*%GOTO   ADRPLS;       /* DSS DYN EXIT PARAMETER LIST MAPPING MACRO     00050000
         MACRO                                                          00100000
&LABEL   ADRDEX01 &DSECT=YES                                            00150000
* /* *************************************************************** */ 00200000
* /*                                                                 */ 00250000
* /* $MAC(ADRDEX01) COMP(DF175) PROD(5650-ZOS): DFSMSdss             */ 00300000
* /*                                                                 */ 00350000
* /*   MACRO NAME = ADRDEX01                                         */ 00400000
* /*                                                                 */ 00450000
* /*   DESCRIPTIVE NAME = DSS DYNAMIC EXIT ROUTINE PARAMETER LIST    */ 00500000
* /*                                                                 */ 00550000
* /*******************************************************************/ 00600000
* /*PROPRIETARY V3 STATEMENT                                         */ 00650000
* /*Licensed Materials - Property of IBM                             */ 00700000
* /*"Restricted Materials of IBM"                                    */ 00750000
* /*5650-ZOS                                                         */ 00800000
* /*Copyright IBM Corp. 2013                                         */ 00850000
* /*END PROPRIETARY V3 STATEMENT                                     */ 00900000
* /*******************************************************************/ 00950000
* /*                                                                 */ 01000000
* /* STATUS:  z/OS V2R1                                              */ 01050000
* /*                                                                 */ 01100000
* /* FUNCTION =                                                      */ 01150000
* /* Define the parameter list passed to the DFSMSdss dynamic        */ 01200000
* /* exit routine, ADRDYEXT_EXIT1 and the characteristics of this    */ 01250000
* /* dynamic exit.                                                   */ 01300000
* /*                                                                 */ 01350000
* /* This dynamic exit is called                                     */ 01400000
* /* by DFSMSdss for data set notification related events            */ 01450000
* /* that are defined in this parameter list.                        */ 01500000
* /*                                                                 */ 01550000
* /*   INVOCATION = PLS -- INCLUDE ADRDEX01                          */ 01600000
* /*                BAL    LABEL   ADRDEX01 DSECT=NO ! DSECT=YES     */ 01650000
* /*                                                                 */ 01700000
* /*   INPUT   = DSECT=NO IF DSECT STATEMENT IS NOT DESIRED          */ 01750000
* /*                                                                 */ 01800000
* /*   OUTPUT = DSS DYNAMIC EXIT ROUTINE PARAMETER LIST EXPANSION    */ 01850000
* /*            RETURN CODES AS DESCRIBED BELOW                      */ 01900000
* /*                                                                 */ 01950000
* /* CHARACTERISTICS =                                               */ 02000000
* /*                                                                 */ 02050000
* /* Characteristics of the DFSMSdss dynamic exit,                   */ 02100000
* /* ADRDYEXT_EXIT1:                                                 */ 02150000
* /*                                                                 */ 02200000
* /* All exit routines connected to ADRDYEXT_EXIT1 are               */ 02250000
* /* called in:                                                      */ 02300000
* /*    - 31-bit addressing mode                                     */ 02350000
* /*    - With authorized program facility (APF)                     */ 02400000
* /*      authorization if DFSMSdss is APF-authorized)               */ 02450000
* /*    - In key 8 problem state                                     */ 02500000
* /*                                                                 */ 02550000
* /* They also must:                                                 */ 02600000
* /*    - Observe standard register save and restore                 */ 02650000
* /*      functions                                                  */ 02700000
* /*    - Be written in reentrant code                               */ 02750000
* /*    - Restore the execution environment                          */ 02800000
* /*      (31-bit addressing mode, key 8, problem state)             */ 02850000
* /*                                                                 */ 02900000
* /*   The parameter list and save area passed to the exit           */ 02950000
* /*   routines resides in key 8 storage                             */ 03000000
* /*                                                                 */ 03050000
* /*   Registers on Entry to an ADRDYEXT_EXIT1 exit routine:         */ 03100000
* /*                                                                 */ 03150000
* /*   Register Contents                                             */ 03200000
* /*    1 - Address of the parm list passed to each exit routine     */ 03250000
* /*        See below                                                */ 03300000
* /*   13 - Address of an 18-word save area                          */ 03350000
* /*   14 - Return address                                           */ 03400000
* /*   15 - Address of the entry point to the called exit routine    */ 03450000
* /*                                                                 */ 03500000
* /*   Registers on Exit from an ADRDYEXT_EXIT1 exit routine:        */ 03550000
* /*                                                                 */ 03600000
* /*   Register Contents                                             */ 03650000
* /*                                                                 */ 03700000
* /*   0 - Possible diagnostic code set by the exit routine          */ 03750000
* /*   15 - Return Code                                              */ 03800000
* /*                                                                 */ 03850000
* /*  For function code x 01  the return codes are defined as:       */ 03900000
* /*                                                                 */ 03950000
* /*  Return Code Description                                        */ 04000000
* /*   0                                                             */ 04050000
* /*   The data set not processed by the exit routine.               */ 04100000
* /*   For a call to close an  open data set, this return            */ 04150000
* /*   code indicates that the call to open the data set             */ 04200000
* /*   is not necessary.  This return code indicates that            */ 04250000
* /*   no further  action is required by DFSMSdss                    */ 04300000
* /*                                                                 */ 04350000
* /*   4                                                             */ 04400000
* /*   The data set was processed successfully by the exit           */ 04450000
* /*   routine.  The data set was closed for a call to close         */ 04500000
* /*   an open data set and opened for a call to open a              */ 04550000
* /*   data set.   For a call to close an open data set, this        */ 04600000
* /*   return code indicates that DFSMSdss will move the data        */ 04650000
* /*   set and that the  dynamic exit will be called to open         */ 04700000
* /*   the closed data set.                                          */ 04750000
* /*                                                                 */ 04800000
* /*   8                                                             */ 04850000
* /*   The data set processed by the exit routine but                */ 04900000
* /*   completed in error. A diagnostic code code as set by          */ 04950000
* /*   the exit routine could be placed in register zero.            */ 05000000
* /*   This return codes indicates that no further action is         */ 05050000
* /*   required by DFSMSdss.                                         */ 05100000
* /*                                                                 */ 05150000
* /*  Parameter list passed to each exit routine:                    */ 05200000
* /*                                                                 */ 05250000
* /*  Register 1 contains the address of the exit routine            */ 05300000
* /*  parameter list in storage protect key of 8.                    */ 05350000
* /*                                                                 */ 05400000
* /*  The 8-word parameter list includes:                            */ 05450000
* /*                                                                 */ 05500000
* /*  First and Second Word                                          */ 05550000
* /*   EBCDIC 'ADRDEX01' ID                                          */ 05600000
* /*                                                                 */ 05650000
* /*  Third Word                                                     */ 05700000
* /*   Byte 0-1                                                      */ 05750000
* /*    Length of the parameter list which is                        */ 05800000
* /*    set to 48 bytes                                              */ 05850000
* /*   Byte 2                                                        */ 06000000
* /*    Function code                                                */ 06050000
* /*    Value Meaning                                                */ 06100000
* /*    X'01' Request is to process open data sets.                  */ 06150000
* /*     A class transition could not be performed                   */ 06200000
* /*     because DFSMSdss could not serialize on                     */ 06250000
* /*     the data set and the SMS management class                   */ 06300000
* /*     ACS routine for class transition specified                  */ 06350000
* /*     that a USEREXIT should be invoked.                          */ 06400000
* /*   Byte 3                                                        */ 06450000
* /*    Function code extension                                      */ 06500000
* /*    For function code X 01, processing of open data              */ 06550000
* /*    sets, the function extension codes are:                      */ 06600000
* /*                                                                 */ 06650000
* /*    Value Meaning                                                */ 06700000
* /*    X'01'     Call is to close open data set                     */ 06750000
* /*    X'02'     Call is to open closed data set                    */ 06800000
* /*                                                                 */ 06850000
* /*  Fourth  Word                                                   */ 06900000
* /*   Flags are set as follows to describe the DSS operation        */ 06950000
* /*   being preformed:                                              */ 07000000
* /*                                                                 */ 07050000
* /*   Byte 0                                                        */ 07100000
* /*   Bit   Meaning                                                 */ 07150000
* /*                                                                 */ 07200000
* /*   0  DEFRAG OPERATION                                           */ 07250000
* /*   1  COPY OPERATION                                             */ 07300000
* /*   2  RESTORE OPERATION                                          */ 07350000
* /*   3  DUMP OPERATION                                             */ 07400000
* /*   4  PRINT OPERATION                                            */ 07450000
* /*   5  COPYDUMP OPERATION                                         */ 07500000
* /*   6  NEWALLOC OPERATION                                         */ 07550000
* /*   7  COMPRESS OPERATION                                         */ 07600000
* /*                                                                 */ 07650000
* /*   Byte 1                                                        */ 07700000
* /*   Bit   Meaning                                                 */ 07750000
* /*                                                                 */ 07800000
* /*   0  RELEASE OPERATION                                          */ 07850000
* /*   1  CONVERT VOLUME OPERATION                                   */ 07900000
* /*   2  BUILDSA OPERATION                                          */ 07950000
* /*   3  DEFRAG CONSOLIDATE                                         */ 08000000
* /*   4  CGCREATED OPERATION                                        */ 08050000
* /*   5  CONSOLID OPERATION                                         */ 08100000
* /*   6-7  RESERVED                                                 */ 08150000
* /*                                                                 */ 08200000
* /*   Byte 2                                                    @P1A*/ 08214200
* /*   Bit   Meaning                                             @P1A*/ 08228400
* /*                                                             @P1A*/ 08242600
* /*   0  INPUT DSN IS VSAM                                      @P1A*/ 08256800
* /*                                                             @P1A*/ 08271000
* /*   Byte 3  Unused                                            @P1C*/ 08285200
* /*                                                                 */ 08300000
* /*  Fifth word                                                     */ 08350000
* /*   Address on entry of a the data set name to be processed       */ 08400000
* /*                                                                 */ 08500000
* /*  Sixth word                                                     */ 08550000
* /*   Address on entry of a 44-byte name of the integrated          */ 08600000
* /*   catalog facility  catalog in which the data set is            */ 08650000
* /*   cataloged.                                                    */ 08700000
* /*                                                                 */ 08750000
* /*  Seventh word                                                   */ 08800000
* /*   Address of volume serial number                               */ 08850000
* /*                                                                 */ 08950000
* /*  Eighth word                                                    */ 09000000
* /*   Address of an 18-byte area that defines who holds             */ 09050000
* /*   the data set enqueue. This includes in this order:            */ 09100000
* /*   - 2-byte ASID of the ENQ requester                            */ 09150000
* /*   - 8-byte job name of the ENQ requester                        */ 09200000
* /*   - 8-byte system name of the ENQ requester                     */ 09250000
* /*                                                                 */ 09300000
* /*   CHANGE ACTIVITY =                                             */ 09350000
* /* $ST= K210095, 210, 01JUL11, TPCJC  : Storage Tiers              */ 09400000
* /* $P1= K210691, 210, 31OCT11, TPCJC  : Add VSAM flag and      @P1A*/ 09412500
* /*                                      update volser field    @P1A*/ 09425000
* /*                                      definition             @P1A*/ 09437500
* /* $VZ3=K211121,HDZ2210,29FEB12,TPCJRL: Copyright Update       @VZ3*/ 09443700
* /*                                                                 */ 09450000
* /* CHANGE DATE: 29FEB12                                        @VZ3*/ 09466600
* /*                                                                 */ 09483200
* /* *************************************************************** */ 09500000
         LCLC  &L                      DEFINE LOCAL CHAR VARIABLE       09550000
&L       SETC  'ADRDEX1_PL'                                             09600000
         AIF   ('&LABEL' EQ '').CDSECT                                  09650000
&L       SETC  '&LABEL'                                                 09700000
.CDSECT  ANOP                                                           09750000
         SPACE 1                                                        09800000
*********************************************************************** 09850000
*        DSS DYNAMIC EXIT ROUTINE PARAMETER LIST                        09900000
*********************************************************************** 09950000
         SPACE 1                                                        10000000
         AIF   ('&DSECT' EQ 'NO').NDSECT1                               10050000
         AIF   ('&DSECT' EQ 'YES').DSECT1                               10100000
         MNOTE 12,'***  IHB001 INVALID OPERAND - DSECT=&DSECT'          10150000
         AGO   .FINISH                                                  10200000
.DSECT1  ANOP                                                           10250000
&L       DSECT             DSS DYN EXIT ROUTINE PARM LIST               10300000
         DS    0F                                                       10350000
         AGO   .ADRDEX1_                                                10400000
.NDSECT1 ANOP                                                           10450000
&L       DS    0F          DSS DYN EXIT ROUTINE PARM LIST               10500000
.ADRDEX1_    ANOP                                                       10550000
ADRDEX1_ID   DS CL8        EBCDIC 'ADRDEX01'                            10600000
ADRDEX1_LENG DS XL2        LENGTH OF PARAMETER LIST                     10650000
*                            = 48 bytes - version 1                     10700000
ADRDEX1_FUNC DS XL1        FUNCTION CODE                                10750000
ADRDEX1_OPEN_DB EQU X'01'  - REQUEST IS TO PROCESS OPEN DB DATA SETS.   10800000
*                            A class transition could not be performed  10850000
*                            because DFSMSdss could not serialize on    10900000
*                            the data set and the SMS management        10950000
*                            class ACS routine for class                11000000
*                            transition specified that a                11050000
*                            USEREXIT should be invoked.                11100000
*                                                                       11150000
ADRDEX1_EXTCD DS XL1       EXTENSION OF FUNCTION CODE DEFINITIONS       11200000
* ---------------------------------------------------------------*      11250000
* FOR FUNCTION CODE '01' DATA BASE PROCESSING OF OPEN DATA SETS         11300000
* ---------------------------------------------------------------*      11350000
ADRDEX1_CLOSE EQU X'01'    CALL IS TO CLOSE OPEN DATA SET               11400000
ADRDEX1_OPEN EQU X'02'     CALL IS TO OPEN DATA SET                     11450000
*                                                                       11500000
* FLAGS SET TO DESCRIBE THE DFSMSdss OPERATION BEING PERFORMED.         11550000
ADRDEX1_FUNC_FLAGS DS 0F       A WORD OF FLAGS                          11600000
ADRDEX1_FLG1     DS XL1        FLAG BYTE 1                              11650000
ADRDEX1_DEFRAG EQU X'80'    1 = DEFRAG FUNCTION                         11700000
ADRDEX1_COPY EQU X'40'      1 = COPY FUNCTION                           11750000
ADRDEX1_REST EQU X'20'      1 = RESTORE FUNCTION                        11800000
ADRDEX1_DUMP EQU X'10'      1 = DUMP FUNCTION                           11850000
ADRDEX1_PRINT EQU X'08'     1 = PRINT FUNCTION                          11900000
ADRDEX1_COPYD EQU X'04'     1 = COPYDUMP FUNCTION                       11950000
ADRDEX1_NEWALC EQU X'02'    1 = NEW ALLOC FUNCTION                      12000000
ADRDEX1_COMPR EQU X'01'     1 = COMPRESS FUNCTION                       12050000
*                                                                       12100000
ADRDEX1_FLG2 DS XL1        FLAG BYTE 2                                  12150000
ADRDEX1_RLSE EQU X'80'      1 = RELEASE FUNCTION                        12200000
ADRDEX1_CONV EQU X'40'      1 = CONVERT VOLUME                          12250000
ADRDEX1_BLDSA EQU X'20'     1 = BUILDSA IPL(DASD)                       12300000
ADRDEX1_DFRGC EQU X'10'     1 = DEFRAG CONSOLIDATE                      12350000
ADRDEX1_CGCR EQU X'08'      1 = CGCREATED FUNCTION                      12400000
ADRDEX1_CONS EQU X'04'      1 = CONSOLIDATE FUNCTION                    12450000
ADRDEX1_RESV EQU X'03'        = UNUSED                                  12475000
*                                                                       12500000
ADRDEX1_FLG3 DS XL1        FLAG BYTE 3                                  12550000
ADRDEX1_VSAM EQU X'80'      1 = SET ON AS INPUT. DSN IS                 12583300
*                                          A VSAM FILE             @P1A 12616600
ADRDEX1_FLG4 DS XL1        FLAG BYTE 4                                  12650000
*                           RESERVED/UNUSED                             12700000
ADRDEX1_DSN    DS A        ADDRESS ON ENTRY OF THE                      12750000
*                           DATA SET NAME TO BE PROCESSED               12800000
ADRDEX1_CAT DS A           ADDRESS ON ENTRY OF 44-BYTE CATALOG NAME     12850000
*                           THAT THIS DATA SET IS DEFINED IN            12900000
ADRDEX1_VOLSER DS A        ADDRESS OF VOLUME SERIAL NUMBER              12950000
*                          FOR FUNC CODE '01', ON AN CLOSE         @P1A 12958300
*                          REQUEST THE VOLSER IS FROM THE          @P1A 12966600
*                          SOURCE VOLUME AND ON AN OPEN            @P1A 12974900
*                          REQUEST THE VOLSER IS FROM THE          @P1A 12983200
*                          TARGET VOLUME OF THE COPY               @P1A 12991500
*                                                                       13000000
ADRDEX1_ENQI DS A          Address of 18-byte area that describes       13050000
*                          who holds the data set enqueue. Included is: 13100000
*                            - 2-byte ASID of the ENQ requester         13150000
*                            - 8-byte job name of the ENQ requester     13200000
*                            - 8-byte system name of the ENQ requeste   13250000
ADRDEX1_RESV2  DS CL16     RESERVED/UNUSED                              13300000
*                                                                       13350000
ADRDEX1_LNGTH EQU *-&L     LENGTH OF DSS DYN EXIT PARAMETER LIST        13400000
*                                                                       13450000
         AGO   .FINISH                                                  13500000
.FINISH  MEND                                                           13550000
**********************************************************************/ 13600000
*%ADRPLS: ;                                                             13650000
*%IF ADRDEX1_PL_BASE = ' ' %THEN %ADRDEX1_PL_BASE = 'BASED(DEXPTR)';    13700000
*                                                                       13750000
*/********************************************************************/ 13800000
*/*      DSS DYNAMIC EXIT PARAMETER LIST                             */ 13850000
*/********************************************************************/ 13900000
*                                                                       13950000
* DCL 1 ADRDEX1_PL ADRDEX1_PL_BASE BDY(WORD), /* DSS DYN EXIT PLIST  */ 14000000
*      2 ADRDEX1_ID CHAR(8),       /* EBCDIC 'ADRDEX01' ID           */ 14050000
*      2 ADRDEX1_LENG FIXED(16),   /* LENGTH OF PARAMETER LIST       */ 14100000
*                                  /*  = 48 bytes - version 1        */ 14150000
*      2 ADRDEX1_FUNC FIXED(8),    /* FUNCTION CODE                  */ 14200000
*      2 ADRDEX1_EXTCD FIXED(8),   /* EXTENSION OF FUNC CODE         */ 14250000
* /* DSS FUNCTION BEING EXECUTED DEFINED IN THE FOLLOWING BYTES      */ 14300000
*      2 ADRDEX1_FUNC_FLAGS CHAR(4) BDY(WORD), /* A WORD OF FLAGS    */ 14350000
*       3 ADRDEX1_FLG1 BIT(8),     /* FLAG BYTE 1                    */ 14400000
*        4 ADRDEX1_DEFRAG BIT(1),  /*  1 = DEFRAG FUNCTION           */ 14450000
*        4 ADRDEX1_COPY BIT(1),    /*  1 = COPY FUNCTION             */ 14500000
*        4 ADRDEX1_REST BIT(1),    /*  1 = RESTORE FUNCTION          */ 14550000
*        4 ADRDEX1_DUMP BIT(1),    /*  1 = DUMP FUNCTION             */ 14600000
*        4 ADRDEX1_PRINT BIT(1),   /*  1 = PRINT FUNCTION            */ 14650000
*        4 ADRDEX1_COPYD BIT(1),   /*  1 = COPYDUMP FUNCTION         */ 14700000
*        4 ADRDEX1_NEWALC BIT(1),  /*  1 = NEW ALLOC FUNCTION        */ 14750000
*        4 ADRDEX1_COMPR BIT(1),   /*  1 = COMPRESS FUNCTION         */ 14800000
*       3 ADRDEX1_FLG2 BIT(8),     /* FLAG BYTE 2                    */ 14850000
*        4 ADRDEX1_RLSE BIT(1),    /*  1 = RELEASE FUNCTION          */ 14900000
*        4 ADRDEX1_CONV BIT(1),    /*  1 = CONVERT VOLUME            */ 14950000
*        4 ADRDEX1_BLDSA BIT(1),   /*  1 = BUILDSA IPL(DASD)         */ 15000000
*        4 ADRDEX1_DFRGC BIT(1),   /*  1 = DEFRAG CONSOLIDATE        */ 15050000
*        4 ADRDEX1_CGCR  BIT(1),   /*  1 = CGCREATED FUNCTION        */ 15100000
*        4 ADRDEX1_CONS BIT(1),    /*  1 = CONSOLIDATE FUNCTION      */ 15150000
*        4 *            BIT(2),    /*  UNUSED                        */ 15175000
*       3 ADRDEX1_FLG3 BIT(8),     /* FLAG BYTE 3                    */ 15200000
*        4 ADRDEX1_VSAM BIT(1),    /*  1 = SET ON AS INPUT. DSN IS      15216600
*                                          A VSAM FILE           @P1A*/ 15233200
*       3 ADRDEX1_FLG4 BIT(8),     /* FLAG BYTE 4                    */ 15250000
*      2 ADRDEX1_DSN    PTR(31),   /* ADDR ON ENTRY OF THE              15300000
*                                     DATA SET NAME TO BE PROCESSED     15350000
*                                                                    */ 15400000
*      2 ADRDEX1_CAT PTR(31),      /* ADDR ON ENTRY OF 44-BYTE CATALOG  15450000
*                                     NAME THAT THIS DATA SET IS        15500000
*                                     DEFINED                        */ 15550000
*      2 ADRDEX1_VOLSER PTR(31),   /* ADDR OF VOLUME SERIAL NUMBER      15564200
*                                     FOR FUNC CODE '01', ON AN CLOSE   15578400
*                                     REQUEST THE VOLSER IS FROM THE    15592600
*                                     SOURCE VOLUME AND ON AN OPEN      15606800
*                                     REQUEST THE VALUE IS FROM THE     15621000
*                                     TARGET VOLUME OF THE COPY  @P1C*/ 15635200
*                                                                       15650000
*      2 ADRDEX1_ENQI PTR(31),                                          15700000
*                          /*  Address of 18-byte area that describes   15750000
*                            who holds the data set enqueue. Includes:  15800000
*                            - 2-byte ASID of the ENQ requester         15850000
*                            - 8-byte job name of the ENQ requester     15900000
*                            - 8-byte system name of the ENQ request */ 15950000
*      2 ADRDEX1_RESV2 CHAR(16);   /* RESERVED                       */ 16000000
*                                                                       16050000
* /* --------------------------------------------------------------- */ 16100000
* /* CONSTANTS                                                       */ 16150000
* /* --------------------------------------------------------------- */ 16200000
* DCL ADRDEX1_IDC CHAR(8) CONSTANT('ADRDEX01');/* EYE-CATCHER        */ 16250000
* DCL ADRDEX1_LNGTH FIXED(8) CONSTANT(LENGTH(ADRDEX1_PL));              16300000
*                                                                       16350000
* /* --------------------------------------------------------------- */ 16400000
* /*    VALUES FOR FUNCTION CODE - ADRDEX1_FUNC                      */ 16450000
* /* --------------------------------------------------------------- */ 16500000
* DCL (                                                                 16550000
*    ADRDEX1_OPEN_DB CONSTANT (1) /*                                    16600000
*                            Request is to process open DB data sets.   16650000
*                            A class transition could not be performed  16700000
*                            because DFSMSdss could not serialize on    16750000
*                            the data set and the SMS management        16800000
*                            class ACS routine for class                16850000
*                            transition specified that a                16900000
*                            USEREXIT should be invoked.             */ 16950000
*                                                                       17000000
*    ) FIXED(8);                                                        17050000
*                                                                       17100000
* /* --------------------------------------------------------------- */ 17150000
* /*    VALUES FOR EXTENDED FUNCTION CODE - ADRDEX1_EXTCD            */ 17200000
* /* --------------------------------------------------------------- */ 17250000
* DCL (                                                                 17300000
*  /* -------------------------------------------------------------- */ 17350000
*  /*  EXTENDED FUNCTION CODE VALUES WHEN FUNC CODE = X'01' -        */ 17400000
*  /*  DATA BASE PROCESSING OF OPEN DATA SETS                        */ 17450000
*  /* -------------------------------------------------------------- */ 17500000
*    ADRDEX1_CLOSE CONSTANT(1),  /* CALL IS TO CLOSE OPEN DATA SET   */ 17550000
*    ADRDEX1_OPEN CONSTANT(2)    /* CALL IS TO OPEN DATA SET         */ 17600000
*    ) FIXED(8);                                                        17650000
*                                                                       17700000
