*%GOTO SKPEID0;                                                                 
       MACRO                                                                    
       ADREID0                                                                  
       EJECT                                                                    
*%SKPEID0:;                                                                     
*@EJECT;                                                                        
* /* *************************************************************** */         
* /*                                                                 */         
* /* $MAC(ADREID0)  COMP(DF175) PROD(5650-ZOS): DFSMSdss         @UXC*/         
* /*                                                                 */         
* /*   MACRO NAME:  ADREID0                                          */         
* /*                                                                 */         
* /*   DESCRIPTIVE NAME:  EXIT IDENTIFICATION BLOCK                  */         
* /*                                                                 */         
* /*******************************************************************/         
* /*PROPRIETARY V3 STATEMENT                                         */         
* /*LICENSED MATERIALS - PROPERTY OF IBM                             */         
* /*"RESTRICTED MATERIALS OF IBM"                                    */         
* /*5650-ZOS                                                         */         
* /*COPYRIGHT IBM CORP. 1992, 2019                                   */         
* /*END PROPRIETARY V3 STATEMENT                                     */         
* /*******************************************************************/         
* /* LICENSED MATERIALS - PROPERTY OF IBM.                           */         
* /*-----------------------------------------------------------------*/         
* /*                                                                 */         
* /*   STATUS:  VERSION  2  RELEASE  3   LEVEL  0                @UXC*/         
* /*                                                                 */         
* /*   FUNCTION:                                                     */         
* /*              THE EXIT IDENTIFICATION BLOCK IS INITIALIZED       */         
* /*    BY DFDSS PRIOR TO CALLING THE USER INTERACTION MODULE        */         
* /*    AND ACTS AS THE INTERFACE BETWEEN DFDSS THE USER INTERACTION */         
* /*    MODULE EXITS.                                                */         
* /*                                                                 */         
* /*******************************************************************/         
* /*   Note:  Because this macro is published in the books and       */         
* /*   shipped to customers, it is important to not disclose         */         
* /*   internal information in the comments on the individual field  */         
* /*   names below.  Also, all comments should be in upper case (to  */         
* /*   maintain a consistent style for the pubs).                    */         
* /*******************************************************************/         
* /*                                                                 */         
* /*   INVOCATION:  PLS -- INCLUDE ADREID0                           */         
* /*                BAL -- ADREID0                                   */         
* /*                                                                 */         
* /*   CHANGE ACTIVITY:  NEW MACRO                               @V21*/         
* /*   ADD UIM EXITS 16, 17, 18 AND 19.                         @V22G*/         
* /*   IMPLEMENT PL02135 FIX                                 @V23N253*/         
* /*       PL02135      09/03/86   MAPPING PROBLEM           @LA02135*/         
* /*   ADD NEW FLAG WORD                        3/25/87      @LA09760*/         
* /*   CORRECT ASSEMBLER EIXERR EQUATE TO MATCH PLS          @V23N298*/         
* /*   ADD SUPPORT FOR UIM-20                         KUI0280 @V24AEG*/         
* /*   ADDED SUPPORT FOR UIM-21, 22, AND 23                      @V25*/         
* /*   CHANGED EI22BCAT FLAG TO EI22BMIG FLAG       07/07/88   @DS007*/         
* /*   ADD EIXWNGOK TO INFORM UIM THAT ALL WARNINGS 12/28/89 @LA54862*/         
* /*     WERE NOT FATAL                                              */         
* /*   ADD EIREC14 TO MAP THE RECORD FOR EXIT 14    07/05/90 @LA65381*/         
* /*   VRRDS DATASET SUPPORT                         10APR91 @LA82401*/         
* /*   MAINTENANCE ROLL-UP                           14JUN91 @NA00267*/         
* /*   EI22LIKE BIT ADDED FOR RESTORE/COPY TO LIKE DEVICE    @LA71949*/         
* /*                IN AN SMS ENVIRONMENT            18JUN91 @LA71949*/         
* /*   EI22EXTR BIT ADDED FOR RESTORE TO THE SAME VOLUME     @NA06820*/         
* /*   ADDED SUPPORT FOR UIM-24                                  @V26*/         
* /*                THAT IS BEING EXTENT REDUCED     05NOV91 @NA06820*/         
* /*   VOLSLST, EXITRECL CONSTANTS ADDED             06NOV91 @NA08383*/         
* /*   ADDED EIREC00 (FWD FIT OF PN05364)            05JAN93 @OY57120*/         
* /*   MODIFIED TO SUPPORT OY60302 SECURITY APAR     19JAN93 @OY60302*/         
* /*   MADE EI22SFLG SOURCE DSET FLAGS AVAILABLE     06AUG93 @OY62462*/         
* /* $L4=BWO,HDZ11B0,20SEP93,TPCDDR: BACKUP WHILE OPEN SUPPORT   @L4A*/         
* /*   CHANGES FOR PARTIAL/INCOMPLETE RECALL         26JAN94 @OW01655*/         
* /* $RLS=HDZ11C0,26JUL94,TPCJT: SDSH/RLS support for V1.3.0     @RLS*/         
* /*   SUPERCEDE OUT OW01655-Phase 1 Partial RECALL  22JUL94 @OW06093*/         
* /*   Design change to inform UIM when track is bad 16AUG94 @OW07425*/         
* /* $RLS=HDZ11C0,23FEB95,TPCJT: SDSH/RLS support for V1.3.0     @RLS*/         
* /* AX cell support for PDSs                        05Apr95 @K131935*/         
* /*   Pass DS byte count in option 23 for PSE       24FEB95 @OW11555*/         
* /*   MSGIEV167 during assemble (KJT0057)           05SEP95 @OW15420*/         
* /*   CHANGES TO SUPPORT DSSXMAPI                   14AUG95 @OW13783*/         
* /* RECOMPILE FOR AE OW14125/OW13783                18OCT95 @OW16394*/         
* /* AE FIX FOR OW16394 - RESHIP, NO CODE CHANGE     24OCT95 @OW16551*/         
* /*   DEFINE NEW EI22IMS AND EI22BWOE FIELDS FOR    14NOV95 @OW15980*/         
* /*   IMS BWO SUPPORT FOR DFSMS 1.C.0               18MAR96 @OW15980*/         
* /* Define EI00SENQ to prevent lockout with hsm     04Jun96 @OW20023*/         
* /* $RLSCDS=HDZ11D0,09Jul96,TPCMAH: RLS hsm CDS     09Jul96  @RLSCDS*/         
* /* ADD EIDDOF1, EIDDOF2 FOR XMAPI                  12AUG96 @OW21750*/         
* /* AE FIX FOR OW21750. ADD EIXTWERR FOR XMAPI      26AUG96 @OW22314*/         
* /* ADD EIXTRERR FOR XMAPI                          18SEP96 @OW22673*/         
* /* APPLICATION INTERFACE EXTENSIONS.               12MAR97 @OW25343*/         
* /* ADD EI00NONF TO EIREC00 FOR NO IGWNOTIF CALL    11JUL97 @OW28223*/         
* /* REMOVE EIDDOF1, EIDDOF2 AND ADD EIXTRC32        31MAY98 @OW33495*/         
* /* PASS DCB@ & WRITING TRAILER FLAG IN EXIT 6      01AUG98 @OW34887*/         
* /* PASS WTO PLIST DURING XMAPI EIOP11              16DEC98 @OW36779*/         
* /* RECOMPILE FOR AE OW36779                        18DEC98 @OW36834*/         
* /* $FSM=HDZ11F0,22JAN99,TPCGN: Fast Second Migrate 22JAN99     @FSM*/         
* /* ADD EI00NOLK TO EIREC00 FOR NO ADRLOCK ENQ/DEQ  25JAN00 @OW42942*/         
* /* ADD EI22DB2 BIT TO EXIT 22 FOR API EXTENSION    16JUN00 @OW45048*/         
* /* $ALF=HDZ11H0,15JUL02,TPCYLD: APPLICATION LEVEL FAST         @ALF*/         
* /*  REPLICATION SUPPORT - ADDED EI00NENQ EI00BSEC EI00SVOL     @ALF*/         
* /* Add 'Output Volume Close' call to exit 26       04DEC02 @OW57536*/         
* /*   - add EI26VCLO                                04DEC02 @OW57536*/         
* /* Corrected misplaced comments                    25SEP03 @OA05056*/         
* /* $IBC=HDZ1180,15MAR05,TPCRSG: IMS BWO SUPPORT FOR            @IBC*/         
* /*      LOGICAL DATA SET COPY                                  @IBC*/         
* /* $PDC=HDZ11L0,02JUN05,TPCANW: Physical Data Set Copy         @PDC*/         
* /* ADDED CANDIDATE WITH SPACE BIT FOR E27/E20 NEEDS TO BE  @K180227*/         
* /*   WHEN VVRCANSP IS ON TO INDICATE THAT THE EI27DRBA     @K180227*/         
* /*   SHOULD NOT BE CONSIDERED TO BE PART OF THE EI27DSHA   @K180227*/         
* /* ADDED E27TRACF BIT TO PLX WAS IN ASM BUT NOT IN PLX     @K180278*/         
* /* ADDED COMMENT REGARDING THE EXIT 27 ESDS BITS           @K180512*/         
* /* REMOVED CANDIDATE WITH SPACE INDICATORS       10JAN06   @K180724*/         
* /* MOVED E27TRACF OUT OF EXIT 23 AND INTO EXIT27 25MAY06   @OA16588*/         
* /*      (ONLY WRONG IN THE PL/X)                           @OA16588*/         
* /* FIX ASSEMBLER SO IT COMPILES (NO FIELD CHANGES) 18JUL06 @OA17350*/         
* /* $TPE=K190406,06NOV06,TPCANW: TAPE ENCRYPTION SUPPORT        @TPE*/         
* /* $P0=K1A1264,HDZ1A10,18DEC07,TPCCK: Restore F9 info          @P0A*/         
* /* $XES=OA22125,13MAY08,TPCJPE: JAG 3 XMEM SUPPORT             @XES*/         
* /* $E2=EAVR2,HDZ1B10,29AUG08,TPCJPE: EAVR2 CODE SUPPORT        @E2A*/         
* /* $CE=K1C0001,HDZ1C10,09JAN09,TPCRSG: CA Reclaim Enablement   @CEA*/         
* /* FIXING BAD DECLARES IN EXIT 28                  01JUN09 @OA29235*/         
* /* FIXING BAD DECLARES IN EXIT 28 (CA Reclaim)     01JUL09 @K1C0372*/         
* /* $P1=K1C1182,HDZ1C10,22DEC09,TPCANW: Max Exit DCL        @K1C1182*/         
* /* $DM=K1D0020,HDZ1D10,16FEB10,TPCANW: EXIT 29                 @DMA*/         
* /* $ST= K210095, 210, 01JUL11, TPCGN  : Storage Tiers          @STA*/         
* /* $P2= OA37260 D10 09AUG11 TPCRSG : zOSMF support             @P2A*/         
* /* $VZ3=K211121,HDZ2210,29FEB12,TPCJRL: Copyright Update       @VZ3*/         
* /* $HR=SM00412,HDZ2210,23JUL12,TPCEEF:RENAMEU SUPORT FOR       @HRA*/         
* /*           FOR PHYSICAL DS COPY                              @HRA*/         
* /* $NV=SM00358,HDZ2210,08AUG12,TPCJRL: HSMFR Any Volume        @NVA*/         
* /*             Also correct offset problem in EIOP20 and           */         
* /*             PLX order location of E27SVRRD                      */         
* /* $P3=SM00834,11SEP12,TPCJRL: Clarify EIREC30 comments        @P3A*/         
* /* $P4=SM00869,18SEP12,TPCJRL: Create EI30VOLENT array         @P4A*/         
* /* $LR=OA38210,10OCT12,TPCJRL: LOGREPLICATE Support            @LRA*/         
* /* $ZC=OA42238,HDZ2210,15JUN13,TPCJRL: ZCOMPRESS Support       @ZCA*/         
* /* $A1=OA49228,29JAN16,TPCGN : BYPASS EXCLUSIVE ADRLOCK        @A1A*/         
* /*                             NONSPEC SUPPORT                 @A1A*/         
* /* $BP=OA49854,HDZ2220,31MAR16,TPCEEF: BYPASS SERIALIZATION ON @BPA*/         
* /*                             SOURCE DATASET SUPPORT          @BPA*/         
* /* $MC=OA50660,HDZ2210,30MAR16,TPCJRS: Cloud Support           @MCA*/         
* /* $01=OA53066,HDZ2230,06JUN17,TPCRSG: zFS Enhancement         @01A*/         
* /* $UX=OA52836,HDZ2230,20JUL17,TPCEEF: UNIX FILE SUPPORT       @UXA*/         
* /*  $P5= 254107,MAY230,22MAY18,TPCEEF: REMOVE EI43 32bit Times @P5A*/         
* /*  $P6= 309543,02APR19,TPCEEF:  Remove Exit 45. QTYPE OA57303 @P6A*/         
* /* $L5=OA58221,HDZ2240,23JUL19,TPCEEF: TCT-TS7700              @L5A*/         
* /*             Story 328194 API License Check                  @L5A*/         
* /* $A2=OA58113,HDZ2240,29JAN20,TPCJRL: Bypass reblock support  @A2A*/         
* /* $02=OA59465,HDZ2240,03JUN20,TPCEEF: TCT COMPRESSION SUPPORT @02A*/         
* /*             Story 370195 - API Support                      @02A*/         
* /* $03=OA60113,HDZ2240,16SEP20,TPCEEF: License Check PE Fix    @03A*/         
* /*             Backout OA58221 license check bits              @03A*/         
* /* $L6=OA60146,HDZ2240,08SEP20,TPCEEF: TCT 4Q2020 Enhancements @L6A*/         
* /*     Story 386453 - Bypass Create Container                  @L6A*/         
* /*                                                                 */         
* /* CHANGE DATE: 08SEP20                                        @L6C*/         
* /*                                                                 */         
* /* *************************************************************** */         
*%GOTO PLSEID0;           /* GO TO THE PLS VERSION */                           
ADREIBID DC    C'EIDB'              /* BLOCK IDENTIFIER              */         
ADREIB@  DS    F'0'                                                             
EIOP00   DC    X'0000'              /* FUNCTION STARTUP ENTRY        */         
EIOP01   DC    X'0001'              /* READING SYSIN RECORD          */         
EIOP02   DC    X'0002'              /* PRINTING SYSPRINT RECORD      */         
EIOP03   DC    X'0003'              /* READING TAPE BLOCK RECORD     */         
EIOP04   DC    X'0004'              /* READING TAPE LOGICAL RECORD   */         
EIOP05   DC    X'0005'              /* WRITING TAPE LOGICAL RECORD   */         
EIOP06   DC    X'0006'              /* WRITING TAPE BLOCK RECORD     */         
EIOP07   DC    X'0007'              /* READING DISK TRACK            */         
EIOP08   DC    X'0008'              /* WRITING DISK TRACK            */         
EIOP09   DC    X'0009'              /* READING UTILITY SYSPRINT      */         
EIOP10   DC    X'000A'              /* WRITING UTILITY SYSPRINT      */         
EIOP11   DC    X'000B'              /* WRITING WTO MESSAGE           */         
EIOP12   DC    X'000C'              /* WRITING WTOR MESSAGE          */         
EIOP13   DC    X'000D'              /* PRESENTING ADRUFO RECORD      */         
EIOP14   DC    X'000E'              /* FUNCTION TERMINATION ENTRY    */         
EIOP15   DC    X'000F'              /* PRESENTING WTOR RESPONSE      */         
EIOP16   DC    X'0010'              /* TAPE VOL SEC/VERIFY       @V22*/         
EIOP17   DC    X'0011'              /* TAPE VOL MOUNT(NON-SPEC)  @V22*/         
EIOP18   DC    X'0012'              /* INSERT RESTORE RECORD     @V22*/         
EIOP19   DC    X'0013'              /* OUTPUT TAPE ERROR         @V22*/         
EIOP20   DC    X'0014'              /* VOLUME NOTIFICATION       @V24*/         
EIOP21   DC    X'0015'              /* DATA SET VERIFICATION     @V25*/         
EIOP22   DC    X'0016'              /* BYPASS VERIFICATION       @V25*/         
EIOP23   DC    X'0017'              /* DS PROCESSED NOTIFICATION @V25*/         
VOLSLST  DC    X'02C4'              /* MAX SIZE OF VOLSER LIST                  
*                                      FOR EIREC23 (118 * 6) @NA08383*/         
EIOP24   DC    X'0018'          /* CONCURRENT COPY INIT COMPLETE @V26*/         
EIOP25   DC    X'0019'              /* BACKSPACE INPUT TAPE  @OW13783*/         
EIOP26   DC    X'001A'              /* VOLUME OPEN FOR O/P   @OW15980*/         
EIOP27   DC    X'001B'              /* PHYSICAL DS PROCESSED     @PDC*/         
EIOP28   DC    X'001C'              /* TARGET ALLOCATION         @E2C*/         
EIOP29   DC    X'001D'              /* Reserved                  @P2C*/         
EIOP30   DC    X'001E'              /* PHYS COPY REST NEWVOL     @NVA*/         
EIOP31   DC    X'001F'              /* Application STORE         @MCA*/         
EIOP32   DC    X'0020'              /* Application RETREIVE      @MCA*/         
EIOP33   DC    X'0021'              /* OBJECT NAME NOTIFICATION  @MCA*/         
EIOP34   DC    X'0022'              /* Reserved                  @L5A*/         
EIOP35   DC    X'0023'              /* Cloud Function Notify     @L6A*/         
EIOP41   EQU   X'0029'              /* Unix Path Notification    @UXA*/         
EIOP42   EQU   X'002A'              /* Unix Path Bypass Verify   @UXA*/         
EIOP43   EQU   X'002B'              /* Unix Path Processed       @UXA*/         
EIOP44   EQU   X'002C'              /* Clone Initialization      @UXA*/         
EIOP45   EQU   X'002D'              /* Present Attributes        @UXA*/         
EIMAXOP  DC    X'002D'              /* MAX VALID EXIT NUMBER     @UXC*/         
EXITRECL DC    X'0030'              /* EXIT RECORD LENGTH    @NA08383*/         
EIRC00   DC    X'0000'              /* CONTINUE NORMAL PROCESSING    */         
EIRC04   DC    X'0004'              /* RECORD REPLACED               */         
EIRC08   DC    X'0008'              /* INSERT RECORD                 */         
EIRC12   DC    X'000C'              /* DELETE RECORD                 */         
EIRC16   DC    X'0010'              /* RECORD MODIFIED               */         
EIRC20   DC    X'0014'              /* DISCONNECT EXIT               */         
EIRC24   DC    X'0018'              /* SELECT USER STATISTICAL RECS  */         
EIRC28   DC    X'001C'              /* WTOR RESPONSE                 */         
EIRC32   DC    X'0020'              /* TERMINATE FUNCTION        @V22*/         
EIRC36   DC    X'0024'              /* TERMINATE DATA SET ONLY   @V25*/         
***********************************************************************         
*          Constants for Serialization error actions              @STA*         
***********************************************************************         
EISRLNONE  EQU   0                      Use None                  @STA          
EISRLDB2   EQU   1                      Use DB2                   @STA          
EISRLZFS   EQU   2                      Use ZFS                   @STA          
EISRLCICS  EQU   3                      Use CICS TS               @STA          
EISRLEXIT  EQU   4                      Use User Exit             @STA          
ADREIB   DSECT                                                                  
EIDLLEN  DS    H                    /* LENGTH OF ADREIB - 2      @V22*/         
EIID     DS    CL4                  /* BLOCK IDENTIFIER EBCDIC "EID0"*/         
EITSKID  DS    FL4                  /* TASK ID NUM OF CALLER @LA02135*/         
EIXALLOW DS    0XL4                 /* USER EXIT ALLOWANCE OPTIONS   */         
EIXALOW0 DS    X                    /* ALLOWANCE OPTIONS BYTE 1      */         
EIXREP   EQU   X'80'                /* ALLOW REPLACE OF RECORD       */         
EIXINS   EQU   X'40'                /* ALLOW INSERT OF RECORD        */         
EIXDEL   EQU   X'20'                /* ALLOW DELETE OF RECORD        */         
EIXMOD   EQU   X'10'                /* ALLOW MODIFICATION OF RECORD  */         
EIXDIS   EQU   X'08'                /* ALLOW DISCONNECT OF EXIT      */         
EIXWTOR  EQU   X'04'                /* ALLOW WTOR RESPONSE           */         
EIXSTAT  EQU   X'02'                /* ALLOW SELECTION OF USER STATS */         
EIXTERM  EQU   X'01'                /* ALLOW TERMINATION OF FUNC @V22*/         
EIXALOW1 DS    X                    /* ALLOWANCE OPTIONS BYTE 2      */         
EIXTDSET EQU   X'80'                /* ALLOW DATA SET TERMINATION@V25*/         
EIXALOW2 DS    X                    /* ALLOWANCE OPTIONS BYTE 3      */         
EIXALOW3 DS    X                    /* ALLOWANCE OPTIONS BYTE 4      */         
EIXERR   EQU   X'80'                /* DIS-ALLOWED OPTION    @V23N298*/         
EIOPTION DS    H                    /* PROCESSING OPTION             */         
EIRETCOD DS    H                    /* EXIT RETURN CODE              */         
EIRECALN DS    FL4                  /* RECORD AREA LENGTH    @LA02135*/         
EIRECLEN DS    FL4                  /* ORIGINAL RECORD LEN   @LA02135*/         
EIRECPTR DS    FL4                  /* ORIGINAL RECORD ADDR  @LA02135*/         
EIUSEPTR DS    FL4                  /* USER DATA AREA PTR    @V23N253*/         
EIDDID   DS    0FL4                 /* EIOP06 DDN/VOLID PTR  @OW36779*/         
EIXMWPL  DS    FL4                  /* EIOP11 WTO PLIST PTR  @OW36779*/         
EIXFLAGS DS    0XL4                 /* OTHER FLAGS           @LA09760*/         
EIXFLAG0 DS    X                    /* FLAG BYTE 0           @LA09760*/         
EIXABEND EQU   X'80'                /* ABEND MESSAGE FLAG    @LA09760*/         
EIXNTERR EQU   X'40'                /* NON-TAPE ERR MSG FLAG @LA09760*/         
EIXWNGOK EQU   X'20'                /* WARNINGS ARE OK  FLAG @LA54862*/         
EIXTRKER EQU   X'10'                /* track is in error     @OW07425*/         
EIXFLAG1 DS    X                    /* FLAG BYTE 1           @LA09760*/         
EIXTRC32 EQU   X'80'                /* UIM SET EIRETCOD 32   @OW33495*/         
EIXTDUMS EQU   X'20'                /* DUMMY SOURCE TAPE     @OW13783*/         
EIXTDUMT EQU   X'10'                /* DUMMY TARGET TAPE     @OW13783*/         
EIXTISXM EQU   X'08'                /* APPL USING XMAPI      @OW13783*/         
EIXDASYS EQU   X'04'                /* XMAPI ALLOCATION ERR  @OW21750*/         
EIXTWERR EQU   X'02'                /* XMAPI TAPE WRITE ERR  @OW22314*/         
EIXTRERR EQU   X'01'                /* XMAPI TAPE READ ERR   @OW22673*/         
EIXFLAG2 DS    X                    /* FLAG BYTE 2           @LA09760*/         
*                                   /* Remove Batch jcl bit      @03D*/         
EIXFLAG3 DS    X                    /* FLAG BYTE 3           @LA09760*/         
         DS    0F                   /* FORCE WORD BOUNDARY           */         
EIDBLEN  EQU   *-ADREIB             /* LENGTH OF THE EIB BLOCK       */         
*/********************************************************************/         
*/* RECORD PRESENTED BY EXIT 06 (WRITE PHYSICAL TAPE):       @OW34887*/         
*/* EIDDINFO IS BASED ON (EIDDID).                           @OW34887*/         
*/********************************************************************/         
EIDDINFO DSECT                                                                  
EIDDNAME DS    CL8                  /* DDNAME LEFT-JUSTIFIED  @V22AEG*/         
EIVOLID  DS    CL6                  /* VOLUME SERIAL NO.      @V22AEG*/         
EIRETC   DS    XL1                  /* RETURN CODE            @V22AEG*/         
EI06FLGS DS    XL1                  /* EXIT 06 FLAGS         @OW34887*/         
EI06FTRL EQU   X'80'                /* RESERVED FOR HSM USE  @OW34887*/         
EI06THWE EQU   X'40'                /* RESERVED FOR HSM USE      @TPE*/         
*                                   /* OUTPUT DEVICE ENCRYPTS    @TPE*/         
EI06DCB@ DS    AL4                  /* RESERVED FOR HSM USE  @OW34887*/         
*        DS    CL4                  /* RESERVED              @OW34887*/         
*/********************************************************************/         
*/* RECORD PRESENTED BY EXIT 00 (FUNCTION STARTUP):          @OY57120*/         
*/********************************************************************/         
EIREC00  DSECT                      /*                       @OY57120*/         
EI00SBPL DS    XL1                  /* SHARED SUBPOOL NUMBER @OY57120*/         
EI00FLGS DS    XL1                  /* startup flags         @OW20023*/         
EI00SENQ EQU   X'80'                /* short VTOC enqueue    @OW20023*/         
EI00NONF EQU   X'40'                /* 1 = Don't allow IGWNOTIF call,           
*                                    0 = Allow IGWNOTIF call @OW28223*/         
EI00NOLK EQU   X'20'                /* 1= NO ADRLOCK ENQ/DEQ @OW42942*/         
EI00NENQ EQU   X'10'                /* 1= NO INPUT VOLUME                       
*                                      SERIALIZATION.                           
*                                      VALID DURING PHYSICAL COPY AND           
*                                      DUMP FUNCTION STARTUPS    @ALF*/         
EI00BSEC EQU   X'08'                /* 1= BYPASS SECURITY VERIFICATION.         
*                                      VALID DURING COPY FULL/TRACKS,           
*                                      DUMP FULL/TRACKS, AND RESTORE            
*                                      FULL/TRACKS FUNCTION STARTUPS,           
*                                      UNIX PATH DUMP/RESTORE                   
*                                                                @UXC*/         
EI00MVOLRECOV EQU X'04'             /* 1=CALLER IS PERFORMING A MULTI           
*                                      VOLUME RECOVERY USING PHYSICAL           
*                                      DATA SET RESTORE AND IT IS               
*                                      ACCEPTABLE FOR DFSMSDSS TO               
*                                      SCRATCH PREALLOCATED TARGET              
*                                      DATA SETS THAT ARE NOT THE               
*                                      CORRECT SIZE              @PDC*/         
EI00BSER EQU   X'02'                /* 1=BYPASS SERIALIZATION OF THE            
*                                      DATA SETS BEING RESTORED DURING          
*                                      A PHYSICAL DATA SET RESTORE              
*                                      OPERATION                 @PDC*/         
EI00_NOEXCL_NSPLOCK EQU X'01'       /* 1=BYPASS EXCLUSIVE ADRLOCK               
*                                      NONSPEC ENQ               @A1C*/         
EI00SVOL DS    CL6                  /* SOURCE VOLSER. VALID DURING              
*                                      COPY FULL/TRACKS, DUMP                   
*                                      FULL/TRACKS, AND RESTORE                 
*                                      FULL/TRACKS FUNCTION STARTUPS.           
*                                      FOR RESTORE, THIS FIELD CONTAINS         
*                                      VOLSER OF THE INPUT VOLUME               
*                                      WHERE THE DUMP DATA SET                  
*                                      RESIDES                   @ALF*/         
EI00FLG2 DS    XL1                  /* 2ND FLAG AREA             @XES*/         
EI00SWNCRYPT EQU X'80'              /* SOFTWARE ENCRYPTION WAS   @XES*/         
*                                   /* REQUESTED (RSA OR         @XES*/         
*                                   /* KEYPASSWORD WAS           @XES*/         
*                                   /* SPECIFIED)                @XES*/         
EI00CANSFE   EQU X'40'              /* CANCEL SOFTWARE ENCRYPT   @XES*/         
EI00MIXDEV   EQU X'20'              /* MIXTURE OF DEVICES PERFORMING            
*                                      AND NOT PERFORMING HARDWARE              
*                                      ENCRYPTION                @XES*/         
EI00ZCOMP    EQU X'10'              /* ZCOMPRESSION IS ATTEMPTED @ZCA*/         
*            EQU X'0F'              /* RESERVED                  @ZCC*/         
              DS  CL3               /* RESERVED                  @P4A*/         
EI00CIRBA_DA  DS  XL4               /* RBA OF VVR CI DATA/NONVSM @NVA*/         
EI00CIRBA_IX  DS  XL4               /* RBA OF VVR CI INDEX       @NVA*/         
*/********************************************************************/         
*/* THE FOLLOWING MAPS THE RECORD PRESENTED BY EXIT 14:      @LA65381*/         
*/* DSS MESSAGE NUMBER ASSOCIATED WITH NON ZERO RETCODE      @LA65381*/         
*/********************************************************************/         
EIREC14  DSECT                                                                  
EI14RC   DS    CL4                  /* DSS RETURN CODE       @LA65381*/         
EI14MESS DS    0CL4                 /* DSS MESSAGE           @LA65381*/         
EI14MNUM DS    CL3                  /*  MESSAGE NUMBER       @LA65381*/         
EI14MTYP DS    CL1                  /*  MESSAGE TYPE         @LA65381*/         
EI14CPUT DS    CL8                  /* DSS CPU TIME          @OW13783*/         
EI14ZCSV DS    XL1                  /* ZCOMPRESS PERCENT SAVED   @ZCA*/         
EI14TCT_CSAVE EQU EI14ZCSV                                                      
*        DS    CL15                 /* unused                    @ZCA*/         
*/********************************************************************/         
*/* THE FOLLOWING MAPS THE RECORD PRESENTED BY EXIT 20: VOLUME   @V24*/         
*/* NOTIFICATION EXIT.                                           @V24*/         
*/********************************************************************/         
EIREC20  DSECT                                                                  
EI20DSN  DS    CL44                 /* DATA SET NAME/CLUSTER NAME               
*                                                                @V24*/         
EI20FLGS DS    XL1                  /* SOME FLAGS:               @V24*/         
EI20VSAM EQU   X'80'                /* 1=DATA SET IS VSAM                       
*                                      0=DATA SET IS NONVSAM     @V24*/         
EI20RACF EQU   X'40'                /* 1=DATA SET IS PROTECTED BY A             
*                                      DISCRETE RACF PROFILE     @V24*/         
EI20LVOL EQU   X'20'                /* 1=LAST VOLUME INDICATOR                  
*                                      ON FOR NON-VSAM DATA SET  @PDC*/         
E20F9ATT EQU   X'10'                /* F9 ATTRS LOST FLAG        @P0A*/         
*        EQU   X'0F'                /* RESERVED                  @P0C*/         
         DS    CL1                  /* RESERVED                  @V24*/         
EI20DA#  DS    XL1                  /* NUMBER OF DATA COMPONENTS @V24*/         
EI20IX#  DS    XL1                  /* NUMBER OF INDEX COMPONENTS               
*                                      (0 IF NONVSAM)            @V24*/         
EI20DA@  DS    AL4                  /* POINTER TO DATA COMPONENT                
*                                      INFO FOR VSAM/DATA SET                   
*                                      INFO FOR NONVSAM          @V24*/         
EI20IX@  DS    AL4                  /* POINTER TO INDEX COMPONENT               
*                                      INFO FOR VSAM/0 FOR NONVSAM              
*                                                                @V24*/         
*                                   /* THE EI20SCNT, EI20DSHA,                  
*                                      AND EI20ISHA FIELDS ARE                  
*                                      PROVIDED WHEN PROCESSING                 
*                                      THE FIRST VOLUME OF A MULTI              
*                                      VOLUME DATA SET           @PDC*/         
         DS    XL2                  /* ADD PADDING FOR ALIGNMENT @NVA*/         
EI20SCNT DS    XL2                  /* TOTAL STRIPE COUNT FOR                   
*                                      THIS VSAM DATA SET.                      
EI20DSHA DS    XL4                  /* VSAM DATA COMPONENT                      
*                                      HIGH ALLOCATED RBA        @PDC*/         
EI20ISHA DS    XL4                  /* VSAM INDEX COMPONENT                     
*                                      HIGH ALLOCATED RBA        @PDC*/         
*/********************************************************************/         
*/* FOR A NONVSAM DATA SET, EI20DA@ WILL POINT TO A SINGLE       @V24*/         
*/* EI20DSI STRUCTURE.  FOR A VSAM CLUSTER, EI20DA@ POINTS TO AN @V24*/         
*/* ARRAY OF STRUCTURES (ONE FOR EACH DATA COMPONENT), AND       @V24*/         
*/* EI20IX@ POINTS TO A SIMILAR ARRAY FOR THE INDEX COMPONENTS   @V24*/         
*/********************************************************************/         
EI20DSI  DSECT                      /* DATA SET INFO             @V24*/         
EI20CON  DS    CL44                 /* COMPONENT NAME (BLANKS FOR               
*                                      NONVSAM)                  @V24*/         
EI20NVOL DS    XL2                  /* # OF VOLUMES IN DS        @V24*/         
         DS    CL2                  /* RESERVED                  @V24*/         
EI20VLI  DS    0CL12                /* VOLUME INFORMATION (REPEAT FOR           
*                                      EACH VOLUME               @V24*/         
EI20VOL  DS    CL6                  /* VOLSER                    @V24*/         
E20DSTP# DS    XL2                  /* DATA COMPONENT STRIPE                    
*                                      NUMBER                    @PDC*/         
EI20RBA  DS    FL4                  /* RBA TOKEN                                
*                                                                @V24*/         
*                                   /* THE EI20DRBA FIELD IS                    
*                                      CALCULATED BY SUBTRACTING                
*                                      THE HIGH RBA FIELDS                      
*                                      FROM THE LOW RBA FIELDS.  @PDC*/         
EI20DRBA DS    XL4                  /* NUMBER OF RBAS PROCESSED                 
*                                      FOR THE THIS COMPONENT    @PDC*/         
EI20VLSQ DS    XL2                  /* VOLUME SEQUENCE NUMBER                   
*                                      FOR THE DATA SET          @PDC*/         
         DS    CL2                  /* PADDING (UNUSED)          @PDC*/         
*/********************************************************************/         
*/* THE FOLLOWING MAPS THE RECORD PRESENTED BY EXIT 21:          @V25*/         
*/*    DATA SET VERIFICATION EXIT                                @V25*/         
*/********************************************************************/         
EIREC21  DSECT                                                /* @V25*/         
EI21DSN  DS    CL44                 /* DATA SET/CLUSTER NAME     @V25*/         
*/********************************************************************/         
*/* THE FOLLOWING MAPS THE RECORD PRESENTED BY EXIT 22:          @V25*/         
*/*    BYPASS VERIFICATION EXIT                                  @V25*/         
*/********************************************************************/         
EIREC22  DSECT                                                /* @V25*/         
EI22DSN  DS    CL44                 /* DATA SET/CLUSTER NAME     @V25*/         
EI22FLGS DS    XL1                  /* EXIT 22 FLAGS:            @V25*/         
EI22BSER EQU   X'80'                /* 1=BYPASS                                 
*                                        SERIALIZATION           @V25*/         
EI22BSEC EQU   X'40'                /* 1=BYPASS DATASET LEVEL, STORCLAS         
*                                        AND MGMTCLAS SECURITY CHECKS.          
*                                        ALSO BYPASS JES3 INTEGRITY             
*                                        CHECKS AND DO NOT CREATE               
*                                        DISCRETE DATASET PROFILES.             
*                                                            @OY60302*/         
EI22BMIG EQU   X'20'                /* 1=TOLERATE MIGRATED VOLSERS              
*                                        FOR NONVSAM DATA SETS @DS007*/         
*               /* SWAPPING POSITIONS OF EI22NSYS & EI22SIRS @OW01655*/         
EI22NSYS EQU   X'10'                /* 1=NO SYSDSN, GET ADRDSN, BWODSN          
*                                       AND SYSVSAM ENQUEUES    @L4A */         
EI22LIKE EQU   X'08'                /* 1=RESTORE/COPY TO SAME                   
*                                        DEVICE              @NA06820*/         
EI22EXTR EQU   X'04'                /* 1=RESTORE TO SAME VOLUME BEING           
*                                        EXTENT REDUCED      @NA06820*/         
EI22SIRS EQU   X'02'                /* SET INCMPLT RECALL    @OW01655           
*                                        SWAPPED W/ EI22NSYS @OW01655*/         
EI22DB2  EQU   X'01'                /* 1 = DB2 RENAME        @OW45048*/         
*                                                                    */         
*/********************************************************************/         
*/* THE FOLLOWING WERE REMOVED FROM THE MAP OF THE RECORD    @OY62462*/         
*/*   PRESENTED TO EXIT 22 BUT ARE NOW RETURNED TO USE       @OY62462*/         
*/********************************************************************/         
EI22SFLG DS    0CL5                 /* SOURCE DATA SET FLAGS @OY62462*/         
E22SSMSF DS    CL1                  /* SOURCE SMS FLAGS              */         
*                                   /*                       @OY62462*/         
E22SDSRG DS    CL2                  /* SOURCE DATA SET ORG           */         
*                                   /*                       @OY62462*/         
E22SVFLG DS    XL2                  /* VSAM DATA SET FLAGS:  @OY62462*/         
E22SESDS EQU   X'80'                /* 1=ESDS DATA SET       @OY62462*/         
E22SKSDS EQU   X'40'                /* 1=KSDS DATA SET       @OY62462*/         
E22SKRDS EQU   X'20'                /* 1=KRDS DATA SET       @OY62462*/         
E22SLDS  EQU   X'10'                /* 1=LINEAR DATA SET     @OY62462*/         
E22SRRDS EQU   X'08'                /* 1=RRDS DATA SET       @OY62462*/         
E22SPSSI EQU   X'04'                /* 1=PAGE/SWAP/STGINDEX, ETC.    */         
*                                   /* UNSUPPORTED DATA SETS @OY62462*/         
E22SVVDS EQU   X'02'                /* 1=VVDS DATA SET       @OY62462*/         
E22SBCS  EQU   X'01'                /* 1=BCS DATA SET        @OY62462*/         
E22SAIX  EQU   X'80'                /* 1=AIX DATA SET        @OY62462*/         
E22SVRRD EQU   X'40'                /* 1=VRRDS DATASET       @OY62462*/         
*        EQU   X'3F'                /* RESERVED              @OY62462*/         
EI22FLG2 DS    XL1                  /* MORE EXIT 22 FLAGS        @RLS*/         
EI22RSET EQU   X'80'                /* RESET DS CHANGED FLAG     @RLS*/         
EI22SSYS EQU   X'40'                /* GET SHARED SYSDSN ENQ     @RLS*/         
EI22RRB  EQU   X'20'                /* MARK TGT RECOVERY REQ'D   @RLS*/         
EI22LINF EQU   X'10'                /* LOG INFO PASSED, SEE      @RLS*/         
*                                   /* EI22LPRM AND EI22LSID     @RLS*/         
EI22BWOP EQU   X'08'                /* BWO_ALLOWED PASSED, SEE   @RLS*/         
*                                   /* EI22BWOA                  @RLS*/         
EI22IMS  EQU   X'04'                /* TYPE=TYPEIMS PROCESS  @OW15980*/         
EI22BWOE EQU   X'02'                /* ENQ ON BWODSN ONLY,   @OW15980*/         
*                                   /* NO ADR OR SYS ENQ'S   @OW15980*/         
EI22_BYPASS_SOURCE_SER EQU X'01'    /* BYPASS SOURCE DS SER      @BPA*/         
EI22LPRM DS    CL1                  /* LOG PARAMETER FOR TGT     @RLS*/         
EI22LSID DS    CL26                 /* LOG STREAM ID FOR TGT     @RLS*/         
EI22FLG3 DS    XL1                  /* MORE EXIT 22 FLAGS        @RLS*/         
EI22BWOA EQU   X'F0'                /* BWO_ALLOWED               @RLS*/         
EI22BRLS EQU   X'08'                /* bypass RLS quiesce     @RLSCDS*/         
EI22SFSM EQU   X'04'                /* Set reconnectable flag    @FSM*/         
EI22LREP EQU   X'02'                /* Set LOGREPLICATE flag     @LRA*/         
EI22BRBK EQU   X'01'                /* bypass reblocking         @A2A*/         
EI22DSSRL DS    XL1                 /* DATA SET SERIALIZATION    @STA*/         
*                                   /* ERROR ACTION              @STA*/         
EI22ACSEN DS    CL8                 /* ACS ENVIRONMENT           @STA*/         
EI22SGP   DS    AL4                 /* POINTER TO STORAGE GROUP  @STA*/         
*                                   /* LIST ( 15 MAXIMUM )       @STA*/         
          DS    CL32                /* AVAILABLE                 @STA*/         
*                                                                    */         
*/********************************************************************/         
*/* RECORD PRESENTED BY EXIT 22 (BYPASS VERIFICATION):           @STA*/         
*/* EISGLIST IS BASED ON (EI22SGP). MAXIMUM NUMBER OF STORAGE    @STA*/         
*/* GROUP IN THE LIST IS 15.                                     @STA*/         
*/********************************************************************/         
EISGLIST DSECT                    /* UIM-22 storage group list   @STA*/         
EISGHDR  DS    0CL4               /* Storage group list header   @STA*/         
EISGCNT  DS    XL1                /* Number of storage group     @STA*/         
*                                 /* list entries                @STA*/         
         DS    CL3                /* For alignment               @STA*/         
EISGENT  DS    0CL32              /* Storage group entry array   @STA*/         
EISGLEN  DS    H                  /* length of storage group     @STA*/         
*                                 /* name                        @STA*/         
EISGNAM  DS    CL30               /* Name of storage group       @STA*/         
*/********************************************************************/         
*/* THE FOLLOWING MAPS THE RECORD PRESENTED BY EXIT 23:          @V25*/         
*/*    DATA SET PROCESSED NOTIFICATION EXIT                      @V25*/         
*/********************************************************************/         
EIREC23  DSECT                                                /* @V25*/         
EI23DSN  DS    CL44                 /* DATA SET/CLUSTER NAME     @V25*/         
EI23NEWN DS    CL44                 /* NEW DATA SET/CLUSTER NAME @V25*/         
EI23DSRC DS    XL2                  /* RETURN CODE FOR DATA SET                 
*                                      PROCESSING                @V25*/         
EI23SFLG DS    0CL5                 /* SOURCE DATA SET FLAGS     @V25*/         
E23SSMSF DS    CL1                  /* SOURCE SMS FLAGS                         
*                                                                @V25*/         
E23SDSRG DS    CL2                  /* SOURCE DATA SET ORG                      
*                                                                @V25*/         
E23SVFLG DS    XL2                  /* VSAM DATA SET FLAGS:      @V25*/         
E23SESDS EQU   X'80'                /* 1=ESDS DATA SET           @V25*/         
E23SKSDS EQU   X'40'                /* 1=KSDS DATA SET           @V25*/         
E23SKRDS EQU   X'20'                /* 1=KRDS DATA SET           @V25*/         
E23SLDS  EQU   X'10'                /* 1=LINEAR DATA SET         @V25*/         
E23SRRDS EQU   X'08'                /* 1=RRDS DATA SET           @V25*/         
E23SPSSI EQU   X'04'                /* 1=PAGE/SWAP/STGINDEX, ETC.               
*                                        UNSUPPORTED DATA SETS   @V25*/         
E23SVVDS EQU   X'02'                /* 1=VVDS DATA SET           @V25*/         
E23SBCS  EQU   X'01'                /* 1=BCS DATA SET            @V25*/         
E23SAIX  EQU   X'80'                /* 1=AIX DATA SET            @NVA*/         
E23BCSEL EQU   X'40'                /* 1=VRRDS DATA SET      @LA82401*/         
E23SVRRD EQU   X'20'                /* 1=VRRDS DATA SET      @LA82401*/         
EI23RRB  EQU   X'10'                /* RECOVERY REQUIRED         @RLS*/         
*        EQU   X'0F'                /* UNUSED                    @RLS*/         
EI23TFLG DS    0CL5                 /* TARGET DATA SET FLAGS     @V25*/         
E23TSMSF DS    CL1                  /* TARGET SMS FLAGS                         
*                                                                @V25*/         
E23TDSRG DS    CL2                  /* TARGET DATA SET ORG                      
*                                                                @V25*/         
E23TVFLG DS    XL2                  /* VSAM DATA SET FLAGS:      @V25*/         
E23TESDS EQU   X'80'                /* 1=ESDS DATA SET           @V25*/         
E23TKSDS EQU   X'40'                /* 1=KSDS DATA SET           @V25*/         
E23TKRDS EQU   X'20'                /* 1=KRDS DATA SET           @V25*/         
E23TLDS  EQU   X'10'                /* 1=LINEAR DATA SET         @V25*/         
E23TRRDS EQU   X'08'                /* 1=RRDS DATA SET           @V25*/         
E23TPSSI EQU   X'04'                /* 1=PAGE/SWAP/STGINDEX, ETC.               
*                                        UNSUPPORTED DATA SETS   @V25*/         
E23TVVDS EQU   X'02'                /* 1=VVDS DATA SET           @V25*/         
E23TBCS  EQU   X'01'                /* 1=BCS DATA SET            @V25*/         
E23TAIX  EQU   X'80'                /* 1=AIX DATA SET        @LA82401*/         
E23TVRRD EQU   X'40'                /* 1=VRRDS DATA SET      @LA82401*/         
*        EQU   X'3F'                /* RESERVED              @LA82401*/         
EI23RLST DS    0CL16                /* RLS TIME STAMPS           @RLS*/         
EI23GMT  DS    CL8                  /* RLS GMT TIME STAMP        @RLS*/         
EI23LOC  DS    CL8                  /* RLS LOCAL TIME STAMP      @RLS*/         
E23BYTES DS    CL8                  /* TOTAL TRACK BYTES RESTORED,              
*                                         COPIED, OR DUMPED  @OW25343*/         
E23FLGS  DS    XL1                  /* MISC FLAGS            @OW11555*/         
E23BSET  EQU   X'80'                /* 1=E23BYTES SET        @OW11555*/         
E23BPDS  EQU   X'40'                /* PDS IS BROKEN         @K131935*/         
E23BPSE  EQU   X'20'                /* E23BYTES IS FOR PSE   @OW25343*/         
E23F9ATT EQU   X'10'                /* F9 ATTRIBUTES NOT RESTD   @P0A*/         
EI23DEVT DS    CL6                  /* REQUIRED DEVICE TYPE  @K131935*/         
         DS    CL9                  /* AVAILABLE             @K131935*/         
EI23VOL# DS    XL1                  /* NUMBER OF VOLUMES         @V25*/         
EI23VSER DS    118XL6               /* VOLSER ARRAY              @V25*/         
*/********************************************************************/         
*/* THE FOLLOWING MAPS THE RECORD PRESENTED BY EXIT 24:          @V26*/         
*/*     CONCURRENT COPY INITIALIZATION COMPLETE                  @V26*/         
*/********************************************************************/         
EIREC24  DSECT                            /*                     @V26*/         
EI24RTCD DS    H                          /* RETURN CODE         @V26*/         
EI24RSCD DS    H                          /* REASON CODE         @V26*/         
         DS    F                          /* RESERVED            @V26*/         
EI24VOL  DS    CL6                        /* VOLUME SERIAL       @V26*/         
EI24DSN  DS    CL44                       /* DATA SET NAME       @V26*/         
EI24FLGS DS    XL1                        /* FLAGS               @RLS*/         
EI24RSET EQU   X'80'                     /* DS CHANGE FLAG RESET @RLS*/         
E24SAIX  EQU   X'40'                      /* 1=AIX DATA SET      @IBC*/         
E24BCSEL EQU   X'20'                      /* 1=BASE CLUS SELECTD @IBC*/         
*        EQU   X'1F'                      /* UNUSED              @IBC*/         
         DS    CL24                       /* AVAILABLE           @RLS*/         
*/********************************************************************/         
*/* THE FOLLOWING MAPS THE RECORD PRESENTED BY EXIT 26:      @OW15980*/         
*/*    DUMP OUTPUT VOLUME MOUNT NOTIFICATION EXIT            @OW15980*/         
*/********************************************************************/         
EIREC26  DSECT                            /*                     @V26*/         
EI26TYPE DS    XL4                     /* EXIT TYPE          @OW15980*/         
EI26VOL  EQU   X'80'           /* OUTPUT VOLUME NOTIFICATION @OW15980*/         
EI26TERM EQU   X'40'           /* OUTPUT VOLUME TERMINATED   @OW15980*/         
EI26R0CE EQU   X'20'           /* BWO R0 COUNT ERROR         @OW15980*/         
EI26VCLO EQU   X'10'           /* output volume close - only                    
*                                 for DASD outputs during                       
*                                 logical dump operations    @OW57536*/         
EI26THWE EQU   X'08'           /* TAPE DEVICE WILL BE                           
*                                 ENCRYPTING DATA IN HARDWARE    @TPE*/         
EI26DSN  DS    CL64            /* DSNAME IF EI26R0CE = '1'B  @OW15980*/         
EI26DSNL DS    AL1             /* LENGTH OF DSNAME           @OW15980*/         
         DS    AL3             /* RESERVED FOR ALIGNMENT     @OW15980*/         
EI26DDN  DS    CL8             /* output dd name if EI26VOL,                    
*                                 EI26TERM, or EI26VCLO set  @OW57536*/         
EI26VSER DS    CL6             /* VOLSER - present if EI26VOL,                  
*                                 EI26TERM, or EI26VCLO set  @OW57536*/         
         DS    CL2             /* RESERVED FOR ALIGNMENT     @OW15980*/         
EI26VTRC DS    XL4             /* return code for volume                        
*                                 term and volume close      @OW57536*/         
         DS    CL96            /* RESERVED FOR EXPANSION     @OW15980*/         
*/********************************************************************/         
*/* THE FOLLOWING MAPS THE RECORD PRESENTED BY EXIT 27:          @PDC*/         
*/*    PHYSICAL DATA SET PROCESSED NOTIFICATION EXIT             @PDC*/         
*/********************************************************************/         
EIREC27  DSECT                                                /* @PDC*/         
EI27DSN  DS    CL44                 /* DATA SET/CLUSTER NAME     @PDC*/         
EI27NEWN DS    CL44                 /* NEW DATA SET/CLUSTER NAME @PDC*/         
EI27DSRC DS    XL2                  /* RETURN CODE FOR DATA SET                 
*                                      PROCESSING                @PDC*/         
EI27SFLG DS    0CL5                 /* SOURCE DATA SET FLAGS     @PDC*/         
E27SSMSF DS    CL1                  /* SOURCE SMS FLAGS                         
*                                                                @PDC*/         
E27SDSRG DS    CL2                  /* SOURCE DATA SET ORG                      
*                                                                @PDC*/         
E27SVFLG DS    XL2                  /* VSAM DATA SET FLAGS:      @PDC*/         
E27SESDS EQU   X'8000'              /* 1=ESDS DATA SET           @PDC*/         
*                                   /* FOR PHYSICAL DATA SET COPY               
*                                      IF THE SOURCE DATA SET IS A              
*                                      KSDS AND THE VOLUME BEING                
*                                      PROCESSED IS NOT THE PRIMARY             
*                                      VOLUME AND THE INDEX FOR THAT            
*                                      KSDS DOES NOT RESIDE ON THE              
*                                      CURRENT VOLUME BEING PROCESSED,          
*                                      THIS BIT MAY BE ON BECAUSE               
*                                      IT APPEARS TO BE A ESDS                  
*                                                            @OA17350*/         
E27SKSDS EQU   X'4000'              /* 1=KSDS DATA SET           @PDC*/         
E27SKRDS EQU   X'2000'              /* 1=KRDS DATA SET           @PDC*/         
E27SLDS  EQU   X'1000'              /* 1=LINEAR DATA SET         @PDC*/         
E27SRRDS EQU   X'0800'              /* 1=RRDS DATA SET           @PDC*/         
E27SPSSI EQU   X'0400'              /* 1=PAGE/SWAP/STGINDEX, ETC.               
*                                        UNSUPPORTED DATA SETS   @PDC*/         
E27SVVDS EQU   X'0200'              /* 1=VVDS DATA SET           @PDC*/         
E27SBCS  EQU   X'0100'              /* 1=BCS DATA SET            @PDC*/         
E27SAIX  EQU   X'0080'                                                          
E27SVVRD EQU   X'0040'              /* 1=VRRDS DATA SET          @PDC*/         
E27BCSEL EQU   X'0020'              /* 1=BASE CLUSTER SELECTED   @NVC*/         
EI27RRB  EQU   X'0010'              /* 1=RECOVERY REQUIRED       @NVA*/         
*        EQU   X'000F'              /* RESERVED                  @NVC*/         
EI27TFLG DS    0CL5                 /* TARGET DATA SET FLAGS     @PDC*/         
E27TSMSF DS    CL1                  /* TARGET SMS FLAGS                         
*                                                                @PDC*/         
E27TDSRG DS    CL2                  /* TARGET DATA SET ORG                      
*                                                                @PDC*/         
E27TVFLG DS    XL2                  /* VSAM DATA SET FLAGS:      @PDC*/         
E27TESDS EQU   X'8000'              /* 1=ESDS DATA SET           @PDC*/         
*                                   /* FOR PHYSICAL DATA SET COPY               
*                                      IF THE SOURCE DATA SET IS A              
*                                      KSDS AND THE VOLUME BEING                
*                                      PROCESSED IS NOT THE PRIMARY             
*                                      VOLUME AND THE INDEX FOR THAT            
*                                      KSDS DOES NOT RESIDE ON THE              
*                                      CURRENT VOLUME BEING PROCESSED,          
*                                      THIS BIT MAY BE ON BECAUSE               
*                                      IT APPEARS TO BE A ESDS                  
*                                                            @OA17350*/         
E27TKSDS EQU   X'4000'              /* 1=KSDS DATA SET           @PDC*/         
E27TKRDS EQU   X'2000'              /* 1=KRDS DATA SET           @PDC*/         
E27TLDS  EQU   X'1000'              /* 1=LINEAR DATA SET         @PDC*/         
E27TRRDS EQU   X'0800'              /* 1=RRDS DATA SET           @PDC*/         
E27TPSSI EQU   X'0400'              /* 1=PAGE/SWAP/STGINDEX, ETC.               
*                                        UNSUPPORTED DATA SETS   @PDC*/         
E27TVVDS EQU   X'0200'              /* 1=VVDS DATA SET           @PDC*/         
E27TBCS  EQU   X'0100'              /* 1=BCS DATA SET            @PDC*/         
E27TAIX  EQU   X'0080'              /* 1=AIX DATA SET            @PDC*/         
E27TVRRD EQU   X'0040'              /* 1=VRRDS DATA SET          @PDC*/         
E27TRACF EQU   X'0020'              /* 1=DATA SET IS PROTECTED BY               
*                                      DISCRETE RACF PROFILE     @PDC*/         
*        EQU   X'001F'              /* RESERVED                  @PDC*/         
EI27TRKS DS    CL8                  /* TOTAL TRACKS COPIED       @PDC*/         
EI27SVOL DS    CL6                  /* SOURCE VOLUME SERIAL      @PDC*/         
EI27TVOL DS    CL6                  /* TARGET VOLUME SERIAL      @PDC*/         
E27FLGS  DS    XL1                  /* MISC FLAGS                @PDC*/         
EI27LVOL EQU   X'80'                /* LAST VOLUME INDICATOR                    
*                                      FROM THE SOURCE DATA SET  @PDC*/         
E27F9ATT EQU   X'40'                /* F9 ATTRS LOST FLAG        @P0A*/         
         DS    XL1                  /* RESERVED                  @PDC*/         
EI27VLSQ DS    H                    /* VOLUME SEQUENCE NUMBER                   
*                                      FROM THE SOURCE DATA SET  @PDC*/         
EI27DSHA DS    F                    /* VSAM DATA COMPONENT HIGH                 
*                                      ALLOCATED RBA COUNT       @PDC*/         
EI27ISHA DS    F                    /* VSAM INDEX COMPONENT HIGH                
*                                      ALLOCATED RBA COUNT       @PDC*/         
EI27SCNT DS    H                    /* VSAM DATA SET STRIPE                     
*                                      COUNT. PROVIDED WHEN  @OA17350*/         
*                                      PROCESSING FIRST VOLUME OF               
*                                      MULTIVOLUME DATA SET.     @PDC*/         
E27DSTP# DS    H                    /* DATA COMPONENT STRIPE                    
*                                      NUMBER                    @PDC*/         
EI27DRBA DS    F                    /* RBAS PROCESSED FOR THE                   
*                                      DATA COMPONENT            @PDC*/         
EI27IRBA DS    F                    /* RBAS PROCESSED FOR THE                   
*                                      INDEX COMPONENT           @PDC*/         
EI27DANM DS    CL44                 /* NEW DATA COMP NAME        @HRA*/         
EI27IXNM DS    CL44                 /* NEW INDEX COMP NAME       @HRA*/         
         DS    CL32                 /* AVAILABLE                 @HRC*/         
*/********************************************************************/         
*/* THE FOLLOWING MAPS THE RECORD PRESENTED BY EXIT 28:          @E2A*/         
*/*    TARGET DATA SET ALLOCATION NOTIFICATION EXIT              @E2A*/         
*/********************************************************************/         
EIREC28  DSECT                                                /* @E2A*/         
EI28PARMS1  DS    XL4               /* EXIT 28 PARMS FIELD 1                    
*                                      ANY FIELD SET ON INDICATES               
*                                      THAT FIELD HAS BEEN SPECIFIED            
*                                      TO BE USED FOR THIS EXIT  @E2A*/         
EI28EATTRP  EQU   X'80000000'       /* EATTR VALUE PASSED    @OA29235*/         
EI28F9DSCBP EQU   X'40000000'       /* F9 DSCB PASSED        @OA29235*/         
EI28CREDTP  EQU   X'20000000'       /* CREATION DATE PASSED  @OA29235*/         
EI28RCAP    EQU   X'10000000'       /* CA RECLAIM VAL PASSED @K1C0372*/         
EI28ZFSP    EQU   X'08000000'       /* LDS defined as zFS        @01A*/         
*           EQU   X'07FFFFFF'       /* UNUSED                    @01C*/         
EI28PARMS2  DS    XL4               /* EXIT 28 PARMS FIELD 2     @E2A*/         
*           EQU   X'FFFFFFFF'       /* UNUSED                @OA29235*/         
EI28TGTDSN  DS    XL44              /* TARGET DATA SET NAME      @E2A*/         
EI28SRCDSN  DS    XL44              /* SOURCE DATA SET NAME      @E2A*/         
EI28F9DSCB  DS    XL140             /* FORMAT 9 DSCB             @E2A*/         
EI28FIELDS1 DS    XL1               /* EXIT 28 FIELDS 1                         
*                                      FLAG BYTE FOR BIT FIELDS  @E2A*/         
EI28EATTR   EQU   X'C0'             /* EATTR VALUE TO BE USED FOR               
*                                      TARGET DATASET ALLOCATION                
*                                                            @OA29235*/         
EI28RCA     EQU   X'20'             /* CA RECLAIM ATTR TO BE USED FOR           
*                                      TARGET DATASET ALLOC  @K1C0372*/         
EI28EATTR_NS EQU  X'00'             /*  '00'B = NS (DEFAULT VALUE USED)         
*                                                            @OA29235*/         
EI28EATTR_NO EQU  X'40'             /*  '01'B = NO           @OA29235*/         
EI28EATTR_OPT EQU X'80'             /*  '10'B = OPT          @OA29235*/         
EI28ZFS     EQU   X'10'             /* LDS defined as zFS        @01A*/         
*           EQU   X'0F'             /* UNUSED                    @01C*/         
EI28CREDT   DS    XL3               /* CREATION DATE (DS1CREDT)  @E2A*/         
            DS    CL92              /* SPACE FOR EXPANSION       @E2A*/         
*/********************************************************************/         
*/* THE FOLLOWING MAPS THE RECORD PRESENTED BY EXIT 30:          @NVA*/         
*/*    PHYSICAL DATA SET COPY RESTORE NEW VOLUME EXIT            @NVA*/         
*/********************************************************************/         
EIREC30  DSECT                                                /* @NVA*/         
EI30TRKS  DS    F                   /* TRACKS REQUIRED           @NVA*/         
EI30RC    DS    H                   /* OVERALL RETURN CODE       @NVA*/         
*         DS    CL2                 /* UNUSED                    @P4C*/         
EI30VSER@ DS    AL4                 /* PTR TO VOLUME STRUCTURE   @P4C*/         
EI30VLIST DSECT                     /* VOLUME ENTRY STRUCTURE    @P3C*/         
EI30VOL#  DS    H                   /* NUMBER OF VOLUME ENTRIES  @P4M*/         
*         DS    CL2                 /* UNUSED                    @P4A*/         
EI30VOLENT DS   0CL16               /* VOLUME ENTRY ARRAY        @P4C*/         
EI30VSER  DS    CL6                 /* VOLSER                    @NVA*/         
EI30VFLG  DS    XL1                 /* VOLUME FLAGS              @NVA*/         
EI30ATT   EQU   X'80'               /* ALLOCATION ATTEMPTED      @NVA*/         
EI30USED  EQU   X'40'               /* VOLUME USED               @NVA*/         
*         EQU   X'3F'               /* UNUSED                    @NVA*/         
*         DS    CL1                 /* UNUSED                    @NVA*/         
EI30VRC   DS    F                   /* VOLUME RETURN CODE        @NVA*/         
EI30VRSN  DS    F                   /* VOLUME REASON CODE        @NVA*/         
*/********************************************************************/         
*/* THE FOLLOWING MAPS THE RECORD PRESENTED BY EXIT 33:          @MCA*/         
*/*    Output Object NOTIFICATION EXIT                           @MCA*/         
*/********************************************************************/         
EIREC33  DSECT                                                /* @MCA*/         
EI33FLGS  DS    XL2                 /* FLAGS                     @MCA*/         
EI33META  EQU   X'80'               /* METADATA OBJECT           @MCA*/         
EI33DATA  EQU   X'40'               /* DATA OBJECT               @MCA*/         
EI33TCT_ENCRYPTED EQU X'20'         /* TCT ENCRYPTED             @02A*/         
EI33TCT_COMPRESSED EQU X'10'        /* TCT COMPRESSED            @02A*/         
*                                                                @MCA           
EI33OBJN  DS    CL128               /* OBJECT NAME               @MCA*/         
EI33OBJL  DS    XL2                 /* OBJECT NAME LENGTH        @MCA*/         
*         DS    XL2                 /* UNUSED                    @MCA*/         
EI33TRKC  DS    CL8                 /* TRACK COUNT FOR DATA OBJ  @MCA*/         
EI33BYTES DS    CL8                 /* BYTE COUNT FOR OBJECT     @MCA*/         
*         DS    XL2                 /* UNUSED                    @MCA*/         
EI33RTC   DS    XL2                 /* RETURN CODE FOR STORE OBJ @MCA*/         
EI33BYTES_COMPRESSED DS    XL8      /* COMPRESSED BYTE COUNT     @02A*/         
*         DS    CL22                /* AVAILABLE                 @02C*/         
*/********************************************************************/         
*/* THE FOLLOWING MAPS THE RECORD PRESENTED BY EXIT 35:          @L6A*/         
*/*    Cloud Function Notification Exit                          @L6A*/         
*/********************************************************************/         
EIREC35  DSECT                        ]                            @L6A         
EI35CNST  DS    0CL32                 ] Constant Length Portion    @L6A         
EI35FLAG1 DS    XL2                   ] FLAGS                      @L6A         
EI35BYPASS_CREATE_CONTAINER EQU x'80' ] 1=DO NOT CREATE CONTAINER  @L6A         
*/********************************************************************/         
*/* THE FOLLOWING MAPS THE RECORD PRESENTED BY EXIT 41:          @UXA*/         
*/*    UNIX FILE PATH NOTIFICATION EXIT                          @UXA*/         
*/********************************************************************/         
EIREC41  DSECT                                                /* @UXA*/         
EI41CNST  DS    0CL4                /* CONSTANT LENGTH PORTION   @UXA*/         
EI41PATHL DS    XL4                 /* LENGTH OF PATH NAME       @UXA*/         
EI41PATHN DS    CL1023              /* PATH NAME                 @UXA*/         
*/********************************************************************/         
*/* THE FOLLOWING MAPS THE RECORD PRESENTED BY EXIT 42:          @UXA*/         
*/*    UNIX FILE PATH BYPASS VERIFICATION EXIT                   @UXA*/         
*/********************************************************************/         
EIREC42  DSECT                                                /* @UXA*/         
EI42CNST  DS    0CL9                /* CONSTANT LENGTH PORTION   @UXA*/         
EI42PATHL DS    XL4                 /* LENGTH OF PATH NAME       @UXA*/         
EI42MODE  DS    XL4                 /* FILE MODE (BPXYMODE)      @UXA*/         
EI42FLAG1 DS    XL1                 /* USER OPTIONS 1            @UXA*/         
EI42RSET  EQU   X'80' 1... ....     /* 1=RESET LAST BACKUP       @UXA*/         
EI42PATHN DS    CL1023              /* PATH NAME                 @UXA*/         
*/********************************************************************/         
*/* THE FOLLOWING MAPS THE RECORD PRESENTED BY EXIT 43:          @UXA*/         
*/*    UNIX FILE PATH PROCESSED NOTIFICATION EXIT                @UXA*/         
*/********************************************************************/         
EIREC43  DSECT                                                /* @UXA*/         
EI43CNST  DS    0CL80               /* CONSTANT LENGTH PORTION   @UXA*/         
EI43PATHL DS    XL4                 /* LENGTH OF PATH NAME       @UXA*/         
EI43RC    DS    XL4                 /* PATH RETURN CODE          @UXA*/         
EI43STAT  DS    0CL24               /* STAT INFO                 @UXA*/         
EI43MODE  DS    XL4                 /* FILE MODE (BPXYMODE)      @UXA*/         
EI43LINK  DS    XL4                 /* NUMBER OF LINKS           @UXA*/         
EI43UID   DS    XL4                 /* USER ID OF OWNER          @UXA*/         
EI43GID   DS    XL4                 /* GROUP ID OF GROUP         @UXA*/         
EI43SIZE  DS    XL8                 /* FILE SIZE IN BYTES        @UXA*/         
EI43STAT64 DS   0CL48               /* STAT 64BIT TIME FIELDS    @UXA*/         
EI43ATIME64 DS  XL8                 /* LAST ACCESS TIME 64       @UXA*/         
EI43MTIME64 DS  XL8                 /* LAST DATA-MOD TIME 64     @UXA*/         
EI43CTIME64 DS  XL8                 /* LAST ATTR-MOD TIME 64     @UXA*/         
EI43CREAT64 DS  XL8                 /* CREATION TIME 64          @UXA*/         
EI43REF64   DS  XL8                 /* REFERENCE TIME 64         @UXA*/         
          DS    XL8                 /* STAT64 UNUSED             @UXA*/         
EI43PATHN DS    CL1023              /* PATH NAME                 @UXA*/         
*/********************************************************************/         
*/* THE FOLLOWING MAPS THE RECORD PRESENTED BY EXIT 44:          @UXA*/         
*/*    UNIX FILE CLONE INITIALIZATION NOTIFICATION EXIT          @UXA*/         
*/********************************************************************/         
EIREC44  DSECT                                                /* @UXA*/         
EI44CNST  DS    0CL12               /* CONSTANT LENGTH PORTION   @UXA*/         
EI44PATHL DS    XL4                 /* LENGTH OF PATH NAME       @UXA*/         
EI44RETCD DS    XL4                 /* CLONE OP RETURN CODE      @UXA*/         
EI44RSNCD DS    XL4                 /* CLONE OP REASON CODE      @UXA*/         
EI44PATHN DS    CL1023              /* PATH NAME                 @UXA*/         
*                                   /* Remove EXIT 45 (10 lines) @P6D*/         
         MEND                                                                   
*%PLSEID0:;            /* PLS VERSION */                                        
*DCL ADREIBID  CHAR(4)   CONSTANT('EIDB');/* BLOCK IDENTIFIER        */         
*DCL ADREIB@   PTR(31);                   /* PTR TO BLOCK            */         
*DCL EIRC00    FIXED(15) CONSTANT(0);     /* CONTINUE NORMAL PROCESS */         
*DCL EIRC04    FIXED(15) CONSTANT(4);     /* RECORD REPLACED         */         
*DCL EIRC08    FIXED(15) CONSTANT(8);     /* INSERT RECORD           */         
*DCL EIRC12    FIXED(15) CONSTANT(12);    /* DELETE RECORD           */         
*DCL EIRC16    FIXED(15) CONSTANT(16);    /* RECORD MODIFIED         */         
*DCL EIRC20    FIXED(15) CONSTANT(20);    /* DISCONNECT EXIT         */         
*DCL EIRC24    FIXED(15) CONSTANT(24);    /* SELECT USER STATS RECS  */         
*DCL EIRC28    FIXED(15) CONSTANT(28);    /* WTOR RESPONSE           */         
*DCL EIRC32    FIXED(15) CONSTANT(32);    /* TERMINATE FUNCTION  @V22*/         
*DCL EIRC36    FIXED(15) CONSTANT(36);    /* TERMINATE DSET ONLY @V25*/         
*DCL EIOP00    FIXED(15) CONSTANT(0);     /* FUNCTION STARTUP ENTRY  */         
*DCL EIOP01    FIXED(15) CONSTANT(1);     /* READING SYSIN RECORD    */         
*DCL EIOP02    FIXED(15) CONSTANT(2);     /* PRINTING SYSPRINT RECORD*/         
*DCL EIOP03    FIXED(15) CONSTANT(3);     /* READING PHYSICAL TAPE   */         
*DCL EIOP04    FIXED(15) CONSTANT(4);     /* READING LOGICAL TAPE    */         
*DCL EIOP05    FIXED(15) CONSTANT(5);     /* WRITING LOGICAL TAPE    */         
*DCL EIOP06    FIXED(15) CONSTANT(6);     /* WRITING PHYSICAL TAPE   */         
*DCL EIOP07    FIXED(15) CONSTANT(7);     /* READING DISK TRACK      */         
*DCL EIOP08    FIXED(15) CONSTANT(8);     /* WRITING DISK TRACK      */         
*DCL EIOP09    FIXED(15) CONSTANT(9);     /* READING UTILITY SYSPRINT*/         
*DCL EIOP10    FIXED(15) CONSTANT(10);    /* WRITING UTILITY SYSPRINT*/         
*DCL EIOP11    FIXED(15) CONSTANT(11);    /* WRITING WTO MESSAGE     */         
*DCL EIOP12    FIXED(15) CONSTANT(12);    /* WRITING WTOR MESSAGE    */         
*DCL EIOP13    FIXED(15) CONSTANT(13);    /* PRESENTING ADRUFO REC   */         
*DCL EIOP14    FIXED(15) CONSTANT(14);    /* FUNCTION TERMINATION    */         
*DCL EIOP15    FIXED(15) CONSTANT(15);    /* PRESENTING WTOR RESPONSE*/         
*DCL EIOP16    FIXED(15) CONSTANT(16);    /* TAPE VOL SECURITY   @V22*/         
*DCL EIOP17    FIXED(15) CONSTANT(17);    /* TAPE MOUNT(NON-SPEC)@V22*/         
*DCL EIOP18    FIXED(15) CONSTANT(18);    /* INSERT LOGICAL REC  @V22*/         
*DCL EIOP19    FIXED(15) CONSTANT(19);    /* TAPE OUTPUT ERROR   @V22*/         
*DCL EIOP20    FIXED(15) CONSTANT(20);    /* VOLUME NOTIFICATION @V24*/         
*DCL EIOP21    FIXED(15) CONSTANT(21);    /* DSET VERIFICATION   @V25*/         
*DCL EIOP22    FIXED(15) CONSTANT(22);    /* BYPASS VERIFICATION @V25*/         
*DCL EIOP23    FIXED(15) CONSTANT(23);    /* DS PROC NOTIFICATION@V25*/         
*DCL VOLSLST   FIXED(15) CONSTANT(708);   /* MAX SIZE OF VOLSER LIST            
*                                      FOR EIREC23 (118 * 6) @NA08383*/         
*DCL EIOP24    FIXED(15) CONSTANT(24);    /* CC INIT DONE        @V26*/         
*DCL EIOP25    FIXED(15) CONSTANT(25);   /* BACKSPACE TAPEIN @OW13783*/         
*DCL EIOP26    FIXED(15) CONSTANT(26);/* VOLUME OPEN FOR O/P @OW15980*/         
*DCL EIOP27    FIXED(15) CONSTANT(27); /* PHYSICAL DS PROCESSED  @PDC*/         
*DCL EIOP28    FIXED(15) CONSTANT(28); /* TARGET ALLOCATION EXIT @E2A*/         
*DCL EIOP29    FIXED(15) CONSTANT(29); /* Reserved               @P2C*/         
*DCL EIOP30    FIXED(15) CONSTANT(30); /* PHYS SMS REDRIVE       @NVA*/         
*DCL EIOP31    FIXED(15) CONSTANT(31); /* APPLICATION STORE META @MCA*/         
*DCL EIOP32    FIXED(15) CONSTANT(32); /* APPLICATION RETRIEVE   @MCA*/         
*DCL EIOP33    FIXED(15) CONSTANT(33); /* OBJECT NAME NOTIFY     @MCA*/         
*DCL EIOP34    FIXED(15) CONSTANT(34); /* Reserved               @L5A*/         
*DCL EIOP35    FIXED(15) CONSTANT(35); /* Cloud Function notify  @L6A*/         
*DCL EIOP41    FIXED(15) CONSTANT(41); /* Unix Path Notification @UXA*/         
*DCL EIOP42    FIXED(15) CONSTANT(42); /* Unix Path Bypass Verify@UXA*/         
*DCL EIOP43    FIXED(15) CONSTANT(43); /* Unix Path Processed    @UXA*/         
*DCL EIOP44    FIXED(15) CONSTANT(44); /* Clone Initialization   @UXA*/         
*DCL EIOP45    FIXED(15) CONSTANT(45); /* Present Attributes     @UXA*/         
*DCL EIMAXOP   FIXED(15) CONSTANT(45); /* MAX VALID EXIT NUMBER  @UXC*/         
*DCL EXITRECL  FIXED(15) CONSTANT(48);    /* EXIT RECORD LEN @NA08383*/         
*/********************************************************************/         
*/*         Constants for Serialization error actions            @STA*/         
*/********************************************************************/         
*Dcl EISRLNONE  Fixed(8)  Constant(0);     /* Use None           @STA*/         
*Dcl EISRLDB2   Fixed(8)  Constant(1);     /* Use DB2            @STA*/         
*Dcl EISRLZFS   Fixed(8)  Constant(2);     /* Use ZFS            @STA*/         
*Dcl EISRLCICS  Fixed(8)  Constant(3);     /* Use CICS           @STA*/         
*Dcl EISRLEXIT  Fixed(8)  Constant(4);     /* Use user exit      @STA*/         
*DCL 1 ADREIB  BASED(ADREIB@) BDY(WORD,3),                                      
*      2 EIDLLEN        FIXED (15), /* LENGTH OF ADREIB - 2      @V22*/         
*      2 EIID           CHAR (4),   /* BLOCK IDENTIFIER EBCDIC "EIDB"*/         
*      2 EITSKID        FIXED (31), /* TASK ID NUMBER                */         
*      2 EIXALLOW       BIT   (32), /* USER EXIT ALLOWANCE OPTIONS   */         
*        3 EIXALOW0     BIT   (8),  /* ALLOWANCE OPTION BYTE 1       */         
*          4 EIXREP     BIT   (1),  /* ALLOW REPLACE OF RECORD       */         
*          4 EIXINS     BIT   (1),  /* ALLOW INSERTION OF RECORD     */         
*          4 EIXDEL     BIT   (1),  /* ALLOW DELETION OF RECORD      */         
*          4 EIXMOD     BIT   (1),  /* ALLOW MODIFICATION OF RECORD  */         
*          4 EIXDIS     BIT   (1),  /* ALLOW DISCONNECT OF EXIT      */         
*          4 EIXWTOR    BIT   (1),  /* ALLOW WTOR RESPONSE           */         
*          4 EIXSTAT    BIT   (1),  /* ALLOW SELECTION OF USER STATS */         
*          4 EIXTERM    BIT   (1),  /* ALLOW FUNCTION TERMINATION@V22*/         
*        3 EIXALOW1     BIT   (8),  /* ALLOWANCE OPTION BYTE 2       */         
*          4 EIXTDSET   BIT   (1),  /* ALLOW DATA SET TERMINATION@V25*/         
*          4 *          BIT   (7),  /* UNUSED                        */         
*        3 EIXALOW2     BIT   (8),  /* ALLOWANCE OPTION BYTE 3       */         
*          4 *          BIT   (8),  /* RESERVED                      */         
*        3 EIXALOW3     BIT   (8),  /* ALLOWANCE OPTION BYTE 4       */         
*          4 EIXERR     BIT   (1),  /* DISALLOWED OPTION ATTEMPTED   */         
*          4 *          BIT   (7),  /* RESERVED                      */         
*      2 EIOPTION       FIXED (15), /* PROCESSING OPTION             */         
*      2 EIRETCOD       FIXED (15), /* EXIT RETURN CODE              */         
*      2 EIRECALN       FIXED (31), /* RECORD AREA LENGTH            */         
*      2 EIRECLEN       FIXED (31), /* ORIGINAL RECORD LENGTH        */         
*      2 EIRECPTR       PTR   (31), /* ORIGINAL RECORD ADDRESS       */         
*      2 EIUSEPTR       PTR   (31), /* USER DATA AREA ADDRESS   @V22G*/         
*      2 EIDDID         PTR   (31), /* EIOP06 DDNAME/VOLID PTR  @V22G*/         
*        3 EIXMWPL      PTR   (31), /* EIOP11 WTO PLIST PTR  @OA17350*/         
*      2 EIXFLAGS       BIT  (32),  /* OTHER FLAGS           @LA09760*/         
*        3 EIXFLAG0     BIT   (8),  /* FLAG BYTE 0           @LA09760*/         
*          4 EIXABEND   BIT   (1),  /* FOR EIOP02 ONLY, 1=MESSAGE IS            
*                       ADR013 INDICATING AN ABEND CONDITION @LA09760*/         
*          4 EIXNTERR   BIT   (1),  /* FOR EIOP02 ONLY, 1=MESSAGE IS            
*                       TYPE 'E' AND IS NOT 324 OR 347       @LA09760*/         
*          4 EIXWNGOK   BIT   (1),  /* FOR EIOP14 ONLY, 1=WARNING MSGS          
*                       WERE ISSUED AND NONE ARE FATAL       @LA54862*/         
*          4 EIXTRKER   BIT   (1),  /* TRACK IS IN ERROR     @OW07425*/         
*          4 *          BIT   (4),  /* RESERVED              @OW07425*/         
*        3 EIXFLAG1     BIT   (8),  /* FLAG BYTE 1           @LA09760*/         
*          4 EIXTRC32   BIT   (1),  /* UIM SET EIRETCOD 32   @OW33495*/         
*          4 *          BIT   (1),  /* RESERVED              @OW13783*/         
*          4 EIXTDUMS   BIT   (1),  /* DUMMY SOURCE TAPE     @OW13783*/         
*          4 EIXTDUMT   BIT   (1),  /* DUMMY TARGET TAPE     @OW13783*/         
*          4 EIXTISXM   BIT   (1),  /* APPL USING XMAPI      @OW13783*/         
*          4 EIXDASYS   BIT   (1),  /* XMAPI ALLOCATION ERR  @OW21750*/         
*          4 EIXTWERR   BIT   (1),  /* XMAPI TAPE WRITE ERR  @OW22314*/         
*          4 EIXTRERR   BIT   (1),  /* XMAPI TAPE READ ERR   @OW22673*/         
*        3 EIXFLAG2     BIT   (8),  /* FLAG BYTE 2               @03C*/         
*        3 EIXFLAG3     BIT   (8),  /* FLAG BYTE 3           @LA09760*/         
*          4 *          BIT   (8),  /* RESERVED              @LA09760*/         
*      2 *              CHAR  (0)   /* FORCE SIZE OF CONTROL BLOCK TO*/         
*        BDY(WORD);                 /* WORD BOUDARY                  */         
*DCL EIDBLEN FIXED (31) CONSTANT(LENGTH(ADREIB)); /* LENGTH OF BLOCK */         
*/********************************************************************/         
*/* RECORD PRESENTED BY EXIT 06 (WRITE PHYSICAL TAPE):       @OW34887*/         
*/* EIDDINFO IS BASED ON (EIDDID).                           @OW34887*/         
*/********************************************************************/         
*DCL 1 EIDDINFO BASED(EIDDID),      /* UIM-06 INFO            @V22AEG*/         
*      2 EIDDNAME       CHAR (8),   /* O/P DEVICE DDNAME      @V22AEG*/         
*      2 EIVOLID        CHAR (6),   /* O/P VOLSER             @V22AEG*/         
*      2 EIRETC         FIXED (8),  /* RESERVED FOR RETCODE   @V22AEG*/         
*      2 EI06FLGS       FIXED (8),  /* EXIT 06 FLAGS          @V22AEG*/         
*        3 EI06FTLR     BIT   (1),  /* RESERVED FOR HSM USE  @OW34887*/         
*        3 EI06THWE     BIT   (1),  /* RESERVED FOR HSM USE      @TPE*/         
*                                   /* OUTPUT DEVICE ENCRYPTS    @TPE*/         
*        3 *            BIT   (6),  /* RESERVED                  @TPE*/         
*      2 EI06DCB@       PTR   (31), /* RESERVED FOR HSM USE  @OW34887*/         
*      2 *              CHAR  (4);  /* RESERVED              @OW34887*/         
*/********************************************************************/         
*/* RECORD PRESENTED BY EXIT 00 (FUNCTION STARTUP):          @OY57120*/         
*/********************************************************************/         
*DCL 1 EIREC00 BASED(EIRECPTR),                    /*            @NVC*/         
*      2 EI00SBPL FIXED(8),         /* SHARED SUBPOOL NUMBER @OY57120*/         
*      2 EI00FLGS BIT(8),           /* startup flags         @OW20023*/         
*        3 EI00SENQ BIT(1),         /* short VTOC enqueue    @OW20023*/         
*        3 EI00NONF BIT(1),         /* 1 = Don't allow IGWNOTIF call            
*                                    0 = Allow IGWNOTIF call @OW28223*/         
*        3 EI00NOLK BIT(1),         /* 1= NO ADRLOCK ENQ/DEQ @OW42942*/         
*        3 EI00NENQ BIT(1),         /* 1= NO INPUT VOLUME                       
*                                      SERIALIZATION.                           
*                                      VALID DURING PHYSICAL COPY AND           
*                                      DUMP FUNCTION STARTUPS    @ALF*/         
*        3 EI00BSEC BIT(1),         /* 1= BYPASS SECURITY VERIFICATION.         
*                                      VALID DURING COPY FULL/TRACKS,           
*                                      DUMP FULL/TRACKS, AND RESTORE            
*                                      FULL/TRACKS FUNCTION STARTUPS,           
*                                      UNIX PATH DUMP/RESTORE                   
*                                                                @UXC*/         
*        3 EI00MVOLRECOV BIT(1),    /* 1=CALLER IS PERFORMING A MULTI           
*                                      VOLUME RECOVERY USING PHYSICAL           
*                                      DATA SET RESTORE AND IT IS               
*                                      ACCEPTABLE FOR DFSMSDSS TO               
*                                      SCRATCH PREALLOCATED TARGET              
*                                      DATA SETS THAT ARE NOT THE               
*                                      CORRECT SIZE              @PDC*/         
*        3 EI00BSER BIT(1),         /* 1=BYPASS SERIALIZATION OF THE            
*                                      DATA SETS BEING RESTORED DURING          
*                                      A PHYSICAL DATA SET RESTORE              
*                                      OPERATION                 @PDC*/         
*        3 EI00_NOEXCL_NSPLOCK BIT(1), /* 1=BYPASS EXCLUSIVE ADRLOCK            
*                                      NONSPEC ENQ               @A1C*/         
*      2 EI00SVOL   CHAR(6),        /* SOURCE VOLSER. VALID DURING              
*                                      COPY FULL/TRACKS, DUMP FULL/             
*                                      TRACKS, AND RESTORE FULL/TRACKS          
*                                      FUNCTION STARTUPS.                       
*                                      FOR RESTORE, THIS FIELD CONTAINS         
*                                      VOLSER OF THE INPUT VOLUME               
*                                      WHERE THE DUMP DATA SET                  
*                                      RESIDES               @OA05056*/         
*      2 EI00FLG2  CHAR(1),         /* 2ND FLAG AREA             @XES*/         
*        3 EI00SWNCRYPT BIT(1),     /* SOFTWARE ENCRYPTION WAS   @XES*/         
*                                   /* REQUESTED (RSA OR         @XES*/         
*                                   /* KEYPASSWORD WAS           @XES*/         
*                                   /* SPECIFIED)                @XES*/         
*        3 EI00CANSFE BIT(1),       /* CANCEL SOFTWARE ENCRYPT   @XES*/         
*        3 EI00MIXDEV BIT(1),       /* MIXTURE OF DEVICES PERFORMING            
*                                      AND NOT PERFORMING HARDWARE              
*                                      ENCRYPTION                @XES*/         
*        3 EI00ZCOMP  BIT(1),       /* ZCOMPRESSION ATTEMPTED    @ZCA*/         
*        3 *          BIT(4),       /* RESERVED                  @ZCC*/         
*      2 *            CHAR(3),      /* RESERVED                  @P4A*/         
*      2 EI00CIRBA_DA FIXED(32),    /* RBA OF VVR CI DATA/NONVSM @NVA*/         
*      2 EI00CIRBA_IX FIXED(32);    /* RBA OF VVR CI INDEX       @NVA*/         
*/********************************************************************/         
*/* THE FOLLOWING MAPS THE RECORD PRESENTED BY EXIT 14:      @LA65381*/         
*/* DSS MESSAGE NUMBER ASSOCIATED WITH NON ZERO RETCODE      @LA65381*/         
*/********************************************************************/         
*DCL                                                                            
*    1 EIREC14 BASED(EIRECPTR),                                                 
*      2 EI14RC        CHAR   (4),     /* DSS RETURN CODE    @LA65381*/         
*      2 EI14MESS      CHAR   (4),     /* DSS MESSAGE        @LA65381*/         
*        3 EI14MNUM    CHAR   (3),     /*  MESSAGE NUMBER    @LA65381*/         
*        3 EI14MTYP    CHAR   (1),     /*  MESSAGE TYPE      @OW13783*/         
*      2 EI14CPUT      CHAR   (8),     /* DSS CPU TIME           @ZCC*/         
*      2 EI14ZCSV      FIXED  (8),     /* ZCOMPRESS % SAVED      @ZCA*/         
*        3 EI14TCT_CSAVE FIXED(8),     /* TCT COMPRESS % SAVED   @02A*/         
*      2 *             CHAR  (15);     /* UNUSED                 @ZCA*/         
*/********************************************************************/         
*/* THE FOLLOWING MAPS THE RECORD PRESENTED BY EXIT 20: VOLUME   @V24*/         
*/* NOTIFICATION EXIT.                                           @V24*/         
*/********************************************************************/         
*DCL                                                                            
*    1 EIREC20 BASED(EIRECPTR),                                                 
*      2 EI20DSN       CHAR   (44),    /* DATA SET NAME/CLUSTER NAME            
*                                                                @V24*/         
*      2 EI20FLGS      BIT     (8),    /* SOME FLAGS:            @V24*/         
*        3  EI20VSAM   BIT     (1),    /* 1=DATA SET IS VSAM                    
*                                         0=DATA SET IS NONVSAM  @V24*/         
*        3  EI20RACF   BIT     (1),    /* 1=DATA SET IS PROTECTED BY A          
*                                         DISCRETE RACF PROFILE  @V24*/         
*        3  EI20LVOL   BIT     (1),    /* 1=LAST VOLUME INDICATOR               
*                                         ON FOR NON-VSAM DS     @PDC*/         
*        3  E20F9ATT   BIT     (1),    /* F9 ATTRS LOST FLAG     @P0A*/         
*        3  *          BIT     (4),    /* RESERVED           @K180724*/         
*      2 *             CHAR    (1),    /* RESERVED               @V24*/         
*      2 EI20DA#       FIXED   (8),    /* NUMBER OF DATA COMPONENTS             
*                                                                @V24*/         
*      2 EI20IX#       FIXED   (8),    /* NUMBER OF INDEX COMPONENTS            
*                                         (0 IF NONVSAM)         @V24*/         
*      2 EI20DA@       PTR    (31),    /* POINTER TO DATA COMPONENT             
*                                         INFO FOR VSAM/DATA SET                
*                                         INFO FOR NONVSAM       @V24*/         
*      2 EI20IX@       PTR    (31),    /* POINTER TO INDEX COMPONENT            
*                                         INFO FOR VSAM/0 FOR NONVSAM           
*                                                                @PDC*/         
*      2 *             FIXED  (15),    /* PADDING (UNUSED)       @PDC*/         
*                                      /* THE EI20SCNT, EI20DSHA,               
*                                         AND EI20ISHA FIELDS ARE               
*                                         PROVIDED WHEN PROCESSING              
*                                         THE FIRST VOLUME OF A MULTI           
*                                         VOLUME DATA SET        @PDC*/         
*      2 EI20SCNT      FIXED  (15),    /* TOTAL STRIPE COUNT FOR                
*                                         THIS VSAM DATA SET     @PDC*/         
*      2 EI20DSHA      FIXED  (32),    /* VSAM DATA COMPONENT                   
*                                         HIGH ALLOCATED RBA CNT @PDC*/         
*      2 EI20ISHA      FIXED  (32);    /* VSAM INDEX COMPONENT                  
*                                         HIGH ALLOCATED RBA CNT @PDC*/         
*/********************************************************************/         
*/* FOR A NONVSAM DATA SET, EI20DA@ WILL POINT TO A SINGLE       @V24*/         
*/* EI20DSI STRUCTURE.  FOR A VSAM CLUSTER, EI20DA@ POINTS TO AN @V24*/         
*/* ARRAY OF STRUCTURES (ONE FOR EACH DATA COMPONENT), AND       @V24*/         
*/* EI20IX@ POINTS TO A SIMILAR ARRAY FOR THE INDEX COMPONENTS   @V24*/         
*/********************************************************************/         
*DCL                                                                            
*    1 EI20DSI BASED,                  /* DATA SET INFO          @V24*/         
*      2 EI20CON       CHAR   (44),    /* COMPONENT NAME (BLANKS FOR            
*                                         NONVSAM)               @V24*/         
*      2 EI20NVOL      FIXED  (16),    /* # OF VOLUMES IN DS     @V24*/         
*      2 *             CHAR    (2),    /* RESERVED               @V24*/         
*      2 EI20VLI,                      /* VOLUME INFORMATION  @KUI406*/         
*        3  EI20VOL    CHAR    (6),    /* VOLSER                 @V24*/         
*        3  E20DSTP#   FIXED  (15),    /* STRIPE NUMBER FOR THE                 
*                                         DATA COMPONENT. 0 FOR                 
*                                         NON-STRIPED DATA SETS  @PDC*/         
*        3  EI20RBA    FIXED  (32),    /* RBA TOKEN                             
*                                                                @V24*/         
*                                      /* THE EI20DRBA FIELD IS                 
*                                         CALCULATED BY SUBTRACTING             
*                                         THE HIGH RBA FIELDS                   
*                                         FROM THE LOW RBA FLDS. @PDC*/         
*        3  EI20DRBA   FIXED  (32),    /* TOTAL NUMBER OF RBAS                  
*                                         PROCESSED FOR THIS                    
*                                         COMPONENT              @PDC*/         
*        3  EI20VLSQ   FIXED  (15),    /* VOLUME SEQUENCE NUMBER                
*                                         FOR THE DATA SET       @PDC*/         
*        3  *          FIXED  (15);    /* UNUSED                 @PDC*/         
*/********************************************************************/         
*/* THE FOLLOWING MAPS THE RECORD PRESENTED BY EXIT 21:          @V25*/         
*/*    DATA SET VERIFICATION EXIT                                @V25*/         
*/********************************************************************/         
*DCL                                                                            
*    1 EIREC21 BASED(EIRECPTR),                               /* @V25*/         
*      2 EI21DSN       CHAR   (44);    /* DATA SET/CLUSTER NAME  @V25*/         
*/********************************************************************/         
*/* THE FOLLOWING MAPS THE RECORD PRESENTED BY EXIT 22:          @V25*/         
*/*    BYPASS VERIFICATION EXIT                                  @V25*/         
*/********************************************************************/         
*DCL                                                                            
*    1 EIREC22 BASED(EIRECPTR),                               /* @V25*/         
*      2 EI22DSN       CHAR   (44),    /* DATA SET/CLUSTER NAME  @V25*/         
*      2 EI22FLGS      BIT     (8),    /* EXIT 22 FLAGS:         @V25*/         
*        3  EI22BSER   BIT     (1),    /* 1=BYPASS                              
*                                           SERIALIZATION        @V25*/         
*        3  EI22BSEC   BIT     (1),    /* 1=BYPASS DATASET LEVEL,               
*                                           STORCLAS & MGMTCLAS                 
*                                           SECURITY CHECKS. ALSO               
*                                           BYPASS JES3 INTEGRITY               
*                                           CHECKS AND DO NOT CREATE            
*                                           DISCRETE DATASET PROFILES.          
*                                                            @OY60302*/         
*        3  EI22BMIG   BIT     (1),    /* 1=TOLERATE MIGRATED VOLSER            
*                                           FOR NONVSAM DSETS                   
*                                           (RESTORE ONLY)     @DS007*/         
*        3  EI22NSYS   BIT     (1),    /* BYPASS SYSDSN ENQ       @L4A          
*                                        SWAPPED W/ EI22SIRS @OW01655*/         
*        3  EI22LIKE   BIT     (1),    /* RESTORE/COPY DATA SET TO              
*                                         A LIKE DEVICE TYPE @LA71949*/         
*        3  EI22EXTR   BIT     (1),    /* RESTORE DATA SET TO EXTENT            
*                                         REDUCTION VOLUME   @NA06820*/         
*        3  EI22SIRS   BIT     (1),    /* SET INCMPLT RECALL @OW01655           
*                                        SWAPPED W/ EI22NSYS @OW01655*/         
*        3  EI22DB2    BIT     (1),    /* SET DB2 FLAG IN A  @OW45048           
*                                        RENAME              @OA17350*/         
*/********************************************************************/         
*/* THE FOLLOWING WERE REMOVED FROM THE MAP OF THE RECORD    @OY62462*/         
*/*   PRESENTED TO EXIT 22 BUT ARE NOW USED                  @OY62462*/         
*/********************************************************************/         
*      2 EI22SFLG,                   /* SOURCE DATA SET FLGS @OY62462*/         
*        3 E22SSMSF    CHAR    (1),  /* SOURCE SMS FLAGS                        
*                                                            @OY62462*/         
*        3 E22SDSRG    CHAR    (2),  /* SOURCE DATA SET ORG                     
*                                                            @OY62462*/         
*        3 E22SVFLG    BIT    (16),  /* SRCE VSAM DSET FLAGS @OY62462*/         
*          4 E22SESDS  BIT     (1),  /* 1=ESDS DATA SET      @OY62462*/         
*          4 E22SKSDS  BIT     (1),  /* 1=KSDS DATA SET      @OY62462*/         
*          4 E22SKRDS  BIT     (1),  /* 1=KRDS DATA SET      @OY62462*/         
*          4 E22SLDS   BIT     (1),  /* 1=LINEAR DATA SET    @OY62462*/         
*          4 E22SRRDS  BIT     (1),  /* 1=RRDS DATA SET      @OY62462*/         
*          4 E22SPSSI  BIT     (1),  /* 1=PAGE/SWAP/STGINDEX, ETC.   */         
*                                    /* UNSUPPRTED DATA SETS @OY62462*/         
*          4 E22SVVDS  BIT     (1),  /* 1=VVDS DATA SET      @OY62462*/         
*          4 E22SBCS   BIT     (1),  /* 1=BCS DATA SET       @OY62462*/         
*          4 E22SAIX   BIT     (1),  /* 1=AIX DATA SET       @OY62462*/         
*          4 E22SVRRD  BIT     (1),  /* VRRDS DATASET        @OY62462*/         
*          4 *         BIT     (6),  /* RESERVED             @OY62462*/         
*      2 EI22FLG2      BIT     (8),  /* MORE EXIT 22 FLAGS       @RLS*/         
*        3  EI22RSET   BIT     (1),  /* RESET DS CHANGED FLAG    @RLS*/         
*        3  EI22SSYS   BIT     (1),  /* GET SHARED SYSDSN ENQ    @RLS*/         
*        3  EI22RRB    BIT     (1),  /* MARK TGT RECOVRY REQ'D   @RLS*/         
*        3  EI22LINF   BIT     (1),  /* LOG INFO PASSED, SEE                    
*                                       EI22LPRM AND EI22LSID    @RLS*/         
*        3  EI22BWOP   BIT     (1),  /* BWO_ALLOWED PASSED, SEE                 
*                                       EI22BWOA                 @RLS*/         
*        3  EI22IMS    BIT     (1),  /* TYPE=TYPEIMS PROCESS @OW15980*/         
*        3  EI22BWOE   BIT     (1),  /* ENQ ON BWODSN ONLY,  @OW15980*/         
*                                    /* NO ADR OR SYS ENQ'S  @OW15980*/         
*        3  EI22_BYPASS_SOURCE_SER   /* BYPASS SOURCE SERIALIZAT @BPA*/         
*                      BIT     (1),  /* - EI22BSER HAS PRECEDENCE@BPC*/         
*      2 EI22LPRM      CHAR    (1),  /* LOG PARAMETER FOR TGT    @RLS*/         
*      2 EI22LSID      CHAR   (26),  /* LOG STREAM ID FOR TGT    @RLS*/         
*      2 EI22FLG3      BIT     (8),  /* MORE EXIT 22 FLAGS       @RLS*/         
*        3 EI22BWOA    BIT     (4),  /* BWO_ALLOWED              @RLS*/         
*        3 EI22BRLS    BIT     (1),  /* bypass RLS quiesce    @RLSCDS*/         
*        3 EI22SFSM    BIT     (1),  /* set reconnectable flag   @FSM*/         
*        3 EI22LREP    BIT     (1),  /* set LOGREPLICATE flag    @LRA*/         
*        3 EI22BRBK    BIT     (1),  /* bypass reblocking        @A2A*/         
*      2 EI22DSSRL     FIXED   (8),  /* DATA SET SERIALIZATION                  
*                                       ERROR ACTION             @STA*/         
*      2 EI22ACSEN     CHAR    (8),  /* ACS ENVIRONMENT          @STA*/         
*      2 EI22SGP       PTR    (31),  /* STORAGE GROUP LIST PTR   @STA*/         
*      2 *             CHAR   (32);  /* AVAILABLE                @STA*/         
*/********************************************************************/         
*/* RECORD PRESENTED BY EXIT 22 (BYPASS VERIFICATION):           @STA*/         
*/* EISGLIST IS BASED ON (EI22SGP).                              @STA*/         
*/********************************************************************/         
*DCL 1 EISGLIST BASED(EI22SGP),   /* UIM-22 storage group list   @STA*/         
*       5 EISGHDR,                /* Storage group list header   @STA*/         
*         7 EISGCNT FIXED(8),     /* Number of storage group     @STA*/         
*                                 /* list entries                @STA*/         
*         7 *       CHAR(3),      /* For alignment               @STA*/         
*       5 EISGENT(15),            /* Storage group entry array   @STA*/         
*         7 EISGLEN FIXED(15),    /* length of storage group     @STA*/         
*                                 /* name                        @STA*/         
*         7 EISGNAM CHAR(30);     /* Name of storage group       @STA*/         
*/********************************************************************/         
*/* THE FOLLOWING MAPS THE RECORD PRESENTED BY EXIT 23:          @V25*/         
*/*    DATA SET PROCESSED NOTIFICATION EXIT                      @V25*/         
*/********************************************************************/         
*DCL                                                                            
*    1 EIREC23 BASED(EIRECPTR),                               /* @V25*/         
*     2 EI23CNST,                      /* CONSTANT LENGTH                       
*                                         PORTION OF CONTROL BLK @V26*/         
*      3 EI23DSN       CHAR   (44),    /* DATA SET/CLUSTER NAME  @V25*/         
*      3 EI23NEWN      CHAR   (44),    /* NEW DSET/CLUSTER NAME  @V25*/         
*      3 EI23DSRC      FIXED  (15),    /* RETURN CODE FOR DATA                  
*                                         SET PROCESSING         @V25*/         
*      3 EI23SFLG,                     /* SOURCE DATA SET FLAGS  @V25*/         
*        4 E23SSMSF    CHAR    (1),    /* SOURCE SMS FLAGS                      
*                                                                @V25*/         
*        4 E23SDSRG    CHAR    (2),    /* SOURCE DATA SET ORG                   
*                                                                @V25*/         
*        4 E23SVFLG    BIT    (16),    /* SOURCE VSAM DSET FLAGS @V25*/         
*          5 E23SESDS  BIT     (1),    /* 1=ESDS DATA SET        @V25*/         
*          5 E23SKSDS  BIT     (1),    /* 1=KSDS DATA SET        @V25*/         
*          5 E23SKRDS  BIT     (1),    /* 1=KRDS DATA SET        @V25*/         
*          5 E23SLDS   BIT     (1),    /* 1=LINEAR DATA SET      @V25*/         
*          5 E23SRRDS  BIT     (1),    /* 1=RRDS DATA SET        @V25*/         
*          5 E23SPSSI  BIT     (1),    /* 1=PAGE/SWAP/STGINDEX, ETC.            
*                                         UNSUPPORTED DATA SETS  @V25*/         
*          5 E23SVVDS  BIT     (1),    /* 1=VVDS DATA SET        @V25*/         
*          5 E23SBCS   BIT     (1),    /* 1=BCS DATA SET         @V25*/         
*          5 E23SAIX   BIT     (1),    /* 1=AIX DATA SET         @V25*/         
*          5 E23BCSEL  BIT     (1),    /* 1=BASE CLUSTER SELECTED               
*                                                            @LA82401*/         
*          5 E23SVRRD  BIT     (1),    /* VRRDS DATASET      @LA82401*/         
*          5 EI23RRB   BIT     (1),    /* RECOVERY REQUIRED      @RLS*/         
*          5 *         BIT     (4),    /* UNUSED                 @RLS*/         
*      3 EI23TFLG,                     /* TARGET DATA SET FLAGS  @V25*/         
*        4 E23TSMSF    CHAR    (1),    /* TARGET SMS FLAGS                      
*                                                                @V25*/         
*        4 E23TDSRG    CHAR    (2),    /* TARGET DATA SET ORG                   
*                                                                @V25*/         
*        4 E23TVFLG    BIT    (16),    /* TARGET VSAM DSET FLAGS @V25*/         
*          5 E23TESDS  BIT     (1),    /* 1=ESDS DATA SET        @V25*/         
*          5 E23TKSDS  BIT     (1),    /* 1=KSDS DATA SET        @V25*/         
*          5 E23TKRDS  BIT     (1),    /* 1=KRDS DATA SET        @V25*/         
*          5 E23TLDS   BIT     (1),    /* 1=LINEAR DATA SET      @V25*/         
*          5 E23TRRDS  BIT     (1),    /* 1=RRDS DATA SET        @V25*/         
*          5 E23TPSSI  BIT     (1),    /* 1=PAGE/SWAP/STGINDEX, ETC.            
*                                         UNSUPPORTED DATA SETS  @V25*/         
*          5 E23TVVDS  BIT     (1),    /* 1=VVDS DATA SET        @V25*/         
*          5 E23TBCS   BIT     (1),    /* 1=BCS DATA SET         @V25*/         
*          5 E23TAIX   BIT     (1),    /* 1=AIX DATA SET         @V25*/         
*          5 E23TVRRD  BIT     (1),    /* VRRDS DATASET      @LA82401*/         
*          5 *         BIT     (6),    /* RESERVED           @OA16588*/         
*      3 EI23RLST,                     /* RLS TIME STAMPS        @RLS*/         
*        4 EI23GMT     CHAR    (8),    /* RLS GMT TIME STAMP     @RLS*/         
*        4 EI23LOC     CHAR    (8),    /* RLS LOCAL TIME STAMP   @RLS*/         
*      3 E23BYTES      CHAR    (8),    /* TOTAL TRACK BYTES RESTORED,           
*                                         COPIED, OR DUMPED  @OW25343*/         
*      3 E23FLGS       CHAR    (1),    /* MISC FLAGS         @OW11555*/         
*          5 E23BSET   BIT     (1),    /* 1=E23BYTES SET     @OW11555*/         
*          5 E23BPDS   BIT     (1),    /* 1=BROKEN PDS       @K131935*/         
*          5 E23BPSE   BIT     (1),    /* E23BYTES IS FOR PSE@OW25343*/         
*          5 E23F9ATT  BIT     (1),    /* F9 ATTRIBS NOT RESTD   @P0A*/         
*          5 *         BIT     (4),    /* AVAILABLE FOR USE      @P0C*/         
*      3 EI23DNAM      CHAR    (6),    /* NAME OF DEVICE NEEDED                 
*                                         TO DO NOPACKING FOR THE               
*                                         BROKEN PDS (I.E. A LIKE               
*                                         DEVICE)            @K131935*/         
*      3 *             CHAR    (9),    /* RESERVED           @K131935*/         
*      3 EI23VOL#      FIXED   (8),    /* NUMBER OF VOLUMES      @V25*/         
*      2 EI23VSER(*)   CHAR    (6);    /* VOLSER ARRAY           @V25*/         
*/********************************************************************/         
*/* THE FOLLOWING MAPS THE RECORD PRESENTED BY EXIT 24:          @V26*/         
*/*    CONCURRENT COPY INITIALIZATION COMPLETE                   @V26*/         
*/********************************************************************/         
*DCL                                                                            
*    1 EIREC24 BASED(EIRECPTR),                               /* @V26*/         
*      2 EI24RTCD      FIXED  (16),    /* RETURN CODE            @V26*/         
*      2 EI24RSCD      FIXED  (16),    /* REASON CODE            @V26*/         
*      2 *             FIXED  (32),    /* RESERVED               @V26*/         
*      2 EI24VOL       CHAR   (6),     /* VOLUME SERIAL          @V26*/         
*      2 EI24DSN       CHAR   (44),    /* DATA SET NAME          @V26*/         
*      2 EI24FLGS      BIT     (8),    /* FLAGS                  @RLS*/         
*        3 EI24RSET    BIT     (1),    /* DS CHANGE FLAG RESET   @RLS*/         
*        3 E24SAIX     BIT     (1),    /* 1=AIX DATA SET         @IBC*/         
*        3 E24BCSEL    BIT     (1),    /* 1=BASE CLUSTER SELECTD @IBC*/         
*        3 *           BIT     (5),    /* UNUSED                 @IBC*/         
*      2 *             CHAR   (24);    /* AVAILABLE              @RLS*/         
*/********************************************************************/         
*/* THE FOLLOWING MAPS THE RECORD PRESENTED BY EXIT 26:      @OW15980*/         
*/*    DUMP OUTPUT VOLUME MOUNT NOTIFICATION EXIT            @OW15980*/         
*/********************************************************************/         
*DCL                                                                            
*    1 EIREC26 BASED(EIRECPTR),        /*                    @OW15980*/         
*      2 EI26TYPE BIT(32),             /* EXIT TYPE          @OW15980*/         
*        4 EI26VOL BIT(1),     /* OUTPUT VOLUME NOTIFICATION @OW15980*/         
*        4 EI26TERM BIT(1),    /* OUTPUT VOLUME TERMINATED   @OW15980*/         
*        4 EI26R0CE BIT(1),    /* BWO R0 COUNT ERROR         @OW15980*/         
*        4 EI26VCLO BIT(1),    /* output volume close - only                    
*                                 for DASD outputs during                       
*                                 logical dump operations    @OW57536*/         
*        4 EI26THWE BIT(1),    /* TAPE DEVICE WILL BE                           
*                                 ENCRYPTING DATA IN HARDWARE    @TPE*/         
*        4 *         BIT(27),  /* RESERVED FOR EXPANSION         @TPE*/         
*      2 EI26DSN   CHAR(64),   /* DSNAME IF EI26R0CE = '1'B  @OW15980*/         
*      2 EI26DSNL  FIXED(8),   /* LENGTH OF DSNAME           @OW15980*/         
*      2 *         FIXED(24),  /* RESERVED FOR ALIGNMENT     @OW15980*/         
*      2 EI26DDN   CHAR(8),    /* output dd name if EI26VOL,                    
*                                 EI26TERM, or EI26VCLO set  @OW57536*/         
*      2 EI26VSER  CHAR(6),    /* VOLSER - present if EI26VOL,                  
*                                 EI26TERM, or EI26VCLO set  @OW57536*/         
*      2 *         CHAR(2),    /* RESERVED FOR ALIGNMENT     @OW15980*/         
*      2 EI26VTRC  FIXED(32),  /* return code for volume                        
*                                 term and volume close      @OW57536*/         
*      2 * CHAR(96);           /* RESERVED FOR EXPANSION     @OW15980*/         
*/********************************************************************/         
*/* THE FOLLOWING MAPS THE RECORD PRESENTED BY EXIT 27:          @PDC*/         
*/*    PHYSICAL DATA SET PROCESSED NOTIFICATION EXIT             @PDC*/         
*/********************************************************************/         
*DCL                                                                            
*    1 EIREC27 BASED(EIRECPTR),                               /* @PDC*/         
*     2 EI27CNST,                      /* CONSTANT LENGTH                       
*                                         PORTION OF CONTROL BLK @PDC*/         
*      3 EI27DSN       CHAR   (44),    /* DATA SET/CLUSTER NAME  @PDC*/         
*      3 EI27NEWN      CHAR   (44),    /* NEW DSET/CLUSTER NAME  @PDC*/         
*      3 EI27DSRC      FIXED  (15),    /* RETURN CODE FOR DATA                  
*                                         SET PROCESSING         @PDC*/         
*      3 EI27SFLG,                     /* SOURCE DATA SET FLAGS  @PDC*/         
*        4 E27SSMSF    CHAR    (1),    /* SOURCE SMS FLAGS                      
*                                                                @PDC*/         
*        4 E27SDSRG    CHAR    (2),    /* SOURCE DATA SET ORG                   
*                                                                @PDC*/         
*        4 E27SVFLG    BIT    (16),    /* SOURCE VSAM DSET FLAGS @PDC*/         
*          5 E27SESDS  BIT     (1),    /* 1=ESDS DATA SET        @PDC*/         
*                                   /* FOR PHYSICAL DATA SET COPY               
*                                      IF THE SOURCE DATA SET IS A              
*                                      KSDS AND THE VOLUME BEING                
*                                      PROCESSED IS NOT THE PRIMARY             
*                                      VOLUME AND THE INDEX FOR THAT            
*                                      KSDS DOES NOT RESIDE ON THE              
*                                      CURRENT VOLUME BEING PROCESSED,          
*                                      THIS BIT MAY BE ON BECAUSE               
*                                      IT APPEARS TO BE A ESDS                  
*                                                            @K180512*/         
*          5 E27SKSDS  BIT     (1),    /* 1=KSDS DATA SET        @PDC*/         
*          5 E27SKRDS  BIT     (1),    /* 1=KRDS DATA SET        @PDC*/         
*          5 E27SLDS   BIT     (1),    /* 1=LINEAR DATA SET      @PDC*/         
*          5 E27SRRDS  BIT     (1),    /* 1=RRDS DATA SET        @PDC*/         
*          5 E27SPSSI  BIT     (1),    /* 1=PAGE/SWAP/STGINDEX, ETC.            
*                                         UNSUPPORTED DATA SETS  @PDC*/         
*          5 E27SVVDS  BIT     (1),    /* 1=VVDS DATA SET        @PDC*/         
*          5 E27SBCS   BIT     (1),    /* 1=BCS DATA SET         @PDC*/         
*          5 E27SAIX   BIT     (1),    /* 1=AIX DATA SET         @PDC*/         
*          5 E27SVRRD  BIT     (1),    /* VRRDS DATASET          @NVM*/         
*          5 E27BCSEL  BIT     (1),    /* 1=BASE CLUSTER SELECTED               
*                                                                @PDC*/         
*          5 EI27RRB   BIT     (1),    /* RECOVERY REQUIRED      @PDC*/         
*          5 *         BIT     (4),    /* UNUSED                 @PDC*/         
*      3 EI27TFLG,                     /* TARGET DATA SET FLAGS  @PDC*/         
*        4 E27TSMSF    CHAR    (1),    /* TARGET SMS FLAGS                      
*                                                                @PDC*/         
*        4 E27TDSRG    CHAR    (2),    /* TARGET DATA SET ORG                   
*                                                                @PDC*/         
*        4 E27TVFLG    BIT    (16),    /* TARGET VSAM DSET FLAGS @PDC*/         
*          5 E27TESDS  BIT     (1),    /* 1=ESDS DATA SET        @PDC*/         
*                                   /* FOR PHYSICAL DATA SET COPY               
*                                      IF THE SOURCE DATA SET IS A              
*                                      KSDS AND THE VOLUME BEING                
*                                      PROCESSED IS NOT THE PRIMARY             
*                                      VOLUME AND THE INDEX FOR THAT            
*                                      KSDS DOES NOT RESIDE ON THE              
*                                      CURRENT VOLUME BEING PROCESSED,          
*                                      THIS BIT MAY BE ON BECAUSE               
*                                      IT APPEARS TO BE A ESDS                  
*                                                            @K180512*/         
*          5 E27TKSDS  BIT     (1),    /* 1=KSDS DATA SET        @PDC*/         
*          5 E27TKRDS  BIT     (1),    /* 1=KRDS DATA SET        @PDC*/         
*          5 E27TLDS   BIT     (1),    /* 1=LINEAR DATA SET      @PDC*/         
*          5 E27TRRDS  BIT     (1),    /* 1=RRDS DATA SET        @PDC*/         
*          5 E27TPSSI  BIT     (1),    /* 1=PAGE/SWAP/STGINDEX, ETC.            
*                                         UNSUPPORTED DATA SETS  @PDC*/         
*          5 E27TVVDS  BIT     (1),    /* 1=VVDS DATA SET        @PDC*/         
*          5 E27TBCS   BIT     (1),    /* 1=BCS DATA SET         @PDC*/         
*          5 E27TAIX   BIT     (1),    /* 1=AIX DATA SET         @PDC*/         
*          5 E27TVRRD  BIT     (1),    /* VRRDS DATASET          @PDC*/         
*          5 E27TRACF  BIT     (1),    /* 1=DATA SET IS PROTECTED BY            
*                                      DISCRETE RACF PROFILE @OA16588*/         
*          5 *         BIT     (5),    /* RESERVED           @OA16588*/         
*      3 EI27TRKS      CHAR    (8),    /* TOTAL TRACKS COPIED    @PDC*/         
*      3 EI27SVOL      CHAR    (6),    /* SOURCE VOLUME SERIAL   @PDC*/         
*      3 EI27TVOL      CHAR    (6),    /* TARGET VOLUME SERIAL   @PDC*/         
*      3 E27FLGS       CHAR    (1),    /* MISC FLAGS             @PDC*/         
*        4 EI27LVOL    BIT     (1),    /* LAST VOLUME INDICATOR  @PDC*/         
*                                      /* FROM SRC DATA SET      @PDC*/         
*        4 E27F9ATT    BIT     (1),    /* F9 ATTRS LOST          @P0A*/         
*        4 *           BIT     (6),    /* AVAILABLE              @P0C*/         
*      3 *             CHAR    (1),    /* RESERVED               @PDC*/         
*      3 EI27VLSQ      FIXED   (15),   /* VOLUME SEQUENCE NUMBER                
*                                         FROM THE SOURCE DATA                  
*                                         SET                    @PDC*/         
*      3 EI27DSHA      FIXED   (31),   /* VSAM DATA COMPONENT                   
*                                         ALLOCATED RBA COUNT    @PDC*/         
*      3 EI27ISHA      FIXED   (31),   /* VSAM INDEX COMPONENT                  
*                                         HIGH ALLOC RBA COUNT   @PDC*/         
*      3 EI27SCNT      FIXED   (15),   /* VSAM DATA SET STRIPE                  
*                                         COUNT                  @PDC*/         
*      3 E27DSTP#      FIXED   (15),   /* DATA COMPONENT STRIPE                 
*                                         COUNT                  @PDC*/         
*                                  /* THE EI27DRBA AND EI27IRBA FIELDS          
*                                     ARE CALCULATED BY SUBTRACTING             
*                                     THE STARTING RBA FROM THE                 
*                                     ENDING RBA                 @PDC*/         
*      3 EI27DRBA      FIXED   (32),   /* RBAS PROCESSED FOR                    
*                                         THE DATA COMPONENT     @PDC*/         
*      3 EI27IRBA      FIXED   (32),   /* RBAS PROCESSED FOR                    
*                                         THE INDEX COMPONENT    @PDC*/         
*      3 EI27DANM      CHAR    (44),   /* NEW DATA COMP NAME     @HRA*/         
*      3 EI27IXNM      CHAR    (44),   /* NEW INDEX COMP NAME    @HRA*/         
*      3 *             CHAR    (32);   /* RESERVED               @HRC*/         
*/********************************************************************/         
*/* THE FOLLOWING MAPS THE RECORD PRESENTED BY EXIT 28:          @E2A*/         
*/*    TARGET DATA SET ALLOCATION NOTIFICATION EXIT              @E2A*/         
*/********************************************************************/         
*DCL                                                                            
*   1 EIREC28 BASED(EIRECPTR),                               /* @E2A*/          
*    2 EI28PARMS1      CHAR    (4),   /* EXIT 28 PARMS FIELD 1                  
*                                        ANY FIELD SET ON INDICATES             
*                                        THAT FIELD HAS BEEN SPECIFIED          
*                                        BE USED FOR THIS EXIT   @E2A*/         
*     3 EI28EATTRP     BIT     (1),   /* EATTR VALUE PASSED      @E2A*/         
*     3 EI28F9DSCBP    BIT     (1),   /* F9 DSCB PASSED          @E2A*/         
*     3 EI28CREDTP     BIT     (1),   /* CREATION DATE PASSED    @E2A*/         
*     3 EI28RCAP       BIT     (1),   /* CA RECLAIM ATTR PASSED  @CEA*/         
*     3 EI28ZFSP       BIT     (1),   /* LDS defined zFS passed  @01A*/         
*     3 *              BIT     (27),  /* UNUSED                  @01C*/         
*    2 EI28PARMS2      CHAR    (4),   /* EXIT 28 PARMS FIELD 2   @E2A*/         
*     3 *              BIT     (32),  /* UNUSED                  @E2A*/         
*    2 EI28TGTDSN      CHAR    (44),  /* TARGET DATA SET NAME    @E2A*/         
*    2 EI28SRCDSN      CHAR    (44),  /* SOURCE DATA SET NAME    @E2A*/         
*    2 EI28F9DSCB      CHAR    (140), /* FORMAT 9 DSCB           @E2A*/         
*    2 EI28FIELDS1     CHAR    (1),   /* EXIT 28 FIELDS 1                       
*                                       FLAG BYTE FOR BIT FIELDS @E2A*/         
*     3 EI28EATTR      BIT     (2),   /* EATTR VALUE TO BE USED FOR             
*                                        TARGET DATA SET ALLOCATION             
*                                       '00'B = NS (DEFAULT VALUE USED)         
*                                       '01'B = NO                              
*                                       '10'B = OPT              @E2A*/         
*     3 EI28RCA        BIT     (1),   /* CA RECLAIM ATTRIBUTE                   
*                                        0 = CA RECLAIM NOT DISABLED            
*                                        1 = CA RECLAIM DISABLED                
*                                                                @CEA*/         
*     3 EI28ZFS        BIT     (1),   /* LDS defined as zFS                     
*                                        0 = not defined as zFS                 
*                                        1 = LDS defined as zFS  @01A*/         
*     3 *              BIT     (4),   /* UNUSED                  @01C*/         
*    2 EI28CREDT       CHAR    (3),   /* CREATION DATE(DS1CREDT) @E2A*/         
*    2 *               CHAR    (92);  /* SPACE FOR EXPANSION     @E2A*/         
*DCL  EI28EATTR_NS  BIT(2) CONSTANT('00'B); /* EATTR NOT SPECIFIED              
*                                             CONTASTANT        @E2A*/          
*DCL  EI28EATTR_NO  BIT(2) CONSTANT('01'B); /* EATTR NO CONSTANT @E2A*/         
*DCL  EI28EATTR_OPT BIT(2) CONSTANT('10'B); /* EATTR NO CONSTANT @E2A*/         
*/********************************************************************/         
*/*                                                                  */         
*/*             PARAMETER BLOCK FOR UIM EXIT 30                   NVA*/         
*/*                                                                  */         
*/********************************************************************/         
*DCL 1 EIREC30 BASED(EIRECPTR),                                                 
*      2 EI30TRKS        FIXED (32), /* TRACKS REQUIRED          @NVA*/         
*      2 EI30RC          FIXED (15), /* OVERALL RETURN CODE      @NVA*/         
*      2 *               CHAR  (2),  /* UNUSED                   @P4C*/         
*      2 EI30VSER@       PTR   (31); /* PTR TO VOLUME STRUCTURE  @P3C*/         
*DCL 1 EI30VLIST    BASED(EI30VSER@),/* VOLUME LIST              @P4A*/         
*      3 EI30VOL#        FIXED (15), /* NUMBER OF VOLUME ENTRIES @P4M*/         
*      3 *               CHAR  (2),  /* UNUSED                   @P4A*/         
*      3 EI30VOLENT(16),             /* VOLSER ENTRY ARRAY       @P4C*/         
*        5 EI30VSER      CHAR  (6),  /* VOLSER                   @P4C*/         
*        5 EI30VFLG      CHAR  (1),  /* VOLUME FLAGS             @P4C*/         
*          7 EI30ATT     BIT   (1),  /* ALLOCATION ATTEMPTED     @P4C*/         
*          7 EI30USED    BIT   (1),  /* VOLUME USED              @P4C*/         
*          7 *           BIT   (6),  /* UNUSED                   @P4C*/         
*        5 *             CHAR  (1),  /* UNUSED                   @P4C*/         
*        5 EI30VRC       FIXED (31), /* VOLUME RETURN CODE       @P4C*/         
*        5 EI30VRSN      FIXED (31); /* VOLUME REASON CODE       @P4C*/         
*/********************************************************************/         
*/* THE FOLLOWING MAPS THE RECORD PRESENTED BY EXIT 33:          @MCA*/         
*/*    OBJECT NAME NOTIFICATION EXIT                             @MCA*/         
*/********************************************************************/         
*DCL                                                                            
*    1 EIREC33 BASED(EIRECPTR),                               /* @MCA*/         
*     2 EI33CNST,                      /* CONSTANT LENGTH                       
*                                         PORTION OF CONTROL BLK @MCA*/         
*      3 EI33FLGS      CHAR    (2),    /* OBJECT FLAGS           @MCA*/         
*        4 EI33META    BIT     (1),    /* ON=META OBJECT         @MCA*/         
*        4 EI33DATA    BIT     (1),    /* ON=USER DATA OBJECT    @MCA*/         
*        4 EI33TCT_ENCRYPTED BIT(1),   /* ON=TCT ENCRYPTED       @02A*/         
*        4 EI33TCT_COMPRESSED BIT(1),  /* ON=TCT COMPRESSED      @02A*/         
*        4 *           BIT     (12),   /* UNUSED                 @02C*/         
*      3 EI33OBJN      CHAR   (128),   /* OBJECT NAME            @MCA*/         
*      3 EI33OBJL      FIXED   (16),   /* OBJECT NAME LENGTH     @MCA*/         
*      3 *             FIXED   (16),   /* UNUSED                 @MCA*/         
*      3 EI33TRKC      CHAR    (8),    /* TOTAL TRACK STORED     @MCA*/         
*      3 EI33BYTES     CHAR    (8),    /* TOTAL TKS/BYTES STORED @MCA*/         
*      3 *             FIXED   (16),   /* UNUSED                 @MCA*/         
*      3 EI33RTC       FIXED   (15),   /* RC FOR STORING OBJ     @MCA*/         
*      3 EI33BYTES_COMPRESSED CHAR(8), /* COMPRESSED SIZE-ONLY   @02A           
*                       POPULATED WHEN EI33TCT_COMPRESSION=ON    @02A*/         
*     2  *             CHAR    (22);   /* UNUSED                 @02C*/         
*/********************************************************************/         
*/* THE FOLLOWING MAPS THE RECORD PRESENTED BY EXIT 35:          @L6A*/         
*/*    UNIX FILE PATH NOTIFICATION EXIT                          @L6A*/         
*/********************************************************************/         
*DCL                                                                            
*    1 EIREC35 BASED(EIRECPTR),        ]                           @L6A         
*     2 EI35CNST,                      ]  Fixed size area          @L6A         
*      3 EI35FLAG1     FIXED  (16),    ]  Cloud Option Flags       @L6A         
*        4 EI35BYPASS_CREATE_CONTAINER BIT(1), ]1=DO NOT CREATE    @L6A         
*        4 *                           BIT(15),]                   @L6A         
*      3 *             Char   (30);    ]  Available                @L6A         
*/********************************************************************/         
*/* THE FOLLOWING MAPS THE RECORD PRESENTED BY EXIT 41:          @UXA*/         
*/*    UNIX FILE PATH NOTIFICATION EXIT                          @UXA*/         
*/********************************************************************/         
*DCL                                                                            
*    1 EIREC41 BASED(EIRECPTR),                               /* @UXA*/         
*     2 EI41CNST,                      /* CONSTANT LENGTH                       
*                                         PORTION OF CONTROL BLK @UXA*/         
*      3 EI41PATHL     FIXED  (32),    /* LENGTH OF PATH NAME    @UXA*/         
*      3 EI41PATHN     CHAR (1023);    /* PATH NAME              @UXA*/         
*/********************************************************************/         
*/* THE FOLLOWING MAPS THE RECORD PRESENTED BY EXIT 42:          @UXA*/         
*/*    UNIX FILE PATH BYPASS VERIFICATION EXIT                   @UXA*/         
*/********************************************************************/         
*DCL                                                                            
*    1 EIREC42 BASED(EIRECPTR),                               /* @UXA*/         
*     2 EI42CNST,                      /* CONSTANT LENGTH                       
*                                         PORTION OF CONTROL BLK @UXA*/         
*      3 EI42PATHL     FIXED  (32),    /* LENGTH OF PATH NAME    @UXA*/         
*      3 EI42MODE      FIXED  (32),    /* FILE MODE (BPXYMODE)   @UXA*/         
*      3 EI42FLAG1     FIXED   (8),    /* USER OPTIONS 1         @UXA*/         
*        4 EI42RSET    BIT     (1),    /* 1=RESET LAST BACK UP   @UXA*/         
*        4 *           BIT     (7),    /* AVAILABLE              @UXA*/         
*      3 EI42PATHN     CHAR (1023);    /* PATH NAME              @UXA*/         
*/********************************************************************/         
*/* THE FOLLOWING MAPS THE RECORD PRESENTED BY EXIT 43:          @UXA*/         
*/*    UNIX FILE PATH PROCESSED NOTIFICATION EXIT                @UXA*/         
*/********************************************************************/         
*DCL                                                                            
*    1 EIREC43 BASED(EIRECPTR),                               /* @UXA*/         
*     2 EI43CNST,                      /* CONSTANT LENGTH                       
*                                         PORTION OF CONTROL BLK @UXA*/         
*      3 EI43PATHL     FIXED  (32),    /* LENGTH OF PATH NAME    @UXA*/         
*      3 EI43RC        FIXED  (31),    /* PATH RETURN CODE       @UXA*/         
*      3 EI43STAT,                     /* STAT INFO              @UXA*/         
*        4 EI43MODE      FIXED  (32),  /* FILE MODE (BPXYMODE)   @UXA*/         
*        4 EI43LINK      FIXED  (32),  /* NUMBER OF LINKS        @UXA*/         
*        4 EI43UID       FIXED  (31),  /* USER ID OF OWNER       @UXA*/         
*        4 EI43GID       FIXED  (31),  /* GROUP ID OF GROUP      @UXA*/         
*        4 EI43SIZE      CHAR    (8),  /* FILE SIZE IN BYTES     @UXA*/         
*      3 EI43STAT64,                   /* STAT 64BIT TIME FIELDS @UXA*/         
*        4 EI43ATIME64   CHAR    (8),  /* LAST ACCESS TIME 64    @UXA*/         
*        4 EI43MTIME64   CHAR    (8),  /* LAST DATA-MOD TIME 64  @UXA*/         
*        4 EI43CTIME64   CHAR    (8),  /* LAST ATTR-MOD TIME 64  @UXA*/         
*        4 EI43CREAT64   CHAR    (8),  /* CREATION TIME 64       @UXA*/         
*        4 EI43REF64     CHAR    (8),  /* REFERENCE TIME 64      @UXA*/         
*        4 *             CHAR    (8),  /* STAT64 UNUSED          @UXA*/         
*      3 EI43PATHN     CHAR   (1023);  /* PATH NAME              @UXA*/         
*/********************************************************************/         
*/* THE FOLLOWING MAPS THE RECORD PRESENTED BY EXIT 44:          @UXA*/         
*/*    UNIX FILE CLONE INITIALIZATION NOTIFICATION EXIT          @UXA*/         
*/********************************************************************/         
*DCL                                                                            
*    1 EIREC44 BASED(EIRECPTR),                               /* @UXA*/         
*     2 EI44CNST,                      /* CONSTANT LENGTH                       
*                                         PORTION OF CONTROL BLK @UXA*/         
*      3 EI44PATHL     FIXED  (32),    /* LENGTH OF PATH NAME    @UXA*/         
*      3 EI44RETCD     FIXED  (32),    /* RETURN CODE            @UXA*/         
*      3 EI44RSNCD     FIXED  (32),    /* REASON CODE            @UXA*/         
*      3 EI44PATHN     CHAR (1023);    /* PATH NAME              @UXA*/         
*                                   /* Remove EXIT 45 (12 lines) @P6D*/         
