*                                                                       00001000
* %DCL AHLFCXG_INCLUDED CHAR EXT;                                       00002000
* %DEACTIVATE AHLFCXG_INCLUDED;                                         00003000
* %IF AHLFCXG_INCLUDED = '' %THEN                                       00004000
* %DO;                                                                  00005000
*/* Macro made bi-lingual on 21044. CBGEN compile date 20027         */ 00006000
*% /*                                                                   00007000
         MACRO                                                          00008000
         AHLFCXG &DSECT=YES,&LIST=YES,&TITLE=YES,&FCX_DATAPREFIX=YES,  *00009000
               &FCX_TCW_DATA=COND,&FCX_TCCBTIDAW_DATA=COND,            *00010000
               &FCX_TCAHDR_DATA=COND,&FCX_DCW_DATA=COND,               *00011000
               &FCX_DCWCNTL_DATA=COND,&FCX_TCATLR_DATA=COND,           *00012000
               &FCX_STATUS_DATA=COND,&FCX_TIDAW_DATA=COND,             *00013000
               &FCX_DATA_DATA=COND,&FCX_SPLIT_DATA=COND,               *00014000
               &FCX_IOSB_DATA=COND,&FCX_IOBE_DATA=COND,                *00015000
               &FCX_EWA_DATA=COND,&FCX_MSG_DATA=COND                    00016000
         GBLC  &AHLFCXG_INCLUDED                                        00017000
         GBLC  &ZCBPRINT                                                00018000
&AHLFCXG_INCLUDED SETC 'YES'                                            00019000
         AIF   ('&LIST' EQ 'NONE').P0                                   00020000
         AIF   ('&TITLE' EQ 'NO').P5                                    00021000
 TITLE   'AHLFCXG  - FCX Channel Program Trace Record                  *00022000
                '                                                       00023000
.P5      ANOP                                                           00024000
**/ AHLFCXG_1:;                                                         00025000
*/** Start of Specifications ****************************************** 00026000
*                                                                       00027000
* $MAC(AHLFCXG) COMP(SC111):                                            00028000
*                                                                       00029000
* Macro Name: AHLFCXG                                                   00030000
*                                                                       00031000
* Descriptive Name: FCX Channel Program Trace Record                    00032000
*                                                                       00033000
* Acronym: None                                                         00034000
*                                                                       00035000
* Dsect Name: FCXREC                                                    00036000
*                                                                       00037000
* Proprietary Statement:                                                00038000
*  LICENSED MATERIALS - PROPERTY OF IBM                                 00039000
*  5694-A01 COPYRIGHT IBM CORP. 2007, 2021                              00040000
*                                                                       00041000
* Status: HBB77D0                                                       00042000
*                                                                       00043000
* Component: Generalized Trace Facility (SC111)                         00044000
*                                                                       00045000
* Function:                                                             00046000
*                                                                       00047000
*   AHLFCXG maps the record formats used for FCX channel programs.      00048000
*                                                                       00049000
* Notes:                                                                00050000
*  - none                                                               00051000
*                                                                       00052000
* Eye-Catcher: None                                                     00053000
*                                                                       00054000
* Created by: AHLTFCXG                                                  00055000
*                                                                       00056000
* Deleted by: AHLFF09                                                   00057000
*                                                                       00058000
* Pointed to by:                                                        00059000
*  - N/A                                                                00060000
*                                                                       00061000
* Size: See listing                                                     00062000
*                                                                       00063000
* Module Type: Mapping macro                                            00064000
*                                                                       00065000
* Method of Access:                                                     00066000
*                                                                       00067000
*   ASM: N/A                                                            00068000
*                                                                       00069000
*  PL/X: %INCLUDE SYSLIB(AHLFCXG)                                       00070000
*                                                                       00071000
*        If you want a BASED version of the FCX Channel Program         00072000
*        Trace Record, specify the following:                           00073000
*                                                                       00074000
*          %FCXGDEF='BASED(basing expression)'                          00075000
*                                                                       00076000
*        If you do not specify the above parameter, the FCX             00077000
*        Channel Program Trace Record will be generated                 00078000
*        within the module's dynamic area.                              00079000
*                                                                       00080000
*        To set the BASED version of the Variable Data                  00081000
*        Prefix, specify the following:                                 00082000
*                                                                       00083000
*          %PRFXDEF='BASED(basing expression)'                          00084000
*                                                                       00085000
*        To set the BASED version of the Variable Data                  00086000
*        Sections, specify the following:                               00087000
*                                                                       00088000
*          %DATADEF='BASED(basing expression)'                          00089000
*                                                                       00090000
* Dependencies: None                                                    00091000
*                                                                       00092000
* Restrictions: None                                                    00093000
*                                                                       00094000
* Serialization: None                                                   00095000
*                                                                       00096000
* Storage Attributes:                                                   00097000
*  Subpool: Any                                                         00098000
*  Key: 0                                                               00099000
*  Dataspace: N/A                                                       00100000
*  Residency: Any                                                       00101000
*  Frequency: N/A                                                       00102000
*                                                                       00103000
* Distribution Library (DLIB): AMACLIB                           @P1A   00104000
*                                                                       00105000
* External Classification: PI                                    @P1A   00106000
* End of External Classification:                                       00107000
*                                                                       00108000
* Change Activity:                                                      00109000
*                                                                       00110000
* Flag LineItem FMID    Date   ID    Comment                            00111000
*                                                                       00112000
* $L0=IOSHPF   HBB7740 070331 PDON: High Performance FICON              00113000
*                                   Changes flagged by APAR             00114000
*                                   OA19956                             00115000
* $L1=ZDAC     HBB7770 090531 PDSC: Discovery and Autoconfiguration     00116000
* $L2=IOSBIDI  HBB7780 100827 PDMD: Bidirectional high performance      00117000
*                                   FICON support. Changes flagged      00118000
*                                   by APAR OA34149.                    00119000
*                                                                       00120000
* $01=OA19956  HBB7720 080930 PDON: High Performance FICON              00121000
* $02=OA32643  HBB7770 100801 PDSC: TINC support                        00122000
* $03=OA34149  HBB7760 100930 PDMD: Bidirectional high                  00123000
*                                   performance FICON support.          00124000
*                                                                       00125000
* $P1=WI390193 HBB77D0 210111 PDDR: Make macro bilingual and change     00126000
*                                   distlib to AMACLIB                  00127000
*                                                                       00128000
**** End Of Specifications *******************************************/ 00129000
*% /*                                                                   00130000
.P0      ANOP                                                           00131000
         AIF   ('&ZCBPRINT' EQ 'NO').P1                                 00132000
         AIF   ('&LIST' EQ 'YES').P2                                    00133000
.P1      ANOP                                                           00134000
         PUSH  PRINT                                                    00135000
         PRINT OFF                                                      00136000
.P2      ANOP                                                           00137000
         AIF   ('&FCX_DATAPREFIX' EQ 'NO').L0002                        00138000
         AIF   ('&DSECT' EQ 'YES').L0003                                00139000
         AIF   ('&FCX_DATAPREFIX' NE 'YES').L0002                       00140000
.L0003   ANOP                                                           00141000
*                                                                       00142000
* ********************************************************************  00143000
* *                                                                  *  00144000
* * Variable Data Prefix - Following the record header are the       *  00145000
* * different components of the channel program (TCW, DCWs, data,    *  00146000
* * etc.). Each of these components is preceded by a variable data   *  00147000
* * prefix that is common to all components and identifies the       *  00148000
* * information that follows.                                        *  00149000
* *                                                                  *  00150000
* ********************************************************************  00151000
*                                                                       00152000
*                                                                       00153000
         AIF   ('&DSECT' EQ 'YES').L0004                                00154000
FCX_DATAPREFIX DS 0H     Variable Data Prefix                           00155000
         AGO   .L0005                                                   00156000
.L0004   ANOP                                                           00157000
FCX_DATAPREFIX DSECT     Variable Data Prefix                           00158000
.L0005   ANOP                                                           00159000
FCX_KEY  DS    X         Key that identifies the type of data which    *00160000
                         follows.                                       00161000
FCX_FORMAT DS  X         Version number that represents the format of  *00162000
                         the variable data identified by the key       *00163000
                         field.                                         00164000
FCX_FLAGS2 DS  B         Flags                                          00165000
FCX_Sequence EQU FCX_Flags2,1,C'B' Sequencing flags used when          *00166000
                                  variable data must be split across   *00167000
                                  multiple GTF records.  It lets the   *00168000
                                  formatter know whether splitting     *00169000
                                  has occurred and which record in     *00170000
                                  the sequence this is.                 00171000
         DS    CL1       Reserved                                       00172000
FCX_TOTALLENGTH DS H     Total length of data that contains the length *00173000
                         of the variable data. If the data is split    *00174000
                         between multiple GTF records, this contains   *00175000
                         the total length of the data in all of the    *00176000
                         GTF records.                                   00177000
FCX_DATALENGTH DS H      Length of data in this record. Contains the   *00178000
                         length of the variable information in this    *00179000
                         GTF record. For data that is not split        *00180000
                         between multiple GTF records, the total       *00181000
                         length and this length are the same. For data *00182000
                         that is split between multiple GTF records,   *00183000
                         this is the length in this record only.        00184000
FCX_DATAPFXEND DS 0C     End of data prefix                             00185000
FCX_DATAPREFIX_LEN EQU *-FCX_DATAPREFIX                                 00186000
.L0002   ANOP                                                           00187000
         AIF   ('&FCX_TCW_DATA' EQ 'NO').L0006                          00188000
         AIF   ('&DSECT' EQ 'YES').L0007                                00189000
         AIF   ('&FCX_TCW_DATA' NE 'YES').L0006                         00190000
.L0007   ANOP                                                           00191000
*                                                                       00192000
* ********************************************************************  00193000
* *                                                                  *  00194000
* * Variable Data Section for the Transport Control Word (TCW).      *  00195000
* *                                                                  *  00196000
* ********************************************************************  00197000
*                                                                       00198000
*                                                                       00199000
         AIF   ('&DSECT' EQ 'YES').L0008                                00200000
FCX_TCW_DATA DS 0F       TCW Data Section                               00201000
         AGO   .L0009                                                   00202000
.L0008   ANOP                                                           00203000
FCX_TCW_DATA DSECT       TCW Data Section                               00204000
.L0009   ANOP                                                           00205000
FCX_TCW_FLAGS DS B       Flags                                          00206000
*  Bit definitions:                                                     00207000
FCX_TCW_NORMAL EQU X'80' TCW for a normal channel program               00208000
FCX_TCW_INTER EQU X'40'  TCW for an interrogate request                 00209000
         DS    CL3       Reserved                                       00210000
FCX_TCW_VADDR DS A       TCW virtual address                            00211000
FCX_TCW_RADDR DS A       TCW real address                               00212000
FCX_TCW  DS    CL64      TCW                                            00213000
FCX_TCW_DATA_LEN EQU *-FCX_TCW_DATA                                     00214000
.L0006   ANOP                                                           00215000
         AIF   ('&FCX_TCCBTIDAW_DATA' EQ 'NO').L000A                    00216000
         AIF   ('&DSECT' EQ 'YES').L000B                                00217000
         AIF   ('&FCX_TCCBTIDAW_DATA' NE 'YES').L000A                   00218000
.L000B   ANOP                                                           00219000
*                                                                       00220000
* ********************************************************************  00221000
* *                                                                  *  00222000
* * Variable Data Section for the Transport Command Control Block    *  00223000
* * (TCCB) TIDAW.                                                    *  00224000
* *                                                                  *  00225000
* ********************************************************************  00226000
*                                                                       00227000
*                                                                       00228000
         AIF   ('&DSECT' EQ 'YES').L000C                                00229000
FCX_TCCBTIDAW_DATA DS 0D TCCB TIDAW Data Section                        00230000
         AGO   .L000D                                                   00231000
.L000C   ANOP                                                           00232000
FCX_TCCBTIDAW_DATA DSECT   TCCB TIDAW Data Section                      00233000
.L000D   ANOP                                                           00234000
FCX_TCCBTIDAW_RADDR DS AD TCCB TIDAW real address                       00235000
FCX_TCCBTIDAW DS CL16    TCCB TIDAW                                     00236000
FCX_TCCBTIDAW_DATA_LEN EQU *-FCX_TCCBTIDAW_DATA                         00237000
.L000A   ANOP                                                           00238000
         AIF   ('&FCX_TCAHDR_DATA' EQ 'NO').L000E                       00239000
         AIF   ('&DSECT' EQ 'YES').L000F                                00240000
         AIF   ('&FCX_TCAHDR_DATA' NE 'YES').L000E                      00241000
.L000F   ANOP                                                           00242000
*                                                                       00243000
* ********************************************************************  00244000
* *                                                                  *  00245000
* * Variable Data Section for the Transport Control Area (TCA)       *  00246000
* * header.                                                          *  00247000
* *                                                                  *  00248000
* ********************************************************************  00249000
*                                                                       00250000
*                                                                       00251000
         AIF   ('&DSECT' EQ 'YES').L0010                                00252000
FCX_TCAHDR_DATA DS 0D    TCA header Data Section                        00253000
         AGO   .L0011                                                   00254000
.L0010   ANOP                                                           00255000
FCX_TCAHDR_DATA DSECT    TCA header Data Section                        00256000
.L0011   ANOP                                                           00257000
FCX_TCAHDR_RADDR DS AD   TCA header real address                        00258000
FCX_TCAHDR DS  CL20      TCA header                                     00259000
FCX_TCAHDR_DATA_LEN EQU *-FCX_TCAHDR_DATA                               00260000
.L000E   ANOP                                                           00261000
         AIF   ('&FCX_DCW_DATA' EQ 'NO').L0012                          00262000
         AIF   ('&DSECT' EQ 'YES').L0013                                00263000
         AIF   ('&FCX_DCW_DATA' NE 'YES').L0012                         00264000
.L0013   ANOP                                                           00265000
*                                                                       00266000
* ********************************************************************  00267000
* *                                                                  *  00268000
* * Variable Data Section for the Device Control Word (DCW).         *  00269000
* *                                                                  *  00270000
* ********************************************************************  00271000
*                                                                       00272000
*                                                                       00273000
         AIF   ('&DSECT' EQ 'YES').L0014                                00274000
FCX_DCW_DATA DS 0D       DCW Data Section                               00275000
         AGO   .L0015                                                   00276000
.L0014   ANOP                                                           00277000
FCX_DCW_DATA DSECT       DCW Data Section                               00278000
.L0015   ANOP                                                           00279000
FCX_DCW_RADDR DS AD      DCW real address                               00280000
FCX_DCW  DS    CL8       DCW                                            00281000
FCX_DCW_DATA_LEN EQU *-FCX_DCW_DATA                                     00282000
.L0012   ANOP                                                           00283000
         AIF   ('&FCX_DCWCNTL_DATA' EQ 'NO').L0016                      00284000
         AIF   ('&DSECT' EQ 'YES').L0017                                00285000
         AIF   ('&FCX_DCWCNTL_DATA' NE 'YES').L0016                     00286000
.L0017   ANOP                                                           00287000
*                                                                       00288000
* ********************************************************************  00289000
* *                                                                  *  00290000
* * Variable Data Section for the DCW control data.                  *  00291000
* *                                                                  *  00292000
* ********************************************************************  00293000
*                                                                       00294000
*                                                                       00295000
         AIF   ('&DSECT' EQ 'YES').L0018                                00296000
FCX_DCWCNTL_DATA DS 0D   DCW descriptor Data Section                    00297000
         AGO   .L0019                                                   00298000
.L0018   ANOP                                                           00299000
FCX_DCWCNTL_DATA DSECT   DCW descriptor Data Section                    00300000
.L0019   ANOP                                                           00301000
FCX_DCWCNTL_RADDR DS AD  DCW descriptor real address                    00302000
FCX_DCWCNTL DS 0C        DCW descriptor data                            00303000
FCX_DCWCNTL_DATA_LEN EQU *-FCX_DCWCNTL_DATA                             00304000
.L0016   ANOP                                                           00305000
         AIF   ('&FCX_TCATLR_DATA' EQ 'NO').L001A                       00306000
         AIF   ('&DSECT' EQ 'YES').L001B                                00307000
         AIF   ('&FCX_TCATLR_DATA' NE 'YES').L001A                      00308000
.L001B   ANOP                                                           00309000
*                                                                       00310000
* ********************************************************************  00311000
* *                                                                  *  00312000
* * Variable Data Section for the Transport Control Area (TCA)       *  00313000
* * trailer.                                                         *  00314000
* *                                                                  *  00315000
* ********************************************************************  00316000
*                                                                       00317000
*                                                                       00318000
         AIF   ('&DSECT' EQ 'YES').L001C                                00319000
FCX_TCATLR_DATA DS 0D    TCA trailer Data Section                       00320000
         AGO   .L001D                                                   00321000
.L001C   ANOP                                                           00322000
FCX_TCATLR_DATA DSECT    TCA trailer Data Section                       00323000
.L001D   ANOP                                                           00324000
FCX_TCATLR_RADDR DS AD   TCA trailer real address                       00325000
FCX_TCATLR DS  0C        TCA trailer                                    00326000
FCX_TCATLR_DATA_LEN EQU *-FCX_TCATLR_DATA                               00327000
.L001A   ANOP                                                           00328000
         AIF   ('&FCX_STATUS_DATA' EQ 'NO').L001E                       00329000
         AIF   ('&DSECT' EQ 'YES').L001F                                00330000
         AIF   ('&FCX_STATUS_DATA' NE 'YES').L001E                      00331000
.L001F   ANOP                                                           00332000
*                                                                       00333000
* ********************************************************************  00334000
* *                                                                  *  00335000
* * Variable Data Section for the Status Block.                      *  00336000
* *                                                                  *  00337000
* ********************************************************************  00338000
*                                                                       00339000
*                                                                       00340000
         AIF   ('&DSECT' EQ 'YES').L0020                                00341000
FCX_STATUS_DATA DS 0D    Status Block Data Section                      00342000
         AGO   .L0021                                                   00343000
.L0020   ANOP                                                           00344000
FCX_STATUS_DATA DSECT    Status Block Data Section                      00345000
.L0021   ANOP                                                           00346000
FCX_STATUS_RADDR DS AD   Status Block real address                      00347000
FCX_STATUS DS  CL64      Status Block                                   00348000
FCX_STATUS_DATA_LEN EQU *-FCX_STATUS_DATA                               00349000
.L001E   ANOP                                                           00350000
         AIF   ('&FCX_TIDAW_DATA' EQ 'NO').L0022                        00351000
         AIF   ('&DSECT' EQ 'YES').L0023                                00352000
         AIF   ('&FCX_TIDAW_DATA' NE 'YES').L0022                       00353000
.L0023   ANOP                                                           00354000
*                                                                       00355000
* ********************************************************************  00356000
* *                                                                  *  00357000
* * Variable Data Section for the Data TIDAW.                        *  00358000
* *                                                                  *  00359000
* ********************************************************************  00360000
*                                                                       00361000
*                                                                       00362000
         AIF   ('&DSECT' EQ 'YES').L0024                                00363000
FCX_TIDAW_DATA DS 0D     Data TIDAW Data Section                        00364000
         AGO   .L0025                                                   00365000
.L0024   ANOP                                                           00366000
FCX_TIDAW_DATA DSECT     Data TIDAW Data Section                        00367000
.L0025   ANOP                                                           00368000
FCX_TIDAW_RADDR DS AD    Data TIDAW real address                        00369000
FCX_DATATIDAW DS CL16    Data TIDAW                                     00370000
FCX_TIDAW_DATA_LEN EQU *-FCX_TIDAW_DATA                                 00371000
.L0022   ANOP                                                           00372000
         AIF   ('&FCX_DATA_DATA' EQ 'NO').L0026                         00373000
         AIF   ('&DSECT' EQ 'YES').L0027                                00374000
         AIF   ('&FCX_DATA_DATA' NE 'YES').L0026                        00375000
.L0027   ANOP                                                           00376000
*                                                                       00377000
* ********************************************************************  00378000
* *                                                                  *  00379000
* * Variable Data Section for the Data (Complete).                   *  00380000
* *                                                                  *  00381000
* ********************************************************************  00382000
*                                                                       00383000
*                                                                       00384000
         AIF   ('&DSECT' EQ 'YES').L0028                                00385000
FCX_DATA_DATA DS 0D      Data (Complete) Data Section                   00386000
         AGO   .L0029                                                   00387000
.L0028   ANOP                                                           00388000
FCX_DATA_DATA DSECT      Data (Complete) Data Section                   00389000
.L0029   ANOP                                                           00390000
FCX_DATA_RADDR DS AD     Data (Complete) real address                   00391000
FCX_DATACOMP DS 0C       Data (Complete)                                00392000
FCX_DATA_DATA_LEN EQU *-FCX_DATA_DATA                                   00393000
.L0026   ANOP                                                           00394000
         AIF   ('&FCX_SPLIT_DATA' EQ 'NO').L002A                        00395000
         AIF   ('&DSECT' EQ 'YES').L002B                                00396000
         AIF   ('&FCX_SPLIT_DATA' NE 'YES').L002A                       00397000
.L002B   ANOP                                                           00398000
*                                                                       00399000
* ********************************************************************  00400000
* *                                                                  *  00401000
* * Variable Data Section for the Data (First and Second Half of     *  00402000
* * Split Data).                                                     *  00403000
* *                                                                  *  00404000
* ********************************************************************  00405000
*                                                                       00406000
*                                                                       00407000
         AIF   ('&DSECT' EQ 'YES').L002C                                00408000
FCX_SPLIT_DATA DS 0D     Split data Data Section                        00409000
         AGO   .L002D                                                   00410000
.L002C   ANOP                                                           00411000
FCX_SPLIT_DATA DSECT     Split data Data Section                        00412000
.L002D   ANOP                                                           00413000
FCX_SPLIT_RADDR DS AD    Split data real address                        00414000
FCX_SPLITDATA DS 0C      Split data                                     00415000
FCX_SPLIT_DATA_LEN EQU *-FCX_SPLIT_DATA                                 00416000
.L002A   ANOP                                                           00417000
         AIF   ('&FCX_IOSB_DATA' EQ 'NO').L002E                         00418000
         AIF   ('&DSECT' EQ 'YES').L002F                                00419000
         AIF   ('&FCX_IOSB_DATA' NE 'YES').L002E                        00420000
.L002F   ANOP                                                           00421000
*                                                                       00422000
* ********************************************************************  00423000
* *                                                                  *  00424000
* * Variable Data Section for the I/O Supervisor Block (IOSB).       *  00425000
* *                                                                  *  00426000
* ********************************************************************  00427000
*                                                                       00428000
*                                                                       00429000
         AIF   ('&DSECT' EQ 'YES').L0030                                00430000
FCX_IOSB_DATA DS 0F      IOSB Data Section                              00431000
         AGO   .L0031                                                   00432000
.L0030   ANOP                                                           00433000
FCX_IOSB_DATA DSECT      IOSB Data Section                              00434000
.L0031   ANOP                                                           00435000
FCX_IOSB_ADDR DS A       IOSB virtual address                           00436000
FCX_IOSB DS    0C        IOSB                                           00437000
FCX_IOSB_DATA_LEN EQU *-FCX_IOSB_DATA                                   00438000
.L002E   ANOP                                                           00439000
         AIF   ('&FCX_IOBE_DATA' EQ 'NO').L0032                         00440000
         AIF   ('&DSECT' EQ 'YES').L0033                                00441000
         AIF   ('&FCX_IOBE_DATA' NE 'YES').L0032                        00442000
.L0033   ANOP                                                           00443000
*                                                                       00444000
* ********************************************************************  00445000
* *                                                                  *  00446000
* * Variable Data Section for the I/O Block Extension (IOBE).        *  00447000
* *                                                                  *  00448000
* ********************************************************************  00449000
*                                                                       00450000
*                                                                       00451000
         AIF   ('&DSECT' EQ 'YES').L0034                                00452000
FCX_IOBE_DATA DS 0F      IOBE Data Section                              00453000
         AGO   .L0035                                                   00454000
.L0034   ANOP                                                           00455000
FCX_IOBE_DATA DSECT      IOBE Data Section                              00456000
.L0035   ANOP                                                           00457000
FCX_IOBE_ADDR DS A       IOBE virtual address                           00458000
FCX_IOBE DS    CL48      IOBE                                           00459000
FCX_IOBE_DATA_LEN EQU *-FCX_IOBE_DATA                                   00460000
.L0032   ANOP                                                           00461000
         AIF   ('&FCX_EWA_DATA' EQ 'NO').L0036                          00462000
         AIF   ('&DSECT' EQ 'YES').L0037                                00463000
         AIF   ('&FCX_EWA_DATA' NE 'YES').L0036                         00464000
.L0037   ANOP                                                           00465000
*                                                                       00466000
* ********************************************************************  00467000
* *                                                                  *  00468000
* * Variable Data Section for the Error Recovery Procedure (ERP)     *  00469000
* * Work Area (EWA).                                                 *  00470000
* *                                                                  *  00471000
* ********************************************************************  00472000
*                                                                       00473000
*                                                                       00474000
         AIF   ('&DSECT' EQ 'YES').L0038                                00475000
FCX_EWA_DATA DS 0F       EWA Data Section                               00476000
         AGO   .L0039                                                   00477000
.L0038   ANOP                                                           00478000
FCX_EWA_DATA DSECT       EWA Data Section                               00479000
.L0039   ANOP                                                           00480000
FCX_EWA_ADDR DS A        EWA virtual address                            00481000
FCX_EWA  DS    CL248     EWA                                            00482000
FCX_EWA_DATA_LEN EQU *-FCX_EWA_DATA                                     00483000
.L0036   ANOP                                                           00484000
         AIF   ('&FCX_MSG_DATA' EQ 'NO').L003A                          00485000
         AIF   ('&DSECT' EQ 'YES').L003B                                00486000
         AIF   ('&FCX_MSG_DATA' NE 'YES').L003A                         00487000
.L003B   ANOP                                                           00488000
*                                                                       00489000
* ********************************************************************  00490000
* *                                                                  *  00491000
* * Variable Data Section for the Message that should be issued.     *  00492000
* *                                                                  *  00493000
* ********************************************************************  00494000
*                                                                       00495000
*                                                                       00496000
         AIF   ('&DSECT' EQ 'YES').L003C                                00497000
FCX_MSG_DATA DS 0X       Message Data Section                           00498000
         AGO   .L003D                                                   00499000
.L003C   ANOP                                                           00500000
FCX_MSG_DATA DSECT       Message Data Section                           00501000
.L003D   ANOP                                                           00502000
FCX_MESSAGE DS CL126     Message text                                   00503000
*                                                                       00504000
* ********************************************************************  00505000
* *                                                                  *  00506000
* * Value for FCX version (FCX_Version)                              *  00507000
* *                                                                  *  00508000
* ********************************************************************  00509000
*                                                                       00510000
*                                                                       00511000
FCX_VERS EQU   0         Current version                                00512000
*                                                                       00513000
* ********************************************************************  00514000
* *                                                                  *  00515000
* * Key constants (FCX_Key)                                          *  00516000
* *                                                                  *  00517000
* ********************************************************************  00518000
*                                                                       00519000
*                                                                       00520000
FCX_TCW_KEY EQU 1        Transport Control Word (TCW) key               00521000
FCX_TCCBTIDAW_KEY EQU 2  Transport Command Control Block (TCCB) TIDAW  *00522000
                         key                                            00523000
FCX_TCAHEADER_KEY EQU 3  TCA header key                                 00524000
FCX_DCW_KEY EQU 4        Device Control Word (DCW) key                  00525000
FCX_DCWCNTL_KEY EQU 5    DCW descriptor data key                        00526000
FCX_TCATRAILER_KEY EQU 6 TCA trailer key (UniDi trailer)                00527000
FCX_TSB_KEY EQU 7        TCW status block key                           00528000
FCX_DATATIDAW_KEY EQU 8  Data TIDAW key                                 00529000
FCX_DATACOMP_KEY EQU 9   Data (complete) key                            00530000
FCX_DATASPLIT1_KEY EQU 10 Data (first half of split) key                00531000
FCX_DATASPLIT2_KEY EQU 11 Data (second half of split) key               00532000
FCX_IOSB_KEY EQU 12      I/O Supervisor Block (IOSB) key                00533000
FCX_IOBE_KEY EQU 13      I/O Block Extension (IOBE) key                 00534000
FCX_EWA_KEY EQU 14       Error Recovery Procedure (ERP) Work Area      *00535000
                         (EWA) key                                      00536000
FCX_MESSAGE_KEY EQU 15   Message key                                    00537000
FCX_TCAXTIDAW_KEY EQU 26 TCAX TIDAW Key                                 00538000
FCX_TCAXDCW_KEY EQU 27   TCAX DCW Key                                   00539000
FCX_TCAXDCWCNTL_KEY EQU 28 TCAX DCW descriptor data key                 00540000
FCX_TCABIDITRAILER_KEY EQU 29 BiDi Trailer key                          00541000
FCX_Seq_Only EQU X'00'            Only record in the sequence (no      *00542000
                                  splitting)                            00543000
FCX_Seq_First EQU X'40'           First record in the sequence          00544000
FCX_Seq_Middle EQU X'80'          Middle record in the sequence         00545000
FCX_Seq_Last EQU X'C0'            Last record in the sequence           00546000
FCX_MSG_DATA_LEN EQU *-FCX_MSG_DATA                                     00547000
.L003A   ANOP                                                           00548000
         AIF   ('&ZCBPRINT' EQ 'NO').P3                                 00549000
         AIF   ('&LIST' EQ 'YES').P4                                    00550000
.P3      ANOP                                                           00551000
         POP   PRINT                                                    00552000
.P4      ANOP                                                           00553000
.P_EXIT  ANOP                                                           00554000
         MEND                                                           00555000
**/ AHLFCXG_2:;                                                         00556000
* %AHLFCXG_INCLUDED = 'YES';                                            00557000
* %DCL ZCBPRINT CHAR EXT;                                               00558000
* %DEACTIVATE ZCBPRINT;                                                 00559000
* %DCL AHLFCXG_LIST CHAR EXT;                                           00560000
* %DEACTIVATE AHLFCXG_LIST;                                             00561000
* %IF AHLFCXG_LIST = 'NO' !                                             00562000
*    ZCBPRINT = 'NO' %THEN                                              00563000
* %DO;                                                                  00564000
*   @LIST PUSH NOECHO;                                                  00565000
*   @LIST NOASSEMBLE NOECHO;                                            00566000
*   @LIST OFF C NOECHO;                                                 00567000
* %END;                                                                 00568000
*/* Start of PL/X Source                                             */ 00569000
*/* Start of PL/X Source                                             */ 00570000
*@SPACE;                                                                00571000
*   DECLARE                                                             00572000
*     %IF FCXGDEF = '' %THEN                                            00573000
*       %GOTO FCXGDF1;                                                  00574000
*   1 FCXREC FCXGDEF BDY(WORD),     /* FCX Channel Program Trace        00575000
*                                      Record                        */ 00576000
*       %GOTO FCXGL1;                                                   00577000
*%FCXGDF1:                                                              00578000
*   ;                                                                   00579000
*   1 FCXREC BDY(WORD),             /* FCX Channel Program Trace        00580000
*                                      Record                        */ 00581000
*       %FCXGL1:;                                                       00582000
*       3    FCX_RecordPrefix CHAR(16), /* GTF record prefix - mapped   00583000
*                                      by AHLZGTW                    */ 00584000
*       3    FCX_Header,            /* FCX channel program header    */ 00585000
*         5    FCX_Common CHAR(16), /* Common GTF trace data - mapped   00586000
*                                      by AHLZGTD                    */ 00587000
*         5    FCX_Version FIXED(8), /* Version number               */ 00588000
*         5    FCX_HdrLength FIXED(8), /* Length of record header    */ 00589000
*         5    FCX_SeqNo FIXED(16), /* Record sequence number that is   00590000
*                                      used during formatting to        00591000
*                                      determine whether the GTF        00592000
*                                      records for a channel program    00593000
*                                      are in the proper sequence.   */ 00594000
*         5    FCX_BaseDevice CHAR(2), /* If the I/O device number      00595000
*                                      was an alias, this contains      00596000
*                                      the base device number.       */ 00597000
*         5    FCX_SSID FIXED(8),   /* The subchannel set identifier    00598000
*                                      of the device associated with    00599000
*                                      the I/O request.              */ 00600000
*         5    FCX_BaseSSID FIXED(8), /* The subchannel set             00601000
*                                      identifier of the base device.*/ 00602000
*         5    FCX_Flags1 BIT(8),   /* Flags                         */ 00603000
*           7    FCX_TCWformat BIT(2), /* This is a copy of the         00604000
*                                      format field in the TCW. The     00605000
*                                      version is included in the       00606000
*                                      formatted FCX header             00607000
*                                      information.                  */ 00608000
*           7    FCX_First   BIT(1),/* First record for channel         00609000
*                                      program                       */ 00610000
*           7    *        BIT(5),   /* Reserved                      */ 00611000
*         5    *        CHAR(3),    /* Reserved                      */ 00612000
*         5    FCX_Hdr_End CHAR(0); /* End of header                 */ 00613000
*@SPACE;                                                                00614000
*/********************************************************************/ 00615000
*/*                                                                  */ 00616000
*/* Variable Data Prefix - Following the record header are the       */ 00617000
*/* different components of the channel program (TCW, DCWs, data,    */ 00618000
*/* etc.). Each of these components is preceded by a variable data   */ 00619000
*/* prefix that is common to all components and identifies the       */ 00620000
*/* information that follows.                                        */ 00621000
*/*                                                                  */ 00622000
*/********************************************************************/ 00623000
*   DECLARE                                                             00624000
*     1    FCX_DataPrefix PRFXDEF,  /* Variable Data Prefix          */ 00625000
*       3    FCX_Key  FIXED(8),     /* Key that identifies the type     00626000
*                                      of data which follows.        */ 00627000
*       3    FCX_Format FIXED(8),   /* Version number that represents   00628000
*                                      the format of the variable       00629000
*                                      data identified by the key       00630000
*                                      field.                        */ 00631000
*       3    FCX_Flags2 BIT(8),     /* Flags                         */ 00632000
*         5    FCX_Sequence BIT(2), /* Sequencing flags used when       00633000
*                                      variable data must be split      00634000
*                                      across multiple GTF records.     00635000
*                                      It lets the formatter know       00636000
*                                      whether splitting has occurred   00637000
*                                      and which record in the          00638000
*                                      sequence this is.             */ 00639000
*         5    *        BIT(6),     /* Reserved                      */ 00640000
*       3    *        CHAR(1),      /* Reserved                      */ 00641000
*       3    FCX_TotalLength FIXED(16), /* Total length of data that    00642000
*                                      contains the length of the       00643000
*                                      variable data. If the data is    00644000
*                                      split between multiple GTF       00645000
*                                      records, this contains the       00646000
*                                      total length of the data in      00647000
*                                      all of the GTF records.       */ 00648000
*       3    FCX_DataLength FIXED(16), /* Length of data in this        00649000
*                                      record. Contains the length of   00650000
*                                      the variable information in      00651000
*                                      this GTF record. For data that   00652000
*                                      is not split between multiple    00653000
*                                      GTF records, the total length    00654000
*                                      and this length are the same.    00655000
*                                      For data that is split between   00656000
*                                      multiple GTF records, this is    00657000
*                                      the length in this record        00658000
*                                      only.                         */ 00659000
*       3    FCX_DataPfxEnd CHAR(0); /* End of data prefix           */ 00660000
*@SPACE;                                                                00661000
*/********************************************************************/ 00662000
*/*                                                                  */ 00663000
*/* Variable Data Section for the Transport Control Word (TCW).      */ 00664000
*/*                                                                  */ 00665000
*/********************************************************************/ 00666000
*DECLARE                                                                00667000
*     1    FCX_TCW_Data DATADEF,    /* TCW Data Section              */ 00668000
*       3    FCX_TCW_Flags BIT(8),  /* Flags                         */ 00669000
*         5    FCX_TCW_Normal BIT(1), /* TCW for a normal channel       00670000
*                                      program                       */ 00671000
*         5    FCX_TCW_Inter BIT(1), /* TCW for an interrogate          00672000
*                                      request                       */ 00673000
*         5    *        BIT(6),     /* Reserved                      */ 00674000
*       3    *        CHAR(3),      /* Reserved                      */ 00675000
*       3    FCX_TCW_Vaddr PTR(31), /* TCW virtual address           */ 00676000
*       3    FCX_TCW_Raddr PTR(31), /* TCW real address              */ 00677000
*       3    FCX_TCW  CHAR(64);     /* TCW                           */ 00678000
*@SPACE;                                                                00679000
*/********************************************************************/ 00680000
*/*                                                                  */ 00681000
*/* Variable Data Section for the Transport Command Control Block    */ 00682000
*/* (TCCB) TIDAW.                                                    */ 00683000
*/*                                                                  */ 00684000
*/********************************************************************/ 00685000
*DECLARE                                                                00686000
*     1 FCX_TCCBTIDAW_Data DATADEF, /* TCCB TIDAW Data Section       */ 00687000
*       3 FCX_TCCBTIDAW_Raddr PTR(64), /* TCCB TIDAW real address    */ 00688000
*       3 FCX_TCCBTIDAW   CHAR(16); /* TCCB TIDAW                    */ 00689000
*@SPACE;                                                                00690000
*/********************************************************************/ 00691000
*/*                                                                  */ 00692000
*/* Variable Data Section for the Transport Control Area (TCA)       */ 00693000
*/* header.                                                          */ 00694000
*/*                                                                  */ 00695000
*/********************************************************************/ 00696000
*DECLARE                                                                00697000
*     1    FCX_TCAhdr_Data DATADEF, /* TCA header Data Section       */ 00698000
*       3    FCX_TCAhdr_Raddr PTR(64), /* TCA header real address    */ 00699000
*       3    FCX_TCAhdr CHAR(20);   /* TCA header                    */ 00700000
*@SPACE;                                                                00701000
*/********************************************************************/ 00702000
*/*                                                                  */ 00703000
*/* Variable Data Section for the Device Control Word (DCW).         */ 00704000
*/*                                                                  */ 00705000
*/********************************************************************/ 00706000
*DECLARE                                                                00707000
*     1    FCX_DCW_Data DATADEF,    /* DCW Data Section              */ 00708000
*       3    FCX_DCW_Raddr PTR(64), /* DCW real address              */ 00709000
*       3    FCX_DCW  CHAR(8);      /* DCW                           */ 00710000
*@SPACE;                                                                00711000
*/********************************************************************/ 00712000
*/*                                                                  */ 00713000
*/* Variable Data Section for the DCW control data.                  */ 00714000
*/*                                                                  */ 00715000
*/********************************************************************/ 00716000
*DECLARE                                                                00717000
*     1    FCX_DCWcntl_Data DATADEF, /* DCW descriptor Data Section  */ 00718000
*       3    FCX_DCWcntl_Raddr PTR(64), /* DCW descriptor real          00719000
*                                      address                       */ 00720000
*       3    FCX_DCWcntl CHAR(*);   /* DCW descriptor data           */ 00721000
*@SPACE;                                                                00722000
*/********************************************************************/ 00723000
*/*                                                                  */ 00724000
*/* Variable Data Section for the Transport Control Area (TCA)       */ 00725000
*/* trailer.                                                         */ 00726000
*/*                                                                  */ 00727000
*/********************************************************************/ 00728000
*DECLARE                                                                00729000
*     1    FCX_TCAtlr_Data DATADEF, /* TCA trailer Data Section      */ 00730000
*       3    FCX_TCAtlr_Raddr PTR(64), /* TCA trailer real address   */ 00731000
*       3    FCX_TCAtlr CHAR(*);    /* TCA trailer               @03C*/ 00732000
*@SPACE;                                                                00733000
*/********************************************************************/ 00734000
*/*                                                                  */ 00735000
*/* Variable Data Section for the Status Block.                      */ 00736000
*/*                                                                  */ 00737000
*/********************************************************************/ 00738000
*DECLARE                                                                00739000
*     1    FCX_Status_Data DATADEF, /* Status Block Data Section     */ 00740000
*       3    FCX_Status_Raddr PTR(64), /* Status Block real address  */ 00741000
*       3    FCX_Status CHAR(64);   /* Status Block                  */ 00742000
*@SPACE;                                                                00743000
*/********************************************************************/ 00744000
*/*                                                                  */ 00745000
*/* Variable Data Section for the Data TIDAW.                        */ 00746000
*/*                                                                  */ 00747000
*/********************************************************************/ 00748000
*DECLARE                                                                00749000
*     1    FCX_TIDAW_Data DATADEF,  /* Data TIDAW Data Section       */ 00750000
*       3    FCX_TIDAW_Raddr PTR(64), /* Data TIDAW real address     */ 00751000
*       3    FCX_DataTIDAW CHAR(16); /* Data TIDAW                   */ 00752000
*@SPACE;                                                                00753000
*/********************************************************************/ 00754000
*/*                                                                  */ 00755000
*/* Variable Data Section for the Data (Complete).                   */ 00756000
*/*                                                                  */ 00757000
*/********************************************************************/ 00758000
*DECLARE                                                                00759000
*     1    FCX_Data_Data DATADEF,   /* Data (Complete) Data Section  */ 00760000
*       3    FCX_Data_Raddr PTR(64), /* Data (Complete) real address */ 00761000
*       3    FCX_DataComp CHAR(*);  /* Data (Complete)               */ 00762000
*@SPACE;                                                                00763000
*/********************************************************************/ 00764000
*/*                                                                  */ 00765000
*/* Variable Data Section for the Data (First and Second Half of     */ 00766000
*/* Split Data).                                                     */ 00767000
*/*                                                                  */ 00768000
*/********************************************************************/ 00769000
*DECLARE                                                                00770000
*     1    FCX_Split_Data DATADEF,  /* Split data Data Section       */ 00771000
*       3    FCX_Split_Raddr PTR(64), /* Split data real address     */ 00772000
*       3    FCX_SplitData CHAR(*); /* Split data                    */ 00773000
*@SPACE;                                                                00774000
*/********************************************************************/ 00775000
*/*                                                                  */ 00776000
*/* Variable Data Section for the I/O Supervisor Block (IOSB).       */ 00777000
*/*                                                                  */ 00778000
*/********************************************************************/ 00779000
*DECLARE                                                                00780000
*     1    FCX_IOSB_Data DATADEF,   /* IOSB Data Section             */ 00781000
*       3    FCX_IOSB_Addr PTR(31), /* IOSB virtual address          */ 00782000
*       3    FCX_IOSB CHAR(*);      /* IOSB                          */ 00783000
*@SPACE;                                                                00784000
*/********************************************************************/ 00785000
*/*                                                                  */ 00786000
*/* Variable Data Section for the I/O Block Extension (IOBE).        */ 00787000
*/*                                                                  */ 00788000
*/********************************************************************/ 00789000
*DECLARE                                                                00790000
*     1    FCX_IOBE_Data DATADEF,   /* IOBE Data Section             */ 00791000
*       3    FCX_IOBE_Addr PTR(31), /* IOBE virtual address          */ 00792000
*       3    FCX_IOBE CHAR(LENGTH(IOBE)); /* IOBE                    */ 00793000
*@SPACE;                                                                00794000
*/********************************************************************/ 00795000
*/*                                                                  */ 00796000
*/* Variable Data Section for the Error Recovery Procedure (ERP)     */ 00797000
*/* Work Area (EWA).                                                 */ 00798000
*/*                                                                  */ 00799000
*/********************************************************************/ 00800000
*DECLARE                                                                00801000
*     1    FCX_EWA_Data DATADEF,    /* EWA Data Section              */ 00802000
*       3    FCX_EWA_Addr PTR(31),  /* EWA virtual address           */ 00803000
*       3    FCX_EWA  CHAR(LENGTH(EWA)); /* EWA                      */ 00804000
*@SPACE;                                                                00805000
*/********************************************************************/ 00806000
*/*                                                                  */ 00807000
*/* Variable Data Section for the Message that should be issued.     */ 00808000
*/*                                                                  */ 00809000
*/********************************************************************/ 00810000
*DECLARE                                                                00811000
*     1    FCX_Msg_Data DATADEF,    /* Message Data Section          */ 00812000
*       3    FCX_Message CHAR(126); /* Message text                  */ 00813000
*@SPACE;                                                                00814000
*/********************************************************************/ 00815000
*/*                                                                  */ 00816000
*/* Value for FCX version (FCX_Version)                              */ 00817000
*/*                                                                  */ 00818000
*/********************************************************************/ 00819000
*DCL  FCX_VERS FIXED(8) CONSTANT(0); /* Current version              */ 00820000
*@SPACE;                                                                00821000
*/********************************************************************/ 00822000
*/*                                                                  */ 00823000
*/* Key constants (FCX_Key)                                          */ 00824000
*/*                                                                  */ 00825000
*/********************************************************************/ 00826000
*DECLARE                                                                00827000
*     FCX_TCW_Key FIXED(8) CONSTANT('01'X), /* Transport Control Word   00828000
*                                      (TCW) key                     */ 00829000
*     FCX_TCCBTIDAW_Key   FIXED(8) CONSTANT('02'X), /* Transport        00830000
*                                      Command Control Block (TCCB)     00831000
*                                      TIDAW key                     */ 00832000
*     FCX_TCAheader_Key FIXED(8) CONSTANT('03'X), /* TCA header key  */ 00833000
*     FCX_DCW_Key FIXED(8) CONSTANT('04'X), /* Device Control Word      00834000
*                                      (DCW) key                     */ 00835000
*     FCX_DCWcntl_Key FIXED(8) CONSTANT('05'X), /* DCW descriptor       00836000
*                                      data key                      */ 00837000
*     FCX_TCAtrailer_Key FIXED(8) CONSTANT('06'X), /* TCA trailer key   00838000
*                                                     (UniDi trailer)   00839000
*                                                                @03C*/ 00840000
*     FCX_TSB_Key FIXED(8) CONSTANT('07'X), /* TCW status block key  */ 00841000
*     FCX_DataTIDAW_Key FIXED(8) CONSTANT('08'X), /* Data TIDAW key  */ 00842000
*     FCX_DataComp_Key FIXED(8) CONSTANT('09'X), /* Data (complete)     00843000
*                                      key                           */ 00844000
*     FCX_DataSplit1_Key FIXED(8) CONSTANT('0A'X), /* Data (first       00845000
*                                      half of split) key            */ 00846000
*     FCX_DataSplit2_Key FIXED(8) CONSTANT('0B'X), /* Data (second      00847000
*                                      half of split) key            */ 00848000
*     FCX_IOSB_Key FIXED(8) CONSTANT('0C'X), /* I/O Supervisor Block    00849000
*                                      (IOSB) key                    */ 00850000
*     FCX_IOBE_Key FIXED(8) CONSTANT('0D'X), /* I/O Block Extension     00851000
*                                      (IOBE) key                    */ 00852000
*     FCX_EWA_Key FIXED(8) CONSTANT('0E'X), /* Error Recovery           00853000
*                                      Procedure (ERP) Work Area        00854000
*                                      (EWA) key                     */ 00855000
*     FCX_Message_Key FIXED(8) CONSTANT('0F'X), /* Message key       */ 00856000
*     FCX_TSRQB_Key FIXED(8) CONSTANT('10'X), /* TSRQB Key       @L1A*/ 00857000
*     FCX_CTIU_Key FIXED(8) CONSTANT('11'X), /* TSRQB CTIU key   @L1A*/ 00858000
*     FCX_GPI_Key FIXED(8) CONSTANT('12'X), /* TSRQB GPI key     @L1A*/ 00859000
*     FCX_GAN_Key FIXED(8) CONSTANT('13'X), /* TSRQB GAN key     @L1A*/ 00860000
*     FCX_RNID_Key FIXED(8) CONSTANT('14'X), /* TSRQB RNID key   @L1A*/ 00861000
*     FCX_TSRSB_Key FIXED(8) CONSTANT('15'X), /* TSRSB Key       @L1A*/ 00862000
*     FCX_TSRSBCTIU_Key FIXED(8) CONSTANT('16'X), /* TSRSB CT_IU Key    00863000
*                                                                @L1A*/ 00864000
*     FCX_TSRSBdata_Key FIXED(8) CONSTANT('17'X), /* TSRSB data Key     00865000
*                                                                @L1A*/ 00866000
*     FCX_TSRSBTIDAW_Key FIXED(8) CONSTANT('18'X), /* TSRSB TIDAW Key   00867000
*                                                                @L1A*/ 00868000
*     FCX_TINC_Key FIXED(8) CONSTANT('19'X), /* TSRQB TINC key   @03C*/ 00869000
*     FCX_TCAXTIDAW_Key FIXED(8) CONSTANT('1A'X), /* TCAX TIDAW Key     00870000
*                                                                @03A*/ 00871000
*     FCX_TCAXDCW_Key FIXED(8) CONSTANT('1B'X),   /* TCAX DCW Key       00872000
*                                                                @03A*/ 00873000
*     FCX_TCAXDCWcntl_Key FIXED(8) CONSTANT('1C'X), /* TCAX DCW         00874000
*                                      descriptor data key       @03A*/ 00875000
*     FCX_TCABiDiTrailer_Key FIXED(8) CONSTANT('1D'X); /* BiDi Trailer  00876000
*                                                      key       @03A*/ 00877000
*@SPACE;                                                                00878000
*/********************************************************************/ 00879000
*/*                                                                  */ 00880000
*/* Sequencing flags (FCX_Sequence)                                  */ 00881000
*/*                                                                  */ 00882000
*/********************************************************************/ 00883000
*DECLARE                                                                00884000
*     FCX_Seq_Only Bit(2) CONSTANT('00'B), /* Only record in the        00885000
*                                      sequence (no splitting)       */ 00886000
*     FCX_Seq_First Bit(2) CONSTANT('01'B), /* First record in the      00887000
*                                      sequence                      */ 00888000
*     FCX_Seq_Middle Bit(2) CONSTANT('10'B), /* Middle record in the    00889000
*                                      sequence                      */ 00890000
*     FCX_Seq_Last Bit(2) CONSTANT('11'B); /* Last record in the        00891000
*                                      sequence                      */ 00892000
*                                                                       00893000
*@logic;                            /*                           @P1A*/ 00894000
*#PRAGMA TOOL=CBGEN.                                                    00895000
**                                                                      00896000
*#LINE.%PRFXDEF='BASED';                                                00897000
*#LINE.%DATADEF='BASED';                                                00898000
*#MAP.                                                                  00899000
*#LINE.%INCLUDE SYSLIB(AHLFCXG);                                        00900000
**                                                                      00901000
** Replace sequence fields in the assembler definition with             00902000
** something more usable                                                00903000
**                                                                      00904000
*#REPLACE.FCX_SEQUENCE                                                  00905000
*FCX_Sequence EQU FCX_Flags2,1,C'B' Sequencing flags used when        * 00906000
*                                  variable data must be split across * 00907000
*                                  multiple GTF records.  It lets the * 00908000
*                                  formatter know whether splitting   * 00909000
*                                  has occurred and which record in   * 00910000
*                                  the sequence this is.                00911000
**#EREPLACE.                                                            00912000
*                                                                       00913000
*#REPLACE.FCX_SEQ_ONLY                                                  00914000
*FCX_Seq_Only EQU X'00'            Only record in the sequence (no    * 00915000
*                                  splitting)                           00916000
**#EREPLACE.                                                            00917000
*                                                                       00918000
*#REPLACE.FCX_SEQ_FIRST                                                 00919000
*FCX_Seq_First EQU X'40'           First record in the sequence         00920000
**#EREPLACE.                                                            00921000
*                                                                       00922000
*#REPLACE.FCX_SEQ_MIDDLE                                                00923000
*FCX_Seq_Middle EQU X'80'          Middle record in the sequence        00924000
**#EREPLACE.                                                            00925000
*                                                                       00926000
*#REPLACE.FCX_SEQ_LAST                                                  00927000
*FCX_Seq_Last EQU X'C0'            Last record in the sequence          00928000
**#EREPLACE.                                                            00929000
**                                                                      00930000
** Delete these fields from the assembler version                       00931000
**                                                                      00932000
*#DELETE.FCX_TSRQB_Key                                                  00933000
*#DELETE.FCX_CTIU_Key                                                   00934000
*#DELETE.FCX_GPI_Key                                                    00935000
*#DELETE.FCX_GAN_Key                                                    00936000
*#DELETE.FCX_RNID_Key                                                   00937000
*#DELETE.FCX_TSRSB_Key                                                  00938000
*#DELETE.FCX_TSRSBCTIU_Key                                              00939000
*#DELETE.FCX_TSRSBdata_Key                                              00940000
*#DELETE.FCX_TSRSBTIDAW_Key                                             00941000
*#DELETE.FCX_TINC_Key                                                   00942000
**                                                                      00943000
** Macros and variables that are needed for compiling but should        00944000
** not be generated                                                     00945000
**                                                                      00946000
*#NOMAP.                                                                00947000
*#LINE.%INCLUDE SYSLIB(IOSDIOBE);                                       00948000
*#LINE.%INCLUDE SYSLIB(EWAMAP);                                         00949000
*#LINE.Dcl EWAPtr Ptr(31);                                              00950000
**                                                                      00951000
*#EPRAGMA.                                                              00952000
*@endlogic;                         /*                           @P1A*/ 00953000
*/* End of PL/X Source                                               */ 00954000
*/* End of PL/X Source                                               */ 00955000
* %IF AHLFCXG_LIST = 'NO' !                                             00956000
*    ZCBPRINT = 'NO' %THEN                                              00957000
* %DO;                                                                  00958000
*   @LIST POP NOECHO;                                                   00959000
* %END;                                                                 00960000
* %END;                                                                 00961000
