*/**** Start of Specifications for AHLMCWRC **************************/ 00200000
*/*                                                                  */ 00400000
*/* $MAC(AHLMCWRC) COMP(SC111) PROD(HBB7720):                        */ 00600000
*/*                                                                  */ 00800000
*/* MACRO NAME:  AHLMCWRC                                            */ 01000000
*/* DESCRIPTIVE NAME:  CCW trace entry segments.                     */ 01200000
*/* COMPONENT: Generalized Trace Facility (SC111)                    */ 01400000
*/*                                                                  */ 01600000
*/* PROPRIETARY STATEMENT:                                           */ 01800000
*/*                                                                  */ 02000000
*/*   LICENSED MATERIALS - PROPERTY OF IBM                           */ 02200000
*/*   THIS MACRO IS "RESTRICTED MATERIALS OF IBM"                    */ 02400000
*/*   5694-A01 COPYRIGHT IBM CORP. 1982, 2005                        */ 02600000
*/*                                                                  */ 02800000
*/* STATUS= HBB7720                                                  */ 03000000
*/*                                                                  */ 03200000
*/* EXTERNAL CLASSIFICATION: PI                                      */ 03400000
*/* END OF EXTERNAL CLASSIFICATION:                                  */ 03600000
*/*                                                                  */ 03800000
*/* FUNCTION:                                                        */ 04000000
*/*   Maps CCW trace entry segments.                                 */ 04200000
*/*                                                                  */ 04400000
*/* METHOD OF ACCESS:                                                */ 04600000
*/*   ASM:                                                           */ 04800000
*/*     AHLMCWRC                                                     */ 05000000
*/*                                                                  */ 05200000
*/*   PL/X:                                                          */ 05400000
*/*     %INCLUDE SYSLIB(AHLMCWRC)                                    */ 05600000
*/*                                                                  */ 05800000
*/*   DSECT NAME:                                                    */ 06000000
*/*     MCWRC                                                        */ 06200000
*/*                                                                  */ 06400000
*/*   EYE CATCHER: None                                              */ 06600000
*/*                                                                  */ 06800000
*/* CREATED BY: Within field MCAWORK in MCAWSA and typically written */ 07000000
*/*   to a GTF external trace data set                               */ 07200000
*/* POINTED TO BY: N/A                                               */ 07400000
*/*                                                                  */ 07600000
*/* SERIALIZATION: Disablement                                       */ 07800000
*/*                                                                  */ 08000000
*/* STORAGE ATTRIBUTES:                                              */ 08200000
*/*                                                                  */ 08400000
*/*   SUBPOOL  : 239                                                 */ 08600000
*/*   KEY      : 0                                                   */ 08800000
*/*   SIZE     : 256 bytes                                           */ 09000000
*/*   FREQUENCY: 1/CPU                                               */ 09200000
*/*   LOCATION : common                                              */ 09400000
*/*   ATTRIBUTES: Fetch protected, fixed                             */ 09600000
*/*                                                                  */ 09800000
*/* DISTRIBUTION LIBRARY: AMACLIB                                    */ 10000000
*/* SYSTEM LIBRARY: MACLIB                                           */ 10200000
*/*                                                                  */ 10400000
*/* ================================================================ */ 10600000
*/*                                                                  */ 10800000
*/*   CHANGE ACTIVITY:                                               */ 11000000
*/* $T0= UZ90152,JBB1326,810601,PDD3: CCWTRACE                       */ 11200000
*/* $H1= 64BITGTF,HBB7703,990503,PDH6: 64 bit IDAWs                  */ 11400000
*/* $P1= PJK0032,HBB7709,001115,PDKV: Shark support                  */ 11600000
*/* $L1= SCHSET ,HBB7720,040330,PDPY: Subchannel Sets                */ 11800000
*/*    = ME01640 HBB7720,040829,PDE1: 5637-A01 ==> 5694-A01          */ 12200000
*/* $P3= ME02279,HBB7720,040915,PDE1: Bilingual PI mapping           */ 12800000
*/*    = ME02313,HBB7720,041110,PDE1: Correct Build390 metadata      */ 13000000
*/*    = ME02801,HBB7720,050131,PDE1: Upgrate prolog text            */ 13200000
*/* $01= OA10984,HBB7709,050830,PDMS: MIDAW Support, add Midaw to    */ 13200015
*/*                                   trace information              */ 13200020
*/* $02= OA24143,HBB7740,080831,PDON: Subchannel sets for PPRC -     */ 13210000
*/*                                   Add MCWBSSID                   */ 13220000
*/*                                                                  */ 13400000
*/**** End of Specifications for AHLMCWRC ****************************/ 13600000
*/* Define HLASM mapping                                                13800000
         MACRO ,                                                   @P3A 14000000
&LABEL   AHLMCWRC ,                    CCW TRACE ENTRY             @P3A 14200000
         IEZBITS ,                     Symbolic bits               @P3P 14400000
MCWRC    DSECT ,                       CCW TRACE ENTRY             @P3A 14600000
MCWASCB  DS    AL4                     ADDRESS SPACE CAUSING       @P3A 14800000
*                                      INTERRUPT                        15000000
MCWCPUID DS    XL2                     CPU CAUSING INTERRUPT       @P3A 15200000
MCWJOB   DS    CL8                     JOBNAME CAUSING TRACE FROM  @P3A 15400000
*                                      FROM ASCBJBNS OR ASCBJBNI        15600000
MCWDEVAD DS    XL2                     DEVICE ADDR CAUSING TRACE   @P3A 15800000
MCWDATAL DS    HL2                     MAX AMOUNT OF DATA TO       @P3A 16000000
*                                      FOLLOW                           16200000
MCWFLG1  DS    BL1                     ID FOR CCWTRACE FORMATTER   @P3A 16400000
*        EQU   BIT0                    Reserved                         16600000
MCWEIDAW EQU   BIT1                    64 bit IDAWs are being      @P3A 16800000
*                                      traced                           17000000
MCWFMT   EQU   BIT2                    FORMAT OF CCWS. 0 IMPLIES   @P3A 17200000
*                                      FORMAT ZERO CCWS ARE BEING       17400000
*                                      TRACED. 1 IMPLIES FORMAT         17600000
*                                      ONE CCWS ARE BEING TRACED.       17800000
MCWEWA   EQU   BIT3                    RECORD CONTAINS A EWA       @P3A 18000000
MCWIOSB  EQU   BIT4                    RECORD CONTAINS A IOSB      @P3A 18200000
MCWLAST  EQU   BIT5                    THIS IS THE LAST RECORD FOR @P3A 18400000
*                                      THIS EVENT (EG: SIO)             18600000
MCWMSG   EQU   BIT6                    RECORD CONTAINS A MESSAGE   @P3A 18800000
MCWLOST  EQU   BIT7                    END OF CHAIN NOT FOUND      @P3A 19000000
MCWRECNO DS    HL2                     SEQUENTIAL RECORD COUNT FOR @P3A 19200000
*                                      PRINT DUMP OF THIS EVENT         19400000
*                                      (EG: SIO)                        19600000
MCWTVSN  DS    FL1                     CCW record version          @P3A 19800000
MCWVERSIONNUMBER0 EQU 0,1,C'F'         Pre V1R6 MCW Version        @P3A 20000000
MCWVERSIONNUMBER1 EQU 1,1,C'F'         V1R6 Version of the MCW     @P3A 20200000
*                                      with PAV support.                20400000
MCWVERSIONNUMBER2 EQU 2,1,C'F'         V1R6 Version of the MCW     @P3A 20699990
*                                      with MIDAW support.              20800000
MCWVERSIONNUMBER3 EQU 3,1,C'F'         V1R7 Version of the MCW     @P3A 21000000
*                                      with SubChannel Set Support      21200000
MCWCURRVERSIONNUMBER EQU MCWVERSIONNUMBER3,1,C'F' The current      @P3A 21400000
*                                      version of the MCW               21600000
MCWSSID  DS    X                       SubChannel set ID           @P3A 21800000
MCWUCBWGT DS   FL1                     From UCB, has UCBMTPXP      @P3A 22000000
MCWBASE  DS    XL2                     Device no. for a PAV        @P3A 22200000
MCWBSSID DS    X                       Base subchannel set ID      @02A 22400000
MCWRSVD2 DS    XL2                     Reserved                    @02C 22410000
MCWREC   DS    0CL(L'MCWREC1)          Variable Data Area          @P3A 22600000
MCWREC1  DS    0CL235                  Variable data area          @P3A 22800000
MCWTRTID DS    FL1                     TRANSLATE TABLE ID FOR      @P3A 23000000
*                                      FORMATTER                        23200000
MCWCCWA  DS    CL234                   START CCW AND DATA FIELD    @P3A 23400000
MCWCCWA1 DSECT ,                                                   @P3A 23600000
MCWFLG2  DS    0BL2                                                @P3A 23800000
MCWFLG2A DS    BL1                     Byte 1 of MCWFLG2           @P3A 24000000
MCWMOD   EQU   BIT0                    CCW HAS MODIFY ABILITY      @P3A 24200000
MCWNODAT EQU   BIT1                    NO DATA TRACED FOR THIS CCW @P3A 24400000
MCWCMCDS EQU   BIT2                    COMMAND CODE SAVED          @P3A 24600000
MCWRDBKW EQU   BIT3                    COMMAND CODE IS READ        @P3A 24800000
*                                      BACKWARD                         25000000
MCWCMDCD EQU   BIT4+BIT5+BIT6+BIT7     SAVE AREA FOR CCW COMD CODE @P3A 25200000
MCWFLG2B DS    BL1                     Byte 2 of MCWFLG2           @P3A 25400000
MCWDATA1 EQU   BIT0                    RECORD CONTAINS             @P3A 25600000
*                                      CONTINUATION OF DATA FROM        25800000
*                                      PREVIOUS RECORD                  26000000
MCWCDBIT EQU   BIT1                    THIS CCW DOES A CHAIN DATA  @P3A 26200000
MCWIDAW1 EQU   BIT2                    IDAW INDICATOR FLAG FOR     @P3A 26400000
*                                      PRINTDUMP FORMATTER              26600000
MCWDATER EQU   BIT3                    ERROR IN DATA TRACED-NO     @P3A 26800000
*                                      DATA FORMATTED                   27000000
MCWSPLIT EQU   BIT4                    MORE DATA AVAILABLE THAN    @P3A 27200000
*                                      FORMATTED                        27400000
MCWLAST1 EQU   BIT5                    LAST CCW TO BE EXECUTED     @P3A 27600000
MCWTIC   EQU   BIT6                    TIC INST NO DATA            @P3A 27800000
*                                      TRANSFERRED                      28000000
MCWLOST1 EQU   BIT7                    CCW CHAIN LOST AT THIS      @P3A 28200000
*                                      POINT                            28400000
MCWDALNH DS    HL2                     LENGTH OF DATA IN THIS CCW. @P3A 28600000
*                                      FOR DATA CONTINUATION, IT IS     28800000
*                                      THE RESIDUAL COUNT               29000000
MCWDATLN DS    FL1                     LENGTH OF DATA IN THIS REC  @P3A 29200000
MCWOLDCCWB DS  0C                      Location of the Format 0    @P3A 29400000
*                                      MCW's CCWB                       29600000
MCWFLG3  DS    BL1                     MCW FLAG 3                  @P3A 29800000
MCWMIDAW1 EQU  BIT0                    MIDAWs ARE ASSOCIATED WITH  @P3A 30000000
*                                      WITH THIS RECORD.                30200000
         DS    XL2                     RESERVED                    @P3A 30400000
MCWCCWB  DS    0FL4                    AREA FOR CCW ADDR,CCW & CNT @P3A 30600000
*                                      also IDAW and MIDAWs             30800000
MCWCCWAD DS    A                       VIRTUAL ADDRESS OF CCW      @P3A 31000000
MCWCCW   DS    XL8                     CCW BEING TRACED            @P3A 31200000
         DS    XL4                     Extra Area for MIDAW        @P3A 31400000
MCWCCWL  DS    0C                      AREA FOR LENGTH AND DATA    @P3A 31600000
*                                                                       31800000
*  ******************************************************************   32000000
*   MCWFmt0CCWB is defined on MCWOldCCWB and overlays MCWFLG3 to        32200000
*   MCWCCWL                                                             32400000
*  ******************************************************************   32600000
*                                                                       32800000
         ORG  MCWOLDCCWB                                           @P3A 33000000
MCWFMT0CCWB DS 0C                      AREA FOR CCW ADDR,CCW CNT   @P3A 33200000
*                                      and IDAWs                        33400000
MCWFMT0CCWAD DS AL4                    VIRTUAL ADDRESS OF CCW      @P3A 33600000
MCWFMT0CCW DS  XL8                     CCW BEING TRACED            @P3A 33800000
MCWFMT0CCWL DS 0C                      AREA FOR LENGTH AND DATA    @P3A 34000000
         ORG   MCWCCWB                                             @P3A 34200000
MCWIDAW  DS    0C                      MAPPING FOR INDIRECT DATA   @P3A 34400000
*                                      ADDRESS WORD ENTRY               34600000
MCWIDAW64 DS   0ADL8                   64 bit pointer to IDAW      @P3A 34800000
MCWIDADH DS    0AL4                    High order 32 bits of IDA   @P3A 35000000
*                                      data address when MCWEIDAW       35200000
*                                      is On.                           35400000
MCWIDAWA DS    CL4                     'IDAW' when MCWEIDAW is Off @P3A 35600000
MCWIDADA DS    AL4                     IDA data address (low order @P3A 35800000
*                                      32 bits when MCWEIDAW is On)     36000000
MCWIDACT DS    HL2                     ACTUAL IDAW LENGTH          @P3A 36200000
         DS    HL2                     UNUSED                      @P3A 36400000
MCWCCWB1 DSECT ,                                                   @P3A 36600000
MCWDATA  DS    CL256                   DATA AREA FOR CCWS          @P3A 36800000
MCWRC    DSECT ,                       CCW TRACE ENTRY             @P3A 37000000
         ORG   MCWREC                                              @P3A 37200000
MCWREC2  DS    XL235                                               @P3A 37400000
MCWBLKHD DS    0XL10                   HEADER GROUP                @P3A 37600000
MCWBLKID DS    XL4                     TYPE OF RECORD              @P3A 37800000
MCWBLKAD DS    AL4                     ADDR OF EWA,IOSB OR ZEROS   @P3A 38000000
MCWBLKLN DS    HL2                     LENGTH OF EWA,IOSB OR MSG   @P3A 38200000
MCWTRC   DS    XL225                   DATA OR MESSAGE             @P3A 38400000
MCWCCWA1 DSECT ,                                                   @P3A 38600000
         ORG   MCWCCWB                                             @P3A 38800000
MCWMIDAW DS    0X                      MAPPING FOR MODIFIED        @P3A 39000000
*                                      INDIRECT DATA ADDRESS WORD       39200000
*                                      ENTRY                            39400000
         DS    XL5                     RESERVED IN THE MIDAW       @P3A 39600000
MCWMIDAFLG1 DS BL1                     FLAGS                       @P3A 39800000
MCWMIDALAST EQU BIT0                   THIS IS THE LAST MIDAW IN A @P3A 40000000
*                                      CONTIGUOUS LIST OF MIDAWS        40200000
MCWMIDASKIP EQU BIT1                   SKIP THE TRANSFER OF        @P3A 40400000
*                                      INFORMATION TO MAIN STORAGE      40600000
*                                      DURING A READ, READ              40800000
*                                      BACKWARDS, SENSE ID OR           41000000
*                                      SENSE OPERATION.                 41200000
MCWMIDACNT DS  HL2                     COUNT                       @P3A 41400000
MCWMIDAADDR DS 0ADL8                   DATA ADDRESS (64 BIT)       @P3A 41600000
MCWMIDAAH DS   AL4                     HIGH ORDER WORD OF ADDR     @P3A 41800000
MCWMIDAAL DS   AL4                     LOW ORDER WORD OF ADDR      @P3A 42000000
AHLUCBWGT DSECT ,                      MAP THE ...WGT FIELD        @P3A 42200000
         DS    BL1                                                 @P3A 42400000
AHLUCBWGTR0 EQU BIT0                   Reserved                    @P3A 42600000
AHLUCBWGTR1 EQU BIT1                   Reserved                    @P3A 42800000
AHLUCBWGTR2 EQU BIT2                   Reserved                    @P3A 43000000
AHLUCBWGTR3 EQU BIT3                   Reserved                    @P3A 43200000
AHLPAV   EQU   BIT4                    Reflects UCB PAV device     @P3A 43400000
AHLUCBWGTR5 EQU BIT5                   Reserved                    @P3A 43600000
AHLUCBWGTR6 EQU BIT6                   Reserved                    @P3A 43800000
AHLUCBWGTR7 EQU BIT7                   Reserved                    @P3A 44000000
         MEND  ,                       END AHLMCWRC - HLASM        @P3A 44200000
*                                      End of HLASM mapping          */ 44400000
*                                                                       44600000
*   DECLARE                                                             44800000
*     1    MCWRC    BOUNDARY(WORD) BASED, /*                     @P1C*/ 45000000
*      2    MCWASCB  POINTER(31),   /* ADDRESS SPACE CAUSING INTER   */ 45200000
*      2    MCWCPUID CHARACTER(2),  /* CPU CAUSING INTERRUPT         */ 45400000
*      2    MCWJOB   CHARACTER(8),  /* JOBNAME OF JOB CAUSING TRACE     45600000
*                                      FROM ASCBJBNS OR ASCBJBNI     */ 45800000
*      2    MCWDEVAD CHARACTER(2),  /* DEVICE ADDR CAUSING TRACE     */ 45800010
*      2    MCWDATAL BIT(16),       /* MAX AMOUNT OF DATA TO FOLLOW  */ 45800020
*      2    MCWFLG1  BIT(8),        /* ID FOR CCWTRACE FORMATTER     */ 45800030
*       3    MCWNewFmt BIT(1),      /* Post PAV dev. support     @P1C*/ 45800040
*       3    MCWEIDAW BIT(1),       /* 64 bit IDAWs are being traced    45800050
*                                                                @H1A*/ 45800060
*       3    MCWFMT   BIT(1),       /* FORMAT OF CCWS. 0 IMPLIES        47200000
*                                      FORMAT ZERO CCWS ARE BEING       47400000
*                                      TRACED. 1 IMPLIES FORMAT ONE     47600000
*                                      CCWS ARE BEING TRACED.           47800000
*                                                            @ZMC2122*/ 48000000
*       3    MCWEWA   BIT(1),       /* RECORD CONTAINS A EWA         */ 48200000
*       3    MCWIOSB  BIT(1),       /* RECORD CONTAINS A IOSB        */ 48400000
*       3    MCWLAST  BIT(1),       /* THIS IS THE LAST RECORD FOR      48600000
*                                      THIS EVENT (EG: SIO)          */ 48800000
*       3    MCWMSG   BIT(1),       /* RECORD CONTAINS A MESSAGE     */ 49000000
*       3    MCWLOST  BIT(1),       /* END OF CHAIN NOT FOUND        */ 49200000
*      2    MCWRECNO BIT(16),       /* SEQUENTIAL RECORD COUNT FOR      49400000
*                                      PRINT DUMP OF THIS EVENT (EG:    49600000
*                                      SIO)                          */ 49800000
*      2    MCWTVsn  CHARACTER(1),  /* CCW record version        @P1A*/ 50000000
*      2    MCWSSID  Fixed(8),      /* SubChannel set ID         @L1A*/ 50200000
*      2    MCWUcbWgt CHARACTER(1), /* From UCB, has UCBMTPXP    @P1A*/ 50400000
*      2    MCWBase  CHARACTER(2),  /* Device no. for a PAV      @P1A*/ 50600000
*      2    MCWBSSID Fixed(8),      /* Base subchannel set ID    @02A*/ 50600010
*      2    MCWRsvd2 CHARACTER(2),  /* Reserved                  @02C*/ 50600011
*      2    MCWREC   CHARACTER(SIZE(McwRec1)), /* Variable Data Area    50600020
*                                                                @01C*/ 50600030
*     1    MCWREC1  CHARACTER(235) BOUNDARY(BYTE) DEFINED(MCWREC),      50600040
*      2    MCWTRTID BIT(8),        /* TRANSLATE TABLE ID FOR           50600050
*                                      FORMATTER                 @01C*/ 50600060
*      2    MCWCCWA  CHARACTER(234), /* START CCW AND DATA FIELD @01C*/ 50600070
*     1    MCWCCWA1 BASED,                                              50600080
*      2    MCWFLG2  BIT(16),       /*                               */ 50600090
*       3    MCWMOD   BIT(1),       /* CCW HAS MODIFY ABILITY        */ 50600100
*       3    MCWNODAT BIT(1),       /* NO DATA TRACED FOR THIS CCW   */ 52800000
*       3    MCWCMCDS BIT(1),       /* COMMAND CODE SAVED INDICATOR  */ 53000000
*       3    MCWRDBKW BIT(1),       /* COMMAND CODE IS READ BACKWARD */ 53200000
*       3    MCWCMDCD BIT(4),       /* SAVE AREA FOR CCW COMD CODE   */ 53400000
*       3    MCWDATA1 BIT(1),       /* RECORD CONTAINS CONTINUATION     53600000
*                                      OF DATA FROM PREVIOUS RECORD  */ 53800000
*       3    MCWCDBIT BIT(1),       /* THIS CCW DOES A CHAIN DATA    */ 54000000
*       3    MCWIDAW1 BIT(1),       /* IDAW INDICATOR FLAG FOR          54200000
*                                      PRINTDUMP FORMATTER           */ 54400000
*       3    MCWDATER BIT(1),       /* ERROR IN DATA TRACED-NO DATA     54600000
*                                      FORMATTED                     */ 54800000
*       3    MCWSPLIT BIT(1),       /* MORE DATA AVAILABLE THEN         55000000
*                                      FORMATTED                     */ 55200000
*       3    MCWLAST1 BIT(1),       /* LAST CCW TO BE EXECUTED       */ 55400000
*       3    MCWTIC   BIT(1),       /* TIC INST NO DATA TRANSFERRED  */ 55600000
*       3    MCWLOST1 BIT(1),       /* CCW CHAIN LOST AT THIS POINT  */ 55800000
*      2    MCWDALNH BIT(16),       /* LENGTH OF DATA IN THIS CCW.      56000000
*                                      FOR DATA CONTINUATION, IT IS     56000010
*                                      THE RESIDUAL COUNT            */ 56000020
*      2    MCWDATLN FIXED(8),      /* LENGTH OF DATA IN THIS REC    */ 56000030
*      2    MCWOldCCWB CHAR(0),     /* Location of the Format 0 MCW's   56000040
*                                      CCWB                      @01A*/ 56000050
*      2    MCWFLG3  BIT(8),        /* MCW FLAG 3                @01A*/ 56000060
*       3    MCWMIDAW1 BIT(1),      /* MIDAWs ARE ASSOCIATED WITH       56000070
*                                      WITH THIS RECORD.         @01A*/ 56000080
*       3    *        BIT(7),       /* RESERVED                  @01A*/ 56000090
*      2    *        BIT(16),       /* RESERVED                  @01A*/ 56000100
*      2    MCWCCWB,                /* AREA FOR CCW ADDR,CCW & CNT      56000110
*                                      also IDAW and MIDAWs      @01C*/ 56000120
*       3    MCWCCWAD CHARACTER(4), /* VIRTUAL ADDRESS OF CCW    @01C*/ 56000130
*       3    MCWCCW   CHARACTER(8), /* CCW BEING TRACED          @01C*/ 56000140
*       3    *        CHARACTER(4), /* Extra Area for MIDAW      @01A*/ 56000150
*      2    MCWCCWL  CHARACTER(0),  /* AREA FOR LENGTH AND DATA  @01C*/ 56000160
*                                                                       56000170
*/********************************************************************/ 56000180
*/* MCWFmt0CCWB is defined on MCWOldCCWB and overlays MCWFLG3 to     */ 56000190
*/* MCWCCWL                                                          */ 56000200
*/********************************************************************/ 56000210
*                                                                       56000220
*     1    MCWFmt0CCWB DEFINED(MCWOldCCWB), /* AREA FOR CCW ADDR,CCW    56000230
*                                      CNT and IDAWs             @01A*/ 56000240
*       3    MCWFmt0CCWAD CHARACTER(4), /* VIRTUAL ADDRESS OF CCW       56000250
*                                                                @01A*/ 56000260
*       3    MCWFmt0CCW CHARACTER(8), /* CCW BEING TRACED        @01A*/ 56000270
*      2    MCWFmt0CCWL CHARACTER(0), /* AREA FOR LENGTH AND DATA@01A*/ 56000280
*     1    MCWIDAW  DEFINED(MCWCCWB), /* MAPPING FOR INDIRECT DATA      56000290
*                                      ADDRESS WORD ENTRY            */ 56000300
*      2    MCWIDAW64 CHAR(8),      /* 64 bit pointer to IDAW    @01A*/ 56000310
*       3    MCWIDADH CHAR(4),      /* High order 32 bits of IDA data   56000320
*                                      address when MCWEIDAW is On.     56000330
*                                                                @01C*/ 56000340
*        4    MCWIDAWA CHAR(4),     /* 'IDAW' when MCWEIDAW is Off.     56000350
*                                                                @01C*/ 56000360
*       3    MCWIDADA CHAR(4),      /* IDA data address (low order 32   56000370
*                                      bits when MCWEIDAW is On) @01C*/ 56000380
*      2    MCWIDACT BIT(16),       /* ACTUAL IDAW LENGTH            */ 56000390
*      2    *        CHARACTER(2),  /* UNUSED                    @01A*/ 56000400
*     1    MCWCCWB1 BASED,                                              56000410
*      2    MCWDATA  CHARACTER(*),  /* DATA AREA FOR CCWS        @01C*/ 56000420
*     1    MCWREC2  CHARACTER(235) BOUNDARY(BYTE) DEFINED(MCWREC),      56000430
*      2    MCWBLKHD CHARACTER(10), /* HEADER GROUP                  */ 56000440
*       3    MCWBLKID CHARACTER(4), /* TYPE OF RECORD                */ 56000450
*       3    MCWBLKAD CHARACTER(4), /* ADDR OF EWA,IOSB OR ZEROS     */ 56000460
*       3    MCWBLKLN BIT(16),      /* LENGTH OF EWA,IOSB OR MSG     */ 56000470
*      2    MCWTRC   CHARACTER(225), /* DATA OR MESSAGE          @01C*/ 56000480
*     1    MCWMIDAW DEFINED(MCWCCWB), /* MAPPING FOR MODIFIED           56000490
*                                      INDIRECT DATA ADDRESS WORD       56000500
*                                      ENTRY                     @01A*/ 56000510
*      2    *        BIT(40),       /* RESERVED IN THE MIDAW     @01A*/ 56000520
*      2    MCWMIDAFLG1 BIT(8),     /* FLAGS                     @01A*/ 56000530
*       3    MCWMIDALAST BIT(1),    /* THIS IS THE LAST MIDAW IN A      56000540
*                                      CONTIGUOUS LIST OF MIDAWS @01A*/ 56000550
*       3    MCWMIDASKIP BIT(1),    /* SKIP THE TRANSFER OF             56000560
*                                      INFORMATION TO MAIN STORAGE      56000570
*                                      DURING A READ, READ BACKWARDS,   56000580
*                                      SENSE ID OR SENSE OPERATION.     56000590
*                                                                @01A*/ 56000600
*       3    *        BIT(6),       /* RESERVED IN THE MIDAW     @01A*/ 56000610
*      2    MCWMIDACNT CHAR(2),     /* COUNT                     @01A*/ 56000620
*      2    MCWMIDAADDR CHAR(8),    /* DATA ADDRESS (64 BIT)     @01A*/ 56000630
*       3    MCWMIDAAH CHAR(4),     /* HIGH ORDER WORD OF ADDR   @01A*/ 56000640
*       3    MCWMIDAAL CHAR(4),     /* LOW ORDER WORD OF ADDR    @01A*/ 56000650
*     McwVersionNumber0 Fixed CONSTANT(0), /* Pre V1R6 MCW Version      56000660
*                                                                @01A*/ 56000670
*     McwVersionNumber1 Fixed CONSTANT(1), /* V1R6 Version of the MCW   56000680
*                                      with PAV support.         @01A*/ 56000690
*     McwVersionNumber2 Fixed CONSTANT(2), /* V1R6 Version of the MCW   56000705
*                                      with MIDAW support.       @01A*/ 56000710
*     McwVersionNumber3 Fixed CONSTANT(3), /* V1R7 Version of the MCW   70600000
*                                      with SubChannel Set Support      70800000
*                                                                @01A*/ 71000000
*     McwCurrVersionNumber FIXED CONSTANT(McwVersionNumber3); /* The    71200000
*                                      current version of the MCW       71400000
*                                                                @01C*/ 71600000
*   %IF MuDone ^= 'DONE' %THEN      /*                           @P1A*/ 71800000
*     %DO;                          /*                           @P1A*/ 72000000
*       DECLARE                                                         72200000
*         1    AhlUcbWgt Bit(8) Based, /* Map the ...WGT field   @P1A*/ 72400000
*          2    AhlUcbWgtR0 Bit(1), /* Reserved                  @P1A*/ 72600000
*          2    AhlUcbWgtR1 Bit(1), /* Reserved                  @P1A*/ 72800000
*          2    AhlUcbWgtR2 Bit(1), /* Reserved                  @P1A*/ 73000000
*          2    AhlUcbWgtR3 Bit(1), /* Reserved                  @P1A*/ 73200000
*          2    AhlPAV   Bit(1),    /* Reflects UCB PAV device   @P1A*/ 73400000
*          2    AhlUcbWgtR5 Bit(1), /* Reserved                  @P1A*/ 73600000
*          2    AhlUcbWgtR6 Bit(1), /* Reserved                  @P1A*/ 73800000
*          2    AhlUcbWgtR7 Bit(1); /* Reserved                  @P1A*/ 74000000
*     %END;                         /*                           @P1A*/ 74200000
*   %MuDone = 'DONE';               /*                           @P1A*/ 74400000
