*%GOTO PQSCSPLAS1;/*                                                    00050000
         MACRO                                                          00100000
&LAB     ANTPQSCS                                                       00150000
.*/%PQSCSPLAS1:;                                                        00200000
*/** START OF SPECIFICATIONS  ***************************************/  00250000
*/*                                                                 */  00300000
*/* $MAC(ANTPQSCS) COMP(DF117) PROD(SDM):                           */  00350000
*/*                                                                 */  00400000
*/* DESCRIPTIVE NAME = ANTRQST PQSCSTAT OUTPUT DATA MAP STRUCTURE   */  00450000
*/*                                                                 */  00500000
*/*                                                                 */  00550000
*/*******************************************************************/  00600000
*/*                                                                 */  00650000
*/*PROPRIETARY V3 STATEMENT                                         */  00700000
*/*"Restricted Materials of IBM"                                    */  00720000
*/*LICENSED MATERIALS - PROPERTY OF IBM                             */  00750000
*/*5650-ZOS                                                         */  00879990
*/*COPYRIGHT IBM CORP  2010,2019                                    */  00946940
*/*END PROPRIETARY V3 STATEMENT                                     */  00950000
*/*                                                                 */  01000000
*/*******************************************************************/  01050000
*/*                                                                 */  01100000
*/* FUNCTION = THIS MACRO MAPS THE OUTPUT FIELDS IN THE             */  01150000
*/*            PARAMETER AREA POINTED TO BY THE QRYINFO KEYWORD     */  01200000
*/*            IN THE ANTRQST PQSCSTAT REQUEST.                     */  01250000
*/*                                                                 */  01300000
*/* NOTES =    THE ANTRQST REQUEST=PQSCSTAT QRYINFO PARAMETER HAS   */  01350000
*/*            THE NAME OF AN AREA MAPPED BY THIS MACRO. THE        */  01400000
*/*            QRYINFO DATA HAS THE MAPPING DESCRIBED BELOW.        */  01450000
*/*            IN THIS FORMAT, THE DATA IS NOT CONVERTED TO         */  01500000
*/*            CHARACTER STRINGS USABLE BY REXX.                    */  01550000
*/*                                                                 */  01600000
*/*            WHEN ANTRQST RETURNS TO THE CALLER, AND THE          */  01650000
*/*            RETINFO RETURN AND REASON CODE ARE ZERO, THE         */  01700000
*/*            QRYINFO AREA WILL HAVE DATA LOCATED AS DESCRIBED     */  01750000
*/*            BELOW.                                               */  01800000
*/*                                                                 */  01850000
*/*                                                                 */  01900000
*/*                                                                 */  01950000
*/* LINKAGE = %INCLUDE SYSLIB(ANTPQSCS)                             */  02000000
*/*                                                                 */  02050000
*/* INPUT = "%PQSCS_BASE" CAN BE USED TO CHANGE THE DEFAULT BASING  */  02100000
*/*         ATTRIBUTE OF THE CONTROL BLOCK.  "%PQSCS_BASE = 'NONE'" */  02150000
*/*         WILL CAUSE THE DECLARE TO NOT BE BASED.  "%PQSCS_BASE = */  02200000
*/*         'BASED(R1)'" WILL CAUSE THE DECLARE TO BE BASED ON R1.  */  02250000
*/*                                                                 */  02300000
*/* CHANGE ACTIVITY =                                               */  02350000
*/*                                                                 */  02400000
*/*  $L0=INITIAL,HDZ1190,091201,TUCCGS: INITIAL SUPPORT             */  02450000
*/*  $CP=OA38976,HDZ1B10,120101,TUCCGS: GM CGPAUSE              @CPA*/  02470000
*/*  $SF=OA40510,HDZ1B10,121212,TUCCGS: SOFT FENCE              @SFA*/  02480000
*/*  $01=OA43548,HDZ1C10,131015,TUCJGS: STATE DATA VALID BIT    @01A*/  02490000
*/*  $SP=OA42677,HDZ1C10,130711,TUCCGS: SPID FENCE              @SPA*/  02495000
*/*  $MT=OA43654,HDZ1D10,141002,TUCCGS: Multi Target PPRC       @MTA*/  02497000
*/*  $02=OA47521,HDZ1D10,150409,TUCCGS: Pending due to FC       @02A*/  02498000
*/*  $MH=OA52386,HDZ2210,170701,RUSCGS: OBJSTORE HyperSwap      @MHA*/  02499000
*/*  $SG=OA56518,HDZ2220,190523,TUCCGS: Safeguarded Copy        @SGA*/  02499500
*/*                                                                 */  02500000
*/** END OF SPECIFICATIONS ******************************************/  02550000
*%GOTO PQSCSPLAS2;/*                                                    02600000
PQSCSF   DSECT                                                          02650000
*                                                                       02700000
*    MAPS THE FRONT MATTER SECTION OF THE PQSCSTAT DATA                 02750000
*                                                                       02800000
PQSCS_EYE          DS    CL8       EYECATCHER C'ANTPQSCS'               02850000
PQSCS_VRL          DS    0XL4      VERSION/RELEASE/LEVEL                02900000
PQSCS_VER          DS    X                                              02950000
PQSCS_REL          DS    X                                              03000000
PQSCS_LVL          DS    X                                              03050000
                   DS    X                                              03100000
                   DS    4X                                             03150000
PQSCS_LEN          DS    F         LENGTH OF ANTPQSCS SPECIFIC HEADER   03200000
*                                  AND DATA RETURNED FROM CONTROLLER    03250000
*                                  (LENGTH OF DSECTS PQSCSF, PQSCSH,    03300000
*                                   PQSCSL,PQSCSD, AND PQSCSR)          03350000
PQSCS_PQSCSF_LEN   DS    F         LENGTH- PQSCSF DSECT                 03400000
PQSCS_PQSCSH_LEN   DS    F         LENGTH- RETURNED HEADER PQSCSH       03450000
PQSCS_PQSCSL_LEN   DS    F         LENGTH- RETURNED LSS DATA PQSCSL     03500000
PQSCS_PQSCSD_LEN   DS    F         LENGTH- RETURNED DEV SUM PQSCSD      03550000
PQSCS_PQSCSR_LEN   DS    F         LENGTH- RETURNED RANK DATA PQSCSR    03600000
                   DS    2F                                             03650000
*                                                                       03700000
*    COMMAND SPECIFIC INFORMATION                                       03750000
*                                                                       03800000
PQSCS_DEVN         DS    H         DEVICE NUMBER SPECIFIED              03850000
                   DS    H                                              03900000
PQSCS_DVC          DS    X         DEVICE TO BE QUERIED CCA             03950000
PQSCS_LSS          DS    X         DEVICE TO BE QUERIED LSS             04000000
PQSCS_SSID         DS    H         DEVICE SSID                          04050000
PQSCS_SERIAL       DS    0CL12     DEVICE SERIAL                        04100000
                   DS    2C        RESERVED                             04150000
PQSCS_SER_ESS      DS    CL10      ESS STYLE S/N                        04200000
                   DS    CL4       RESERVED                             04250000
PQSCS_FLAGS        DS    0XL4      FLAGS                                04300000
PQSCS_FLAGS1       DS    X         FLAG BYTE 0                          04350000
PQSCS_SCOPE_LSS    EQU   X'80'     SCOPE OF REQUEST IS LSS ONLY         04400000
PQSCS_SCOPE_RANK   EQU   X'40'     SCOPE OF REQUEST IS RANK             04450000
PQSCS_OPENDVCS     EQU   X'20'     FB DVCS SPECIFIED                    04500000
PQSCS_PPRC_STATE_VALID  EQU   X'10' PQSCSD_PPRC_STATE DATA IS VALID@01A 04520000
PQSCS_FLAGS2       DS    X         FLAG BYTE 2                          04550000
PQSCS_FLAGS3       DS    X         FLAG BYTE 3                          04600000
PQSCS_FLAGS4       DS    X         FLAG BYTE 4                          04650000
                   DS    CL28                                           04700000
PQSCS_LG    EQU  *-PQSCSF                                               04750000
                                                                        04800000
*                                                                       04850000
*    END OF FRONT MATTER, BEGIN CONTROLLER DATA                         04900000
*                                                                       04950000
PQSCSH   DSECT                                                          05000000
*                                                                       05050000
*    MAPS THE CONTROLLER DATA HEADER INFORMATION                        05100000
*                                                                       05150000
PQSCSH_DATA_LEN    DS    H         TOTAL LENGTH OF CONTROLLER           05200000
*                                  RETURNED DATA                        05250000
PQSCSH_FLAGS       DS    0XL2      QUERY HEADER FLAGS                   05300000
PQSCSH_FLAGS1      DS    X         QUERY HEADER FLAG BYTE 1             05350000
*                                                                       05400000
PQSCS_LSS_VALID    EQU   X'80'     LSS DATA IS VALID                    05450000
PQSCS_RANK_VALID   EQU   X'40'     RANK DATA IS VALID                   05500000
PQSCS_MT_VALID     EQU   X'20'     MULTI TARGET VALID              @MTA 05520000
*                                                                       05550000
PQSCSH_FLAGS2      DS    X         QUERY HEADER FLAG BYTE 2             05600000
PQSCSH_SCI_TYPE    DS    CL6       STORAGE CONTR IMAGE TYPE (EBCDIC)    05650000
PQSCSH_SCI_MODEL   DS    CL3       STORAGE CONTR IMAGE MODEL (EBCDIC)   05700000
PQSCSH_SCI_SEQ     DS    CL10      STORAGE CONTR IMAGE SEQUENCE NUMBER  05750000
PQSCSH_SCI_WWNN    DS    CL8       STORAGE CONTR IMAGE WORLD WIDE NODE  05800000
*                                  NAME                                 05850000
PQSCSH_VERSION     DS    X         VERSION OF CONTR DATA (CURRENT =     05900000
*                                  X'01')                               05950000
PQSCSH_LG   EQU    *-PQSCSH                                             06000000
*                                                                       06050000
*    END OF CONTROLLER DATA HEADER INFORMATION                          06100000
*                                                                       06150000
PQSCSL  DSECT                                                           06200000
*                                                                       06250000
*    MAPS THE CONTROLLER DATA LSS INFORMATION                           06300000
*                                                                       06350000
PQSCSL_FLAGS       DS    0XL2                                           06400000
PQSCSL_FLAGS1      DS    X                                              06450000
PQSCSL_DUAL_CL     EQU   X'80'     STORAGE CONTR IN DUAL CLUSTER MODE   06500000
PQSCSL_FLAGS2      DS    X                                              06550000
*                                                                       06600000
PQSCL_CKD_BITMAP   DS    XL32      32 BYTES (256 BITS) REPRESENT LSS'S  06650000
*                                  THAT                                 06700000
*                                  HAVE BEEN CONFIGURED AS CKD          06750000
PQSCL_FB_BITMAP    DS    XL32      32 BYTES (256 BITS) REPRESENT LSS'S  06800000
*                                  THAT                                 06850000
*                                  HAVE BEEN CONFIGURED AS FB           06900000
PQSCSL_LG         EQU *-PQSCSL                                          06950000
*                                                                       07000000
*    ENDS THE CONTROLLER DATA LSS INFORMATION                           07050000
*                                                                       07100000
PQSCSD   DSECT                                                          07150000
*                                                                       07200000
*    MAPS THE CONTROLLER DATA DEVICE INFORMATION                        07250000
*                                                                       07300000
PQSCSD_VOL_ARRAY   DS    XL2048    2048 BYTES OF DATA, 8 BYTES PER      07350000
*                                  DEVICE                               07400000
PQSCSD_LG            EQU *-PQSCSD                                       07450000
                   ORG   PQSCSD_VOL_ARRAY                               07500000
PQSCSD_ENTRY   DSECT                                                    07550000
PQSCSD_VOL_STATE   DS    0XL2      2 BYTES (16 BITS) OF VOLUME STATE    07600000
*                                  DATA PER DEVICE                      07650000
PQSCSD_VOL_STATE1  DS    X                                              07700000
PQSCSD_VOL_CONFIG  EQU   X'80'     DEVICE IS CONFIGURED                 07750000
PQSCSD_VOL_BASE    EQU   X'40'     DEVICE IS A BASE DEVICE              07800000
PQSCSD_VOL_FENCED  EQU   X'20'     DEVICE IS FENCED                     07850000
PQSCSD_VOL_PINDATA EQU   X'10'     PINNED DATA EXISTS FOR DEVICE        07900000
PQSCSD_VOL_LONGBZ  EQU   X'08'     DEVICE IS LONG BUSY                  07950000
PQSCSD_VOL_WRT_INH EQU   X'04'     DEVICE IS WRITE INHIBITED            08000000
PQSCSD_VOL_ARR_REB EQU   X'02'     DEVICE IS ON AN ARRAY THAT IS        08050000
*                                  REBUILDING                           08100000
PQSCSD_VOL_FAILNVS EQU   X'01'     DEVICE HAS DATA IN FAILED NVS        08150000
*                                                                       08200000
PQSCSD_VOL_STATE2  DS    X                                              08250000
PQSCSD_VOL_SF      EQU   X'80'     DEVICE IN A SOFT FENCED STATE   @SFA 08270000
PQSCSD_VOL_SPID    EQU   X'40'     DEVICE IN A SPID FENCED STATE   @SPA 08280000
*                                                                       08300000
PQSCSD_CS_STATE    DS    0XL2      2 BYTES (16 BITS) OF COPY SERVICES   08350000
*                                  STATE DATA PER DEVICE                08400000
PQSCSD_CS_STATE1   DS    X                                              08450000
PQSCSD_CS_PPRC        EQU   X'80'     PPRC ACTIVE FOR VOLUME            08500000
PQSCSD_CS_PPRC_SEC    EQU   X'40'     DEVICE IS A PPRC SECONDARY        08550000
PQSCSD_CS_PPRC_CASC   EQU   X'20'     DEVICE IS CASCADED PPRC           08600000
PQSCSD_CS_PPRC_CHANG  EQU   X'02'     DEVICE IS PPRC STATE CHANGE       08800000
*                                     PENDING                           08850000
PQSCSD_CS_GM          EQU   X'01'     DEVICE IS IN A GLOBAL MIRROR      08900000
*                                     SESSION                           08950000
*                                                                       09000000
PQSCSD_CS_STATE2   DS    X                                              09050000
PQSCSD_CS_NO_PATHS    EQU   X'80'     NO PPRC PATHS ARE AVAILABLE       09100000
PQSCSD_CS_CC          EQU   X'40'     CONCURRENT COPY ACTIVE FOR THE    09150000
*                                     DEVICE                            09200000
PQSCSD_CS_XRC         EQU   X'20'     XRC IS ACTIVE FOR THE DEVICE      09250000
PQSCSD_CS_XRC_SUSP    EQU   X'10'     XRC IS SUSPENDED OR QUIESCED FOR  09300000
*                                     DEVICE                            09350000
PQSCSD_CS_FLC_SOURCE  EQU   X'08'     DEVICE IS A FLASHCOPY SOURCE      09400000
PQSCSD_CS_FLC_TARGET  EQU   X'04'     DEVICE IS A FLASHCOPY TARGET      09450000
PQSCSD_CS_CAS_FAIL    EQU   X'02'     Cascading PPRC Failover      @SGA 09460000
PQSCSD_CS_SGC_ACTIVE  EQU   X'01'     Safeguarded Copy Relationship@SGA 09470000
*                                                                       09500000
PQSCSD_PPRC_STATE  DS    X                                         @CPA 09555990
PQSCSD_PPRC_STATE_SIMP    EQU X'00'      *SIMPLEX                  @CPA 09561980
PQSCSD_PPRC_STATE_PNDG    EQU X'01'      *PENDING                  @CPA 09567970
PQSCSD_PPRC_STATE_DUP     EQU X'02'      *DUPLEX                   @CPA 09573960
PQSCSD_PPRC_STATE_SUSP03  EQU X'03'      * SUSPENDED BY HOST CMD   @MHA 09574260
*                                        * DIRECTED TO THE PRIMARY @MHA 09574560
PQSCSD_PPRC_STATE_SUSP04  EQU X'04'      * HOST SUSPENDED THE      @MHA 09574860
*                                        * SECONDARY VOLUME        @MHA 09575160
PQSCSD_PPRC_STATE_SUSP05  EQU X'05'      * SUSPENDED BY PRIMARY CU @MHA 09575460
*                                        * UPDATE SECONDARY        @MHA 09575760
PQSCSD_PPRC_STATE_SUSP06  EQU X'06'      * SUSPENDED BY CU INT     @MHA 09576060
*                                        * CONDITIONS              @MHA 09576360
PQSCSD_PPRC_STATE_SUSP07  EQU X'07'      * SUSPENDED DUE TO SEC    @MHA 09576660
*                                        * STATE CHANGE INTERRUPT  @MHA 09576960
PQSCSD_PPRC_STATE_SUSP08  EQU X'08'      * SUSPENDED DUE TO INT    @MHA 09577260
*                                        * CONDITIONS              @MHA 09577560
PQSCSD_PPRC_STATE_SUSP09  EQU X'09'      * SUSPENDED DUE TO IML OR @MHA 09577860
*                                        * POWER RESTORE           @MHA 09578160
PQSCSD_PPRC_STATE_SUSP0A  EQU X'0A'      * SUSPENDED DUE TO HOST   @MHA 09578460
*                                        * ISSUING A FREEZE        @MHA 09578760
PQSCSD_PPRC_STATE_NOT_INIT EQU X'0B'     * VOLUME NOT INSTALLED    @MHA 09579060
*                                        * OR NOT CONFIGURED       @MHA 09579360
PQSCSD_PPRC_STATE_PMSUSP  EQU X'0C'      *SUSPENDED DUE TO PM OP   @CPA 09579950
PQSCSD_PPRC_STATE_PENFC   EQU X'0D'      *PENDING DUE TO FLASHCOPY @02A 09581950
PQSCSD_PPRC_STATE_SUSP0E  EQU X'0E'      * SUSPPENDED DUE TO SPACE @MHA 09582950
*                                        * RELEASE FAILURE ON SEC  @MHA 09583950
PQSCSD_PPRC_STATE_CGSUSP  EQU X'0F'      *SUS DUE TO GM CG PAUSE   @CPA 09585940
PQSCSD_PPRC_STATE_MTIR    EQU X'10'      * MULTI-TARGET INCR       @MHA 09586940
*                                        * RESYNC PAIR             @MHA 09587940
PQSCSD_PPRC_STATE_MEDIAERR EQU X'11'     * SECONDARY VOLUME        @MHA 09588940
*                                        * MEDIA ERRORS            @MHA 09589940
                    DS    XL3       RESERVED FOR FUTURE VOLUME STATES   09591930
PQSCSD_ENTRY_LG        EQU *-PQSCSD_ENTRY                               09600000
*                                                                       09650000
*    ENDS THE CONTROLLER DATA DEVICE INFORMATION                        09700000
*                                                                       09750000
PQSCSR   DSECT                                                          09800000
*                                                                       09850000
*    MAPS THE CONTROLLER DATA RANK INFORMATION                          09900000
*                                                                       09950000
PQSCSR_RANK_COUNT   DS   H          NUMBER OF SETS OF RANK SUMMARY      10000000
*                                   INFORMATION RETURNED                10050000
*    4 BYTES OF RANK SUMMARY INFORMATION IS REPEATED FOR EACH RANK THAT 10100000
*    THE DEVICE OCCUPIES.  THE MAXIMUM NUMBER OF RANKS A VOLUME CAN     10150000
*    OCCUPY IS 384.                                                     10200000
*                                                                       10250000
PQSCSR_ENTRY   DSECT                                                    10300000
PQSCSR_RANK_ID      DS   H          RANK IDENTIFIER                     10350000
PQSCSR_RANK_STATE   DS   X          RANK STATE                          10400000
                    DS   X          RESERVED                            10450000
PQSCSR_RANK_GOOD      EQU  X'00'      RANK STATE IS GOOD                10500000
PQSCSR_RANK_INACC     EQU  X'01'      RANK STATE IS INACCESSIBLE        10550000
*                                     RANK HAS FAILED - MAY BE MULTIPLE 10600000
*                                     DRIVE OR LINK FAILURES            10650000
PQSCSR_RANK_OFFLINE   EQU  X'02'      RANK HAS BEEN TAKEN OFFLINE FOR   10700000
*                                     SERVICE                           10750000
PQSCSR_ENTRY_LG       EQU  *-PQSCSR_ENTRY                               10800000
*                                                                       10850000
*    ENDS THE CONTROLLER DATA RANK INFORMATION                          10900000
*                                                                       10901000
*    MAPS THE CONTROLLER DATA MULTI-TARGET VOLUME INFORMATION      @MTA 10902000
*                                                                  @MTA 10903000
PQSCSM DSECT                                                       @MTA 10904000
PQSCSM_VOL_ARRAY              DS 0CL5120  256 entries              @MTA 10905000
PQSCSM_PRIMARY_RELATIONSHIP_1 DS 0XL4                              @MTA 10906000
PQSCSM_P1_PPRC_STATE          DS  X       VOLUME PPRC STATE        @MTA 10907000
                              DS  X       NOT USED                 @MTA 10908000
PQSCSM_P1_SEC_SSID            DS  H       SECONDARY CU SSID        @MTA 10909000
PQSCSM_PRIMARY_RELATIONSHIP_2 DS 0XL4                              @MTA 10910000
PQSCSM_P2_PPRC_STATE          DS  X       VOLUME PPRC STATE        @MTA 10911000
                              DS  X       NOT USED                 @MTA 10912000
PQSCSM_P2_SEC_SSID            DS  H       SECONDARY CU SSID        @MTA 10913000
PQSCSM_PRIMARY_RELATIONSHIP_3 DS 0XL4                              @MTA 10914000
PQSCSM_P3_PPRC_STATE          DS  X       VOLUME PPRC STATE        @MTA 10915000
                              DS  X       NOT USED                 @MTA 10916000
PQSCSM_P3_SEC_SSID            DS  H       SECONDARY CU SSID        @MTA 10917000
PQSCSM_PRIMARY_RELATIONSHIP_4 DS 0XL4                              @MTA 10918000
PQSCSM_P4_PPRC_STATE          DS  X       VOLUME PPRC STATE        @MTA 10919000
                              DS  X       NOT USED                 @MTA 10920000
PQSCSM_P4_SEC_SSID            DS  H       SECONDARY CU SSID        @MTA 10921000
PQSCSM_SECONDARY_RELATIONSHIP DS 0XL4                              @MTA 10922000
PQSCSM_S_PPRC_STATE           DS  X       VOLUME PPRC STATE        @MTA 10923000
                              DS  X       NOT USED                 @MTA 10924000
PQSCSM_S_PRI_SSID             DS  H       PRIMARY CU SSID          @MTA 10925000
PQSCSM_VOL_ARRAY_ENT_LEN EQU *-PQSCSM_PRIMARY_RELATIONSHIP_1       @MTA 10926000
*                                                                  @MTA 10927000
*    ENDS THE CONTROLLER DATA MULTI-TARGET VOLUME INFORMATION      @MTA 10928000
*                                                                       10950000
*                                                                       11000000
.ZEND    ANOP  ,                                                        11050000
         MEND                                                           11100000
**** END ASM VERSION *************************************************/ 11150000
*/** BEGIN PL/X VERSION *********************************************** 11200000
.*/%PQSCSPLAS2:;                                                        11250000
*                                                                       11300000
*DECLARE                                                                11350000
*%IF PQSCS_BASE = '' %THEN                                              11400000
*  %DO;                                                                 11450000
*  1 ANTPQSCS BASED BDY(DWORD),       /* ...                        */  11500000
*  %END;                                                                11550000
*%ELSE                                                                  11600000
*  %IF PQSCS_BASE = 'NONE' %THEN                                        11650000
*    %DO;                                                               11700000
*  1 ANTPQSCS BDY(DWORD),             /* ...                         */ 11750000
*    %END;                                                              11800000
*  %ELSE                                                                11850000
*    %DO;                                                               11900000
*  1 ANTPQSCS PQSCS_BASE BDY(DWORD),                                    11950000
*    %END;                                                              12000000
*                                                                       12050000
*/*** MAPS THE FRONT MATTER SECTION OF THE PQSCSTAT DATA **/            12100000
*                                                                       12150000
*    3 PQSCS_HEADER      BDY(DWORD),     /* BEGIN PARM LIST          */ 12200000
*      5 PQSCS_EYE           CHAR(8),    /* EYECATCHER C'ANTPQSCS'   */ 12250000
*      5 PQSCS_VRL           FIXED(32),  /* VERS, RLS, LVL, RSRVD    */ 12300000
*      5 *                   FIXED(32),  /*                          */ 12350000
*      5 PQSCS_LEN           FIXED(31),  /* ANTPQSCS HEADER LEN      */ 12400000
*      5 *,                              /* LEN DATA FROM CONTROLLER */ 12450000
*        7 PQSCS_PQSCSF_LEN    FIXED(31),/*                          */ 12500000
*        7 PQSCS_PQSCSH_LEN    FIXED(31),/*                          */ 12550000
*        7 PQSCS_PQSCSL_LEN    FIXED(31),/*                          */ 12600000
*        7 PQSCS_PQSCSD_LEN    FIXED(31),/*                          */ 12650000
*        7 PQSCS_PQSCSR_LEN    FIXED(31),/*                          */ 12700000
*        7 *                   FIXED(31),/*                          */ 12750000
*        7 *                   FIXED(31),/*                          */ 12800000
*                                                                       12850000
*/*** COMMAND SPECIFIC INFORMATION ***/                                 12900000
*                                                                       12950000
*    3 PQSCS_IN_DEVN       FIXED(16),  /* DEVICE NUMBER SPECIFIED    */ 13000000
*    3 *                   FIXED(16),  /*                            */ 13050000
*    3 PQSCS_IN_DVC        CHAR(1),    /* DEVICE TO BE QUERIED CCA   */ 13100000
*    3 PQSCS_IN_LSS        CHAR(1),    /* DEVICE TO BE QUERIED LSS   */ 13150000
*    3 PQSCS_IN_SSID       CHAR(2),    /* DEVICE SSID                */ 13200000
*    3 PQSCS_IN_SERIAL     CHAR(12),   /* DEVICE SERIAL              */ 13250000
*      5 *                   CHAR(2),  /*                            */ 13300000
*      5 PQSCS_IN_SER_ESS    CHAR(10), /* ESS STYLE S/N              */ 13350000
*    3 *                   CHAR(4),    /* RESERVED                   */ 13400000
*    3 PQSCS_IN_FLAGS      BIT(32),    /* FLAGS                      */ 13450000
*      5 PQSCS_IN_FLAGS1     BIT(8),   /* FLAG BYTE 0                */ 13500000
*        7 PQSCS_SCOPE_LSS     BIT(1), /* SCOPE IS LSS ONLY          */ 13550000
*        7 PQSCS_SCOPE_RANK    BIT(1), /* SCOPE IS RANK              */ 13600000
*        7 PQSCS_OPENDVCS      BIT(1), /* FB DVCS SPECIFIED          */ 13650000
*        7 PQSCS_PPRC_STATE_VALID BIT(1), /* PQSCSD_PPRC_STATE IS@01A*/ 13709990
*                                         /* VALID               @01A*/ 13719980
*        7 *                   BIT(4), /*                        @01C*/ 13729970
*      5 PQSCS_IN_FLAGS2     BIT(8),   /* FLAG BYTE 2                */ 13750000
*      5 PQSCS_IN_FLAGS3     BIT(8),   /* FLAG BYTE 3                */ 13800000
*      5 PQSCS_IN_FLAGS4     BIT(8),   /* FLAG BYTE 4                */ 13850000
*    3 *                   CHAR(28),   /*                            */ 13900000
*                                      /*                            */ 13950000
*/*** END OF FRONT MATTER, BEGIN CONTROLLER DATA ***/                   14000000
*                                                                       14050000
*/*** MAPS THE CONTROLLER DATA HEADER INFORMATION ***/                  14100000
*  2 PQSCSH,                           /*                            */ 14150000
*    3 PQSCSH_DATA_LEN     FIXED(16),  /*TOTAL LENTH OF RETURNED DATA*/ 14200000
*    3 PQSCSH_FLAGS        BIT(16),    /* QUERY HEADER FLAGS         */ 14250000
*      5 PQSCSH_FLAGS1       BIT(8),   /* QUERY HEADER FLAG BYTE 1   */ 14300000
*        7 PQSCS_LSS_VALID     BIT(1), /* LSS DATA IS VALID          */ 14350000
*        7 PQSCS_RANK_VALID    BIT(1), /* RANK DATA IS VALID         */ 14400000
*        7 PQSCS_MT_VALID      BIT(1), /* MULTI TARGET VALID     @MTA*/ 14459990
*        7 *                   BIT(5), /*                        @MTC*/ 14469980
*      5 PQSCSH_FLAGS2       BIT(8),   /* QUERY HEADER FLAG BYTE 2   */ 14500000
*    3 PQSCSH_SCI_TYPE     CHAR(6),    /* IMAGE TYPE (EBCDIC)        */ 14550000
*    3 PQSCSH_SCI_MODEL    CHAR(3),    /* IMAGE MODEL (EBCDIC)       */ 14600000
*    3 PQSCSH_SCI_SEQ      CHAR(10),   /* IMAGE SEQUENCE NUMBER      */ 14650000
*    3 PQSCSH_SCI_WWNN     CHAR(8),    /* IMAGE WORLD WIDE NODE      */ 14700000
*    3 PQSCSH_VERSION      BIT(8),     /* VERSION OF CONTR DATA X'01'*/ 14750000
*                                                                       14800000
*/*** END OF CONTROLLER DATA HEADER INFORMATION ***/                    14850000
*                                                                       14900000
*/*** MAPS THE CONTROLLER DATA LSS INFORMATION ***/                     14950000
*  2 PQSCSL,                           /*                            */ 15000000
*    3 PQSCSL_FLAGS        BIT(16),    /*                            */ 15050000
*      5 PQSCSL_FLAGS1       BIT(8),   /*                            */ 15100000
*        7 PQSCSL_DUAL_CL      BIT(1), /* DUAL CLUSTER MODE          */ 15150000
*        7 *                   BIT(7), /*                            */ 15200000
*      5 PQSCSL_FLAGS2       BIT(8),   /*                            */ 15250000
*    3 PQSCL_CKD_BITMAP    CHAR(32),   /* REPRESENT LSS CONFIG AS CKD*/ 15300000
*    3 PQSCL_FB_BITMAP     CHAR(32),   /* REPRESENT LSS CONFIG AS FB */ 15350000
*                                                                       15400000
*/*** ENDS THE CONTROLLER DATA LSS INFORMATION ***/                     15450000
*                                                                       15500000
*/*** MAPS THE CONTROLLER DATA DEVICE INFORMATION ***/                  15550000
*  2 PQSCSD,                           /*                            */ 15600000
*    3 PQSCSD_VOL_ARRAY(256),          /* 8 BYTES PER DEVICE         */ 15650000
*     4 PQSCSD_VOL_STATE   BIT(16),    /* 2 BYTES OF VOLUME STATE    */ 15700000
*      5 PQSCSD_VOL_STATE1   BIT(8),   /*                            */ 15750000
*        7 PQSCSD_VOL_CONFIG   BIT(1), /* IS CONFIGURED              */ 15800000
*        7 PQSCSD_VOL_BASE     BIT(1), /* A BASE DEVICE              */ 15850000
*        7 PQSCSD_VOL_FENCED   BIT(1), /* IS FENCED                  */ 15900000
*        7 PQSCSD_VOL_PINDATA  BIT(1), /* PINNED DATA EXISTS         */ 15950000
*        7 PQSCSD_VOL_LONGBZ   BIT(1), /* IS LONG BUSY               */ 16000000
*        7 PQSCSD_VOL_WRT_INH  BIT(1), /* IS WRITE INHIBITED         */ 16050000
*        7 PQSCSD_VOL_ARR_REB  BIT(1), /* IS ON AN ARRAY THAT IS     */ 16100000
*                                      /* REBUILDING                 */ 16150000
*        7 PQSCSD_VOL_FAILNVS  BIT(1), /* HAS DATA IN FAILED NVS     */ 16200000
*      5 PQSCSD_VOL_STATE2   BIT(8),   /*                            */ 16250000
*        7 PQSCSD_VOL_SF       BIT(1), /* SOFT FENCED STATE      @SFA*/ 16260000
*        7 PQSCSD_VOL_SPID     BIT(1), /* SPID FENCED STATE      @SPA*/ 16279990
*        7 *                   BIT(6), /*                        @SPA*/ 16289980
*     4 PQSCSD_CS_STATE    BIT(16),    /* 2 BYTES OF CS STATE DATA   */ 16300000
*      5 PQSCSD_CS_STATE1    BIT(8),   /*                            */ 16350000
*        7 PQSCSD_CS_PPRC      BIT(1), /* PPRC ACTIVE FOR VOLUME     */ 16400000
*        7 PQSCSD_CS_PPRC_SEC  BIT(1), /* A PPRC SECONDARY           */ 16450000
*        7 PQSCSD_CS_PPRC_CASC BIT(1), /* CASCADED PPRC              */ 16500000
*        7 *                   BIT(1), /* NOT USED.              @MTC*/ 16579990
*        7 *                   BIT(1), /* NOT USED.              @MTC*/ 16609980
*        7 *                   BIT(1), /* NOT USED.              @MTC*/ 16639970
*        7 PQSCSD_CS_PPRC_CHANG BIT(1),/* PPRC STATE CHANGE PENDI@SGC*/ 16719990
*        7 PQSCSD_CS_GM        BIT(1), /* DEVICE IS IN A GM SESSION  */ 16750000
*      5 PQSCSD_CS_STATE2    BIT(8),   /*                            */ 16800000
*        7 PQSCSD_CS_NO_PATHS  BIT(1), /* NO PPRC PATHS ARE AVAILABLE*/ 16850000
*        7 PQSCSD_CS_CC        BIT(1), /* CONCURRENT COPY ACTIVE     */ 16900000
*        7 PQSCSD_CS_XRC       BIT(1), /* XRC IS ACTIVE              */ 16950000
*        7 PQSCSD_CS_XRC_SUSP  BIT(1), /* XRC SUSPENDED OR QUIESCED  */ 17000000
*        7 PQSCSD_CS_FLC_SOURCE BIT(1), /* A FLASHCOPY SOURCE        */ 17050000
*        7 PQSCSD_CS_FLC_TARGET BIT(1), /* A FLASHCOPY TARGET        */ 17100000
*        7 PQSCSD_CS_CAS_FAIL   BIT(1), /* CAS FAILOVER          @SGA*/ 17159990
*        7 PQSCSD_CS_SGC_ACTIVE BIT(1), /* Safeguarded Copy      @SGC*/ 17169980
*     4 PQSCSD_PPRC_STATE  CHAR(1),    /* VOLUME PPRC STATE      @CPA*/ 17209990
*     4 *                  CHAR(3),    /* RESERVED               @CPC*/ 17219980
*                                                                       17250000
*/*** ENDS THE CONTROLLER DATA DEVICE INFORMATION ***/                  17300000
*                                                                       17350000
*/*** MAPS THE CONTROLLER DATA RANK INFORMATION ***/                    17400000
*  2 PQSCSR,                           /*                            */ 17450000
*    3 PQSCSR_RANK_COUNT   FIXED(16),  /* NUMBER OF SETS OF RANK     */ 17500000
*                                      /* INFORMATION RETURNED       */ 17550000
*/********************************************************************/ 17600000
*/*** 4 BYTES OF RANK SUMMARY INFORMATION IS REPEATED              ***/ 17650000
*/*** FOR EACH RANK THAT THE DEVICE OCCUPIES.  THE MAXIMUM         ***/ 17700000
*/*** NUMBER OF RANKS A VOLUME CAN OCCUPY IS 384.                  ***/ 17750000
*/********************************************************************/ 17800000
*                                                                       17850000
*    3 PQSCSR_RANK_ID      FIXED(16),  /*  RANK IDENTIFIER           */ 17900000
*    3 PQSCSR_RANK_STATE   BIT(8),     /*  RANK STATE                */ 17950000
*                     /*   X'00' RANK STATE IS GOOD                  */ 18000000
*                     /*   X'01' RANK STATE IS INACCESSIBLE          */ 18050000
*                     /*         RANK HAS FAILED - MAY BE MULTIPLE   */ 18100000
*                     /*         DRIVE OR LINK FAILURES              */ 18150000
*                     /*   X'02' RANK HAS BEEN TAKEN OFFLINE FOR     */ 18200000
*                     /*         SERVICE                             */ 18250000
*    3 *                   CHAR(1),    /* RESERVED                   */ 18319990
*/*** ENDS THE CONTROLLER DATA RANK INFORMATION ***/                    18350000
*                                                                       18351000
*/*** MAPS THE CONTROLLER DATA MULTI-TARGET VOLUME INFORMATION * @MTA*/ 18352000
*  2 PQSCSM,                           /*                        @MTA*/ 18353000
*   3 PQSCSM_VOL_ARRAY(256),           /*                        @MTA*/ 18354000
*    4 PQSCSM_PRIMARY_RELATIONSHIP_1,  /*                        @MTA*/ 18355000
*      5 PQSCSM_P1_PPRC_STATE CHAR(1), /* VOLUME PPRC STATE      @MTA*/ 18356000
*      5 *                    CHAR(1), /* NOT USED               @MTA*/ 18357000
*      5 PQSCSM_P1_SEC_SSID   CHAR(2), /* SECONDARY CU SSID      @MTA*/ 18358000
*    4 PQSCSM_PRIMARY_RELATIONSHIP_2,  /*                        @MTA*/ 18359000
*      5 PQSCSM_P2_PPRC_STATE CHAR(1), /* VOLUME PPRC STATE      @MTA*/ 18360000
*      5 *                    CHAR(1), /* NOT USED               @MTA*/ 18361000
*      5 PQSCSM_P2_SEC_SSID   CHAR(2), /* SECONDARY CU SSID      @MTA*/ 18362000
*    4 PQSCSM_PRIMARY_RELATIONSHIP_3,  /*                        @MTA*/ 18363000
*      5 PQSCSM_P3_PPRC_STATE CHAR(1), /* VOLUME PPRC STATE      @MTA*/ 18364000
*      5 *                    CHAR(1), /* NOT USED               @MTA*/ 18365000
*      5 PQSCSM_P3_SEC_SSID   CHAR(2), /* SECONDARY CU SSID      @MTA*/ 18366000
*    4 PQSCSM_PRIMARY_RELATIONSHIP_4,  /*                        @MTA*/ 18367000
*      5 PQSCSM_P4_PPRC_STATE CHAR(1), /* VOLUME PPRC STATE      @MTA*/ 18368000
*      5 *                    CHAR(1), /* NOT USED               @MTA*/ 18369000
*      5 PQSCSM_P4_SEC_SSID   CHAR(2), /* SECONDARY CU SSID      @MTA*/ 18370000
*    4 PQSCSM_SECONDARY_RELATIONSHIP,  /*                        @MTA*/ 18371000
*      5 PQSCSM_S_PPRC_STATE CHAR(1),  /* VOLUME PPRC STATE      @MTA*/ 18372000
*      5 *                    CHAR(1), /* NOT USED               @MTA*/ 18373000
*      5 PQSCSM_S_PRI_SSID   CHAR(2);  /* PRIMARY CU SSID        @MTA*/ 18374000
*/*** ENDS THE CONTROLLER DATA MULTI-TARGET VOLUME INFORMATION * @MTA*/ 18375000
*                                                                       18400000
*/*** CONSTANTS FOR EYE-CATCHERS ***/                                   18450000
*                                                                       18500000
*DECLARE                                                                18550000
*  PQSCS_EYE_CONSTANT CHAR(8)                                           18600000
*    CONSTANT('ANTPQSCS');               ] ACRONYM                      18650000
*DECLARE                                                                18700000
*  PQSCS_VRL_CONSTANT CHAR(4)                                           18750000
*    CONSTANT('01010000'X);              ] VERSION-RELEASE-LEVEL        18800000
*                                                                       18850000
*/** END PL/X VERSION ************************************************/ 18900000
