*%GOTO PFCCIPLAS1;/*                                                    00050000
         MACRO                                                          00100000
&LAB     ANTPFCCI                                                       00150000
.*/%PFCCIPLAS1:;                                                        00200000
*/** Start of Specifications  ***************************************/  00250000
*/*                                                                 */  00300000
*/* $MAC(ANTPFCCI) COMP(DF117) PROD(SDM):                           */  00350000
*/*                                                                 */  00400000
*/* Descriptive Name = ANTRQST PQUERY PATHS(LNK) Output data map     */ 00450000
*/*                    structure                                    */  00500000
*/*                                                                 */  00550000
*/*                                                                 */  00600000
*/*******************************************************************/  00650000
*/*                                                                 */  00700000
*/*PROPRIETARY V3 STATEMENT                                         */  00750000
*/*Licensed Materials - Property of IBM                             */  00800000
*/*"Restricted Materials of IBM"                                    */  00850000
*/*5694-A01                                                         */  00900000
*/*Copyright IBM Corp. 2011                                         */  00950000
*/*END PROPRIETARY V3 STATEMENT                                     */  01000000
*/*                                                                 */  01050000
*/*******************************************************************/  01100000
*/*                                                                 */  01150000
*/* Function = This macro maps the output fields in the             */  01200000
*/*            parameter area pointed to by the QRYINFO keyword     */  01250000
*/*            in the ANTRQST PQUERY PATHS(LNK) request.             */ 01300000
*/*                                                                 */  01350000
*/* Notes =    The ANTRQST REQUEST=PQUERY QRYINFO parameter has     */  01400000
*/*            the name of an area mapped by this macro. The        */  01450000
*/*            QRYINFO data has the mapping described below.        */  01500000
*/*            In this format, the data is not converted to         */  01550000
*/*            character strings usable by REXX.                    */  01600000
*/*                                                                 */  01650000
*/*            When ANTRQST returns to the caller, and the          */  01700000
*/*            RETINFO return and reason code are zero, the         */  01750000
*/*            QRYINFO area will have data located as described     */  01800000
*/*            below.                                               */  01850000
*/*                                                                 */  01900000
*/*                                                                 */  01950000
*/*                                                                 */  02000000
*/* Linkage = %INCLUDE SYSLIB(ANTPFCCI)                             */  02050000
*/*                                                                 */  02100000
*/* Input = "%PFCCI_BASE" can be used to change the default basing  */  02150000
*/*         attribute of the control block.  "%PFCCI_BASE = 'NONE'" */  02200000
*/*         will cause the declare to not be based.  "%PFCCI_BASE = */  02250000
*/*         'BASED(R1)'" will cause the declare to be based on R1.  */  02300000
*/*                                                                 */  02350000
*/* Change Activity =                                               */  02400000
*/*                                                                 */  02450000
*/*  $L0=Initial,HDZ1D10,100713,TUCNPS: Initial support             */  02500000
*/*                                                                 */  02550000
*/** END OF SPECIFICATIONS ******************************************/  02600000
*%GOTO PFCCIPLAS2;/*                                                    02650000
PFCCIF   DSECT                                                          02700000
*                                                                       02750000
*    MAPS THE FRONT MATTER SECTION OF THE PFCCITAT DATA                 02800000
*                                                                       02850000
PFCCI_EYE          DS    CL8       EYECATCHER C'ANTPFCCI'               02900000
PFCCI_VRL          DS    0XL4      VERSION/RELEASE/LEVEL                02950000
PFCCI_VER          DS    X                                              03000000
PFCCI_REL          DS    X                                              03050000
PFCCI_LVL          DS    X                                              03100000
                   DS    X                                              03150000
                   DS    4X                                             03200000
PFCCI_PFCCIA_OFFS  DS    F         OFFSET TO PFCCIA DSECT               03300000
PFCCI_PFCCIB_OFFS  DS    F         OFFSET TO PFCCIB DSECT               03350000
PFCCI_PFCCIC_OFFS  DS    F         OFFSET TO PFCCIC DSECT               03400000
PFCCI_PFCCID_OFFS  DS    F         OFFSET TO PFCCID DSECT               03450000
                   DS    3F                                             03500000
PFCCI_LEN          DS    F         LENGTH OF ANTPFCCI SPECIFIC HEADER   03550000
*                                  INFO AND DATA RETURNED FROM          03600000
*                                  THE CONTROLLER                       03650000
*                                  (LENGTH OF DSECTS PFCCIF, PFCCIA,    03700000
*                                  PFCCIB, PFCCIC AND PFCCID)           03750000
PFCCIA             DSECT                                                03800000
*                                                                       03850000
*    START OF DATA MAPPING PART A                                       03900000
*                                                                       03950000
PFCCIA_DATA_LEN    DS    F         TOTAL LENGTH OF CONTROLLER RETURNED  04000000
*                                  DATA                                 04050000
PFCCIA_FLAGS       DS    0XL2      FLAGS                                04100000
PFCCIA_FLAGS1      DS    X         FLAG BYTE 1                          04150000
PFCCIA_NO_PSA      EQU   X'80'     NO PRIMARY STORAGE ADAPTERS          04200000
*                                  AVAILABLE FOR CONNECTION             04250000
PFCCIA_NO_SSA      EQU   X'40'     NO SECONDARY STORAGE ADAPTERS        04300000
*                                  AVAILABLE FOR CONNECTION             04350000
PFCCIA_FLAGS2      DS    X         FLAG BYTE 2                          04400000
PFCCIA_NBR_SSA     DS    H         MAXIMUM NUMBER OF SECONDARY STORAGE  04450000
*                                  ADAPTERS AVAILABLE FOR CONNECTION.   04500000
PFCCIA_PWWNN       DS    CL8       WORLD WIDE NODE NAME OF PRIMARY      04550000
*                                  CONTROLLER                           04600000
PFCCIA_SWWNN       DS    CL8       WORLD WIDE NODE NAME OF SECONDARY    04650000
*                                  CONTROLLER                           04700000
PFCCI_PARTB        DS    0X        PART B ENTRIES FOLLOW                04750000
*                                                                       04800000
*    END OF PART A                                                      04850000
*                                                                       04900000
PFCCIB             DSECT                                                04950000
*                                                                       05000000
*    START OF DATA MAPPING PART B                                       05050000
*                                                                       05100000
PFCCIB_SAID        DS    CL2       ARRAY ENTRY FOR SECONDARY STORAGE    05150000
*                                  ADAPTER IDS. NUMBER OF ENTRIES IS    05200000
*                                  PFCCIA_NBR_SSA.                      05250000
PFCCI_PARTC        DS    0X        PART C ENTRIES FOLLOW                05300000
*                                                                       05350000
*    END OF PART B                                                      05400000
*                                                                       05450000
PFCCIC             DSECT                                                05500000
*                                                                       05550000
*    START OF DATA MAPPING PART C                                       05600000
*                                                                       05650000
PFCCIC_NBR_PSA     DS    H         NUMBER OF PRIMARY STORAGE ADAPTERS   05700000
*                                  THAT HAVE A POTENTIAL CONNECTION TO  05750000
*                                  THE SECONDARY CONTROLLER.            05800000
                   DS    H                                              05850000
PFCCI_PARTD        DS    0X        PART D ENTRIES FOLLOW                05900000
*                                                                       05950000
*    END OF PART C                                                      06000000
*                                                                       06050000
PFCCID             DSECT                                                06100000
*                                                                       06150000
*    START OF DATA MAPPING PART D                                       06200000
*                                                                       06250000
PFCCID_PAID        DS    CL2                                            06300000
PFCCID_STATUS      DS    XL2                                            06350000
PFCCID_POT_CONN    EQU   X'0000'                                        06400000
PFCCID_NO_CONN     EQU   X'0001'                                        06450000
PFCCID_OFFLINE     EQU   X'0002'                                        06500000
PFCCID_LINK_FAIL   EQU   X'0003'                                        06550000
PFCCID_INV_TOP     EQU   X'0004'                                        06600000
PFCCID_ERRORS      EQU   X'0005'                                        06650000
PFCCID_INV_SWWNN   EQU   X'0006'                                        06700000
PFCCID_TIMEOUT     EQU   X'0007'                                        06750000
*                                                                       06800000
PFCCID_SSA_BITMAP  DS    CL32                                           06850000
*                                                                       06900000
*    END OF PART D                                                      06950000
*                                                                       07000000
*                                                                       07050000
.ZEND    ANOP  ,                                                        07100000
         MEND                                                           07150000
**** End ASM version *************************************************/ 07200000
*/** Begin PL/X version *********************************************** 07250000
.*/%PFCCIPLAS2:;                                                        07300000
*                                                                       07350000
*DECLARE                                                                07400000
*%IF PFCCI_BASE = '' %THEN                                              07450000
*  %DO;                                                                 07500000
*  1 ANTPFCCI BASED BDY(DWORD),       /* ...                        */  07550000
*  %END;                                                                07600000
*%ELSE                                                                  07650000
*  %IF PFCCI_BASE = 'NONE' %THEN                                        07700000
*    %DO;                                                               07750000
*  1 ANTPFCCI BDY(DWORD),             /* ...                         */ 07800000
*    %END;                                                              07850000
*  %ELSE                                                                07900000
*    %DO;                                                               07950000
*  1 ANTPFCCI PFCCI_BASE BDY(DWORD),                                    08000000
*    %END;                                                              08050000
*                                                                       08100000
*/*** MAPS THE FRONT MATTER SECTION OF THE PFCCI DATA **/               08150000
*                                                                       08200000
*    3 PFCCI_HEADER      BDY(DWORD),     /* BEGIN PARM LIST          */ 08250000
*      5 PFCCI_EYE           CHAR(8),    /* EYECATCHER C'ANTPFCCI'   */ 08300000
*      5 PFCCI_VRL           FIXED(32),  /* VERS, RLS, LVL, RSRVD    */ 08350000
*        7 PFCCI_VER           FIXED(8), /* Version                  */ 08362500
*        7 PFCCI_REL           FIXED(8), /* Release                  */ 08375000
*        7 PFCCI_LVL           FIXED(8), /* Level                    */ 08387500
*      5 *                   FIXED(32),  /*                          */ 08400000
*      5 *,                              /* LEN DATA FROM CONTROLLER */ 08450000
*        7 PFCCI_PFCCIA_OFFS   FIXED(31),/* OFFSET TO PFCCIA DSECT   */ 08550000
*        7 PFCCI_PFCCIB_OFFS   FIXED(31),/* OFFSET TO PFCCIB DSECT   */ 08600000
*        7 PFCCI_PFCCIC_OFFS   FIXED(31),/* OFFSET TO PFCCIC DSECT   */ 08650000
*        7 PFCCI_PFCCID_OFFS   FIXED(31),/* OFFSET TO PFCCID DSECT   */ 08700000
*        7 *                   FIXED(31),/*                          */ 08750000
*        7 *                   FIXED(31),/*                          */ 08800000
*        7 *                   FIXED(31),/*                          */ 08825000
*      5 PFCCI_LEN           FIXED(31);  /* ANTPFCCI HEADER LEN      */ 08850000
*                                                                       08900000
*/*** END OF FRONT MATTER, BEGIN CONTROLLER DATA ***/                   08950000
*                                                                       09000000
*/*** START OF DATA MAPPING PART A                ***/                  09050000
*                                                                       09100000
*DECLARE                                                                09150000
*  1 PFCCIA  BASED(PFCCIA_PTR),        /*                            */ 09200000
*    3 PFCCIA_DATA_LEN     FIXED(31),  /*                            */ 09250000
*    3 PFCCIA_FLAGS        BIT(16),    /*                            */ 09300000
*      5 PFCCIA_FLAGS1       BIT(8),   /*                            */ 09350000
*        7 PFCCIA_NO_PSA       BIT(1), /*                            */ 09400000
*        7 PFCCIA_NO_SSA       BIT(1), /*                            */ 09450000
*        7 *                   BIT(6), /*                            */ 09500000
*      5 PFCCIA_FLAGS2       BIT(8),   /*                            */ 09550000
*    3 PFCCIA_NBR_SSA      FIXED(15),  /*                            */ 09600000
*    3 PFCCIA_PWWNN        CHAR(8),    /*                            */ 09650000
*    3 PFCCIA_SWWNN        CHAR(8);    /*                            */ 09700000
*                                                                       09750000
*/*** END OF PART A                             ***/                    09800000
*                                                                       09850000
*/*** START OF DATA MAPPING PART B                ***/                  09900000
*                                                                       09950000
*DECLARE                                                                10000000
*  1 PFCCIB(256)  BASED(PFCCIB_PTR),        /*                       */ 10050000
*    3 PFCCIB_SAID       CHAR(2);      /*                            */ 10100000
*                                                                       10150000
*/*** END OF PART B                             ***/                    10200000
*                                                                       10250000
*/*** START OF DATA MAPPING PART C                ***/                  10300000
*                                                                       10350000
*DECLARE                                                                10400000
*  1 PFCCIC  BASED(PFCCIC_PTR),        /*                            */ 10450000
*    3 PFCCIC_NBR_PSA      FIXED(15),  /*                            */ 10500000
*    3 *                   CHAR(2);                                     10550000
*                                                                       10600000
*/*** END OF PART C                             ***/                    10650000
*                                                                       10700000
*/*** START OF DATA MAPPING PART D                ***/                  10750000
*                                                                       10800000
*DECLARE                                                                10850000
*  1 PFCCID  BASED(PFCCID_PTR),        /*                            */ 10900000
*    3 PFCCID_FIXED,                                                    10950000
*      5 PFCCID_PAID       CHAR(2),    /*                            */ 11000000
*      5 PFCCID_STATUS     FIXED(16),  /*                            */ 11050000
*        7 PFCCID_STATC    CHAR(2),    /*                            */ 11100000
*    3 PFCCID_BITMAP       CHAR(32);   /*                            */ 11150000
*                                                                       11200000
*/*** END OF PART D                             ***/                    11250000
*                                                                       11300000
*/*** CONSTANTS FOR EYE-CATCHERS ***/                                   11350000
*                                                                       11400000
*DECLARE                                                                11450000
*  PFCCIA_PTR  PTR(31),                                                 11550000
*  PFCCIB_PTR  PTR(31),                                                 11600000
*  PFCCIC_PTR  PTR(31),                                                 11650000
*  PFCCID_PTR  PTR(31);                                                 11700000
*                                                                       11750000
*DECLARE                                 ] MAX NUMBER OF PRIMARY        11762500
*  PFCCI_MAX_SAIDS    FIXED(32)          ] STORAGE IDS AND SECONDARY    11775000
*    CONSTANT(256);                      ] STORAGE IDS EACH             11787500
*DECLARE                                                                11800000
*  PFCCI_EYE_CONSTANT CHAR(8)                                           11850000
*    CONSTANT('ANTPFCCI');               ] ACRONYM                      11900000
*DECLARE                                                                11950000
*  PFCCI_VER_CONSTANT CHAR(1)                                           11966600
*    CONSTANT('01'X);                    ] VERSION                      11983200
*DECLARE                                                                11999800
*  PFCCI_REL_CONSTANT CHAR(1)                                           12016400
*    CONSTANT('01'X);                    ] RELEASE                      12033000
*DECLARE                                                                12049600
*  PFCCI_LVL_CONSTANT CHAR(1)                                           12066200
*    CONSTANT('00'X);                    ] LEVEL                        12082800
*                                                                       12100000
*/** END PL/X VERSION ************************************************/ 12150000
