*%GOTO QHAPLAS1;/*                                                      00000500
         MACRO                                                          00000990
&LAB     ANTQHA                                                         00001480
.*/%QHAPLAS1:;                                                          00001970
*/** START OF SPECIFICATIONS  ***************************************/  00002460
*/*                                                                 */  00002950
*/* $MAC(ANTQHA) COMP(DF117) PROD(SDM):                             */  00003440
*/*                                                                 */  00003930
*/* DESCRIPTIVE NAME = ANTRQST QHA OUTPUT DATA MAP STRUCTURE        */  00004420
*/*                                                                 */  00004910
*/*                                                                 */  00005400
*/*******************************************************************/  00005890
*/*                                                                 */  00006380
*/*PROPRIETARY V3 STATEMENT                                         */  00006870
*/*"Restricted Materials of IBM"                                    */  00007070
*/*LICENSED MATERIALS - PROPERTY OF IBM                             */  00007360
*/*5650-ZOS                                                         */  00008240
*/*COPYRIGHT IBM CORP. 2010,2014                                    */  00008630
*/*END PROPRIETARY V3 STATEMENT                                     */  00009320
*/*                                                                 */  00009810
*/*******************************************************************/  00010300
*/*                                                                 */  00010790
*/* FUNCTION = THIS MACRO MAPS THE OUTPUT FIELDS IN THE             */  00011280
*/*            PARAMETER AREA POINTED TO BY THE QRYINFO KEYWORD     */  00011770
*/*            IN THE ANTRQST QHA REQUEST.                          */  00012260
*/*                                                                 */  00012750
*/* NOTES =    THE ANTRQST REQUEST=QHA QRYINFO PARAMETER HAS        */  00013240
*/*            THE NAME OF AN AREA MAPPED BY THIS MACRO. THE        */  00013730
*/*            QRYINFO DATA HAS THE MAPPING DESCRIBED BELOW.        */  00014220
*/*            IN THIS FORMAT, THE DATA IS NOT CONVERTED TO         */  00014710
*/*            CHARACTER STRINGS USABLE BY REXX.                    */  00015200
*/*                                                                 */  00015690
*/*            WHEN ANTRQST RETURNS TO THE CALLER, AND THE          */  00016180
*/*            RETINFO RETURN AND REASON CODE DO NOT INDICATE       */  00016670
*/*            AN I/O ERROR QRYINFO AREA WILL HAVE THE DATA         */  00017160
*/*            AS DESCRIBED BELOW.                                  */  00017650
*/*                                                                 */  00018140
*/*                                                                 */  00018630
*/*                                                                 */  00019120
*/* LINKAGE = %INCLUDE SYSLIB(ANTQHA)                               */  00019610
*/*                                                                 */  00020100
*/* INPUT = "%QHA_BASE" CAN BE USED TO CHANGE THE DEFAULT BASING    */  00020590
*/*         ATTRIBUTE OF THE CONTROL BLOCK.  "%QHA_BASE = 'NONE'"   */  00021080
*/*         WILL CAUSE THE DECLARE TO NOT BE BASED.  "%QHA_BASE =   */  00021570
*/*         'BASED(R1)'" WILL CAUSE THE DECLARE TO BE BASED ON R1.  */  00022060
*/*                                                                 */  00022550
*/* CHANGE ACTIVITY =                                               */  00023040
*/*                                                                 */  00023530
*/*  $QH=OA40509,HDZ1B10,130130,TUCCGS: QUERY HOST ACCESS       @QHA*/  00024020
*/*  $SP=OA42677,HDZ1C10,130711,TUCCGS: SPID FENCE              @SPA*/  00024220
*/*                                                                 */  00024510
*/** END OF SPECIFICATIONS ******************************************/  00025000
*%GOTO QHAPLAS2;/*                                                      00025490
ANTQHA             DSECT                                                00025980
*                                                                       00026470
*    MAPS THE FRONT MATTER SECTION OF THE QHA DATA                      00026960
*                                                                       00027450
QHA_EYE            DS    CL8       EYECATCHER C'ANTQHA'                 00027940
QHA_VRL            DS    0XL4      VERSION/RELEASE/LEVEL                00028430
QHA_VER            DS    X                                              00028920
QHA_REL            DS    X                                              00029410
QHA_LVL            DS    X                                              00029900
                   DS    X                                              00030390
                   DS    4X                                             00030880
QHA_TOTAL_LEN      DS    F         TOTAL LEN OF RETURNED                00031370
*                                  PLUS THE HEADER LENGTH               00031860
*    COMMAND SPECIFIC INFORMATION                                       00032350
*                                                                       00032840
QHA_IN_DEVN        DS    H         DEVICE NUMBER SPECIFIED              00033330
                   DS    H                                              00033820
QHA_IN_DVC         DS    X         DEVICE TO BE QUERIED CCA             00034310
QHA_IN_LSS         DS    X         DEVICE TO BE QUERIED LSS             00034800
QHA_IN_SSID        DS    H         SSID OF DEVICE IN DEVN               00035290
QHA_IN_SERIAL      DS    0CL12     DEVICE SERIAL                        00035780
                   DS    2C        RESERVED                             00036270
QHA_IN_SER_ESS     DS    CL10      ESS STYLE S/N                        00036760
                   DS    CL4       RESERVED                             00037250
*                                                                       00037740
*    END OF FRONT MATTER, BEGIN CONTROLLER DATA                         00038230
*                                                                       00038720
*                                                                       00039210
*    MAPS THE CONTROLLER DATA HEADER INFORMATION                        00039700
*                                                                       00040190
QHAH     DSECT                                                          00040680
QHAH_FLAGS         DS    X         HOST FLAGS                           00041170
QHAH_HAI           DS    X         HOST ACCESS INFORMATION              00041660
QHA_HAI_VER01      EQU   X'01'     Version 01                   @SPA    00041760
QHA_HAI_VER02      EQU   X'02'     Version 02                   @SPA    00041860
QHAH_DATA_CKD_LEN  DS    H         LENGTH OF CKD HAI                    00042150
QHAH_DATA_SCSI_LEN DS    H         LENGTH OF SCSI HAI                   00042640
                   DS    CL10      NOT USED                             00043130
*                                                                       00043620
*    END OF CONTROLLER DATA HEADER INFORMATION                          00044110
*                                                                       00044600
*                                                                       00045090
*    MAPS CKD HOST ACCESS INFORMATION                                   00045580
*                                                                       00046070
QHA_CKD            DSECT                                                00046560
QHA_CKD_FLAGS      DS    X         FLAGS                                00047050
QHA_CKD_SPID_FENCE EQU   X'80'     SPID FENCED STATE            @SPA    00047150
QHA_CKD_SOFT_FENCE EQU   X'40'     SOFT FENCED STATE            @SPA    00047250
QHA_CKD_ENT_SIZE   DS    X         SIZE OF PATH GROUP ENTRY             00047540
QHA_CKD_NUM_ENT    DS    H         # CKD PATH GROUP ENTRIES             00048030
QHA_CKD_PGE_ARRAY  DS    0X        START OF PATH GROUP ENTRIES          00048520
*                                                                       00049010
QHA_CKD_PGE        DSECT           PATH GROUP ENTRY                     00049500
QHA_CKD_PATH_STAT  DS    X         PATH STATUS FLAGS                    00049990
QHA_CKD_GROUPED    EQU   X'40'     GROUPED STATE                        00050480
QHA_CKD_RES2PG     EQU   X'20'     RESERVED TO PATH GROUP               00050970
QHA_CKD_MULTIPATH  EQU   X'10'     MULTI-PATH MODE                      00051460
QHA_CKD_PG_ID      DS    CL11      PATH GROUP ID                        00051950
QHA_CKD_SPLX_NAME  DS    CL8       Z/OS SYSPLEX NAME                    00052440
QHA_CKD_TIME_STAMP DS    CL4       DEVICE RESERVE TIMESTAMP             00052930
QHA_CKD_MAX_CYL    DS    CL4       MAX CYLINDERS PER VOLUME             00053420
                   DS    CL4       RESERVED                             00053910
QHA_CKD_PGE_LEN    EQU   *-QHA_CKD_PGE LENGTH OF PATH GROUP ENTRY       00054400
QHA_CKD_ADDITIONAL DSECT           CKD ADDITIONAL INFO          @SPA    00054490
QHA_CKD_SPID_TOKEN DS    CL8       SPID FENCE HOST TOKEN        @SPA    00054580
                   DS    CL56      RESERVED                     @SPA    00054670
QHA_CKD_ADD_LEN    EQU   *-QHA_CKD_ADDITIONAL                   @SPA    00054760
*                                                                       00054890
*    ENDS THE CKD HOST ACCESS INFORMATION                               00055380
*                                                                       00055870
QHA_SCSI           DSECT                                                00056360
QHA_SCSI_FLAGS     DS    X         FLAGS                                00056850
QHA_SCSI_RES_TYPE  DS    X         RESERVATION TYPE                     00057340
                   DS    X         RESERVED                             00057830
QHA_SCSI_SIZE      DS    X         SIZE OF RES HOLDER ENTRY             00058320
QHA_SCSI_NUM_RES   DS    H         NUMBER OF RES HOLDERS                00058810
                   DS    H         RESERVED                             00059300
QHA_SCSI_RES_ARRAY DS    0X        START OF PATH GROUP ENTRIES          00059790
*                                                                       00060280
QHA_SCSI_RES       DSECT           RES HOLDER ENTRY                     00060770
QHA_SCSI_ENT_FLG   DS    X         RESERVATION FLAGS                    00061260
QHA_SCSI_ENT_ONLN  EQU   X'80'     ONLINE                               00061750
                   DS    X         NOT USED                             00062240
QHA_SCSI_ENT_WWPN  DS    CL8       WORLD WIDE PORT NAME                 00062730
QHA_SCSI_ENT_ID    DS    CL2       INTERFACE IDENTIFICATION             00063220
                   DS    CL4       RESERVED                             00063710
QHA_SCSI_RES_LEN   EQU   *-QHA_SCSI_RES   LENGTH OF RES HOLDER ENTRY    00064200
.ZEND    ANOP  ,                                                        00064690
         MEND                                                           00065180
**** END ASM VERSION *************************************************/ 00065670
*/** BEGIN PL/X VERSION *********************************************** 00066160
.*/%QHAPLAS2:;                                                          00066650
*                                                                       00067140
*DECLARE                                                                00067630
*%IF QHA_BASE = '' %THEN                                                00068120
*  %DO;                                                                 00068610
*  1 ANTQHA BASED BDY(DWORD),         /* ...                        */  00069100
*  %END;                                                                00069590
*%ELSE                                                                  00070080
*  %IF QHA_BASE = 'NONE' %THEN                                          00070570
*    %DO;                                                               00071060
*  1 ANTQHA BDY(DWORD),               /* ...                         */ 00071550
*    %END;                                                              00072040
*  %ELSE                                                                00072530
*    %DO;                                                               00073020
*  1 ANTQHA QHA_BASE BDY(DWORD),                                        00073510
*    %END;                                                              00074000
*                                                                       00074490
*/*** MAPS THE FRONT MATTER SECTION OF THE QHA DATA **/                 00074980
*                                                                       00075470
*    3 QHA_HEADER        BDY(DWORD),     /* BEGIN PARM LIST          */ 00075960
*      5 QHA_EYE             CHAR(8),    /* EYECATCHER C'ANTQHA'     */ 00076450
*      5 QHA_VRL             FIXED(32),  /* VERS, RLS, LVL, RSRVD    */ 00076940
*        7 QHA_VER           CHAR(1),    /*                          */ 00077430
*        7 QHA_REL           CHAR(1),    /*                          */ 00077920
*        7 QHA_LVL           CHAR(1),    /*                          */ 00078410
*        7 *                 CHAR(1),    /*                          */ 00078900
*      5 *                   FIXED(32),  /*                          */ 00079390
*      5 QHA_TOTAL_LEN       FIXED(31),  /* TOTAL LEN OF RETURNED    */ 00079880
*                                        /* PLUS THE HEADER LENGTH   */ 00080370
*/*** COMMAND SPECIFIC INFORMATION ***/                                 00080860
*                                                                       00081350
*    3 QHA_IN_DEVN         FIXED(16),  /* DEVICE NUMBER SPECIFIED    */ 00081840
*    3 *                   FIXED(16),  /*                            */ 00082330
*    3 QHA_IN_DVC          CHAR(1),    /* DEVICE TO BE QUERIED CCA   */ 00082820
*    3 QHA_IN_LSS          CHAR(1),    /* DEVICE TO BE QUERIED LSS   */ 00083310
*    3 QHA_IN_SSID         CHAR(2),    /* SSID OF DEVICE IN DEVN     */ 00083800
*    3 QHA_IN_SERIAL       CHAR(12),   /* DEVICE SERIAL              */ 00084290
*      5 *                   CHAR(2),  /*                            */ 00084780
*      5 QHA_IN_SER_ESS      CHAR(10), /* ESS STYLE S/N              */ 00085270
*    3 *                   CHAR(4),    /* RESERVED                   */ 00085760
*    3 QHA_SF_HEADER_END   CHAR(0),    /* USED FOR BASING            */ 00086250
*                                      /*                            */ 00086740
*/*** END OF FRONT MATTER, BEGIN CONTROLLER DATA ***/                   00087230
*                                                                       00087720
*/*** MAPS THE CONTROLLER DATA HEADER INFORMATION ***/                  00088210
*                                                                       00088700
*  1 QHAH BASED(QHA_QHAH_BASE),        /*                            */ 00089190
*    3 QHAH_FLAGS          BIT(8),     /* HOST FLAGS                 */ 00089680
*    3 QHAH_HAI            BIT(8),     /* HOST ACCESS INFORMATION    */ 00090170
*    3 QHAH_DATA_CKD_LEN   FIXED(16),  /* LENGTH OF CKD HAI          */ 00090660
*    3 QHAH_DATA_SCSI_LEN  FIXED(16),  /* LENGTH OF SCSI HAI         */ 00091150
*    3 *                   CHAR(10),   /* NOT USED                   */ 00091640
*    3 CTRL_HEADER_END     CHAR(0),    /* USED FOR BASING            */ 00092130
*                                                                       00092620
*/*** END OF CONTROLLER DATA HEADER INFORMATION ***/                    00093110
*                                                                       00093600
*/*** MAPS CKD HOST ACCESS INFORMATION ***/                             00094090
*                                                                       00094580
*  1 QHA_CKD BASED(QHA_CKD_BASE),      /*                            */ 00095070
*    3 QHA_CKD_FLAGS       BIT(8),     /* FLAGS                      */ 00095560
*      5 QHA_CKD_SPID_FENCE BIT(1),    /* IN SPID FENCED STATE   @SPA*/ 00095660
*      5 QHA_CKD_SOFT_FENCE BIT(1),    /* IN SOFT FENCED STATE   @SPA*/ 00095760
*      5 *                 BIT(6),     /* RESERVED               @SPC*/ 00095860
*    3 QHA_CKD_ENT_SIZE    BIT(8),     /* SIZE OF PATH GROUP ENTRY   */ 00096050
*    3 QHA_CKD_NUM_ENT     FIXED(16),  /* # CKD PATH GROUP ENTRIES   */ 00096540
*    3 QHA_CKD_PGE(*),                 /* PATH GROUP ENTRIES         */ 00097030
*      5 QHA_CKD_PATH_STAT  BIT(8),    /* PATH STATUS FLAGS          */ 00097520
*        7 QHA_CKD_GROUPED   BIT(2),   /* 00=UNGROUPED. 01=GROUPED.  */ 00098010
*        7 QHA_CKD_RES2PG    BIT(1),   /* RESERVED TO PATH GROUP     */ 00098500
*        7 QHA_CKD_MULTIPATH BIT(1),   /* MULTI-PATH MODE            */ 00098990
*        7 *                 BIT(4),   /* RESERVED                   */ 00099480
*      5 QHA_CKD_PG_ID      CHAR(11),  /* PATH GROUP ID              */ 00099970
*      5 QHA_CKD_SPLX_NAME  CHAR(8),   /* Z/OS SYSPLEX NAME          */ 00100460
*      5 QHA_CKD_TIME_STAMP CHAR(4),   /* DEVICE RESERVE TIMESTAMP   */ 00100950
*      5 QHA_CKD_MAX_CYL    CHAR(4),   /* MAX CYLINDERS PER VOLUME   */ 00101440
*      5 *                  CHAR(4),   /* RESERVED                   */ 00101930
*  1 QHA_CKD_ADDITIONAL  CHAR(64) BASED(QHA_TOKEN_BASE),      /* @SPA*/ 00102030
*    3 QHA_CKD_SPID_TOKEN  CHAR(8),                     /* SPID  @SPA*/ 00102130
*                                      /* FENCE HOST TOKEN       @SPA*/ 00102230
*                                                                       00102420
*/*** ENDS THE CKD HOST ACCESS INFORMATION ***/                         00102910
*                                                                       00103400
*/*** MAPS SCSI HOST ACCESS INFORMATION***/                             00103890
*                                                                       00104380
*  1 QHA_SCSI BASED(QHA_SCSI_BASE),                                     00104870
*    3 QHA_SCSI_FLAGS      BIT(8),     /* FLAGS                      */ 00105360
*    3 QHA_SCSI_RES_TYPE   BIT(8),     /* RESERVATION TYPE           */ 00105850
*    3 *                   BIT(8),     /* RESERVED                   */ 00106340
*    3 QHA_SCSI_SIZE       BIT(8),     /* SIZE OF RES HOLDER ENTRY   */ 00106830
*    3 QHA_SCSI_NUM_RES    FIXED(16),  /* NUMBER OF RES HOLDERS      */ 00107320
*    3 *                   CHAR(2),    /* RESERVED                   */ 00107810
*    3 QHA_SCSI_RES(*),                /* RES HOLDER ENTRY           */ 00108300
*      5 QHA_SCSI_ENT_FLG   BIT(8),    /* RESERVATION FLAGS          */ 00108790
*        7 QHA_SCSI_ENT_ONLN BIT(1),   /* ONLINE                     */ 00109280
*        7 *                 BIT(7),   /* RESERVED                   */ 00109770
*      5 *                 CHAR(1),    /* RESERVED                   */ 00110260
*      5 QHA_SCSI_ENT_WWPN CHAR(8),    /* WORLD WIDE PORT NAME       */ 00110750
*      5 QHA_SCSI_ENT_ID   CHAR(2),    /* INTERFACE IDENTIFICATION   */ 00111240
*      5 *                 CHAR(4);    /* RESERVED                   */ 00111730
*                                                                       00112220
*/*** ENDS THE SCSI HOST ACCESS INFORMATION ***/                        00112710
*                                                                       00113200
*/*** BASING ADDRESSES ***/                                             00113690
*DECLARE                                                                00114180
*  QHA_QHAH_BASE PTR(31),                                               00114670
*  QHA_CKD_BASE PTR(31),                                                00115160
*  QHA_TOKEN_BASE PTR(31),                                              00115360
*  QHA_SCSI_BASE PTR(31);                                               00115650
*                                                                       00116140
*/*** CONSTANTS FOR EYE-CATCHERS ***/                                   00116630
*                                                                       00117120
*DECLARE                                                                00117610
*  QHA_EYE_CONSTANT CHAR(6)                                             00118100
*    CONSTANT('ANTQHA');                 ] ACRONYM                      00118590
*DECLARE                                                                00119080
*  QHA_VRL_CONSTANT CHAR(4)                                             00119570
*    CONSTANT('01010000'X);              ] VERSION-RELEASE-LEVEL        00120060
*                                                                       00120550
*/*** CONSTANTS                  ***/                                   00120620
*DECLARE                                                                00120690
*  QHA_HAI_VER01 FIXED(8)                                               00120760
*    CONSTANT(01),                       ] CKD INFO VERSION             00120830
*  QHA_HAI_VER02 FIXED(8)                                               00120900
*    CONSTANT(02);                       ] CKD INFO VERSION             00120970
*/** END PL/X VERSION ************************************************/ 00121040
