*%GOTO ANTQFRVLPLAS1;/*                                                 00050000
         MACRO                                                          00100000
&LAB     ANTQFRVL                                                       00150000
.*/%ANTQFRVLPLAS1:;                                                     00200000
*/** Start of Specifications  ***************************************/  00250000
*/*                                                                 */  00300000
*/* $MAC(ANTQFRVL) COMP(DF117) PROD(SDM):                           */  00350000
*/*                                                                 */  00400000
*/* Descriptive Name = ANTRQST QFRVOLS request VOLLIST parameter    */  00450000
*/*                    area mapping macro                           */  00500000
*/*                                                                 */  00550000
*/*******************************************************************/  00600000
*/*                                                                 */  00650000
*/* PROPRIETARY V3 STATEMENT                                        */  00739990
*/* Licensed Materials - Property of IBM                            */  00779980
*/* "Restricted Materials of IBM"                                   */  00819970
*/* 5650-ZOS                                                        */  00859960
*/* Copyright IBM Corp. 1998,2022                                   */  00934910
*/* END PROPRIETARY V3 STATEMENT                                    */  00939940
*/*                                                                 */  01000000
*/*******************************************************************/  01050000
*/*                                                                 */  01100000
*/* Function = This macro maps the input and output fields in the   */  01150000
*/*            parameter area pointed to by the VOLLIST keyword     */  01200000
*/*            in the ANTRQST Query Fast-Replication Volumes        */  01250000
*/*            request.                                             */  01300000
*/*                                                                 */  01350000
*/* Notes =    The ANTRQST REQUEST=QFRVOLS VOLLIST parameter has    */  01400000
*/*            the name of an area mapped by this macro. This       */  01450000
*/*            area is required for the QFRVOLS request of ANTRQST. */  01500000
*/*                                                                 */  01525000
*/*            The header area must be filled in by the caller.     */  01550000
*/*            This includes setting QFRVLEYE to 'ANTQFRVL',    @03A*/  01558300
*/*            setting QFRVLVRL to the value of the QFRVRLC     @03A*/  01566600
*/*            symbol, and setting QFRVLLEN to the total length @03A*/  01574900
*/*            in bytes of the parameter area.                  @03A*/  01583200
*/*                                                                 */  01591500
*/*            The number of Volume Entries is set by the caller    */  01600000
*/*            and the respective Volume Entries have the volume    */  01650000
*/*            or device information supplied by the caller. All    */  01700000
*/*            other volume entry areas are set to binary zero      */  01750000
*/*            by the caller.                                       */  01800000
*/*                                                                 */  01850000
*/*            When ANTRQST returns to the caller, and the          */  01900000
*/*            RETINFO return and reason code are zero, the         */  01950000
*/*            ANTQFRVL header return code and reason code will     */  02000000
*/*            have the values as described below.                  */  02050000
*/*                                                                 */  02100000
*/* Return  Reason  Description                                     */  02150000
*/*                                                                 */  02200000
*/*   0       0     The control volume and VOLLIST volumes have     */  02250000
*/*                 been processed. All volumes are eligible.       */  02300000
*/*                                                                 */  02350000
*/*   0       1     The control volume and VOLLIST volumes have     */  02400000
*/*                 been processed. One or more VOLLIST volumes     */  02450000
*/*                 are ineligible.                                 */  02500000
*/*                                                                 */  02550000
*/*   4       1     No volumes have been processed. The control     */  02600000
*/*                 volume does not support any version of          */  02650000
*/*                 FlashCopy.                                      */  02700000
*/*                                                                 */  02750000
*/*   4       2     No volumes have been processed. The control     */  02800000
*/*                 volume could not be accessed to determine       */  02850000
*/*                 FlashCopy support status.                       */  02900000
*/*                                                                 */  02950000
*/*   8       x     Input parameters or VOLLIST extent parameters   */  03000000
*/*                 invalid (For IBM Use).                          */  03069990
*/*                                                                 */  03100000
*/*   12      x     QFRVOLS abend or other serious error            */  03179990
*/*                 (For IBM Use).                                  */  03209980
*/*                                                                 */  03250000
*/*            When ANTRQST returns to the caller, and the          */  03300000
*/*            RETINFO return and reason code are zero, and the     */  03350000
*/*            ANTQFRVL header return code is zero, each volume     */  03400000
*/*            entry will have one of the values described below    */  03450000
*/*            in the volume capability and reason fields           */  03500000
*/*                                                                 */  03550000
*/* Volume  Volume                                                  */  03600000
*/* Capable Reason  Description                                     */  03650000
*/*                                                                 */  03700000
*/*   1       0     The volume is source capable.                   */  03750000
*/*                                                                 */  03800000
*/*   2       0     The volume is target capable.                   */  03850000
*/*                                                                 */  03900000
*/*   0       .     The volume is not currently Fast Replication    */  03950000
*/*                 capable. The volume reason will have a non-     */  04000000
*/*                 zero value indicating the current cause for     */  04050000
*/*                 being incapable.                                */  04100000
*/*                                                                 */  04150000
*/*   0       1     The maximum number of FlashCopy relationships   */  04200000
*/*                 are active on the volume.                       */  04250000
*/*                                                                 */  04300000
*/*   0       2     The volume is a PPRC Primary volume, target     */  04325000
*/*                 capability was requested and QFRVL_TGT_PPRC_OK  */  04350000
*/*                 is not set                                      */  04375000
*/*                                                                 */  04400000
*/*   0       3     The volume is a PPRC Secondary volume.          */  04450000
*/*                                                                 */  04500000
*/*   0       4     The volume is a Concurrent Copy source.         */  04550000
*/*                                                                 */  04600000
*/*   0       5     The volume is an eXtended Remote Copy source.   */  04650000
*/*                                                                 */  04700000
*/*   0       6     The volume is currently inhibited from          */  04750000
*/*                 starting any FlashCopy operations.              */  04800000
*/*                                                                 */  04850000
*/*   0       7     A Volume Level (Phase 1) FlashCopy relationship */  04900000
*/*                 is active on this volume.                       */  04950000
*/*                                                                 */  05000000
*/*   0       8     The maximum number of FlashCopy relationships   */  05050000
*/*                 for the SFI are active                          */  05100000
*/*                                                                 */  05200000
*/*   0       9     The volume is currently inaccessible.           */  05250000
*/*                                                                 */  05251600
*/*   0      10     The volume is a Global Mirror primary       @P2A*/  05253200
*/*                                                                 */  05254800
*/*   0      11     A full volume target relationship already   @P2A*/  05256400
*/*                 exists                                      @P2A*/  05258000
*/*                                                                 */  05259600
*/*   0      12     A full volume source relationship already   @P2A*/  05261200
*/*                 exists and target capability was requested  @P2A*/  05262800
*/*                                                                 */  05264400
*/*   0      13     The maximum number of full volume source    @P2A*/  05266000
*/*                 relationships exist and source capability   @P2A*/  05267600
*/*                 was requested                               @P2A*/  05269200
*/*                                                                 */  05270800
*/*   0      14     The volume is space efficient               @P2A*/  05272400
*/*                                                                 */  05274000
*/*   0      15     The volume is in the process of a PPRC      @P2A*/  05275600
*/*                 cascading failover/failback recovery        @P2A*/  05277200
*/*                 or the PPRC volume was established with     @P2A*/  05278800
*/*                 incremental resync.  Target capability req. @P2A*/  05280400
*/*                                                                 */  05282000
*/*   0      16     The volume is a cascaded PPRC volume        @P2A*/  05283600
*/*                                                                 */  05285200
*/*   0      17     The volume is not capable of dataset level  @P2A*/  05286800
*/*                 FlashCopy                                   @P2A*/  05288400
*/*                                                                 */  05290000
*/*   0      18     The volume is not capable inhibiting writes @P2A*/  05291600
*/*                 to the source                               @P2A*/  05293200
*/*                                                                 */  05294800
*/*   0      19     Reserved                                    @SFA*/  05296790
*/*                                                             @SFA*/  05297180
*/*   0      20     Reserved                                    @SFA*/  05297570
*/*                                                             @SFA*/  05297960
*/*   0      21     Device is in a Soft Fenced State.           @SFA*/  05298350
*/*                                                             @SFA*/  05298828
*/*   0      22     Reserved                                    @CFA*/  05298836
*/*                                                             @CFA*/  05298844
*/*   0      23     The specified volume is a target            @CFA*/  05298852
*/*                 volume of an incremental relationship,      @CFA*/  05298860
*/*                 source checking was requested, and          @CFA*/  05298868
*/*                 the copy is not complete for the            @CFA*/  05298876
*/*                 incremental relationship.                   @CFA*/  05298884
*/*                                                             @CFA*/  05298892
*/*   0      24     The maximum number of full volume           @CFA*/  05298900
*/*                 relations exists and target capability      @CFA*/  05298908
*/*                 was requested.                              @CFA*/  05298916
*/*                                                             @CFA*/  05298924
*/*   0      25     Volume is in an incremental FlashCopy       @CFA*/  05298932
*/*                 relationship and is not eligible for        @CFA*/  05298940
*/*                 new incremental FlashCopy relationship      @CFA*/  05298948
*/*                 of the requested change recording version   @CFA*/  05298956
*/*                                                             @SGA*/  05298957
*/*   0      26     Volume is a Safeguarded Copy Source Volume  @SGA*/  05298958
*/*                                                             @SGA*/  05298959
*/*   0      27     Safeguarded Copy Recovery target relations  @SGA*/  05298960
*/*                 exists and source capability requested      @SGA*/  05298961
*/*                                                             @CFA*/  05298964
*/*   0      28     FlashCopy onto a Global Mirror target       @FGA*/  05298973
*/*                 cannot be performed because a Global        @FGA*/  05298974
*/*                 Mirror force Consistency Group is in        @FGA*/  05298975
*/*                 progress.                                   @FGA*/  05298976
*/*                                                             @FGA*/  05298977
*/*   0      29     FlashCopy onto a Safeguarded Copy source    @SSA*/  05298977
*/*                 cannot be performed because a Safeguarded   @SSA*/  05298977
*/*                 Copy reservation is active on the volume.   @SSA*/  05298977
*/*                                                             @SSA*/  05298977
*/*   0      30-63  Reserved for common incapable reason codes  @FGC*/  05298978
*/*                                                             @XFC*/  05298980
*/*            FlashCopy incapable, PPRC RPFC incapable,        @XFC*/  05299060
*/*            and XRC RPFC incapable                           @XFC*/  05299140
*/*                                                             @XFC*/  05299220
*/*   0      64-95  For XRC Remote Pair FlashCopy               @XFA*/  05299300
*/*                                                             @XFA*/  05299380
*/*   0      96-127 Reserved                                    @XFA*/  05299460
*/*                                                             @XFA*/  05299540
*/*   0     128-159 For PPRC Remote Pair FlashCopy              @XFA*/  05299620
*/*                                                             @XFA*/  05299700
*/*   0     160-191 Reserved                                    @XFA*/  05299780
*/*                                                                 */  05300000
*/*   0     200     The volume cannot be found.                     */  05350000
*/*                                                                 */  05400000
*/*   0     201     The volume does not support FlashCopy.          */  05450000
*/*                                                                 */  05500000
*/*   0     202     The volume is not within the subsystem          */  05550000
*/*                 boundary of the control volume.                 */  05600000
*/*                                                                 */  05650000
*/*   0     203     An I/O error was detected when obtaining        */  05700000
*/*                 FlashCopy status of the volume.                 */  05750000
*/*                                                                 */  05800000
*/*   0     204     The volume does not have the same track         */  05850000
*/*                 geometry as the control volume.                 */  05900000
*/*                                                                 */  05907100
*/*   0     206     An I/O timeout was detected when obtaining      */  05914200
*/*                 FlashCopy status of the volume.             @02A*/  05921300
*/*                                                                 */  05928400
*/*   0     207     The specified extent is outside of volume's     */  05935500
*/*                 capabilities.                               @02A*/  05942700
*/*                                                             @P2A*/  05950800
*/*            When ANTRQST returns to the caller, and the      @P2A*/  05951200
*/*            RETINFO return and reason code are zero, and the @P2A*/  05951600
*/*            ANTQFRVL header return code is zero, and the     @P2A*/  05952000
*/*            Version 2 or higher is specified, each volume    @P2A*/  05952400
*/*            entry will have one of the values described      @P2A*/  05952800
*/*            below in the preserve mirror capability and      @P2A*/  05953200
*/*            preserve mirror reason fields.                   @P2A*/  05953600
*/*                                                             @P2A*/  05954000
*/* PresMir PresMir                                             @P2A*/  05954400
*/* Capable Reason  Description                                 @P2A*/  05954800
*/*                                                             @P2A*/  05955200
*/*   1       0     The volume is Preserve Mirror Capable       @P2A*/  05955600
*/*                                                             @P2A*/  05956000
*/*   2       0     Preserve Mirror checking not requested      @P2A*/  05956400
*/*                                                             @P2A*/  05956800
*/*   3       0     Preserve Mirror checking was not done       @P2A*/  05957200
*/*                 because the volume is not FlashCopy capable @P2A*/  05957600
*/*                                                             @P2A*/  05958000
*/*   0       .     The volume is not currently Preserve Mirror @P2A*/  05958400
*/*                 capable. The volume reason will have a non- @P2A*/  05958800
*/*                 zero value indicating the current cause for @P2A*/  05959200
*/*                 being incapable.                            @P2A*/  05959600
*/*                                                             @P2A*/  05960000
*/*   0       1     The maximum number of FlashCopy relations   @P2A*/  05960400
*/*                 are active on the volume.                   @P2A*/  05960800
*/*                                                             @P2A*/  05961200
*/*   0       2     Reserved                                    @P2A*/  05961600
*/*                                                             @P2A*/  05962000
*/*   0       3     Reserved                                    @P2A*/  05962400
*/*                                                             @P2A*/  05962800
*/*   0       4     The volume's secondary is a Concurrent      @P2A*/  05963200
*/*                 Copy source.                                @P2A*/  05963600
*/*                                                             @P2A*/  05964000
*/*   0       5     The volume's secondary is an XRC primary    @P2A*/  05964400
*/*                                                             @P2A*/  05964800
*/*   0       6     The volume's secondary currently is         @P2A*/  05965200
*/*                 inhibited from starting any FlashCopy       @P2A*/  05965600
*/*                 operations.                                 @P2A*/  05966000
*/*                                                             @P2A*/  05966400
*/*   0       7     A Volume Level (Phase 1) FlashCopy relation @P2A*/  05966800
*/*                 is active on this volume's secondary        @P2A*/  05967200
*/*                                                             @P2A*/  05967600
*/*   0       8     The maximum number of FlashCopy relations   @P2A*/  05968000
*/*                 for the volume's secondary volume's SFI     @P2A*/  05968400
*/*                                                             @P2A*/  05968800
*/*   0       9     The volume's secondary is inaccessible      @P2A*/  05969200
*/*                                                             @P2A*/  05969600
*/*   0      10     The volume's secondary is a Global Mirror   @P2A*/  05970000
*/*                 primary                                     @P2A*/  05970400
*/*                                                             @P2A*/  05970800
*/*   0      11     A full volume target relationship already   @P2A*/  05971200
*/*                 exists on the volume's secondary            @P2A*/  05971600
*/*                                                             @P2A*/  05972000
*/*   0      12     A full volume source relationship already   @P2A*/  05972400
*/*                 exists on the volume's secondary and        @P2A*/  05972800
*/*                 target capability was requested             @P2A*/  05973200
*/*                                                             @P2A*/  05973600
*/*   0      13     The maximum number of full volume source    @P2A*/  05974000
*/*                 relationships exist on the volume's         @P2A*/  05974400
*/*                 secondondary and source capability was      @P2A*/  05974800
*/*                 requested                                   @P2A*/  05975200
*/*                                                             @P2A*/  05975600
*/*   0      14     The volume's secondary is space efficient   @P2A*/  05976000
*/*                                                             @P2A*/  05976400
*/*   0      15     The volume's secondary is in the process of @P2A*/  05976800
*/*                 a PPRC cascading failover/failback recovery @P2A*/  05977200
*/*                 or the PPRC volume was established with     @P2A*/  05977600
*/*                 incremental resync.  Target capability req. @P2A*/  05978000
*/*                                                             @P2A*/  05978400
*/*   0      16     The volume's secondary is a cascaded PPRC   @P2A*/  05978800
*/*                 volume                                      @P2A*/  05979200
*/*                                                             @P2A*/  05979600
*/*   0      17     The volume's secondary is not capable of    @P2A*/  05980000
*/*                 dataset level FlashCopy operations          @P2A*/  05980400
*/*                                                             @P2A*/  05980800
*/*   0      18     The volume's secondary is not capable of    @P2A*/  05981200
*/*                 inhibiting writes to the source             @P2A*/  05981600
*/*                                                             @P2A*/  05982000
*/*   0      19     Reserved                                    @SFA*/  05982440
*/*                                                             @SFA*/  05982480
*/*   0      20     Reserved                                    @SFA*/  05982520
*/*                                                             @SFA*/  05982560
*/*   0      21     Device is in a Soft Fenced State.           @SFA*/  05982600
*/*                                                             @XFA*/  05982650
*/*   0      22     Reserved                                    @CFA*/  05982661
*/*                                                             @CFA*/  05982662
*/*   0      23     The specified volume is a target            @CFA*/  05982663
*/*                 volume of an incremental relationship,      @CFA*/  05982664
*/*                 source checking was requested, and          @CFA*/  05982665
*/*                 the copy is not complete for the            @CFA*/  05982666
*/*                 incremental relationship.                   @CFA*/  05982667
*/*                                                             @CFA*/  05982668
*/*   0      24     The maximum number of full volume           @CFA*/  05982669
*/*                 relations exists and target capability      @CFA*/  05982670
*/*                 was requested.                              @CFA*/  05982671
*/*                                                             @CFA*/  05982672
*/*   0      25     Volume is in an incremental FlashCopy       @CFA*/  05982673
*/*                 relationship and is not eligible for        @CFA*/  05982674
*/*                 new incremental FlashCopy relationship      @CFA*/  05982675
*/*                 of the requested change recording version   @CFA*/  05982676
*/*                                                             @CFA*/  05982677
*/*   0      26     Volume is a Safeguarded Copy Source Volume  @SGA*/  05982680
*/*                                                             @SGA*/  05982681
*/*   0      27     Safeguarded Copy Recovery target relations  @SGA*/  05982682
*/*                 exists and source capability requested      @SGA*/  05982683
*/*                                                             @SGA*/  05982684
*/*   0      28     FlashCopy onto a Global Mirror target       @FGA*/  05982685
*/*                 cannot be performed because a Global        @FGA*/  05982686
*/*                 Mirror force Consistency Group is in        @FGA*/  05982687
*/*                 progress.                                   @FGA*/  05982688
*/*                                                             @FGA*/  05982689
*/*   0      29     FlashCopy onto a Safeguarded Copy source    @SSA*/  05298977
*/*                 cannot be performed because a Safeguarded   @SSA*/  05298977
*/*                 Copy reservation is active on the volume.   @SSA*/  05298977
*/*                                                             @SSA*/  05298977
*/*   0      30-63  Reserved for common incapable reason codes  @CFC*/  05982690
*/*                 FlashCopy incapable, PPRC RPFC incapable,   @XFC*/  05982691
*/*                 and XRC RPFC incapable                      @XFC*/  05982692
*/*                                                             @XFA*/  05982693
*/*   0     64-95   Reserved for XRC Remote Pair FlashCopy      @XFA*/  05982700
*/*                                                             @XFA*/  05982710
*/*   0     96-127  Reserved                                    @XFA*/  05982720
*/*                                                             @P2A*/  05982800
*/*   0     128     The volume is not a PPRC primary device     @P2A*/  05983200
*/*                 (for target checking, software can treat    @P2A*/  05983600
*/*                  this as capable)                           @P2A*/  05984000
*/*                                                             @P2A*/  05984400
*/*   0     129     The volume's secondary and the control      @P2A*/  05984800
*/*                 volume's secondary are not in the same      @P2A*/  05985200
*/*                 SFI                                         @P2A*/  05985600
*/*                                                             @P2A*/  05986000
*/*   0     130     The volume's PPRC relationship is not       @P2A*/  05986400
*/*                 full duplex                                 @P2A*/  05986800
*/*                                                             @P2A*/  05987200
*/*   0     131     The volume's secondary's SFI does not       @P2A*/  05987600
*/*                 have the microcode installed that supports  @P2A*/  05988000
*/*                 IBM Remote Pair FlashCopy (Preserve Mirror) @P2A*/  05988400
*/*                                                             @P2A*/  05988800
*/*   0     132     The control volume is not a PPRC primary    @P2A*/  05989200
*/*                                                             @P2A*/  05989600
*/*   0     133     The command was received while the          @P2A*/  05990000
*/*                 subsystem was attempting to install a new   @P2A*/  05990400
*/*                 microcode load and the level of one or      @P2A*/  05990800
*/*                 both of the CECs does not support           @P2A*/  05991200
*/*                 IBM Remote Pair FlashCopy (Preserve Mirror) @P2A*/  05991600
*/*                                                             @P2A*/  05992000
*/*   0     134     An error was detected when sending the      @P2A*/  05992400
*/*                 command to the volume's secondary           @P2A*/  05992800
*/*                                                             @P2A*/  05993200
*/*   0     135     The volume is space efficient and target    @P2A*/  05993600
*/*                 capability was requested.  Space efficient  @P2A*/  05994000
*/*                 volumes are not allowed as the target of    @P2A*/  05994400
*/*                 a preserve mirror operation.                @P2A*/  05994800
*/*                                                             @XFA*/  05994880
*/*   0     136-159 For PPRC Remote Pair FlashCopy              @XFA*/  05994960
*/*                                                             @XFA*/  05995040
*/*   0     160-191 Reserved                                    @XFA*/  05995120
*/*                                                             @P2A*/  05995200
*/*   0     136     Volume has PPRC Multi-Target relationships  @MTA*/  05995280
*/*                 and either none or more than one of the     @MTA*/  05995360
*/*                 target volumes have "Use Remote Pair        @MTA*/  05995440
*/*                 FlashCopy" set.                             @MTA*/  05995520
*/*                                                             @MTA*/  05995600
*/*   0     137     The volume is in a PPRC Multi-Target        @MTA*/  05995680
*/*                 relationship and Preserve Mirror Preferred  @MTA*/  05995760
*/*                 was specified.                              @MTA*/  05995840
*/*                                                             @MTA*/  05995920
*/*   0     208     The volume is a PPRC primary and the Preserve   */  05996000
*/*                 Mirror feature is not enabled.              @05A*/  05996800
*/*                                                                 */  05997000
*/*   0     209     PPRC Primary not Full Duplex or PM ver2 not     */  05997200
*/*                 installed                                   @06A*/  05997400
*/*                                                                 */  05997600
*/*   0     256     The controller does not have the Preserve       */  05998400
*/*                 Mirror feature enabled.                     @05A*/  05999200
*/*                                                                 */  05999210
*/*            When ANTRQST returns to the caller, and the      @XFA*/  05999220
*/*            RETINFO return and reason code are zero, and the @XFA*/  05999230
*/*            ANTQFRVL header return code is zero, each volume @XFA*/  05999240
*/*            entry will have one of the values described below@XFA*/  05999250
*/*            in the XRC Remote Pair Flashcopy capability and  @XFA*/  05999260
*/*            reason fields if the volume is capable and the   @XFA*/  05999270
*/*            extents are specified.                           @XFA*/  05999280
*/*                                                             @XFA*/  05999290
*/* XRCRPFC XRCRPFC                                             @XFA*/  05999300
*/* Capable Reason                                              @XFA*/  05999310
*/*                                                             @XFA*/  05999320
*/*   1       0     The volume is XRC RPFC Capable              @XFA*/  05999330
*/*                                                             @XFA*/  05999340
*/*   2       0     XRC RPFC checking not requested             @XFA*/  05999350
*/*                                                             @XFA*/  05999360
*/*   3       0     XRC RPFC checking was not done because      @XFA*/  05999370
*/*                 the volume is not FlashCopy capable         @XFA*/  05999380
*/*                                                             @XFA*/  05999390
*/*   0       .     The volume is not curently XRC RPFC         @XFA*/  05999400
*/*                 capable. The volume reason will have a non- @XFA*/  05999410
*/*                 zero value indicating the current cause for @XFA*/  05999420
*/*                 being incapable                             @XFA*/  05999430
*/*                                                             @XFA*/  05999440
*/*   0     23-63   Reserved for common incapable codes         @XFA*/  05999450
*/*                 FlashCopy incapable, PPRC RPFC incapable,   @XFA*/  05999460
*/*                 and XRC RPFC incapable                      @XFA*/  05999470
*/*                                                             @XFA*/  05999480
*/*   0     64      XRC RPFC not enabled by DSO Set Session     @XFA*/  05999490
*/*                 Characteristics. Set XRC RPFC Session Name  @XFA*/  05999500
*/*                                                             @XFA*/  05999510
*/*   0     65      Control Volume is not an XRC Primary        @XFA*/  05999520
*/*                                                             @XFA*/  05999530
*/*   0     66      XRC Session Names are not equal             @XFA*/  05999540
*/*                                                             @XFA*/  05999550
*/*   0     67      The Control volume is in a suspended state  @XFA*/  05999560
*/*                                                             @XFA*/  05999570
*/*   0     68      Addressed volume is not an XRC primary      @XFA*/  05999580
*/*                                                             @XFA*/  05999590
*/*   0     69      Addressed volume is in an XRC Suspended     @XFA*/  05999600
*/*                 State                                       @XFA*/  05999610
*/*                                                             @XFA*/  05999620
*/*   0     70      Addressed volume is Space Efficient         @XFA*/  05999630
*/*                 and Target Capability was requested.        @XFA*/  05999640
*/*                 SE target volumes are not allowed           @XFA*/  05999650
*/*                 for XRC RPFC operations.                    @XFA*/  05999660
*/*                                                             @XFA*/  05999670
*/*   0     71      The Control Volume is Space Efficient.      @XFA*/  05999680
*/*                 SE target volumes are not                   @XFA*/  05999690
*/*                 allowed for XRC RPFC operations.            @XFA*/  05999700
*/*                                                             @XFA*/  05999710
*/*   0     72      The microcode level of one or both CECs     @XFA*/  05999720
*/*                 does not support XRC RPFC operations        @XFA*/  05999730
*/*                                                             @XFA*/  05999740
*/*   0     73-95   Reserved for XRC Remote Pair FlashCopy      @XFA*/  05999750
*/*                                                             @XFA*/  05999760
*/*   0     96-127  Reserved                                    @XFA*/  05999770
*/*                                                             @XFA*/  05999780
*/*   0    128-159  For PPRC Remote Pair Flashcopy              @XFA*/  05999790
*/*                                                             @XFA*/  05999800
*/*   0    160-191  Reserved                                    @XFA*/  05999810
*/*                                                                 */  06000000
*/*            When ANTRQST returns to the caller, and the          */  06050000
*/*            RETINFO return and reason code are zero, and the     */  06100000
*/*            ANTQFRVL header return code is zero, each volume     */  06150000
*/*            entry will have one of the values described below    */  06200000
*/*            in the extent capability and reason fields if the    */  06250000
*/*            volume is capable and the extents were specified.    */  06300000
*/*                                                                 */  06350000
*/* Extent  Extent                                                  */  06400000
*/* Capable Reason  Description                                     */  06450000
*/*                                                                 */  06500000
*/*   1       0     The extent is source capable.                   */  06550000
*/*                                                                 */  06600000
*/*   2       0     The extent is target capable.                   */  06650000
*/*                                                                 */  06700000
*/*   0       .     The extent is not currently Fast Replication    */  06750000
*/*                 capable. The extent reason will have a non-     */  06800000
*/*                 zero value indicating the current cause for     */  06850000
*/*                 being incapable.                                */  06900000
*/*                                                                 */  06950000
*/*   0       1     For a target eligibility request, the extent    */  07000000
*/*                 has active FC source tracks.                    */  07050000
*/*                                                                 */  07100000
*/*   0       2     For source or target eligibility requests,      */  07150000
*/*                 the extent has active FC target tracks.         */  07200000
*/*                                                                 */  07250000
*/*   0       3     For a source eligibility request, the extent    */  07300000
*/*                 has the maximum number of source relationships  */  07350000
*/*                 to target tracks.                               */  07400000
*/*                                                                 */  07450000
*/*   0       4     The specified extent is in a validation         */  07500000
*/*                 required status.                                */  07550000
*/*                                                                 */  07600000
*/* Linkage = %INCLUDE SYSLIB(ANTQFRVL)                             */  07700000
*/*                                                                 */  07750000
*/* Input = "%QFRVL_BASE" can be used to change the default basing  */  07800000
*/*         attribute of the control block.  "%QFRVL_BASE = 'NONE'" */  07850000
*/*         will cause the declare to not be based.  "%QFRVL_BASE = */  07900000
*/*         'BASED(R1)'" will cause the declare to be based on R1.  */  07950000
*/*                                                                 */  08000000
*/* Owner = SDM                                                     */  08050000
*/*                                                                 */  08100000
*/* Change Activity =                                               */  08150000
*/*                                                                 */  08200000
*/*  $L0=OA03954,HDZ11J0,020520,TUCHAD: DSLFC Initial release   @L0A*/  08233300
*/*  $01=OA06473,HDZ11J0,040105,TUCHAD: FC Tgt PPRC Prim OK     @01A*/  08266600
*/*  $02=OA22200,HDZ11J0,070822,TUCNPS: QFRVOLS 0C1 handling    @02A*/  08291600
*/*  $PM=OA24809,HDZ11K0,080525,TUCCGS: Preserve mirror         @PMA*/  08294400
*/*  $03=OA29249,HDZ1190,091104,TUCAGM: Remove QFREYEC          @03A*/  08297200
*/*  $P2=OA31871,HDZ1A10,100205,TUCLJG: Preserve mirror update  @P2A*/  08298600
*/*  $04=OA32495,HDZ1A10,100401,TUCLJG: Return Cluster ID       @04A*/  08299300
*/*  $05=OA34034,HDZ1A10,110110,TUCDRL: Add Feature RSN codes   @05A*/  08299600
*/*  $06=OA36165,HDZ1A10,110622,TUCCGS: Add PM V2 RSN code      @06A*/  08299800
*/*  $SF=OA40510,HDZ1B10,121212,TUCCGS: Soft Fence              @SFA*/  08299900
*/*  $MT=OA43654,HDZ1D10,141002,TUCCGS: Multi Target PPRC       @MTA*/  08299950
*/*  $M2=OA45682,HDZ1D10,141001,RUSTYS: MultiIncremental FC GA  @M2A*/  08299970
*/*  $07=OA49815,HDZ1D10,160331,TUCDRL: ABEND0C4 in S4934 xBAC  @07A*/  08299980
*/*  $XF=OA44674,HDZ2210,150423,TUCCGS: RPFC for XRC - FC       @XFA*/  08299990
*/*  $CF=OA52394,HDZ2210,170404,TUCCGS: Cascading FlashCopy     @CFA*/  08299995
*/*  $08=OA53913,HDZ2210,170911,TUCCGS: QFRVL_VOL_ENTRY size    @08A*/  08299997
*/*  $FG=OA57172,HDZ2220,190501,TUCCGS: FCQUERY GM              @FGA*/  08299998
*/*  $SG=OA56518 HDZ2220,190701,TUCCGS: Safe Guarded Copy       @SGA*/  08299999
*/*  $SS=OA62836 HDZ2223,220804,TUCJCL: FLC onto SafeGSource    @SSA*/  08299999
*/*                                                                 */  08300000
*/** END OF SPECIFICATIONS ******************************************/  08350000
*%GOTO ANTQFRVLPLAS2;/*                                                 08400000
QFRVL    DSECT                                                          08450000
         AIF   ('&LAB' EQ '').RUN                                       08500000
&LAB     DS    0F                                                       08550000
.RUN     ANOP                                                           08600000
QFRVLEYE DS    CL8           Eyecatcher 'ANTQFRVL'                 @PMC 08630000
QFRVLVRL DS    XL4           Version, Release, Level, Reserved     @PMC 08690000
QFRVRLC  EQU   X'02010000'                                         @PMA 08720000
QFRVLLEN DS    F             ANTQFRVL total size                        08750000
*                                                                       08800000
QFRVLRET_CODE DS F                                                      08850000
QFRVL_RETCODE_0   EQU X'00000000'                                       08900000
QFRVL_RETCODE_4   EQU X'00000004'                                       08950000
QFRVL_RETCODE_8   EQU X'00000008'                                       09000000
QFRVL_RETCODE_12  EQU X'0000000C'                                       09050000
*                                                                       09100000
QFRVLRSN_CODE DS F                                                      09150000
QFRVL_RTC0_RSC0   EQU X'00000000'                                       09200000
QFRVL_RTC0_RSC1   EQU X'00000001'                                       09250000
QFRVL_RTC4_RSC1   EQU X'00000001'                                       09300000
QFRVL_RTC4_RSC2   EQU X'00000002'                                       09350000
QFRVL_RTC8_RSC1   EQU X'00000001'                                       09400000
QFRVL_RTC8_RSC2   EQU X'00000002'                                       09450000
QFRVL_RTC8_RSC3   EQU X'00000003'                                       09500000
QFRVL_RTC8_RSC4   EQU X'00000004'                                       09550000
QFRVL_RTC12_RSC1  EQU X'00000001'                                       09600000
QFRVL_RTC12_RSC2  EQU X'00000002'                                       09650000
QFRVL_RTC12_RSC3  EQU X'00000003'                                       09700000
QFRVL_RTC12_RSC4  EQU X'00000004'                                       09750000
QFRVL_RTC12_RSC5  EQU X'00000005'                                       09800000
QFRVL_RTC12_RSC6  EQU X'00000006'                                       09850000
QFRVL_RTC12_RSC7  EQU X'00000007'                                       09900000
QFRVL_RTC12_RSC8  EQU X'00000008'                                       09950000
QFRVL_RTC12_RSC9  EQU X'00000009'                                       10000000
QFRVL_RTC12_RSC10 EQU X'0000000A'                               @P2A    10005000
QFRVL_RTC12_RSC11 EQU X'0000000B'                               @P2A    10010000
QFRVL_RTC12_RSC12 EQU X'0000000C'                               @P2A    10015000
QFRVL_RTC12_RSC13 EQU X'0000000D'                               @P2A    10020000
QFRVL_RTC12_RSC14 EQU X'0000000E'                               @P2A    10025000
QFRVL_RTC12_RSC15 EQU X'0000000F'                               @P2A    10030000
QFRVL_RTC12_RSC16 EQU X'00000010'                               @P2A    10035000
QFRVL_RTC12_RSC17 EQU X'00000011'                               @P2A    10040000
QFRVL_RTC12_RSC18 EQU X'00000012'                               @P2A    10045000
QFRVL_RTC12_RSC19 EQU X'00000013'                               @SFA    10049000
QFRVL_RTC12_RSC20 EQU X'00000014'                               @SFA    10053000
QFRVL_RTC12_RSC21 EQU X'00000015'                               @SFA    10057000
QFRVL_RTC12_RSC22 EQU X'00000016'                               @CFA    10058000
QFRVL_RTC12_RSC23 EQU X'00000017'                               @CFA    10059000
QFRVL_RTC12_RSC24 EQU X'00000018'                               @CFA    10060000
QFRVL_RTC12_RSC25 EQU X'00000019'                               @CFA    10061000
QFRVL_RTC12_RSC26 EQU X'0000001A'                               @SGA    10061300
QFRVL_RTC12_RSC27 EQU X'0000001B'                               @SGA    10061600
QFRVL_RTC12_RSC28 EQU X'0000001C'                               @FGA    10062000
QFRVL_RTC12_RSC29 EQU X'0000001D'                               @SSA    10062000
         DS   CL3                                             @04C      10063300
QFRVL_CV_CLUSTER DS XL1            Control Volume Cluster     @04A      10081600
QFRVLCOUNT DS F                                                         10100000
*                                                                       10150000
QFRVL_HEADER_LEN EQU *-QFRVL                                            10200000
*                                                                       10250000
QFRVL_VOL_ENTRY DSECT                   * Array of volume entries  @08C 10319990
         DS    0F                                                       10350000
QFRVLIN_VOLSER DS CL6                                                   10400000
QFRVL_IN_VOL_CAP DS XL1                                                 10450000
QFRVL_IN_VOL_SRC  EQU X'80'                                             10500000
QFRVL_IN_VOL_TGT  EQU X'40'                                             10550000
QFRVL_TGT_PPRC_OK EQU X'20'                                        @XFC 10577990
QFRVL_TGT_PPRC_NO EQU X'10'                                        @XFA 10580980
QFRVL_SE_OK       EQU X'08'                                        @XFA 10583970
QFRVL_SE_NO       EQU X'04'                                        @XFA 10586960
QFRVL_TGT_XRC_OK  EQU X'02'                                        @XFA 10589950
QFRVL_TGT_XRC_NO  EQU X'01'                                        @XFA 10592940
QFRVL_IN_VOL2_CAP DS XL1                                           @CFA 10609990
QFRVL_IN_VOL2_CRFLC_Type  EQU X'80'                                @CFA 10619980
*                                                                       10650000
QFRVLOUT_VOL_CAPB DS XL1                                                10700000
QFRVL_VOL_NOT_CAP EQU X'00'                                             10750000
QFRVL_VOL_SRC_CAP EQU X'01'                                             10800000
QFRVL_VOL_TGT_CAP EQU X'02'                                             10850000
*                                                                       10900000
QFRVLOUT_VOL_RSN DS XL1                                                 10950000
QFRVL_VOL_CAPBL    EQU X'00'                                            11000000
QFRVL_VOL_MAX_VOL  EQU X'01'                                            11050000
QFRVL_VOL_PPRC_PR  EQU X'02'                                            11100000
QFRVL_VOL_PPRC_SC  EQU X'03'                                            11150000
QFRVL_VOL_CC       EQU X'04'                                            11200000
QFRVL_VOL_XRC_SRC  EQU X'05'                                            11250000
QFRVL_VOL_INHIBIT  EQU X'06'                                            11300000
QFRVL_VOL_VLFC_ACT EQU X'07'                                            11350000
QFRVL_VOL_MAX_ESS  EQU X'08'                                            11400000
QFRVL_VOL_INACCESS EQU X'09'                                            11450000
QFRVL_VOL_GM_PRIM        EQU X'0A'                                 @P2A 11455000
QFRVL_VOL_FV_TGT_EXISTS  EQU X'0B'                                 @P2A 11460000
QFRVL_VOL_FV_SRC_EXISTS  EQU X'0C'                                 @P2A 11465000
QFRVL_VOL_MAX_FV_SRC     EQU X'0D'                                 @P2A 11470000
QFRVL_VOL_TGT_SE         EQU X'0E'                                 @P2A 11475000
QFRVL_VOL_TGT_CFE        EQU X'0F'                                 @P2A 11480000
QFRVL_VOL_TGT_CASC       EQU X'10'                                 @P2A 11485000
QFRVL_VOL_TGT_NODSLFC    EQU X'11'                                 @P2A 11490000
QFRVL_VOL_SRC_NOWRINH    EQU X'12'                                 @P2A 11495000
*                        EQU X'13'                                 @SFA 11496000
*                        EQU X'14'                                 @SFA 11497000
QFRVL_VOL_SOFT_FENCE     EQU X'15'                                 @SFA 11498000
QFRVL_VOL_INC_BGC        EQU X'17'                                 @CFA 11498500
QFRVL_VOL_MAX_FV_REL     EQU X'18'                                 @CFA 11499000
QFRVL_VOL_NO_CR_BM       EQU X'19'                                 @CFA 11499500
QFRVL_VOL_SGC_SOURCE     EQU X'1A'                                 @SGA 11499560
QFRVL_VOL_SGC_RECOVERY   EQU X'1B'                                 @SGA 11499620
QFRVL_VOL_GM_FORCE_CG    EQU X'1C'                                 @FGA 11499700
QFRVL_VOL_FC_SGC         EQU X'1D'                                 @SSA 11499700
QFRVL_VOL_NOTFOUND EQU X'C8'                                            11500000
QFRVL_VOL_NOT_FC   EQU X'C9'                                            11550000
QFRVL_VOL_BNDRY    EQU X'CA'                                            11600000
QFRVL_VOL_IO_ERR   EQU X'CB'                                            11650000
QFRVL_VOL_TRK_FMT  EQU X'CC'                                            11700000
QFRVL_VOL_IO_TMOUT EQU X'CE'                                       @02A 11716600
QFRVL_VOL_OUTRANGE EQU X'CF'                                       @02A 11733200
*                                                                       11750000
QFRVLOUT_XTNT_CAPB DS XL1                                               11800000
QFRVL_XT_NOT_CPBL  EQU X'00'                                            11850000
QFRVL_XT_SRC_CPBL  EQU X'01'                                            11900000
QFRVL_XT_TGT_CPBL  EQU X'02'                                            11950000
*                                                                       12000000
QFRVLOUT_XTNT_RSN DS XL1                                                12050000
QFRVL_XT_CAPBL     EQU X'00'                                            12100000
QFRVL_XT_ACTV_SRC  EQU X'01'                                            12150000
QFRVL_XT_ACTV_TGT  EQU X'02'                                            12200000
QFRVL_XT_MAX_TGTS  EQU X'03'                                            12250000
QFRVL_XT_VALID_REQ EQU X'04'                                            12300000
*                                                                       12350000
QFRVLOUT_FLAGS1 DS XL1                                                  12400000
QFRVL_OUT_EXTPVAL  EQU X'02'                                     @M2A   12420000
QFRVLOUT_FLAGS2 DS XL1                                                  12450000
QFRVLOUT_FLAGS3 DS XL1                                                  12500000
QFRVL_OUT_IOERR EQU X'20'                                               12550000
*                                                                       12583300
QFRVL_CLUSTER  DS XL1                Volume's Cluster ID         @04C   12616600
*                                                                       12650000
QFRVL_OUT_TTL_RELS DS F                                                 12700000
*                                                                       12750000
QFRVL_OUT_MAX_RELS DS F                                                 12800000
*                                                                       12850000
QFRVL_OUT_AOM_RETC DS XL1                                               12900000
QFRVL_OUT_AOM_RSNC DS XL1                                               12950000
QFRVL_OUT_UCB_RETC DS XL1                                               13000000
QFRVL_OUT_UCB_RSNC DS XL1                                               13050000
*                                                                       13100000
QFRVL_OUT_SENSE7 DS XL1                                                 13150000
QFRVL_OUT_SENSE8 DS XL1                                                 13200000
QFRVL_OUT_SENSE_RSV DS XL2                                              13250000
*                                                                       13300000
QFRVL_IN_XTNT_PTR DS A                                                  13350000
*                                                                       13400000
QFRVL_IN_XTNT_COUNT DS F                                                13450000
*                                                                       13500000
QFRVL_OUT_MSG_TEXT DS CL68                                              13550000
QFRVL_OUT_MSG_RSRV DS CL4                                               13600000
*                                                                       13650000
QFRVL_USER_RESERVED DS CL16                                             13700000
*                                                                       13750000
* If any of the following fields are checked in any module,        @07A 13750200
*  the module must first check for version QFRVL_VRL2_CONSTANT     @07A 13750400
*                                                                  @07A 13750600
QFRVL_OUT_PM_CAPB   DS   XL1                                       @PMA 13750900
QFRVL_PM_NOT_CAPABLE     EQU X'00'                                 @PMA 13751800
QFRVL_PM_CAPABLE         EQU X'01'                                 @PMA 13752700
QFRVL_PM_NOT_REQUESTED   EQU X'02'                                 @PMA 13753600
QFRVL_PM_NOT_CHECKED     EQU X'03'                                 @PMA 13754500
*                                                                  @PMA 13755400
QFRVL_OUT_PM_RSN    DS   XL2                                       @PMA 13756300
QFRVL_PM_CAPBL           EQU X'0000'                               @PMA 13757200
QFRVL_PM_MAX_RELS        EQU X'0001'                               @PMA 13758100
* RESERVED 02-03                                                   @PMA 13759000
QFRVL_PM_CC              EQU X'0004'                               @PMA 13759900
QFRVL_PM_XRC_SRC         EQU X'0005'                               @PMA 13760800
QFRVL_PM_INHIBIT         EQU X'0006'                               @PMA 13761700
QFRVL_PM_VLFC_ACT        EQU X'0007'                               @PMA 13762600
QFRVL_PM_MAX_ESS         EQU X'0008'                               @PMA 13763500
QFRVL_PM_INACCESS        EQU X'0009'                               @PMA 13764400
QFRVL_PM_GM_PRIM         EQU X'000A'                               @PMA 13765300
QFRVL_PM_FV_TGT_EXISTS   EQU X'000B'                               @PMA 13766200
QFRVL_PM_FV_SRC_EXISTS   EQU X'000C'                               @PMA 13767100
QFRVL_PM_MAX_FV_SRC      EQU X'000D'                               @PMA 13768000
QFRVL_PM_TGT_SE          EQU X'000E'                               @PMA 13768900
QFRVL_PM_TGT_CFE         EQU X'000F'                               @PMA 13769800
QFRVL_PM_TGT_SEC_CASC    EQU X'0010'                               @PMA 13770700
QFRVL_PM_TGT_SEC_NODSLFC EQU X'0011'                               @P2A 13771200
QFRVL_PM_SRC_NOWRINH     EQU X'0012'                               @P2A 13771700
*                        EQU X'0013'                               @SFA 13772290
*                        EQU X'0014'                               @SFA 13772380
QFRVL_PM_SOFT_FENCE      EQU X'0015'                               @SFA 13772470
QFRVL_PM_INC_BGC         EQU X'0017'                               @CFA 13772596
QFRVL_PM_MAX_FV_REL      EQU X'0018'                               @CFA 13772602
QFRVL_PM_NO_CR_BM        EQU X'0019'                               @CFA 13772608
QFRVL_PM_SGC_SOURCE      EQU X'001A'                               @SGA 13772610
QFRVL_PM_SGC_RECOVERY    EQU X'001B'                               @SGA 13772612
QFRVL_PM_GM_FORCE_CG     EQU X'001C'                               @FGA 13772616
QFRVL_PM_FC_SGC          EQU X'001D'                               @SSA 13772616
* RESERVED 1E-3F                                                   @FGC 13772618
* RESERVED 40-7F                                                        13772620
QFRVL_PM_TGT_NOT_PRIM    EQU X'0080'                               @P2C 13772700
QFRVL_PM_SEC_DIFF_SFI    EQU X'0081'                               @PMA 13773400
QFRVL_PM_NOT_DUPLEX      EQU X'0082'                               @PMA 13774300
QFRVL_PM_NOFEAT_SEC      EQU X'0083'                               @PMA 13775200
QFRVL_PM_SRC_NOT_PRIM    EQU X'0084'                               @P2C 13775600
QFRVL_PM_CTL_NOT_PRIM    EQU X'0084'                               @P2A 13776000
QFRVL_PM_UCLOAD_NOFEAT   EQU X'0085'                               @P2A 13776400
QFRVL_PM_ERROR_SENDING   EQU X'0086'                               @PMA 13777900
QFRVL_PM_TARGET_SE       EQU X'0087'                               @PMA 13778800
QFRVL_PM_USE_FOR_PM      EQU X'0088'                               @MTA 13778900
QFRVL_PM_PREF_MT         EQU X'0089'                               @MTA 13779000
QFRVL_PM_PPRCNOPM        EQU X'00D0'                               @05A 13779100
QFRVL_PM_NODUPNOPMV2     EQU X'00D1'                               @06A 13779200
QFRVL_PM_NOPMFEAT        EQU X'0100'                               @05A 13779400
*                                                                  @PMA 13779700
QFRVL_OUT_PM_MSG_TEXT DS CL68                                      @PMA 13780600
QFRVL_OUT_PM_MSG_RSRV DS CL4                                       @PMA 13781500
*                                                                  @PMA 13782400
QFRVL_OUT_PM_EXT_CAP  DS XL1                                       @PMA 13783300
QFRVL_PM_EXT_NOT_CAPABLE EQU X'00'                                 @PMA 13784200
QFRVL_PM_EXT_SRC_CAPABLE EQU X'01'                                 @PMA 13785100
QFRVL_PM_EXT_TGT_CAPABLE EQU X'02'                                 @PMA 13786000
*                                                                  @PMA 13786900
QFRVL_OUT_PM_EXT_RSN  DS XL2                                       @PMA 13787800
QFRVL_PM_EXT_CAPBL       EQU X'0000'                               @PMA 13788700
QFRVL_PM_EXT_SRC_EXIST   EQU X'0001'                               @PMA 13789600
QFRVL_PM_EXT_TGT_EXIST   EQU X'0002'                               @PMA 13790500
QFRVL_EXT_MAX_TGTS       EQU X'0003'                               @PMA 13791400
QFRVL_PM_EXT_VAL_REQD    EQU X'0004'                               @PMA 13792300
*                                                                  @PMA 13793200
QFRVL_OUT_EXTPID      DS XL2                                       @M2A 13794290
*                                                                  @M2A 13794480
QFRVL_OUT_XF_CAPB   DS   XL1                                       @XFA 13794676
QFRVL_XF_NOT_CAPABLE     EQU X'00'                                 @XFA 13794682
QFRVL_XF_CAPABLE         EQU X'01'                                 @XFA 13794688
QFRVL_XF_NOT_REQUESTED   EQU X'02'                                 @XFA 13794694
QFRVL_XF_NOT_CHECKED     EQU X'03'                                 @XFA 13794700
*                                                                       13794706
QFRVL_OUT_XF_RSN    DS   XL2                                       @XFA 13794712
QFRVL_XF_CAPBL           EQU X'0000'                               @XFA 13794718
QFRVL_XF_MAX_RELS        EQU X'0001'                               @XFA 13794724
* RESERVED 02-03                                                   @XFA 13794730
QFRVL_XF_CC              EQU X'0004'                               @XFA 13794736
QFRVL_XF_XRC_SRC         EQU X'0005'                               @XFA 13794742
QFRVL_XF_INHIBIT         EQU X'0006'                               @XFA 13794748
QFRVL_XF_VLFC_ACT        EQU X'0007'                               @XFA 13794754
QFRVL_XF_MAX_ESS         EQU X'0008'                               @XFA 13794760
QFRVL_XF_INACCESS        EQU X'0009'                               @XFA 13794766
QFRVL_XF_GM_PRIM         EQU X'000A'                               @XFA 13794772
QFRVL_XF_FV_TGT_EXISTS   EQU X'000B'                               @XFA 13794778
QFRVL_XF_FV_SRC_EXISTS   EQU X'000C'                               @XFA 13794784
QFRVL_XF_MAX_FV_SRC      EQU X'000D'                               @XFA 13794790
QFRVL_XF_TGT_SE          EQU X'000E'                               @XFA 13794796
QFRVL_XF_TGT_CFE         EQU X'000F'                               @XFA 13794802
QFRVL_XF_TGT_SEC_CASC    EQU X'0010'                               @XFA 13794808
QFRVL_XF_TGT_SEC_NODSLFC EQU X'0011'                               @XFA 13794814
QFRVL_XF_SRC_NOWRINH     EQU X'0012'                               @XFA 13794820
*                        EQU X'0013'                               @XFA 13794826
*                        EQU X'0014'                               @XFA 13794832
QFRVL_XF_SOFT_FENCE      EQU X'0015'                               @XFA 13794838
* RESERVED 16-3F                                                   @XFA 13794844
QFRVL_XF_NOT_ENABLED     EQU X'0040'                               @XFA 13794850
QFRVL_XF_CTL_NOT_PRIM    EQU X'0041'                               @XFA 13794856
QFRVL_XF_SESS_NAMES      EQU X'0042'                               @XFA 13794862
QFRVL_XF_CTL_VOL_SUS     EQU X'0043'                               @XFA 13794868
QFRVL_XF_ADDR_NOT_PRIM   EQU X'0044'                               @XFA 13794874
QFRVL_XF_ADDR_VOL_SUS    EQU X'0045'                               @XFA 13794880
QFRVL_XF_ADDR_VOL_SE     EQU X'0046'                               @XFA 13794886
QFRVL_XF_CTL_VOL_SE      EQU X'0047'                               @XFA 13794892
QFRVL_XF_NO_LIC_SUPP     EQU X'0048'                               @XFA 13794898
* RESERVED 49-100                                                  @XFA 13794904
*                                                                       13794910
QFRVL_OUT_XF_EXT_CAP  DS XL1                                       @XFA 13794916
QFRVL_XF_EXT_NOT_CAPABLE EQU X'00'                                 @XFA 13794922
QFRVL_XF_EXT_SRC_CAPABLE EQU X'01'                                 @XFA 13794928
QFRVL_XF_EXT_TGT_CAPABLE EQU X'02'                                 @XFA 13794934
*                                                                       13794940
QFRVL_OUT_XF_EXT_RSN  DS XL2                                       @XFA 13794946
*                                                                       13794952
         DS              CL2           RESERVED                    @08C 13794968
*                                                                       13795000
QFRVL_VOL_ENTRY_LEN EQU *-QFRVL_VOL_ENTRY                               13800000
*                                                                       13850000
*-----------------------------------------------------------------      13900000
* The following Volume Extent information is based on the pointer       13950000
* in QFRVL_IN_XTNT_PTR (above). Each extent has a beginning track       14000000
* location and an ending track location. If multiple extents are        14050000
* needed, each extent immediately follows the previous extent.          14100000
* The total number of extent(s) is placed in the                        14150000
* QFRVL_IN_XTNT_COUNT field. If QFRVL_IN_XTNT_PTR is zero or            14200000
* QFRVL_IN_XTNT_COUNT is zero, the default of full volume extent        14250000
* (all tracks) is used.                                                 14300000
*-----------------------------------------------------------------      14350000
*                                                                       14400000
QFRVL_VOL_EXTENT DSECT                                             @08C 14469990
*                                                                       14500000
QFRVL_EXTENT_BEGIN DS 0F                                                14550000
QFRVL_EXTENT_BGN_CYL  DS XL2                                            14600000
QFRVL_EXTENT_BGN_TRK  DS XL2                                            14650000
QFRVL_EXTENT_END   DS 0F                                                14700000
QFRVL_EXTENT_END_CYL  DS XL2                                            14750000
QFRVL_EXTENT_END_TRK  DS XL2                                            14800000
*                                                                       14850000
QFRVL_EXTENT_LENGTH EQU *-QFRVL_EXTENT_BEGIN                            14900000
*                                                                       14950000
.ZEND    ANOP  ,                                                        15000000
         MEND                                                           15050000
**** End ASM version *************************************************/ 15100000
*/** Begin PL/X version *********************************************** 15150000
.*/%ANTQFRVLPLAS2:;                                                     15200000
*                                                                       15250000
*DECLARE                                                                15300000
*%IF QFRVL_BASE = '' %THEN                                              15350000
*  %DO;                                                                 15400000
*  1 ANTQFRVL BASED BDY(DWORD),       /* ...                        */  15450000
*  %END;                                                                15500000
*%ELSE                                                                  15550000
*  %IF QFRVL_BASE = 'NONE' %THEN                                        15600000
*    %DO;                                                               15650000
*  1 ANTQFRVL BDY(DWORD),             /* ...                         */ 15700000
*    %END;                                                              15750000
*  %ELSE                                                                15800000
*    %DO;                                                               15850000
*  1 ANTQFRVL QFRVL_BASE BDY(DWORD),                                    15900000
*    %END;                                                              15950000
*    3 QFRVL_HEADER      BDY(DWORD),     /* Begin parm list          */ 16000000
*      5 QFRVL_EYE           CHAR(8),    /* Eyecatcher 'ANTQFRVL'    */ 16050000
*      5 QFRVL_VRL           FIXED(32),  /* Vers, Rls, Lvl, Rsrvd    */ 16100000
*      5 QFRVL_LEN           FIXED(31),  /* Total length             */ 16150000
*                                                                       16200000
*      5 QFRVL_RET_CODE      FIXED(32),  /* AOMQFC_RETCODE           */ 16250000
*      5 QFRVL_RSN_CODE      FIXED(32),  /* AOMQFC_REASON            */ 16300000
*      5 *                   CHAR(3),    /* reserved             @04C*/ 16333300
*      5 QFRVL_CV_CLUSTER    CHAR(1),    /* Contorl Vol Cluster  @04A*/ 16366600
*      5 QFRVL_COUNT         FIXED(31),  /* Count of Volume entries  */ 16400000
*                                                                       16450000
*    3 QFRVL_VOL_ENTRIES   CHAR(0);      /* Start of vol entries @PMA*/ 16471000
*DECLARE                                                                16492000
*%IF QFRVL_BASE = '' %THEN                                              16513000
*  %DO;                                                                 16534000
*  1 QFRVL_VOL_ENTRY(*) BASED BDY(WORD),                         ] @PMC 16555000
*  %END;                                                                16576000
*%ELSE                                                                  16597000
*  %DO;                                                                 16618000
*  1 QFRVL_VOL_ENTRY(*) BDY(WORD) BASED(ADDR(QFRVL_VOL_ENTRIES)), ]@PMC 16639000
*  %END;                                                                16660000
*    3 QFRVL_IN_VOLSER     CHAR(6),    /* Input volume serial        */ 16681000
*    3 QFRVL_IN_VOL_CAP    BIT(8),     /* Volume Rel Cap flags       */ 16702000
*      5 QFRVL_IN_VOL_SRC    BIT(1),   /* Vol Source Status          */ 16723000
*      5 QFRVL_IN_VOL_TGT    BIT(1),   /* Vol Target Status          */ 16744000
*      5 QFRVL_TGT_PPRC_OK   BIT(1),   /* PPRC Pri allowed       @XFC*/ 16773990
*      5 QFRVL_TGT_PPRC_NO   BIT(1),   /* PPRC PRI not allowed   @XFA*/ 16782980
*      5 QFRVL_SE_OK         BIT(1),   /* Eligible if SE         @XFA*/ 16791970
*      5 QFRVL_SE_NO         BIT(1),   /* Not eligible if SE     @XFA*/ 16800960
*      5 QFRVL_TGT_XRC_OK    BIT(1),   /* Allowed for XRC        @XFA*/ 16809950
*      5 QFRVL_TGT_XRC_NO    BIT(1),   /* Not allowed for XRC    @XFA*/ 16818940
*    3 QFRVL_IN_VOL2_CAP   BIT(8),     /* Volume Rel Cap flags 2 @CFA*/ 16832990
*      5 QFRVL_IN_VOL2_CRFLC_Type  BIT(1), /* Change Recording   @CFA*/ 16837980
*      5 *                   BIT(7),   /* Reserved               @CFA*/ 16842970
*                                                                       16850000
*    3 QFRVL_OUT_VOL_CAPB  CHAR(1),    /* Volume capability          */ 16900000
*    3 QFRVL_OUT_VOL_RSN   CHAR(1),    /* Volume reason              */ 16950000
*    3 QFRVL_OUT_XTNT_CAPB CHAR(1),    /* Extent capability          */ 17000000
*    3 QFRVL_OUT_XTNT_RSN  CHAR(1),    /* Extent reason              */ 17050000
*                                                                       17100000
*    3 QFRVL_OUT_FLAGS1    BIT(8),     /* Src and tgt list Flash @M2C*/ 17157990
*                                      /* Copy status            @M2A*/ 17165980
*     4 *                    BIT(6),   /* Reserved               @M2A*/ 17173970
*     4 QFRVL_OUT_EXTPVAL    BIT(1),   /* Extent pool ID valid   @M2A*/ 17181960
*     4 *                    BIT(1),   /* Reserved               @M2A*/ 17189950
*    3 QFRVL_OUT_FLAGS2    BIT(8),     /* AOMQFC Flags 2             */ 17200000
*    3 QFRVL_OUT_FLAGS3    BIT(8),     /* AOMQFC Flags 3             */ 17250000
*      5 *                   BIT(2),   /* Reserved                   */ 17300000
*      5 QFRVL_OUT_IOERR     BIT(1),   /* Vol Access I/O error       */ 17350000
*      5 *                   BIT(4),   /* Reserved                   */ 17400000
*    3 QFRVL_CLUSTER       CHAR(1),    /* Cluster ID for Volume  @04C*/ 17450000
*                                                                       17500000
*    3 QFRVL_OUT_TTL_RELS  FIXED(31),  /* Volume total relations     */ 17550000
*                                                                       17600000
*    3 QFRVL_OUT_MAX_RELS  FIXED(31),  /* Volume maximum relations   */ 17650000
*                                                                       17700000
*    3 QFRVL_OUT_AOM_RETC  CHAR(1),    /* AOM Return Code            */ 17750000
*    3 QFRVL_OUT_AOM_RSNC  CHAR(1),    /* AOM Reason Code            */ 17800000
*    3 QFRVL_OUT_UCB_RETC  CHAR(1),    /* UCBLOOK return code        */ 17850000
*    3 QFRVL_OUT_UCB_RSNC  CHAR(1),    /* UCBLOOK reason code        */ 17900000
*                                                                       17950000
*    3 QFRVL_OUT_SENSE7    CHAR(1),    /* I/O Sense byte 7           */ 18000000
*    3 QFRVL_OUT_SENSE8    CHAR(1),    /* I/O Sense byte 8           */ 18050000
*    3 QFRVL_OUT_SENSE_RSV CHAR(2),    /* Reserved sense info        */ 18100000
*                                                                       18150000
*    3 QFRVL_IN_XTNT_PTR   PTR(31),    /* Volume extent list ptr     */ 18200000
*    3 QFRVL_IN_XTNT_COUNT FIXED(31),  /* Volume extents count       */ 18250000
*                                                                       18300000
*    3 QFRVL_OUT_MSG_TEXT  CHAR(68),   /* Error Message text         */ 18350000
*    3 QFRVL_OUT_MSG_RSRV  CHAR(4),    /* Reserved text              */ 18400000
*                                                                       18450000
*    3 QFRVL_USER_RESERVED CHAR(16),   /* Reserved for user          */ 18460000
*                                                                       18470000
*/*** If any of the following fields are checked in any module,         18472000
*      the module must first check for version QFRVL_VRL2_CONSTANT      18474000
*                                                                @07A*/ 18476000
*    3 QFRVL_OUT_PM_CAPB   CHAR(1),    /* Pres mir capability    @PMA*/ 18480000
*    3 QFRVL_OUT_PM_RSN    CHAR(2),    /* Pres mir rsn code      @PMA*/ 18490000
*    3 QFRVL_OUT_PM_MSG_TEXT CHAR(68), /* Pres mir message text  @PMA*/ 18500000
*    3 QFRVL_OUT_PM_MSG_RSRV CHAR(4),  /* Pres mir reserved area @PMA*/ 18510000
*    3 QFRVL_OUT_PM_EXT_CAP  CHAR(1),  /* Pres mir extent Cap    @PMA*/ 18520000
*    3 QFRVL_OUT_PM_EXT_RSN  CHAR(2),  /* Pres mir extent Reason @PMA*/ 18530000
*    3 QFRVL_OUT_EXTPID      CHAR(2),  /* Extent Pool ID         @M2A*/ 18542990
*                                                                       18546470
*    3 QFRVL_OUT_XF_CAPB   CHAR(1),    /* XRCRPFC capability     @XFA*/ 18546960
*    3 QFRVL_OUT_XF_RSN    CHAR(2),    /* XRCRPFC rsn code       @XFA*/ 18547450
*    3 QFRVL_OUT_XF_EXT_CAP  CHAR(1),  /* XRCRPFC extent cap     @XFA*/ 18547940
*    3 QFRVL_OUT_XF_EXT_RSN  CHAR(2),  /* XRCRPFC extent reason  @XFA*/ 18548430
*    3 *                     CHAR(2);  /*                        @XFC*/ 18548920
*                                                                       18550000
*DECLARE                                                                18600000
*  1 QFRVL_VOL_EXTENTS(*)  BDY(WORD)    BASED(QFRVL_IN_XTNT_PTR),       18650000
*    3 QFRVL_EXTENT_BEGIN    FIXED(32),                                 18700000
*      5 QFRVL_EXTENT_BGN_CYL  FIXED(16),                               18750000
*      5 QFRVL_EXTENT_BGN_TRK  FIXED(16),                               18800000
*    3 QFRVL_EXTENT_END      FIXED(32),                                 18850000
*      5 QFRVL_EXTENT_END_CYL  FIXED(16),                               18900000
*      5 QFRVL_EXTENT_END_TRK  FIXED(16);                               18950000
*                                                                       19000000
*/*** Constants for eye-catchers ***/                                   19050000
*                                                                       19100000
*DECLARE                                                                19150000
*  QFRVL_EYE_CONSTANT CHAR(8)                                           19200000
*    CONSTANT('ANTQFRVL');               ] ACRONYM                      19250000
*DECLARE                                                                19300000
*  QFRVL_VRL_CONSTANT CHAR(4)                                           19350000
*    CONSTANT('02010000'X);              ] CURRENT VERS-REL-LEVEL  @PMC 19360590
*DECLARE                                                                19365200
*  QFRVL_VRL1_CONSTANT CHAR(4)                                          19372800
*    CONSTANT('01010000'X);              ] VERSION-RELEASE-LEVEL   @PMA 19380400
*DECLARE                                                                19388000
*  QFRVL_VRL2_CONSTANT CHAR(4)                                          19395600
*    CONSTANT('02010000'X);              ] VERSION-RELEASE-LEVEL   @PMA 19403200
*                                                                       19410800
*/*** Constants for Entry lengths      ***/                      ] @PMA 19418400
*DECLARE                                                         ] @PMA 19426000
*  QFRVL_V1_LENGTH        FIXED(31)  CONSTANT(128),              ] @PMA 19433600
*  QFRVL_V2_LENGTH        FIXED(31)  CONSTANT(216),              ] @08C 19442190
*  QFRVL_HEADER_LEN    FIXED(31)                                 ] @08A 19443180
*                      CONSTANT(LENGTH(QFRVL_HEADER)),           ] @08A 19444170
*  QFRVL_VOL_ENTRY_LEN FIXED(31)                                 ] @08A 19445160
*                      CONSTANT(LENGTH(QFRVL_VOL_ENTRY)),        ] @08A 19446150
*  QFRVL_EXTENT_LENGTH FIXED(31)                                 ] @08A 19447140
*                      CONSTANT(LENGTH(QFRVL_VOL_EXTENTS));      ] @08A 19448130
*                                                                       19450000
*/*** Constants for QFRVL_RET_CODE     ***/                             19500000
*                                                                       19550000
*DECLARE                                                                19600000
*  QFRVL_RETCODE_0    FIXED(31)  CONSTANT('00000000'X),                 19650000
*  QFRVL_RETCODE_4    FIXED(31)  CONSTANT('00000004'X),                 19700000
*  QFRVL_RETCODE_8    FIXED(31)  CONSTANT('00000008'X),                 19750000
*  QFRVL_RETCODE_12   FIXED(31)  CONSTANT('0000000C'X);                 19800000
*                                                                       19850000
*                                                                       19900000
*/*** Constants for QFRVL_RSN_CODE     ***/                             19950000
*                                                                       20000000
*DECLARE                                                                20050000
*  QFRVL_RTC0_RSC0    FIXED(31)  CONSTANT('00000000'X),                 20100000
*  QFRVL_RTC0_RSC1    FIXED(31)  CONSTANT('00000001'X),                 20150000
*  QFRVL_RTC4_RSC1    FIXED(31)  CONSTANT('00000001'X),                 20200000
*  QFRVL_RTC4_RSC2    FIXED(31)  CONSTANT('00000002'X),                 20250000
*  QFRVL_RTC8_RSC1    FIXED(31)  CONSTANT('00000001'X),                 20300000
*  QFRVL_RTC8_RSC2    FIXED(31)  CONSTANT('00000002'X),                 20350000
*  QFRVL_RTC8_RSC3    FIXED(31)  CONSTANT('00000003'X),                 20400000
*  QFRVL_RTC8_RSC4    FIXED(31)  CONSTANT('00000004'X),                 20450000
*  QFRVL_RTC12_RSC1   FIXED(31)  CONSTANT('00000001'X),                 20500000
*  QFRVL_RTC12_RSC2   FIXED(31)  CONSTANT('00000002'X),                 20550000
*  QFRVL_RTC12_RSC3   FIXED(31)  CONSTANT('00000003'X),                 20600000
*  QFRVL_RTC12_RSC4   FIXED(31)  CONSTANT('00000004'X),                 20650000
*  QFRVL_RTC12_RSC5   FIXED(31)  CONSTANT('00000005'X),                 20700000
*  QFRVL_RTC12_RSC6   FIXED(31)  CONSTANT('00000006'X),                 20750000
*  QFRVL_RTC12_RSC7   FIXED(31)  CONSTANT('00000007'X),                 20800000
*  QFRVL_RTC12_RSC8   FIXED(31)  CONSTANT('00000008'X),                 20850000
*  QFRVL_RTC12_RSC9   FIXED(31)  CONSTANT('00000009'X),                 20877500
*  QFRVL_RTC12_RSC10  FIXED(31)  CONSTANT('0000000A'X),         ] @P2A  20905000
*  QFRVL_RTC12_RSC11  FIXED(31)  CONSTANT('0000000B'X),         ] @P2A  20910000
*  QFRVL_RTC12_RSC12  FIXED(31)  CONSTANT('0000000C'X),         ] @P2A  20915000
*  QFRVL_RTC12_RSC13  FIXED(31)  CONSTANT('0000000D'X),         ] @P2A  20920000
*  QFRVL_RTC12_RSC14  FIXED(31)  CONSTANT('0000000E'X),         ] @P2A  20925000
*  QFRVL_RTC12_RSC15  FIXED(31)  CONSTANT('0000000F'X),         ] @P2A  20930000
*  QFRVL_RTC12_RSC16  FIXED(31)  CONSTANT('00000010'X),         ] @P2A  20935000
*  QFRVL_RTC12_RSC17  FIXED(31)  CONSTANT('00000011'X),         ] @P2A  20940000
*  QFRVL_RTC12_RSC18  FIXED(31)  CONSTANT('00000012'X),         ] @SFC  20945990
*  QFRVL_RTC12_RSC19  FIXED(31)  CONSTANT('00000013'X),         ] @SFA  20946980
*  QFRVL_RTC12_RSC20  FIXED(31)  CONSTANT('00000014'X),         ] @SFA  20947970
*  QFRVL_RTC12_RSC21  FIXED(31)  CONSTANT('00000015'X),         ] @CFC  20949050
*  QFRVL_RTC12_RSC22  FIXED(31)  CONSTANT('00000016'X),         ] @CFA  20949140
*  QFRVL_RTC12_RSC23  FIXED(31)  CONSTANT('00000017'X),         ] @CFA  20949230
*  QFRVL_RTC12_RSC24  FIXED(31)  CONSTANT('00000018'X),         ] @CFA  20949320
*  QFRVL_RTC12_RSC25  FIXED(31)  CONSTANT('00000019'X),         ] @FGC  20949500
*  QFRVL_RTC12_RSC26  FIXED(31)  CONSTANT('0000001A'X),         ] @SGA  20949530
*  QFRVL_RTC12_RSC27  FIXED(31)  CONSTANT('0000001B'X),         ] @SGA  20949560
*  QFRVL_RTC12_RSC28  FIXED(31)  CONSTANT('0000001C'X),         ] @FGA  20949590
*  QFRVL_RTC12_RSC29  FIXED(31)  CONSTANT('0000001D'X);         ] @SSA  20949590
*                                                                       20950000
*                                                                       21000000
*/*** Constants for Volume Capability Reason Codes    ***/              21050000
*                                                                       21100000
*DECLARE                                                                21150000
*  QFRVL_VOL_NOT_CAP  FIXED(8)  CONSTANT('00'X),                        21200000
*  QFRVL_VOL_SRC_CAP  FIXED(8)  CONSTANT('01'X),                        21250000
*  QFRVL_VOL_TGT_CAP  FIXED(8)  CONSTANT('02'X);                        21300000
*                                                                       21350000
*                                                                       21400000
*/*** Constants for Volume Eligibility Reason Codes    ***/             21450000
*                                                                       21500000
*DECLARE                                                                21550000
*  QFRVL_VOL_CAPBL    FIXED(8)  CONSTANT('00'X),                        21600000
*  QFRVL_VOL_MAX_VOL  FIXED(8)  CONSTANT('01'X),                        21650000
*  QFRVL_VOL_PPRC_PR  FIXED(8)  CONSTANT('02'X),                        21700000
*  QFRVL_VOL_PPRC_SC  FIXED(8)  CONSTANT('03'X),                        21750000
*  QFRVL_VOL_CC       FIXED(8)  CONSTANT('04'X),                        21800000
*  QFRVL_VOL_XRC_SRC  FIXED(8)  CONSTANT('05'X),                        21850000
*  QFRVL_VOL_INHIBIT  FIXED(8)  CONSTANT('06'X),                        21900000
*  QFRVL_VOL_VLFC_ACT FIXED(8)  CONSTANT('07'X),                        21950000
*  QFRVL_VOL_MAX_ESS  FIXED(8)  CONSTANT('08'X),                        22000000
*  QFRVL_VOL_INACCESS FIXED(8)  CONSTANT('09'X),                        22050000
*  QFRVL_VOL_GM_PRIM        FIXED(8)  CONSTANT('0A'X),           ] @P2A 22055000
*  QFRVL_VOL_FV_TGT_EXISTS  FIXED(8)  CONSTANT('0B'X),           ] @P2A 22060000
*  QFRVL_VOL_FV_SRC_EXISTS  FIXED(8)  CONSTANT('0C'X),           ] @P2A 22065000
*  QFRVL_VOL_MAX_FV_SRC     FIXED(8)  CONSTANT('0D'X),           ] @P2A 22070000
*  QFRVL_VOL_TGT_SE         FIXED(8)  CONSTANT('0E'X),           ] @P2A 22075000
*  QFRVL_VOL_TGT_CFE        FIXED(8)  CONSTANT('0F'X),           ] @P2A 22080000
*  QFRVL_VOL_TGT_CASC       FIXED(8)  CONSTANT('10'X),           ] @P2A 22085000
*  QFRVL_VOL_TGT_NODSLFC    FIXED(8)  CONSTANT('11'X),           ] @P2A 22090000
*  QFRVL_VOL_SRC_NOWRINH    FIXED(8)  CONSTANT('12'X),           ] @P2A 22095000
*  *                        FIXED(8)  CONSTANT('13'X),           ] @SFA 22096000
*  *                        FIXED(8)  CONSTANT('14'X),           ] @SFA 22097000
*  QFRVL_VOL_SOFT_FENCE     FIXED(8)  CONSTANT('15'X),           ] @SFA 22098000
*  QFRVL_VOL_INC_BGC        FIXED(8)  CONSTANT('17'X),           ] @CFA 22098500
*  QFRVL_VOL_MAX_FV_REL     FIXED(8)  CONSTANT('18'X),           ] @CFA 22099000
*  QFRVL_VOL_NO_CR_BM       FIXED(8)  CONSTANT('19'X),           ] @CFA 22099500
*  QFRVL_VOL_SGC_SOURCE     FIXED(8)  CONSTANT('1A'X),           ] @SGA 22099560
*  QFRVL_VOL_SGC_RECOVERY   FIXED(8)  CONSTANT('1B'X),           ] @SGA 22099620
*  QFRVL_VOL_GM_FORCE_CG    FIXED(8)  CONSTANT('1C'X),           ] @FGA 22099700
*  QFRVL_VOL_FC_SGC         FIXED(8)  CONSTANT('1D'X),           ] @SSA 22099700
*  QFRVL_VOL_NOTFOUND FIXED(8)  CONSTANT('C8'X),                        22100000
*  QFRVL_VOL_NOT_FC   FIXED(8)  CONSTANT('C9'X),                        22150000
*  QFRVL_VOL_BNDRY    FIXED(8)  CONSTANT('CA'X),                        22200000
*  QFRVL_VOL_IO_ERR   FIXED(8)  CONSTANT('CB'X),                        22250000
*  QFRVL_VOL_TRK_FMT  FIXED(8)  CONSTANT('CC'X),                 ] @02C 22275000
*  QFRVL_VOL_IO_TMOUT FIXED(8)  CONSTANT('CE'X),                 ] @02A 22300000
*  QFRVL_VOL_OUTRANGE FIXED(8)  CONSTANT('CF'X);                 ] @02A 22325000
*                                                                       22350000
*                                                                       22400000
*/*** Constants for Extent Capability Reason Codes     ***/             22450000
*                                                                       22500000
*DECLARE                                                                22550000
*  QFRVL_XT_NOT_CPBL  FIXED(8)  CONSTANT('00'X),                        22600000
*  QFRVL_XT_SRC_CPBL  FIXED(8)  CONSTANT('01'X),                        22650000
*  QFRVL_XT_TGT_CPBL  FIXED(8)  CONSTANT('02'X);                        22700000
*                                                                       22750000
*                                                                       22800000
*/*** Constants for Extent Eligibility Reason Codes    ***/             22850000
*                                                                       22900000
*DECLARE                                                                22950000
*  QFRVL_XT_CAPBL     FIXED(8)  CONSTANT('00'X),                        23000000
*  QFRVL_XT_ACTV_SRC  FIXED(8)  CONSTANT('01'X),                        23050000
*  QFRVL_XT_ACTV_TGT  FIXED(8)  CONSTANT('02'X),                        23100000
*  QFRVL_XT_MAX_TGTS  FIXED(8)  CONSTANT('03'X),                        23150000
*  QFRVL_XT_VALID_REQ FIXED(8)  CONSTANT('04'X);                        23200000
*                                                                       23250000
*/*** Constants for Preserve mirror capability         ***/             23251500
*                                                                       23253000
*DECLARE                                                                23254500
*  QFRVL_PM_NOT_CAPABLE   FIXED(8)  CONSTANT('00'X),                    23256000
*  QFRVL_PM_CAPABLE       FIXED(8)  CONSTANT('01'X),                    23257500
*  QFRVL_PM_NOT_REQUESTED FIXED(8)  CONSTANT('02'X),                    23259000
*  QFRVL_PM_NOT_CHECKED   FIXED(8)  CONSTANT('03'X);                    23260500
*                                                                       23262000
*/*** Preserve mirror reason codes                     ***/             23263500
*DECLARE                                                                23265000
*  QFRVL_PM_CAPBL         FIXED(16) CONSTANT('0000'X),                  23266500
*  QFRVL_PM_MAX_RELS      FIXED(16) CONSTANT('0001'X),                  23268000
*  QFRVL_PM_CC            FIXED(16) CONSTANT('0004'X),                  23269500
*  QFRVL_PM_XRC_SRC       FIXED(16) CONSTANT('0005'X),                  23271000
*  QFRVL_PM_INHIBIT       FIXED(16) CONSTANT('0006'X),                  23272500
*  QFRVL_PM_VLFC_ACT      FIXED(16) CONSTANT('0007'X),                  23274000
*  QFRVL_PM_MAX_ESS       FIXED(16) CONSTANT('0008'X),                  23275500
*  QFRVL_PM_INACCESS      FIXED(16) CONSTANT('0009'X),                  23277000
*  QFRVL_PM_GM_PRIM       FIXED(16) CONSTANT('000A'X),                  23278500
*  QFRVL_PM_FV_TGT_EXISTS FIXED(16) CONSTANT('000B'X),                  23280000
*  QFRVL_PM_FV_SRC_EXISTS FIXED(16) CONSTANT('000C'X),                  23281500
*  QFRVL_PM_MAX_FV_SRC    FIXED(16) CONSTANT('000D'X),                  23283000
*  QFRVL_PM_TGT_SE        FIXED(16) CONSTANT('000E'X),                  23284500
*  QFRVL_PM_TGT_CFE       FIXED(16) CONSTANT('000F'X),                  23286000
*  QFRVL_PM_TGT_SEC_CASC  FIXED(16) CONSTANT('0010'X),                  23287500
*  QFRVL_PM_TGT_SEC_NODSLFC FIXED(16) CONSTANT('0011'X),       ] @P2A   23288200
*  QFRVL_PM_SRC_NOWRINH   FIXED(16) CONSTANT('0012'X),         ] @P2A   23288900
*  *                      FIXED(16) CONSTANT('0013'X),         ] @SFA   23289000
*  *                      FIXED(16) CONSTANT('0014'X),         ] @SFA   23289100
*  QFRVL_PM_SOFT_FENCE    FIXED(16) CONSTANT('0015'X),         ] @SFA   23289200
*  QFRVL_PM_INC_BGC       FIXED(16) CONSTANT('0017'X),         ] @CFA   23289300
*  QFRVL_PM_MAX_FV_REL    FIXED(16) CONSTANT('0018'X),         ] @CFA   23289400
*  QFRVL_PM_NO_CR_BM      FIXED(16) CONSTANT('0019'X),         ] @CFA   23289500
*  QFRVL_PM_SGC_SOURCE    FIXED(16) CONSTANT('001A'X),         ] @SGA   23289510
*  QFRVL_PM_SGC_RECOVERY  FIXED(16) CONSTANT('001B'X),         ] @SGA   23289520
*  QFRVL_PM_GM_FORCE_CG   FIXED(16) CONSTANT('001C'X),         ] @FGA   23289550
*  QFRVL_PM_FC_SGC        FIXED(16) CONSTANT('001D'X),         ] @SSA   23289550
*  QFRVL_PM_TGT_NOT_PRIM  FIXED(16) CONSTANT('0080'X),         ] @P2C   23289600
*  QFRVL_PM_SEC_DIFF_SFI  FIXED(16) CONSTANT('0081'X),                  23290500
*  QFRVL_PM_NOT_DUPLEX    FIXED(16) CONSTANT('0082'X),                  23292000
*  QFRVL_PM_NOFEAT_SEC    FIXED(16) CONSTANT('0083'X),                  23293500
*  QFRVL_PM_SRC_NOT_PRIM  FIXED(16) CONSTANT('0084'X),         ] @P2C   23294200
*  QFRVL_PM_CTL_NOT_PRIM  FIXED(16) CONSTANT('0084'X),         ] @P2A   23294900
*  QFRVL_PM_UCLOAD_NOFEAT FIXED(16) CONSTANT('0085'X),         ] @P2A   23295600
*  QFRVL_PM_ERROR_SENDING FIXED(16) CONSTANT('0086'X),                  23296500
*  QFRVL_PM_TARGET_SE     FIXED(16) CONSTANT('0087'X),         ] @05C   23297200
*  QFRVL_PM_USE_FOR_PM    FIXED(16) CONSTANT('0088'X),         ] @MTA   23297400
*  QFRVL_PM_PREF_MT       FIXED(16) CONSTANT('0089'X),         ] @MTA   23297600
*  QFRVL_PM_PPRCNOPM      FIXED(16) CONSTANT('00D0'X),         ] @05A   23297900
*  QFRVL_PM_NODUPNOPMV2   FIXED(16) CONSTANT('00D1'X),         ] @06A   23298200
*  QFRVL_PM_NOPMFEAT      FIXED(16) CONSTANT('0100'X);         ] @05A   23298600
*                                                                       23299300
*                                                                       23300000
*/*** Constants for XRC RPFC reason codes              ***/             23301000
*                                                                       23302000
*DECLARE                                                                23303000
*  QFRVL_XF_NOT_CAPABLE   FIXED(8)  CONSTANT('00'X),                    23304000
*  QFRVL_XF_CAPABLE       FIXED(8)  CONSTANT('01'X),                    23305000
*  QFRVL_XF_NOT_REQUESTED FIXED(8)  CONSTANT('02'X),                    23306000
*  QFRVL_XF_NOT_CHECKED   FIXED(8)  CONSTANT('03'X);                    23307000
*                                                                       23308000
*/*** XRC RPFC reason codes                     ***/           ] @XFA   23309000
*DECLARE                                                       ] @XFA   23310000
*  QFRVL_XF_CAPBL         FIXED(16) CONSTANT('0000'X),         ] @XFA   23311000
*  QFRVL_XF_MAX_RELS      FIXED(16) CONSTANT('0001'X),         ] @XFA   23312000
*  QFRVL_XF_CC            FIXED(16) CONSTANT('0004'X),         ] @XFA   23313000
*  QFRVL_XF_XRC_SRC       FIXED(16) CONSTANT('0005'X),         ] @XFA   23314000
*  QFRVL_XF_INHIBIT       FIXED(16) CONSTANT('0006'X),         ] @XFA   23315000
*  QFRVL_XF_VLFC_ACT      FIXED(16) CONSTANT('0007'X),         ] @XFA   23316000
*  QFRVL_XF_MAX_ESS       FIXED(16) CONSTANT('0008'X),         ] @XFA   23317000
*  QFRVL_XF_INACCESS      FIXED(16) CONSTANT('0009'X),         ] @XFA   23318000
*  QFRVL_XF_GM_PRIM       FIXED(16) CONSTANT('000A'X),         ] @XFA   23319000
*  QFRVL_XF_FV_TGT_EXISTS FIXED(16) CONSTANT('000B'X),         ] @XFA   23320000
*  QFRVL_XF_FV_SRC_EXISTS FIXED(16) CONSTANT('000C'X),         ] @XFA   23321000
*  QFRVL_XF_MAX_FV_SRC    FIXED(16) CONSTANT('000D'X),         ] @XFA   23322000
*  QFRVL_XF_TGT_SE        FIXED(16) CONSTANT('000E'X),         ] @XFA   23323000
*  QFRVL_XF_TGT_CFE       FIXED(16) CONSTANT('000F'X),         ] @XFA   23324000
*  QFRVL_XF_TGT_SEC_CASC  FIXED(16) CONSTANT('0010'X),         ] @XFA   23325000
*  QFRVL_XF_TGT_SEC_NODSLFC FIXED(16) CONSTANT('0011'X),       ] @XFA   23326000
*  QFRVL_XF_SRC_NOWRINH   FIXED(16) CONSTANT('0012'X),         ] @XFA   23327000
*  *                      FIXED(16) CONSTANT('0013'X),         ] @XFA   23328000
*  *                      FIXED(16) CONSTANT('0014'X),         ] @XFA   23329000
*  QFRVL_XF_SOFT_FENCE    FIXED(16) CONSTANT('0015'X),         ] @XFA   23330000
*  QFRVL_XF_NOT_ENABLED   FIXED(16) CONSTANT('0040'X),         ] @XFA   23331000
*  QFRVL_XF_CTL_NOT_PRIM  FIXED(16) CONSTANT('0041'X),         ] @XFA   23332000
*  QFRVL_XF_SESS_NAMES    FIXED(16) CONSTANT('0042'X),         ] @XFA   23333000
*  QFRVL_XF_CTL_VOL_SUS   FIXED(16) CONSTANT('0043'X),         ] @XFA   23334000
*  QFRVL_XF_ADDR_NOT_PRIM FIXED(16) CONSTANT('0044'X),         ] @XFA   23335000
*  QFRVL_XF_ADDR_VOL_SUS  FIXED(16) CONSTANT('0045'X),         ] @XFA   23336000
*  QFRVL_XF_ADDR_VOL_SE   FIXED(16) CONSTANT('0046'X),         ] @XFA   23337000
*  QFRVL_XF_CTL_VOL_SE    FIXED(16) CONSTANT('0047'X),         ] @XFA   23338000
*  QFRVL_XF_NO_LIC_SUPP   FIXED(16) CONSTANT('0048'X);         ] @XFA   23339000
*                                                                       23340000
*/** End PL/X version ************************************************/ 23350000
