*/** Start of Specifications  ***************************************** 00050000
*                                                                     * 00100000
*   $MAC(ANTRQMAP)  COMP(DF117)  PROD(SDM):                           * 00150000
*                                                                     * 00200000
*   Descriptive Name = Mapping macro for RQUERY output.               * 00250000
*                                                                     * 00300000
*********************************************************************** 00350000
*                                                                     * 00400000
*   PROPRIETARY V3 STATEMENT                                          * 00450000
*   Licensed Materials - Property of IBM                              * 00500000
*   "Restricted Materials of IBM"                                     * 00550000
*   5694-A01                                                          * 00600000
*   Copyright IBM Corp. 2004,2023                                     * 00679980
*   END PROPRIETARY V3 STATEMENT                                      * 00700000
*                                                                     * 00750000
*********************************************************************** 00800000
*                                                                     * 00850000
*   Function = This macro provides mappings of the data returned by   * 00900000
*              the ANTRQST ILK=ESSRVCS,REQUEST=RQUERY service.        * 00950000
*                                                                     * 01000000
*   Input =                                                           * 01050000
*                                                                     * 01100000
*      Assembler =                                                    * 01150000
*                                                                     * 01200000
*          ANTRQMAP TYPE=STAT4A!STAT4B!STAT4C!STAT51                  * 01250000
*                                                                     * 01300000
*      PL/X =                                                         * 01350000
*                                                                     * 01400000
*          ? ANTRQMAP TYPE(STAT4A!STAT4B!STAT4C!STAT51)               * 01450000
*                                                                     * 01500000
*      where                                                          * 01550000
*                                                                     * 01600000
*            TYPE - tells what kind of mapping to generate. The       * 01650000
*                   valid values are:                                 * 01700000
*                                                                     * 01750000
*                     STAT4A: a mapping that gives                    * 01800000
*                                                                     * 01850000
*                     STAT4B: a mapping that gives                    * 01900000
*                                                                     * 01950000
*                     STAT4C: a mapping that gives                    * 02000000
*                                                                     * 02050000
*                     STAT51: a mapping that gives                    * 02100000
*                                                                     * 02150000
*                                                                     * 02200000
*   Output = A mapping of the requested type.                         * 02250000
*                                                                     * 02300000
*   Notes =                                                           * 02350000
*                                                                     * 02400000
*         - ANTRQMAP may be invoked multiple times with different     * 02450000
*           TYPE values.                                              * 02500000
*                                                                     * 02550000
*   Exit-Normal = Macro return code 0                                 * 02600000
*                                                                     * 02650000
*   Exit-Error = Macro return code 8                                  * 02700000
*                                                                     * 02750000
*           ANTRQMAP.01 - Positional parameters not allowed           * 02800000
*           ANTRQMAP.02 - Invalid TYPE parameter value                * 02850000
*                                                                     * 02900000
*   Owner = Bob Crockett                                              * 02950000
*                                                                     * 03000000
*   Change Activity =                                                 * 03050000
*                                                                     * 03100000
*     $L0=OA08829,HDZ11G0,040819,TUCRNC: Initial version         @L0A * 03150000
* $01=OA14852,HDZ11J0,060509,TUCRNC: Fix spelling errors          @01A* 03175000
* $MG=OA33030,HDZ1190,090901,TUCCGS: Multiple GM                  @MGA* 03187500
* $CP=OA38976,HDZ1B10,120101,TUCCGS: GM CGPAUSE                   @CPA* 03193500
* $TS=OA39733,HDZ1C10,130607,RUSTYS: Time Synchronization         @TSA* 03196500
* $MT=OA43654,HDZ1C10,130927,TUCCGS: Multi Target PPRC            @MTA* 03197500
* $MU=OA62809,HDZ2250,220222,INDUDA: Multiple GM Session on LSS   @MUA* 03197500
* $02=OA64310,HDZ2250,230206,INDUDA: PE RQUERY UNKNOWN VERSION    @02A* 03197500
*                                                                     * 03200000
**** End of Specifications *******************************************/ 03250000
*/** Begin ASM version ************************************************ 03300000
         MACRO                                                          03350000
         ANTRQMAP &TYPE=                                                03400000
         LCLA  &ZMACRET                                                 03450000
&ZMACRET SETA  0                                                        03500000
.*                                                                      03550000
.* Check for positional parameters                                      03600000
.*                                                                      03650000
         AIF   (N'&SYSLIST EQ 0).NOPSTNL                                03700000
         MNOTE 8,'ANTRQMAP.01 - Positional parameters not allowed'      03750000
&ZMACRET SETA  8                                                        03800000
         AGO   .ZEND                                                    03850000
.NOPSTNL ANOP  ,                                                        03900000
.*                                                                      03950000
.* Check TYPE parameter                                                 04000000
.*                                                                      04050000
         AIF   ('&TYPE(1)' EQ 'STAT4A').ST4A                            04100000
         AIF   ('&TYPE(1)' EQ 'STAT4B').ST4B                            04150000
         AIF   ('&TYPE(1)' EQ 'STAT4C').ST4C                            04200000
         AIF   ('&TYPE(1)' EQ 'STAT51').ST51                            04250000
     MNOTE 8,'ANTRQMAP.02 - TYPE parameter is invalid'                  04300000
&ZMACRET SETA  8                                                        04350000
         AGO   .ZEND                                                    04400000
.*                                                                      04450000
.* STAT4A mapping                                                       04500000
.*                                                                      04550000
.ST4A    ANOP  ,                                                        04600000
ST4A     DSECT                                                          04650000
ST4A_HEADER DS 0XL12                *                                   04700000
ST4AH_EYE DS   XL8                  * "RQMPST4A"                        04750000
ST4AH_SIZE DS  XL2                  * Length of ST4A                    04800000
ST4AH_VER DS   XL1                  * Mapping macro version             04850000
         DS    XL1                  *                                   04900000
ST4A_REST DS   0C                   *                                   04950000
ST4A_STATUS DS XL1                  *                                   05000000
ST4AS_NOVOLS EQU B'10000000'        * Session has no volumes. All of    05050000
*                                   * the counters are set to zero.     05100000
ST4AS_ONE EQU  B'01000000'          * The following fields are valid:   05150000
*                                   *  ST4A_SNBR                        05200000
*                                   *  ST4A_OOS_TRACKS                  05250000
ST4AS_TWO EQU  B'00100000'          * The following fields are valid:   05300000
*                                   *  ST4A_CGFLAGS                     05350000
*                                   *  ST4A_SNBR                        05400000
*                                   *  ST4A_FC_SEQ_NBR                  05450000
ST4AS_NOTCS EQU B'00001000'         * Data could not be collected due   05500000
*                                   * to inaccessibility of control     05550000
*                                   * structures. Rest of status        05600000
*                                   * description will be zero.         05650000
ST4AS_NOSESS EQU B'00000100'        * Global Mirror physical session    05700000
*                                   * has not been started. ST4A_SNBR   05750000
*                                   * is valid.                         05800000
ST4AS_CUGMPCG EQU B'00000010'       * CU supports GM Pause on CG Bdry   06150000
ST4A_CGFLAGS DS XL1                 *                                   05850000
ST4AF_RNREQ EQU B'10000000'         * Revertible or Not Revertible, and 05900000
*                                   * equal                             05950000
ST4AF_NREQ EQU B'01000000'          * Not Revertible and equal          06000000
ST4AF_RNR EQU  B'00100000'          * Revertible and Not Revertible     06050000
ST4AF_ALLR EQU B'00010000'          * All Revertible                    06100000
ST4AF_CGBAD EQU B'00001000'         * Consistency Group corrupted       06150000
ST4A_STYPE DS  XL1                  * Session type                      06200000
ST4A_SNBR DS   XL1                  * Session number                    06250000
ST4A_OOS_TRACKS DS XL8              * Total number of Out-Of_Sync       06300000
*                                   * tracks                            06350000
         DS    XL32                 * Reserved                          06400000
ST4A_FC_SEQ_NBR DS XL4              * FlashCopy sequence number         06450000
ST4AL    EQU   *-ST4A_STATUS        *                                   06500000
         AGO   .ZEND                                                    06550000
.*                                                                      06600000
.* STAT4B mapping                                                       06650000
.*                                                                      06700000
.ST4B    ANOP  ,                                                        06750000
ST4B     DSECT                                                          06800000
ST4B_HEADER DS 0XL12                *                                   06850000
ST4BH_EYE DS   XL8                  * "RQMPST4B"                        06900000
ST4BH_SIZE DS  XL2                  * Length of ST4B                    06950000
ST4BH_VER DS   XL1                  * Mapping macro version             07000000
         DS    XL1                  *                                   07050000
ST4B_REST DS   0C                   *                                   07100000
ST4B_FLAGS DS  XL1                  *                                   07150000
ST4BF_ALL0 EQU B'10000000'          * All OOS bitmaps for all volumes   07200000
*                                   * are zero.                         07250000
ST4BF_NOTCS EQU B'01000000'         * Session not in correct state to   07300000
*                                   * allow consistency group           07350000
*                                   * formation. ST4B_NOTCS_REASON will 07400000
*                                   * give the reason.                  07450000
ST4BF_NOSTR EQU B'00001000'         * Unable to get to structures.      07500000
*                                   * ST4B_NOTCS_REASON and ST4B_VOLCNT 07550000
*                                   * will be zero.                     07600000
ST4BF_NOSESS EQU B'00000100'        * Session has not been started.     07650000
*                                   * ST4B_NOTCS_REASON and ST4B_VOLCNT 07700000
*                                   * will be zero.                     07750000
ST4BF_CUGMPCG EQU B'00000010'       * CU supports GM Pause on CG Bdry   06150000
ST4B_NOTCS_REASON DS XL1            *                                   07800000
ST4BR_NOTVOL EQU B'10000000'        * One or more volumes are not in a  07850000
*                                   * state to allow a consistency      07900000
*                                   * group to be formed.               07950000
ST4BR_NOTCR EQU B'01000000'         * Change recording cannot be        08000000
*                                   * activated in one or more volumes. 08050000
ST4BR_UNKVOL EQU B'00100000'        * One or more volumes are in an     08100000
*                                   * unknown state.                    08150000
ST4BR_IOVOL EQU B'00010000'         * One or more volumes are not in    08200000
*                                   * the correct state because of I/O  08250000
*                                   * going on.                         08300000
ST4BR_ESCON EQU B'00001000'         * One or more volumes have been     08350000
*                                   * established with ESCON paths.     08400000
         DS    XL2                  * Reserved                          08450000
ST4B_STYPE DS  XL1                  * Session type                      08500000
ST4B_SNBR DS   XL1                  * Session number                    08550000
ST4B_VOLCNT DS XL2                  * Count of volumes who do not have  08600000
*                                   * the ST4B bitmap zeroed out yet.   08650000
ST4BL    EQU   *-ST4B_FLAGS         *                                   08700000
         AGO   .ZEND                                                    08750000
.*                                                                      08800000
.* STAT4C mapping                                                       08850000
.*                                                                      08900000
.ST4C    ANOP  ,                                                        08950000
ST4C     DSECT                                                          09000000
ST4C_HEADER DS 0XL16                *                                   09050000
ST4CH_EYE DS   XL8                  * "RQMPST4C"                        09100000
ST4CH_SIZE DS  XL2                  * Total length of data returned by  09150000
*                                   * a STAT4C request                  09200000
ST4CH_VER DS   XL1                  * Mapping macro version             09250000
         DS    XL1                  *                                   09300000
ST4CH_SD_SIZE DS XL2                * Length of ST4C_SD                 09350000
ST4CH_VD_SIZE DS XL2                * Length of ST4C_VD                 09400000
ST4C_REST DS   0C                   *                                   09450000
ST4C_DATA_SIZE DS XL2               * How much data the storage control 09500000
*                                   * wants to give us.                 09550000
ST4C_SESSCNT DS XL1                 * Number of sessions in the storage 09600000
*                                   * control.                          09650000
ST4C_FLAGS DS  XL1                  *                                   09700000
ST4CF_STFMT EQU B'00000000'         * Single Target PPRC Format    @MTA 09710000
ST4CF_MTFMT EQU B'01000000'         * Multi Target PPRC Format     @MTA 09720000
ST4CF_NOTCS EQU B'00001000'         * Data could not be collected due   09750000
*                                   * to inaccessibility of control     09800000
*                                   * structures. Rest of status        09850000
*                                   * description will be zero.         09900000
ST4C_SESS_OUTPUT DS 0X              * Rest of output information,       09950000
*                                   * mapped by ST4C_SD DSECT.          10000000
ST4CL    EQU   *-ST4C_DATA_SIZE     *                                   10050000
*********************************************************************** 10100000
ST4C_SD  DSECT                      * Session detail, mapping of data   10150000
*                                   * starting at ST4C_SESS_OUTPUT.     10200000
*                                   * One session detail record for     10250000
*                                   * each session. Number of sessions  10300000
*                                   * found in ST4C_SESSCNT.            10350000
ST4C_STYPE DS  XL1                  * Session type                      10400000
ST4C_SNBR DS   XL1                  * Session number                    10450000
         DS    XL1                  * Reserved                          10500000
ST4C_SSTATUS DS XL1                 *                                   10550000
ST4CS_NOVOL EQU B'10000000'         * No active volumes in the session  10600000
ST4CS_ENSTATE_MASK EQU B'01100000'  * The second and third bits in      10650000
*                                   * ST4C_SSTATUS are called the       10700000
*                                   * Encoded Session State.  Their     10750000
*                                   * values are as follows:            10800000
*                                   *  00 - Session is in GM normal     10850000
*                                   *       state                       10900000
*                                   *  01 - Session is in GM increment  10950000
*                                   *       pending state               11000000
*                                   *  10 - Session is in GM            11050000
*                                   *       Consistency Group in        11100000
*                                   *       progress state              11150000
*                                   *  11 - Not used                    11200000
*                                   * The following EQUates can be used 11250000
*                                   * to test for the various bit       11300000
*                                   * combinations                      11350000
ST4CS_ENSTATE_BIT2 EQU B'01000000'  *                                   11400000
ST4CS_ENSTATE_BIT3 EQU B'00100000'  *                                   11450000
ST4CS_ENSTATE_BIT23 EQU B'01100000' *                                   11500000
ST4C_VOLCNT DS XL2                  * Number of volumes for session     11550000
ST4C_VOL_OUTPUT DS 0X               * Rest of output information,       11600000
*                                   * mapped by ST4C_VD DSECT.          11650000
ST4C_SDL EQU   *-ST4C_STYPE         *                                   11700000
*********************************************************************** 11750000
ST4C_VD  DSECT                      * Volume detail, mapping of data    11800000
*                                   * starting at ST4C_VOL_OUTPUT.      11850000
*                                   * One volume detail record for      11900000
*                                   * each volume. Number of volumes    11950000
*                                   * found in ST4C_VOLCNT.             12000000
ST4C_DVCNBR DS 0XL2                 * Device number                     12050000
ST4C_DVC_LSS DS XL1                 * Logical SubSystem number          12100000
ST4C_DVC_CCA_LUN DS XL1             * Channel Connection Address (CKD)/ 12150000
*                                   * Logical Unit Number (FB).         12200000
ST4C_VSTATUS DS XL1                 * Volume pair status                12250000
ST4CV_INSESS EQU B'10000000'        * In an GM session                  12300000
ST4CV_INCASC EQU B'01000000'        * In a cascading-allowed state      12350000
ST4CV_INJOIN EQU B'00100000'        * In the join pending state         12400000
ST4CV_INREMV EQU B'00010000'        * In the remove pending state       12450000
ST4CV_PASS1 EQU B'00001000'         * In the first pass of initial copy 12500000
ST4C_PVSTATUS DS XL1                * Primary volume status             12550000
ST4CP_CR_ACT     EQU B'10000000'    * CR active for other function @MTA 12560000
ST4CP_ADD_REL    EQU B'01000000'    * Additional multi target pairs@MTA 12570000
*                                   * exists enable MT to view them@MTA 12580000
ST4C_VSTATE_MASK EQU B'00000011'    * The seventh and eighth bits in    12600000
*                                   * ST4C_PVSTATUS are called Volume   12650000
*                                   * State. Their values are as        12700000
*                                   * follows:                          12750000
*                                   *  00 - Pair is simplex             12800000
*                                   *  01 - Pair is duplex pending      12850000
*                                   *  10 - Pair is full duplex         12900000
*                                   *  11 - Pair is suspended           12950000
*                                   * The following EQUates can be used 13000000
*                                   * to test for the various bit       13050000
*                                   * combinations                      13100000
ST4C_VSTATE_BIT7 EQU B'00000010'    *                                   13150000
ST4C_VSTATE_BIT8 EQU B'00000001'    *                                   13200000
ST4C_VSTATE_BIT78 EQU B'00000011'   *                                   13250000
ST4C_SVSTATUS DS XL1                * Secondary volume status. This     13300000
*                                   * field has exactly the same format 13350000
*                                   * as ST4C_PVSTATUS, so the EQUates  13400000
*                                   * defined for ST4C_PVSTATUS can     13450000
*                                   * also be used for this field       13500000
ST4C_PNUM_REL      DS XL1           * Num Rel for Primary vol      @MTA 13559990
ST4C_VDL EQU   *-ST4C_DVCNBR        * Compatibility Mode Size      @MTA 13569980
ST4C_SSERIAL       DS XL10          * Secondary Serial Number      @MTA 13579970
ST4C_SDVCNBR       DS 0XL2          * Secondary Volume IDs         @MTA 13589960
ST4C_SDVC_LSS      DS XL1           *                              @MTA 13599950
ST4C_SDVC_CCA_LUN  DS XL1           *                              @MTA 13609940
                   DS XL14          *                              @MTA 13619930
ST4C_VDL_MT EQU   *-ST4C_DVCNBR     * Multi-Target Mode Size       @MTA 13629920
         AGO   .ZEND                                                    13650000
.*                                                                      13700000
.* STAT51 mapping                                                       13750000
.*                                                                      13800000
.ST51    ANOP  ,                                                        13850000
ST51     DSECT                                                          13900000
ST51_HEADER DS 0XL20                *                                   13950000
ST51H_EYE DS   XL8                  * "RQMPST51"                        14000000
ST51H_SIZE DS  XL2                  * Total length of data returned by  14050000
*                                   * a STAT51 request                  14100000
ST51H_VER DS   XL1                  * Mapping macro version             14150000
         DS    XL1                  *                                   14200000
ST51H_MD_SIZE DS XL2                * Length of ST51_MD                 14250000
ST51H_SD_SIZE DS XL2                * Length of ST51_SD                 14300000
ST51H_ADH_SIZE DS XL2               * Length of ST51_ADH                14350000
ST51H_ADD_SIZE DS XL2               * Length of ST51_ADD                14400000
ST51_REST DS   0C                   *                                   14450000
ST51_FLAGS DS  XL1                  *                                   14500000
ST51F_NOCONF EQU B'10000000'        * No configuration for SNBR         14550000
ST51F_NOTCS EQU B'00001000'         * Could not get to the control      14600000
*                                   * structures.                       14650000
ST51F_NOTMCS EQU B'00000100'        * Could not get to the Master       14700000
*                                   * control structures.               14750000
ST51F_NOTSCS EQU B'00000010'        * Could not get to the Subordinate  14800000
*                                   * control structures.               14850000
         DS    XL1                  * Reserved                          14900000
ST51_DATA_SIZE DS XL2               * How much data the storage control 14950000
*                                   * wants to give us.                 15000000
ST51_MSTRCNT DS XL1                 * Number of master sessions         15050000
ST51_MSTR_OUTPUT DS 0X              * Rest of output information,       15100000
*                                   * mapped by ST51_MD DSECT.          15150000
ST51L    EQU   *-ST51_FLAGS         *                                   15200000
*********************************************************************** 15250000
ST51_MD  DSECT                      * Master detail, mapping of data    15300000
*                                   * starting at ST51_MSTR_OUTPUT.     15350000
*                                   * One master detail record for      15400000
*                                   * each session. Number of sessions  15450000
*                                   * found in ST51_MSTRCNT.            15500000
ST51_MFLAGS DS XL1                  *                                   15550000
ST51F_NODATA EQU B'00001000'        * Data could not be collected       15600000
ST51F_TS  EQU B'00000100'           * Bytes 48-64  - time sync info     15620000
ST51_STYPE DS  XL1                  * Session type                      15650000
ST51_SNBR DS   XL1                  * Session number                    15700000
ST51_STATE DS XL1                   * State of SNBR                     15750000
ST51_STATE_RUNNING EQU X'01'        * Global mirror session running     15800000
ST51_STATE_PAUSED EQU X'02'         * Global mirror session paused      15850000
ST51_STATE_FATAL EQU X'03'          * Global mirror session fatal error 15900000
ST51_STATE_PAUSING EQU X'04'        * Global mirror session pausing     15950000
ST51_STATE_NOT_OWN EQU X'05'        * GM session not owned by      @MGA 15960000
*                                   * cluster receiving command         15970000
ST51_STATE_RECOVER EQU X'06'        * GM session is being          @MGA 15980000
*                                   * recovered by the Master           15990000
ST51_STATE_CGPAUSE EQU X'07'        * GM Paused with Consistency   @CPA 15991000
*                                   *                                   15992000
ST51_STATE_CGPING  EQU X'08'        * GM Pausing with Consistency  @CPA 15993000
*                                   *                                   15994000
ST51_STATE_PFAIL   EQU X'09'        * GM Session Paused because    @CPA 15995000
*                                   * Un-suspend Failed                 15996000
ST51_FATAL DS XL1                   * Reason for fatal error            16000000
ST51_FATAL_REVERT EQU X'01'         * Revert FlashCopy failed           16050000
ST51_FATAL_INACCES EQU X'02'        * Global Mirror structures          16100000
*                                   * inaccessible or in a failed       16150000
*                                   * state                             16200000
ST51_FATAL_SEQNBR EQU X'03'         * Consistency check of sequence     16250000
*                                   * numbers failed                    16300000
ST51_FATAL_BADSID EQU X'04'         * Invalid session id detected       16350000
ST51_FATAL_CGBAD EQU X'05'          * Consistency Group corrupted       16400000
ST51_FATAL_TIMEOUT EQU X'06'        * Timeout during consistency check  16450000
ST51_FATAL_COMMFAIL EQU X'07'       * Communication failure during      16500000
*                                   * consistency check                 16550000
ST51_FATAL_NOTCOMP EQU X'08'        * Unable to complete consistency    16600000
*                                   * check                             16650000
ST51_FATAL_BUSY EQU X'09'           * Busy condition prevents           16700000
*                                   * consistency check                 16750000
ST51_FATAL_REVERTTO EQU X'0A'       * Revert FlashCopy failed due to    16800000
*                                   * timeout                           16850000
ST51_FATAL_NOSUBORD EQU X'0B'       * Global Mirror subordinate has     16900000
*                                   * been terminated by a Pause/       16950000
*                                   * Terminate GM command              17000000
ST51_CG_INTERVAL DS XL2             * CG Interval time (seconds)        17050000
ST51_MAX_COORD DS XL2               * Max Coord interval (milliseconds) 17100000
ST51_MAX_CG_DRAIN DS XL2            * Max CG Drain time (seconds)       17150000
ST51_CURRENT_TIME DS XL8            * ESS TOD in seconds, starting at   17200000
*                                   * 1 Jan 1970                        17250000
ST51_TIME_LAST_GOOD_CG DS XL8       * ESS TOD in seconds, starting at   17300000
*                                   * 1 Jan 1970                        17350000
ST51_BADCG_CNT DS XL4               * Number unsuccessful CG attempts   17400000
*                                   * since last successful CG          17450000
ST51_TOTAL_GOODPCT DS XL1           * Percent successful attempts       17500000
         DS    XL3                  * Reserved                          17550000
ST51_TOTAL_GOODCG DS XL4            * Total number successful CG        17600000
ST51_TOTAL_BADCG DS XL4             * Total number unsuccessful CG      17650000
ST51_SYSPLEXNAME  DS XL8            * Sysplex Name                      17707990
ST51_SYSPLEX_CGTIME  DS XL8         * Sysplex CG time in sec            17715980
ST51_SYSPLEX_EST_CURR_TIME DS XL8   * Sysplex estimated curr time       17723970
ST51_SYSPLEX_EST_DRIFT DS XL1       * CU estimated clock driftime       17731960
         DS    XL7                  * Reserved                          17739950
ST51_CG_FAILURE1 DS XL16            * First failure - mapped by         17750000
*                                   * ST51_CGF DSECT                    17800000
ST51_CG_FAILUREP DS XL16            * Previous failure - mapped by      17850000
*                                   * ST51_CGF DSECT                    17900000
ST51_CG_FAILUREL DS XL16            * Last failure                      17950000
*                                   * ST51_CGF DSECT                    18000000
ST51_MASTER_SERIAL DS XL10          *                                   18050000
ST51_SUBORD_CNT DS XL1              * Number of subordinate sessions    18100000
ST51_MASTER_LSS DS XL1              *                                   18150000
ST51_SUBORD_OUTPUT DS 0X            * Subordinate information, mapped   18200000
*                                   * by ST51_SD DSECT.                 18250000
ST51_MDL EQU   *-ST51_FLAGS         *                                   18300000
*********************************************************************** 18350000
ST51_SD  DSECT                      * Subordinate detail, mapping of    18400000
*                                   * data starting at ST51_SUBORD_     18450000
*                                   * OUTPUT. One detail record for     18500000
*                                   * each subordinate. Number of       18550000
*                                   * subordinates found in             18600000
*                                   * ST51_SUBORD_CNT.                  18650000
ST51_MASTER_SSID DS XL2             *                                   18700000
ST51_SUBORD_SSID DS XL2             *                                   18750000
ST51_MASTER_PATHA_LSS DS XL1        * Master path association LSS       18800000
ST51_SUBORD_PATHA_LSS DS XL1        * Subordinate path association LSS  18850000
ST51_SUBORD_SERIAL DS XL10          *                                   18900000
ST51_SDL EQU   *-ST51_MASTER_SSID   *                                   18950000
*********************************************************************** 19000000
ST51_ADH DSECT                      * Association header, mapping of    19050000
*                                   * data starting after last ST51_SD  19100000
*                                   * record.                           19150000
ST51_ASSOC_CNT DS XL1               * Number of master to subordinate   19200000
*                                   * associations                      19250000
ST51_SFLAGS DS XL1                  *                                   19300000
ST51S_NOTCS EQU B'00001000'         * Data could not be gathered        19350000
*                                   * because of inaccessibility of     19400000
*                                   * control structures                19450000
ST51_ASSOC_OUTPUT DS 0X             * Association detail information,   19500000
*                                   * mapped by ST51_ADD DSECT.         19550000
ST51A_ADHL EQU *-ST51_ASSOC_CNT     *                                   19600000
*********************************************************************** 19650000
ST51_ADD DSECT                      * Association detail, mapping of    19700000
*                                   * data starting at ST51_ASSOC__     19750000
*                                   * OUTPUT. One detail record for     19800000
*                                   * each association. Number of       19850000
*                                   * associations found in             19900000
*                                   * ST51_ASSOC_CNT.                   19950000
ST51A_STYPE DS  XL1                 * Session type                      20000000
ST51A_SNBR DS   XL1                 * Session number                    20050000
ST51A_MASTER_OWNING_SERIAL DS XL10  *                                   20100000
ST51A_ADDL EQU *-ST51A_STYPE        *                                   20150000
*********************************************************************** 20200000
ST51_CGF DSECT                      * Consistency Group failure         20250000
*                                   * information.                      20300000
ST51C_SERIAL DS XL10                * Failing ESS serial number         20350000
ST51C_LSS DS   XL1                  * Failing LSS number                20400000
         DS    XL1                  * Reserved                          20450000
ST51C_ERROR DS XL2                  * Error reason                      20500000
ST51C_ERROR_INACCES EQU X'0001'     * GM structures cannot be accessed  20550000
ST51C_ERROR_FAILURE EQU X'0002'     * Communication path failure        20600000
ST51C_ERROR_NOTCS EQU X'0003'       * GM members not in correct state   20650000
ST51C_ERROR_DRAIN EQU X'0004'       * Maximum CG drain time exceeded    20700000
ST51C_ERROR_STIME EQU X'0008'       * GM have not a valid Sysplex Time  20720000
ST51C_ERROR_BADPARM EQU X'0400'     * Invalid parm                      20750000
ST51C_ERROR_FORMAT0F_B EQU X'0F00'  * Format x'0F' error, where the     20800000
*                                   * second byte is the reason code -  20850000
*                                   * begin                             20900000
ST51C_ERROR_FORMAT0F_E EQU X'0FFF'  * Format x'0F' error, where the     20950000
*                                   * second byte is the reason code -  21000000
*                                   * end                               21050000
*                                   * What is actually returned is a    21100000
*                                   * 0Fxx error value, such as 0FB1.   21150000
*                                   * These two equates can be used to  21200000
*                                   * do a range check.                 21250000
ST51C_ERROR_MCODEERR_B EQU X'7000'  * Microcode logic error, where the  21300000
*                                   * first byte second nibble and      21350000
*                                   * second byte describe the error -  21400000
*                                   * begin                             21450000
ST51C_ERROR_MCODEERR_E EQU X'7FFF'  * Microcode logic error, where the  21500000
*                                   * first byte second nibble and      21550000
*                                   * second byte describe the error -  21600000
*                                   * end                               21650000
ST51C_ERROR_UNAVAIL EQU X'F005'     * Temporarily unavailable           21700000
ST51C_ERROR_LONGBUSY EQU X'F01D'    * LongBusy                          21750000
ST51C_MASTER DS XL1                 * Master state                      21800000
ST51C_MASTER_PAUSING EQU X'01'      * GM pause/terminate in progress    21850000
ST51C_MASTER_START EQU X'02'        * GM start/resume in progress       21900000
ST51C_MASTER_BETWEEN EQU X'03'      * Between CG formation              21950000
ST51C_MASTER_SINCR EQU X'04'        * Start increment in progress       22000000
ST51C_MASTER_RUN EQU X'05'          * Run in progress                   22050000
ST51C_MASTER_DRAIN EQU X'06'        * Drain in progress                 22100000
ST51C_MASTER_ESTB EQU X'07'         * FlashCopy establish with          22150000
*                                   * revertible in progress            22200000
ST51C_MASTER_WITHC EQU X'08'        * FlashCopy withdraw with commit    22250000
*                                   * in progress                       22300000
ST51C_MASTER_INCR EQU X'09'         * Increment complete in progress    22350000
ST51C_MASTER_WITHR EQU X'0A'        * FlashCopy withdraw with revert    22400000
*                                   * in progress                       22450000
ST51C_MASTER_PAUSED EQU X'0B'       * GM is paused                      22500000
ST51C_MASTER_POSTCON EQU X'0C'      * Performing post-CG tasks          22550000
ST51C_MASTER_FATAL EQU X'0D'        * GM is fatal                       22600000
ST51C_MASTER_ERRRCVRY EQU X'0E'     * Completing error recovery         22650000
         DS    XL1                  * Reserved                          22700000
ST51_CGFL EQU  *-ST51C_SERIAL       *                                   22750000
         AGO   .ZEND                                                    22800000
.*                                                                      22850000
.ZEND    ANOP  ,                                                        22900000
         MEND                                                           22950000
**** End ASM version *************************************************/ 23000000
*/** Begin PL/X version **********************************************/ 23050000
*%ANTRQMAP:                                                             23100000
*      MACRO KEYS(                                                      23150000
*                 TYPE                                                  23200000
*                 ) TRACE                                               23250000
*                 ;                                                     23300000
*                                                                       23350000
*  DECLARE EHARC FIXED EXT;                                             23400000
*  EHARC = 0;                                                           23450000
*                                                                       23500000
*  IF NUMBER(MACLIST) > 0 THEN      /* Any positional parameters     */ 23550000
*    DO;                            /* Yes - error                   */ 23600000
*      STMT = 'ANTRQMAP.01 - Positional parameters not allowed';        23650000
*      EHARC=8;                                                         23700000
*      ANS (COMMENT(STMT)) MSG(STMT) NORESCAN SKIP; /* Put the error    23750000
*                                      message in both the source and   23800000
*                                      macro source listings         */ 23850000
*      RETURN CODE(EHARC);                                              23900000
*    END;                                                               23950000
*  IF TYPE(1) ^= 'STAT4A' &                                             24000000
*     TYPE(1) ^= 'STAT4B' &                                             24050000
*     TYPE(1) ^= 'STAT4C' &                                             24100000
*     TYPE(1) ^= 'STAT51' THEN                                          24150000
*    DO;                                                                24200000
*      STMT = 'ANTRQMAP.02 - TYPE parameter is invalid';                24250000
*      EHARC=8;                                                         24300000
*      ANS (COMMENT(STMT)) MSG(STMT) NORESCAN SKIP;                     24350000
*      RETURN CODE(EHARC);                                              24400000
*    END;                                                               24450000
*                                                                       24500000
*  IF TYPE(1) = 'STAT4A' THEN DO;                                       24550000
*    BLOCKANSWER COL(MACLMAR) RESCAN;                                   24600000
*  'DECLARE '                                                           24650000
*  '  1 ST4A BASED BDY(WORD),       ] GM session status '               24700000
*  '   2 ST4A_HEADER CHAR(12) BDY(WORD), '                              24750000
*  '     4 ST4AH_EYE CHAR(8),       ] "RQMPST4A" '                      24800000
*  '     4 ST4AH_SIZE FIXED(15),    ] Length of ST4A '                  24850000
*  '     4 ST4AH_VER FIXED(8),      ] Mapping macro version '           24900000
*  '     4 * CHAR(1), '                                                 24950000
*  '   2 ST4A_REST, '                                                   25000000
*  '    3 ST4A_STATUS CHAR(1), '                                        25050000
*  '      5 ST4AS_NOVOLS BIT(1),    ] Session has no volumes. All of '  25100000
*  '                                ] the counters are set to zero. '   25150000
*  '      5 ST4AS_ONE BIT(1),       ] The following fields are valid: ' 25200000
*  '                                ]  ST4A_SNBR '                      25250000
*  '                                ]  ST4A_OOS_TRACKS '                25300000
*  '      5 ST4AS_TWO BIT(1),       ] The following fields are valid: ' 25350000
*  '                                ]  ST4A_CGFLAGS '                   25400000
*  '                                ]  ST4A_SNBR '                      25450000
*  '                                ]  ST4A_FC_SEQ_NBR '                25500000
*  '      5 * BIT(1), '                                                 25550000
*  '      5 ST4AS_NOTCS BIT(1),     ] Data could not be collected due ' 25600000
*  '                                ] to inaccessibility of control '   25650000
*  '                                ] structures. Rest of status '      25700000
*  '                                ] description will be zero. '       25750000
*  '      5 ST4AS_NOSESS BIT(1),    ] Async session has not been '      25800000
*  '                                ] started. ST4A_SNBR is valid. '    25850000
*  '      5 ST4AS_CUGMPCG BIT(1),   ] CU supports GM Pause on CG Bdry ' 26300000
*  '      5 * BIT(1), '                                                 25900000
*  '    3 ST4A_CGFLAGS CHAR(1), '                                       25950000
*  '      5 ST4AF_RNREQ BIT(1),     ] Revertible or Not Revertible, '   26000000
*  '                                ] and Equal '                       26050000
*  '      5 ST4AF_NREQ BIT(1),      ] Not Revertible and Equal '        26100000
*  '      5 ST4AF_RNR BIT(1),       ] Revertible and Not Revertible '   26150000
*  '      5 ST4AF_ALLR BIT(1),      ] All Revertible '                  26200000
*  '      5 ST4AF_CGBAD BIT(1),     ] Consistency Group corrupted '     26250000
*  '      5 * BIT(3), '                                                 26300000
*  '    3 ST4A_STYPE CHAR(1),       ] Session type '                    26350000
*  '    3 ST4A_SNBR CHAR(1),        ] Session number '                  26400000
*  '    3 ST4A_OOS_TRACKS CHAR(8),  ] Total number of Out-of-Sync '     26450000
*  '                                ] tracks '                          26500000
*  '    3 * CHAR(32),               ] Reserved '                        26550000
*  '    3 ST4A_FC_SEQ_NBR CHAR(4),  ] FlashCopy sequence number '       26600000
*  '    3 * CHAR(0), '                                                  26650000
*  '  ST4AH_EYEC CHAR(8) CONSTANT(''RQMPST4A''), '                      26700000
*  '  ST4AH_VERC FIXED(8) CONSTANT(1); '                                26750000
*    ENDANSWER;                                                         26800000
*                                                                       26850000
*  END;                                                                 26900000
*                                                                       26950000
*  ELSE                                                                 27000000
*                                                                       27050000
*  IF TYPE(1) = 'STAT4B' THEN DO;                                       27100000
*    BLOCKANSWER COL(MACLMAR) RESCAN;                                   27150000
*  'DECLARE '                                                           27200000
*  '  1 ST4B BASED BDY(WORD),        ] ........................ '       27250000
*  '   2 ST4B_HEADER CHAR(12) BDY(WORD), '                              27300000
*  '     4 ST4BH_EYE CHAR(8),       ] "RQMPST4B" '                      27350000
*  '     4 ST4BH_SIZE FIXED(15),    ] Length of ST4B '                  27400000
*  '     4 ST4BH_VER FIXED(8),      ] Mapping macro version '           27450000
*  '     4 * CHAR(1), '                                                 27500000
*  '   2 ST4B_REST, '                                                   27550000
*  '    3 ST4B_FLAGS CHAR(1), '                                         27600000
*  '      5 ST4BF_ALL0 BIT(1),      ] All OOS bitmaps for all volumes ' 27650000
*  '                                ] are zero. '                       27700000
*  '      5 ST4BF_NOTCS BIT(1),     ] Session not in correct state to ' 27750000
*  '                                ] allow consistency group '         27800000
*  '                                ] formation. ST4B_NOTCS_REASON '    27850000
*  '                                ] will give the reason. '           27900000
*  '      5 * BIT(2), '                                                 27950000
*  '      5 ST4BF_NOSTR BIT(1),     ] Unable to get to structures. '    28000000
*  '                                ] ST4B_NOTCS_REASON and '           28050000
*  '                                ] ST4B_VOLCNT will be zero. '       28100000
*  '      5 ST4BF_NOSESS BIT(1),    ] Session has not been started. '   28150000
*  '                                ] ST4B_NOTCS_REASON and '           28200000
*  '                                ] ST4B_VOLCNT will be zero. '       28250000
*  '      5 ST4BF_CUGMPCG BIT(1),   ] CU supports GM Pause on CG Bdry ' 28300000
*  '      5 * BIT(1), '                                                 28300000
*  '    3 ST4B_NOTCS_REASON CHAR(1), '                                  28350000
*  '      5 ST4BR_NOTVOL BIT(1),    ] One or more volumes are not in a' 28400000
*  '                                ] state to allow a consistency '    28450000
*  '                                ] group to be formed. '             28500000
*  '      5 ST4BR_NOTCR BIT(1),     ] Change recording cannot be '      28550000
*  '                                ] activated in one or more volumes' 28600000
*  '      5 ST4BR_UNKVOL BIT(1),    ] One or more volumes are in an '   28650000
*  '                                ] unknown state. '                  28700000
*  '      5 ST4BR_IOVOL BIT(1),     ] One or more volumes are not in '  28750000
*  '                                ] the correct state because of '    28800000
*  '                                ] I/O going on. '                   28850000
*  '      5 ST4BR_ESCON BIT(1),     ] One or more volumes have been '   28900000
*  '                                ] established with ESCON paths. '   28950000
*  '      5 * BIT(3), '                                                 29000000
*  '    3 * CHAR(2),                ] Reserved '                        29050000
*  '    3 ST4B_STYPE CHAR(1),       ] Session type '                    29100000
*  '    3 ST4B_SNBR CHAR(1),        ] Session number '                  29150000
*  '    3 ST4B_VOLCNT CHAR(2),      ] Count of volumes who do not have' 29200000
*  '                                ] the OOS bitmap zeroed out yet. '  29250000
*  '    3 * CHAR(0), '                                                  29300000
*  '  ST4BH_EYEC CHAR(8) CONSTANT(''RQMPST4B''), '                      29350000
*  '  ST4BH_VERC FIXED(8) CONSTANT(1); '                                29400000
*    ENDANSWER;                                                         29450000
*                                                                       29500000
*  END;                                                                 29550000
*                                                                       29600000
*  ELSE                                                                 29650000
*                                                                       29700000
*  IF TYPE(1) = 'STAT4C' THEN DO;                                       29750000
*    BLOCKANSWER COL(MACLMAR) RESCAN;                                   29800000
*  'DECLARE '                                                           29850000
*  '  1 ST4C BASED BDY(WORD),       ] .................. '              29900000
*  '   2 ST4C_HEADER CHAR(16) BDY(WORD), '                              29950000
*  '     4 ST4CH_EYE CHAR(8),       ] "RQMPST4C" '                      30000000
*  '     4 ST4CH_SIZE FIXED(15),    ] Total length of data returned '   30050000
*  '                                ] by a STAT4C request '             30100000
*  '     4 ST4CH_VER FIXED(8),      ] Mapping macro version '           30150000
*  '     4 * CHAR(1), '                                                 30200000
*  '     4 ST4CH_S_SIZE FIXED(15),  ] Length of ST4C_SESS_DETAIL '      30250000
*  '     4 ST4CH_V_SIZE FIXED(15),  ] Length of ST4C_VOL_DETAIL '       30300000
*  '   2 ST4C_REST, '                                                   30350000
*  '    3 ST4C_DATA_SIZE FIXED(16), ] How much data the strg control'   30400000
*  '                                ] wants to give us. '               30450000
*  '    3 ST4C_SESSCNT FIXED(8),    ] Number of sessions in the ESS '   30500000
*  '    3 ST4C_FLAGS CHAR(1), '                                         30550000
*  '      5 ST4CF_FMT_TYPE BIT(2),  ] 00 Single TGT 01 Multi TGT  @MTA' 30609990
*  '      5 * BIT(2),               ]                             @MTC' 30619980
*  '      5 ST4CF_NOTCS BIT(1),     ] Data could not be collected due ' 30650000
*  '                                ] to inaccessibility of control '   30700000
*  '                                ] structures. Rest of status '      30750000
*  '                                ] description will be zero. '       30800000
*  '      5 * BIT(3), '                                                 30850000
*  '    3 ST4C_SESS_OUTPUT CHAR(0), ] Rest of output information '      30900000
*  '  1 ST4C_SESS_DETAIL BASED(ST4C_SESS_PTR), '                        30950000
*  '    3 ST4C_STYPE CHAR(1),       ] Session type '                    31000000
*  '    3 ST4C_SNBR CHAR(1),        ] Session number '                  31050000
*  '    3 * CHAR(1),                ] Reserved '                        31100000
*  '    3 ST4C_SSTATUS CHAR(1), '                                       31150000
*  '      5 ST4CS_NOVOL BIT(1),     ] No active volumes in the session' 31200000
*  '      5 ST4CS_ENSTATE BIT(2),   ] See definitions below '           31250000
*  '      5 * BIT(5), '                                                 31300000
*  '    3 ST4C_VOLCNT FIXED(15),    ] Number of volumes for session '   31350000
*  '    3 ST4C_VOL_OUTPUT CHAR(0),  ] Volume information '              31400000
*  '  1 ST4C_VOL_DETAIL BASED(ST4C_VOL_PTR), '                          31450000
*  '    3 ST4C_DVCNBR CHAR(2), '                                        31500000
*  '      5 ST4C_DVC_LSS CHAR(1), '                                     31550000
*  '      5 ST4C_DVC_CCA_LUN CHAR(1), '                                 31600000
*  '    3 ST4C_VSTATUS CHAR(1), '                                       31650000
*  '      5 ST4CV_INSESS BIT(1),    ] In an GM Consistency session '    31700000
*  '      5 ST4CV_INCASC BIT(1),    ] In a cascading-allowed state '    31750000
*  '      5 ST4CV_INJOIN BIT(1),    ] In the join pending state '       31800000
*  '      5 ST4CV_INREMV BIT(1),    ] In the remove pending state '     31850000
*  '      5 ST4CV_PASS1 BIT(1),     ] In the first pass of inital copy' 31900000
*  '      5 * BIT(3), '                                                 31950000
*  '    3 ST4C_PVSTATUS CHAR(1),    ] Primary volume '                  32000000
*  '      5 ST4CP_CR_ACT  BIT(1),   ] CR active for other function@MTA' 32059990
*  '      5 ST4CP_ADD_REL BIT(1),   ] Compat mode but MT env      @MTA' 32069980
*  '      5 * BIT(4),               ]                             @MTC' 32079970
*  '      5 ST4CP_VSTATE BIT(2),    ] See definitions below '           32100000
*  '    3 ST4C_SVSTATUS CHAR(1),    ] Secondary volume '                32150000
*  '      5 * BIT(6), '                                                 32200000
*  '      5 ST4CS_VSTATE BIT(2),    ] See definitions below '           32250000
*  '    3 ST4C_PNUM_REL FIXED(8),   ] Num Rel for Primary vol     @MTA' 32305990
*  '    3 ST4C_SECINFO,             ] Secondary information       @MTA' 32311980
*  '      5 ST4C_SSERIAL  CHAR(10),   ] Secondary Serial Number   @MTA' 32317970
*  '      5 ST4C_SDVCNBR CHAR(2),     ] Secondary Volume IDs      @MTA' 32323960
*  '        7 ST4C_SDVC_LSS CHAR(1),  ]                           @MTA' 32329950
*  '        7 ST4C_SDVC_CCA_LUN CHAR(1),]                         @MTA' 32335940
*  '      5 * CHAR(14),               ] Reserved                  @MTA' 32341930
*  '  ST4C_SESS_PTR PTR(31),        ] Initial address is location '     32350000
*  '                                ] ST4C_SESS_OUTPUT '                32400000
*  '  ST4C_VOL_PTR PTR(31),         ] Initial address is location '     32450000
*  '                                ] ST4C_VOL_OUTPUT '                 32500000
*  '  ST4C_ENSTATE_NORMAL BIT(2) CONSTANT(''00''B), ] Session is in '   32550000
*  '                                ] GM Consistency normal state '     32600000
*  '  ST4C_ENSTATE_PENDING BIT(2) CONSTANT(''01''B), ] Session is in '  32650000
*  '                                ] GM Increment Pending state '      32700000
*  '  ST4C_ENSTATE_PROGRESS BIT(2) CONSTANT(''10''B), ] Session is in ' 32750000
*  '                                ] GM Consistency Group in '         32800000
*  '                                ] progress state '                  32850000
*  '  ST4C_VSTATE_SIMPLEX BIT(2) CONSTANT(''00''B), '                   32900000
*  '  ST4C_VSTATE_DUP_PENDING BIT(2) CONSTANT(''01''B), '               32950000
*  '  ST4C_VSTATE_DUPLEX BIT(2) CONSTANT(''10''B), '                    33000000
*  '  ST4C_VSTATE_SUSPENDED BIT(2) CONSTANT(''11''B), '                 33050000
*  '  ST4C_FMT_TYPE_MT      BIT(2) CONSTANT(''01''B), '                 33060000
*  '  ST4C_FMT_TYPE_ST      BIT(2) CONSTANT(''00''B), '                 33070000
*  '  ST4CH_EYEC CHAR(8) CONSTANT(''RQMPST4C''), '                      33100000
*  '  ST4CH_VERC FIXED(8) CONSTANT(3);                          ] @MUC' 33169990
*    ENDANSWER;                                                         33200000
*                                                                       33250000
*  END;                                                                 33300000
*                                                                       33350000
*  ELSE                                                                 33400000
*                                                                       33450000
*  DO;                                                                  33500000
*    BLOCKANSWER COL(MACLMAR) RESCAN;                                   33550000
*  'DECLARE '                                                           33600000
*  '  1 ST51 BASED BDY(WORD),       ] .........................       ' 33650000
*  '   2 ST51_HEADER CHAR(20) BDY(WORD), '                              33700000
*  '     4 ST51H_EYE CHAR(8),       ] "RQMPST51" '                      33750000
*  '     4 ST51H_SIZE FIXED(15),    ] Total length of data returned '   33800000
*  '                                ] by a STAT51 request '             33850000
*  '     4 ST51H_VER FIXED(8),      ] Mapping macro version '           33900000
*  '     4 * CHAR(1), '                                                 33950000
*  '     4 ST51H_M_SIZE FIXED(15),  ] Length of ST51_MSTR_DETAIL '      34000000
*  '     4 ST51H_S_SIZE FIXED(15),  ] Length of ST51_SUBORD_DETAIL '    34050000
*  '     4 ST51H_AH_SIZE FIXED(15), ] Length of ST51_ASSOC_HDR '        34100000
*  '     4 ST51H_AD_SIZE FIXED(15), ] Length of ST51_ASSOC_DETAIL '     34150000
*  '   2 ST51_REST, '                                                   34200000
*  '    3 ST51_FLAGS CHAR(1), '                                         34250000
*  '      5 ST51F_NOCONF BIT(1),    ] No configuration for SNBR '       34300000
*  '      5 * BIT(3), '                                                 34350000
*  '      5 ST51F_NOTCS BIT(1),     ] Could not get to the control '    34400000
*  '                                ] structures '                      34450000
*  '      5 ST51F_NOTMCS BIT(1),    ] Could not get to the Master '     34500000
*  '                                ] control structures '              34550000
*  '      5 ST51F_NOTSCS BIT(1),    ] Could not get to the Subordinate' 34600000
*  '                                ] control structures '              34650000
*  '      5 * BIT(1), '                                                 34700000
*  '    3 * CHAR(1),                ] Reserved '                        34750000
*  '    3 ST51_DATA_SIZE FIXED(15), ] How much data the storage contl'  34800000
*  '                                ] wants to give us '                34850000
*  '    3 ST51_MSTRCNT FIXED(8),    ] Number of master sessions '       34900000
*  '    3 ST51_MSTR_OUTPUT CHAR(0), ] Rest of output information '      34950000
*  '  1 ST51_MSTR_DETAIL BASED(ST51_MSTR_PTR), '                        35000000
*  '    3 ST51_MFLAGS CHAR(1), '                                        35050000
*  '      5 * BIT(4), '                                                 35100000
*  '      5 ST51F_NODATA BIT(1),    ] Data could not be collected '     35150000
*  '      5 ST51F_TS     BIT(1),    ] Bytes 48-64 contains time sync '  35209990
*  '      5 * BIT(2), '                                                 35219980
*  '    3 ST51_STYPE CHAR(1),       ] Session type '                    35250000
*  '    3 ST51_SNBR CHAR(1),        ] Session number '                  35300000
*  '    3 ST51_STATE CHAR(1),       ] See definitions below '           35350000
*  '    3 ST51_FATAL CHAR(1),       ] See definitions below '           35400000
*  '    3 ST51_CG_INTERVAL CHAR(2), ] CG Interval time (seconds) '      35450000
*  '    3 ST51_MAX_COORD CHAR(2),   ] Max Coord interval (millisecs)'   35500000
*  '    3 ST51_MAX_CG_DRAIN CHAR(2), ] Max CG drain time (seconds) '    35550000
*  '    3 ST51_CURRENT_TIME CHAR(8), '                                  35600000
*  '    3 ST51_TIME_LAST_GOOD_CG CHAR(8), '                             35650000
*  '    3 ST51_BADCG_CNT CHAR(4),   ] Number unsuccessful CG attempts ' 35700000
*  '                                ] since last successful CG       '  35750000
*  '    3 ST51_TOTAL_GOODPCT FIXED(8),] Percent successful attempts '   35800000
*  '    3 * CHAR(3), '                                                  35850000
*  '    3 ST51_TOTAL_GOODCG CHAR(4), ] Total number successful CG '     35900000
*  '    3 ST51_TOTAL_BADCG CHAR(4),  ] Total number unsuccessful CG '   35950000
*  '    3 ST51_SYSPLEXNAME  CHAR(8), ] Sysplex Name                 '   36007990
*  '    3 ST51_SYSPLEX_CGTIME  CHAR(8), ] Sysplex CG time in sec     '  36015980
*  '    3 ST51_SYSPLEX_EST_CURR_TIME CHAR(8), ] Sysplex est curr time ' 36023970
*  '    3 ST51_SYSPLEX_EST_DRIFT     CHAR(1), ] CU est clock drift '    36031960
*  '    3 * CHAR(7),                ] Reserved                        ' 36039950
*  '    3 ST51_CG_FAILURE(3) CHAR(16), ] 1 = first failure            ' 36050000
*  '                                ] 2 = previous failure           '  36100000
*  '                                ] 3 = most recent failure        '  36150000
*  '      5 ST51F_SERIAL CHAR(10),  ] Failing ESS serial number       ' 36200000
*  '      5 ST51F_LSS CHAR(1),      ] Failing LSS number          '     36250000
*  '      5 * CHAR(1), '                                                36300000
*  '      5 ST51F_ERROR CHAR(2),    ] Error reason - see definition '   36350000
*  '      5 ST51F_MASTER CHAR(1),   ] Master state - see definition '   36400000
*  '      5 * CHAR(1), '                                                36450000
*  '    3 ST51_MASTER_SERIAL CHAR(10),                               '  36500000
*  '    3 ST51_SUBORD_CNT FIXED(8), ] Subordinate count               ' 36550000
*  '    3 ST51_MASTER_LSS CHAR(1),                                   '  36600000
*  '    3 ST51_SUBORD_OUTPUT CHAR(0), ] Subordinate information '       36650000
*  '  1 ST51_SUBORD_DETAIL BASED(ST51_SUBORD_PTR),                    ' 36700000
*  '    3 ST51_MASTER_SSID CHAR(2),                                  '  36750000
*  '    3 ST51_SUBORD_SSID CHAR(2),                                   ' 36800000
*  '    3 ST51_MASTER_PATHA_LSS CHAR(1), ] Master path association LSS' 36850000
*  '    3 ST51_SUBORD_PATHA_LSS CHAR(1), ] Subord path association LSS' 36900000
*  '    3 ST51_SUBORD_SERIAL CHAR(10),                                ' 36950000
*  '  1 ST51_ASSOC_HDR BASED(ST51_ASSOCH_PTR),                        ' 37000000
*  '    3 ST51_ASSOC_CNT FIXED(8),  ] Number of master to subordinate ' 37050000
*  '                                ] associations                   '  37100000
*  '    3 ST51_SFLAGS CHAR(1),                                       '  37150000
*  '      5 * BIT(4),                                                 ' 37200000
*  '      5 ST51S_NOTCS BIT(1),     ] Data could not be gathered     '  37250000
*  '                                ] because of inaccessibility of  '  37300000
*  '                                ] control structures             '  37350000
*  '      5 * BIT(3),                                                 ' 37400000
*  '    3 ST51_ASSOC_OUTPUT CHAR(0), ] Association information       '  37450000
*  '  1 ST51_ASSOC_DETAIL BASED(ST51_ASSOCD_PTR),                    '  37500000
*  '    3 ST51A_STYPE CHAR(1),      ] Session type '                    37550000
*  '    3 ST51A_SNBR CHAR(1),       ] Session number '                  37600000
*  '    3 ST51_MASTER_OWNING_SERIAL CHAR(10),               '           37650000
*  '  ST51_MSTR_PTR PTR(31),        ] Initial address is location '     37700000
*  '                                ] ST51_MSTR_OUTPUT '                37750000
*  '  ST51_SUBORD_PTR PTR(31),      ] Initial address is location '     37800000
*  '                                ] ST51_SUBORD_OUTPUT '              37850000
*  '  ST51_ASSOCH_PTR PTR(31),      ] Initial address is first byte '   37900000
*  '                                ] after last ST51_SUBORD_DETAIL'    37950000
*  '                                ] record '                          38000000
*  '  ST51_ASSOCD_PTR PTR(31),      ] Initial address is location '     38050000
*  '                                ] ST51_ASSOC_OUTPUT '               38100000
*  '  ST51_STATE_RUNNING CHAR(1) CONSTANT(''01''X), ] Async session '   38150000
*  '                                ] running '                         38200000
*  '  ST51_STATE_PAUSED CHAR(1) CONSTANT(''02''X), ] Async session '    38250000
*  '                                ] paused '                          38300000
*  '  ST51_STATE_FATAL CHAR(1) CONSTANT(''03''X), ] Async session '     38350000
*  '                                ] fatal '                           38400000
*  '  ST51_STATE_PAUSING CHAR(1) CONSTANT(''04''X), ] Async session '   38450000
*  '                                ] pausing '                         38500000
*  '  ST51_STATE_NOT_OWN CHAR(1) CONSTANT(''05''X), ] Async ses  @MGA ' 38507100
*  '                                ] GM session not owned by '         38514200
*  '                                ] cluster receiving command '       38521300
*  '  ST51_STATE_RECOVER CHAR(1) CONSTANT(''06''X), ] Async ses  @MGA ' 38528400
*  '                                ] GM session is being '             38535500
*  '                                ] recovered by the Master '         38542600
*  '  ST51_STATE_CGPAUSE CHAR(1) CONSTANT(''07''X), ]            @CPA ' 38543300
*  '                                ] GM Paused           '             38544000
*  '                                ] with Consistency        '         38544700
*  '  ST51_STATE_CGPING  CHAR(1) CONSTANT(''08''X), ]            @CPA ' 38545400
*  '                                ] GM Pausing          '             38546100
*  '                                ] with Consistency        '         38546800
*  '  ST51_STATE_PFAIL   CHAR(1) CONSTANT(''09''X), ]            @CPA ' 38547500
*  '                                ] GM Session Paused   '             38548200
*  '                                ] because Un-suspend Failed '       38548900
*  '  ST51_FATAL_REVERT CHAR(1) CONSTANT(''01''X), ] Revert FlashCopy ' 38550000
*  '                                ] failed '                          38600000
*  '  ST51_FATAL_INACCES CHAR(1) CONSTANT(''02''X), ] Async structures' 38650000
*  '                                ] inaccessible or in a failed '     38700000
*  '                                ] state '                           38750000
*  '  ST51_FATAL_SEQNBR CHAR(1) CONSTANT(''03''X), ] Consistency check' 38800000
*  '                                ] of sequence numbers failed '      38850000
*  '  ST51_FATAL_BADSID CHAR(1) CONSTANT(''04''X), ] Invalid session '  38900000
*  '                                ] id detected '                     38950000
*  '  ST51_FATAL_CGBAD CHAR(1) CONSTANT(''05''X), ] Consistency group ' 39000000
*  '                                ] corrupted '                       39050000
*  '  ST51_FATAL_TIMEOUT CHAR(1) CONSTANT(''06''X), ] Timeout during '  39100000
*  '                                ] consistency check '               39150000
*  '  ST51_FATAL_COMMFAIL CHAR(1) CONSTANT(''07''X), ] Communication '  39200000
*  '                                ] failure during consistency check' 39250000
*  '  ST51_FATAL_NOTCOMP CHAR(1) CONSTANT(''08''X), ] Unable to '       39300000
*  '                                ] complete consistency check '      39350000
*  '  ST51_FATAL_BUSY CHAR(1) CONSTANT(''09''X), ] Busy condition '     39400000
*  '                                ] prevents consistency check '      39450000
*  '  ST51_FATAL_REVERTTO CHAR(1) CONSTANT(''0A''X), ] Revert FlashCpy' 39500000
*  '                                ] failed due to timeout '           39550000
*  '  ST51_FATAL_NOSUBORD CHAR(1) CONSTANT(''0B''X), ] Async '          39600000
*  '                                ] subordinate has been terminated ' 39650000
*  '                                ] by a Pause/Terminate Async '      39700000
*  '                                ] command '                         39750000
*  '  ST51_ERROR_INACCES CHAR(2) CONSTANT(''0001''X), ] Async '         39800000
*  '                                ] structures cannot be accessed '   39850000
*  '  ST51_ERROR_FAILURE CHAR(2) CONSTANT(''0002''X), ] Communication ' 39900000
*  '                                ] path failure '                    39950000
*  '  ST51_ERROR_NOTCS CHAR(2) CONSTANT(''0003''X), ] Async members '   40000000
*  '                                ] not in correct state '            40050000
*  '  ST51_ERROR_DRAIN CHAR(2) CONSTANT(''0004''X), ] Maximum CG drain' 40100000
*  '                                ] time exceeded '                   40150000
*  '  ST51_ERROR_STIME CHAR(2) CONSTANT(''0008''X), ] Invalid Sysplex'  40160000
*  '                                ] time '                            40170000
*  '  ST51_ERROR_BADPARM CHAR(2) CONSTANT(''0400''X), ] Invalid parm '  40200000
*  '  ST51_ERROR_FORMAT0F_B CHAR(2) CONSTANT(''0F00''X), ] Format 0x0F' 40250000
*  '                                ] error, where the second byte is ' 40300000
*  '                                ] the reason code - begin '         40350000
*  '  ST51_ERROR_FORMAT0F_E CHAR(2) CONSTANT(''0FFF''X), ] Format 0x0F' 40400000
*  '                                ] error, where the second byte is ' 40450000
*  '                                ] the reason code - end '           40500000
*  '  ST51_ERROR_MCODEERR_B CHAR(2) CONSTANT(''7000''X), ] Microcode '  40550000
*  '                                ] logic error, where the first '    40600000
*  '                                ] byte second nibble and second '   40650000
*  '                                ] byte describe the error - begin ' 40700000
*  '  ST51_ERROR_MCODEERR_E CHAR(2) CONSTANT(''7FFF''X), ] Microcode '  40750000
*  '                                ] logic error, where the first '    40800000
*  '                                ] byte second nibble and second '   40850000
*  '                                ] byte describe the error - end '   40900000
*  '  ST51_ERROR_UNAVAIL CHAR(2) CONSTANT(''F005''X), ] Temporarily '   40950000
*  '                                ] unavailable '                     41000000
*  '  ST51_ERROR_LONGBUSY CHAR(2) CONSTANT(''F01D''X), ] LongBusy '     41050000
*  '  ST51_MASTER_PAUSING CHAR(1) CONSTANT(''01''X), ] Async Pause/ '   41100000
*  '                                ] Terminate in progress '           41150000
*  '  ST51_MASTER_START CHAR(1) CONSTANT(''02''X), ] Async Start/ '     41200000
*  '                                ] Resume in progress '              41250000
*  '  ST51_MASTER_BETWEEN CHAR(1) CONSTANT(''03''X), ] Between '        41300000
*  '                                ] Consistency Group formation '     41350000
*  '  ST51_MASTER_SINCR CHAR(1) CONSTANT(''04''X), ] Start increment '  41400000
*  '                                ] in progress '                     41450000
*  '  ST51_MASTER_RUN CHAR(1) CONSTANT(''05''X), ] Run in progress '    41500000
*  '  ST51_MASTER_DRAIN CHAR(1) CONSTANT(''06''X), ] Drain in progress' 41550000
*  '  ST51_MASTER_ESTB CHAR(1) CONSTANT(''07''X), ] Establish '         41600000
*  '                                ] FlashCopy with Revertible in '    41650000
*  '                                ] progress '                        41700000
*  '  ST51_MASTER_WITHC CHAR(1) CONSTANT(''08''X), ] Withdraw '         41750000
*  '                                ] FlashCopy with Commit in '        41800000
*  '                                ] progress '                        41850000
*  '  ST51_MASTER_INCRC CHAR(1) CONSTANT(''09''X), ] Increment complte' 41900000
*  '                                ] in progress '                     41950000
*  '  ST51_MASTER_WITHR CHAR(1) CONSTANT(''0A''X), ] Withdraw '         42000000
*  '                                ] FlashCopy with Revert in '        42050000
*  '                                ] progress '                        42100000
*  '  ST51_MASTER_PAUSED CHAR(1) CONSTANT(''0B''X), ] Async is paused ' 42150000
*  '  ST51_MASTER_POSTCON CHAR(1) CONSTANT(''0C''X), ] Performing '     42200000
*  '                                ] post-Consistency Group tasks '    42250000
*  '  ST51_MASTER_FATAL CHAR(1) CONSTANT(''0D''X), ] Async is fatal '   42300000
*  '  ST51_MASTER_ERRRCVRY CHAR(1) CONSTANT(''0E''X), ] Completing '    42350000
*  '                                ] error recovery '                  42400000
*  '  ST51H_EYEC CHAR(8) CONSTANT(''RQMPST51''), '                      42450000
*  '  ST51H_VERC FIXED(8) CONSTANT(1); '                                42500000
*    ENDANSWER;                                                         42550000
*  END;                                                                 42600000
*                                                                       42650000
*  RETURN CODE(EHARC);                                                  42700000
*                                                                       42750000
*%END ANTRQMAP;                                                         42800000
*/** End PL/X version ************************************************/ 42850000
