*********************************************************************** 00010000
*                                                                     * 00020000
*  CONTROL BLOCK NAME    APIPP1X2                                     * 00030000
*                                                                     * 00040000
*  DESCRIPTIVE NAME:     DSECT of S2STG STORAGE for Netspool exits    * 00050000
*                        APIPPTD1, APIPPTD2, APIUGEX, and APIUBF3.    * 00060000
*                                                                     * 00070000
*                                                                     * 00080000
*   Licensed Materials - Property of IBM                              * 00090000
*   5694-A01                                                          * 00105990
*   (C) Copyright IBM Corp. 1994, 2006                           @06C * 00117960
*                                                                     * 00120000
*   Status = HNET730                                             @06C * 00137970
*                                                                     * 00140000
*                                                                     * 00150000
*                                                                     * 00160000
*  CHANGE ACTIVITY:                                                   * 00170000
*                                                                     * 00180000
*     $MOD(APIPP1X2),COMP(NPF),PROD(TCP/IP):                          * 00190000
*                                                                     * 00200000
*     Flag Reason   Release Date   Origin       Flag Descriptors      * 00210000
*     ---- -------- ------- ------ ------  -------------------------- * 00220000
* $00=OW21953,HPRF226,091696,BLDTHS: New function                  @00A 00230000
* $01=OW29656,HPRF226,100297,BLDKZB: Externalize macro             @01A 00240000
* $02=LAPI0001,HNET280,041599,XNMKZB: V2 support                   @02A 00250000
* $03=LAPI0002,HNET705,112100,BLDDDA: Release z/OS 1.2 of NetSpool @03A 00260000
* $04=LAPI0003,HNET708,071603,BLDKZB: Release z/OS 1.5 of NetSpool @04A 00266990
* $05=OA05990,HNET708,012105,BLDKZB: Support 3270 max 255 byte line@05A 00267990
* $06=LAPI0004,HNET708,122905,BLDDDA: Release z/OS 1.8 of NetSpool @06A 00268990
*                                                                     * 00270000
*********************************************************************** 00280000
*                                                                       00290000
*                                                                       00300000
S2STG    DSECT                                                          00310000
         DS    0D                                                       00320000
S2EYEC   DS    CL5                 Eye-catcher ('S2STG')                00330000
*                                                                       00340000
*        ==========================================================     00350000
*        The following flags are input fields to all exits.             00360000
*        The exits must not change these flags.                         00370000
*        ==========================================================     00380000
S2FLAGS  DS    1BL1                Flags - Lu type and Format Mode @03C 00390000
         ORG   S2FLAGS                                             @03A 00400000
S2LU1    EQU   X'10'                 Set when LU type is 1         @03A 00410000
*                                      Reset when LU0 or LU 3      @03A 00420000
S2FPCL   EQU   X'01'                 Set when Formatting is "PCL"  @03A 00430000
*                                      Reset when "STD" or "NONE"  @03A 00440000
*                                                                       00450000
*        ==========================================================     00460000
*        The following fields are input to APIPPTD1 and APIPPTD2.       00470000
*        The exits must not change these fields.                        00480000
*        ==========================================================     00490000
*                                  Horizontal Page Format:              00500000
S2COL    DS    H                      Next column in output             00510000
S2LM     DS    H                      Left Margin column number         00520000
S2RM     DS    H                      Right Margin column number        00530000
S2MPP    DS    H                      Max Present'n Pos (line len)      00540000
*                                                                       00550000
*                                  Vertical Page Format:                00560000
S2LINE   DS    H                      Next output line number           00570000
S2TM     DS    H                      Top Margin line number            00580000
S2VCSTBL EQU   S2TM                   channel 1 == top margin           00590000
S2C2T12  DS    11H                    Channel 2 - 12 line numbers       00600000
S2CH12   EQU   S2VCSTBL+22            addr of channel 12 line number    00610000
S2BM     DS    H                      Bottom Margin page number         00620000
S2MPL    DS    H                      Max Page Length                   00630000
*                                                                       00640000
*        ==========================================================     00650000
*        The following fields are input to all exits.                   00660000
*        The exits must not change these fields.                        00670000
*        ==========================================================     00680000
S2PLUNAM DS    CL8                    Name of the PLU, data sender      00690000
S2LPTNAM DS    CL8                    Name of the SLU, logical printer  00700000
*                                                                       00710000
         DS    0F                                                       00720000
S2PRTCLS DS    CL8                 Printer class.                       00730000
*                                                                       00740000
*        ==========================================================     00750000
*        The following flag can be set by APIPPTD1.                     00760000
*        ==========================================================     00770000
S2DBCSM  DS    X                   Double Byte Char Set Mode            00780000
S2DBCSM1 EQU   1                   IN DOUBLE BYTE MODE TWO BYTES WILL   00790000
*                                   BE ONE PRINT CHARACTER.  THIS IS    00800000
*                                   FOR PREVIOUS VERSION COMPATIBILITY. 00810000
*        ==========================================================     00820990
*        The following flag can be set by APIUBF3. Setting S2VLN255 bit 00821980
*        will indicate that the maximum line length for 3270 variable   00822970
*        length line format is 255 characters (not including carriage   00823960
*        control) instead of the default length of 132 characters.      00824950
*        Note: the variable line format is set in the Write Control     00825940
*        Character(WCC) which is the second byte in the first RU of     00826930
*        a chain.                                                 @05A  00827920
*        ==========================================================     00828910
*                                                                       00829900
S2OUTFLG DS    X                   Output flag for exits          @05C  00830890
S2VLN255 EQU   X'80'               Maximum 3270 variable line length    00831880
*                                   is 255 bytes                  @05A  00832870
*                                                                       00840000
*        ==========================================================     00850000
*        The following fields can be set by APIPPTD1 and APIPPTD2       00860000
*        ==========================================================     00870000
S2NLNUM  DS    H                   New line number desired after exit.  00880000
S2NCNUM  DS    H                   New column number desired after exit 00890000
*                                                                       00900000
*        ==========================================================     00910000
*        The following field is input to APIPPTD2 and APIUGEX.          00920000
*        The exits must not change this field.                          00930000
*        ==========================================================     00940000
         DS    0F                                                       00950000
S2TPDATA DS    XL275               INPUT DATA FOR NETSPOOL EXIT         00960000
*                                  TD2 - REPLICA OF TRANSPARENT DATA    00970000
*                                        PRECEDED BY X'35' AND LEN      00980000
*                                  GEX - GRAPHIC ESC CHAR IN EBCDIC     00990000
*                                        AND THEN IN PRINTER CP (ASCII) 01000000
         DS    XL5                 RESERVED                             01010000
*                                                                       01020000
*        ==========================================================     01030000
*        The following fields can be set by all exits.                  01040000
*        ==========================================================     01050000
         DS    0F                  ALIGNMENT FOR OUTPUT AREA            01060000
S2WRKLEN DS    F                   LENGTH OF DATA RETURNED BY EXIT      01070000
*                                        IN S2WRKARA BUFFER             01080000
S2WRKARA DS    XL275               DATA RETURNED BY NETSPOOL EXIT       01090000
*                                  TD1 - SCS COMMANDS OR TRANSPARENT    01100000
*                                        DATA TO ADD BEFORE 1ST RECORD  01110000
*                                  TD2 - MODIFIED TRANSPARENT DATA AND  01120000
*                                        SCS COMMANDS to REPLACE INPUT  01130000
*                                  BF3 - LINEMODE OR PCL DATA TO ADD    01140000
*                                        BEFORE THE 1ST RECORD          01150000
*                                  GEX - LINEMODE OR PCL DATA TO        01160000
*                                        REPLACE THE GRAPHIC ESCAPE     01170000
*                                        CHARACTER SEQUENCE X'08XX'     01180000
         DS    0D                                                       01190000
S2LENZ   EQU   *-S2STG                Length to initialize to zeros     01200000
