*/**** START OF SPECIFICATIONS ***************************************/ 00010000
*/*01* MACRO NAME  = APSGEXTP                                        */ 00020000
*/* $MAC(APSGEXTP) COMP(APS) PROD(PSF) : VERSION 4.7.0               */ 00030000
*/*                                                                  */ 00040000
*/*01* DESCRIPTIVE NAME = INSTALLATION EXIT PARAMETER AREA           */ 00050000
*/*                                                                  */ 00060000
*/*01* STATUS = HPRF470                                              */ 00070000
*/*                                                                  */ 00080000
*/* FUNCTION: This control block is used to map the installation     */ 00090000
*/*           exit parameter area.  This area is used as an interface*/ 00100000
*/*           between PSF and the installation exit subcomponent of  */ 00110000
*/*           PSF.  This map is also utilized for communications     */ 00120000
*/*           between the installation exit module APSUEXIT and      */ 00130000
*/*           the exit processing modules.                           */ 00140000
*/*                                                                  */ 00150000
*/*           The XTPECAP field is required when invoking APSUEXIT.  */ 00160000
*/*                                                                  */ 00170000
*/*02* OPERATION = INVOKING OF THIS MACRO WILL DECLARE THE PSF       */ 00180000
*/*                EXIT PARAMETER AREA (APSGEXTP), THE EXIT06        */ 00190000
*/*                AND EXIT07 PARAMETER AREAS (XTP6 & XTP7)      @U7C*/ 00200000
*/*                AND THE ACCOMPANYING CONSTANTS.               @U7C*/ 00210000
*/*                                                                  */ 00220000
*/*01* NOTES =                                                       */ 00230000
*/*02*    DEPENDENCIES = NONE                                        */ 00240000
*/*02*    BAL LISTING  = SPEC LIST=YES ON MACRO CALL                 */ 00250000
*/*                      TO EXPAND DSECT IN LISTING                  */ 00260000
*/*                                                                  */ 00270000
*/*                                                                  */ 00280000
*/*01* MODULE TYPE = MACRO                                           */ 00290000
*/*02*    PROCESSOR = PL/X                                       @H7C*/ 00300000
*/*02*   ATTRIBUTES = INCLUDABLE, BI-LINGUAL.                        */ 00310000
*/*      CREATED BY :  APSUEXTI                                  @JCA*/ 00320000
*/*                                                                  */ 00330000
*/*01* INVOCATION =                                                  */ 00340000
*/*              BAL  - APSGEXTP(DSECT IS ALWAYS PRODUCED)           */ 00350000
*/*                     USING ON XTP GIVES ADDRESSABILITY            */ 00360000
*/*              PL/S - %INCLUDE SYSLIB(APSGEXTP)                    */ 00370000
*/*                                                                  */ 00380000
*/*01* INPUT =  NONE                                                 */ 00390000
*/*                                                                  */ 00400000
*/*01* OUTPUT = INLINE INCLUSION OF DECLARE STATEMENTS               */ 00410000
*/*                                                                  */ 00420000
*/*01* EXIT-NORMAL = MACRO SUCCESSFULLY INCLUDED IN CALLER           */ 00430000
*/*                                                                  */ 00440000
*/*01* EXIT-ERROR = NONE                                             */ 00450000
*/*                                                                  */ 00460000
*/*01* EXTERNAL REFERENCES =                                         */ 00470000
*/*                                                                  */ 00480000
*/*02*    ROUTINES = NONE                                            */ 00490000
*/*                                                                  */ 00500000
*/*02*    DATA AREAS = NONE                                          */ 00510000
*/*                                                                  */ 00520000
*/*02*    CONTROL BLOCKS =                                           */ 00530000
*/*03*        CONTROL BLOCKS REFERENCED:                             */ 00540000
*/*                NONE                                              */ 00550000
*/*                                                                  */ 00560000
*/*03*        CONTROL BLOCKS MODIFIED:                               */ 00570000
*/*                NONE                                              */ 00580000
*/*                                                                  */ 00590000
*/*03*        CONTROL BLOCKS CREATED:                                */ 00600000
*/*                NONE                                              */ 00610000
*/*                                                                  */ 00620000
*/*01* TABLES = NONE                                                 */ 00630000
*/*                                                                  */ 00640000
*/*01* MACROS = NONE                                                 */ 00650000
*/*                                                                  */ 00660000
*/*01* MESSAGES (MNOTES) = NONE                                      */ 00670000
*/*                                                                  */ 00680000
*/* 01* CHANGE ACTIVITY =                                            */ 00690000
*/* $B0=OW10067 , HAF1102, 093083, TC1    : INITIAL VERSION          */ 00700000
*/* $H2=LAPS0002, HAF1203, 022586, BJ13SM : RELEASE 2.0          @H2A*/ 00710000
*/* $H3=LAPS0003, HAF1220, 081787, B51PSM : RELEASE 2.1          @H3A*/ 00720000
*/* $U7=OY0????,  HAF1220, 021088, BJ13SDJ: RESOURCE EXIT ROLLUP @U7A*/ 00730000
*/* $L1=LAPS0004, HAF1228, 060188, B53KAN : RELEASE 3.0          @L1A*/ 00740000
*/* $02=OY16759,  HAF1228, 011189, BJ13DTT: BYPASS ETFF FOR HDR  @02A*/ 00750000
*/* $03=OY15015,  HAF1228, 080988, B53KTAC: APAR Rollup          @03A*/ 00760000
*/* $05=OY22492,  HPRF102, 890807, B53KEMC: EX7 HOLD QUEUE OPTION@05A*/ 00770000
*/* $06=OY20334,  HAF1220, 890406, BJ13SDJ: HARDWARE DEFAULT FONT@06A*/ 00780000
*/* $H7=LAPS0005, HPRF102, 121089, B53KEMC: REL 2.1.0 STAGE 2    @H7A*/ 00790000
*/* $07=OY54600,  HPRF102, 920518, BLDRLD : CHANGE THE DEFINITION@07A*/ 00800000
*/*                                         XTP7HQUE & XTP6HOLD      */ 00810000
*/*                                                                  */ 00820000
*/* $08=OY66646,  HPRF102, 930804, BJ13CWJ: Identifying the inter@08A*/ 00830000
*/*                                         rupt message page in @08A*/ 00840000
*/*                                         the output datastream@08A*/ 00850000
*/* $CN=OY65917,  HPRF102, 930608, BJ13ALH: LINE MODE CONVERSION @CNA*/ 00860000
*/*                                                                  */ 00870000
*/* $D2=LAPS0006, HPRF220, 940207, BJ13RLD: REL 2.2.0 - Add      @D2A*/ 00880000
*/*                                         extra reserved space @D2A*/ 00890000
*/* $D3=LAPS0006, HPRF220, 940606, BJ13ALH: REL 2.2.0 - Add      @D3A*/ 00900000
*/*                                         comments for line mode   */ 00910000
*/* $09=OW06631,  HPRF220, 940706, BJ13RLD: Suppress interrupt   @09A*/ 00920000
*/*                                         message page         @09A*/ 00930000
*/* $DF=LAPS0006, HPRF220, 950213, BJ13RLD: MSG DS Re-direction  @DFA*/ 00940000
*/* $DE=LAPS0006, HPRF220, 940426, BJ13LD : AFP-COM support      @DEA*/ 00950000
*/* $10=OW10928,  HPRF220, 941116, BJ13RLD: Set 3900 media origin@10A*/ 00960000
*/*                                         to 3800 media origin @10A*/ 00970000
*/* $11=OW08340,  HPRF220, 940901, BJ13DDA: OUTLINE FONT D-APAR  @11A*/ 00980000
*/* $12=OW16122, HPRF220, 951113, BDKUMLC: Huffman compression   @12A*/ 00990000
*/* $13=OW17550, HPRF220, 951214, BDKUMLC: Recompile only.       @13A*/ 01000000
*/* $14=OW17625, HPRF220, 951218, BDKUMLC: RECOMPILE ONLY        @14A*/ 01010000
*/* $15=OW16864, HPRF220, 960115, BDKURLD: Add support for       @15A*/ 01020000
*/*                                        converting a multiple @15A*/ 01030000
*/*                                        celled IM1 image to a @15A*/ 01040000
*/*                                        single IOCA image     @15A*/ 01050000
*/* $16=OW18773, HPRF220, 960209, BDKURLD: Set media origin for  @16A*/ 01060000
*/*                                        auxiliary datasets to @16A*/ 01070000
*/*                                        top left corner       @16A*/ 01080000
*/* $DD=OW19103, HPRF220, 960502, BDKURLD: Cut sheet emulation   @DDA*/ 01090000
*/* $17=OW22257, HPRF102, 960827, BDKURLD: Allow APSUX07 to      @17A*/ 01100000
*/*                                        change an abend to    @17A*/ 01110000
*/*                                        nonrestartable        @17A*/ 01120000
*/* $18=OW22539,  HPRF220, 960905, BDKURLD: Line merge support   @18A*/ 01130000
*/* $19=OW24057, HPRF220, 970101, BLDCWJ:  Change comments for   @19A*/ 01140000
*/*                                        MODCA IOB support     @19A*/ 01150000
*/* $MR=OW27622, HPRF220, 970417, BDKURLD: Multiple resolution   @MRA*/ 01160000
*/* $20=OW29924, HPRF220, 971017, BDKURLD: Wide/narrow paper flag@20A*/ 01170000
*/*                                        for CSE and 3800 media@20A*/ 01180000
*/*                                        origin                @20A*/ 01190000
*/* $IR=OW31717, HPRF220, 980210, BDKUELJ: Inhibit repositioning @IRA*/ 01200000
*/* $21=OW32244, HPRF220, 980312, BDKURLD: End brackets without  @21A*/ 01210000
*/*                                        ending the session    @21A*/ 01220000
*/* $DN=LAPS0007,HPRF310, 980507, BDKUMAL: 8 character msg id    @DNA*/ 01230000
*/* $DG=LAPS0007,HPRF310, 980512, BDKURLD: New sample exit 07s   @DGA*/ 01240000
*/* $22=OW31358, HPRF220, 980219, BDKURLD: Allow ack per sheet   @22A*/ 01250000
*/* $DU=LAPS0007,HPRF310,980427,BDKURLD: Version 3.1.0           @DUA*/ 01260000
*/*                                        space for 3.1.0       @DUA*/ 01270000
*/* $23=OW38168, HPRF310, 990322, BDKURLD: Specify PRMODE via        */ 01280000
*/*                                        exit 07               @23A*/ 01290000
*/* $24=OW38524, HPRF310, 990404, BDKUELJ: Close libraries       @24A*/ 01300000
*/* $25=OW38556, HPRF310, 990402, BDKURLD: Allow default character   */ 01310000
*/*                                        for single byte outline   */ 01320000
*/*                                        font code page        @25A*/ 01330000
*/* $27=OW39112, HPRF310, 990422, BDKURLD: Capture inline resources  */ 01340000
*/*                                       when connected via DPF @27A*/ 01350000
*/* $28=OW39239, HPRF310, 990513, BDKURLD: Pass device resolution    */ 01360000
*/*                                        to exit 07            @28A*/ 01370000
*/* $29=OW40173, HPRF310, 990715, BDKUELJ: Don't RELDS on repos  @29A*/ 01380000
*/* $30=OW40737, HPRF310, 990707, BDKURLD: Suppress copy marks   @30A*/ 01390000
*/* $31=OW41385, HPRF310, 991012, BDKUELJ: XTP7RSV1              @31A*/ 01400000
*/* $DX=LAPS0008,HPRF320, 991117, BUQ4RLB: Version 3.2.0         @DXA*/ 01410000
*/* $EJ=LAPS0008,HPRF320, 000117, BDKUELJ: Interrupt page-exit 6 @EJA*/ 01420000
*/* $33=OW43463, HPRF310, 000302, BDKURLD: Change XTP6PROC       @33A*/ 01430000
*/* $34=OW41991, HPRF310, 000112, BDKULMM: Allow capture of      @34A*/ 01440000
*/*                                        inline resources on   @34A*/ 01450000
*/*                                        WPM                   @34A*/ 01460000
*/* $35=0W44363, HPRF320, 000906, BDKURLD: Support line mode         */ 01470000
*/*                                        migration             @35A*/ 01480000
*/* $36=0W45477, HPRF320, 000719, BDKURLD: AOS in CSE mode causes    */ 01490000
*/*                                        new sheet - XTP7NSF   @36A*/ 01500000
*/* $37=OW47659, HPRF320, 010104, BDKUMLC: Compile only          @37A*/ 01510000
*/* $38=OW47253, HPRF320, 001129, BDKURLD: Separate copymarks and    */ 01520000
*/*                                        jogging               @38A*/ 01530000
*/* $EV=LAPS0009,HPRF330, 010530, BUQ4RLB: Version 3.3.0         @EVA*/ 01540000
*/* $EX=LAPS0009,HPRF330, 010423, BDKURLD: Support line mode     @EXA*/ 01550000
*/*                                        migration enhancement @EXA*/ 01560000
*/* $EZ=LAPS0009,HPRF330, 010615, BDKUMLC: Removal of Huffman    @EZA*/ 01570000
*/*                                        Compression code.     @EZA*/ 01580000
*/* $EM=LAPS0009,HPRF330, 011011, BDKURLD: ASAP support          @EMA*/ 01590000
*/* $39=OW52112, HPRF320, 011108, BDKURLD: Side sensitivity support  */ 01600000
*/*                                                              @39A*/ 01610000
*/* $FC=LAPS0010,HPRF340,020612,BDKULD : Version 3.4.0           @FCA*/ 01620000
*/* $FE=LAPS0010,HPRF340,030211,BDKUPG : HFS/zFS Support         @FEA*/ 01630000
*/* $40=OA06203 ,HPRF330, 040113, BDKURLD: Add intervention message  */ 01640000
*/*                                        for TCP/IP and SNA    @40A*/ 01650000
*/* $FM=LAPS0011,HPRF410,040220,BDKURDD: Version 4.1.0           @FMA*/ 01660000
*/* $41=OA05555, HPRF330, 031117, BDKURLD: Add printjob              */ 01670000
*/*                                        finishing support     @41A*/ 01680000
*/* $42=OA12544, HPRF330,050726,BDKURLD: Incorrect page placement    */ 01690000
*/*                                      in CSE after $I         @42A*/ 01700000
*/* $43=OA15653, HPRF410,060321,BDKURLD: Restore LINECT for LMM  @43A*/ 01710000
*/* $FU=LAPS0012,HPRF420,060630,BDKURDD: Version 4.2.0           @FUA*/ 01720000
*/* $44=OA19859, HPRF410,070207,BDKURLD: Honor page boundary spacing */ 01730000
*/*                                      for LMM                 @44A*/ 01740000
*/* $45=OA22787, HPRF410,071008,BDKURLD: Highlight the communications*/ 01750000
*/*                                      failure message         @45A*/ 01760000
*/* $GD=LAPS0013,HPRF430,080514,BDKURDD: Version 4.3.0           @GDA*/ 01770000
*/* $GH=LAPS0014,HPRF440,090922,BDKURDD: Version 4.4.0           @GHA*/ 01780000
*/* $46=OA30514, HPRF420,090929,BDKURLD: Support LMC/LMM in POSE @46A*/ 01790000
*/* $HH=LAPS0015,HPRF450,111202,BDKUGLM: Version 4.5.0           @HHA*/ 01800000
*/* $IL=LAPS0016,HPRF460,151207,BDKUDWP: Version 4.6.0           @ILA*/ 01810000
*/* $JC=LAPS0016,HPRF460,150119,BDKURLD: 8 byte control block ID @JCA*/ 01820000
*/* $IT=LAPS0016,HPRF460,160408,BDKURLD: Add End Data Set call to    */ 01830000
*/*                                      exit 07                 @ITA*/ 01840000
*/* $JM=LAPS0017,HPRF470,171116,BDKUDWP: Version 4.7.0           @JMA*/ 01850000
*/*                                                                  */ 01860000
*/**** END OF SPECIFICATIONS *****************************************/ 01870000
*  %GOTO EXTPPRO; /*                                                    01880000
          MACRO                                                         01890000
          APSGEXTP &LIST=NO                                             01900000
*           */                                                          01910000
*  %EXTPPRO: ;                                                          01920000
*  %GOTO XTPDCL; /*                                                     01930000
         PUSH  PRINT                                                    01940000
         AIF   ('&LIST' EQ 'YES').MAP1                                  01950000
         PRINT OFF                                                      01960000
.MAP1    ANOP                                                           01970000
APSGEXTP DSECT                                                          01980000
         SPACE 1                                                        01990000
XTPWRT   EQU   0                    WRITE ORIGINAL RECORD               02000000
XTPSKP   EQU   1                    SKIP ORIGINAL RECORD                02010000
XTWRTIX  EQU   2                    WRITE REC(S) IN INDEX               02020000
         SPACE 1                                                        02030000
XTP      EQU   APSGEXTP             ALTERNATE DSECT NAME                02040000
*******************************************************************     02050000
*         THE FOLLOWING FIELDS PROVIDE INPUT TO THE INSTALLATION        02060000
*         EXIT PROCESSOR ROUTINES.                                      02070000
*******************************************************************     02080000
XTPECAP  DS    AL4                  EXIT COMMUNICATIONS AREA ADDR.      02090000
XTPJSPAP DS    AL4                  PTR TO JES SEPARATOR PAGE AREA      02100000
*                                   OF THE LAST DATA SET (WITH          02110000
*                                   A SEPERATOR, MIGHT BE ZERO)         02120000
*                                                                       02130000
XTPRECP  DS    AL4                  PTR TO INPUT RECORD                 02140000
XTPRECL  DS    F                    INPUT RECORD LENGTH                 02150000
         DS    CL4                  RESERVED                    @D2A    02160000
*******************************************************************     02170000
*         THE FOLLOWING FIELDS WILL BE SET BY THE INSTALLATION          02180000
*         EXIT PROCESSOR ROUTINES IN ORDER TO PROVIDE AN INTERFACE      02190000
*         BACK TO PSF.  ON INPUT TO PROCESSORS XTPRIXP WILL POINT       02200000
*         TO A RECORD INDEX ENTRY.  ON OUTPUT IF THE PROCESSOR          02210000
*         INDICATES WRITE INDEX, XTPRIXP MUST POINT TO THE NEWLY        02220000
*         CREATED INDEX HEADER.                                         02230000
*******************************************************************     02240000
XTPRIXP  DS    AL4                  PTR TO RECORD TABLE INDEX           02250000
XTPPIND  DS    AL1                  PROCESSING INDICATOR                02260000
XTP4FLAG DS    CL1                  EXIT04 OR EXIT14 FLAGS       @18C   02270000
XTP4NTY  EQU   X'80'                NOTIFY EXIT4 OF EOT          @H2A   02280000
XTP4NEOT EQU   X'40'                NORMAL EOT FLAG              @H2A   02290000
XTP4ABNE EQU   X'20'                ABNORMAL EOT FLAG            @H2A   02300000
XTP4NCAL EQU   X'10'                EXIT 04 NO CALL FLAG -       @CNA   02310000
*                                   WHEN THIS FLAG IS SET ON     @CNA   02320000
*                                   THEN EXIT 04 WILL NO LONGER  @CNA   02330000
*                                   BE CALLED AGAIN UNTIL EOT OR @CNA   02340000
*                                   THE NEXT COPY OF THE DATA    @CNA   02350000
*                                   SET OR THE NEXT DATA SET.    @CNA   02360000
*                                   THIS FLAG IS RESET           @CNA   02370000
*                                   WHEN EXIT 04 IS CALLED       @CNA   02380000
*                                   FOR THE FIRST RECORD OF THE  @CNA   02390000
*                                   NEXT COPY OF THE DATA SET    @CNA   02400000
*                                   OR THE NEXT DATA SET.        @CNA   02410000
XTP4CONV EQU   X'08'                DO CONVERSION FLAG -         @CNA   02420000
*                                   WHEN THIS FLAG IS SET ON,    @18A   02430000
*                                   3800 LINE MODE CONVERSION    @18A   02440000
*                                   IS ACTIVATED.                @18A   02450000
*                                   THIS FLAG IS RESET WHEN      @CNA   02460000
*                                   EXIT 04/14 IS CALLED         @18C   02470000
*                                   FOR THE FIRST RECORD OF THE  @CNA   02480000
*                                   TRANSMISSION.                @CNA   02490000
XTP4WINA EQU   X'04'                WIDE OR NARROW PAPER FLAG -  @DDA   02500000
*                                   THIS FLAG IS ONLY VALID      @DDA   02510000
*                                   WHEN XTP4CONV IS SET ON      @DDA   02520000
*                                   (3800 LINE MODE CONVERSION   @DDA   02530000
*                                   IS ACTIVE) AND THE PRINTER   @DDA   02540000
*                                   IS IN CUT SHEET EMULATION    @DDA   02550000
*                                   MODE. THIS FLAG IS RESET     @DDA   02560000
*                                   WHEN EXIT 04/14 IS CALLED    @18C   02570000
*                                   FOR THE FIRST RECORD OF THE  @DDA   02580000
*                                   TRANSMISSION (NEXT COPY OF   @DDA   02590000
*                                   THE DATASET OR THE NEXT DATA @DDA   02600000
*                                   SET). WHEN THIS FLAG IS SET  @DDA   02610000
*                                   ON, THEN LANDSCAPE PAGES     @DDA   02620000
*                                   WILL BE GENERATED FOR        @DDA   02630000
*                                   PRINTING IN CUT SHEET        @DDA   02640000
*                                   EMULATION MODE.              @DDA   02650000
*                                   WHEN THIS FLAG IS SET        @DDA   02660000
*                                   OFF, THEN PORTRAIT PAGES     @DDA   02670000
*                                   WILL BE GENERATED FOR        @DDA   02680000
*                                   PRINTING IN CUT SHEET        @DDA   02690000
*                                   EMULATION MODE.              @DDA   02700000
XTP4LMRG EQU   X'02'                LINE MERGE FLAG -            @18A   02710000
*                                   WHEN THIS FLAG IS SET ON,    @18A   02720000
*                                   PSF WILL PERFORM THE LINE    @18A   02730000
*                                   MERGE FUNCTION LIKE THE      @18A   02740000
*                                   3800 PRINTER IN "LINE MODE". @18A   02750000
*                                   THIS FLAG IS ONLY VALID      @18A   02760000
*                                   WHEN XTP4CONV IS SET ON      @18A   02770000
*                                   (3800 LINE MODE CONVERSION   @18A   02780000
*                                   IS ACTIVE).                  @18A   02790000
*                                   THIS FLAG IS RESET WHEN      @18A   02800000
*                                   EXIT 04/14 IS CALLED         @18A   02810000
*                                   FOR THE FIRST RECORD OF THE  @18A   02820000
*                                   TRANSMISSION.                @18A   02830000
         DS    CL4                  RESERVED                     @D2A   02840000
XTP5FLAG DS    CL1                  EXIT05 SMF 6 FLAGS           @L1A   02850000
XTP5NEWS EQU   X'80'                PROCESSING JESNEWS DS        @L1A   02860000
XTP4DPLX DS    AL1                  DUPLEX VALUE -               @18C   02870000
*                                   0 = NOT SPECIFIED (DEFAULTS  @18A   02880000
*                                       TO FORMDEF VALUE)        @18A   02890000
*                                   1 = SIMPLEX                  @18A   02900000
*                                   2 = NORMAL DUPLEX            @18A   02910000
*                                   3 = TUMBLE DUPLEX            @18A   02920000
*                                   THIS FIELD IS SET TO ZERO    @18A   02930000
*                                   WHEN EXIT 04/14 IS CALLED    @18A   02940000
*                                   FOR THE FIRST RECORD OF      @18A   02950000
*                                   THE TRANSMISSION.            @18A   02960000
*                                   THIS FIELD IS ONLY           @18A   02970000
*                                   VALID WHEN XTP4CONV IS       @18A   02980000
*                                   SET ON (3800 LINE MODE       @18A   02990000
*                                   CONVERSION IS ACTIVE).       @18A   03000000
XTP4SIMP EQU   1                    SIMPLEX                      @18A   03010000
XTP4NDUP EQU   2                    NORMAL DUPLEX                @18A   03020000
XTP4TDUP EQU   3                    TUMBLE DUPLEX                @18A   03030000
XTP4XOFF DS    H                    HORIZONTAL OFFSET VALUE -    @CNA   03040000
*                                   PELS AT 240 PELS/INCH.       @CNA   03050000
*                                   ONLY VALID WHEN XTP4CONV     @D3C   03060000
*                                   IS SET ON.                   @D3C   03070000
XTP4YOFF DS    H                    VERTICAL OFFSET VALUE - PELS @CNA   03080000
*                                   AT 240 PELS/INCH.            @CNA   03090000
*                                   ONLY VALID WHEN XTP4CONV     @D3C   03100000
*                                   IS SET ON.                   @D3C   03110000
         DS    CL4                  RESERVED                     @D2A   03120000
*********************************************************************   03130000
*         THE FOLLOWING FIELDS PROVIDE INPUT TO THE INSTALLATION        03140000
*         EXIT06 (MESSAGE EXIT).                                        03150000
*********************************************************************   03160000
XTP6     DSECT                      EXIT06 INPUT RECORD                 03170000
XTP6PROC DS    CL8                  FSA identifier. The label    @33C   03180000
*                                   of the PRINTDEV statement.   @33A   03190000
XTP6MSG  DS    CL8                  MESSAGE ID (APSXXXXI)        @DNC   03200000
XTP6TYPE DS    CL1                  MESSAGE TYPE                        03210000
*                                   W=WTO, MOST WTO MESSAGES ARE        03220000
*                                   ASYNCRONOUS.  ASYNC MSGS BELONG     03230000
*                                   TO THE DATASET ON THE PRINTER       03240000
*                                   WHICH MAY BE DIFFERENT FROM THE     03250000
*                                   ONE BEING PROCESSED BY PSF.         03260000
*                                   XTPJSPAP POINTS TO THE JSPA         03270000
*                                   RELATED TO THE CURRENT DATASET      03280000
*                                   BEING PROCESSED BY PSF              03290000
*                                   P=PAPER, MESSAGES PRINTED ON        03300000
*                                   PAPER ARE SYNC MESSAGES      @03C   03310000
XTP6FLAG DS    CL1                                               @EJA   03320000
XTP6INTP EQU   X'80'                MESSAGE IS TARGETED FOR THE  @EJA   03330000
*                                   INTERRUPT MESSAGE PAGE       @EJA   03340000
*       THE FOLLOWING FIELDS ARE SET BY EXIT06                          03350000
XTP6FLG1 DS    CL1                                               @03A   03360000
XTP6TFSA EQU   X'80'                TERMINATE FSA - PSF WILL COMPLETE   03370000
*                                   THE PROCESSING OF THE CURRENT       03380000
*                                   DATASET (THE ONE BEING PROCESSED    03390000
*                                   BY PSF WHICH MAY BE DIFFERENT FROM  03400000
*                                   THE ONE ON THE PRINTER)  AND        03410000
*                                   TERMINATE THE FSA            @03A   03420000
XTP6HOLD EQU    X'40'               RELEASE THE DATASET CURRENTLY       03430000
*                                   BEING PROCESSED BY PSF TO JES       03440000
*                                   AND MARK THE DATASET AS      @07C   03450000
*                                   UNPRINTABLE                  @07C   03460000
XTP6TJOB EQU    X'20'               TERMINATE THE JOB ASSOCIATED        03470000
*                                   WITH INTERRUPT MESSAGE PAGE  @EJA   03480000
XTP6ACT DS     CL1                 ACTION TO BE TAKEN BY PSF     @H7A   03490000
*                                    SET BY PSF ON INPUT                03500000
*                                    CAN BE ALTERED BY THE EXIT         03510000
XTP6WTO EQU    X'80'                 PUT MSG TO OPERATOR CONSOLE @H7A   03520000
XTP6SEC EQU    X'40'                 PUT MSG TO SECURITY CONSOLE @H7A   03530000
XTP6PAP EQU    X'20'                 PUT TO MSG DATASET (PAPER)  @H7A   03540000
XTP6SUP EQU    X'00'                 SUPPRESS THIS MSG           @H7A   03550000
*                                                                       03560000
         DS     CL4                 RESERVED                     @EJC   03570000
*********************************************************************   03580000
*         THE FOLLOWING FIELDS PROVIDE INPUT TO THE INSTALLATION        03590000
*         EXIT07 (RESOURCE EXIT).                                @U7A   03600000
*********************************************************************   03610000
XTP7     DSECT                                                   @U7A   03620000
XTP7CID  DS    CL4                  CONTROL BLOCK ID = 'XTP7'    @U7A   03630000
XTP7LENG DS    AL4                  LENGTH OF XTP7 AREA          @U7A   03640000
XTP7ETYP DS    CL2                  FLAGS SET BY PSF - INDICATES        03650000
*                                   TO APSUX07 THE TYPE OF EXIT         03660000
*                                   CALL BEING MADE.             @U7A   03670000
XTP7INIT EQU   X'8000'              INITIALIZATION EXIT          @U7A   03680000
XTP7BDS  EQU   X'4000'              BEGINNING OF DATA SET        @U7A   03690000
XTP7ACC  EQU   X'2000'              RESOURCE ACCESS TIME EXIT    @U7A   03700000
XTP7LDB  EQU   X'1000'              LOAD BEGIN EXIT              @U7A   03710000
XTP7LDE  EQU   X'0800'              LOAD END EXIT                @U7A   03720000
XTP7DSE  EQU   X'0400'              RESOURCE DELETE CALL         @ITC   03730000
XTP7TERM EQU   X'0200'              TERMINATION OF FSA           @U7A   03740000
XTP7EDS  EQU   X'0100'              END OF DATA SET              @ITA   03750000
*                                                                       03760000
XTP7RTYP DS    CL2                  FLAGS SET BY PSF - INDICATES        03770000
*                                   TO APSUX07 THE TYPE OF RESOURCE     03780000
*                                   CURRENTLY BEING PROCESSED    @U7A   03790000
XTP7PD   EQU   X'8000'              PAGEDEF                      @U7A   03800000
XTP7FD   EQU   X'4000'              FORMDEF                      @U7A   03810000
XTP7CF   EQU   X'2000'              CODED FONT                   @U7A   03820000
XTP7MO   EQU   X'1000'              OVERLAY                      @U7A   03830000
XTP7PS   EQU   X'0800'              PAGE SEGMENT/OCA             @19C   03840000
XTP7OC   EQU   X'0400'              OBJECT CONTAINER             @DEA   03850000
*                                                                       03860000
XTP7DSTY DS    CL1                  FLAGS SET BY PSF - INDICATES        03870000
*                                   TO APSUX07 THE TYPE OF DATA SET     03880000
*                                   CURRENTLY BEING PROCESSED    @U7A   03890000
XTP7AUX  EQU   X'80'                PROCESSING SYSTEM DEFAULT OR        03900000
*                                   FOR AUXILIARY DATA SETS      @U7A   03910000
XTP7PDS  EQU   X'40'                PRINT DATA SET               @U7A   03920000
*                                                                       03930000
XTP7DSAT DS    CL1                  FLAGS SET BY PSF - TYPE OF          03940000
*                                   THE DATA SET BEING PROCESSED @DGC   03950000
XTP7PDFT EQU   X'80'                SYSTEM DEFAULT               @U7A   03960000
XTP7PJHD EQU   X'40'                JOB HEADER                   @U7A   03970000
XTP7PJTR EQU   X'20'                JOB TRAILER                  @U7A   03980000
XTP7PDSH EQU   X'10'                DATA SET HEADER              @U7A   03990000
XTP7PMDS EQU   X'08'                MESSAGE DATA SET             @U7A   04000000
XTP7PLDS EQU   X'04'                LAST PRINT DATA SET IN JOB          04010000
*                                   - VALID BDS & DSE EXIT ONLY  @U7A   04020000
XTP7ACSE DS    AL1                  AUTOMATIC CUT SHEET EMULATION       04030000
*                                   CHECKING                            04040000
*                                   (VALID FOR INITIALIZATION           04050000
*                                    "XTP7INIT", BDS "XTP7BDS",         04060000
*                                    AND EDS "XTP7EDS")          @ITC   04070000
XTP7NCK  EQU   0                    DO NOT CHECK TO SEE IF PAGE         04080000
*                                   FITS                         @DDA   04090000
XTP7CK1P EQU   1                    CHECK ONLY FIRST PAGE TO SEE        04100000
*                                   IF IT FITS                   @DDA   04110000
XTP7CKAP EQU   2                    CHECK ALL PAGES TO SEE IF           04120000
*                                   THEY FIT                     @DDA   04130000
XTP7IPCC DS    AL1                  NUMBER OF COPIES OF THE             04140000
*                                      INTERRUPT MESSAGE PAGE TO PRO-   04150000
*                                      DUCE.                            04160000
*                                      - ONLY VALID WITH XTP7IPMF       04170000
*                                      - IGNORED FOR THE 3800           04180000
*                                      DOMAIN: 1 - 10            @08A   04190000
*                                                                       04200000
XTP7NOTY DS    CL4                  NOTIFICATION FLAGS - SET BY         04210000
*                                   APSUX07, INDICATES TO PSF WHEN      04220000
*                                   THE EXIT WANTS CONTROL       @U7A   04230000
         ORG   XTP7NOTY                                                 04240000
XTP7MISC DS    CL1                  MISCELLANEOUS EXITS          @U7A   04250000
XTP7EBDS EQU   X'80'                BEGINNING OF DATA SET        @U7A   04260000
XTP7ETRM EQU   X'40'                TERMINATION OF FSA           @U7A   04270000
XTP7EEDS EQU   X'20'                END OF DATA SET              @ITA   04280000
*                                                                       04290000
XTP7NACC DS    CL1                  ACCESS TIME EXITS            @U7A   04300000
XTP7APD  EQU   X'80'                PAGEDEFS                     @U7A   04310000
XTP7AFD  EQU   X'40'                FORMDEFS                     @U7A   04320000
XTP7ACF  EQU   X'20'                CODED FONTS                  @U7A   04330000
XTP7AMO  EQU   X'10'                MEDIUM OVERLAYS              @U7A   04340000
XTP7APS  EQU   X'08'                PAGE SEGMENT/OCA             @19C   04350000
XTP7AOC  EQU   X'04'                OBJECT CONTAINERS            @DEA   04360000
*                                                                       04370000
XTP7NLD  DS    CL1                  LOAD TIME EXITS              @U7A   04380000
XTP7LPD  EQU   X'80'                PAGEDEFS                     @U7A   04390000
XTP7LFD  EQU   X'40'                FORMDEFS                     @U7A   04400000
XTP7LCF  EQU   X'20'                CODED FONTS                  @U7A   04410000
XTP7LMO  EQU   X'10'                MEDIUM OVERLAYS              @U7A   04420000
XTP7LPS  EQU   X'08'                PAGE SEGMENTS                @U7A   04430000
XTP7LOC  EQU   X'04'                OBJECT CONTAINERS            @DEA   04440000
*                                                                       04450000
XTP7NDEL DS    CL1                  DELETE TIME (DSE) EXITS      @U7A   04460000
XTP7DPD  EQU   X'80'                PAGEDEFS                     @U7A   04470000
XTP7DFD  EQU   X'40'                FORMDEFS                     @U7A   04480000
XTP7DCF  EQU   X'20'                CODED FONTS                  @U7A   04490000
XTP7DMO  EQU   X'10'                MEDIUM OVERLAYS              @U7A   04500000
XTP7DPS  EQU   X'08'                PAGE SEGMENT/OCA             @19C   04510000
XTP7DOC  EQU   X'04'                OBJECT CONTAINERS (NOT USED) @DEA   04520000
*                                                                       04530000
XTP7RFLG DS    CL2                  RESPONSE FLAGS               @U7A   04540000
XTP7ETFF EQU   X'8000'              EJECT TO FRONT FACING BETWEEN       04550000
*                                   DOCUMENTS                           04560000
*                                   (VALID FOR INITIALIZATION           04570000
*                                    "XTP7INIT", BDS "XTP7BDS",         04580000
*                                    AND EDS "XTP7EDS")          @ITC   04590000
*                                     0 = ETFF ACTIVE                   04600000
*                                     1 = BYPASS ETFF            @DGC   04610000
XTP7TDS  EQU   X'4000'              TERMINATE THE DATA SET              04620000
*                                     0 = DO NOT TERMINATE              04630000
*                                     1 = TERMINATE              @U7A   04640000
XTP7EFFH EQU   X'2000'              EJECT TO FRONT FACING BEFORE        04650000
*                                   JOB HEADER                          04660000
*                                   (VALID FOR INITIALIZATION           04670000
*                                    "XTP7INIT", BDS "XTP7BDS",         04680000
*                                    AND EDS "XTP7EDS")          @ITC   04690000
*                                     0 = ETFF ACTIVE                   04700000
*                                     1 = BYPASS ETFF            @DGC   04710000
XTP7HDF  EQU   X'1000'              SELECT HARDWARE DEFAULT FONT        04720000
*                                   (VALID FOR 3800 ONLY)               04730000
*                                     0 = USE HARDWARE DEFAULT FONT     04740000
*                                     1 = USE 1ST FONT MAPPED    @06A   04750000
XTP7HQUE EQU   X'0800'              SEND DATA SET TO JES AND MARK@07C   04760000
*                                   IT AS UNPRINTABLE            @07A   04770000
*                                   (VALID ONLY WHEN DATA SET           04780000
*                                    TERMINATED BY XTP7TDS)             04790000
*                                     0 = PURGE THE DATA SET            04800000
*                                     1 = MARK DATA SET AS       @07C   04810000
*                                         UNPRINTABLE            @07A   04820000
*                                                                       04830000
XTP7PRNS EQU   X'0400'              SINGLE BYTE FONT PRUNING FLAG       04840000
*                                   (VALID ONLY ON INITIALIZATION       04850000
*                                    CALL "XTP7INIT")                   04860000
*                                     0 = PRUNE SINGLE BYTE FONTS       04870000
*                                     1 = BYPASS PRUNING         @H7A   04880000
*                                                                       04890000
XTP7PRND EQU   X'0200'              DOUBLE BYTE FONT PRUNING            04900000
*                                   (VALID ONLY ON INITIALIZATION       04910000
*                                    CALL "XTP7INIT")                   04920000
*                                     0 = PRUNE DOUBLE BYTE FONTS       04930000
*                                     1 = BYPASS PRUNING         @H7A   04940000
*                                                                       04950000
XTP7IPMF EQU   X'0100'              MARK FORM REQUEST                   04960000
*                                   (VALID FOR INITIALIZATION           04970000
*                                    "XTP7INIT", BDS "XTP7BDS",         04980000
*                                    AND EDS "XTP7EDS")          @ITC   04990000
*                                     SEE XTP7IPCC FOR COPIES.          05000000
*                                      1 = MARK INTERRUPT MESSAGE PAGE  05010000
*                                      0 = NO MARKING OF INTERRUPT      05020000
*                                          MESSAGE PAGE          @08A   05030000
XTP7IPOS EQU   X'0080'              OFFSET STACK INTERRUPT MESSAGE      05040000
*                                   PAGE.                               05050000
*                                   (VALID FOR INITIALIZATION           05060000
*                                    "XTP7INIT", BDS "XTP7BDS",         05070000
*                                    AND EDS "XTP7EDS")          @ITC   05080000
*                                      1 = OFFSET STACKING              05090000
*                                      0 = NO OFFSET STACKING           05100000
*                                                                @08A   05110000
XTP7MTOF EQU   X'0040'              MAP FONTS TO OUTLINE FONTS          05120000
*                                   (VALID ONLY ON INITIALIZATION       05130000
*                                    CALL "XTP7INIT").                  05140000
*                                      1 = MAP FONTS TO OUTLINE         05150000
*                                          FONTS                        05160000
*                                      0 = DO NOT MAP FONTS TO          05170000
*                                          OUTLINE FONTS                05180000
*                                                                @11A   05190000
XTP7RFNF EQU   X'0020'              RECOVER FROM FONT-NOT-FOUND         05200000
*                                   CONDITIONS (VALID ONLY ON           05210000
*                                   INITIALIZATION, CALL "XTP7INIT").   05220000
*                                      1 = QUERY THE HOST FONT          05230000
*                                          LIBRARIES FOR THE MAPPED     05240000
*                                          FONT.  IF THE MAPPED FONT    05250000
*                                          DOES NOT EXIST, GO BACK      05260000
*                                          AND USE THE ORIGINAL FONT.   05270000
*                                          NOTE:  DUE TO THE ADDITIONAL 05280000
*                                          LIBRARY QUERIES FOR EVERY    05290000
*                                          FONT RESOURCE, PERFORMANCE   05300000
*                                          WILL BE DEGRADED IF THIS     05310000
*                                          OPTION IS TURNED ON   @11A   05320000
*                                      0 = DO NOT QUERY HOST FONT       05330000
*                                          LIBRARIES TO ENSURE THAT     05340000
*                                          THE MAPPED FONT ACTUALLY     05350000
*                                          EXISTS.               @11A   05360000
XTP7IPSU EQU   X'0010'              SUPPRESS INTERRUPT MESSAGE PAGES    05370000
*                                   (VALID FOR INITIALIZATION           05380000
*                                   "XTP7INIT")                         05390000
*                                      1 = SUPPRESS INT MSG PAGES       05400000
*                                      0 = ALLOW INT MSG PAGES          05410000
*                                                                @09A   05420000
XTP738MO EQU   X'0008'              SET 3900 MEDIA ORIGIN TO 3800       05430000
*                                   MEDIA ORIGIN FOR THE USER'S         05440000
*                                   DATASET                             05450000
*                                   (VALID FOR INITIALIZATION           05460000
*                                    "XTP7INIT", BDS "XTP7BDS",         05470000
*                                    AND EDS "XTP7EDS")          @ITC   05480000
*                                      1 = SET 3900 MEDIA ORIGIN        05490000
*                                          TO 3800 MEDIA ORIGIN         05500000
*                                      0 = DO NOT SET 3900 MEDIA        05510000
*                                          ORIGIN                       05520000
*                                                                @16C   05530000
*                                                                       05540000
XTP7MDSD EQU   X'0004'              SEND THE MESSAGE DATASET TO A       05550000
*                                   SYSOUT DATASET                      05560000
*                                   (VALID FOR INITIALIZATION           05570000
*                                    "XTP7INIT", BDS "XTP7BDS",         05580000
*                                    AND EDS "XTP7EDS")          @ITC   05590000
*                                      1 = SEND MSG DATASET TO          05600000
*                                          A SYSOUT DATASET             05610000
*                                      0 = DO NOT SEND MSG DATASET      05620000
*                                          TO A SYSOUT DATASET          05630000
*                                                                @DFA   05640000
*                                                                       05650000
*****************************************************************@EZA   05660000
*XTP7HCA  EQU   X'0002'             Decommission Huffman code    @EZC   05670000
*****************************************************************@EZA   05680000
*                                                                       05690000
*        EQU   X'0002'              Reserved - do not use.       @EZA   05700000
*                                                                       05710000
XTP7C2SI EQU   X'0001'              CONVERT A MULTIPLE CELLED IM1       05720000
*                                   IMAGE TO A SINGLE IOCA IMAGE        05730000
*                                   (VALID FOR INITIALIZATION           05740000
*                                    "XTP7INIT", BDS "XTP7BDS",         05750000
*                                    AND EDS "XTP7EDS")          @ITC   05760000
*                                      1 = CONVERT TO SINGLE            05770000
*                                          IOCA IMAGE                   05780000
*                                      0 = CONVERT TO MULTIPLE          05790000
*                                          IOCA IMAGES           @15A   05800000
*                                                                       05810000
XTP7RRLV DS    CL14                 REASONABLE RESOURCE LOADED   @D2A   05820000
*                                   VALUES (RRLV'S) - DETERMINES        05830000
*                                   THE NUMBER OF RESOURCES RETAINED    05840000
*                                   AT DATA SET END.             @U7A   05850000
         ORG   XTP7RRLV                                                 05860000
XTP7RPD  DS    AL2                  RRLV FOR PAGEDEFS            @U7A   05870000
XTP7RFD  DS    AL2                  RRLV FOR FORMDEFS            @U7A   05880000
XTP7RMO  DS    AL2                  RRLV FOR OVERLAYS            @U7A   05890000
XTP7RPS  DS    AL2                  RRLV FOR PAGE SEGMENT/OCA    @19C   05900000
XTP7RCF  DS    AL2                  RRLV FOR FONTS               @U7A   05910000
XTP7ROC  DS    AL2                  RRLV FOR OBJECT CONTAINERS   @DEA   05920000
         DS    CL2                  RESERVED                     @DEC   05930000
*                                                                       05940000
XTP7RLST DS    CL8                  RLST CHAIN INFORMATION       @U7A   05950000
         ORG   XTP7RLST                                                 05960000
XTP7LSTP DS    AL4                  POINTER TO APSURLST          @U7A   05970000
XTP7RESC DS    AL2                  RESOURCE COUNT - # OF DISTINCT      05980000
*                                   RESOURCES IN RLST CHAIN      @U7A   05990000
XTP7LSTC DS    AL2                  LIST COUNT - # OF ENTRIES IN        06000000
*                                   RLST CHAIN                   @U7A   06010000
*                                                                       06020000
XTP7OVLY DS    CL8                  NAME OF OVERLAY CURRENTLY           06030000
*                                   BEING PROCESSED              @U7A   06040000
*                                                                       06050000
XTP7PINF DS    CL20                 PRINTER INFORMATION          @L1C   06060000
         ORG   XTP7PINF                                                 06070000
XTP7PRT  DS    CL8                  PRINTER TYPE AND MODEL       @U7A   06080000
         ORG   XTP7PRT                                                  06090000
XTP7ATCH DS    CL1                  ATTACHMENT TYPE              @U7A   06100000
XTP7FMLY DS    CL4                  DEVICE FAMILY                @U7A   06110000
XTP7PRTT DS    CL2                  DEVICE TYPE                  @U7A   06120000
XTP7PRTM DS    CL1                  MODEL NUMBER                 @U7A   06130000
XTP7PFLG DS    CL1                  PRINTER FLAGS                @L1A   06140000
XTP7PSEC EQU   X'80'                SECURE PRINTER               @L1A   06150000
         DS    CL3                  RESERVED                     @L1A   06160000
XTP7PNAM DS    CL8                  PRINTER NAME                 @U7A   06170000
*                                                                       06180000
XTP7MSGP DS    AL4                  POINTER TO USER SUPPLIED, 64        06190000
*                                   BYTE MESSAGE INSERT          @U7A   06200000
XTP7MSGL DS    AL1                  LENGTH OF MESSAGE INSERT     @U7A   06210000
         DS    CL1                  RESERVED                     @U7A   06220000
*                                                                       06230000
XTP7CRLF DS    CL1                  CRL FLAGS -                         06240000
*                                      0 = FREE THE STORAGE             06250000
*                                      1 = KEEP THE CRL          @U7A   06260000
XTP7CFPD EQU   X'80'                FREE/KEEP PAGEDEF CRL        @U7A   06270000
XTP7CFFD EQU   X'40'                FREE/KEEP FORMDEF CRL        @U7A   06280000
XTP7CFCF EQU   X'20'                FREE/KEEP FONT DEFAULT CRL   @MRC   06290000
XTP7CFMO EQU   X'10'                FREE/KEEP OVERLAY DEFAULT CRL@MRC   06300000
XTP7CFPS EQU   X'08'                FREE/KEEP SEGMENT/OCA               06310000
*                                         DEFAULT CRL            @MRC   06320000
XTP7CSSD EQU   X'04'                FREE/KEEP SECURITY DEF              06330000
*                                         DEFAULT CRL            @MRC   06340000
XTP7CSCF EQU   X'02'                FREE/KEEP SECURITY FONT             06350000
*                                         DEFAULT CRL            @MRC   06360000
XTP7CSMO EQU   X'01'                FREE/KEEP SECUR OVERLAY             06370000
*                                         DEFAULT CRL            @MRC   06380000
*                                                                       06390000
XTP7CRF2 DS    CL1                  CRL FLAGS-                          06400000
*                                      0 = FREE THE STORAGE             06410000
*                                      1 = KEEP THE CRL          @L1C   06420000
XTP7CSPS EQU   X'80'                FREE/KEEP SECURITY SEG              06430000
*                                         DEFAULT CRL            @MRC   06440000
XTP7CFOC EQU   X'40'                FREE/KEEP OBJ CONTAINER CRL  @DEA   06450000
XTP7C2CF EQU   X'20'                FREE/KEEP FONT 240 CRL       @MRA   06460000
XTP7C3CF EQU   X'10'                FREE/KEEP FONT 300 CRL       @MRA   06470000
XTP7C2MO EQU   X'08'                FREE/KEEP OVERLAY 240 CRL    @MRA   06480000
XTP7C3MO EQU   X'04'                FREE/KEEP OVERLAY 300 CRL    @MRA   06490000
XTP7C2PS EQU   X'02'                FREE/KEEP SEGMENT/OCA 240 CRL@MRA   06500000
XTP7C3PS EQU   X'01'                FREE/KEEP SEGMENT/OCA 300 CRL@MRA   06510000
*                                                                       06520000
XTP7CRLP DS    CL40                 POINTERS TO THE CONCATENATION@D2C   06530000
*                                   RETRIEVAL LISTS              @L1C   06540000
         ORG   XTP7CRLP                                          @U7A   06550000
XTP7CLPD DS    AL4                  POINTER TO PAGEDEF CRL       @U7A   06560000
XTP7CLFD DS    AL4                  POINTER TO FORMDEF CRL       @U7A   06570000
XTP7CLCF DS    AL4                  POINTER TO FONT DEFAULT CRL  @MRC   06580000
XTP7CLMO DS    AL4                  POINTER TO OVLY DEFAULT CRL  @MRC   06590000
XTP7CLPS DS    AL4                  POINTER TO SEGMENT/OCA              06600000
*                                              DEFAULT CRL       @MRC   06610000
XTP7CLOC DS    AL4                  POINTER TO OBJ CONTAINER CRL @DEC   06620000
XTP7CLSD DS    AL4                  POINTER TO SECURITY DEF             06630000
*                                              DEFAULT CRL       @MRC   06640000
XTP7CLSF DS    AL4                  POINTER TO SEC FONT                 06650000
*                                              DEFAULT CRL       @MRC   06660000
XTP7CLSO DS    AL4                  POINTER TO SEC OVERLAY              06670000
*                                              DEFAULT CRL       @MRC   06680000
XTP7CLSP DS    AL4                  POINTER TO SEC SEG/OCA              06690000
*                                              DEFAULT CRL       @MRC   06700000
*                                                                       06710000
*                                                                       06720000
XTP7MFLG DS    CL1                  MORE RESPONSE FLAGS          @16A   06730000
XTP7JHMO EQU   X'80'                SET THE JOB HEADER MEDIA ORIGIN     06740000
*                                   TO TOP LEFT CORNER                  06750000
*                                   (VALID FOR INITIALIZATION           06760000
*                                    "XTP7INIT", BDS "XTP7BDS",         06770000
*                                    AND EDS "XTP7EDS")          @ITC   06780000
*                                      1 = SET JOB HEADER MEDIA         06790000
*                                          ORIGIN TO TOP LEFT CORNER    06800000
*                                      0 = DO NOT SET JOB HEADER        06810000
*                                          MEDIA ORIGIN                 06820000
*                                                                @16A   06830000
*                                                                       06840000
XTP7JTMO EQU   X'40'                SET THE JOB TRAILER MEDIA ORIGIN    06850000
*                                   TO TOP LEFT CORNER                  06860000
*                                   (VALID FOR INITIALIZATION           06870000
*                                    "XTP7INIT", BDS "XTP7BDS",         06880000
*                                    AND EDS "XTP7EDS")          @ITC   06890000
*                                      1 = SET JOB TRAILER MEDIA        06900000
*                                          ORIGIN TO TOP LEFT CORNER    06910000
*                                      0 = DO NOT SET JOB TRAILER       06920000
*                                          MEDIA ORIGIN                 06930000
*                                                                @16A   06940000
*                                                                       06950000
XTP7DHMO EQU   X'20'                SET THE DATASET HEADER MEDIA        06960000
*                                   ORIGIN TO TOP LEFT CORNER           06970000
*                                   (VALID FOR INITIALIZATION           06980000
*                                    "XTP7INIT", BDS "XTP7BDS",         06990000
*                                    AND EDS "XTP7EDS")          @ITC   07000000
*                                      1 = SET DATASET HEADER MEDIA     07010000
*                                          ORIGIN TO TOP LEFT CORNER    07020000
*                                      0 = DO NOT SET DATASET HEADER    07030000
*                                          MEDIA ORIGIN                 07040000
*                                                                @16A   07050000
*                                                                       07060000
XTP7MDMO EQU   X'10'                SET THE MESSAGE DATASET MEDIA       07070000
*                                   ORIGIN TO TOP LEFT CORNER           07080000
*                                   (VALID FOR INITIALIZATION           07090000
*                                    "XTP7INIT", BDS "XTP7BDS",         07100000
*                                    AND EDS "XTP7EDS")          @ITC   07110000
*                                      1 = SET MESSAGE DATASET MEDIA    07120000
*                                          ORIGIN TO TOP LEFT CORNER    07130000
*                                      0 = DO NOT SET MESSAGE DATASET   07140000
*                                          MEDIA ORIGIN                 07150000
*                                                                @16A   07160000
*                                                                       07170000
XTP7RSTR EQU   X'08'                ABEND RESTART FLAG                  07180000
*                                   (VALID ONLY ON TERMINATION          07190000
*                                    CALL "XTP7TERM")                   07200000
*                                     0 = NONRESTARTABLE ABEND          07210000
*                                     1 = RESTARTABLE ABEND             07220000
*                                                                @17A   07230000
*                                                                       07240000
XTP7WIDE EQU   X'04'                WIDE OR NARROW PAPER FLAG -  @20A   07250000
*                                   (VALID FOR INITIALIZATION           07260000
*                                    "XTP7INIT", BDS "XTP7BDS",         07270000
*                                    AND EDS "XTP7EDS")          @ITC   07280000
*                                   THIS FLAG IS ONLY VALID      @20A   07290000
*                                   WHEN ONE OR MORE OF THE      @20A   07300000
*                                   3800 MEDIA ORIGIN FLAGS      @20A   07310000
*                                   IS SET AND THE PRINTER       @20A   07320000
*                                   IS IN CUT SHEET EMULATION    @20A   07330000
*                                   MODE.                        @20A   07340000
*                                      1 = LANDSCAPE PAGES WILL  @20A   07350000
*                                          BE GENERATED FOR      @20A   07360000
*                                          PRINTING WHEN IN CUT  @20A   07370000
*                                          SHEET EMULATION MODE. @20A   07380000
*                                      0 = PORTRAIT PAGES WILL   @20A   07390000
*                                          BE GENERATED FOR      @20A   07400000
*                                          PRINTING WHEN IN CUT  @20A   07410000
*                                          SHEET EMULATION MODE. @20A   07420000
*                                                                @20A   07430000
XTP7IHIB EQU   X'02'                INHIBIT RECOVERY FLAG               07440000
*                                   (VALID FOR INITIALIZATION           07450000
*                                    "XTP7INIT", BDS "XTP7BDS",         07460000
*                                    AND EDS "XTP7EDS")          @ITC   07470000
*                                   THIS FLAG IS ONLY VALID      @20A   07480000
*                                     0 = ALLOW RECOVERY                07490000
*                                     1 = INHIBIT RECOVERY       @IRA   07500000
XTP7ENDC EQU   X'01'                END THE SNA LU1 CONVERSATION        07510000
*                                   (VALID ONLY ON INITIALIZATION       07520000
*                                    CALL "XTP7INIT")                   07530000
*                                      1 = END SNA LU1 CONVERSATION     07540000
*                                          WITHOUT ENDING THE SESSION   07550000
*                                      0 = ONLY END SNA CONVERSATION    07560000
*                                          WHEN THE SESSION ENDS        07570000
*                                                                @21A   07580000
XTP7ABRC DS    CL2                  ABEND REASON CODE            @17A   07590000
XTP7JOG  DS    AL1                  JOGGING VALUE -                     07600000
*                                   VALID FOR INITIALIZATION            07610000
*                                   "XTP7INIT", AND BDSC "XTP7BDS"      07620000
*                                   FOR FIRST DATA SET OF A JOB         07630000
*                                   0 = DEFAULT TO JES COPY MARK        07640000
*                                       SETTING                         07650000
*                                   1 = DO NOT JOG                      07660000
*                                   2 = JOG ON A DATA SET BOUNDARY      07670000
*                                   3 = JOG ON A JOB BOUNDARY    @38C   07680000
XTP7NONE EQU   1                    NONE                         @38A   07690000
XTP7DSET EQU   2                    DATASET                      @38A   07700000
XTP7JOB  EQU   3                    JOB                          @38A   07710000
XTP7FMT  DS    AL2                  CURRENT DATASET RESOLUTION          07720000
*                                   VALUE SET BY APSUX07         @MRA   07730000
XTP7CRF3 DS    CL1                  CRL FLAGS-                          07740000
*                                      0 = FREE THE STORAGE             07750000
*                                      1 = KEEP THE CRL          @MRA   07760000
XTP7CFPF EQU   X'40'                FREE/KEEP FONT PATH CRL      @FEA   07770000
XTP7S2CF EQU   X'20'                FREE/KEEP SECUR. FONT 240 CRL@MRA   07780000
XTP7S3CF EQU   X'10'                FREE/KEEP SECUR. FONT 300 CRL@MRA   07790000
XTP7S2MO EQU   X'08'                FREE/KEEP SECUR. OVLY 240 CRL@MRA   07800000
XTP7S3MO EQU   X'04'                FREE/KEEP SECUR. OVLY 300 CRL@MRA   07810000
XTP7S2PS EQU   X'02'                FREE/KEEP SECUR. SEG 240 CRL @MRA   07820000
XTP7S3PS EQU   X'01'                FREE/KEEP SECUR. SEG 300 CRL @MRA   07830000
         DS    CL1                  RESERVED                     @MRA   07840000
*                                                                       07850000
XTP7CRP2 DS    CL56                 POINTERS TO THE CONCATENATION       07860000
*                                   RETRIEVAL LISTS              @MRA   07870000
         ORG   XTP7CRP2                                          @U7A   07880000
XTP72LCF DS    AL4                  POINTER TO FONT 240 CRL      @MRA   07890000
XTP73LCF DS    AL4                  POINTER TO FONT 300 CRL      @MRA   07900000
XTP72LMO DS    AL4                  POINTER TO OVLY 240 CRL      @MRA   07910000
XTP73LMO DS    AL4                  POINTER TO OVLY 300 CRL      @MRA   07920000
XTP72LPS DS    AL4                  POINTER TO SEGM/OCA 240 CRL  @MRA   07930000
XTP73LPS DS    AL4                  POINTER TO SEGM/OCA 300 CRL  @MRA   07940000
XTP7CRFP DS    AL4                  POINTER TO FONT PATH CRL     @FEC   07950000
         DS    AL4                  RESERVED                     @MRA   07960000
XTP72LSF DS    AL4                  POINTER TO SECUR FONT 240 CRL@MRA   07970000
XTP73LSF DS    AL4                  POINTER TO SECUR FONT 300 CRL@MRA   07980000
XTP72LSO DS    AL4                  POINTER TO SECUR OVLY 240 CRL@MRA   07990000
XTP73LSO DS    AL4                  POINTER TO SECUR OVLY 300 CRL@MRA   08000000
XTP72LSP DS    AL4                  POINTER TO SECUR SEG 240 CRL @MRA   08010000
XTP73LSP DS    AL4                  POINTER TO SECUR SEG 300 CRL @MRA   08020000
*                                                                       08030000
XTP7MFG1 DS    CL1                  MORE RESPONSE FLAGS          @22A   08040000
XTP7APSF EQU   X'80'                ACK PER SHEET FLAG -                08050000
*                                   VALID FOR CHANNEL-ATTACHED          08060000
*                                   PRINTERS ONLY                       08070000
*                                   (VALID ONLY ON INITIALIZATION       08080000
*                                    CALL "XTP7INIT")                   08090000
*                                     0 = ACK PER PAGE                  08100000
*                                     1 = ACK PER SHEET          @DXC   08110000
XTP7NSF  EQU   X'40'                CSE NEW SHEET FLAG                  08120000
*                                   (VALID ONLY ON                      08130000
*                                    INITIALIZATION CALL                08140000
*                                    "XTP7INIT")                        08150000
*                                      0 = In CSE mode, JOG(AOS) with   08160000
*                                          offset stacking being done   08170000
*                                          or start of a data set       08180000
*                                          causes skip to next          08190000
*                                          front side partition         08200000
*                                      1 = In CSE mode, JOG(AOS) with   08210000
*                                          offset stacking being done   08220000
*                                          or start of a data set       08230000
*                                          causes skip to new sheet.    08240000
*                                                                @36C   08250000
XTP7CLOS EQU   X'20'                CLOSE RESOURCE LIBRARIES     @24A   08260000
*                                   (VALID ONLY ON INITIALIZATION       08270000
*                                    CALL "XTP7INIT")                   08280000
*                                     0 = DON'T CLOSE                   08290000
*                                     1 = CLOSE WHEN IDLE               08300000
XTP7SDCH EQU   X'10'                SEND DEFAULT CHARACTER FLAG -       08310000
*                                     USED FOR SINGLE BYTE OUTLINE      08320000
*                                     FONT CODE PAGE                    08330000
*                                   (VALID FOR INITIALIZATION           08340000
*                                    "XTP7INIT", BDS "XTP7BDS",         08350000
*                                    AND EDS "XTP7EDS")          @ITC   08360000
*                                     0 = DO NOT SEND DEFAULT           08370000
*                                         CHARACTER                     08380000
*                                     1 = SEND DEFAULT CHARACTER        08390000
*                                                                @25A   08400000
XTP7CINR EQU   X'08'                CAPTURE INLINE RESOURCES WHEN       08410000
*                                     CONNECTED VIA DPF OR WPM   @34C*/ 08420000
*                                   (VALID FOR INITIALIZATION           08430000
*                                    "XTP7INIT", BDS "XTP7BDS",         08440000
*                                    AND EDS "XTP7EDS")          @ITC   08450000
*                                     0 = DO NOT CAPTURE INLINE         08460000
*                                         RESOURCES WHEN CONNECTED      08470000
*                                         VIA DPF OR WPM                08480000
*                                     1 = CAPTURE INLINE RESOURCES      08490000
*                                         WHEN CONNECTED VIA DPF OR     08500000
*                                         WPM                    @34C*/ 08510000
XTP7RDSR EQU   X'04'                RELEASE DATA SETS WHEN              08520000
*                                      REPOSITIONING                    08530000
*                                   (VALID FOR INITIALIZATION           08540000
*                                        "XTP7INIT")                    08550000
*                                      0 = DO NOT RELEASE DATA SETS     08560000
*                                          WHEN REPOSITIONING           08570000
*                                      1 = RELEASE DATA SETS WHEN       08580000
*                                          REPOSITIONING         @29A   08590000
XTP7SUCM EQU   X'02'                SUPPRESS COPY MARKS                 08600000
*                                   (VALID FOR INITIALIZATION           08610000
*                                    "XTP7INIT", BDS "XTP7BDS",         08620000
*                                    AND EDS "XTP7EDS")          @ITC   08630000
*                                     0 = DO NOT SUPPRESS COPY MARKS    08640000
*                                     1 = SUPPRESS COPY MARKS           08650000
*                                                                @30A   08660000
XTP7RSV1 EQU   X'01'                RESERVED - DO NOT USE        @31A   08670000
XTP7PRMD DS    CL8                  PRMODE - SPECIFIES THE TYPE OF      08680000
*                                      DATA IN THE PRINT DATA SET       08690000
*                                   (VALID FOR INITIALIZATION           08700000
*                                    "XTP7INIT" AND BDS "XTP7BDS")      08710000
*                                      ONLY SOSI1, SOSI2, SOSI3 OR      08720000
*                                      SOSI4 CAN BE SPECIFIED.   @FCC   08730000
*                                                                       08740000
         DS    CL1                  RESERVED                     @28A   08750000
XTP7DRES DS    H                    DEVICE RESOLUTION (PELS/10 IN)      08760000
*                                   FOR X DIRECTION                     08770000
*                                   X'960' = 240 PEL PRINTER            08780000
*                                   X'BB8' = 300 PEL PRINTER            08790000
*                                                                @28A   08800000
XTP7BINS DS    CL12                 SIDE AND EDGE SENSITIVITY           08810000
*                                   BINS                         @39A   08820000
         ORG   XTP7BINS                                          @39A   08830000
XTP7BINA DS    AL1                  FIRST BIN                    @39A   08840000
XTP7SIMA DS    AL1                  FIRST SIMPLEX BIN            @39A   08850000
XTP7DUPA DS    AL1                  FIRST DUPLEX BIN             @39A   08860000
XTP7BINB DS    AL1                  SECOND BIN                   @39A   08870000
XTP7SIMB DS    AL1                  SECOND SIMPLEX BIN           @39A   08880000
XTP7DUPB DS    AL1                  SECOND DUPLEX BIN            @39A   08890000
XTP7BINC DS    AL1                  THIRD BIN                    @39A   08900000
XTP7SIMC DS    AL1                  THIRD SIMPLEX BIN            @39A   08910000
XTP7DUPC DS    AL1                  THIRD DUPLEX BIN             @39A   08920000
XTP7BIND DS    AL1                  FOURTH BIN                   @39A   08930000
XTP7SIMD DS    AL1                  FOURTH SIMPLEX BIN           @39A   08940000
XTP7DUPD DS    AL1                  FOURTH DUPLEX BIN            @39A   08950000
*                                                                       08960000
XTP7MFG2 DS    CL1                  MORE RESPONSE FLAGS          @EMA   08970000
XTP7ASAP EQU   X'80'                AFP STATISTICS ABOUT THE PRINTFILE  08980000
*                                   (VALID FOR BDS "XTP7BDS")           08990000
*                                     0 = DO NOT GATHER AFP STATISTICS  09000000
*                                         FOR THIS DATASET (PRINTFILE)  09010000
*                                     1 = GATHER AFP STATISTICS FOR     09020000
*                                         THIS PRINTFILE         @EMA   09030000
XTP7SENS EQU   X'40'                SIDE AND EDGE SENSITIVITY FLAG      09040000
*                                   (VALID ONLY ON INIT CALL            09050000
*                                    "XTP7INIT")                        09060000
*                                     0 = DO NOT USE SIDE AND EDGE      09070000
*                                         SENSITIVITY                   09080000
*                                     1 = ACTIVATE SIDE AND EDGE        09090000
*                                         SENSITIVITY            @39A   09100000
XTP7IMSG EQU   X'20'                INTERVENTION MESSAGE FLAG           09110000
*                                   (VALID ONLY ON INIT CALL            09120000
*                                    "XTP7INIT")                        09130000
*                                     0 = DO NOT DISPLAY THE            09140000
*                                         INTERVENTION MESSAGE ON       09150000
*                                         THE OPERATOR CONSOLE          09160000
*                                     1 = DISPLAY THE INTERVENTION      09170000
*                                         MESSAGE ON THE OPERATOR       09180000
*                                         CONSOLE                @40A   09190000
XTP7PJO  EQU   X'10'                PRINTJOB FINISHING OFF              09200000
*                                   (VALID FOR BDS "XTP7BDS"            09210000
*                                    AND EDS "XTP7EDS")          @ITC   09220000
*                                     0 = DO NOT ALTER PRINTJOB         09230000
*                                         FINISHING SETTING             09240000
*                                     1 = SET PRINTJOB FINISHING        09250000
*                                         OFF                    @41A   09260000
XTP7CPPP EQU   X'08'                CSE PRESERVE PAGE PLACEMENT         09270000
*                                   (VALID ONLY ON INIT CALL            09280000
*                                    "XTP7INIT")                        09290000
*                                     0 = DO NOT PRESERVE PAGE          09300000
*                                        PLACEMENT ACROSS REPOSITIONS   09310000
*                                     1 = PRESERVE PAGE PLACEMENTS      09320000
*                                        ACROSS REPOSITIONS      @42A   09330000
XTP7LCNT EQU   X'04'                USE LINE COUNT (LINECT) IN LINE     09340000
*                                   MODE MIGRATION FOR CALCULATING      09350000
*                                   THE NUMBER OF LINES ON A PAGE       09360000
*                                   (VALID ONLY ON INIT CALL            09370000
*                                    "XTP7INIT")                        09380000
*                                     0 = DO NOT USE LINECT             09390000
*                                     1 = USE LINECT             @43A   09400000
XTP7HLCF EQU   X'02'                HIGHLIGHT COMMUNICATIONS FAILURE    09410000
*                                   MESSAGE APS6501A                    09420000
*                                   (VALID ONLY ON INIT CALL            09430000
*                                    "XTP7INIT")                        09440000
*                                     0 = DO NOT HIGHLIGHT              09450000
*                                     1 = HIGHLIGHT MESSAGE      @45A   09460000
XTP7LMCM EQU   X'01'                ALLOW LINE MODE                     09470000
*                                   CONVERSION MESSAGE APS973I          09480000
*                                   IN AFP DOWNLOAD PLUS                09490000
*                                   (VALID ONLY ON INIT CALL            09500000
*                                    "XTP7INIT")                        09510000
*                                     0 = DO NOT ALLOW MESSAGE          09520000
*                                     1 = ALLOW MESSAGE          @46A   09530000
         DS    CL24                 RESERVED                     @39C   09540000
*********************************************************************   09550000
*         THE FOLLOWING FIELDS ARE USED FOR INSTALLATION EXIT 08        09560000
*         (MIGRATION EXIT)                                       @35A   09570000
*********************************************************************   09580000
XTP8     DSECT                                                          09590000
XTP8FLAG DS    CL1                  Exit08 Flags                 @35A   09600000
XTP8MIG  EQU   X'80'                Do line mode migration flag for a   09610000
*                                   4245 FCB (FCB2).                    09620000
*                                   When this flag is set on,           09630000
*                                   line mode migration is activated    09640000
*                                   for a 4245 FCB (FCB2).              09650000
*                                   This flag is reset when             09660000
*                                   exit 08 is called.           @EXC   09670000
XTP8MIG4 EQU   X'40'                Do line mode migration flag for a   09680000
*                                   4248 FCB (FCB4).                    09690000
*                                   When this flag is set on,           09700000
*                                   line mode migration is activated    09710000
*                                   for a 4248 FCB (FCB4).              09720000
*                                   This flag is reset when             09730000
*                                   exit 08 is called.           @EXA   09740000
XTP8PBSP EQU   X'20'                Honor page boundary spacing.        09750000
*                                   When this flag is set on,           09760000
*                                   page boundary spacing will be       09770000
*                                   honored in line mode migration      09780000
*                                   This flag is reset when             09790000
*                                   exit 08 is called.           @44A   09800000
         DS    CL9                  Reserved                     @35A   09810000
         POP   PRINT                                                    09820000
         MEND  , -  */                                                  09830000
*@SPACE;                                                                09840000
*  %XTPDCL: ;                                                           09850000
*DCL 1 APSGEXTP BASED,              /* PSF EXIT PARAMETER AREA       */ 09860000
*      /* THE FOLLOWING FIELDS PROVIDE INPUT TO THE INSTALLATION     */ 09870000
*      /* EXIT PROCESSOR ROUTINES.                                   */ 09880000
*      3 XTPECAP    PTR (31),       /* EXIT COMMUNICATIONS AREA ADDR.*/ 09890000
*      3 XTPJSPAP   PTR (31),       /* PTR TO JES SEPARATOR PAGE AREA   09900000
*                                      OF THE LAST DATA SET (WITH       09910000
*                                    A SEPARATOR, MIGHT BE ZERO)     */ 09920000
*      3 XTPRECP    PTR (31),       /* PTR TO INPUT RECORD           */ 09930000
*      3 XTPRECL    FIXED(31),      /* INPUT RECORD LENGTH           */ 09940000
*      /* THE FOLLOWING FIELDS WILL BE SET BY THE INSTALLATION       */ 09950000
*      /* EXIT PROCESSOR ROUTINES IN ORDER TO PROVIDE AN INTERFACE   */ 09960000
*      /* BACK TO PSF.  ON INPUT TO PROCESSORS XTPRIXP WLL POINT     */ 09970000
*      /* TO A RECORD INDEX ENTRY.  ON OUTPUT, IF THE PROCESOR       */ 09980000
*      /* INDICATES 'WRITE INDEX', XTPRIXP MUST POINT TO THE NEWLY   */ 09990000
*      /* CREATED INDEX HEADER.                                      */ 10000000
*      3 *          CHAR(4),        /* RESERVED                  @D2A*/ 10010000
*      3 XTPRIXP    PTR (31),       /* PTR TO RECORD TABLE INDEX     */ 10020000
*      3 XTPPIND    FIXED(8),       /* PROCESSING INDICATOR          */ 10030000
*      3 XTP4FLAG BIT(8),           /* EXIT04 EOT BIT FLAGS      @H2A*/ 10040000
*        5 XTP4NTY BIT(1),          /* NOTIFY EXIT4 OF EOT       @H2A*/ 10050000
*        5 XTP4NEOT BIT(1),         /* NORMAL EOT FLAG           @H2A*/ 10060000
*        5 XTP4ABNE BIT(1),         /* ABNORMAL EOT FLAG         @H2A*/ 10070000
*        5 XTP4NCAL BIT(1),         /* EXIT 04 NO CALL FLAG -    @CNA*/ 10080000
*                                   /* WHEN THIS FLAG IS SET ON  @CNA*/ 10090000
*                                   /* THEN EXIT 04 WILL NO      @CNA*/ 10100000
*                                   /* LONGER BE CALLED AGAIN    @CNA*/ 10110000
*                                   /* UNTIL EOT OR THE NEXT     @CNA*/ 10120000
*                                   /* COPY OF THE DATA SET      @CNA*/ 10130000
*                                   /* OR THE NEXT DATA SET.     @CNA*/ 10140000
*                                   /* THIS FLAG IS RESET        @CNA*/ 10150000
*                                   /* WHEN EXIT 04 IS CALLED FOR@CNA*/ 10160000
*                                   /* THE FIRST RECORD OF THE   @CNA*/ 10170000
*                                   /* NEXT COPY OF THE DATA SET @CNA*/ 10180000
*                                   /* OR THE NEXT DATA SET.     @CNA*/ 10190000
*        5 XTP4CONV BIT(1),         /* DO CONVERSION FLAG  -     @CNA*/ 10200000
*                                   /* THIS FLAG IS RESET WHEN   @DDA*/ 10210000
*                                   /* EXIT 04/14 IS CALLED      @18C*/ 10220000
*                                   /* FOR THE FIRST RECORD OF   @DDA*/ 10230000
*                                   /* THE TRANSMISSION.         @DDA*/ 10240000
*                                   /* WHEN THIS FLAG IS SET ON, @18A*/ 10250000
*                                   /* 3800 LINE MODE CONVERSION @18A*/ 10260000
*                                   /* IS ACTIVATED.             @18A*/ 10270000
*        5 XTP4WINA BIT(1),         /* WIDE OR NARROW PAPER FLAG @DDA*/ 10280000
*                                   /* THIS FLAG IS ONLY VALID   @DDA*/ 10290000
*                                   /* WHEN XTP4CONV IS SET ON   @DDA*/ 10300000
*                                   /* (3800 LINE MODE CONVERSION@DDA*/ 10310000
*                                   /* IS ACTIVE) AND THE PRINTER@DDA*/ 10320000
*                                   /* IS IN CUT SHEET EMULATION @DDA*/ 10330000
*                                   /* MODE. THIS FLAG IS RESET  @DDA*/ 10340000
*                                   /* WHEN EXIT 04/14 IS CALLED @18C*/ 10350000
*                                   /* FOR THE FIRST RECORD OF   @DDA*/ 10360000
*                                   /* THE TRANSMISSION (NEXT    @DDA*/ 10370000
*                                   /* COPY OF THE DATA SET      @DDA*/ 10380000
*                                   /* OR THE NEXT DATA SET).    @DDA*/ 10390000
*                                   /* WHEN THIS FLAG IS SET     @DDA*/ 10400000
*                                   /* ON, THEN LANDSCAPE PAGES  @DDA*/ 10410000
*                                   /* WILL BE GENERATED FOR     @DDA*/ 10420000
*                                   /* PRINTING IN CUT SHEET     @DDA*/ 10430000
*                                   /* EMULATION MODE.           @DDA*/ 10440000
*                                   /* WHEN THIS FLAG IS SET     @DDA*/ 10450000
*                                   /* OFF, THEN PORTRAIT PAGES  @DDA*/ 10460000
*                                   /* WILL BE GENERATED FOR     @DDA*/ 10470000
*                                   /* PRINTING IN CUT SHEET     @DDA*/ 10480000
*                                   /* EMULATION MODE.           @DDA*/ 10490000
*        5 XTP4LMRG BIT(1),         /* LINE MERGE FLAG -         @18A*/ 10500000
*                                   /* WHEN THIS FLAG IS SET ON, @18A*/ 10510000
*                                   /* PSF WILL PERFORM THE LINE @18A*/ 10520000
*                                   /* MERGE FUNCTION LIKE THE   @18A*/ 10530000
*                                   /* 3800 PRINTER IN "LINE     @18A*/ 10540000
*                                   /* MODE".                    @18A*/ 10550000
*                                   /* THIS FLAG IS ONLY VALID   @18A*/ 10560000
*                                   /* WHEN XTP4CONV IS SET ON   @18A*/ 10570000
*                                   /* (3800 LINE MODE CONVERSION@18A*/ 10580000
*                                   /* IS ACTIVE).               @18A*/ 10590000
*                                   /* THIS FLAG IS RESET WHEN   @18A*/ 10600000
*                                   /* EXIT 04/14 IS CALLED      @18A*/ 10610000
*                                   /* FOR THE FIRST RECORD OF   @18A*/ 10620000
*                                   /* THE TRANSMISSION.         @18A*/ 10630000
*        5 * BIT(1),                /* RESERVED                  @18C*/ 10640000
*      3 *          CHAR(4),        /* RESERVED                  @D2A*/ 10650000
*      3 XTP5FLAG BIT(8),           /* EXIT05 SMF 6 FLAGS        @L1A*/ 10660000
*        5 XTP5NEWS BIT(1),         /* PROCESSING JESNEWS DS     @L1A*/ 10670000
*      3 XTP4DPLX   FIXED(8),       /* DUPLEX VALUE -            @18C*/ 10680000
*                                   /* 0 = NOT SPECIFIED         @18A*/ 10690000
*                                   /*     (DEFAULTS TO FORMDEF  @18A*/ 10700000
*                                   /*      VALUE)               @18A*/ 10710000
*                                   /* 1 = SIMPLEX               @18A*/ 10720000
*                                   /* 2 = NORMAL DUPLEX         @18A*/ 10730000
*                                   /* 3 = TUMBLE DUPLEX         @18A*/ 10740000
*                                   /* THIS FIELD IS SET TO ZERO @18A*/ 10750000
*                                   /* WHEN EXIT 04/14 IS CALLED @18A*/ 10760000
*                                   /* FOR THE FIRST RECORD OF   @18A*/ 10770000
*                                   /* THE TRANSMISSION.         @18A*/ 10780000
*                                   /* THIS FIELD IS ONLY        @18A*/ 10790000
*                                   /* VALID WHEN XTP4CONV IS    @18A*/ 10800000
*                                   /* SET ON (3800 LINE MODE    @18A*/ 10810000
*                                   /* CONVERSION IS ACTIVE).    @18A*/ 10820000
*      3 XTP4XOFF   BINARY(16),     /* HORIZONTAL OFFSET VALUE - @CNA*/ 10830000
*                                   /* PELS AT 240 PELS/INCH.    @CNA*/ 10840000
*                                   /* ONLY VALID WHEN XTP4CONV  @CNA*/ 10850000
*                                   /* IS SET ON.                @CNA*/ 10860000
*      3 XTP4YOFF   BINARY(16),     /* VERTICAL OFFSET VALUE -   @CNA*/ 10870000
*                                   /* PELS AT 240 PELS/INCH.    @CNA*/ 10880000
*                                   /* ONLY VALID WHEN XTP4CONV  @CNA*/ 10890000
*                                   /* IS SET ON.                @CNA*/ 10900000
*      3 *          CHAR(4);        /* RESERVED                  @D2A*/ 10910000
*DCL 1 XTP6 BASED(XTPRECP),         /* EXIT06 INPUT RECORD           */ 10920000
*      /* THE FOLLOWING FIELDS PROVIDE INPUT TO THE INSTALLATION     */ 10930000
*      /* EXIT06 (MESSAGE EXIT).                                     */ 10940000
*      3 XTP6PROC CHAR(8),          /* FSA identifier. The label @33C*/ 10950000
*                                   /* of the PRINTDEV statement @33A*/ 10960000
*      3 XTP6MSG  CHAR(8),          /* MESSAGE ID (APSXXXXI)     @DNC*/ 10970000
*      3 XTP6TYPE CHAR(1),          /* MESSAGE TYPE                  */ 10980000
*                                   /* W=WTO, MOST WTO MESSAGES ARE  */ 10990000
*                                   /* ASYNCRONOUS.  ASYNC MESSAGES  */ 11000000
*                                   /* BELONG TO THE DATASET ON THE  */ 11010000
*                                   /* PRINTER WHICH MAY BE DIFFERENT*/ 11020000
*                                   /* FROM THE ONE BEING PROCESSED  */ 11030000
*                                   /* BY PSF.  XTPJSPAP POINTS TO   */ 11040000
*                                   /* THE JSPA RELATED TO THE       */ 11050000
*                                   /* CURRENT DATASET BEING         */ 11060000
*                                   /* PROCESSED BY PSF              */ 11070000
*                                   /* P=PAPER, MESSAGES PRINTED ON  */ 11080000
*                                   /* PAPER ARE SYNC MESSAGES   @03C*/ 11090000
*      3 XTP6FLAG BIT(8),           /* MESSAGE FLAGS             @EJA*/ 11100000
*        5 XTP6INTP BIT(1),         /* MESSAGE TARGETED FOR THE  @EJA*/ 11110000
*                                   /* INTERRUPT MESSAGE PAGE    @EJA*/ 11120000
*        5 *        BIT(7),         /* RESERVED                  @EJA*/ 11130000
*    /* THE FOLLOWING FIELDS ARE SET BY EXIT06                       */ 11140000
*   3 XTP6FLG1 CHAR(1),             /*                           @03A*/ 11150000
*     5 XTP6TFSA BIT(1),            /* TERMINATE FSA - PSF WILL      */ 11160000
*                                   /* COMPLETE THE PROCESSING OF    */ 11170000
*                                   /* THE CURRENT DATASET (THE ONE  */ 11180000
*                                   /* BEING PROCESSED BY PSF WHICH  */ 11190000
*                                   /* MAY BE DIFFERENT FROM THE ONE */ 11200000
*                                   /* ON THE PRINTER) AND TERMINATE */ 11210000
*                                   /* THE FSA                   @03A*/ 11220000
*     5 XTP6HOLD BIT(1),            /* RELEASE THE DATASET CURRENTLY */ 11230000
*                                   /* BEING PROCESSED BY PSF TO JES */ 11240000
*                                   /* HOLD QUEUE WHEN THE DATASET IS*/ 11250000
*                                   /* STACKED                   @03A*/ 11260000
*     5 XTP6TJOB BIT(1),            /* TERMINATE THE JOB ASSOCIATED  */ 11270000
*                                   /* WITH THE INTERRUPT MESSAGE    */ 11280000
*                                   /* PAGE                      @EJA*/ 11290000
*     5 * BIT(5),                   /* RESERVED                  @EJC*/ 11300000
*   3 XTP6ACT BIT(8),               /* ACTION TO BE TAKEN ON MSG @H7A*/ 11310000
*                                   /* SET BY PSF ON INPUT       @H7A*/ 11320000
*                                   /* CAN BE ALTERED BY EXIT    @H7A*/ 11330000
*     5 XTP6WTO BIT(1),             /*   PUT MSG TO OP. CONSOLE  @H7A*/ 11340000
*     5 XTP6SEC BIT(1),             /*   PUT MSG TO SEC. CONSOLE @H7A*/ 11350000
*     5 XTP6PAP BIT(1),             /*   PUT MSG TO PAPER        @H7A*/ 11360000
*     5 *        BIT(5),            /*   RESERVED                @H7A*/ 11370000
*   3 *         CHAR(4);            /* RESERVED                  @EJC*/ 11380000
*                                                                       11390000
*/********************************************************************/ 11400000
*/*         THE FOLLOWING FIELDS PROVIDE INPUT TO THE INSTALLATION   */ 11410000
*/*         EXIT07 (RESOURCE EXIT).                              @U7A*/ 11420000
*/********************************************************************/ 11430000
*DECLARE                                                                11440000
* 1 XTP7 BASED(XTPRECP),                                      /* @U7A*/ 11450000
*   3 XTP7CID  CHAR(4),             /* CONTROL BLOCK ID = 'XTP7' @U7A*/ 11460000
*   3 XTP7LENG FIXED(31),           /* LENGTH OF XTP7 AREA       @U7A*/ 11470000
*   3 XTP7ETYP BIT(16),             /* FLAGS SET BY PSF - INDICATES     11480000
*                                      TO APSUX07 THE TYPE OF EXIT      11490000
*                                      CALL BEING MADE.          @U7A*/ 11500000
*     5 XTP7INIT BIT(1),            /* INITIALIZATION EXIT       @U7A*/ 11510000
*     5 XTP7BDS  BIT(1),            /* BEGINNING OF DATA SET     @U7A*/ 11520000
*     5 XTP7ACC  BIT(1),            /* RESOURCE ACCESS TIME EXIT @U7A*/ 11530000
*     5 XTP7LDB  BIT(1),            /* LOAD BEGIN EXIT           @U7A*/ 11540000
*     5 XTP7LDE  BIT(1),            /* LOAD END EXIT             @U7A*/ 11550000
*     5 XTP7DSE  BIT(1),            /* Resource delete call      @ITC*/ 11560000
*     5 XTP7TERM BIT(1),            /* TERMINATION OF FSA        @U7A*/ 11570000
*     5 XTP7EDS  BIT(1),            /* End of data set           @ITA*/ 11580000
*     5 *        BIT(8),            /* RESERVED                  @ITC*/ 11590000
*   3 XTP7RTYP BIT(16),             /* FLAGS SET BY PSF - INDICATES     11600000
*                                      TO APSUX07 THE TYPE OF RESOURCE  11610000
*                                      CURRENTLY BEING PROCESSED @U7A*/ 11620000
*     5 XTP7PD   BIT(1),            /* PAGEDEF                   @U7A*/ 11630000
*     5 XTP7FD   BIT(1),            /* FORMDEF                   @U7A*/ 11640000
*     5 XTP7CF   BIT(1),            /* CODED FONT                @U7A*/ 11650000
*     5 XTP7MO   BIT(1),            /* OVERLAY                   @U7A*/ 11660000
*     5 XTP7PS   BIT(1),            /* PAGE SEGMENT/OCA          @19C*/ 11670000
*     5 XTP7OC   BIT(1),            /* OBJECT CONTAINER          @DEA*/ 11680000
*     5 *        BIT(10),           /* RESERVED                  @DEC*/ 11690000
*   3 XTP7DSTY BIT(8),              /* FLAGS SET BY PSF - INDICATES     11700000
*                                      TO APSUX07 THE TYPE OF DATA SET  11710000
*                                      CURRENTLY BEING PROCESSED @U7A*/ 11720000
*     5 XTP7AUX  BIT(1),            /* PROCESSING SYSTEM DEFAULT OR     11730000
*                                      FOR AUXILIARY DATA SETS   @U7A*/ 11740000
*     5 XTP7PDS  BIT(1),            /* PRINT DATA SET            @U7A*/ 11750000
*     5 *        BIT(6),            /* RESERVED                  @U7A*/ 11760000
*   3 XTP7DSAT BIT(8),              /* FLAGS SET BY PSF - ATTRIBUTES    11770000
*                                      OF THE DATA SET CURRENTLY        11780000
*                                      BEING PROCESSED           @U7A*/ 11790000
*     5 XTP7PDFT BIT(1),            /* SYSTEM DEFAULT            @U7A*/ 11800000
*     5 XTP7PJHD BIT(1),            /* JOB HEADER                @U7A*/ 11810000
*     5 XTP7PJTR BIT(1),            /* JOB TRAILER               @U7A*/ 11820000
*     5 XTP7PDSH BIT(1),            /* DATA SET HEADER           @U7A*/ 11830000
*     5 XTP7PMDS BIT(1),            /* MESSAGE DATA SET          @U7A*/ 11840000
*     5 XTP7PLDS BIT(1),            /* LAST PRINT DATA SET IN JOB       11850000
*                                      - BDS & DSE EXITS ONLY    @U7A*/ 11860000
*     5 *        BIT(2),            /* RESERVED                  @U7A*/ 11870000
*   3 XTP7ACSE   FIXED(8),          /* AUTOMATIC CUT SHEET EMULATION    11880000
*                                      CHECKING                         11890000
*                                      (VALID FOR INITIALIZATION        11900000
*                                       "XTP7INIT", BDS "XTP7BDS",      11910000
*                                       AND EDS "XTP7EDS")       @ITC*/ 11920000
*   3 XTP7IPCC   FIXED(8),          /* NUMBER OF COPIES OF THE          11930000
*                                      INTERRUPT MESSAGE PAGE TO PRO-   11940000
*                                      DUCE.                            11950000
*                                      - ONLY VALID WITH XTP7IPMF       11960000
*                                      - IGNORED FOR THE 3800           11970000
*                                      DOMAIN: 1 - 10            @08A*/ 11980000
*   3 XTP7NOTY BIT(32),             /* NOTIFICATION FLAGS - SET BY      11990000
*                                      APSUX07, INDICATES TO PSF WHEN   12000000
*                                      THE EXIT WANTS CONTROL    @U7A*/ 12010000
*     5 XTP7MISC BIT(8),            /* MISCELLANEOUS TYPE EXITS  @U7A*/ 12020000
*       7 XTP7EBDS BIT(1),          /* BEGINNING OF DATA SET     @U7A*/ 12030000
*       7 XTP7ETRM BIT(1),          /* TERMINATION OF FSA        @U7A*/ 12040000
*       7 XTP7EEDS BIT(1),          /* End of data set           @ITA*/ 12050000
*       7 *        BIT(5),          /* RESERVED                  @ITC*/ 12060000
*     5 XTP7NACC BIT(8),            /* ACCESS TIME EXITS         @U7A*/ 12070000
*       7 XTP7APD  BIT(1),          /* PAGEDEFS                  @U7A*/ 12080000
*       7 XTP7AFD  BIT(1),          /* FORMDEFS                  @U7A*/ 12090000
*       7 XTP7ACF  BIT(1),          /* CODED FONTS               @U7A*/ 12100000
*       7 XTP7AMO  BIT(1),          /* MEDIUM OVERLAYS           @U7A*/ 12110000
*       7 XTP7APS  BIT(1),          /* PAGE SEGMENT/OCA          @19C*/ 12120000
*       7 XTP7AOC  BIT(1),          /* OBJECT CONTAINERS         @DEA*/ 12130000
*       7 *        BIT(2),          /* RESERVED                  @DEC*/ 12140000
*     5 XTP7NLD  BIT(8),            /* LOAD TIME EXITS           @U7A*/ 12150000
*       7 XTP7LPD  BIT(1),          /* PAGEDEFS                  @U7A*/ 12160000
*       7 XTP7LFD  BIT(1),          /* FORMDEFS                  @U7A*/ 12170000
*       7 XTP7LCF  BIT(1),          /* CODED FONTS               @U7A*/ 12180000
*       7 XTP7LMO  BIT(1),          /* MEDIUM OVERLAYS           @U7A*/ 12190000
*       7 XTP7LPS  BIT(1),          /* PAGE SEGMENT/OCA          @19C*/ 12200000
*       7 XTP7LOC  BIT(1),          /* OBJECT CONTAINERS         @DEA*/ 12210000
*       7 *        BIT(2),          /* RESERVED                  @DEC*/ 12220000
*     5 XTP7NDEL BIT(8),            /* DELETE TIME (DSE) EXITS   @U7A*/ 12230000
*       7 XTP7DPD  BIT(1),          /* PAGEDEFS                  @U7A*/ 12240000
*       7 XTP7DFD  BIT(1),          /* FORMDEFS                  @U7A*/ 12250000
*       7 XTP7DCF  BIT(1),          /* CODED FONTS               @U7A*/ 12260000
*       7 XTP7DMO  BIT(1),          /* MEDIUM OVERLAYS           @U7A*/ 12270000
*       7 XTP7DPS  BIT(1),          /* PAGE SEGMENT/OCA          @19C*/ 12280000
*       7 XTP7DOC  BIT(1),          /* OBJECT CONTAINERS         @DEA*/ 12290000
*       7 *        BIT(2),          /* RESERVED                  @DEC*/ 12300000
*   3 XTP7RFLG BIT(16),             /* RESPONSE FLAGS            @U7A*/ 12310000
*     7 XTP7ETFF BIT(1),            /* EJECT TO FRONT FACING            12320000
*                                      BETWEEN DOCUMENTS:               12330000
*                                      (VALID FOR INITIALIZATION        12340000
*                                       "XTP7INIT", BDS "XTP7BDS",      12350000
*                                       AND EDS "XTP7EDS")       @ITC   12360000
*                                        0 = ETFF ACTIVE                12370000
*                                        1 = BYPASS ETFF         @02C*/ 12380000
*     7 XTP7TDS  BIT(1),            /* TERMINATE THE DATA SET           12390000
*                                        0 = DO NOT TERMINATE           12400000
*                                        1 = TERMINATE           @U7A*/ 12410000
*     7 XTP7EFFH BIT(1),            /* EJECT TO FRONT FACING            12420000
*                                      BEFORE JOB HEADER:               12430000
*                                      (VALID FOR INITIALIZATION        12440000
*                                       "XTP7INIT", BDS "XTP7BDS",      12450000
*                                       AND EDS "XTP7EDS")       @ITC   12460000
*                                        0 = ETFF ACTIVE                12470000
*                                        1 = BYPASS ETFF         @02A*/ 12480000
*     7 XTP7HDF  BIT(1),            /* SELECT HARDWARE DEFAULT FONT     12490000
*                                      (VALID FOR 3800 ONLY)            12500000
*                                        0 = USE HARDWARE DEFAULT       12510000
*                                        1 = USE 1ST FONT MAPPED @06A*/ 12520000
*     7 XTP7HQUE BIT(1),            /* SEND DATA SET TO HOLD QUEUE      12530000
*                                      (VALID ONLY WHEN DATA SET        12540000
*                                       TERMINATED BY XTP7TDS)          12550000
*                                        0 = PURGE THE DATA SET         12560000
*                                        1 = TO HOLD QUEUE       @05A*/ 12570000
*     7 XTP7PRNS BIT(1),            /* SINGLE BYTE FONT PRUNING FLAG    12580000
*                                      (VALID ONLY ON INITIALIZATION    12590000
*                                       CALL "XTP7INIT")                12600000
*                                       0 = PRUNE SINGLE BYTE FONTS     12610000
*                                       1 = BYPASS PRUNING       @H7A*/ 12620000
*     7 XTP7PRND BIT(1),            /* DOUBLE BYTE FONT PRUNING FLAG    12630000
*                                      (VALID ONLY ON INITIALIZATION    12640000
*                                       CALL "XTP7INIT")                12650000
*                                       0 = PRUNE DOUBLE BYTE FONTS     12660000
*                                       1 = BYPASS PRUNING       @H7A*/ 12670000
*     7 XTP7IPMF BIT(1),            /* MARK FORM REQUEST                12680000
*                                      (VALID FOR INITIALIZATION        12690000
*                                       "XTP7INIT", BDS "XTP7BDS",      12700000
*                                       AND EDS "XTP7EDS")       @ITC   12710000
*                                      SEE XTP7IPCC FOR COPIES.         12720000
*                                      1 = MARK INTERRUPT MESSAGE PAGE  12730000
*                                      0 = NO MARKING OF INTERRUPT PAGE 12740000
*                                                                @08A*/ 12750000
*     7 XTP7IPOS BIT(1),            /* OFFSET STACK INTERRUPT MESSAGE   12760000
*                                      PAGE.                            12770000
*                                      (VALID FOR INITIALIZATION        12780000
*                                       "XTP7INIT", BDS "XTP7BDS",      12790000
*                                       AND EDS "XTP7EDS")       @ITC   12800000
*                                      1 = OFFSET STACKING              12810000
*                                      0 = NO OFFSET STACKING           12820000
*                                                                @08A*/ 12830000
*     7 XTP7MTOF BIT(1),            /* MAP FONTS TO OUTLINE FONTS       12840000
*                                      (VALID ONLY ON INITIALIZATION    12850000
*                                      CALL "XTP7INIT").                12860000
*                                      1 = MAP FONTS TO OUTLINE         12870000
*                                          FONTS                        12880000
*                                      0 = DO NOT MAP FONTS TO          12890000
*                                          OUTLINE FONTS                12900000
*                                                                @11A*/ 12910000
*     7 XTP7RFNF BIT(1),            /* RECOVER FROM FONT-NOT-FOUND      12920000
*                                      CONDITIONS (VALID ONLY ON        12930000
*                                      INITIALIZATION, CALL "XTP7INIT") 12940000
*                                      1 = QUERY THE HOST FONT          12950000
*                                          LIBRARIES FOR THE MAPPED     12960000
*                                          FONT.  IF THE MAPPED FONT    12970000
*                                          DOES NOT EXIST, GO BACK      12980000
*                                          AND USE THE ORIGINAL FONT.   12990000
*                                          NOTE:  DUE TO THE ADDITIONAL 13000000
*                                          LIBRARY QUERIES FOR EVERY    13010000
*                                          FONT RESOURCE, PERFORMANCE   13020000
*                                          WILL BE DEGRADED IF THIS     13030000
*                                          OPTION IS TURNED ON.         13040000
*                                      0 = DO NOT QUERY THE HOST FONT   13050000
*                                          LIBRARIES TO ENSURE THAT     13060000
*                                          THE MAPPED FONT ACTUALLY     13070000
*                                          EXISTS.               @11A*/ 13080000
*     /* delete space reserved for above flags                  1@11D*/ 13090000
*     7 XTP7IPSU BIT(1),            /* SUPPRESS INTERRUPT MESSAGE       13100000
*                                      PAGES                            13110000
*                                      (VALID FOR INITIALIZATION        13120000
*                                       "XTP7INIT")                     13130000
*                                      1 = SUPPRESS INT MSG PAGES       13140000
*                                      0 = ALLOW INT MSG PAGES          13150000
*                                                                @09A*/ 13160000
*     7 XTP738MO BIT(1),            /* SET 3900 MEDIA ORIGIN TO 3800    13170000
*                                      MEDIA ORIGIN FOR THE USER'S      13180000
*                                      DATASET                          13190000
*                                      (VALID FOR INITIALIZATION        13200000
*                                       "XTP7INIT", BDS "XTP7BDS",      13210000
*                                       AND EDS "XTP7EDS")       @ITC   13220000
*                                      1 = SET 3900 MEDIA ORIGIN        13230000
*                                          TO 3800 MEDIA ORIGIN         13240000
*                                      0 = DO NOT SET 3900 MEDIA        13250000
*                                          ORIGIN                       13260000
*                                                                @16A*/ 13270000
*                                                                       13280000
*     7 XTP7MDSD BIT(1),            /* SEND THE MESSAGE DATASET TO A    13290000
*                                      SYSOUT DATASET                   13300000
*                                      (VALID FOR INITIALIZATION        13310000
*                                       "XTP7INIT", BDS "XTP7BDS",      13320000
*                                       AND EDS "XTP7EDS")       @ITC   13330000
*                                      1 = SEND MSG DATASET TO          13340000
*                                          A SYSOUT DATASET             13350000
*                                      0 = DO NOT SEND MSG DATASET      13360000
*                                          TO A SYSOUT DATASET          13370000
*                                                                @DFA*/ 13380000
*                                                                       13390000
*/***************************************************************@EZA*/ 13400000
*/*   7 XTP7HCA  BIT(1),               Decommission Huffman code @EZC*/ 13410000
*/***************************************************************@EZA*/ 13420000
*                                                                       13430000
*     7 *        BIT(1),            /* Reserved - do not use     @EZA*/ 13440000
*                                                                       13450000
*     7 XTP7C2SI BIT(1),            /* CONVERT A MULTIPLE CELLED        13460000
*                                      IM1 IMAGE TO A SINGLE IOCA IMAGE 13470000
*                                      (VALID FOR INITIALIZATION        13480000
*                                       "XTP7INIT", BDS "XTP7BDS",      13490000
*                                       AND EDS "XTP7EDS")       @ITC   13500000
*                                        1 = CONVERT TO SINGLE          13510000
*                                            IOCA IMAGE                 13520000
*                                        0 = CONVERT TO MULTIPLE        13530000
*                                            IOCA IMAGES         @15A*/ 13540000
*                                   /* DELETED 1 LINE            @15D*/ 13550000
*   3 XTP7RRLV,                     /* REASONABLE RESOURCE LOADED       13560000
*                                      VALUE                     @U7A*/ 13570000
*     5 XTP7RPD  FIXED(15),         /* RRLV FOR PAGEDEFS         @U7A*/ 13580000
*     5 XTP7RFD  FIXED(15),         /* RRLV FOR FORMDEFS         @U7A*/ 13590000
*     5 XTP7RMO  FIXED(15),         /* RRLV FOR OVERLAYS         @U7A*/ 13600000
*     5 XTP7RPS  FIXED(15),         /* RRLV FOR PAGE SEGMENT/OCA @19C*/ 13610000
*     5 XTP7RCF  FIXED(15),         /* RRLV FOR FONTS            @U7A*/ 13620000
*     5 XTP7ROC  FIXED(15),         /* RRLV FOR OBJ CONTAINERS   @DEA*/ 13630000
*     5 *        CHAR(2),           /* RESERVED                  @DEC*/ 13640000
*   3 XTP7RLST,                     /* APSURLST INFORMATION      @U7A*/ 13650000
*     5 XTP7LSTP PTR(31),           /* POINTER TO APSURLST       @U7A*/ 13660000
*     5 XTP7RESC FIXED(15),         /* RESOURCE COUNT - # OF DISTINCT   13670000
*                                      RESOURCES IN RLST CHAIN   @U7A*/ 13680000
*     5 XTP7LSTC FIXED(15),         /* LIST COUNT - # OF ENTRIES IN     13690000
*                                      RLST CHAIN                @U7A*/ 13700000
*   3 XTP7OVLY CHAR(8),             /* NAME OF OVERLAY CURRENTLY        13710000
*                                      BEING PROCESSED           @U7A*/ 13720000
*   3 XTP7PINF,                     /* PRINTER INFORMATION       @U7C*/ 13730000
*     5 XTP7PRT  CHAR(8),           /* PRINTER TYPE AND MODEL    @11C*/ 13740000
*       7 XTP7ATCH CHAR(1),         /* ATTACHMENT TYPE           @U7A*/ 13750000
*       7 XTP7FMLY CHAR(4),         /* DEVICE FAMILY             @U7A*/ 13760000
*       7 XTP7PRTT CHAR(2),         /* DEVICE TYPE               @U7A*/ 13770000
*       7 XTP7PRTM CHAR(1),         /* MODEL NUMBER              @U7A*/ 13780000
*     5 XTP7PFLG BIT(8),            /* PRINTER FLAGS             @11C*/ 13790000
*       7 XTP7PSEC BIT(1),          /* SECURE PRINTER            @11C*/ 13800000
*       7 *        BIT(7),          /* RESERVED                  @11C*/ 13810000
*     5 *        CHAR(3),           /* RESERVED                  @11C*/ 13820000
*     5 XTP7PNAM CHAR(8),           /* PRINTER NAME              @U7A*/ 13830000
*   3 *,                            /* MESSAGE INSERT INFORMATION -     13840000
*                                      POINTER & LENGTH OF TEXT FOR     13850000
*                                      OPTIONAL MESSAGE INSERT FOR      13860000
*                                      APS563I & APS954I         @U7A*/ 13870000
*     5 XTP7MSGP PTR(31),           /* POINTER TO USER SUPPLIED, 64     13880000
*                                      BYTE MESSAGE INSERT       @U7A*/ 13890000
*     5 XTP7MSGL FIXED(8),          /* LENGTH OF INSERT TEXT            13900000
*                                      DOMAIN (0-64)             @U7A*/ 13910000
*     5 *        CHAR(1),           /* RESERVED                  @U7A*/ 13920000
*   3 XTP7CRLF BIT(8),              /* CRL FLAGS -                      13930000
*                                        0 = FREE THE STORAGE           13940000
*                                        1 = KEEP THE CRL        @U7A*/ 13950000
*     5 XTP7CFPD BIT(1),            /* FREE/KEEP PAGEDEF CRL     @U7A*/ 13960000
*     5 XTP7CFFD BIT(1),            /* FREE/KEEP FORMDEF CRL     @U7A*/ 13970000
*     5 XTP7CFCF BIT(1),            /* FREE/KEEP FONT DEFAULT CRL@MRC*/ 13980000
*     5 XTP7CFMO BIT(1),            /* FREE/KEEP OVLY DEFAULT CRL@MRC*/ 13990000
*     5 XTP7CFPS BIT(1),            /* FREE/KEEP SEGMENT/OCA            14000000
*                                                 DEFAULT CRL    @MRC*/ 14010000
*     5 XTP7CSSD BIT(1),            /* FREE/KEEP SECUR. DEFN            14020000
*                                                 DEFAULT CRL    @MRC*/ 14030000
*     5 XTP7CSCF BIT(1),            /* FREE/KEEP SECUR. FONT            14040000
*                                                 DEFAULT CRL    @MRC*/ 14050000
*     5 XTP7CSMO BIT(1),            /* FREE/KEEP SECUR. OVLY            14060000
*                                                 DEFAULT CRL    @MRC*/ 14070000
*   3 XTP7CRF2 BIT(8),              /* CRL FLAGS -                      14080000
*                                        0 = FREE THE STORAGE           14090000
*                                        1 = KEEP THE CRL        @L1C*/ 14100000
*     5 XTP7CSPS BIT(1),            /* FREE/KEEP SECURITY SEG           14110000
*                                                 DEFAULT CRL    @MRC*/ 14120000
*     5 XTP7CFOC BIT(1),            /* FREE/KEEP OBJ CONTAIN CRL @DEA*/ 14130000
*     5 XTP7C2CF BIT(1),            /* FREE/KEEP FONT 240 CRL    @MRA*/ 14140000
*     5 XTP7C3CF BIT(1),            /* FREE/KEEP FONT 300 CRL    @MRA*/ 14150000
*     5 XTP7C2MO BIT(1),            /* FREE/KEEP OVERLAY 240 CRL @MRA*/ 14160000
*     5 XTP7C3MO BIT(1),            /* FREE/KEEP OVERLAY 300 CRL @MRA*/ 14170000
*     5 XTP7C2PS BIT(1),            /* FREE/KEEP SEGMENT/OCA 240        14180000
*                                                             CRL@MRA*/ 14190000
*     5 XTP7C3PS BIT(1),            /* FREE/KEEP SEGMENT/OCA 300        14200000
*                                                             CRL@MRA*/ 14210000
*   3 XTP7CRLP,                     /* POINTERS TO THE CONCATENATION    14220000
*                                      RETRIEVAL LISTS           @U7A*/ 14230000
*     5 XTP7CLPD PTR(31),           /* POINTER TO PAGEDEF CRL    @U7A*/ 14240000
*     5 XTP7CLFD PTR(31),           /* POINTER TO FORMDEF CRL    @U7A*/ 14250000
*     5 XTP7CLCF PTR(31),           /* POINTER TO FONT                  14260000
*                                                 DEFAULT CRL    @MRC*/ 14270000
*     5 XTP7CLMO PTR(31),           /* POINTER TO OVERLAY               14280000
*                                                 DEFAULT CRL    @MRC*/ 14290000
*     5 XTP7CLPS PTR(31),           /* POINTER TO SEGMENT/OCA           14300000
*                                                 DEFAULT CRL    @MRC*/ 14310000
*     5 XTP7CLOC PTR(31),           /* POINTER TO OBJ CONTAIN CRL@DEC*/ 14320000
*     5 XTP7CLSD PTR(31),           /* PTR TO SECURITY DEFN             14330000
*                                                 DEFAULT CRL    @MRC*/ 14340000
*     5 XTP7CLSF PTR(31),           /* PTR TO SECURITY FONT             14350000
*                                                 DEFAULT CRL    @MRC*/ 14360000
*     5 XTP7CLSO PTR(31),           /* PTR TO SECURITY OVLY             14370000
*                                                 DEFAULT CRL    @MRC*/ 14380000
*     5 XTP7CLSP PTR(31),           /* PTR TO SECURITY SGMT             14390000
*                                                 DEFAULT CRL    @MRC*/ 14400000
*   3 XTP7MFLG BIT(8),              /* MORE RESPONSE FLAGS       @16A*/ 14410000
*     5 XTP7JHMO BIT(1),            /* SET THE JOB HEADER MEDIA ORIGIN  14420000
*                                      TO TOP LEFT CORNER               14430000
*                                      (VALID FOR INITIALIZATION        14440000
*                                       "XTP7INIT", BDS "XTP7BDS",      14450000
*                                       AND EDS "XTP7EDS")       @ITC   14460000
*                                         1 = SET JOB HEADER MEDIA      14470000
*                                             ORIGIN TO TOP LEFT        14480000
*                                             CORNER                    14490000
*                                         0 = DO NOT SET JOB HEADER     14500000
*                                             MEDIA ORIGIN       @16A*/ 14510000
*     5 XTP7JTMO BIT(1),            /* SET THE JOB TRAILER MEDIA        14520000
*                                      ORIGIN TO TOP LEFT CORNER        14530000
*                                      (VALID FOR INITIALIZATION        14540000
*                                       "XTP7INIT", BDS "XTP7BDS",      14550000
*                                       AND EDS "XTP7EDS")       @ITC   14560000
*                                         1 = SET JOB TRAILER MEDIA     14570000
*                                             ORIGIN TO TOP LEFT        14580000
*                                             CORNER                    14590000
*                                         0 = DO NOT SET JOB TRAILER    14600000
*                                             MEDIA ORIGIN       @16A*/ 14610000
*     5 XTP7DHMO BIT(1),            /* SET THE DATASET HEADER MEDIA     14620000
*                                      ORIGIN TO TOP LEFT CORNER        14630000
*                                      (VALID FOR INITIALIZATION        14640000
*                                       "XTP7INIT", BDS "XTP7BDS",      14650000
*                                       AND EDS "XTP7EDS")       @ITC   14660000
*                                         1 = SET DATASET HEADER MEDIA  14670000
*                                             ORIGIN TO TOP LEFT        14680000
*                                             CORNER                    14690000
*                                         0 = DO NOT SET DATASET HEADER 14700000
*                                             MEDIA ORIGIN       @16A*/ 14710000
*     5 XTP7MDMO BIT(1),            /* SET THE MESSAGE DATASET MEDIA    14720000
*                                      ORIGIN TO TOP LEFT CORNER        14730000
*                                      (VALID FOR INITIALIZATION        14740000
*                                       "XTP7INIT", BDS "XTP7BDS",      14750000
*                                       AND EDS "XTP7EDS")       @ITC   14760000
*                                         1 = SET MESSAGE DATASET MEDIA 14770000
*                                             ORIGIN TO TOP LEFT        14780000
*                                             CORNER                    14790000
*                                         0 = DO NOT SET MESSAGE        14800000
*                                             DATASET MEDIA ORIGIN      14810000
*                                                                @16A*/ 14820000
*     5 XTP7RSTR BIT(1),            /* ABEND RESTART FLAG               14830000
*                                      (VALID ONLY ON TERMINATION       14840000
*                                       CALL "XTP7TERM")                14850000
*                                        0 = NONRESTARTABLE ABEND       14860000
*                                        1 = RESTARTABLE ABEND   @17A*/ 14870000
*     5 XTP7WIDE BIT(1),            /* WIDE OR NARROW PAPER FLAG        14880000
*                                      (VALID FOR INITIALIZATION        14890000
*                                       "XTP7INIT", BDS "XTP7BDS",      14900000
*                                       AND EDS "XTP7EDS")       @ITC   14910000
*                                      THIS FLAG IS ONLY VALID          14920000
*                                      WHEN ONE OR MORE OF THE          14930000
*                                      3800 MEDIA ORIGIN FLAGS          14940000
*                                      IS SET AND THE PRINTER           14950000
*                                      IS IN CUT SHEET EMULATION        14960000
*                                      MODE.                            14970000
*                                        1 = LANDSCAPE PAGES WILL       14980000
*                                            BE GENERATED FOR           14990000
*                                            PRINTING WHEN IN CUT       15000000
*                                            SHEET EMULATION MODE.      15010000
*                                        0 = PORTRAIT PAGES WILL        15020000
*                                            BE GENERATED FOR           15030000
*                                            PRINTING WHEN IN CUT       15040000
*                                            SHEET EMULATION            15050000
*                                            MODE.               @20A*/ 15060000
*     5 XTP7IHIB BIT(1),            /* INHIBIT RECOVERY                 15070000
*                                      (VALID FOR INITIALIZATION        15080000
*                                       "XTP7INIT", BDS "XTP7BDS",      15090000
*                                       AND EDS "XTP7EDS")       @ITC   15100000
*                                        0 = ALLOW RECOVERY             15110000
*                                        1 = INHIBIT RECOVERY    @IRA*/ 15120000
*     5 XTP7ENDC BIT(1),            /*   END THE SNA LU1 CONVERSATION   15130000
*                                        (VALID ONLY ON INITIALIZATION  15140000
*                                         CALL "XTP7INIT")              15150000
*                                        1 = END SNA LU1 CONVERSATION   15160000
*                                            WITHOUT ENDING THE SESSION 15170000
*                                        0 = ONLY END SNA CONVERSATION  15180000
*                                            WHEN THE SESSION ENDS      15190000
*                                                                @21A*/ 15200000
*   3 XTP7ABRC  BIT(16),            /* ABEND REASON CODE         @17A*/ 15210000
*   3 XTP7JOG   FIXED(8),           /* JOGGING VALUE -                  15220000
*                                      VALID FOR INITIALIZATION         15230000
*                                      "XTP7INIT", AND BDSC "XTP7BDS"   15240000
*                                      FOR FIRST DATA SET OF A JOB      15250000
*                                      0 = DEFAULT TO JES COPY MARK     15260000
*                                          SETTING                      15270000
*                                      1 = DO NOT JOG                   15280000
*                                      2 = JOG ON A DATA SET BOUNDARY   15290000
*                                      3 = JOG ON A JOB BOUNDARY @38C*/ 15300000
*   3 XTP7FMT   FIXED(16),          /* CURRENT DATASET RESOLUTION       15310000
*                                      VALUE SET BY APSUX07      @MRA*/ 15320000
*   3 XTP7CRF3  BIT(8),             /*     CRL FLAGS-                   15330000
*                                      0 = FREE THE STORAGE             15340000
*                                      1 = KEEP THE CRL          @MRA*/ 15350000
*     5 *        BIT(1),            /* RESERVED                  @MRA*/ 15360000
*     5 XTP7CFPF BIT(1),            /* Free/Keep Font Path CRL   @FEC*/ 15370000
*     5 XTP7S2CF BIT(1),            /* FREE/KEEP SECUR. FONT 240        15380000
*                                                             CRL@MRA*/ 15390000
*     5 XTP7S3CF BIT(1),            /* FREE/KEEP SECUR. FONT 300        15400000
*                                                             CRL@MRA*/ 15410000
*     5 XTP7S2MO BIT(1),            /* FREE/KEEP SECUR. OVLY 240        15420000
*                                                             CRL@MRA*/ 15430000
*     5 XTP7S3MO BIT(1),            /* FREE/KEEP SECUR. OVLY 300        15440000
*                                                             CRL@MRA*/ 15450000
*     5 XTP7S2PS BIT(1),            /* FREE/KEEP SECUR. SEG 240 CRL     15460000
*                                                                @MRA*/ 15470000
*     5 XTP7S3PS BIT(1),            /* FREE/KEEP SECUR. SEG 300 CRL     15480000
*                                                                @MRA*/ 15490000
*   3 *  CHAR(1),                   /* RESERVED                  @MRA*/ 15500000
*                                                                       15510000
*   3 XTP7CRP2,                     /* POINTERS TO THE CONCATENATION *  15520000
*                                      RETRIEVAL LISTS           @MRA*/ 15530000
*     5 XTP72LCF  PTR(31),          /* POINTER TO FONT 240 CRL   @MRA*/ 15540000
*     5 XTP73LCF  PTR(31),          /* POINTER TO FONT 300 CRL   @MRA*/ 15550000
*     5 XTP72LMO  PTR(31),          /* POINTER TO OVLY 240 CRL   @MRA*/ 15560000
*     5 XTP73LMO  PTR(31),          /* POINTER TO OVLY 300 CRL   @MRA*/ 15570000
*     5 XTP72LPS  PTR(31),          /* POINTER TO SEGM/OCA 240 CRL      15580000
*                                                                @MRA*/ 15590000
*     5 XTP73LPS  PTR(31),          /* POINTER TO SEGM/OCA 300 CRL      15600000
*                                                                @MRA*/ 15610000
*     5 XTP7CRFP  PTR(31),          /* Pointer to Font Path CRL  @FEC*/ 15620000
*     5 *         PTR(31),          /* RESERVED                  @MRA*/ 15630000
*     5 XTP72LSF  PTR(31),          /* POINTER TO SECUR FONT 240        15640000
*                                                             CRL@MRA*/ 15650000
*     5 XTP73LSF  PTR(31),          /* POINTER TO SECUR FONT 300        15660000
*                                                             CRL@MRA*/ 15670000
*     5 XTP72LSO  PTR(31),          /* POINTER TO SECUR OVLY 240        15680000
*                                                             CRL@MRA*/ 15690000
*     5 XTP73LSO  PTR(31),          /* POINTER TO SECUR OVLY 300        15700000
*                                                             CRL@MRA*/ 15710000
*     5 XTP72LSP  PTR(31),          /* POINTER TO SECUR SEG 240 CRL     15720000
*                                                                @MRA*/ 15730000
*     5 XTP73LSP  PTR(31),          /* POINTER TO SECUR SEG 300 CRL     15740000
*                                                                @MRA*/ 15750000
*   3 XTP7MFG1 BIT(8),              /* MORE RESPONSE FLAGS       @22A*/ 15760000
*     5 XTP7APSF BIT(1),            /* ACK PER SHEET FLAG -             15770000
*                                      VALID FOR CHANNEL-ATTACHED       15780000
*                                      PRINTERS ONLY                    15790000
*                                      (VALID ONLY ON INITIALIZATION    15800000
*                                       CALL "XTP7INIT")                15810000
*                                        0 = ACK PER PAGE               15820000
*                                        1 = ACK PER SHEET       @DXC*/ 15830000
*     5 XTP7NSF  BIT(1),            /* CSE NEW SHEET FLAG               15840000
*                                      (VALID ONLY ON                   15850000
*                                       INITIALIZATION CALL             15860000
*                                       "XTP7INIT")                     15870000
*                                        0 = In CSE mode, JOG(AOS) with 15880000
*                                            offset stacking being done 15890000
*                                            or start of a data set     15900000
*                                            causes skip to next        15910000
*                                            front side partition       15920000
*                                        1 = In CSE mode, JOG(AOS) with 15930000
*                                            offset stacking being done 15940000
*                                            or start of a data set     15950000
*                                            causes skip to new sheet.  15960000
*                                                                @36C*/ 15970000
*     5 XTP7CLOS BIT(1),            /* Close libraries when idle        15980000
*                                      (VALID ONLY ON INITIALIZATION    15990000
*                                       CALL "XTP7INIT")                16000000
*                                        0 = Don't close                16010000
*                                        1 = Close               @24A*/ 16020000
*     5 XTP7SDCH BIT(1),            /* SEND DEFAULT CHARACTER FLAG -    16030000
*                                        USED FOR SINGLE BYTE OUTLINE   16040000
*                                        FONT CODE PAGE                 16050000
*                                      (VALID FOR INITIALIZATION        16060000
*                                       "XTP7INIT", BDS "XTP7BDS",      16070000
*                                       AND EDS "XTP7EDS")       @ITC   16080000
*                                        0 = DO NOT SEND DEFAULT        16090000
*                                            CHARACTER                  16100000
*                                        1 = SEND DEFAULT CHARACTER     16110000
*                                                                @25A*/ 16120000
*     5 XTP7CINR BIT(1),            /* CAPTURE INLINE RESOURCES WHEN    16130000
*                                       CONNECTED VIA DPF OR WPM        16140000
*                                      (VALID FOR INITIALIZATION        16150000
*                                       "XTP7INIT", BDS "XTP7BDS",      16160000
*                                       AND EDS "XTP7EDS")       @ITC   16170000
*                                        0 = DO NOT CAPTURE INLINE      16180000
*                                            RESOURCES WHEN CONNECTED   16190000
*                                            VIA DPF OR WPM             16200000
*                                        1 = CAPTURE INLINE RESOURCES   16210000
*                                            WHEN CONNECTED VIA DPF     16220000
*                                            OR WPM              @34C*/ 16230000
*     5 XTP7RDSR BIT(1),            /* RELEASE DATA SETS WHEN           16240000
*                                        REPOSITIONING                  16250000
*                                      (VALID FOR INITIALIZATION        16260000
*                                        "XTP7INIT")                    16270000
*                                        0 = DO NOT RELEASE DATA SETS   16280000
*                                            WHEN REPOSITIONING         16290000
*                                        1 = RELEASE DATA SETS WHEN     16300000
*                                            REPOSITIONING       @29A*/ 16310000
*     5 XTP7SUCM BIT(1),            /* SUPPRESS COPY MARKS              16320000
*                                      (VALID FOR INITIALIZATION        16330000
*                                       "XTP7INIT", BDS "XTP7BDS",      16340000
*                                       AND EDS "XTP7EDS")       @ITC   16350000
*                                       0 = DO NOT SUPPRESS COPY        16360000
*                                           MARKS                       16370000
*                                       1 = SUPPRESS COPY MARKS         16380000
*                                                                @30A*/ 16390000
*     5 XTP7RSV1 BIT(1),            /* RESERVED - DO NOT USE     @31C*/ 16400000
*   3 XTP7PRMD CHAR(8),             /* PRMODE - SPECIFIES THE TYPE OF   16410000
*                                        DATA IN THE PRINT DATA SET     16420000
*                                      (VALID FOR INITIALIZATION        16430000
*                                       "XTP7INIT" AND BDS "XTP7BDS")   16440000
*                                      ONLY SOSI1, SOSI2, OR            16450000
*                                      SOSI3 CAN BE SPECIFIED.   @23A*/ 16460000
*                                                                       16470000
*   3 *        CHAR(1),             /* RESERVED                  @28A*/ 16480000
*   3 XTP7DRES BINARY(16),          /* DEVICE RESOLUTION (PELS/10 IN)   16490000
*                                      FOR X DIRECTION                  16500000
*                                      X'960' = 240 PEL PRINTER         16510000
*                                      X'BB8' = 300 PEL PRINTER  @28A*/ 16520000
*   3 XTP7BINS(4),                  /* SIDE AND EDGE SENSITIVITY        16530000
*                                      BINS                      @39A*/ 16540000
*     5 XTP7BIN BIN(8),             /* INPUT BIN                 @39A*/ 16550000
*     5 XTP7SIM BIN(8),             /* SIMPLEX INPUT BIN         @39A*/ 16560000
*     5 XTP7DUP BIN(8),             /* DUPLEX INPUT BIN          @39A*/ 16570000
*   3 XTP7MFG2 BIT(8),              /* MORE RESPONSE FLAGS       @EMA*/ 16580000
*     5 XTP7ASAP BIT(1),            /* AFP STATISTICS ABOUT THE         16590000
*                                      PRINTFILE                        16600000
*                                      (VALID FOR BDS "XTP7BDS")        16610000
*                                      0 = DO NOT GATHER AFP STATS      16620000
*                                          FOR THIS DATASET(PRINTFILE)  16630000
*                                      1 = GATHER AFP STATISTICS FOR    16640000
*                                          THIS PRINTFILE        @EMA*/ 16650000
*     5 XTP7SENS BIT(1),            /* SIDE AND EDGE SENSITIVITY FLAG - 16660000
*                                      (VALID ONLY ON INIT CALL         16670000
*                                       "XTP7INIT")                     16680000
*                                      0 = DO NOT USE SIDE AND EDGE     16690000
*                                          SENSITIVITY                  16700000
*                                      1 = ACTIVATE SIDE AND EDGE       16710000
*                                          SENSITIVITY           @39A*/ 16720000
*     5 XTP7IMSG BIT(1),            /* INTERVENTION MESSAGE FLAG        16730000
*                                      (VALID ONLY ON INIT CALL         16740000
*                                       "XTP7INIT")                     16750000
*                                      0 = DO NOT DISPLAY THE           16760000
*                                          INTERVENTION MESSAGE ON      16770000
*                                          THE OPERATOR CONSOLE         16780000
*                                      1 = DISPLAY THE INTERVENTION     16790000
*                                          MESSAGE ON THE OPERATOR      16800000
*                                          CONSOLE               @40A*/ 16810000
*     5 XTP7PJO  BIT(1),            /* PRINTJOB FINISHING OFF           16820000
*                                      (VALID FOR BDS "XTP7BDS"         16830000
*                                       AND EDS "XTP7EDS")       @ITC   16840000
*                                      0 = DO NOT ALTER PRINTJOB        16850000
*                                          FINISHING SETTING            16860000
*                                      1 = SET PRINTJOB FINISHING       16870000
*                                          OFF                   @41A*/ 16880000
*     5 XTP7CPPP BIT(1),            /* CSE PRESERVE PAGE PLACEMENT      16890000
*                                      (VALID ONLY ON INIT CALL         16900000
*                                       "XTP7INIT")                     16910000
*                                        0 = DO NOT PRESERVE PAGE       16920000
*                                         PLACEMENT ACROSS REPOSITIONS  16930000
*                                        1 = PRESERVE PAGE PLACEMENTS   16940000
*                                           ACROSS REPOSITIONS   @42A*/ 16950000
*     5 XTP7LCNT BIT(1),            /* USE LINE COUNT (LINECT) IN LINE  16960000
*                                      MODE MIGRATION FOR CALCULATING   16970000
*                                      THE NUMBER OF LINES ON A PAGE    16980000
*                                      (VALID ONLY ON INIT CALL         16990000
*                                       "XTP7INIT")                     17000000
*                                        0 = DO NOT USE LINECT          17010000
*                                        1 = USE LINECT          @43A*/ 17020000
*     5 XTP7HLCF BIT(1),            /* HIGHLIGHT COMMUNICATIONS FAILURE 17030000
*                                      MESSAGE APS6501A                 17040000
*                                      (VALID ONLY ON INIT CALL         17050000
*                                       "XTP7INIT")                     17060000
*                                        0 = DO NOT HIGHLIGHT           17070000
*                                        1 = HIGHLIGHT MESSAGE   @45A*/ 17080000
*     5 XTP7LMCM BIT(1),            /* ALLOW LINE MODE                  17090000
*                                      CONVERSION MESSAGE APS973I       17100000
*                                      IN AFP DOWNLOAD PLUS             17110000
*                                      (VALID ONLY ON INIT CALL         17120000
*                                       "XTP7INIT")                     17130000
*                                        0 = DO NOT ALLOW MESSAGE       17140000
*                                        1 = ALLOW MESSAGE              17150000
*                                                                @46A*/ 17160000
*   3 *        CHAR(24);            /* RESERVED                  @39C*/ 17170000
*/********************************************************************/ 17180000
*/*       THE FOLLOWING FIELDS ARE USE FOR INSTALLATION EXIT 08      */ 17190000
*/*       (MIGRATION EXIT)                                       @35A*/ 17200000
*/********************************************************************/ 17210000
* DCL 1 XTP8 BASED(XTPRECP),                                  /* @35A*/ 17220000
*       3 XTP8FLAG CHAR(1),         /* Exit08 Flags              @35A*/ 17230000
*         5 XTP8MIG  BIT(1),        /* Do line mode migration flag      17240000
*                                      for a 4245 FCB (FCB2).           17250000
*                                      When this flag is set on,        17260000
*                                      line mode migration is activated 17270000
*                                      for a 4245 FCB (FCB2).           17280000
*                                      This flag is reset when          17290000
*                                      exit 08 is called.        @EXC*/ 17300000
*         5 XTP8MIG4 BIT(1),        /* Do line mode migration flag      17310000
*                                      for a 4248 FCB (FCB4).           17320000
*                                      When this flag is set on,        17330000
*                                      line mode migration is activated 17340000
*                                      for a 4248 FCB (FCB4).           17350000
*                                      This flag is reset when          17360000
*                                      exit 08 is called.        @EXA*/ 17370000
*         5 XTP8PBSP BIT(1),        /* Honor page boundary spacing.     17380000
*                                      When this flag is set on,        17390000
*                                      page boundary spacing will be    17400000
*                                      honored in line mode migration   17410000
*                                      This flag is reset when          17420000
*                                      exit 08 is called.        @44A*/ 17430000
*         5 *        BIT(5),        /* Reserved                  @44C*/ 17440000
*       3 *        CHAR(9);         /* Reserved                  @35A*/ 17450000
*                                                                       17460000
*/********************************************************************/ 17470000
*/*  THE FOLLOWING CONSTANTS ARE USED TO SET FIELDS IN APSGEXTP      */ 17480000
*/********************************************************************/ 17490000
*DCL XTPWRT   FIXED(8) CONSTANT(00);/* WRITE ORIGINAL RECORD         */ 17500000
*DCL XTPSKP   FIXED(8) CONSTANT(01);/* SKIP ORIGINAL RECORD          */ 17510000
*DCL XTPWRTIX FIXED(8) CONSTANT(02);/* WRITE REC(S) IN INDEX         */ 17520000
*DCL XTP7NCK  FIXED(8) CONSTANT(00);/* DO NOT CHECK TO SEE IF PAGE      17530000
*                                      FITS                      @DDA*/ 17540000
*DCL XTP7CK1P FIXED(8) CONSTANT(01);/* CHECK ONLY FIRST PAGE TO SEE     17550000
*                                      IF IT FITS                @DDA*/ 17560000
*DCL XTP7CKAP FIXED(8) CONSTANT(02);/* CHECK ALL PAGES TO SEE IF        17570000
*                                      THEY FIT                  @DDA*/ 17580000
*DCL XTP7ID CHAR(4) CONSTANT('XTP7');/* ID FOR XTP7 AREA         @U7A*/ 17590000
*DCL XTP7TITL CHAR(8) CONSTANT('XTP7    ');/* ID FOR TRACING     @U7A*/ 17600000
*DCL XTP4SIMP FIXED(8) CONSTANT(01);/* SIMPLEX                   @18A*/ 17610000
*DCL XTP4NDUP FIXED(8) CONSTANT(02);/* NORMAL DUPLEX             @18A*/ 17620000
*DCL XTP4TDUP FIXED(8) CONSTANT(03);/* TUMBLE DUPLEX             @18A*/ 17630000
*DCL XTP7NONE FIXED(8) CONSTANT(01);/* JOGGING = NONE            @38A*/ 17640000
*DCL XTP7DSET FIXED(8) CONSTANT(02);/* JOGGING = DATASET         @38A*/ 17650000
*DCL XTP7JOB  FIXED(8) CONSTANT(03);/* JOGGING = JOB             @38A*/ 17660000
