*  %GOTO ECAPRO; /*                                                     00010000
         MACRO                                                          00020000
         APSUECA  &LIST=NO                                              00030000
*          */                                                           00040000
*  %ECAPRO: ;                                                           00050000
*/********************************************************************/ 00060000
*/* COMMON NAME: EXIT COMMUNICATIONS AREA                            */ 00070000
*/* $MAC(APSUECA) COMP(APS) PROD(PSF) : PSF VERSION 4.7.0            */ 00080000
*/*                                                                  */ 00090000
*/* MACRO ID:   APSUECA                                              */ 00100000
*/* DSECT NAME: APSUECA                                              */ 00110000
*/* CREATED BY: APSUEXTI                                             */ 00120000
*/* DELETED BY: APSPPFSA, APSPPATR, APSPPIEP                         */ 00130000
*/* POINTED TO BY: BASED                                             */ 00140000
*/* FUNCTION: THIS CONTROL BLOCK IS USED TO PROVIDE INFORMATION      */ 00150000
*/*           BETWEEN THE PSF INSTALLATION EXIT ROUTINES.            */ 00160000
*/* NOTE:     THE LENGTH OF ECAWKBUF CAN BE INCREASED BY CHANGING    */ 00170000
*/*           THE TOTAL LENGTH OF APSUECA.  THIS CHANGE MUST BE      */ 00180000
*/*           MADE TO THE LENGTH FIELD IN APSUCOM.  THE MACRO        */ 00190000
*/*           APSXUCOM CAN BE USED TO CREATE A NEW APSUCOM TABLE     */ 00200000
*/*           WITH A DIFFERENT LENGTH FIELD VALUE SPECIFIED.         */ 00210000
*/* INVOCATION =                                                     */ 00220000
*/*              BAL  - APSUECA (DSECT IS ALWAYS PRODUCED)           */ 00230000
*/*                     USING ON ECA  GIVES ADDRESSABILITY           */ 00240000
*/*              PL/S - %INCLUDE SYSLIB(APSUECA)                     */ 00250000
*/*   DEVELOPERS                                                     */ 00260000
*/*              BAL LISTING - SPEC LIST=YES ON MACRO CALL           */ 00270000
*/*                            TO EXPAND DSECT IN LISTING            */ 00280000
*/*                                                                  */ 00290000
*/*01* STATUS = HPRF470                                              */ 00300000
*/* 01* CHANGE ACTIVITY =                                        @H4C*/ 00310000
*/* $B0=LAPS0000, HAF1102, 101981, TR4  : INITIAL VERSION            */ 00320000
*/* $01=OZ87400,  HAF1203, 022086, BJ13WLC: CAN'T PASS DATA BETWEEN  */ 00330000
*/*                                         2 ECA'S                  */ 00340000
*/* $02=OZ88810,  HAF1203, 030386, BJ13WLC: TSM COUNT IN ECA         */ 00350000
*/* $03=OZ90130,  HAF1203, 030586, BJ13WLC: MSG EXIT                 */ 00360000
*/* $H2=LAPS0002, HAF1203, 061686, BJ13WLC: PSF REL 2.0              */ 00370000
*/* $04=OY00169,  HAF1203, 101486, BJ13WLC: EXIT4 ENHANCEMENT        */ 00380000
*/* $05=OY04618,  HAF1203, 032487, BJ13ALH: COPY DIA INFO INTO ECA   */ 00390000
*/* $H3=LAPS0003,HAF1220,870928,BJ13WLC: RELEASE 2.1             @H3A*/ 00400000
*/* $U7=OY0????,  HAF1220, 021088, BJ13SDJ: RESOURCE EXIT ROLLUP @U7A*/ 00410000
*/* $06=OY14561,  HAF1203, 061488, TUCGS: ADD MSG & RESOURCE EXIT@06A*/ 00420000
*/*                                       SAVE AREAS             @06A*/ 00430000
*/* $L1=LAPS0004, HAF1228, 060188, B53KELJ: RELEASE 3.0          @L1A*/ 00440000
*/* $07=OY19555,  HAF1228, 012389, BJ13DTT: MFCS SUPPORT         @07A*/ 00450000
*/* $H4=LAPS0005, HPRF102, 040789, B53KEMC: REL 2.1.0 PLAS CONV  @H4A*/ 00460000
*/* $H5=LAPS0005, HPRF102, 053089, B53KEMC: REL 2.1.0 NEW FUNCT  @H5A*/ 00470000
*/* $H7=LAPS0005, HPRF102, 121089, B53KEMC: REL 2.1.0 STAGE 2    @H7A*/ 00480000
*/* $H9=LAPS0005, HAF1237, 062990, B53KRLD: ESS NEW FUNCTION     @H9A*/ 00490000
*/* $08=OY42256,  HPRF102, 910329, B53KELJ: Add ECEFORM 8 char   @08A*/ 00500000
*/* $09=OY51438,  HPRF102, 921122, BJ13JPG: Add ECERPM & ECEDPF  @09A*/ 00510000
*/* $10=OY65167,  HPRF102, 930812, BJ13CWJ: Suppression of mark  @10A*/ 00520000
*/*                                         forms for multi-page @10A*/ 00530000
*/*                                         trailers             @10A*/ 00540000
*/* $11=OY66024,  HPRF102, 930927, BJ13JPG: 3930 SUPPORT         @11A*/ 00550000
*/* $12=OW00105,  HPRF102, 931109, BJ13RLD: APSUBTBL new function@12A*/ 00560000
*/*                                                                  */ 00570000
*/* $D2=LAPS0006, HPRF220, 921113, BJ13RLD: REL 2.2.0 - CONTROL  @D2A*/ 00580000
*/*                                       BLOCK CONSTANT CHANGES @D2A*/ 00590000
*/* $13=OW07738,  HPRF220, 940829, BJ13RLD: Provide last or only @13A*/ 00600000
*/*                                         dataset indication       */ 00610000
*/* $14=OW07446,  HPRF220, 940815, BJ13ELJ: FIX SMF6IMPS         @14A*/ 00620000
*/* $15=OW08338,  HPRF220, 940929, BJ13RLD: Add PSF Direct       @15A*/ 00630000
*/*                                         support              @15A*/ 00640000
*/* $16=OW10928,  HPRF220, 950316, BJ13RLD: Added to supersede   @16A*/ 00650000
*/*                                         PE OW07446           @16A*/ 00660000
*/* $17=OW17525,  HPRF220, 951115, BJCRWC:  MVSDL EXIT15         @17A*/ 00670000
*/* $18=OW22539,  HPRF220, 970116, BDKURLD: Line merge support   @18A*/ 00680000
*/* $19=OW25116,  HPRF220, 970210, BDKURLD: Add field for LMO    @19A*/ 00690000
*/* $DU=LAPS0007,HPRF310,980427,BDKURLD: Version 3.1.0           @DUA*/ 00700000
*/*                                       BLOCK CONSTANT CHANGES @DUA*/ 00710000
*/* $20=OW38201,  HPRF220, 990316, BDKURLD: Update comments      @20A*/ 00720000
*/* $21=OW40839,  HPRF310, 990831, BDKURLD: Pass data set id to      */ 00730000
*/*                                         exits                @21A*/ 00740000
*/* $22=OW42117,  HPRF310, 991207, BDKURLD: Add sample APSUX15M  @22A*/ 00750000
*/* $23=OW41991,  HPRF310, 000113, BDKURLD: Enable capture of inline */ 00760000
*/*                                         resources on WPM     @23A*/ 00770000
*/* $EC=LAPS0008, HPRF320, 991005, BDKUEAS: Exits in C           @ECA*/ 00780000
*/* $DX=LAPS0008, HPRF320, 991214, BDKURLD: Change release level @DXA*/ 00790000
*/* $24=OW45610,  HPRF320, 000524, BDKURLD: Indicate simplex/duplex  */ 00800000
*/*                                                              @24A*/ 00810000
*/* $25=OW46917,  HPRF320, 001213, BDKURLD: Fix comment          @25A*/ 00820000
*/* $26=OW44363,  HPRF320, 000906, BDKURLD: Support line mode        */ 00830000
*/*                                         migration            @26A*/ 00840000
*/* $27=OW47659,  HPRF320, 010104, BDKUMLC: Compile only         @27A*/ 00850000
*/* $EV=LAPS0009,HPRF330,010530,BUQ4RLB: Version 3.3.0           @EVA*/ 00860000
*/* $EV=LAPS0009,HPRF330,010713,BDKURLD: Add ability to print 2      */ 00870000
*/*                                      copies of separators    @EVA*/ 00880000
*/* $28=OW53147,  HPRF320, 020128, BDKURLD: Add FSS name         @28A*/ 00890000
*/* $FC=LAPS0010,HPRF340,020612,BDKULD : Version 3.4.0           @FCA*/ 00900000
*/* $FC=LAPS0010,HPRF340,030415,BDKURLD: Update Download comment @FCA*/ 00910000
*/* $FM=LAPS0011,HPRF410,040220,BDKURDD: Version 4.1.0           @FMA*/ 00920000
*/* $FN=LAPS0011,HPRF410,040930,BDKURLD: PSF, Download, or AFP       */ 00930000
*/*                                      Download Plus           @FNA*/ 00940000
*/* $30=OA09282, HPRF330,041019,BDKURLD: Provide FCB name to         */ 00950000
*/*                                      exits                   @30A*/ 00960000
*/* $FU=LAPS0012,HPRF420,060630,BDKURDD: Version 4.2.0           @FUA*/ 00970000
*/* $GD=LAPS0013,HPRF430,080514,BDKURDD: Version 4.3.0           @GDA*/ 00980000
*/* $GH=LAPS0014,HPRF440,090922,BDKURDD: Version 4.4.0           @GHA*/ 00990000
*/* $GW=LAPS0014,HPRF440,100504,BDKURLD: Large copy set values   @GWA*/ 01000000
*/* $HH=LAPS0015,HPRF450,111202,BDKUGLM: Version 4.5.0           @HHA*/ 01010000
*/* $HV=LAPS0015,HPRF450,120611,BJYQMAL: SMF6 Record update      @HVA*/ 01020000
*/* $IL=LAPS0016,HPRF460,151207,BDKUDWP: Version 4.6.0           @ILA*/ 01030000
*/* $JM=LAPS0017,HPRF470,171116,BDKUDWP: Version 4.7.0           @JMA*/ 01040000
*/* $JR=LAPS0017,HPRF470,171211,BDKURLD: Update ECEJOBPP, ECELPCNT,  */ 01050000
*/*                                      and ECEPPCNT            @JRA*/ 01060000
*/*                                                                  */ 01070000
*/********************************************************************/ 01080000
*  %GOTO ECADCL; /*                                                     01090000
         PUSH  PRINT                                                    01100000
         AIF   ('&LIST' EQ 'YES').MAP1                                  01110000
         PRINT OFF                                                      01120000
.MAP1    ANOP                                                           01130000
APSUECA  DSECT                                                          01140000
ECA      EQU   APSUECA             ALTERNATE DSECT NAME                 01150000
ECABASE  EQU   *                   BASE SECTION OF ECA           @H4A   01160000
ECAID    DS    CL4                 CONTROL BLOCK ID, SET TO UECA        01170000
ECALEN   DS    F                   LENGTH OF ECA                        01180000
ECAPTF   DS    CL6                 RELATIVE PTF DATE                    01190000
ECAREL   DS    CL2                 RELEASE LEVEL                        01200000
ECARCODE DS    F                   RRB PUT RETURN CODE                  01210000
ECAUCOMP DS    AL4                 ADDR. OF EXIT APSUCOM TABLE          01220000
ECAPUTP  DS    AL4                 ADDR. OF EXIT PUT ROUTINE            01230000
ECABLKP  DS    AL4                 ADDR. OF EXIT BLOCK LETTER RTN       01240000
ECASABP  DS    AL4                 ADDR. OF APSPFSAB                    01250000
*                                    (PSF USAGE ONLY)           @20C    01260000
ECAECEP  DS    AL4                 ADDR OF ECA EXTENSION        @01A    01270000
ECAMARP  DS    AL4                 3800-3/8 MIGRATION AID PTR   @04C    01280000
ECAFORM  DS    CL4                 FORM NAME IN OUTPUT JCL      @U7C    01290000
ECAMFCS  DS    AL1                 MARK FORM CARRIER STRIP      @07A    01300000
ECARNDM  DS    CL6                 RANDOM NUMBER FOR SEPARATORS @L1C    01310000
ECAFLAG  DS    CL1                 ECA FLAGS                    @10C    01320000
ECAMFTRL EQU   B'10000000'         MARK FORMS INHIBIT FLAG FOR JOB      01330000
********************************************************************    01340000
*                                                                       01350000
*  FOLLOWING IS THE COMBINATION OF THE ECALSTDS AND ECAFSTDS            01360000
*  FLAGS AND THEIR MEANING                                              01370000
*                                                                       01380000
*  00 = NOT FIRST OR LAST DATASET (MIDDLE DATASET)                      01390000
*  01 = FIRST DATASET                                                   01400000
*  10 = LAST DATASET                                                    01410000
*  11 = ONLY DATASET                                                    01420000
*                                                               @22A    01430000
********************************************************************    01440000
ECALSTDS EQU   B'01000000'         LAST DATASET                         01450000
*                                  0 = NOT THE LAST DATASET             01460000
*                                      OF THE JOB                       01470000
*                                  1 = LAST DATASET OF THE JOB          01480000
*                                                               @22C    01490000
ECAFSTDS EQU   B'00100000'         FIRST DATASET                        01500000
*                                  0 = NOT THE FIRST DATASET            01510000
*                                      OF THE JOB                       01520000
*                                  1 = FIRST DATASET OF THE JOB         01530000
*                                                               @22A    01540000
ECACUTSH EQU   B'00010000'         CUTSHEET OUTPUT                      01550000
*                                  0 = NOT CUTSHEET OUTPUT              01560000
*                                  1 = CUTSHEET OUTPUT - EITHER         01570000
*                                      CUTSHEET PRINTER OR CONTINUOUS   01580000
*                                      FORMS PRINTER WITH BTS           01590000
*                                      AVAILABLE                @24A    01600000
ECADUPEN EQU   B'00001000'         DUPLEX ENABLED                       01610000
*                                  0 = DUPLEX NOT ENABLED               01620000
*                                  1 = DUPLEX ENABLED - DUPLEX          01630000
*                                      AVAILABLE FROM AT LEAST ONE      01640000
*                                      MEDIA SOURCE             @24A    01650000
ECARECAD DS    AL4                 ADDR. OF A RECORD TO BE PUT TO PSF   01660000
ECARECLN DS    F                   RECORD LENGTH                        01670000
ECADRF   DS    AL1                 RECORD DESCRIPTION FLAGS             01680000
ECADSR   EQU   B'10000000'           INDICATES DATA STREAM RECORD       01690000
ECALMR   EQU   B'01000000'           INDICATES LINE MODE RECORD         01700000
ECAANSI  EQU   B'00100000'           RECORD CONTAINS ANSI CONTROL CHAR  01710000
ECAMACH  EQU   B'00010000'           RECORD CONTAINS MACH CONTROL CHAR  01720000
ECAOPJ   EQU   B'00000001'           OPTCODE = J USED FOR RECORD        01730000
ECAPTYPE DS    AL1                 PRODUCT TYPE - PSF, DOWNLOAD,        01740000
*                                  OR AFP Download Plus          @FNA   01750000
ECATRNC  DS    H                   CURRENT TRANSMISSION COUNT  @GWC     01760000
ECAFLAGS DS    AL1                 EXIT PROCESSOR FLAG BYTE             01770000
ECASLANT EQU   X'80'                 SLANT LETTERS REQUESTED            01780000
ECALJUST EQU   X'40'                 LEFT JUSTIFY BLOCK LETTER LINES    01790000
ECAPBLK  EQU   X'20'                 PERFORMANCE BLOCK LETTER  @H2A     01800000
         DS    AL1                 RESERVED                             01810000
ECAGWRK  DS    H                   GENERAL USE WORK FIELD               01820000
ECABLKIN DS    CL8                 INPUT TO BLOCK LETTER RTN     @06M   01830000
         DS    0F                                                @06A   01840000
ECAUSAVE DS    CL72                EXIT PROCESSOR'S SAVE AREA           01850000
ECAGSAVE DS    CL72                GENERAL USE EXIT SAVE AREA           01860000
ECABSAVE DS    CL72                24-BIT INTERFACE RTN SAVEAREA @H5A   01870000
ECAMSGSV DS    CL72                MESSAGE EXIT SAVE AREA        @06A   01880000
ECARSCSV DS    CL72                RESOURCE EXIT SAVE AREA       @06A   01890000
ECACSAVE DS    CL72                C exit routine save area      @ECA   01900000
ECAWKBUF DS    0F                  WORK BUFFER, SEE NOTE ABOVE          01910000
ECAFXLEN EQU   *-APSUECA           LENGTH OF THE FIXED PORTION          01920000
APSUECE  DSECT                                                 @01A     01930000
ECE      EQU   APSUECE             EXIT EXTENSION              @01A     01940000
ECEID    DS    CL4                 CONTROL BLOCK ID, SET TO UECE @01A   01950000
ECELEN   DS    F                   LENGTH OF ECE               @01A     01960000
ECEPTF   DS    CL6                 PTF     LEVEL               @01A     01970000
ECEREL   DS    CL2                 RELEASE LEVEL               @01A     01980000
ECEFECAP DS    AL4                 ADDR OF FSA ECA, USED BY    @01A     01990000
*                                  EXITS 1-4, 6,7,8,14,15,16   @26C     02000000
ECENECAP DS    AL4                 ADDR OF NST ECA, USED BY    @01A     02010000
*                                  EXIT 5                      @01A     02020000
ECEPRMD  DS    CL8                 PRMODE DEFINED IN JCL OUTPUT @04A    02030000
ECEFLASH DS    CL4                 FLASH DEFINED IN JCL OUTPUT @L1A     02040000
ECEDPDEF DS    CL8                 PAGEDEF DEFINED IN PRINTDEV @L1A     02050000
ECEDFDEF DS    CL8                 FORMDEF DEFINED IN PRINTDEV @L1A     02060000
ECEFSSWK DS    AL4                 FSS WORK AREA PTR           @H7A     02070000
ECEPDEVK DS    CL8                 PRINTDEV SWB TOKEN          @H7A     02080000
ECEOUTTK DS    CL8                 PRINT DATA SET SWB TOKEN    @H7A     02090000
ECEJDVTN DS    CL8                 PRINT DATA SET JDVT NAME    @H7A     02100000
ECEPRTT  DS    CL2                 PRINTER TYPE (EG. X'3800')  @H7A     02110000
*                                  THAT THE DEVICE IS EMULATING@11A     02120000
*                                  (FROM THE IPDS STM)         @11A     02130000
ECEPRTM  DS    CL1                 PRINTER MODULE NUMBER       @H7A     02140000
*                                          (EG. X'03')         @H7A     02150000
*                                  THAT THE DEVICE IS EMULATING@11A     02160000
*                                  (FROM THE IPDS STM)         @11A     02170000
ECEFLAG  DS    CL1                 EXIT FLAGS                  @H7A     02180000
ECEJESS  EQU   X'80'                 JES SUPPORTS ENHANCED     @H7A     02190000
*                                    SYSOUT SUPPORT (ESS) JCL  @H7A     02200000
ECERPM   EQU   X'40'               RPM IS ATTACHED             @09A     02210000
ECEDPF   EQU   X'20'               DPF IS ATTACHED             @09A     02220000
ECEPSFD  EQU   X'10'               PSF DIRECT IS ATTACHED      @15A     02230000
ECEWPM   EQU   X'08'               WPM IS ATTACHED             @23A     02240000
ECEFORM  DS    CL8                 FORM NAME IN OUTPUT JCL     @08A     02250000
ECEPRTDT DS    CL4                 PRINTER DEVICE TYPE STAMPED @11A     02260000
*                                  ON THE PRINTER IN EBCDIC    @11A     02270000
*                                  (FROM THE IPDS OPC, OR STM  @11A     02280000
*                                  IF NONE IN THE OPC)         @11A     02290000
ECEPRTMD DS    CL3                 PRINTER MODEL NUMBER STAMPED@11A     02300000
*                                  ON THE PRINTER IN EBCDIC    @11A     02310000
*                                  (FROM THE IPDS OPC, OR STM  @11A     02320000
*                                  IF NONE IN THE OPC)         @11A     02330000
         DS    CL1                 RESERVED                    @12A     02340000
ECEBTBL  DS    AL4                 ADDR. OF BLOCK LETTER TBLS  @12A     02350000
*                                  DO NOT MODIFY ECEBTBL AS IT @12A     02360000
*                                  IS USED BY APSUBLK          @12A     02370000
ECEJOBLP DS    F                   LOGICAL PAGES IN THE JOB    @14A     02380000
ECEJOBIM DS    F                   IMPRESSIONS(SIDES) IN JOB   @14A     02390000
ECEJOBPP DS    F                   PHYSICAL SHEETS IN THE JOB  @HVC     02400000
*                                  (includes header, message,  @JRA     02410000
*                                   and trailer sheets)        @JRA     02420000
ECEWKPTR DS    AL4                 @ OF AN EXIT WORK AREA      @H9A     02430000
ECEWKLEN DS    F                   LENGTH OF AN EXIT WORK AREA @H9A     02440000
ECETUPTR DS    AL4                 ADDRESS OF THE SWBTU        @H9A     02450000
ECETULEN DS    F                   LENGTH OF THE SWBTU         @H9A     02460000
ECEREC   DS    F                   LOGICAL RECORD COUNT        @05A     02470000
*                                  THE COUNT DOES NOT INCLUDE  @05A     02480000
*                                  HEADER OR TRAILER PAGE      @05A     02490000
*                                  RECORD                      @05A     02500000
ECELPCNT DS    F                   Logical page count for the  @JRC     02510000
*                                  data set (includes header   @JRC     02520000
*                                  and trailer pages)          @JRC     02530000
ECEPPCNT DS    F                   Physical sheet count for    @JRC     02540000
*                                  the data set (includes      @JRC     02550000
*                                  header and trailer sheets)  @JRC     02560000
*                                                             3@HVD     02570000
ECEDSCNT DS    F                   PHYSICAL DUPLEX SHEET COUNT.@HVA     02580000
*                                  COUNT INCLUDES HEADER OR    @HVA     02590000
*                                  TRAILER SHEETS.             @HVA     02600000
ECESSCNT DS    F                   PHYSICAL SIMPLEX SHEET CNT. @HVA     02610000
*                                  COUNT INCLUDES HEADER OR    @HVA     02620000
*                                  TRAILER SHEETS.             @HVA     02630000
ECENUP1C DS    F                   PHYSICAL N-Up 1 SHEET CNT.  @HVA     02640000
*                                  COUNT INCLUDES HEADER OR    @HVA     02650000
*                                  TRAILER SHEETS.             @HVA     02660000
ECENUP2C DS    F                   PHYSICAL N-Up 2 SHEET CNT.  @HVA     02670000
*                                  COUNT INCLUDES HEADER OR    @HVA     02680000
*                                  TRAILER SHEETS.             @HVA     02690000
ECENUP3C DS    F                   PHYSICAL N-Up 3 SHEET CNT.  @HVA     02700000
*                                  COUNT INCLUDES HEADER OR    @HVA     02710000
*                                  TRAILER SHEETS.             @HVA     02720000
ECENUP4C DS    F                   PHYSICAL N-Up 4 SHEET CNT.  @HVA     02730000
*                                  COUNT INCLUDES HEADER OR    @HVA     02740000
*                                  TRAILER SHEETS.             @HVA     02750000
ECESCPY  DS    H                   Separator copy count        @EVC     02760000
ECETXMS  DS    H                   TOTAL TRANSMISSIONS REQUIRED         02770000
*                                                              @GWC     02780000
*                                                                       02790000
*  The following addresses are valid only for assembler exits  @ECA     02800000
*                                                                       02810000
ECEX01P  DS    AL4                 ADDR OF EXIT APSUX01        @01A     02820000
ECEX02P  DS    AL4                 ADDR OF EXIT APSUX02        @01A     02830000
ECEX03P  DS    AL4                 ADDR OF EXIT APSUX03        @01A     02840000
ECEX04P  DS    AL4                 ADDR OF EXIT APSUX04        @01A     02850000
ECEX05P  DS    AL4                 ADDR OF EXIT APSUX05        @01A     02860000
ECEX06P  DS    AL4                 ADDR OF EXIT APSUX06        @03C     02870000
ECEX07P  DS    AL4                 ADDR OF EXIT APSUX07        @U7C     02880000
ECEX08P  DS    AL4                 Addr of exit APSUX08        @26C     02890000
ECEX09P  DS    AL4                 RESERVED                    @01A     02900000
ECEX10P  DS    AL4                 RESERVED                    @01A     02910000
ECEX11P  DS    AL4                 RESERVED                    @01A     02920000
ECEX12P  DS    AL4                 RESERVED                    @01A     02930000
ECEX13P  DS    AL4                 RESERVED                    @01A     02940000
ECEX14P  DS    AL4                 ADDR OF EXIT APSUX14        @18C     02950000
*                                    (IN DIRECT PRT MODE ONLY  @18A     02960000
ECEX15P  DS    AL4                 ADDR OF EXIT APSUX15        @18C     02970000
*                                  (IN DOWNLOAD FOR Z/OS ONLY) @FCC     02980000
ECEX16P  DS    AL4                 ADDR OF EXIT APSUX16        @H7C     02990000
*                                    (IN DIRECT PRT MODE ONLY) @H7A     03000000
ECEIMPS  DS    F                   IMPRESSIONS(SIDES)          @14A     03010000
*                                  PRINTED FOR THE DATA SET    @14A     03020000
ECEDSID  DS    CL12                FSI GETDS DATASET ID        @17A     03030000
*              deleted comment about Download for z/OS only    @21D     03040000
ECELMO   DS    AL4                 RESERVED FOR LMO CODE       @19A     03050000
ECEPUTC  DS    AL4                 Addr of APSUPUTC            @ECA     03060000
ECEBLKC  DS    AL4                 Addr of APSUBLKC            @ECA     03070000
ECEFSSNM DS    CL8                 FSS name (Writer proc name) @28A     03080000
ECEFCB   DS    CL4                 FCB name in OUTPUT JCL      @30A     03090000
ECELTXMS DS    F                   TOTAL TRANSMISSIONS REQUIRED         03100000
*                                                              @GWA     03110000
ECELTRNC DS    F                   CURRENT TRANSMISSION COUNT  @GWA     03120000
         DS    CL4                 RESERVED                    @GWC     03130000
         POP   PRINT                                                    03140000
         MEND  , -    */                                                03150000
*  %ECADCL: ;                                                           03160000
*@SPACE;                                                                03170000
*DCL 1 APSUECA BASED,               /* EXIT COMMUNICATIONS AREA      */ 03180000
*     2 ECABASE,                    /* BASE SECTION OF ECA       @H4A*/ 03190000
*      3 ECAID  CHAR(4),            /* CONTROL BLOCK ID SET TO 'UECA'*/ 03200000
*      3 ECALEN    FIXED(31),       /* LENGTH OF ECA                 */ 03210000
*      3 ECAPTF    CHAR(6),         /* RELATIVE PTF DATE             */ 03220000
*      3 ECAREL    CHAR(2),         /* RELEASE LEVEL                 */ 03230000
*      3 ECARCODE  FIXED(31),       /* RRB PUT RETURN CODE           */ 03240000
*      3 ECAUCOMP   PTR (31),       /* ADDR. OF EXIT APSUCOM TABLE   */ 03250000
*      3 ECAPUTP    PTR (31),       /* ADDR. OF EXIT PUT ROUTINE     */ 03260000
*      3 ECABLKP    PTR (31),       /* ADDR. OF BLOCK LETTER RTN     */ 03270000
*      3 ECASABP    PTR (31),       /* ADDR. OF APSPFSAB                03280000
*                                        (PSF USAGE ONLY)        @20C*/ 03290000
*      3 ECAECEP    PTR (31),       /* ADDR. OF EXIT EXTENSION   @01C*/ 03300000
*      3 ECAMARP    PTR (31),      /* 3800-3/8 MIGRATION AID PTR @04C*/ 03310000
*      3 ECAFORM    CHAR(4),        /* FORM NAME IN OUTPUT JCL   @U7C*/ 03320000
*      3 ECAMFCS    BIT(8),         /* MARK FORM CARRIER STRIP   @07A*/ 03330000
*      3 ECARNDM    CHAR(6),        /* SEPARATOR PAGE RANDOM #   @L1C*/ 03340000
*      3 ECAFLAG    CHAR(1),        /* ECA FLAGS                 @10C*/ 03350000
*        7 ECAMFTRL BIT(1),         /* Mark Forms inhibit flag for      03360000
*                                      job trailer                      03370000
*                                      1=do not mark job trailers       03380000
*                                      0=job trailers may be marked     03390000
*                                                                @10A*/ 03400000
*  /******************************************************************  03410000
*                                                                       03420000
*     Following is the combination of the ECALSTDS and ECAFSTDS         03430000
*     flags and their meaning                                           03440000
*                                                                       03450000
*     00 = Not first or last dataset (middle dataset)                   03460000
*     01 = First dataset                                                03470000
*     10 = Last dataset                                                 03480000
*     11 = Only dataset                                                 03490000
*                                                                @22A   03500000
*   ******************************************************************/ 03510000
*        7 ECALSTDS BIT(1),         /* LAST DATASET                     03520000
*                                      0 = NOT THE LAST DATASET         03530000
*                                          OF THE JOB                   03540000
*                                      1 = LAST DATASET OF THE JOB      03550000
*                                                                @22C*/ 03560000
*        7 ECAFSTDS BIT(1),         /* FIRST DATASET                    03570000
*                                      0 = NOT THE FIRST DATASET        03580000
*                                          OF THE JOB                   03590000
*                                      1 = FIRST DATASET OF THE JOB     03600000
*                                                                @22A*/ 03610000
*        7 ECACUTSH BIT(1),         /* CUTSHEET OUTPUT                  03620000
*                                      0 = NOT CUTSHEET OUTPUT          03630000
*                                      1 = CUTSHEET OUTPUT - EITHER     03640000
*                                          CUTSHEET PRINTER OR          03650000
*                                          CONTINUOUS FORMS PRINTER     03660000
*                                          WITH BTS AVAILABLE    @24A*/ 03670000
*        7 ECADUPEN BIT(1),         /* DUPLEX ENABLED                   03680000
*                                      0 = DUPLEX NOT ENABLED           03690000
*                                      1 = DUPLEX ENABLED - DUPLEX      03700000
*                                          AVAILABLE FROM AT LEAST ONE  03710000
*                                          MEDIA SOURCE          @24A*/ 03720000
*        7 *        BIT(3),         /* .... .xxx reserved        @24C*/ 03730000
*      3 ECARECAD   PTR (31),       /* ADDR. OF A RECORD TO BE PUT   */ 03740000
*                                   /* TO PSF FROM AN EXIT PROCESSOR */ 03750000
*      3 ECARECLN   FIXED(31),      /* LENGTH OF EXIT RECORD         */ 03760000
*      3 ECADRF    BIT(8) BDY(WORD),/* RECORD DESCRIPTION FLAGS      */ 03770000
*        5 ECADSR  BIT(1),          /* INDICATES DATA STREAM REC     */ 03780000
*        5 ECALMR  BIT(1),          /* INDICATES LINE MODE RECORD    */ 03790000
*        5 ECAANSI BIT(1),          /* REC CONTS ANSI CNTRL CHARS    */ 03800000
*        5 ECAMACH BIT(1),          /* REC CONTS MACH CNTRL CHARS    */ 03810000
*        5 *       BIT(1),          /* RESERVED (PSF USAGE ONLY)     */ 03820000
*        5 *       BIT(1),          /* RESERVED (PSF USAGE ONLY)     */ 03830000
*        5 *       BIT(1),          /* RESERVED (PSF USAGE ONLY)     */ 03840000
*        5 ECAOPJ  BIT(1),          /* OPTCODE=J USED FOR RECORD     */ 03850000
*      3 ECAPTYPE   FIXED(8),       /* PRODUCT TYPE - PSF, DOWNLOAD, */ 03860000
*                                   /* OR AFP PRINT DISTRIBUTOR  @FNA*/ 03870000
*      3 ECATRNC    FIXED(15),      /* CURRENT TRANSMISSION COUNT    */ 03880000
*                                   /*                           @GWC*/ 03890000
*      3 ECAFLAGS   BIT(8),         /* EXIT CONTROL FLAGS        @L1C*/ 03900000
*        5 ECASLANT BIT(1),         /* SLANT LETTERS REQUESTED       */ 03910000
*        5 ECALJUST BIT(1),         /* LEFT JUSTIFY BLOCK            */ 03920000
*                                   /* LETTER LINES                  */ 03930000
*        5 ECAPBLK  BIT(1),         /* PERFORMANCE BLOCK LETTERS @H2A*/ 03940000
*        5 *        BIT(5),         /* RESERVED                  @L1C*/ 03950000
*      3 *          BIT(8),         /* RESERVED                  @L1A*/ 03960000
*      3 ECAGWRK    FIXED(15),      /* GENERAL USE WORK FIELD        */ 03970000
*      3 ECABLKIN   CHAR(8),        /* INPUT TO BLOCK LETTER RTN     */ 03980000
*      3 ECAUSAVE   CHAR(72),       /* EXIT PROCESSOR'S SAVE AREA    */ 03990000
*      3 ECAGSAVE   CHAR(72),       /* GENERAL USE EXIT SAVE AREA    */ 04000000
*      3 ECABSAVE   CHAR(72),       /* 24-BIT INTERFACE SAVEAREA @H5A*/ 04010000
*      3 ECAMSGSV   CHAR(72) BDY(WORD), /* MSG EXIT SAVE AREA    @06A*/ 04020000
*      3 ECARSCSV   CHAR(72) BDY(WORD), /* RESOURCE EXIT SV AREA @06A*/ 04030000
*      3 ECACSAVE   CHAR(72) BDY(WORD),                                 04040000
*                                   /* C exit routine save area  @25C*/ 04050000
*     2 ECAWKBUF    CHAR(*);        /* WORK BUFFER, SEE PROLOGUE @H4C*/ 04060000
*DCL 1 APSUECE BASED(ECAECEP) BDY(WORD), /* EXIT EXTENSION       @01A*/ 04070000
*      3 ECEID CHAR(4),             /* CNTL BLK ID SET 'UECE'    @01A*/ 04080000
*      3 ECELEN FIXED(31),          /* LENGTH OF ECE             @01A*/ 04090000
*      3 ECEPTF CHAR(6),            /* RELATIVE PTF DATE         @01A*/ 04100000
*      3 ECEREL CHAR(2),            /* RELEASE LEVEL             @01A*/ 04110000
*      3 ECEFECAP PTR(31),          /* ADDR OF FSA ECA, USED BY  @01A*/ 04120000
*                                   /* EXITS 1-4, 6,7,8,14,15,16 @26C*/ 04130000
*      3 ECENECAP PTR(31),          /* ADDR OF NST ECA, USED BY  @01A*/ 04140000
*                                   /* EXIT 5                    @01A*/ 04150000
*      3 ECEPRMD CHAR(8),        /* PRMODE DEFINED IN JCL OUTPUT @04A*/ 04160000
*      3 ECEFLASH CHAR(4),       /* FLASH  DEFINED IN JCL OUTPUT @L1A*/ 04170000
*      3 ECEDPDEF CHAR(8),       /* PAGEDEF DEFINED IN PRINTDEV  @L1A*/ 04180000
*      3 ECEDFDEF CHAR(8),       /* FORMDEF DEFINED IN PRINTDEV  @L1A*/ 04190000
*      3 ECEFSSWK PTR(31),       /* FSS WORK AREA PTR            @H7A*/ 04200000
*      3 ECEPDEVK CHAR(8),       /* PRINTDEV SWB TOKEN           @H7A*/ 04210000
*      3 ECEOUTTK CHAR(8),       /* PRINT DATA SET SWB TOKEN     @H7A*/ 04220000
*      3 ECEJDVTN CHAR(8),       /* PRINT DATA SET JDVT NAME     @H7A*/ 04230000
*      3 ECEPRTT  CHAR(2),       /* PRINTER TYPE (EG. X'3800')   @H7A*/ 04240000
*                                /* THAT THE DEVICE IS EMULATING @11A*/ 04250000
*                                /* (FROM THE IPDS STM)          @11A*/ 04260000
*      3 ECEPRTM  CHAR(1),       /* PRINTER MODULE NUMBER (EG. X'03')   04270000
*                                                                @H7A*/ 04280000
*                                /* THAT THE DEVICE IS EMULATING @11A*/ 04290000
*                                /* (FROM THE IPDS STM)          @11A*/ 04300000
*      3 ECEFLAG  BIT(8),        /* EXIT FLAGS                   @H7A*/ 04310000
*        5 ECEJESS BIT(1),       /*   JESS SUPPORTS ENHANCED            04320000
*                                     SYSOUT SUPPORT (ESS) JCL   @H7A*/ 04330000
*        5 ECERPM  BIT(1),       /*   RPM IS ATTACHED            @09A*/ 04340000
*        5 ECEDPF  BIT(1),       /*   DPF IS ATTACHED            @09A*/ 04350000
*        5 ECEPSFD BIT(1),       /*   PSF DIRECT IS ATTACHED     @15A*/ 04360000
*        5 ECEWPM  BIT(1),       /*   WPM IS ATTACHED            @23A*/ 04370000
*        5 *      BIT(3),        /*   RESERVED                   @23C*/ 04380000
*      3 ECEFORM  CHAR(8),          /* FORM NAME IN OUTPUT JCL   @08A*/ 04390000
*      3 ECEPRTDT CHAR(4),        /* PRINTER DEVICE TYPE STAMPED @11A*/ 04400000
*                                 /* ON THE PRINTER IN EBCDIC    @11A*/ 04410000
*                                 /* (FROM THE IPDS OPC, OR STM  @11A*/ 04420000
*                                 /* IF NONE IN THE OPC)         @11A*/ 04430000
*      3 ECEPRTMD CHAR(3),        /* PRINTER MODEL NUMBER STAMPED@11A*/ 04440000
*                                 /* ON THE PRINTER IN EBCDIC    @11A*/ 04450000
*                                 /* (FROM THE IPDS OPC, OR STM  @11A*/ 04460000
*                                 /* IF NONE IN THE OPC)         @11A*/ 04470000
*      3 *        CHAR(1),        /* RESERVED                    @12A*/ 04480000
*      3 ECEBTBL  PTR(31),        /* ADDR. OF BLOCK LETTER TABLES@12A*/ 04490000
*                                 /* DO NOT MODIFY ECEBTBL AS IT @12A*/ 04500000
*                                 /* IS USED BY APSUBLK          @12A*/ 04510000
*      3 ECEJOBLP FIXED(31),      /* LOGICAL PAGES IN THE JOB    @14A*/ 04520000
*      3 ECEJOBIM FIXED(31),      /* IMPRESSIONS(SIDES) IN JOB   @14A*/ 04530000
*      3 ECEJOBPP FIXED(31),      /* PHYSICAL SHEETS IN THE JOB  @HVC*/ 04540000
*                                 /* (includes header, message,  @JRA*/ 04550000
*                                 /*  and trailer sheets)        @JRA*/ 04560000
*      3 ECEWKPTR PTR(31),        /* @ OF AN EXIT WORK AREA      @H9A*/ 04570000
*      3 ECEWKLEN FIXED(31),      /* LENGTH OF AN EXIT WORK AREA @H9A*/ 04580000
*      3 ECETUPTR PTR(31),        /* ADDRESS OF THE SWBTU        @H9A*/ 04590000
*      3 ECETULEN FIXED(31),      /* LENGTH OF THE SWBTU         @H9A*/ 04600000
*      3 ECEREC FIXED(31),        /* LOGICAL RECORD COUNT        @05A*/ 04610000
*                                 /* THE COUNT DOES NOT INCLUDE  @05A*/ 04620000
*                                 /* HEADER OR TRAILER PAGE      @05A*/ 04630000
*                                 /* RECORD                      @05A*/ 04640000
*      3 ECELPCNT FIXED(31),      /* Logical page count for the  @JRC*/ 04650000
*                                 /* data set (includes header   @JRC*/ 04660000
*                                 /* and trailer pages)          @JRC*/ 04670000
*      3 ECEPPCNT FIXED(31),      /* Physical sheet count for    @JRC*/ 04680000
*                                 /* the data set (includes      @JRC*/ 04690000
*                                 /* header and trailer sheets)  @JRC*/ 04700000
*                                 /*                            3@HVD*/ 04710000
*      3 ECEDSCNT FIXED(32),      /* PHYSICAL DUPLEX SHEET COUNT.@HVA*/ 04720000
*                                 /* COUNT INCLUDES HEADER OR    @HVA*/ 04730000
*                                 /* TRAILER SHEETS.             @HVA*/ 04740000
*      3 ECESSCNT FIXED(32),      /* PHYSICAL SIMPLEX SHEET CNT. @HVA*/ 04750000
*                                 /* COUNT INCLUDES HEADER OR    @HVA*/ 04760000
*                                 /* TRAILER SHEETS.             @HVA*/ 04770000
*      3 ECENUP1C FIXED(32),      /* PHYSICAL N-Up 1 SHEET CNT.  @HVA*/ 04780000
*                                 /* COUNT INCLUDES HEADER OR    @HVA*/ 04790000
*                                 /* TRAILER SHEETS.             @HVA*/ 04800000
*      3 ECENUP2C FIXED(32),      /* PHYSICAL N-Up 2 SHEET CNT.  @HVA*/ 04810000
*                                 /* COUNT INCLUDES HEADER OR    @HVA*/ 04820000
*                                 /* TRAILER SHEETS.             @HVA*/ 04830000
*      3 ECENUP3C FIXED(32),      /* PHYSICAL N-Up 3 SHEET CNT.  @HVA*/ 04840000
*                                 /* COUNT INCLUDES HEADER OR    @HVA*/ 04850000
*                                 /* TRAILER SHEETS.             @HVA*/ 04860000
*      3 ECENUP4C FIXED(32),      /* PHYSICAL N-Up 4 SHEET CNT.  @HVA*/ 04870000
*                                 /* COUNT INCLUDES HEADER OR    @HVA*/ 04880000
*                                 /* TRAILER SHEETS.             @HVA*/ 04890000
*      3 ECESCPY FIXED(15),       /* Separator copy count        @EVC*/ 04900000
*      3 ECETXMS FIXED(15),       /* TOTAL TRANSMISSIONS REQUIRED    */ 04910000
*                                 /*                             @GWC*/ 04920000
* /*                                                                 */ 04930000
* /* The following addresses are valid only for assembler exits  @ECA*/ 04940000
* /*                                                                 */ 04950000
*      3 ECEX01P PTR(31),           /* ADDR OF EXIT APSUX01      @01A*/ 04960000
*      3 ECEX02P PTR(31),           /* ADDR OF EXIT APSUX02      @01A*/ 04970000
*      3 ECEX03P PTR(31),           /* ADDR OF EXIT APSUX03      @01A*/ 04980000
*      3 ECEX04P PTR(31),           /* ADDR OF EXIT APSUX04      @01A*/ 04990000
*      3 ECEX05P PTR(31),           /* ADDR OF EXIT APSUX05      @01A*/ 05000000
*      3 ECEX06P PTR(31),           /* ADDR OF EXIT APSUX06      @03C*/ 05010000
*      3 ECEX07P PTR(31),           /* ADDR OF EXIT APSUX07      @U7C*/ 05020000
*      3 ECEX08P PTR(31),           /* Addr of exit APSUX08      @26C*/ 05030000
*      3 ECEX09P PTR(31),           /* RESERVED                  @01A*/ 05040000
*      3 ECEX10P PTR(31),           /* RESERVED                  @01A*/ 05050000
*      3 ECEX11P PTR(31),           /* RESERVED                  @01A*/ 05060000
*      3 ECEX12P PTR(31),           /* RESERVED                  @01A*/ 05070000
*      3 ECEX13P PTR(31),           /* RESERVED                  @01A*/ 05080000
*      3 ECEX14P PTR(31),           /* ADDR OF EXIT APSUX14      @18C*/ 05090000
*      3 ECEX15P PTR(31),           /* ADDR OF EXIT APSUX15      @17C*/ 05100000
*      3 ECEX16P PTR(31),           /* ADDR OF EXIT APSUX16      @H7C*/ 05110000
*      3 ECEIMPS FIXED(31),         /* IMPRESSIONS(SIDES)        @14A*/ 05120000
*                                   /* PRINTED FOR THE DATA SET  @14A*/ 05130000
*      3 ECEDSID CHAR(12),          /* FSI GETDS DATASET ID      @17A*/ 05140000
*      /*      deleted comment about Download for z/OS only      @21D*/ 05150000
*      3 ECELMO  PTR(31),           /* RESERVED FOR LMO CODE     @19A*/ 05160000
*      3 ECEPUTC PTR(31),           /* Addr of APSUPUTC          @ECA*/ 05170000
*      3 ECEBLKC PTR(31),           /* Addr of APSUBLKC          @ECA*/ 05180000
*      3 ECEFSSNM CHAR(8),          /* FSS name(Writer proc name)@28A*/ 05190000
*      3 ECEFCB   CHAR(4),          /* FCB name in OUTPUT JCL    @30A*/ 05200000
*      3 ECELTXMS  FIXED(32),       /* TOTAL TRANSMISSIONS REQUIRED  */ 05210000
*                                   /*                           @GWA*/ 05220000
*      3 ECELTRNC  FIXED(32),       /* CURRENT TRANSMISSION COUNT    */ 05230000
*                                   /*                           @GWA*/ 05240000
*      3 * CHAR(4);                 /* RESERVED                  @GWC*/ 05250000
*/********************************************************************/ 05260000
*/*                   CONTROL BLOCK CONSTANTS                        */ 05270000
*/********************************************************************/ 05280000
*DCL ECAIDC CHAR(4) CONSTANT ('UECA');/* CONTROL BLOCK ID            */ 05290000
*DCL ECEIDC CHAR(4) CONSTANT ('UECE');/* CONTROL BLOCK ID        @01A*/ 05300000
*DCL ECAPTFC CHAR(6) CONSTANT('000000');/* PTF DATE                  */ 05310000
*DCL ECEPTFC CHAR(6) CONSTANT('000000');/* PTF DATE              @01A*/ 05320000
*DCL ECARELC CHAR(2) CONSTANT('18');/* RELEASE LEVEL             @JMC*/ 05330000
*DCL ECERELC CHAR(2) CONSTANT('18');/* RELEASE LEVEL             @JMC*/ 05340000
*DCL ECAMINLN BIT(16) CONSTANT('07F7'X);/* MIN LENGTH OF APSUECA @H7C*/ 05350000
*DCL ECAMFCSA BIT(8)  CONSTANT('F5'X);  /* ACTIVATE MARK FORM CS @07A*/ 05360000
*DCL ECAPSF   FIXED(8) CONSTANT(01);  /* PSF product type        @FNA*/ 05370000
*DCL ECADOWN  FIXED(8) CONSTANT(02);  /* Download product type   @FNA*/ 05380000
*DCL ECAAFPDP FIXED(8) CONSTANT(03);  /* AFP Download Plus           */ 05390000
*                                     /* product type            @FNA*/ 05400000
