*/********************************************************************/         
*/*                                                                  */         
*/* $MAC(ARCFSR2) COMP(DATA) PROD(DFHSM):                            */         
*/* *** ARCFSR2  ***                                                 */         
*/*                                                                  */         
*/* DESCRIPTION -                                                    */         
*/*   ARCFSR2 -- HSM FUNCTION STATISTICS RECORD REFORMATTED          */         
*/*                                                                  */         
* /*******************************************************************/         
* /*PROPRIETARY V3 STATEMENT                                         */         
* /*LICENSED MATERIALS - PROPERTY OF IBM                             */         
* /*"RESTRICTED MATERIALS OF IBM"                                    */         
* /*5650-ZOS                                                         */         
* /*COPYRIGHT IBM CORP. 2009, 2021                                   */         
* /*END PROPRIETARY V3 STATEMENT                                     */         
* /*******************************************************************/         
*/*                                                                  */         
*/* FUNCTION    -                                                    */         
*/*         THIS IS A MAPPING AFTER REFORMAT FOR RMM.                */         
*/*         FSR2.... RECORDS MAINTAIN A 1:1 NAMING RELATIONSHIP      */         
*/*         WITH FSR.... RECORDS.  A '2' IS INSERTED AFTER 'FSR'     */         
*/*         OR A '2' OVERLAYS AN UNDERSCORE FOLLOWING 'FSR' IN THE   */         
*/*         VARIABLE NAME.  NAMED BITS ARE NOT REMAPPED.             */         
*/*                                                                  */         
*/*         FSR RECORDS ARE WRITTEN TO THE HSM LOG AND SMF           */         
*/*         (IF REQUESTED) FOR EACH DATA SET PROCESSED BY HSM        */         
*/*         IT CONTAINS STATISTICS AND INFORMATION RELATING          */         
*/*         TO THE PROCESSING OF THE REQUEST.                        */         
*/*                                                                  */         
*/* METHOD OF ACCESS                                                 */         
*/*        ASM  ARCFSR2                                              */         
*/* CHANGE ACTIVITY - SEE BELOW                                      */         
*/* $P0=HSMPR,Z1A,030507,THMB: NEW MAPPING MACRO                 @PRA*/         
*/* $PR=HSMPR,Z1A,120507,THMB: K1A1878 rollin BACKDS NEWNAME and     */         
*/*                            OVERRIDE BSGS                   P1@PRA*/         
*/* $PR=HSMPR,Z1A,121207,THMB: K1A1945 Add reserve space       P2@PRA*/         
*/* $ER-HSMER,Z1A,022008,THI9-6: PTM K1A2275 F9 attrs lost during    */         
*/*                              DSS RESTORE                   P1@ERA*/         
*/* $LS=HSMLS,B10,073108,THI9-10: ML1 Enhancements               @LSA*/         
*/* $RS=HSMRS,B10,043008,THA5: BACKDS RETAINDAYS support.        @RSA*/         
*/* $RS-HSMRS,B10,011209,THHF: K1B0832 DSBRP support.          1P@RSA*/         
*/* $VT=HSMVT,C10,082109,THI9-15: EAV R3 support                 @VTA*/         
*/* $VT=HSMVT,C10,100809,THI9-6: K1C0820 - Update comments     1P@VTA*/         
*/* $ZT=HSMZT,C10,122109,THGS: K1C1184 - Update comments         @ZTA*/         
*/* $ZV=HSMZV,D10,020211,THI9-9: K1D0904 - Update comments       @ZVA*/         
*/* $SW=OA36293,D10,042511,THGS: Tape Infrastructure             @SWA*/         
*/*                              Enhancements Coexistence        @SWA*/         
*/* $SW=HSMSW,210,042511,THGS: Tape Infrastructure             1P@SWA*/         
*/*                            Enhancements                    1P@SWA*/         
*/* $TW=HSMTW,210,080411,THI9-15: Storage Tiers                  @TWA*/         
*/* $VW=HSMVW,210,081913,THVV: OA43142-Correct copyright         @01C*/         
*/* $01=HSM01,210,010714,THVV: OA44167-Added * in above comment  @01A*/         
*/* $CW=OA50697,220,060616,THI9-15: Cloud Support                @CWA*/         
*/* $UY=HSMUY,230,021919,THWA: UNIX file support                 @UYA*/         
*/* $02=OA57834,240,060619,THAM: FSR DS Compression              @02A*/         
*/* $C8=OA59466,240,040120,THL9: TCT Compression Support SPE     @C8A*/         
*/* $C9=OA60278,250,010722,THL9: TCT Full Volume Dump SPE        @C9A*/         
*/* $03=OA63889,250,101222,THJH: FSR2DEVT not appearing          @03A*/         
*/*                              correctly in generated reports  @03A*/         
*/********************************************************************/         
*/*                                                                  */         
*/* NOTE: This macro must reflect any changes in ARCFSR.             */         
*/*                                                                  */         
*/********************************************************************/         
         MACRO                                                                  
&NAME ARCFSR2                                                                   
FSR2      DSECT          FUNCTIONAL STATISTICS RECORD (SMF)                     
FSR2LEN   DS    H        SMF RDW RECORD LENGTH                                  
FSR2SEG   DS    H        SMF RDW SEGMENT DESCRIPTOR                             
FSR2FLG   DS    B        SMF OPERATING ENVIRONMENT                              
FSR2RTY   DS    X        SMF RECORD TYPE                                        
FSR2TME   DS    BL4      SMF TOD REC WRITTEN                                    
FSR2DTE   DS    BL4      SMF DATE REC WRITTEN                                   
FSR2SID   DS    CL4      SYSTEM ID FROM INSTALLATION                            
FSR2JBN   DS    CL8      JOB NAME REQUESTING SERVICE                            
FSR2RST   DS    BL4      JOB START TIME IN .01 SEC                              
FSR2RSD   DS    CL8      JOB START DATE IN YYYYDDD                              
FSR2UID   DS    CL8      USERID REQUESTING SERVICE                              
FSR2TYPE  DS    X        FUNCTION TYPE - Use browse (M) macro                   
*    Dec 1 X'01'           MIGRATE L0->L1                                       
*    Dec 2 X'02'           MIGRATE L1->L2                                       
*    Dec 3 X'03'           MIGRATE L0->L2                                       
*    Dec 4 X'04'           RECALL L1->L0                                        
*    Dec 5 X'05'           RECALL L2->L0                                        
*    Dec 6 X'06'           DEL MIG DS                                           
*    Dec 7 X'07'           DAILY BACKUP                                         
*    Dec 8 X'08'           BACKUP SPILL                                         
*    Dec 9 X'09'           RECOVER                                              
*   Dec 10 X'0A'           RECYCLE                                              
*   Dec 11 X'0B'           DEL BY AGE                                           
*   Dec 12 X'0C'           RECYCLE MIGRATION VOL                                
*   Dec 13 X'0D'           FULL VOLUME DUMP                                     
*   Dec 14 X'0E'           VOLUME OR DS RESTORE                                 
*   Dec 15 X'0F'           Used for ABACKUP                                     
*   Dec 16 X'10'           Used for ARECOVER                                    
*   Dec 17 X'11'           Expire L0 or migrated DS                             
*   Dec 18 X'12'           Partrel                                              
*   Dec 19 X'13'           Expire Incremental backup vers                       
*   Dec 20 X'14'           Delete Incremental backup vers                       
*   Dec 21 X'15'           FRBACKUP                                             
*   Dec 22 X'16'           FRRECOVER                                            
*   Dec 23 X'17'           FRDELETE                                             
*   Dec 24 X'18'           Class transition                                     
*   Dec 25 X'19'           Migration to cloud                     @CWA          
*   Dec 26 X'1A'           Recall from cloud                      @CWA          
FSR2FLAGS DS    B        FSR FLAGS                                              
FSR2FFSTR EQU   X'80'    1=FROM A STRIPED DATA SET                              
FSR2FTSTR EQU   X'40'    1=TO A STRIPED DATA SET                                
FSR2F32K  EQU   X'20'    1=DATA SET IS GREATER THAN 32K TRACKS         *        
                         USE FIELDS FSRTRKKR AND FSRTRKKW              *        
                         RATHER THAN FSRTRKR AND FSRTRKW                        
FSR2FKB   EQU   X'10'    1=DATA SET IS GREATER THAN 2GB                         
FSR2FVER  EQU   X'08'    Used in ARCFSR only                                    
FSR2FNONQ EQU   X'04'    1=DIRECTED NOT TO SERIALIZE (ENQ) BEFORE COPY          
FSR2FNQN1 EQU   X'02'    1=DSET WAS BACKED-UP ALTHOUGH ENQ FAILED(ONCE)         
FSR2FNQN2 EQU   X'01'    1=ENQ FAILED, BU RETRIED, ENQ FAILED AGAIN             
FSR2DSN   DS    CL44     DSN!CP NAME IF TYPE = 21 !  22  !  23    @ZVC          
FSR2TVOL  DS    CL6      RECEIVING VOLUME FROM MWE                              
FSR2DEVT  DS    XL4      RECEIVING DEVICE TYPE                    @03C          
FSR2FVOL  DS    CL6      SOURCE VOLUME Use browse macro (M)                     
*                        SOURCE VOLUME represents both                          
*                        FSRFVOL (from volume)                                  
*                        and FSR_RECYCLE_SOURCE_VOLUME.                         
FSR2CLIP  DS    CL6      RESTORE TARGET VOL                                     
          DS    CL2      RESERVED                                               
FSR2GEN   DS    BL4      BACKUP GEN NUM                                         
FSR2VER   DS    BL4      BACKUP VER NUM                                         
FSR2DATE  DS    CL8      BU DATE IF RECOVERY AS YYYYDDD                         
FSR2RC    DS    BL4      RETURN CODE FROM MWE                                   
FSR2REAS  DS    BL4      REASON CODE FROM MWE                                   
FSR2ABCC  DS    CL4      ABEND CODE                                             
FSR2DARC  DS    BL2      DYNALLOC RETURN CODE                                   
FSR2GRP   DS    CL8      RACF GROUP NAME                                        
FSR2RACF  DS    B        RACF FLAGS FROM ACEEFLG1                               
FSR2MFLGS DS    B        FLAGS FROM MWE: Use browse macro (M)                   
FSR2FRTRY EQU   X'80'    WHEN SET TO 1, THE BACKUP COPY WAS MADE       *        
                         DURING A RETRY, AFTER THE 1ST TRY FAILED      *        
                         BECAUSE THE DATA SET WAS IN USE.                       
FSR2F_REMOTE EQU X'40'   When set to 1, the request was completed      *        
                         successfully on a remote system.                       
FSR2FPIGB EQU   X'20'    When set to 1, the request was completed      *        
                         using a tape already mounted                           
FSR2F_REMOTE_HOST_PROCESSED EQU X'10' MWE processed by remote host              
FSR2F_DASD EQU  X'08'    ON= the DASD copy of the version was deleted           
FSR2F_DUMPCPY EQU X'04'  ON= The dump class of copy pool dump was      *        
                         deleted                                                
FSR2F_DUMPVER EQU X'02'  ON=the whole dump version of copy pool ver    *        
                         was deleted                                            
FSR2F_COPYPOOL_FRDUMP EQU X'01' FR dump/restore                                 
FSR2RQN   DS    BL4      DFSMSHSM REQUEST NUMBER                                
FSR2DATR  DS    CL8      DATE OF REQUEST - YYYYDDD                              
FSR2TIMR  DS    BL4      TIME OF REQUEST - X'HHMMSSTH'                          
FSR2TIMS  DS    BL4      TIME REQUEST STARTED - X'HHMMSSTH'                     
FSR2TIME  DS    BL4      TIME REQUEST COMPLETED - X'HHMMSSTH'                   
FSR2TIMA  DS    BL4      TIME DS ALLOC COMPLETED - X'HHMMSSTH'                  
FSR2DLU   DS    CL8      JULIAN DS LAST REF(MIG) OR CHG(BU)                     
*                        DATA SET LAST REFERENCE JULIAN DATE FOR                
*                        MIGRATION OR THE LAST CHANGE JULIAN DATE               
*                        FOR BACKUP.                                            
FSR2DLM   DS    CL8      JULIAN DS MOVED (MIG,BU,RECALL)                        
*                        JULIAN DATE DS WAS LAST MOVED,                         
*                        MIGRATED, BACKED UP, OR RECALLED.                      
FSR2BYTR  DS    F        KB READ                                                
FSR2BYTW  DS    F        KB WRITE                                               
FSR2TRKR  DS    H        TRACKS FREED!READ IF LESS THAN 32K                     
*                        THIS FIELD IS ALSO AVAILABLE IN FSR2TRKKR              
*                        AS K-TRACKS.                                           
FSR2TRKW  DS    H        TRACKS WRITTEN IF LESS THAN 32K                        
*                        THIS FIELD IS ALSO AVAILABLE IN FSR2TRKKW              
*                        AS K-TRACKS.                                           
FSR2DORG  DS    BL2      DSORG OF SOURCE                                        
FSR2FVSDS EQU   X'0008'  ON IF VSAM DATA SET                      @RSA          
FSR2F9ATT EQU   X'0002'  Types 4,5,9,14 - on if F9 DSCB         1P@VTC          
*                        attributes lost                        1P@VTA          
FSR2FLG2  DS    BL2      REQUEST FLAGS: Use browse macro (M)                    
FSR2FMNT  EQU   X'80'    ON IF VOLUME MOUNTED FOR REQUEST                       
FSR2TSO   EQU   X'40'    ON IF TSO REQUEST, OFF FOR BATCH                       
FSR2USER  EQU   X'20'    ON IF SINGLE DATA SET REQUEST, OFF IF VOLUME  *        
                         REQUEST                                                
FSR2WAIT  EQU   X'10'    ON IF WAIT REQUEST, OFF IF NOWAIT                      
FSR2FDAT  EQU   X'08'    ON IF FSRDATE FIELD HAS DATE                           
FSR2FRSV  EQU   X'04'    ON IF USER SPECIFIED VOLUME FOR RESTORE OF    *        
                         DATA SET                                               
FSR2FML2  EQU   X'02'    ON IF USER SPECIFIED LEVEL 2 FOR MIGRATION OF *        
                         DATA SET                                               
FSR2FFRV  EQU   X'01'    ON IF USER SPECIFIED FROM VOLUME FOR RESTORE  *        
                         BACKUP COPY (RBC)                                      
FSR2FREP  EQU   X'80'    ON IF USER SPECIFIED REPLACE FOR RESTORE      *        
                         BACKUP COPY (RBC)                                      
FSR2FDSRE EQU   X'40'    ON IF STATISTICS ASSOCIATED WITH A DATA SET   *        
                         RESTORE FROM A FULL VOLUME DUMP ARE BEING     *        
                         REQUESTED                                              
FSR2FAPIN EQU   X'20'    ON IF APPLYINCREMENTAL HAS BEEN REQUESTED     *        
                         FOLLOWING A FULL VOLUME DUMP                           
FSR2FEXT  EQU   X'10'    ON IF EXTENT REDUCTION REQUEST                         
FSR2FCNVT EQU   X'08'    ON IF CONVERT REQUEST                                  
FSR2FROG  EQU   X'04'    ON IF ROLLED-OFF GDS                                   
FSR2FDSS  EQU   X'02'    ON, DFDSS MOVEMENT                                     
FSR2FT0   EQU   X'01'    ON, BACKUP USED T0 COPY                                
FSR2CPU   DS    F        CPU TIME IN .01 SECONDS                                
FSR2AGE   DS    BL2      AGE: Use browse macro (M)                              
*                        AGE SINCE LAST REF IF MIGRATE                          
*                        SINCE LAST UPDATE FOR BACKUP                           
*                        SINCE MIGRATE FOR RECALL               P2@PRC          
*                        SINCE LAST UPDATE FOR RBC                              
FSR2RECFM DS    B        RECORD FORMAT FROM DSCB                                
FSR2OPTCD DS    B        I/O OPTION CODES FROM DSCB                             
FSR2DS_MOUNT DS H        # RECALLS/RECOVERS FROM MOUNTED TAPE                   
FSR2RECALL_RETRIES DS X  # OF ATTEMPTS TO RECALL A DATA SET                     
FSR2F_LFS_COPY      EQU X'80' On if migration copy or backup                    
*                             version is LFS                    1P@VTC          
FSR2F_ML1_OVERFLOW  EQU X'40' On if migration copy or backup                    
*                             version is on ML1 OVERFLOW volume 1P@VTC          
FSR2F_NOOVERFLOW_DS EQU X'20' ON - NOOVERFLOW eligible data set                 
*                             has been redirected up to a       1P@VTC          
*                             OVERFLOW volume                   1P@VTC          
FSR2F_OVERFLOW_DS   EQU X'10' ON - OVERFLOW eligible data set has               
*                             been redirected up to             1P@VTC          
*                             a NOOVERFLOW volume               1P@VTC          
FSR2COPYMETHOD DS X      FR METHOD: 1-NONE 2-PREF 3-REQUIRED                    
FSR2RECYCLE_COUNTER DS X NUM TIMES RECYCLED                                     
FSR2FLG5 DS X            Additional flags: Use browse macro (M) P1@PRA          
FSR2FBACKDS_NEWNAME EQU X'80' For Type=7 ON=NEWNAME specified          *        
                         at time of backup                      P1@PRA          
FSR2FBACKDS_NOSPHERE EQU X'40' For Type=7 ON=NOSPH processed           *        
                         at time of backup                      P1@PRA          
FSRF2BACKDS_RD_SPCD EQU X'20' ON=RETAINDAYS specified at backup 1P@VTC          
*                        time                                   1P@VTA          
FSRF2BACKDS_NEVER_EXP EQU X'10' ON=The version will never expire 1P@VTC         
*                        Only valid when FSRF_BACKDS_RD_SPCD    1P@VTC          
*                        is 1                                   1P@VTA          
          DS    CL2      RESERVED                               P1@PRC          
FSR2SRCDEV DS   XL2      LAST2 DEVTYPE RECALL/RECOVER/RECYCLE                   
*                        LAST 2 BYTES OF DEVTYPE                                
FSR2SCLEN DS    BL2      LENGTH OF STORAGE-CLASS NAME                           
FSR2SCNAM DS    CL8      1ST 8 CHAR OF STORAGE-CLASS NAME                       
FSR2TRKKR DS    F        K-TRACKS FREED!READ                                    
FSR2TRKKW DS    F        K-TRACKS WRITTEN                                       
FSR2MCLEN DS    BL2      MGMT CLASS LENGTH                                      
FSR2MCNAM DS    CL8      MGMT CLASS NAME                                        
FSR2FLG3  DS    B        REQUEST FLAGS:  Use browse macro (M)                   
FSR2FVINI EQU   X'80'    1=DS recovery SCHEDULED FROM A VOLUME REQUEST          
FSR2FXPL1 EQU   X'40'    On indicates that the data set being expired  *        
                         is from ML1 volume                                     
FSR2FXPL2 EQU   X'20'    On indicates that the data set being expired  *        
                         is from ML2 volume                                     
FSR2FEXBV EQU   X'10'    On indicates that the backup version is being *        
                         deleted by the EXPIREBV command                        
FSR2FBKTP EQU   X'08'    On indicates that the backup version being    *        
                         deleted is on a tape volume                            
FSR2FEXDT EQU   X'04'    On indicates that the data set is being       *        
                         deleted by expiration date or management      *        
                         class age attributes                                   
FSR2RECON EQU   X'02'    ON INDICATES DATA SET WAS MIGRATED VIA        *        
                         RECONNECTION                                           
FSR2F_RECALL_TAKEAWAY EQU X'01' When set to 1, this recall caused a    *        
                         tape-takeaway.                                         
FSR2FLG4  DS    B        FLAGS: Use browse macro (M)                            
FSR2F_FRRECOV_DSNAME EQU X'80' On = This is a FRRECOV DSNAME request            
FSR2F_FRRECOV_FROMDISK EQU X'40' On = Recovery will be performed from  *        
                         disk. Only set if FSRF_FRRECOV_DSNAME is also *        
                         set.                                                   
FSR2F_MULT_DSNAMES EQU X'20' On = Multiple data set names were         *        
                         specified. Only set for Type 22 FSRs.                  
FSR2F_MULTIVOLUME EQU X'10' On = One part of a multivolume data set.   *        
                         Only set if FSRF_FRRECOV_DSNAME is also set.           
FSR2F_ALTERPRI EQU X'08' On = The priority of this request was altered *        
                         via the ALTERPRI command.                              
FSR2F_ALTERPRI_HI EQU X'04' On = HIGH keyword spec'd on the ALTERPRI   *        
                         cmd. Off = LOW keyword spec'd on the ALTERPRI *        
                         cmd. This flag only applies when              *        
                         FSRF_ALTERPRI = ON                                     
FSR2F_INC EQU   X'02'    ON=A CP incremental version was processed by  *        
                         either Fast Replication backup or Fast        *        
                         Replication recover                                    
FSR2F_CPBSG EQU X'01'    ON=FRBACKUP override CPBSG            P1@PRA           
FSR2TIMS2 DS    BL4      TIME PRE-PROCESS COMPLETE X'HHMMSSTH'                  
FSR2TIMM1 DS    BL4      TIME DATA MOVEMENT START X'HHMMSSTH'                   
FSR2TIMM2 DS    BL4      TIME DATA MOVEMENT COMP X'HHMMSSTH'                    
FSR2TIME1 DS    BL4      TIME POST-PROCESS START X'HHMMSSTH'                    
FSR2NENT1 DS    H        # TAPE VOL OR # RECYCLE INPUT VOL                      
FSR2NENT2 DS    H        # RECYCLE OUTPUT TAPES                                 
FSR2DCOPR DS    H        # OF DUMP COPIES REQUESTED                             
FSR2DCOPF DS    H        # OF ATTEMPTED FAILED DUMP COPIES                      
FSR2CPNAME DS   CL40     CP NAME WHEN FSR2F_FRRECOV_DSNAME=1                    
FSR2DCLA1 DS    CL8      DUMP CLASS 1                                           
FSR2DCLA2 DS    CL8      DUMP CLASS 2                                           
FSR2DCLA3 DS    CL8      DUMP CLASS 3                                           
FSR2DCLA4 DS    CL8      DUMP CLASS 4                                           
FSR2DCLA5 DS    CL8      DUMP CLASS 5                                           
FSR2HOST  DS    CL2      HOST IDENTIFIER                                        
FSR2ORGNL_HID DS CL2     HOST ID GENERATING REQUEST IF RECALL                   
FSR2FR_REAS DS  F        FAST REP RETURN CODE                                   
FSR2PSQTY DS    F        # TRKS NEEDED IF NOT ENOUGH ML1 ERR                    
FSR2BACKDS_RETAINDAYS DS H   RETAINDAYS value for ds backup       @RSA          
FSR2FLG6  DS    B        MORE FLAGS                               @VTA          
FSR2FMB   EQU   X'80'    1= FSRBYTR AND FSRBYTW ARE IN MBYTES     @VTA          
FSR2FXPLC EQU   X'40'    1= EXPIRED DATA SET FROM CLOUD           @CWA          
FSR2UNIX  EQU   X'20'    1= RECORD FOR UNIX FILE - FILE NAME      @UYA          
*                        AREA AFTER FSR2TAPE + FSRNENT1+FSRNENT2  @UYA          
FSR2_COMP EQU   X'10'    1= Compressed Data Set                   @02A          
FSR2_ZEDC EQU   X'08'    1= DS was zEDC compressed during migrate @02A          
FSR2F_CLD_COMP EQU X'02' 1= Data was TCT compressed               @C8A          
FSR2F_CLD_ENCRYPT EQU X'01' 1=Data was TCT encrypted              @C8A          
FSR2FLG7  DS    B        MORE FLAGS                               @C9A          
FSR2F_CLOUD EQU X'80'    1= Record is for TCT full volume dump    @C9A          
*                        or restore (cloud)                       @C9A          
FSR2_USER_DATASIZE DS F  VALID WHEN FSR2_COMP IS SET. THIS VALUE  @02A          
*                        REPRESENTS IN KB (1024) WHAT THE DATA    @02A          
*                        SIZE WOULD BE IF IT WERE NOT COMPRESSED. @02A          
FSR2_COMP_DATASIZE DS F  VALID WHEN FSR2_COMP IS SET. THIS VALUE  @02A          
*                        REPRESENTS IN KB (1024) THE ACTUAL       @02A          
*                        COMPRESSED DATA SIZE.                    @02A          
FSR2_ZEDC_COMPRESS_PRCNT DS XL1  VALID ONLY WHEN FSR2_ZEDC IS SET.@02A          
*                        REPRESENTS THE PERCENT SAVED BY ZEDC COMP@02A          
FSR2_CLD_COMPRESS_PRCNT DS XL1   Percent space saved by TCT       @C8A          
*                        compression during migration.            @C9C          
*                        Valid when FSR2F_CLD_COMP=1              @C8A          
          DS    CL30     RESERVED                                 @C9C          
FSR2TAPE  DS    0CL6096  TAPE VOL ENTRY: Use browse macro (M)   1P@SWC          
*                        MAXIMUM OF 254 INPUT AND 254 OUTPUT ENTRIES            
FSR2TPVOL DS    CL6      1ST VOLSER                                             
FSR2TFLGS DS    B        FLAGS THIS VOL: Use browse macro (M)  P2@PRC           
FSR2FTKB  EQU   X'80'    WHEN SET TO 1, MORE THAN 2GB WORTH OF DATA -  *        
                         FSR2TBYBK REPRESENTS KBYTES (1024 BYTES).     *        
                         WHEN SET TO 0, LESS THAN 2GB WORTH OF DATA -  *        
                         FSR2TBYBK REPRESENTS BYTES.                            
FSR2FTMB  EQU   X'20'    WHEN SET TO 1, MORE THAN 2TB WORTH OF DATA -  *        
                         FSR2TBYBK REPRESENTS MBYTES (1024 KBYTES).    *        
                         WHEN SET TO 0, LESS THAN 2TB WORTH OF DATA -  *        
                         FSR2TBYBK REPRESENTS BYTES OR KBYTES.    @VTA          
FSR2FALT  EQU   X'40'    WHEN SET TO 1, the output DS is duplexed.              
          DS    CL1      RESERVED                                               
FSR2TBYBK DS    F        B/KB/BLK RD/WR: Use browse macro (M)                   
*                        BACKUP DATA WRITTEN:                                   
*                        BYTES IF FSR2FTKB=0 ELSE KBYTES                        
*                        RECOVER DATA WRITTEN:                                  
*                        BYTES IF FSR2FTKB=0 ELSE KBYTES                        
*                        BLOCKS READ IF RECYCLE INPUT.                          
*                        BLOCKS WRITTEN IF RECYCLE OUTPUT.                      
          ORG   FSR2TAPE Cloud info starts at tape info location  @CWA          
FSR2CLOUD DS    0CL130   Cloud location entry                     @CWA          
FSR2CLNML DS    CL2      Construct name length                    @CWA          
FSR2CLNM  DS    CL30     SMS cloud construct name                 @CWA          
FSR2CLCNT DS    CL44     HSM container used                       @CWA          
FSR2CLOB# DS    F        Count of objects created                 @CWA          
FSR2PFXNM DS    CL44     Object prefix                            @C9C          
FSR2CLFVD_COMP_PRCNT DS XL1       Percent space saved by TCT      @C9A          
*                        compression during full volume dump.     @C9A          
*                        Valid when FSR2F_CLD_COMP=1              @C9A          
          DS    CL49     Reserved                                 @C9C          
*                        Is found after FSRTAPE + FSR2NENT1 +     @UYA          
*                        FSR2NENT2                                              
FSR2_UNIX DSECT          UNIX filename area                       @UYA          
FSR2_UNML DS    H        Length of UNIX file name                 @UYA          
FSR2_FLGS DS    BL2      UNIX file flags                          @UYA          
FSR2_UNAM DS    CL1024   UNIX file name characters                @UYA          
         MEND                                                                   
