*/*                                                                  */ 00010000
*/*    *************** START OF SPECIFICATIONS ***********************/ 00020000
*/*  MACRO-NAME = ASCRE                                              */ 00030000
*/*                                                                  */ 00040000
*/*  DESCRIPTIVE-NAME = Address Space Services Create                */ 00050000
*/*                                                                  */ 00060000
*/*  COPYRIGHT =                                                     */ 00070000
*/*             5650-ZOS                                             */ 00080001
*/*             COPYRIGHT IBM CORP. 1988,2013                        */ 00090001
*/*             LICENSED MATERIALS - PROPERTY OF IBM                 */ 00100000
*/*                                                                  */ 00110000
*/*  STATUS = HBB7790                                                */ 00120001
*/*                                                                  */ 00130000
*/*01* EXTERNAL CLASSIFICATION:                                      */ 00140001
*/*01*     PI: BASE                                                  */ 00150001
*/*01*     NOTPI: MAXRGN, KEEPRGN                                    */ 00160002
*/*                                                                  */ 00170001
*/*                                                                  */ 00180001
*/*01* END OF EXTERNAL CLASSIFICATION:                               */ 00190000
*/*                                                                  */ 00200000
*/*  LIBRARY = MACLIB                                                */ 00210000
*/*                                                                  */ 00220000
*/*  FUNCTION = The ASCRE macro provides the interface to the        */ 00230000
*/*             Address Space Services Create service.               */ 00240000
*/*             The macro checks the parameters for the macro form   */ 00250000
*/*             specified and generates the parameter list for       */ 00260000
*/*             the service.  The macro can be invoked in either     */ 00270000
*/*             BAL or PL/S.                                         */ 00280000
*/*                                                                  */ 00290000
*/*  PROCESSOR = ASSEMBLER H                                         */ 00300000
*/*                                                                  */ 00310000
*/*  INPUT = Consists of keywords using the syntax described         */ 00320000
*/*          below.                                                  */ 00330000
*/*                                                                  */ 00340000
*/*     SYNTAX =   label ASCRE                                       */ 00350000
*/*                             ,ASNAME=op2 !                        */ 00360000
*/*                             ,STPARM=op1                          */ 00370000
*/*                                                                  */ 00380000
*/*                             ,INIT=op2                            */ 00390000
*/*                             ,ODA=op1                             */ 00400000
*/*                            <,TRMEXIT=op1                         */ 00410000
*/*                               <,UTOKEN=op1>>                     */ 00420000
*/*                            <,ASPARM=op1>                         */ 00430000
*/*                            <,ATTR=(attr1,...,attr-n)>            */ 00440000
*/*                            <,AXLIST=op1>                         */ 00450000
*/*                            <,TKLIST=op1                          */ 00460000
*/*                               <,LXLIST=op1>>                     */ 00470000
*/*                            <,MF=L !                              */ 00480000
*/*                             ,MF=(E,cntl-addr)>                   */ 00490000
*/*                            <,RELATED=op3>                        */ 00500000
*/*                                                                  */ 00510000
*/*  --------------------------------------------------------------- */ 00520000
*/*  ! macro    !                !                !                ! */ 00530000
*/*  ! form --> !  List          !  Standard      !  Execute       ! */ 00540000
*/*  ! ----------------------------------------------------------- ! */ 00550000
*/*  ! op1      ! A-type address ! A-type address ! Rx-type address! */ 00560000
*/*  !          !                ! or Register    ! or Register    ! */ 00570000
*/*  !          !                !  (2) - (12)    !  (2) - (12)    ! */ 00580000
*/*  ! ----------------------------------------------------------- ! */ 00590000
*/*  ! op2      ! C-type constant! C-type constant! C-type constant! */ 00600000
*/*  !          ! or A-type      ! or A-type      ! or Rx-type     ! */ 00610000
*/*  !          ! address        ! address or     ! address or     ! */ 00620000
*/*  !          !                ! Register       ! Register       ! */ 00630000
*/*  !          !                !  (2) - (12)    !  (2) - (12)    ! */ 00640000
*/*  ! ----------------------------------------------------------- ! */ 00650000
*/*  ! op3      ! May be any valid keyword value for all forms     ! */ 00660000
*/*  --------------------------------------------------------------- */ 00670000
*/*                                                                  */ 00680000
*/*   OUTPUT =  The macro builds a parameter list for the standard   */ 00690000
*/*             and list forms as described below.                   */ 00700000
*/*                                                                  */ 00710000
*/*      Hex        Mask/                                            */ 00720000
*/*     Offset      Length    COMMENTS                               */ 00730000
*/*                                                                  */ 00740000
*/*       0           1       Parameter list version number          */ 00750000
*/*       1           2       Attributes                             */ 00760000
*/*                X'8000'    XMPT                                   */ 00770000
*/*                X'4000'    PXMT                                   */ 00780000
*/*                X'2000'    NOMT                                   */ 00790000
*/*                X'1000'    NOMD                                   */ 00800000
*/*                X'0800'    1LPU                                   */ 00810000
*/*                X'0400'    2LPU                                   */ 00820000
*/*                X'0200'    N2LP                                   */ 00830000
*/*                X'0100'    PRIV                                   */ 00840000
*/*                X'0080'    NOSWAP                                 */ 00850000
*/*                X'0040'    PERM                                   */ 00860000
*/*                X'0020'    CANCEL                                 */ 00870000
*/*                X'0010'    Reserved                               */ 00880000
*/*                X'0008'    HIPRI                                  */ 00890000
*/*                X'0004'    NONURG                                 */ 00900000
*/*                X'0002'    KEEPRGN                                */ 00910000
*/*                X'0001'    REUSASID                           @L3A*/ 00920000
*/*                X'000080'  JOBSPACE                           @01A*/ 00930000
*/*                X'000040'  ASCBV31                            @L4A*/ 00940000
*/*                X'000020'  MAXRGN                             @P1A*/ 00950001
*/*       0           1       Parameter list version number      @01C*/ 00960000
*/*       1           3       Attributes                         @01C*/ 00970000
*/*                                                                  */ 00980000
*/*         4         4       Address of 8-byte init routine name    */ 00990000
*/*         8         4       INIT alet                              */ 01000000
*/*         C         4       Address of variable-length start       */ 01010000
*/*                           parm string                            */ 01020000
*/*        10         4       STPARM alet                            */ 01030000
*/*        14         4       Address of 8-byte utoken               */ 01040000
*/*        18         4       UTOKEN alet                            */ 01050000
*/*        1C         4       Address of variable-length ASPARM      */ 01060000
*/*        20         4       ASPARM alet                            */ 01070000
*/*        24         4       Exit routine address                   */ 01080000
*/*        28         4       Address of AX-list                     */ 01090000
*/*        2C         4       AXLIST alet                            */ 01100000
*/*        30         4       Address of LX-list                     */ 01110000
*/*        34         4       LXLIST alet                            */ 01120000
*/*        38         4       Address of TK-list                     */ 01130000
*/*        3C         4       TKLIST alet                            */ 01140000
*/*        40         4       Address of ODA                         */ 01150000
*/*        44         4       ODA alet                               */ 01160000
*/*        48         8       Reserved                               */ 01170000
*/*                                                                  */ 01180000
*/*  External-Macros = IHBERMAC, SYSSTATE                            */ 01190000
*/*                                                                  */ 01200000
*/*  CHANGE-ACTIVITY =                                               */ 01210000
*/*   $L0 =    AR    HBB3310 850901 PDXB: AR SUPPORT                 */ 01220000
*/*   $D1 = DCR0287  HBB3310 870909 PDFP: Remove Force option        */ 01230000
*/*   $L1 = COUPLASE HBB4410 870316 PDU8: KEEPRGN attribute support  */ 01240000
*/*                  OY23862 - Change Prologue Comment               */ 01250000
*/*   $L2 = NETSYHL  JBB4422 901112 PDHL: Netview Sysplex            */ 01260000
*/*   $L3 = LXREU   ,HBB7709,030801,PDXB: ASN-AND-LX-REUSE FACILITY  */ 01270000
*/*   $L4 = ASCBV31 ,HBB7730,050415,PDXB: ASCBV31                    */ 01280000
*/*   $01 = OA11021  HBB7707 050630 PDHD: JOBSPACE attribute support */ 01290000
*/*   $P1 = ME23072  HBB7790 111210 PDCS: MAXRGN   attribute support */ 01300001
*/*   $P2 = ME23545  HBB7790 120215 PDCS: Correct proprietary        */ 01310001
*/*                                       statement                  */ 01320001
*/*                                                                     01330000
*                                                                       01340000
         MACRO                                                          01350000
&XLAB    ASCRE &TRMEXIT=,&ASNAME=,&ASPARM=,&ATTR=,&AXLIST=,&INIT=,     *01360000
               &LXLIST=,&ODA=,&MF=I,&STPARM=,&TKLIST=,&UTOKEN=,        *01370000
               &ELXLIST=,&RELATED=                                      01380000
         LCLA  &XINIT                                                   01390000
         LCLA  &I                                                       01400000
         LCLA  &ZMACRET                                                 01410000
         LCLB  &B(24)                                                   01420000
         LCLC  &TEMP                                                    01430000
         LCLC  &LAB2                                                    01440000
&LAB2    SETC  '&XLAB'                                                  01450000
         LCLC  &LA                      "LA" OR "LAE" VIA SYSSTATE      01460000
         GBLC  &SYSASCE                                                 01470000
         SYSSTATE TEST                  TEST ASC ENVIRONMENT            01480000
&LA      SETC  'LA'                     MUST USE LA INSTRUCTION         01490000
         AIF   ('&SYSASCE' EQ 'P').NOLAE                                01500000
&LA      SETC  'LAE'                    MUST USE LAE                    01510000
.NOLAE   ANOP                                                           01520000
.*                                                                      01530000
.* No positional parameters allowed                                     01540000
         AIF   (N'&SYSLIST EQ 0).ZMLIST2                                01550000
         MNOTE 12,'***  IHB027  NO POSITIONAL PARAMETERS ARE ALLOWED.'  01560000
&ZMACRET SETA  12                                                       01570000
.ZMLIST2 ANOP                                                           01580000
.*                                                                      01590000
         AIF   (N'&STPARM LE 1).ZM1A                                    01600000
         MNOTE 12,'***  IHB247  MORE THAN 1 ARGUMENT SPECIFIED FOR THE *01610000
               STPARM PARAMETER.'                                       01620000
&ZMACRET SETA  12                                                       01630000
.ZM1A    ANOP                                                           01640000
.*                                                                      01650000
         AIF   (N'&ASNAME LE 1).ZM2A                                    01660000
         MNOTE 12,'***  IHB247  MORE THAN 1 ARGUMENT SPECIFIED FOR THE *01670000
               ASNAME PARAMETER.'                                       01680000
&ZMACRET SETA  12                                                       01690000
.ZM2A    ANOP                                                           01700000
.*                                                                      01710000
         AIF   (N'&INIT LE 1).ZM3A                                      01720000
         MNOTE 12,'***  IHB247  MORE THAN 1 ARGUMENT SPECIFIED FOR THE *01730000
               INIT PARAMETER.'                                         01740000
&ZMACRET SETA  12                                                       01750000
.ZM3A    ANOP                                                           01760000
&XINIT   SETA  0                                                        01770000
         AIF   ('&INIT' EQ '').ZM3B                                     01780000
&XINIT   SETA  1                                                        01790000
         AIF   ('&INIT'(1,1) EQ '''').ZM3B                              01800000
&XINIT   SETA  2                                                        01810000
         AIF   ('&INIT'(1,1) NE '(').ZM3B                               01820000
&XINIT   SETA  3                                                        01830000
.ZM3B    ANOP                                                           01840000
.*                                                                      01850000
         AIF   (N'&TRMEXIT LE 1).ZM4A                                   01860000
         MNOTE 12,'***  IHB247  MORE THAN 1 ARGUMENT SPECIFIED FOR THE *01870000
               TRMEXIT PARAMETER.'                                      01880000
&ZMACRET SETA  12                                                       01890000
.ZM4A    ANOP                                                           01900000
.*                                                                      01910000
         AIF   (N'&UTOKEN LE 1).ZM5A                                    01920000
         MNOTE 12,'***  IHB247  MORE THAN 1 ARGUMENT SPECIFIED FOR THE *01930000
               UTOKEN PARAMETER.'                                       01940000
&ZMACRET SETA  12                                                       01950000
.ZM5A    ANOP                                                           01960000
.*                                                                      01970000
         AIF   (N'&LXLIST LE 1).ZM6A                                    01980000
         MNOTE 12,'***  IHB247  MORE THAN 1 ARGUMENT SPECIFIED FOR THE *01990000
               LXLIST PARAMETER.'                                       02000000
&ZMACRET SETA  12                                                       02010000
.ZM6A    ANOP                                                           02020000
         AIF   (N'&ELXLIST LE 1).ZM6A2                                  02030000
         MNOTE 12,'***  IHB247  MORE THAN 1 ARGUMENT SPECIFIED FOR THE *02040000
               ELXLIST PARAMETER.'                                      02050000
&ZMACRET SETA  12                                                       02060000
.ZM6A2   ANOP                                                           02070000
         AIF   ('&LXLIST' EQ '' OR '&ELXLIST' EQ '').ZM6A1        @L3A  02080000
         MNOTE 12,'***  IHB280 LXLIST IS NOT VALID WITH ELXLIST'  @L3A  02090000
&ZMACRET SETA  12                                                       02100000
.ZM6A1   ANOP                                                     @L3A  02110000
.*                                                                      02120000
         AIF   (N'&TKLIST LE 1).ZM7A                                    02130000
         MNOTE 12,'***  IHB247  MORE THAN 1 ARGUMENT SPECIFIED FOR THE *02140000
               TKLIST PARAMETER.'                                       02150000
&ZMACRET SETA  12                                                       02160000
.ZM7A    ANOP                                                           02170000
.*                                                                      02180000
         AIF   (N'&AXLIST LE 1).ZM8A                                    02190000
         MNOTE 12,'***  IHB247  MORE THAN 1 ARGUMENT SPECIFIED FOR THE *02200000
               AXLIST PARAMETER.'                                       02210000
&ZMACRET SETA  12                                                       02220000
.ZM8A    ANOP                                                           02230000
.*                                                                      02240000
         AIF   (N'&ASPARM LE 1).ZM9A                                    02250000
         MNOTE 12,'***  IHB247  MORE THAN 1 ARGUMENT SPECIFIED FOR THE *02260000
               ASPARM PARAMETER.'                                       02270000
&ZMACRET SETA  12                                                       02280000
.ZM9A    ANOP                                                           02290000
.*                                                                      02300000
         AIF   (N'&ODA LE 1).ZM10A                                      02310000
         MNOTE 12,'***  IHB247  MORE THAN 1 ARGUMENT SPECIFIED FOR THE *02320000
               ODA PARAMETER.'                                          02330000
&ZMACRET SETA  12                                                       02340000
.ZM10A   ANOP                                                           02350000
.*                                                                      02360000
&I       SETA  1                                                        02370000
.ATTRL   ANOP                                                           02380000
         AIF   (&I GT N'&ATTR).ATTREND                                  02390000
         AIF   ('&ATTR(&I)' NE 'XMPT').ATTR2                            02400000
&B(1)    SETB  1                                                        02410000
         AGO   .ATTRCON                                                 02420000
.ATTR2   ANOP                                                           02430000
         AIF   ('&ATTR(&I)' NE 'PXMT').ATTR3                            02440000
&B(2)    SETB  1                                                        02450000
         AGO   .ATTRCON                                                 02460000
.ATTR3   ANOP                                                           02470000
         AIF   ('&ATTR(&I)' NE 'NOMT').ATTR4                            02480000
&B(3)    SETB  1                                                        02490000
         AGO   .ATTRCON                                                 02500000
.ATTR4   ANOP                                                           02510000
         AIF   ('&ATTR(&I)' NE 'NOMD').ATTR5                            02520000
&B(4)    SETB  1                                                        02530000
         AGO   .ATTRCON                                                 02540000
.ATTR5   ANOP                                                           02550000
         AIF   ('&ATTR(&I)' NE '1LPU').ATTR6                            02560000
&B(5)    SETB  1                                                        02570000
         AGO   .ATTRCON                                                 02580000
.ATTR6   ANOP                                                           02590000
         AIF   ('&ATTR(&I)' NE '2LPU').ATTR7                            02600000
&B(6)    SETB  1                                                        02610000
         AGO   .ATTRCON                                                 02620000
.ATTR7   ANOP                                                           02630000
         AIF   ('&ATTR(&I)' NE 'N2LP').ATTR8                            02640000
&B(7)    SETB  1                                                        02650000
         AGO   .ATTRCON                                                 02660000
.ATTR8   ANOP                                                           02670000
         AIF   ('&ATTR(&I)' NE 'PRIV').ATTR9                            02680000
&B(8)    SETB  1                                                        02690000
         AGO   .ATTRCON                                                 02700000
.ATTR9   ANOP                                                           02710000
         AIF   ('&ATTR(&I)' NE 'NOSWAP').ATTR10                         02720000
&B(9)    SETB  1                                                        02730000
         AGO   .ATTRCON                                                 02740000
.ATTR10  ANOP                                                           02750000
         AIF   ('&ATTR(&I)' NE 'PERM').ATTR11                           02760000
&B(10)   SETB  1                                                        02770000
         AGO   .ATTRCON                                                 02780000
.ATTR11  ANOP                                                           02790000
         AIF   ('&ATTR(&I)' NE 'CANCEL').ATTR12                         02800000
&B(11)   SETB  1                                                        02810000
         AGO   .ATTRCON                                                 02820000
.ATTR12  ANOP                                                           02830000
         AIF   ('&ATTR(&I)' NE 'HIPRI').ATTR14                          02840000
&B(13)   SETB  1                                                        02850000
         AGO   .ATTRCON                                                 02860000
.ATTR14  ANOP                                                           02870000
         AIF   ('&ATTR(&I)' NE 'NONURG').ATTR15                   @L1C  02880000
&B(14)   SETB  1                                                        02890000
         AGO   .ATTRCON                                                 02900000
.ATTR15  ANOP                                                     @L1A  02910000
         AIF   ('&ATTR(&I)' NE 'KEEPRGN').ATTR16                  @L3A  02920000
&B(15)   SETB  1                                                  @L1A  02930000
         AGO   .ATTRCON                                           @L1A  02940000
.ATTR16  ANOP                                                     @L3A  02950000
         AIF   ('&ATTR(&I)' NE 'REUSASID').ATTR17                 @L4C  02960000
&B(16)   SETB  1                                                  @L3A  02970000
         AGO   .ATTRCON                                           @L3A  02980000
.ATTR17  ANOP                                                     @01A  02990000
         AIF   ('&ATTR(&I)' NE 'JOBSPACE').ATTR18                 @01C  03000000
&B(17)   SETB  1                                                  @01C  03010000
         AGO   .ATTRCON                                           @01C  03020000
.ATTR18  ANOP                                                     @01A  03030000
         AIF   ('&ATTR(&I)' NE 'ASCBV31').ATTR19                  @P1A  03040001
&B(18)   SETB  1                                                  @01A  03050000
         AGO   .ATTRCON                                           @01A  03060000
.ATTR19  ANOP                                                     @P1A  03070001
         AIF   ('&ATTR(&I)' NE 'MAXRGN').ATTRBAD                  @P1A  03080001
&B(19)   SETB  1                                                  @P1A  03090001
         AGO   .ATTRCON                                           @P1A  03100001
.ATTRBAD ANOP                                                           03110000
         IHBERMAC 1001,ATTR,&ATTR(&I)                                   03120000
&ZMACRET SETA  12                                                       03130000
.ATTRCON ANOP                                                           03140000
&I       SETA  &I+1                                                     03150000
         AGO   .ATTRL                                                   03160000
.ATTREND ANOP                                                           03170000
&B(24)   SETB  ('&ELXLIST' NE '')                                 @L3A  03180000
         AIF   (&B(13) EQ 1 AND &B(14) EQ 1).ATTRBD2                    03190000
         AGO   .ATTROK                                                  03200000
.ATTRBD2 ANOP                                                           03210000
         MNOTE 12,'***  IHB304  THE HIPRI AND NONURG ATTRIBUTES ARE MUT*03220000
               UALLY EXCLUSIVE.'                                        03230000
&ZMACRET SETA  12                                                       03240000
.ATTROK  ANOP                                                           03250000
         AIF   ('&ASNAME' EQ '' OR '&STPARM' EQ '').MUTOK               03260000
         MNOTE 12,'***  IHB304  THE ASNAME AND STPARM PARAMETERS ARE MU*03270000
               TUALLY EXCLUSIVE.'                                       03280000
&ZMACRET SETA  12                                                       03290000
.MUTOK   ANOP                                                           03300000
         AIF   (N'&MF GT 2).MFBAD                                       03310000
         AIF   ('&MF' EQ '').MFBAD                                      03320000
         AIF   (N'&MF LT 2 AND '&MF(1)' EQ 'E').MFBAD                   03330000
         AIF   (N'&MF LT 2 OR '&MF(1)' EQ 'E').MFOK                     03340000
.MFBAD   ANOP                                                           03350000
         IHBERMAC 1012,MF                                               03360000
         MEXIT                                                          03370000
.MFOK    ANOP                                                           03380000
         AIF ('&MF(1)' EQ 'I'                                          *03390000
               OR '&MF(1)' EQ 'E' OR '&MF(1)' EQ 'L').MFOK2             03400000
         MNOTE 12,'***  IHB002  THE FIRST ARGUMENT OF THE MF PARAMETER *03410000
               MUST BE ''I'', ''E'', OR ''L''.'                         03420000
         MEXIT                                                          03430000
.MFOK2   ANOP                                                           03440000
         AIF ('&MF(1)' NE 'I').NOTMFI                                   03450000
         AIF ('&INIT' NE '').OKINIT                                     03460000
         MNOTE 12,'***  IHB001  THE INIT PARAMETER MUST BE SPECIFIED ON*03470000
                THE STANDARD FORM.'                                     03480000
&ZMACRET SETA  12                                                       03490000
.OKINIT  ANOP                                                           03500000
         AIF ('&STPARM' NE '' OR '&ASNAME' NE '').OKSTP                 03510000
         MNOTE 12,'***  IHB001  THE STPARM OR ASNAME PARAMETER MUST BE *03520000
               SPECIFIED ON THE STANDARD FORM.'                         03530000
&ZMACRET SETA  12                                                       03540000
.OKSTP   ANOP                                                           03550000
         AIF ('&ODA' NE '').OKODA                                       03560000
         MNOTE 12,'***  IHB001  THE ODA PARAMETER MUST BE SPECIFIED ON *03570000
               THE STANDARD FORM.'                                      03580000
&ZMACRET SETA  12                                                       03590000
.OKODA   ANOP                                                           03600000
         AIF ('&UTOKEN' EQ '' OR '&TRMEXIT' NE '').OKASEX               03610000
         MNOTE 12,'***  IHB246  TRMEXIT IS REQUIRED WHEN UTOKEN IS SPEC*03620000
               IFIED.'                                                  03630000
&ZMACRET SETA  12                                                       03640000
.OKASEX  ANOP                                                           03650000
         AIF ('&LXLIST.&ELXLIST' EQ '' OR '&TKLIST' NE '').OKLXL        03660000
         MNOTE 12,'***  IHB246  TKLIST IS REQUIRED WHEN (E)LXLIST IS SP*03670000
               ECIFIED.'                                                03680000
&ZMACRET SETA  12                                                       03690000
.OKLXL   ANOP                                                           03700000
         AIF ('&TKLIST' EQ '' OR '&LXLIST.&ELXLIST' NE '').OKTKL        03710000
         MNOTE 12,'***  IHB246  (E)LXLIST IS REQUIRED WHEN TKLIST IS SP*03720000
               ECIFIED.'                                                03730000
&ZMACRET SETA  12                                                       03740000
.OKTKL   ANOP                                                           03750000
.NOTMFI  ANOP                                                           03760000
         AIF ('&MF(1)' NE 'L').NOTMFL                                   03770000
         AIF ('&ASNAME' EQ '').NOTREG1                                  03780000
         AIF ('&ASNAME'(1,1) NE '(').NOTREG1                            03790000
       MNOTE 12,'***  IHB006 ASNAME -- REGISTER NOTATION MAY NOT BE USE*03800000
               D WHEN MF=L.'                                            03810000
&ZMACRET SETA  12                                                       03820000
.NOTREG1 ANOP                                                           03830000
         AIF ('&STPARM' EQ '').NOTREG2                                  03840000
         AIF ('&STPARM'(1,1) NE '(').NOTREG2                            03850000
       MNOTE 12,'***  IHB006 STPARM -- REGISTER NOTATION MAY NOT BE USE*03860000
               D WHEN MF=L.'                                            03870000
&ZMACRET SETA  12                                                       03880000
.NOTREG2 ANOP                                                           03890000
         AIF ('&INIT' EQ '').NOTREG3                                    03900000
         AIF ('&INIT'(1,1) NE '(').NOTREG3                              03910000
       MNOTE 12,'***  IHB006 INIT -- REGISTER NOTATION MAY NOT BE USED *03920000
               WHEN MF=L.'                                              03930000
&ZMACRET SETA  12                                                       03940000
.NOTREG3 ANOP                                                           03950000
         AIF ('&TRMEXIT' EQ '').NOTREG4                                 03960000
         AIF ('&TRMEXIT'(1,1) NE '(').NOTREG4                           03970000
       MNOTE 12,'***  IHB006 TRMEXIT -- REGISTER NOTATION MAY NOT BE US*03980000
               ED WHEN MF=L.'                                           03990000
&ZMACRET SETA  12                                                       04000000
.NOTREG4 ANOP                                                           04010000
         AIF ('&UTOKEN' EQ '').NOTREG5                                  04020000
         AIF ('&UTOKEN'(1,1) NE '(').NOTREG5                            04030000
       MNOTE 12,'***  IHB006 UTOKEN -- REGISTER NOTATION MAY NOT BE USE*04040000
               D WHEN MF=L.'                                            04050000
&ZMACRET SETA  12                                                       04060000
.NOTREG5 ANOP                                                           04070000
         AIF ('&LXLIST' EQ '').NOTREG6                                  04080000
         AIF ('&LXLIST'(1,1) NE '(').NOTREG6                            04090000
       MNOTE 12,'***  IHB006 LXLIST -- REGISTER NOTATION MAY NOT BE USE*04100000
               D WHEN MF=L.'                                            04110000
&ZMACRET SETA  12                                                       04120000
.NOTREG6 ANOP                                                           04130000
         AIF ('&ELXLIST' EQ '').NOTREG6E                                04140000
         AIF ('&ELXLIST'(1,1) NE '(').NOTREG6E                          04150000
       MNOTE 12,'***  IHB006 ELXLIST -- REGISTER NOTATION MAY NOT BE US*04160000
               ED WHEN MF=L.'                                           04170000
&ZMACRET SETA  12                                                       04180000
.NOTREG6E ANOP                                                          04190000
         AIF ('&TKLIST' EQ '').NOTREG7                                  04200000
         AIF ('&TKLIST'(1,1) NE '(').NOTREG7                            04210000
       MNOTE 12,'***  IHB006 TKLIST -- REGISTER NOTATION MAY NOT BE USE*04220000
               D WHEN MF=L.'                                            04230000
&ZMACRET SETA  12                                                       04240000
.NOTREG7 ANOP                                                           04250000
         AIF ('&AXLIST' EQ '').NOTREG8                                  04260000
         AIF ('&AXLIST'(1,1) NE '(').NOTREG8                            04270000
       MNOTE 12,'***  IHB006 AXLIST -- REGISTER NOTATION MAY NOT BE USE*04280000
               D WHEN MF=L.'                                            04290000
&ZMACRET SETA  12                                                       04300000
.NOTREG8 ANOP                                                           04310000
         AIF ('&ASPARM' EQ '').NOTREG9                                  04320000
         AIF ('&ASPARM'(1,1) NE '(').NOTREG9                            04330000
       MNOTE 12,'***  IHB006 ASPARM -- REGISTER NOTATION MAY NOT BE USE*04340000
               D WHEN MF=L.'                                            04350000
&ZMACRET SETA  12                                                       04360000
.NOTREG9 ANOP                                                           04370000
         AIF ('&ODA' EQ '').NOTMFL                                      04380000
         AIF ('&ODA'(1,1) NE '(').NOTMFL                                04390000
          MNOTE 12,'***  IHB006 ODA -- REGISTER NOTATION MAY NOT BE USE*04400000
               D WHEN MF=L.'                                            04410000
&ZMACRET SETA  12                                                       04420000
.NOTMFL  ANOP                                                           04430000
         AIF (&ZMACRET GT 4).EXIT                                       04440000
         AIF ('&MF(1)' NE 'I').TRYMFL                                   04450000
         CNOP  0,4                                                      04460000
&LAB2    &LA   1,*+8              GET PARAMETER LIST ADDRESS            04470000
         B     AS&SYSNDX          BRANCH AROUND PARAMETER LIST          04480000
&LAB2    SETC  ''                                                       04490000
         AGO   .MORE                                                    04500000
.TRYMFL  ANOP                                                           04510000
         AIF ('&MF(1)' EQ 'E').DOMFE                                    04520000
.MORE    ANOP                                                           04530000
&LAB2    DS    0F                                                       04540000
         DC    XL1'01'            VERSION NUMBER                        04550000
         DC    BL1'&B(1)&B(2)&B(3)&B(4)&B(5)&B(6)&B(7)&B(8)'            04560000
         DC    BL1'&B(9)&B(10)&B(11)&B(12)&B(13)&B(14)&B(15)&B(16)'     04570000
         DC    BL1'&B(17)&B(18)&B(19)&B(20)&B(21)&B(22)&B(23)&B(24)'    04580000
         AIF  ('&XINIT' EQ '1').SINIT     Character string specified    04590000
         AIF  ('&XINIT' NE '2').ZINIT                                   04600000
         DC    A(&INIT)           INIT PARAMETER                        04610000
         AGO  .EINIT                                                    04620000
.SINIT   ANOP                                                           04630000
         DC    A(*+76)            INIT PARAMETER                        04640000
         AGO  .EINIT                                                    04650000
.ZINIT   ANOP                                                           04660000
         DC    A(0)               INIT PARAMETER                        04670000
.EINIT   ANOP                                                           04680000
         DC    A(0)               INIT ALET                             04690000
         AIF  ('&ASNAME' NE '').LASNAME                                 04700000
         AIF  ('&STPARM' EQ '').ZSTPARM                                 04710000
         AIF  ('&STPARM'(1,1) EQ '(').ZSTPARM                           04720000
         DC    A(&STPARM) .       STPARM PARAMETER                      04730000
         AGO  .ESTPARM                                                  04740000
.LASNAME ANOP                                                           04750000
&TEMP    SETC  '*+68'                                                   04760000
.* If INIT is specified too, there will be two defined areas at         04770000
.* the end of the parameter list, so the ASNAME area will follow        04780000
.* the INIT area.                                                       04790000
         AIF   (&XINIT NE 1).NOINIT2                                    04800000
&TEMP    SETC  '*+76'                                                   04810000
.NOINIT2 ANOP                                                           04820000
         DC    A(&TEMP) .         ASNAME PARAMETER                      04830000
         AGO  .ESTPARM                                                  04840000
.ZSTPARM ANOP                                                           04850000
         DC    A(0)               STPARM PARAMETER                      04860000
.ESTPARM ANOP                                                           04870000
         DC    A(0)               ASNAME/STPARM ALET                    04880000
         AIF  ('&UTOKEN' EQ '').ZUTOKEN                                 04890000
         AIF  ('&UTOKEN'(1,1) EQ '(').ZUTOKEN                           04900000
         DC    A(&UTOKEN)         UTOKEN PARAMETER                      04910000
         AGO  .EUTOKEN                                                  04920000
.ZUTOKEN ANOP                                                           04930000
         DC    A(0)               UTOKEN PARAMETER                      04940000
.EUTOKEN ANOP                                                           04950000
         DC    A(0)               UTOKEN ALET                           04960000
         AIF  ('&ASPARM' EQ '').ZASPARM                                 04970000
         AIF  ('&ASPARM'(1,1) EQ '(').ZASPARM                           04980000
         DC    A(&ASPARM)         ASPARM PARAMETER                      04990000
         AGO  .EASPARM                                                  05000000
.ZASPARM ANOP                                                           05010000
         DC    A(0)               ASPARM PARAMETER                      05020000
.EASPARM ANOP                                                           05030000
         DC    A(0)               ASPARM ALET                           05040000
         AIF  ('&TRMEXIT' EQ '').ZTMEXIT                                05050000
         AIF  ('&TRMEXIT'(1,1) EQ '(').ZTMEXIT                          05060000
         DC    A(&TRMEXIT)        TRMEXIT PARAMETER                     05070000
         AGO   .ETMEXIT                                                 05080000
.ZTMEXIT ANOP                                                           05090000
         DC    A(0)               TRMEXIT PARAMETER                     05100000
.ETMEXIT ANOP                                                           05110000
         AIF  ('&AXLIST' EQ '').ZAXLIST                                 05120000
         AIF  ('&AXLIST'(1,1) EQ '(').ZAXLIST                           05130000
         DC    A(&AXLIST)         AXLIST PARAMETER                      05140000
         AGO   .EAXLIST                                                 05150000
.ZAXLIST ANOP                                                           05160000
         DC    A(0)               AXLIST PARAMETER                      05170000
.EAXLIST ANOP                                                           05180000
         DC    A(0)               AXLIST ALET                           05190000
         AIF  ('&LXLIST.&ELXLIST' EQ '').ZLXLIST                        05200000
         AIF  ('&ELXLIST' NE '').ZELXLIST                               05210000
         AIF  ('&LXLIST'(1,1) EQ '(').ZLXLIST                           05220000
         DC    A(&LXLIST)         LXLIST PARAMETER                      05230000
         AGO  .E_LXLIST                                                 05240000
.ZLXLIST ANOP                                                           05250000
         DC    A(0)               LXLIST PARAMETER                      05260000
         AGO  .E_LXLIST                                                 05270000
.ZELXLIST ANOP                                                          05280000
         AIF  ('&ELXLIST'(1,1) EQ '(').ZELXLISTR                        05290000
         DC    A(&ELXLIST)         ELXLIST PARAMETER                    05300000
         AGO  .E_LXLIST                                                 05310000
.ZELXLISTR ANOP                                                         05320000
         DC    A(0)               ELXLIST PARAMETER                     05330000
.E_LXLIST ANOP                                                          05340000
         DC    A(0)               (E)LXLIST ALET                        05350000
         AIF  ('&TKLIST' EQ '').ZTKLIST                                 05360000
         AIF  ('&TKLIST'(1,1) EQ '(').ZTKLIST                           05370000
         DC    A(&TKLIST)         TKLIST PARAMETER                      05380000
         AGO  .ETKLIST                                                  05390000
.ZTKLIST ANOP                                                           05400000
         DC    A(0)               TKLIST PARAMETER                      05410000
.ETKLIST ANOP                                                           05420000
         DC    A(0)               TKLIST ALET                           05430000
         AIF  ('&ODA' EQ '').ZODA                                       05440000
         AIF  ('&ODA'(1,1) EQ '(').ZODA                                 05450000
         DC    A(&ODA)            ODA PARAMETER                         05460000
         AGO  .EODA                                                     05470000
.ZODA    ANOP                                                           05480000
         DC    A(0)               ODA PARAMETER                         05490000
.EODA    ANOP                                                           05500000
         DC    A(0)               ODA ALET                              05510000
         DC    XL8'00'            RESERVED AREA                         05520000
         AIF (&XINIT NE 1).NOINITD                                      05530000
         DC    CL8&INIT                                                 05540000
.NOINITD ANOP                                                           05550000
         AIF ('&ASNAME' EQ '').NOASND                                   05560000
         DC    XL2'0008',CL8&ASNAME                               @L2C  05570000
.NOASND  ANOP                                                           05580000
         AIF   ('&MF(1)' EQ 'L').EXIT                                   05590000
AS&SYSNDX DS   0F                                                       05600000
         AGO   .COM                                                     05610000
.DOMFE   ANOP                                                           05620000
         AIF   ('&MF(2)'(1,1) EQ '(').DOMFER                            05630000
&LAB2    &LA   1,&MF(2)           GET PARAMETER LIST ADDRESS            05640000
         AGO   .COM                                                     05650000
.DOMFER  ANOP                                                           05660000
&TEMP    SETC  '&MF(2)'(2,K'&MF(2)-2)                                   05670000
         AIF   ('&TEMP' EQ '1').NOLOAD                                  05680000
&LAB2    &LA   1,0(,&TEMP)         GET PARAMETER LIST ADDRESS           05690000
         AGO   .COM                                                     05700000
.NOLOAD  AIF   ('&LAB2' EQ '').COM                                      05710000
&LAB2    DS    0H                                                       05720000
.COM     ANOP                                                           05730000
         AIF   ('&MF(1)' EQ 'I').NATTR3                                 05740000
&TEMP    SETC  '&B(1)&B(2)&B(3)&B(4)&B(5)&B(6)&B(7)&B(8)'               05750000
         AIF   ('&TEMP' EQ '00000000').NATTR1                           05760000
         OI    1(1),B'&TEMP.'     SET ATTRIBUTE BYTE 1                  05770000
.NATTR1  ANOP                                                           05780000
&TEMP    SETC  '&B(9)&B(10)&B(11)&B(12)&B(13)&B(14)&B(15)&B(16)'        05790000
         AIF   ('&TEMP' EQ '00000000').NATTR2                           05800000
         OI    2(1),B'&TEMP.'     SET ATTRIBUTE BYTE 2                  05810000
.NATTR2  ANOP                                                           05820000
&TEMP    SETC  '&B(17)&B(18)&B(19)&B(20)&B(21)&B(22)&B(23)&B(24)'       05830000
         AIF   ('&TEMP' EQ '00000000').NATTR3                           05840000
         OI    3(1),B'&TEMP.'     SET ATTRIBUTE/OPTION BYTE 3           05850000
.NATTR3  ANOP                                                           05860000
         AIF   ('&INIT' EQ '').NOINIT                                   05870000
         AIF   ('&INIT'(1,1) EQ '(').RINIT                              05880000
         AIF   ('&MF(1)' EQ 'I').NOINIT                                 05890000
         AIF   ('&INIT'(1,1) EQ '''').QINIT                             05900000
         &LA   15,&INIT           GET ADDRESS OF INIT ROUTINE NAME      05910000
         ST    15,4(,1)           SAVE INIT ROUTINE NAME ADDRESS        05920000
         AIF   ('&SYSASCE' EQ 'P').NOINIT                               05930000
         STAM  15,15,8(1)         SAVE INIT ROUTINE NAME ALET           05940000
         AGO   .NOINIT                                                  05950000
.QINIT   ANOP                                                           05960000
         &LA   15,*+8             GET INIT ROUTINE NAME ADDRESS         05970000
         B     *+12                                                     05980000
         DC    CL8&INIT                                                 05990000
         ST    15,4(,1)           SAVE INIT ROUTINE NAME ADDRESS        06000000
         AIF   ('&SYSASCE' EQ 'P').NOINIT                               06010000
         STAM  15,15,8(1)         SAVE INIT ROUTINE NAME ALET           06020000
         AGO   .NOINIT                                                  06030000
.RINIT   ANOP                                                           06040000
         ST    &INIT(1),4(,1)     SAVE INIT ROUTINE NAME ADDRESS        06050000
         AIF   ('&SYSASCE' EQ 'P').NOINIT                               06060000
         STAM  &INIT(1),&INIT(1),8(1)  SAVE INIT ROUTINE NAME ALET      06070000
.NOINIT  ANOP                                                           06080000
         AIF   ('&ASNAME' EQ '').NASNAME                                06090000
         AIF   ('&MF(1)' EQ 'I').NASNAME                                06100000
         &LA   15,*+8             GET ASNAME ADDRESS                    06110000
         B     *+14                                                     06120000
         DC    X'0008',CL8&ASNAME                                 @L2C  06130000
         DS    0H                                                       06140000
         ST    15,12(,1)          SAVE ASNAME ADDRESS                   06150000
         AIF   ('&SYSASCE' EQ 'P').NASNAME                              06160000
         STAM  15,15,16(1)        SAVE ASNAME ALET                      06170000
.NASNAME ANOP                                                           06180000
         AIF   ('&STPARM' EQ '').NSTPARM                                06190000
         AIF   ('&STPARM'(1,1) EQ '(').RSTPARM                          06200000
         AIF   ('&MF(1)' EQ 'I').NSTPARM                                06210000
         &LA   15,&STPARM         GET STPARM ADDRESS                    06220000
         ST    15,12(,1)          SAVE STPARM ADDRESS                   06230000
         AIF   ('&SYSASCE' EQ 'P').NSTPARM                              06240000
         STAM  15,15,16(1)        SAVE STPARM ALET                      06250000
         AGO   .NSTPARM                                                 06260000
.RSTPARM ANOP                                                           06270000
         ST    &STPARM(1),12(,1)  SAVE STPARM ADDRESS                   06280000
         AIF   ('&SYSASCE' EQ 'P').NSTPARM                              06290000
         STAM  &STPARM(1),&STPARM(1),16(1)  SAVE STPARM ALET            06300000
.NSTPARM ANOP                                                           06310000
         AIF   ('&UTOKEN' EQ '').NUTOKEN                                06320000
         AIF   ('&UTOKEN'(1,1) EQ '(').RUTOKEN                          06330000
         AIF   ('&MF(1)' EQ 'I').NUTOKEN                                06340000
         &LA   15,&UTOKEN         GET UTOKEN ADDRESS                    06350000
         ST    15,20(,1)          SAVE UTOKEN ADDRESS                   06360000
         AIF   ('&SYSASCE' EQ 'P').NUTOKEN                              06370000
         STAM  15,15,24(1)        SAVE UTOKEN ALET                      06380000
         AGO   .NUTOKEN                                                 06390000
.RUTOKEN ANOP                                                           06400000
         ST    &UTOKEN(1),20(,1)  SAVE UTOKEN ADDRESS                   06410000
         AIF   ('&SYSASCE' EQ 'P').NUTOKEN                              06420000
         STAM  &UTOKEN(1),&UTOKEN(1),24(1)  SAVE UTOKEN ALET            06430000
.NUTOKEN ANOP                                                           06440000
         AIF   ('&ASPARM' EQ '').NASPARM                                06450000
         AIF   ('&ASPARM'(1,1) EQ '(').RASPARM                          06460000
         AIF   ('&MF(1)' EQ 'I').NASPARM                                06470000
         &LA   15,&ASPARM         GET ASPARM ADDRESS                    06480000
         ST    15,28(,1)          SAVE ASPARM ADDRESS                   06490000
         AIF   ('&SYSASCE' EQ 'P').NASPARM                              06500000
         STAM  15,15,32(1)        SAVE ASPARM ALET                      06510000
         AGO   .NASPARM                                                 06520000
.RASPARM ANOP                                                           06530000
         ST    &ASPARM(1),28(,1)  SAVE ASPARM ADDRESS                   06540000
         AIF   ('&SYSASCE' EQ 'P').NASPARM                              06550000
         STAM  &ASPARM(1),&ASPARM(1),32(1)  SAVE ASPARM ALET            06560000
.NASPARM ANOP                                                           06570000
         AIF   ('&TRMEXIT' EQ '').NTMEXIT                               06580000
         AIF   ('&TRMEXIT'(1,1) EQ '(').RTMEXIT                         06590000
         AIF   ('&MF(1)' EQ 'I').NTMEXIT                                06600000
         LA    15,&TRMEXIT        GET TRMEXIT ADDRESS                   06610000
         ST    15,36(,1)          SAVE TRMEXIT ADDRESS                  06620000
         AGO   .NTMEXIT                                                 06630000
.RTMEXIT ANOP                                                           06640000
         ST    &TRMEXIT(1),36(,1) SAVE TRMEXIT ADDRESS                  06650000
.NTMEXIT ANOP                                                           06660000
         AIF   ('&AXLIST' EQ '').NAXLIST                                06670000
         AIF   ('&AXLIST'(1,1) EQ '(').RAXLIST                          06680000
         AIF   ('&MF(1)' EQ 'I').NAXLIST                                06690000
         &LA   15,&AXLIST         GET AXLIST ADDRESS                    06700000
         ST    15,40(,1)          SAVE AXLIST ADDRESS                   06710000
         AIF   ('&SYSASCE' EQ 'P').NAXLIST                              06720000
         STAM  15,15,44(1)        SAVE AXLIST ALET                      06730000
         AGO   .NAXLIST                                                 06740000
.RAXLIST ANOP                                                           06750000
         ST    &AXLIST(1),40(,1)  SAVE AXLIST ADDRESS                   06760000
         AIF   ('&SYSASCE' EQ 'P').NAXLIST                              06770000
         STAM  &AXLIST(1),&AXLIST(1),44(1) SAVE AXLIST ALET             06780000
.NAXLIST ANOP                                                           06790000
         AIF   ('&LXLIST' EQ '').NLXLIST                                06800000
         AIF   ('&LXLIST'(1,1) EQ '(').RLXLIST                          06810000
         AIF   ('&MF(1)' EQ 'I').NLXLIST                                06820000
         &LA   15,&LXLIST         GET LXLIST ADDRESS                    06830000
         ST    15,48(,1)          SAVE LXLIST ADDRESS                   06840000
         AIF   ('&SYSASCE' EQ 'P').NLXLIST                              06850000
         STAM  15,15,52(1)        SAVE LXLIST ALET                      06860000
         AGO   .NLXLIST                                                 06870000
.RLXLIST ANOP                                                           06880000
         ST    &LXLIST(1),48(,1)  SAVE LXLIST ADDRESS                   06890000
         AIF   ('&SYSASCE' EQ 'P').NLXLIST                              06900000
         STAM  &LXLIST(1),&LXLIST(1),52(1) SAVE LXLIST ALET             06910000
.NLXLIST ANOP                                                           06920000
         AIF   ('&ELXLIST' EQ '').NELXLIST                              06930000
         AIF   ('&ELXLIST'(1,1) EQ '(').RELXLIST                        06940000
         AIF   ('&MF(1)' EQ 'I').NELXLIST                               06950000
         &LA   15,&ELXLIST        GET ELXLIST ADDRESS                   06960000
         ST    15,48(,1)          SAVE ELXLIST ADDRESS                  06970000
         AIF   ('&SYSASCE' EQ 'P').NELXLIST                             06980000
         STAM  15,15,52(1)        SAVE ELXLIST ALET                     06990000
         AGO   .NELXLIST                                                07000000
.RELXLIST ANOP                                                          07010000
         ST    &ELXLIST(1),48(,1) SAVE ELXLIST ADDRESS                  07020000
         AIF   ('&SYSASCE' EQ 'P').NELXLIST                             07030000
         STAM  &ELXLIST(1),&ELXLIST(1),52(1) SAVE ELXLIST ALET          07040000
.NELXLIST ANOP                                                          07050000
         AIF   ('&TKLIST' EQ '').NTKLIST                                07060000
         AIF   ('&TKLIST'(1,1) EQ '(').RTKLIST                          07070000
         AIF   ('&MF(1)' EQ 'I').NTKLIST                                07080000
         &LA   15,&TKLIST         GET TKLIST ADDRESS                    07090000
         ST    15,56(,1)          SAVE TKLIST ADDRESS                   07100000
         AIF   ('&SYSASCE' EQ 'P').NTKLIST                              07110000
         STAM  15,15,60(1)        SAVE TKLIST ALET                      07120000
         AGO   .NTKLIST                                                 07130000
.RTKLIST ANOP                                                           07140000
         ST    &TKLIST(1),56(,1)  SAVE TKLIST ADDRESS                   07150000
         AIF   ('&SYSASCE' EQ 'P').NTKLIST                              07160000
         STAM  &TKLIST(1),&TKLIST(1),60(1) SAVE TKLIST ALET             07170000
.NTKLIST ANOP                                                           07180000
         AIF   ('&ODA' EQ '').NODA                                      07190000
         AIF   ('&ODA'(1,1) EQ '(').RODA                                07200000
         AIF   ('&MF(1)' EQ 'I').NODA                                   07210000
         &LA   15,&ODA            GET ODA ADDRESS                       07220000
         ST    15,64(,1)          SAVE ODA ADDRESS                      07230000
         AIF   ('&SYSASCE' EQ 'P').NODA                                 07240000
         STAM  15,15,68(1)        SAVE ODA ALET                         07250000
         AGO   .NODA                                                    07260000
.RODA    ANOP                                                           07270000
         ST    &ODA(1),64(,1)     SAVE ODA ADDRESS                      07280000
         AIF   ('&SYSASCE' EQ 'P').NODA                                 07290000
         STAM  &ODA(1),&ODA(1),68(1) SAVE ODA ALET                      07300000
.NODA    ANOP                                                           07310000
         AIF   ('&MF(1)' EQ 'I').NOVERSN                                07320000
         AIF   ('&ATTR' EQ '' AND                                      *07330000
               '&STPARM' EQ '' AND '&ASNAME' EQ '' AND                 *07340000
               '&INIT' EQ '' AND '&TRMEXIT' EQ '' AND                  *07350000
               '&UTOKEN' EQ '' AND '&LXLIST' EQ '' AND                 *07360000
               '&ELXLIST' EQ '' AND                                    *07370000
               '&TKLIST' EQ '' AND '&AXLIST' EQ '' AND                 *07380000
               '&ASPARM' EQ '' AND '&ODA' EQ '').NOVERSN                07390000
         MVI   0(1),X'01'         VERSION NUMBER                        07400000
.NOVERSN ANOP                                                           07410000
         SLR   0,0                INDICATE ASCRE                        07420000
         L     14,16(0,0)         GET CVT ADDRESS                       07430000
         L     14,772(14,0)       GET SFT ADDRESS                       07440000
         L     14,180(14,0)       GET LX/EX FOR ASCRE                   07450000
         PC    0(14)              INVOKE SERVICE                        07460000
.EXIT    ANOP                                                           07470000
         MEND                                                           07480000
**/                                                                     07490000
*%ASCRE: MACRO KEYS(TRMEXIT,ASNAME,ASPARM,ATTR,AXLIST,INIT,LXLIST,      07500000
*    ELXLIST,MF,ODA,REASON,RETCODE,STPARM,TKLIST,UTOKEN,RELATED);       07510000
*                                                                       07520000
* ANS('?'!!MACLABEL!!'ASCREP '!!MACLIST!!MACKEYS!!';');                 07530000
* %END ASCRE;                                                           07540000
