         MACRO                                                          00000100
&LABEL   ATBCSASM                                                       00000200
** START OF SPECIFICATIONS    ***************************************   00000300
*                                                                       00000400
*01* MACRO NAME: ATBCSASM                                               00000500
*01* DSECT NAME:  none                                                  00000600
*                                                                       00000700
*01* DESCRIPTIVE NAME: Interface Declaration File for APPC/MVS          00000800
*                      Callable System Services - Assembler             00000900
*02*   ACRONYM: ATBCSASM                                                00001000
*                                                                       00001100
*01* COMPONENT: APPC Component (SCACB)                                  00001200
*                                                                       00001300
*01* EYE-CATCHER: N/A                                                   00001400
*02*   OFFSET: N/A                                                      00001500
*02*   LENGTH: N/A                                                      00001600
*                                                                       00001700
*01* PROPRIETARY STATEMENT=                                     @P4A*   00001800
*  **PROPRIETARY_STATEMENT********************************************* 00001900
*                                                                     * 00002000
*                                                                     * 00002100
*   LICENSED MATERIALS - PROPERTY OF IBM                              * 00002200
*   5645-001 COPYRIGHT IBM CORP. 1990, 1997                           * 00002400
*                                                                     * 00002500
*   STATUS= HBB6603                                                   * 00002600
*                                                                     * 00002700
*  **END_OF_PROPRIETARY_STATEMENT************************************** 00002800
*                                                                       00002900
*01* EXTERNAL CLASSIFICATION: GUPI                                      00003000
*                                                                       00003100
*01* END OF EXTERNAL CLASSIFICATION:                                    00003200
*                                                                       00003300
*                                                                       00003400
*                                                                       00003500
*01* FUNCTION:                                                          00003600
*02*    ATBCSASM contains the Assembler language declarations for       00003700
*       parameter values for the APPC/MVS Callable System Services      00003800
*                                                                       00003900
*01* METHOD OF ACCESS:                                                  00004000
*02*    ASM:             ATBCSASM                                       00004100
*                                                                       00004200
*01* POINTED TO BY: N/A                                                 00004300
*                                                                       00004400
*01* CREATED BY: N/A                                                    00004500
*                                                                       00004600
*01* STORAGE ATTRIBUTES:                                                00004700
*02*   SUBPOOL: N/A                                                     00004800
*02*   KEY: N/A                                                         00004900
*02*   RESIDENCY: N/A                                                   00005000
*                                                                       00005100
*01* SIZE: N/A                                                          00005200
*                                                                       00005300
*01* SERIALIZATION: none                                                00005400
*                                                                       00005500
*01* DISTRIBUTION LIBRARY: MACLIB                                       00005600
*                                                                       00005700
*01* CHANGE-ACTIVITY:                                                   00005800
*                                                                       00005900
* Flag LineItem    FMID    DATE  ID  Comment                            00006000
*                                                                       00006100
*    $P0=PH31223  HBB4420 900917 PDB7: Advanced Program-to-Program      00006200
*        communication for MVS/ESA, initial release.                    00006300
*                                                                       00006400
*    $P1=PKI0021  JBB4422 900928 PDB7: Advanced Program-to-Program      00006500
*        communication for MVS/ESA, update with new constants           00006600
*                                                                       00006700
*    $P2=PKI0234  JBB4422 910510 PDB7: Advanced Program-to-Program      00006800
*        communication for MVS/ESA, update with new constants for       00006900
*        Cleanup TP and Cleanup AS                                      00007000
*                                                                       00007100
*    $P3=PKI0241  JBB4422 910510 PDCO: Add 'User_Not_Auth_For_TP' sense 00007200
*     code back since SP422 supports PV Receive.                        00007300
*                                                                       00007400
*    $L1=APPCSTS  HBB4430 920211 PDAC: Provide support for Server       00007500
*        Facilities.  Add new return code for Associate service to      00007600
*        be returned when an attempt was made to Associate a TP that    00007700
*        is owned by a server address space.  Add new return code       00007800
*        for Identify service to be returned when a server address      00007900
*        space tries to issue the Identify service.                     00008000
*                                                                       00008100
*    $L2=APPCP    HBB6603 960105 PDE6: ATBIDN4 support                  00008200
*                                                                       00008300
*    $P4=PQC0919  HBB6603 950325 PDPB: SHOWHDR conformance              00008400
*                                                                       00008500
** END OF SPECIFICATIONS    *****************************************   00008600
*                                                                       00008700
ATBCSS_FW0                          DC    F'00'                         00008800
ATBCSS_FW1                          DC    F'01'                         00008900
ATBCSS_FW2                          DC    F'02'                         00009000
ATBCSS_FW3                          DC    F'03'                         00009100
ATBCSS_FW4                          DC    F'04'                         00009200
ATBCSS_FW5                          DC    F'05'                         00009300
ATBCSS_FW6                          DC    F'06'                         00009400
ATBCSS_FW7                          DC    F'07'                         00009500
ATBCSS_FW8                          DC    F'08'                         00009600
ATBCSS_FW12                         DC    F'12'                         00009700
ATBCSS_FW14                         DC    F'14'                         00009800
ATBCSS_FW16                         DC    F'16'                         00009900
ATBCSS_FW18                         DC    F'18'                  @P1A   00010000
ATBCSS_FW20                         DC    F'20'                         00010100
ATBCSS_FW22                         DC    F'22'                  @P1A   00010200
ATBCSS_FW24                         DC    F'24'                         00010300
ATBCSS_FW26                         DC    F'26'                  @L2A   00010400
ATBCSS_FW28                         DC    F'28'                         00010500
ATBCSS_FW30                         DC    F'30'                         00010600
ATBCSS_FW38                         DC    F'38'                  @L1A   00010700
ATBCSS_FW40                         DC    F'40'                         00010800
*                                                                       00010900
*     Function Values for Control Service                               00011000
*                                                                       00011100
ATBCNTL_HALT_INPUT                  EQU   ATBCSS_FW0                    00011200
ATBCNTL_RESUME_INPUT                EQU   ATBCSS_FW1                    00011300
ATBCNTL_HALT_ALL_INPUT              EQU   ATBCSS_FW2                    00011400
ATBCNTL_RESUME_ALL_INPUT            EQU   ATBCSS_FW3                    00011500
*                                                                       00011600
*     Condition Values for Cleanup AS Service                           00011700
*                                                                       00011800
ATBCMAS_NORMAL_CLEANUP              EQU   ATBCSS_FW0                    00011900
ATBCMAS_SYSTEM_CLEANUP              EQU   ATBCSS_FW1                    00012000
*                                                                       00012100
*     Notify Type Values for Cleanup AS Service                         00012200
*                                                                       00012300
ATBCMAS_NOTIFY_TYPE_NONE            EQU   ATBCSS_FW0              @P2A  00012400
ATBCMAS_NOTIFY_TYPE_ECB             EQU   ATBCSS_FW1              @P2A  00012500
*                                                                       00012600
*     Condition Values for Cleanup TP Service                           00012700
*                                                                       00012800
ATBCMTP_NORMAL_CLEANUP              EQU   ATBCSS_FW0                    00012900
ATBCMTP_SYSTEM_CLEANUP              EQU   ATBCSS_FW1                    00013000
ATBCMTP_TP_NOT_AVAIL_NO_RETRY       EQU   ATBCSS_FW2                    00013100
ATBCMTP_TP_NOT_AVAIL_RETRY          EQU   ATBCSS_FW3                    00013200
ATBCMTP_TPN_NOT_RECOGNIZED          EQU   ATBCSS_FW4                    00013300
ATBCMTP_SECURITY_NOT_VALID          EQU   ATBCSS_FW5                    00013400
ATBCMTP_SYNC_LEVEL_NOT_SPT_PGM      EQU   ATBCSS_FW6              @P3C  00013500
ATBCMTP_USER_NOT_AUTH_FOR_TP        EQU   ATBCSS_FW7              @P3A  00013600
*                                                                       00013700
*     Notify Type Values for Cleanup TP Service                         00013800
*                                                                       00013900
ATBCMTP_NOTIFY_TYPE_NONE            EQU   ATBCSS_FW0              @P2A  00014000
ATBCMTP_NOTIFY_TYPE_ECB             EQU   ATBCSS_FW1              @P2A  00014100
*                                                                       00014200
*     TP Profile Processing Values for Identify Service                 00014300
*                                                                       00014400
ATBIDEN_PROFILE_REQUIRED            EQU   ATBCSS_FW0                    00014500
ATBIDEN_PROFILE_OPTIONAL            EQU   ATBCSS_FW1                    00014600
*                                                                       00014700
*     LU Initial Status Values for Identify Service                     00014800
*                                                                       00014900
ATBIDEN_LU_INIT_STAT_ACTIVE         EQU   ATBCSS_FW0                    00015000
ATBIDEN_LU_INIT_STAT_OUTBOUND       EQU   ATBCSS_FW1                    00015100
*                                                                       00015200
*     Prohibit_default_lu values for Set AS Attributes Service          00015300
*                                                                       00015400
ATBSASA_PROHIBIT_DEFAULT_LU_NO      EQU   ATBCSS_FW0                    00015500
ATBSASA_PROHIBIT_DEFAULT_LU_YES     EQU   ATBCSS_FW1                    00015600
*                                                                       00015700
*                                                                       00015800
*                                                                       00015900
*     Unidentify_type values for Unidentify Service               @P1A  00016000
*                                                                 @P1A  00016100
ATBUNID_UNIDENT_TYPE_NORMAL         EQU   ATBCSS_FW0              @P1A  00016200
ATBUNID_UNIDENT_TYPE_IMMEDIATE      EQU   ATBCSS_FW1              @P1A  00016300
*                                                                       00016400
*                                                                       00016500
*     RETURN CODE VALUES                                                00016600
*     ------------------                                                00016700
*                                                                       00016800
*     Common Return Code Values                                         00016900
*                                                                       00017000
*        The requested service was completed successfully               00017100
ATB_SUCCESSFUL                      EQU   ATBCSS_FW0                    00017200
*        The requested service is not supported in the callers          00017300
*        environment.                                                   00017400
ATB_INVALID_ENVIRONMENT             DC    F'32'                         00017500
*        The requested service must be invoked from a transaction       00017600
*        scheduler address space                                        00017700
ATB_AS_MUST_BE_A_TS                 DC    F'34'                         00017800
*        The requested service must be invoked from a transaction       00017900
*        scheduler address space or from a transaction scheduler        00018000
*        subordinate address space                                      00018100
ATB_AS_MUST_BE_A_TS_OR_SUB          DC    F'36'                         00018200
*        The requested service can not be called from a transaction     00018300
*        scheduler subordinate address space or have outstanding        00018400
*        conversations                                                  00018500
ATB_AS_CANT_BE_SUB_OR_HAVE_CONV        DC    F'38'                      00018600
*        APPC/MVS is not currently active                               00018700
ATB_APPC_NOT_ACTIVE                 DC    F'44'                         00018800
*        APPC/MVS services failure                                      00018900
ATB_APPC_SERVICES_FAILURE           DC    F'48'                         00019000
*                                                                       00019100
*                                                                       00019200
*     Return Codes for Associate Service                                00019300
*                                                                       00019400
*        The TPID specified is not valid                                00019500
ATBASOC_INVALID_TPID                EQU   ATBCSS_FW8                    00019600
*        The new address space is already associated with a TPID        00019700
ATBASOC_AS_ALREADY_ASSOCIATED       EQU   ATBCSS_FW12                   00019800
*        A TPID of zero was specified and Current_ASCB_Ptr is for       00019900
*        a transaction scheduler                                        00020000
ATBASOC_ZERO_TPID_INVAL_FOR_TS      EQU   ATBCSS_FW16                   00020100
*        The New_ASCB_Ptr parameter was not valid                       00020200
ATBASOC_INVALID_NEW_ASCB_PTR        EQU   ATBCSS_FW20                   00020300
*        The Current_ASCB_Ptr parameter was not valid                   00020400
ATBASOC_INVALID_CURRENT_ASCBPTR     EQU   ATBCSS_FW24                   00020500
*        The Transaction Program to be associated has an active         00020600
*        APPC request outstanding                                       00020700
ATBASOC_APPC_REQUEST_OUTSTAND       EQU   ATBCSS_FW28                   00020800
*        The combination of parameters is not valid                     00020900
ATBASOC_INVALID_PARM_COMB           EQU   ATBCSS_FW30                   00021000
*        The TP to be associated is owned by a server address     @L1A  00021100
*        space                                                    @L1A  00021200
ATBASOC_TP_OWNED_BY_SERVER          EQU   ATBCSS_FW38             @L1A  00021300
*                                                                       00021400
*                                                                       00021500
*     Return Codes for Connect Service                                  00021600
*                                                                       00021700
*        The ASCB_Ptr parameter was not valid                           00021800
ATBCONN_INVALID_ASCB_PTR            EQU   ATBCSS_FW4                    00021900
*        The Connect request was rejected because either the address    00022000
*        space specified is already connected to a transaction          00022100
*        scheduler or the address space has outstanding APPC            00022200
*        conversations                                                  00022300
ATBCONN_CONNECT_REJECTED            EQU   ATBCSS_FW8                    00022400
*                                                                       00022500
*                                                                       00022600
*     Return Codes for Cleanup AS                                       00022700
*                                                                       00022800
*        No conversations exist to be cleaned up                        00022900
ATBCMAS_NO_CONVERSATIONS            EQU   ATBCSS_FW4                    00023000
*        The ASCB_Ptr parameter was not valid                           00023100
ATBCMAS_INVALID_ASCB                EQU   ATBCSS_FW8                    00023200
*        Failure in establishing the asynchronous thread          @P2A  00023300
ATBCMAS_ASYNC_FAILURE               EQU   ATBCSS_FW12             @P2A  00023400
*                                                                       00023500
*                                                                       00023600
*     Return Codes for Cleanup TP                                       00023700
*                                                                       00023800
*        No conversations exist to be cleaned up                        00023900
ATBCMTP_NO_CONVERSATIONS            EQU   ATBCSS_FW4                    00024000
*        The TPID parameter specifies a non-existant TP instance        00024100
ATBCMTP_INVALID_TPID                EQU   ATBCSS_FW8                    00024200
*        Failure in establishing the asynchronous thread          @P2A  00024300
ATBCMTP_ASYNC_FAILURE               EQU   ATBCSS_FW12             @P2A  00024400
*                                                                       00024500
*                                                                       00024600
*     Return Codes for Control Service                                  00024700
*                                                                       00024800
*        Request accepted.  One or more LUs were not immediately        00024900
*        affected                                                       00025000
ATBCNTL_LU_AFFECTED_LATER           EQU   ATBCSS_FW4                    00025100
*        The LU name specified is not valid or does not belong          00025200
*        to calling transaction scheduler                               00025300
ATBCNTL_LU_NOT_ASSIGNED_TO_TS       EQU   ATBCSS_FW8                    00025400
*        The LU is in a state that can not be changed by this           00025500
*        service                                                        00025600
ATBCNTL_INVALID_LU_STATE            EQU   ATBCSS_FW12                   00025700
*        The function code specified is not valid                       00025800
ATBCNTL_INVALID_FUNCTION            EQU   ATBCSS_FW16                   00025900
*                                                                       00026000
*                                                                       00026100
*     Return Codes for Disconnect Service                               00026200
*                                                                       00026300
*        The ASCB_Ptr parameter was not valid                           00026400
ATBDCON_INVALID_ASCB_PTR            EQU   ATBCSS_FW4                    00026500
*        The address space specified is not a subordinate address       00026600
*        space connected to the calling transaction scheduler           00026700
ATBDCON_NOT_CONNECTED               EQU   ATBCSS_FW8                    00026800
*                                                                       00026900
*                                                                       00027000
*     Return Codes for Define Local TP Service                          00027100
*                                                                       00027200
*        The LU name specified is not valid or does not belong          00027300
*        to calling transaction scheduler                               00027400
ATBDFTP_LU_NOT_ASSIGNED_TO_TS       EQU   ATBCSS_FW4                    00027500
*        The TP name is not a valid character string                    00027600
ATBDFTP_INVALID_TP_NAME             EQU   ATBCSS_FW8                    00027700
*                                                                       00027800
*                                                                       00027900
*     Return Codes for Identify Service                                 00028000
*                                                                       00028100
*        Request accepted.  No base LUs are present                     00028200
ATBIDEN_NO_BASE_LU                  EQU   ATBCSS_FW4                    00028300
*        Request accepted.  No applicable LU names found                00028400
ATBIDEN_NO_LUS                      EQU   ATBCSS_FW8                    00028500
*        The calling transaction scheduler address space has already    00028600
*        identified itself with the same name                           00028700
ATBIDEN_IDENTIFIED_SAME_NAME        EQU   ATBCSS_FW12                   00028800
*        The calling transaction scheduler address space has already    00028900
*        identified itself but with a different name                    00029000
ATBIDEN_IDENTIFIED_DIFF_NAME        EQU   ATBCSS_FW14                   00029100
*        The transaction scheduler name is already in use               00029200
ATBIDEN_SCHED_NAME_IN_USE           EQU   ATBCSS_FW16                   00029300
*        The loading of the conversion exit was unsuccessful      @P1A  00029400
ATBIDEN_EXIT_LOAD_FAILED            EQU   ATBCSS_FW18             @P1A  00029500
*        The scheduler name parameter is not valid                      00029600
ATBIDEN_INVALID_SCHED_NAME          EQU   ATBCSS_FW20                   00029700
*        The Conversion exit name passed in is not valid          @P1A  00029800
ATBIDEN_INVALID_EXIT_NAME           EQU   ATBCSS_FW22             @P1A  00029900
*        The TP_Profile_Processing parameter value is not valid         00030000
ATBIDEN_INVALID_TP_PROF_PROC        EQU   ATBCSS_FW24                   00030100
*        The Resource_Manager_Name parameter value is not valid   @L2A  00030200
ATBIDEN_RM_NAME_NOT_VALID           EQU   ATBCSS_FW26             @L2A  00030300
*        The LU_initial_status parameter is not valid                   00030400
ATBIDEN_INVALID_LU_INIT_STATUS      EQU   ATBCSS_FW28                   00030500
*        The Identify service was issued from a server address    @L1A  00030600
*        space                                                    @L1A  00030700
ATBIDEN_IDENTIFIED_FROM_SERVER      EQU   ATBCSS_FW40             @L1A  00030800
*                                                                       00030900
*                                                                       00031000
*     Return Codes for Unidentify Service                               00031100
*                                                                       00031200
*        The unidentify type parameter contains an unknown value  @P1A  00031300
ATBUNID_INVALID_UNIDENTIFY_TYPE     EQU   ATBCSS_FW16             @P1A  00031400
*                                                                       00031500
*                                                                       00031600
*     Return Codes for Join SysAppc Group Service                       00031700
*                                                                       00031800
*        XCF failed or request is denied by XCF                         00031900
ATBMIGRP_XCF_FAILED                 EQU   ATBCSS_FW8                    00032000
*        The caller is not running in supervisor state or key 0-7       00032100
ATBMIGRP_CALLER_NOT_SUP_KEY0_7      EQU   ATBCSS_FW40                   00032200
*                                                                       00032300
*                                                                       00032400
*     Return Codes for Set Address Space Attributes Service             00032500
*                                                                       00032600
*        The ASCB_Ptr parameter was not valid                           00032700
ATBSASA_INVALID_ASCB_PTR            EQU   ATBCSS_FW4                    00032800
*        The Default_LU_designation parameter is not valid              00032900
ATBSASA_INVALID_PROHIBIT_VALUE      EQU   ATBCSS_FW8                    00033000
*        The caller is not running in supervisor state or key 0-7       00033100
ATBSASA_CALLER_NOT_SUP_KEY0_7       EQU   ATBCSS_FW40                   00033200
*                                                                       00033300
         MEND                                                           00033400
                                                                        00033500
