         MACRO                                                          00000100
&LABEL   ATBCTASM                                                       00000200
** START OF SPECIFICATIONS    ***************************************   00000300
*                                                                       00000400
*01* MACRO NAME: ATBCTASM                                               00000500
*                                                                       00000600
*01* DSECT NAME:  N/A                                                   00000700
*                                                                       00000800
*01* DESCRIPTIVE NAME: Interface Declaration File for                   00000900
*                      Callable Transaction Services - Assembler        00001000
*                                                                       00001100
*02*   ACRONYM: ATBCTASM                                                00001200
*                                                                       00001300
*01* COMPONENT: APPC Component (SCACB)                                  00001400
*                                                                       00001500
*01* EYE-CATCHER: NONE                                          @P3A    00001600
*02*   OFFSET: N/A                                                      00001700
*02*   LENGTH: N/A                                                      00001800
*                                                                       00001900
*01* COMPONENT: APPC Component (SCACB)                                  00002000
*                                                                       00002100
**01* PROPRIETARY STATEMENT=                                     @P5A*  00002200
*  **PROPRIETARY_STATEMENT********************************************* 00002300
*                                                                     * 00002400
*                                                                     * 00002500
*   LICENSED MATERIALS - PROPERTY OF IBM                              * 00002600
*   5645-001 COPYRIGHT IBM CORP. 1992, 1997                           * 00002800
*                                                                     * 00002900
*   STATUS= HBB6603                                                   * 00003000
*                                                                     * 00003100
*  **END_OF_PROPRIETARY_STATEMENT************************************** 00003200
*                                                                       00003300
*01* FUNCTION:                                                          00003400
*02*    ATBCTASM contains the Assembler language declarations for       00003500
*       parameter values for Callable Transaction Services.             00003600
*                                                                       00003700
*01* EXTERNAL CLASSIFICATION: GUPI                                      00003800
*01* END OF EXTERNAL CLASSIFICATION                                     00003900
*                                                                       00004000
**                                                                      00004100
*01* POINTED TO BY: N/A                                                 00004200
*                                                                       00004300
*01* CREATED BY:  N/A                                                   00004400
*                                                                       00004500
*01* DELETED BY:  N/A                                                   00004600
*                                                                       00004700
*01* STORAGE ATTRIBUTES:                                                00004800
*02*   SUBPOOL: N/A                                                     00004900
*02*   DATASPACE: N/A                                                   00005000
*02*   KEY: N/A                                                         00005100
*02*   RESIDENCY: N/A                                                   00005200
*02*   VIRTUAL  : N/A                                                   00005300
*                                                                       00005400
*01* SIZE: N/A                                                          00005500
*                                                                       00005600
*01* SERIALIZATION: none                                                00005700
*                                                                       00005800
*01* METHOD OF ACCESS:                                                  00005900
*02*    ASM:             ATBCTASM                                       00006000
*                                                                       00006100
*01* DISTRIBUTION LIBRARY: MACLIB                                       00006200
*                                                                       00006300
*01* CHANGE-ACTIVITY:                                                   00006400
*                                                                       00006500
* Flag LineItem    FMID    DATE  ID  Comment                            00006600
*                                                                       00006700
*    $L0=APPCSSF  HBB4430 920318 PDG9: Advanced Program-to-Program      00006800
*        Communication for MVS/ESA, Callable Transaction Services       00006900
*    $D0=DKB0138  HBB4430 920729 PDBC: Add a return code -              00007000
*        ATBCTS_APPC_NOT_AVAILABLE.                                     00007100
*    $P1=PKB3727  HBB4430 920729 PDG9: Advanced Program-to-Program      00007200
*        Communication for MVS/ESA, Callable Transaction Services       00007300
*    $L1=APPCII   HBB5510 930415 PDD4: Support for Error Extract        00007400
*        Service.                                                       00007500
*    $P2=PIG2256  HBB5510 930909 PDCO: Advanced Program-to-Program      00007600
*        Communication for MVS/ESA, SHOWHDR conformance                 00007700
*    $P3=PN70191  HBB5520 940210 PDCO: Advanced Program-to-Program      00007800
*        Communication for MVS/ESA, SHOWHDR conformance                 00007900
*    $P4=PN71168  HBB5520 940510 PDXB: Support CSECT/RSECT              00008000
*        Satisfies request R042499                                      00008100
*    $01=OW13158  HBB4430 950731 PDB7: Add a new reason code            00008200
*    $L2=APPCP    HBB6603 960105 PDE6: APPC/MVS PC Support              00008300
*    $P5=PQC0919  HBB6603 950325 PDPB: SHOWHDR conformance              00008400
*                                                                       00008500
** END OF SPECIFICATIONS    *****************************************   00008600
*                                                                       00008700
ATBCTS_FW0                          DC    F'00'                         00008800
ATBCTS_FW1                          DC    F'01'                         00008900
ATBCTS_FW2                          DC    F'02'                         00009000
ATBCTS_FW3                          DC    F'03'                         00009100
ATBCTS_FW4                          DC    F'04'                         00009200
*                                                                       00009300
*   Reject Conversation - Deallocate Sense Codes                        00009400
*                                                                       00009500
ATBCTS_TP_NOT_AVAILABLE_RETRY       DC    X'084B6031'                   00009600
ATBCTS_TP_NOT_AVAIL_NO_RETRY        DC    X'084C0000'                   00009700
ATBCTS_TPN_NOT_RECOGNIZED           DC    X'10086021'                   00009800
ATBCTS_SECURITY_NOT_VALID           DC    X'080F6051'                   00009900
ATBCTS_SYNC_LVL_NOT_SPPRTD_PGM      DC    X'10086041'                   00010000
ATBCTS_CONV_TYPE_MISMATCH           DC    X'10086034'                   00010100
*                                                                       00010200
*   Event Notification Types                                            00010300
*                                                                       00010400
ATBCTS_SET_ONE_TIME_NOTIFY          EQU   ATBCTS_FW1              @P1C  00010500
ATBCTS_SET_CONTINUOUS_NOTIFY        EQU   ATBCTS_FW2              @P1C  00010600
ATBCTS_CANCEL_NOTIFY                EQU   ATBCTS_FW3              @P1C  00010700
ATBCTS_CANCEL_ALL_NOTIFY            EQU   ATBCTS_FW4              @P1C  00010800
*                                                                       00010900
*   Event Notification Codes                                            00011000
*                                                                       00011100
ATBCTS_ALLOCATE_QUEUE_MIN           EQU   ATBCTS_FW1              @P1C  00011200
ATBCTS_ALLOCATE_QUEUE_MAX           EQU   ATBCTS_FW2              @P1C  00011300
*                                                                       00011400
*   Invocation types                                                    00011500
*                                                                       00011600
ATBCTS_IMMEDIATE                    EQU   ATBCTS_FW1              @P1C  00011700
ATBCTS_WAIT                         EQU   ATBCTS_FW2              @P1C  00011800
ATBCTS_TIMED                        EQU   ATBCTS_FW3              @P1C  00011900
*                                                                       00012000
*   Event Buffers                                                       00012100
*                                                                       00012200
ATBCTS_BUF_ALLOC_QUEUE_MIN DSECT                                        00012300
         DS  0F                        Align on word boundary           00012400
ATBCTS_MIN_ALLOC_QUEUE_TOKEN DS CL8                                     00012500
ATBCTS_MIN_QUEUE_SIZE   DS CL4                                          00012600
ATBCTS_BUF_ALLOC_QUEUE_MAX DSECT                                        00012700
         DS  0F                        Align on word boundary           00012800
ATBCTS_MAX_ALLOC_QUEUE_TOKEN DS CL8                                     00012900
ATBCTS_MAX_QUEUE_SIZE   DS CL4                                          00013000
         LCLA  &A             A local variable with no value       @P4A 00013100
         LCLC  &T,&STYP       (Record section type in &STYP)       @P4A 00013200
&STYP    SETC  'CSECT'        (Best we can do under ASMH)          @P4A 00013300
&T       SETC  T'&A     Set type attribute to a local SETC symbol  @P4A 00013400
         AIF   ('&T' NE 'N').ASMH   Test for High Level Assembler  @P4A 00013500
         AIF   ('&SYSSTYP' EQ 'CSECT').HLOK                        @P4A 00013600
         AIF   ('&SYSSTYP' EQ 'RSECT').HLOK                        @P4A 00013700
       MNOTE 12,'ATBCTASM --> SECTION TYPE MUST BE CSECT OR RSECT' @P4A 00013800
.HLOK    ANOP                                                      @P4A 00013900
&STYP    SETC  '&SYSSTYP'                                          @P4A 00014000
.ASMH    ANOP                                                      @P4A 00014100
&SYSECT  &STYP                                                     @P4C 00014200
*                                                                       00014300
*   Return Code Values                                                  00014400
*                                                                       00014500
ATBCTS_OK                           DC    F'00'                         00014600
ATBCTS_WARNING                      DC    F'04'                         00014700
ATBCTS_PARAMETER_ERROR              DC    F'08'                         00014800
ATBCTS_REQUEST_UNSUCCESSFUL         DC    F'16'                         00014900
ATBCTS_SERVICE_FAILURE              DC    F'32'                         00015000
ATBCTS_APPC_NOT_AVAILABLE           DC    F'64'                    @D0A 00015100
*                                                                       00015200
*   Reason Code Values                                                  00015300
*                                                                       00015400
ATBCTS_ALREADY_REGISTERED           DC    F'01'                         00015500
ATBCTS_TP_NAME_NOT_SPECIFIED        DC    F'02'                         00015600
ATBCTS_INVAL_TP_NAME                DC    F'03'                         00015700
ATBCTS_INVAL_TP_NAME_LENGTH         DC    F'04'                         00015800
ATBCTS_LOCAL_LU_NOT_SPECIFIED       DC    F'05'                         00015900
*     6  IS RESERVED                                               @D0C 00016000
ATBCTS_PARAMETER_INACCESSIBLE       DC    F'07'                         00016100
ATBCTS_CANNOT_HOLD_LOCKS            DC    F'08'                         00016200
*     9  IS RESERVED                                                    00016300
ATBCTS_SCHED_CANT_REGISTER          DC    F'10'                         00016400
ATBCTS_SYM_DEST_NAME_UNKNOWN        DC    F'11'                         00016500
ATBCTS_INVAL_LOCAL_LU               DC    F'12'                         00016600
ATBCTS_LU_NOT_RECEIVING             DC    F'13'                         00016700
ATBCTS_NOT_AUTH_TO_SERVE_TP         DC    F'14'                         00016800
ATBCTS_NOT_AUTH_TO_LOCAL_LU         DC    F'15'                         00016900
ATBCTS_APPC_SERVICE_FAILURE         DC    F'16'                         00017000
ATBCTS_INVAL_ALLOC_QUEUE_TOKEN      DC    F'17'                         00017100
ATBCTS_INVAL_NOTIFY_TYPE            DC    F'18'                         00017200
ATBCTS_INVAL_TIMEOUT_VALUE          DC    F'19'                         00017300
ATBCTS_REQUEST_CANCELLED            DC    F'20'                         00017400
ATBCTS_NO_ALLOC_TO_RECEIVE          DC    F'21'                         00017500
ATBCTS_INVAL_CONVERSATION_ID        DC    F'22'                         00017600
ATBCTS_INVAL_SENSE_CODE             DC    F'23'                         00017700
ATBCTS_NOT_FIRST_CONV_CALL          DC    F'24'                         00017800
ATBCTS_NOT_INBOUND_CONV             DC    F'25'                         00017900
ATBCTS_INVAL_EVENT_NOTIF_TYPE       DC    F'26'                         00018000
ATBCTS_INVAL_EVENT_CODE             DC    F'27'                         00018100
ATBCTS_NETID_DOES_NOT_MATCH         DC    F'28'                         00018200
ATBCTS_INVAL_EVENT_CODE_QUAL        DC    F'29'                         00018300
ATBCTS_NO_EVENT_AVAILABLE           DC    F'30'                         00018400
ATBCTS_EVENT_NOTIFY_CANCELLED       DC    F'31'                         00018500
ATBCTS_GET_EVENT_OUTSTANDING        DC    F'32'                         00018600
ATBCTS_NOTIFY_NOT_SET               DC    F'33'                         00018700
ATBCTS_INVAL_QUEUE_KEEP_TIME        DC    F'34'                         00018800
ATBCTS_INVAL_ACCT_DATA_LENGTH       DC    F'35'                   @P1C  00018900
ATBCTS_UNREG_ALL_NO_REGISTERS       DC    F'36'                   @P1C  00019000
ATBCTS_INVAL_EVENT_GET_TYPE         DC    F'37'                   @P1C  00019100
ATBCTS_INVAL_RECEIVE_ALLC_TYPE      DC    F'38'                   @P1C  00019200
ATBCTS_CANNOT_DETERMINE_NETID       DC    F'39'                   @P1C  00019300
ATBCTS_CONV_INACCESSIBLE            DC    F'40'                   @P1C  00019400
ATBCTS_BUFFER_TOO_SMALL             DC    F'41'                   @P1C  00019500
ATBCTS_NO_ERROR_INFO                DC    F'42'                   @L1A  00019600
ATBCTS_INVAL_PARTNER_LU             DC    F'43'                   @01A  00019700
ATBCTS_LUWID_ALREADY_ASSOCIATED     DC    F'44'                   @L2A  00019800
ATBCTS_SYNC_POINT_MANAGER_ERROR     DC    F'45'                   @L2A  00019900
         MEND                                                           00020000
                                                                        00020100
