*%GOTO TPEPROLOG;                                                       00000100
          MACRO                                                         00000200
          ATBDFTPE                                                      00000300
*%TPEPROLOG: ;                                                          00000400
*/*START OF SPECIFICATIONS ******************************************** 00000500
*                                                                       00000600
*01* MACRO NAME: ATBDFTPE                                               00000700
*                                                                       00000800
*01* DESCRIPTIVE NAME: APPC SDFM TP Profile Conversion Exit             00000900
*01*                   Parameter Control Block                          00001000
*02* ACRONYM: ATBDFTPE                                                  00001100
*                                                                       00001200
*01* DSECT NAME: ATBDFTPE                                               00001300
*                                                                       00001400
*01* COMPONENT: APPC Component (SCACB)                                  00001500
*                                                                       00001600
*01* EYE-CATCHER: ATBDFTPE                                              00001700
*02*   OFFSET: 0                                                        00001800
*02*   LENGTH: 8                                                        00001900
*                                                                       00002000
*/***PROPRIETARY_STATEMENT********************************************/ 00002100
*/*01* PROPRIETARY STATEMENT=                                        */ 00002200
*/***PROPRIETARY_STATEMENT********************************************/ 00002300
*/*                                                                  */ 00002400
*/*                                                                  */ 00002500
*/* LICENSED MATERIALS - PROPERTY OF IBM                             */ 00002600
*/* 5695-047  COPYRIGHT IBM CORP. 1991, 1992                         */ 00002800
*/*                                                                  */ 00003000
*/* STATUS= HBB4430                                                  */ 00003100
*/*                                                                  */ 00003200
*/* EXTERNAL CLASSIFICATION:  GUPI                                   */ 00003300
*/*                                                                  */ 00003301
*/* END OF EXTERNAL CLASSIFICATION                                   */ 00003302
*/*                                                                  */ 00003303
*/***END_OF_PROPRIETARY_STATEMENT*************************************/ 00003304
*/********************************************************************* 00003400
*                                                                       00003500
*01* FUNCTION:                                                          00004000
*                                                                       00004100
*    Mapping macro for the System Data File Manager TP Profile          00004200
*    Conversion Exit Parameters                                         00004300
*                                                                       00004400
*01* METHOD OF ACCESS:                                                  00004500
*                                                                       00004600
*02*   ASM: ATBDFTPE                                                    00004700
*                                                                       00004800
*      ATBDFTPE is accessed by a macro invocation of ATBDFTPE.          00004900
*      Addressability to the ATBDFTPE can be obtained via a             00005000
*      USING on ATBDFTPE.                                               00005100
*                                                                       00005200
*02*   PLAS: %INCLUDE SYSLIB(ATBDFTPE)                                  00005300
*                                                                       00005400
*      ATBDFTPE is accessed by a %include statement for ATBDFTPE. A     00005500
*      preprocessor variable ATBDFTPESTORAGE may be set before the      00005600
*      %include to override the default storage class.                  00005700
*                                                                       00005800
*01* POINTED TO BY: Dynamically within ATBSD0G                          00005900
*                                                                       00006000
*01* CREATED BY: ATBSD0G                                                00006100
*                                                                       00006200
*01* DELETED BY: ATBSD0G                                                00006300
*                                                                       00006400
*01* STORAGE ATTRIBUTES:                                                00006500
*02*  SUBPOOL  : 230                                                    00006600
*02*  KEY      : 1                                                      00006700
*02*  RESIDENCY: Above or Below the 16M Line                            00006800
*                                                                       00006900
*01* SIZE: Refer to Listing of ATBSD0G module.                          00007000
*                                                                       00007100
*01* FREQUENCY: Once per FMH5 invocation.                               00007200
*                                                                       00007300
*01* SERIALIZATION: None                                                00007400
*                                                                       00007500
*01* DEPENDENCIES: None                                                 00007600
*                                                                       00007700
*01* NOTES: None                                                        00007800
*                                                                       00007900
*01* CHANGE-ACTIVITY:                                                   00008000
*                                                                       00008100
*    Flag LineItem  FMID    DATE   ID   Comment                         00008200
*                                                                       00008300
*     $L0=APPC1DF  JBB4422 900928 PDD8: Advanced Program-to-Program     00008400
*         Communication for MVS/ESA, System Data File Manager           00008500
*         Conversion Exit support.                                      00008600
*                                                                       00008700
*     $P1=APPC1DF  JBB4422 910329 PDD8: Corrected spelling of           00008800
*         ATBDFTPE_FUNCTION_REQUESTED.                                  00008900
*                                                                       00009000
*     $P2=PKB0907  HBB4430 920429 PDI8: Removed * from column 72        00009100
*         of START OF SPECIFICATIONS.                                   00009200
*                                                                       00009300
*     $P3=PKB0148  HBB4430 920617 PDG9: Corrected comment on            00009400
*         reserved storage                                              00009500
*                                                                       00009600
*END OF SPECIFICATIONS ***********************************************/ 00009700
*                                                               @SPACE; 00009800
*%GOTO TPEPLASKEY;                                                      00009900
*                                                               @SPACE; 00010000
* /* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * */ 00010100
* /*                                                                 */ 00010200
* /* This is the ATBDFTPE mapping macro.                             */ 00010300
* /* Addressability to the ATBDFTPE can be obtained via a            */ 00010400
* /* USING on ATBDFTPE.                                              */ 00010500
* /*                                                                 */ 00010600
* /* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * */ 00010700
*                                                                       00010800
ATBDFTPE                      DSECT       SDFM TP Profile Conversion    00010900
*                                         Exit Parameter List           00011000
                              DS 0D       Align on double word boundary 00011100
DFTPE_ID                      DS CL8      Identifier                    00011200
DFTPE_VERSION                 DS CL2      Version Number                00011300
DFTPE_LENGTH                  DS H        Length of ATBDFTPE            00011400
DFTPE_PARAMETERS              DS CL8      Parameters from IDENTIFY verb 00011500
DFTPE_TP_PROFILE_KEY_POINTER  DS F        Pointer to TP Profile Key     00011600
DFTPE_TP_PROFILE_POINTER      DS F        Pointer to TP Profile         00011700
DFTPE_CONV_DATA_POINTER       DS F        Pointer to Converted Data     00011800
DFTPE_CONV_DATA_LENGTH        DS F        Length of Converted Data      00011900
DFTPE_FUNCTION_REQUESTED      DS F        Function requested of the     00012000
*                                         Conversion Exit          @P1C 00012100
                              DS CL16     Reserved                      00012200
*                                                                       00012300
* /* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * */ 00012400
* /*                                                                 */ 00012500
* /* These constants are used with the ATBDFTPE Mapping Macro        */ 00012600
* /*                                                                 */ 00012700
* /* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * */ 00012800
*                                                               @SPACE; 00012900
ATBDFTPE_EYE_CATCHER          DC CL8'ATBDFTPE'                          00013000
ATBDFTPE_CURRENT_VERSION      DC CL2'01'                                00013100
DFTPE_CONVERT_TP              DC F'1'                                   00013200
*                                                                       00013300
DFTPE_OKAY                    DC F'0'    Converted and cached           00013400
DFTPE_SYNTAX_ERROR            DC F'20'   Conversion failed, not cached  00013500
DFTPE_SEVERE_ERROR            DC F'36'                                  00013600
DFTPE_NOT_CONVERTED           DC F'54'   Not converted, unconverted     00013700
*                                        TP Profile is cached           00013800
*                                                                       00013900
          MEND                                                          00014000
*                                                                       00014100
*%TPEPLASKEY: ;                                                         00014200
*                                                                       00014300
*  %IF ATBDFTPESTORAGE='' %THEN                                         00014400
*     %ATBDFTPESTORAGE=' ';                                             00014500
*                                                               @SPACE; 00014600
* /* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * */ 00014700
* /*                                                                 */ 00014800
* /* This is the ATBDFTPE mapping macro. It can be automatically     */ 00014900
* /* based by seting the ATBDFTPESTORAGE preprocessor variable.      */ 00015000
* /*                                                                 */ 00015100
* /* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * */ 00015200
*                                                               @SPACE; 00015300
*  DCL                                                                  00015400
*    1 ATBDFTPE ATBDFTPESTORAGE,       /* SDFM TP Profile Conversion    00015500
*                                         Exit Parameter List        */ 00015600
*      2  Dftpe_ID                 char(8),   /* Identifier=ATBDFTPE */ 00015700
*      2  Dftpe_Version            char(2),    /* Version number     */ 00015800
*      2  Dftpe_Length             fixed(16),  /* Length of ATBDFTPE */ 00015900
*                                                               @SPACE; 00016000
*      2  Dftpe_Parameters         char(8),   /* Parms from IDENTIFY */ 00016100
*      2  Dftpe_TP_Profile_Key_Pointer pointer(31), /* Input key     */ 00016200
*      2  Dftpe_TP_Profile_Pointer pointer(31), /* Pointer to data   */ 00016300
*      2  Dftpe_Conv_Data_Pointer  pointer(31), /* Pointer to converted 00016400
*                                                  TP Profile        */ 00016500
*      2  Dftpe_Conv_Data_Length   fixed(31),   /* Length of converted  00016600
*                                                  TP Profile        */ 00016700
*      2  Dftpe_Function_Requested fixed(31),   /* Function requested   00016800
*                                                  of conv. exit     */ 00016900
*                                                               @SPACE; 00017000
*      2  *                        char(16);    /* Reserved - Unused    00017100
*                                                                @P3C*/ 00017200
*                                                               @SPACE; 00017300
* /* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * */ 00017400
* /*                                                                 */ 00017500
* /* These constants are used with the ATBDFTPE Mapping Macro        */ 00017600
* /*                                                                 */ 00017700
* /* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * */ 00017800
*                                                               @SPACE; 00017900
*  DCL ATBDFTPE_eye_catcher     char(8)    constant('ATBDFTPE'),        00018000
*      ATBDFTPE_current_version char(2)    constant('01'),              00018100
*      Dftpe_convert_tp         fixed(32)  constant( 1),                00018200
*      Dftpe_okay               fixed(32)  constant( 0),                00018300
*      Dftpe_syntax_error       fixed(32)  constant(20),                00018400
*      Dftpe_severe_error       fixed(32)  constant(36),                00018500
*      Dftpe_not_converted      fixed(32)  constant(54);                00018600
                                                                        00018700
