* %GOTO PLAS_ATBEXCOS;                                                  00000100
         MACRO                                                          00000200
         ATBEXCOS                                                       00000300
*/*START OF SPECIFICATIONS *******************************************  00000400
*                                                                       00000500
*01* MACRO NAME: ATBEXCOS                                               00000600
*01* DESCRIPTIVE NAME: APPC Extract Specific Conversation Information   00000700
*                      Control Block Mapping                            00000800
*                                                                       00000900
*01* DSECT NAME:  ATBEXCOS                                              00001000
*                                                                       00001100
*01* COMPONENT:  APPC Component (SCACB)                                 00001200
*                                                                       00001300
*01* EYE-CATCHER: None                                                  00001400
*                                                                       00001500
**********************************************************************/ 00001600
*/***PROPRIETARY_STATEMENT********************************************/ 00001700
*/*01* PROPRIETARY STATEMENT=                                        */ 00001800
*/*                                                                  */ 00001900
*/*                                                                  */ 00002000
*/* LICENSED MATERIALS - PROPERTY OF IBM                             */ 00002100
*/* 5645-001 COPYRIGHT IBM CORP. 1990, 1997                          */ 00002200
*/*                                                                  */ 00002300
*/* STATUS= HBB6603                                                  */ 00002400
*/*                                                                  */ 00002500
*/* EXTERNAL CLASSIFICATION: GUPI                                    */ 00002600
*/*                                                                  */ 00002700
*/* END OF EXTERNAL CLASSIFICATION                                   */ 00002800
*/*                                                                  */ 00002900
*/***END_OF_PROPRIETARY_STATEMENT*************************************/ 00003000
*/********************************************************************* 00003200
*                                                                       00003300
*01* FUNCTION:                                                          00003400
*                                                                       00003500
*    ATBEXCOS is used to map the information returned in the            00003600
*    buffer area passed by ATBEXAI when ATBEXAI is called with an       00003700
*    Extract_Code of '0001'X.                                           00003800
*                                                                       00003900
*01* METHOD OF ACCESS:                                                  00004000
*                                                                       00004100
*02*   ASM:                                                             00004200
*                                                                       00004300
*        Addressability to the ATBEXCOS can be established via a        00004400
*        USING on ATBEXCOS.                                             00004500
*                                                                       00004600
*        Invocation syntax:                                             00004700
*          ATBEXCOS                     Include ATBEXCOS mapping        00004800
*           :   :                                                       00004900
*          USING   ATBEXCOS,Rn          Establishes addressability      00005000
*                                                                       00005100
*02*   PLAS:                                                            00005200
*                                                                       00005300
*        %ATBEXCOSBASE is a Macro variable which may be used            00005400
*        to establish the attributes for the ATBEXCOS declaration.      00005500
*        If not specified, 'BASED(excosptr)' default is                 00005600
*        declared by this MACRO.                                        00005700
*                                                                       00005800
*        Invocation syntax:                                             00005900
*          %ATBEXCOSBASE = <optional base, default is BASED(Excosptr)>  00006000
*          %INCLUDE SYSLIB (ATBEXCOS)                                   00006100
*                                                                       00006200
*01* POINTED TO BY:                                                     00006300
*                                                                       00006400
*02*   Local pointer                                                    00006500
*                                                                       00006600
*01* CREATED BY:                                                        00006700
*                                                                       00006800
*02*   Any caller of ATBEXAI                                            00006900
*                                                                       00007000
*01* DELETED BY: Creator                                                00007100
*                                                                       00007200
*01* STORAGE ATTRIBUTES:                                                00007300
*                                                                       00007400
*02*   ALLOCATION-METHOD: Determined by caller                          00007500
*                                                                       00007600
*02*   SUBPOOL/DATASPACE: Determined by caller                          00007700
*                                                                       00007800
*02*   KEY:       Determined by caller                                  00007900
*                                                                       00008000
*02*   RESIDENCY: Determined by caller                                  00008100
*                                                                       00008200
*02*   VIRTUAL:   Determined by caller                                  00008300
*                                                                       00008400
*01* SIZE:  See Assembler listing                                       00008500
*                                                                       00008600
*01* FREQUENCY: 1 per caller                                            00008700
*                                                                       00008800
*01* SERIALIZATION: None                                                00008900
*                                                                       00009000
*01* DEPENDENCIES: None                                                 00009100
*                                                                       00009200
*01* NOTES: None                                                        00009300
*                                                                       00009400
*01* CHANGE-ACTIVITY:                                                   00009500
*                                                                       00009600
*      Flag LineItem  FMID    DATE   ID   Comment                       00009700
*                                                                       00009800
*       $L0=APPCSVS  HBB4430 920108 PDG9: Advanced Program-to_Program   00009900
*         Communication for MVS/ESA, Specfic Conversation Information   00010000
*                                                                       00010100
*       $D1=DKB0049  HBB4430 920318 PDE4: Increase user data field      00010200
*         to 255 bytes                                                  00010300
*                                                                       00010400
*       $D2=DKB0068   HBB4430 920429 PDG9: Advanced Program-to_Program  00010500
*         Communication for MVS/ESA, Server Facilities                  00010600
*         Remove extra field                                            00010700
*                                                                       00010800
*       $D3=DKB0069   HBB4430 920729 PDG9: Advanced Program-to_Program  00010900
*         Communication for MVS/ESA, Server Facilities                  00011000
*         Clarify description of ATBEXCOS_LAST_SERVICE_REASON_CODE      00011100
*                                                                       00011200
*       $P1=PQC1680   HBB6603 960830 PDC9: Add Unit of Recovery Id      00011300
*         which is only valid for conversations with Sync Level of      00011400
*         Syncpt (protected conversations).                             00011500
*                                                                       00011600
*END OF SPECIFICATIONS ***********************************************/ 00011700
         EJECT                                                          00011800
**********************************************************************  00011900
*                                                                    *  00012000
*  ATBEXCOS - Extract Specific Conversation Information Control      *  00012100
*             Block Mapping                                          *  00012200
*                                                                    *  00012300
**********************************************************************  00012400
         SPACE                                                          00012500
ATBEXCOS DSECT                     Extract Specific Conversation        00012600
*                                  Information Control Block            00012700
                         DS  0D    Align on doubleword boundary         00012800
EXCOS_CONV_ID            DS  CL8   Conversation ID                      00012900
EXCOS_INOUT              DS  F     Inbound/Outbound indicator:          00013000
*                                       0 -> outbound, 1 -> inbound     00013100
EXCOS_PLU_LOCATION       DS  F     Partner LU location                  00013200
*                                      1 -> remote, 2 -> local          00013300
EXCOS_CONV_KIND          DS  F     How the conversation was processed   00013400
*                                       0 -> others, 1 -> served TP     00013500
EXCOS_LUWID              DS  CL26  Logical unit of work ID              00013600
EXCOS_CONV_CORRELATOR    DS  CL8   Conversation Correlator              00013700
EXCOS_CONV_USERID        DS  CL10  Conversation userid: sent            00013800
*                                    or received in the attach          00013900
*                                    request (FMH-5) which created      00014000
*                                    this conversation                  00014100
EXCOS_SCHED_NAME         DS  CL8   Scheduler Name                       00014200
EXCOS_TP_NAME_LENGTH     DS  F     Length of TP Name sent               00014300
*                                    or received in the attach          00014400
*                                    request (FMH-5) which created      00014500
*                                    this conversation                  00014600
EXCOS_TP_NAME            DS  CL64  Transaction Program Name sent        00014700
*                                    or received in the attach          00014800
*                                    request (FMH-5) which created      00014900
*                                    this conversation                  00015000
EXCOS_LOCAL_TP_NAME_LENGTH DS F    Local TP Name Length                 00015100
EXCOS_LOCAL_TP_NAME      DS  CL64  Local TP Name                        00015200
EXCOS_LU_NAME            DS  CL8   Logical Unit Name                    00015300
EXCOS_PLU_NAME           DS  CL17  Fully qualified Partner LU name      00015400
                         DS  CL3   Reserved                             00015500
EXCOS_ARRIVAL_TIME       DS  CL8   Date and time this ALLOCATE          00015600
*                                     request was obtained from VTAM    00015700
*                                     or from a local LU                00015800
*                                     by APPC/MVS.  This field          00015900
*                                     contains the date and time in     00016000
*                                     the format provided by the STORE  00016100
*                                     CLOCK (STCK) assembler            00016200
*                                     instruction.  This field is set   00016300
*                                     to zero for outbound requests.    00016400
EXCOS_CONV_AVAILABLE_TIME DS CL8   Date and time this conversation was  00016500
*                                     placed on the allocate queue. The 00016600
*                                     content of this field has meaning 00016700
*                                     only when Excos_Conv_Kind         00016800
*                                     indicates that this is a served   00016900
*                                     TP.                               00017000
EXCOS_CONV_START_TIME    DS CL8    For outbound conversations this is   00017100
*                                     the date and time the allocate    00017200
*                                     was issued.  For inbound          00017300
*                                     conversations, if the TP is not   00017400
*                                     served, this is the time the      00017500
*                                     first verb was issued.            00017600
*                                     For inbound, served TPs, this is  00017700
*                                     the time RECEIVE_ALLOCATE was     00017800
*                                     issued.                           00017900
EXCOS_END_TIME           DS  CL8   Date and time this conversation      00018000
*                                     was deallocated. This field       00018100
*                                     contains the date and time in the 00018200
*                                     format provided by the STORE      00018300
*                                     CLOCK (STCK) assembler            00018400
*                                     instruction.                      00018500
EXCOS_MODE_NAME          DS  CL8   Conversation mode name               00018600
EXCOS_SYNC_LEVEL         DS  F     Conversation synchronization level   00018700
EXCOS_TOTAL_SENDS        DS  F     Total number of Sends issued by      00018800
*                                      the local transaction program    00018900
*                                      on this conversation             00019000
EXCOS_TOTAL_SEND_AMT     DS  CL8   Total amount of data sent, in        00019100
*                                     bytes. Value is returned as       00019200
*                                     a Long Floating Point Number in   00019300
*                                     the form: 'eehhhhhhhhhhhhhh',     00019400
*                                     where ee is the characteristic    00019500
*                                     (00 <= ee <= 7F), and where       00019600
*                                     hhhhhhhhhhhhhh is the 14-digit    00019700
*                                     hexadicimal fraction part.        00019800
EXCOS_TOTAL_RECEIVES     DS  F     Total number of Receives             00019900
EXCOS_TOTAL_RECEIVE_AMT  DS  CL8   Total amount of data received,       00020000
*                                     in bytes. Value is returned as    00020100
*                                     a Long Floating Point Number in   00020200
*                                     the form: 'eehhhhhhhhhhhhhh',     00020300
*                                     where ee is the characteristic    00020400
*                                     (00 <= ee <= 7F), and where       00020500
*                                     hhhhhhhhhhhhhh is the 14-digit    00020600
*                                     hexadicimal fraction part.        00020700
EXCOS_TOTAL_CALLABLE_SERVICE DS F  Total number of                      00020800
*                                     callable service requests         00020900
*                                     issued by the local transaction   00021000
*                                     program for this conversation     00021100
EXCOS_LAST_SERVICE_RETURN_CODE DS F Return code from last requested     00021200
*                                     callable service                  00021300
EXCOS_LAST_SERVICE_REASON_CODE DS F Reason code from last callable      00021400
*                                   service requested on this           00021500
*                                   conversation which returned         00021600
*                                   product_specific_error         @D3C 00021700
EXCOS_CONVERSATION_STATE DS  F      Current State of Conversation       00021800
EXCOS_LAST_SERVICE_START_TIME DS CL8 Date and time of start of last     00021900
*                                     requested service in STCK format  00022000
EXCOS_LAST_SERVICE_END_TIME DS CL8  Date and time of end of last        00022100
*                                     requested service in STCK format  00022200
EXCOS_LENGTH_OF_USER_DATA DS F      Length of Excos_User_Data field     00022300
EXCOS_USER_DATA          DS  CL255  User field - This field is set @D1C 00022400
*                                     from user input provided via      00022500
*                               SET_CONVERSATION_ACCOUNTING_INFORMATION 00022600
EXCOS_URID               DS CL16    Unit of Recovery Identifier for     00022700
*                                   protected conversations        @P1A 00022800
ATBEXCOS_LEN             EQU *-ATBEXCOS  Length of ATBEXCOS control     00022900
*                                   block                               00023000
         MEND                                                           00023100
**********************************************************************  00023200
*                                                                    *  00023300
*    End of Assembler mapping                                        *  00023400
*                                                                    *  00023500
**********************************************************************  00023600
*%PLAS_ATBEXCOS: ;                                                      00023700
*/*START OF SPECIFICATIONS *******************************************  00023800
*                                                                       00023900
*01* MACRO NAME: ATBEXCOS                                               00024000
*01* DESCRIPTIVE NAME: APPC Extract Specific Conversation Information   00024100
*                      Control Block Mapping                            00024200
*                                                                       00024300
*01* DSECT NAME:  ATBEXCOS                                              00024400
*                                                                       00024500
*01* COMPONENT:  APPC Component (SCACB)                                 00024600
*                                                                       00024700
*01* EYE-CATCHER: None                                                  00024800
*                                                                       00024900
**********************************************************************/ 00025000
*/***PROPRIETARY_STATEMENT********************************************/ 00025100
*/*01* PROPRIETARY STATEMENT=                                        */ 00025200
*/*                                                                  */ 00025300
*/*                                                                  */ 00025400
*/* LICENSED MATERIALS - PROPERTY OF IBM                             */ 00025500
*/* 5645-001 (C) COPYRIGHT IBM CORP. 1990, 1997                      */ 00025700
*/*                                                                  */ 00025800
*/* STATUS= HBB6603                                                  */ 00025900
*/*                                                                  */ 00026000
*/* EXTERNAL CLASSIFICATION: GUPI                                    */ 00026100
*/*                                                                  */ 00026200
*/* END EXTERNAL CLASSIFICATION                                      */ 00026300
*/*                                                                  */ 00026400
*/***END_OF_PROPRIETARY_STATEMENT*************************************/ 00026500
*/********************************************************************* 00026600
*                                                                       00026700
*01* FUNCTION:                                                          00026800
*                                                                       00026900
*    ATBEXCOS is used to map the information returned in the            00027000
*    buffer area passed by ATBEXAI when ATBEXAI is called with an       00027100
*    Extract_Code of '0001'X.                                           00027200
*                                                                       00027300
*01* METHOD OF ACCESS:                                                  00027400
*                                                                       00027500
*02*   ASM:                                                             00027600
*                                                                       00027700
*        Addressability to the ATBEXCOS can be established via a        00027800
*        USING on ATBEXCOS.                                             00027900
*                                                                       00028000
*        Invocation syntax:                                             00028100
*          ATBEXCOS                     Include ATBEXCOS mapping        00028200
*           :   :                                                       00028300
*          USING   ATBEXCOS,Rn          Establishes addressability      00028400
*                                                                       00028500
*02*   PLAS:                                                            00028600
*                                                                       00028700
*        %ATBEXCOSBASE is a Macro variable which may be used            00028800
*        to establish the attributes for the ATBEXCOS declaration.      00028900
*        If not specified, 'BASED(Excosptr)' default is                 00029000
*        declared by this MACRO.                                        00029100
*                                                                       00029200
*        Invocation syntax:                                             00029300
*          %ATBEXCOSBASE = <optional base, default is BASED(Excosptr)>  00029400
*          %INCLUDE SYSLIB (ATBEXCOS)                                   00029500
*                                                                       00029600
*01* POINTED TO BY:                                                     00029700
*                                                                       00029800
*02*   Local pointer                                                    00029900
*                                                                       00030000
*01* CREATED BY:                                                        00030100
*                                                                       00030200
*02*   Any caller of ATBEXAI                                            00030300
*                                                                       00030400
*01* DELETED BY: Creator                                                00030500
*                                                                       00030600
*01* STORAGE ATTRIBUTES:                                                00030700
*                                                                       00030800
*02*   ALLOCATION-METHOD: Determined by caller                          00030900
*                                                                       00031000
*02*   SUBPOOL/DATASPACE: Determined by caller                          00031100
*                                                                       00031200
*02*   KEY:       Determined by caller                                  00031300
*                                                                       00031400
*02*   RESIDENCY: Determined by caller                                  00031500
*                                                                       00031600
*02*   VIRTUAL:   Determined by caller                                  00031700
*                                                                       00031800
*01* FREQUENCY: 1 per caller                                            00031900
*                                                                       00032000
*01* SERIALIZATION: None                                                00032100
*                                                                       00032200
*01* DEPENDENCIES: None                                                 00032300
*                                                                       00032400
*01* NOTES: None                                                        00032500
*                                                                       00032600
*01* CHANGE-ACTIVITY:                                                   00032700
*                                                                       00032800
*      Flag LineItem  FMID    DATE   ID   Comment                       00032900
*                                                                       00033000
*       $L0=APPCSVS  HBB4430 920108 PDG9: Advanced Program-to_Program   00033100
*         Communication for MVS/ESA, Specfic Conversation Information   00033200
*                                                                       00033300
*       $D1=DKB0049  HBB4430 920318 PDE4: Increase user data field      00033400
*         to 255 bytes                                                  00033500
*                                                                       00033600
*       $D2=DKB0068   HBB4430 920429 PDG9: Advanced Program-to_Program  00033700
*         Communication for MVS/ESA, Server Facilities                  00033800
*         Remove extra field                                            00033900
*                                                                       00034000
*       $D3=DKB0069   HBB4430 920729 PDG9: Advanced Program-to_Program  00034100
*         Communication for MVS/ESA, Server Facilities                  00034200
*         Clarify description of ATBEXCOS_LAST_SERVICE_REASON_CODE      00034300
*                                                                       00034400
*       $P1=PQC1680   HBB6603 960830 PDC9: Add Unit of Recovery Id      00034500
*         which is only valid for conversations with Sync Level of      00034600
*         Syncpt (protected conversations).                             00034700
*                                                                       00034800
*END OF SPECIFICATIONS ***********************************************/ 00034900
 %IF ATBEXCOSBASE='' %THEN         /* Any basing expression?         */ 00035000
    %ATBEXCOSBASE='BASED(Excosptr)'; /* No, so use the default       */ 00035100
 %ELSE                                                                  00035200
    %GOTO PLAS_SKIP_EXCOSPTR_DCL;  /* Skip DCL for default ptr       */ 00035300
                                                                        00035400
  DECLARE                                                               00035500
    Excosptr PTR(31);              /* Default basing ptr for Atbexcos*/ 00035600
                                                                        00035700
 %PLAS_SKIP_EXCOSPTR_DCL: ;                                             00035800
                                                                        00035900
 DECLARE                                                                00036000
   1 Atbexcos ATBEXCOSBASE,        /* Extract Specific Conversation     00036100
                                      Information Control Block      */ 00036200
     3 Excos_Conv_ID     CHAR(8),  /* Conversation ID                */ 00036300
     3 Excos_InOut       FIXED(32), /* Inbound/Outbound indicator:      00036400
                                       0 -> outbound, 1 -> inbound   */ 00036500
     3 Excos_PLU_Location FIXED(32), /* Partner LU location             00036600
                                       1 -> remote, 2 -> local       */ 00036700
     3 Excos_Conv_Kind    FIXED(32), /* How the conversation was        00036800
                                       processed                        00036900
                                       0 -> others, 1 -> served TP   */ 00037000
     3 Excos_Luwid       CHAR(26), /* Logical unit of work ID        */ 00037100
     3 Excos_Conv_Correlator CHAR(8), /* Conversation Correlator     */ 00037200
     3 Excos_Conv_Userid CHAR(10), /* Conversation userid: sent         00037300
                                      or received in the attach         00037400
                                      request (FMH-5)                   00037500
                                      which created this                00037600
                                      conversation                   */ 00037700
     3 Excos_Sched_Name  CHAR(8),  /* Scheduler Name                 */ 00037800
     3 Excos_TP_Name_Length FIXED(32), /* Length of TP Name sent        00037900
                                      or received in the attach         00038000
                                      request (FMH-5)                   00038100
                                      which created this                00038200
                                      conversation                   */ 00038300
     3 Excos_TP_Name     CHAR(64), /* Transaction Program Name sent     00038400
                                      or received in the attach         00038500
                                      request (FMH-5)                   00038600
                                      which created this                00038700
                                      conversation                   */ 00038800
     3 Excos_Local_TP_Name_Length FIXED(32), /* Local TP Name Length */ 00038900
     3 Excos_Local_TP_Name     CHAR(64), /* Local TP Name            */ 00039000
     3 Excos_LU_Name     CHAR(8),  /* Logical Unit Name              */ 00039100
     3 Excos_PLU_Name    CHAR(17), /* Fully qualified Partner LU name*/ 00039200
     3 *                 CHAR(3),  /* Reserved                       */ 00039300
     3 Excos_Arrival_Time CHAR(8), /* Date and time this ALLOCATE       00039400
                                      request was obtained from VTAM    00039500
                                      or from a local LU                00039600
                                      by APPC/MVS.  This field          00039700
                                      contains the date and time in     00039800
                                      the format provided by the STORE  00039900
                                      CLOCK (STCK) assembler            00040000
                                      instruction.  This field is set   00040100
                                      to zero for outbound requests  */ 00040200
     3 Excos_Conv_Available_Time CHAR(8), /* Date and time this         00040300
                                      conversation was placed on the    00040400
                                      allocate queue.  The content of   00040500
                                      this field has meaning only when  00040600
                                      Excos_Conv_Kind indicates that    00040700
                                      this is a served conversation. */ 00040800
     3 Excos_Conv_Start_Time CHAR(8), /* For outbound conversations this00040900
                                      is the date and time the allocate 00041000
                                      was issued.  For inbound          00041100
                                      conversations, if the TP is not   00041200
                                      served, this is the time the first00041300
                                      verb was issued.  For inbound,    00041400
                                      served TPs, this is the time      00041500
                                      RECEIVE_ALLOCATE was issued.   */ 00041600
     3 Excos_End_Time CHAR(8),     /* Date and time this conversation   00041700
                                      was deallocated. This field       00041800
                                      contains the date and time in the 00041900
                                      format provided by the STORE CLOCK00042000
                                      (STCK) assembler instruction.  */ 00042100
     3 Excos_Mode_Name   CHAR(8),  /* Conversation mode name         */ 00042200
     3 Excos_Sync_Level FIXED(32), /* Conversation synchronization      00042300
                                      level                          */ 00042400
     3 Excos_Total_Sends FIXED(32), /* Total number of Sends issued by  00042500
                                      the local transaction program     00042600
                                      on this conversation           */ 00042700
     3 Excos_Total_Send_Amt CHAR(8),/* Total amount of data sent, in    00042800
                                      bytes. Value is returned as       00042900
                                      a Long Floating Point Number in   00043000
                                      the form: 'eehhhhhhhhhhhhhh',     00043100
                                      where ee is the characteristic    00043200
                                      (00 <= ee <= 7F), and where       00043300
                                      hhhhhhhhhhhhhh is the 14-digit    00043400
                                      hexadicimal fraction part.     */ 00043500
     3 Excos_Total_Receives FIXED(32), /* Total number of Receives   */ 00043600
     3 Excos_Total_Receive_Amt CHAR(8),/* Total amount of data received 00043700
                                      in bytes. Value is returned as    00043800
                                      a Long Floating Point Number in   00043900
                                      the form: 'eehhhhhhhhhhhhhh',     00044000
                                      where ee is the characteristic    00044100
                                      (00 <= ee <= 7F), and where       00044200
                                      hhhhhhhhhhhhhh is the 14-digit    00044300
                                      hexadicimal fraction part.     */ 00044400
     3 Excos_Total_Callable_Service FIXED(32), /* Total number of       00044500
                                      callable service requests         00044600
                                      issued by the local transaction   00044700
                                      program for this conversation  */ 00044800
     3 Excos_Last_Service_Return_Code FIXED(32), /* Return code from    00044900
                                      last requested callable service*/ 00045000
     3 Excos_Last_Service_Reason_Code FIXED(32), /* Reason code from    00045100
                                      last callable service requested   00045200
                                      on this conversation which        00045300
                                      returned product_specific_error   00045400
                                                                 @D3C*/ 00045500
     3 Excos_Conversation_State  FIXED(31), /* Current                  00045600
                                      State of Conversation          */ 00045700
     3 Excos_Last_Service_Start_Time CHAR(8), /* Date and time of start 00045800
                                      of last requested service in STCK 00045900
                                      format                         */ 00046000
     3 Excos_Last_Service_End_Time CHAR(8), /* Date and time of end of  00046100
                                      last requested service in STCK    00046200
                                      format                         */ 00046300
     3 Excos_Length_Of_User_Data FIXED(32), /* Length of                00046400
                                      Excos_User_Data                */ 00046500
     3 Excos_User_Data CHAR(255),  /* User field - This field is set    00046600
                                      from user input provided via      00046700
                              SET_CONVERSATION_ACCOUNTING_INFORMATION   00046800
                                                                @D1C */ 00046900
     3 Excos_URID CHAR(16);        /* Unit of Recovery Identifier for   00047000
                                      protected conversations    @P1A*/ 00047100
                                                                        00047200
 @SPACE;                                                                00047300
 /********************************************************************/ 00047400
 /*                                                                  */ 00047500
 /*   Length Constants                                               */ 00047600
 /*                                                                  */ 00047700
 /********************************************************************/ 00047800
                                                                        00047900
 DECLARE                                                                00048000
   atbexcos_len FIXED(31) CONSTANT(Length(Atbexcos)); /* Length of the  00048100
                                      ATBEXCOS control block         */ 00048200
                                                                        00048300
                                                                        00048400
