*%GOTO PLAS_ATBXCFMS;                                                   00000100
         MACRO                                                          00000200
         ATBXCFMS                                                       00000300
*/* START OF SPECIFICATIONS ******************************************* 00000400
**                                                                      00000500
**01* MACRO NAME: ATBXCFMS                                              00000600
**                                                                      00000700
**01* DSECT NAME:                                                       00000800
**               XCFMS_SHORT_MESSAGE_HEADER                             00000900
**               XCFMS_INBOUND_FMH5                                     00001000
**               XCFMS_LUM_STATUS_MESSAGE                         @L1A  00001100
**                                                                      00001200
**01* DESCRIPTIVE NAME: APPC/XCF Message mappings                       00001300
**                                                                      00001400
**02*   ACRONYM: XCFMS                                                  00001500
**                                                                      00001600
**01* COMPONENT: APPC Component (SCACB)                                 00001700
**                                                                      00001800
**01* EYE-CATCHER: None                                                 00001900
**                                                                      00002000
**********************************************************************/ 00002100
*/*01* PROPRIETARY STATEMENT=                                        */ 00002200
*/***PROPRIETARY_STATEMENT********************************************/ 00002300
*/*                                                                  */ 00002400
*/*                                                                  */ 00002500
*/* LICENSED MATERIALS - PROPERTY OF IBM                             */ 00002600
*/* 5647-A01 COPYRIGHT IBM CORP. 1990, 1998                          */ 00002700
*/*                                                                  */ 00002800
*/* STATUS= HBB6606                                                  */ 00002900
*/*                                                                  */ 00003000
*/***END_OF_PROPRIETARY_STATEMENT*************************************/ 00003100
*/********************************************************************* 00003200
**                                                                      00003400
**01* FUNCTION:                                                         00003500
**                                                                      00003600
**    This mapping macro contains a mapping of each APPC/XCF            00003700
**    message in APPC.  It also contains the constants for the          00003800
**    message types for the APPC/XCF messages.                          00003900
**                                                                      00004000
**    When a transaction scheduler accepts a message longer than        00004100
**    the 32 byte initial message, the buffer that is used to           00004200
**    receive the message must be obtained in the PSW key in            00004300
**    which the transaction scheduler joined the APPC Group in.         00004400
**                                                                      00004500
**                                                                      00004600
**01* EXTERNAL CLASSIFICATION:                                          00004700
**                                                                      00004800
**02*   GUPI: BASE                                                      00004900
**                                                                      00005000
**02*   DMTI: FIELDS                                                    00005100
**             XCFMS_ATTACH_EXIT_DATA                                   00005200
**                                                                      00005300
**01* END OF EXTERNAL CLASSIFICATION                                    00005400
**                                                                      00005500
**                                                                      00005600
**01* METHOD OF ACCESS:                                                 00005700
**                                                                      00005800
**02*   ASM:                                                            00005900
**                                                                      00006000
**       Addressability to the XCFMS_SHORT_MESSAGE_HEADER can be        00006100
**       established via a USING on XCFMS_SHORT_MESSAGE_HEADER          00006200
**                                                                      00006300
**       Addressability to the Allocate TP Request Message can be       00006400
**       established via a USING on XCFMS_INBOUND_FMH5                  00006500
**                                                                      00006600
**       Addressability to the LU Status Message be                     00006700
**       established via a USING on XCFMS_LUM_STATUS_MESSAGE      @Q1A  00006800
**                                                                      00006900
**       Invocation syntax:                                             00007000
**         ATBXCFMS                               Include macro mapping 00007100
**          :   :                                                       00007200
**         USING   XCFMS_SHORT_MESSAGE_HEADER,Rn  Establishes           00007300
**                                                Addressability        00007400
**         USING   XCFMS_INBOUND_FMH5,Rm          Establishes           00007500
**                                                Addressability        00007600
**         USING   XCFMS_LUM_STATUS_MESSAGE,Rx    Establishes           00007700
**                                                Addressability        00007800
**                                                                      00007900
**      ATBXCFMS                                                        00008000
**                                                                      00008100
**02*   PLAS:                                                           00008200
**                                                                      00008300
**      See the individual mapping below for instructions on how to     00008400
**      base the mappings.                                              00008500
**                                                                      00008600
**      To then include the mapping macro, issue the following:         00008700
**        %INCLUDE  SYSLIB(ATBXCFMS)                                    00008800
**                                                                      00008900
**01* POINTED TO BY: User Defined                                       00009000
**                                                                      00009100
**01* CREATED BY:  N/A                                                  00009200
**                                                                      00009300
**01* DELETED BY:  N/A                                                  00009400
**                                                                      00009500
**01* STORAGE ATTRIBUTES:                                               00009600
**                                                                      00009700
**02*   ALLOCATION-METHOD: User Defined                                 00009800
**                                                                      00009900
**02*   SUBPOOL/DATASPACE: User Defined                                 00010000
**                                                                      00010100
**02*   KEY: Any                                                        00010200
**                                                                      00010300
**02*   RESIDENCY: Any                                                  00010400
**                                                                      00010500
**02*   VIRTUAL: Any                                                    00010600
**                                                                      00010700
**01* SIZE:  See Assembler listing                                      00010800
**                                                                      00010900
**01* SERIALIZATION:  None                                              00011000
**                                                                      00011100
**01* DEPENDENCIES: None                                                00011200
**                                                                      00011300
**01* NOTES: None                                                       00011400
**                                                                      00011500
**01* DISTRIBUTION LIBRARY: MACLIB                                      00011600
**                                                                      00011700
** = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = =  00011800
**01* CHANGE-ACTIVITY:                                                  00011900
**                                                                      00012000
**    Flag LineItem  FMID    DATE   ID    Comment                       00012100
**                                                                      00012200
**     $L0=APPC1MI   HBB4420 891009 PDF1: Advanced Program-to-Program   00012300
**         Communication for MVS/ESA, initial release                   00012400
**                                                                      00012500
**     $D1=DH30069   HBB4420 891211 PDV7: Add two bytes of padding      00012600
**         after LUWID in the Attach TP message to end on a word        00012700
**         boundary                                                     00012800
**                                                                      00012900
**     $D2=DH30078   HBB4420 890122 PDV7: Add conversation type and     00013000
**         conversation sync level to the Attach TP message             00013100
**                                                                      00013200
**     $L1=APPC1LU   JBB4422 900720 PDB2: Scheduler Recovery            00013300
**         Facilities Enablement                                        00013400
**                                                                      00013500
**     $L2=APPC1MI   JBB4422 900824 PDV7: Add ENVR Object support       00013600
**                                                                      00013700
**     $P1=PH31223   HBB4420 890917 PDB7: Add assembler declarations    00013800
**                                                                      00013900
**     $Q1=PKI0021   JBB4422 900928 PDB7: Add new assembler             00014000
**         declarations                                                 00014100
**                                                                      00014200
**     $P2=PH32107   HBB4420 910204 PDF1: Change size of                00014300
**                   XCFMS_PROFILE_KEY from 100 bytes to 108.           00014400
**                                                                      00014500
**     $D3=DKI0022   JBB4422 910510 PDBC: Changed XRFLU keyword to      00014600
**         ALTLU                                                        00014700
**                                                                      00014800
**     $P3=PKB0148   HBB4430 920617 PDG9: Correct comment on            00014900
**         XCFMS_LU_FLAGS                                               00015000
**                                                                      00015100
**     $L3=XCFCC     HBB5510 930421 PDCO: Add conversation correlator   00015200
**         to the Allocate TP Request Message.                          00015300
**                                                                      00015400
**     $P4=PIG4250   HBB5510 930520 PDCO: Move conversation correlator  00015500
**         related fields to the 'reserved slots'.                      00015600
**                                                                      00015700
**     $01=OW05742   HBB5510 940611 PDI6: OpenMVS Exit Data Support     00015800
**                                                                      00015900
**     $L4=APPCC     HBB6603 950601 PDB7: Add generic resource name     00016000
**         to LU Activation/Deactivation message.                       00016100
**                                                                      00016200
**     $L5=APPCC     HBB6603 950801 PDE4: Add NQN Support indicator.    00016300
**                                                                      00016400
**     $L6=APPCP     HBB6603 951117 PDE6: APPC/MVS PC Support.          00016500
**     $P5=PVT0251   HBB6606 971209 PDB7: Create a flag to              00016600
**        indicate whether the Local LU is NQN Capable.                 00016700
**     $02=OW51636   HBB7703 011212 PDI8: Support XCF messages greater  00016800
**        than 61K.                                                     00016900
**                                                                      00017000
**** END OF SPECIFICATIONS *******************************************/ 00017100
         EJECT                                                          00017200
**********************************************************************  00017300
** This mapping is mapped over the 32-byte short message buffer      *  00017400
** (XCF Control Area).  This mapping will be common to all short     *  00017500
** messages.  The message type will always be the first 4 bytes,     *  00017600
** with specific information following the message type field.       *  00017700
**                                                               @P1A*  00017800
**********************************************************************  00017900
         SPACE                                                          00018000
XCFMS_SHORT_MESSAGE_HEADER DSECT                                        00018100
                           DS 0F                                        00018200
XCFMS_MESSAGE_TYPE         DS  F                                        00018300
XCFMS_INFORMATION          DS  CL28   another mapping will be           00018400
*                                     mapped over this field.           00018500
*                                     it will be specific to            00018600
*                                     the type of message         @P1A  00018700
XCFMS_HEADER_LENGTH        EQU  *-XCFMS_SHORT_MESSAGE_HEADER            00018800
*                                     Length of short message           00018900
*                                                                       00019000
**********************************************************************  00019100
*                APPC STATUS MESSAGE                                    00019200
*  This mapping will be for the APPC status message.  This mapping      00019300
*  will be defined right on top of the XCFMS_INFORMATION field.         00019400
*  Those using this message need only to refer to the fields            00019500
*  directly.                                                            00019600
*                                                                       00019700
*  The message types are also defined here.  They are:                  00019800
*      APPC initialization message  ->   '00001000'X                    00019900
*      APPC termination/norestart   ->   '00001001'X                    00020000
*      APPC termination/restart     ->   '00001002'X                    00020100
*                                                                 @P1A  00020200
**********************************************************************  00020300
         SPACE                                                          00020400
         ORG  XCFMS_INFORMATION                                         00020500
XCFMS_APPC_STATUS          DS  0F                                       00020600
XCFMS_APPC_VERSION         DS  CL4    The level of the APPC             00020700
*                                     component active on the           00020800
*                                     system                      @P1A  00020900
XCFMS_APPC_TIME_STAMP      DS  CL8    The time stamp, in TOD            00021000
*                                     format, of the time APPC          00021100
*                                     completed initialization          00021200
*                                     or completed termination    @P1A  00021300
XCFMS_APPC_RESERVE         DS  CL16   Reserved                    @P1A  00021400
*                                                                       00021500
         SPACE                                                          00021600
XCFMS_CURRENT_APPC_VERSION DC CL4'0001'                           @P1A  00021700
         SPACE                                                          00021800
XCFMS_APPC_INIT            EQU  4096                              @P1A  00021900
XCFMS_APPC_NORESTART       EQU  4097                              @P1A  00022000
XCFMS_APPC_RESTART         EQU  4098                              @P1A  00022100
         SPACE                                                          00022200
**********************************************************************  00022300
**          LU ACTIVATION/DEACTIVATION MESSAGE                       *  00022400
**                                                                   *  00022500
** This mapping will be for the LU status message.  This mapping     *  00022600
** will be defined right on top of the XCFMS_INFORMATION field.      *  00022700
** Those using this message need only to refer to these fields       *  00022800
** directly.                                                         *  00022900
**                                                                   *  00023000
** The message types are also defined here.  They are:               *  00023100
**     LU activation    ->   '00002000'X                             *  00023200
**     LU deactivation  ->   '00002001'X                             *  00023300
**                                                                   *  00023400
**********************************************************************  00023500
         SPACE                                                          00023600
         ORG  XCFMS_INFORMATION                                         00023700
XCFMS_LUM_STATUS           DS  0F                                       00023800
XCFMS_LU_FLAGS             DS  0XL4    Flags indicating special         00023900
*                                     features of the LU.         @P1A  00024000
                           DS  XL1                                      00024100
XCFMS_BASE_LU              EQU X'80'  BIT   MEANING                     00024200
*                                     0   The LU was specified          00024300
*                                         as the BASE LU for            00024400
*                                         the scheduler           @P1A  00024500
XCFMS_NQN_CAPABLE          EQU X'20'  BIT   MEANING                     00024600
*                                     2   The LU is capable of          00024700
*                                         supporting network-           00024800
*                                         qualified function.     @L5A  00024900
                           DS  XL3    Reserved                    @P3C  00025000
XCFMS_LU_TIME_STAMP        DS  CL8    The time stamp, in TOD            00025100
*                                     format, of the time               00025200
*                                     the LU was activated or           00025300
*                                     deactivated                 @P1A  00025400
XCFMS_LU_NAME              DS  CL8    The local LU name described       00025500
*                                     by the message (it is not         00025600
*                                     fully qualified)            @P1A  00025700
XCFMS_TRANS_SCHED_NAME     DS  CL8    The name of the Transaction       00025800
*                                     Scheduler assigned to the         00025900
*                                     LU name in the APPCPMxx           00026000
*                                     parmlib member              @P1A  00026100
         SPACE                                                          00026200
**********************************************************************  00026300
*   Message type constants                                           *  00026400
**********************************************************************  00026500
XCFMS_LU_ACTIVE            EQU  8192                              @P1A  00026600
XCFMS_LU_NOACTIVE          EQU  8193                              @P1A  00026700
         SPACE                                                          00026800
**********************************************************************  00026900
**              ALLOCATE TP REQUEST MESSAGE HEADER                   *  00027000
**                                                                   *  00027100
** This mapping will be for the Allocate TP Request Message header.  *  00027200
** This message will be accompanied by a longer message representing *  00027300
** an Allocate TP request.  The TPID in this header will represent   *  00027400
** the Transaction Program that this allocate request represents.    *  00027500
** This mapping will be defined right on top of the                  *  00027600
** XCFMS_INFORMATION field. Those using this message need only to    *  00027700
** refer to these fields directly.                                   *  00027800
**                                                                   *  00027900
** The message types are also defined here.  They are:               *  00028000
**     ATTACH TP request ->   '00000001'X                            *  00028100
**                                                                   *  00028200
**********************************************************************  00028300
         SPACE                                                          00028400
         ORG  XCFMS_INFORMATION                                         00028500
XCFMS_ATTACH_HEADER        DS  0F                                 @P1A  00028600
XCFMS_ATTACH_TPID          DS  CL8    The Transaction Program ID which  00028700
*                                     uniquely identifies the TP        00028800
*                                     created allocate TP request @P1A  00028900
XCFMS_ATTACH_EXIT_DATA     DS  A      Exit Data For this Attach         00029000
*                                     Request, used for OpenEdition MVS 00029100
*                                     Allocate_Conversation Exit  @01A  00029200
XCFMS_APPC_NOTIFYEXIT_DATA DS  CL8    Control information used          00029300
*                                     by APPC to communicate            00029400
*                                     with its XCF Notification         00029500
*                                     exit                        @02A  00029600
XCFMS_ATTACH_RESERVED      DS  CL8    RESERVED space              @02C  00029700
         SPACE                                                          00029800
**********************************************************************  00029900
** Message type constants                                            *  00030000
**********************************************************************  00030100
XCFMS_INBOUND_ATTACH       EQU  1                                 @P1A  00030200
         SPACE                                                          00030300
*********************************************************************   00030400
*                LU STATUS MESSAGE                                      00030500
* This message will represent the status of an LU.  This                00030600
* message will accompany the LU status header.                          00030700
*                                                                       00030800
*********************************************************************   00030900
         SPACE                                                          00031000
XCFMS_LUM_STATUS_MESSAGE DSECT                                          00031100
*                         DS  0F                                   @Q1A 00031200
XCFMS_LU_MSG_TYPE         DS   F      LU message type (same as the      00031300
*                                     XCFMS_MESSAGE_TYPE)               00031400
*                                     '00002000'X -> LU activate        00031500
*                                     '00002001'X -> LU deactivate @Q1A 00031600
XCFMS_LU_USERVAR          DS  CL8     The user variable supplied in     00031700
*                                     the APPCPMxx parmlib member  @Q1A 00031800
XCFMS_ALT_LU              DS  CL8     The ALT_LU value supplied in      00031900
*                                     the APPCPMxx parmlib member  @Q1A 00032000
XCFMS_GENERIC_RESOURCE    DS  CL8     The generic resource name used    00032100
*                                     for the LU.  This value is        00032200
*                                     supplied using the GRNAME keyword 00032300
*                                     on the LUADD statement.           00032400
*                                     (will be zeroes if GRNAME not     00032500
*                                      used)                       @L4A 00032600
XCFMS_XRF_MSG_RESERVED    DS  CL16    Reserved space               @L4C 00032700
         SPACE                                                          00032800
**********************************************************************  00032900
**               APPC Allocate TP Request Message                    *  00033000
** This message will represent an Allocate TP request.  This         *  00033100
** message will accompany the Allocate TP request header.            *  00033200
**                                                                   *  00033300
**********************************************************************  00033400
*                                                                       00033500
XCFMS_INBOUND_FMH5 DSECT                                                00033600
                   DS  0F             Align on a word boundary    @P1A  00033700
XCFMS_ATTACH_MSG           DS  F      Message type                      00033800
*                                      '00000001'X  -> allocate TP      00033900
*                                                      request    @P1A  00034000
XCFMS_ATTACH_FLAGS         DS  0XL4   FMH-5 Attach flags          @P5C  00034100
                           DS  XL1                                @P5A  00034200
XCFMS_LOCALLU_NQN_CAPABLE  EQU X'80'  Indicates that the local lu is    00034300
*                                     NQN Capable                 @P5A  00034400
                           DS  XL3                                @P5A  00034500
XCFMS_ATTACH_TIME_STAMP    DS  CL8    The timestamp, in TOD clock       00034600
*                                     format, of the time the allocate  00034700
*                                     TP request entered the system     00034800
*                                                                 @P1A  00034900
XCFMS_LOCAL_LU             DS  CL8    Name of the Local LU to which the 00035000
*                                     attach request was directed.@P1A  00035100
XCFMS_TP_ID                DS  CL8    The Transaction Program ID which  00035200
*                                     uniquely identifies the TP        00035300
*                                     created by the allocate TP        00035400
*                                     request                     @P1A  00035500
XCFMS_CONV_ID              DS  CL8    The Conversation_ID is a token    00035600
*                                     that uniquely identifies a        00035700
*                                     conversation to MVS.  This token  00035800
*                                     is the resource identifier of     00035900
*                                     the conversation.           @P1A  00036000
XCFMS_MODE_NAME            DS  CL8    The mode name designating the     00036100
*                                     network properties for the        00036200
*                                     session which was allocated for   00036300
*                                     the conversation.           @P1A  00036400
XCFMS_PARTNER_LU           DS  CL17   The fully-qualified name of the   00036500
*                                     partner LU (i.e. the LU where     00036600
*                                     the allocate request)       @P1A  00036700
                           DS  CL1    Reserved - padding          @P1A  00036800
XCFMS_CONV_CORR_LENGTH     DS  H      The length of the Conversation    00036900
*                                     Correlator located by the         00037000
*                                     Conversation Correlator Offset.   00037100
*                                                                 @P4M  00037200
XCFMS_LUWID                DS  CL26   The Logical Unit of Work ID is    00037300
*                                     used to identify the most recent  00037400
*                                     sync point and for accounting     00037500
*                                     purposes.  If an LUW_Identifier   00037600
*                                     was not present in the allocate   00037700
*                                     request this field will be zero.  00037800
*                                                                 @P1A  00037900
XCFMS_CONV_CORR_OFFSET     DS  H      The offset into the message       00038000
*                                     area where the Conversation       00038100
*                                     Correlator is located.            00038200
*                                     This field is zero if the         00038300
*                                     Conversation Correlator is not    00038400
*                                     available on FMH-5 request. @P4A  00038500
XCFMS_SECTOKN_OFFSET       DS  H      The offset into the message       00038600
*                                     area of the security token which  00038700
*                                     identifies the security           00038800
*                                     environment created for the user  00038900
*                                     by RACF.                    @P1A  00039000
XCFMS_SECTOKN_LENGTH       DS  H      The length of the security        00039100
*                                     token located by the              00039200
*                                     Security_token_offset.      @P1A  00039300
XCFMS_PROFILE_OFFSET       DS  H      The offset into the message       00039400
*                                     area where the TP_Profile is      00039500
*                                     located.  This field is 0 if      00039600
*                                     the TP_Profile was optional and   00039700
*                                     was not found.              @P1A  00039800
XCFMS_PROFILE_LENGTH       DS  H      The length of the TP_Profile      00039900
*                                     This field is 0 if the            00040000
*                                     TP_Profile was optional and was   00040100
*                                     not found.                  @P1A  00040200
XCFMS_ENVR_OFFSET          DS  H      The offset into the message       00040300
*                                     area where the ENVR Object is     00040400
*                                     located.  This field is 0 if the  00040500
*                                     level of RACF required to support 00040600
*                                     this is not present.        @Q1A  00040700
XCFMS_ENVR_LENGTH          DS  H      The length of the ENVR Object.    00040800
*                                     This field is 0 if the level of   00040900
*                                     RACF required to support this is  00041000
*                                     not present.                @Q1A  00041100
XCFMS_PROFILE_KEY          DS  CL108  The TP_Profile key used to        00041200
*                                     search the TP_Profile data set    00041300
*                                     for a TP_Profile.           @P2C  00041400
XCFMS_CONV_TYPE            DS  H      The type of conversation          00041500
*                                     for this TP.                @P1A  00041600
XCFMS_CONV_SYNC_LEVEL      DS  H      The sync level associated         00041700
*                                     with this TP.               @P1A  00041800
XCFMS_CONTEXT_TOKEN        DS  CL16   The context token representing    00041900
*                                     the unit of work for the TP @L6A  00042000
XCFMS_END                  DS  0F     End of static message section.    00042100
*                                                                 @P1A  00042200
         SPACE                                                          00042300
**********************************************************************  00042400
*  The Attach Message conversation type constants.                   *  00042500
**********************************************************************  00042600
*                                                                       00042700
XCFMS_BASIC      DC  H'0'             Basic conversation          @P1A  00042800
XCFMS_MAPPED     DC  H'1'             Mapped conversation         @P1A  00042900
*                                                                       00043000
         SPACE                                                          00043100
**********************************************************************  00043200
*  The Attach Message conversation sync level constants.             *  00043300
**********************************************************************  00043400
*                                                                       00043500
XCFMS_NONE       DC  H'0'             Sync Level NONE             @P1A  00043600
XCFMS_CONFIRM    DC  H'1'             Sync Level CONFIRM          @P1A  00043700
XCFMS_SYNCPT     DC  H'2'             Sync Level SYNCPT           @L6A  00043800
*                                                                       00043900
         MEND                                                           00044000
                                                                        00044100
**********************************************************************  00044200
*                                                                    *  00044300
*    End of Assembler mapping                                        *  00044400
*                                                                    *  00044500
**********************************************************************  00044600
                                                                        00044700
 %PLAS_ATBXCFMS: ;                                                      00044800
                                                                        00044900
 /********************************************************************  00045000
 * This mapping is mapped over the 32-byte short message buffer         00045100
 * (XCF Control Area).  This mapping will be common to all short        00045200
 * messages.  The message type will always be the first 4 bytes,        00045300
 * with specific information following the message type field.          00045400
 *                                                                      00045500
 * NOTE: This short message mapping is a maximum of 32 bytes.   @L1A    00045600
 * If you need to add fields that will make the short mapping   @L1A    00045700
 * longer than 32 bytes, you must use either the long message   @L1A    00045800
 * format, or the short and long message formats together.      @L1A    00045900
 *                                                                      00046000
 * To base XCFMS_SHORT_MESSAGE_HEADER , set the following               00046100
 * macro variable as follows:                                           00046200
 *    %XCFMSHEADERBASE = 'optional base'    Default: Automatic          00046300
 *                                                                      00046400
 *********************************************************************/ 00046500
 %IF XCFMSHEADERBASE = '' %THEN                                         00046600
    %XCFMSHEADERBASE = 'AUTOMATIC';                                     00046700
                                                                        00046800
 DECLARE                                                                00046900
     1 XCFMS_SHORT_MESSAGE_HEADER  XCFMSHEADERBASE BDY(WORD),           00047000
      3 XCFMS_MESSAGE_TYPE    FIXED(32),                                00047100
      3 XCFMS_INFORMATION     CHAR(28);     /* another mapping will be  00047200
                                               mapped over this field.  00047300
                                               it will be specific to   00047400
                                               the type of message   */ 00047500
                                                                @SPACE; 00047600
 /********************************************************************  00047700
                 APPC STATUS MESSAGE                                    00047800
   This mapping will be for the APPC status message.  This mapping      00047900
   will be defined right on top of the XCFMS_INFORMATION field.         00048000
   Those using this message need only to refer to the fields            00048100
   directly.                                                            00048200
                                                                        00048300
   The message types are also defined here.  They are:                  00048400
       APPC initialization message  ->   '00001000'X                    00048500
       APPC termination/norestart   ->   '00001001'X                    00048600
       APPC termination/restart     ->   '00001002'X                    00048700
                                                                        00048800
 *********************************************************************/ 00048900
 DECLARE                                                                00049000
     1 XCFMS_APPC_STATUS  DEFINED(XCFMS_INFORMATION),                   00049100
      3 XCFMS_APPC_VERSION    CHAR(4),    /* The level of the APPC      00049200
                                             component active on the    00049300
                                             system                  */ 00049400
      3 XCFMS_APPC_TIME_STAMP CHAR(8),    /* The time stamp, in TOD     00049500
                                             format, of the time APPC   00049600
                                             completed initialization   00049700
                                             or completed termination*/ 00049800
      3 XCFMS_APPC_RESERVE    CHAR(16);   /* Reserved                */ 00049900
                                                                @SPACE; 00050000
 DECLARE                                                                00050100
    XCFMS_CURRENT_APPC_VERSION CHAR(4) CONSTANT('0001');                00050200
                                                                @SPACE; 00050300
 DECLARE                                                                00050400
    XCFMS_APPC_INIT         FIXED(32)  CONSTANT(4096),                  00050500
    XCFMS_APPC_NORESTART    FIXED(32)  CONSTANT(4097),                  00050600
    XCFMS_APPC_RESTART      FIXED(32)  CONSTANT(4098);                  00050700
                                                                @SPACE; 00050800
 /********************************************************************  00050900
 *               LU  STATUS Header Message                              00051000
 * This mapping will be for the LU  status message.  This mapping       00051100
 * will be defined right on top of the XCFMS_INFORMATION field.         00051200
 * Those using this message need only to refer to these fields          00051300
 * directly.                                                            00051400
 *                                                                      00051500
 * The message types are also defined here.  They are:                  00051600
 *     LU  activation    ->   '00002000'X                               00051700
 *     LU  deactivation  ->   '00002001'X                               00051800
 *                                                                      00051900
 ********************************************************************/  00052000
 DECLARE                                                                00052100
     1 XCFMS_LUM_STATUS  DEFINED(XCFMS_INFORMATION),                    00052200
      3 XCFMS_LU_FLAGS        BIT(32),    /* Flags indicating special   00052300
                                             features of the LU.     */ 00052400
        5 XCFMS_BASE_LU       BIT(1),     /*  BIT   MEANING             00052500
                                               0   The LU was specified 00052600
                                                   as the BASE LU for   00052700
                                                   the scheduler     */ 00052800
        5 *                   BIT(1),     /*  BIT   MEANING             00052900
                                               1   reserved for PC   */ 00053000
        5 XCFMS_NQN_CAPABLE   BIT(1),     /*  BIT   MEANING             00053100
                                               2   The LU is capable of 00053200
                                                   supporting network-  00053300
                                                   qualified names      00053400
                                                   function      @L5A*/ 00053500
        5 *                   BIT(29),    /*  3-31 Reserved      @L5C*/ 00053600
      3 XCFMS_LU_TIME_STAMP   CHAR(8),    /* The time stamp, in TOD     00053700
                                             format, of the time        00053800
                                             the LU was activated or    00053900
                                             deactivated             */ 00054000
      3 XCFMS_LU_NAME         CHAR(8),    /* The local LU name described00054100
                                             by the message (it is not  00054200
                                             fully qualified)        */ 00054300
      3 XCFMS_TRANS_SCHED_NAME CHAR(8);   /* The name of the Transaction00054400
                                             Scheduler assigned to the  00054500
                                             LU name in the APPCPMxx    00054600
                                             parmlib member          */ 00054700
                                                                @SPACE; 00054800
 /* Message type constants                                           */ 00054900
 DECLARE                                                                00055000
    XCFMS_LU_ACTIVE         FIXED(32)  CONSTANT(8192),                  00055100
    XCFMS_LU_NOACTIVE       FIXED(32)  CONSTANT(8193);                  00055200
                                                                @SPACE; 00055300
 /********************************************************************  00055400
 *                LU STATUS MESSAGE                              @L1A   00055500
 * This message will represent the status of an LU.  This        @L1A   00055600
 * message will accompany the LU status header.                  @L1A   00055700
 *                                                                      00055800
 * To base XCFMS_LUM_STATUS_MESSAGE, set the following macro     @L1A   00055900
 * variable as follows:                                          @L1A   00056000
 *                                                                      00056100
 *     %XCFMSLUMBASE = 'BASED(POINTER)' - to base the message    @L1A   00056200
 *                                        mapping on a pointer   @L1A   00056300
 *                                                                      00056400
 *     %XCFMSLUMBASE = ''   - the message mapping will not be    @L1A   00056500
 *                            based                              @L1A   00056600
 *                                                                      00056700
 ********************************************************************/  00056800
 %IF XCFMSLUMBASE = '' %THEN              /*                    @L1A */ 00056900
    %XCFMSLUMBASE = ' ';                  /*                    @L1A */ 00057000
                                                                        00057100
 DECLARE                                                                00057200
     1 XCFMS_LUM_STATUS_MESSAGE XCFMSLUMBASE BDY(WORD),  /* @L1A */     00057300
      3 XCFMS_LU_MSG_TYPE  FIXED(32),  /* LU message type (same as the  00057400
                                          XCFMS_MESSAGE_TYPE)           00057500
                                           '00002000'X -> LU activate   00057600
                                           '00002001'X -> LU deactivate 00057700
                                                                @L1A */ 00057800
      3 XCFMS_LU_USERVAR      CHAR(8),    /* The user variable supplied 00057900
                                             in the APPCPMxx parmlib    00058000
                                             member             @L1A */ 00058100
      3 XCFMS_ALT_LU          CHAR(8),    /* The ALT_LU value supplied  00058200
                                             in the APPCPMxx parmlib    00058300
                                             member             @D3C */ 00058400
      3 XCFMS_GENERIC_RESOURCE CHAR(8),   /* The generic resource name  00058500
                                             used for the LU.  This     00058600
                                             value is supplied using    00058700
                                             the GRNAME keyword on the  00058800
                                             LUADD statement.  (will    00058900
                                             be zeroes if GRNAME not    00059000
                                             used)              @L4A */ 00059100
                                                                        00059200
      3 XCFMS_XRF_MSG_RESERVED CHAR(16);  /* Reserved space     @L4C */ 00059300
                                                                @SPACE; 00059400
 /********************************************************************  00059500
 *               INBOUND ATTACH MESSAGE HEADER                          00059600
 * This mapping will be for the Inbound ATTACH message header.          00059700
 * This message will be accompanied by a longer message representing    00059800
 * an Inbound ATTACH request.  The TPID in this header will represnt    00059900
 * the Transaction Program that this ATTACH represents.                 00060000
 * This mapping will be defined right on top of the                     00060100
 * XCFMS_INFORMATION field. Those using this message need only to       00060200
 * refer to these fields directly.                                      00060300
 *                                                                      00060400
 * The message types are also defined here.  They are:                  00060500
 *     ATTACH TP request ->   '00000001'X                               00060600
 *                                                                      00060700
 ********************************************************************/  00060800
 DECLARE                                                                00060900
     1 XCFMS_ATTACH_HEADER DEFINED(XCFMS_INFORMATION),                  00061000
      3 XCFMS_ATTACH_TPID     CHAR(8),    /* The Transaction Program ID 00061100
                                             which uniquely identifies  00061200
                                             the TP created by the      00061300
                                             inbound FMH5 attach        00061400
                                             request                 */ 00061500
      3 XCFMS_ATTACH_EXIT_DATA PTR(31),   /* Exit Data For this Attach  00061600
                                             Request, used for Open     00061700
                                             Edition MVS Alloc_Conv Exit00061800
                                                                 @01A*/ 00061900
      3 XCFMS_APPC_NOTIFYEXIT_DATA                                      00062000
                              CHAR(8),   /* Control information used    00062100
                                            by APPC to communicate      00062200
                                            with its XCF Notification   00062300
                                            exit                 @02A*/ 00062400
      3 XCFMS_ATTACH_RESERVED CHAR(8);   /* RESERVED space       @02C*/ 00062500
                                                                @SPACE; 00062600
 /* Message type constants                                           */ 00062700
 DECLARE                                                                00062800
    XCFMS_INBOUND_ATTACH    FIXED(32)  CONSTANT(1);                     00062900
 /********************************************************************* 00063000
 *           APPC Inbound FMH5 Attach Request message                   00063100
 * This message will represent an inbound ATTACH request.  This message 00063200
 *will accompany the inbound ATTACH request header.                     00063300
 *                                                                      00063400
 * To base XCFMS_INBOUND_FMH5 , set the following                       00063500
 * macro variable as follows:                                           00063600
 *    %XCFMSFMH5BASE = 'optional base'    Default: BASED                00063700
 *                                                                      00063800
 *                                                                      00063900
 *********************************************************************/ 00064000
 %IF XCFMSFMH5BASE = '' %THEN                                           00064100
    %XCFMSFMH5BASE = 'BASED';                                           00064200
                                                                        00064300
   DECLARE                                                              00064400
     1 XCFMS_INBOUND_FMH5 XCFMSFMH5BASE BDY(WORD),                      00064500
       3 XCFMS_ATTACH_MSG FIXED(32),/* Message type                     00064600
                                       '00000001'X  -> inbound ATTACH   00064700
                                                                     */ 00064800
       3 XCFMS_ATTACH_FLAGS                                             00064900
                          BIT(32),  /* No flags currently            */ 00065000
         5 XCFMS_LOCALLU_NQN_CAPABLE BIT(1), /* INDICATES THAT THE LOCAL00065100
                                       LU is NQN capable          @P5A*/00065200
       3 XCFMS_ATTACH_TIME_STAMP                                        00065300
                          CHAR(8),  /* The timestamp, in TOD clock      00065400
                                       format, of the time the FMH-5    00065500
                                       ATTACH command entered the       00065600
                                       system                        */ 00065700
       3 XCFMS_LOCAL_LU   CHAR(8),  /* Name of the Local LU to which the00065800
                                       attach request was directed.  */ 00065900
       3 XCFMS_TP_ID      CHAR(8),  /* The Transaction Program ID which 00066000
                                       uniquely identifies the TP       00066100
                                       created by the inbound FMH5      00066200
                                       attach request                */ 00066300
       3 XCFMS_CONV_ID    CHAR(8),  /* The Conversation_ID is a token   00066400
                                       that uniquely identifies a       00066500
                                       conversation to MVS.  This token 00066600
                                       is the resource identifier of    00066700
                                       the conversation.             */ 00066800
       3 XCFMS_MODE_NAME  CHAR(8),  /* The mode name designating the    00066900
                                       network properties for the       00067000
                                       session which was allocated for  00067100
                                       the conversation. */             00067200
       3 XCFMS_PARTNER_LU CHAR(17), /* The fully-qualified name of the  00067300
                                       partner LU (i.e. the LU where    00067400
                                       the FMH5 Attach request          00067500
                                       originated). */                  00067600
       3 *                CHAR(1),  /* Unused - padding */              00067700
       3 XCFMS_CONV_CORR_LENGTH FIXED(16), /* The length of the         00067800
                                       Conversation Correlator          00067900
                                       located by the conversation      00068000
                                       Correlator Offset.        @P4A*/ 00068100
       3 XCFMS_LUWID      CHAR(26), /* The Logical Unit of Work ID is   00068200
                                       used to identify the most recent 00068300
                                       sync point and for accounting    00068400
                                       purposes.  If an LUW_Identifier  00068500
                                       was not present in the FMH5,     00068600
                                       this field will be zero. */      00068700
       3 XCFMS_CONV_CORR_OFFSET FIXED(16), /* The offset into the       00068800
                                       message area where the           00068900
                                       Conversation Correlator is       00069000
                                       located.  This field is zero if  00069100
                                       the Conversation Correlator is   00069200
                                       not available on FMH-5           00069300
                                       request.                  @P4A*/ 00069400
       3 XCFMS_SECTOKN_OFFSET FIXED(16), /* The offset into the message 00069500
                                       area of the security token which 00069600
                                       identifies the security          00069700
                                       environment created for the user 00069800
                                       by RACF. */                      00069900
       3 XCFMS_SECTOKN_LENGTH FIXED(16), /* The length of the security  00070000
                                       token located by the             00070100
                                       Security_token_offset. */        00070200
       3 XCFMS_PROFILE_OFFSET FIXED(16), /* The offset into the message 00070300
                                       area where the TP_Profile is     00070400
                                       located.  This field is 0 if     00070500
                                       the TP_Profile was optional and  00070600
                                       was not found. */                00070700
       3 XCFMS_PROFILE_LENGTH FIXED(16), /* The length of the TP_Profile00070800
                                       This field is 0 if the           00070900
                                       TP_Profile was optional and was  00071000
                                       not found. */                    00071100
       3 XCFMS_ENVR_OFFSET FIXED(16), /* The offset into the message    00071200
                                       area where the ENVR Object is    00071300
                                       located.  This field is 0 if the 00071400
                                       level of RACF required to support00071500
                                       this is not present.      @L2A*/ 00071600
       3 XCFMS_ENVR_LENGTH FIXED(16), /* The length of the ENVR Object. 00071700
                                       This field is 0 if the level of  00071800
                                       RACF required to support this is 00071900
                                       not present.              @L2A*/ 00072000
       3 XCFMS_PROFILE_KEY CHAR(108), /* The TP_Profile key used to     00072100
                                       search the TP_Profile data set   00072200
                                       for a TP_Profile.  Mapped by     00072300
                                       ATBDFTP mapping macro.    @P2C*/ 00072400
       3 XCFMS_CONV_TYPE       FIXED(16), /* The type of conversation   00072500
                                       for this TP.  See constants      00072600
                                       defined below             @D2A*/ 00072700
       3 XCFMS_CONV_SYNC_LEVEL FIXED(16), /* The sync level associated  00072800
                                       with this TP.  See constants     00072900
                                       defined below             @D2A*/ 00073000
       3 XCFMS_CONTEXT_TOKEN   CHAR(16),  /* The context token          00073100
                                       representing the unit of work    00073200
                                       for the TP                @L6A*/ 00073300
       3 XCFMS_END CHAR(0) BDY(WORD); /* End of static message section. 00073400
                                       Security token and TP profile    00073500
                                       contents follow.          @D2C*/ 00073600
 @SPACE;                                                                00073700
    /*****************************************************************/ 00073800
    /* The security token which identifies the security environment  */ 00073900
    /* created for the user by RACF.  This token may be used to      */ 00074000
    /* create a security environment in the program's execution      */ 00074100
    /* address space.                                                */ 00074200
    /*****************************************************************/ 00074300
                                                                        00074400
    DECLARE                         /* Security Token                */ 00074500
      1 XCFMS_SECTOKN  BDY(WORD)                                        00074600
          BASED(ADDR(XCFMS_INBOUND_FMH5)+XCFMS_SECTOKN_OFFSET),         00074700
        3 *           CHAR(*);      /* Security Token                */ 00074800
                                                                        00074900
 @SPACE;                                                                00075000
    /*****************************************************************/ 00075100
    /* The TP_Profile entry contents, if a profile was available.    */ 00075200
    /*****************************************************************/ 00075300
                                                                        00075400
    DECLARE                         /* TP Profile contents           */ 00075500
      1 XCFMS_PROFILE  BDY(WORD)                                        00075600
          BASED(ADDR(XCFMS_INBOUND_FMH5)+XCFMS_PROFILE_OFFSET),         00075700
        3 *           CHAR(*);      /* TP Profile contents          */  00075800
                                                                        00075900
 @SPACE;                                                                00076000
    /****************************************************************/  00076100
    /* The Conversation_Correlator contents, if a conversation      */  00076200
    /* correlator is available.                              @L3A   */  00076300
    /****************************************************************/  00076400
                                                                        00076500
    DECLARE               /* Conversation Correlator contentes @L3A*/   00076600
      1 XCFMS_CONV_CORR BDY(WORD)                                       00076700
          BASED(ADDR(XCFMS_INBOUND_FMH5)+XCFMS_CONV_CORR_OFFSET),       00076800
        3 * CHAR(*);      /* Conversation Correlator contentes @L3A*/   00076900
    /*****************************************************************/ 00077000
    /* The ENVR Object which represents the security environment     */ 00077100
    /* created for the user by RACF.  This ENVR Object may be used   */ 00077200
    /* to quickly re-create the security environment in the program's*/ 00077300
    /* execution address space.                                      */ 00077400
    /*********************************************************** @L2A*/ 00077500
                                                                        00077600
    DECLARE                                                             00077700
      1 XCFMS_ENVR  BDY(WORD)                                           00077800
          BASED(ADDR(XCFMS_INBOUND_FMH5)+XCFMS_ENVR_OFFSET),            00077900
        3 *           CHAR(*);      /* ENVR Object contents      @L2A*/ 00078000
                                                                        00078100
 @SPACE;                                                                00078200
    /*****************************************************************/ 00078300
    /* The Attach Message conversation type constants.               */ 00078400
    /*****************************************************************/ 00078500
                                                                        00078600
    DECLARE                                                             00078700
      XCFMS_BASIC      FIXED(16)                                        00078800
                       CONSTANT(0), /* Basic conversation        @D2A*/ 00078900
      XCFMS_MAPPED     FIXED(16)                                        00079000
                       CONSTANT(1); /* Mapped conversation       @D2A*/ 00079100
                                                                        00079200
 @SPACE;                                                                00079300
    /*****************************************************************/ 00079400
    /* The Attach Message conversation sync level constants.         */ 00079500
    /*****************************************************************/ 00079600
                                                                        00079700
    DECLARE                                                             00079800
      XCFMS_NONE       FIXED(16)                                        00079900
                       CONSTANT(0), /* Sync Level NONE           @D2A*/ 00080000
      XCFMS_CONFIRM    FIXED(16)                                        00080100
                       CONSTANT(1), /* Sync Level CONFIRM        @D2A*/ 00080200
      XCFMS_SYNCPT     FIXED(16)                                        00080300
                       CONSTANT(2); /* Sync Level SYNCPT         @L6A*/ 00080400
                                                                        00080500
                                                                        00080600
