*        %GOTO ATRFZQRY1;             /*                                00010000
         MACRO                                                          00020000
         ATRFZQRY                                                       00030000
**/                                                                     00040000
*%ATRFZQRY1: ;                                                          00050000
*/******* START OF SPECIFICATIONS ************************************/ 00060000
*/*                                                                  */ 00070000
*/*01* Macro Name: ATRFZQRY                                          */ 00080000
*/*                                                                  */ 00090000
*/*01* Descriptive Name: RRS ATRQUERY Mappings and Constants         */ 00100000
*/*                                                                  */ 00110000
*/*02*  Acronym: N/A                                                 */ 00120000
*/*                                                                  */ 00130000
*/*01* PROPRIETARY STATEMENT=                                        */ 00140000
*/*                                                                  */ 00150000
*/* LICENSED MATERIALS - PROPERTY OF IBM                             */ 00160000
*/* 5694-A01   COPYRIGHT IBM CORP. 1997, 2011                        */ 00170000
*/*                                                                  */ 00180000
*/* STATUS= HBB7780                                                  */ 00190000
*/*                                                                  */ 00200000
*/*01* PROPRIETARY STATEMENT=                                        */ 00210000
*/*                                                                  */ 00220000
*/*01* EXTERNAL CLASSIFICATION: GUPI                                 */ 00230000
*/*01* END OF EXTERNAL CLASSIFICATION:                               */ 00240000
*/*                                                                  */ 00250000
*/*01* COMPONENT: Resource Recovery Services (SCRRS)                 */ 00260000
*/*                                                                  */ 00270000
*/*01* DSECT Name: ATRFZRM,                                          */ 00280000
*/*                ATRFZUR,                                          */ 00290000
*/*                ATRFZURI                                      @P1C*/ 00300000
*/*                ATRFZST                                       @07A*/ 00310000
*/*                                                                  */ 00320000
*/*01* Eye-Catcher: N/A                                              */ 00330000
*/*02*  Offset: n/a                                                  */ 00340000
*/*02*  Length: n/a                                                  */ 00350000
*/*                                                                  */ 00360000
*/*01* Storage Attributes:                                           */ 00370000
*/*02*  Subpool: Determined by caller of ATRQUERY macro          @P1C*/ 00380000
*/*02*  Key: Determined by caller of ATRQUERY macro              @P1C*/ 00390000
*/*02*  Residency: Determined by caller of ATRQUERY macro        @P1C*/ 00400000
*/*                                                                  */ 00410000
*/*01* Size: ATRFZRM  ( 80 bytes)                                @07C*/ 00420000
*/*          ATRFZUR  (184 bytes)                                @PCC*/ 00430000
*/*          ATRFZURI (120 bytes)                                @PCC*/ 00440000
*/*          ATRFZST  ( 48 bytes)                                @07A*/ 00450000
*/*                                                                  */ 00460000
*/*01* Created by: Callers of ATRQUERY macro                     @P1C*/ 00470000
*/*                                                                  */ 00480000
*/*01* Pointed to by: AREAADDR parameter on ATRQUERY macro       @P1C*/ 00490000
*/*                                                                  */ 00500000
*/*01* Serialization: N/A                                            */ 00510000
*/*                                                                  */ 00520000
*/*01* Function: This macro contains constants and declares for      */ 00530000
*/*              the ATRQUERY executable macro                       */ 00540000
*/*                                                                  */ 00550000
*/*01* Method of Access:                                             */ 00560000
*/*                                                                  */ 00570000
*/*02*  PL/X: %INCLUDE SYSLIB(ATRFZQRY)                              */ 00580000
*/*           %INCLUDE SYSLIB(ATRBKCON)                              */ 00590000
*/*           %INCLUDE SYSLIB(ATRRPLX)                               */ 00600000
*/*                                                                  */ 00610000
*/*02*  ASM : ATRFZQRY                                               */ 00620000
*/*           ATRRASM                                                */ 00630000
*/*                                                                  */ 00640000
*/*01* Distribution Library: AMACLIB                                 */ 00650000
*/*                                                                  */ 00660000
*/*01* Change Activity:                                              */ 00670000
*/*                                                                  */ 00680000
*/*   PN  REASON   RLSE    DATE   ORG   COMMENTS                     */ 00690000
*/*   $L0=RRSCS    HBB6603 950907 PDEV: Resource Recovery Services   */ 00700000
*/*   $L1=PQC0667  HBB6603 960201 PDEV: Add ASM code, fix prolog     */ 00710000
*/*   $P1=PQC1218  HBB6603 960819 PDLC: Fix SHOWHDR data             */ 00720000
*/*   $P2=PQC2168  HBB6603 960826 PDEV: Return ASID, not ASCB addr   */ 00730000
*/*   $P3=PQC2195  HBB6603 961028 B7HGEJ:  Handle asynchronous       */ 00740000
*/*                                        ABENDs during syncpoint.  */ 00750000
*/*                                        (TRSQ - OW23556,OW25222,  */ 00760000
*/*                                                OW27323)          */ 00770000
*/*   $L2=RSXID    HBB6605 970601 PDEM: RRS/BOSS XID Support         */ 00780000
*/*   $01=OW27925  HBB6603 970627 B7HGEV: Fix ASM fields to match    */ 00790000
*/*                                       the PLX version            */ 00800000
*/*   $02=OW27726  HBB6603 970627 B7HGRP: Highlight heuristic mixed  */ 00810000
*/*                                       condition in panels.       */ 00820000
*/*   $P4=PUX0330  HBB6605 970815 PDMF: Identify deferred URs        */ 00830000
*/*   $L3=RRSSV    HBB6606 971208 B7HGRP: Serviceability enhancements*/ 00840000
*/*   $L4=RRSSV    HBB6606 971217 B7HGEJ: Serviceability enhancements*/ 00850000
*/*   $L5=RRSSV    HBB6606 971217 B7HGRP: Serviceability enhancements*/ 00860000
*/*   $L6=RRSSV    HBB6606 980116 B7HGRP: Serviceability enhancements*/ 00870000
*/*   $03=OW33138  HBB6606 980515 B7HGRP: Fix ATRQUERY problems      */ 00880000
*/*   $L7=RRSSM    HBB6608 980701 B7HGEJ: RRS Sysplex System         */ 00890000
*/*                                       Management                 */ 00900000
*/*   $L8=RRSSM    HBB6608 981001 PDEM:   RRS Sysplex System         */ 00910000
*/*                                       Management                 */ 00920000
*/*   $L9=RRSSM    HBB6608 981101 PDEV:   RRS Sysplex System         */ 00930000
*/*                                       Management                 */ 00940000
*/*   $LA=RRSSM    HBB6608 981120 PDEV:   RRS Sysplex System         */ 00950000
*/*                                       Management                 */ 00960000
*/*   $P5=PWK0529  HBB6608 981215 PDEM:   Invalid arealen and        */ 00970000
*/*                                       areaaddr                   */ 00980000
*/*   $LB=RRSCT    JBB6609 990122 B7HGEJ: RRS Cascaded Transactions  */ 00990000
*/*   $LC=RRSCT    JBB6609 990401 PDEM:   RRS Cascaded Transactions  */ 01000000
*/*   $P6=PWY0539  JBB6609 990615 PDEM:   Add cascaded UR exclusion  */ 01010000
*/*                                       mask                       */ 01020000
*/*   $P7=PWY0877  JBB6609 990920 PDEM:   Add fzur info version for  */ 01030000
*/*                                       down level systems         */ 01040000
*/*   $04=OW42386  HBB6606 991215 PDEV: OW40061/OW42032 PTF errors   */ 01050000
*/*                                      (reship)                    */ 01060000
*/*   $05=OW44170  HBB7703 000616 PDMF: RRS Local Transaction SPE    */ 01070000
*/*   $LD=RRSSC    HBB7705 000415 B7HGBV: RRS Sysplex Cascaded       */ 01080000
*/*                                                 Transactions     */ 01090000
*/*   $P8=RRSSC    HBB7705 000908 B7HGBV: Surid Filtering            */ 01100000
*/*   $P9=PX00472  HBB7705 001106 B7HGBL: Get new exclusion flags    */ 01110000
*/*                                       working                    */ 01120000
*/*   $PA=PX00901  HBB7705 010315 B7HGBR: Missing UR Entries for     */ 01130000
*/*                                         Sysplex Subs             */ 01140000
*/*   $PB=PX01165  HBB7705 010501 PDEV: Duplicate ur family entries  */ 01150000
*/*   $06=OA08641  HBB7707 040826 B7HGBR: ATRQUERY SysInfo Missing   */ 01160000
*/*      =ME02740 HBB7720 050122 B7HGLH: (Replaced by RRSPDT)        */ 01170000
*/*      =ME02740 HBB7720 050122 B7HGLH: (Replaced by ME02362)       */ 01180000
*/*   $PD=ME03065 HBB7720 050122 B7HGLH:Part of ME02740, add comment */ 01190000
*/*                                     delimitor                    */ 01200000
*/*   $LE=RRSPDT   HBB7730 040506 B7HGLH: PID Retrieval Support      */ 01210000
*/*   $PC=ME02362  HBB7730 041117 B7HGLH: Prolog cleanup             */ 01220000
*/*   $LF=RRSRML  HBB7730 050721 B7HGBL: RM Metadata Support         */ 01230000
*/* $PE=ME04202 HBB7730 050816 B7HGBL: Warning when no Meta Data log */ 01240000
*/* $LG=RRSPPE  HBB7730 060319 B7HGBL: Pre-Prepare Exit Support      */ 01250000
*/*   $07=OA29174  HBB7730 090917 B7HGBR: Display RRS Enhancements   */ 01260000
*/* $PF=ME19132 HBB7780 100615 B7HGBL: CopyRight Changes             */ 01270000
*/*   $08=OA51675 HBB7790 170630 R4GABR: UR Exception for outstanding*/ 01273000
*/*                                      ATRABAK/ATRACMT and ATRAFGT */ 01276000
*/*                                                                  */ 01280000
*/** END OF SPECIFICATIONS *******************************************/ 01290000
*/* A - Added heuristic mixed condition flag to URINFO return    @02A*/ 01300000
*/*     mappings.                                                @02A*/ 01310000
*/* A - Added Deferred UR condition flag to URINFO return        @P4A*/ 01320000
*                                                                       01330000
*        %GOTO ATRFZQRY2;              /*                               01340000
*                                                                       01350000
* values for parameters                                                 01360000
*                                                                       01370000
ATR_NOFILTER EQU -1       No filtering for this parm                    01380000
ATR_NOFILTER_MASK       EQU X'00000000' No filtering               @L3A 01390000
ATR_IN_FLIGHT_MASK      EQU X'80000000' Include in_flight URs      @L3A 01400000
ATR_IN_STATE_CHECK_MASK EQU X'40000000' Include in_state_check URs @L3A 01410000
ATR_IN_PREPARE_MASK     EQU X'20000000' Include in_prepare URs     @L3A 01420000
ATR_IN_DOUBT_MASK       EQU X'10000000' Include in_doubt URs       @L3A 01430000
ATR_IN_COMMIT_MASK      EQU X'08000000' Include in_commit URs      @L3A 01440000
ATR_IN_BACKOUT_MASK     EQU X'04000000' Include in_backout URs     @L3A 01450000
ATR_IN_END_MASK         EQU X'02000000' Include in_end URs         @L3A 01460000
ATR_IN_COMPLETION_MASK  EQU X'01000000' Include in_completion URs  @L3A 01470000
ATR_IN_ONLY_AGENT_MASK  EQU X'00800000' Include in_only_agent URs  @L3A 01480000
ATR_IN_FORGET_MASK      EQU X'00400000' Include in_forget URs      @L3A 01490000
*                                                                       01500000
ATR_NOEXCLUSION_MASK    EQU X'00000000' No exclusion conditions    @L3A 01510000
ATR_RESTART_LOG_MASK    EQU X'80000000' Exclude URs from restart lg@L3A 01520000
ATR_RESTART_REQUIRED_MASK EQU X'40000000' Exclude URs that have URIs    01530000
*                                         whose RMs must restart   @L3A 01540000
ATR_NONDEFERRED_UR_MASK EQU X'20000000' Exclude URs that are not        01550000
*                                       deferred                   @L3A 01560000
ATR_CASCADED_UR_MASK    EQU X'10000000' Exclude URs that are cascaded   01570000
*                                       URs in a cascaded UR family@P6A 01580000
ATR_GLOBAL_UR_MASK      EQU X'04000000' Units of recovery in any global 01590000
*                                       transaction mode will be        01600000
*                                       excluded from the returned      01610000
*                                       information.  (Both Global and  01620000
*                                       Hybrid-Global units of recovery 01630000
*                                       are excluded.)             @05A 01640000
ATR_LOCAL_UR_MASK       EQU X'08000000' Units of recovery in local      01650000
*                                       transaction mode will be        01660000
*                                       excluded from the returned      01670000
*                                       information.               @05A 01680000
ATR_RRS_MANAGED_UR_MASK EQU X'02000000' UR's whose current work manager 01690000
*                                       is RRS will be excluded from    01700000
*                                       the returned information.  RRS  01710000
*                                       is a work manager for restart   01720000
*                                       URs and for URs associated with 01730000
*                                       contexts delegated to RRS. @P9A 01740000
ATR_NONRRS_MANAGED_UR_MASK EQU X'01000000' UR's whose current work      01750000
*                                       manager is not RRS will be      01760000
*                                       excluded from the returned      01770000
*                                       information.               @P9A 01780000
*                                                                       01790000
ATR_SORT_WM_NAME        EQU X'00000001' sort by work manager name  @L5A 01800000
ATR_SORT_URID           EQU X'00000002' sort by UR identifier      @L5A 01810000
ATR_SORT_CREATE_TIME    EQU X'00000003' sort by create time of UR  @L5A 01820000
ATR_SORT_UR_STATE       EQU X'00000004' sort by UR state           @L5A 01830000
ATR_SORT_LUWID          EQU X'00000005' sort by LUWID              @L5A 01840000
ATR_SORT_TID            EQU X'00000006' sort by Transaction ID     @L5A 01850000
ATR_SORT_GTID           EQU X'00000007' sort by Global Trans. ID   @L5A 01860000
ATR_SORT_XID            EQU X'00000008' sort by X/Open Identifier  @L5A 01870000
ATR_SORT_GNAME          EQU X'00000009' sort by logging group name @L7C 01880000
ATR_SORT_SYSNAME        EQU X'0000000A' sort by system name        @L7C 01890000
ATR_SORT_SURID          EQU X'0000000B' sort by SURID              @P8A 01900000
*                                                                       01910000
ATR_SORT_MAX_ENTRIES    EQU X'0000000B' max. sort table entries    @P8c 01920000
*                                                                       01930000
ATR_SORTOPT_ASCENDING   EQU X'00000000' sort in ascending order    @L5A 01940000
ATR_SORTOPT_DESCENDING  EQU X'80000000' sort in descending order   @L5A 01950000
*                                                                       01960000
ATR_UR_TST              EQU X'00000001' UR  timestamp table        @L6A 01970000
ATR_URI_TST             EQU X'00000002' URI timestamp table        @L6A 01980000
*                                                                       01990000
ATR_NOXINFO_MASK        EQU X'00000000' no extended info requested @L6A 02000000
ATR_XINFO_TIMESTAMP_MASK EQU X'80000000' timestamp info requested  @L6A 02010000
ATR_XINFO_CASCADED_MASK  EQU X'40000000' Cascaded UR info reqed    @LCA 02020000
ATR_XINFO_PID_MASK       EQU X'20000000' Persistent int info            02030000
*                                        requested                 @LEA 02040000
ATR_XINFO_STATUS_MASK    EQU X'10000000' State duration time and UR     02050000
*                                        count info requested      @07A 02060000
*                                                                       02070000
* Return codes                                                          02080000
*                                                                       02090000
ATRQUERY_SUCCESS EQU 0 Function completed successfully                  02100000
ATRQUERY_WARNING EQU 4 Function completed with warnings                 02110000
ATRQUERY_FAILURE EQU 8 Function failed                                  02120000
*                                                                       02130000
* Reason codes                                                          02140000
*                                                                       02150000
ATRQUERY_ASID_INVALID      EQU  1 The input ASID does not exist         02160000
ATRQUERY_RRS_NOT_ACTIVE    EQU  2 RRS is not active                     02170000
ATRQUERY_AREA_FULL         EQU  3 The output area is full               02180000
ATRQUERY_NOT_SAF_AUTH      EQU  4 The caller does not have proper SAF   02190000
*                             authorization                             02200000
ATRQUERY_URSTMASK_RSVD     EQU  5 Reserved fields in UR state mask were 02210000
*                                 nonzero                         @L6A  02220000
ATRQUERY_XINFOMASK_RSVD    EQU  6 Reserved fields in extended info mask 02230000
*                                 were nonzero                    @L6A  02240000
ATRQUERY_EXCLUSIONMASK_RSVD EQU 7 Reserved fields in UR exclusion mask  02250000
*                                 were nonzero                    @L6A  02260000
ATRQUERY_SORTKEY_INVALID   EQU  8 Sort table contained invalid key@L6A  02270000
ATRQUERY_SORTOPT_INVALID   EQU  9 Sort table contained invalid option   02280000
*                                                                 @L6A  02290000
ATRQUERY_SORTNUM_INVALID   EQU 10 Sort element number was invalid @L6A  02300000
ATRQUERY_TID_RANGE_INVALID EQU 11 TIDLOW parameter was higher than      02310000
*                                 TIDHIGH parameter               @L6A  02320000
ATRQUERY_TOD_RANGE_INVALID EQU 12 TODBEG parameter was higher than      02330000
*                                 TODEND parameter                @L6A  02340000
ATRQUERY_LUWIDSTR_INVALID  EQU 13 LUWIDSTR parameter was invalid  @L6A  02350000
ATRQUERY_CURDUR_INVALID    EQU 14 CURDUR parameter was invalid    @L6A  02360000
ATRQUERY_SORTTABPTR_BAD    EQU 15 Sort table ptr was invalid      @03A  02370000
ATRQUERY_AREAALET_SECONDARY EQU 16 Cannot pass secondary alet      @L7A 02380000
ATRQUERY_REQUEST_UNKNOWN    EQU 17 Downlevel System did not        @L7A 02390000
*                                  understand request.                  02400000
ATRQUERY_GNAME_INVALID      EQU 18 The value specified for the          02410000
*                                  gname parameter is not valid    @L8A 02420000
ATRQUERY_SYSNAME_INVALID    EQU 19 The value specified for the          02430000
*                                  sysname parameter is not valid  @L8A 02440000
ATRQUERY_RESOURCE_ERROR     EQU 20 No buffer is available to            02450000
*                                  satisfy a remote request        @L8A 02460000
ATRQUERY_TOO_MANY_ITEMS     EQU 21 There are too many data items to     02470000
*                                  fit in the buffer to be sorted  @L8A 02480000
ATRQUERY_INSTANCE_FAILURE   EQU 22 Error(s) occurred in the remote      02490000
*                                  request(s)                      @L8A 02500000
ATRQUERY_REMOTE_WARNING     EQU 23 Error(s) occurred on some systems    02510000
*                                  involved in the query request   @L9A 02520000
ATRQUERY_REMOTE_ERROR       EQU 24 Error(s) occurred on all systems     02530000
*                                  involved in the query request   @L9A 02540000
ATRQUERY_RESP_NOT_RECEIVED  EQU 25 Response not received from the       02550000
*                                  remote system                   @L9A 02560000
ATRQUERY_REMOTE_NOT_ACTIVE  EQU 26 The remote system is not active @L9A 02570000
ATRQUERY_AREALEN_INVALID    EQU 27 The arealen specified is not valid   02580000
*                                                                  @P5A 02590000
ATRQUERY_AREAADDR_INVALID   EQU 28 The areaaddr specified is not valid  02600000
*                                                                  @P5A 02610000
ATRQUERY_RMMETADATALOGUNAVAILABLE EQU 29 The RM Meta Data log is not    02620000
*                                  available                       @PEA 02630000
ATRQUERY_UNEXPECTED_ERROR   EQU 4095 Unexpected system error       @L8A 02640000
*                                                                       02650000
* Version numbers                                                       02660000
*                                                                       02670000
ATRQUERY_RM_VERSION     EQU 3 RM version number                    @07C 02680000
ATRQUERY_RM_VERSION_0   EQU 0 UR version number                    @LFA 02690000
ATRQUERY_RM_VERSION_1   EQU 1 UR version number prior to Meta Data @LFA 02700000
ATRQUERY_RM_VERSION_2   EQU 2 UR version number for Meta Data      @LFA 02710000
ATRQUERY_RM_VERSION_3   EQU 3 UR version number for RM Job Name    @07A 02720000
ATRQUERY_WM_VERSION     EQU 1 WM version number                   @L8C  02730000
ATRQUERY_UR_VERSION     EQU 7 UR version number                    @07C 02740000
ATRQUERY_LG_VERSION     EQU 0 LG version number                   @L8A  02750000
ATRQUERY_SI_VERSION     EQU 0 SI version number                   @L8A  02760000
ATRQUERY_SI_VERSION_1   EQU 1 SI version number (correct output)  @06A  02770000
ATRQUERY_CFM_VERSION    EQU 0 CFM version number                  @LCA  02780000
ATRQUERY_UR_VERSION_3   EQU 3 UR version number for R8            @P7A  02790000
ATRQUERY_UR_VERSION_4   EQU 4 UR version number for R9            @P7A  02800000
ATRQUERY_UR_VERSION_5   EQU 5 UR version number for R12-R17, prior to   02810000
*                                               pid retrieval     @LDA  02820000
ATRQUERY_UR_VERSION_6   EQU 6 UR version number for R18, pid retrieval  02830000
*                                                                 @LEA  02840000
ATRQUERY_UR_VERSION_7   EQU 7 UR version number More Comment flags @07A 02850000
ATRQUERY_URI_VERSION_1  EQU 1 URI version  before pid retrieval    @LEA 02860000
ATRQUERY_URI_VERSION_2  EQU 2 URI version  pid retrieval           @LGA 02870000
ATRQUERY_URI_VERSION_3  EQU 3 URI version  Pre-Prepare             @LGA 02880000
ATRQUERY_URI_VERSION    EQU 3 URI version number                   @LGC 02890000
*                                                                       02900000
ATRQUERY_TST_VERSION_0  EQU 0 TST version  Before Pre-Prepare      @LGA 02910000
ATRQUERY_TST_VERSION_1  EQU 1 TST version  Pre-Prepare             @LGA 02920000
ATRQUERY_TST_VERSION    EQU 1 TST version number                   @LGC 02930000
*                                                                       02940000
ATRQUERY_URSTATUS_VERSION_1  EQU 48 UR Status version number       @07A 02950000
*                                                                       02960000
* RMINFO return mappings                                                02970000
*                                                                       02980000
ATRFZRM DSECT                                                           02990000
ATRFZRMNEXT     DS A(0) Address/offset of the next ATRFZRM              03000000
*                       block or zero                             @L8C  03010000
ATRFZRMFLAGS    DS BL2  Indicators                                @L2C  03020000
ATRFZRMVERSION  DS H    Version number                            @L2A  03030000
ATRFZRMRMNAME   DS CL32 Resource manager name                           03040000
ATRFZRMRMTOKEN  DS CL16 Resource manager token                          03050000
ATRFZRMRMSTATE  DS F    Resource managers state                         03060000
ATRFZRMLGPTR    DS A(0) Address/offset of the system/logging group      03070000
*                       information                               @L8C  03080000
ATRFZRMMETADATALEN   DS A(0) Length of the RM Meta Data                 03090000
*                       information                                @LFA 03100000
ATRFZRMMETADATALGPTR DS A(0) Address/offset of the RM Meta Data         03110000
*                       information                                @LFA 03120000
ATRFZRMRMJOBNAME DS CL8 Resource manager Job name                  @07A 03130000
*                                                                       03140000
* WMINFO return mappings                                                03150000
*                                                                       03160000
ATRFZWM DSECT                                                     @L5A  03170000
ATRFZWMNEXT     DS A(0) Address/offset of the next ATRFZWM              03180000
*                       block or zero                             @L8C  03190000
ATRFZWMFLAGS    DS BL2  Indicators                                @L5A  03200000
ATRFZWMVERSION  DS H    Version number                            @L5A  03210000
ATRFZWMWMNAME   DS CL32 Resource manager name                     @L5A  03220000
ATRFZWMLGPTR    DS A(0) Address/offset of the system/logging group      03230000
*                       information                               @L8C  03240000
*                                                                       03250000
* URINFO return mappings                                                03260000
*                                                                       03270000
ATRFZUR DSECT                                                           03280000
ATRFZURNEXT     DS A(0) Address/offset of the next ATRFZUR              03290000
*                       block or zero                             @L8C  03300000
ATRFZURFLAGS    DS BL2  Indicators                                @L2C  03310000
ATRFZURRESTARTLOG EQU X'8000'  UR is only on the restart log            03320000
ATRFZURDAMAGED    EQU X'4000'  UR is damaged                      @P3A  03330000
ATRFZURHEURMIXED  EQU X'2000'  Heuristic mixed condition          @02A  03340000
ATRFZURDEFERRED   EQU X'1000'  UR is Deferred                     @P4A  03350000
ATRFZURMIXEDSTATES EQU X'0800' UR contains interests that are in        03360000
*                              mixed states                       @L6A  03370000
ATRFZURCFAMILY    EQU X'0400'  UR is part of a cascaded UR family @LCA  03380000
ATRFZURCASCADED   EQU X'0200'  UR is a child UR in a cascaded UR        03390000
*                              family                             @LCA  03400000
ATRFZURFAMILYINCLUDE EQU X'0100' UR was included only because it is     03410000
*                              part of a cascaded UR family       @LCA  03420000
ATRFZURMODELOCAL     EQU X'0080' UR transaction mode is local     @05A  03430000
ATRFZURMODEGLOBAL    EQU X'0040' UR transaction mode is Global    @05A  03440000
*                                UR transaction mode is hybrid when     03450000
*                                MODELOCAL and MODEGLOBAL are both not  03460000
*                                set.                             @05A  03470000
ATRFZURSYSPLEXCASCADED EQU X'0020' UR is part of sysplex cascade  @LDA  03480000
ATRFZURMAINLOG EQU X'0010'    UR is from Main log                 @PAA  03490000
ATRFZURDELAYEDLOG EQU X'0008' UR is from Delayed log              @PAA  03500000
ATRFZURDONOTDISPLAY EQU X'0004' UR is a duplicate, Do not use it  @PBA  03510000
ATRFZURWAITAPPLCOMPLETE  EQU X'0002'  WAIT for Appl Complete Set  @07A  03520000
ATRFZURFLAGS1ACTIVE  EQU X'0001'  Flags1 Field In Use             @07A  03530000
*                                                                       03540000
ATRFZURVERSION  DS H    UR version number                         @L2A  03550000
ATRFZURURID     DS CL16 UR identifier                                   03560000
ATRFZURURSTATE  DS F    UR state                                        03570000
ATRFZURURTYPE   DS F    UR type                                         03580000
ATRFZURCRTIME   DS CL8  UR create time, in TOD format                   03590000
ATRFZURASID     DS H    ASID that created the UR                        03600000
ATRFZURFLAGS1   DS BL2  Indicators                                @07C  03610000
ATRFZURWAITSUBURS EQU X'8000'  Coord UR is WAITING for SUB URs    @07A  03620000
ATRFZURWAITEXITS  EQU X'4000'  UR WAITing for SyncPoint Exits     @07A  03630000
ATRFZURWAITOUTSTANDING EQU X'2000' UR WAITing for (S)DSRM Agent   @08A  03635000
*                                                                       03640000
ATRFZURPROTOCOL DS F    UR protocol                                     03650000
ATRFZURLUWIDLEN DS F    LUWID length                                    03660000
ATRFZURLUWIDPTR DS A(0) Address/offset of LUWID                   @L8C  03670000
ATRFZUREIDLEN   DS F    EID length                                      03680000
ATRFZUREIDPTR   DS A(0) Address/offset of EID                     @L8C  03690000
ATRFZURURICOUNT DS F    Number of ATRFZURI blocks                       03700000
ATRFZURURIADDR  DS A(0) Address/offset of the first ATRFZURI block@L8C  03710000
ATRFZURURFUNCMAP DS BL8  UR function map                          @L2A  03720000
ATRFZURXIDLEN   DS F    XID length                                @L2A  03730000
ATRFZURXIDPTR   DS A(0) Address/offset of XID                     @L8C  03740000
ATRFZURTSTPTR   DS A(0) Address/offset of ATRFZTST array          @L8C  03750000
ATRFZURWMNAME   DS CL32 Work Manager name                         @L3A  03760000
ATRFZURLGPTR    DS A(0) Addr/offset of system/logging group info  @L8C  03770000
ATRFZURPARENTURID DS CL16 UR ID of the parent of this UR          @LBA  03780000
ATRFZURCFMPTR   DS A(0) Addr/offset of ATRFZCFM array, zero if          03790000
*                       ATRFZURCFAMILY is 0                       @LCA  03800000
ATRFZURSURID      DS CL32 Sysplex UR ID                           @LDA  03810000
ATRFZURELEMENT_LEN DS F Total length of the returned info including     03820000
*                       the UR and URi info as well as the pdata for    03830000
*                       each URi                                  @LEA  03840000
*                                                                       03850000
ATRFZURI DSECT                                                          03860000
ATRFZURINEXT             DS A(0) Address/offset of the next ATRFZURI    03870000
*                                block or zero                    @L8C  03880000
ATRFZURIFLAGS            DS BL2  Indicators                       @L2C  03890000
ATRFZURIRSTRTREQ         EQU X'80' URI represents an interest of an RM  03900000
*                                  that is required to restart with     03910000
*                                  RRS                            @L3A  03920000
ATRFZURIDEFERRED         EQU X'40' URI represents an interest that has  03930000
*                                  been deferred                  @L3A  03940000
ATRFZURIVERSION          DS H    URI version number               @L2A  03950000
ATRFZURITOKEN            DS CL16 URI token                              03960000
ATRFZURIRMNAME           DS CL32 Resource manager name                  03970000
ATRFZURIINTTYPE          DS F    URI Interest type                      03980000
ATRFZURIPROTOCOL         DS F    URI Protocol                           03990000
ATRFZURIROLE             DS F    URI Role                               04000000
ATRFZURISTATECHECK_RC    DS F    State Check exit return code           04010000
ATRFZURIPREPARE_RC       DS F    InPrepare exit return code             04020000
ATRFZURICOMMIT_RC        DS F    InCommit exit return code              04030000
ATRFZURIBACKOUT_RC       DS F    InBackout exit return code             04040000
ATRFZURIEND_RC           DS F    InEnd exit return code                 04050000
ATRFZURICOMPLETION_RC    DS F    Completion exit return code            04060000
ATRFZURIONLYAGENT_RC     DS F    Only Agent exit return code            04070000
ATRFZURIDISTSYNCPOINT_RC DS F    Distributed Syncpoint exit return code 04080000
ATRFZURIEXITFAILED_RC    DS F    Exit Failed exit return code           04090000
ATRFZURITSTPTR           DS A(0) Address/offset of ATRFZTST array @L8C  04100000
ATRFZURISTATE            DS F    URI State                        @L3A  04110000
ATRFZURIPIDLEN           DS F    PID length                       @LEA  04120000
ATRFZURIPIDPTR           DS A(0) Address/offset of PID data       @LEA  04130000
ATRFZURIPREPREPARE_RC    DS F    Pre-Prepare exit return code      @LGA 04140000
*                                                                       04150000
ATRFZTST DSECT                                                    @L3A  04160000
                         DS 0D                                    @L3A  04170000
ATRFZTSTFLAGS            DS BL2  Indicators                       @L3A  04180000
ATRFZTSTVERSION          DS H    TST Version Number               @L3A  04190000
ATRFZTSTTYPE             DS F    Type of Timestamp Table          @L3A  04200000
*                                1=UR  Timestamp Table            @L3A  04210000
*                                2=URI Timestamp Table            @L3A  04220000
ATRFZTSTSTRSCHK          DS CL8  Start GMT for State Check        @L3A  04230000
ATRFZTSTENDSCHK          DS CL8  End   GMT for State Check        @L3A  04240000
ATRFZTSTSTRPRP           DS CL8  Start GMT for Prepare            @L3A  04250000
ATRFZTSTENDPRP           DS CL8  End   GMT for Prepare            @L3A  04260000
ATRFZTSTSTRDBT           DS CL8  Start GMT for Doubt              @L3A  04270000
ATRFZTSTENDDBT           DS CL8  End   GMT for Doubt              @L3A  04280000
ATRFZTSTSTRCMT           DS CL8  Start GMT for Commit             @L3A  04290000
ATRFZTSTENDCMT           DS CL8  End   GMT for Commit             @L3A  04300000
ATRFZTSTSTRBAK           DS CL8  Start GMT for Backout            @L3A  04310000
ATRFZTSTENDBAK           DS CL8  End   GMT for Backout            @L3A  04320000
ATRFZTSTSTREND           DS CL8  Start GMT for End                @L3A  04330000
ATRFZTSTENDEND           DS CL8  End   GMT for End                @L3A  04340000
ATRFZTSTSTROLA           DS CL8  Start GMT for Only Agent         @L3A  04350000
ATRFZTSTENDOLA           DS CL8  End   GMT for Only Agent         @L3A  04360000
ATRFZTSTSTRCMP           DS CL8  Start GMT for Completion         @L6M  04370000
ATRFZTSTENDCMP           DS CL8  End   GMT for Completion         @L6M  04380000
ATRFZTSTSTRPPP           DS CL8  Start GMT for Pre-Prepare         @LGC 04390000
ATRFZTSTENDPPP           DS CL8  End   GMT for Pre-Prepare         @LGC 04400000
*                                                                       04410000
* Element mapping for sort table                                        04420000
ATRFZSRT DSECT                                                    @L5A  04430000
                         DS 0D                                    @L5A  04440000
ATRFZSRTKEY              DS F    Sort key                         @L5A  04450000
ATRFZSRTOPTIONS          DS F    Sort options                     @L5A  04460000
*                                                                       04470000
ATRFZLG  DSECT                                                    @L7A  04480000
                         DS 0D                                    @L7A  04490000
ATRFZLGFLAGS             DS BL2  Indicators                       @L7A  04500000
ATRFZLGVERSION           DS H    LG Version Number                @L7A  04510000
ATRFZLGTYPE              DS F    Type of UR Group and System Table@L7A  04520000
ATRFZLGSYSNAME           DS CL8  Sysname                          @L7A  04530000
ATRFZLGGNAME             DS CL8  Logging Group Name               @L7A  04540000
*                                                                       04550000
ATRFZSI  DSECT                                                    @L7A  04560000
                         DS 0D                                    @L7A  04570000
ATRFZSINEXT              DS A(0) Address/offset of the next ATRFZSI     04580000
*                                block or zero                    @L8C  04590000
ATRFZSIFLAGS             DS BL2  Undefined                        @06C  04600000
ATRFZSIVERSION           DS H    LG Version Number                @L7A  04610000
ATRFZSISYSNAME           DS CL8  Sysname                          @L7A  04620000
ATRFZSIMEMNAME           DS CL16 XCF Member Name                  @L7A  04630000
ATRFZSIMEMSTATE          DS CL1  XCF Member State                 @L7A  04640000
ATRFZSIMEMSTATE_ACTIVE   EQU  1  XCF Member State = ACTIVE        @06A  04650000
ATRFZSIRSVD              DS CL7  Reserved                         @L7A  04660000
ATRFZSIGNAME             DS CL8  Logging Group Name               @L7A  04670000
*                                                                       04680000
* RCTABLE entry mapping                                                 04690000
*                                                                       04700000
ATRFZRCA DSECT                                                    @L9A  04710000
                         DS 0D                                    @L9A  04720000
ATRFZRCAGNAME            DS CL8  Logging Group name               @L9A  04730000
ATRFZRCASYSNAME          DS CL8  System name                      @L9A  04740000
ATRFZRCAATRRC            DS F    ATRQUERY/ATRSRV Return Code      @LAC  04750000
ATRFZRCAATRRSN           DS F    ATRQUERY/ATRSRV Reason Code      @LAC  04760000
ATRFZRCASERVICEID        DS F    Failing Service Identifier     ]@L9A   04770000
ATRFZRCASERVICERC        DS F    Failing Service Return Code    ]@L9A   04780000
ATRFZRCASERVICERSN       DS F    Failing Service Reason Code    ]@L9A   04790000
*                                                                       04800000
* ATRFZCFM entry mapping                                                04810000
*                                                                       04820000
ATRFZCFM DSECT                                                    @LCA  04830000
                         DS 0D                                    @LCA  04840000
ATRFZCFMFLAGS            DS BL2  Indicators                       @LCA  04850000
ATRFZCFMPARENTNOTMAPPED  EQU X'8000'  The parent of this UR is not      04860000
*                                included in the output area      @LCA  04870000
ATRFZCFMSIBNOTMAPPED     EQU X'4000'  The sibling of this UR is not     04880000
*                                included in the output area      @LCA  04890000
ATRFZCFMCHILDNOTMAPPED   EQU X'2000'  The child of this UR is not       04900000
*                                included in the output area      @LCA  04910000
ATRFZCFMVERSION          DS H    CFM version number               @LCA  04920000
ATRFZCFMPRNTPTR          DS F    Address of the ATRFZUR entry           04930000
*                                of the parent of this UR. Zero if      04940000
*                                this UR is a top level UR or if        04950000
*                                ATRFZCFMPARENTNOTMAPPED is 1     @LCA  04960000
ATRFZCFMSIBPTR           DS F    Address of the ATRFZUR entry           04970000
*                                of the next sibling of this UR.        04980000
*                                Zero if this UR has no additional      04990000
*                                siblings or if this UR is a top        05000000
*                                level UR or of ATRFZCFMSIBNOTMAPPED    05010000
*                                is 1                             @LCA  05020000
ATRFZCFMCHILDPTR         DS F    Address of the ATRFZUR entry           05030000
*                                of the child of this UR. Zero if       05040000
*                                this UR has no children or if          05050000
*                                ATRFZCFMCHILDNOTMAPPED is 1      @LCA  05060000
*                                                                       05070000
* ATRFZST UR Status return mapping                                      05080000
*                                                                       05090000
ATRFZST DSECT                                                     @07A  05100000
                         DS 0D                                    @07A  05110000
ATRFZSTNEXT              DS A(0) Address/offset of the next ATRFZST     05120000
*                                block or zero                    @07A  05130000
ATRFZSTFLAGS             DS BL2  Unused                           @07A  05140000
ATRFZSTVERSION           DS H    ST Version Number                @07A  05150000
ATRFZSTGNAME             DS CL8  Logging Group Name               @07A  05160000
ATRFZSTSYSNAME           DS CL8  Sysname                          @07A  05170000
ATRFZSTSTATE             DS F    UR state                         @07A  05180000
ATRFZSTNUMOFURS          DS F    Number of URs in that state      @07A  05190000
ATRFZSTMINTIME           DS CL8  Minimum UR Duration, TOD format. See   05200000
*                                message ATR623I for explanation. @07A  05210000
ATRFZSTMAXTIME           DS CL8  Maximum UR Duration, TOD format. See   05220000
*                                message ATR623I for explanation. @07A  05230000
*                                                                       05240000
         MEND   , */                                                    05250000
*%ATRFZQRY2:  ;                                                         05260000
*]                                                                      05270000
*] values for parameters                                                05280000
*]                                                                      05290000
*dcl atr_nofilter fixed(31) constant(-1);                               05300000
*dcl atr_nofilter_mask       fixed(32) constant('00000000'X);    ] @L3A 05310000
*dcl atr_in_flight_mask      bit(32)   constant('80000000'X);    ] @L3A 05320000
*dcl atr_in_state_check_mask fixed(32) constant('40000000'X);    ] @L3A 05330000
*dcl atr_in_prepare_mask     fixed(32) constant('20000000'X);    ] @L3A 05340000
*dcl atr_in_doubt_mask       fixed(32) constant('10000000'X);    ] @L3A 05350000
*dcl atr_in_commit_mask      fixed(32) constant('08000000'X);    ] @L3A 05360000
*dcl atr_in_backout_mask     fixed(32) constant('04000000'X);    ] @L3A 05370000
*dcl atr_in_end_mask         fixed(32) constant('02000000'X);    ] @L3A 05380000
*dcl atr_in_completion_mask  fixed(32) constant('01000000'X);    ] @L3A 05390000
*dcl atr_in_only_agent_mask  fixed(32) constant('00800000'X);    ] @L3A 05400000
*dcl atr_in_forget_mask      fixed(32) constant('00400000'X);    ] @L3A 05410000
*                                                                       05420000
*dcl atr_noexclusion_mask    fixed(32) constant('00000000'X);    ] @L3A 05430000
*dcl atr_restart_log_mask    bit(32)   constant('80000000'X);    ] @L3A 05440000
*dcl atr_restart_required_mask fixed(32) constant('40000000'X);  ] @L3A 05450000
*dcl atr_nondeferred_ur_mask fixed(32) constant('20000000'X);    ] @L3A 05460000
*dcl atr_cascaded_ur_mask    fixed(32) constant('10000000'X);    ] @P6A 05470000
*dcl atr_global_ur_mask      fixed(32) constant('04000000'X);    ] @05A 05480000
*dcl atr_local_ur_mask       fixed(32) constant('08000000'X);    ] @05A 05490000
*dcl atr_rrs_managed_ur_mask    fixed(32) constant('02000000'X); ] @P9A 05500000
*dcl atr_nonrrs_managed_ur_mask fixed(32) constant('01000000'X); ] @P9A 05510000
*                                                                       05520000
*dcl atr_sort_wm_name        fixed(32) constant('00000001'X);    ] @L5A 05530000
*dcl atr_sort_urid           fixed(32) constant('00000002'X);    ] @L5A 05540000
*dcl atr_sort_create_time    fixed(32) constant('00000003'X);    ] @L5A 05550000
*dcl atr_sort_ur_state       fixed(32) constant('00000004'X);    ] @L5A 05560000
*dcl atr_sort_luwid          fixed(32) constant('00000005'X);    ] @L5A 05570000
*dcl atr_sort_tid            fixed(32) constant('00000006'X);    ] @L5A 05580000
*dcl atr_sort_gtid           fixed(32) constant('00000007'X);    ] @L5A 05590000
*dcl atr_sort_xid            fixed(32) constant('00000008'X);    ] @L5A 05600000
*dcl atr_sort_gname          fixed(32) constant('00000009'X);    ] @L7C 05610000
*dcl atr_sort_sysname        fixed(32) constant('0000000A'X);    ] @L7A 05620000
*dcl atr_sort_surid          fixed(32) constant('0000000B'X);    ] @P8a 05630000
*dcl atr_sort_max_entries    fixed(32) constant('0000000B'X);    ] @P8c 05640000
*                                                                       05650000
*dcl atr_sortopt_ascending   bit(32)   constant('00000000'X);    ] @L5A 05660000
*dcl atr_sortopt_descending  bit(32)   constant('80000000'X);    ] @L5A 05670000
*                                                                       05680000
*dcl atr_ur_tst              fixed(32) constant('00000001'X);    ] @L6A 05690000
*dcl atr_uri_tst             fixed(32) constant('00000002'X);    ] @L6A 05700000
*                                                                       05710000
*dcl atr_noxinfo_mask        bit(32)   constant('00000000'X);    ] @L6A 05720000
*dcl atr_xinfo_timestamp_mask bit(32)  constant('80000000'X);    ] @L6A 05730000
*dcl atr_xinfo_cascaded_mask  bit(32)  constant('40000000'X);    ] @LCA 05740000
*dcl atr_xinfo_pid_mask       bit(32)  constant('20000000'X);    ] @LEA 05750000
*dcl atr_xinfo_status_mask    bit(32)  constant('10000000'X);    ] @07A 05760000
*                                                                       05770000
*]                                                                      05780000
*] Return codes                                                         05790000
*]                                                                      05800000
*dcl atrquery_success  fixed(31) constant(0)                            05810000
*    ,atrquery_warning fixed(31) constant(4)                            05820000
*    ,atrquery_failure fixed(31) constant(8)                            05830000
*    ;                                                                  05840000
*                                                                       05850000
*]                                                                      05860000
*] Reason codes                                                         05870000
*]                                                                      05880000
*dcl atrquery_asid_invalid              fixed(31) constant(1)           05890000
*    ,atrquery_rrs_not_active           fixed(31) constant(2)           05900000
*    ,atrquery_area_full                fixed(31) constant(3)           05910000
*    ,atrquery_not_saf_auth             fixed(31) constant(4)           05920000
*    ,atrquery_urstmask_rsvd            fixed(31) constant(5)  ] @L6A   05930000
*    ,atrquery_xinfomask_rsvd           fixed(31) constant(6)  ] @L6A   05940000
*    ,atrquery_exclusionmask_rsvd       fixed(31) constant(7)  ] @L6A   05950000
*    ,atrquery_sortkey_invalid          fixed(31) constant(8)  ] @L6A   05960000
*    ,atrquery_sortopt_invalid          fixed(31) constant(9)  ] @L6A   05970000
*    ,atrquery_sortnum_invalid          fixed(31) constant(10) ] @L6A   05980000
*    ,atrquery_tid_range_invalid        fixed(31) constant(11) ] @L6A   05990000
*    ,atrquery_tod_range_invalid        fixed(31) constant(12) ] @L6A   06000000
*    ,atrquery_luwidstr_invalid         fixed(31) constant(13) ] @L6A   06010000
*    ,atrquery_curdur_invalid           fixed(31) constant(14) ] @L6A   06020000
*    ,atrquery_sorttabptr_bad           fixed(31) constant(15) ] @03A   06030000
*    ,atrquery_areaalet_secondary       fixed(31) constant(16)   ] @L7A 06040000
*    ,atrquery_request_unknown          fixed(31) constant(17)   ] @L7A 06050000
*    ,atrquery_gname_invalid            fixed(31) constant(18)   ] @L8A 06060000
*    ,atrquery_sysname_invalid          fixed(31) constant(19)   ] @L8A 06070000
*    ,atrquery_Resource_Error           fixed(31) constant(20)   ] @L8A 06080000
*    ,atrquery_Too_Many_Items           fixed(31) constant(21)   ] @L8A 06090000
*    ,Atrquery_Instance_Failure         fixed(31) constant(22)   ] @L9A 06100000
*    ,Atrquery_Remote_Warning           fixed(31) constant(23)   ] @L9A 06110000
*    ,Atrquery_Remote_Error             fixed(31) constant(24)   ] @L9A 06120000
*    ,Atrquery_Resp_Not_Received        fixed(31) constant(25)   ] @L9A 06130000
*    ,Atrquery_Remote_Not_Active        fixed(31) constant(26)   ] @L9A 06140000
*    ,Atrquery_Arealen_Invalid          fixed(31) constant(27)   ] @P5A 06150000
*    ,Atrquery_Areaaddr_Invalid         fixed(31) constant(28)   ] @P5A 06160000
*    ,Atrquery_RMMetaDataLogUnavailable fixed(31) constant(29)   ] @PEA 06170000
*    ,atrquery_Unexpected_Error         fixed(31) constant(4095) ] @L8A 06180000
*    ;                                                                  06190000
*                                                                       06200000
*]                                                                      06210000
*] Version numbers                                                      06220000
*]                                                                      06230000
*Dcl Atrquery_Rm_Version      Fixed(16) Constant(3);              ]@07C 06240000
*Dcl Atrquery_Rm_Version_0    Fixed(16) Constant(0);              ]@LFA 06250000
*Dcl Atrquery_Rm_Version_1    Fixed(16) Constant(1);              ]@LFA 06260000
*Dcl Atrquery_Rm_Version_2    Fixed(16) Constant(2);              ]@LFA 06270000
*Dcl Atrquery_Rm_Version_3    Fixed(16) Constant(3);              ]@07A 06280000
*Dcl Atrquery_Wm_Version      Fixed(16) Constant(1);           ] @L7C   06290000
*Dcl Atrquery_Ur_Version      Fixed(16) Constant(7);              ]@07C 06300000
*Dcl Atrquery_Lg_Version      Fixed(16) Constant(0);           ] @L7A   06310000
*Dcl Atrquery_Si_Version      Fixed(16) Constant(0);           ] @L7A   06320000
*Dcl Atrquery_Si_Version_1    Fixed(16) Constant(1); ] Full output @06A 06330000
*Dcl Atrquery_Rca_Version     Fixed(16) Constant(0);           ] @L9A   06340000
*Dcl Atrquery_Cfm_Version     Fixed(16) Constant(0);           ] @LAA   06350000
*Dcl Atrquery_Ur_Version_3    Fixed(16) Constant(3);           ] @P7A   06360000
*Dcl Atrquery_Ur_Version_4    Fixed(16) Constant(4);           ] @P7A   06370000
*Dcl Atrquery_Ur_Version_5    Fixed(16) Constant(5);           ] @LDA   06380000
*Dcl Atrquery_Ur_Version_6    Fixed(16) Constant(6);           ] @LEA   06390000
*Dcl Atrquery_Ur_Version_7    Fixed(16) Constant(7);              ]@07A 06400000
*                                                                       06410000
*Dcl Atrquery_Uri_Version_1   Fixed(16) Constant(1);           ] @LEA   06420000
*Dcl Atrquery_Uri_Version_2            Fixed(16) Constant(2);     ]@LGA 06430000
*Dcl Atrquery_Uri_PiData_Support       Fixed(16) Constant(2);     ]@LGA 06440000
*Dcl Atrquery_Uri_Version_3            Fixed(16) Constant(3);     ]@LGA 06450000
*Dcl Atrquery_Uri_Pre_Prepare_Support  Fixed(16) Constant(3);     ]@LGA 06460000
*Dcl Atrquery_Uri_Version              Fixed(16) Constant(3);     ]@LGC 06470000
*                                                                       06480000
*Dcl Atrquery_Tst_Version_0            Fixed(16) Constant(0);     ]@LGA 06490000
*Dcl Atrquery_Tst_Version_1            Fixed(16) Constant(1);     ]@LGA 06500000
*Dcl Atrquery_Tst_Pre_Prepare_Support  Fixed(16) Constant(1);     ]@LGA 06510000
*Dcl Atrquery_Tst_Version              Fixed(16) Constant(1);     ]@LGC 06520000
*                                                                       06530000
*Dcl Atrquery_URStatus_Version_1       Fixed(16)                        06540000
*                               Constant(atrfzst_vers1_length);   ]@07A 06550000
*                                                                       06560000
*]                                                                      06570000
*] RMINFO return mappings                                               06580000
*]                                                                      06590000
*dcl 1 atrfzrm_type type,                                               06600000
*      3 next     ptr(31)                                               06610000
*       ,5 nextoffset fixed(31)                                  ] @L7A 06620000
*     ,3 flags    bit(16),                                     ] @L2C   06630000
*      3 RmVersionNumber Fixed(16),                            ] @L2A   06640000
*      3 rmname   isa(ATR_rm_name_type),                                06650000
*      3 rmtoken  isa(ATR_rm_token_Type),                               06660000
*      3 rmstate  fixed                                                 06670000
*     ,3 lgptr    ptr(31)                                        ] @L7A 06680000
*       ,5 lgoffset fixed(31)                                    ] @L7A 06690000
*     ,3 RMMetaDataLen      Fixed(31)                             ]@LFA 06700000
*     ,3 RMMetaDatalgptr      Ptr(31)                             ]@LFA 06710000
*       ,5 RMMetaDatalgoffset Fixed(31)                           ]@LFA 06720000
*     ,3 rmjobname      Char(8)                                   ]@07A 06730000
*     ;                                                                 06740000
*                                                                       06750000
*]                                                                      06760000
*] WMINFO return mappings                                               06770000
*]                                                                      06780000
*dcl 1 atrfzwm_type type,                                      ] @L5A   06790000
*      3 next     ptr(31)                                      ] @L5A   06800000
*       ,5 nextoffset fixed(31)                                  ] @L7A 06810000
*     ,3 flags    bit(16),                                     ] @L5A   06820000
*      3 WmVersionNumber Fixed(16),                            ] @L5A   06830000
*      3 wmname   isa(ATR_rm_name_type)                        ] @L5A   06840000
*     ,3 lgptr    ptr(31)                                        ] @L7A 06850000
*       ,5 lgoffset fixed(31)                                    ] @L7A 06860000
*     ;                                                                 06870000
*                                                                       06880000
*]                                                                      06890000
*] URINFO return mappings                                               06900000
*]                                                                      06910000
*dcl 1 atrfzur_type type,                                               06920000
*      3 next     ptr(31)                                               06930000
*       ,5 nextoffset fixed(31)                                  ] @L7A 06940000
*     ,3 flags    bit(16),                                     ] @L2C   06950000
*        5 restartlog bit(1),                                           06960000
*        5 damaged    bit(1),                                  ] @P3A   06970000
*        5 heurmixed  bit(1),                                  ] @02A   06980000
*        5 Deferred   bit(1),                                  ] @P4A   06990000
*        5 mixedstates bit(1),                                 ] @L6C   07000000
*        5 CFamily    bit(1),                                  ] @LCA   07010000
*        5 Cascaded   bit(1),                                  ] @LCA   07020000
*        5 FamilyInclude bit(1),                               ] @LCA   07030000
*        5 ModeLocal     bit(1),                               ] @05A   07040000
*        5 ModeGlobal    bit(1),                               ] @05A   07050000
*        5 SysplexCascaded bit(1),                             ] @LDA   07060000
*        5 MainLog    bit(1),                                  ] @PAA   07070000
*        5 DelayedLog  bit(1),                                 ] @PAA   07080000
*        5 DoNotDisplay bit(1),                                ] @PBA   07090000
*        5 WAITApplComplete bit(1),                            ] @07A   07100000
*        5 Flags1Active   bit(1),         ] Flags1 Field in use  @07C   07110000
*      3 UrVersionNumber Fixed(16),/* NOTE: The offset of               07120000
*                                        UrVersionNumber must be the    07130000
*                                        same as stVersion in           07140000
*                                        atrfzst_type.          ]@07C*/ 07150000
*      3 urid     isa(ATR_URID_Type),          ] char(16)               07160000
*      3 urstate  isa(ATR_UR_State_Type),      ] fixed(31)              07170000
*      3 urtype   isa(ATR_Interest_Type_Type), ] fixed(31)              07180000
*      3 crtime   char(8),                                              07190000
*      3 asid     fixed(16),                                   ] @P2C   07200000
*      3 flags1   bit(16),                                      ]  @07C 07210000
*        5 WAITSubURs   bit(1),                                  ] @07A 07220000
*        5 WAITExits    bit(1),                                  ] @07A 07230000
*        5 WAITOutstanding bit(1),  ] UR Waiting for (S)DSRM Agent @08A 07242900
*        5 *      bit(13),                 ] Unused                @08C 07245900
*      3 protocol isa(ATR_Protocol_Type),                               07250000
*      3 luwidlen isa(ATR_Uwid_Len_Type),      ] fixed(31)              07260000
*      3 luwidptr ptr(31)                                               07270000
*       ,5 luwidoffset fixed(31)                                 ] @L7A 07280000
*     ,3 eidlen   isa(ATR_Uwid_Len_Type),      ] fixed(31)              07290000
*      3 eidptr   ptr(31)                                               07300000
*       ,5 eidoffset fixed(31)                                   ] @L7A 07310000
*     ,3 uricount fixed(31),                                            07320000
*      3 uriaddr  ptr(31)                                               07330000
*       ,5 urioffset fixed(31)                                   ] @L7A 07340000
*     ,3 urfuncmap bit(64),                                    ] @L2A   07350000
*      3 Xidlen   Isa(ATR_Uwid_Len_Type),                      ] @L2A   07360000
*      3 Xidptr   Ptr(31)                                      ] @L2A   07370000
*       ,5 xidoffset fixed(31)                                   ] @L7A 07380000
*     ,3 tstptr   ptr(31)                                      ] @L3A   07390000
*       ,5 tstoffset fixed(31)                                   ] @L7A 07400000
*     ,3 wmname   isa(atr_rm_name_Type)                        ] @L3A   07410000
*     ,3 lgptr    ptr(31)                                        ] @L7A 07420000
*       ,5 lgoffset fixed(31)                                    ] @L7A 07430000
*     ,3 parenturid  isa(atr_urid_Type)                          ] @LBA 07440000
*     ,3 cfmPtr   Ptr(31)                                        ] @LCA 07450000
*       ,5 cfmoffset fixed(31)                                   ] @LCA 07460000
*     ,3 SURID       char(32)                                    ] @LDA 07470000
*     ,3 Element_Len  fixed(31) ] Total length of the returned info     07480000
*                               ]including the UR and URi info as well  07490000
*                               ] as the Pdata for each URi.    ]@LEA   07500000
*     ;                                                                 07510000
*                                                                       07520000
*                                                                       07530000
*dcl 1 atrfzuri_type type,                                              07540000
*      3 next             ptr(31)                                       07550000
*       ,5 nextoffset fixed(31)                                  ] @L7A 07560000
*     ,3 flags            bit(16),                             ] @L2C   07570000
*        5 restartreq     bit(1),                              ] @L3A   07580000
*        5 deferred       bit(1),                              ] @L3A   07590000
*      3 UriVersionNumber Fixed(16),                           ] @L2A   07600000
*      3 token            isa(atr_uri_token_type),  ] char(16)          07610000
*      3 rmname           isa(atr_rm_name_type),  ] char(32)            07620000
*      3 inttype          isa(ATR_Interest_Type_Type),] fixed(31)       07630000
*      3 protocol         isa(ATR_Protocol_Type),                       07640000
*      3 role             isa(ATR_Role_Type),] fixed(31)                07650000
*      3 StateCheck_RC    fixed(31),                                    07660000
*      3 Prepare_RC       fixed(31),                                    07670000
*      3 Commit_RC        fixed(31),                                    07680000
*      3 Backout_RC       fixed(31),                                    07690000
*      3 End_RC           fixed(31),                                    07700000
*      3 Completion_RC    fixed(31),                                    07710000
*      3 OnlyAgent_RC     fixed(31),                                    07720000
*      3 DistSyncpoint_RC fixed(31),                                    07730000
*      3 ExitFailed_RC    fixed(31),                                    07740000
*      3 tstptr           ptr(31)                               ] @L3A  07750000
*       ,5 tstoffset fixed(31)                                  ] @L7A  07760000
*     ,3 UriState         isa(atr_ur_state_type)                ] @LEC  07770000
*     ,3 PidLen           Isa(Atr_Pdata_Length_Type)            ] @LEA  07780000
*     ,3 PidPtr           ptr(31)                               ] @LEA  07790000
*       ,5 Pidoffset fixed(31)                                    ]@LGC 07800000
*     ,3 Pre_Prepare_RC   fixed(31)                               ]@LGA 07810000
*     ;                                                           ]@LGA 07820000
*                                                                       07830000
*dcl 1 atrfztst_type type,                                              07840000
*      3 flags            bit(16),                              ] @L3A  07850000
*      3 tstVersion       fixed(16),                            ] @L3A  07860000
*      3 tstType          fixed(32),  /* make a type for this?   @L3A*/ 07870000
*      3 s_state_check    char(8),                              ] @L3A  07880000
*      3 e_state_check    char(8),                              ] @L3A  07890000
*      3 s_prepare        char(8),                              ] @L3A  07900000
*      3 e_prepare        char(8),                              ] @L3A  07910000
*      3 s_doubt          char(8),                              ] @L3A  07920000
*      3 e_doubt          char(8),                              ] @L3A  07930000
*      3 s_commit         char(8),                              ] @L3A  07940000
*      3 e_commit         char(8),                              ] @L3A  07950000
*      3 s_backout        char(8),                              ] @L3A  07960000
*      3 e_backout        char(8),                              ] @L3A  07970000
*      3 s_in_end         char(8),                              ] @L3A  07980000
*      3 e_in_end         char(8),                              ] @L3A  07990000
*      3 s_only_agent     char(8),                              ] @L3A  08000000
*      3 e_only_agent     char(8),                              ] @L3A  08010000
*      3 s_completion     char(8),                              ] @L6M  08020000
*      3 e_completion     char(8),                              ] @L6M  08030000
*      /* Note: Space for s_forget and e_forget were wasted just like   08040000
*               the space for ATR_FORGOTTEN was wasted in the URI_TST   08050000
*               array. The positions will now be used for Pre-Prepare.  08060000
*      */                                                               08070000
*      3 s_pre_prepare    char(8),                                ]@LGC 08080000
*      3 e_pre_prepare    char(8);                                ]@LGC 08090000
*                                                                       08100000
*dcl 1 atrfzlg_type type,                                               08110000
*      3 flags            bit(16),                              ] @L7A  08120000
*      3 lgVersion        fixed(16),                            ] @L7A  08130000
*      3 lgType           fixed(32),                            ] @L7A  08140000
*      3 sysname          char(8)                               ] @L7A  08150000
*     ,3 gname            char(8)                               ] @L7A  08160000
*     ;                                                         ] @L7A  08170000
*                                                                       08180000
*dcl 1 atrfzsi_type type                                                08190000
*     ,3 next             ptr(31)                               ] @L7A  08200000
*       ,5 nextoffset fixed(31)                                 ] @L7A  08210000
*     ,3 flags            bit(16)                               ] @L7A  08220000
*     ,3 siVersion        fixed(16)                             ] @L7A  08230000
*     ,3 sysname          char(8)                               ] @L7A  08240000
*     ,3 memname          char(16)                              ] @L7A  08250000
*     ,3 memstate         char(1)                               ] @L7A  08260000
*     ,3 rsvd             char(7)                               ] @L7A  08270000
*     ,3 gname            char(8)                               ] @L7A  08280000
*     ;                                                         ] @L7A  08290000
*dcl atrfzSI_memstate_ACTIVE  Constant(1);                     ]  @06A  08300000
*                                                                       08310000
*dcl 1 atrfzsorttabentry_type type,                             ] @L6A  08320000
*      3 key fixed(32),                                         ] @L6A  08330000
*      3 options bit(32);                                       ] @L6A  08340000
*                                                                       08350000
*dcl 1 AtrfzrcaEntry_type type                                  ]@L9A   08360000
*     ,3 Gname            char(8)                               ]@L9A   08370000
*     ,3 Sysname          char(8)                               ]@L9A   08380000
*     ,3 AtrRc            fixed(31)                             ]@LAC   08390000
*     ,3 AtrRsn           fixed(31)                             ]@LAC   08400000
*     ,3 ServiceId        fixed(31)                             ]@L9A   08410000
*     ,3 ServiceRc        fixed(31)                             ]@L9A   08420000
*     ,3 ServiceRsn       fixed(31)                             ]@L9A   08430000
*     ;                                                                 08440000
*                                                                       08450000
*]                                                                      08460000
*] Cascaded UR family info return mappings                              08470000
*]                                                                      08480000
*dcl 1 Atrfzcfm_Type      Type                                  ] @LCA  08490000
*     ,3 Flags            Bit(16)                               ] @LCA  08500000
*       ,5 ParentNotMapped  Bit(1)                              ] @LCA  08510000
*       ,5 SibNotMapped     Bit(1)                              ] @LCA  08520000
*       ,5 ChildNotMapped   BIt(1)                              ] @LCA  08530000
*     ,3 CfmVersionNumber   Fixed(16)                           ] @LCA  08540000
*     ,3 ParentPtr          Ptr(31)                             ] @LCA  08550000
*     ,3 SibPtr             Ptr(31)                             ] @LCA  08560000
*     ,3 ChildPtr           Ptr(31)                             ] @LCA  08570000
*     ;                                                         ] @LCA  08580000
*                                                                       08590000
*]                                                                      08600000
*] UR Status return mappings                                            08610000
*]                                                                      08620000
*dcl 1 atrfzst_type type                                                08630000
*     ,3 next         ptr(31)                                           08640000
*       ,5 nextoffset fixed(31)                                         08650000
*     ,3 flags        bit(16)                                           08660000
*     ,3 stVersion    fixed(16) /* NOTE: The offset of stVersion must   08670000
*                                        be the same as UrVersionNumber 08680000
*                                        in atrfzur_type. */            08690000
*     ,3 gname        char(8)                                           08700000
*     ,3 sysname      char(8)                                           08710000
*     ,3 state        isa(ATR_UR_State_Type)                            08720000
*     ,3 numofurs     fixed(31)                                         08730000
*     ,3 mintime      char(8)                                           08740000
*     ,3 maxtime      char(8)                                           08750000
*     ;                                                           ]@07A 08760000
*                                                                       08770000
*dcl atrfzsortkey_type type fixed(32);                          ] @L5A  08780000
*dcl atrfzrm isa(atrfzrm_type) based;                                   08790000
*dcl atrfzwm isa(atrfzwm_type) based;                           ] @L5A  08800000
*dcl atrfzur isa(atrfzur_type) based;                                   08810000
*dcl atrfzuri isa(atrfzuri_type) based(atrfzur.uriaddr);                08820000
*dcl atrfzst isa(atrfzst_type) based;                             ]@07A 08830000
*dcl atrfztst isa(atrfztst_type) based;                         ] @L3A  08840000
*dcl atrfzur_luwid char(ATR_MAX_LUWID_LENGTH) based(atrfzur.luwidptr);  08850000
*dcl atrfzur_eid char(ATR_MAX_EID_LENGTH) based(atrfzur.eidptr);        08860000
*dcl atrfzur_xid char(ATR_MAX_XID_LENGTH) based(atrfzur.xidptr); ] @L2A 08870000
*dcl atrfzlg isa(atrfzlg_type) based;                            ] @L7A 08880000
*dcl atrfzsi isa(atrfzsi_type) based;                            ] @L7A 08890000
*dcl atrfzcfm isa(atrfzcfm_type) based;                          ] @LCA 08900000
*                                                                       08910000
*dcl atrfzrm_vers0_length fixed(31) constant(60);                ] @L7A 08920000
*dcl atrfzrm_vers1_length fixed(31) constant(64);                ] @L7A 08930000
*dcl atrfzrm_vers2_length fixed(31) constant(72);                 ]@LFA 08940000
*dcl atrfzrm_vers3_length fixed(31) constant(80);                 ]@07A 08950000
*dcl atrfzrm_length fixed(31) constant(length(atrfzrm));                08960000
*                                                                       08970000
*dcl atrfzwm_vers0_length fixed(31) constant(40);                ] @L7A 08980000
*dcl atrfzwm_vers1_length fixed(31) constant(44);                ] @L7A 08990000
*dcl atrfzwm_length fixed(31) constant(length(atrfzwm));        ] @L6A  09000000
*                                                                       09010000
*dcl atrfzlg_vers0_length fixed(31) constant(24);                ] @L7A 09020000
*dcl atrfzlg_length fixed(31) constant(length(atrfzlg));         ] @L7A 09030000
*                                                                       09040000
*dcl atrfzsi_vers0_length fixed(31) constant(48);                ] @L7A 09050000
*dcl atrfzsi_length fixed(31) constant(length(atrfzsi));         ] @L7A 09060000
*                                                                       09070000
*dcl atrfzur_vers0_length fixed(31) constant(72);                ] @L7A 09080000
*dcl atrfzur_vers1_length fixed(31) constant(88);                ] @L7A 09090000
*dcl atrfzur_vers2_length fixed(31) constant(124);               ] @L7A 09100000
*dcl atrfzur_vers3_length fixed(31) constant(128);               ] @L7A 09110000
*dcl atrfzur_vers4_length fixed(31) constant(148);               ] @LCA 09120000
*dcl atrfzur_vers5_length fixed(31) constant(180);               ] @LDA 09130000
*dcl atrfzur_vers6_length fixed(31) constant(184);               ] @LEA 09140000
*dcl atrfzur_vers7_length fixed(31) constant(184);                ]@07A 09150000
*dcl atrfzur_length fixed(31) constant(length(atrfzur));                09160000
*                                                                       09170000
*dcl atrfzuri_vers0_length fixed(31) constant(104);              ] @L7A 09180000
*dcl atrfzuri_vers1_length fixed(31) constant(112);              ] @L7A 09190000
*dcl atrfzuri_vers2_length fixed(31) constant(120);              ] @LEA 09200000
*dcl atrfzuri_vers3_length fixed(31) constant(124);               ]@LGA 09210000
*dcl atrfzuri_length fixed(31) constant(length(atrfzuri));              09220000
                                                                        09230000
*dcl atrfztst_vers0_length fixed(31) constant(152);              ] @L7A 09240000
*dcl atrfztst_vers1_length fixed(31) constant(152);               ]@LGA 09250000
*dcl atrfztst_length fixed(31) constant(length(atrfztst));       ] @L7A 09260000
                                                                        09270000
*dcl atrfzcfm_vers0_length fixed(31) constant(16);               ] @LCA 09280000
*dcl atrfzcfm_length fixed(31) constant(length(atrfzcfm));       ] @LCA 09290000
                                                                        09300000
*dcl atrfzst_vers1_length fixed(31) constant(48);                 ]@07A 09310000
*dcl atrfzst_length fixed(31) constant(length(atrfzst));          ]@07A 09320000
