*                                                                       00050001
* %DCL ATRTZRMD_INCLUDED CHAR EXT;                                      00100001
* %DEACTIVATE ATRTZRMD_INCLUDED;                                        00150001
* %IF ATRTZRMD_INCLUDED = '' %THEN                                      00200001
* %DO;                                                                  00250001
*/* Macro made bi-lingual on 97069. CBGEN compile date 96059         */ 00300001
*% /*                                                                   00350001
         MACRO                                                          00400001
         ATRTZRMD &DSECT=YES,&LIST=YES,&TITLE=YES,&ATRTZRMD=YES         00450001
         GBLC  &ATRTZRMD_INCLUDED                                       00500001
         GBLC  &ZCBPRINT                                                00550001
&ATRTZRMD_INCLUDED SETC 'YES'                                           00600001
         AIF   ('&LIST' EQ 'NONE').P0                                   00650001
         AIF   ('&TITLE' EQ 'NO').P5                                    00700001
 TITLE   'ATRTZRMD  - RRS RM Data Log Block                       '     00750001
.P5      ANOP                                                           00800001
**/ ATRTZRMD_1:;                                                        00850001
*/******* START OF SPECIFICATIONS ************************************/ 00900001
*/*                                                                  */ 00950001
*/*01* Macro Name: ATRTZRMD                                          */ 01000001
*/*                                                                  */ 01050001
*/*01* Descriptive Name: RRS RM Data Log Block                       */ 01100001
*/*                                                                  */ 01150001
*/*02*  Acronym: ATRTCRMD                                            */ 01200001
*/*                                                                  */ 01250001
*/*01* PROPRIETARY STATEMENT=                                        */ 01300001
*/*                                                                  */ 01350001
*/* LICENSED MATERIALS - PROPERTY OF IBM                             */ 01400001
*/* THIS MACRO IS "RESTRICTED MATERIALS OF IBM"                      */ 01450001
*/* 5694-A01 (C) COPYRIGHT IBM CORP. 1997, 2006                 @L4C */ 01500001
*/*                                                                  */ 01550001
*/* STATUS= HBB7730                                             @L4C */ 01600001
*/*                                                                  */ 01650001
*/*01* PROPRIETARY STATEMENT=                                        */ 01700001
*/*                                                                  */ 01750001
*/*01* EXTERNAL CLASSIFICATION: PSPI                                 */ 01800001
*/*01* END OF EXTERNAL CLASSIFICATION:                               */ 01850001
*/*                                                                  */ 01900001
*/*01* COMPONENT: Resource Recovery Services (SCRRS)                 */ 01950001
*/*                                                                  */ 02000001
*/*01* DSECT Name: ATRTZRMD                                          */ 02050001
*/*                                                                  */ 02100001
*/*01* Eye-Catcher: ATRTCRMD                                         */ 02150001
*/*02*  Offset: 0                                                    */ 02200001
*/*02*  Length: 8                                                    */ 02250001
*/*                                                                  */ 02300001
*/*01* Storage Attributes:                                           */ 02350001
*/*02*  Subpool: N/A                                                 */ 02400001
*/*02*  Key: N/A                                                     */ 02450001
*/*02*  Residency: N/A                                               */ 02500001
*/*                                                                  */ 02550001
*/*01* Size: 252 bytes                                               */ 02600001
*/*                                                                  */ 02650001
*/*01* Created by: N/A                                               */ 02700001
*/*                                                                  */ 02750001
*/*01* Pointed to by: N/A                                            */ 02800001
*/*                                                                  */ 02850001
*/*01* Serialization: N/A                                            */ 02900001
*/*                                                                  */ 02950001
*/*01* Function: This macro contains constants and declares for      */ 03000001
*/*              the RRS RM Data log block                           */ 03050001
*/*                                                                  */ 03100001
*/*01* Method of Access:                                             */ 03150001
*/*                                                                  */ 03200001
*/*02*  PL/X: %INCLUDE SYSLIB(ATRTZRMD)                              */ 03250001
*/*                                                                  */ 03300001
*/*           To add declaration options:                            */ 03350001
*/*                                                                  */ 03400001
*/*           %DCL ATRTZRMD_BASE CHAR EXT                            */ 03450001
*/*                                                                  */ 03500001
*/*           and set these to the desired options.                  */ 03550001
*/*                                                                  */ 03600001
*/*02*  ASM : ATRTZRMD                                               */ 03650001
*/*                                                                  */ 03700001
*/*           Options:                                               */ 03750001
*/*                                                                  */ 03800001
*/*           DSECT=YES!NO - Whether or not ATRTZRMD is generated    */ 03850001
*/*                          as a DSECT (YES) or a DS (NO)           */ 03900001
*/*                                                                  */ 03950001
*/*           ATRTZRMD=YES!NO - Whether or not the ATRTZRMD mapping  */ 04000001
*/*                             is generated                         */ 04050001
*/*                                                                  */ 04100001
*/*           LIST=YES!NO - Whether or not the macro expansion is    */ 04150001
*/*                         printed                                  */ 04200001
*/*                                                                  */ 04250001
*/*           TITLE=YES!NO - Whether or not the TITLE line is        */ 04300001
*/*                         printed                                  */ 04350001
*/*                                                                  */ 04400001
*/*01* Distribution Library: AMACLIB                                 */ 04450001
*/*                                                                  */ 04500001
*/*01* Change Activity:                                              */ 04550001
*/*                                                                  */ 04600001
*/*   PN  REASON   RLSE    DATE   ORG   COMMENTS                     */ 04650001
*/*   $P0=PQC2934  HBB6603 970310 B7HGEV:  Document the block        */ 04700001
*/*   $P1=PU700xx  HBB6603 970320 B7HGEJ:  RM Instance Number        */ 04750001
*/*                                        (TRSQ - OW26369, OW27324) */ 04800001
*/*   $P2=PUXxxxx  HBB6603 970601 ?DEM:    Align the log data to a   */ 04816601
*/*                                        doubleword boundary       */ 04833201
*/*   $L1=RRSRA    HBB7709 020513 B7HGBL: Restart Anytime/Anywhere   */ 04836501
*/*   $L2=RRSRA    HBB7709 021219 B7HGBL: Restart Anytime/Anywhere   */ 04839801
*/*   $L3=RRSRA    HBB7709 030312 PDEV:   Restart Anytime/Anywhere   */ 04843101
*/*   $P3=PJK0558  HBB7709 030618 PDEV: Remove RMD vers2 data        */ 04846401
*/*   $P4=PJK0767 HBB7709 030918 PDEV: RM not allowed to restart     */ 04847601
*/*                                    anywhere                      */ 04848801
*/*   $L4=RRSRML  HBB7730 050721 B7HGBL: RM Metadata Support         */ 04848901
*/*   $P5=ME04103 HBB7730 050802 B7HGBL: Correct ATRTZRMD size to    */ 04849003
*/*                                      prevent 0C4 in ATRTMSRA     */ 04849103
*/*                                                                  */ 04850001
*/** END OF SPECIFICATIONS *******************************************/ 04900001
*% /*                                                                   04950001
.P0      ANOP                                                           05000001
         AIF   ('&ZCBPRINT' EQ 'NO').P1                                 05050001
         AIF   ('&LIST' EQ 'YES').P2                                    05100001
.P1      ANOP                                                           05150001
         PUSH  PRINT                                                    05200001
         PRINT OFF                                                      05250001
.P2      ANOP                                                           05300001
         AIF   ('&ATRTZRMD' EQ 'NO').L0002                              05350001
         AIF   ('&DSECT' EQ 'YES').L0003                                05400001
         AIF   ('&ATRTZRMD' NE 'YES').L0002                             05450001
ATRTZRMD DS    0F                                                       05500001
         AGO   .L0004                                                   05550001
.L0003   ANOP                                                           05600001
ATRTZRMD DSECT                                                          05650001
.L0004   ANOP                                                           05700001
EYECATCHER DS  1CL0008   Control block eyecatcher                       05750001
VERSIONNUM DS  1FL4      Control block version                          05800001
ENTRYLENGTH DS 1FL4      Control block length                           05850001
EVENTID  DS    1FL2      Last event for this block                      05900001
FLAGS    DS    0BL2                                                     05950001
LOSSOFDATA EQU X'80'     ON means that log data may have been lost     *06000001
                         that could affect this resource manager. When *06050001
                         the resource manager restarts, it will be     *06100001
                         presented with a possible loss of data error.  06150001
DATAINRESTARTLOG EQU X'40' When the RqdRstSystem field is blank, ON    *06200001
                         means that the resource manager has entries   *06250001
                         in the restart log. OFF means that the        *06300001
                         resource manager does not have entries in the *06350001
                         restart log.                                   06400001
RMD_RESTARTANYTIMESUPPORTED EQU X'20'  If ON, RM was last              *06408301
                                       active on a restart anytime     *06416601
                                       capable system. This will allow *06424901
                                       the RM to restart on any        *06433201
                                       restart anytime capable system.  06441501
RMD_RINRESTARTANYWHEREMAYBE EQU X'10'  IF ON, a removeint              *06442701
                                       was done for this RM by an R6   *06443901
                                       system. RM restart processing   *06445101
                                       on a pre-R6 system must prevent *06446301
                                       the RM from restarting if any   *06447501
                                       interests are found.     ]@P4A   06448701
         ORG   FLAGS+X'00000002'                                        06450001
RM_NAME  DS    1CL0032   Resource Manager name                          06500001
RMLOGNAMELENGTH DS 1FL4  Resource Manager log name length               06550001
RMLOGNAME DS   1CL0064   Resource Manager log name                      06600001
RQDRSTSYSTEM DS 1CL0008  System where the resource manager is required *06650001
                         to restart with RRS. This field has no        *06700001
                         meaning for the RRS resource manager entry.    06750001
LASTACTSYSTEM DS 1CL0008 System where the resource manager was last    *06800001
                         active with RRS. This field has no meaning    *06850001
                         for the RRS resource manager entry.            06900001
LOGGINGSYSTEM DS 1CL0008 System which wrote the log entry               06950001
RRS_ENTRY_DATA DS 0CL32   Union for RRS Version Data              ]@P5A 06953003
*                                                                       07000001
*      ***************************************************************  07050001
*      *                                                             *  07100001
*      * The log stream versions are valid only for the RRS resource *  07150001
*      * manager log entry                                           *  07200001
*      *                                                             *  07250001
*      ***************************************************************  07300001
*                                                                       07350001
*                                                                       07400001
RMD_MAINURLOGSTREAMVERSION DS 1CL0008 Main UR log stream version token  07450001
RMD_DELAYEDURLOGSTREAMVERSION DS 1CL0008 Delayed UR log stream version *07500001
                         token                                          07550001
RMD_RESTARTLOGSTREAMVERSION DS 1CL0008 Restart log stream version      *07600001
                         token                                          07650001
RMD_RMMETADATALOGSTREAMVERSION DS 1CL0008 RM Meta Data log stream      *07651002
                         version token                            ]@L4A 07652002
RM_ENTRY_DATA ORG RRS_ENTRY_DATA  Union for RM Data               ]@P5A 07670003
         DS CL24         Unused space to get RMD_LOG_INSTANCE_NUMBER   *07680002
                         at the correct offset.                   ]@P5A 07690003
RMD_LOG_INSTANCE_NUMBER DS 1CL0008 RM Instance Number used to          *07700001
                         differentiate log entries in the UR state logs*07750001
                         that completed, logically deleted, but have   *07800001
                         yet to be compressed out of the logs.     @P1A 07850001
         ORG   ATRTZRMD+X'000000FC'                                     07900001
ATRTZRMD_LEN EQU *-ATRTZRMD                                             07950001
.L0002   ANOP                                                           08000001
         AIF   ('&ZCBPRINT' EQ 'NO').P3                                 08050001
         AIF   ('&LIST' EQ 'YES').P4                                    08100001
.P3      ANOP                                                           08150001
         POP   PRINT                                                    08200001
.P4      ANOP                                                           08250001
.P_EXIT  ANOP                                                           08300001
         MEND                                                           08350001
**/ ATRTZRMD_2:;                                                        08400001
* %ATRTZRMD_INCLUDED = 'YES';                                           08450001
* %DCL ZCBPRINT CHAR EXT;                                               08500001
* %DEACTIVATE ZCBPRINT;                                                 08550001
* %DCL ATRTZRMD_LIST CHAR EXT;                                          08600001
* %DEACTIVATE ATRTZRMD_LIST;                                            08650001
* %IF ATRTZRMD_LIST ^= 'NO' &                                           08700001
*    ZCBPRINT ^= 'NO' %THEN                                             08750001
*   %GOTO ATRTZRMD_3;                                                   08800001
*   @LIST PUSH NOECHO;                                                  08850001
*   @LIST NOASSEMBLE NOECHO;                                            08900001
*   @LIST OFF C NOECHO;                                                 08950001
* %ATRTZRMD_3:;                                                         09000001
*/* Start of PL/X Source                                             */ 09050001
*%dcl atrtzrmd_base char ext;                                           09100001
*Dcl 1 ATRTZRMD Bdy(Word) atrtzrmd_base,                         ] @P2C 09150001
*      3 EyeCatcher  Char(8),   /* Control block eyecatcher          */ 09200001
*      3 VersionNum  Fixed(31), /* Control block version             */ 09250001
*      3 EntryLength Fixed(31), /* Control block length              */ 09300001
*      3 EventID     Fixed(16), /* Last event for this block         */ 09350001
*      3 Flags       bit(16),                                           09400001
*        5 LossOfData       bit(1), /* ON means that log data may have  09450001
*                                      been lost that could affect this 09500001
*                                      resource manager.                09550001
*                                      When the resource manager        09600001
*                                      restarts, it will be presented   09650001
*                                      with a possible loss of data     09700001
*                                      error.                        */ 09750001
*        5 DataInRestartLog bit(1), /* When the RqdRstSystem field      09800001
*                                      is blank, ON means that          09850001
*                                      the resource manager has entries 09900001
*                                      in the restart log.              09950001
*                                      OFF means that the resource      10000001
*                                      manager does not have entries    10050001
*                                      in the restart log.           */ 10100001
*        5 Rmd_RestartAnytimeSupported Bit(1), /* If ON, RM was last    10107101
*                                      active on a restart anytime      10114201
*                                      capable system. This will allow  10121301
*                                      the RM to restart on any         10128401
*                                      restart anytime capable system.  10135501
*                                                                @P3A*/ 10142601
*        5 Rmd_RINRestartAnywhereMaybe Bit(1), /* If ON, a removeint    10143601
*                                      was done for this RM by an R6    10144601
*                                      system. RM restart processing    10145601
*                                      on a pre-R6 system must prevent  10146601
*                                      the RM from restarting if any    10147601
*                                      interests are found.     ]@P4A*/ 10148601
*      3 RM_name         char(32), /* Resource Manager name          */ 10150001
*      3 RMLognameLength fixed, /* Resource Manager log name length  */ 10200001
*      3 RMLogname       char(64),/* Resource Manager log name       */ 10250001
*                                                                       10300001
*      3 RqdRstSystem  char(8), /* System where the resource manager    10350001
*                                  is required to restart with RRS.     10400001
*                                  This field has no meaning for the    10450001
*                                  RRS resource manager entry.       */ 10500001
*      3 LastActSystem char(8), /* System where the resource manager    10550001
*                                  was last active with RRS.            10600001
*                                  This field has no meaning for the    10650001
*                                  RRS resource manager entry.       */ 10700001
*      3 LoggingSystem char(8), /* System which wrote the log entry  */ 10750001
*                                                                       10800001
*      3 * UNION,                                                 ]@P5A 10810003
*        5 RRS_Entry_Data,                                        ]@P5A 10820003
*          /* The log stream versions are valid only for the            10850001
*             RRS resource manager log entry                            10900001
*          */                                                           10950001
*          7 Rmd_MainUrLogStreamVersion char(8),/* Main UR log stream   11000001
*                                                     version token  */ 11050001
*          7 Rmd_DelayedUrLogStreamVersion char(8),/* Delayed UR log    11100001
*                                               stream version token */ 11150001
*                                                                       11160001
*          7 Rmd_RestartLogStreamVersion char(8),/* Restart log stream  11200001
*                                                     version token  */ 11250001
*          7 Rmd_RMMetaDataLogStreamVersion char(8), /* RM Meta Data    11412601
*                                        log stream version token @L4A*/11412801
*        5 RM_Entry_Data,                                         ]@P5A 11413103
*          7 * Char(24), ] Unused space to get RMD_LOG_INSTANCE_NUMBER  11413202
*                        ] at the correct offset.                 ]@P5A 11413303
*          7 Rmd_LogInstanceNumber     char(8), /* Instance Number used 11413901
*                      to differentiate log entries in the UR state     11414001
*                      logs that completed, logically deleted, but have 11414101
*                      yet to be compressed out of the logs.     @P2C*/ 11415001
*      3 Rmd_EndIt      Char(0),       /* Ensure strcture ends on       11425001
*                                         doubleword boundary    @P2A*/ 11437501
*      3 *              Char(                                           11450001
*                            (((Offset(Atrtzrmd.Rmd_EndIt)+7)/8)*8)-    11462501
*                            Offset(Atrtzrmd.Rmd_EndIt)                 11475001
*                           );         /*                        @P2A*/ 11487501
* Dcl ATRTZRMD_LEN fixed constant(length(atrtzrmd));                    11500001
*/* End of PL/X Source                                               */ 11550001
* %IF ATRTZRMD_LIST ^= 'NO' &                                           11600001
*    ZCBPRINT ^= 'NO' %THEN                                             11650001
*   %GOTO ATRTZRMD_4;                                                   11700001
*   @LIST POP NOECHO;                                                   11750001
* %ATRTZRMD_4:;                                                         11800001
* %END;                                                                 11850001
