*/*** Start of Specifications for BLSQMDEF ***************************/ 00010000
*/*                                                                  */ 00020000
*/* $MAC(BLSQMDEF) COMP(SC132) PROD(HBB77A0): FORMAT MODEL HEADER    */ 00030000
*/*                                                                  */ 00040000
*/*    PROPRIETARY STATEMENT =                                       */ 00050000
*/*                                                                  */ 00060000
*/*    LICENSED MATERIALS  PROPERTY OF IBM                           */ 00070000
*/*    5650-ZOS                                                      */ 00080000
*/*    COPYRIGHT IBM CORP. 1984, 2015                                */ 00090000
*/*                                                                  */ 00100000
*/*    STATUS = HBB77A0                                              */ 00110000
*/*                                                                  */ 00120000
*/* EXTERNAL CLASSIFICATION: GUPI                                    */ 00130000
*/* END OF EXTERNAL CLASSIFICATION:                                  */ 00140000
*/*                                                                  */ 00150000
*/* DESCRIPTIVE NAME:     Format model header                        */ 00160000
*/*   ACRONYM:  Not applicable                                       */ 00170000
*/*                                                                  */ 00180000
*/* MACRO NAME: BLSQMDEF                                             */ 00190000
*/* DSECT NAME: Not applicable                                       */ 00200000
*/* COMPONENT:  IPCS (SC132)                                         */ 00210000
*/* EYE-CATCHER: None                                                */ 00220000
*/*     OFFSET:  Not applicable                                      */ 00230000
*/*     LENGTH:  Not applicable                                      */ 00240000
*/*                                                                  */ 00250000
*/* STORAGE ATTRIBUTES:                                              */ 00260000
*/*   SUBPOOL:  Not applicable                                       */ 00270000
*/*   KEY:  0, 8                                                     */ 00280000
*/*   RESIDENCY:  LOC(ANY)                                           */ 00290000
*/*   MAIN STORAGE:  No                                              */ 00300000
*/*   AUXILIARY STORAGE: Yes                                         */ 00310000
*/*   VIRTUAL STORAGE: No                                            */ 00320000
*/*   DATA SPACE: No                                                 */ 00330000
*/*                                                                  */ 00340000
*/* SIZE: Not applicable                                             */ 00350000
*/* CREATED BY: User code for use by the IPCS model processor        */ 00360000
*/* POINTED TO BY: IPCS model processor parameters                   */ 00370000
*/* SERIALIZATION: None                                              */ 00380000
*/* FUNCTION: Begin and end the declaration of a model to be used    */ 00390000
*/* by the IPCS model processor.                                     */ 00400000
*/*                                                                  */ 00410000
*/* METHOD OF ACCESS: See MVS/SP Application Development Reference   */ 00420000
*/* DELETED BY: User code                                            */ 00430000
*/* DEPENDENCIES: None                                               */ 00440000
*/* DISTRIBUTION LIBRARY: AMACLIB                                    */ 00450000
*/*                                                                  */ 00460000
*/* ================================================================ */ 00470000
*/*                                                                  */ 00480000
*/* CHANGE ACTIVITY=                                                 */ 00490000
*/*                                                                  */ 00500000
*/*   Products=                                                      */ 00510000
*/* $L1= IPCSENH,HBB3310,86099,PDE4: Formatting enhancements:        */ 00520000
*/*      View match on value, multiple source formatting             */ 00530000
*/* $L2= VLF,HBB3310,87236,PDE1: Allow EXTERNAL to be specified as   */ 00540000
*/*      a second positional argument on an initial PLAS BLSQMDEF    */ 00550000
*/*      invocation.                                                 */ 00560000
*/*    = IPCSM,HBB4430,910327,PDE4: Withdrawn                        */ 00570000
*/* $L3= IPCSREUS,JBB6602,95172,PDE1: Mixed upper/lower case support */ 00580000
*/*                                                                  */ 00590000
*/* ---------------------------------------------------------------- */ 00600000
*/*                                                                  */ 00610000
*/* $H1=IEEEBLS,HBB6606,97344,PDE1: Additional FP registers          */ 00620000
*/*     Use SIZE built-in rather than LENGTH built-in if compiling   */ 00630000
*/*     with PL/X 1.4.1 or later                                     */ 00640000
*/*                                                                  */ 00650000
*/* ---------------------------------------------------------------- */ 00660000
*/*                                                                  */ 00670000
*/*   Design changes=                                                */ 00680000
*/* $D0= DCR0054,JBB2125,83125,DSDPPY: Process new format models     */ 00690000
*/*    = DKB0014,HBB4430,92008,PDE1: Remove IPCSM                    */ 00700000
*/*                                                                  */ 00710000
*/* ---------------------------------------------------------------- */ 00720000
*/*                                                                  */ 00730000
*/*   PTMs=                                                          */ 00740000
*/* $P1= PN71373,HBB5520,94230,PDE1: Align each new model on a       */ 00750000
*/*      halfword boundary, silencing binder warnings regarding      */ 00760000
*/*      byte-aligned entry points and yielding a very slight        */ 00770000
*/*      performance improvement as a result of the numerous         */ 00780000
*/*      halfword fields in models being aligned                     */ 00790000
*/*    = PN71742,HBB5520,94276,PDE1: Add SHOWHDR data to macro       */ 00800000
*/*      prolog, including classification                            */ 00810000
*/* $P2= ME27702,HBB77A0,140712,PDNJ: revert fullword alignment      */ 00811000
*/*                                                                  */ 00821000
*/* ---------------------------------------------------------------- */ 00830000
*/*                                                                  */ 00840000
*/*   Maintenance=                                                   */ 00850000
*/* $01=OA45131,HBB7780,140605,PDNJ: Models to be full word aligned  */ 00851000
*/*                                                                  */ 00860000
*/***** End of Specifications for BLSQMDEF **************************** 00870000
         MACRO                                                          00880000
&NAME    BLSQMDEF &OPT1,                                               *00890000
               &BASELBL=,&CBLEN=,&MAINTLV=,&ACROFF=,&ACROLEN=,         *00900000
               &ACROLBL=,&ACRONYM=,&PREFIX=3,&OFFSETS=PRINT,           *00910000
               &STRTCOL=0,&LBLSPC=0,&HEADER=,&VIEWMATCH=           @L1C 00920000
*        MACDATE 06/12/14                                          @P2C 00930000
         LCLA  &TEMP                                                    00940000
         LCLB  &B1,&B2,&B3                                         @L1C 00950000
         LCLC  &ACRLEN                                                  00960000
         LCLC  &DEFLBL                                                  00970000
         LCLC  &SMAINL,&SACRYN                                          00980000
         GBLA  &GPREFIX                                                 00990000
         GBLA  &LLBL                   MAXIMUM LABEL LENGTH        @L1C 01000000
         GBLB  &FIRSTSW                                            @L1C 01010000
         GBLB  &VARYSPC                                                 01020000
         GBLB  &ARAYOPN                                                 01030000
         GBLC  &FIRTFLD                                                 01040000
         GBLC  &OFFLBL                                                  01050000
         GBLC  &LEVEL                                                   01060000
         GBLC  &VARYLBL                                                 01070000
         GBLC  &VARYVAL                                                 01080000
         GBLC  &VALULLN                USED TO SET MAX LBL LEN IN HDR   01090000
         GBLC  &GSRCNDX                SOURCE INDEX                @L1A 01100000
         AIF   ('&OPT1' EQ '').LBL015                                   01110000
         AIF   ('&OPT1' EQ 'END').LBL005                                01120000
         MNOTE 4,'INVALID PARAMETER SPECIFIED - ''&OPT1'''              01130000
         AGO   .LBL015                                                  01140000
.LBL005  ANOP                                                           01150000
         AIF   (&FIRSTSW NE 1).MSG3                                     01160000
&VARYVAL SETC  'X''00'''                                                01170000
         AIF   (&VARYSPC EQ 0).LBL010                                   01180000
&VARYVAL SETC  'X''40'''                                                01190000
.LBL010  ANOP                                                           01200000
&B2      SETB  0                       ARRAY BIT                   @L1A 01210000
&OFFLBL  SETC  ''                      RESET LABEL OFFSET          @L1C 01220000
&VARYLBL EQU   &VARYVAL                                                 01230000
&FIRSTSW SETB  0                                                        01240000
&LEVEL   EQU   1                       MODEL LEVEL                 @L1C 01250000
&VALULLN EQU   &LLBL                   MAXIMUM LABEL LENGTH        @L1C 01260000
         DC    AL1(0)                  END OF MODEL                @L1C 01270000
         AIF   (&ARAYOPN EQ 0).LBL011                                   01280000
         MNOTE 8,'ARRAY DEFINITION NOT CLOSED'                          01290000
         MNOTE *,'ARRAY=END MUST BE SPECIFIED ON BLSQMFLD MACRO'        01300000
.LBL011  ANOP                                                           01310000
&ARAYOPN SETB  0                                                        01320000
         MEXIT                                                          01330000
.LBL015  ANOP                                                           01340000
         AIF   (&FIRSTSW NE 0).MSG4                                     01350000
&FIRTFLD SETC  'FLD1&SYSNDX'                                            01360000
&LEVEL   SETC  'LVL&SYSNDX'                                             01370000
&VARYLBL SETC  'VARY&SYSNDX'                                            01380000
&VARYVAL SETC  'X''00'''                                                01390000
&VALULLN SETC  'LLBL&SYSNDX'                                            01400000
         AIF   ('&CBLEN' NE '').PCK010                                  01410000
         MNOTE 8,'''CBLEN'' MUST BE SPECIFIED'                          01420000
.PCK010  ANOP                                                           01430000
&GSRCNDX SETC  '0'                     SOURCE INDEX DEFAULT        @L1A 01440000
&GPREFIX SETA  3                       DEFAULT PREFIX VALUE             01450000
&LLBL    SETA  5                       DEFAULT MAXIMUM LABEL LENGTH     01460000
         AIF   (T'&PREFIX(1) NE 'N').MSG1 '                        @L1C 01470000
&TEMP    SETA  &PREFIX(1)                                               01480000
         AIF   (&TEMP GT 8).MSG1                                        01490000
&GPREFIX SETA  &PREFIX(1)+1                                             01500000
&LLBL    SETA  8-&PREFIX(1)            MAXIMUM LABEL LENGTH             01510000
.PCK020  ANOP                                                           01520000
&B1      SETB  1                                                        01530000
         AIF   ('&OFFSETS' NE 'PRINT' AND '&OFFSETS' NE 'NOPRINT').MSG2 01540000
         AIF   ('&OFFSETS' EQ 'PRINT').PCK025                           01550000
&B1      SETB  0                                                        01560000
.PCK025  ANOP                                                           01570000
&B3      SETB  1             ASSUME VALUE MATCH                   @L1A  01580000
         AIF   ('&VIEWMATCH' NE '' AND '&VIEWMATCH' NE 'VALUE').MSG5    01590000
.*                                                                      01600000
         AIF   ('&VIEWMATCH' EQ 'VALUE').PCK027                   @L1A  01610000
&B3      SETB  0             BIT MATCH                            @L1A  01620000
.PCK027  ANOP                                                     @L1A  01630000
&OFFLBL  SETC  ''                                                       01640000
         AIF   ('&BASELBL' EQ '').PCK30                                 01650000
&OFFLBL  SETC  '&BASELBL'                                               01660000
.PCK30   ANOP                                                           01670000
         AIF   ('&ACROLEN' EQ '').PCK35                                 01680000
&ACRLEN  SETC  '&ACROLEN'                                               01690000
         AIF   (T'&ACROLEN(1) NE 'N').PCK35 '                      @L1C 01700000
&TEMP    SETA  &ACROLEN(1)                                              01710000
         AIF   (&TEMP LE 8).PCK35                                       01720000
         MNOTE 4,'INVALID VALUE SPECIFIED FOR ACROLEN'                  01730000
&ACRLEN  SETC  '0'                                                      01740000
.PCK35   ANOP                                                           01750000
.*                                                                      01760000
.*       PARAMETER CHECKING COMPLETE                                    01770000
.*                                                                      01780000
&SMAINL  SETC  '        '                                               01790000
         AIF   ('&MAINTLV' EQ '').LBL030                                01800000
&SMAINL  SETC  '&MAINTLV'                                               01810000
         AIF   (K'&MAINTLV LE 8).LBL030 '                          @L1C 01820000
         MNOTE 4,'MAINTLV VALUE TOO LONG. TRUNCATED TO 8 CHARACTERS'    01830000
.LBL030  ANOP  ,                                                   @L1C 01840000
&SACRYN  SETC  'CL8'' '''                                          @L1C 01850000
         AIF   ('&ACRONYM' EQ '').LBL040                                01860000
         AIF   ('&ACRONYM'(1,2) NE 'C''').LBL031                   @L1A 01870000
&SACRYN  SETC  'CL8'.'&ACRONYM'(2,K'&ACRONYM-1) '                  @L1A 01880000
         AIF   ('&ACROLEN' NE '').LBL041                           @L1M 01890000
&TEMP    SETA  K'&ACRONYM-3 '          Length of acronym           @L1A 01900000
         AGO   .LBL034                 Check length of acronym     @L1A 01910000
.LBL031  AIF   ('&ACRONYM'(1,2) NE 'X''').LBL033                   @L1A 01920000
&TEMP    SETA  (K'&ACRONYM-2)/2 '      Length of acronym           @L1A 01930000
&SACRYN  SETC  '&ACRONYM'(3,K'&ACRONYM-3) '                        @L1A 01940000
&SACRYN  SETC  '&SACRYN'.'0000000000000000'(1,16-(2*&TEMP)) '      @L1A 01950000
&SACRYN  SETC  'XL8''&SACRYN'''                                    @L1A 01960000
         AIF   ('&ACROLEN' NE '').LBL041                           @L1M 01970000
         AGO   .LBL034                 Check length of acronym     @L1A 01980000
.LBL033  ANOP  ,                                                   @L1A 01990000
&SACRYN  SETC  'CL8''&ACRONYM'''                                   @L1A 02000000
         AIF   ('&ACROLEN' NE '').LBL041                           @L1M 02010000
&TEMP    SETA  K'&ACRONYM '            Length of acronym           @L1A 02020000
.LBL034  AIF   (&TEMP LE 8).LBL035     Check length of acronym     @L1A 02030000
         MNOTE 4,'ACRONYM VALUE TOO LONG. TRUNCATED TO 8 CHARACTERS'    02040000
&TEMP    SETA  8                                                        02050000
.LBL035  ANOP                                                           02060000
&ACRLEN  SETC  '&TEMP'                                                  02070000
         AGO   .LBL041                                                  02080000
.LBL040  ANOP                                                           02090000
&ACRLEN  SETC  '0'                                                      02100000
.*                                                                      02110000
.*       BEGIN DEFINING A MODEL                                         02120000
.*                                                                      02130000
.LBL041  ANOP  ,                       Begin defining a model      @P1C 02140000
&NAME    DS    0H                      Align new model             @P2C 02150000
&DEFLBL  SETC  'DEF&SYSNDX'                                             02160000
&DEFLBL  DC    &SACRYN                 EBCDIC CTRL BLK ACRONYM     @L1C 02170000
         AIF   ('&HEADER' EQ '').LBL045                                 02180000
         AIF   (K'&HEADER LE 8).LBL043                           ' @L1C 02190000
         MNOTE 4,'HEADER VALUE TOO LONG. TRUNCATED TO 8 CHARACTERS'     02200000
.LBL043  ANOP                                                           02210000
         DC    CL8'&HEADER'            OUTPUT HEADER               @L1C 02220000
         AGO   .LBL046                                                  02230000
.LBL045  ANOP                                                           02240000
         DC    CL8' '                  OUTPUT HEADER (NONE)        @L1C 02250000
.LBL046  ANOP                                                           02260000
         DC    CL8'&SMAINL'            MAINTENANCE LEVEL OF CONTROL    *02270000
                                       BLOCK                       @L1C 02280000
         AIF   ('&CBLEN' EQ '').LBL048                                  02290000
         DC    AL2(&CBLEN)             LENGTH OF CONTROL BLOCK     @L1C 02300000
         AGO   .LBL049                                                  02310000
.LBL048  ANOP                                                           02320000
         DC    AL2(0)                  LENGTH OF CONTROL BLOCK     @L1C 02330000
.LBL049  ANOP                                                           02340000
         AIF   ('&ACROFF' EQ '').LBL050                                 02350000
         DC    AL2(&ACROFF)            OFFSET TO ACRONYM IN CONTROL    *02360000
                                       BLOCK                       @L1C 02370000
         AGO   .LBL053                                                  02380000
.LBL050  ANOP                                                           02390000
         AIF   ('&ACROLBL' EQ '').LBL052                                02400000
         AIF   ('&OFFLBL' NE '').LBL051                                 02410000
         DC    AL2(0)                  OFFSET TO ACRONYM IN CONTROL    *02420000
                                       BLOCK                       @L1C 02430000
         MNOTE 8,'ACROFF PARAMETER REQUIRED BUT NOT SPECIFIED'          02440000
         AGO   .LBL053                                                  02450000
.LBL051  ANOP                                                           02460000
         DC    AL2(&ACROLBL-&OFFLBL)   OFFSET TO ACRONYM IN CONTROL    *02470000
                                       BLOCK                       @L1C 02480000
         AGO   .LBL053                                                  02490000
.LBL052  ANOP                                                           02500000
         DC    AL2(0)                  OFFSET TO ACRONYM           @L1C 02510000
.LBL053  ANOP                                                           02520000
         DC    AL1(&ACRLEN)            LENGTH OF ACRONYM           @L1C 02530000
         DC    AL1(&VALULLN)           LABEL LENGTH                @L1C 02540000
         DC    AL1(&STRTCOL)           START COLUMN OR LEFT MARGIN @L1C 02550000
         DC    AL1(&LBLSPC)            NUMBER OF COLUMNS BETWEEN       *02560000
                                       LABELS                      @L1C 02570000
         DC    AL1(B'&B1&B2&B3.00000'+&VARYLBL)  FLAGS             @L1C 02580000
         DC    AL1(&FIRTFLD-&DEFLBL)   OFFSET TO FIRST FIELD DESC  @L1C 02590000
         DC    AL1(&LEVEL)             MODEL LEVEL                 @L1C 02600000
         DC    X'00'                   RESERVED                    @L1C 02610000
&FIRSTSW SETB  1                                                        02620000
         MEXIT                                                          02630000
.*                                                                      02640000
.MSG1    ANOP                                                           02650000
         MNOTE 4,'INVALID VALUE SPECIFIED FOR PREFIX'                   02660000
         AGO   .PCK020                                                  02670000
.MSG2    ANOP                                                           02680000
         MNOTE 4,'INVALID VALUE SPECIFIED FOR OFFSETS'                  02690000
         AGO   .PCK025                                                  02700000
.MSG5    ANOP                                                      @L1A 02710000
         MNOTE 4,'INVALID VALUE SPECIFIED FOR VIEWMATCH'           @L1A 02720000
         AGO   .PCK027                                             @L1A 02730000
.MSG3    ANOP                                                           02740000
    MNOTE 8,'NO DEFINITION CURRENTLY IN PROGRESS - TERMINATION IGNORED' 02750000
         MEXIT                                                          02760000
.MSG4    ANOP                                                           02770000
    MNOTE 8,'DEFINITION CURRENTLY IN PROGRESS - NEW DEFINITION IGNORED' 02780000
         MEXIT                                                          02790000
         MEND  ,                                                     */ 02800000
*                                                                       02810000
*%BLSQMDEF:                         /* Define model header       @L2C*/ 02820000
*   MACRO KEYS(ACROFF,ACROLBL,ACROLEN,ACRONYM,BASELBL,CBLEN,HEADER,     02830000
*       LBLSPC,MAINTLV,OFFSETS,PREFIX,STRTCOL,VIEWMATCH);               02840000
*                                                                       02850000
*/* ================================================================ */ 02860000
*/* Define Macro-Variables                                           */ 02870000
*/* ================================================================ */ 02880000
*                                                                       02890000
*   DECLARE                         /* Macro variables               */ 02900000
*     ASAXMAC_IsItPLX CHARACTER EXTERNAL, /* ASAXMAC interface   @H1A*/ 02910000
*     ELSQMDEFFLAG CHARACTER EXTERNAL, /* Flag constant base     @L1A*/ 02920000
*     ELSQMDEFNAME CHARACTER EXTERNAL, /* Unique name base       @L1A*/ 02930000
*     ELSQMDEFOFFL CHARACTER EXTERNAL, /* Offset label base      @L1A*/ 02940000
*     ELSQMDEFSRCI CHARACTER EXTERNAL, /* Multiple source index  @L1A*/ 02950000
*     ELSQMDEFLLEN FIXED EXTERNAL,  /* Maximum label length      @L1A*/ 02960000
*     ELSQMDEFPLEN FIXED EXTERNAL,  /* Prefix length + 1         @L1A*/ 02970000
*     CLMETRIC CHARACTER INTERNAL,  /* Length metric             @H1A*/ 02980000
*     F1       FIXED INTERNAL;      /* Utility                   @L1P*/ 02990000
*   DEACTIVATE                      /* Prevent accidents         @L1A*/ 03000000
*       CLMETRIC,                   /*                           @H1C*/ 03010000
*       ELSQMDEFFLAG,ELSQMDEFNAME,ELSQMDEFOFFL,ELSQMDEFSRCI;            03020000
*   ANSWER('?ASAXMAC ISITPLX(1,4,1);'); /*                       @H1A*/ 03030000
*   IF ASAXMAC_IsItPLX = 'YES' THEN /* Use SIZE                  @H1A*/ 03040000
*     CLMETRIC = 'SIZE(';           /*                           @H1A*/ 03050000
*   ELSE                            /* Use LENGTH                    */ 03060000
*     CLMETRIC = 'LENGTH(';         /*                           @H1A*/ 03070000
*                                                                       03080000
*/* ================================================================ */ 03090000
*/* Produce Declaration                                              */ 03100000
*/* ================================================================ */ 03110000
*                                                                       03120000
*   IF TRANSLATE(MACLIST(1)) = 'END' THEN /* Mark end of model   @L3C*/ 03130000
*                                                                       03140000
*     /***************************************************************/ 03150000
*     /*                                                             */ 03160000
*     /* Mark end of model                                           */ 03170000
*     /*                                                             */ 03180000
*     /***************************************************************/ 03190000
*                                                                       03200000
*     DO;                           /* Mark end of model         @L1A*/ 03210000
*       ANSWER('2 END#MODEL BIT(8) INITIAL(''00''X),/*BLSQMDEF'!!       03220000
*           MACLIST!!' '!!MACKEYS!!'*/') COLUMN(8); /*           @L1A*/ 03230000
*       ANSWER(ELSQMDEFNAME!!'FLAG BIT(8) CONSTANT('''!!ELSQMDEFFLAG!!  03240000
*           '''B),/*Model header flags*/') COLUMN(7); /*         @L1A*/ 03250000
*       ANSWER(ELSQMDEFNAME!!'LLEN CONSTANT('!!CHAR(ELSQMDEFLLEN)!!     03260000
*           ');/*Maximum label length*/') COLUMN(7); /*          @L1A*/ 03270000
*       ANSWER('?BLRDEFEP;');       /* Process deferred DCLs     @L2P*/ 03280000
*     END;                          /* Mark end of model         @L1A*/ 03290000
*   ELSE                            /* Begin model               @L1A*/ 03300000
*                                                                       03310000
*     /***************************************************************/ 03320000
*     /*                                                             */ 03330000
*     /* Begin a model                                               */ 03340000
*     /*                                                             */ 03350000
*     /***************************************************************/ 03360000
*                                                                       03370000
*     DO;                           /* Begin model               @L1A*/ 03380000
*       ANSWER('?BLRDEFEP;');       /* Process deferred DCLs     @L2P*/ 03390000
*       ELSQMDEFNAME = 'BLSQMDEF' !! MACINDEX; /* Unique name    @L1A*/ 03400000
*       ELSQMDEFOFFL = BASELBL(1);  /* Offset label base         @L1A*/ 03410000
*       ELSQMDEFSRCI = '0';         /* Multiple source index     @L1A*/ 03420000
*                                                                       03430000
*       /*************************************************************/ 03440000
*       /*                                                           */ 03450000
*       /* Process prefix length                                     */ 03460000
*       /*                                                           */ 03470000
*       /*************************************************************/ 03480000
*                                                                       03490000
*       ELSQMDEFLLEN = 5;           /* Maximum label length      @L1A*/ 03500000
*       ELSQMDEFPLEN = 4;           /* Prefix length + 1         @L1A*/ 03510000
*       IF LENGTH(PREFIX(1)) > 0 THEN /* Explicit prefix length  @L1A*/ 03520000
*         DO;                       /* Explicit prefix length    @L1A*/ 03530000
*           F1 = FIXED(PREFIX(1));  /* Prefix length             @L1A*/ 03540000
*           ELSQMDEFLLEN = 8 - F1;  /* Maximum label length      @L1A*/ 03550000
*           ELSQMDEFPLEN = F1 + 1;  /* Prefix length + 1         @L1A*/ 03560000
*         END;                      /* Explicit prefix length    @L1A*/ 03570000
*                                                                       03580000
*       /*************************************************************/ 03590000
*       /*                                                           */ 03600000
*       /* Declare prefix length                                     */ 03610000
*       /*                                                           */ 03620000
*       /*************************************************************/ 03630000
*                                                                       03640000
*       ANSWER('DECLARE/*BLSQMDEF #MD97344*/'); /*               @H1C*/ 03650000
*       ANSWER('/*BLSQMDEF'!!MACLIST!!' '!!MACKEYS!!'*/') COLUMN(7);    03660000
*                                   /*                           @L2A*/ 03670000
*       ANSWER('1 '!!MACLIST(1)!!' '!!MACLIST(2)!!                      03680000
*           ' STATIC LOCAL BOUNDARY(WORD),/*BLSQMDEF #MD97344*/')       03690000
*           COLUMN(7);              /*                           @H1C*/ 03700000
*       ANSWER('2 MODEL#HEADER BOUNDARY(WORD),/*Model header*/') COLUMN 03710000
*           (9);                    /*                           @L1A*/ 03720000
*                                                                       03730000
*       /*************************************************************/ 03740000
*       /*                                                           */ 03750000
*       /* Process acronym                                           */ 03760000
*       /*                                                           */ 03770000
*       /*************************************************************/ 03780000
*                                                                       03790000
*       ANSWER('3 ACRONYM CHARACTER(8) INITIAL(') COLUMN(9); /*  @L1A*/ 03800000
*       IF LENGTH(ACRONYM(1)) > 0 THEN /*                        @L1A*/ 03810000
*         ANSWER(ACRONYM(1));       /*                           @L1A*/ 03820000
*       ELSE                                                            03830000
*         ANSWER(''' ''');          /*                           @L1A*/ 03840000
*       ANSWER('),/*Control block acronym*/'); /*                @L1A*/ 03850000
*                                                                       03860000
*       /*************************************************************/ 03870000
*       /*                                                           */ 03880000
*       /* Process label                                             */ 03890000
*       /*                                                           */ 03900000
*       /*************************************************************/ 03910000
*                                                                       03920000
*       ANSWER('3 OUTPUT#HEADER CHARACTER(8) INITIAL(') COLUMN(9); /*   03930000
*                                                                @L1A*/ 03940000
*       IF LENGTH(HEADER(1)) > 0 THEN /*                         @L1A*/ 03950000
*         ANSWER(HEADER(1));        /*                           @L1A*/ 03960000
*       ELSE                                                            03970000
*         ANSWER(''' ''');          /*                           @L1A*/ 03980000
*       ANSWER('),/*Formatted output header*/'); /*              @L1A*/ 03990000
*                                                                       04000000
*       /*************************************************************/ 04010000
*       /*                                                           */ 04020000
*       /* Process maintenance level                                 */ 04030000
*       /*                                                           */ 04040000
*       /*************************************************************/ 04050000
*                                                                       04060000
*       ANSWER('3 MODEL#MAINTENANCE#LEVEL CHARACTER(8) INITIAL(')       04070000
*           COLUMN(9);              /*                           @L1A*/ 04080000
*       IF LENGTH(MAINTLV(1)) > 0 THEN /*                        @L1A*/ 04090000
*         ANSWER(MAINTLV(1));       /*                           @L1A*/ 04100000
*       ELSE                                                            04110000
*         ANSWER(''' ''');          /*                           @L1A*/ 04120000
*       ANSWER('),/*Maintenance level of this model*/'); /*      @L1A*/ 04130000
*                                                                       04140000
*       /*************************************************************/ 04150000
*       /*                                                           */ 04160000
*       /* Process control block length                              */ 04170000
*       /*                                                           */ 04180000
*       /*************************************************************/ 04190000
*                                                                       04200000
*       ANSWER('3 CONTROL#BLOCK#LENGTH UNSIGNED BINARY(15) INITIAL(')   04210000
*           COLUMN(9);              /*                           @L1A*/ 04220000
*       IF LENGTH(CBLEN(1)) > 0 THEN /* Length specified         @L1A*/ 04230000
*         ANSWER(CBLEN(1));         /*                           @L1A*/ 04240000
*       ELSE                        /* No length                     */ 04250000
*         ANSWER('0');              /*                           @L1A*/ 04260000
*       ANSWER('),/*Control block length*/') COLUMN(33); /*      @L1A*/ 04270000
*                                                                       04280000
*       /*************************************************************/ 04290000
*       /*                                                           */ 04300000
*       /* Process acronym offset                                    */ 04310000
*       /*                                                           */ 04320000
*       /*************************************************************/ 04330000
*                                                                       04340000
*       ANSWER('3 ACRONYM#OFFSET SIGNED BINARY(15) INITIAL(') COLUMN(9) 04350000
*           ;                       /*                           @L1A*/ 04360000
*       IF LENGTH(ACROFF(1)) > 0 THEN /* Length specified        @L1A*/ 04370000
*         ANSWER(ACROFF(1));        /*                           @L1A*/ 04380000
*       ELSE                        /* No length                     */ 04390000
*         IF LENGTH(ACROLBL(1)) > 0 THEN /* Acronym label named  @L1A*/ 04400000
*           IF LENGTH(BASELBL(1)) > 0 THEN /* Base label named   @L1A*/ 04410000
*             ANSWER('OFFSET('!!ACROLBL(1)!!','!!BASELBL(1)!!')'); /*   04420000
*                                      Offset from label         @L1A*/ 04430000
*           ELSE                    /* No base label                 */ 04440000
*             ANSWER('OFFSET('!!ACROLBL(1)!!')'); /*             @L1A*/ 04450000
*         ELSE                      /* No acronym label              */ 04460000
*           ANSWER('0');            /* Default offset            @L1A*/ 04470000
*       ANSWER('),/*Acronym offset*/'); /*                       @L1A*/ 04480000
*                                                                       04490000
*       /*************************************************************/ 04500000
*       /*                                                           */ 04510000
*       /* Process acronym length                                    */ 04520000
*       /*                                                           */ 04530000
*       /*************************************************************/ 04540000
*                                                                       04550000
*       ANSWER('3 ACRONYM#LENGTH UNSIGNED BINARY(8) INITIAL(') COLUMN(9 04560000
*           );                      /*                           @L1A*/ 04570000
*       IF LENGTH(ACROLEN(1)) > 0 THEN /* Length specified       @L1A*/ 04580000
*         ANSWER(ACROLEN(1));       /*                           @L1A*/ 04590000
*       ELSE                        /* No length                     */ 04600000
*         IF LENGTH(ACROLBL(1)) > 0 THEN /* Acronym label named  @L1A*/ 04610000
*           ANSWER(CLMETRIC!!ACROLBL(1)!!')'); /*                @H1C*/ 04620000
*         ELSE                      /* No acronym label              */ 04630000
*           IF LENGTH(ACRONYM(1)) > 0 THEN /*                    @L1A*/ 04640000
*             ANSWER(CLMETRIC!!ACRONYM(1)!!')'); /*              @H1C*/ 04650000
*           ELSE                    /* No acronym                    */ 04660000
*             ANSWER('0');          /*                           @L1A*/ 04670000
*       ANSWER('),/*Acronym length*/'); /*                       @L1A*/ 04680000
*                                                                       04690000
*       /*************************************************************/ 04700000
*       /*                                                           */ 04710000
*       /* Process label length                                      */ 04720000
*       /*                                                           */ 04730000
*       /*************************************************************/ 04740000
*                                                                       04750000
*       ANSWER('3 LABEL#LENGTH UNSIGNED BINARY(8) INITIAL('!!           04760000
*           ELSQMDEFNAME!!'LLEN),/*Maximum length of label*/') COLUMN(9 04770000
*           );                      /*                           @L1A*/ 04780000
*                                                                       04790000
*       /*************************************************************/ 04800000
*       /*                                                           */ 04810000
*       /* Process begin column                                      */ 04820000
*       /*                                                           */ 04830000
*       /*************************************************************/ 04840000
*                                                                       04850000
*       ANSWER('3 BEGIN#COLUMN UNSIGNED BINARY(8) INITIAL(') COLUMN(9); 04860000
*                                   /*                           @L1A*/ 04870000
*       IF LENGTH(STRTCOL(1)) > 0 THEN /* Column specified       @L1A*/ 04880000
*         ANSWER(STRTCOL(1));       /*                           @L1A*/ 04890000
*       ELSE                        /* No column                     */ 04900000
*         ANSWER('0');              /*                           @L1A*/ 04910000
*       ANSWER('),/*Begin column*/'); /*                         @L1A*/ 04920000
*                                                                       04930000
*       /*************************************************************/ 04940000
*       /*                                                           */ 04950000
*       /* Process column distance                                   */ 04960000
*       /*                                                           */ 04970000
*       /*************************************************************/ 04980000
*                                                                       04990000
*       ANSWER('3 COLUMN#WIDTH UNSIGNED BINARY(8) INITIAL(') COLUMN(9); 05000000
*                                   /*                           @L1A*/ 05010000
*       IF LENGTH(LBLSPC(1)) > 0 THEN /* Width specified         @L1A*/ 05020000
*         ANSWER(LBLSPC(1));        /*                           @L1A*/ 05030000
*       ELSE                        /* No width                      */ 05040000
*         ANSWER('0');              /*                           @L1A*/ 05050000
*       ANSWER('),/*The usual interpretation is the number of '!!       05060000
*           'columns used for one label and the data associated '!!     05070000
*           'with it.  See the published documentation regarding '!!    05080000
*           'special, contextual interpretations.*/'); /*        @L1A*/ 05090000
*                                                                       05100000
*       /*************************************************************/ 05110000
*       /*                                                           */ 05120000
*       /* Process model header flags                                */ 05130000
*       /*                                                           */ 05140000
*       /*************************************************************/ 05150000
*                                                                       05160000
*       ELSQMDEFFLAG = '00000000';  /* Flag constant base        @L1A*/ 05170000
*       IF TRANSLATE(OFFSETS(1)) = 'PRINT' THEN /* OFFSETS(PRINT)       05180000
*                                                                @L3C*/ 05190000
*         ELSQMDEFFLAG = '10000000'; /* Flag constant base       @L1A*/ 05200000
*       IF TRANSLATE(VIEWMATCH(1)) = 'VALUE' THEN /* VIEWMATCH(VALUE)   05210000
*                                                                @L3C*/ 05220000
*         ELSQMDEFFLAG = ELSQMDEFFLAG(1:1) !! '0100000'; /* Flag        05230000
*                                      constant base             @L1A*/ 05240000
*       ANSWER('3 FLAG BIT(8) INITIAL('!!ELSQMDEFNAME!!                 05250000
*           'FLAG),/*Model header flags*/') COLUMN(9); /*        @L1A*/ 05260000
*       ANSWER('4 FLAG#PRINT#OFFSETS BIT(1),/*Print data offsets*/')    05270000
*           COLUMN(10);             /*                           @L1A*/ 05280000
*       ANSWER(                                                         05290000
*           '4 FLAG#VARIABLE#ARRAY BIT(1),/*Variable array described*/' 05300000
*           ) COLUMN(10);           /*                           @L1A*/ 05310000
*       ANSWER('4 FLAG#VIEWMATCH#VALUE BIT(1),/*Match on view value*/') 05320000
*           COLUMN(10);             /*                           @L1A*/ 05330000
*       ANSWER('4 * BIT(5),/*Reserved*/') COLUMN(10); /*         @L1A*/ 05340000
*                                                                       05350000
*       /*************************************************************/ 05360000
*       /*                                                           */ 05370000
*       /* Process first entry offset                                */ 05380000
*       /*                                                           */ 05390000
*       /*************************************************************/ 05400000
*                                                                       05410000
*       ANSWER('3 FIRST#BLSQMFLD#OFFSET POINTER(8) INITIAL(OFFSET('!!   05420000
*           MACLIST(1)!!'.END#HEADER,'!!MACLIST(1)!!                    05430000
*           ')),/*Offset to first BLSQMFLD macro expansion*/') COLUMN(9 05440000
*           );                      /*                           @L1A*/ 05450000
*                                                                       05460000
*       /*************************************************************/ 05470000
*       /*                                                           */ 05480000
*       /* Process definition level                                  */ 05490000
*       /*                                                           */ 05500000
*       /*************************************************************/ 05510000
*                                                                       05520000
*       ANSWER('3 DEFINITION#LEVEL UNSIGNED BINARY(8) INITIAL(1),'!!    05530000
*           '/*Version of BLSQMDEF and BLSQMFLD macro expansions*/')    05540000
*           COLUMN(9);              /*                           @L1A*/ 05550000
*       ANSWER(                                                         05560000
*           '3 * BIT(8) BOUNDARY(WORD,4) INITIAL(''00''X),/*Reserved*/' 05570000
*           ) COLUMN(9);            /*                           @L1A*/ 05580000
*       ANSWER(                                                         05590000
*'3 END#HEADER CHARACTER(0) BOUNDARY(WORD),/*BLSQMDEF #MD97344*/')      05600000
*           COLUMN(9);              /*                           @H1C*/ 05610000
*     END;                          /* Begin model               @L1A*/ 05620000
*   %END BLSQMDEF;                  /* Define model header       @L1A*/ 05630000
