*        %GOTO PCFPRO   ;         /* Bilingual header                   00050000
         MACRO                                                          00100000
         BPXYPCF   &DSECT=MEANINGLESS,&LIST=YES               8@D1A     00111100
         GBLB  &PCF411                                                  00122200
         AIF   (&PCF411 EQ 1).E411                                      00133300
&PCF411 SETB   1                                                        00144400
         AIF   ('&LIST' EQ 'YES').A411                                  00155500
         PUSH  PRINT  BPXYPCF:  Command values specified on             00166600
         PRINT OFF              pathconf and fpathconf system calls     00177700
         AGO   .A411                                                    00188800
*                                  */                                   00200000
*%PCFPRO  : ;                                                           00250000
*/****START OF SPECIFICATIONS****************************************** 00300000
*                                                                       00350000
*    $MAC (BPXYPCF) COMP(SCPX1) PROD(BPX):                              00400000
*                                                                       00450000
*01* MACRO NAME: BPXYPCF                                                00500000
*                                                                       00550000
*01* DSECT NAME: PCFFLAGS                                               00600000
*                                                                       00650000
*01* DESCRIPTIVE NAME: Command values specified on pathconf             00700000
*                      and fpathconf system calls                       00750000
*                                                                       00800000
*02*   ACRONYM: PCF                                                     00850000
**/                                                                     00900000
*/*01* PROPRIETARY STATEMENT=                                        */ 00950000
*/***PROPRIETARY_STATEMENT********************************************/ 01000000
*/*                                                                  */ 01050000
*/*                                                                  */ 01100000
*/* LICENSED MATERIALS - PROPERTY OF IBM                             */ 01150000
*/* THIS MACRO IS "RESTRICTED MATERIALS OF IBM"                      */ 01200000
*/* 5694-A01 (C) COPYRIGHT IBM CORP. 1993, 2003                      */ 01250000
*/*                                                                  */ 01350000
*/* STATUS= HBB7709                                                  */ 01400000
*/*                                                                  */ 01450000
*/***END_OF_PROPRIETARY_STATEMENT*************************************/ 01500000
*/*                                                                     01550000
*                                                                       01556200
*01* EXTERNAL CLASSIFICATION:  GUPI                                     01562500
*01* END OF EXTERNAL CLASSIFICATION:                                    01575000
*                                                                       01587500
*01* FUNCTION:                                                          01600000
*                                                                       01650000
*      The PCF defines the command values for the pathconf and          01700000
*      fpathconf system calls                                           01750000
*                                                                       01800000
*                                                                       01850000
*01* METHOD OF ACCESS:                                                  01900000
*                                                                       01950000
*02*   PL/X:                                                            02000000
*                                                                       02050000
*        %INCLUDE SYSLIB(BPXYPCF)                                       02100000
*                                                                       02150000
*02*   ASM:                                                             02200000
*        BPXYMSG DSECT=YES/NO                                           02250004
*                                                                       02350000
*01* SIZE: None - This defines constants                                02400000
*                                                                       02450000
*01* POINTED TO BY: N/A                                                 02500000
*                                                                       02550000
*01* CREATED BY: N/A                                                    02600000
*                                                                       02650000
*01* DELETED BY: N/A                                                    02700000
*                                                                       02750000
*01* STORAGE ATTRIBUTES:                                                02800000
*02*   SUBPOOL/DATASPACE:  N/A                                          02850000
*02*   KEY:                N/A                                          02900000
*02*   RESIDENCY:          N/A                                          02950000
*                                                                       03000000
*01* FREQUENCY: Included with compile                                   03050000
*                                                                       03100000
*01* SERIALIZATION: N/A                                                 03150000
*                                                                       03200000
*01* DEPENDENCIES: None                                                 03250000
*                                                                       03300000
*01* COMPONENT: OpenMVS (SCPX1)                                         03350000
*                                                                       03400000
*01* DISTRIBUTION LIBRARY:  AMACLIB                                     03450000
*                                                                       03500000
*01* EYE-CATCHER: None                                                  03550000
*02*   OFFSET:                                                          03600000
*02*   LENGTH:                                                          03650000
*                                                                       03700000
*01* CHANGE-ACTI3ITY:                                                   03750000
*                                                                       03800000
* $L0=POSIXXF  HOM1110 921201 PDJS: OpenMVS Initial Release             03830000
* $D1=DL70019  HOM1110 921201 PDJM: Assembler macro fixup               03860000
* $P2=PL70366  HOM1110 920908 PDSV: Macro commentary                    03890000
* $P3=PL70597  HOM1110 930104 PDJM: Use "OpenMVS"                       03920000
* $D2=DSYA214  JBB6604 961120 PDJT  NFS V3 Protocols          (PSY0380) 03930000
* $D3=DCA0309  HBB6608 980901 PDMX: Dcr A309.08 Sysplex support         03935000
* $D4=DYM0525  HBB7706 010112 PD2R: DCR A525.01 - ACLS support          03937500
*    =DYM0525  HBB7706 010513 PDJS: DCR A525.01 - ACLS support sysplex  03938300
* $P4=PYM0301  HBB7706 010528 PDJS: Fix PCFGMAX value                   03939100
* $P5=PYN0220  HBB7708 020301 PDFO: Bilingual fixup                     03939500
* $P6=ME05333  HBB7730 060112 PDMJ: Recognize DSECT=NO                  03939605
*                                                                       03940000
****END OF SPECIFICATIONS*********************************************/ 03950000
*        %GOTO PCFPLS   ;         /* Bilingual header                   04050000
.A411    ANOP  ,                                                        04100000
** BPXYPCF:  Command values                                             04150000
**  Used By: FPC PCF                                                    04200000
PC_CHOWN_RESTRICTED  EQU 1        _POSIX_CHOWN_RESTRICTED option        04350000
PC_LINK_MAX          EQU 2        LINK_MAX option                       04400000
PC_MAX_CANON         EQU 3        _POSIX_MAX_CANON option               04450000
PC_MAX_INPUT         EQU 4        _POSIX_MAX_INPUT option               04500000
PC_NAME_MAX          EQU 5        NAME_MAX option                       04550000
PC_NO_TRUNC          EQU 6        _POSIX_NO_TRUNC option                04600000
PC_PATH_MAX          EQU 7        PATH_MAX option                       04650000
PC_PIPE_BUF          EQU 8        PIPE_BUF option                       04700000
PC_VDISABLE          EQU 9        _POSIX_VDISABLE option                04750000
PC_ACL               EQU 10       _PC_ACL option                 @D4A   04750100
PC_ACL_ENTRIES_MAX   EQU 11       _PC_ACL_ENTRIES_MAX            @P4A   04750200
PC_CASE              EQU 100      Case Flags                     @D2A   04750300
*                                                                       04750600
PCFGMAX              EQU 11       Max _POSIX_ value              @P4C   04750700
*                                                                       04750800
*  Pathconf Case Flags - vn_pathconf(PC_CASE) returned value     @D2A   04750900
         AIF   ('&DSECT' EQ 'NO').B411                           @P6A   04751006
PCCASEFLAGS          DSECT ,                                     @D2A   04751200
         AGO   .C411                                             @P6A   04751306
.B411    ANOP  ,                                                 @P6A   04751406
PCCASEFLAGS          DS    0F                                    @P6A   04751506
.C411    ANOP  ,                                                 @P6A   04751606
                     DS    XL3                                   @D2A   04751702
PCCASEFLAGSBYTE      DS    XL1                                   @D2A   04751800
PCCASEINSENSITIVE    EQU   X'02'          0=SENSITIVE,1=NOT      @D2A   04752100
PCCASENONPRESERVING  EQU   X'01'          0=PERSERVING,1=NOT     @D2A   04752400
*                                                                       04752700
*  Pathconf File Group - for v_pathconf(BPX1VPC)                 @D2A   04753000
         AIF   ('&DSECT' EQ 'NO').B412                           @P6A   04753106
PCFG                 DSECT ,                                     @D2A   04753300
         AGO   .C412                                             @P6A   04753406
.B412    ANOP  ,                                                 @P6A   04753506
PCFG                 DS    0F                                    @P6A   04753606
.C412    ANOP  ,                                                 @P6A   04753706
PCFGLINKMAX          DS    F              LINK_MAX               @D2A   04753800
PCFGNAMEMAX          DS    F              NAME_MAX               @D2A   04753900
PCFGPCFLAGS          DS    XL1            FLAGS:                 @D2A   04754200
PCFGNOTRUNC           EQU   X'80'            POSIX_NO_TRUNC      @D2A   04754500
PCFGCHOWNRSTD         EQU   X'40'            CHOWN RESTRICTED    @D2A   04754800
PCFGCASEINSENSITIVE   EQU   X'20'            0=SENSITIVE,1=NOT   @D2A   04755100
PCFGCASENONPRESERVING EQU   X'10'            0=PERSERVING,1=NOT  @D2A   04755400
PCFGSECACL            EQU   X'08'            0=ACLSUPPORT,1=NONE @D4A   04755500
                     DS    XL3                                   @D2A   04755700
*                                                                       04756000
** BPXYPCF End                                                          04758300
         SPACE 3                                                        04766600
         AIF   ('&LIST' EQ 'YES').E411                        6@D1A     04774900
         POP   PRINT                                                    04783200
.E411    ANOP  ,                                                        04791500
         MEND  ,                  Terminating PL/X comment           */ 04841500
*%PCFPLS : ;                                                            04891500
*                                                                       04941500
*DCL                                                                    04991500
*PC_CHOWN_RESTRICTED Fixed(32) Constant(1), /*   _POSIX_CHOWN_RSTD  */  05041500
*PC_LINK_MAX         Fixed(32) Constant(2), /*   LINK_MAX           */  05091500
*PC_MAX_CANON        Fixed(32) Constant(3), /*   _POSIX_MAX_CANON   */  05141500
*PC_MAX_INPUT        Fixed(32) Constant(4), /*   _POSIX_MAX_INPUT   */  05191500
*PC_NAME_MAX         Fixed(32) Constant(5), /*   NAME_MAX           */  05241500
*PC_NO_TRUNC         Fixed(32) Constant(6), /*   _POSIX_NO_TRUNC    */  05291500
*PC_PATH_MAX         Fixed(32) Constant(7), /*   PATH_MAX           */  05341500
*PC_PIPE_BUF         Fixed(32) Constant(8), /*   PIPE_BUF           */  05391500
*PC_VDISABLE         Fixed(32) Constant(9), /*   _POSIX_VDISABLE    */  05441500
*PC_ACL              Fixed(32) Constant(10),/*   _POSIX_ACL    2@D4A*/  05491500
*PC_ACL_ENTRIES_MAX  Fixed(32) Constant(11);/*_POSIX_ACL_ENTRIES_MAX*/  05541500
*                                                                       05591500
*Dcl           /* Max POSIX Value - update when new codes added     */  05641500
* PCFGMAX            Fixed(32) Constant(11);/* Case Flags       @P4C*/  05691500
*                                                                       05741500
*Dcl           /* Non-POSIX Extensions                          @D2A*/  05791500
* PC_CASE            Fixed(32) Constant(100); /* Case Flags     @D2A*/  05841500
*                                                                       05891500
*/*-------------------------------------------------------------@D2A*/  05941500
*/*  Pathconf Case Flags - vn_pathconf(PC_CASE) returned value  @D2A*/  05991500
*/*-------------------------------------------------------------@D2A*/  06041500
*Dcl 1 PcCaseFlags   Fixed(32),                               /*@D2A*/  06091500
*      3   *            Bit(30),                              /*@D2A*/  06141500
*      3 PcCaseInsensitive   Bit(1),     /* 0=sensitive,1=not   @D2A*/  06191500
*      3 PcCaseNonPreserving Bit(1);     /* 0=perserving,1=not  @D2A*/  06241500
*                                                                       06291500
*/*-------------------------------------------------------------@D2A*/  06341500
*/*  Pathconf File Group - for v_pathconf(BPX1VPC)              @D2A*/  06391500
*/*-------------------------------------------------------------@D2A*/  06441500
*Dcl 1 PCFG Based Bdy(Word),        /* (Matches MtabPathConf)   @D2A*/  06491500
*      5 PcfgLinkmax    Fixed(32),  /* link_max                 @D2A*/  06541500
*      5 PcfgNamemax    Fixed(32),  /* name_max                 @D2A*/  06591500
*      5 PcfgPCFlags    Bit(8),     /* Flags:                   @D2A*/  06641500
*        7 PcfgNotrunc    Bit(1),        /* posix_No_trunc      @D2A*/  06691500
*        7 PcfgChownRstd  Bit(1),        /* Chown restricted    @D2A*/  06741500
*        7 PcfgCaseInsensitive Bit(1),   /* 0=sensitive,1=not   @D2A*/  06791500
*        7 PcfgCaseNonPreserving Bit(1), /* 0=perserving,1=not  @D2A*/  06841500
*        7 PcfgSecAcl   Bit(1),          /* 1=supported,0=not   @D4A*/  06891500
*        7   *            Bit(3),                             /*@D2A*/  06941500
*      5 *              Char(3);                              /*@D2A*/  06991500
*                                                                       07041500
*                                                                       07091500
