*        %GOTO AIOPRO   ;         /* Bilingual header                   00010000
         MACRO                                                          00020000
         BPXYAIO   &DSECT=YES,&LIST=YES                                 00030000
         GBLB  &AIO411                                                  00040000
         GBLC  &SYSAM64       Var set by SYSSTATE AMODE64=YES     @P4A  00050000
         AIF   (&AIO411 EQ 1).E411                                      00060000
&AIO411 SETB   1                                                        00070000
         AIF   ('&LIST' EQ 'YES').A411                                  00080000
         PUSH  PRINT  BPXYAIO:  Asyncio parameter block specified       00090000
         PRINT OFF              on BPX1AIO(asyncio) system call         00100000
         AGO   .A411                                                    00110000
*                                  */                                   00120000
*%AIOPRO  : ;                                                           00130000
*/****START OF SPECIFICATIONS****************************************** 00140000
*                                                                       00150000
*    $MAC (BPXYAIO)  COMP(SCPX1) PROD(BPX):                             00160000
*                                                                       00170000
*01* MACRO NAME: BPXYAIO                                                00180000
*                                                                       00190000
*01* DSECT NAME: AIO                                                    00200000
*                                                                       00210000
*01* DESCRIPTIVE NAME: Async I/O Control Block specified on             00220000
*                      BPX1AIO(AsyncIO) system call.                    00230000
*                                                                       00240000
*02*   ACRONYM: AIOCB                                                   00250000
**/                                                                     00260000
*/*01* PROPRIETARY STATEMENT=                                        */ 00270000
*/***PROPRIETARY_STATEMENT********************************************/ 00280000
*/*                                                                  */ 00290000
*/*                                                                  */ 00300000
*/* LICENSED MATERIALS - PROPERTY OF IBM                             */ 00310000
*/* 5694-A01 COPYRIGHT IBM CORP. 1997, 2015                          */ 00320002
*/*                                                                  */ 00330000
*/* STATUS= HBB77A0                                                  */ 00340002
*/*                                                                  */ 00350000
*/***END_OF_PROPRIETARY_STATEMENT*************************************/ 00360000
*/*                                                                     00370000
*                                                                       00380000
*01* EXTERNAL CLASSIFICATION:  GUPI                                     00390000
*01* END OF EXTERNAL CLASSIFICATION:                                    00400000
*                                                                       00410000
*01* FUNCTION:                                                          00420000
*                                                                       00430000
*      The AIOCB defines the input parameters needed by the             00440000
*      BPX1AIO(AsyncIO) system call.                                    00450000
*                                                                       00460000
*                                                                       00470000
*01* METHOD OF ACCESS:                                                  00480000
*                                                                       00490000
*02*   PL/X:                                                            00500000
*                                                                       00510000
*        %INCLUDE SYSLIB(BPXYAIO)                                       00520000
*        By default, the AIO is based on AioPtr. If                     00530000
*        other basing is desired, use %AIOBASE='BASED(XXXXXX)'.         00540000
*        If %AIOBASE='BASED(AioPtr)' is coded, a Declare for            00550000
*        AioPtr is also generated.                                      00560000
*                                                                       00570000
*02*   ASM:                                                             00580000
*        SYSSTATE  AMODE64=YES  if you are in AMODE(64)                 00590000
*                                                                       00600000
*        With DSECT=YES, a DSECT is produced and "USING AIO,reg"        00610000
*        is required for addressability.  Here "reg" contains the       00620000
*        address of AIO#LENGTH bytes of storage.                        00630000
*        With DSECT=NO, storage is allocated in line and                00640000
*        addressability is provided thru that DSECT or CSECT.           00650000
*        the default is DSECT=YES.                                      00660000
*                                                                       00670000
*01* SIZE: AIO#LENGTH                                                   00680000
*                                                                       00690000
*01* POINTED TO BY: AioPtr                                              00700000
*                                                                       00710000
*01* CREATED BY: Caller of system call                                  00720000
*                                                                       00730000
*01* DELETED BY: Caller of system call                                  00740000
*                                                                       00750000
*01* STORAGE ATTRIBUTES:                                                00760000
*02*   SUBPOOL/DATASPACE:                                               00770000
*02*   KEY:                N/A                                          00780000
*02*   RESIDENCY:          N/A                                          00790000
*                                                                       00800000
*01* FREQUENCY: 1 per call to Asyncio()                                 00810000
*                                                                       00820000
*01* SERIALIZATION: N/A                                                 00830000
*                                                                       00840000
*01* DEPENDENCIES: Once created, this control block must remain         00850000
*                  addressable for the entire life of the asynchronous  00860000
*                  request.                                             00870000
*                                                                       00880000
*01* NOTES: This control block has some fields defined for future       00890000
*           consideration of POSIX and/or for future use with files.    00900000
*                                                                       00910000
*           Consult the documentation for the asyncio(BPX1AIO) function 00920000
*           for the current list of supported fields.                   00930000
*                                                                       00940000
*           AMODE(64) Usage - - - - - - - - - - - - - - - - - - -  @P4A 00950000
*            1) BPX4AIO is called by programs running in AMODE(64).     00960000
*                                                                       00970000
*            2) In ASM: SYSSTATE AMODE64=YES must be used before        00980000
*                       including this macro and all field names        00990000
*                       remain the same as for 31-bit mode.             01000000
*                                                                       01010000
*            3) In PL/X --> SOME FIELD NAMES ARE DIFFERENT <--          01020000
*                    You MUST use the following names for 64-Bit usage: 01030000
*                       AioBuffPtr64                                    01040000
*                       AioExitPtr64                                    01050000
*                       AioSockAddrPtr64                                01060000
*                       AioLocSockAddrPtr64                             01061000
*                       SigEvent64 structure within AioSigEvent64       01062000
*                                                                       01063000
*                    Issue 'ASAXMAC SetEsameInfo' to define the         01064000
*                       appropriate 8-byte data type for %AsaxmacP64,   01065000
*                       or define the macro variable yourself.          01066000
*                       The Default is Char(8) for Amode(31) usage      01067000
*                       where the space is not used.                    01068000
*                                                                       01069000
*                    AioBuffSize remains 31-bits                        01070000
*                       You may only send or recv 2 Gig at a time]      01080000
*                       The word in front of it must be zero.           01090000
*                                                                       01100000
*                    For example:                                       01110000
*                                                                       01120000
*                      Aiocb = ''b                                      01130000
*                      AioFd = Sd                                       01140000
*                      AioNotifyType = Aio#MVS                          01150000
*                      AioCmd = Aio#RecvFrom                            01160000
*              --->    AioBuffPtr64 = Addr(Buffer)                      01170000
*                      AioBuffSize  = Length(Buffer)                    01180000
*              --->    AioExitPtr64   = Addr(MyExit64)                  01190000
*              --->    AioSockAddrPtr64 = Addr(SA)                      01200000
*                      AioSockAddrLen   = Length(SA)                    01210000
*                      Call BPX4AIO(Length(Aiocb), Aiocb, Rv,Rc,Rsn)    01220000
*                                                                       01230000
*                    Exits will be invoked in AMODE(64).                01240000
*                                                                       01250000
*                                                                       01260000
*01* COMPONENT: OpenMVS (SCPX1)                                         01270000
*                                                                       01280000
*01* DISTRIBUTION LIBRARY:  AMACLIB                                     01290000
*                                                                       01300000
*01* EYE-CATCHER: None                                                  01310000
*02*   OFFSET:                                                          01320000
*02*   LENGTH:                                                          01330000
*                                                                       01340000
*01* CHANGE-ACTIVITY:                                                   01350000
*                                                                       01360000
*  $D0=DSPA175   HOM1150, 960604, PDJS: Dcr A175.02 Asyncio             01370000
*  $P0=PQC1821   HBB6603  960730  PDJT: User Key                        01380000
*  $D1=DSPA194   JBB6604, 960829, PDJT: Dcr A194.03 Asyncio Extended    01390000
*  $01=OW29923   HBB6605  971228  PDJT: No Notify Option        PVT0088 01400000
*  $D2=DWAA275   JBB6607, 980223, PDJJ: Dcr A275.02 aio_suspend()       01410000
*  $P2=OW37935   HBB6608, 990227, PDJT: AioTcbAffinity          PWY0213 01420000
*  $D3=DxxA505   HBB7708  000821  PDJT: LP64 & 64-Bit addressing        01430000
*  $02=OW48918   HBB7707  010613  PDJT: Fix DSECT=NO for all DSECTs     01440000
*  $P3=PYN0220   HBB7708  020301  PDFO: Bilingual fixup                 01450000
*  $D4=DJKA619   HBB7709  020521  PDJT: Common Buffers                  01460000
*  $D5=DJKA625   HBB7709  020620  PDJT: SRB ACEEs                       01470000
*  $03=OA03051   HBB7705  030416  PDJT: AioSiCode                       01480000
*  $P4=TJK0971   HBB7709  031030  PDJT: Add ASM Parts for 64-Bit        01490000
*  $D6=DcrB035   HBB7740  050909  PDJT: I/O Complete --> Msg Queues     01500000
*  $P5=ME07638   HBB7740  060828  PDJT: Dcl Aio#BRLock                  01510000
*  $04=OA18483   HBB7709  061011  PDJT: AioArqTok for lost Aio#Cancel   01520000
*  $D7=DCRB575   HBB7760  080310  PDJN: Async Accept_and_receive        01530000
*  $D8=DCRC595   HBB77A0  140328  PDSK: AMODE64 - 64-bit autodata       01531001
*                                                                       01540000
****END OF SPECIFICATIONS*********************************************/ 01550000
*        %GOTO AIOPLS   ;         /* Bilingual header                   01560000
.A411    ANOP  ,                                                        01570000
         AIF   ('&SYSAM64' EQ 'YES').AM64A                              01580000
* ------------------------------ 31-Bit Version                         01590000
&AIOBUFFPTR31     SETC 'AIOBUFFPTR'                             @P4A    01600000
&AIOEXITPTR31     SETC 'AIOEXITPTR'                             @P4A    01610000
&AIOSIGEVENT31    SETC 'AIOSIGEVENT'                            @P4A    01620000
&AIOSOCKADDRPTR31 SETC 'AIOSOCKADDRPTR'                         @P4A    01630000
&AIOBUFFPTR64     SETC 'AIOBUFFPTR64'                           @P4A    01640000
&AIOEXITPTR64     SETC 'AIOEXITPTR64'                           @P4A    01650000
&AIOSIGEVENT64    SETC 'AIOSIGEVENT64'                          @P4A    01660000
&AIOSOCKADDRPTR64 SETC 'AIOSOCKADDRPTR64'                       @P4A    01670000
&AIOPTRSIZE       SETC 'F'                                      @P4A    01680000
         AGO   .AM64B                                           @P4A    01690000
.AM64A   ANOP  ,                                                @P4A    01700000
* ------------------------------ 64-Bit Version                         01710000
&AIOBUFFPTR31     SETC 'AIOBUFFPTR31'                           @P4A    01720000
&AIOEXITPTR31     SETC 'AIOEXITPTR31'                           @P4A    01730000
&AIOSIGEVENT31    SETC 'AIOSIGEVENT31'                          @P4A    01740000
&AIOSOCKADDRPTR31 SETC 'AIOSOCKADDRPTR31'                       @P4A    01750000
&AIOBUFFPTR64     SETC 'AIOBUFFPTR'                             @P4A    01760000
&AIOEXITPTR64     SETC 'AIOEXITPTR'                             @P4A    01770000
&AIOSIGEVENT64    SETC 'AIOSIGEVENT'                            @P4A    01780000
&AIOSOCKADDRPTR64 SETC 'AIOSOCKADDRPTR'                         @P4A    01790000
&AIOPTRSIZE       SETC 'D'                                      @P4A    01800000
.AM64B   ANOP  ,                                                @P4A    01810000
* ------------------------------                                        01820000
** BPXYAIO:  Asyncio parameter block                                    01830000
**  Used by: AIO                                                        01840000
         AIF   ('&DSECT' EQ 'NO').B411                                  01850000
AIO                  DSECT ,                                            01860000
         AGO   .C411                                                    01870000
.B411    ANOP  ,                                                        01880000
AIO                  DS    0D                                           01890000
.C411    ANOP  ,                                                        01900000
AIOFD                DS    F      File Descriptor                       01910000
AIOBUFFDW            DS    0CL8   Eight byte addresses                  01920000
AIOBUFFALET          DS    F      Alet for AioBuffPtr                   01930000
&AIOBUFFPTR31        DS    F      Buffer Pointer                 @P4C   01940000
AIOBUFFSIZE          DS    F      Buffer Length or Iov count            01950000
AIOOFFSETDW          DS    0CL8   Offset in File                        01960000
AIOOFFSETH           DS    F      Offset in File highword               01970000
AIOOFFSET            DS    F      Offset in File lowword                01980000
AIOMSGEVENT          DS    0C     Message Event overlays SigEv   @D6A   01990000
&AIOSIGEVENT31       DS    CL20   POSIX Signals          @D1A@D2C@P4C   02000000
AIOREQPRIO           DS    F      REQUEST PRIORITY               @D2C   02010000
AIOLIOOPCODE         DS    F      LIO_LISTIO() OP                @D2A   02020000
*                                                                       02030000
                     ORG   AIOLIOOPCODE                                 02040000
AIOCMD               DS    F      Command Code                          02050000
AIONOTIFYTYPE        DS    H      Notification Type                     02060000
AIOCFLAGS            DS    XL1    Control Flags                         02070000
AIOOK2COMPIMD        EQU   X'80'  Ok to complete immediately            02080000
AIOCALLB4            EQU   X'40'  Call exit before redrive              02090000
AIOSYNC              EQU   X'10'  Do synchronously                      02100000
AIOEXITMODETCB       EQU   X'08'  0=SRB, 1=TCB                          02110000
AIOCANCELNOWAIT      EQU   X'04'  Nowait option on cancel               02120000
AIOCANCELNONOTIFY    EQU   X'02'  NoNotify option on cancel      @01A   02130000
AIOTCBAFFINITY       EQU   X'01'  TCB Affinity I/O               @P2A   02140000
AIOCFLAGS2           DS    XL1    Control Flags2                        02150000
AIOUSERKEY           EQU   X'F0'  Caller's User's Key bit positions     02160000
AIOUSEUSERKEY        EQU   X'08'  Use User's Key for moves              02170000
AIOTHLICOMECB        EQU   X'04'  AioEcbPtr points tp ThliComEcb        02180000
AIOCOMMBUFF          EQU   X'02'  Common Area Buffer             @D4A   02190000
AIOMSGIOVALET        DS    F      Alet for recvmsg/sendmsg IOV          02200000
AIOIOVBUFALET        DS    F      Alet for all IOV buffers              02210000
*                                                                       02220000
AIORV                DS    F      Return value                          02230000
AIORC                DS    F      Return code                           02240000
AIORSN               DS    F      Reason code                           02250000
*                                                                       02260000
AIOPOSIXFLAGS        DS    XL4    Posix flags                           02270000
&AIOEXITPTR31        DS    F      Pointer to user exit           @P4C   02280000
AIOEXITDATA          DS    CL8    User Data for exit program            02290000
AIOECBPTR            DS    F      ECB address                           02300000
AIOSOCKADDRLEN       DS    F      Sockaddr length                       02310000
&AIOSOCKADDRPTR31    DS    F      Sockaddr pointer               @P4C   02320000
AIOTIMEOUT           DS    F      TimeOut Value in Milli-seconds @D1A   02330000
AIOACEE              DS    F      SRB ACEE for MLS               @D5C   02340000
AIOSICODE            DS    XL2    Signal si_code                 @03A   02350000
AIORES06             DS    CL4    Reserved                       @D7C   02360000
AIOLEN               DS    XL2    (Output,debug) Len of AIO rcvd @D7A   02370000
AIOARQTOK            DS    CL8    Async Req Token                @04A   02380000
AIOENDVER1           DS    0D     End of Original Aiocb          @P4A   02390000
* -------- 64-Bit Extension                                             02400000
AIOLP64              DS    0D                                    @P4A   02410000
&AIOBUFFPTR64        DS    AD     Buffer Ptr                     @P4A   02420000
&AIOEXITPTR64        DS    AD     Exit Program Address           @P4A   02430000
&AIOSIGEVENT64       DS    CL32   SigEvent Structure             @P4A   02440000
&AIOSOCKADDRPTR64    DS    AD     Sockaddr Ptr                   @P4A   02450000
                     DS    CL8                                   @P4A   02460000
* -------- Version 3 Extension                                          02470000
.AM64C   ANOP  ,                                                        02480000
         AIF   ('&SYSAM64' EQ 'YES').AM64D                              02490000
* ------------------------------ 31-Bit Version                         02500000
AIORES01             DS    F      RESERVED                              02510000
AIOLOCSOCKADDRPTR    DS    F      Local Sockaddr Ptr for ANR     @D7    02510100
         AGO   .AM64E                                                   02510200
.AM64D   ANOP  ,                                                 @D7A   02510300
* ------------------------------ 64-Bit Version                         02510400
AIOLOCSOCKADDRPTR    DS    AD     Local Sockaddr Ptr for ANR     @D7A   02510500
.AM64E   ANOP  ,                                                 @D7A   02510600
AIOLOCSOCKADDRLEN    DS    F      Local Sockaddr Len for ANR     @D7A   02510700
AIOANRSOCKET         DS    F      Accepted Socket for ANR        @D7A   02510800
                     DS    CL48                                  @D7A   02510900
AIOENDVER3           DS    0D     End of Version 3 extension     @D7A   02511000
                                                                        02512000
AIOEND               DS    0D     End of Aiocb                   @P4A   02513000
*                                                                       02514000
AIO#LENGTH           EQU   *-AIO  Length of this structure              02515000
*                                                                       02516000
** AIO command values                                                   02517000
AIO#ACCEPT           EQU   126                                          02518000
AIO#CONNECT          EQU   128                                          02519000
AIO#READ             EQU   43                                           02520000
AIO#WRITE            EQU   54                                           02530000
AIO#READV            EQU   133                                          02540000
AIO#WRITEV           EQU   144                                          02550000
AIO#RECV             EQU   134                                          02560000
AIO#SEND             EQU   138                                          02570000
AIO#RECVFROM         EQU   135                                          02580000
AIO#SENDTO           EQU   140                                          02590000
AIO#RECVMSG          EQU   243                                          02600000
AIO#SENDMSG          EQU   244                                          02610000
AIO#ANR              EQU   264                                   @D7A   02620000
Aio#BRLOCK           EQU   3                                     @P5A   02630000
AIO#SELPOLL          EQU   2                                     @D1A   02640000
AIO#CANCEL           EQU   1                                            02650000
*                                                                       02660000
** AIO notify type                                                      02670000
AIO#POSIX            EQU   0                                     @D1A   02680000
AIO#MVS              EQU   1                                            02690000
AIO#MSGQ             EQU   2                                     @D6A   02700000
*                                                                       02710000
** AIO Message Event Structure                                   @D6A   02720000
*        For AioNotifyType of AIO#MSGQ the AioMsgEvent           @D6A   02730000
*          structure overlays AioSigEvent (31-bit location).     @D6A   02740000
*        Msgbuf and Msgbuf64 are defined in BPXYMSG.             @D6A   02750000
*        IPC_NOWAIT is defined in BPXYIPCP.                      @D6A   02760000
*                                                                @D6A   02770000
AIO_BEFORE_MSGEV     DS    0C            Note current position   @D6A   02780000
                     ORG   AIOMSGEVENT                           @D6A   02790000
AIOMSGEV_QID         DS    F             Msg Queue Id            @D6A   02800000
AIOMSGEV_SIZE        DS    H             Length of Msg_mtext     @D6A   02810000
AIOMSGEV_FLAG        DS    H             0 or IPC_NOWAIT         @D6A   02820000
AIOMSGEV_ADDR64      DS    D             Amode(64)-> MsgBuf64    @D6A   02830000
                     ORG   AIOMSGEV_ADDR64                       @D6A   02840000
AIOMSGEV_ADDRH       DS    F                                     @D6A   02850000
AIOMSGEV_ADDR        DS    F             Amode(31)-> MsgBuf      @D6A   02860000
                     ORG   AIO_BEFORE_MSGEV    Return to above   @D6A   02870000
*                                                                       02880000
AIO#MSGTEXTMAX       EQU  240            Max Msg_MText           @D6A   02890000
*                                                                       02900000
** AIO Signal Event                                                     02910000
         AIF   ('&DSECT' EQ 'NO').B412                           @02A   02920000
SIGEVENT        DSECT ,                                          @D1A   02930000
         AGO   .C412                                             @02A   02940000
.B412    ANOP  ,                                                 @02A   02950000
SIGEVENT         DS 0F                                           @02A   02960000
.C412    ANOP  ,                                                 @02A   02970000
SIGEV_NOTIFY         DS    F             NOTIFICATION TYPE       @D1A   02980000
SIGEV_SIGNO          DS    F             SIGNAL NUMBER           @D1A   02990000
SIGEV_VALUE          DS    &AIOPTRSIZE   SIG VALUE           @P4C@D1A   03000000
                     ORG   SIGEV_VALUE                                  03010000
SIVAL_INT            DS    F                                            03020000
                     ORG   SIGEV_VALUE                                  03030000
SIVAL_PTR            DS    &AIOPTRSIZE                       @P4C       03040000
SIGEV_NOTIFY_FUNCTION   DS &AIOPTRSIZE   NOTIF. FUNCTION     @P4C @D2A  03050000
SIGEV_NOTIFY_ATTRIBUTES DS &AIOPTRSIZE   NOTIF. ATTRIBUTES   @P4C @D2A  03060000
*                                                                       03070000
SIGEV#LENGTH         EQU   *-SIGEVENT  Length of this structure   @P4A  03080000
*                                                                       03090000
*    SIGEV_NOTIFY Values                                                03100000
SIGEV_SIGNAL         EQU   0             GENERATE A SIGNAL        @D1A  03110000
SIGEV_NONE           EQU   1             DON'T GENERATE SIGNAL    @D1A  03120000
SIGEV_THREAD         EQU   2             Call Notif. function     @D2A  03130000
*                                                                       03140000
** AIOTIMEOUT VALUES                                                    03150000
AIO#FOREVER          EQU   0             NO TIMEOUT, JUST WAIT    @D1A  03160000
AIO#NOWAITING        EQU   X'FFFFFFFF'   NO WAITING, JUST CHECK   @D1A  03170000
** AIO CANCEL RETURN VALUES                                             03180000
AIO_CANCELED         EQU   1             ALL CANCELS SUCCESSFUL   @D1A  03190000
AIO_NOTCANCELED      EQU   2             AT LEAST 1 CANCEL FAILED @D1A  03200000
AIO_ALLDONE          EQU   3             NONE CANCELED, ALL COMP  @D1A  03210000
*                                                                       03220000
** BPXYAIO End                                                          03230000
         SPACE 3                                                        03240000
         AIF   ('&LIST' EQ 'YES').E411                                  03250000
         POP   PRINT                                                    03260000
.E411    ANOP  ,                                                        03270000
         MEND  ,                  Terminating PL/X comment           */ 03280000
*%AIOPLS : ;                                                            03290000
*                                                                       03291000
* %DCL ASABEGIN_AMODE CHAR EXTERNAL;                          /* @D8A*/ 03300001
* %DCL PTR_64 CHAR EXTERNAL;                                  /* @D8A*/ 03301001
* %IF AIOBASE= '' %THEN                                                 03301100
*   %DO;                                                                03301200
*     %AIOBASE = 'Based(AioPtr)';                                       03301300
*   %END;                                                               03301400
* %IF TRANSLATE(AIOBASE)='BASED(AIOPTR)' %THEN                          03305100
*   %DO;                                                                03307000
*    %IF ASABEGIN_AMODE='64' ! PTR_64='YES' %THEN             /* @D8A*/ 03308001
*    %DO;                                                     /* @D8A*/ 03309101
*     DCL AioPtr Ptr(64);                                     /* @D8A*/ 03309201
*    %END;                                                    /* @D8A*/ 03309301
*    %ELSE                                                    /* @D8A*/ 03309501
*    %DO;                                                     /* @D8A*/ 03309601
*     DCL AioPtr Ptr;                                                   03309700
*    %END;                                                    /* @D8A*/ 03309801
*   %END;                                                               03309900
*                                                                       03400000
* %IF AsaxmacP64 = ''                  /* Set data types for     @D3A*/ 03410000
*    %Then %AsaxmacP64 = 'Char(8)';    /*   down lvl systems.    @D3A*/ 03420000
*                                                                       03430000
*                                                                       03440000
* Declare                                                               03450000
*   1 AioCb AIOBASE Bdy(DWord),                                /*@D3C*/ 03460000
*     2 AioPosix ,                     /* POSIX AsyncIO Fields       */ 03470000
*       3 AioFd          Fixed(31),    /*  File Descriptor           */ 03480000
*       3 AioBuffDW ,                                                   03490000
*         5 AioBuffAlet    Fixed(32),  /*  Alet for AioBuffPtr       */ 03500000
*         5 AioBuffPtr     Ptr,        /*  Buffer: RW, RcvSnd, RfSt,    03510000
                                                   ANR                  03520000
*                                          Iov: RdvWrv                  03530000
*                                          Msg: RmsgSmsg             */ 03540000
*           7 AioBuffSize64HW Fixed(32),   /* Upper word of LP64 @D3A*/ 03550000
*                                          /*   size, must be 0  @D3A*/ 03560000
*       3 AioBuffSize    Fixed(31),    /*  Buffer/Msg Len, Iov Count */ 03570000
*                                      /*+10 */                         03580000
*       3 AioOffsetDW ,                /*  8-byte File Offsets       */ 03590000
*         5 AioOffsetH    Fixed(31),   /*   File Offset, High Word   */ 03600000
*         5 AioOffset     Fixed(32),   /*   File Offset, Low Word    */ 03610000
*                                                                       03620000
*       3 AioSigEvent  Like(SigEvent), /*  POSIX Signals         @D1A*/ 03630000
*       3 AioReqPrio      Fixed(32),   /*  Request Priority      @D2A*/ 03640000
*                                                                       03650000
*     2 AioExt ,                       /* OpenEdition Extensions     */ 03660000
*                                      /*+30 */                         03670000
*       3 AioCmd          Fixed(31),   /*  Command Code              */ 03680000
*         5 AioLioOpcode    Fixed(32), /*    lio_listio() op     @D2A*/ 03690000
*       3 AioNotifyType   Fixed(16),   /*  Notification Type         */ 03700000
*       3 AioCFlags       Bit(8),      /*  Control Flags:            */ 03710000
*         5 AioOk2CompImd  Bit(1),     /*   Ok to Complete Immed     */ 03720000
*         5 AioCallB4      Bit(1),     /*   Call Exit Before Redrive */ 03730000
*         5 *              Bit(1),     /*                            */ 03740000
*         5 AioSync        Bit(1),     /*   Do Synchronously         */ 03750000
*         5 AioExitModeTCB    Bit(1),  /*   0=SRB, 1=TCB             */ 03760000
*         5 AioCancelNoWait   Bit(1),  /*   NoWait option on cancel  */ 03770000
*         5 AioCancelNoNotify Bit(1),  /*   NoNotify option      @01A*/ 03780000
*         5 AioTcbAffinity    Bit(1),  /*   I/O has TCB affinity @P2A*/ 03790000
*       3 AioCFlags2      Bit(8),      /*  Control Flags2:           */ 03800000
*         5 AioUserKey     Bit(4),     /*   Caller's User's Key      */ 03810000
*         5 AioUseUserKey  Bit(1),     /*   Use User's Key for moves */ 03820000
*         5 AioThliComEcb  Bit(1),     /*   AiocbEcbPtr points to       03830000
*                                           ThliComEcb           @D2A*/ 03840000
*         5 AioCommBuff    Bit(1),     /*   Common Area Buffer   @D4A*/ 03850000
*         5   *            Bit(1),                                      03860000
*       3 AioMsgIovAlet   Fixed(32),   /*  Alet for RmsgSmsg Iov     */ 03870000
*       3 AioIovBufAlet   Fixed(32),   /*  Alet for all Iov Buffers  */ 03880000
*                                      /*+40 */                         03890000
*       3 AioRetInfo ,                 /*  Async Completion Info     */ 03900000
*         5 AioRv         Fixed(31),   /*    Return Value            */ 03910000
*         5 AioRc         Fixed(32),   /*    Return Code (Errno)     */ 03920000
*         5 AioRsn        Fixed(32),   /*    Reason Code (ErrnoJr)   */ 03930000
*       3 AioPosixFlags   Bit(32),     /*  RcvSnd, RfSt, RmsgSmsg       03940000
*                                          ANR                       */ 03950000
*                                      /*+50 */                         03960000
*       3 AioExitPtr      Ptr,         /*  Exit Address              */ 03970000
*       3 AioExitData     Char(8),     /*  User Data for Exit pgm    */ 03980000
*       3 AioECBPtr       Ptr,         /*  ECB Address               */ 03990000
*                                      /*+60 */                         04000000
*       3 AioSockAddrLen  Fixed(31),   /*  Sockaddr: Length & Ptr       04010000
*                                            (Remote) sockaddr       */ 04020000
*       3 AioSockAddrPtr  Ptr,         /*    RfSt, Accept, Connect      04030000
*                                            ANR - Remote sockaddr   */ 04040000
*       3 AioTimeOut      Fixed(31),   /*  TimeOut in Milli-secs @D1A*/ 04050000
*       3 AioAcee         Ptr,         /*  SRB's ACEE for MLS    @D5A*/ 04060000
*                                      /*+70 */                         04070000
*       3 AioSiCode       Fixed(16),   /*  Signal si_code        @03A*/ 04080000
*       3   *             Char(4),                             /*@D7C*/ 04090000
*       3 AioLenNTok,                  /*  Adjacent fields for          04100000
*                                          MVCDK                 @D7A*/ 04110000
*         5 AioLen        Fixed(16),   /*  Length of the AIO received.  04120000
*                                          Output field for PD.         04121000
*                                          Note that this value may be  04122000
*                                          larger than a valid          04123000
*                                          AIOCB.  Debug only.  No      04124000
*                                          dependent logic on           04125000
*                                          this value            @D7A*/ 04126000
*         5 AioArqTok     Char(8),     /*  Async Req Token       @04A*/ 04127000
*       3 AioEndVer1      Char(0),     /*+80 End Version 1       @D3A*/ 04128000
*                                                                       04129000
*       3 AioLP64 ,                    /*  LP64 Extension        @D3A*/ 04130000
*         5 AioBuffPtr64   AsaxmacP64,        /* Buffer address  @D3A*/ 04140000
*         5 AioExitPtr64   AsaxmacP64,        /* Exit Rtn addr   @D3A*/ 04150000
*                                      /*+90 */                         04160000
*         5 AioSigEvent64  Like(SigEvent64),  /* SigEvent struct @D3A*/ 04170000
*                                      /*+B0 */                         04180000
*         5 AioSockAddrPtr64 AsaxmacP64,      /* SockAddr addr   @D3A*/ 04190000
*       3   *             Char(8),                             /*@D3A*/ 04200000
*       3 AioEndVer2      Char(0),     /*+C0 End Version 2       @D7A*/ 04210000
*       /********************************************************@D7A*/ 04220000
*       /* VERSION 3 Extensions start here.                          */ 04230000
*       /*************************************************************/ 04240000
*       3 AioLocSockAddrPtr64 AsaxmacP64 Bdy(Word),/* Local             04241000
*                                           Sockaddr for ANR     @D7A*/ 04242000
*         5 *                   Ptr(31), /* High word            @D7A*/ 04242100
*         5 AioLocSockAddrPtr   Ptr(31), /* 31-bit address       @D7A*/ 04242200
*       3 AioLocSockAddrLen  Fixed(31),/*   Loc Sockaddr len ANR @D7A*/ 04242300
*       3 AioAnrSocket         Fixed(31),/*   (output) accepted socket  04242400
*                                           descriptor for ANR   @D7A*/ 04242500
*       /* Note: No data at or below AioAvailable is included in        04242600
*        * the AsyncIO CTRACE entry.  Add definitions above             04242700
*        * AioAvailable and keep AioAvailable last.              @D7A*/ 04242800
*       3 AioAvailable   Char(48),     /* +D0  Available for use @D7A*/ 04242900
*       3 AioEndVer3      Char(0),     /* +100 End Version 3     @D7A*/ 04243000
*       3 AioEnd          Char(0);     /* +100                       */ 04244000
*                                                                       04245000
*   Dcl Aio#Length      Fixed(32) Constant(Length(Aiocb));     /*@P4A*/ 04246000
*                                                                       04247000
*   /* AioCmd Values:                   */                              04248000
*                                                                       04249000
*   Dcl ( Aio#Accept    Constant(126),    ] These values match the      04250000
*         Aio#Connect   Constant(128),    ]   syscall numbers for the   04260000
*                                         ]   corresponding regular     04270000
*         Aio#Read      Constant(043),    ]   functions from the macros 04280000
*         Aio#Write     Constant(054),    ]   BPXXSINC and BPXZIDF.     04290000
*         Aio#ReadV     Constant(133),                                  04300000
*         Aio#WriteV    Constant(144),                                  04310000
*         Aio#Recv      Constant(134),                                  04320000
*         Aio#Send      Constant(138),                                  04330000
*         Aio#RecvFrom  Constant(135),                                  04340000
*         Aio#SendTo    Constant(140),                                  04350000
*         Aio#RecvMsg   Constant(243),                                  04360000
*         Aio#SendMsg   Constant(244),                                  04370000
*         Aio#ANR       Constant(264),                         /*@D7A*/ 04380000
*                                                                       04390000
*         Aio#BRLock    Constant(003),                         /*@P5A*/ 04400000
*         Aio#SelPoll   Constant(002),                         /*@D1A*/ 04410000
*         Aio#Cancel    Constant(001)     ] Cancel does not have a      04420000
*                                         ] corresponding reg function. 04430000
*                               ) Fixed(31);                            04440000
*   /************************************/                              04450000
*   /* AioNotifyType Values:            */                              04460000
*   /************************************/                              04470000
*                                                                       04480000
*   Dcl ( Aio#POSIX   Constant(0),     /* POSIX Signals          @D1A*/ 04490000
*         Aio#MVS     Constant(1),     /* MVS Exit/ECB               */ 04500000
*         Aio#MSGQ    Constant(2)      /* Message Queue          @D6A*/ 04510000
*                        ) Fixed(16);                                   04520000
*                                                                       04530000
*                                                                       04540000
*   /* Signal Event Structure           (Ref POSIX 1003.4 D14)   @D1A*/ 04550000
*                                                              /*@D1A*/ 04560000
*   Dcl 1 SigEvent Based Bdy(Word),                            /*@D1A*/ 04570000
*         2 Sigev_Notify Fixed(31),    /* Notification Type      @D1A*/ 04580000
*         2 Sigev_Signo  Fixed(32),    /* Signal Number          @D1A*/ 04590000
*         2 Sigev_Value  Fixed(32),    /* Signal value           @D2C*/ 04600000
*           3 Sival_Int   Fixed(32),   /*   as an int            @D2A*/ 04610000
*             4 Sival_Ptr  Ptr,        /*   as a pointer         @D2A*/ 04620000
*         2 Sigev_Notify_Function   Ptr,  /* Notif. Function     @D2A*/ 04630000
*         2 Sigev_Notify_Attributes Ptr;  /* Notif. Attributes   @D2A*/ 04640000
*                                                                       04650000
*                                      /* LP64 Version           @D3A*/ 04660000
*   Dcl 1 SigEvent64 Based Bdy(DWord),                         /*@D3A*/ 04670000
*         2 Sigev64_Notify Fixed(31),     /* Notification Type   @D3A*/ 04680000
*         2 Sigev64_Signo  Fixed(32),     /* Signal Number       @D3A*/ 04690000
*         2 Sigev64_Value  Char(8) Bdy(Word), /* Signal value    @D3A*/ 04700000
*           3 Sival64_Ptr  AsaxmacP64 Bdy(Word), /* as a pointer @D3A*/ 04710000
*             4 Sival64_Int  Fixed(32),   /*   as an int         @D3A*/ 04720000
*         2 Sigev64_Notify_Function   AsaxmacP64, /* Function   @D3A*/  04730000
*         2 Sigev64_Notify_Attributes AsaxmacP64; /* Attributes @D3A*/  04740000
*                                                                       04750000
*                                                              /*@D1A*/ 04760000
*   /* Sigev_Notify Values:             */                     /*@D1A*/ 04770000
*                                                              /*@D1A*/ 04780000
*   Dcl ( Sigev_Signal  Constant(0),   /* Generate a Signal      @D1A*/ 04790000
*         Sigev_None    Constant(1),   /* Don't Generate signal  @D1A*/ 04800000
*         Sigev_Thread  Constant(2)    /* Call Notif. Function   @D2A*/ 04810000
*                               ) Fixed(31);                   /*@D1A*/ 04820000
*                                                                       04830000
*   /* Message Event Structure                                   @D6A   04840000
*        For AioNotifyType of AIO#MSGQ the AioMsgEvent           @D6A   04850000
*          structure overlays AioSigEvent in the Aiocb.          @D6A   04860000
*        Msgbuf and Msgbuf64 are defined in BPXYMSG.             @D6A   04870000
*        IPC_NOWAIT is defined in BPXYIPCP.                      @D6A*/ 04880000
*                                                              /*@D6A*/ 04890000
*   Dcl 1 AioMsgEvent Defined(AioSigEvent) Bdy(DWord),         /*@D6A*/ 04900000
*         2 AioMsgev_QID   Fixed(31) Unsigned, /* Msg Queue Id   @D6A*/ 04910000
*         2 AioMsgev_Size  Fixed(16),   /* Length of Msg_mtext   @D6A*/ 04920000
*         2 AioMsgev_Flag  Fixed(16),   /* 0 or IPC_NOWAIT       @D6A*/ 04930000
*         2 AioMsgev_Addr64 AsaxmacP64  /* Amode(64)-> MsgBuf64  @D6A*/ 04940000
*                               BDY(DWord),                    /*@D6A*/ 04950000
*           3 AioMsgev_AddrH Fixed(32),                        /*@D6A*/ 04960000
*           3 AioMsgev_Addr  Ptr ;      /* Amode(31)-> MsgBuf    @D6A*/ 04970000
*                                                              /*@D6A*/ 04980000
*   Dcl Aio#MsgTextMax Fixed(16) Constant(240); /* Max Msg_mtext @D6A*/ 04990000
*                                                                       05000000
*   /* AioTimeOut Values                                         @D1A*/ 05010000
*                                                              /*@D1A*/ 05020000
*   Dcl ( Aio#Forever   Constant(0),   /* No Timeout, just wait  @D1A*/ 05030000
*         Aio#NoWaiting Constant(-1)   /* No waiting, just check @D1A*/ 05040000
*                               ) Fixed(31);                            05050000
*                                                                       05060000
*   /* Aio_suspend Values                                        @D2A*/ 05070000
*   Dcl                                                                 05080000
*     Aio#No_ASP_Timeout Fixed(32)  Constant(2147483647); /* Don't      05090000
*                                         set timer on BPX1ASP call     05100000
*                                                                @D2A*/ 05110000
*   /************************************/                              05120000
*   /* Aio_cancel() return values:      */                              05130000
*   /************************************/                              05140000
*                                                                       05150000
*   Dcl ( AIO_CANCELED Constant(1),    /* All cancels successful     */ 05160000
*         AIO_NOTCANCELED Constant(2), /* At least 1 cancel failed   */ 05170000
*         AIO_ALLDONE  Constant(3) /* None canceled, already complete*/ 05180000
*                        ) Fixed(16);                                   05190000
*                                                                       05200000
