*        %GOTO PRLIPRO  ;         /* Bilingual header                   00010000
         MACRO                                                          00020000
         BPXYPRLI  &DSECT=YES,&LIST=YES                                 00030000
         GBLB  &PRLI411                                                 00040000
         AIF   (&PRLI411 EQ 1).E411                                     00050000
&PRLI411 SETB  1                                                        00060000
         AIF   ('&LIST' EQ 'YES').A411                                  00070000
         PUSH  PRINT  BPXYPRLI: Process Level Information               00080000
         PRINT OFF                                                      00090000
         AGO   .A411                                                    00100000
*                                  */                                   00110000
*%PRLIPRO : ;                                                           00120000
*/****START OF SPECIFICATIONS****************************************** 00130000
*                                                                       00140000
*    $MAC (BPXYPRLI) COMP(SCPX1) PROD(BPX):                             00150000
*                                                                       00160000
*01* MACRO NAME: BPXYPRLI                                               00170000
*                                                                       00180000
*01* DSECT NAME: BPXYPRLI                                               00190000
*                                                                       00200000
*01* DESCRIPTIVE NAME: Process Level Information                        00210000
*                                                                       00220000
*02*   ACRONYM: PRLI                                                    00230000
**/                                                                     00240000
*/*01* PROPRIETARY STATEMENT=                                        */ 00250000
*/***PROPRIETARY_STATEMENT********************************************/ 00260000
*/*                                                                  */ 00270000
*/*                                                                  */ 00280000
*/* LICENSED MATERIALS - PROPERTY OF IBM                             */ 00290000
*/* 5650-ZOS  COPYRIGHT IBM CORP. 1996, 2015                         */ 00300003
*/*                                                                  */ 00310000
*/* STATUS= HBB77A0                                                  */ 00320003
*/*                                                                  */ 00330000
*/***END_OF_PROPRIETARY_STATEMENT*************************************/ 00340000
*/*                                                                     00350000
*                                                                       00360000
*01* EXTERNAL CLASSIFICATION:  GUPI                                     00370000
*01* END OF EXTERNAL CLASSIFICATION:                                    00380000
*                                                                       00390000
*01* FUNCTION:                                                          00400000
*                                                                       00410000
*    This file contains the mapping of process related information of   00420000
*    possible interest to external users.  One of these data areas will 00430000
*    be created whenever a process is created.                          00440000
*                                                                       00450000
*01* METHOD OF ACCESS:                                                  00460000
*                                                                       00470000
*02*   PL/X:                                                            00480000
*                                                                       00490000
*        %INCLUDE SYSLIB(BPXYPRLI)                                      00500000
*                                                                       00510000
*        By default, the PRLI is based on ThliPRLI. If                  00520000
*        other basing is desired, use %PRLIBASE='BASED(xxxxxx)'.        00530000
*                                                                       00540000
*02*   ASM:                                                             00550000
*        With DSECT=NO (default), storage is allocated in line          00560000
*        and addressability is provided thru that DSECT or CSECT.       00570000
*        With DSECT=YES, a DSECT is produced and "USING PRLI,reg"       00580000
*        is required for addressability.  Here "reg" contains the       00590000
*        address of PRLI#LENGTH bytes of storage.                       00600000
*                                                                       00610000
*01* SIZE: PRLI#LENGTH                                                  00620000
*            PRLI -- X'0020' bytes                                      00630000
*                                                                       00640000
*01* POINTED TO BY:                                                     00650000
*                   ThliPrli                                            00660000
*                   OapbPrli                                            00670000
*                                                                       00680000
*01* CREATED BY: BPXPRIN1                                               00690000
*                                                                       00700000
*01* DELETED BY:                                                        00710000
*      Task termination cleanup                                         00720000
*      Process cleanup                                                  00730000
*                                                                       00740000
*01* STORAGE ATTRIBUTES:                                                00750000
*02*   SUBPOOL: 230                                                     00760000
*02*   KEY: Same as callers key who was first dubbed in the process     00770000
*02*   RESIDENCY: private                                               00780000
*                                                                       00790000
*01* FREQUENCY: 1 per process                                           00800000
*                                                                       00810000
*01* SERIALIZATION: None                                                00820000
*                                                                       00830000
*01* DEPENDENCIES: None                                                 00840000
*                                                                       00850000
*01* NOTES: None                                                        00860000
*                                                                       00870000
*01* COMPONENT:  OpenMVS (SCPX1)                                        00880000
*                                                                       00890000
*01* DISTRIBUTION LIBRARY:  AMACLIB                                     00900000
*                                                                       00910000
*01* EYE-CATCHER: PRLI                                                  00920000
*02*   OFFSET:  0                                                       00930000
*02*   LENGTH:  4                                                       00940000
*                                                                       00950000
*01* CHANGE-ACTIVITY:                                                   00960000
* $L0=DRGA153 HOM1140 951212 PDPY: A153.03 - Performance                00970000
* $P0=PQC1585 HOM1150 960620 PDJM: Rework assembler portion             00980000
* $01=OW23381 JBB6604 961028 PDKG: Medium weight process bit            00990000
* $D1=DCRA243 JBB6606 970801 PDZJ: Performance Enhancement              01000000
* $D2=DWAA274 JBB6607 980423 PDJQ: FastCGI (A274.01)                    01010000
* $P1=PWA0140 JBB6607 980507 PDJQ: Keep PRLIL16JRC on WORD boundary     01020000
* $D3=DWKA313 HBB6608 980615 PDI6: Exec Magic Number Support (A313.01)  01030000
* $D4=DWKA285 HBB6608 980818 PDKG: Enable/disable signal (A285.01)      01040000
* $D5=DXDA403 HBB7703 990915 PDPY: Performance (A403.00)                01050000
* $02=OW48547 HBB6608 010309 PDKG: WebSphere - terminate processes      01060000
* $P2=PYN0220 HBB7708 020301 PDFO: Bilingual fixup                      01070000
* $03=OA33516 HBB7750 100901 PDJQ: Add support for Shrlib region size   01080000
* $04=OA37056 HBB7790 110915 PDJJ: Add support for CICS/TCPIP           01090000
* $D6=ME25296 HBB7790 121206 PDKG: Remove prlimed flag                  01091000
* $05=OA43472 HBB7780 130924 PDKG: Flag for PTXQG watiers no time out   01091102
****END OF SPECIFICATIONS*********************************************/ 01092000
*        %GOTO PRLIPLS  ;         /* Bilingual header                   01093000
.A411    ANOP  ,                                                        01094000
** BPXYPRLI: Process Level Information                                  01095000
         AIF   ('&DSECT' EQ 'NO').B411                                  01096000
PRLI            DSECT ,                                                 01097000
                AGO   .C411                                             01098000
.B411    ANOP  ,                                                        01099000
PRLI            DS    0F                                                01100000
.C411    ANOP  ,                                                        01110000
PRLIID          DC    C'PRLI'   EBCDIC ID                               01120000
PRLISP          DS    FL1       Subpool number of this Prli             01130000
PRLILEN         DS    FL3       Length of this Prli                     01140000
PRLIPROCESSID   DS    F         Process ID. Used for fast getpid()      01150000
PRLICATCHERMASK DS    BL8       Mask of signals that may be caught      01160000
PRLIOAPB        DS    A         Oapb Addr of this process               01170000
PRLIFLAG        DS    BL1       Flag byte                               01180000
PRLIF1MED       EQU   B'10000000'  Process is medium weight local @01A  01190000
PRLIF1DISSIG    EQU   B'01000000'  Disable signal delivery        @D4A  01200000
PRLISYSCONFOK   EQU   B'00100000'  SC_ fields valid. Note, that        X01210000
                                   this implies the OEXT SC_           X01220000
                                   fields are also valid           @D5A 01230000
PRLIF1TERMT     EQU   B'00010000'  Terminate threads               @02A 01240000
PRLISHLIBRGNSIZEOK EQU B'00001000' PrliShlibRgnSize address is         X01250000
                                   available                       @03A 01260000
PRLICICS        EQU   B'00000100' Reserved for CICS                @04A 01270000
PRLIPTXAGKEEP   EQU   B'00000010'                                  @05A 01271002
PRLIMAGICNUMBER DS    CL2       Magic Number Characters                 01280000
                DS    CL1       Reserved                                01290000
PRLIL16JRC      DS    F         Return code area for L16J FastCGI @P1M  01300000
PRLIRUID        DS    A         Real Uid addr                           01310000
PRLIEUID        DS    A         Effective Uid addr                      01320000
PRLIRGID        DS    A         Real Gid addr                           01330000
PRLIEGID        DS    A         Effective gid                           01340000
PRLIPROCGRPID   DS    A         Process Group ID addr                   01350000
PRLIPARENTPID   DS    A         Parent Process ID addr                  01360000
PRLITHREADTASKSMAX DS A         SC_THREAD_TASK_MAX_NP value addr   @D5A 01370000
PRLITHREADSMAX  DS    A         SC_THREADS_MAX_NP value address    @D5A 01380000
PRLICHILDMAX    DS    A         SC_CHILD_MAX value addr            @D5A 01390000
PRLIOPENMAX     DS    A         SC_OPEN_MAX value address          @D5A 01400000
PRLIMMAPMEMMAX  DS    A         SC_MMAP_MEM_MAX value address      @D5A 01410000
PRLISHLIBRGNSIZEADDR DS A       Shared library region size address @03A 01420000
                DS    CL32      Reserved                           @03A 01430000
PRLIEND         DS    0C        End of Prli                             01440000
PRLI#ID         EQU   C'PRLI'   Control Block Acronym                   01450000
PRLI#LEN        EQU   112       Length of Prli                          01460000
PRLI#SP         EQU   230       Subpool for the Prli                    01470000
PRLI_LEN        EQU   *-PRLI                                            01480000
** BPXYPRLI End                                                         01490000
                SPACE 3                                                 01500000
         AIF   ('&LIST' EQ 'YES').E411                                  01510000
         POP   PRINT                                                    01520000
.E411    ANOP  ,                                                        01530000
         MEND  ,                  Terminating PL/X comment           */ 01540000
*                                                                       01550000
*%PRLIPLS : ;                                                           01560000
* %DCL BPXYPRLI_INCLUDED CHAR EXT;                                      01570000
* %DEACTIVATE BPXYPRLI_INCLUDED;                                        01580000
* %IF BPXYPRLI_INCLUDED = 'YES' %THEN                                   01590000
*   %GOTO BPXYPRLI_4;                                                   01600000
* %BPXYPRLI_INCLUDED = 'YES';                                           01610000
* %DCL ZCBPRINT CHAR EXT;                                               01620000
* %DEACTIVATE ZCBPRINT;                                                 01630000
* %DCL BPXYPRLI_LIST CHAR EXT;                                          01640000
* %DEACTIVATE BPXYPRLI_LIST;                                            01650000
* %IF BPXYPRLI_LIST ^= 'NO' &                                           01660000
*    ZCBPRINT ^= 'NO' %THEN                                             01670000
*   %GOTO BPXYPRLI_3;                                                   01680000
*   @LIST PUSH NOECHO;                                                  01690000
*   @LIST NOASSEMBLE NOECHO;                                            01700000
*   @LIST OFF C NOECHO;                                                 01710000
* %BPXYPRLI_3:;                                                         01720000
*                                                               @EJECT; 01730000
*%IF PRLIBASE='' %THEN                                                  01740000
*  %DO;                                                                 01750000
*    %PRLIBASE='BASED(THLIPRLI)';                                       01760000
*  %END;                                                                01770000
*                                                                       01780000
*   DECLARE                                                             01790000
*     1    Prli     PrliBASE Bdy(Word),                                 01800000
*       3    PrliID   Char(04),     /* EBCDIC ID - Prli              */ 01810000
*       3    PrliSP   Fixed(08),    /* Subpool number of this Prli   */ 01820000
*       3    PrliLEN  Fixed(24),    /* Length of this Prli           */ 01830000
*       3    PrliProcessID Fixed(32), /* Process ID. Used for fast      01840000
*                                      getpid()                      */ 01850000
*       3    PrliCatcherMask BIT(64), /* Mask of signals that may be    01860000
*                                      caught                        */ 01870000
*       3    PrliOapb Ptr(31),      /* Oapb Addr of this process @D1A*/ 01880000
*       3    PrliFlag Bit(8),       /* Flag byte                 @01A*/ 01890000
*        5    *            Bit(1),  /*   Reserved                @01A*/ 01900000
*        5    PrliF1DisSig Bit(1),  /*   Disable signal delivery @D4A*/ 01910000
*        5    PrliSysConfOK Bit(1), /*   SC_ fields valid. Note, that   01920000
*                                        this implies the OEXT SC_      01930000
*                                        fields are also valid   @D5A*/ 01940000
*        5    PrliF1TermT   Bit(1), /*   Terminate thread even   @02A*/ 01950000
*                                   /*    if have a linkage st   @02A*/ 01960000
*        5    PrliShlibRgnSizeOK Bit(1), /*  PrliShlibRgnSize    @03A*/ 01970000
*                                     /*  address is available   @03A*/ 01980000
*        5    PrliCICS           Bit(1), /*  Reserved for CICS   @04A*/ 01990000
*        5    PrliPTXAGKeep      Bit(1), /* Keep tasks waiting   @05A*/ 01991002
*       3    PrliMagicNumber Char(2), /* Magic Number Characters set by 02000000
*                                     C RTL to indicate active codepage 02010000
*                                      representation of '#]'    @D3A*/ 02020000
*       3    *        Char(1),      /* Reserved                  @D2C*/ 02030000
*       3    PrliL16JRC Fixed(32),  /* Return code area for L16J use    02040000
*                                      for FastCGI, need one word that  02050000
*                                      is in user key storage    @P1M*/ 02060000
*       3    PrliRUid Ptr(31),      /* Real Uid addr             @D1A*/ 02070000
*       3    PrliEUid Ptr(31),      /* Effective Uid addr        @D1A*/ 02080000
*       3    PrliRGid Ptr(31),      /* Real Gid addr             @D1A*/ 02090000
*       3    PrliEGid Ptr(31),      /* Effective gid addr        @D1A*/ 02100000
*       3    PrliProcGrpID Ptr(31), /* Process Group ID addr     @D1A*/ 02110000
*       3    PrliParentPID Ptr(31), /* Parent Process ID addr    @D1A*/ 02120000
*       3    PrliThreadTasksMax Ptr(31), /* SC_THREAD_TASK_MAX_NP       02130000
*                                      value address             @D5A*/ 02140000
*       3    PrliThreadsMax Ptr(31), /* SC_THREADS_MAX_NP value         02150000
*                                      address                   @D5A*/ 02160000
*       3    PrliChildMax  Ptr(31), /* SC_CHILD_MAX value addr   @D5A*/ 02170000
*       3    PrliOpenMax   Ptr(31), /* SC_OPEN_MAX value address @D5A*/ 02180000
*       3    PrliMmapMemMax Ptr(31),/* SC_MMAP_MEM_MAX value address    02190000
*                                                                @D5A*/ 02200000
*       3    PrliShlibRgnSizeAddr Ptr(31), /* Shared library region     02210000
*                                         size value address     @03A*/ 02220000
*       3    *                Char(32),/* Reserved               @03A*/ 02230000
*       3    PrliEnd  Bdy(Word) Char(0); /* End of Prli              */ 02240000
*                                                                       02250000
*   DECLARE                                                             02260000
*     Prli#ID  Char(4) Constant('PRLI'), /* Control Block Acronym    */ 02270000
*     Prli#Len Fixed(16) Constant(LENGTH(Prli)), /* Length of Prli   */ 02280000
*     Prli#SP  Fixed(31) Constant(230); /* Subpool for the Prli      */ 02290000
* %IF BPXYPRLI_LIST ^= 'NO' &                                           02300000
*    ZCBPRINT ^= 'NO' %THEN                                             02310000
*   %GOTO BPXYPRLI_4;                                                   02320000
*   @LIST POP NOECHO;                                                   02330000
* %BPXYPRLI_4:;                                                         02340000
