*                                                                       00001000
* %DCL BPXYSXIB_INCLUDED CHAR EXT;                                      00002000
* %DEACTIVATE BPXYSXIB_INCLUDED;                                        00003000
* %IF BPXYSXIB_INCLUDED = '' %THEN                                      00004000
* %DO;                                                                  00005000
*/* Macro made bi-lingual on 17018. CBGEN compile date 15295         */ 00006000
*% /*                                                                   00007000
         MACRO                                                          00008000
         BPXYSXIB &DSECT=YES,&LIST=YES,&TITLE=YES,&SXIB=YES             00009000
         GBLC  &BPXYSXIB_INCLUDED                                       00010000
         GBLC  &ZCBPRINT                                                00011000
&BPXYSXIB_INCLUDED SETC 'YES'                                           00012000
         AIF   ('&LIST' EQ 'NONE').P0                                   00013000
         AIF   ('&TITLE' EQ 'NO').P5                                    00014000
 TITLE   'BPXYSXIB  - Mapping of the Syscall Exit Information Block   '*00015000
                                                                        00016000
.P5      ANOP                                                           00017000
**/ BPXYSXIB_1:;                                                        00018000
*/****START OF SPECIFICATIONS****************************************** 00019000
*                                                                       00020000
*    $MAC (BPXYSXIB) COMP(SCPX1) PROD(BPX):                             00021000
*                                                                       00022000
*01* MACRO NAME: BPXYSXIB                                               00023000
*                                                                       00024000
*01* DSECT NAME: SXIB                                                   00025000
*                                                                       00026000
*01* DESCRIPTIVE NAME: Mapping of the Syscall Exit Information Block    00027000
*                                                                       00028000
*02*   ACRONYM: SXIB                                                    00029000
**/                                                                     00030000
*/*01* PROPRIETARY STATEMENT=                                        */ 00031000
*/***PROPRIETARY_STATEMENT********************************************/ 00032000
*/*                                                                  */ 00033000
*/*                                                                  */ 00034000
*/* LICENSED MATERIALS - PROPERTY OF IBM                             */ 00035000
*/* 5650-ZOS COPYRIGHT IBM CORP. 2017                                */ 00036000
*/*                                                                  */ 00037000
*/* STATUS: HBB77B0                                                  */ 00038000
*/*                                                                  */ 00039000
*/***END_OF_PROPRIETARY_STATEMENT*************************************/ 00040000
*/*                                                                     00041000
*01* EXTERNAL CLASSIFICATION:  PI                                       00042000
*01* END OF EXTERNAL CLASSIFICATION:                                    00043000
*                                                                       00044000
*01* FUNCTION:                                                          00045000
*                                                                       00046000
*      Mapping for the Syscall Exit Information Block. The address      00047000
*      of the SXIB is passed via R1 to all exit routines that are       00048000
*      added to the following exit points:                              00049000
*                                                                       00050000
*      BPX_PRE_SYSCALL  - pre-syscall exit point                        00051000
*      BPX_POST_SYSCALL - post-syscall exit point                       00052000
*                                                                       00053000
*01* METHOD OF ACCESS:                                                  00054000
*                                                                       00055000
*02*   PL/X:                                                            00056000
*                                                                       00057000
*        %INCLUDE SYSLIB(BPXYSXIB)                                      00058000
*                                                                       00059000
*02*   ASM:                                                             00060000
*                                                                       00061000
*        With DSECT=NO (default), storage is allocated in line          00062000
*        and addressability is provided thru that DSECT or CSECT.       00063000
*        With DSECT=YES, a DSECT is produced and "USING SXIB,reg"       00064000
*        is rquired for addressability.  Here "reg" contains the        00065000
*        address of SXIB#LEN bytes of storage.                          00066000
*                                                                       00067000
*01* SIZE: SXIB#LEN                                                     00068000
*            SXIB -- X'0180' bytes                                      00069000
*                                                                       00070000
*01* POINTED TO BY: OtcbSxib                                            00071000
*                   R1 on entry to syscall exit routines                00072000
*                                                                       00073000
*01* CREATED BY: BPXJCSXE (Syscall Exits manager)                       00074000
*                                                                       00075000
*01* DELETED BY: The SXIB is explicitly freed by BPXPRMPC during        00076000
*                thread termination.                                    00077000
*                                                                       00078000
*                                                                       00079000
*01* USED BY:                                                           00080000
*                                                                       00081000
*                                                                       00082000
*01* STORAGE ATTRIBUTES:                                                00083000
*02*   SUBPOOL/DATASPACE:  SP230                                        00084000
*02*   KEY:                0, non fetch protected                       00085000
*02*   RESIDENCY:          Extended Private of user                     00086000
*                                                                       00087000
*01* FREQUENCY: 1 per thread (allocated at first use)                   00088000
*                                                                       00089000
*01* SERIALIZATION: N/A                                                 00090000
*                                                                       00091000
*01* DEPENDENCIES: None                                                 00092000
*                                                                       00093000
*01* NOTES: None                                                        00094000
*                                                                       00095000
*01* COMPONENT:  OpenMVS (SCPX1)                                        00096000
*                                                                       00097000
*01* DISTRIBUTION LIBRARY:  AMACLIB                                     00098000
*                                                                       00099000
*01* EYE-CATCHER: SXIB                                                  00100000
*02*   OFFSET:  0                                                       00101000
*02*   LENGTH:  4                                                       00102000
*                                                                       00103000
*01* CHANGE-ACTIVITY:                                                   00104000
*                                                                       00105000
* $D0=DC89300  HBB77B0 160701 PDJQ: (C893.00) Syscall Exits             00106000
* $P0=WI154952 HBB77B0 170117 PDLO: Correct SxibPreScId length          00107000
*                                                                       00108000
****END OF SPECIFICATIONS*********************************************/ 00109000
*% /*                                                                   00110000
.P0      ANOP                                                           00111000
         AIF   ('&ZCBPRINT' EQ 'NO').P1                                 00112000
         AIF   ('&LIST' EQ 'YES').P2                                    00113000
.P1      ANOP                                                           00114000
         PUSH  PRINT                                                    00115000
         PRINT OFF                                                      00116000
.P2      ANOP                                                           00117000
         AIF   ('&SXIB' EQ 'NO').L0002                                  00118000
         AIF   ('&DSECT' EQ 'YES').L0003                                00119000
         AIF   ('&SXIB' NE 'YES').L0002                                 00120000
.L0003   ANOP                                                           00121000
*                                                                       00122000
*   Start of PL/X Source                                                00123000
*                                                                       00124000
*                                                                       00125000
         AIF   ('&DSECT' EQ 'YES').L0004                                00126000
SXIB     DS    0D                                                       00127000
         AGO   .L0005                                                   00128000
.L0004   ANOP                                                           00129000
SXIB     DSECT                                                          00130000
.L0005   ANOP                                                           00131000
SXIBEYE  DS    CL4       Eye catcher - 'SXIB'                           00132000
SXIBSP   DS    X         Sxib subpool                                   00133000
SXIBLENGTH DS  FL3       Length of structure                            00134000
SXIBMAIN DS    0CL376                                                   00135000
SXIBSYSCALLTOK DS BL16   Syscall exit token, The token is unique       *00136000
                         across one pair of pre and post syscall exit  *00137000
                         points                                         00138000
SXIBCALLERPLST64 DS 0AD  Syscall callers parameter list pointer (GR1)  *00139000
                         AMODE64                                        00140000
         DS    CL4       Not used in AMODE31                            00141000
SXIBCALLERPLST31 DS A    Syscall callers parameter list pointer (R1)   *00142000
                         AMODE31                                        00143000
SXIBSYSCALLNUM DS F      Syscall number                                 00144000
SXIBFLAGS DS   0F        Flags                                          00145000
SXIBFLAGSB1 DS 0CL1      1st flag byte                                  00146000
SXIBPRESCEXIT EQU X'80'  On = Pre-syscall exit point                    00147000
SXIBPOSTSCEXIT EQU X'40' On = Post-syscall exit point                   00148000
SXIBAMODE31 EQU X'20'    On = Syscall caller AMODE31                    00149000
SXIBAMODE64 EQU X'10'    On = Syscall caller AMODE64                    00150000
         ORG   SXIBFLAGSB1+1                                            00151000
SXIBFLAGSB2 DS CL1       2nd flag byte                                  00152000
SXIBFLAGSB3 DS CL1       3rd flag byte                                  00153000
SXIBFLAGSB4 DS CL1       4th flag byte                                  00154000
*                                                                       00155000
*      ***************************************************************  00156000
*      *                                                             *  00157000
*      * If a pre-syscall exit elects to fail a syscall this area    *  00158000
*      * should be used to identify the product and the rationale for*  00159000
*      * failing by providing return and reason codes. This          *  00160000
*      * information will be returned to the caller (for syscalls    *  00161000
*      * that do return on failure) via the THLI control block for   *  00162000
*      * interrogation by the caller. z/OS UNIX will return          *  00163000
*      * -1/EMVSERR/JrFailedBySyscallExit                            *  00164000
*      *                                                             *  00165000
*      ***************************************************************  00166000
*                                                                       00167000
*                                                                       00168000
SXIBPRESCFAIL DS 0CL24   Pre-syscall failing exit info                  00169000
SXIBPRESCID DS CL16      ID of product failing syscall                  00170000
SXIBPRESCRC DS F         Product specified return code                  00171000
SXIBPRESCRS DS F         Product specified reason code                  00172000
SXIBWORKAREA DS CL256    Exit work area (Dword Bdy)                     00173000
SXIBCALLERSKEY DS F      Syscall callers psw key                        00174000
         DS    CL60      Reserved for future use                        00175000
SXIB#ID  EQU   C'SXIB'   Eye catcher                                    00176000
SXIB#SP  EQU   230       Key0, non fetch protected, Extended private    00177000
SXIB#LEN EQU   384       Length of SXIB                                 00178000
SXIB_LEN EQU   *-SXIB                                                   00179000
.L0002   ANOP                                                           00180000
         AIF   ('&ZCBPRINT' EQ 'NO').P3                                 00181000
         AIF   ('&LIST' EQ 'YES').P4                                    00182000
.P3      ANOP                                                           00183000
         POP   PRINT                                                    00184000
.P4      ANOP                                                           00185000
.P_EXIT  ANOP                                                           00186000
         MEND                                                           00187000
**/ BPXYSXIB_2:;                                                        00188000
* %BPXYSXIB_INCLUDED = 'YES';                                           00189000
* %DCL ZCBPRINT CHAR EXT;                                               00190000
* %DEACTIVATE ZCBPRINT;                                                 00191000
* %DCL BPXYSXIB_LIST CHAR EXT;                                          00192000
* %DEACTIVATE BPXYSXIB_LIST;                                            00193000
* %IF BPXYSXIB_LIST ^= 'NO' &                                           00194000
*    ZCBPRINT ^= 'NO' %THEN                                             00195000
*   %GOTO BPXYSXIB_3;                                                   00196000
*   @LIST PUSH NOECHO;                                                  00197000
*   @LIST NOASSEMBLE NOECHO;                                            00198000
*   @LIST OFF C NOECHO;                                                 00199000
* %BPXYSXIB_3:;                                                         00200000
*/* Start of PL/X Source                                             */ 00201000
*/* Start of PL/X Source                                             */ 00202000
*%IF SXIBBASE='' %THEN                                                  00203000
*  %DO;                                                                 00204000
*    %SXIBBASE='BASED(OtcbSxib)';                                       00205000
*  %END;                                                                00206000
* %IF SXIBBASE='BASED(SxibPtr)' %THEN                                   00207000
*   %DO;                                                                00208000
*     DCL SxibPtr Ptr(31);           /* Pointer to the SXIB          */ 00209000
*   %END;                                                               00210000
*DCL                                                                    00211000
* 1 SXIB              SXIBBASE    Bdy(DWord),                           00212000
*   3 SxibEye         Char(4),    /* Eye catcher - 'SXIB'            */ 00213000
*   3 SxibSP          Fixed(8),   /* Sxib subpool                    */ 00214000
*   3 SxibLength      Fixed(24),  /* Length of structure             */ 00215000
*   3 SxibMain,                                                         00216000
*    5 SxibSyscallTok  Bit(128) Bdy(DWord), /* Syscall exit token,      00217000
*                                    The token is unique across one     00218000
*                                    pair of pre and post syscall       00219000
*                                    exit points                     */ 00220000
*    5 SxibCallerPlst64  Ptr(64), /* Syscall callers parameter list     00221000
*                                    pointer (GR1) AMODE64           */ 00222000
*     7 *                Char(4), /* Not used in AMODE31             */ 00223000
*     7 SxibCallerPlst31 Ptr(31), /* Syscall callers parameter list     00224000
*                                    pointer (R1) AMODE31            */ 00225000
*    5 SxibSyscallNum  Fixed(32), /* Syscall number                  */ 00226000
*    5 SxibFlags       Fixed(32), /* Flags                           */ 00227000
*     7 SxibFlagsB1    Char(1),   /* 1st flag byte                   */ 00228000
*      9 SxibPreSCExit Bit(1),    /* On = Pre-syscall exit point     */ 00229000
*      9 SxibPostSCExit Bit(1),   /* On = Post-syscall exit point    */ 00230000
*      9 SxibAMODE31   Bit(1),    /* On = Syscall caller AMODE31     */ 00231000
*      9 SxibAMODE64   Bit(1),    /* On = Syscall caller AMODE64     */ 00232000
*      9 * Bit(4),                /* Available                       */ 00233000
*     7 SxibFlagsB2    Char(1),   /* 2nd flag byte                   */ 00234000
*     7 SXIBFlagsB3    Char(1),   /* 3rd flag byte                   */ 00235000
*     7 SXIBFlagsB4    Char(1),   /* 4th flag byte                   */ 00236000
*   /*****************************************************************/ 00237000
*   /* If a pre-syscall exit elects to fail a syscall this area      */ 00238000
*   /* should be used to identify the product and the rationale for  */ 00239000
*   /* failing by providing return and reason codes. This            */ 00240000
*   /* information will be returned to the caller (for syscalls that */ 00241000
*   /* do return on failure) via the THLI control block for          */ 00242000
*   /* interrogation by the caller. z/OS UNIX will return            */ 00243000
*   /* -1/EMVSERR/JrFailedBySyscallExit                              */ 00244000
*   /*****************************************************************/ 00245000
*    5 SxibPreScFail,             /* Pre-syscall failing exit info   */ 00246000
*     7 SxibPreScID    Char(16),  /* ID of product failing syscall      00247000
*                                                                @P0C*/ 00248000
*     7 SxibPreScRC    Fixed(32), /* Product specified return code   */ 00249000
*     7 SxibPreScRS    Fixed(32), /* Product specified reason code   */ 00250000
*    5 SxibWorkArea    Char(256), /* Exit work area (Dword Bdy)      */ 00251000
*    5 SxibCallersKey  Fixed(32), /* Syscall callers psw key         */ 00252000
*    5 * Char(60),                /* Reserved for future use         */ 00253000
*    5 *            Char(0);      /* End                             */ 00254000
*                                                                       00255000
*DCL                                                                    00256000
* SXIB#ID    Char(4)   Constant('SXIB'),     /* Eye catcher          */ 00257000
* SXIB#SP    Fixed(8)  Constant(230), /* Key0, non fetch protected,     00258000
*                                        Extended private            */ 00259000
* SXIB#LEN   Fixed(24) Constant(Length(SXIB)); /* Length of SXIB     */ 00260000
*/* End of PL/X Source                                               */ 00261000
* %IF BPXYSXIB_LIST ^= 'NO' &                                           00262000
*    ZCBPRINT ^= 'NO' %THEN                                             00263000
*   %GOTO BPXYSXIB_4;                                                   00264000
*   @LIST POP NOECHO;                                                   00265000
* %BPXYSXIB_4:;                                                         00266000
* %END;                                                                 00267000
