*                                                                       00050000
* %DCL BPXYSMMX_INCLUDED CHAR EXT;                                      00100000
* %DEACTIVATE BPXYSMMX_INCLUDED;                                        00150000
* %IF BPXYSMMX_INCLUDED = '' %THEN                                      00200000
* %DO;                                                                  00250000
*/* Macro made bi-lingual on 02158. CBGEN compile date 02143         */ 00300000
*% /*                                                                   00350000
         MACRO                                                          00400000
         BPXYSMMX &DSECT=YES,&LIST=YES,&TITLE=YES,&SMMX=YES             00450000
         GBLC  &BPXYSMMX_INCLUDED                                       00500000
         GBLC  &ZCBPRINT                                                00550000
&BPXYSMMX_INCLUDED SETC 'YES'                                           00600000
         AIF   ('&LIST' EQ 'NONE').P0                                   00650000
         AIF   ('&TITLE' EQ 'NO').P5                                    00700000
 TITLE   'BPXYSMMX  - Mapping of SMMX structure used on the BPX1SMC   '*00750000
                                                                        00800000
.P5      ANOP                                                           00850000
**/ BPXYSMMX_1:;                                                        00900000
*/****START OF SPECIFICATIONS****************************************** 00950000
*                                                                       01000000
*    $MAC (BPXYSMMX) COMP(SCPX1) PROD(BPX):                             01050000
*                                                                       01100000
*01* MACRO NAME: BPXYSMMX                                               01150000
*                                                                       01200000
*01* DSECT NAME: SMMX                                                   01250000
*                                                                       01300000
*01* DESCRIPTIVE NAME: Mapping of SMMX structure used on the BPX1SMC    01350000
*                      callable service                                 01400000
*                                                                       01450000
*02*   ACRONYM: SMMX                                                    01500000
**/                                                                     01550000
*/*01* PROPRIETARY STATEMENT=                                        */ 01600000
*/***PROPRIETARY_STATEMENT********************************************/ 01650000
*/*                                                                  */ 01700000
*/*                                                                  */ 01750000
*/* LICENSED MATERIALS - PROPERTY OF IBM                             */ 01800000
*/* THIS MACRO IS "RESTRICTED MATERIALS OF IBM"                      */ 01850000
*/* 5694-A01 (C) COPYRIGHT IBM CORP. 2003                            */ 01900000
*/*                                                                  */ 01950000
*/* STATUS= HBB7709                                                  */ 02000000
*/*                                                                  */ 02050000
*/***END_OF_PROPRIETARY_STATEMENT*************************************/ 02100000
*/*                                                                     02150000
*01* EXTERNAL CLASSIFICATION:                                           02200000
*                                                                       02250000
*02*   PI: BASE                                                         02300000
*                                                                       02350000
*01* END OF EXTERNAL CLASSIFICATION:                                    02400000
*                                                                       02450000
*01* FUNCTION:                                                          02500000
*                                                                       02550000
*      The SMMX maps the Shared Memory Mutex Structure that is supplied 02600000
*      on the BPX1SMC callable service.                                 02650000
*                                                                       02700000
*                                                                       02750000
*01* METHOD OF ACCESS:                                                  02800000
*                                                                       02850000
*02*   PL/X:                                                            02900000
*                                                                       02950000
*        %INCLUDE SYSLIB(BPXYSMMX)                                      03000000
*                                                                       03050000
*                                                                       03100000
*02*   ASM:                                                             03150000
*        With DSECT=NO, storage is allocated in line                    03200000
*        and addressability is provided thru that DSECT or CSECT.       03250000
*        With DSECT=YES, a DSECT is produced and "USING SMMX,reg"       03300000
*        is required for addressability.  Here "reg" contains the       03350000
*        address of SMMX#LEN bytes of storage.                          03400000
*        The default is DSECT=YES.                                      03450000
*                                                                       03500000
*01* SIZE: SMMX#LEN                                                     03550000
*            SMMX -- X'0040' bytes                                      03600000
*                                                                       03650000
*01* POINTED TO BY: SMMXPtr                                             03700000
*                                                                       03750000
*01* CREATED BY: Caller of BPX1SMC callable service                     03800000
*                                                                       03850000
*01* DELETED BY: Caller of BPX1SMC callable service                     03900000
*                                                                       03950000
*01* STORAGE ATTRIBUTES:                                                04000000
*02*   SUBPOOL/DATASPACE:  Any user subpool (0-127,129,131)             04050000
*02*   KEY:                8                                            04100000
*02*   RESIDENCY:          user address space                           04150000
*                                                                       04200000
*01* FREQUENCY: 1 per shared memory mutex or condition variable         04250000
*                                                                       04300000
*01* SERIALIZATION: N/A                                                 04350000
*                                                                       04400000
*01* DEPENDENCIES: None                                                 04450000
*                                                                       04500000
*01* NOTES: None                                                        04550000
*                                                                       04600000
*01* COMPONENT:  OpenMVS (SCPX1)                                        04650000
*                                                                       04700000
*01* DISTRIBUTION LIBRARY:  AMACLIB                                     04750000
*                                                                       04800000
*01* EYE-CATCHER: SMMX                                                  04850000
*02*   OFFSET:  0                                                       04900000
*02*   LENGTH:  4                                                       04950000
*                                                                       05000000
*01* CHANGE-ACTIVITY:                                                   05050000
*                                                                       05100000
* $D0=DJKA586 HBB7709 020505 PDI6: Shared Mutex/Condvar Support  (A586) 05150000
****END OF SPECIFICATIONS*********************************************/ 05200000
*% /*                                                                   05250000
.P0      ANOP                                                           05300000
         AIF   ('&ZCBPRINT' EQ 'NO').P1                                 05350000
         AIF   ('&LIST' EQ 'YES').P2                                    05400000
.P1      ANOP                                                           05450000
         PUSH  PRINT                                                    05500000
         PRINT OFF                                                      05550000
.P2      ANOP                                                           05600000
         AIF   ('&SMMX' EQ 'NO').L0002                                  05650000
         AIF   ('&DSECT' EQ 'YES').L0003                                05700000
         AIF   ('&SMMX' NE 'YES').L0002                                 05750000
SMMX     DS    0D                                                       05800000
         AGO   .L0004                                                   05850000
.L0003   ANOP                                                           05900000
SMMX     DSECT                                                          05950000
.L0004   ANOP                                                           06000000
SMMXID   DS    1CL0004   'SMMX'                                         06050000
SMMXFLAGS DS   0FL4      Flag Word                                      06100000
SMMXFLAGSB1 DS 0BL1      Flag Byte 1                                    06150000
SMMXRECURSIVE EQU X'80'  Recursive Mutex                                06200000
SMMXNOERRORCHECK EQU X'40' No Errorcheck Mutex                          06250000
SMMXNODEBUG EQU X'20'    No Debug Mutex                                 06300000
SMMXTRCSUMFLG EQU X'10'  Trace summary flag                             06350000
SMMXRELEASED EQU X'08'   Mutex prematurely released                     06400000
         ORG   SMMXFLAGSB1+X'00000001'                                  06450000
SMMXFLAGSB2 DS 1BL1      Flag Byte 1                                    06500000
SMMXFLAGSB3 DS 1BL1      Flag Byte 1                                    06550000
SMMXFLAGSB4 DS 0BL1      Flag Byte 1                                    06600000
SMMXLARGE EQU  X'02'     Large Size Mutex (Do not move)                 06650000
SMMXSHARED EQU X'01'     Shared Mutex (Do not move)                     06700000
         ORG   SMMXFLAGS+X'00000004'                                    06750000
SMMXKERNELTOKEN DS 1CL0008 Token that uniquely identifies kernel data  *06800000
                         for object                                     06850000
SMMXLOCKDWORD DS 0CL0008 Lock double word:                              06900000
SMMXLOCKOWNERTHIDUH DS 1FL4 Thread ID (Upper Half)                      06950000
SMMXLOCKFLAGS DS 0FL1    Lock Flags                                     07000000
SMMXLOCKDESTROY EQU X'80' Mutex destroyed                               07050000
SMMXLOCKUNUSABLE EQU X'40' Mutex unusable                               07100000
         ORG   SMMXLOCKFLAGS+X'00000001'                                07150000
SMMXLOCKWTRCNT DS 1FL3   Count of waiters                               07200000
SMMXOWNERDATA DS 0CL0008 Owner's User Data                              07250000
SMMXOWNERDATAUH DS 1AL4                                                 07300000
SMMXOWNERDATALH DS 1AL4                                                 07350000
SMMXKERNELAREA DS 1CL0008 Kernel Workarea                               07400000
SMMXRECURSECNT DS 1FL2   Recursive count                                07450000
SMMXRSVD01 DS  1CL0002                                                  07500000
SMMXWORKLE DS  0FL4      LE work area                                   07550000
SMMXSOURCE DS  0BL2      Source (copied from CEEXMXAB)                  07600000
SMMXSOURCEB1 DS 0BL1     Source byte 1                                  07650000
SMMXUSER EQU   X'80'     Untagged (User)                                07700000
SMMXC370 EQU   X'40'     C/370                                          07750000
SMMXDCE  EQU   X'20'     DCE                                            07800000
SMMXSOCKET EQU X'10'     Socket                                         07850000
         ORG   SMMXSOURCEB1+X'00000001'                                 07900000
SMMXSOURCEB2 DS 1BL1     Source byte 2                                  07950000
         ORG   SMMXWORKLE+X'00000004'                                   08000000
SMMXNEXT DS    0CL0008   Pointer to next SMMX in the queue (used by    *08050000
                         LE)                                            08100000
SMMXNEXTH DS   1AL4      High part of next SMMX pointer                 08150000
SMMXNEXTL DS   1AL4      Low part of next SMMX pointer                  08200000
SMMXRSVD02 DS  1CL0008                                                  08250000
SMMXEND  DS    0C                                                       08300000
SMMX#ID  EQU   C'SMMX'   Eye catcher                                    08350000
SMMX#LEN EQU   64        Length of SMMX                                 08400000
SMMX_LEN EQU   *-SMMX                                                   08450000
.L0002   ANOP                                                           08500000
         AIF   ('&ZCBPRINT' EQ 'NO').P3                                 08550000
         AIF   ('&LIST' EQ 'YES').P4                                    08600000
.P3      ANOP                                                           08650000
         POP   PRINT                                                    08700000
.P4      ANOP                                                           08750000
.P_EXIT  ANOP                                                           08800000
         MEND                                                           08850000
**/ BPXYSMMX_2:;                                                        08900000
* %BPXYSMMX_INCLUDED = 'YES';                                           08950000
* %DCL ZCBPRINT CHAR EXT;                                               09000000
* %DEACTIVATE ZCBPRINT;                                                 09050000
* %DCL BPXYSMMX_LIST CHAR EXT;                                          09100000
* %DEACTIVATE BPXYSMMX_LIST;                                            09150000
* %IF BPXYSMMX_LIST ^= 'NO' &                                           09200000
*    ZCBPRINT ^= 'NO' %THEN                                             09250000
*   %GOTO BPXYSMMX_3;                                                   09300000
*   @LIST PUSH NOECHO;                                                  09350000
*   @LIST NOASSEMBLE NOECHO;                                            09400000
*   @LIST OFF C NOECHO;                                                 09450000
* %BPXYSMMX_3:;                                                         09500000
*/* Start of PL/X Source                                             */ 09550000
*DECLARE                                                                09600000
*1 Smmx Based Bdy(Dword),                                               09650000
*  3 SmmxId        Char(4),               /* 'SMMX'                  */ 09700000
*  3 SmmxFlags     Fixed(32),             /* Flag Word               */ 09750000
*    5 SmmxFlagsB1 Bit(8),                /* Flag Byte 1             */ 09800000
*     7 SmmxRecursive    Bit(1),          /* Recursive Mutex         */ 09850000
*     7 SmmxNoErrorCheck Bit(1),          /* No Errorcheck Mutex     */ 09900000
*     7 SmmxNoDebug      Bit(1),          /* No Debug Mutex          */ 09950000
*     7 SmmxTrcSumFlg    Bit(1),          /* Trace summary flag      */ 10000000
*     7 SmmxReleased     Bit(1),          /* Mutex prematurely          10050000
*                                            released                */ 10100000
*    5 SmmxFlagsB2 Bit(8),                /* Flag Byte 1             */ 10150000
*    5 SmmxFlagsB3 Bit(8),                /* Flag Byte 1             */ 10200000
*    5 SmmxFlagsB4 Bit(8),                /* Flag Byte 1             */ 10250000
*     7 *                Bit(5),          /* Reserved                */ 10275000
*     7 *                Bit(1),          /* Reserved For LE Usage,     10300000
*                                            Not to be used by Kernel*/ 10325000
*     7 SmmxLarge        Bit(1),          /* Large Size Mutex           10350000
*                                            (Do not move)           */ 10400000
*     7 SmmxShared       Bit(1),          /* Shared Mutex               10450000
*                                            (Do not move)           */ 10500000
*  3 SmmxKernelToken  Char(8),            /* Token that uniquely        10550000
*                                            identifies kernel data for 10600000
*                                            object                  */ 10650000
*  3 SmmxLockDword Bdy(Dword),            /* Lock double word:       */ 10700000
*     5 SmmxLockOwnerThidUh  Fixed(32),   /* Thread ID (Upper Half)  */ 10750000
*     5 SmmxLockFlags  Fixed(8),          /* Lock Flags              */ 10800000
*       7 SmmxLockDestroy  Bit(1),        /* Mutex destroyed         */ 10850000
*       7 SmmxLockUnusable Bit(1),        /* Mutex unusable          */ 10900000
*     5 SmmxLockWtrCnt Fixed(24),         /* Count of waiters        */ 10950000
*  3 SmmxOwnerData Bdy(Dword),            /* Owner's User Data       */ 11000000
*    5 SmmxOwnerDataUh Ptr(31),                                         11050000
*    5 SmmxOwnerDataLh Ptr(31),                                         11100000
*  3 SmmxKernelArea Char(8) Bdy(Dword),   /* Kernel Workarea         */ 11150000
*  3 SmmxRecurseCnt Fixed(16),            /* Recursive count         */ 11200000
*  3 SmmxRsvd01 Char(02),                                               11250000
*  3 SmmxWorkLE Fixed(32),                /* LE work area            */ 11300000
*    5 SmmxSource    Bit(16),             /* Source (copied from        11350000
*                                            CEEXMXAB)               */ 11400000
*     7 SmmxSourceB1  Bit(8),             /* Source byte 1           */ 11450000
*      9 SmmxUser     Bit(1),             /* Untagged (User)         */ 11500000
*      9 SmmxC370     Bit(1),             /* C/370                   */ 11550000
*      9 SmmxDCE      Bit(1),             /* DCE                     */ 11600000
*      9 SmmxSocket   Bit(1),             /* Socket                  */ 11650000
*     7 SmmxSourceB2  Bit(8),             /* Source byte 2           */ 11700000
*  3 SmmxNext Bdy(Dword),                 /* Pointer to next SMMX in    11750000
*                                            the queue (used by LE)  */ 11800000
*    5 SmmxNextH     Ptr(31),             /* High part of next SMMX     11850000
*                                            pointer                 */ 11900000
*    5 SmmxNextL     Ptr(31),             /* Low  part of next SMMX     11950000
*                                            pointer                 */ 12000000
*  3 SmmxRsvd02 Char(08),                                               12050000
*  3 SmmxEnd Char(0);                                                   12100000
*                                                                       12150000
*DCL                                                                    12200000
* SMMX#ID Char(4)  Constant('SMMX'),      /* Eye catcher             */ 12250000
* SMMX#Len Fixed(16) Constant(Length(SMMX));/* Length of SMMX        */ 12300000
*/* End of PL/X Source                                               */ 12350000
* %IF BPXYSMMX_LIST ^= 'NO' &                                           12400000
*    ZCBPRINT ^= 'NO' %THEN                                             12450000
*   %GOTO BPXYSMMX_4;                                                   12500000
*   @LIST POP NOECHO;                                                   12550000
* %BPXYSMMX_4:;                                                         12600000
* %END;                                                                 12650000
