*        %GOTO  OEXTPRO ;      /* Bilingual header                      00001000
         MACRO                                                          00002000
         BPXYOEXT  &DSECT=YES,&LIST=YES                       8@D1A     00003000
         GBLB  &OEXT411                                                 00004000
         AIF   (&OEXT411 EQ 1).E411                                     00005000
&OEXT411 SETB  1                                                        00006000
         AIF   ('&LIST' EQ 'YES').A411                                  00007000
         PUSH  PRINT  BPXYOEXT: Common External Control Block           00008000
         PRINT OFF                                                      00009000
         AGO   .A411                                                    00010000
*                              */                                       00020000
*%OEXTPRO : ;                                                           00030000
*/****START OF SPECIFICATIONS****************************************** 00040000
*                                                                       00050000
*    $MAC (BPXYOEXT) COMP(SCPX1) PROD(BPX):                             00060000
*                                                                       00070000
*01* MACRO NAME: BPXYOEXT                                               00080000
*                                                                       00090000
*01* DSECT NAME: OEXT                                                   00100000
*                                                                       00110000
*01* DESCRIPTIVE NAME: Common External Control Block                    00120000
*                                                                       00130000
*02*   ACRONYM: OEXT                                                    00140000
**/                                                                     00150000
*/*01* PROPRIETARY STATEMENT=                                        */ 00160000
*/***PROPRIETARY_STATEMENT********************************************/ 00170000
*/*                                                                  */ 00180000
*/*                                                                  */ 00190000
*/* LICENSED MATERIALS - PROPERTY OF IBM                             */ 00200000
*/* 5650-ZOS COPYRIGHT IBM CORP. 1993, 2017                          */ 00210006
*/*                                                                  */ 00220000
*/* STATUS= HBB77B0                                                  */ 00230006
*/*                                                                  */ 00240000
*/***END_OF_PROPRIETARY_STATEMENT*************************************/ 00250000
*/*                                                                     00260000
*                                                                       00270000
*01* EXTERNAL CLASSIFICATION:  GUPI                                     00280000
*01* END OF EXTERNAL CLASSIFICATION:                                    00290000
*                                                                       00300000
*01* FUNCTION:                                                          00310000
*                                                                       00320000
*    This maps the common OpenMVS control block that                    00330000
*    users can access.                                                  00340000
*                                                                       00350000
*01* METHOD OF ACCESS:                                                  00360000
*                                                                       00370000
*02*   PL/X:                                                            00380000
*                                                                       00390000
*        %INCLUDE SYSLIB(BPXYOEXT)                                      00400000
*        By default, the OEXT is based on ECVTOEXT. If                  00410000
*        other basing is desired, use %OEXTBASE='BASED(XXXXXX)'.        00420000
*        If %OEXTBASE='BASED(OEXTPTR)' is coded, a Declare for          00430000
*        OEXTPTR is also generated.                                     00440000
*                                                                       00450000
*02*   ASM:                                                             00460000
*        With DSECT=NO, storage is allocated in line                    00470000
*        and addressability is provided thru that DSECT or CSECT.       00480000
*        With DSECT=YES, a DSECT is produced and "USING OEXT,reg"       00490000
*        is required for addressability.  Here "reg" contains the       00500000
*        address of OEXT#LENGTH bytes of storage.                       00510000
*        The default is DSECT=YES.                                      00520000
*                                                                       00530000
*01* SIZE: OEXT#LENGTH                                                  00540000
*                                                                       00550000
*01* POINTED TO BY:                                                     00560000
*      1) ECVTOEXT                                                      00570000
*                                                                       00580000
*01* CREATED BY: Component Initialization                               00590000
*                                                                       00600000
*01* DELETED BY: Component Termination                                  00610000
*                                                                       00620000
*01* STORAGE ATTRIBUTES:                                                00630000
*02*   SUBPOOL: 241                                                     00640000
*02*   KEY: 0, non fetch protected                                      00650000
*02*   RESIDENCY: ECSA                                                  00660000
*                                                                       00670000
*01* FREQUENCY: 1 per system                                            00680000
*                                                                       00690000
*01* SERIALIZATION: N/A                                                 00700000
*                                                                       00710000
*01* DEPENDENCIES: None                                                 00720000
*                                                                       00730000
*01* NOTES: None                                                        00740000
*                                                                       00750000
*01* COMPONENT: OpenMVS (SCPX1)                                         00760000
*                                                                       00770000
*01* DISTRIBUTION LIBRARY:  AMACLIB                                     00780000
*                                                                       00790000
*01* EYE-CATCHER: OEXT                                                  00800000
*02*   OFFSET:  0                                                       00810000
*02*   LENGTH:  4                                                       00820000
*                                                                       00830000
*01* CHANGE-ACTIVITY:                                                   00840000
*                                                                       00850000
* $L0=POSIXXI  HOM1110 931201 PDF4: OpenMVS Initial Release             00860000
* $D1=DL70019  HOM1110 921201 PDJM: Assembler macro fixup               00870000
* $P1=PL70597  HOM1110 930104 PDJM: Use "OpenMVS"                       00880000
* $P2=POA0088  HOM1120 931019 PDJI: Add HOM1120 version flag            00890000
* $D2=PPFA065  HOM1130 940110 PDJI: Add HOM1130 version flag            00900000
* $D3=DPFA065  HOM1130 940517 PDAX: A065.05 Rlimits/Rusage              00910000
* $D4=DPFA051  HOM1130 940624 PDJJ: A051.07 Fork daemon                 00920000
* $D5=DPFA097  HOM1130 941104 PDJD: A097.01 RACF 2.1 Toleration         00930000
* $D6=DRGA055  HOM1140 950220 PDJI: A055.01 Add HOM1140 version flag    00940000
* $P3=PQC1978  HBB6603 960729 PDAE: change comment to new release       00950000
* $D7=DSYA199  JBB6604 960916 PDI6: A199.01 RUNOPTS() support           00960000
* $D8=DSYA197  JBB6604 961220 PDPY: A197.00 APPC Elimination            00970000
* $D9=DUXA217  HBB6605 970527 PDPY: A217.18 Thli post support           00980000
* $01=OW33618  JBB6607 980910 PDKG: OW33618 - default UID/GID           00990000
* $02=OW36163  JBB6607 981115 PDPY: Propagate MSGLEVEL to child         01000000
*                                   PWK0443                             01010000
* $P4=PWK0271  HBB6608 981001 PKJJ: IP@ & security exits OW35109        01020000
* $DA=DWKA309  JBB6609 990216 PKJI: Sysplex support                     01030000
* $DB=DXDA382  HBB7703 990817 PDQR: A382.00 Enhanced RMF Support        01040000
*                                                                       01050000
* $DC=DXDA403  HBB7703 990915 PDPY: Performance (A403.00)               01060000
* $DD=DXDA406  HBB7703 991029 PDPY: BPX1TAF Thread affinity support     01070000
*                                   (A406.00)                           01080000
* $DE=DXVA409  HBB7704 000403 PDJI: BPX1PQG Pthread quiesce support     01090000
* $DF=DYMA511  HBB7706 010305 PDPY: OMVS Restart Support                01100000
* $DG=DYVA574  HBB7707 010504 PDJT: IPv6 (A574.01)                      01110000
* $P5=PYN0220  HBB7708 020301 PDFO: Bilingual fixup                     01120000
* $xx=TJK0336  HBB7709 020430 PDNU: Rollup IPV6                         01130000
* $03=OA08701  HBB7709 040812 PDJT: OextIpv6Conf Flag                   01140000
* $DH=DCRB037  HBB7740 060227 PDI6: Key 2 Mmap                          01150000
* $DI=DCRC395  HBB77A0 120127 PDKG: PAUSE/RELEASE services              01151001
* $04=OA51000  HBB77B0 160810 PDLZ: UMASK new parmlib statement         01160004
*                                   (Rollup DCRD018)                    01161004
*                                                                       01162001
****END OF SPECIFICATIONS*********************************************/ 01170000
*        %GOTO  OEXTPLS ;      /* Bilingual header                      01180000
.A411    ANOP  ,                                                        01190000
** BPXYOEXT: Common External Control Block                              01200000
*                                                                       01210000
*     The address of BPXYOEXT control block can be obtained as follows: 01220000
*                                                                       01230000
*        L        14,16(0,0)      GET CVT ADDRESS                       01240000
*        L        15,140(0,14)    GET ECVT ADDRESS                      01250000
*        L        14,244(0,15)    GET BPXYOEXT ADDRESS                  01260000
*                                                                       01270000
*                                                                       01280000
*    OEXT user exit support:                                            01290000
*                                                                       01300000
*      When the kernel detects that the OEXTUSEREXIT address is         01310000
*      non-zero, control will be given to this exit on:                 01320000
*                                                                       01330000
*         1) Successful completion of the GETPWNAME service and         01340000
*            specified name matches invoking userid.                    01350000
*                                                                       01360000
*              Parm 1 = 4 byte function code set to OEXT#UEGETPWNAME    01370000
*              Parm 2 = 4 byte length of Current Working Directory      01380000
*              Parm 3 = N byte Current Working Directory                01390000
*                                                                       01400000
*            Purpose of call is to allow exit to examine/change CWD.    01410000
*            Length of CWD must remain the same.                        01420000
*                                                                       01430000
*      User Exit will be given control in supervisor state key zero.    01440000
*                                                                       01450000
*      Input:                                  ---------------          01460000
*           Register 1 = Parmlist address ---> ! Parm 1 addr !          01470000
*                                              ---------------          01480000
*                                              ! Parm 2 addr !          01490000
*                                              ---------------          01500000
*                                                     .                 01510000
*                                                     .                 01520000
*                                   Bit 31 on  ---------------          01530000
*                                   in last -->! Parm N addr !          01540000
*                                   parm       ---------------          01550000
*                                                                       01560000
*                                                                       01570000
*           Register 13 = Save area address                             01580000
*           Register 14 = Return address                                01590000
*                                                                       01600000
*      Output:                                                          01610000
*            Possible modification of CWD, length must not change.      01620000
*                                                                       01630000
*       Exit will be passed a 64 bytes save area in Register 13.  It is 01640000
*       the responsibility of the User Exit to save all resisters upon  01650000
*       entry and to restore all registers before return.               01660000
*                                                                       01670000
*                                                                       01680000
         AIF   ('&DSECT' EQ 'NO').B411                                  01690000
OEXT                 DSECT ,                                            01700000
         AGO   .C411                                                    01710000
.B411    ANOP  ,                                                        01720000
OEXT                 DS    0D                                           01730000
.C411    ANOP  ,                                                        01740000
OEXTID               DS    CL4    Eye catcher                           01750000
OEXTSP               DS    FL1    Subpool of this structure             01760000
OEXTLEN              DS    FL3    Length this structure                 01770000
OEXTFLGS             DS    0CL4                                         01780000
OEXTFLG1             DS    B                                            01790000
OEXTF1DEFSEG         EQU   X'80'  OMVS default segment exists     @01A  01800000
*                    EQU   X'40'  Reserved for future use         @01A  01810000
OEXTSYSPLEXACTV      EQU   X'20'  OMVS is a member of sysplex     @DAA  01820000
OEXTNOACCT           EQU   X'10'  Don't allow user to change acct-info  01830000
*                                                                 @P4A  01840000
OEXTSETIP@           EQU   X'08'  Deamons should set IP@ of client      01850000
*                                                                 @P4A  01860000
OEXTGRPIDVALID       EQU   X'04'  If on, OextTtyGrpId is valid    @DCA  01870000
OEXTSERVICESAVAILABLE EQU  X'02'  IF ON, USS Services Available   @DFA  01880000
OEXTFLG2             DS    B                                            01890000
OEXTCINETCONF        EQU   X'80'  Cinet is configured             @03A  01900000
OEXTIPV6             EQU   X'40'  IPv6 Configured & Supported     @03A  01910000
OEXTIPV6CONF         EQU   X'20'  IPv6 is Configured              @03A  01920000
OEXTFLG3             DS    B                                            01930000
OEXTUMASKCONF        EQU   X'80'  UMASK specified in BPXPRM       @04A  01931003
OEXTFLG4             DS    B                                            01940000
OEXTSTARTM           DS    BL.64  Time OpenEdition MVS was started      01950000
*                                 (TOD format)                     @P2C 01960000
OEXTSMFP             DS    A      Pointer to the SMF Process accounting 01970000
*                                 data collection routine.  This offset 01980000
*                                 must not change.  It is hardcoded in  01990000
*                                 executable macro BPXESMF.             02000000
OEXTLVL              DS    0XL4   OpenEdition MVS Release level         02010000
*                                 indicator                             02020000
*                                 (Multiple bits may be set, e.g.       02030000
*                                 OEXT1120 and OEXT1130 will both       02040000
*                                 be set)                          @P2A 02050000
OEXTLV0              DS    XL1    Byte 0 of OEXTLVL                @P2A 02060000
*                    EQU   X'80'  Reserved                         @P2A 02070000
OEXT1120             EQU   X'40'  HOM1120 functions are present    @P2A 02080000
OEXT1130             EQU   X'20'  HOM1130 functions are present    @D2A 02090000
OEXT1130IPC          EQU   X'10'  HOM1130 functions InterProcess        02100000
*                                 Communication (IPC), NFSC, directory  02110000
*                                 sticky bit, lchown UID=-1, are        02120000
*                                 present.                         @D5A 02130000
OEXT1140             EQU   X'08'  HOM1140 functions are present    @D6A 02140000
OEXT1150             EQU   X'04'  HBB6603 functions are present. Future 02150000
*                                 OpenEdition release indicators will   02160000
*                                 not be added since OpenEdition MVS is 02170000
*                                 now an integral part of the BCP. @P3C 02180000
OEXTTECFS            EQU   X'02'  The Thli ECB comunication function is 02190000
*                                 supported                        @D9A 02200000
OEXTTAFS             EQU   X'01'  The MvsThreadAffinity function is     02210000
*                                 supported                        @DDA 02220000
OEXTLV1              DS    XL1    Byte 1 of OEXTLVL                @DEA 02230000
OEXTPQG              EQU   X'80'  The pthread_quiesce_and_get_np        02240000
*                                 function (BPX1PQG) is supported  @DEA 02250000
OEXTMMAPEXTKEY       EQU   X'40'  The mmap extended key function        02251000
*                                 is supported                     @DHA 02252000
                     DS    XL2    Bytes 2-3 of OEXTLVL             @DEC 02253000
OEXTAPPCBPXEXIT      DS    A      Pointer to the OpenEdition MVS Exit   02254000
*                                 for APPC Processing.             @D4A 02255000
OEXTTIXP             DS    A      Pointer to OpenEdition timer exit.    02256000
*                                 Invoked by IEAVLEXT.             @D3A 02257000
OEXTRUNOPTSPTR       DS    A      Pointer to the RUNOPTS() string       02258000
*                                 specified at IPL time.           @D7A 02259000
OEXTRUNOPTSLEN       DS    FL4    Length of the RUNOPTS() string        02260000
*                                 specified at IPL time.           @D7A 02270000
OEXTBPXWLMEXIT       DS    A      Pointer to OpenMVS Exit for WLM       02280000
*                                 IWMUWON timeout processing       @D8C 02290000
OEXTUSEREXIT         DS    A      Pointer to OpenMVS User Exit     @P4A 02300000
OEXTMSGACBRTN        DS    A      Pointer to JESYSMSG ACB PUT rtn  @02A 02310000
OEXTPARMLIBPTR       DS    A      Pointer to USS Parmlib Data Area @DBA 02320000
OEXTARG_MAX          DS    FL4    Sysconf ARG_MAX value            @DCA 02330000
OEXTCLK_TCK          DS    FL4    Sysconf CLK_TCK value            @DCA 02340000
OEXTTZNAME_MAX       DS    FL4    Sysconf TZNAME_MAX value         @DCA 02350000
OEXTJOB_CONTROL      DS    FL4    Sysconf JOB_CONTROL value        @DCA 02360000
OEXTVERSION          DS    FL4    Sysconf VERSION value            @DCA 02370000
OEXT2_CHAR_TERM      DS    FL4    Sysconf CHAR_TERM value          @DCA 02380000
OEXTTTYGRPID         DS    FL4    sysconf TTY_GROUP value          @DCA 02390000
OEXTLKNKS            DS    A      Address of BPXLKNKS              @DIA 02391001
                     DS    1CL0004   Available                     @DIC 02400001
                     DS    0D     Ensure end on double word boundary    02410000
OEXT#LENGTH          EQU   *-OEXT Length of this structure              02420000
OEXT#UEGETPWNAME     EQU   1      Function code indicating user exit    02430000
*                                 called from getpwname            @P4A 02440000
** BPXYOEXT End                                                         02450000
         SPACE 3                                                        02460000
         AIF   ('&LIST' EQ 'YES').E411                                  02470000
         POP   PRINT                                                    02480000
.E411    ANOP  ,                                                        02490000
         MEND  ,                  Terminating PL/X comment           */ 02500000
*%OEXTPLS : ;                                                           02510000
*%IF OEXTBASE='' %THEN                                                  02520000
*  %DO;                                                                 02530000
*    %OEXTBASE='BASED(EcvtOext)';                                       02540000
*  %END;                                                                02550000
* %IF OEXTBASE='BASED(OexpPtr)' %THEN                                   02560005
*   %DO;                                                                02570000
*     DCL OexpPtr PTR(31);           /* Pointer to the OEXT  @04C    */ 02580005
*   %END;                                                               02590000
*DCL                                                                    02600000
* 1    Oext       OEXTBASE   Bdy(DWord),                                02610000
*  3   OextID     Char(4),   /* EBCDIC ID - OEXT                     */ 02620000
*  3   OextSP     Fixed(8),  /* Subpool number of this OEXT          */ 02630000
*  3   OextLen    Fixed(24), /* Length of this OEXT                  */ 02640000
*  3   OextFlgS   Char(4),   /* flag bytes                           */ 02650000
*    5 OextFlg1   Char(1),   /* flag byte 1                          */ 02660000
*      7 OextF1DefSeg   Bit(1),  /* OMVS default segment exists  @01A*/ 02670000
*      7 *              Bit(1),  /* Reserved                     @01A*/ 02680000
*      7 OextSysplexActv Bit(1), /* OMVS is a member of sysplex  @DAA*/ 02690000
*      7 OextNoAcct Bit(1),  /* Don't allow user to set acct_info via   02700000
*                               env var or spawn inhe struct     @P4A*/ 02710000
*      7 OextSetIP@ Bit(1),  /* If on daemons should store the IP@ of   02720000
*                               client into the ThliIP@          @P4A*/ 02730000
*      7 OextGrpIdValid Bit(1), /* If on, OextTtyGrpId is valid  @DCA*/ 02740000
*      7 OextServicesAvailable Bit(1), /* If on, SYSCALL services are   02750000
*                               avaiable.  The state of this flag       02760000
*                               can change over time, a result of       02770000
*                               shutdow/restart processing       @DFA*/ 02780000
*    5 OextFlg2   Char(1),   /* flag byte 2                          */ 02790000
*      7 OextCinetConf Bit(1),  /* Cinet is configured           @DGA*/ 02800000
*      7 OextIpV6      Bit(1),  /* IPv6 Configured & Supported   @DGA*/ 02810000
*      7 OextIPv6Conf  Bit(1),  /* IPv6 is Configured            @03A*/ 02820000
*    5 OextFlg3   Char(1),   /* flag byte 3                          */ 02830000
*      7 OextUmaskConf bit(1),  /* UMASK specified in BPXPRM     @04A*/ 02831001
*    5 OextFlg4   Char(1),   /* flag byte 4                          */ 02840000
*  3   OextStartm Bit(64),   /* Time OpenEdition MVS was started        02850000
*                               (TOD format)                         */ 02860000
*  3   OextSMFP   Pointer(31),/* Pointer to the SMF Process Accounting  02870000
*                               data collection routine.  This offset   02880000
*                               must not change.  It is hardcoded in    02890000
*                               executable macro BPXESMF.            */ 02900000
*  3   OextLvl    BIT(32),   /* OpenEdition MVS Release level           02910000
*                               indicator                               02920000
*                               (Multiple bits may be set, e.g.         02930000
*                               OEXT1120 and OEXT1130 will both         02940000
*                               be set)                          @P2A*/ 02950000
*    5  *           BIT(1),  /* Reserved                         @P2A*/ 02960000
*    5  Oext1120    BIT(1),  /* HOM1120 functions are present    @P2A*/ 02970000
*    5  Oext1130    BIT(1),  /* HOM1130 functions are present    @D2A*/ 02980000
*    5  Oext1130IPC BIT(1),  /* HOM1130 functions InterProcess          02990000
*                               Communication (IPC), NFSC, directory    03000000
*                               sticky bit, lchown UID=-1, are          03010000
*                               supported.                       @D5A*/ 03020000
*    5  Oext1140    BIT(1),  /* HOM1140 functions are present    @D6A*/ 03030000
*    5  Oext1150    BIT(1),  /* HBB6603 functions are present.  Future  03040000
*                               OpenEdition release indicators will     03050000
*                               not be added since OpenEdition MVS is   03060000
*                               now an integral part of the BCP. @P3C*/ 03070000
*    5  OextTECFS   BIT(1),  /* The Thli ECB comunication function is   03080000
*                               supported                        @D9A*/ 03090000
*    5  OextTAFS    BIT(1),  /* The MvsThreadAffinity function is       03100000
*                               supported                        @DDA*/ 03110000
*    5  OextPqg     BIT(1),  /* The Pthread_quiesce_and_get_np          03120000
*                               function (BPX1PQG) is supported  @DDA*/ 03130000
*    5  OextMmapExtKey BIT(1), /* The mmap extended Key function is     03140000
*                               supported                        @DHA*/ 03150000
*  3   OextBpxAppcExit Ptr(31),/* Pointer to the OpenMVS Exit for APPC  03160000
*                                processing                      @D4A*/ 03170000
*  3   OextTIXP   Pointer(31),/* Pointer to OpenEdition timer exit.     03180000
*                               Invoked by IEAVLEXT.             @D3A*/ 03190000
*  3   OextRunOptsPtr  Ptr(31),/* Pointer to the RUNOPTS string         03200000
*                                specified at IPL time           @D7A*/ 03210000
*  3   OextRunOptsLen Fixed(31),/* Length of the RUNOPTS string         03220000
*                                specified at IPL time           @D7A*/ 03230000
*  3   OextBpxWlmExit Ptr(31), /* Pointer to OpenMVS Exit for WLM       03240000
*                                IWMUWON timeout processing      @D8C*/ 03250000
*  3   OextUserExit   Ptr(31), /* Pointer to user defined Key 0 user    03260000
*                                 exit                           @P4A*/ 03270000
*  3   OextMsgAcbRtn  Ptr(31), /* Pointer to the JESYSMSG ACB PUT       03280000
*                                 routine                        @02A*/ 03290000
*  3   OextParmLibPtr Ptr(31), /* Pointer to USS Parmlib Data Area      03300000
*                                                                @DBA*/ 03310000
*  3   OextArg_Max     Fixed(31), /* SC_ARG_MAX value            @DCA*/ 03320000
*  3   OextClk_Tck     Fixed(31), /* SC_CLK_TCK value            @DCA*/ 03330000
*  3   OextTzname_Max  Fixed(31), /* SC_TZNAME_MAX value         @DCA*/ 03340000
*  3   OextJob_Control Fixed(31), /* SC_JOB_CONTROL value        @DCA*/ 03350000
*  3   OextVersion     Fixed(31), /* SC_VERSION value            @DCA*/ 03360000
*  3   Oext2_Char_Term Fixed(31), /* SC_CHAR_TERM value          @DCA*/ 03370000
*  3   OextTtyGrpId    Fixed(31), /* SC_TTY_GROUP value          @DCA*/ 03380000
*  3   OextLKNKS      Ptr(31),  /* Entry point for BPXLKNKS      @DIA*/ 03390001
*  3   *              Char(04), /* Available                     @DIC*/ 03391001
*  3 * CHAR(0) BDY(DWORD);   /* Ensure  CB ends on DWORD boundary    */ 03400000
*DCL                                                                    03410000
*  Oext#Id    Char(4)   CONSTANT('OEXT'), /* Control Block Acronym   */ 03420000
*  Oext#Len   Fixed(24) CONSTANT(LENGTH(Oext)),  /* Length of OEXT   */ 03430000
*  Oext#SP    Fixed(8)  CONSTANT(241);  /* Subpool for the OEXT      */ 03440000
*Dcl                                                                    03450000
*  Oext#UEGetPwName Fixed(32) Constant(1); /* Func code for user exit   03460000
*                                     indicating call is from getpwname 03470000
*                                                                @P4A*/ 03480000
*/* If OpenMVS Exit Dcls for APPC not requested skip dcls        @01A*/ 03490000
* %IF OEXTAPPCEXIT^='YES' %THEN                                         03500000
*   %GOTO ENDOEXT;                                                      03510000
*                                                                       03520000
*/* NOTE:  The following declares are used and required by APPC. @01A*/ 03530000
*                                                                       03540000
*/* Declares for the OpenMVS Exit that is invoked by APPC during Fork   03550000
*   and Exec Processing. The exit is invoked from Allocate_Conversation 03560000
*   in the parent and during Job Initiation in the Child.        @01A*/ 03570000
*DECLARE                                                                03580000
*  BPX_Exit ENTRY            /* OpenMVS Exit Routine Entry       @01A*/ 03590000
*           OPTIONS(AMODE(31) ENV(PRIMARY))                             03600000
*           BASED (OextBpxAppcExit)                                     03610000
*           VALRG(*);                                                   03620000
*                                                                       03630000
*DECLARE                     /* OpenMVS Exit Parameters          @01A*/ 03640000
*  BPX_Exit_Function_Code Fixed(32),      /* Function Code       @01A*/ 03650000
*  BPX_Exit_Data_Area     Ptr(31),        /* Data Area passed between   03660000
*                                            Alloc_Conv Exit and Job    03670000
*                                            Initiation Exit     @01A*/ 03680000
*  BPX_Exit_SJF_Token     Char(8),        /* SJF Token for SWAREQ       03690000
*                                                                @01A*/ 03700000
*  BPX_Exit_Return_Userid Char(8),        /* Userid Returned by Job     03710000
*                                            Initiation Exit     @01A*/ 03720000
*  1 BPX_Exit_Return_Flags  Fixed(32),    /* Indicators Returned by Job 03730000
*                                            Initiation Exit     @01A*/ 03740000
*    3 BPX_Exit_Tailor_Account Bit(1),                                  03750000
*    3 BPX_Exit_Tailor_Sysout Bit(1),                                   03760000
*  BPX_Exit_Return_Code   Fixed(32);      /* Return Code         @01A*/ 03770000
*                                                                       03780000
*DECLARE                     /* OpenMVS Exit Function Codes      @01A*/ 03790000
*  BPX_Exit_Alloc_Conv  Fixed(32) Constant(0), /* Allocate_Conversation 03800000
*                                                                @01A*/ 03810000
*  BPX_Exit_Fork        Fixed(32) Constant(1), /* Fork processing       03820000
*                                                                @01A*/ 03830000
*  BPX_Exit_Exec        Fixed(32) Constant(2); /* Exec processing       03840000
*                                                                @01A*/ 03850000
*                                                                       03860000
*DECLARE                            /* OpenMVS Exit Return Codes @01A*/ 03870000
*  BPX_Exit_Ok            Fixed(32) Constant(0);                        03880000
*                                                                       03890000
*DECLARE                            /* OpenMVS Exit NULL Return_Userid  03900000
*                                      Constant                  @01A*/ 03910000
*  BPX_Null_Userid        Bit(64) Constant('0000000000000000'x);        03920000
*                                                                       03930000
*%ENDOEXT: ;                                                            03940000
*/* If OpenMVS Exit Dcls for WLM not requested skip dcls         @D8A*/ 03950000
*   %IF OEXTWLMEXIT = 'YES' %THEN   /*                           @D8A*/ 03960000
*     %DO;                          /*                           @D8A*/ 03970000
*       DCL BPX_IWMUWON_TOExit ENTRY    /* OpenMVS IWMUWON TimeOut Exit 03980000
*                                      Routine Entry                 */ 03990000
*           (TOE_Udata:= CHar(16) Input) /* Input is the 16             04000000
*                                      byte user data area provided     04010000
*                                      on the IWMUWON request        */ 04020000
*           OPTIONS(AMODE(31) ENV(PRIMARY)) BASED(OextBpxWlmExit) VALRG 04030000
*           (*);                    /*                           @D8A*/ 04040000
*     %END;                         /*                           @D8A*/ 04050000
