*                                                                       00050000
* %DCL BPXYSMC_INCLUDED CHAR EXT;                                       00100000
* %DEACTIVATE BPXYSMC_INCLUDED;                                         00150000
* %IF BPXYSMC_INCLUDED = '' %THEN                                       00200000
* %DO;                                                                  00250000
*/* Macro made bi-lingual on 02161. CBGEN compile date 02143         */ 00300000
*% /*                                                                   00350000
         MACRO                                                          00400000
         BPXYSMC &DSECT=YES,&LIST=YES,&TITLE=YES,&SMC_FCNFLAGS=YES,    *00450000
               &SMCT=COND                                               00500000
         GBLC  &BPXYSMC_INCLUDED                                        00550000
         GBLC  &ZCBPRINT                                                00600000
&BPXYSMC_INCLUDED SETC 'YES'                                            00650000
         AIF   ('&LIST' EQ 'NONE').P0                                   00700000
         AIF   ('&TITLE' EQ 'NO').P5                                    00750000
 TITLE   'BPXYSMC  - BPX1SMC Interface Declares                      '  00800000
.P5      ANOP                                                           00850000
**/ BPXYSMC_1:;                                                         00900000
*/****START OF SPECIFICATIONS****************************************** 00950000
*                                                                       01000000
*    $MAC (BPXYSMC) COMP(SCPX1) PROD(BPX):                              01050000
*                                                                       01100000
*01* MACRO NAME: BPXYSMC                                                01150000
*                                                                       01200000
*01* DSECT NAME: N/A                                                    01250000
*                                                                       01300000
*01* DESCRIPTIVE NAME: BPX1SMC Interface Declares                       01350000
*                                                                       01400000
*02*   ACRONYM: N/A                                                     01450000
**/                                                                     01500000
*/*01* PROPRIETARY STATEMENT=                                        */ 01550000
*/***PROPRIETARY_STATEMENT********************************************/ 01600000
*/*                                                                  */ 01650000
*/*                                                                  */ 01700000
*/* LICENSED MATERIALS - PROPERTY OF IBM                             */ 01750000
*/* THIS MACRO IS "RESTRICTED MATERIALS OF IBM"                      */ 01800000
*/* 5694-A01 (C) COPYRIGHT IBM CORP. 2003                            */ 01850000
*/*                                                                  */ 01900000
*/* STATUS= HBB7709                                                  */ 01950000
*/*                                                                  */ 02000000
*/***END_OF_PROPRIETARY_STATEMENT*************************************/ 02050000
*/*                                                                     02100000
*01* EXTERNAL CLASSIFICATION:                                           02150000
*                                                                       02200000
*02*   PI: BASE                                                         02250000
*                                                                       02300000
*01* END OF EXTERNAL CLASSIFICATION:                                    02350000
*                                                                       02400000
*01* FUNCTION:                                                          02450000
*      Contains Declares and Constants for BPX1SMC Callable Service     02500000
*                                                                       02550000
*01* METHOD OF ACCESS:                                                  02600000
*                                                                       02650000
*02*   PL/X:                                                            02700000
*        %INCLUDE SYSLIB(BPXYSMC)                                       02750000
*                                                                       02800000
*02*   ASM:                                                             02850000
*       BPXYSMC                                                         02900000
*                                                                       02950000
*01* SIZE:                                                              03000000
*            SMC_FCNFLAGS -- X'0004' bytes                              03050000
*            SMCT         -- X'0008' bytes                              03100000
*                                                                       03150000
*01* POINTED TO BY: N/A                                                 03200000
*                                                                       03250000
*01* CREATED BY: N/A                                                    03300000
*                                                                       03350000
*01* DELETED BY: N/A                                                    03400000
*                                                                       03450000
*01* STORAGE ATTRIBUTES:                                                03500000
*02*   SUBPOOL/DATASPACE:  N/A                                          03550000
*02*   KEY:                N/A                                          03600000
*02*   RESIDENCY:          N/A                                          03650000
*                                                                       03700000
*01* FREQUENCY: N/A                                                     03750000
*                                                                       03800000
*01* SERIALIZATION: N/A                                                 03850000
*                                                                       03900000
*01* DEPENDENCIES: None                                                 03950000
*                                                                       04000000
*01* NOTES: None.                                                       04050000
*                                                                       04100000
*01* COMPONENT: OpenMVS (SCPX1)                                         04150000
*                                                                       04200000
*01* DISTRIBUTION LIBRARY:  AMACLIB                                     04250000
*                                                                       04300000
*01* EYE-CATCHER: None                                                  04350000
*02*   OFFSET:  -                                                       04400000
*02*   LENGTH:  -                                                       04450000
*                                                                       04500000
*01* CHANGE-ACTIVITY:                                                   04550000
* $D0=DJKA586 HBB7709 020505 PDI6: Shared Mutex/Condvar Support         04600000
*                                                                       04650000
****END OF SPECIFICATIONS*********************************************/ 04700000
*% /*                                                                   04750000
.P0      ANOP                                                           04800000
         AIF   ('&ZCBPRINT' EQ 'NO').P1                                 04850000
         AIF   ('&LIST' EQ 'YES').P2                                    04900000
.P1      ANOP                                                           04950000
         PUSH  PRINT                                                    05000000
         PRINT OFF                                                      05050000
.P2      ANOP                                                           05100000
*                                                                       05150000
* ********************************************************************  05200000
* *   Define equates for FcnCode parameter                           *  05250000
* ********************************************************************  05300000
*                                                                       05350000
*                                                                       05400000
SMC_WAIT EQU   1         Wait function request                          05450000
SMC_POST EQU   2         Post function request                          05500000
SMC_INIT EQU   4         Initialization function request                05550000
SMC_DESTROY EQU 8        Destroy function request                       05600000
SMC_POSTALL EQU 16       Postall function request                       05650000
SMC_SETUPTOWAIT EQU 32   SetupToWait function request                   05700000
SMC_CANCELSETUPTOWAIT EQU 64 CancelSetupToWait function request         05750000
*                                                                       05800000
* ********************************************************************  05850000
* * Mapping for FcnFlags parameter                                   *  05900000
* ********************************************************************  05950000
*                                                                       06000000
*                                                                       06050000
         AIF   ('&SMC_FCNFLAGS' EQ 'NO').L0002                          06100000
         AIF   ('&DSECT' EQ 'YES').L0003                                06150000
         AIF   ('&SMC_FCNFLAGS' NE 'YES').L0002                         06200000
SMC_FCNFLAGS DS 0F                                                      06250000
         AGO   .L0004                                                   06300000
.L0003   ANOP                                                           06350000
SMC_FCNFLAGS DSECT                                                      06400000
.L0004   ANOP                                                           06450000
SMC_FCNFLAGSB1 DS 0BL1                                                  06500000
SMC_MUTEX EQU  X'80'                                                    06550000
SMC_CONDVAR EQU X'40'                                                   06600000
SMC_TIMEDWAIT EQU X'20'                                                 06650000
SMC_OUTSIDEWAIT EQU X'10'                                               06700000
         ORG   SMC_FCNFLAGSB1+X'00000001'                               06750000
SMC_FCNFLAGSB2 DS 1BL1                                                  06800000
SMC_FCNFLAGSB3 DS 1BL1                                                  06850000
SMC_FCNFLAGSB4 DS 1BL1                                                  06900000
SMC_FCNFLAGS_LEN EQU *-SMC_FCNFLAGS                                     06950000
.L0002   ANOP                                                           07000000
*                                                                       07050000
* ********************************************************************  07100000
* * Mapping for Time Structure pointed to by TimeStrucAddr parameter *  07150000
* ********************************************************************  07200000
*                                                                       07250000
*                                                                       07300000
         AIF   ('&SMCT' EQ 'NO').L0005                                  07350000
         AIF   ('&DSECT' EQ 'YES').L0006                                07400000
         AIF   ('&SMCT' NE 'YES').L0005                                 07450000
SMCT     DS    0F                                                       07500000
         AGO   .L0007                                                   07550000
.L0006   ANOP                                                           07600000
SMCT     DSECT                                                          07650000
.L0007   ANOP                                                           07700000
SMCTSECS DS    1FL4      The time to wait for the condition variable   *07750000
                         expressed in seconds. Seconds can be any      *07800000
                         value greater or equal to 0 or less than or   *07850000
                         equal to 4,294,967,295.                        07900000
SMCTNANOSECS DS 1FL4     The time in nanoseconds to be added to        *07950000
                         SmctSecs to wait for condition variable.      *08000000
                         Nanoseconds can be any value greater than or  *08050000
                         equal to 0 and less than 1,000,000,000.        08100000
SMCT_LEN EQU   *-SMCT                                                   08150000
.L0005   ANOP                                                           08200000
         AIF   ('&ZCBPRINT' EQ 'NO').P3                                 08250000
         AIF   ('&LIST' EQ 'YES').P4                                    08300000
.P3      ANOP                                                           08350000
         POP   PRINT                                                    08400000
.P4      ANOP                                                           08450000
.P_EXIT  ANOP                                                           08500000
         MEND                                                           08550000
**/ BPXYSMC_2:;                                                         08600000
* %BPXYSMC_INCLUDED = 'YES';                                            08650000
* %DCL ZCBPRINT CHAR EXT;                                               08700000
* %DEACTIVATE ZCBPRINT;                                                 08750000
* %DCL BPXYSMC_LIST CHAR EXT;                                           08800000
* %DEACTIVATE BPXYSMC_LIST;                                             08850000
* %IF BPXYSMC_LIST ^= 'NO' &                                            08900000
*    ZCBPRINT ^= 'NO' %THEN                                             08950000
*   %GOTO BPXYSMC_3;                                                    09000000
*   @LIST PUSH NOECHO;                                                  09050000
*   @LIST NOASSEMBLE NOECHO;                                            09100000
*   @LIST OFF C NOECHO;                                                 09150000
* %BPXYSMC_3:;                                                          09200000
*/* Start of PL/X Source                                             */ 09250000
*                                                               @EJECT; 09300000
*/********************************************************************/ 09350000
*/*   Define equates for FcnCode parameter                           */ 09400000
*/********************************************************************/ 09450000
*Dcl                                                         /*      */ 09500000
*  SMC_WAIT       Fixed(32) Constant(1), /* Wait   function             09550000
*                                   request                          */ 09600000
*  SMC_POST       Fixed(32) Constant(2), /* Post   function             09650000
*                                   request                          */ 09700000
*  SMC_INIT       Fixed(32) Constant(4), /* Initialization function     09750000
*                                   request                          */ 09800000
*  SMC_DESTROY    Fixed(32) Constant(8), /* Destroy function            09850000
*                                   request                          */ 09900000
*  SMC_POSTALL    Fixed(32) Constant(16),/* Postall function            09950000
*                                   request                          */ 10000000
*  SMC_SETUPTOWAIT Fixed(32) Constant(32),/* SetupToWait function       10050000
*                                   request                          */ 10100000
*  SMC_CANCELSETUPTOWAIT Fixed(32) Constant(64);/* CancelSetupToWait    10150000
*                                   function request                 */ 10200000
*                                                                       10250000
*/********************************************************************/ 10300000
*/* Mapping for FcnFlags parameter                                   */ 10350000
*/********************************************************************/ 10400000
*DCL                                                                    10450000
* 1 SMC_FcnFlags Fixed(32) Based,                                       10500000
*  3 SMC_FcnFlagsB1   Bit(8),                                           10550000
*   5 SMC_Mutex       Bit(1),                                           10600000
*   5 SMC_Condvar     Bit(1),                                           10650000
*   5 SMC_TimedWait   Bit(1),                                           10700000
*   5 SMC_OutsideWait Bit(1),                                           10750000
*  3 SMC_FcnFlagsB2   Bit(8),                                           10800000
*  3 SMC_FcnFlagsB3   Bit(8),                                           10850000
*  3 SMC_FcnFlagsB4   Bit(8);                                           10900000
*/********************************************************************/ 10950000
*/* Mapping for Time Structure pointed to by TimeStrucAddr parameter */ 11000000
*/********************************************************************/ 11050000
*DCL                                                                    11100000
*1 Smct Based,                                                          11150000
*  3 SmctSecs        Fixed(32), /* The time to wait for the condition   11200000
*                                  variable expressed in seconds.       11250000
*                                  Seconds can be any value greater     11300000
*                                  or equal to 0 or less than or equal  11350000
*                                  to 4,294,967,295.                 */ 11400000
*  3 SmctNanoSecs    Fixed(32); /* The time in nanoseconds to be added  11450000
*                                  to SmctSecs to wait for condition    11500000
*                                  variable.  Nanoseconds can be any    11550000
*                                  value greater than or equal to 0 and 11600000
*                                  less than 1,000,000,000.             11650000
*                                                                    */ 11700000
*/* End of PL/X Source                                               */ 11750000
* %IF BPXYSMC_LIST ^= 'NO' &                                            11800000
*    ZCBPRINT ^= 'NO' %THEN                                             11850000
*   %GOTO BPXYSMC_4;                                                    11900000
*   @LIST POP NOECHO;                                                   11950000
* %BPXYSMC_4:;                                                          12000000
* %END;                                                                 12050000
