*        %GOTO RFIPRO   ;         /* Bilingual header                   00050000
         MACRO                                                          00100000
         BPXYRFIS  &DSECT=YES,&LIST=YES                                 00150000
         GBLB  &RFI411                                                  00200000
         AIF   (&RFI411 EQ 1).E411                                      00250000
&RFI411 SETB   1                                                        00300000
         AIF   ('&LIST' EQ 'YES').A411                                  00350000
         PUSH  PRINT  BPXYRFIS: Register File Interest Structures       00400000
         PRINT OFF                                                      00450000
         AGO   .A411                                                    00500000
*                                  */                                   00550000
*%RFIPRO  : ;                                                           00600000
*/****START OF SPECIFICATIONS****************************************** 00650000
*                                                                       00700000
*    $MAC (BPXYRFIS) COMP(SCPX1) PROD(BPX):                             00750000
*                                                                       00800000
*01* MACRO NAME: BPXYRFIS                                               00850000
*                                                                       00900000
*01* DSECT NAME: RFIS                                                   00950000
*                                                                       01000000
*01* DESCRIPTIVE NAME: Register File Interest Structures                01050000
*                                                                       01100000
*02*   ACRONYM: RFIS                                                    01150000
**/                                                                     01200000
*/*01* PROPRIETARY STATEMENT=                                        */ 01250000
*/***PROPRIETARY_STATEMENT********************************************/ 01300000
*/*                                                                  */ 01350000
*/*                                                                  */ 01400000
*/* LICENSED MATERIALS - PROPERTY OF IBM                             */ 01450000
*/* THIS MACRO IS "RESTRICTED MATERIALS OF IBM"                      */ 01500000
*/* 5694-A01 (C) COPYRIGHT IBM CORP. 1999, 2003                      */ 01550000
*/*                                                                  */ 01600000
*/* STATUS= HBB7709                                                  */ 01650000
*/*                                                                  */ 01700000
*/***END_OF_PROPRIETARY_STATEMENT*************************************/ 01750000
*/*                                                                     01800000
*                                                                       01850000
*01* EXTERNAL CLASSIFICATION:  GUPI                                     01900000
*01* END OF EXTERNAL CLASSIFICATION:                                    01950000
*                                                                       02000000
*01* FUNCTION:                                                          02050000
*                                                                       02100000
*      These structures used to register interest in a file             02150000
*      and to be notified when that file changes.                       02200000
*                                                                       02250000
*01* METHOD OF ACCESS:                                                  02300000
*                                                                       02350000
*02*   PL/X:                                                            02400000
*                                                                       02450000
*        %INCLUDE SYSLIB(BPXYRFIS)                                      02500000
*        All structures are Based.                                      02550000
*        To localize a structure use:                                   02600000
*             Dcl LocalXXXX Char(Length(XXXX)) Bdy(Word)                02650000
*             Rfy XXXX Based(Addr(LocalXXXX))                           02700000
*        To use a pointer use:                                          02750000
*             Dcl XxxxPtr Ptr                                           02800000
*             Rfy XXXX Based(XxxxPtr)                                   02850000
*                                                                       02900000
*                                                                       02950000
*02*   ASM:                                                             03000000
*        With DSECT=YES, a DSECT is produced and "USING RFIS,reg"       03050000
*        or "USING RFIM,reg" is required for addressability.            03100000
*        Here "reg" contains the address of RFIS#LENGTH or RFIM#LENGTH  03150000
*        bytes of storage.                                              03200000
*        With DSECT=NO, storage is allocated in line and                03250000
*        addressability is provided thru that DSECT or CSECT.           03300000
*        the default is DSECT=YES.                                      03350000
*                                                                       03400000
*01* SIZE: Length(RFIS) or Length(RFIM)                                 03450000
*                                                                       03500000
*01* POINTED TO BY: N/A                                                 03550000
*                                                                       03600000
*01* CREATED BY: Caller of system call                                  03650000
*                                                                       03700000
*01* DELETED BY: Caller of system call                                  03750000
*                                                                       03800000
*01* STORAGE ATTRIBUTES:                                                03850000
*02*   SUBPOOL/DATASPACE:                                               03900000
*02*   KEY:                N/A                                          03950000
*02*   RESIDENCY:          N/A                                          04000000
*                                                                       04050000
*01* FREQUENCY: 1 per call to ioctl()                                   04100000
*                                                                       04150000
*01* SERIALIZATION: N/A                                                 04200000
*                                                                       04250000
*01* DEPENDENCIES: None.                                                04300000
*                                                                       04350000
*01* NOTES:                                                             04400000
*                                                                       04450000
*01* COMPONENT: OpenMVS (SCPX1)                                         04500000
*                                                                       04550000
*01* DISTRIBUTION LIBRARY:  AMACLIB                                     04600000
*                                                                       04650000
*01* EYE-CATCHER: None                                                  04700000
*02*   OFFSET:                                                          04750000
*02*   LENGTH:                                                          04800000
*                                                                       04850000
*01* CHANGE-ACTIVITY:                                                   04900000
*                                                                       04950000
*  $D0=PWA0391   JBB6607  980627  PDJT: Register File Interest  A326.01 05000000
*  $P1=PYN0220   HBB7708  020301  PDFO: Bilingual fixup                 05050000
*                                                                       05100000
****END OF SPECIFICATIONS*********************************************/ 05150000
*        %GOTO RFIPLS   ;         /* Bilingual header                   05200000
.A411    ANOP  ,                                                        05250000
** BPXYRFIS                                                             05300000
*                                                                       05350000
*  Register File Interest Structure                                     05400000
*                                                                       05450000
         AIF   ('&DSECT' EQ 'NO').B411                                  05500000
RFIS                 DSECT ,                                            05550000
         AGO   .C411                                                    05600000
.B411    ANOP  ,                                                        05650000
RFIS                 DS    0D                                           05700000
.C411    ANOP  ,                                                        05750000
RFIS_CMD             DS    H           CMD = REG OR UNREG               05800000
RFIS_FLAGS           DS    0H          FLAGS                            05850000
RFIS_FLAGS1          DS    XL1          FLAGS Byte 1                    05900000
RFIS_LOSTMSGS        EQU   X'80'         MSGSND HAS FAILED              05950000
RFIS_FLAGS2          DS    XL1          FLAGS Byte 2                    06000000
RFIS_RFTOK           DS    CL8         SYSTEM REGISTERED FILE TOKEN     06050000
RFIS_QID             DS    F             IPC MSG QUEUE ID               06100000
RFIS_TYPE            DS    F             IPC MSG TYPE                   06150000
RFIS_UTOK            DS    CL8           IPC MSG USER TOKEN             06200000
*                                                                       06250000
RFIS#LENGTH          EQU   *-RFIS Length of this structure              06300000
*                                                                       06350000
** RFIS_CMD Values                                                      06400000
RFIS#REG             EQU   1                                            06450000
RFIS#UNREG           EQU   2                                            06500000
*                                                                       06550000
*  Registered File invalidate Message                                   06600000
*                                                                       06650000
         AIF   ('&DSECT' EQ 'NO').B412                                  06700000
RFIM                 DSECT ,                                            06750000
         AGO   .C412                                                    06800000
.B412    ANOP  ,                                                        06850000
RFIM                 DS    0D                                           06900000
.C412    ANOP  ,                                                        06950000
RFIM_TYPE            DS    F        IPC MSG TYPE, FROM RFIS_TYPE        07000000
RFIM_TEXT            DS    0CL12    IPC MSG TEXT:                       07050000
RFIM_UTOK            DS    CL8        USER TOKEN, FROM RFIS_UTOK        07100000
RFIM_EVENT           DS    H          CHANGE EVENT                      07150000
RFIM_FLAGS           DS    0H         FLAGS                             07200000
RFIM_FLAGS1          DS    XL1         FLAGS Byte 1                     07250000
RFIM_LOSTMSGS        EQU   X'80'         MSGSND HAS FAILED              07300000
RFIM_FLAGS2          DS    XL1         FLAGS Byte 2                     07350000
*                                                                       07400000
RFIM#LENGTH          EQU   *-RFIM Length of this structure              07450000
*                                                                       07500000
** RFIM_EVENT Values                                                    07550000
RFIM#WRITE           EQU   1         WRITE, TRUNC, OPEN(O_TRUNC)        07600000
RFIM#ATTR            EQU   2         ANY ATTR CHANGE, CHMOD, ETC.       07650000
RFIM#UNLINK          EQU   3         ANY NAME UNLINKED                  07700000
RFIM#RENAME          EQU   4         ANY NAME RENAMED                   07750000
RFIM#UNMOUNT         EQU   5         CONTAINING FILE SYS UNMNTED        07800000
*                                                                       07850000
** BPXYRFIS End                                                         07900000
         SPACE 3                                                        07950000
         AIF   ('&LIST' EQ 'YES').E411                                  08000000
         POP   PRINT                                                    08050000
.E411    ANOP  ,                                                        08100000
         MEND  ,                  Terminating PL/X comment           */ 08150000
*%RFIPLS : ;                                                            08200000
*                                                                       08250000
* /*-----------------------------------------------------------------*/ 08300000
* /*---  Register File Interest Structure                         ---*/ 08350000
* /*                                                                 */ 08400000
* /* Input Argument to ioctl to register or unregister a file.       */ 08450000
* /*                                                                 */ 08500000
* /*-----------------------------------------------------------------*/ 08550000
* Dcl 1 Rfis Based,                                                     08600000
*       2 Rfis_Cmd    Fixed(16),     /* Cmd = Reg or Unreg           */ 08650000
*       2 Rfis_Flags  Bit(16),       /* Flags                        */ 08700000
*         3 Rfis_LostMsgs Bit(1),    /*   MsgSnd has failed          */ 08750000
*       2 Rfis_RfTok  Char(8),       /* System Registered File Token */ 08800000
*                                    /*   Out from Reg, In to UnReg  */ 08850000
*                                    /* For Reg call:                */ 08900000
*       2 Rfis_Qid    Fixed(32),     /*   IPC Msg Queue Id           */ 08950000
*       2 Rfis_Type   Fixed(31),     /*   IPC Msg Type               */ 09000000
*       2 Rfis_Utok   Char(8);       /*   IPC Msg User Token         */ 09050000
*                                                                       09100000
*                    /* Rfis_Cmd Values                              */ 09150000
* Dcl ( Rfis#Reg   Constant(1),                /* Register File      */ 09200000
*       Rfis#UnReg Constant(2) ) Fixed(16);    /* UnRegister File    */ 09250000
*                                                                       09300000
*                                                                       09350000
* /*-----------------------------------------------------------------*/ 09400000
* /*---  Registered File Invalidate Message                       ---*/ 09450000
* /*                                                                 */ 09500000
* /* Sent to Rfis_Qid when a registered file is changed.             */ 09550000
* /*                                                                 */ 09600000
* /*-----------------------------------------------------------------*/ 09650000
* Dcl 1 Rfim Based,                                                     09700000
*       2 Rfim_Type      Fixed(31),  /* IPC Msg Type, from Rfis_Type */ 09750000
*       2 Rfim_Text ,                /* IPC Msg Text:                */ 09800000
*         3 Rfim_Utok    Char(8),    /*   User Token, from Rfis_Utok */ 09850000
*         3 Rfim_Event   Fixed(16),  /*   Change Event               */ 09900000
*         3 Rfim_Flags   Bit(16),    /*   Flags:                     */ 09950000
*           5 Rfim_LostMsgs Bit(1);  /*    MsgSnd has failed         */ 10000000
*                                                                       10050000
*                                                                       10100000
*                    /* Rfim_Event Values                            */ 10150000
* Dcl ( Rfim#Write   Constant(1),    /* Write, Trunc, Open(O_TRUNC)  */ 10200000
*       Rfim#Attr    Constant(2),    /* Any Attr change, chmod, etc. */ 10250000
*       Rfim#Unlink  Constant(3),    /* Any name unlinked            */ 10300000
*       Rfim#Rename  Constant(4),    /* Any name renamed             */ 10350000
*       Rfim#Unmount Constant(5)     /* Containing file sys unmnted  */ 10400000
*                       ) Fixed(16);                                    10450000
*                                                                       10500000
