*        %GOTO STATPRO  ;         /* Bilingual header                   00010000
         MACRO                                                          00020000
         BPXYSTAT  &DSECT=YES,&LIST=YES                       8@D1A     00030000
         GBLB  &STAT411                                                 00040000
         AIF   (&STAT411 EQ 1).E411                                     00050000
&STAT411 SETB  1                                                        00060000
         AIF   ('&LIST' EQ 'YES').A411                                  00070000
         PUSH  PRINT  BPXYSTAT: stat system call structure              00080000
         PRINT OFF                                                      00090000
         AGO   .A411                                                    00100000
*                                  */                                   00110000
*%STATPRO : ;                                                           00120000
*/****START OF SPECIFICATIONS****************************************** 00130000
*                                                                       00140000
*    $MAC (BPXYSTAT) COMP(SCPX1) PROD(BPX):                             00150000
*                                                                       00160000
*01* MACRO NAME: BPXYSTAT                                               00170000
*                                                                       00180000
*01* DSECT NAME: STAT                                                   00190000
*                                                                       00200000
*01* DESCRIPTIVE NAME: mapping of stat system call structure            00210000
*                                                                       00220000
*02*   ACRONYM: STAT                                                    00230000
**/                                                                     00240000
*/*01* PROPRIETARY STATEMENT=                                        */ 00250000
*/***PROPRIETARY_STATEMENT********************************************/ 00260000
*/*                                                                  */ 00270000
*/*                                                                  */ 00280000
*/* LICENSED MATERIALS - PROPERTY OF IBM                             */ 00290000
*/* THIS MACRO IS "RESTRICTED MATERIALS OF IBM"                      */ 00300000
*/* 5694-A01 COPYRIGHT IBM CORP. 1993, 2015                          */ 00310002
*/*                                                                  */ 00320000
*/* STATUS= HBB77A0                                                  */ 00330002
*/*                                                                  */ 00340000
*/***END_OF_PROPRIETARY_STATEMENT*************************************/ 00350000
*/*                                                                     00360000
*                                                                       00370000
*01* EXTERNAL CLASSIFICATION:  GUPI                                     00380000
*01* END OF EXTERNAL CLASSIFICATION:                                    00390000
*                                                                       00400000
*01* FUNCTION:                                                          00410000
*                                                                       00420000
*      The STAT maps the structure returned by the stat() system call.  00430000
*                                                                       00440000
*                                                                       00450000
*01* METHOD OF ACCESS:                                                  00460000
*                                                                       00470000
*02*   PL/X:                                                            00480000
*                                                                       00490000
*        %INCLUDE SYSLIB(BPXYSTAT)                                      00500000
*        By default, the STAT is based on StatPtr. If                   00510000
*        other basing is desired, use %STATBASE='BASED(XXXXXX)'.        00520000
*        If %STATBASE='BASED(StatPtr)' is coded, a Declare for          00530000
*        StatPtr is also generated.                                     00540000
*                                                                       00550000
*        By default, the STAT uses no VIA.  If access                   00560000
*        register usage is desired, code %STATVIA='VIA(XXXXXX)'.        00570000
*        If %STATVIA='VIA(StatAlet)' is coded, a Declare for            00580000
*        StatAlet is also generated.                                    00590000
*                                                                       00600000
*02*   ASM:                                                             00610000
*        With DSECT=NO, storage is allocated in line                    00620000
*        and addressability is provided thru that DSECT or CSECT.       00630000
*        With DSECT=YES, a DSECT is produced and "USING STAT,reg"       00640000
*        is required for addressability.  Here "reg" contains the       00650000
*        address of STAT#LENGTH bytes of storage.                       00660000
*        The default is DSECT=YES.                                      00670000
*                                                                       00680000
*01* SIZE: STAT#LENGTH                                                  00690000
*                                                                       00700000
*01* POINTED TO BY: StatPtr                                             00710000
*                                                                       00720000
*01* CREATED BY: Storage obtained by caller of system call              00730000
*                                                                       00740000
*01* DELETED BY: Caller of system call                                  00750000
*                                                                       00760000
*01* STORAGE ATTRIBUTES:                                                00770000
*02*   SUBPOOL/DATASPACE:  N/A                                          00780000
*02*   KEY:                N/A                                          00790000
*02*   RESIDENCY:          N/A                                          00800000
*                                                                       00810000
*01* FREQUENCY: 1 per call to stat()                                    00820000
*                                                                       00830000
*01* SERIALIZATION: N/A                                                 00840000
*                                                                       00850000
*01* DEPENDENCIES: None                                                 00860000
*                                                                       00870000
*01* NOTES:                                                             00880000
*                                                                       00890000
*      1) Mode flags are mapped by BPXYMODE                             00900000
*      2) The size of the STAT structure is defined by st#Len (PL/X)    00910000
*         and ST#LEN (ASM).                                             00920000
*                                                                       00930000
*      3) The following mapping macros are closely related.             00940000
*                                                                       00950000
*      BPXYATT  - Interface between an application and the LFS for      00960000
*                 BPX1CHA (chattr).  It maps the subset of BPXYATTR     00970000
*                 fields which can be modified, and the set flags.      00980000
*                 Fields match corresponding fields in BPXYATTR.        00990000
*                 The overall structures are not related.               01000000
*                 (Field size and type match, but not the offset.)      01010000
*                 AttSetFlags, AttGenMask, and AttGenValue structures   01020000
*                 match AttrSetFlags, AttrGenMask, and AttrGenValue     01030000
*                 in BPXYATTR.                                          01040000
*                                                                       01050000
*      BPXYATTR - Vnode interface to the LFS and PFS for file           01060000
*                 attributes.                                           01070000
*                 Fields match corresponding fields in BPXYATT.         01080000
*                 AttrStat, AttrStat2, and AttrStat3 structures match   01090000
*                 st_Part1, st_Part2,  and st_Part3 in BPXYSTAT.        01100000
*                                                                       01110000
*      BPXYSTAT - Interface between an application and the LFS for      01120000
*                 BPX1STA (stat).  It is the POSIX interface to the LFS 01130000
*                 for file attributes.  The st_Part1, st_Part2, and     01140000
*                 st_Part3 structures match AttrStat, AttrStat2,        01150000
*                 and AttrStat3 in BPXYATTR.  The entire BPXYSTAT       01160000
*                 structure also matches the stat.h structure.          01170000
*                                                                       01180000
*      BPXZATTR - Prior name of BPXYATTR.  To facilitate migration,     01190000
*                 BPXZATTR includes BPXYATTR.  In all new code,         01200000
*                 BPXYATTR should be used.                              01210000
*                                                                       01220000
*      BPXYVFSI - C program interface for the BPX1V (v_) services.      01230000
*                 The ATTR structure in BPXYVFSI matches the BPXYATTR   01240000
*                 structure.                                            01250000
*                                                                       01260000
*      stat.h   - C program interface for stat().  It is the POSIX C    01270000
*                 form of BPXYSTAT.  The entire stat.h structure        01280000
*                 matches the BPXYSTAT structure.                       01290000
*                                                                       01300000
*    4) The 8-byte time fields within st_LP64 will contain the     @D9A 01310000
*       same value as the cooresponding original 4-byte time       @D9A 01320000
*       fields until early in 2038.                                @D9A 01330000
*                                                                       01340000
*    5) Stat is an output structure and the amount of information  @D9A 01350000
*        returned may be limited by the amount of space provided.  @D9A 01360000
*       The Version 2 structure will be returned if enough space   @D9A 01370000
*        is available and the st_version field will be st#Ver02.   @D9A 01380000
*       The Version 1 structure will be returned if there is not   @D9A 01390000
*        enough room for a full Version 2 structure and the result @D9A 01400000
*        will be copied to the output buffer up to the length      @D9A 01410000
*        that is available.      St_version will be st#Ver01.      @D9A 01420000
*       St_length will be the length of a full structure at the    @D9A 01430000
*        level of st_version.                                      @D9A 01440000
*       For programs that may run on multiple releases the amount  @D9A 01450000
*        of information that has been returned can be determined   @D9A 01460000
*        from the value of st_length or st_version, up to the      @D9A 01470000
*        buffer size that was provided.                            @D9A 01480000
*                                                                       01490000
*                                                                       01500000
*01* COMPONENT:  OpenMVS (SCPX1)                                        01510000
*                                                                       01520000
*01* DISTRIBUTION LIBRARY:  AMACLIB                                     01530000
*                                                                       01540000
*01* EYE-CATCHER: STAT                                                  01550000
*02*   OFFSET:  0                                                       01560000
*02*   LENGTH:  4                                                       01570000
*                                                                       01580000
*01* CHANGE-ACTIVITY:                                                   01590000
*                                                                       01600000
* $L0=POSIXXF  HOM1110 931201 PDSV: OpenMVS Initial Release             01610000
* $D1=DL70019  HOM1110 921201 PDJM: Assembler macro fixup               01620000
* $P2=PL70366  HOM1110 920908 PDSV: Macro commentary, name changes      01630000
* $P3=PL70547  HOM1110 921208 PDJV: Make time values signed             01640000
* $P4=PL70597  HOM1110 930104 PDJM: Use "OpenMVS"                       01650000
* $D2=DOAA008  HOM1111 930312 PDJV: DCR A008.01 ChAttr changes          01660000
* $D3=DOAA009  HOM1111 930301 PDJV: DCR A009.01 NFS                     01670000
* $D4=DOAA009  HOM1111 930715 PDSV: DCR A009.03 NFS                     01680000
* $D5=DPFA065  HOM1130 940922 PDJS: DCR A065.31 - File Format           01690000
* $D6=DSYA188  JBB6604 960823 PDND: trusted tree - DCR A188.03          01700000
* $D7=DWYA315  JBB6609 981215 PDI6: Shared Library - DCR A315.00        01710000
* $D8=DX0A412  HBB7705 000215 PDMX: Native ASCII A412.00                01720000
* $D9=DxxA505  HBB7708 000317 PDJT: LP64 & 64-Bit addressing            01730000
* $DA=   A525  HBB7706 001128 PDJS: Access Control Lists (ACLS) A525.01 01740000
* $P5=PYN0220  HBB7708 020301 PDFO: Bilingual fixup                     01750000
* $DB=DCRC595  HBB77A0 140328 PDSK: AMODE64 64-bit autodata             01751001
*                                                                       01760000
****END OF SPECIFICATIONS*********************************************/ 01770000
*        %GOTO STATPLS  ;         /* Bilingual header                   01780000
.A411    ANOP  ,                                                        01790000
** BPXYSTAT: stat system call structure                                 01800000
**  Used By: FST LST STA                                                01810000
         AIF   ('&DSECT' EQ 'NO').B411                        7@D1A     01820000
STAT                 DSECT ,                                            01830000
         AGO   .C411                                                    01840000
.B411    ANOP  ,                                                        01850000
STAT                 DS    0D                                           01860000
.C411    ANOP  ,                                                        01870000
ST_BEGIN             DS    0D                                           01880000
*                                                                       01890000
ST_EYE               DC    C'STAT'  Eye catcher                         01900000
ST_LENGTH            DC    AL2(STAT#LENGTH)                            *01910000
                                  Length of this structure         @P2A 01920000
ST_VERSION           DC    AL2(ST#VER)                                 *01930000
                                  Version of this structure        @P2A 01940000
ST_MODE              DS    F      File Mode, mapped by BPXYMODE         01950000
ST_INO               DS    F      File Serial Number                    01960000
ST_DEV               DS    F      Device ID of the file                 01970000
ST_NLINK             DS    F      Number of links                       01980000
ST_UID               DS    F      User ID of the owner of the file      01990000
ST_GID               DS    F      Group ID of the Group of the file     02000000
ST_SIZE              DS    0D     File Size in bytes, for regular       02010000
*                                 files.  Unspecified, for others       02020000
ST_SIZE_H            DS    F      First word of size                    02030000
ST_SIZE_L            DS    F      Second word of size                   02040000
ST_ATIME             DS    F      Time of last access                   02050000
ST_MTIME             DS    F      Time of last data modification        02060000
ST_CTIME             DS    F      Time of last file status change       02070000
*                                 Time is in seconds since              02080000
*                                 00:00:00 GMT, Jan. 1, 1970            02090000
ST_RDEV              DS    0F     Device Information                    02100000
ST_MAJORNUMBER       DS    H      Major number for this file, if it     02110000
*                                    is a character special file.       02120000
ST_MINORNUMBER       DS    H      Minor number for this file, if it     02130000
*                                    is a character special file.       02140000
ST_AUDITORAUDIT      DS    F      Area for auditor audit info           02150000
ST_USERAUDIT         DS    F      Area for user audit info              02160000
ST_BLKSIZE           DS    F      File Block size                       02170000
ST_CREATETIME        DS    F      File Creation Time                    02180000
ST_AUDITID           DS    4F     RACF File ID for auditing             02190000
ST_RES01             DS    F                                            02200000
ST_CHARSETID         DS    0XL12  Coded Character Set ID (obsolete @D8C 02210000
ST_FILETAG           DS    0F     File Tag                         @D8A 02220000
FT_CCSID             DS    H      Coded character set ID in binary @D8A 02230000
FT_UNTAGGED          EQU   X'0000' File has no tag                 @D8A 02240000
FT_BINARYTAG         EQU   X'FFFF' File is binary data             @D8A 02250000
FT_FLAGS             DS    XL2     File tagging flags              @D8A 02260000
FT_TXTFLAG           EQU   X'8000' File is pure text data          @D8A 02270000
FT_DEFERTAG          EQU   X'4000' File to be tagged at 1st write  @D8A 02280000
ST_RES01A            DS    2F     reserved                         @D8A 02290000
ST_BLOCKS_D          DS    0D     Double word number - blocks allocated 02300000
ST_RES02             DS    F                                            02310000
ST_BLOCKS            DS    F      Number of blocks allocated            02320000
ST_GENVALUE          DS    0XL4   General attribute values         @D6C 02330000
ST_OPAQUE            DS    XL3    Opaque attribute flags- Reserved @D6A 02340000
ST_VISIBLE           DS    X      Visible attribute flags          @D6A 02350000
ST_SHARELIB          EQU   X'10'  Shared Library Flag              @D7A 02360000
ST_NOSHAREAS         EQU   X'08'  No shareas flag                  @D6A 02370000
ST_APFAUTH           EQU   X'04'  APF authorized flag              @D6A 02380000
ST_PROGCTL           EQU   X'02'  Program controlled flag          @D6A 02390000
ST_EXTLINK           EQU   X'01'  External Symlink                 @D6A 02400000
ST_REFTIME           DS    F      Reference time                        02410000
ST_FID               DS    2F     File identifier                       02420000
ST_FILEFMT           DS    XL1    File Format                      @D5A 02430000
ST_FSPFLAG2          DS    XL1    IFSP_FLAG2 ACL support           @DAA 02440000
ST_ACCESSACL         EQU   X'80'  Access Acl exists                @DAA 02450000
ST_FMODELACL         EQU   X'40'  File Model Acl exists            @DAA 02460000
ST_DMODELACL         EQU   X'20'  Directory Model Acl exists       @DAA 02470000
ST_RES03             DS    CL2    reserved                         @DAA 02480000
ST_CTIMEMSEC         DS    F      Micro-Sec of full Ctime          @D9A 02490000
ST_SECLABEL          DS    CL8    Security Label                   @DAA 02500000
ST_RES04             DS    CL4    Reserved for future              @DAC 02510000
ST_ENDVER1          EQU    *      End of Ver 1 Stat                @D9A 02520000
*                                                                       02530000
                     DS    F      Reserved                         @D9A 02540000
ST_ATIME64           DS    D      Access Time                      @D9A 02550000
ST_MTIME64           DS    D      Data Modification Time           @D9A 02560000
ST_CTIME64           DS    D      Meda-data Change Time            @D9A 02570000
ST_CREATETIME64      DS    D      File Creation Time               @D9A 02580000
ST_REFTIME64         DS    D      Reference Time                   @D9A 02590000
                     DS    D      Reserved                         @D9A 02600000
ST_RES05             DS    CL16   Reserved                         @D9A 02610000
ST_ENDVER2          EQU    *      End of Ver 2 Stat                @D9A 02620000
*                                                                       02630000
*   Constants                                                           02640000
*                                                                       02650000
STAT#LENGTH          EQU   *-STAT   Length of STAT                      02660000
ST#VER01             EQU   1        Version 1 of this structure    @P2A 02670000
ST#VER02             EQU   2        Version 1 of this structure    @D9A 02680000
ST#VER               EQU   ST#VER02 Current version                @D9C 02690000
ST#LEN               EQU   STAT#LENGTH Length of STAT              @P2A 02700000
ST#VER01LEN          EQU   ST_ENDVER1-ST_BEGIN                     @D9A 02710000
ST#VER02LEN          EQU   ST_ENDVER2-ST_BEGIN                     @D9A 02720000
** BPXYSTAT End                                                         02730000
         SPACE 3                                                        02740000
         AIF   ('&LIST' EQ 'YES').E411                        6@D1A     02750000
         POP   PRINT                                                    02760000
.E411    ANOP  ,                                                        02770000
         MEND  ,                  Terminating PL/X comment           */ 02780000
*                                                                       02790000
*%STATPLS : ;                                                           02800000
* %DCL ASABEGIN_AMODE CHAR EXTERNAL;                          /* @DBA*/ 02801001
* %DCL PTR_64 CHAR EXTERNAL;                                  /* @DBA*/ 02802001
*%IF STATBASE='' %THEN                                                  02803000
*  %DO;                                                                 02804000
*    %STATBASE='BASED(StatPtr)';                                        02805000
*  %END;                                                                02806000
* %IF STATBASE='BASED(StatPtr)' %THEN                         /* @DBA*/ 02807001
*   %DO;                                                      /* @DBA*/ 02808001
*   %IF ASABEGIN_AMODE='64' ! PTR_64='YES'                    /* @DBA*/ 02809001
*    %THEN                                                    /* @DBA*/ 02809101
*    %DO;                                                     /* @DBA*/ 02809201
*      DCL StatPtr Ptr(64);          /* Pointer to the Stat      @DBA*/ 02809301
*    %END;                                                    /* @DBA*/ 02809401
*   %ELSE                                                     /* @DBA*/ 02809501
*    %DO;                                                     /* @DBA*/ 02809601
*      DCL StatPtr Ptr(31);          /* Pointer to the Stat          */ 02809700
*    %END;                                                    /* @DBA*/ 02809801
*   %END;                                                               02809900
* %IF STATVIA='VIA(StatAlet)' %THEN                                     02890000
*    %DO;                                                               02900000
*      Dcl StatAlet Ptr(31);       /* Alet of the Stat               */ 02910000
*    %END;                                                              02920000
* %IF FILETAGBASE='' %THEN                                              02930000
*    %DO;                                                               02940000
*      %FILETAGBASE = 'Based';                                          02950000
*    %END;                                                              02960000
*                                                                       02970000
*DCL                                                                    02980000
* 1 Stat STATBASE STATVIA,        /* Stat system call response       */ 02990000
*                                 /* structure                       */ 03000000
*   3 st_eye        Char(4),      /* Eye catcher - 'STAT'            */ 03010000
*   3 st_length     Fixed(16),    /* Length of structure             */ 03020000
*   3 st_version    Fixed(16),    /* Version number                  */ 03030000
*   3 st_Part1,                   /* First part of the stat from attr*/ 03040000
*     5 st_mode     Fixed(32),    /* File Mode, mapped by BPXYMODE   */ 03050000
*     5 st_ino      Fixed(32),    /* File Serial Number              */ 03060000
*                                 /*+10*/                               03070000
*     5 st_dev      Fixed(32),    /* Device ID of the file           */ 03080000
*     5 st_nlink    Fixed(32),    /* Number of links                 */ 03090000
*     5 st_uid      Fixed(31),    /* User ID of the owner of the file*/ 03100000
*     5 st_gid      Fixed(31),    /*Group ID of the Group of the file*/ 03110000
*                                 /*+20*/                               03120000
*     5 st_size  Char(8) Bdy(8),  /* File Size in bytes, for regular    03130000
*                                    files.  Unspecified, for others */ 03140000
*       7 st_size_h Fixed(31),    /* First word of size              */ 03150000
*       7 st_size_l Fixed(32),    /* Second word of size             */ 03160000
*     5 st_atime    Fixed(31),    /* POSIX Access Time           @P3C*/ 03170000
*     5 st_mtime    Fixed(31),    /* POSIX Modification Time     @P3C*/ 03180000
*                                 /*+30*/                               03190000
*     5 st_ctime    Fixed(31),    /* POSIX Change Time           @P3C*/ 03200000
*                                 /*   Time is in seconds since         03210000
*                                      00:00:00 GMT, Jan. 1, 1970    */ 03220000
*   3 st_RDev,                    /* Device information              */ 03230000
*     5 st_MajorNumber Fixed(16), /* Major number for this file, if it  03240000
*                                    is a character special file.    */ 03250000
*     5 st_MinorNumber Fixed(16), /* Minor number for this file, if it  03260000
*                                    is a character special file.    */ 03270000
*   3 st_Part2,                   /* Matches Attr part 2             */ 03280000
*     5 st_AuditorAudit Bit(32),  /* Area for auditor audit info     */ 03290000
*     5 st_UserAudit    Bit(32),  /* Area for user audit info        */ 03300000
*                                 /*+40*/                               03310000
*     5 st_BlkSize      Fixed(31),/* File Block Size                 */ 03320000
*     5 st_CreateTime   Fixed(31),/* File Creation Time          @P3C*/ 03330000
*     5 st_AuditId      Char(16), /* RACF File ID for auditing       */ 03340000
*     5 st_Res01        Fixed(32),/* Reserved                    @D2C*/ 03350000
*                                 /*+5C*/                               03360000
*   3 st_Part3,                   /* Matches Attr part 3             */ 03370000
*     5 st_CharSetId  Char(12),   /* Char Set ID (obsolete)      @D8C*/ 03380000
*       7 st_FileTag  Char(4),    /* File tag (see below)        @D8A*/ 03390000
*       7 *           Char(8),    /* reserved                    @D8A*/ 03400000
*     5 st_Blocks_D Char(8) Bdy(word),/* Double word number - blocks */ 03410000
*       7 *           Fixed(31),                                        03420000
*       7 st_Blocks   Fixed(32),  /* Number of blocks allocated      */ 03430000
*                                 /*+70*/                               03440000
*     5 st_GenValue   Bit(32),    /* General attribute values    @D2A*/ 03450000
*      7 st_Opaque      Bit(24),  /*     Opaque attribute flags -       03460000
*                                        Reserved for ADSTAR use @D2A*/ 03470000
*      7 st_Visible     Bit(8),   /*     Visible attribute flags @D2A*/ 03480000
*        9  *             Bit(3), /*     Reserved                @D7C*/ 03490000
*        9  st_Sharelib  Bit(1),  /*     Shared library Program  @D7A*/ 03500000
*        9  st_NoShareas Bit(1),  /*     do not run in shareas   @D6A*/ 03510000
*        9  st_ApfAuth   Bit(1),  /*     Program is APF auth     @D6A*/ 03520000
*        9  st_ProgCtl   Bit(1),  /*     Program controlled      @D6A*/ 03530000
*        9  st_ExtLink    Bit(1), /*     External Symlink        @D2A*/ 03540000
*     5 st_RefTime    Fixed(31),  /* Reference time - also know as      03550000
*                                        Backup Time Stamp       @D2A*/ 03560000
*     5 st_Fid        Char(8),    /* File identifier             @D3A*/ 03570000
*                                 /*+80*/                               03580000
*     5 st_FileFmt    Fixed(8),   /* File Format                 @D5A*/ 03590000
*                                 /*   Value constants for filefmt   */ 03600000
*                                 /*   declared in BPXYFTYP      @D5A*/ 03610000
*     5 st_FspFlag2   Bit(8),     /* IFSP_FLAG2 ACL support      @DAA*/ 03620000
*       7  st_AccessAcl Bit(1),   /* 1 = Access Acl exists       @DAA*/ 03630000
*       7  st_FModelAcl Bit(1),   /* 1 = File Model Acl exists   @DAA*/ 03640000
*       7  st_DModelAcl Bit(1),   /* 1 = Dir  Model Acl exists   @DAA*/ 03650000
*       7  *            Bit(5),   /* reserved                    @DAA*/ 03660000
*                                                                       03670000
*     5 st_Res03      Char(2),    /* reserved                    @DAA*/ 03680000
*     5 st_CtimeMsec  Fixed(32),  /* Micro-Sec of full Ctime     @D9A*/ 03690000
*     5 st_SecLabel   Char(8),    /* Security Label              @DAA*/ 03700000
*                                                                       03710000
*     5 st_Res04      Char(4),    /* Reserved for expansion      @DAC*/ 03720000
*   3 st_EndVer1      Char(0),    /* ----- End of Ver 1 Stat --- @D9A*/ 03730000
*   3   *             Fixed(32),  /* Avail for LFS, nonPFS, Info @D9C*/ 03740000
*                                 /*+98*/                               03750000
*   3 st_Part4 ,                  /* Fourth part = AttrStat4     @D9A*/ 03760000
*     5 st_LP64 ,                 /* LP64 Versions              7@D9A*/ 03770000
*       7 st_Atime64     Char(8),    /*  Access Time                 */ 03780000
*       7 st_Mtime64     Char(8),    /*  Data Modification Time      */ 03790000
*       7 st_Ctime64     Char(8),    /*  Meda-data Change Time       */ 03800000
*       7 st_CreateTime64 Char(8),   /*  File Creation Time          */ 03810000
*       7 st_RefTime64   Char(8),    /*  Reference Time              */ 03820000
*       7   *            Char(8),    /*  Reserved                    */ 03830000
*                                 /*+C8*/                               03840000
*     5 *               Char(16), /* New Expansion area          @D9A*/ 03850000
*                                 /*+D8*/                               03860000
*   3 st_EndVer2      Char(0);    /* ----- End of Ver 2 Stat --- @D9A*/ 03870000
*                                                                       03880000
* /*******************************************************************/ 03890000
* /* File Tag structure for files tagged with a character set.       */ 03900000
* /*******************************************************************/ 03910000
* DCL                                                                   03920000
* 1 File_tag    Bdy(Word) FILETAGBASE, /*                        @D8A*/ 03930000
*   2 Ft_Ccsid  Fixed(16),        /* Coded character set ID      @D8A*/ 03940000
*   2 Ft_Flags  Bit(16),          /*                             @D8A*/ 03950000
*     3 Ft_TxtFlag  Bit,          /* File is pure text only      @D8A*/ 03960000
*     3 Ft_DeferTag Bit,          /* File to be tagged at 1st write -   03970000
*                                    Ft_Ccsid is ignored         @D8A*/ 03980000
*     3 *          Bit(14);       /*                             @D8A*/ 03990000
* /* Special values for Ft_Ccsid                                     */ 04000000
* DCL                                                                   04010000
* FT_UNTAGGED  Fixed(16) Constant(0),  /* no Ccsid present           */ 04020000
* FT_BINARYTAG Fixed(16) Constant('FFFF'X); /* file is binary    @D8A*/ 04030000
*                                                                       04040000
*DCL                                                                    04050000
* st#ID  Char(4)   Constant('STAT'),      /* Eye catcher             */ 04060000
* st#Ver Fixed(16) Constant(st#Ver02),    /* Current version     @D9C*/ 04070000
* st#Ver01 Fixed(16) Constant(1),         /* Version 1 stat      @P2C*/ 04080000
* st#Ver02 Fixed(16) Constant(2),         /* Version 2 stat      @D9A*/ 04090000
* st#Ver01Len Fixed(16) Constant(Offset(st_EndVer1)),          /*@D9A*/ 04100000
* st#Ver02Len Fixed(16) Constant(Offset(st_EndVer2)),          /*@D9A*/ 04110000
*                                                                       04120000
* st#Len Fixed(16) Constant(Length(Stat));/* Length of Stat          */ 04130000
