*        %GOTO ATTPRO  ;         /* Bilingual header                            
         MACRO                                                                  
         BPXYATT &DSECT=YES,&LIST=YES,&ATTX=NO,                        x        
               &ATTXValLength=0,&ATT=YES                           @D9C         
         GBLB  &ATT411                                                          
         AIF   (&ATT411 EQ 1).E411                                              
&ATT411  SETB  1                                                                
         AIF   ('&LIST' EQ 'YES').A411                                          
         PUSH  PRINT  BPXYATT: File attributes for chattr system call           
         PRINT OFF                                                              
         AGO   .A411                                                            
*                                  */                                           
*%ATTPRO : ;                                                                    
*/****START OF SPECIFICATIONS******************************************         
*                                                                               
*    $MAC (BPXYATT) COMP(SCPX1) PROD(BPX):                                      
*                                                                               
*01* MACRO NAME: BPXYATT                                                        
*                                                                               
*01* DSECT NAME: BPXYATT                                                        
*                                                                               
*01* DESCRIPTIVE NAME: Attribute Structure passed to File System                
*                                                                               
*02*   ACRONYM: ATT                                                             
**/                                                                             
*/*01* PROPRIETARY STATEMENT=                                        */         
*/***PROPRIETARY_STATEMENT********************************************/         
*/*                                                                  */         
*/*                                                                  */         
*/* LICENSED MATERIALS - PROPERTY OF IBM                             */         
*/* 5650-ZOS COPYRIGHT IBM CORP. 1993, 2021                          */         
*/*                                                                  */         
*/* STATUS= HBB77D0                                                  */         
*/*                                                                  */         
*/***END_OF_PROPRIETARY_STATEMENT*************************************/         
*/*                                                                             
*                                                                               
*01* EXTERNAL CLASSIFICATION:  PI                                               
*01* END OF EXTERNAL CLASSIFICATION:                                            
*                                                                               
*01* FUNCTION:                                                                  
*                                                                               
*      The ATT maps a request to the file system to change file                 
*      attributes via the chattr system call.                                   
*                                                                               
*01* METHOD OF ACCESS:                                                          
*                                                                               
*02*   PL/X:                                                                    
*                                                                               
*        %INCLUDE SYSLIB(BPXYATT)                                               
*        By default, the ATT is based on AttPtr.  If                            
*        other basing is desired, use %ATTBASE='BASED(XXXXXX)'.                 
*        If %ATTBASE='BASED(ATTPTR)' is coded, a Declare for                    
*        ATTPTR is also generated.                                              
*                                                                               
*02*   ASM:                                                                     
*                                                                               
*        With DSECT=NO, storage is allocated in line                            
*        and addressability is provided thru that DSECT or CSECT.               
*        With DSECT=YES, a DSECT is produced and "USING STAT,reg"               
*        is required for addressability.  Here "reg" contains the               
*        address of ATT#LENGTH bytes of storage.                                
*        The default is DSECT=YES.                                              
*                                                                               
*        ATT=NO!YES specifies if the ATT will be included                       
*        ATTX=NO!YES specifies if the ATTX will be included                     
*          With ATTXValLength,  you can specify a length for the value          
*                      of the attribute being passed.  useful for               
*                      including the space.                                     
*                                                                               
*01* SIZE: Release dependent.  Refer to the mapping.                            
*                                                                               
*01* POINTED TO BY: Input parameter of chattr system call                       
*                                                                               
*01* CREATED BY: Invoker of chattr system call routine                          
*                                                                               
*01* DELETED BY: Invoker of chattr system call routine                          
*                                                                               
*01* STORAGE ATTRIBUTES:                                                        
*02*   SUBPOOL: N/A                                                             
*02*   KEY:     N/A                                                             
*02*   RESIDENCY: Caller's Primary address space                                
*                                                                               
*01* FREQUENCY: 1 per chattr system call                                        
*                                                                               
*01* SERIALIZATION: N/A                                                         
*                                                                               
*01* DEPENDENCIES: None                                                         
*                                                                               
*01* NOTES:                                                                     
*                                                                               
*   1. The following mapping macros are closely related.                        
*                                                                               
*      BPXYATT  - Interface between an application and the LFS for              
*                 BPX1CHA (chattr).  It maps the subset of BPXYATTR             
*                 fields which can be modified, and the set flags.              
*                 Fields match corresponding fields in BPXYATTR.                
*                 The overall structures are not related.                       
*                 (Field size and type match, but not the offset.)              
*                 AttSetFlags, AttGenMask, and AttGenValue structures           
*                 match AttrSetFlags, AttrGenMask, and AttrGenValue             
*                 in BPXYATTR. (ATT=YES)                                        
*                                                                               
*               - Interface  to Set, Get, Remove or List extended               
*                 attributes. (ATTX=YES)                                        
*                                                                               
*      BPXYATTR - Vnode interface to the LFS and PFS for file                   
*                 attributes.                                                   
*                 Fields match corresponding fields in BPXYATT.                 
*                 AttrStat, AttrStat2, and AttrStat3 structures match           
*                 st_Part1, st_Part2,  and st_Part3 in BPXYSTAT.                
*                                                                               
*      BPXYSTAT - Interface between an application and the LFS for              
*                 BPX1STA (stat).  It is the POSIX interface to the LFS         
*                 for file attributes.  The st_Part1, st_Part2, and             
*                 st_Part3 structures match AttrStat, AttrStat2,                
*                 and AttrStat3 in BPXYATTR.  The entire BPXYSTAT               
*                 structure also matches the stat.h structure.                  
*                                                                               
*      BPXZATTR - Prior name of BPXYATTR.  To facilitate migration,             
*                 BPXZATTR includes BPXYATTR.  In all new code,                 
*                 BPXYATTR should be used.                                      
*                                                                               
*      BPXYVFSI - C program interface for the BPX1V (v_) services.              
*                 The ATTR structure in BPXYVFSI matches the BPXYATTR           
*                 structure.                                                    
*                                                                               
*      stat.h   - C program interface for stat().  It is the POSIX C            
*                 form of BPXYSTAT.  The entire stat.h structure                
*                 matches the BPXYSTAT structure.                               
*                                                                               
*   2. The AttExtLink flag cannot be set on with BPX1CHA (chattr).              
*                                                                               
*                                                                               
*01* COMPONENT: OpenMVS (SCPX1)                                                 
*                                                                               
*01* DISTRIBUTION LIBRARY:  AMACLIB                                             
*                                                                               
*01* EYE-CATCHER: ATT                                                           
*02*   OFFSET:  0                                                               
*02*   LENGTH:  4                                                               
*                                                                               
*01* CHANGE-ACTIVITY:                                                           
*                                                                               
*    $D0=DOAA008  HOM1111 930128 PDFZ: DCR A008.01 (f)chattr support            
*    $D1=DOAA009  HOM1111 930715 PDSV: DCR A009.03 NFS                          
*    $D2=DOAA009  HOM1120 931015 PDSV: DCR A009.05 ASM improvements             
*    $D3=DPFA065  HOM1130 940922 PDJS: DCR A065.31 - File Format                
*    $D4=DSYA188  JBB6604 960823 PDND: trusted tree - DCR A188.03               
*    $D5=DWYA315  JBB6609 981021 PDZJ: DCR A315.00 Shared Library               
*    $P1=PX00213  HBB7705 000613 PDJV: Bit to prevent delete from               
*                                      directory                                
*    $D6=DX0A412  HBB7705 000215 PDMX: Native ASCII A412.00                     
*    $D7=DYNA519  HBB7708 010315 PDSK: LP64                     A519.07         
*    $P2=PYN0220  HBB7708 020301 PDFO: Bilingual fixup                          
*    $D8=DYNA597  HBB7708 020212 PDJS: MLS   DCR A597.00                        
*    $P3=PYN0432  HBB7708 020619 PDJS: Add Ver3Res02 to assembler               
*    $P4=PJK0584  HBB7709 030707 PDJS: Fix SymMask                              
*    $P5=WI414583 HBB77D0 210608 PDTS: Add AttLP64Times to SymMask              
*    $D9=WI401047 HBB77D0 012522 PDND: Add ATTX structure                       
*                                                                               
****END OF SPECIFICATIONS*********************************************/         
*        %GOTO ATTPLS   ;         /* Bilingual header                           
.A411    ANOP  ,                                                                
         AIF   ('&ATT' EQ 'NO').J411                               @P6A         
**  BPXYATT:  File attributes for chattr system call                            
**  Used By:  CHR FCR                                                           
         AIF   ('&DSECT' EQ 'NO').B411                                          
ATT                  DSECT ,                                                    
         AGO   .C411                                                            
.B411    ANOP  ,                                                                
                     DS    0D                                                   
ATT                  DC    XL(ATT#LENGTH)'00'                                   
                     ORG   ATT                                                  
.C411    ANOP  ,                                                                
ATTBEGIN             DS    0D                                                   
*                                                                               
ATTID                DC    C'ATT '  Eye Catcher                                 
ATTVERSION           DC    AL2(ATT#VER)                                         
*                                 Version of this structure                     
ATTRES01             DS    CL2    Reserved                                      
ATTSETFLAGS          DS    0XL4   Flags - which fields to set                   
ATTSETFLAGS1         DS    X      Flag byte 1                                   
ATTMODECHG           EQU   X'80'  1 = Change to the mode indicated              
ATTOWNERCHG          EQU   X'40'  1 = Change to Owner indicated                 
ATTSETGEN            EQU   X'20'  1 = Set General attributes                    
ATTTRUNC             EQU   X'10'  1 = Truncate size                             
ATTATIMECHG          EQU   X'08'  1 = Change the Atime                          
ATTATIMETOD          EQU   X'04'  1 = Change to the Current Time                
ATTMTIMECHG          EQU   X'02'  1 = Change the Mtime                          
ATTMTIMETOD          EQU   X'01'  1 = Change to the Current Time                
ATTSETFLAGS2         DS    X      Flag byte 2                                   
ATTMAAUDIT           EQU   X'80'  1 = Modify auditor audit info                 
ATTMUAUDIT           EQU   X'40'  1 = Modify user audit info                    
ATTCTIMECHG          EQU   X'20'  1 = Change the Ctime                          
ATTCTIMETOD          EQU   X'10'  1 = Change Ctime to the Current               
*                                     Time                                      
ATTREFTIMECHG        EQU   X'08'  1 = Change the RefTime                        
ATTREFTIMETOD        EQU   X'04'  1 = Change RefTime to Current Time            
ATTFILEFMTCHG        EQU   X'02'  1 = Change File Format          @D3A          
ATTRES04             EQU   X'01'  Reserved                        @D6A          
ATTSETFLAGS3         DS    X      Reserved                                      
ATTRES05             EQU   X'80'  Reserved                        @D6A          
ATTCHARSETIDCHG      EQU   X'40'  1 = Change File tag             @D6A          
ATTLP64TIMES         EQU   X'20'  1 = Use 64-bit times            @D7A          
ATTSECLABELCHG       EQU   X'10'  1 = Set Seclabel                @D8A          
ATTSETFLAGS4         DS    X      Reserved                                      
ATTMODE              DS    F      File Mode, mapped by BPXYMODE                 
ATTUID               DS    F      User ID of the owner of the file              
ATTGID               DS    F      Group ID of the Group of the file             
ATTGENMASK           DS    0XL4   Mask to indicate which General                
*                                 attributes bits to modify                     
*                                 --Must match AttGenValue                      
ATTOPAQUEMASK        DS    XL3    Opaque attribute flags - Reserved             
*                                  for ADSTAR use                               
ATTVISIBLEMASK       DS    X      Visible attribute flags                       
ATTNODELFILESMASK    EQU   X'20'  Files should not be deleted      @P1A         
ATTSHARELIBMASK      EQU   X'10'  Shared Library                   @D5A         
ATTNOSHAREASMASK     EQU   X'08'  No shareas flag                  @D4A         
ATTAPFAUTHMASK       EQU   X'04'  APF authorized flag              @D4A         
ATTPROGCTLMASK       EQU   X'02'  Program controlled flag          @D4A         
ATTGENVALUE          DS    0XL4   General attribute values                      
*                                 --Must match AttGenMask                       
ATTOPAQUE            DS    XL3    Opaque attribute flags - Reserved             
*                                  for ADSTAR use                               
ATTVISIBLE           DS    X      Visible attribute flags                       
ATTNODELFILES        EQU   X'20'  Files should not be deleted      @P1A         
ATTSHARELIB          EQU   X'10'  Shared Library                   @D5A         
ATTNOSHAREAS         EQU   X'08'  No shareas flag                  @D4A         
ATTAPFAUTH           EQU   X'04'  APF authorized flag              @D4A         
ATTPROGCTL           EQU   X'02'  Program controlled flag          @D4A         
ATTSIZE              DS    0D     File Size in bytes, for regular               
*                                 files.  Unspecified, for others               
ATTSIZE_H            DS    F      First word of size                            
ATTSIZE_L            DS    F      Second word of size                           
ATTATIME             DS    F      Time of last access                           
ATTMTIME             DS    F      Time of last data modification                
ATTAUDITORAUDIT      DS    F      Area for auditor audit info                   
ATTUSERAUDIT         DS    F      Area for user audit info                      
ATTCTIME             DS    F      Time of last file status change               
*                                 Time is in seconds since                      
*                                 00:00:00 GMT, Jan. 1, 1970                    
ATTREFTIME           DS    F      Reference time                                
ATTENDVER1           DS    0D     End of Version 1                              
ATTFILEFMT           DS    XL1    File Format                     @D3A          
ATTRES02             DS    XL3    Reserved for future             @D6A          
ATTFILETAG           DS    F      File tag (see BPXYSTAT)         @D6A          
ATTRES03             DS    CL8    Reserved for future             @D6C          
ATTENDVER2           DS    0D     End of Version 2                @D3A          
*                                                                               
ATTATIME64           DS    D      Access Time                     @D7A          
ATTMTIME64           DS    D      Data Mod Time                   @D7A          
ATTCTIME64           DS    D      Medadata Change Time            @D7A          
ATTREFTIME64         DS    D      Reference Time                  @D7A          
ATTSECLABEL          DS    CL8    Security Label                  @D8A          
ATTVER3RES02         DS    CL8    Reserved for R6                 @P3A          
ATTENDVER3           DS    0D     End of Version 3                @D8A          
*                                                                               
*   Constants                                                                   
*                                                                               
ATT#VER              EQU   ATT#VER03 Current version              @D7C          
ATT#VER01            EQU   1         Version 1 of this structure                
ATT#VER02            EQU   2         Version 2 of this structure                
ATT#VER03            EQU   3         Version 3 of this structure  @D7A          
ATT#LENGTH           EQU   *-ATTBEGIN                                  X        
                                     Length of ATT                              
ATT#VER1LEN          EQU   ATTENDVER1-ATTBEGIN                         X        
                                     Length of Version 1 ATT                    
ATT#VER2LEN          EQU   ATTENDVER2-ATTBEGIN                         X        
                                     Length of Version 2 ATT                    
ATT#VER3LEN          EQU   ATTENDVER3-ATTBEGIN                         X        
                                     Length of Version 3 ATT      @D7A          
.J411    AIF   ('&ATTX' NE 'YES').H411                             @D9A         
**********************************************************************          
* ATTX Parameter List for Extended Attributes                      @D9A         
**********************************************************************          
         AIF   ('&DSECT' EQ 'NO').F411                                          
ATTX                 DSECT ,                                                    
         AGO   .G411                                                            
.F411    ANOP  ,                                                                
                     DS    0D                                                   
ATTX                 DC    XL(ATTXVAL-ATTXBEGIN-256)'00'                        
                     DC    XL(256)'00'                                          
                     ORG   ATTX                                                 
.G411    ANOP  ,                                                                
ATTXBEGIN            DS    0D                                                   
*                                                                               
ATTXID               DC    C'ATTX'   Eye Catcher                                
ATTXVERSION          DC    AL2(ATTX#VER)                                        
ATTXSUBCMD           DS    H         Subcommand                                 
ATTX#SCSET           EQU   1            Set                                     
ATTX#SCGET           EQU   2            Get                                     
ATTX#SCREMOVE        EQU   3            Remove                                  
ATTX#SCLIST          EQU   4            List                                    
ATTXFLAGS            DS    XL4       Flags                                      
ATTXFLSET            EQU   X'00000004'                                          
ATTXFREPLACE         EQU   X'00000002'                                          
ATTXFCREATE          EQU   X'00000001'                                          
                     DS    XL60      Reserved                                   
ATTXNAMELN           DS    F         Attribute name length                      
ATTXNAME             DS    CL256     Attribute name                             
ATTXVALLN            DS    F         Attribute value length                     
         AIF   ('&ATTXValLength' NE '0').I411                                   
ATTXVAL              DS    0D        Attribute value                            
                     AGO   .I411X                              /*@D9A*/         
.I411    ANOP                                                                   
ATTXVAL              DS    XL(&ATTXValLength)                                   
.I411X   ANOP                                                                   
*                                                                               
*   Constants                                                                   
*                                                                               
ATTX#VER             EQU   1         Current version                            
ATTX#LENGTH          EQU   *-ATTXBEGIN                                          
ATTX#MAXVAL          EQU   50000     Max Value Length                           
         AIF   ('&DSECT' NE 'NO').H411                                          
Attx#ID           DC    C'ATTX'                  Control Block id               
*   AttxName values                                                             
Attx#apfauth      DC    C'trusted.apfauth'                                      
Attx#sharelib     DC    C'trusted.sharelib'                                     
Attx#progctl      DC    C'trusted.progctl'                                      
Attx#noshareas    DC    C'system.noshareas'                                     
Attx#filefmt      DC    C'system.filefmt'                                       
Attx#filetag      DC    C'system.filetag'                                       
Attx#seclabel     DC    C'system.seclabel'                                      
Attx#auditoraudit DC    C'system.auditoraudit'                                  
Attx#useraudit    DC    C'system.useraudit'                                     
Attx#accessacl    DC    C'system.accessacl'                                     
Attx#fmodelacl    DC    C'system.fmodelacl'                                     
Attx#dmodelacl    DC    C'system.dmodelacl'                                     
Attx#createtime   DC    C'system.createtime'                                    
Attx#auditid      DC    C'system.auditid'                                       
*  class prefixes                                                               
Attx#trustedclass DC    C'trusted.'                                             
Attx#systemclass  DC    C'system.'                                              
Attx#userclass    DC    C'user.'                                                
.H411    ANOP  ,                                                   @D9A         
** BPXYATT  End                                                                 
         SPACE 3                                                                
         AIF   ('&LIST' EQ 'YES').E411                                          
         POP   PRINT                                                            
.E411    ANOP  ,                                                                
         MEND  ,                  Terminating PL/X comment           */         
*                                                                               
*%ATTPLS : ;                                                                    
* %IF ATTBASE = '' %THEN                                                        
*   %DO;                                                                        
*     %ATTBASE = 'Based(AttPtr)';                                               
*   %END;                                                                       
* %IF TRANSLATE(ATTBASE) = 'BASED(ATTPTR)' %THEN                                
*   %DO;                                                                        
*     DCL AttPtr Ptr(31);           /* Pointer to the ATT            */         
*   %END;                                                                       
*                                                                               
*%IF AsaxmacF63 = ''                                                            
*   %Then %AsaxmacF63 = 'Char(8)';                            /* @D7A*/         
*                                                                               
*Dcl                                                                            
* 1  Att        ATTBASE,                                                        
*  3 AttID      Char(4),         /* +00 Eye Catcher  - 'ATT '        */         
*  3 AttVersion Fixed(16),       /* +04 Version                      */         
*  3 *          Char(2),         /* +06 Reserved                     */         
*  3 AttSetFlags      Bit(32),   /* +08 Flags - which fields to set  */         
*    5 AttModeChg   Bit(1),      /*     Change to the mode indicated */         
*    5 AttOwnerChg  Bit(1),      /*     Change to Owner indicated    */         
*    5 AttSetGen    Bit(1),      /*     Set General attributes       */         
*    5 AttTrunc     Bit(1),      /*     Truncate size                */         
*    5 AttATimeChg   Bit(1),     /*     Change the Atime             */         
*    5 AttAtimeTOD   Bit(1),     /*     Change to the Current Time   */         
*    5 AttMTimeChg   Bit(1),     /*     Change the Mtime             */         
*    5 AttMtimeTOD   Bit(1),     /*     Change to the Current Time   */         
*    5 AttMAAudit     Bit(1),    /*     Modify auditor audit info    */         
*    5 AttMUAudit     Bit(1),    /*     Modify user audit info       */         
*    5 AttCTimeChg    Bit(1),    /*     Change the Ctime             */         
*    5 AttCTimeTOD    Bit(1),    /*     Change Ctime to the Current             
*                                        Time                        */         
*    5 AttRefTimeChg   Bit(1),   /*     Change the RefTime           */         
*    5 AttRefTimeTOD   Bit(1),   /*     Change RefTime to Current               
*                                        Time                        */         
*    5 AttFileFmtChg   Bit(1),   /*     Change File Format       @D3A*/         
*    5 *               Bit(2),   /*     Reserved - internal use  @D6A*/         
*    5 AttCharSetIdChg Bit(1),   /*     Change File tag          @D6A*/         
*    5 AttLP64Times    Bit(1),   /*     64-bit time values       @D7A*/         
*    5 AttSecLabelChg  Bit(1),   /*     Set Security Label       @D8C*/         
*                                /************************************/         
*                                /*==>  When adding new flags, the   */         
*                                /*==>  mask constant must be        */         
*                                /*==>  updated.                 @D3A*/         
*                                /************************************/         
*    5 *               Bit(12),  /*     Reserved bits        @D8C@D6C*/         
*  3 AttMode         Fixed(32),  /* +0C File Mode mapped by BPXYMODE */         
*    5    AttType    Fixed(8),   /*     First byte of mode is file              
*                                        type, mapped by BPXYFTYP    */         
*    5    AttRemMode Fixed(24),  /*     Name to know the last 3 byte */         
*  3 AttUid          Fixed(31),  /* +10 User ID of owner of the file */         
*  3 AttGid          Fixed(31),  /* +14 Group ID of Group of file    */         
*  3 AttGenMask      Bit(32),    /* +18 Mask to indicate which                  
*                                       General attributes bit to               
*                                       modify                                  
*                                     --Must match AttGenValue       */         
*    5 AttOpaqueMask   Bit(24),  /*     Opaque attribute flags -                
*                                       Reserved for ADSTAR          */         
*    5 AttVisibleMask  Bit(8),   /*     Visible attribute flags      */         
*      7    *            Bit(2), /*     Reserved            @D5C @P1C*/         
*      7 AttNoDelFilesMask Bit(1),/*    Files should not be deleted             
*                                                                @P1A*/         
*      7 AttShareLibMask Bit(1), /*     Shared Library           @D5A*/         
*      7 AttNoShareasMask Bit(1), /*    do not run in shareas    @D4A*/         
*      7 AttApfAuthMask Bit(1),  /*     Program is APF auth      @D4A*/         
*      7 AttProgCtlMask Bit(1),  /*     Program controlled       @D4A*/         
*      7    *            Bit(1), /*     Reserved - corresponds to ext           
*                                       link flag - Mask not used    */         
*  3 AttGenValue     Bit(32),    /* +1C General attribute values                
*                                     --Must match AttGenMask        */         
*    5 AttOpaque       Bit(24),  /*     Opaque attribute flags -                
*                                       Reserved for ADSTAR          */         
*    5 AttVisible      Bit(8),   /*     Visible attribute flags      */         
*      7    *            Bit(2), /*     Reserved            @D5C @P1C*/         
*      7 AttNoDelFiles   Bit(1), /*     Files should not be deleted             
*                                                                @P1A*/         
*      7  AttShareLib Bit(1),    /*     Shared Library           @D5A*/         
*      7  AttNoShareas Bit(1),   /*     do not run in shareas    @D4A*/         
*      7  AttApfAuth  Bit(1),    /*     Program is APF auth      @D4A*/         
*      7  AttProgCtl  Bit(1),    /*     Program controlled       @D4A*/         
*      7    AttExtLink   Bit(1), /*     External Symlink             */         
*  3 AttSize Char(8) Bdy(8),     /* +20 File Size in bytes, for                 
*                                        regular file.    This is               
*                                        unspecified, for others.    */         
*    5 AttSize_h     Fixed(31),  /*     First word of size          */          
*    5 AttSize_l     Fixed(32),  /*     Second word of size         */          
*  3 AttAtime        Fixed(31),  /* +28 Time of last access          */         
*  3 AttMtime        Fixed(31),  /* +2C Time of last data mod        */         
*  3 AttAuditorAudit Bit(32),    /* +30 Area for auditor audit info  */         
*  3 AttUserAudit    Bit(32),    /* +34 Area for user audit info     */         
*  3 AttCTime        Fixed(31),  /* +38 Time of last file stat change*/         
*  3 AttRefTime      Fixed(31),  /* +3C Reference Time -                        
*                                       Reserved for ADSTAR          */         
*  3 AttEndVer1  Char(0),        /* +40 End of Version 1             */         
*    /****************************************************************/         
*    /* Add fields here for Version 2.                               */         
*    /* NOTE that the increased length of the ATT will have          */         
*    /* migration considerations in the code that handles ATT's.     */         
*    /****************************************************************/         
*  3 AttFileFmt Fixed(8),        /* +40 File Format              @D3A*/         
*                                /*     Value constants for filefmt  */         
*                                /*     declared in BPXYFTYP     @D3A*/         
*  3 *          Char(3),         /* +41 Reserved                 @D4C*/         
*  3 AttFileTag Char(4),         /* +44 Reserved                 @D4C*/         
*  3 *          Char(8),         /* +45 Reserved                 @D4C*/         
*  3 AttEndVer2  Char(0),        /* +50 End of Version 2         @D3A*/         
*  3 AttLP64 Bdy(DWord),         /* +50 End of Version 2         @D7A*/         
*    5 AttAtime64    Char(8) Bdy(DWord), /* +50 Access Time      @D7A*/         
*      7 AttAtime64S AsaxmacF63, /*     Signed value             @D7A*/         
*    3 AttMtime64    Char(8) Bdy(DWord), /* +58 Data Mod Time    @D7A*/         
*      7 AttMtime64S AsaxmacF63, /*     Signed value             @D7A*/         
*    3 AttCtime64    Char(8) Bdy(DWord), /* +60 Metadata Chg Time@D7A*/         
*      7 AttCtime64S AsaxmacF63, /*     Signed value             @D7A*/         
*    3 AttRefTime64  Char(8) Bdy(DWord), /* +68 Reference Time   @D7A*/         
*      7 AttReftime64S AsaxmacF63,/*    Signed value             @D7A*/         
*  3 AttSecLabel Char(8),        /* +70 Security Label           @D8A*/         
*  3 * Char(8),                  /* +78 reserved                 @D8A*/         
*  3 AttEndVer3 Char(0),         /* +80 End of Version 3             */         
*  3 * Char(0) Bdy(Dword);       /*     Ensure ATT ends on doubleword           
*                                       boundary                 @D3C*/         
*                                                                               
*DCL                                                                            
*  Att#ID     Char(4)   Constant('ATT '),   /* Control Block Acronym */         
*  Att#Len    Fixed(16) Constant(Length(ATT)), /* Length of ATT      */         
*  Att#Ver    Fixed(16) Constant(Att#Ver03), /* Current version  @D7C*/         
*  Att#Ver1Len Fixed(16) Constant(Offset(AttEndVer1)), /* Length of             
*                                               Version 1            */         
*  Att#Ver2Len Fixed(16) Constant(Offset(AttEndVer2)), /* Length of             
*                                               Version 2        @D3A*/         
*  Att#Ver3Len Fixed(16) Constant(Offset(AttEndVer3)), /* Length of             
*                                               Version 3        @D7A*/         
*  Att#Ver01  Fixed(16) Constant(1),         /* Version 1            */         
*                                                                               
*  Att#Ver02  Fixed(16) Constant(2),         /* Version 2        @D3A*/         
*  Att#Ver03  Fixed(16) Constant(3),         /* Version 3        @D7A*/         
*                                                                               
*  /******************************************************************/         
*  /* Masks used to ensure that reserved AttSetFlags are not used    */         
*  /*************************************************************@D3A*/         
*  Att#RsrvMask01 Bit(32) Constant('FFFC0000'X),   /* Ver01 mask @D3A*/         
*  Att#RsrvMask02 Bit(32) Constant('FFFE4000'X),   /* Ver02 mask @D6C*/         
*  Att#RsrvMask03 Bit(32) Constant('FFFE7000'X),/* Ver03 mask@P4C@D8A*/         
*  Att#SymMask    Bit(32) Constant('4F3C3000'X), /* symlink mask @P5C*/         
*  Att#PrivGen    Bit(8)  Constant('06'X);  /* priv genattr bits @D4A*/         
*                                                                               
* /* ATTX structure for xattr calls                              @D9A*/         
* %IF ATTXBASE = '' %THEN                                                       
*   %DO;                                                                        
*     %ATTXBASE = 'Based(AttxPtr)';                                             
*   %END;                                                                       
* %IF TRANSLATE(ATTXBASE) = 'BASED(ATTXPTR)' %THEN                              
*   %DO;                                                                        
*     DCL AttxPtr Ptr(64);           /* Pointer to the ATTX          */         
*   %END;                                                                       
*                                                                               
*Dcl                                                                            
* 1  Attx       ATTXBASE,                                                       
*  3 AttxID      Char(4),         /* +00 Eye Catcher  - 'ATTX'       */         
*  3 AttxVersion Fixed(16),       /* +04 Version                     */         
*  3 AttxSubcmd  Char(2),         /* +06 subcommand                  */         
*  3 AttxFlags   Fixed(32),       /* +08 flags                       */         
*    5 *              Bit(29),                                                  
*    5 AttxfLset      Bit(1),                                                   
*    5 AttxfReplace   Bit(1),                                                   
*    5 AttxfCreate    Bit(1),                                                   
*  3 *           Char(60),        /* +0C reserved                    */         
*  3 AttxNameLn  Fixed(31),       /* +48 attribute name length       */         
*  3 AttxName    Char(256),       /* +4C attribute name              */         
*  3 AttxValLn   Fixed(31),       /* 14C attribute value length      */         
*  3 AttxVal     Char(0),         /* 150 attribute value             */         
*  3 *           Char(0) Bdy(Dword);  /* 150 ATTX ends on doubleword */         
*                                                                               
*DCL                                                                            
*  Attx#ID     Char(4)   Constant('ATTX')   /* Control Block id      */         
* ,Attx#Ver    Fixed(16) Constant(1)        /* Current version       */         
* ,Attx#MaxVal Fixed(32) Constant(50000)    /* max val len           */         
*                                                                               
*  ] AttxSubcmd values:                                                         
* ,Attx#scSet         Fixed(15) Constant(1)                                     
* ,Attx#scGet         Fixed(15) Constant(2)                                     
* ,Attx#scRemove      Fixed(15) Constant(3)                                     
* ,Attx#scList        Fixed(15) Constant(4)                                     
*                                                                               
*  ] AttxName values                                                            
* ,Attx#apfauth       Char(*)   Constant('trusted.apfauth')                     
* ,Attx#sharelib      Char(*)   Constant('trusted.sharelib')                    
* ,Attx#progctl       Char(*)   Constant('trusted.progctl')                     
* ,Attx#noshareas     Char(*)   Constant('system.noshareas')                    
* ,Attx#filefmt       Char(*)   Constant('system.filefmt')                      
* ,Attx#filetag       Char(*)   Constant('system.filetag')                      
* ,Attx#seclabel      Char(*)   Constant('system.seclabel')                     
* ,Attx#auditoraudit  Char(*)   Constant('system.auditoraudit')                 
* ,Attx#useraudit     Char(*)   Constant('system.useraudit')                    
* ,Attx#accessacl     Char(*)   Constant('system.accessacl')                    
* ,Attx#fmodelacl     Char(*)   Constant('system.fmodelacl')                    
* ,Attx#dmodelacl     Char(*)   Constant('system.dmodelacl')                    
* ,Attx#createtime    Char(*)   Constant('system.createtime')                   
* ,Attx#auditid       Char(*)   Constant('system.auditid')                      
*  ] class prefixes                                                             
* ,Attx#trustedclass  Char(*)   Constant('trusted.')                            
* ,Attx#systemclass   Char(*)   Constant('system.')                             
* ,Attx#userclass     Char(*)   Constant('user.')                               
* ;                                                                             
*                                                              /*@D9A*/         
