*        %GOTO VOPNPRO  ;         /* Bilingual header                   00010000
         MACRO                                                          00020000
         BPXYVOPN  &DSECT=YES,&LIST=YES                                 00030000
         GBLB  &VOPN411                                                 00040000
         AIF   (&VOPN411 EQ 1).E411                                     00050000
&VOPN411 SETB  1                                                        00060000
         AIF   ('&LIST' EQ 'YES').A411                                  00070000
         PUSH  PRINT  BPXYVOPN: v_open parameter definitions            00080000
         PRINT OFF                                                      00090000
         AGO   .A411                                                    00100000
*                                  */                                   00110000
*%VOPNPRO: ;                                                            00120000
*/****START OF SPECIFICATIONS****************************************** 00130000
*                                                                       00140000
*    $MAC (BPXYVOPN) COMP(SCPX1) PROD(BPX):                             00150000
*                                                                       00160000
*01* MACRO NAME: BPXYVOPN                                               00170000
*                                                                       00180000
*01* DSECT NAME: VOPN                                                   00190000
*                                                                       00200000
*01* DESCRIPTIVE NAME: BPX1VOP(v_open) Parameter Definitions            00210000
*                                                                       00220000
*02*   ACRONYM: None                                                    00230000
**/                                                                     00240000
*/*01* PROPRIETARY STATEMENT=                                        */ 00250000
*/***PROPRIETARY_STATEMENT********************************************/ 00260000
*/*                                                                  */ 00270000
*/*                                                                  */ 00280000
*/* LICENSED MATERIALS - PROPERTY OF IBM                             */ 00290000
*/* 5694-A01 (C) COPYRIGHT IBM CORP. 2005                            */ 00300000
*/*                                                                  */ 00310000
*/* STATUS= HBB7720                                                  */ 00320000
*/*                                                                  */ 00330000
*/***END_OF_PROPRIETARY_STATEMENT*************************************/ 00340000
*/*                                                                     00350000
*                                                                       00360000
*01* EXTERNAL CLASSIFICATION:  GUPI                                     00370000
*01* END OF EXTERNAL CLASSIFICATION:                                    00380000
*                                                                       00390000
*01* FUNCTION:                                                          00400000
*                                                                       00410000
*      This macro defines the input parameters for v_open.              00420000
*                                                                       00430000
*                                                                       00440000
*01* METHOD OF ACCESS:                                                  00450000
*                                                                       00460000
*02*   PL/X:                                                            00470000
*                                                                       00480000
*        %INCLUDE SYSLIB(BPXYVOPN)                                      00490000
*        By default, the VOpenParms structure is simply based.          00500000
*        If special basing is desired, use %VOPNBASE='BASED(XXXXXX)'.   00510000
*                                                                       00520000
*02*   ASM:                                                             00530000
*        With DSECT=YES, a DSECT is produced and "USING VOPN,reg"       00540000
*        is required for addressability.  Here "reg" contains the       00550000
*        address of VOPN#LENGTH bytes of storage.                       00560000
*        With DSECT=NO, storage is allocated in line and                00570000
*        addressability is provided thru that DSECT or CSECT.           00580000
*        the default is DSECT=YES.                                      00590000
*                                                                       00600000
*01* SIZE: VOPN#LENGTH                                                  00610000
*                                                                       00620000
*01* POINTED TO BY: N/A                                                 00630000
*                                                                       00640000
*01* CREATED BY: Caller of system call                                  00650000
*                                                                       00660000
*01* DELETED BY: Caller of system call                                  00670000
*                                                                       00680000
*01* STORAGE ATTRIBUTES:                                                00690000
*02*   SUBPOOL/DATASPACE:                                               00700000
*02*   KEY:                Caller's                                     00710000
*02*   RESIDENCY:          Primary                                      00720000
*                                                                       00730000
*01* FREQUENCY: 1 per call to v_open                                    00740000
*                                                                       00750000
*01* SERIALIZATION: N/A                                                 00760000
*                                                                       00770000
*01* DEPENDENCIES: N/A                                                  00780000
*                                                                       00790000
*01* NOTES: None                                                        00800000
*                                                                       00810000
*01* COMPONENT: OpenMVS (SCPX1)                                         00820000
*                                                                       00830000
*01* DISTRIBUTION LIBRARY:  AMACLIB                                     00840000
*                                                                       00850000
*01* EYE-CATCHER: None                                                  00860000
*02*   OFFSET:                                                          00870000
*02*   LENGTH:                                                          00880000
*                                                                       00890000
*01* CHANGE-ACTIVITY:                                                   00900000
*                                                                       00910000
*  $D0=DDEA630   HBB7720  031019  PDJT: Initial Release for NFS V4      00920000
*  $D1=DDEA630   HBB7720  040401  PDJS: complete assembler section      00930000
*  $P1=ME01269   HBB7720  040714  PDJS: inserted opens                  00940000
*  $P2=ME06137   HBB7730  051028  PDJT: Shares to a PFS                 00950000
*  $D2=DcrB040   HBB7740  060325  PDJT: Internal v_opens        (A864)  00960000
*                                                                       00970000
****END OF SPECIFICATIONS*********************************************/ 00980000
*        %GOTO VOPNPLS  ;         /* Bilingual header                   00990000
.A411    ANOP  ,                                                        01000000
** BPXYVOPN: V_open Parameters                                          01010000
**  Used by: VOPN                                                       01020000
         AIF   ('&DSECT' EQ 'NO').B411                                  01030000
VOPN                 DSECT ,                                            01040000
         AGO   .C411                                                    01050000
.B411    ANOP  ,                                                        01060000
VOPN                 DS    0D                                           01070000
.C411    ANOP  ,                                                        01080000
VOPNOPENTYPE         DS    F      Type of v_open                        01090000
VOPNOPENOWNER        DS    CL16   Owner identification                  01100000
VOPNSHRACCESS        DS    F      Read, Write, or Both                  01110000
VOPNSHRDENY          DS    F      None, Read, Write, Both               01120000
VOPNOPENTOKEN        DS    CL8    Output/Input Open Token               01130000
VOPNVNTOKEN          DS    CL8    Output Vnode Token                    01140000
VOPNFLAGS            DS    F      Open Flags @D1A                       01150000
                     DS    CL12  @D1C                                   01160000
*                                                                       01170000
VOPN#LENGTH          EQU   *-VOPN Length of this structure              01180000
*                                                                       01190000
** VopnOpenType Values:                                                 01200000
OPEN_CREATE_UNCHECKED  EQU  1                                           01210000
OPEN_CREATE_GUARDED    EQU  2                                           01220000
OPEN_CREATE_EXCLUSIVE  EQU  3                                           01230000
OPEN_FILE              EQU  4                                           01240000
OPEN_NLM_SHR           EQU  5                                           01250000
OPEN_UPGRADE           EQU  6                                           01260000
OPEN_DOWNGRADE         EQU  7                                           01270000
*                                                                       01280000
** VopnShrAccess Values:                                                01290000
SHRACC_WRITE       EQU  1                                               01300000
SHRACC_READ        EQU  2                                               01310000
SHRACC_BOTH        EQU  3                                               01320000
*                                                                       01330000
** VopnShrDeny Values:  @D1C                                            01340000
*                                                                       01350000
SHRDENY_NONE       EQU  0                                               01360000
SHRDENY_WRITE      EQU  1                                               01370000
SHRDENY_READ       EQU  2                                               01380000
SHRDENY_BOTH       EQU  3                                               01390000
*                                                                       01400000
** VopnFlags Values:                                                    01410000
*                                                                       01420000
SHRMOD_NONE        EQU  0                                               01430000
SHRMOD_DENY        EQU  1                                               01440000
SHRMOD_ACC         EQU  2                                               01450000
SHRMOD_BOTH        EQU  3                                               01460000
*                                                                       01470000
*  Share Reservation information passed to a PFS in ts_sysd1     @P2A   01480000
VNOPEN_FILE        EQU  0        Open type                       @P2A   01490000
VNOPEN_NLM_SHR     EQU  5                                        @P2A   01500000
VNOPEN_INTERNAL    EQU 99                                        @P2A   01510000
VNSHRCHK_NONE      EQU  0        Checking requested              @P2A   01520000
VNSHRCHK_ADV       EQU  1                                        @P2A   01530000
VNSHRCHK_MAND      EQU  3                                        @P2A   01540000
*                                                                       01550000
** BPXYVOPN End                                                         01560000
         SPACE 3                                                        01570000
         AIF   ('&LIST' EQ 'YES').E411                                  01580000
         POP   PRINT                                                    01590000
.E411    ANOP  ,                                                        01600000
         MEND  ,                  Terminating PL/X comment           */ 01610000
*%VOPNPLS: ;                                                            01620000
*                                                                       01630000
* %IF VOPNBASE = '' %THEN                                               01640000
*   %DO;                                                                01650000
*     %VOPNBASE = 'Based';                                              01660000
*   %END;                                                               01670000
*                                                                       01680000
* /*-----------------------------------------------------------------*/ 01690000
* /* V_Open OpenParms Parameter                                      */ 01700000
* /*-----------------------------------------------------------------*/ 01710000
* Declare                                                               01720000
*   1 VOpenParms VOPNBASE Bdy(Word),                                    01730000
*     2 VopnOpenType    Fixed(32),        /* Type of v_open          */ 01740000
*     2 VopnOpenOwner   Char(Length(VopnLOwner)),  /* Owner Id       */ 01750000
*     2 VopnShrAccess   Fixed(32),        /* Access Intent to:       */ 01760000
*       3 VopnIOpen       Bit(1),         /*    Internal Open    @D2A*/ 01770000
*       3   *             Bit(29),        /*  READ, WRITE, or BOTH   */ 01780000
*       3 VopnShrAccRd    Bit(1),         /*    Read Access          */ 01790000
*       3 VopnShrAccWrt   Bit(1),         /*    Write Access         */ 01800000
*     2 VopnShrDeny     Fixed(32),        /* Reservations that deny: */ 01810000
*       3   *             Bit(30),        /* NONE, READ, WRITE, BOTH */ 01820000
*       3 VopnShrDenyRd   Bit(1),         /*    Deny Read Access     */ 01830000
*       3 VopnShrDenyWrt  Bit(1),         /*    Deny Write Access    */ 01840000
*     2 VopnOpenToken   Char(8),          /* Output/Input Open Token */ 01850000
*     2 VopnVnToken     Char(8),          /* Output Vnode Token      */ 01860000
*     2 VopnFlags       Bit(32),          /* Flags                   */ 01870000
*      3  *             Bit(30),          /* Reserved                */ 01880000
*      3  Vopn_ModAcc   Bit(1),  /* Modify Access (upgrade/downgrade)*/ 01890000
*      3  Vopn_ModDeny Bit(1),   /* Modify Deny (upgrade/downgrade)  */ 01900000
*     2   *             Char(12);                                       01910000
*                                                                       01920000
*                                                                       01930000
*   /*---------------------------------------------------------------*/ 01940000
*   /* Lock or Open Owner                                            */ 01950000
*   /*---------------------------------------------------------------*/ 01960000
*   Declare                                                             01970000
*     1 VopnLOwner Based Bdy(Word),                                     01980000
*       2 VopnLO_ServerPid Fixed(32),   /* Server's PID              */ 01990000
*       2 VopnLO_ClientPid Fixed(32),   /* Server's Client's ID      */ 02000000
*       2 VopnLO_ClientTid Char(8);     /* Client's Thread's ID      */ 02010000
*                                                                       02020000
*                                                                       02030000
*   /* VopnOpenType Values:             */                              02040000
*   /* (Note value 99 is reserved for internal use only        @P1A*/   02050000
*                                                                       02060000
*   Dcl ( OPEN_CREATE_UNCHECKED   Constant(1),                          02070000
*         OPEN_CREATE_GUARDED     Constant(2),                          02080000
*         OPEN_CREATE_EXCLUSIVE   Constant(3),                          02090000
*         OPEN_FILE               Constant(4),                          02100000
*         OPEN_NLM_SHR            Constant(5),                          02110000
*         OPEN_UPGRADE            Constant(6),                          02120000
*         OPEN_DOWNGRADE          Constant(7)                           02130000
*                            ) Fixed(32);                               02140000
*                                                                       02150000
*   /* VopnShrAccess Values:             */                             02160000
*                                                                       02170000
*   Dcl ( SHRACC_WRITE Constant(1),                                     02180000
*         SHRACC_READ Constant(2),                                      02190000
*         SHRACC_BOTH Constant(3)                                       02200000
*                            ) Fixed(32);                               02210000
*                                                                       02220000
*   /* VopnShrDeny Value:                */                             02230000
*                                                                       02240000
*   Dcl ( SHRDENY_NONE Constant(0),                                     02250000
*         SHRDENY_WRITE Constant(1),                                    02260000
*         SHRDENY_READ Constant(2),                                     02270000
*         SHRDENY_BOTH Constant(3)                                      02280000
*                            ) Fixed(32);                               02290000
*                                                                       02300000
*   /* VopnFlags Values: for upgrade/downgrade */                       02310000
*                                                                       02320000
*   Dcl ( SHRMOD_NONE Constant(0),                                      02330000
*         SHRMOD_DENY Constant(1),                                      02340000
*         SHRMOD_ACC  Constant(2),                                      02350000
*         SHRMOD_BOTH Constant(3)                                       02360000
*                            ) Fixed(32);                               02370000
*                                                                       02380000
*   Dcl Vopn#Length Fixed(32) Constant(Length(VOpenParms));             02390000
*                                                                       02400000
*/*------------------------------------------------------------------*/ 02410000
*/* Share Reservation information passed to a PFS in ts_sysd1    @P2A*/ 02420000
*/*------------------------------------------------------------------*/ 02430000
*              /* Open Type constants for vn_open                @P2A*/ 02440000
*Dcl ( VNOPEN_FILE      Constant(0),  /* For open() or v_open()  @P2A*/ 02450000
*      VNOPEN_NLM_SHR   Constant(5),  /* For NLM Share           @P2A*/ 02460000
*      VNOPEN_INTERNAL  Constant(99), /* For LFS Internal Open   @P2A*/ 02470000
*              /* Checking Requested for vn_rdwr & vn_setattr    @P2A*/ 02480000
*      VNSHRCHK_NONE    Constant(0),  /* No Checking             @P2A*/ 02490000
*      VNSHRCHK_ADV     Constant(1),  /* Advisory Check, V4 only @P2A*/ 02500000
*      VNSHRCHK_MAND    Constant(3)   /* Mandatory Check, all    @P2A*/ 02510000
*                            ) Fixed(32);                               02520000
*                                                                       02530000
