*                                                                       00001000
* %DCL BPXYSMFR_INCLUDED CHAR EXT;                                      00002000
* %DEACTIVATE BPXYSMFR_INCLUDED;                                        00003000
* %IF BPXYSMFR_INCLUDED = '' %THEN                                      00004000
* %DO;                                                                  00005000
*/* Macro made bi-lingual on 21172. CBGEN compile date 21138         */ 00006000
*% /*                                                                   00007000
         MACRO                                                          00008000
         BPXYSMFR &DSECT=YES,&LIST=YES,&TITLE=YES,&SMFRCD92=YES,       *00009000
               &SMF92SSS=COND,&SMF92ID=COND,&SMF92FSM=COND,            *00010000
               &SMF92FSP=COND,&SMF92FSS=COND,&SMF92FSR=COND,           *00011000
               &SMF92FSU=COND,&SMF92FSV=COND,&SMF92FOP=COND,           *00012000
               &SMF92FCL=COND,&SMF92MMP=COND,&SMF92MUN=COND,           *00013000
               &SMF92DFL=COND,&SMF92ESA=COND,&SMF92FAC=COND,           *00014000
               &SMF92FSG=COND,&SMF92FSO=COND                            00015000
         GBLC  &BPXYSMFR_INCLUDED                                       00016000
         GBLC  &ZCBPRINT                                                00017000
&BPXYSMFR_INCLUDED SETC 'YES'                                           00018000
         AIF   ('&LIST' EQ 'NONE').P0                                   00019000
         AIF   ('&TITLE' EQ 'NO').P5                                    00020000
 TITLE   'BPXYSMFR  - OpenMVS File System SMF Record format           '*00021000
                                                                        00022000
.P5      ANOP                                                           00023000
**/ ;                                                                   00024000
*/****START OF SPECIFICATIONS****************************************** 00025000
*                                                                       00026000
*    $MAC (BPXYSMFR) COMP(SCPX1) PROD(BPX):                             00027000
*                                                                       00028000
*01* MACRO NAME: BPXYSMFR                                               00029000
*                                                                       00030000
*01* DSECT NAME: SMFRCD92                                               00031000
*                                                                       00032000
*01* DESCRIPTIVE NAME: OpenMVS File System SMF Record format            00033000
*                                                                       00034000
*02*   ACRONYM: SMFR                                                    00035000
**/                                                                     00036000
*/*01* PROPRIETARY STATEMENT=                                        */ 00037000
*/***PROPRIETARY_STATEMENT********************************************/ 00038000
*/*                                                                  */ 00039000
*/*                                                                  */ 00040000
*/* LICENSED MATERIALS - PROPERTY OF IBM                             */ 00041000
*/* 5650-ZOS COPYRIGHT IBM CORP. 1993, 2021                          */ 00042000
*/*                                                                  */ 00043000
*/* STATUS= HBB77D0                                                  */ 00044000
*/*                                                                  */ 00045000
*/***END_OF_PROPRIETARY_STATEMENT*************************************/ 00046000
*/*                                                                     00047000
*                                                                       00048000
*01* EXTERNAL CLASSIFICATION:  GUPI                                     00049000
*01* END OF EXTERNAL CLASSIFICATION:                                    00050000
*                                                                       00051000
*01* FUNCTION:                                                          00052000
*                                                                       00053000
*      The SMFRCD92 maps the structure of SMF record type 92 which      00054000
*      is written at OpenMVS file open or close, file system            00055000
*      mount, remount or unmount, file system suspend or resume,        00056000
*      and file memory map or unmap.                                    00057000
*                                                                       00058000
*      This is a CBGEN part, see the notes below before changing.       00059000
*                                                                       00060000
*01* METHOD OF ACCESS:                                                  00061000
*                                                                       00062000
*02*   PL/X:                                                            00063000
*                                                                       00064000
*        %INCLUDE SYSLIB(BPXYSMFR)                                      00065000
*        By default, the SMFRCD92 is based on SMF92PTR. If              00066000
*        other basing is desired, use %SMFRBASE='BASED(XXXXXX)'.        00067000
*        If %SMFRBASE='BASED(SMF92PTR)' is coded, a declare for         00068000
*        SMF92PTR is also generated.                                    00069000
*                                                                       00070000
*01* SIZE:                                                              00071000
*            SMF92FSO -- X'0002' bytes                                  00072000
*            SMF92FSG -- X'0098' bytes                                  00073000
*            SMF92FAC -- X'0058' bytes                                  00074000
*            SMF92ESA -- X'0490' bytes                                  00075000
*            SMF92DFL -- X'00CC' bytes                                  00076000
*            SMFRCD92 -- X'0034' bytes                                  00077000
*            SMF92SSS -- X'0014' bytes                                  00078000
*            SMF92ID  -- X'0048' bytes                                  00079000
*            SMF92FSM -- X'006C' bytes                                  00080000
*            SMF92FSP -- X'0002' bytes                                  00081000
*            SMF92FSS -- X'0051' bytes                                  00082000
*            SMF92FSR -- X'0059' bytes                                  00083000
*            SMF92FSU -- X'0094' bytes                                  00084000
*            SMF92FSV -- X'0094' bytes                                  00085000
*            SMF92FOP -- X'0018' bytes                                  00086000
*            SMF92FCL -- X'0084' bytes                                  00087000
*            SMF92MMP -- X'0020' bytes                                  00088000
*            SMF92MUN -- X'0030' bytes                                  00089000
*01*             SMFRCD92 -- X'0034' bytes                              00090000
*01*             SMF92SSS -- X'0014' bytes                              00091000
*01*             SMF92ID  -- X'0048' bytes                              00092000
*01*             SMF92FSM -- X'006C' bytes                              00093000
*01*             SMF92FSP -- X'0002' bytes                              00094000
*01*             SMF92FSS -- X'0050' bytes                              00095000
*01*             SMF92FSR -- X'0058' bytes                              00096000
*01*             SMF92FSU -- X'0094' bytes                              00097000
*01*             SMF92FOP -- X'0018' bytes                              00098000
*01*             SMF92FCL -- X'0044' bytes                              00099000
*01*             SMF92MMP -- X'0020' bytes                       @DCC   00100000
*01*             SMF92MUN -- X'0030' bytes                       @DCC   00101000
*                                                                       00102000
*01* POINTED TO BY: SMF92PTR                                            00103000
*                                                                       00104000
*01* CREATED BY:                                                        00105000
*             Open file record            - BPXFSOPN                    00106000
*             Close file record           - BPXFSCLS                    00107000
*             Mount file System record    - BPXFSLIT and BPXFSMNT       00108000
*                                           and BPXFTCLN and BPXTXMCS   00109000
*                                                                @DDC   00110000
*             Unmount File System record  - BPXFSUMT                    00111000
*             Suspend File System record  - BPXFSQSE                    00112000
*             Resume File System record   - BPXFSUQS                    00113000
*             Mmap record                 - BPXGYMPK             @DCC   00114000
*             Munmap record               - BPXGYVDA,BPXGYKVD    @DCC   00115000
*                                                                       00116000
*01* DELETED BY: Caller of SMFEWTM                                      00117000
*                                                                       00118000
*01* STORAGE ATTRIBUTES:                                                00119000
*02*   SUBPOOL:            N/A                                          00120000
*02*   KEY:                N/A                                          00121000
*02*   RESIDENCY:          N/A                                          00122000
*                                                                       00123000
*01* FREQUENCY: 1 per call to SMFEWTM                                   00124000
*                                                                       00125000
*01* SERIALIZATION: N/A                                                 00126000
*                                                                       00127000
*01* DEPENDENCIES: None                                                 00128000
*                                                                       00129000
*01* NOTES:  The assembly language portion of this macro is             00130000
*            generated using the CBGEN tool - it is not                 00131000
*            to be edited manually.                                     00132000
*                                                                       00133000
*  To make a change in the development release:                   @01A  00134000
*  -------------------------------------------                          00135000
*  1) Extract the BPXYSMFR.CBG part from Git into a dataset.            00136000
*  2) Make your changes to the PLX section only.                        00137000
*     The ASM section will be totally replaced in step 3.               00138000
*  3) Generate a new executable macro through the TSO CBGEN panel.      00139000
*     Do a test assemble of the generated macro.                        00140000
*  4) Transmit the new generated object as the new CBG part in Git.     00141000
*     This is so the Git library object will have the current level     00142000
*     of the ASM section.                                               00143000
*     B390 will generate a new macro for the compile maclibs,           00144000
*     i.e. B390.fmid.MACLIB.  This should match the one you generated,  00145000
*     and transmitted as the .CBG part.                                 00146000
*                                                                       00147000
*  To generate a header file mapping in C:                        @DDA  00148000
*  ---------------------------------------                              00149000
*  1) Extract the BPXYSMFR.CBG part into a PDS.                         00150000
*  2) Generate the header file through the CBGENC tool.                 00151000
*       MASTSSI.COMMON.REXX(CBGENC)                                     00152000
*       Member. ==> BPXYSMFR                                            00153000
*       Source dataset. ==> 'HLQ.DSNAME.PLX'                            00154000
*       Output C Header. ==> 'HLQ.DSNAME.C'                             00155000
*       Output C header for use with CPSI. ==> 'HLQ.DSNAME2.C'          00156000
*  -> CPSI is "C to PL/X Structure Interrogator" similar to PADI.       00157000
*     This will compare the generated C to PLX as a sanity check.       00158000
*                                                                       00159000
*01* COMPONENT: OpenMVS (SCPX1)                                         00160000
*                                                                       00161000
*01* DISTRIBUTION LIBRARY:  AMACLIB                                     00162000
*                                                                       00163000
*01* EYE-CATCHER: none                                                  00164000
*                                                                       00165000
*01* CHANGE-ACTIVITY:                                                   00166000
*                                                                       00167000
*      $L0=POSIXXF  HOM1110 921201 PDP1: OpenMVS Initial Release        00168000
*      $P1=PL70342  HOM1110 920721 PDJT: Change Line Item Flag to XF    00169000
*      $L1=D0AA006  HOM1120 930419 PDI6: OpenMVS Multi-Process Support  00170000
*      $D1=DOAA009  HOM1120 930812 PDEA: Wellington NFS Server Support  00171000
*                                        for Dcr A009.04                00172000
*      $D2=DOAA002  HOM1120 930816 PDEA: (dcr A002.12) SMF support for  00173000
*                                        socket                         00174000
*      $P2=POA0294  HOM1120 940201 PDEA: Change the version number      00175000
*      $P2=PPF0001  HOM1130 940201 PDEA: Change the version number      00176000
*      $P3=POA0421  HOM1120 940415 PDNU: SMF Accounting                 00177000
*      $P3=PPF0006  HOM1130 940415 PDNU: SMF Accounting                 00178000
*      $D3=DPFA065  HOM1130 940628 PDPB: A065.03 MMAP support           00179000
*      $D4=DPFA052  HOM1130 940630 PDEA: A052.05 NFSC support           00180000
*      $D5=DPFA091  HOM1130 941103 PDSV: DCR A091.02 Automountd/remount 00181000
*      $D6=DUXA217  HBB6605 970411 PDSK: NFS Performance Items A217.12  00182000
*      $D7=DCA0309  JBB6609 990410 PDRD: DCR A309 Support               00183000
*      $P4=PYN0220  HBB7708 020301 PDFO: Bilingual fixup                00184000
*      $D8=DDEA630  HBB7720 040316 PDJT: NFS V4                         00185000
*      $D9=ME06291  HBB7740 060322 PDFV: Subtype 14 Deletes  B033.00    00186000
*      $01=OA24208  HBB7730 080209 PDJT: Subtype 15 Ext Security Attrs  00187000
*      $DA=DCRC221  HBB7790 110111 PDGY: New subtypes 16 & 17           00188000
*      $02=OA43426  HBB7790 140113 PD2R: subtype 16 also used for       00189000
*                                        pipes/fifos close recording    00190000
*      $DB=DCRC923  HBB77B0 161117 PDX8: New subtype 8                  00191000
*      $DC=WI169636 HBB77D0 201117 PDCL: changes to Map and Unmap       00192000
*      $DD=WI344928 HBB77D0 210219 PDCF: Add SMF Record "Mount" on      00193000
*                                        remount (TRSQ OA61176)         00194000
*                                                                       00195000
****END OF SPECIFICATIONS*********************************************/ 00196000
*% /*                                                                   00197000
.P0      ANOP                                                           00198000
         AIF   ('&ZCBPRINT' EQ 'NO').P1                                 00199000
         AIF   ('&LIST' EQ 'YES').P2                                    00200000
.P1      ANOP                                                           00201000
         PUSH  PRINT                                                    00202000
         PRINT OFF                                                      00203000
.P2      ANOP                                                           00204000
         AIF   ('&SMFRCD92' EQ 'NO').L0002                              00205000
         AIF   ('&DSECT' EQ 'YES').L0003                                00206000
         AIF   ('&SMFRCD92' NE 'YES').L0002                             00207000
SMFRCD92 DS    0D                                                       00208000
         AGO   .L0004                                                   00209000
.L0003   ANOP                                                           00210000
SMFRCD92 DSECT                                                          00211000
.L0004   ANOP                                                           00212000
SMF92RPS DS    0CL52     Fixed record sections                          00213000
*                                                                       00214000
*                                                                       00215000
*    SMF Record Header Section                                          00216000
*                                                                       00217000
*                                                                       00218000
*                                                                       00219000
SMF92RHD DS    0CL28     Record header section                          00220000
SMF92LEN DS    H         Record length                                  00221000
SMF92SEG DS    H         Segment descriptor                             00222000
SMF92FLG DS    0B        Header flag byte                               00223000
SMF92SSF EQU   X'80'     Bit 0 - Subsys ID after Sys ID                 00224000
SMF92SBT EQU   X'40'     Bit 1 - Subtypes utilized                      00225000
         ORG   SMF92FLG+1                                               00226000
SMF92RTY DS    B         Record type - 92 ('5C'x)                       00227000
SMF92TME DS    FL4       Record written time                            00228000
SMF92DTE DS    FL4       Record written date                            00229000
SMF92SID DS    CL4       System identifier                              00230000
SMF92WID DS    CL4       Subsystem identifier                           00231000
SMF92STP DS    H         Record subtype                                 00232000
         DS    CL2       Reserved                                       00233000
SMF92SDL DS    H         Length of self-defining section                00234000
*                                                                       00235000
*                                                                       00236000
*    Self Defining Section                                              00237000
*                                                                       00238000
*                                                                       00239000
*                                                                       00240000
SMF92SDS DS    0CL24                                                    00241000
SMF92SOF DS    F         Offset to subsystem section                    00242000
SMF92SLN DS    H         Length of subsystem section                    00243000
SMF92SON DS    H         Number of subsystem sections                   00244000
SMF92IOF DS    F         Offset of identification section               00245000
SMF92ILN DS    H         Length of identification section               00246000
SMF92ION DS    H         Number of identification section               00247000
SMF92DOF DS    F         Offset of data section                         00248000
SMF92DLN DS    H         Length of data section                         00249000
SMF92DON DS    H         Number of data sections                        00250000
SMFRCD92_LEN EQU *-SMFRCD92                                             00251000
.L0002   ANOP                                                           00252000
         AIF   ('&SMF92SSS' EQ 'NO').L0005                              00253000
         AIF   ('&DSECT' EQ 'YES').L0006                                00254000
         AIF   ('&SMF92SSS' NE 'YES').L0005                             00255000
.L0006   ANOP                                                           00256000
*                                                                       00257000
*                                                                       00258000
*    Subsystem Section                                                  00259000
*                                                                       00260000
*                                                                       00261000
*                                                                       00262000
         AIF   ('&DSECT' EQ 'YES').L0007                                00263000
SMF92SSS DS    0H                                                       00264000
         AGO   .L0008                                                   00265000
.L0007   ANOP                                                           00266000
SMF92SSS DSECT                                                          00267000
.L0008   ANOP                                                           00268000
SMF92TYP DS    H         Record subtype, 1 = File system mount, 2 =    *00269000
                         File system suspend, 4 = File system resume,  *00270000
                         5 = File system unmount, 6 = File system      *00271000
                         remount, 7 = File system move, 8 = File       *00272000
                         system migration, 10 = File open, 11 = File   *00273000
                         close. 12 = Memmap. 13 = Memunmap. 14 =       *00274000
                         File/directory delete 15 = Security           *00275000
                         attributes changed 16 = Socket/char spec      *00276000
                         close 17 = File accesses                       00277000
SMF92RVN DS    CL2       Record version number                          00278000
SMF92PNM DS    CL8       Product name - OpenMVS                         00279000
SMF92OSL DS    CL8       MVS product level                              00280000
SMF92SSS_LEN EQU *-SMF92SSS                                             00281000
.L0005   ANOP                                                           00282000
         AIF   ('&SMF92ID' EQ 'NO').L0009                               00283000
         AIF   ('&DSECT' EQ 'YES').L000A                                00284000
         AIF   ('&SMF92ID' NE 'YES').L0009                              00285000
.L000A   ANOP                                                           00286000
*                                                                       00287000
*                                                                       00288000
*    Identification Section                                             00289000
*                                                                       00290000
*                                                                       00291000
*                                                                       00292000
         AIF   ('&DSECT' EQ 'YES').L000B                                00293000
SMF92ID  DS    0F                                                       00294000
         AGO   .L000C                                                   00295000
.L000B   ANOP                                                           00296000
SMF92ID  DSECT                                                          00297000
.L000C   ANOP                                                           00298000
SMF92JBN DS    CL8       JobName                                        00299000
SMF92RST DS    F         Reader start time                              00300000
SMF92RSD DS    CL4       Reader start date                              00301000
SMF92STM DS    CL8       Step name                                      00302000
SMF92RGD DS    CL8       SAF group ID                                   00303000
SMF92RUD DS    CL8       SAF user ID                                    00304000
SMF92UID DS    F         OpenMVS real user ID                           00305000
SMF92GID DS    F         OpenMVS real group ID                          00306000
SMF92PID DS    F         OpenMVS process ID                             00307000
SMF92PGD DS    F         OpenMVS process group ID                       00308000
SMF92SSD DS    F         OpenMVS session ID                             00309000
SMF92API DS    F         OpenMVS anchor process ID                      00310000
SMF92APG DS    F         OpenMVS anchor proc grp ID                     00311000
SMF92ASG DS    F         OpenMVS anchor session ID                      00312000
SMF92ID_LEN EQU *-SMF92ID                                               00313000
.L0009   ANOP                                                           00314000
         AIF   ('&SMF92FSM' EQ 'NO').L000D                              00315000
         AIF   ('&DSECT' EQ 'YES').L000E                                00316000
         AIF   ('&SMF92FSM' NE 'YES').L000D                             00317000
.L000E   ANOP                                                           00318000
*                                                                       00319000
*                                                                       00320000
*    Data Section for File System Mount subtype (subtype 1)             00321000
*                                                                       00322000
*                                                                       00323000
*                                                                       00324000
         AIF   ('&DSECT' EQ 'YES').L000F                                00325000
SMF92FSM DS    0F                                                       00326000
         AGO   .L0010                                                   00327000
.L000F   ANOP                                                           00328000
SMF92FSM DSECT                                                          00329000
.L0010   ANOP                                                           00330000
SMF92MTM DS    BL8       Time of mount, STCK format. If SMF92MRM is    *00331000
                         ON, this is the time of the Mount for Remount  00332000
SMF92MPF DS    F         Offset of path section                         00333000
SMF92MFT DS    F         File system type from MntEntFSType field of   *00334000
                         BPXYMNTE                                       00335000
SMF92MFM DS    F         File system mode from MntEntFSMode field of   *00336000
                         BPXYMNTE                                       00337000
SMF92MDN DS    F         File system device number from MntEntFSDev    *00338000
                         field of BPXYMNTE                              00339000
SMF92MDD DS    CL8       DDNAME specified on mount from MntEntFSDDName *00340000
                         field of BPXYMNTE                              00341000
SMF92MTN DS    CL8       File system type name from MntEntFSTName      *00342000
                         field of BPXYMNTE                              00343000
SMF92MFN DS    CL44      File system name from MntEntFSName field of   *00344000
                         BPXYMNTE                                       00345000
SMF92MBL DS    F         File system block size                         00346000
SMF92MST DS    BL8       Total space in file system in block size      *00347000
                         units                                          00348000
SMF92MSU DS    BL8       Allocated space in file system in block size  *00349000
                         units                                          00350000
SMF92MFG DS    0B        Flag byte                                      00351000
SMF92MAU EQU   X'80'     Mounted by Automounter                         00352000
SMF92MAS EQU   X'40'     Asynchronous mount 1 = Yes, 0 = No             00353000
SMF92MRM EQU   X'20'     Mount was for remount                          00354000
         ORG   SMF92MFG+1                                               00355000
SMF92MF2 DS    0B        Second Flag byte                               00356000
SMF92MLU EQU   X'80'     Mounted localy                                 00357000
SMF92MNU EQU   X'40'     Mounted remotely                               00358000
SMF92MDO EQU   X'20'     HFS Sysplex client                             00359000
SMF92MSN EQU   X'10'     Filesystem owner                               00360000
         ORG   SMF92MF2+1                                               00361000
         DS    CL2       Reserved                                       00362000
SMF92FSM_LEN EQU *-SMF92FSM                                             00363000
.L000D   ANOP                                                           00364000
         AIF   ('&SMF92FSP' EQ 'NO').L0011                              00365000
         AIF   ('&DSECT' EQ 'YES').L0012                                00366000
         AIF   ('&SMF92FSP' NE 'YES').L0011                             00367000
SMF92FSP DS    0H                                                       00368000
         AGO   .L0013                                                   00369000
.L0012   ANOP                                                           00370000
SMF92FSP DSECT                                                          00371000
.L0013   ANOP                                                           00372000
SMF92PPL DS    H         Length of path name                            00373000
SMF92PPN DS    0C        Path name of directory where file system is   *00374000
                         mounted. Maximum length=1024 When SMF92MRM is *00375000
                         ON, a '+' indicates that the path name is     *00376000
                         truncated to 64 bytes.                         00377000
SMF92FSP_LEN EQU *-SMF92FSP                                             00378000
.L0011   ANOP                                                           00379000
         AIF   ('&SMF92FSS' EQ 'NO').L0014                              00380000
         AIF   ('&DSECT' EQ 'YES').L0015                                00381000
         AIF   ('&SMF92FSS' NE 'YES').L0014                             00382000
.L0015   ANOP                                                           00383000
*                                                                       00384000
*                                                                       00385000
*    Data Section for File System Suspend subtype (subtype 2)           00386000
*        This subtype is written as a result of a quiesce syscall       00387000
*                                                                       00388000
*                                                                       00389000
*                                                                       00390000
         AIF   ('&DSECT' EQ 'YES').L0016                                00391000
SMF92FSS DS    0F                                                       00392000
         AGO   .L0017                                                   00393000
.L0016   ANOP                                                           00394000
SMF92FSS DSECT                                                          00395000
.L0017   ANOP                                                           00396000
SMF92STS DS    BL8       Time of suspend, STCK format                   00397000
SMF92SFT DS    F         File system type from MntEntFSType field of   *00398000
                         BPXYMNTE                                       00399000
SMF92SFM DS    F         File system mode from MntEntFSMode field of   *00400000
                         BPXYMNTE                                       00401000
SMF92SDN DS    F         File system device number from MntEntFSDev    *00402000
                         field of BPXYMNTE                              00403000
SMF92SDD DS    CL8       DDNAME specified on mount from MntEntFSDDName *00404000
                         field of BPXYMNTE                              00405000
SMF92STN DS    CL8       File system type name from MntEntFSTName      *00406000
                         field of BPXYMNTE                              00407000
SMF92SFN DS    CL44      File system name from MntEntFSName field of   *00408000
                         BPXYMNTE                                       00409000
SMF92SFG DS    0B        Flag btye                                      00410000
SMF92SLU EQU   X'80'     Mounted localy                                 00411000
SMF92SNU EQU   X'40'     Mounted remotely                               00412000
SMF92SDO EQU   X'20'     HFS Sysplex client                             00413000
SMF92SSN EQU   X'10'     Filesystem owner                               00414000
         ORG   SMF92FSS+81                                              00415000
SMF92FSS_LEN EQU *-SMF92FSS                                             00416000
.L0014   ANOP                                                           00417000
         AIF   ('&SMF92FSR' EQ 'NO').L0018                              00418000
         AIF   ('&DSECT' EQ 'YES').L0019                                00419000
         AIF   ('&SMF92FSR' NE 'YES').L0018                             00420000
.L0019   ANOP                                                           00421000
*                                                                       00422000
*                                                                       00423000
*    Data Section for File System Resume subtype (subtype 4)            00424000
*        This subtype is written as a result of an unquiesce syscall    00425000
*                                                                       00426000
*                                                                       00427000
*                                                                       00428000
         AIF   ('&DSECT' EQ 'YES').L001A                                00429000
SMF92FSR DS    0F                                                       00430000
         AGO   .L001B                                                   00431000
.L001A   ANOP                                                           00432000
SMF92FSR DSECT                                                          00433000
.L001B   ANOP                                                           00434000
SMF92RTS DS    BL8       Time of suspend, STCK format                   00435000
SMF92RTR DS    BL8       Time of resume, STCK format                    00436000
SMF92RFT DS    F         File system type from MntEntFSType field of   *00437000
                         BPXYMNTE                                       00438000
SMF92RFM DS    F         File system mode from MntEntFSMode field of   *00439000
                         BPXYMNTE                                       00440000
SMF92RDN DS    F         File system device number from MntEntFSDev    *00441000
                         field of BPXYMNTE                              00442000
SMF92RDD DS    CL8       DDNAME specified on mount from MntEntFSDDName *00443000
                         field of BPXYMNTE                              00444000
SMF92RTN DS    CL8       File system type name from MntEntFSTName      *00445000
                         field of BPXYMNTE                              00446000
SMF92RFN DS    CL44      File system name from MntEntFSName field of   *00447000
                         BPXYMNTE                                       00448000
SMF92RFG DS    0B        Flag btye                                      00449000
SMF92RLU EQU   X'80'     Mounted localy                                 00450000
SMF92RNU EQU   X'40'     Mounted remotely                               00451000
SMF92RDO EQU   X'20'     HFS Sysplex client                             00452000
SMF92RSN EQU   X'10'     Filesystem owner                               00453000
         ORG   SMF92FSR+89                                              00454000
SMF92FSR_LEN EQU *-SMF92FSR                                             00455000
.L0018   ANOP                                                           00456000
         AIF   ('&SMF92FSU' EQ 'NO').L001C                              00457000
         AIF   ('&DSECT' EQ 'YES').L001D                                00458000
         AIF   ('&SMF92FSU' NE 'YES').L001C                             00459000
.L001D   ANOP                                                           00460000
*                                                                       00461000
*                                                                       00462000
*    Data Section for File System Unmount subtype (subtype 5)           00463000
*    Data Section for File System Remount subtype (subtype 6)           00464000
*    (Subtypes 5 & 6 differ only by the subtype numbers)                00465000
*                                                                       00466000
*                                                                       00467000
*                                                                       00468000
         AIF   ('&DSECT' EQ 'YES').L001E                                00469000
SMF92FSU DS    0F                                                       00470000
         AGO   .L001F                                                   00471000
.L001E   ANOP                                                           00472000
SMF92FSU DSECT                                                          00473000
.L001F   ANOP                                                           00474000
SMF92UTM DS    BL8       Time of mount, STCK format                     00475000
SMF92UTU DS    BL8       Time of unmount, STCK format                   00476000
SMF92UFT DS    F         File system type from MntEntFSType field of   *00477000
                         BPXYMNTE                                       00478000
SMF92UFM DS    F         File system mode from MntEntFSMode field of   *00479000
                         BPXYMNTE                                       00480000
SMF92UDN DS    F         File system device number from MntEntFSDev    *00481000
                         field of BPXYMNTE                              00482000
SMF92UDD DS    CL8       DDNAME specified on mount from MntEntFSDDName *00483000
                         field of BPXYMNTE                              00484000
SMF92UTN DS    CL8       File system type name from MntEntFSTName      *00485000
                         field of BPXYMNTE                              00486000
SMF92UFN DS    CL44      File system name from MntEntFSName field of   *00487000
                         BPXYMNTE                                       00488000
SMF92UBL DS    F         File system block size                         00489000
SMF92UST DS    BL8       Total space in file system in block size      *00490000
                         units                                          00491000
SMF92USU DS    BL8       Allocated space in file system in block size  *00492000
                         units                                          00493000
SMF92USR DS    F         Reads                                          00494000
SMF92USW DS    F         Writes                                         00495000
SMF92UDI DS    F         Directory I/O blocks                           00496000
SMF92UIR DS    F         I/O blocks read                                00497000
SMF92UIW DS    F         I/O blocks written                             00498000
SMF92UBR DS    BL8       Bytes read                                     00499000
SMF92UBW DS    BL8       Bytes written                                  00500000
SMF92UFG DS    0B        Flag byte                                      00501000
SMF92UAU EQU   X'80'     Unmounted by Automounter                       00502000
SMF92UMI EQU   X'40'     Unmnted/Remnted by Migration                   00503000
         ORG   SMF92UFG+1                                               00504000
SMF92UF2 DS    0B        Second flag byte                               00505000
SMF92ULU EQU   X'80'     Mounted localy                                 00506000
SMF92UNU EQU   X'40'     Mounted remotely                               00507000
SMF92UDO EQU   X'20'     HFS Sysplex client                             00508000
SMF92USN EQU   X'10'     Filesystem owner                               00509000
         ORG   SMF92UF2+1                                               00510000
         DS    CL2       Reserved                                       00511000
SMF92FSU_LEN EQU *-SMF92FSU                                             00512000
.L001C   ANOP                                                           00513000
         AIF   ('&SMF92FSV' EQ 'NO').L0020                              00514000
         AIF   ('&DSECT' EQ 'YES').L0021                                00515000
         AIF   ('&SMF92FSV' NE 'YES').L0020                             00516000
.L0021   ANOP                                                           00517000
*                                                                       00518000
*                                                                       00519000
*   Data Section for Move File System subtype (subtype 7)               00520000
*                                                                       00521000
*                                                                       00522000
*                                                                       00523000
         AIF   ('&DSECT' EQ 'YES').L0022                                00524000
SMF92FSV DS    0F                                                       00525000
         AGO   .L0023                                                   00526000
.L0022   ANOP                                                           00527000
SMF92FSV DSECT                                                          00528000
.L0023   ANOP                                                           00529000
SMF92VTV DS    BL8       Time of move, STCK format                      00530000
SMF92VTM DS    BL8       Time of mount, STCK format                     00531000
SMF92VFT DS    F         File system type from MntEntFSType field of   *00532000
                         BPXYMNTE                                       00533000
SMF92VFM DS    F         File system mode from MntEntFSMode field of   *00534000
                         BPXYMNTE                                       00535000
SMF92VDN DS    F         File system device number from MntEntFSDev    *00536000
                         field of BPXYMNTE                              00537000
SMF92VDD DS    CL8       DDNAME specified on mount from MntEntFSDDName *00538000
                         field of BPXYMNTE                              00539000
SMF92VTN DS    CL8       File system type name from MntEntFSTName      *00540000
                         field of BPXYMNTE                              00541000
SMF92VNM DS    CL44      File system name from MntEntFSName field of   *00542000
                         BPXYMNTE                                       00543000
SMF92VBL DS    F         File system block size                         00544000
SMF92VST DS    BL8       Total space in file system in block size      *00545000
                         units                                          00546000
SMF92VSU DS    BL8       Allocated space in file system in block size  *00547000
                         units                                          00548000
SMF92VSR DS    F         Reads                                          00549000
SMF92VSW DS    F         Writes                                         00550000
SMF92VDI DS    F         Directory I/O blocks                           00551000
SMF92VIR DS    F         I/O blocks read                                00552000
SMF92VIW DS    F         I/O blocks written                             00553000
SMF92VBR DS    BL8       Bytes read                                     00554000
SMF92VBW DS    BL8       Bytes written                                  00555000
SMF92VFG DS    0B        Flag byte - reason for move                    00556000
SMF92VUI EQU   X'80'     User-initiated                                 00557000
SMF92VRI EQU   X'40'     Recovery                                       00558000
         ORG   SMF92VFG+1                                               00559000
SMF92VOF DS    0B        Flag byte - old status                         00560000
SMF92VOL EQU   X'80'     Mounted localy                                 00561000
SMF92VON EQU   X'40'     Mounted remotely                               00562000
SMF92VOD EQU   X'20'     HFS Sysplex client                             00563000
SMF92VOS EQU   X'10'     Filesystem owner                               00564000
         ORG   SMF92VOF+1                                               00565000
SMF92VNF DS    0B        Flag byte - new status                         00566000
SMF92VNL EQU   X'80'     Mounted localy                                 00567000
SMF92VNN EQU   X'40'     Mounted remotely                               00568000
SMF92VND EQU   X'20'     HFS Sysplex client                             00569000
SMF92VNS EQU   X'10'     Filesystem owner                               00570000
         ORG   SMF92VNF+1                                               00571000
         DS    CL1       Reserved                                       00572000
SMF92FSV_LEN EQU *-SMF92FSV                                             00573000
.L0020   ANOP                                                           00574000
         AIF   ('&SMF92FOP' EQ 'NO').L0024                              00575000
         AIF   ('&DSECT' EQ 'YES').L0025                                00576000
         AIF   ('&SMF92FOP' NE 'YES').L0024                             00577000
.L0025   ANOP                                                           00578000
*                                                                       00579000
*                                                                       00580000
*    Data Section for File Open subtype (subtype 10)                    00581000
*                                                                       00582000
*                                                                       00583000
*                                                                       00584000
         AIF   ('&DSECT' EQ 'YES').L0026                                00585000
SMF92FOP DS    0F                                                       00586000
         AGO   .L0027                                                   00587000
.L0026   ANOP                                                           00588000
SMF92FOP DSECT                                                          00589000
.L0027   ANOP                                                           00590000
SMF92OTO DS    BL8       Open time - STCK format                        00591000
SMF92OTY DS    X         File Type as defined in BPXYFTYP               00592000
SMF92OFG DS    0B        record flag                                    00593000
SMF92ONF EQU   X'80'     record generated by VNode interface service    00594000
SMF92ONS EQU   X'40'     Network or local socket, 1 = network           00595000
SMF92OCS EQU   X'20'     Client or server socket 1 = client             00596000
         ORG   SMF92OFG+1                                               00597000
         DS    CL2       Reserved                                       00598000
SMF92OTK DS    BL4       Open file token (Matches close)                00599000
SMF92OIN DS    F         Inode number                                   00600000
SMF92ODN DS    F         Unique device number                           00601000
SMF92FOP_LEN EQU *-SMF92FOP                                             00602000
.L0024   ANOP                                                           00603000
         AIF   ('&SMF92FCL' EQ 'NO').L0028                              00604000
         AIF   ('&DSECT' EQ 'YES').L0029                                00605000
         AIF   ('&SMF92FCL' NE 'YES').L0028                             00606000
.L0029   ANOP                                                           00607000
*                                                                       00608000
*                                                                       00609000
*    Data Section for File Close subtype (subtype 11)                   00610000
*    Data Section for Character Special and Socket File Close           00611000
*     subtype (subtype 16)                                              00612000
*                                                                       00613000
*                                                                       00614000
*                                                                       00615000
         AIF   ('&DSECT' EQ 'YES').L002A                                00616000
SMF92FCL DS    0F                                                       00617000
         AGO   .L002B                                                   00618000
.L002A   ANOP                                                           00619000
SMF92FCL DSECT                                                          00620000
.L002B   ANOP                                                           00621000
SMF92CTO DS    BL8       Open time - STCK format                        00622000
SMF92CTC DS    BL8       Close time - STCK format                       00623000
SMF92CTY DS    X         File type as defined in BPXYFTYP               00624000
SMF92CFG DS    0B        record flag                                    00625000
SMF92CNF EQU   X'80'     record generated by VNode interface service    00626000
SMF92CNS EQU   X'40'     Network or local socket 1 = network            00627000
SMF92CCS EQU   X'20'     Client or server socket 1 = server             00628000
SMF92CFC EQU   X'10'     File was cached                                00629000
SMF92CDR EQU   X'08'     File had Deny Read on it                       00630000
SMF92CDW EQU   X'04'     File had Deny Write on it                      00631000
         ORG   SMF92CFG+1                                               00632000
         DS    CL2       Reserved                                       00633000
SMF92CTK DS    BL4       Open file token                                00634000
SMF92CIN DS    F         Inode number                                   00635000
SMF92CDN DS    F         Unique device number                           00636000
SMF92CSR DS    F         Reads                                          00637000
SMF92CSW DS    F         Writes                                         00638000
SMF92CDI DS    F         Directory I/O blocks                           00639000
SMF92CIR DS    F         I/O blocks read                                00640000
SMF92CIW DS    F         I/O blocks written                             00641000
SMF92CBR DS    BL8       Bytes read                                     00642000
SMF92CBW DS    BL8       Bytes written                                  00643000
SMF92CPN DS    CL64      Pathname                                       00644000
SMF92FCL_LEN EQU *-SMF92FCL                                             00645000
.L0028   ANOP                                                           00646000
         AIF   ('&SMF92MMP' EQ 'NO').L002C                              00647000
         AIF   ('&DSECT' EQ 'YES').L002D                                00648000
         AIF   ('&SMF92MMP' NE 'YES').L002C                             00649000
.L002D   ANOP                                                           00650000
*                                                                       00651000
*                                                                       00652000
*    Data Section for mmap subtype (subtype 12)                         00653000
*                                                                       00654000
*                                                                       00655000
*                                                                       00656000
         AIF   ('&DSECT' EQ 'YES').L002E                                00657000
SMF92MMP DS    0D                                                       00658000
         AGO   .L002F                                                   00659000
.L002E   ANOP                                                           00660000
SMF92MMP DSECT                                                          00661000
.L002F   ANOP                                                           00662000
SMF92MTO DS    BL8       time of mmap - STCK format                     00663000
SMF92MSZ DS    F         Number of bytes being memory mapped or 2G-1   *00664000
                         if map>=2G                                     00665000
SMF92MTK DS    F         mmap file token (matches token in munmap data *00666000
                         section                                        00667000
SMF92MIN DS    F         file serial number                             00668000
SMF92MMDN DS   F         file unique device number                      00669000
SMF92MLSZ DS   FL8       64 bit Number of bytes being memory mapped     00670000
SMF92MMP_LEN EQU *-SMF92MMP                                             00671000
.L002C   ANOP                                                           00672000
         AIF   ('&SMF92MUN' EQ 'NO').L0030                              00673000
         AIF   ('&DSECT' EQ 'YES').L0031                                00674000
         AIF   ('&SMF92MUN' NE 'YES').L0030                             00675000
.L0031   ANOP                                                           00676000
*                                                                       00677000
*                                                                       00678000
*    Data Section for munmap subtype (subtype 13)                       00679000
*                                                                       00680000
*                                                                       00681000
*                                                                       00682000
         AIF   ('&DSECT' EQ 'YES').L0032                                00683000
SMF92MUN DS    0D                                                       00684000
         AGO   .L0033                                                   00685000
.L0032   ANOP                                                           00686000
SMF92MUN DSECT                                                          00687000
.L0033   ANOP                                                           00688000
SMF92MUTO DS   BL8       time of mmap - STCK format                     00689000
SMF92MUTC DS   BL8       time of munmap - STCK format                   00690000
SMF92MUSZ DS   F         number of bytes being memory mapped or 2G-1   *00691000
                         if map>=2G                                     00692000
SMF92MUTK DS   F         mmap file token (matches token in mmap data   *00693000
                         section                                        00694000
SMF92MUIN DS   F         file serial number                             00695000
SMF92MUDN DS   F         file unique device number                      00696000
SMF92MUIR DS   F         I/O blocks read                                00697000
SMF92MUIW DS   F         I/O blocks written                             00698000
SMF92MULSZ DS  FL8       64 bit number of bytes being memory mapped     00699000
SMF92MUN_LEN EQU *-SMF92MUN                                             00700000
.L0030   ANOP                                                           00701000
         AIF   ('&SMF92DFL' EQ 'NO').L0034                              00702000
         AIF   ('&DSECT' EQ 'YES').L0035                                00703000
         AIF   ('&SMF92DFL' NE 'YES').L0034                             00704000
.L0035   ANOP                                                           00705000
*                                                                       00706000
*                                                                       00707000
*    Data Section for File Delete Subtype (Subtype 14)                  00708000
*                                                                       00709000
*                                                                       00710000
*                                                                       00711000
         AIF   ('&DSECT' EQ 'YES').L0036                                00712000
SMF92DFL DS    0F                                                       00713000
         AGO   .L0037                                                   00714000
.L0036   ANOP                                                           00715000
SMF92DFL DSECT                                                          00716000
.L0037   ANOP                                                           00717000
SMF92D   DS    0CL136    Delete information                             00718000
SMF92DFT DS    BL8       Delete time - STCK format                      00719000
SMF92DTY DS    X         File Type as defined in BPXYFTYP               00720000
SMF92DFLG DS   0X        Flags                                          00721000
SMF92DREN EQU  X'80'     Rename record                                  00722000
         ORG   SMF92DFLG+1                                              00723000
         DS    H         Reserved                                       00724000
SMF92DIN DS    F         File serial number                             00725000
SMF92DINP DS   F         File serial number of parent                   00726000
SMF92DDN DS    F         File unique device number                      00727000
SMF92DFS DS    CL44      File System Name                               00728000
SMF92DNL DS    F         Length of name for delete                      00729000
SMF92DFN DS    CL64      Name deleted                                   00730000
SMF92DR  DS    0CL68     Rename information                             00731000
SMF92DNLR DS   F         Length of name for rename                      00732000
SMF92DFNR DS   CL64      Name deleted                                   00733000
SMF92DFL_LEN EQU *-SMF92DFL                                             00734000
.L0034   ANOP                                                           00735000
         AIF   ('&SMF92ESA' EQ 'NO').L0038                              00736000
         AIF   ('&DSECT' EQ 'YES').L0039                                00737000
         AIF   ('&SMF92ESA' NE 'YES').L0038                             00738000
.L0039   ANOP                                                           00739000
*                                                                       00740000
*                                                                       00741000
*    Data Section for Ext Security Attr Change (Subtype 15)             00742000
*                                                                       00743000
*                                                                       00744000
*                                                                       00745000
         AIF   ('&DSECT' EQ 'YES').L003A                                00746000
SMF92ESA DS    0F                                                       00747000
         AGO   .L003B                                                   00748000
.L003A   ANOP                                                           00749000
SMF92ESA DSECT                                                          00750000
.L003B   ANOP                                                           00751000
SMF92ESA_BASE DS 0CL144  Fixed Length Secion                            00752000
SMF92ACT DS    BL8       Change Time - STCK format                      00753000
SMF92ATY DS    X         File Type. See BPXYFTYP                        00754000
SMF92AFLG DS   X         Flags                                          00755000
         DS    H         Reserved                                       00756000
SMF92AIN DS    F         File Ino number                                00757000
SMF92ADN DS    F         File's File System devno                       00758000
SMF92AFS DS    CL44      File System Name                               00759000
SMF92AOLDGENVAL DS 0BL4  File's original gen values - same as          *00760000
                         st_GenValue from BPXYSTAT.                     00761000
         DS    BL3                                                      00762000
SMF92AOLDGENVALSECBYTE DS 0B                                            00763000
SMF92AOLDSHARELIB EQU X'10' Shared Library                              00764000
SMF92AOLDAPFAUTH EQU X'04' Program is APF Auth                          00765000
SMF92AOLDPROGCTL EQU X'02' Program Controlled                           00766000
         ORG   SMF92AOLDGENVAL+4                                        00767000
SMF92AOLDSECATTRSC DS 0CL4 File's original Security flags in character *00768000
                         form: A, P, S.                                 00769000
SMF92AOLDATTRCHAR DS CL1 '>' Delimiter                                  00770000
SMF92AOLDSHRLIBC DS CL1  =S if Shared Lib was on                        00771000
SMF92AOLDAPFAUTHC DS CL1 =A if APF Auth was on                          00772000
SMF92AOLDPGMCTLC DS CL1  =P if Program Ctl was on                       00773000
SMF92ANEWGENVAL DS 0BL4  New gen values after the change same as       *00774000
                         st_GenValue from BPXYSTAT.                     00775000
         DS    BL3                                                      00776000
SMF92ANEWGENVALSECBYTE DS 0B                                            00777000
SMF92ANEWSHARELIB EQU X'10' Shared Library                              00778000
SMF92ANEWAPFAUTH EQU X'04' Program is APF Auth                          00779000
SMF92ANEWPROGCTL EQU X'02' Program Controlled                           00780000
         ORG   SMF92ANEWGENVAL+4                                        00781000
SMF92ANEWSECATTRSC DS 0CL4 File's new Security flags in character      *00782000
                         form: A, P, S.                                 00783000
SMF92ANEWATTRCHAR DS CL1 '>' Delimiter                                  00784000
SMF92ANEWSHRLIBC DS CL1  =S if Shared Lib is on                         00785000
SMF92ANEWAPFAUTHC DS CL1 =A if APF Auth is on                           00786000
SMF92ANEWPGMCTLC DS CL1  =P if Program Ctl is on                        00787000
SMF92AOWNUID DS F        File Owner UID                                 00788000
SMF92AOWNGID DS F        File Owner GID                                 00789000
SMF92ASECLABEL DS CL8    File SecLabel                                  00790000
SMF92AAUDITFID DS CL16   RACF's File Id - this is the same as the      *00791000
                         XXXX_FILE_ID in the various RACF SMF Type 80  *00792000
                         audit records.                                 00793000
         DS    CL20      Reserved                                       00794000
SMF92ACWDRC DS F         getcwd Error Return Code                       00795000
SMF92ACWDRSN DS F        getcwd Error Reason Code - If the full        *00796000
                         pathname of the file could not be determined  *00797000
                         these fields contain the return and reason    *00798000
                         codes of the error. In this case the SMF92APN *00799000
                         field will contain the relative pathname as   *00800000
                         entered by the user. SMF92APN is a full       *00801000
                         pathname if SMF92ACwdRc=0.                     00802000
SMF92APNL DS   F         File Pathname length                           00803000
SMF92APN DS    CL1024    File Pathname - the absolute pathname as      *00804000
                         entered by the user or the getcwd() value for *00805000
                         the current working directory concatenated    *00806000
                         with the relative name that was entered by    *00807000
                         the user.                                      00808000
*                                                                       00809000
*    *****************************************************************  00810000
*    *                                                               *  00811000
*    * The SubType 15 record is variable length and ends at the end  *  00812000
*    * of the pathname string within the SMF92APN field.                00813000
*    * Security Attribute Character Values - for SMF92AOldSecAttrsC  *  00814000
*    * and SMF92ANewSecAttrsC                                           00815000
*    *                                                               *  00816000
*    *****************************************************************  00817000
*                                                                       00818000
*                                                                       00819000
SMF92#SECATTRAPFAUTH EQU C'A'                                           00820000
SMF92#SECATTRPGMCTL EQU C'P'                                            00821000
SMF92#SECATTRSHARLIB EQU C'S'                                           00822000
SMF92#SECATTRDELIM EQU C'>'                                             00823000
SMF92ESA_LEN EQU *-SMF92ESA                                             00824000
.L0038   ANOP                                                           00825000
         AIF   ('&SMF92FAC' EQ 'NO').L003C                              00826000
         AIF   ('&DSECT' EQ 'YES').L003D                                00827000
         AIF   ('&SMF92FAC' NE 'YES').L003C                             00828000
.L003D   ANOP                                                           00829000
*                                                                       00830000
*                                                                       00831000
*    Data Section for File Accesses subtype (subtype 17)                00832000
*                                                                       00833000
*                                                                       00834000
*                                                                       00835000
         AIF   ('&DSECT' EQ 'YES').L003E                                00836000
SMF92FAC DS    0F                                                       00837000
         AGO   .L003F                                                   00838000
.L003E   ANOP                                                           00839000
SMF92FAC DSECT                                                          00840000
.L003F   ANOP                                                           00841000
SMF92FAWT DS   BL8       This can be time when internal file control   *00842000
                         block is released. If SMF92FAIT is on,        *00843000
                         denotes SMF interval time.                     00844000
SMF92FAFT DS   X         File type as defined in BPXYFTYP               00845000
SMF92FAFG DS   0B        record flag                                    00846000
SMF92FAIT EQU  X'80'     When on SMF92FAWT is SMF interval time.        00847000
         ORG   SMF92FAFG+1                                              00848000
         DS    CL2       Reserved                                       00849000
SMF92FAIN DS   F         Inode number                                   00850000
SMF92FADN DS   F         Unique device number                           00851000
SMF92FATI DS   F         Total accesses to file during interval         00852000
SMF92FAPN DS   CL64      Pathname                                       00853000
*                                                                       00854000
*    Used when calling WriteSMF9217 to indicate if the record being     00855000
*    written was cut during inact in FTCLN or on the SMF interval       00856000
*                                                                       00857000
*                                                                       00858000
SMF92#INACT EQU 1                                                       00859000
SMF92#INTERVAL EQU 2                                                    00860000
SMF92FAC_LEN EQU *-SMF92FAC                                             00861000
.L003C   ANOP                                                           00862000
         AIF   ('&SMF92FSG' EQ 'NO').L0040                              00863000
         AIF   ('&DSECT' EQ 'YES').L0041                                00864000
         AIF   ('&SMF92FSG' NE 'YES').L0040                             00865000
.L0041   ANOP                                                           00866000
*                                                                       00867000
*                                                                       00868000
*    Data Section for File System Migration subtype (subtype 8)         00869000
*                                                                       00870000
*                                                                       00871000
*                                                                       00872000
         AIF   ('&DSECT' EQ 'YES').L0042                                00873000
SMF92FSG DS    0F                                                       00874000
         AGO   .L0043                                                   00875000
.L0042   ANOP                                                           00876000
SMF92FSG DSECT                                                          00877000
.L0043   ANOP                                                           00878000
SMF92GTM DS    BL8       Time of migration, STCK format                 00879000
SMF92GMO DS    F         Offset of mount parm section                   00880000
SMF92GFT DS    F         File system type from MntEntFSType field of   *00881000
                         BPXYMNTE                                       00882000
SMF92GFM DS    F         File system mode from MntEntFSMode field of   *00883000
                         BPXYMNTE                                       00884000
SMF92GDN DS    F         File system device number from MntEntFSDev    *00885000
                         field of BPXYMNTE                              00886000
SMF92GDD DS    CL8       DDNAME specified on mount from MntEntFSDDName *00887000
                         field of BPXYMNTE                              00888000
SMF92GTN DS    CL8       File system type name from MntEntFSTName      *00889000
                         field of BPXYMNTE                              00890000
SMF92GFN DS    CL44      File system name from MntEntFSName field of   *00891000
                         BPXYMNTE. Migration target filesystem name     00892000
SMF92GON DS    CL44      Migration source filesystem name               00893000
SMF92GBL DS    F         File system block size                         00894000
SMF92GST DS    BL8       Total space in file system in block size      *00895000
                         units                                          00896000
SMF92GSU DS    BL8       Allocated space in file system in block size  *00897000
                         units                                          00898000
SMF92GFG DS    0B        Flag byte                                      00899000
         DS    B         Reserved                                       00900000
SMF92GF2 DS    0B        Second Flag byte                               00901000
SMF92GLU EQU   X'80'     Mounted locally                                00902000
SMF92GNU EQU   X'40'     Mounted remotely                               00903000
SMF92GSN EQU   X'10'     Filesystem owner                               00904000
         ORG   SMF92GF2+1                                               00905000
         DS    CL2       Reserved                                       00906000
SMF92FSG_LEN EQU *-SMF92FSG                                             00907000
.L0040   ANOP                                                           00908000
         AIF   ('&SMF92FSO' EQ 'NO').L0044                              00909000
         AIF   ('&DSECT' EQ 'YES').L0045                                00910000
         AIF   ('&SMF92FSO' NE 'YES').L0044                             00911000
SMF92FSO DS    0H                                                       00912000
         AGO   .L0046                                                   00913000
.L0045   ANOP                                                           00914000
SMF92FSO DSECT                                                          00915000
.L0046   ANOP                                                           00916000
SMF92MOL DS    H         Length of mount parm option                    00917000
SMF92MON DS    0C        Mount parm option used when mounting target   *00918000
                         file system. Maximum length=500                00919000
*                                                                       00920000
*    Version Constants - SMF92RVN                                       00921000
*                                                                       00922000
*                                                                       00923000
SMF92#VERSION02 EQU C'02' Record version 02                             00924000
SMF92#VERSION01 EQU C'01' Record version 01                             00925000
SMF92#VERSION EQU C'02'  Record version num                             00926000
*                                                                       00927000
*    Subtype Values - SMF92TYP & SMF92STP                               00928000
*                                                                       00929000
*                                                                       00930000
SMF92#MOUNT EQU 1        Mount subtype                                  00931000
SMF92#SUSPEND EQU 2      Suspend subtype                                00932000
SMF92#RESUME EQU 4       Resume subtype                                 00933000
SMF92#UNMOUNT EQU 5      UnMount subtype                                00934000
SMF92#REMOUNT EQU 6      ReMount subtype                                00935000
SMF92#MOVE EQU 7         Move subtype                                   00936000
SMF92#OPEN EQU 10        Open subtype                                   00937000
SMF92#CLOSE EQU 11       Close subtype                                  00938000
SMF92#MMAP EQU 12        Memmap subtype                                 00939000
SMF92#MUNMAP EQU 13      Memunmap subtype                               00940000
SMF92#DELETE EQU 14      Delete subtype                                 00941000
SMF92#EXTSEC EQU 15      Ext Security                                   00942000
SMF92#CLSSOCCHARSPEC EQU 16 Close sockets & character special &        *00943000
                         pipes/fifos @02C                               00944000
SMF92#FILEACC EQU 17     File acesses                                   00945000
SMF92#MIGRATION EQU 8    File system migration                          00946000
SMF92#MMAP64RECLEN EQU 32 Memmap subtype record length                  00947000
SMF92#MUNMAP64RECLEN EQU 48 Memunmap subtype record length              00948000
SMF92FSO_LEN EQU *-SMF92FSO                                             00949000
.L0044   ANOP                                                           00950000
         AIF   ('&ZCBPRINT' EQ 'NO').P3                                 00951000
         AIF   ('&LIST' EQ 'YES').P4                                    00952000
.P3      ANOP                                                           00953000
         POP   PRINT                                                    00954000
.P4      ANOP                                                           00955000
.P_EXIT  ANOP                                                           00956000
         MEND                                                           00957000
**/ ;                                                                   00958000
* %BPXYSMFR_INCLUDED = 'YES';                                           00959000
* %DCL ZCBPRINT CHAR EXT;                                               00960000
* %DEACTIVATE ZCBPRINT;                                                 00961000
* %DCL BPXYSMFR_LIST CHAR EXT;                                          00962000
* %DEACTIVATE BPXYSMFR_LIST;                                            00963000
* %IF BPXYSMFR_LIST = 'NO' !                                            00964000
*    ZCBPRINT = 'NO' %THEN                                              00965000
* %DO;                                                                  00966000
*   @LIST PUSH NOECHO;                                                  00967000
*   @LIST NOASSEMBLE NOECHO;                                            00968000
*   @LIST OFF C NOECHO;                                                 00969000
* %END;                                                                 00970000
*/* Start of PL/X Source                                             */ 00971000
*%IF SMFRBASE='' %THEN                                                  00972000
*  %DO;                                                                 00973000
*    %SMFRBASE='BASED(SMF92PTR)';                                       00974000
*  %END;                                                                00975000
*%IF SMFRBASE='BASED(SMF92PTR)' %THEN                                   00976000
*  %DO;                                                                 00977000
*    DCL SMF92PTR PTR(31);        /* Pointer to SMFRCD92             */ 00978000
*  %END;                                                                00979000
*DCL                                                                    00980000
*  1 SMFRCD92 SMFRBASE BDY(DWORD),                                      00981000
*    2 SMF92RPS,                  /* Fixed record sections           */ 00982000
*/*                                                                  */ 00983000
*/*  SMF Record Header Section                                       */ 00984000
*/*                                                                  */ 00985000
*      3 SMF92RHD,                /* Record header section           */ 00986000
*        5 SMF92LEN Fixed(15),    /* Record length                   */ 00987000
*        5 SMF92SEG Fixed(15),    /* Segment descriptor              */ 00988000
*        5 SMF92FLG Bit(8),       /* Header flag byte                */ 00989000
*          7 SMF92SSF Bit(1),     /* Bit 0 - Subsys ID after Sys ID  */ 00990000
*          7 SMF92SBT Bit(1),     /* Bit 1 - Subtypes utilized       */ 00991000
*          7 * Bit(1),            /* Bit 2 - reserved                */ 00992000
*          7 * Bit(1),            /* Bit 3 - MVS/4.X                 */ 00993000
*          7 * Bit(1),            /* Bit 4 - MVS/ESA                 */ 00994000
*          7 * Bit(1),            /* Bit 5 - MVS/XA                  */ 00995000
*          7 * Bit(1),            /* Bit 6 - VS2                     */ 00996000
*          7 * Bit(1),            /* Bit 7 - VS1                     */ 00997000
*        5 SMF92RTY Bit(8),       /* Record type - 92  ('5C'x)       */ 00998000
*        5 SMF92TME Fixed(31) Bdy(Hword),/* Record written time      */ 00999000
*        5 SMF92DTE Fixed(31) Bdy(Hword),/* Record written date      */ 01000000
*        5 SMF92SID Char(4),      /* System identifier               */ 01001000
*        5 SMF92WID Char(4),      /* Subsystem identifier            */ 01002000
*        5 SMF92STP Fixed (15),   /* Record subtype                  */ 01003000
*        5 * Char(2),             /* Reserved                        */ 01004000
*        5 SMF92SDL Fixed (15),   /* Length of self-defining section */ 01005000
*/*                                                                  */ 01006000
*/*  Self Defining Section                                           */ 01007000
*/*                                                                  */ 01008000
*      3 SMF92SDS,                                                      01009000
*        5 SMF92SOF Fixed (31),   /* Offset to subsystem section     */ 01010000
*        5 SMF92SLN Fixed (15),   /* Length of subsystem section     */ 01011000
*        5 SMF92SON Fixed (15),   /* Number of subsystem sections    */ 01012000
*        5 SMF92IOF Fixed (31),   /* Offset of identification section*/ 01013000
*        5 SMF92ILN Fixed (15),   /* Length of identification section*/ 01014000
*        5 SMF92ION Fixed (15),   /* Number of identification section*/ 01015000
*        5 SMF92DOF Fixed (31),   /* Offset of data section          */ 01016000
*        5 SMF92DLN Fixed (15),   /* Length of data section          */ 01017000
*        5 SMF92DON Fixed (15),   /* Number of data sections         */ 01018000
*/*                                                                  */ 01019000
*/*  Subsystem Section                                               */ 01020000
*/*                                                                  */ 01021000
*  1 SMF92SSS BASED(ADDR(SMFRCD92)+SMF92SOF),                           01022000
*    3 SMF92TYP Fixed(15),        /* Record subtype,                    01023000
*                                     1 = File system mount,            01024000
*                                     2 = File system suspend,          01025000
*                                     4 = File system resume,           01026000
*                                     5 = File system unmount,          01027000
*                                     6 = File system remount,   @D5A   01028000
*                                     7 = File system move,      @D7A   01029000
*                                     8 = File system migration, @DBA   01030000
*                                    10 = File open,                    01031000
*                                    11 = File close.                   01032000
*                                    12 = Memmap.                       01033000
*                                    13 = Memunmap.                     01034000
*                                    14 = File/directory delete  @D9A   01035000
*                                    15 = Security attributes changed   01036000
*                                    16 = Socket/char spec close @DRA   01037000
*                                    17 = File accesses          @DRA*/ 01038000
*    3 SMF92RVN Char(2),          /* Record version number           */ 01039000
*    3 SMF92PNM Char(8),          /* Product name - OpenMVS          */ 01040000
*    3 SMF92OSL Char(8),          /* MVS product level               */ 01041000
*/*                                                                  */ 01042000
*/*  Identification Section                                          */ 01043000
*/*                                                                  */ 01044000
*  1 SMF92ID  BASED(ADDR(SMFRCD92)+SMF92IOF),                           01045000
*    3 SMF92JBN Char(8),          /* JobName                         */ 01046000
*    3 SMF92RST Fixed(31),        /* Reader start time               */ 01047000
*    3 SMF92RSD Char(4),          /* Reader start date               */ 01048000
*    3 SMF92STM Char(8),          /* Step name                       */ 01049000
*    3 SMF92RGD Char(8),          /* SAF group ID                    */ 01050000
*    3 SMF92RUD Char(8),          /* SAF user ID                     */ 01051000
*    3 SMF92UID Fixed(32),        /* OpenMVS real user ID            */ 01052000
*    3 SMF92GID Fixed(32),        /* OpenMVS real group ID           */ 01053000
*    3 SMF92PID Fixed(32),        /* OpenMVS process ID              */ 01054000
*    3 SMF92PGD Fixed(32),        /* OpenMVS process group ID        */ 01055000
*    3 SMF92SSD Fixed(32),        /* OpenMVS session ID              */ 01056000
*    3 SMF92API Fixed(32),        /* OpenMVS anchor process ID   @L1A*/ 01057000
*    3 SMF92APG Fixed(32),        /* OpenMVS anchor proc grp ID  @L1A*/ 01058000
*    3 SMF92ASG Fixed(32),        /* OpenMVS anchor session ID   @L1A*/ 01059000
*/*                                                                  */ 01060000
*/*  Data Section for File System Mount subtype (subtype 1)          */ 01061000
*/*                                                                  */ 01062000
*  1 SMF92FSM BASED(ADDR(SMFRCD92)+SMF92DOF),                           01063000
*    3 SMF92MTM Bit(64),          /* Time of mount, STCK format.        01064000
*                                    If SMF92MRM is ON, this is the     01065000
*                                    time of the Mount for Remount      01066000
*                                                                @DDC*/ 01067000
*    3 SMF92MPF Fixed(31),        /* Offset of path section          */ 01068000
*    3 SMF92MFT Fixed(32),        /* File system type from              01069000
*                                    MntEntFSType field of BPXYMNTE  */ 01070000
*    3 SMF92MFM Fixed(32),        /* File system mode from              01071000
*                                    MntEntFSMode field of BPXYMNTE  */ 01072000
*    3 SMF92MDN Fixed(32),        /* File system device number from     01073000
*                                    MntEntFSDev field of BPXYMNTE   */ 01074000
*    3 SMF92MDD Char(8),          /* DDNAME specified on mount from     01075000
*                                    MntEntFSDDName field of BPXYMNTE*/ 01076000
*    3 SMF92MTN Char(8),          /* File system type name from         01077000
*                                    MntEntFSTName field of BPXYMNTE */ 01078000
*    3 SMF92MFN Char(44),         /* File system name from              01079000
*                                    MntEntFSName field of BPXYMNTE  */ 01080000
*    3 SMF92MBL Fixed(31),        /* File system block size          */ 01081000
*    3 SMF92MST Bit(64),          /* Total space in file system         01082000
*                                    in block size units             */ 01083000
*    3 SMF92MSU Bit(64),          /* Allocated space in file system     01084000
*                                    in block size units             */ 01085000
*    3 SMF92MFG Bit(8),           /* Flag byte                   @D5C*/ 01086000
*      5 SMF92MAU Bit(1),         /* Mounted by Automounter      @D5A*/ 01087000
*      5 SMF92MAS Bit(1),         /* Asynchronous mount                 01088000
*                                    1 = Yes, 0 = No             @D5M*/ 01089000
*      5 SMF92MRM Bit(1),         /* Mount was for remount       @DDA*/ 01090000
*      5 *        Bit(5),         /* Reserved              @DDC 6@D7A*/ 01091000
*    3 SMF92MF2 Bit(8),           /* Second Flag byte                */ 01092000
*      5 SMF92MLU Bit(1),         /* Mounted localy                  */ 01093000
*      5 SMF92MNU Bit(1),         /* Mounted remotely                */ 01094000
*      5 SMF92MDO Bit(1),         /* HFS Sysplex client              */ 01095000
*      5 SMF92MSN Bit(1),         /* Filesystem owner                */ 01096000
*      5 *        Bit(4),         /* Reserved                    @DDA*/ 01097000
*    3 *        Char(2),          /* Reserved                    @D4A*/ 01098000
*  1 SMF92FSP Based(Addr(SMFRCD92)+SMF92MPF),                           01099000
*    5 SMF92PPL Fixed(15),        /* Length of path name             */ 01100000
*    5 SMF92PPN Char(*),          /* Path name of directory where       01101000
*                                    file system is mounted.            01102000
*                                    Maximum length=1024                01103000
*                                    When SMF92MRM is ON, a '+'         01104000
*                                    indicates that the path name is    01105000
*                                    truncated to 64 bytes.      @DDC*/ 01106000
*/*                                                                  */ 01107000
*/*  Data Section for File System Suspend subtype (subtype 2)        */ 01108000
*/*      This subtype is written as a result of a quiesce syscall    */ 01109000
*/*                                                                  */ 01110000
*  1 SMF92FSS BASED(ADDR(SMFRCD92)+SMF92DOF),                           01111000
*    3 SMF92STS Bit(64),          /* Time of suspend, STCK format    */ 01112000
*    3 SMF92SFT Fixed(32),        /* File system type from              01113000
*                                    MntEntFSType field of BPXYMNTE  */ 01114000
*    3 SMF92SFM Fixed(32),        /* File system mode from              01115000
*                                    MntEntFSMode field of BPXYMNTE  */ 01116000
*    3 SMF92SDN Fixed(32),        /* File system device number from     01117000
*                                    MntEntFSDev field of BPXYMNTE   */ 01118000
*    3 SMF92SDD Char(8),          /* DDNAME specified on mount from     01119000
*                                    MntEntFSDDName field of BPXYMNTE*/ 01120000
*    3 SMF92STN Char(8),          /* File system type name from         01121000
*                                    MntEntFSTName field of BPXYMNTE */ 01122000
*    3 SMF92SFN Char(44),         /* File system name from              01123000
*                                    MntEntFSName field of BPXYMNTE  */ 01124000
*    3 SMF92SFG Bit(8),           /* Flag btye                  6@D7A*/ 01125000
*      5 SMF92SLU Bit(1),         /* Mounted localy                  */ 01126000
*      5 SMF92SNU Bit(1),         /* Mounted remotely                */ 01127000
*      5 SMF92SDO Bit(1),         /* HFS Sysplex client              */ 01128000
*      5 SMF92SSN Bit(1),         /* Filesystem owner                */ 01129000
*      5 *        Bit(4),         /* Reserved                        */ 01130000
*/*                                                                  */ 01131000
*/*  Data Section for File System Resume subtype (subtype 4)         */ 01132000
*/*      This subtype is written as a result of an unquiesce syscall */ 01133000
*/*                                                                  */ 01134000
*  1 SMF92FSR BASED(ADDR(SMFRCD92)+SMF92DOF),                           01135000
*    3 SMF92RTS Bit(64),          /* Time of suspend, STCK format    */ 01136000
*    3 SMF92RTR Bit(64),          /* Time of resume, STCK format     */ 01137000
*    3 SMF92RFT Fixed(32),        /* File system type from              01138000
*                                    MntEntFSType field of BPXYMNTE  */ 01139000
*    3 SMF92RFM Fixed(32),        /* File system mode from              01140000
*                                    MntEntFSMode field of BPXYMNTE  */ 01141000
*    3 SMF92RDN Fixed(32),        /* File system device number from     01142000
*                                    MntEntFSDev field of BPXYMNTE   */ 01143000
*    3 SMF92RDD Char(8),          /* DDNAME specified on mount from     01144000
*                                    MntEntFSDDName field of BPXYMNTE*/ 01145000
*    3 SMF92RTN Char(8),          /* File system type name from         01146000
*                                    MntEntFSTName field of BPXYMNTE */ 01147000
*    3 SMF92RFN Char(44),         /* File system name from              01148000
*                                    MntEntFSName field of BPXYMNTE  */ 01149000
*    3 SMF92RFG Bit(8),           /* Flag btye                  6@D7A*/ 01150000
*      5 SMF92RLU Bit(1),         /* Mounted localy                  */ 01151000
*      5 SMF92RNU Bit(1),         /* Mounted remotely                */ 01152000
*      5 SMF92RDO Bit(1),         /* HFS Sysplex client              */ 01153000
*      5 SMF92RSN Bit(1),         /* Filesystem owner                */ 01154000
*      5 *        Bit(4),         /* Reserved                        */ 01155000
*/*                                                                  */ 01156000
*/*  Data Section for File System Unmount subtype (subtype 5)        */ 01157000
*/*  Data Section for File System Remount subtype (subtype 6)    @D5A*/ 01158000
*/*  (Subtypes 5 & 6 differ only by the subtype numbers)         @D5A*/ 01159000
*/*                                                                  */ 01160000
*  1 SMF92FSU BASED(ADDR(SMFRCD92)+SMF92DOF),                           01161000
*    3 SMF92UTM Bit(64),          /* Time of mount, STCK format      */ 01162000
*    3 SMF92UTU Bit(64),          /* Time of unmount, STCK format    */ 01163000
*    3 SMF92UFT Fixed(32),        /* File system type from              01164000
*                                    MntEntFSType field of BPXYMNTE  */ 01165000
*    3 SMF92UFM Fixed(32),        /* File system mode from              01166000
*                                    MntEntFSMode field of BPXYMNTE  */ 01167000
*    3 SMF92UDN Fixed(32),        /* File system device number from     01168000
*                                    MntEntFSDev field of BPXYMNTE   */ 01169000
*    3 SMF92UDD Char(8),          /* DDNAME specified on mount from     01170000
*                                    MntEntFSDDName field of BPXYMNTE*/ 01171000
*    3 SMF92UTN Char(8),          /* File system type name from         01172000
*                                    MntEntFSTName field of BPXYMNTE */ 01173000
*    3 SMF92UFN Char(44),         /* File system name from              01174000
*                                    MntEntFSName field of BPXYMNTE  */ 01175000
*    3 SMF92UBL Fixed(31),        /* File system block size          */ 01176000
*    3 SMF92UST Bit(64),          /* Total space in file system         01177000
*                                    in block size units             */ 01178000
*    3 SMF92USU Bit(64),          /* Allocated space in file system     01179000
*                                    in block size units             */ 01180000
*    3 SMF92USR Fixed(32),        /* Reads                           */ 01181000
*    3 SMF92USW Fixed(32),        /* Writes                          */ 01182000
*    3 SMF92UDI Fixed(32),        /* Directory I/O blocks            */ 01183000
*    3 SMF92UIR Fixed(32),        /* I/O blocks read                 */ 01184000
*    3 SMF92UIW Fixed(32),        /* I/O blocks written              */ 01185000
*    3 SMF92UBR Bit(64),          /* Bytes read                      */ 01186000
*    3 SMF92UBW Bit(64),          /* Bytes written                   */ 01187000
*    3 SMF92UFG Bit(8),           /* Flag byte                   @D5A*/ 01188000
*      5 SMF92UAU Bit(1),         /* Unmounted by Automounter    @D5A*/ 01189000
*      5 SMF92UMI Bit(1),         /* Unmnted/Remnted by Migration@DBA*/ 01190000
*      5 *        Bit(6),         /* Reserved                   6@D7A*/ 01191000
*    3 SMF92UF2 Bit(8),           /* Second flag byte                */ 01192000
*      5 SMF92ULU Bit(1),         /* Mounted localy                  */ 01193000
*      5 SMF92UNU Bit(1),         /* Mounted remotely                */ 01194000
*      5 SMF92UDO Bit(1),         /* HFS Sysplex client              */ 01195000
*      5 SMF92USN Bit(1),         /* Filesystem owner                */ 01196000
*    3 *        Char(2),          /* Reserved                    @D5A*/ 01197000
*/*                                                                  */ 01198000
*/* Data Section for Move File System subtype (subtype 7)            */ 01199000
*/*                                                                  */ 01200000
*  1 SMF92FSV BASED(ADDR(SMFRCD92)+SMF92DOF),                           01201000
*    3 SMF92VTV Bit(64),          /* Time of move, STCK format       */ 01202000
*    3 SMF92VTM Bit(64),          /* Time of mount, STCK format      */ 01203000
*    3 SMF92VFT Fixed(32),        /* File system type from              01204000
*                                    MntEntFSType field of BPXYMNTE  */ 01205000
*    3 SMF92VFM Fixed(32),        /* File system mode from              01206000
*                                    MntEntFSMode field of BPXYMNTE  */ 01207000
*    3 SMF92VDN Fixed(32),        /* File system device number from     01208000
*                                    MntEntFSDev field of BPXYMNTE   */ 01209000
*    3 SMF92VDD Char(8),          /* DDNAME specified on mount from     01210000
*                                    MntEntFSDDName field of BPXYMNTE*/ 01211000
*    3 SMF92VTN Char(8),          /* File system type name from         01212000
*                                    MntEntFSTName field of BPXYMNTE */ 01213000
*    3 SMF92VNM Char(44),         /* File system name from              01214000
*                                    MntEntFSName field of BPXYMNTE  */ 01215000
*    3 SMF92VBL Fixed(31),        /* File system block size          */ 01216000
*    3 SMF92VST Bit(64),          /* Total space in file system         01217000
*                                    in block size units             */ 01218000
*    3 SMF92VSU Bit(64),          /* Allocated space in file system     01219000
*                                    in block size units             */ 01220000
*    3 SMF92VSR Fixed(32),        /* Reads                           */ 01221000
*    3 SMF92VSW Fixed(32),        /* Writes                          */ 01222000
*    3 SMF92VDI Fixed(32),        /* Directory I/O blocks            */ 01223000
*    3 SMF92VIR Fixed(32),        /* I/O blocks read                 */ 01224000
*    3 SMF92VIW Fixed(32),        /* I/O blocks written              */ 01225000
*    3 SMF92VBR Bit(64),          /* Bytes read                      */ 01226000
*    3 SMF92VBW Bit(64),          /* Bytes written                   */ 01227000
*    3 SMF92VFG Bit(8),           /* Flag byte - reason for move     */ 01228000
*      5 SMF92VUI Bit(1),         /* User-initiated                  */ 01229000
*      5 SMF92VRI Bit(1),         /* Recovery                        */ 01230000
*      5 *        Bit(6),         /* Reserved                        */ 01231000
*    3 SMF92VOF Bit(8),           /* Flag byte - old status          */ 01232000
*      5 SMF92VOL Bit(1),         /* Mounted localy                  */ 01233000
*      5 SMF92VON Bit(1),         /* Mounted remotely                */ 01234000
*      5 SMF92VOD Bit(1),         /* HFS Sysplex client              */ 01235000
*      5 SMF92VOS Bit(1),         /* Filesystem owner                */ 01236000
*      5 *        Bit(4),         /* Reserved                        */ 01237000
*    3 SMF92VNF Bit(8),           /* Flag byte - new status          */ 01238000
*      5 SMF92VNL Bit(1),         /* Mounted localy                  */ 01239000
*      5 SMF92VNN Bit(1),         /* Mounted remotely                */ 01240000
*      5 SMF92VND Bit(1),         /* HFS Sysplex client              */ 01241000
*      5 SMF92VNS Bit(1),         /* Filesystem owner                */ 01242000
*    3 *        Char(1),          /* Reserved                        */ 01243000
*/*                                                                  */ 01244000
*/*  Data Section for File Open subtype (subtype 10)                 */ 01245000
*/*                                                                  */ 01246000
*  1 SMF92FOP BASED(ADDR(SMFRCD92)+SMF92DOF),                           01247000
*    3 SMF92OTO Bit(64),          /* Open time - STCK format         */ 01248000
*    3 SMF92OTY Fixed(8),         /* File Type as defined in BPXYFTYP*/ 01249000
*    3 SMF92OFG    Bit(8),        /* record flag                 @D1A*/ 01250000
*      5 SMF92ONF  Bit(1),        /* record generated by VNode          01251000
*                                    interface service           @D1A*/ 01252000
*      5 SMF92ONS  Bit(1),        /* Network or local socket,           01253000
*                                    1 = network                 @D2A*/ 01254000
*      5 SMF92OCS  Bit(1),        /* Client or server socket            01255000
*                                    1 = client                  @D2A*/ 01256000
*      5 *         Bit(5),        /* Reserved                    @D2C*/ 01257000
*    3 *   Char(2),               /* Reserved                        */ 01258000
*    3 SMF92OTK Bit(32),          /* Open file token (Matches close) */ 01259000
*    3 SMF92OIN Fixed(32),        /* Inode number                    */ 01260000
*    3 SMF92ODN Fixed(32),        /* Unique device number            */ 01261000
*/*                                                                  */ 01262000
*/*  Data Section for File Close subtype (subtype 11)                */ 01263000
*/*  Data Section for Character Special and Socket File Close        */ 01264000
*/*   subtype (subtype 16)                                           */ 01265000
*/*                                                                  */ 01266000
*  1 SMF92FCL BASED(ADDR(SMFRCD92)+SMF92DOF),                           01267000
*    3 SMF92CTO Bit(64),          /* Open time - STCK format         */ 01268000
*    3 SMF92CTC Bit(64),          /* Close time - STCK format        */ 01269000
*    3 SMF92CTY Fixed(8),         /* File type as defined in BPXYFTYP*/ 01270000
*    3 SMF92CFG    Bit(8),        /* record flag                 @D1A*/ 01271000
*      5 SMF92CNF  Bit(1),        /* record generated by VNode          01272000
*                                    interface service           @D1A*/ 01273000
*      5 SMF92CNS  Bit(1),        /* Network or local socket            01274000
*                                    1 = network                 @D2A*/ 01275000
*      5 SMF92CCS  Bit(1),        /* Client or server socket            01276000
*                                    1 = server                  @P3C*/ 01277000
*      5 SMF92CFC  Bit(1),        /* File was cached             @D6A*/ 01278000
*      5 SMF92CDR  Bit(1),        /* File had Deny Read on it    @D8A*/ 01279000
*      5 SMF92CDW  Bit(1),        /* File had Deny Write on it   @D8A*/ 01280000
*      5 *         Bit(2),        /* Reserved                    @D8C*/ 01281000
*    3 *   Char(2),               /* Reserved                        */ 01282000
*    3 SMF92CTK Bit(32),          /* Open file token                 */ 01283000
*    3 SMF92CIN Fixed(32),        /* Inode number                    */ 01284000
*    3 SMF92CDN Fixed(32),        /* Unique device number            */ 01285000
*    3 SMF92CSR Fixed(32),        /* Reads                           */ 01286000
*    3 SMF92CSW Fixed(32),        /* Writes                          */ 01287000
*    3 SMF92CDI Fixed(32),        /* Directory I/O blocks            */ 01288000
*    3 SMF92CIR Fixed(32),        /* I/O blocks read                 */ 01289000
*    3 SMF92CIW Fixed(32),        /* I/O blocks written              */ 01290000
*    3 SMF92CBR Bit(64),          /* Bytes read                      */ 01291000
*    3 SMF92CBW Bit(64),          /* Bytes written                   */ 01292000
*    3 SMF92CPN Char(64),         /* Pathname                    @D6A*/ 01293000
*/*                                                                  */ 01294000
*/*  Data Section for mmap subtype (subtype 12)                  @D3A*/ 01295000
*/*                                                                  */ 01296000
*  1 SMF92MMP BASED(ADDR(SMFRCD92)+SMF92DOF),                           01297000
*    3 SMF92MTO Bit(64),          /* time of mmap - STCK format  @D3A*/ 01298000
*    3 SMF92MSZ Fixed(32),        /* Number of bytes being memory       01299000
*                                    mapped or 2G-1 if map>=2G   @DCC*/ 01300000
*    3 SMF92MTK Fixed(32),        /* mmap file token (matches token     01301000
*                                    in munmap data section      @D3A*/ 01302000
*    3 SMF92MIN Fixed(32),        /* file serial number          @D3A*/ 01303000
*    3 SMF92MMDN Fixed(32),       /* file unique device number   @D3A*/ 01304000
*    3 SMF92MLSZ Fixed(64),       /* 64 bit Number of bytes being       01305000
*                                    memory mapped               @DCA*/ 01306000
*/*                                                                  */ 01307000
*/*  Data Section for munmap subtype (subtype 13)                @D3A*/ 01308000
*/*                                                                  */ 01309000
*  1 SMF92MUN BASED(ADDR(SMFRCD92)+SMF92DOF),                           01310000
*    3 SMF92MUTO Bit(64),         /* time of mmap - STCK format  @D3A*/ 01311000
*    3 SMF92MUTC Bit(64),         /* time of munmap - STCK format       01312000
*                                                                @D3A*/ 01313000
*    3 SMF92MUSZ Fixed(32),       /* number of bytes being memory       01314000
*                                    mapped or 2G-1 if map>=2G   @DCC*/ 01315000
*    3 SMF92MUTK Fixed(32),       /* mmap file token (matches token     01316000
*                                    in mmap data section        @D3A*/ 01317000
*    3 SMF92MUIN Fixed(32),       /* file serial number          @D3A*/ 01318000
*    3 SMF92MUDN Fixed(32),       /* file unique device number   @D3A*/ 01319000
*    3 SMF92MUIR Fixed(32),       /* I/O blocks read             @D3A*/ 01320000
*    3 SMF92MUIW Fixed(32),       /* I/O blocks written          @D3A*/ 01321000
*    3 SMF92MULSZ Fixed(64),      /* 64 bit number of bytes being       01322000
*                                    memory mapped               @DCA*/ 01323000
*/*                                                                  */ 01324000
*/*  Data Section for File Delete Subtype (Subtype 14)           @D9A*/ 01325000
*/*                                                                  */ 01326000
*  1 SMF92DFL BASED(ADDR(SMFRCD92)+SMF92DOF),                           01327000
*   3  SMF92D,                    /* Delete information          @D9A*/ 01328000
*    5 SMF92DFT  Bit(64),         /* Delete time  - STCK format  @D9A*/ 01329000
*    5 SMF92DTY  Fixed(8),        /* File Type as defined in BPXYFTYP   01330000
*                                                                @D9A*/ 01331000
*    5 SMF92DFLG Fixed(8),        /* Flags                       @D9A*/ 01332000
*      7 SMF92DREN Bit(1),        /* Rename record               @D9A*/ 01333000
*    5 *         Fixed(16),       /* Reserved                    @D9A*/ 01334000
*    5 SMF92DIN  Fixed(32),       /* File serial number          @D9A*/ 01335000
*    5 SMF92DINP Fixed(32),       /* File serial number of parent@D9A*/ 01336000
*    5 SMF92DDN  Fixed(32),       /* File unique device number   @D9A*/ 01337000
*    5 SMF92DFS  Char(44),        /* File System Name            @D9A*/ 01338000
*    5 SMF92DNL  Fixed(32),       /* Length of name for delete   @D9A*/ 01339000
*    5 SMF92DFN  Char(64),        /* Name deleted                @D9A*/ 01340000
*   3  SMF92DR,                   /* Rename information          @D9A*/ 01341000
*    5 SMF92DNLR Fixed(32),       /* Length of name for rename   @D9A*/ 01342000
*    5 SMF92DFNR Char(64);        /* Name deleted                @D9A*/ 01343000
*/*                                                                  */ 01344000
*/*  Data Section for Ext Security Attr Change (Subtype 15)      @01A*/ 01345000
*/*                                                                  */ 01346000
*Dcl                                                                    01347000
*  1 SMF92ESA BASED(ADDR(SMFRCD92)+SMF92DOF),                           01348000
*   3 SMF92ESA_Base ,             /* Fixed Length Secion         @01A*/ 01349000
*    5 SMF92ACT  Bit(64),          /* Change Time - STCK format  @01A*/ 01350000
*    5 SMF92ATY  Fixed(8),         /* File Type.  See BPXYFTYP   @01A*/ 01351000
*    5 SMF92AFLG Fixed(8),         /* Flags                      @01A*/ 01352000
*    5 *         Fixed(16),        /* Reserved                   @01A*/ 01353000
*    5 SMF92AIN  Fixed(32),        /* File Ino number            @01A*/ 01354000
*    5 SMF92ADN  Fixed(32),        /* File's File System devno   @01A*/ 01355000
*    5 SMF92AFS  Char(44),         /* File System Name           @01A*/ 01356000
*                                                              /*@01A*/ 01357000
*    5 SMF92AOldGenVal   Bit(32),  /* File's original gen values -      01358000
*                          same as st_GenValue from BPXYSTAT.    @01A*/ 01359000
*      7 *                      Bit(24),                                01360000
*      7 SMF92AOldGenValSecByte Bit(8),                                 01361000
*        9 *                 Bit(3),                                    01362000
*        9 SMF92AOldShareLib Bit(1), /* Shared Library           @01A*/ 01363000
*        9 *                 Bit(1),                                    01364000
*        9 SMF92AOldApfAuth  Bit(1), /* Program is APF Auth      @01A*/ 01365000
*        9 SMF92AOldProgCtl  Bit(1), /* Program Controlled       @01A*/ 01366000
*        9 *                 Bit(1),                                    01367000
*    5 SMF92AOldSecAttrsC Char(4), /* File's original Security flags    01368000
*                          in character form: A, P, S.           @01A*/ 01369000
*      7 SMF92AOldAttrChar CHAR(1),  /* '>' Delimiter            @01A*/ 01370000
*      7 SMF92AOldShrLibC  Char(1),  /* =S if Shared Lib was on  @01A*/ 01371000
*      7 SMF92AOldApfAuthC Char(1),  /* =A if APF Auth was on    @01A*/ 01372000
*      7 SMF92AOldPgmCtlC  Char(1),  /* =P if Program Ctl was on @01A*/ 01373000
*    5 SMF92ANewGenVal   Bit(32),  /* New gen values after the change   01374000
*                          same as st_GenValue from BPXYSTAT.    @01A*/ 01375000
*      7 *                      Bit(24),                                01376000
*      7 SMF92ANewGenValSecByte Bit(8),                                 01377000
*        9 *                 Bit(3),                                    01378000
*        9 SMF92ANewShareLib Bit(1), /* Shared Library           @01A*/ 01379000
*        9 *                 Bit(1),                                    01380000
*        9 SMF92ANewApfAuth  Bit(1), /* Program is APF Auth      @01A*/ 01381000
*        9 SMF92ANewProgCtl  Bit(1), /* Program Controlled       @01A*/ 01382000
*        9 *                 Bit(1),                                    01383000
*    5 SMF92ANewSecAttrsC Char(4), /* File's new Security flags         01384000
*                          in character form: A, P, S.           @01A*/ 01385000
*      7 SMF92ANewAttrChar Char(1),  /* '>' Delimiter            @01A*/ 01386000
*      7 SMF92ANewShrLibC  Char(1),  /* =S if Shared Lib is on   @01A*/ 01387000
*      7 SMF92ANewApfAuthC Char(1),  /* =A if APF Auth is on     @01A*/ 01388000
*      7 SMF92ANewPgmCtlC  Char(1),  /* =P if Program Ctl is on  @01A*/ 01389000
*                                                              /*@01A*/ 01390000
*    5 SMF92AOwnUID    Fixed(32),  /* File Owner UID             @01A*/ 01391000
*    5 SMF92AOwnGID    Fixed(32),  /* File Owner GID             @01A*/ 01392000
*    5 SMF92ASecLabel  Char(8),    /* File SecLabel              @01A*/ 01393000
*    5 SMF92AAuditFID  Char(16),   /* RACF's File Id - this is the      01394000
*                      same as the XXXX_FILE_ID in the various          01395000
*                      RACF SMF Type 80 audit records.           @01A*/ 01396000
*    5  *              Char(20),   /* Reserved                   @01A*/ 01397000
*    5 SMF92ACwdRc     Fixed(32),  /* getcwd Error Return Code   @01A*/ 01398000
*    5 SMF92ACwdRsn    Fixed(32),  /* getcwd Error Reason Code -        01399000
*                      If the full pathname of the file could not       01400000
*                      be determined these fields contain the return    01401000
*                      and reason codes of the error.  In this case     01402000
*                      the SMF92APN field will contain the relative     01403000
*                      pathname as entered by the user.  SMF92APN is    01404000
*                      a full pathname if SMF92ACwdRc=0.         @01A*/ 01405000
*    5 SMF92APNL       Fixed(32),  /* File Pathname length       @01A*/ 01406000
*   3 SMF92APN        Char(1024); /* File Pathname - the absolute       01407000
*                      pathname as entered by the user or the           01408000
*                      getcwd() value for the current working           01409000
*                      directory concatenated with the relative name    01410000
*                      that was entered by the user.             @01A*/ 01411000
*       /* The SubType 15 record is variable length and ends at the     01412000
*          end of the pathname string within the SMF92APN field. @01A*/ 01413000
*                                                                       01414000
*       /* Security Attribute Character Values -                        01415000
*                for SMF92AOldSecAttrsC and SMF92ANewSecAttrsC   @01A*/ 01416000
*          Dcl SMF92#SecAttrApfAuth Char(1) Constant('A'),     /*@01A*/ 01417000
*              SMF92#SecAttrPgmCtl  Char(1) Constant('P'),     /*@01A*/ 01418000
*              SMF92#SecAttrSharLib Char(1) Constant('S'),     /*@01A*/ 01419000
*              SMF92#SecAttrDelim   Char(1) Constant('>');     /*@01A*/ 01420000
*                                                                       01421000
*/*                                                                  */ 01422000
*/*  Data Section for File Accesses subtype (subtype 17)         @DAA*/ 01423000
*/*                                                                  */ 01424000
* Dcl                                                                   01425000
*  1 SMF92FAC BASED(ADDR(SMFRCD92)+SMF92DOF),                           01426000
*    3 SMF92FAWT Bit(64),         /* This can be time when internal     01427000
*                                    file control block is released.    01428000
*                                    If SMF92FAIT is on, denotes SMF    01429000
*                                    interval time.                  */ 01430000
*    3 SMF92FAFT Fixed(8),        /* File type as defined in BPXYFTYP*/ 01431000
*    3 SMF92FAFG    Bit(8),       /* record flag                     */ 01432000
*      5 SMF92FAIT  Bit(1),       /* When on SMF92FAWT is SMF interval  01433000
*                                    time.                           */ 01434000
*    3 *   Char(2),               /* Reserved                        */ 01435000
*    3 SMF92FAIN Fixed(32),       /* Inode number                    */ 01436000
*    3 SMF92FADN Fixed(32),       /* Unique device number            */ 01437000
*    3 SMF92FATI Fixed(32),       /* Total accesses to file during      01438000
*                                    interval                        */ 01439000
*    3 SMF92FAPN Char(64);        /* Pathname                        */ 01440000
*                                                                       01441000
* /* Used when calling WriteSMF9217 to indicate if the record being     01442000
*    written was cut during inact in FTCLN or on the SMF interval@DAA*/ 01443000
*     Dcl SMF92#Inact    Fixed(8) Constant(1);                 /*@DAA*/ 01444000
*     Dcl SMF92#Interval Fixed(8) Constant(2);                 /*@DAA*/ 01445000
*                                                                       01446000
*/*                                                                  */ 01447000
*/*  Data Section for File System Migration subtype (subtype 8)  @DBA*/ 01448000
*/*                                                                  */ 01449000
* Dcl                                                                   01450000
*  1 SMF92FSG BASED(ADDR(SMFRCD92)+SMF92DOF),                           01451000
*    3 SMF92GTM Bit(64),          /* Time of migration, STCK format  */ 01452000
*    3 SMF92GMO Fixed(31),        /* Offset of mount parm section    */ 01453000
*    3 SMF92GFT Fixed(32),        /* File system type from              01454000
*                                    MntEntFSType field of BPXYMNTE  */ 01455000
*    3 SMF92GFM Fixed(32),        /* File system mode from              01456000
*                                    MntEntFSMode field of BPXYMNTE  */ 01457000
*    3 SMF92GDN Fixed(32),        /* File system device number from     01458000
*                                    MntEntFSDev field of BPXYMNTE   */ 01459000
*    3 SMF92GDD Char(8),          /* DDNAME specified on mount from     01460000
*                                    MntEntFSDDName field of BPXYMNTE*/ 01461000
*    3 SMF92GTN Char(8),          /* File system type name from         01462000
*                                    MntEntFSTName field of BPXYMNTE */ 01463000
*    3 SMF92GFN Char(44),         /* File system name from              01464000
*                                    MntEntFSName field of BPXYMNTE.    01465000
*                                    Migration target filesystem name*/ 01466000
*    3 SMF92GON Char(44),         /* Migration source filesystem name*/ 01467000
*    3 SMF92GBL Fixed(31),        /* File system block size          */ 01468000
*    3 SMF92GST Bit(64),          /* Total space in file system         01469000
*                                    in block size units             */ 01470000
*    3 SMF92GSU Bit(64),          /* Allocated space in file system     01471000
*                                    in block size units             */ 01472000
*    3 SMF92GFG Bit(8),           /* Flag byte                       */ 01473000
*      5 *        Bit(8),         /* Reserved                        */ 01474000
*    3 SMF92GF2 Bit(8),           /* Second Flag byte                */ 01475000
*      5 SMF92GLU Bit(1),         /* Mounted locally                 */ 01476000
*      5 SMF92GNU Bit(1),         /* Mounted remotely                */ 01477000
*      5 *        Bit(1),         /* Reserved                        */ 01478000
*      5 SMF92GSN Bit(1),         /* Filesystem owner                */ 01479000
*      5 *        Bit(4),         /* Reserved                        */ 01480000
*    3 *        Char(2),          /* Reserved                        */ 01481000
*  1 SMF92FSO Based(Addr(SMFRCD92)+SMF92GMO),                           01482000
*    5 SMF92MOL Fixed(15),        /* Length of mount parm option     */ 01483000
*    5 SMF92MON Char(*);          /* Mount parm option used when        01484000
*                                    mounting target file system.       01485000
*                                    Maximum length=500              */ 01486000
*                                                                       01487000
*                                                                       01488000
* /* Version Constants - SMF92RVN                                    */ 01489000
*  DCL SMF92#Version02 Char(2) Constant('02'); /* Record version 02  */ 01490000
*                                              /*                @P2A*/ 01491000
*  DCL SMF92#Version01 Char(2) Constant('01'); /* Record version 01  */ 01492000
*  DCL SMF92#Version   Char(2) Constant('02'); /* Record version num */ 01493000
*                                              /*                @P2C*/ 01494000
* /* Subtype Values - SMF92TYP & SMF92STP                            */ 01495000
*  DCL SMF92#Mount    Fixed(15) Constant(01); /* Mount subtype       */ 01496000
*  DCL SMF92#Suspend  Fixed(15) Constant(02); /* Suspend subtype     */ 01497000
*  DCL SMF92#Resume   Fixed(15) Constant(04); /* Resume subtype      */ 01498000
*  DCL SMF92#UnMount  Fixed(15) Constant(05); /* UnMount subtype     */ 01499000
*  DCL SMF92#ReMount  Fixed(15) Constant(06); /* ReMount subtype @D5A*/ 01500000
*  DCL SMF92#Move     Fixed(15) Constant(07); /* Move subtype    @D7A*/ 01501000
*  DCL SMF92#Open     Fixed(15) Constant(10); /* Open subtype        */ 01502000
*  DCL SMF92#Close    Fixed(15) Constant(11); /* Close subtype       */ 01503000
*  DCL SMF92#Mmap     Fixed(15) Constant(12); /* Memmap subtype      */ 01504000
*  DCL SMF92#Munmap   Fixed(15) Constant(13); /* Memunmap subtype    */ 01505000
*  DCL SMF92#Delete   Fixed(15) Constant(14); /* Delete subtype  @D9A*/ 01506000
*  DCL SMF92#ExtSec   Fixed(15) Constant(15); /* Ext Security    @01A*/ 01507000
*  DCL SMF92#ClsSocCharSpec  Fixed(15) Constant(16); /* Close sockets & 01508000
*                           character special & pipes/fifos  @02C@DAA*/ 01509000
*  DCL SMF92#FileAcc  Fixed(15) Constant(17); /* File acesses    @DAA*/ 01510000
*  DCL SMF92#Migration Fixed(15) Constant(8);/* File system migration   01511000
*                                                                @DBA*/ 01512000
*  DCL SMF92#Mmap64RecLen Fixed(15) Constant(32); /* Memmap subtype     01513000
*                                               record length    @DCA*/ 01514000
*  DCL SMF92#Munmap64RecLen Fixed(15) Constant(48); /* Memunmap         01515000
*                                       subtype record length    @DCA*/ 01516000
*@LOGIC;                                                                01517000
* #PRAGMA TOOL=CBGEN.                                                   01518000
* #NOTUSEORG.                                                           01519000
* #EPRAGMA.                                                             01520000
*@ENDLOGIC;                                                             01521000
*/* End of PL/X Source                                               */ 01522000
* %IF BPXYSMFR_LIST = 'NO' !                                            01523000
*    ZCBPRINT = 'NO' %THEN                                              01524000
* %DO;                                                                  01525000
*   @LIST POP NOECHO;                                                   01526000
* %END;                                                                 01527000
* %END;                                                                 01528000
