*                                                                       00050000
* %DCL BPXYSMCV_INCLUDED CHAR EXT;                                      00100000
* %DEACTIVATE BPXYSMCV_INCLUDED;                                        00150000
* %IF BPXYSMCV_INCLUDED = '' %THEN                                      00200000
* %DO;                                                                  00250000
*/* Macro made bi-lingual on 02158. CBGEN compile date 02143         */ 00300000
*% /*                                                                   00350000
         MACRO                                                          00400000
         BPXYSMCV &DSECT=YES,&LIST=YES,&TITLE=YES,&SMCV=YES             00450000
         GBLC  &BPXYSMCV_INCLUDED                                       00500000
         GBLC  &ZCBPRINT                                                00550000
&BPXYSMCV_INCLUDED SETC 'YES'                                           00600000
         AIF   ('&LIST' EQ 'NONE').P0                                   00650000
         AIF   ('&TITLE' EQ 'NO').P5                                    00700000
 TITLE   'BPXYSMCV  - Mapping of SMCV structure used on the BPX1SMC   '*00750000
                                                                        00800000
.P5      ANOP                                                           00850000
**/ BPXYSMCV_1:;                                                        00900000
*/****START OF SPECIFICATIONS****************************************** 00950000
*                                                                       01000000
*    $MAC (BPXYSMCV) COMP(SCPX1) PROD(BPX):                             01050000
*                                                                       01100000
*01* MACRO NAME: BPXYSMCV                                               01150000
*                                                                       01200000
*01* DSECT NAME: SMCV                                                   01250000
*                                                                       01300000
*01* DESCRIPTIVE NAME: Mapping of SMCV structure used on the BPX1SMC    01350000
*                      callable service                                 01400000
*                                                                       01450000
*02*   ACRONYM: SMCV                                                    01500000
**/                                                                     01550000
*/*01* PROPRIETARY STATEMENT=                                        */ 01600000
*/***PROPRIETARY_STATEMENT********************************************/ 01650000
*/*                                                                  */ 01700000
*/*                                                                  */ 01750000
*/* LICENSED MATERIALS - PROPERTY OF IBM                             */ 01800000
*/* THIS MACRO IS "RESTRICTED MATERIALS OF IBM"                      */ 01850000
*/* 5694-A01 (C) COPYRIGHT IBM CORP. 2003                            */ 01900000
*/*                                                                  */ 01950000
*/* STATUS= HBB7709                                                  */ 02000000
*/*                                                                  */ 02050000
*/***END_OF_PROPRIETARY_STATEMENT*************************************/ 02100000
*/*                                                                     02150000
*01* EXTERNAL CLASSIFICATION:                                           02200000
*                                                                       02250000
*02*   PI: BASE                                                         02300000
*                                                                       02350000
*01* END OF EXTERNAL CLASSIFICATION:                                    02400000
*                                                                       02450000
*01* FUNCTION:                                                          02500000
*                                                                       02550000
*      The SMCV maps the Shared Memory Condition Variable Structure     02600000
*      that is supplied on the BPX1SMC callable service.                02650000
*                                                                       02700000
*                                                                       02750000
*01* METHOD OF ACCESS:                                                  02800000
*                                                                       02850000
*02*   PL/X:                                                            02900000
*                                                                       02950000
*        %INCLUDE SYSLIB(BPXYSMCV)                                      03000000
*                                                                       03050000
*                                                                       03100000
*02*   ASM:                                                             03150000
*        With DSECT=NO, storage is allocated in line                    03200000
*        and addressability is provided thru that DSECT or CSECT.       03250000
*        With DSECT=YES, a DSECT is produced and "USING SMCV,reg"       03300000
*        is required for addressability.  Here "reg" contains the       03350000
*        address of SMCV#LEN bytes of storage.                          03400000
*        The default is DSECT=YES.                                      03450000
*                                                                       03500000
*01* SIZE: SMCV#LEN                                                     03550000
*            SMCV -- X'0040' bytes                                      03600000
*                                                                       03650000
*01* POINTED TO BY: SMCVPtr                                             03700000
*                                                                       03750000
*01* CREATED BY: Caller of BPX1SMC callable service                     03800000
*                                                                       03850000
*01* DELETED BY: Caller of BPX1SMC callable service                     03900000
*                                                                       03950000
*01* STORAGE ATTRIBUTES:                                                04000000
*02*   SUBPOOL/DATASPACE:  Any user subpool (0-127,129,131)             04050000
*02*   KEY:                8                                            04100000
*02*   RESIDENCY:          user address space                           04150000
*                                                                       04200000
*01* FREQUENCY: 1 per shared memory mutex or condition variable         04250000
*                                                                       04300000
*01* SERIALIZATION: N/A                                                 04350000
*                                                                       04400000
*01* DEPENDENCIES: None                                                 04450000
*                                                                       04500000
*01* NOTES: None                                                        04550000
*                                                                       04600000
*01* COMPONENT:  OpenMVS (SCPX1)                                        04650000
*                                                                       04700000
*01* DISTRIBUTION LIBRARY:  AMACLIB                                     04750000
*                                                                       04800000
*01* EYE-CATCHER: SMCV                                                  04850000
*02*   OFFSET:  0                                                       04900000
*02*   LENGTH:  4                                                       04950000
*                                                                       05000000
*01* CHANGE-ACTIVITY:                                                   05050000
*                                                                       05100000
* $D0=DJKA586  HBB7709 020505 PDI6: Shared Mutex/Condvar Support (A586) 05150000
****END OF SPECIFICATIONS*********************************************/ 05200000
*% /*                                                                   05250000
.P0      ANOP                                                           05300000
         AIF   ('&ZCBPRINT' EQ 'NO').P1                                 05350000
         AIF   ('&LIST' EQ 'YES').P2                                    05400000
.P1      ANOP                                                           05450000
         PUSH  PRINT                                                    05500000
         PRINT OFF                                                      05550000
.P2      ANOP                                                           05600000
         AIF   ('&SMCV' EQ 'NO').L0002                                  05650000
         AIF   ('&DSECT' EQ 'YES').L0003                                05700000
         AIF   ('&SMCV' NE 'YES').L0002                                 05750000
SMCV     DS    0D                                                       05800000
         AGO   .L0004                                                   05850000
.L0003   ANOP                                                           05900000
SMCV     DSECT                                                          05950000
.L0004   ANOP                                                           06000000
SMCVID   DS    1CL0004   'SMCV'                                         06050000
SMCVFLAGS DS   0FL4      Flag Word                                      06100000
SMCVFLAGSB1 DS 0BL1      Flag Byte 1                                    06150000
SMCVNODEBUG EQU X'80'    No Debug Condvar                               06200000
         ORG   SMCVFLAGSB1+X'00000001'                                  06250000
SMCVFLAGSB2 DS 1BL1      Flag Byte 2                                    06300000
SMCVFLAGSB3 DS 1BL1      Flag Byte 3                                    06350000
SMCVFLAGSB4 DS 0BL1      Flag Byte 4                                    06400000
SMCVLARGE EQU  X'02'     Large Size Condvar (Do not move)               06450000
SMCVSHARED EQU X'01'     Shared Condvar (Do not move)                   06500000
         ORG   SMCVFLAGS+X'00000004'                                    06550000
SMCVKERNELTOKEN DS 1CL0008 Token that uniquely identifies kernel data  *06600000
                         for object                                     06650000
SMCVMUTEXTOKEN DS 1CL0008 Associated Mutex Token                        06700000
SMCVOWNERADDR DS 0CL0008 Address of Owner's SMCV                        06750000
SMCVOWNERADDRUH DS 1AL4                                                 06800000
SMCVOWNERADDRLH DS 1AL4                                                 06850000
SMCVKERNELAREA DS 1CL0008 Kernel workarea                               06900000
SMCVLOCKWORD DS 0CL0004  Lockword                                       06950000
SMCVLOCKFLAGS DS 0BL1                                                   07000000
SMCVUNUSABLE EQU X'80'   Condvar unusable                               07050000
SMCVDESTROYED EQU X'40'  Condvar destroyed                              07100000
         ORG   SMCVLOCKFLAGS+X'00000001'                                07150000
SMCVWAITERCNT DS 1FL3    Count of waiters                               07200000
SMCVWORKLE DS  0FL4      LE work area                                   07250000
SMCVSOURCE DS  0BL2      Source (copied from CEEXCDAB)                  07300000
SMCVSOURCEB1 DS 0BL1     Source Byte 1                                  07350000
SMCVUSER EQU   X'80'     Untagged (User)                                07400000
SMCVC370 EQU   X'40'     C/370                                          07450000
SMCVDCE  EQU   X'20'     DCE                                            07500000
SMCVSOCKET EQU X'10'     Socket                                         07550000
         ORG   SMCVSOURCEB1+X'00000001'                                 07600000
SMCVSOURCEB2 DS 1BL1     Source Byte 2                                  07650000
         ORG   SMCVWORKLE+X'00000004'                                   07700000
SMCVRSVD01 DS  1CL0016                                                  07750000
SMCVEND  DS    0C                                                       07800000
SMCV#ID  EQU   C'SMCV'   Eye catcher                                    07850000
SMCV#LEN EQU   64        Length of SMCV                                 07900000
SMCV_LEN EQU   *-SMCV                                                   07950000
.L0002   ANOP                                                           08000000
         AIF   ('&ZCBPRINT' EQ 'NO').P3                                 08050000
         AIF   ('&LIST' EQ 'YES').P4                                    08100000
.P3      ANOP                                                           08150000
         POP   PRINT                                                    08200000
.P4      ANOP                                                           08250000
.P_EXIT  ANOP                                                           08300000
         MEND                                                           08350000
**/ BPXYSMCV_2:;                                                        08400000
* %BPXYSMCV_INCLUDED = 'YES';                                           08450000
* %DCL ZCBPRINT CHAR EXT;                                               08500000
* %DEACTIVATE ZCBPRINT;                                                 08550000
* %DCL BPXYSMCV_LIST CHAR EXT;                                          08600000
* %DEACTIVATE BPXYSMCV_LIST;                                            08650000
* %IF BPXYSMCV_LIST ^= 'NO' &                                           08700000
*    ZCBPRINT ^= 'NO' %THEN                                             08750000
*   %GOTO BPXYSMCV_3;                                                   08800000
*   @LIST PUSH NOECHO;                                                  08850000
*   @LIST NOASSEMBLE NOECHO;                                            08900000
*   @LIST OFF C NOECHO;                                                 08950000
* %BPXYSMCV_3:;                                                         09000000
*/* Start of PL/X Source                                             */ 09050000
*DECLARE                                                                09100000
*1 Smcv Based Bdy(Dword),                                               09150000
*  3 SmcvId          Char(4),             /* 'SMCV'                  */ 09200000
*  3 SmcvFlags       Fixed(32),           /* Flag Word               */ 09250000
*    5 SmcvFlagsB1   Bit(8),              /* Flag Byte 1             */ 09300000
*     7 SmcvNoDebug      Bit(1),          /* No Debug Condvar        */ 09350000
*    5 SmcvFlagsB2   Bit(8),              /* Flag Byte 2             */ 09400000
*    5 SmcvFlagsB3   Bit(8),              /* Flag Byte 3             */ 09450000
*    5 SmcvFlagsB4   Bit(8),              /* Flag Byte 4             */ 09500000
*     7 *                Bit(6),          /* Reserved                */ 09550000
*     7 SmcvLarge        Bit(1),          /* Large Size Condvar         09600000
*                                            (Do not move)           */ 09650000
*     7 SmcvShared       Bit(1),          /* Shared Condvar             09700000
*                                            (Do not move)           */ 09750000
*  3 SmcvKernelToken  Char(8),            /* Token that uniquely        09800000
*                                            identifies kernel data for 09850000
*                                            object                  */ 09900000
*  3 SmcvMutexToken   Char(8),            /* Associated Mutex Token  */ 09950000
*  3 SmcvOwnerAddr,                       /* Address of Owner's SMCV */ 10000000
*    5 SmcvOwnerAddrUh Ptr(31),                                         10050000
*    5 SmcvOwnerAddrLh Ptr(31),                                         10100000
*  3 SmcvKernelArea  Char(8) Bdy(Dword),  /* Kernel workarea         */ 10150000
*  3 SmcvLockWord,                        /* Lockword                */ 10200000
*    5 SmcvLockFlags   Bit(8),                                          10250000
*     7 SmcvUnusable   Bit(1),            /* Condvar unusable        */ 10300000
*     7 SmcvDestroyed  Bit(1),            /* Condvar destroyed       */ 10350000
*    5 SmcvWaiterCnt   Fixed(24),         /* Count of waiters        */ 10400000
*  3 SmcvWorkLE      Fixed(32),           /* LE work area            */ 10450000
*    5 SmcvSource    Bit(16),             /* Source (copied from        10500000
*                                            CEEXCDAB)               */ 10550000
*     7 SmcvSourceB1 Bit(8),              /* Source Byte 1           */ 10600000
*      9 SmcvUser     Bit(1),             /* Untagged (User)         */ 10650000
*      9 SmcvC370     Bit(1),             /* C/370                   */ 10700000
*      9 SmcvDCE      Bit(1),             /* DCE                     */ 10750000
*      9 SmcvSocket   Bit(1),             /* Socket                  */ 10800000
*     7 SmcvSourceB2 Bit(8),              /* Source Byte 2           */ 10850000
*  3 SmcvRsvd01      Char(16),                                          10900000
*  3 SmcvEnd         Char(0);                                           10950000
*                                                                       11000000
*DCL                                                                    11050000
* SMCV#ID Char(4)  Constant('SMCV'),      /* Eye catcher             */ 11100000
* SMCV#Len Fixed(16) Constant(Length(SMCV));/* Length of SMCV        */ 11150000
*/* End of PL/X Source                                               */ 11200000
* %IF BPXYSMCV_LIST ^= 'NO' &                                           11250000
*    ZCBPRINT ^= 'NO' %THEN                                             11300000
*   %GOTO BPXYSMCV_4;                                                   11350000
*   @LIST POP NOECHO;                                                   11400000
* %BPXYSMCV_4:;                                                         11450000
* %END;                                                                 11500000
