*        %GOTO OSSPRO  ;          /* Bilingual header                   00010000
         MACRO                                                          00020000
         BPXYOSS  &DSECT=YES,&LIST=YES                                  00030000
         GBLB  &OSS411                                                  00040000
         AIF   (&OSS411 EQ 1).E411                                      00050000
&OSS411 SETB   1                                                        00060000
         AIF   ('&LIST' EQ 'YES').A411                                  00070000
         PUSH  PRINT  BPXYOSS: Operating System Specific Information    00080000
         PRINT OFF                                                      00090000
         AGO   .A411                                                    00100000
*                                  */                                   00110000
*%OSSPRO : ;                                                            00120000
*/****START OF SPECIFICATIONS****************************************** 00130000
*                                                                       00140000
*    $MAC (BPXYOSS) COMP(SCPX1) PROD(BPX):                              00150000
*                                                                       00160000
*01* MACRO NAME: BPXYOSS                                                00170000
*                                                                       00180000
*01* DSECT NAME: OSS                                                    00190000
*                                                                       00200000
*01* DESCRIPTIVE NAME: Operating System Specific Information            00210000
*                                                                       00220000
*02*   ACRONYM: OSS                                                     00230000
**/                                                                     00240000
*/*01* PROPRIETARY STATEMENT=                                        */ 00250000
*/***PROPRIETARY_STATEMENT********************************************/ 00260000
*/*                                                                  */ 00270000
*/*                                                                  */ 00280000
*/* LICENSED MATERIALS - PROPERTY OF IBM                             */ 00290000
*/* 5650-ZOS COPYRIGHT IBM CORP. 1993, 2013                          */ 00291005
*/*                                                                  */ 00310000
*/* STATUS= HBB7790                                                  */ 00311005
*/*                                                                  */ 00330000
*/***END_OF_PROPRIETARY_STATEMENT*************************************/ 00340000
*/*                                                                     00350000
*                                                                       00360000
*01* EXTERNAL CLASSIFICATION:  GUPI                                     00370000
*01* END OF EXTERNAL CLASSIFICATION:                                    00380000
*                                                                       00390000
*01* FUNCTION:                                                          00400000
*                                                                       00410000
*      To pass information specific to the OpenMVS implemenation        00420000
*      of the VFS/VNODE interface.                                      00430000
*                                                                       00440000
*01* METHOD OF ACCESS:                                                  00450000
*                                                                       00460000
*02*   PL/X:                                                            00470000
*                                                                       00480000
*        %INCLUDE SYSLIB(BPXYOSS)                                       00490000
*        By default, the OSS is based on OssPtr. If                     00500000
*        other basing is desired, use %OSSBASE='BASED(XXXXXX)'.         00510000
*        If %OSSBASE='BASED(OssPtr)' is coded, a Declare for            00520000
*        OssPtr is also generated.                                      00530000
*                                                                       00540000
*        Typical Syscall usage: %OSSBASE = 'Based(Addr(InputOss))'      00550000
*                                                                       00560000
*02*   ASM:                                                             00570000
*        With DSECT=NO, storage is allocated in line                    00580000
*        and addressability is provided thru that DSECT or CSECT.       00590000
*        With DSECT=YES, a DSECT is produced and "USING OSS,reg"        00600000
*        is required for addressability.  Here "reg" contains the       00610000
*        address of OSS#LENGTH bytes of storage.                        00620000
*        The default is DSECT=YES.                                      00630000
*                                                                       00640000
*01* SIZE: OSS#LENGTH                                                   00650000
*                                                                       00660000
*01* POINTED TO BY: OssPtr                                              00670000
*                                                                       00680000
*01* CREATED BY: Storage obtained by caller of system call              00690000
*                                                                       00700000
*01* DELETED BY: Caller of system call                                  00710000
*                                                                       00720000
*01* STORAGE ATTRIBUTES:                                                00730000
*02*   SUBPOOL/DATASPACE:  N/A                                          00740000
*02*   KEY:                N/A                                          00750000
*02*   RESIDENCY:          N/A                                          00760000
*                                                                       00770000
*01* FREQUENCY: 1 per syscall of a vnode op                             00780000
*                                                                       00790000
*01* SERIALIZATION: N/A                                                 00800000
*                                                                       00810000
*01* DEPENDENCIES: None                                                 00820000
*                                                                       00830000
*01* NOTES:                                                             00840000
*           BPXYVFSI is a C program interface for the BPX1V (v_)        00850000
*           services.  The OSS structure in BPXYVFSI matches            00860000
*           the BPXYOSS structure.                                      00870000
*                                                                       00880000
*01* COMPONENT:  OpenMVS (SCPX1)                                        00890000
*                                                                       00900000
*01* DISTRIBUTION LIBRARY:  AMACLIB                                     00910000
*                                                                       00920000
*01* EYE-CATCHER: OSS                                                   00930000
*02*   OFFSET:  0                                                       00940000
*02*   LENGTH:  4                                                       00950000
*                                                                       00960000
*01* CHANGE-ACTIVITY:                                                   00970000
*                                                                       00980000
* $D0=DOAA009, HOM1120, 930330, PDJT: NFS Support       - DCR A009.01   00990000
* $D1=DOAA009  HOM1120, 930831, PDJT: Accounting Fields - DCR A009.04   01000000
* $D4=DOAA009, HOM1120, 931015, PDSV: ASM improvements  - DCR A009.05   01010000
* $D2=DRGA055  HOM1140  950904  PDJT: Sysplex support   - DCR A055.05   01020000
* $D3=D  A309  HBB6609  980904  PDJS: Sysplex support   - DCR A309.00   01030000
* $P1=PWY0213  JBB6609  990315  PDJT: Xing MtPts for DFSS SMB PWK0618   01040000
* $P2=PWY0294  JBB6609  990415  PDJT: Osi Attr/FSP                      01050000
* $P3=PYN0220  HBB7708  020301  PDFO: Bilingual fixup                   01060000
* $01=OA03254  JBB6609  030801  PDMX: unsigned counters (FIN)           01070000
* $D4=DDEA630  HBB7720  031020  PDJT: NFS V4 - Open Token               01080000
* $02=OA26837  HBB7730  081027  PDJT: Don't cross into NFSC file sys    01090000
* $D5=ME23945  HBB7790  120501  PDSK: XPFS rdd+ performance PFS rdd+    01100006
*                                                                       01102004
****END OF SPECIFICATIONS*********************************************/ 01110000
*        %GOTO OSSPLS   ;         /* Bilingual header                   01120000
.A411    ANOP  ,                                                        01130000
** BPXYOSS: OSS - Operating System Specific Information                 01140000
**  Used By: v_ callable services                                       01150000
         AIF   ('&DSECT' EQ 'NO').B411                                  01160000
OSS                  DSECT ,                                            01170000
         AGO   .C411                                                    01180000
.B411    ANOP  ,                                                        01190000
                     DS    0D                 Clear storage             01200000
OSS                  DC    XL(OSS#LENGTH)'00'                           01210000
                     ORG   OSS                                          01220000
.C411    ANOP  ,                                                        01230000
OSSBEGIN             DS    0D                                           01240000
*                                                                       01250000
OSSID                DC    C'OSS '            Eye catcher               01260000
OSSLEN               DC    AL4(OSS#LENGTH)    Length of the structure   01270000
OSSDIRIBC            DS    F                  Directory I/O block cnt   01280000
OSSREADIBC           DS    F                  Read I/O block cnt        01290000
OSSWRITEIBC          DS    F                  Write I/O block cnt       01300000
OSSOPENFLAGS         DS    F                  Reserved for internal     01310000
*                                             use - open flags          01320000
                     ORG   OSSOPENFLAGS                       @P2C@P1A  01330000
OSSFLAGS1            DS    B                                      @P1A  01340000
OSSXMTPT             EQU   X'80'               Cross Mount Points @P1A  01350000
OSSNOREMOTE          EQU   X'40'               Don't cross remote @02A  01360000
OSSRDD2CLIENT        EQU   X'20'               readdir2 client    @D5A  01361004
                     DS    CL3                                    @P1A  01370000
OSSOPENTOKEN         DS    CL8                V_Open Token        @D4A  01380000
*                                                                       01390000
*   Constants                                                           01400000
*                                                                       01410000
OSS#LENGTH           EQU   *-OSSBEGIN         Length of OSS             01420000
** BPXYOSS End                                                          01430000
         SPACE 3                                                        01440000
         AIF   ('&LIST' EQ 'YES').E411                        6@D1A     01450000
         POP   PRINT                                                    01460000
.E411    ANOP  ,                                                        01470000
         MEND  ,                  Terminating PL/X comment           */ 01480000
*                                                                       01490000
*%OSSPLS : ;                                                            01500000
*                                                                       01510000
*%Dcl OSSBASE2 Char Ext;          /* Settable by other macros    @D2A*/ 01520000
*                                                                       01530000
*%IF OSSBASE = '' %THEN                                                 01540000
*  %IF OSSBASE2 = '' %THEN                                     /*@D2A*/ 01550000
*    %DO;                                                               01560000
*      %OSSBASE = 'BASED(OssPtr)';                                      01570000
*    %END;                                                              01580000
*  %ELSE %OSSBASE = OSSBASE2;                                  /*@D2A*/ 01590000
*                                                                       01600000
*%IF Translate(OSSBASE) = 'BASED(OSSPTR)' %THEN                         01610000
*  %DO;                                                                 01620000
*    DCL OssPtr Ptr(31);          /* Pointer to the OSS              */ 01630000
*  %END;                                                                01640000
*                                                                       01650000
*                                                                       01660000
*DCL                                                                    01670000
* 1 OSS OSSBASE ,                 /* Operating System Specific Info  */ 01680000
*                                                                       01690000
*   3 OssId         Char(4),      /* Eye catcher - 'OSS '            */ 01700000
*   3 OssLen        Fixed(31),    /* Length of structure             */ 01710000
*                                                                       01720000
*   3 OssAcctIBC,                 /* I/O Block Counts                */ 01730000
*     7 OssDirIBC   Fixed(32),    /*   Directory I/O block cnt   @01C*/ 01740000
*     7 OssReadIBC  Fixed(32),    /*   Read I/O block cnt        @01C*/ 01750000
*     7 OssWriteIBC Fixed(32),    /*   Write I/O block cnt       @01C*/ 01760000
*                                                                       01770000
*   3 OssOpenFlags  Bit(32),      /* Reserved for internal use -        01780000
*                                    open flags for internal v_rdwr     01790000
*                                    callers                 @P2M@D3A*/ 01800000
*     5 OssXmtpt     Bit(1),      /*   Cross Mount Points        @P1A*/ 01810000
*     5 OssNoRemote  Bit(1),      /*   Don't cross into NFSC     @02A*/ 01820000
*     5 OssRdd2Client  Bit(1),    /*   readdir2 client           @D5A*/ 01822004
*   3 OssOpenToken  Char(8),      /* V_Open Token            @D4A@P2D*/ 01830000
*     5 OssOpenTokSpec Char(4);   /*   Special Token Values  @D4A@P2D*/ 01840000
*                                                                       01850000
*                                                                       01860000
*DCL                                                                    01870000
* Oss#ID  Char(4)  Constant('OSS '),      /* Eye catcher             */ 01880000
* Oss#Len Fixed(31) Constant(Length(Oss));/* Length of Oss           */ 01890000
*                                                                       01900000
*Dcl          /* Special Values for OssOpenTokSpec               @D4A*/ 01910000
* (Oss#NoTokAdvChk   Constant(0),  /* Advisory Check, vs. V4     @D4A*/ 01920000
*  Oss#NoTokMandChk  Constant(2),  /* Mandatory Check, vs. all   @D4A*/ 01930000
*  Oss#NoTokOverride Constant(1) ) /* No Checks, for Reads only  @D4A*/ 01940000
*                            Fixed(32);                        /*@D4A*/ 01950000
*                                                                       01960000
