*        %GOTO INHEPRO  ;         /* Bilingual header                   00010000
         MACRO                                                          00020000
         BPXYINHE  &DSECT=YES,&LIST=YES                       8@D1A     00030000
         GBLB  &INHE411                                                 00040000
         GBLC  &SYSAM64       Variable set by SYSSTATE AMODE64=YES @D6A 00050000
         AIF   (&INHE411 EQ 1).E411                                     00060000
&INHE411 SETB  1                                                        00070000
         AIF   ('&LIST' EQ 'YES').A411                                  00080000
         PUSH  PRINT  BPXYINHE: Inheritance Area for Spawn Service      00090000
         PRINT OFF                                                      00100000
         AGO   .A411                                                    00110000
*                                  */                                   00120000
*%INHEPRO : ;                                                           00130000
*/****START OF SPECIFICATIONS****************************************** 00140000
*                                                                       00150000
*    $MAC (BPXYINHE) COMP(SCPX1) PROD(BPX):                             00160000
*                                                                       00170000
*01* MACRO NAME: BPXYINHE                                               00180000
*                                                                       00190000
*01* DSECT NAME: INHE                                                   00200000
*                                                                       00210000
*01* DESCRIPTIVE NAME: Mapping of Inheritance structure for the Spawn   00220000
*                      callable service                                 00230000
*                                                                       00240000
*02*   ACRONYM: INHE                                                    00250000
**/                                                                     00260000
*/*01* PROPRIETARY INHEEMENT=                                        */ 00270000
*/***PROPRIETARY_INHEEMENT********************************************/ 00280000
*/*                                                                  */ 00290000
*/*                                                                  */ 00300000
*/* LICENSED MATERIALS - PROPERTY OF IBM                             */ 00310000
*/* 5694-A01 (C) COPYRIGHT IBM CORP. 1997, 2006                      */ 00330001
*/*                                                                  */ 00340000
*/* STATUS= HBB7730                                                  */ 00350000
*/*                                                                  */ 00360000
*/***END_OF_PROPRIETARY_INHEEMENT*************************************/ 00370000
*/*                                                                     00380000
*01* EXTERNAL CLASSIFICATION:  GUPI                                     00390000
*01* END OF EXTERNAL CLASSIFICATION:                                    00400000
*                                                                       00410000
*01* FUNCTION:                                                          00420000
*                                                                       00430000
*      The INHE maps the inheritance structure that is supplied to the  00440000
*      Spawn callable service.                                          00450000
*                                                                       00460000
*                                                                       00470000
*01* METHOD OF ACCESS:                                                  00480000
*                                                                       00490000
*02*   PL/X:                                                            00500000
*                                                                       00510000
*        %INCLUDE SYSLIB(BPXYINHE)                                      00520000
*        By default, the INHE is based on INHEPtr. If                   00530000
*        other basing is desired, use %INHEBASE='BASED(XXXXXX)'.        00540000
*        If %INHEBASE='BASED(INHEPtr)' is coded, a Declare for          00550000
*        INHEPtr is also generated.                                     00560000
*                                                                       00570000
*                                                                       00580000
*02*   ASM:                                                             00590000
*        With DSECT=NO, storage is allocated in line                    00600000
*        and addressability is provided thru that DSECT or CSECT.       00610000
*        With DSECT=YES, a DSECT is produced and "USING INHE,reg"       00620000
*        is required for addressability.  Here "reg" contains the       00630000
*        address of INHE#LENGTH bytes of storage.                       00640000
*        The default is DSECT=YES.                                      00650000
*                                                                       00660000
*01* SIZE: INHE#LENGTH                                                  00670000
*                                                                       00680000
*01* POINTED TO BY: INHEPtr                                             00690000
*                                                                       00700000
*01* CREATED BY: Storage obtained by caller of Spawn callable service   00710000
*                                                                       00720000
*01* DELETED BY: Caller of Spawn callable service                       00730000
*                                                                       00740000
*01* STORAGE ATTRIBUTES:                                                00750000
*02*   SUBPOOL/DATASPACE:  N/A                                          00760000
*02*   KEY:                N/A                                          00770000
*02*   RESIDENCY:          N/A                                          00780000
*                                                                       00790000
*01* FREQUENCY: 1 per call to spawn()                                   00800000
*                                                                       00810000
*01* SERIALIZATION: N/A                                                 00820000
*                                                                       00830000
*01* DEPENDENCIES: None                                                 00840000
*                                                                       00850000
*01* NOTES: None                                                        00860000
*                                                                       00870000
*01* COMPONENT:  OpenMVS (SCPX1)                                        00880000
*                                                                       00890000
*01* DISTRIBUTION LIBRARY:  AMACLIB                                     00900000
*                                                                       00910000
*01* EYE-CATCHER: INHE                                                  00920000
*02*   OFFSET:  0                                                       00930000
*02*   LENGTH:  4                                                       00940000
*                                                                       00950000
*01* CHANGE-ACTIVITY:                                                   00960000
*                                                                       00970000
* $D1=DPFA079  HOM1130 940315 PDI6: Spawn Support (A079.01)             00980000
* $D2=DPFA051  HOM1130 950307 PDI6: (A051.23) updated for bpxb1sm1      00990000
* $D3=DSYA196  HBB6604 960822 PDAE: (A196.02) Add USERID, REGION, TIME  01000000
*                             LIMIT, JOBNAME, ACCOUNT DATA, CWD & UMASK 01010000
* $D4=DVTA237  HBB6606 961211 PDJQ:  Spawn local only                   01020000
* $D5=DWKA315  HBB6608 981015 PDI6:  Spawn DBX Support (DCR A341.01)    01030000
* $D6=DYN0519  HBB7708 000314 PDJM:  Initial release 64-bit addressing  01040000
* $D7=DYN0519  HBB7708 010315 PDZJ:  Memlimit support DCA519.11         01050000
* $P1=PYN0220  HBB7708 020301 PDFO: Bilingual fixup                     01060000
* $P2=PJK0056  HBB7709 020515 PDZJ: Memlimit is number of bytes         01070000
* $D8=DYN0519  HBB7709 020703 PDZJ:  Memlimit 31bit caller              01080000
* $01=OW47179  HBB7709 020820 PDAE:  fix masks for flags                01090000
* $D9=DCRA585  HBB7730 050217 PDKG: inittab/respawn                     01091000
* $P3=ME06095  HBB7730 060309 PDKG: inittab - respfrk                   01091100
****END OF SPECIFICATIONS*********************************************/ 01092000
*        %GOTO INHEPLS  ;         /* Bilingual header                   01093000
.A411    ANOP  ,                                                        01094000
** BPXYINHE: Inheritance Area                                           01095000
**  Used By: spawn() callable service                                   01096000
         AIF   ('&DSECT' EQ 'NO').B411                                  01097000
INHE                 DSECT ,                                            01098000
         AGO   .C411                                                    01099000
.B411    ANOP  ,                                                        01100000
INHE                 DS    0D                                           01110000
.C411    ANOP  ,                                                        01120000
INHEBEGIN            DS    0D                                           01130000
*                                                                       01140000
INHEEYE              DC    C'INHE'  Eye catcher                         01150000
INHELENGTH           DC    AL2(INHE#LENGTH)                            *01160000
                                  Length of this structure              01170000
INHEVERSION          DC    AL2(INHE#VER)                                01180000
INHE#VER             EQU   3     Version of this structure       @D6C   01190000
INHEFLAGS            DS    0BL4  Flags indicating contents of structure 01200000
INHEFLAGS0           DS    XL1   1st byte                               01210000
INHESETPGROUP        EQU   X'80' Set Process Group using INHEPGROUP     01220000
INHESETSIGMASK       EQU   X'40' Set Signal Mask using INHESIGMASK      01230000
INHESETSIGDEF        EQU   X'20' Set Signal Defaults using INHESIGDEF   01240000
INHESETTCPGRP        EQU   X'10' Set TTY Pgrp using INHECTLTTYFD  @D3A  01250000
INHESETCWD           EQU   X'08' Set CWD using INHECWDPTR         @D3A  01260000
INHESETUMASK         EQU   X'04' Set UMASK using INHEUMASK        @D3A  01270000
INHESETUSERID        EQU   X'02' Set Userid using INHEUSERID      @D3A  01280000
INHESETREGIONSZ      EQU   X'01' Set Region using INHEREGIONSZ    @D3A  01290000
INHEFLAGS1           DS    XL1   2nd byte                               01300000
INHESETTIMELIMIT     EQU   X'80' Set Timelimit with INHETIMELIMIT @D3A  01310000
INHESETACCTDATA      EQU   X'40' SET ACCTDATA using INHEACCTDATA  @D3A  01320000
INHESETJOBNAME       EQU   X'20' SET JOBNAME using INHEJOBNAME    @D3A  01330000
INHEMUSTBELOCAL      EQU   X'10' Spawn locally or else fail       @D4A  01340000
INHESETDEBUGENV      EQU   X'08' Setup Debug Environment          @D5A  01350000
INHESETMEMLIMIT      EQU   X'04' Set MemLimit with INHEMEMLIMIT   @D7A  01360000
INHEFLAGS2           DS    XL1   3rd byte                               01370000
INHEFLAGS3           DS    XL1   4th byte                               01380000
INHEPGROUP           DS    F     Process Group for child                01390000
INHE#NEWPGROUP       EQU   0     Put child in a new proc grp of its own 01400000
INHESIGMASK          DS    BL8   Signal Mask for child                  01410000
INHESIGDEF           DS    BL8   Set of default signals for child       01420000
INHECTLTTYFD         DS    F     Cntl TTY FD for tcsetgrp() in child    01430000
         AIF  ('&SYSAM64' EQ 'YES').AM64A                         @D6A  01440000
                     DS    0F    31-Bit Addressing Version        @D6A  01450000
INHECWDPTR           DS    F     Pointer to the users CWD         @D3A  01460000
INHECWDLEN           DS    H     Length of the users CWD          @D3A  01470000
INHEACCTDATALEN      DS    H     LENGTH OF THE USERS ACCTDATA     @D3A  01480000
INHEACCTDATAPTR      DS    F     POINTER TO THE USERS ACCTDATA    @D3A  01490000
INHEUMASK            DS    XL4   Users Umask                      @D3A  01500000
INHEUSERID           DS    CL8   New A.S. user identity           @D3A  01510000
INHEJOBNAME          DS    CL8   New A.S. jobname                 @D3A  01520000
INHEREGIONSZ         DS    F     New A.S. region size             @D3A  01530000
INHETIMELIMIT        DS    F     New A.S. Time limit              @D3A  01540000
                     DS    CL20  reserved                         @D8A  01550000
INHEMEMLIMIT         DS    D     New A.S. Memlimit #bytes         @D8C  01560000
         AGO   .AM64B                                             @D6A  01570000
.AM64A   ANOP  ,                                                  @D6A  01580000
                     DS    0F    64-Bit Addressing Version        @D6A  01590000
INHERES01            DS    F     Reserved                         @D6C  01600000
INHECWDLEN           DS    H     Length of the users CWD          @D3A  01610000
INHEACCTDATALEN      DS    H     LENGTH OF THE USERS ACCTDATA     @D3A  01620000
INHERES02            DS    F     Reserved                         @D6C  01630000
INHEUMASK            DS    XL4   Users Umask                      @D3A  01640000
INHEUSERID           DS    CL8   New A.S. user identity           @D3A  01650000
INHEJOBNAME          DS    CL8   New A.S. jobname                 @D3A  01660000
INHEREGIONSZ         DS    F     New A.S. region size             @D3A  01670000
INHETIMELIMIT        DS    F     New A.S. Time limit              @D3A  01680000
INHERES03            DS    F     Reserved                         @D6A  01690000
INHECWDPTR           DS    AD    Pointer to the users CWD         @D6A  01700000
INHEACCTDATAPTR      DS    AD    Pointer to the users ACCTDATA    @D6A  01710000
INHEMEMLIMIT         DS    D     New A.S. Memlimit #bytes         @P2C  01720000
.AM64B   ANOP  ,                                                  @D6A  01730000
INHE#LENGTH          EQU   *-INHE                                       01740000
** BPXYINHE End                                                         01750000
         SPACE 3                                                        01760000
         AIF   ('&LIST' EQ 'YES').E411                                  01770000
         POP   PRINT                                                    01780000
.E411    ANOP  ,                                                        01790000
         MEND  ,                  Terminating PL/X comment           */ 01800000
*                                                                       01810000
*%INHEPLS : ;                                                           01820000
*%IF INHEBASE='' %THEN                                                  01830000
*  %DO;                                                                 01840000
*    %INHEBASE='BASED(INHEPtr)';                                        01850000
*  %END;                                                                01860000
* %IF INHEBASE='BASED(INHEPtr)' %THEN                                   01870000
*   %DO;                                                                01880000
*     DCL INHEPtr Ptr(31);         /* Pointer to the INHE            */ 01890000
*   %END;                                                               01900000
*%IF AsaxmacP64 = ''                                          /* @D6A*/ 01910000
*   %Then %AsaxmacP64 = 'Char(8)';                            /* @D6A*/ 01920000
*%IF AsaxmacF64 = ''                                          /* @D6A*/ 01930000
*   %Then %AsaxmacF64 = 'Char(8)';                            /* @D6A*/ 01940000
*%IF AsaxmacF63 = ''                                          /* @D6A*/ 01950000
*   %Then %AsaxmacF63 = 'Char(8)';                            /* @D6A*/ 01960000
*DCL                                                                    01970000
* 1 Inhe INHEBASE,                /* INHE - Inheritance structure for   01980000
*                                    Spawn callable service          */ 01990000
*   3 InheEye       Char(4),      /* Eye catcher - 'INHE'            */ 02000000
*   3 InheLength    Fixed(16),    /* Length of structure             */ 02010000
*   3 InheVersion   Fixed(16),    /* Version number                  */ 02020000
*   3 InheFlags     Fixed(32),    /* Flags indicating contents of       02030000
*                                    structure                       */ 02040000
*    /****************************************************************/ 02050000
*    /* WARNING:                                                     */ 02060000
*    /* When adding flags for new fields be sure to update the mask  */ 02070000
*    /* constants for the appropriate version.                       */ 02080000
*    /****************************************************************/ 02090000
*    5 InheFlags1  Fixed(8),      /* 1st flag byte                   */ 02100000
*     7 InheSetPgroup  Bit(1),    /* Set Process Group using InhePgroup 02110000
*                                                             V1     */ 02120000
*     7 InheSetSigMask Bit(1),    /* Set Signal Mask using InheSigMask  02130000
*                                                             V1     */ 02140000
*     7 InheSetSigDef  Bit(1),    /* Set Signal Defaults using          02150000
*                                    InheSigDef               V1     */ 02160000
*     7 InheSetTcPgrp  Bit(1),   /*Set Cntl TTY Pgrp using INHECTLTTYFD 02170000
*                                                             V1     */ 02180000
*     7 InheSetCwd       Bit(1),  /* CWD was specified        V2 @D3A*/ 02190000
*     7 InheSetUmask     Bit(1),  /* Umask was specified      V2 @D3A*/ 02200000
*     7 InheSetUserid    Bit(1),  /* Userid was specified     V2 @D3A*/ 02210000
*     7 InheSetRegionSz  Bit(1),  /* Region was specified     V2 @D3A*/ 02220000
*                                                                       02230000
*    5 InheFlags2  Fixed(8),      /* 2nd flag byte                   */ 02240000
*     7 InheSetTimeLimit Bit(1),  /* Time limit was specified V2 @D3A*/ 02250000
*     7 InheSetAcctData  Bit(1),  /* AcctData was specified   V2 @D3A*/ 02260000
*     7 InheSetJobName   Bit(1),  /* JobName was specified    V2 @D3A*/ 02270000
*     7 InheMustBeLocal  Bit(1),  /* Spawn locally or else fail         02280000
*                                                           V1+2 @D4A*/ 02290000
*     7 InheSetDebugEnv  Bit(1),  /* Setup Debug Environment for        02300000
*                                    child (Pt_TraceMe)     V1+2 @D5A*/ 02310000
*     7 InheSetMemLimit  Bit(1),  /* Setup Memlimit         V3   @D7A*/ 02320000
*     7 InheProcessInitTab Bit(1),/* /etc/inittab startup     V3 @D9A*/ 02330000
*     7 InheRespawn        Bit(1),/* mark process respawnable V3 @D9A*/ 02340000
*    5 InheFlags3  Fixed(8),      /* 3rd flag byte                   */ 02350000
*     7 InheRespFork       Bit(1),/* Forked process gets respawn @P3A*/ 02351000
*    5 InheFlags4  Fixed(8),      /* 4th flag byte                   */ 02360000
*   3 InhePgroup   Fixed(32),     /* Process Group for child         */ 02370000
*   3 InheSigMask  Bit(64),       /* Signal Mask for child           */ 02380000
*   3 InheSigDef   Bit(64),       /* Set of default signals for child*/ 02390000
*   3 InheCtlTtyFd Fixed(32),     /* Cntl TTY FD for tcsetpgrp() in     02400000
*                                    child                           */ 02410000
*   3 InheVer1Len  Char(0),       /* End of Version 1            @D3A*/ 02420000
*   3 InheCwdPtr   Ptr(31),       /* Pointer to the users CWD    @D3A*/ 02430000
*   3 InheCwdLen   Fixed(16),     /* Length of the users CWD     @D3A*/ 02440000
*   3 InheAcctDataLen Fixed(16),  /* Length of Account Data Area @D3A*/ 02450000
*   3 InheAcctDataPtr Ptr(31),    /* Ptr to Account Data Area    @D3A*/ 02460000
*   3 InheUmask    Fixed(32),     /* Users UMASK                 @D3A*/ 02470000
*   3 InheUserid   Char(8),       /* New A.S. user identity      @D3A*/ 02480000
*   3 InheJobName  Char(8),       /* New A.S. jobname            @D3A*/ 02490000
*   3 InheRegionSz  Fixed(32),    /* New A.S. region size        @D3A*/ 02500000
*   3 InheTimelimit Fixed(32),    /* New A.S. Time limit         @D3A*/ 02510000
*   3 *             Fixed(16),    /* Reserved                    @D3A*/ 02520000
*   3 InheVer2Len Char(0),        /* End of Version 2            @D3A*/ 02530000
*   3 *             Fixed(16),    /* Reserved                    @D6A*/ 02540000
*   3 InheCwdPtr64  AsaxmacP64 Bdy(Dword), /* Pointer to the users CWD  02550000
*                                                                @D6A*/ 02560000
*   3 InheAcctDataPtr64 AsaxmacP64 Bdy(Dword), /* Ptr to Account Data   02570000
*                                    Area                        @D6A*/ 02580000
*   3 InheMemLimit      AsaxmacF64 Bdy(Dword), /* New A.S. memlimit     02590000
*                                               #bytes           @P2A*/ 02600000
*   3 InheVer3Len  Char(0);       /* End of Version 3            @D6A*/ 02610000
*                                                                       02620000
*DCL                                                                    02630000
* Inhe#ID Char(4)  Constant('INHE'),      /* Eye catcher             */ 02640000
* Inhe#Ver Fixed(16) Constant(Inhe#Ver03), /* Current version of        02650000
*                                             control block      @D6A*/ 02660000
* Inhe#Ver01 Fixed(16) Constant(1),       /* Version 1 of control       02670000
*                                            block                   */ 02680000
* Inhe#Ver02 Fixed(16) Constant(2),       /* Version 2 of control       02690000
*                                            block               @D3A*/ 02700000
* Inhe#Ver03 Fixed(16) Constant(3),       /* Version 3 of control       02710000
*                                            block               @D6A*/ 02720000
* Inhe#Len01 Fixed(16) Constant(Offset(InheVer1Len)),                   02730000
*                         /* Version 1 INHE control block length @D3A*/ 02740000
* Inhe#Len02 Fixed(16) Constant(Offset(InheVer2Len)),                   02750000
*                         /* Version 2 INHE control block length @D3A*/ 02760000
* Inhe#Len03 Fixed(16) Constant(Offset(InheVer3Len)),                   02770000
*                         /* Version 3 INHE control block length @D6A*/ 02780000
* Inhe#Len Fixed(16) Constant(Length(INHE)),/* Length of INHE        */ 02790000
* Inhe#Mask01 Bit(32) Constant('F0180000'X),/* Ver 1 mask for clearing  02800000
*                                              extraneous bits   @01C*/ 02810000
* Inhe#Mask02 Bit(32) Constant('FFF80000'X),/* Ver 2 mask for clearing  02820000
*                                              extraneous bits   @01C*/ 02830000
* Inhe#Mask03 Bit(32) Constant('FFFC0000'X),/* Ver 3 mask for clearing  02840000
*                                              extraneous bits   @01A*/ 02850000
* Inhe#NewPgroup Fixed(32) Constant(0);   /* Indicates to create new    02860000
*                                            process group for child */ 02870000
