*        %GOTO SSETPRO  ;         /* Bilingual header                   00050000
         MACRO                                                          00100000
         BPXYSSET  &LIST=YES                                            00150000
         GBLB  &SSET411                                                 00200000
         GBLC  &SYSAM64       Variable set by SYSSTATE AMODE64=YES @D1A 00225000
         AIF   (&SSET411 EQ 1).E411                                     00250000
&SSET411 SETB  1                                                        00300000
         AIF   ('&LIST' EQ 'YES').A411                                  00350000
         PUSH  PRINT  BPXYSSET: sigactionset for multiple signals       00400000
         PRINT OFF                                                      00450000
         AGO   .A411                                                    00500000
*                                  */                                   00550000
*%SSETPRO : ;                                                           00600000
*/****START OF SPECIFICATIONS****************************************** 00650000
*                                                                       00700000
*    $MAC (BPXYSSET) COMP(SCPX1) PROD(BPX):                             00750000
*                                                                       00800000
*01* MACRO NAME: BPXYSSET                                               00850000
*                                                                       00900000
*01* DSECT NAME: BPXYSSET                                               00950000
*                                                                       01000000
*01* DESCRIPTIVE NAME: Macro which enables multiple signal calls        01050000
*                                                                       01100000
*02*   ACRONYM: SSET                                                    01150000
**/                                                                     01200000
*/*01* PROPRIETARY STATEMENT=                                        */ 01250000
*/***PROPRIETARY_STATEMENT********************************************/ 01300000
*/*                                                                  */ 01350000
*/*                                                                  */ 01400000
*/* LICENSED MATERIALS - PROPERTY OF IBM                             */ 01450000
*/* THIS MACRO IS "RESTRICTED MATERIALS OF IBM"                      */ 01500000
*/* 5694-A01 (C) COPYRIGHT IBM CORP. 1998, 2003                      */ 01550000
*/*                                                                  */ 01600000
*/* STATUS= HBB7709                                                  */ 01650000
*/*                                                                  */ 01700000
*/***END_OF_PROPRIETARY_STATEMENT*************************************/ 01750000
*/*                                                                     01800000
*                                                                       01825000
*01* EXTERNAL CLASSIFICATION:  GUPI                                     01850000
*01* END OF EXTERNAL CLASSIFICATION:                                    01900000
*                                                                       01950000
*01* FUNCTION:                                                          02000000
*                                                                       02050000
*      The Sset maps a request to the BPX1SA2 syscall to specify        02100000
*      multiple signals with one call.                                  02150000
*                                                                       02200000
*01* METHOD OF ACCESS:                                                  02250000
*                                                                       02300000
*02*   PL/X:                                                            02350000
*                                                                       02400000
*        %INCLUDE SYSLIB(BPXYSSET)                                      02450000
*        By default, the Sset is based on SsetPtr. If                   02500000
*        other basing is desired, use %SSETBASE='BASED(XXXXXX)'.        02550000
*        If %SSETBASE='BASED(SSETPTR)' is coded, a Declare for          02600000
*        SsetPTR is also generated.                                     02650000
*                                                                       02700000
*02*   ASM:                                                             02750000
*        A one word area SSETOPTION_FLAGS will be allocated and         02800000
*        a DSECT SSET of length SSET#LENGTH will be defined.            02850000
*        The user will assign sortage in SSET#LENGTH increments         02900000
*        each corresponding to a signal set.                            02950000
*                                                                       03000000
*01* SIZE: Release dependent.  Refer to the mapping.                    03050000
*                                                                       03100000
*01* POINTED TO BY: Input parameters Old_Struct and New_Struct          03150000
*                   supplied by BPX1SA2 system call routine             03200000
*                                                                       03250000
*01* CREATED BY: Invoker of BPX1SA2 system call routine                 03300000
*                                                                       03350000
*01* DELETED BY: Invoker of BPX1SA2 system call routine                 03400000
*                                                                       03450000
*01* STORAGE ATTRIBUTES:                                                03500000
*02*   SUBPOOL: N/A                                                     03550000
*02*   KEY:     N/A                                                     03600000
*02*   RESIDENCY: Caller's Primary address space                        03650000
*                                                                       03700000
*01* FREQUENCY: Up to 2 per BPX1SA2 system call                         03750000
*                                                                       03800000
*01* SERIALIZATION: N/A                                                 03850000
*                                                                       03900000
*01* DEPENDENCIES: None                                                 03950000
*                                                                       04000000
*01* NOTES:                                                             04050000
*                                                                       04100000
*01* COMPONENT: OpenMVS (SCPX1)                                         04150000
*                                                                       04200000
*01* DISTRIBUTION LIBRARY:  AMACLIB                                     04250000
*                                                                       04300000
*01* EYE-CATCHER: None                                                  04350000
*                                                                       04400000
*01* CHANGE-ACTIVITY:                                                   04450000
* $D0=DVTA217 HBB6606 970904 PD2J: __Sigactionset (a217.17)             04500000
* $P0=PVT0652 HBB6606 980316 PD2M: Correct ASM bilingual errors         04550000
* $D1=DCA5191 HBB7708 001006 PDJC: 64 bit support                       04575000
* $P1=PYN0220 HBB7708 020301 PDFO: Bilingual fixup                      04587500
****END OF SPECIFICATIONS*********************************************/ 04600000
*        %GOTO SSETPLS  ;         /* Bilingual header                   04650000
.A411    ANOP  ,                                                        04700000
**  BPXYSSET: Macro which enables multiple signal calls                 04750000
**  Used By:  SA2                                                       04800000
SSETOPTION_FLAGS   DS    0F                                             04850000
SSETOPTION_FLAGS1  DS    FL1   FLAGS INDICATING CALLER OPTIONS          04900000
SSET_IGINVALID     EQU   X'80' IGNORE INVALID SIGNALS & SIGACTIONS     X04950000
                               0=DO NOT IGNORE, 1=IGNORE                05000000
                   DS    3FL1  RESERVED                                 05050000
                   SPACE ,                                              05100000
         AIF  ('&SYSAM64' EQ 'YES').AM64A                          @D1A 05125000
SSET               DSECT ,                                              05150000
SSETCONSOLMASK     DS  XL8    SIGNALS HAVING THE SAME FLAGS,MASK,      X05200000
                              USERDATA, AND SIGNAL ACTION               05250000
SSETCOMPARE        DS  0CL20                                            05300000
SSETFLAGS          DS  XL4    VALUE FOR SIGACTION FLAGS (BPXYSIGH)      05350000
SSETSAHANDLER      DS  A      ADDRESS OF A SIGNAL HANDLER ROUTINE       05400000
SSETSAMASK         DS  XL8    VALUE FOR SIGACTION MASK                  05450000
SSETUSERDATA       DS  F      USER DEFINED DATA                         05500000
SSET#LENGTH        EQU *-SSET LENGTH OF ONE SSET ENTRY                  05550000
         AGO   .AM64B                                              @D1A 05553500
.AM64A   ANOP  ,                                                   @D1A 05557000
SSET               DSECT ,                                         @D1A 05560500
SSETCONSOLMASK     DS  XL8    SIGNALS HAVING THE SAME FLAGS,MASK,      X05564000
                              USERDATA, AND SIGNAL ACTION          @D1A 05567500
SSETCOMPARE        DS  0CL28                                       @D1A 05571000
SSETSAHANDLER      DS  AD     ADDRESS OF A SIGNAL HANDLER ROUTINE  @D1A 05574500
SSETSAMASK         DS  XL8    VALUE FOR SIGACTION MASK             @D1A 05578000
SSETUSERDATA       DS  FD     USER DEFINED DATA                    @D1A 05581500
SSETFLAGS          DS  XL4    VALUE FOR SIGACTION FLAGS (BPXYSIGH) @D1A 05585000
SSETRES01          DS  F      Reserved                             @D1A 05588500
SSET#LENGTH        EQU *-SSET LENGTH OF ONE SSET ENTRY             @D1A 05592000
.AM64B   ANOP  ,                                                   @D1A 05595500
** BPXYSSET End                                                         05600000
         SPACE 3                                                        05650000
         AIF   ('&LIST' EQ 'YES').E411                                  05700000
         POP   PRINT                                                    05750000
.E411    ANOP  ,                                                        05800000
         MEND  ,                  Terminating PL/X comment           */ 05850000
*                                                                       05950000
*%SSETPLS : ;                                                           06000000
* %IF SSETBASE = '' %THEN                                               06050000
*   %DO;                                                                06100000
*     %SSETBASE = 'Based(SsetPtr)';                                     06150000
*   %END;                                                               06200000
* %IF TRANSLATE(SSETBASE) = 'BASED(SsetPTR)' %THEN                      06250000
*   %DO;                                                                06300000
*     DCL SsetPtr Ptr(31);          /* Pointer to the Sset           */ 06350000
*   %END;                                                               06400000
* %IF AsaxmacP64 = ''                                         /* @D1A*/ 06450000
*    %Then %AsaxmacP64 = 'Char(8)';                           /* @D1A*/ 06500000
* %IF AsaxmacF64 = ''                                         /* @D1A*/ 06550000
*    %Then %AsaxmacF64 = 'Char(8)';                           /* @D1A*/ 06600000
* %IF AsaxmacF63 = ''                                         /* @D1A*/ 06650000
*    %Then %AsaxmacF63 = 'Char(8)';                           /* @D1A*/ 06700000
*DCL                                                                    06750000
* 1 Sset Bdy(Word) Based,                                               06800000
*   3 SsetConsolMask Bit(64),   /*Signals having the same flags,mask */ 06850000
*   3 SsetCompare,                                                      06900000
*     5 SsetSaFlags    Bit(32), /*Value for sigaction flags             06950000
*                                 (BPXYSIGH)                         */ 07000000
*     5 SsetSaHandler  Ptr(31), /*Address of a signal handler           07050000
*                                 routine                            */ 07100000
*     5 SsetSaMask     Bit(64), /*Value for sigaction mask           */ 07150000
*     5 SsetUserData   Fixed(32);/*User defined data userdata, and      07200000
*                                 signal action                      */ 07250000
*DCL                                                                    07300000
* 1 Sset64 Bdy(DWord) Based,                                  /* @D1A*/ 07350000
*   3 Sset64ConsolMask  Bit(64),  /*Signals having the same flags,mask  07400000
*                                                                @D1A*/ 07450000
*   3 Sset64Compare,                                          /* @D1A*/ 07500000
*     5 Sset64SaHandler AsaxmacP64, /*Address of a signal handler       07550000
*                                   routine                      @D1A*/ 07600000
*     5 Sset64SaMask    Bit(64),  /*Value for sigaction mask     @D1A*/ 07650000
*     5 Sset64UserData  AsaxmacF64, /*User defined data userdata, and   07700000
*                                   signal action                @D1A*/ 07750000
*     5 Sset64SaFlags   Bit(32),  /*Value for sigaction flags           07800000
*                                   (BPXYSIGH)                   @D1A*/ 07850000
*   3 *                 Char(4);  /* Reserved                    @D1A*/ 07900000
*DCL                                                                    07950000
*  Sset#EntryLength Fixed(16) Constant(Length(Sset)); /* Length of one  08000000
*                                                        Sset Entry  */ 08050000
*DCL                                                                    08100000
*  Sset64#EntryLength Fixed(16) Constant(Length(Sset64)); /* Length of  08150000
*                                                   one Sset64 Entry */ 08200000
*DCL                                                                    08250000
* 1 SsetOption_Flags Bit(32),  /*Flags indicating caller options     */ 08300000
*   3 Sset_IgInvalid Bit(1),   /*Ignore Invalid signals & sigactions    08350000
*                                   0=Do not Ignore, 1=Ignore        */ 08400000
*   3 *              Bit(31);  /*Reserved                            */ 08450000
