*        %GOTO OPNFPRO  ;         /* Bilingual header                   00010000
         MACRO                                                          00020000
         BPXYOPNF  &DSECT=YES,&LIST=YES                       8@D1A     00030000
         GBLB  &OPNF411                                                 00040000
         AIF   (&OPNF411 EQ 1).E411                                     00050000
&OPNF411 SETB  1                                                        00060000
         AIF   ('&LIST' EQ 'YES').A411                                  00070000
         PUSH  PRINT  BPXYOPNF: Oflag constants specified               00080000
         PRINT OFF              on open system call                     00090000
         AGO   .A411                                                    00100000
*                                  */                                   00110000
*%OPNFPRO : ;                                                           00120000
*/****START OF SPECIFICATIONS****************************************** 00130000
*                                                                       00140000
*    $MAC (BPXYOPNF) COMP(SCPX1) PROD(BPX):                             00150000
*                                                                       00160000
*01* MACRO NAME: BPXYOPNF                                               00170000
*                                                                       00180000
*01* DSECT NAME: O_FLAGS                                                00190000
*                                                                       00200000
*01* DESCRIPTIVE NAME: Oflag constants specified                        00210000
*                      on open and fcntl system calls                   00220000
*                                                                       00230000
*02*   ACRONYM: OPNF                                                    00240000
**/                                                                     00250000
*/*01* PROPRIETARY STATEMENT=                                        */ 00260000
*/***PROPRIETARY_STATEMENT********************************************/ 00270000
*/*                                                                  */ 00280000
*/*                                                                  */ 00290000
*/* LICENSED MATERIALS - PROPERTY OF IBM                             */ 00300000
*/* THIS MACRO IS "RESTRICTED MATERIALS OF IBM"                      */ 00310000
*/* 5694-A01 COPYRIGHT IBM CORP. 1993, 2015                          */ 00320002
*/*                                                                  */ 00330000
*/* STATUS= HBB77A0                                                  */ 00340002
*/*                                                                  */ 00350000
*/***END_OF_PROPRIETARY_STATEMENT*************************************/ 00360000
*/*                                                                     00370000
*                                                                       00380000
*01* EXTERNAL CLASSIFICATION:  GUPI                                     00390000
*01* END OF EXTERNAL CLASSIFICATION:                                    00400000
*                                                                       00410000
*01* FUNCTION:                                                          00420000
*                                                                       00430000
*      The OPNF defines the open flags used on the OPEN and FCNTL       00440000
*      system calls.                                                    00450000
*                                                                       00460000
*01* METHOD OF ACCESS:                                                  00470000
*                                                                       00480000
*02*   PL/X:                                                            00490000
*                                                                       00500000
*        %INCLUDE SYSLIB(BPXYOPNF)                                      00510000
*        By default, the OPNF is based on O_FlagsPtr. If                00520000
*        other basing is desired, use %OPNFBASE='BASED(XXXXXX)'.        00530000
*        If %OPNFBASE='BASED(O_FlagsPtr)' is coded, a Declare for       00540000
*        O_FlagsPtr also generated.                                     00550000
*                                                                       00560000
*02*   ASM:                                                             00570000
*        With DSECT=NO, storage is allocated in line                    00580000
*        and addressability is provided thru that DSECT or CSECT.       00590000
*        With DSECT=YES, a DSECT is produced and "USING O_FLAGS,reg"    00600000
*        is required for addressability.  Here "reg" contains the       00610000
*        address of OPNF#LENGTH bytes of storage.                       00620000
*        The default is DSECT=YES.                                      00630000
*                                                                       00640000
*01* SIZE: OPNF#LENGTH = 4 bytes                                        00650000
*                                                                       00660000
*01* POINTED TO BY: O_FlagsPtr                                          00670000
*                                                                       00680000
*01* CREATED BY: Caller of system call                                  00690000
*                                                                       00700000
*01* DELETED BY: Caller of system call                                  00710000
*                                                                       00720000
*01* STORAGE ATTRIBUTES:                                                00730000
*02*   SUBPOOL/DATASPACE:  N/A                                          00740000
*02*   KEY:                N/A                                          00750000
*02*   RESIDENCY:          N/A                                          00760000
*                                                                       00770000
*01* FREQUENCY: Included with compile                                   00780000
*                                                                       00790000
*01* SERIALIZATION: N/A                                                 00800000
*                                                                       00810000
*01* DEPENDENCIES: None                                                 00820000
*                                                                       00830000
*01* NOTES: None                                                        00840000
*                                                                       00850000
*01* COMPONENT: OpenMVS (SCPX1)                                         00860000
*                                                                       00870000
*01* DISTRIBUTION LIBRARY:  AMACLIB                                     00880000
*                                                                       00890000
*01* EYE-CATCHER: None                                                  00900000
*                                                                       00910000
*01* CHANGE-ACTIVITY:                                                   00920000
*                                                                       00930000
* $L0=POSIXXF  HOM1110 931201 PDSV: OpenMVS Initial Release             00940000
* $R0=PL70249  HOM1110,921201,PDJS: Have GETFL return O_Flags           00950000
* $D1=DL70019  HOM1110 921201 PDJM: Assembler macro fixup               00960000
* $P2=PL70366  HOM1110 920908 PDSV: Macro commentary                    00970000
* $P3=PL70597  HOM1110 930104 PDJM: Use "OpenMVS"                       00980000
* $D2=DOAA002  HOM1120 930505 PDJV: Integrated Sockets support          00990000
*                                       Dcr A002.01                     01000000
* $P4=PL70770  HOM1110 930615 PDJV: Add O_GETFL field to ASM            01010000
* $D3=DOAA035  HOM1120 930802 PDJV: Add O_SYNC support                  01020000
* $D4=DPFA065  HOM1130 940727 PDJV: Add Async Signal support            01030000
* $D5=DxxA213  HBB7703 990923 PDJT: O_NOLARGEFILE & O_LARGEFILE         01040000
* $P5=PYN0220  HBB7708 020301 PDFO: Bilingual fixup                     01050000
* $D6=DDEA630  HBB7720 040107 PDJT: NFS V4                              01060000
* $01=OA42093  HBB7770 130430 PDGY: Add O_PrivProgCk                    01070000
* $D7=DCRC595  HBB77A0 140328 PDSK: AMODE64 64-bit autodata             01071001
*                                                                       01080000
****END OF SPECIFICATIONS*********************************************/ 01090000
*        %GOTO OPNFPLS  ;         /* Bilingual header                   01100000
.A411    ANOP  ,                                                        01110000
** BPXYOPNF: File status flags                                          01120000
**  Used By: FCT OPN                                                    01130000
         AIF   ('&DSECT' EQ 'NO').B411                        7@D1A     01140000
O_FLAGS              DSECT ,                                            01150000
         AGO   .C411                                                    01160000
.B411    ANOP  ,                                                        01170000
O_FLAGS              DS    0F                                           01180000
.C411    ANOP  ,                                                        01190000
O_FLAGS1             DS    B      Open flags - byte 1                   01200000
OPNFHIGH             EQU   X'80'  DO NOT USE THIS BIT]                  01210000
*                                 O_FLAGS must never be < 0             01220000
                     SPACE ,                                            01230000
O_FLAGS2             DS    B      Open flags - byte 2                   01240000
OPNFEXEC             EQU   X'80'  Execute access requested -            01250000
O_PRIVPROGCK         EQU   X'04'  Privileged program checking      @01A 01260000
*                                 authorization required for use        01270000
                     SPACE ,                                            01280000
O_FLAGS3             DS    B      Open flags - byte 3                   01290000
O_NOLARGEFILE        EQU   X'08'  Large Files not allowed          @D5A 01300000
O_LARGEFILE          EQU   X'04'  Ignored                          @D5A 01310000
O_ASYNCSIG           EQU   X'02'  An asynchronous signal may occur @D4A 01320000
O_SYNC               EQU   X'01'  Force synchronous updates    @D3A     01330000
                     SPACE ,                                            01340000
O_FLAGS4             DS    B      Open flags - byte 4                   01350000
O_CREXCL             EQU   X'C0'  Create file only if non-existent      01360000
O_CREAT              EQU   X'80'  Create file                           01370000
O_EXCL               EQU   X'40'  Exclusive flag                        01380000
O_NOCTTY             EQU   X'20'  Not a controlling terminal            01390000
O_TRUNC              EQU   X'10'  Truncate flag                         01400000
O_APPEND             EQU   X'08'  Set offset to EOF on write            01410000
O_NONBLOCK           EQU   X'04'  Don't block this file                 01420000
FNDELAY              EQU   X'04'  Don't block this file        @D2A     01430000
O_RDWR               EQU   X'03'  Open for Read and Write               01440000
O_RDONLY             EQU   X'02'  Open for Read Only                    01450000
O_WRONLY             EQU   X'01'  Open for Write Only                   01460000
O_ACCMODE            EQU   X'03'  Mask for file access modes            01470000
O_GETFL              EQU   X'0F'  Mask for file access modes and        01480000
*                                 file status flags together   @P4A     01490000
                     SPACE ,                                            01500000
OPNF#LENGTH          EQU   *-O_FLAGS Length of this structure           01510000
** BPXYOPNF End                                                         01520000
         SPACE 3                                                        01530000
         AIF   ('&LIST' EQ 'YES').E411                        6@D1A     01540000
         POP   PRINT                                                    01550000
.E411    ANOP  ,                                                        01560000
         MEND  ,                  Terminating PL/X comment           */ 01570000
*%OPNFPLS : ;                                                           01580000
* %DCL ASABEGIN_AMODE CHAR EXTERNAL;                          /* @D7A*/ 01581001
* %DCL PTR_64 CHAR EXTERNAL;                                  /* @D7A*/ 01582001
*%IF OPNFBASE='' %THEN                                                  01583000
*  %DO;                                                                 01584000
*    %OPNFBASE='BASED(O_FlagsPtr)';                                     01585000
*  %END;                                                                01586000
* %IF OPNFBASE='BASED(O_FlagsPtr)' %THEN                      /* @D7A*/ 01587001
*   %DO;                                                      /* @D7A*/ 01588001
*   %IF ASABEGIN_AMODE='64' ! PTR_64='YES'                    /* @D7A*/ 01589001
*    %THEN                                                    /* @D7A*/ 01589101
*    %DO;                                                     /* @D7A*/ 01589201
*      DCL O_FlagsPtr Ptr(64);       /* Pointer to the O_Flags   @D7A*/ 01589301
*    %END;                                                    /* @D7A*/ 01589401
*   %ELSE                                                     /* @D7A*/ 01589501
*    %DO;                                                     /* @D7A*/ 01589601
*      DCL O_FlagsPtr Ptr(31);       /* Pointer to the O_Flags       */ 01589700
*    %END;                                                    /* @D7A*/ 01589801
*   %END;                                                               01589900
*DCL 1 O_Flags Fixed(32) OPNFBASE,                                      01670000
* 2 O_FLAGS1      Bit(8),          /*                            @D3A*/ 01680000
*   3 OPNFHIGH      Bit(1),        /*DO NOT USE THIS BIT]               01690000
*                                     O_Flags must never be < 0      */ 01700000
*   3 OPNFRES1      Bit(7),        /* Reserved                       */ 01710000
* 2 O_FLAGS2      Bit(8),          /*                            @D3A*/ 01720000
*   3 OPNFEXEC      Bit(1),        /* Execute access requested -        01730000
*                                     flag for authorized function   */ 01740000
*   3 OPNFRES2      Bit(4),        /* Reserved                   @01C*/ 01750000
*   3 O_PrivProgCk Bit(1),         /* Privileged program checking@01A*/ 01760000
*   3 OpnfDenyRd    Bit(1),        /* v_open(Deny_Read)    IUO   @D6A*/ 01770000
*   3 OpnfDenyWrt   Bit(1),        /* v_open(Deny_Write)   IUO   @D6A*/ 01780000
* 2 O_FLAGS3      Bit(8),          /*                            @D3A*/ 01790000
*   3 OPNFRES3      Bit(4),        /* Reserved              @D3C @D4C*/ 01800000
*   3 O_NOLARGEFILE Bit(1),        /* Large Files not allowed    @D5A*/ 01810000
*   3 O_LARGEFILE   Bit(1),        /* Ignored                    @D5A*/ 01820000
*   3 O_ASYNCSIG    Bit(1),        /* An asynchronous signal may occur  01830000
*                                                                @D4A*/ 01840000
*   3 O_SYNC        Bit(1),        /* Force synchronous updates  @D3A*/ 01850000
* 2 O_FLAGS4      Bit(8),          /*                            @D3A*/ 01860000
*   3 O_CREXCL      Bit(2),        /* Create file only if non-existnt*/ 01870000
*     5 O_CREAT      Bit(1),       /* Create file                    */ 01880000
*     5 O_EXCL       Bit(1),       /* Exclusive flag                 */ 01890000
*   3 O_NOCTTY      Bit(1),        /* Not a controlling terminal     */ 01900000
*   3 O_TRUNC       Bit(1),        /* Truncate flag                  */ 01910000
*   3 O_APPEND      Bit(1),        /* Set offset to EOF on write     */ 01920000
*   3 O_NONBLOCK    Bit(1),        /* Don't block this file          */ 01930000
*     5 FNDELAY      Bit(1),       /* Don't block this file      @D2A*/ 01940000
*   3 O_RDWR        Bit(2),        /* Open for Read and Write        */ 01950000
*     5 O_RDONLY     Bit(1),       /* Open for Read Only             */ 01960000
*     5 O_WRONLY     Bit(1);       /* Open for Write Only            */ 01970000
*/*  Mask for related flags    */                                       01980000
*DCL                                                                    01990000
* O_ACCMODE Bit(32) Constant('00000003'X),  /* Mask for file access     02000000
*                                              modes                 */ 02010000
* O_DENYMODE Bit(32) Constant('00030000'X),  /* Mask for file deny      02020000
*                                              modes             @D6A*/ 02030000
* O_GETFL   Bit(32) Constant('0000000F'X), /* Mask for file access      02040000
*                                modes and file status flags together*/ 02050000
*                                                                       02060000
* O_RDWR_on Bit(2) Constant('11'B),         /* Open for Read & Write */ 02070000
* O_CREXCL_on Bit(2) Constant('11'B);       /* Create file only if      02080000
*                                              non-existent          */ 02090000
