*        %GOTO MTMPRO   ;         /* Bilingual header                   00010000
         MACRO                                                          00020000
         BPXYMTM   &DSECT=YES,&LIST=YES                       8@D1A     00030000
         GBLB  &MTM411                                                  00040000
         AIF   (&MTM411 EQ 1).E411                                      00050000
&MTM411 SETB   1                                                        00060000
         AIF   ('&LIST' EQ 'YES').A411                                  00070000
         PUSH  PRINT  BPXYMTM:  File system mount/unmount               00080000
         PRINT OFF              modes                                   00090000
         AGO   .A411                                                    00100000
*                                  */                                   00110000
*%MTMPRO  : ;                                                           00120000
*/****START OF SPECIFICATIONS****************************************** 00130000
*                                                                       00140000
*    $MAC (BPXYMTM) COMP(SCPX1) PROD(BPX):                              00150000
*                                                                       00160000
*01* MACRO NAME: BPXYMTM                                                00170000
*                                                                       00180000
*01* DSECT NAME: MTM                                                    00190000
*                                                                       00200000
*01* DESCRIPTIVE NAME: file system mount/umount modes                   00210000
*                                                                       00220000
*02*   ACRONYM: MTM                                                     00230000
**/                                                                     00240000
*/*01* PROPRIETARY STATEMENT=                                        */ 00250000
*/***PROPRIETARY_STATEMENT********************************************/ 00260000
*/*                                                                  */ 00270000
*/*                                                                  */ 00280000
*/* LICENSED MATERIALS - PROPERTY OF IBM                             */ 00290000
*/* 5694-A01 COPYRIGHT IBM CORP. 1993, 2017                          */ 00300004
*/*                                                                  */ 00310000
*/* STATUS= HBB77B0                                                  */ 00320004
*/*                                                                  */ 00330000
*/***END_OF_PROPRIETARY_STATEMENT*************************************/ 00340000
*/*                                                                     00350000
*                                                                       00360000
*01* EXTERNAL CLASSIFICATION:  GUPI                                     00370000
*01* END OF EXTERNAL CLASSIFICATION:                                    00380000
*                                                                       00390000
*01* FUNCTION:                                                          00400000
*                                                                       00410000
*      The MTM defines flags representing the file system access        00420000
*      modes supported by the mount, umount and unquiesce system calls. 00430000
*                                                                       00440000
*                                                                       00450000
*01* METHOD OF ACCESS:                                                  00460000
*                                                                       00470000
*02*   PL/X:                                                            00480000
*                                                                       00490000
*        %INCLUDE SYSLIB(BPXYMTM)                                       00500000
*        By default, the MTM is based on MTMPtr. If                     00510000
*        other basing is desired, use %MTMBASE='BASED(XXXXXX)'.         00520000
*        If %MTMBASE='BASED(MTMPtr)' is coded, a Declare for            00530000
*        MTMPtr is also generated.                                      00540000
*                                                                       00550000
*02*   ASM:                                                             00560000
*        With DSECT=NO, storage is allocated in line                    00570000
*        and addressability is provided thru that DSECT or CSECT.       00580000
*        With DSECT=YES, a DSECT is produced and "USING MTM,reg"        00590000
*        is required for addressability.  Here "reg" contains the       00600000
*        address of MTM#LENGTH bytes of storage.                        00610000
*        The default is DSECT=YES.                                      00620000
*                                                                       00630000
*01* SIZE: MTM#LENGTH = 4 bytes                                         00640000
*                                                                       00650000
*01* POINTED TO BY: MTMPtr                                              00660000
*                                                                       00670000
*01* CREATED BY: Caller of system call                                  00680000
*                                                                       00690000
*01* DELETED BY: Caller of system call                                  00700000
*                                                                       00710000
*01* STORAGE ATTRIBUTES:                                                00720000
*02*   SUBPOOL/DATASPACE:  N/A                                          00730000
*02*   KEY:                N/A                                          00740000
*02*   RESIDENCY:          N/A                                          00750000
*                                                                       00760000
*01* FREQUENCY: Included with compile                                   00770000
*                                                                       00780000
*01* SERIALIZATION: N/A                                                 00790000
*                                                                       00800000
*01* DEPENDENCIES: None                                                 00810000
*                                                                       00820000
*01* NOTES: The Mtm corresponds to the VfsFlags field.  Any changes     00830000
*           made to either field should be reflected in the other.      00840000
*                                                                       00850000
*01* COMPONENT: OpenMVS (SCPX1)                                         00860000
*                                                                       00870000
*01* DISTRIBUTION LIBRARY:  AMACLIB                                     00880000
*                                                                       00890000
*01* EYE-CATCHER: None                                                  00900000
*02*   OFFSET:                                                          00910000
*02*   LENGTH:                                                          00920000
*                                                                       00930000
*01* CHANGE-ACTIVITY:                                                   00940000
*                                                                       00950000
* $L0=POSIXXF  HOM1110 921201 PDSV: OpenMVS Initial Release             00960000
* $R1=POSIXXF  HOM1110 920320 PDJV: Add umount fields                   00970000
* $R2=POSIXXF  HOM1110 920601 PDJV: Add unquiesce fields                00980000
* $D1=DL70019  HOM1110 921201 PDJM: Assembler macro fixup               00990000
* $P0=PL70366  HOM1110 920908 PDSV: Macro commentary                    01000000
* $P1=PL70484  HOM1110 921208 PDJV: Add comment explanations            01010000
* $P2=PL70597  HOM1110 930104 PDJM: Use "OpenMVS"                       01020000
* $P3=POA0106  HOM1120 931208 PDJV: Reserve 2 additional bits           01030000
* $D2=DPFA052  HOM1130 940619 PDSV: vfs_pfsctl             A052.05      01040000
* $D3=DPFA065  HOM1130 940712 PDJV: UU/XPG4 support        A065.18      01050000
* $D4=DPFA052  HOM1130 940930 PDSV: Asynchronous mount     A052.07      01060000
* $D5=DPFA091  HOM1130 941112 PDSV: DCR A091.02 Automount/remount       01070000
* $D6=PWA0061  JBB6607 980302 PDJT: Mount NoSecurity       A297         01080000
* $P4=PWA0114  JBB6607 980429 PDJT: Add NoSec to Mtm#MountTest          01090000
* $D7=DCA0309  HBB6608 980921 PDSZ: Sysplex                A309         01100000
* $D8=DWY0309  JBB6609 980108 PDJP: Sysplex support - XPFS A309         01110000
* $01=PX01179  HBB7703 010115 PDJS: Add MtmTermUmount                   01120000
* $D9=DYM0522  HBB7706 001025 PDFV: Add UnMount to AutoMove   A522.00   01130000
* $P5=PYN0220  HBB7708 020301 PDFO: Bilingual fixup                     01140000
* $P6=ME09283  HBB7740 070204 PDJN: Clarify valid Mount bits            01150000
* $DA=DCRB241  HBB7750 080229 PDSK: Support for zFS B241.02 ME12678     01151000
* $xx=DCRB495  HBB7760 080630 PDGY: update comment for MtmSamemode      01151100
* $DB=DCRC595  HBB77A0 140328 PDSK: AMODE64 64-bit autodata             01151200
* $DC=DCRC923  HBB77B0 151204 PDSK: HFS->zFS Vfs queue changes          01151305
*                                                                       01151405
****END OF SPECIFICATIONS*********************************************/ 01151505
*        %GOTO MTMPLS   ;         /* Bilingual header                   01151605
.A411    ANOP  ,                                                        01151705
** BPXYMTM:  File system mount/unmount modes                            01151805
**  Used By: MNT UMT                                                    01151905
         AIF   ('&DSECT' EQ 'NO').B411                           7@D1A  01152005
MTM                  DSECT ,                                            01152105
         AGO   .C411                                                    01152205
.B411    ANOP  ,                                                        01152305
MTM                  DS    0F                                           01152405
.C411    ANOP  ,                                                        01152505
MTM1                 DS    B     Flag byte 1                            01152605
MTMRO                EQU   X'80' Mount file set read-only               01152705
MTMRDWR              EQU   X'40' Mount file set read/write              01152805
MTMDDNAME            EQU   X'20' FileSet is a DDName                    01152905
MTMUMOUNT            EQU   X'10' This is a normal unmount request.      01153005
*                                If no one is using any of the files    01153105
*                                in the named filesystem, the unmount   01154000
*                                will be done.  Otherwise, the request  01155000
*                                will be rejected.                @P1C  01156000
MTMIMMED             EQU   X'08' This is an unmount immediate request.  01157000
*                                The filesystem will be unmounted       01158000
*                                immediately, forcing any users of any  01159000
*                                files in the named filesystem to fail. 01160000
*                                All data changes that were made up to  01170000
*                                the time of the request will be saved. 01180000
*                                If there is a problem saving the data, 01190000
*                                the unmount request will fail.   @P1C  01200000
MTMFORCE             EQU   X'04' This is an unmount force request.      01210000
*                                The filesystem will be unmounted       01220000
*                                immediately, forcing any users of any  01230000
*                                files in the named filesystem to fail. 01240000
*                                All data changes that were made up to  01250000
*                                the time of the request will be saved. 01260000
*                                If there is a problem saving the data, 01270000
*                                the request will continue and data may 01280000
*                                be lost.  Since data may be lost,      01290000
*                                before a forced request will be        01300000
*                                allowed, a previous immediate unmount  01310000
*                                request must have been attempted, or   01320000
*                                the request will be rejected.     @P1C 01330000
MTMDRAIN             EQU   X'02' This is an unmount drain request.      01340000
*                                The requestor is willing to wait for   01350000
*                                all uses of this filesystem to be      01360000
*                                normally terminated and the            01370000
*                                filesystem to be unmounted.       @P1C 01380000
MTMRESET             EQU   X'01' This is a reset unmount request.  This 01390000
*                                will allow a previous unmount drain    01400000
*                                request to be stopped.            @P1C 01410000
                     SPACE ,                                            01420000
MTM2                 DS    B     Flag byte 2                            01430000
MTM2RES80            EQU   X'80' Must not be used                  @R1A 01440000
MTM2RES40            EQU   X'40' Must not be used                  @R1A 01450000
MTMTERMUNMOUNT       EQU   X'20' Unmount from PFS term             @01C 01460000
MTMSAMEMODE          EQU   X'10' Remount samemode              @DAC@01C 01470000
MTMMNTINCOMP         EQU   X'08' Mount is incomplete               @R1A 01480000
MTMUNQSEFORCE        EQU   X'04' Force this unquiesce request, even     01490000
*                                if the requester process is not        01500000
*                                the process that made the quiesce      01510000
*                                request.                          @P1C 01520000
MTM2RES02            EQU   X'02' Must not be used                  @R1A 01530000
MTM2RES01            EQU   X'01' Must not be used                  @R1A 01540000
                     SPACE ,                                            01550000
MTM3                 DS    B     Flag byte 3 - reserved                 01560000
MTMSWAP              EQU   X'80' internal use only                 @DCA 01561007
MTM3RES40            EQU   X'40' Must not be used                  @R1A 01580000
MTM3RES20            EQU   X'20' Must not be used                  @P3A 01590000
MTM3RES10            EQU   X'10' Must not be used                  @P3A 01600000
MTM3RES08            EQU   X'08' Must not be used                  @D2A 01610000
MTMNOSUID            EQU   X'04' Dont allow setuid                 @D3A 01620000
MTMSYNCHONLY         EQU   X'02' Mount must be completed                01630000
*                                synchronously.  That is, mount()       01640000
*                                must not return +1                @D4A 01650000
MTMREMOUNT           EQU   X'01' Change attributes of mounted file      01660000
*                                system                            @D5A 01670000
                     SPACE ,                                            01680000
MTM4                 DS    B     Flag byte 4 - reserved                 01690000
MTMNOSEC             EQU   X'80' NoSecurity option                 @D6A 01700000
MTM4RES40            EQU   X'40' Must not be used                  @D7A 01710000
MTM4RES20            EQU   X'20' Must not be used                  @D7A 01720000
MTMAMOVE             EQU   X'10' Automove option                   @D7A 01730000
*                                BPX2MNT/BPX4MNT use only          @P6C 01740000
MTMAUNMOUNT          EQU   X'08' UnMount during recovery      @D9C @D8A 01750000
*                                BPX2MNT/BPX4MNT use only          @P6C 01760000
MTM4RES08            EQU   X'08' Must not be used                  @D8A 01770000
MTM4RES04            EQU   X'04' Must not be used                  @D8A 01780000
MTM4RES02            EQU   X'02' Must not be used                  @D8A 01790000
MTM#LENGTH           EQU   *-MTM Length of this structure               01800000
*                                                                       01810000
* MTM#MOUNTTEST defines the valid MTM bit settings for the BPX1MNT      01820000
* interface                                                             01830000
MTM#MOUNTTEST        EQU   X'C0000680'                             @P6A 01840000
** BPXYMTM End                                                          01850000
         SPACE 3                                                        01860000
         AIF   ('&LIST' EQ 'YES').E411                            6@D1A 01870000
         POP   PRINT                                                    01880000
.E411    ANOP  ,                                                        01890000
         MEND  ,                  Terminating PL/X comment           */ 01900000
*%MTMPLS  : ;                                                           01910000
* %DCL ASABEGIN_AMODE CHAR EXTERNAL;                          /* @DBA*/ 01920000
* %DCL PTR_64 CHAR EXTERNAL;                                  /* @DBA*/ 01930000
*%IF MTMBASE='' %THEN                                                   01940000
*  %DO;                                                                 01950000
*    %MTMBASE='BASED(MTMPtr)';                                          01960000
*  %END;                                                                01970000
* %IF TRANSLATE(MTMBASE)='BASED(MTMPTR)' %THEN                          01980000
*   %DO;                                                                01990000
*   %IF ASABEGIN_AMODE='64' ! PTR_64='YES'                    /* @DBA*/ 01991000
*    %THEN                                                    /* @DBA*/ 01992000
*    %DO;                                                     /* @DBA*/ 01993000
*      DCL MTMPtr Ptr(64);           /* Pointer to the MTM       @DBA*/ 01994000
*    %END;                                                    /* @DBA*/ 01995000
*   %ELSE                                                     /* @DBA*/ 01996000
*    %DO;                                                     /* @DBA*/ 01997000
*      DCL MTMPtr Ptr(31);           /* Pointer to the MTM           */ 01998000
*    %END;                                                    /* @DBA*/ 01999000
*   %END;                                                               02000000
*DCL                                                                    02010000
* 1 Mtm Fixed(32) MTMBASE,                                              02020000
*  3 MtmRo         Bit(1),         /* Mount file set read-only       */ 02030000
*  3 MtmRdwr       Bit(1),         /* Mount file set read/write      */ 02040000
*  3 MtmDDName     Bit(1),         /* On=FileSet is a DDName            02050000
*                                     Off=FileSet is not a DDName    */ 02060000
*  3 MtmUmount     Bit(1),         /* This is a normal unmount request. 02070000
*                                     If no one is using any of the     02080000
*                                     files in the named filesystem,    02090000
*                                     the unmount will be done.         02100000
*                                     Otherwise, the request will be    02110000
*                                     rejected.                  @P1A*/ 02120000
*  3 MtmImmed        Bit(1),       /* This is an immediate unmount      02130000
*                                     request.  The filesystem will be  02140000
*                                     unmounted immediately, forcing    02150000
*                                     any users of any files in the     02160000
*                                     named filesystem to fail.  All    02170000
*                                     data changes that were made up    02180000
*                                     to the time of the request will   02190000
*                                     be saved.  If there is a problem  02200000
*                                     saving the data, the unmount      02210000
*                                     request will fail.         @P1C*/ 02220000
*  3 MtmForce        Bit(1),       /* This is a forced unmount request. 02230000
*                                     The filesystem will be unmounted  02240000
*                                     immediately, forcing any users    02250000
*                                     of any files in the named         02260000
*                                     filesystem to fail.  All data     02270000
*                                     changes that were made up to the  02280000
*                                     time of the request will be       02290000
*                                     saved.  If there is a problem     02300000
*                                     saving the data, the request      02310000
*                                     will continue and some data may   02320000
*                                     be lost.  Since data may be lost, 02330000
*                                     before a forced request will be   02340000
*                                     allowed, a previous immediate     02350000
*                                     unmount must have been attempted, 02360000
*                                     or the request will be rejected.  02370000
*                                                                @P1C*/ 02380000
*  3 MtmDrain        Bit(1),       /* This is an unmount drain request. 02390000
*                                     The requestor is willing to wait  02400000
*                                     for all uses of this filesystem   02410000
*                                     to be normally terminated and     02420000
*                                     the filesystem to be unmounted.   02430000
*                                                                @P1C*/ 02440000
*  3 MtmReset        Bit(1),       /* This is a reset unmount request.  02450000
*                                     This will allow a previous        02460000
*                                     unmount drain request to be       02470000
*                                     stopped.                   @P1C*/ 02480000
*  3  *            Bit(2),         /* Must not be used           @01C*/ 02490000
*  3  MtmTermUnmount Bit(1),       /* Unmount by PFS termination @01A*/ 02500000
*  3 MtmSameMode   Bit(1),         /* Remount samemode           @DAC*/ 02510000
*  3 MtmMntIncomp    Bit(1),       /* Mount is incomplete            */ 02520000
*  3 MtmUnqseForce   Bit(1),       /* Force this unquiesce request,     02530000
*                                     even if the requester process is  02540000
*                                     not the process that made the     02550000
*                                     quiesce request.           @P1C*/ 02560000
*  3  *              Bit(2),       /* Must not be used           @D2C*/ 02570002
*  3 MtmSwap         Bit(1),       /* internal use only          @DCA*/ 02570106
*  3  *              Bit(4),       /* Must not be used           @D2C*/ 02570202
*  3 MtmNoSuid       Bit(1),       /* Don't allow setuid         @D3A*/ 02580000
*  3 MtmSynchOnly    Bit(1),       /* Mount must be completed           02590000
*                                     synchronously.  That is, mount()  02600000
*                                     must not return +1         @D4A*/ 02610000
*  3 MtmRemount      Bit(1),       /* Change attributes of              02620000
*                                     mounted file system        @D5A*/ 02630000
*  3 MtmNoSec        Bit(1),       /* NoSecurity Option          @D6A*/ 02640000
*  3 *               Bit(2),       /* Must not be used           @D7A*/ 02650000
*  3 MtmNoAutoMove   Bit(1),       /* Automove Option                   02660000
*                                     BPX2MNT/BPX4MNT only  @P6C@D7A*/  02670000
*  3 MtmAUnMount     Bit(1),       /* UnMount during recovery           02680000
*                                     BPX2MNT/BPX4MNT only              02690000
*                                                 @P6C @D9C @D7A @D8C*/ 02700000
*  3 *               Bit(1),       /* Must not be used     @D7A, @D8C*/ 02710000
*  3 MtmServedClient Bit(1),       /* Mount as served client -          02720000
*                                       kernel use only          @D8A*/ 02730000
*  3 MtmResx         Bit(1);       /* Reserved             @D7C, @D8C*/ 02740000
*  /******************************************************************/ 02750000
*  /* Declare constant fields that can be used by mount,umount, and  */ 02760000
*  /* unquiesce system calls to verify the input bits.               */ 02770000
*  /******************************************************************/ 02780000
*  Dcl Mtm#MountTest       Bit(32) Constant('C0000680'X),      /*@P4C*/ 02790000
*      Mtm#UmountTest      Bit(32) Constant('DF308100'X),  /*@DCC@01C*/ 02800005
*      Mtm#UmountValid     Bit(32) Constant('0F000000'X),               02810000
*      Mtm#RemountValid    Bit(32) Constant('DF000000'X),      /*@D5A*/ 02820000
*      Mtm#UnquiesceTest   Bit(32) Constant('00040000'X);               02830000
