*        %GOTO MODEPRO  ;         /* Bilingual header                   00010000
         MACRO                                                          00020000
         BPXYMODE  &DSECT=YES,&LIST=YES                       8@D1A     00030000
         GBLB  &MODE411                                                 00040000
         AIF   (&MODE411 EQ 1).E411                                     00050000
&MODE411 SETB  1                                                        00060000
         AIF   ('&LIST' EQ 'YES').A411                                  00070000
         PUSH  PRINT  BPXYMODE: Mode constants specified                00080000
         PRINT OFF              on system calls                         00090000
         AGO   .A411                                                    00100000
*                                  */                                   00110000
*%MODEPRO : ;                                                           00120000
*/****START OF SPECIFICATIONS****************************************** 00130000
*                                                                       00140000
*    $MAC (BPXYMODE) COMP(SCPX1) PROD(BPX):                             00150000
*                                                                       00160000
*01* MACRO NAME: BPXYMODE                                               00170000
*                                                                       00180000
*01* DSECT NAME: S_MODE                                                 00190000
*                                                                       00200000
*01* DESCRIPTIVE NAME: mode constants for syscalls                      00210000
*                                                                       00220000
*02*   ACRONYM: MODE                                                    00230000
**/                                                                     00240000
*/*01* PROPRIETARY STATEMENT=                                        */ 00250000
*/***PROPRIETARY_STATEMENT********************************************/ 00260000
*/*                                                                  */ 00270000
*/*                                                                  */ 00280000
*/* LICENSED MATERIALS - PROPERTY OF IBM                             */ 00290000
*/* THIS MACRO IS "RESTRICTED MATERIALS OF IBM"                      */ 00300000
*/* 5694-A01 COPYRIGHT IBM CORP. 1993, 2015                          */ 00310002
*/*                                                                  */ 00320000
*/* STATUS= HBB77A0                                                  */ 00330002
*/*                                                                  */ 00340000
*/***END_OF_PROPRIETARY_STATEMENT*************************************/ 00350000
*/*                                                                     00360000
*                                                                       00370000
*01* EXTERNAL CLASSIFICATION:  GUPI                                     00380000
*01* END OF EXTERNAL CLASSIFICATION:                                    00390000
*                                                                       00400000
*01* FUNCTION:                                                          00410000
*                                                                       00420000
*      The MODE defines the mode flags specified on the CHMOD,          00430000
*      FCHMOD, MKDIR, MKFIFO, OPEN and UMASK system calls.              00440000
*                                                                       00450000
*                                                                       00460000
*01* METHOD OF ACCESS:                                                  00470000
*                                                                       00480000
*02*   PL/X:                                                            00490000
*                                                                       00500000
*        %INCLUDE SYSLIB(BPXYMODE)                                      00510000
*        By default, the MODE is based on S_ModePtr. If                 00520000
*        other basing is desired, use %MODEBASE='BASED(XXXXXX)'.        00530000
*        If %MODEBASE='BASED(S_ModePtr)' is coded, a Declare for        00540000
*        S_ModePtr is also generated.                                   00550000
*                                                                       00560000
*02*   ASM:                                                             00570000
*        With DSECT=NO, storage is allocated in line                    00580000
*        and addressability is provided thru that DSECT or CSECT.       00590000
*        With DSECT=YES, a DSECT is produced and "USING S_MODE,reg"     00600000
*        is required for addressability.  Here "reg" contains the       00610000
*        address of S_MODE#LENGTH bytes of storage.                     00620000
*        The default is DSECT=YES.                                      00630000
*                                                                       00640000
*01* SIZE: S_MODE#LENGTH = 4 bytes                                      00650000
*                                                                       00660000
*01* POINTED TO BY: S_ModePtr                                           00670000
*                                                                       00680000
*01* CREATED BY: Caller of system calls                                 00690000
*                                                                       00700000
*01* DELETED BY: Caller of system calls                                 00710000
*                                                                       00720000
*01* STORAGE ATTRIBUTES:                                                00730000
*02*   SUBPOOL/DATASPACE:  N/A                                          00740000
*02*   KEY:                N/A                                          00750000
*02*   RESIDENCY:          N/A                                          00760000
*                                                                       00770000
*01* FREQUENCY: Included with compile                                   00780000
*                                                                       00790000
*01* SERIALIZATION: N/A                                                 00800000
*                                                                       00810000
*01* DEPENDENCIES: None                                                 00820000
*                                                                       00830000
*01* NOTES: File types are mapped by BPXYFTYP                           00840000
*                                                                       00850000
*01* COMPONENT: OpenMVS (SCPX1)                                         00860000
*                                                                       00870000
*01* DISTRIBUTION LIBRARY:  AMACLIB                                     00880000
*                                                                       00890000
*01* EYE-CATCHER: None                                                  00900000
*                                                                       00910000
*01* CHANGE-ACTIVITY:                                                   00920000
*                                                                       00930000
* $L0=POSIXXF  HOM1110 921201 PDSV: OpenMVS Initial Release             00940000
* $R0=POSIXXF  HOM1110 920528 PDSV: DR12: define S_ISVTX                00950000
* $P1=PL70275  HOM1110 920608 PDSV: Define S_RES0x in ASM               00960000
* $D1=DL70019  HOM1110 921201 PDJM: Assembler macro fixup               00970000
* $P3=PL70366  HOM1110 920908 PDSV: Macro commentary                    00980000
* $D2=DCR0012  HOM1110 920930 PDSV: Sticky bit                          00990000
* $P4=PL70597  HOM1110 930104 PDJM: Use "OpenMVS"                       01000000
* $P5=PL70585  HOM1110 930113 PDSV: Terminology improvement             01010000
* $D3=DPFA051  HOM1130 940131 PDJD: A051.02 Initial XPG4 IPC            01020000
* $P6=PPF0001  HOM1130 940216 PDSV: A051.02 Add ASM                     01030000
* $D4=DPFA052  HOM1130 940510 PDSV: DCR A052.04 RES0x lengths           01040000
* $P7=PPF0230  HOM1130 950308 PDJT: Update Sticky Bit comment           01050000
* $P8=PPF0338  HOM1130 950403 PDSK: Umask not process specific -        01060000
*                                   APAR OW11644                        01070000
* $P9=PYN0220  HBB7708 020301 PDFO: Bilingual fixup                     01080000
* $D5=DCRC595  HBB77A0 140328 PDSK: AMODE64 64-bit autodata             01081001
****END OF SPECIFICATIONS*********************************************/ 01090000
*        %GOTO MODEPLS  ;         /* Bilingual header                   01100000
.A411    ANOP  ,                                                        01110000
** BPXYMODE: Mode constants specified on system calls                   01120000
**  Used By: CHM FCM MKD MKN OPN UMK                                    01130000
         AIF   ('&DSECT' EQ 'NO').B411                        7@D1A     01140000
S_MODE               DSECT ,                                            01150000
         AGO   .C411                                                    01160000
.B411    ANOP  ,                                                        01170000
S_MODE               DS    0F                                           01180000
.C411    ANOP  ,                                                        01190000
                     DS    0F                                           01200000
*                                                                       01210000
S_TYPE               DS    B      File types, mapped by BPXYFTYP        01220000
*                                 Flag bytes                            01230000
S_MODE3B             DS    0XL3   All flag bytes                   @P6A 01240000
S_RES01              DS    0BL.8  Reserved                         @D4C 01250000
S_MODE1              DS    B      Flag byte 1 - reserved                01260000
*                                                                       01270000
S_RES02              DS    0BL.4  Reserved                         @D4C 01280000
S_MODE2              DS    B      Flag byte 2                           01290000
*                                 Set ID flags                          01300000
S_ISUID              EQU   X'08'  Set user ID on execution              01310000
S_ISGID              EQU   X'04'  Set group ID on execution             01320000
S_ISVTX              EQU   X'02'  Sticky Bit: For executables, look     01330000
*                                  first in normal MVS search order     01340000
*                                  For directories, deletion rstd       01350000
*                                  to owner or superuser.               01360000
*                                 Owner flags                           01370000
S_IRWXU1             EQU   X'01'  All permissions for user - part I     01380000
S_IRUSR              EQU   X'01'  Read permission                       01390000
*                                                                       01400000
S_MODE3              DS    B      Flag byte 3                           01410000
*                                 Owner flags - continued               01420000
S_IRWXU2             EQU   X'C0'  All permissions for user - Part II    01430000
S_IWUSR              EQU   X'80'  Write permission                      01440000
S_IXUSR              EQU   X'40'  Search (if a directory) or            01450000
*                                 execute (otherwise) permission        01460000
*                                 Group flags                           01470000
S_IRWXG              EQU   X'38'  All permissions for group             01480000
S_IRGRP              EQU   X'20'  Read permission                       01490000
S_IWGRP              EQU   X'10'  Write permission                      01500000
S_IXGRP              EQU   X'08'  Search (if a directory) or            01510000
*                                 execute (otherwise) permission        01520000
*                                 Other flags                           01530000
S_IRWXO              EQU   X'07'  All permissions for other             01540000
S_IROTH              EQU   X'04'  Read permission                       01550000
S_IWOTH              EQU   X'02'  Write permission                      01560000
S_IXOTH              EQU   X'01'  Search (if a directory) or            01570000
*                                 execute (otherwise) permission        01580000
S_MODE#LENGTH        EQU   *-S_MODE Length this structure               01590000
** BPXYMODE End                                                         01600000
         SPACE 3                                                        01610000
         AIF   ('&LIST' EQ 'YES').E411                        6@D1A     01620000
         POP   PRINT                                                    01630000
.E411    ANOP  ,                                                        01640000
         MEND  ,                  Terminating PL/X comment           */ 01650000
*%MODEPLS : ;                                                           01660000
* %DCL ASABEGIN_AMODE CHAR EXTERNAL;                          /* @D5A*/ 01661001
* %DCL PTR_64 CHAR EXTERNAL;                                  /* @D5A*/ 01662001
*%IF MODEBASE='' %THEN                                                  01663000
*  %DO;                                                                 01664000
*    %MODEBASE='BASED(S_ModePtr)';                                      01665000
*  %END;                                                                01666000
* %IF MODEBASE='BASED(S_ModePtr)' %THEN                                 01667000
*   %DO;                                                                01668000
*   %IF ASABEGIN_AMODE='64' ! PTR_64='YES'                    /* @D5A*/ 01669001
*    %THEN                                                    /* @D5A*/ 01669101
*    %DO;                                                     /* @D5A*/ 01669201
*      DCL S_ModePtr Ptr(64);        /* Pointer to the S_Mode    @D5A*/ 01669301
*    %END;                                                    /* @D5A*/ 01669401
*   %ELSE                                                     /* @D5A*/ 01669501
*    %DO;                                                     /* @D5A*/ 01669601
*      DCL S_ModePtr Ptr(31);        /* Pointer to the S_Mode        */ 01669700
*    %END;                                                    /* @D5A*/ 01669801
*   %END;                                                               01669900
*DCL                                                                    01750000
* 1 S_Mode Fixed(32) MODEBASE,                                          01760000
*                                                                       01770000
*  3 S_Type      Fixed(8),         /* File type, mapped by BPXYFTYP  */ 01780000
*  3 S_Mode3B     Char(3),         /* Used to LIKE(map)          @D3A*/ 01790000
*   4 S_RES01     Bit(8),          /* Reserved                   @D2C*/ 01800000
*   4 S_RES02     Bit(4),          /* Reserved                   @D2C*/ 01810000
*   4 S_ISUID     Bit(1),          /* Set user ID on execution       */ 01820000
*   4 S_ISGID     Bit(1),          /* Set group ID on execution      */ 01830000
*   4 S_ISVTX     Bit(1),          /* Sticky Bit: For executables, look 01840000
*                                      first in normal MVS search order 01850000
*                                      For directories, deletion rstd   01860000
*                                      to owner or superuser.    @P7C*/ 01870000
*   4 S_IRWXU     Bit(3),          /* Owner class mask               */ 01880000
*    5 S_IRUSR    Bit(1),          /* Read permission                */ 01890000
*    5 S_IWUSR    Bit(1),          /* Write permission               */ 01900000
*    5 S_IXUSR    Bit(1),          /* Search (if a directory) or        01910000
*                                     execute (otherwise) permission */ 01920000
*   4 S_IRWXG     Bit(3),          /* Group class mask               */ 01930000
*    5 S_IRGRP    Bit(1),          /* Read permission                */ 01940000
*    5 S_IWGRP    Bit(1),          /* Write permission               */ 01950000
*    5 S_IXGRP    Bit(1),          /* Search (if a directory) or        01960000
*                                     execute (otherwise) permission */ 01970000
*   4 S_IRWXO     Bit(3),          /* Other class mask               */ 01980000
*    5 S_IROTH    Bit(1),          /* Read permission                */ 01990000
*    5 S_IWOTH    Bit(1),          /* Write permission               */ 02000000
*    5 S_IXOTH    Bit(1);          /* Search (if a directory) or        02010000
*                                     execute (otherwise) permission */ 02020000
*/*  Masks for related flags    */                                      02030000
*DCL                                                                    02040000
*S_IRWXU_on Bit(3) Constant('111'B),/* All permissions for user      */ 02050000
*S_IRWXG_on Bit(3) Constant('111'B),/* All permissions for group     */ 02060000
*S_IRWXO_on Bit(3) Constant('111'B),/* All permissions for other     */ 02070000
*S_IUGO Bit(32) Constant('000001FF'X);   /* User, group and      @P8A*/ 02080000
*                                   /* other bits in S_Mode word @P8A*/ 02090000
