*                                                                       00001006
* %DCL BPXYPOE_INCLUDED CHAR EXT;                                       00002006
* %DEACTIVATE BPXYPOE_INCLUDED;                                         00003006
* %IF BPXYPOE_INCLUDED = '' %THEN                                       00004006
* %DO;                                                                  00005006
*/* Macro made bi-lingual on 09067. CBGEN compile date 08242         */ 00006006
*% /*                                                                   00007006
         MACRO                                                          00008006
         BPXYPOE &DSECT=YES,&LIST=YES,&TITLE=YES,&POE=YES               00009006
         GBLC  &BPXYPOE_INCLUDED                                        00010006
         GBLC  &ZCBPRINT                                                00011006
&BPXYPOE_INCLUDED SETC 'YES'                                            00012006
         AIF   ('&LIST' EQ 'NONE').P0                                   00013006
         AIF   ('&TITLE' EQ 'NO').P5                                    00014006
 TITLE   'BPXYPOE  - Point of Entry parameter block specified on     '  00015006
.P5      ANOP                                                           00016006
**/ BPXYPOE_1:;                                                         00017006
*/****START OF SPECIFICATIONS****************************************** 00018006
*                                                                       00019006
*    $MAC (BPXYPOE) COMP(SCPX1) PROD(BPX):                              00020006
*                                                                       00021006
*01* MACRO NAME: BPXYPOE                                                00022006
*                                                                       00023006
*01* DSECT NAME: BPXYPOE                                                00024006
*                                                                       00025006
*01* DESCRIPTIVE NAME: Point of Entry parameter block specified on      00026006
*                      BPX1POE (__poe) system call                      00027006
*                                                                       00028006
*02*   ACRONYM: POE                                                     00029006
**/                                                                     00030006
*/*01* PROPRIETARY STATEMENT=                                        */ 00031006
*/***PROPRIETARY_STATEMENT********************************************/ 00032006
*/*                                                                  */ 00033006
*/*                                                                  */ 00034006
*/* LICENSED MATERIALS - PROPERTY OF IBM                             */ 00035006
*/* THIS MACRO IS "RESTRICTED MATERIALS OF IBM"                      */ 00036006
*/* 5694-A01 (C) COPYRIGHT IBM CORP. 1993, 2003                      */ 00037006
*/*                                                                  */ 00038006
*/* STATUS= HBB7709                                                  */ 00039006
*/*                                                                  */ 00040006
*/***END_OF_PROPRIETARY_STATEMENT*************************************/ 00041006
*/*                                                                     00042006
*                                                                       00043006
*01* EXTERNAL CLASSIFICATION:  GUPI                                     00044006
*01* END OF EXTERNAL CLASSIFICATION:                                    00045006
*                                                                       00046006
*01* FUNCTION:                                                          00047006
*                                                                       00048006
*      The POE maps a request to the __poe service to specify what      00049006
*      Point Of Entry information should be used in doing permission    00050006
*      checking                                                         00051006
*                                                                       00052006
*01* METHOD OF ACCESS:                                                  00053006
*                                                                       00054006
*02*   PL/X:                                                            00055006
*                                                                       00056006
*        %INCLUDE SYSLIB(BPXYPOE)                                       00057006
*        By default, the POE is based on POEPtr.  If                    00058006
*        other basing is desired, use %POEBASE='BASED(XXXXXX)'.         00059006
*        If %POEBASE='BASED(POEPTR)' is coded, a Declare for            00060006
*        POEPTR is also generated.                                      00061006
*                                                                       00062006
*02*   ASM:                                                             00063006
*                                                                       00064006
*        With DSECT=NO, storage is allocated in line                    00065006
*        and addressability is provided thru that DSECT or CSECT.       00066006
*        With DSECT=YES, a DSECT is produced and "USING STAT,reg"       00067006
*        is required for addressability.  Here "reg" contains the       00068006
*        address of POE#LEN bytes of storage.                           00069006
*        The default is DSECT=YES.                                      00070006
*                                                                       00071006
*01* SIZE: POE#LEN                                                      00072006
*            POE -- X'0078' bytes                                       00073006
*                                                                       00074006
*01* POINTED TO BY: Input parameter of __poe system call                00075006
*                                                                       00076006
*01* CREATED BY: Invoker of __poe system call routine                   00077006
*                                                                       00078006
*01* DELETED BY: Invoker of __poe system call routine                   00079006
*                                                                       00080006
*01* STORAGE POERIBUTES:                                                00081006
*02*   SUBPOOL: N/A                                                     00082006
*02*   KEY:     N/A                                                     00083006
*02*   RESIDENCY: Caller's Primary address space                        00084006
*                                                                       00085006
*01* FREQUENCY: 1 per __poe system call                                 00086006
*                                                                       00087006
*01* SERIALIZATION: N/A                                                 00088006
*                                                                       00089006
*01* DEPENDENCIES: None                                                 00090006
*                                                                       00091006
*01* NOTES:                                                             00092006
*                                                                       00093006
*01* COMPONENT: OpenMVS (SCPX1)                                         00094006
*                                                                       00095006
*01* DISTRIBUTION LIBRARY:  AMACLIB                                     00096006
*                                                                       00097006
*01* EYE-CATCHER: POE                                                   00098006
*02*   OFFSET:  0                                                       00099006
*02*   LENGTH:  4                                                       00100006
*                                                                       00101006
*01* CHANGE-ACTIVITY:                                                   00102006
*                                                                       00103006
*    $L0=DYVA567  HBB7707 010913 PDJQ: MLS support (DCR A567.00) rollup 00104006
****END OF SPECIFICATIONS*********************************************/ 00105006
*% /*                                                                   00106006
.P0      ANOP                                                           00107006
         AIF   ('&ZCBPRINT' EQ 'NO').P1                                 00108006
         AIF   ('&LIST' EQ 'YES').P2                                    00109006
.P1      ANOP                                                           00110006
         PUSH  PRINT                                                    00111006
         PRINT OFF                                                      00112006
.P2      ANOP                                                           00113006
         AIF   ('&POE' EQ 'NO').L0002                                   00114006
         AIF   ('&DSECT' EQ 'YES').L0003                                00115006
         AIF   ('&POE' NE 'YES').L0002                                  00116006
POE      DS    0D                                                       00117006
         AGO   .L0004                                                   00118006
.L0003   ANOP                                                           00119006
POE      DSECT                                                          00120006
.L0004   ANOP                                                           00121006
POEVER1  DS    0CL24                                                    00122006
POEOPTIONS DS  F         +00 Options for POE                            00123006
POEENTRYTYPE DS F        +04 Point Of Entry Type                        00124006
POEENTRYLEN DS F         +08 Point Of Entry Length                      00125006
         DS    CL4       +0C Reserved                                   00126006
POEENTRYPTR64 DS 0CL8    +10 64 Address of Port of Entry                00127006
         DS    CL4       +10 Padding                                    00128006
POEENTRYPTR DS A         +14 Address of Point Of Entry                  00129006
POEVER2  DS    0CL96                                                    00130006
POEATTRIBUTES DS 0CL96   __poe() port of entry info                     00131006
POEPEERIPADDR DS 0CL16   Peer IP Address                                00132006
POEPEERIPV6PREFIX DS CL12                                               00133006
POEPEERIPV4ADDR DS F                                                    00134006
POETERMID DS   CL8       TERMINAL Profile Name                          00135006
POELABEL DS    CL8       Security Label of poe                          00136006
POEPROFILE DS  CL64      SERVAUTH Profile Name                          00137006
POE#LEN  EQU   24        Length of POE                                  00138006
POE#LENV2 EQU  120       Length of POE                                  00139006
POE#ENTRYSOCKET EQU 1    Entry is a file descriptor for a socket file   00140006
POE#ENTRYSOCKETLEN EQU 4 Length of file descriptor of a socket file     00141006
POE#ENTRYFILE EQU 2      Entry is a file descriptor for a non-socket   *00142006
                         file                                           00143006
POE#ENTRYFILELEN EQU 4   Length of file descriptor for a non-socket    *00144006
                         file                                           00145006
*                                                                       00146006
*     Scope Options for POE                                             00147006
*                                                                       00148006
*                                                                       00149006
POE#SCOPETHREAD EQU 1    Thread scope                                   00150006
POE#SCOPEPROCESS EQU 2   Process scope                                  00151006
POE#SCOPESOCKET EQU 4    Socket scope (only valid for read request)     00152006
*                                                                       00153006
*     Action Options for POE                                            00154006
*                                                                       00155006
*                                                                       00156006
POE#ACTIONREAD EQU 8     Read POE                                       00157006
POE#ACTIONWRITE EQU 16   Write POE                                      00158006
POE#ACTIONSETGET EQU 32  Set/Get POE                                    00159006
POE_LEN  EQU   *-POE                                                    00160006
.L0002   ANOP                                                           00161006
         AIF   ('&ZCBPRINT' EQ 'NO').P3                                 00162006
         AIF   ('&LIST' EQ 'YES').P4                                    00163006
.P3      ANOP                                                           00164006
         POP   PRINT                                                    00165006
.P4      ANOP                                                           00166006
.P_EXIT  ANOP                                                           00167006
         MEND                                                           00168006
**/ BPXYPOE_2:;                                                         00169006
* %BPXYPOE_INCLUDED = 'YES';                                            00170006
* %DCL ZCBPRINT CHAR EXT;                                               00171006
* %DEACTIVATE ZCBPRINT;                                                 00172006
* %DCL BPXYPOE_LIST CHAR EXT;                                           00173006
* %DEACTIVATE BPXYPOE_LIST;                                             00174006
* %IF BPXYPOE_LIST ^= 'NO' &                                            00175006
*    ZCBPRINT ^= 'NO' %THEN                                             00176006
*   %GOTO BPXYPOE_3;                                                    00177006
*   @LIST PUSH NOECHO;                                                  00178006
*   @LIST NOASSEMBLE NOECHO;                                            00179006
*   @LIST OFF C NOECHO;                                                 00180006
* %BPXYPOE_3:;                                                          00181006
*/* Start of PL/X Source                                             */ 00182006
* %IF POEBASE = '' %THEN                                                00183006
*   %DO;                                                                00184006
*     %POEBASE = 'Based(POEPtr)';                                       00185006
*   %END;                                                               00186006
* %IF TRANSLATE(POEBASE) = 'BASED(POEPTR)' %THEN                        00187006
*   %DO;                                                                00188006
*     DCL POEPtr Ptr(31);           /* Pointer to the POE            */ 00189006
*   %END;                                                               00190006
*%IF AsaxmacP64 = ''                                                    00191006
*   %Then %AsaxmacP64 = 'Char(8)';                                      00192006
*Dcl                                                                    00193006
* 1  POE        POEBASE,                                                00194006
*  2 POEVer1,                                                           00195006
*   3 POEOptions   Fixed(32),     /* +00 Options for POE             */ 00196006
*   3 POEEntryType Fixed(32),     /* +04 Point Of Entry Type         */ 00197006
*   3 POEEntryLen  Fixed(32),     /* +08 Point Of Entry Length       */ 00198006
*   3 *            Char(4),       /* +0C Reserved                    */ 00199006
*   3 POEEntryPtr64 AsaxmacP64 Bdy(Dword), /* +10 64 Address of Port of 00200006
*                                       Entry                       */  00201006
*    5 *            Char(4),      /* +10 Padding                     */ 00202006
*    5 POEEntryPtr  Ptr(31),      /* +14 Address of Point Of Entry   */ 00203006
*  2 POEVer2,                                                           00204006
*   3 POEAttributes,              /* __poe() port of entry info @E7A*/  00205006
*    5 POEPeerIpAddr Char(16) Bdy(Word), /* Peer IP Address  @E7A*/     00206006
*     7 POEPeerIPv6Prefix Char(12),                        /*@E7A*/     00207006
*     7 POEPeerIPv4Addr Fixed(32),                         /*@E7A*/     00208006
*    5 POETermid  Char(8),          /* TERMINAL Profile Name @E7A*/     00209006
*    5 POELabel   Char(8),          /* Security Label of poe @E7A*/     00210006
*    5 POEProfile Char(64),         /* SERVAUTH Profile Name @E7A*/     00211006
*   3 * Char(0) Bdy(Dword);       /*     Ensure POE ends on doubleword  00212006
*                                       boundary                     */ 00213006
*                                                                       00214006
*DCL                                                                    00215006
*  POE#Len    Fixed(32) Constant(Length(POEVer1)), /* Length of POE  */ 00216006
*  POE#LenV2  Fixed(32) Constant(Length(POE)), /* Length of POE      */ 00217006
*  POE#EntrySocket Fixed(32) Constant(1),/* Entry is a file descriptor  00218006
*                                           for a socket file        */ 00219006
*  POE#EntrySocketLen Fixed(32) Constant(4), /* Length of file          00220006
*                                        descriptor of a socket file */ 00221006
*  POE#EntryFile Fixed(32) Constant(2), /* Entry is a file descriptor   00222006
*                                          for a non-socket file     */ 00223006
*  POE#EntryFileLen Fixed(32) Constant(4), /* Length of file            00224006
*                                   descriptor for a non-socket file */ 00225006
*  /* Scope Options for POE                                      @D2A*/ 00226006
*  POE#ScopeThread  Fixed(32) Constant('00000001'x),/* Thread scope  */ 00227006
*  POE#ScopeProcess Fixed(32) Constant('00000002'x),/* Process scope */ 00228006
*  POE#ScopeSocket  Fixed(32) Constant('00000004'x),/* Socket scope     00229006
*                                                    (only valid for    00230006
*                                                     read request)  */ 00231006
*  /* Action Options for POE                                     @D2A*/ 00232006
*  POE#ActionRead Fixed(32) Constant('00000008'x), /* Read POE       */ 00233006
*  POE#ActionWrite Fixed(32) Constant('00000010'x), /* Write POE     */ 00234006
*  POE#ActionSetGet Fixed(32) Constant('00000020'x); /* Set/Get POE  */ 00235006
*/* End of PL/X Source                                               */ 00236006
* %IF BPXYPOE_LIST ^= 'NO' &                                            00237006
*    ZCBPRINT ^= 'NO' %THEN                                             00238006
*   %GOTO BPXYPOE_4;                                                    00239006
*   @LIST POP NOECHO;                                                   00240006
* %BPXYPOE_4:;                                                          00241006
* %END;                                                                 00242006
