*        %GOTO CIDPRO   ;         /* Bilingual header                   00050000
         MACRO                                                          00100000
         BPXYCID   &DSECT=YES,&LIST=YES                                 00150000
         GBLB  &CID411                                                  00200000
         AIF   (&CID411 EQ 1).E411                                      00250000
&CID411  SETB   1                                                       00300000
         AIF   ('&LIST' EQ 'YES').A411                                  00350000
         PUSH  PRINT  BPXYCID: OpenMVS ClientID Structure               00400000
         PRINT OFF                                                      00450000
         AGO   .A411                                                    00500000
*                                  */                                   00550000
*%CIDPRO : ;                                                            00600000
*/****START OF SPECIFICATIONS****************************************** 00650000
*                                                                       00700000
*    $MAC (BPXYCID) COMP(SCPX1) PROD(BPX):                              00750000
*                                                                       00800000
*01* MACRO NAME: BPXYCID                                                00850000
*                                                                       00900000
*01* DSECT NAME: N/A                                                    00950000
*                                                                       01000000
*01* DESCRIPTIVE NAME: OpenMVS ClientId structure control block         01050000
*                                                                       01100000
*02*   ACRONYM: CID                                                     01150000
**/                                                                     01200000
*/*01* PROPRIETARY STATEMENT=                                        */ 01250000
*/***PROPRIETARY_STATEMENT********************************************/ 01300000
*/*                                                                  */ 01350000
*/*                                                                  */ 01400000
*/* LICENSED MATERIALS - PROPERTY OF IBM                             */ 01450000
*/* THIS MACRO IS "RESTRICTED MATERIALS OF IBM"                      */ 01500000
*/* 5694-A01 (C) COPYRIGHT IBM CORP. 1997, 2003                      */ 01550000
*/*                                                                  */ 01600000
*/* STATUS= HBB7709                                                  */ 01650000
*/*                                                                  */ 01700000
*/***END_OF_PROPRIETARY_STATEMENT*************************************/ 01750000
*/*                                                                     01800000
*                                                                       01850000
*01* EXTERNAL CLASSIFICATION:  GUPI                                     01900000
*01* END OF EXTERNAL CLASSIFICATION:                                    01950000
*                                                                       02000000
*01* FUNCTION:                                                          02050000
*                                                                       02100000
*    This file contains the definitions of the clientid                 02150000
*    structure control block.                                           02200000
*    The clientid is a parameter on the following                       02250000
*    syscalls: givesocket                                               02300000
*              takesocket                                               02350000
*              getclientid                                              02400000
*                                                                       02450000
*01* METHOD OF ACCESS:                                                  02500000
*                                                                       02550000
*02*   PL/X:                                                            02600000
*                                                                       02650000
*        %INCLUDE SYSLIB(BPXYCID)                                       02700000
*        By default, the CID is based on CIDPTR. If                     02750000
*        other basing is desired, use %CIDBASE='BASED(XXXXXX)'.         02800000
*        If %CIDBASE='BASED(CIDPTR)' is coded, a Declare for            02850000
*        CIDPTR is also generated.                                      02900000
*                                                                       02950000
*                                                                       03000000
*02*   ASM:                                                             03050000
*                                                                       03100000
*        None                                                           03150000
*                                                                       03200000
*01* SIZE: Release dependent.  Refer to the mapping.                    03250000
*                                                                       03300000
*01* POINTED TO BY: Input parameter                                     03350000
*                                                                       03400000
*01* CREATED BY:    caller                                              03450000
*                                                                       03500000
*01* DELETED BY:    caller                                              03550000
*                                                                       03600000
*01* STORAGE ATTRIBUTES:                                                03650000
*02*   SUBPOOL:                                                         03700000
*02*   KEY:                                                             03750000
*02*   RESIDENCY:                                                       03800000
*                                                                       03850000
*01* FREQUENCY:                                                         03900000
*                                                                       03950000
*01* SERIALIZATION: N/A                                                 04000000
*                                                                       04050000
*01* DEPENDENCIES: None                                                 04100000
*                                                                       04150000
*01* NOTES: None                                                        04200000
*                                                                       04250000
*01* COMPONENT: OpenMVS (SCPX1)                                         04300000
*                                                                       04350000
*01* DISTRIBUTION LIBRARY:  AMACLIB                                     04400000
*                                                                       04450000
*01* EYE-CATCHER: None - this is the interface block from the user.     04500000
*02*   OFFSET:  N/A                                                     04550000
*02*   LENGTH:  N/A                                                     04600000
*                                                                       04650000
*01* CHANGE-ACTIVITY:                                                   04700000
*                                                                       04750000
*  $D0=DSPA146  HOM1150 960205 PDSK: give/takesocket support (A146.03)  04800000
*  $P1=PVT0659  HBB6606 980318 PDSK: givesocket CId#Select option       04850000
*                                    (OW32028)                          04900000
*  $P2=PWK0258  HBB6608 980925 PDSK: End asm macro with ORG ,           04950000
*  $P3=PYN0220  HBB7708 020301 PDFO: Bilingual fixup                    05000000
*                                                                       05050000
****END OF SPECIFICATIONS*********************************************/ 05100000
*        %GOTO CIDPLX   ;         /* Bilingual header                   05150000
.A411    ANOP  ,                                                        05200000
*                                                                       05250000
*********************************************************************** 05300000
** BPXYCID: OpenMVS ClientId Structure                                * 05350000
** Used By: Sockets LFS                                               * 05400000
*********************************************************************** 05450000
*                                                                       05500000
         AIF   ('&DSECT' EQ 'NO').B411                                  05550000
CID                  DSECT ,          ClientId structure                05600000
         AGO   .C411                                                    05650000
.B411    ANOP  ,                                                        05700000
CID                  DS    0D                                           05750000
.C411    ANOP  ,                                                        05800000
CIDBEGIN             DS    0D                                           05850000
*                                                                       05900000
CIDDOMAIN            DS    F          Domain                            05950000
CIDNAME              DS    CL8        Address space name                06000000
CIDTASK              DS    CL8        Subtask name                      06050000
CIDRESERVED          DS    CL20       Reserved                          06100000
*                                                                       06150000
CID#LENGTH           EQU   *-CID      Constant - Fixed length of CID    06200000
*                                                                       06250000
                     ORG  CIDNAME                                       06300000
CIDNAMEUPPER         DS   F           Binary zeroes                     06350000
CIDPID               DS   F           Process Id                        06400000
*                                                                       06450000
                     ORG  CIDRESERVED                                   06500000
CIDTYPE              DS   X           Type of request                   06550000
CIDSPECIFIC          DS   CL19                                          06600000
*                                                                       06650000
                     ORG  CIDSPECIFIC                                   06700000
                     DS   CL3                                           06750000
CIDSOCKTOKEN         DS   F           Returned token                    06800000
                     ORG  ,                                      @P2A   06850000
*                                                                       06900000
CID#CLOSE            EQU  1           Close socket                      06950000
CID#SELECT           EQU  2           Giver will do select       @P1A   07000000
*                                                                       07050000
*                                                                       07100000
*                                                                       07150000
** BPXYCID End                                                          07200000
         SPACE 3                                                        07250000
         AIF   ('&LIST' EQ 'YES').E411                                  07300000
         POP   PRINT                                                    07350000
.E411    ANOP  ,                                                        07400000
         MEND  ,                  Terminating PL/X comment           */ 07450000
*                                                                       07500000
*%CIDPLX : ;                                                            07550000
*%IF CIDBASE='' %THEN                                                   07600000
*  %DO;                                                                 07650000
*    %CIDBASE='Based(CIDPtr)';                                          07700000
*  %END;                                                                07750000
*%IF TRANSLATE(CIDBASE)='BASED(CIDPTR)'    %THEN                        07800000
*  %DO;                                                                 07850000
*    DCL CIDPtr Ptr(31);             /* Pointer to the CID           */ 07900000
*  %END;                                                                07950000
*                                                                       08000000
*Dcl                                                                    08050000
* 1 CId CIDBASE,                                                        08100000
*   3  CIdDomain         Fixed(32),           /* Domain              */ 08150000
*   3  CIdName           Char(8),             /* job identifier      */ 08200000
*   3  CIdTask           Char(8),             /* Task identifier     */ 08250000
*   3  CIdReserved       Char(20),            /* Reserved            */ 08300000
*      5 CIdType         Fixed(8),            /* Type of request     */ 08350000
*      5 CIdSpecific     Char(19);            /* Specific data       */ 08400000
*                                                                       08450000
*/********************************************************************/ 08500000
*/* Additional subfields for NAME                                    */ 08550000
*/********************************************************************/ 08600000
*Dcl 1 * Defined(CIdName),                    /* job identifier      */ 08650000
*      3 CIdNameUpper    Fixed(32),           /* binary zeroes       */ 08700000
*      3 CIdPID          Fixed(32);           /* process id          */ 08750000
*                                                                       08800000
*/********************************************************************/ 08850000
*/* Constants for CIdType field                                      */ 08900000
*/********************************************************************/ 08950000
*Dcl CId#Close      Fixed(8)  Constant(1);  /* close socket          */ 09000000
*Dcl CId#Select     Fixed(8)  Constant(2);  /* giver will select @P1A*/ 09050000
*                                                                       09100000
*/********************************************************************/ 09150000
*/* For CIdType = CId#Close                                          */ 09200000
*/* givesocket() returns a unique token for the socket descriptor    */ 09250000
*/* that was closed in the CIdSockToken field.                       */ 09300000
*/********************************************************************/ 09350000
*Dcl                                                                    09400000
* 1 *  Defined(CIdSpecific) Bdy(Byte),                                  09450000
*   3  *                 Char(3),                                       09500000
*   3  CIdSockToken      Fixed(32) Bdy(Word);   /* Returned token    */ 09550000
*                                                                       09600000
*/********************************************************************/ 09650000
*/* Constants                                                        */ 09700000
*/********************************************************************/ 09750000
*Dcl CId#Length Fixed(16) Constant(Length(CId)); /* Length of CId    */ 09800000
