*                                                                       00001000
* %DCL BPXYOHOW_INCLUDED CHAR EXT;                                      00002000
* %DEACTIVATE BPXYOHOW_INCLUDED;                                        00003000
* %IF BPXYOHOW_INCLUDED = '' %THEN                                      00004000
* %DO;                                                                  00005000
*/* Macro made bi-lingual on 23266. CBGEN compile date 23032         */ 00006000
*% /*                                                                   00007000
         MACRO                                                          00008000
         BPXYOHOW &DSECT=YES,&LIST=YES,&TITLE=YES,&O_HOW=YES            00009000
         GBLC  &BPXYOHOW_INCLUDED                                       00010000
         GBLC  &ZCBPRINT                                                00011000
&BPXYOHOW_INCLUDED SETC 'YES'                                           00012000
         AIF   ('&LIST' EQ 'NONE').P0                                   00013000
         AIF   ('&TITLE' EQ 'NO').P5                                    00014000
 TITLE   'BPXYOHOW  - Open_How structure and constants specified      '*00015000
                                                                        00016000
.P5      ANOP                                                           00017000
**/ ;                                                                   00018000
*/****START OF SPECIFICATIONS****************************************** 00019000
*                                                                       00020000
*    $MAC (BPXYOHOW) COMP(SCPX1) PROD(BPX):                             00021000
*                                                                       00022000
*01* MACRO NAME: BPXYOHOW                                               00023000
*                                                                       00024000
*01* DSECT NAME: O_HOW                                                  00025000
*                                                                       00026000
*01* DESCRIPTIVE NAME: Open_How structure and constants specified       00027000
*                      on openat2 system call                           00028000
*                                                                       00029000
*02*   ACRONYM: OHOW                                                    00030000
**/                                                                     00031000
*/*01* PROPRIETARY STATEMENT=                                        */ 00032000
*/***PROPRIETARY_STATEMENT********************************************/ 00033000
*/*                                                                  */ 00034000
*/*                                                                  */ 00035000
*/* LICENSED MATERIALS - PROPERTY OF IBM                             */ 00036000
*/* 5650-ZOS COPYRIGHT IBM CORP. 2022                                */ 00037000
*/*                                                                  */ 00038000
*/* STATUS= HBB77D0                                                  */ 00039000
*/*                                                                  */ 00040000
*/***END_OF_PROPRIETARY_STATEMENT*************************************/ 00041000
*/*                                                                     00042000
*                                                                       00043000
*01* EXTERNAL CLASSIFICATION:  PI                                       00044000
*01* END OF EXTERNAL CLASSIFICATION:                                    00045000
*                                                                       00046000
*01* FUNCTION:                                                          00047000
*                                                                       00048000
*      The OHOW defines the open_how structure used on the OPENAT2      00049000
*      system call.                                                     00050000
*                                                                       00051000
*01* METHOD OF ACCESS:                                                  00052000
*                                                                       00053000
*02*   PL/X:                                                            00054000
*                                                                       00055000
*        %INCLUDE SYSLIB(BPXYOHOW)                                      00056000
*        By default, the OHOW is based on O_HowPtr. If                  00057000
*        other basing is desired, use %OHOWBASE='BASED(XXXXXX)'.        00058000
*        If %OHOWBASE='BASED(O_HowPtr)' is coded, a Declare for         00059000
*        O_FhowPtr also generated.                                      00060000
*                                                                       00061000
*02*   ASM:                                                             00062000
*        With DSECT=NO, storage is allocated in line                    00063000
*        and addressability is provided thru that DSECT or CSECT.       00064000
*        With DSECT=YES, a DSECT is produced and "USING O_HOW,reg"      00065000
*        is required for addressability.  Here "reg" contains the       00066000
*        address of OHOW#LENGTH bytes of storage.                       00067000
*        The default is DSECT=YES.                                      00068000
*                                                                       00069000
*01* SIZE:                                                              00070000
*            O_HOW -- X'0018' bytes                                     00071000
*                                                                       00072000
*01* POINTED TO BY: O_HowPtr                                            00073000
*                                                                       00074000
*01* CREATED BY: Caller of system call                                  00075000
*                                                                       00076000
*01* DELETED BY: Caller of system call                                  00077000
*                                                                       00078000
*01* STORAGE ATTRIBUTES:                                                00079000
*02*   SUBPOOL/DATASPACE:  N/A                                          00080000
*02*   KEY:                N/A                                          00081000
*02*   RESIDENCY:          N/A                                          00082000
*                                                                       00083000
*01* FREQUENCY: Included with compile                                   00084000
*                                                                       00085000
*01* SERIALIZATION: N/A                                                 00086000
*                                                                       00087000
*01* DEPENDENCIES: None                                                 00088000
*                                                                       00089000
*01* NOTES: None                                                        00090000
*                                                                       00091000
*01* COMPONENT: z/OS UNIX (SCPX1)                                       00092000
*                                                                       00093000
*01* DISTRIBUTION LIBRARY:  AMACLIB                                     00094000
*                                                                       00095000
*01* EYE-CATCHER: None                                                  00096000
*                                                                       00097000
*01* CHANGE-ACTIVITY:                                                   00098000
*                                                                       00099000
* $L0=WI415237 HBB77D0 220217 TUCDMS: openat2 support                   00100000
*                                                                       00101000
****END OF SPECIFICATIONS*********************************************/ 00102000
*% /*                                                                   00103000
.P0      ANOP                                                           00104000
         AIF   ('&ZCBPRINT' EQ 'NO').P1                                 00105000
         AIF   ('&LIST' EQ 'YES').P2                                    00106000
.P1      ANOP                                                           00107000
         PUSH  PRINT                                                    00108000
         PRINT OFF                                                      00109000
.P2      ANOP                                                           00110000
         AIF   ('&O_HOW' EQ 'NO').L0002                                 00111000
         AIF   ('&DSECT' EQ 'YES').L0003                                00112000
         AIF   ('&O_HOW' NE 'YES').L0002                                00113000
O_HOW    DS    0D                                                       00114000
         AGO   .L0004                                                   00115000
.L0003   ANOP                                                           00116000
O_HOW    DSECT                                                          00117000
.L0004   ANOP                                                           00118000
OH_OFLAGS DS   FL8                                                      00119000
OH_OMODE DS    FL8                                                      00120000
OH_RESOLVE DS  BL8                                                      00121000
         ORG   OH_RESOLVE                                               00122000
OH_RESOLVE1 DS B         Reserved                                       00123000
OH_RESOLVE2 DS B         Reserved                                       00124000
OH_RESOLVE3 DS B         Reserved                                       00125000
OH_RESOLVE4 DS B         Reserved                                       00126000
OH_RESOLVE5 DS B         Reserved                                       00127000
OH_RESOLVE6 DS B         Reserved                                       00128000
OH_RESOLVE7 DS B         Reserved                                       00129000
OH_RESOLVE8 DS B         Resolve flags                                  00130000
*  Bit definitions:                                                     00131000
RESOLVE_CACHED EQU X'20'                                                00132000
RESOLVE_IN_ROOT EQU X'10'                                               00133000
RESOLVE_BENEATH EQU X'08'                                               00134000
RESOLVE_NO_SYMLINKS EQU X'04'                                           00135000
RESOLVE_NO_MAGICLINKS EQU X'02'                                         00136000
RESOLVE_NO_XDEV EQU X'01'                                               00137000
         ORG   O_HOW+24                                                 00138000
O_HOW_LEN EQU  *-O_HOW                                                  00139000
.L0002   ANOP                                                           00140000
         AIF   ('&ZCBPRINT' EQ 'NO').P3                                 00141000
         AIF   ('&LIST' EQ 'YES').P4                                    00142000
.P3      ANOP                                                           00143000
         POP   PRINT                                                    00144000
.P4      ANOP                                                           00145000
.P_EXIT  ANOP                                                           00146000
         MEND                                                           00147000
**/ ;                                                                   00148000
* %BPXYOHOW_INCLUDED = 'YES';                                           00149000
* %DCL ZCBPRINT CHAR EXT;                                               00150000
* %DEACTIVATE ZCBPRINT;                                                 00151000
* %DCL BPXYOHOW_LIST CHAR EXT;                                          00152000
* %DEACTIVATE BPXYOHOW_LIST;                                            00153000
* %IF BPXYOHOW_LIST = 'NO' !                                            00154000
*    ZCBPRINT = 'NO' %THEN                                              00155000
* %DO;                                                                  00156000
*   @LIST PUSH NOECHO;                                                  00157000
*   @LIST NOASSEMBLE NOECHO;                                            00158000
*   @LIST OFF C NOECHO;                                                 00159000
* %END;                                                                 00160000
*/* Start of PL/X Source                                             */ 00161000
* %DCL ASABEGIN_AMODE CHAR EXTERNAL;                                    00162000
* %DCL PTR_64 CHAR EXTERNAL;                                            00163000
*%IF OHOWBASE='' %THEN                                                  00164000
*  %DO;                                                                 00165000
*    %OHOWBASE='BASED(O_HowPtr)';                                       00166000
*  %END;                                                                00167000
* %IF OHOWBASE='BASED(O_HowPtr)' %THEN                                  00168000
*   %DO;                                                                00169000
*   %IF ASABEGIN_AMODE='64' ! PTR_64='YES'                              00170000
*    %THEN                                                              00171000
*    %DO;                                                               00172000
*      DCL O_HowPtr Ptr(64);         /* Pointer to the O_Flags       */ 00173000
*    %END;                                                              00174000
*   %ELSE                                                               00175000
*    %DO;                                                               00176000
*      DCL O_HowPtr Ptr(31);         /* Pointer to the O_Flags       */ 00177000
*    %END;                                                              00178000
*   %END;                                                               00179000
*DCL                                                                    00180000
* 1 O_How OHOWBASE,                                                     00181000
*   2 OH_OFLAGS    FIXED(64),                                           00182000
*   2 OH_OMODE     FIXED(64),                                           00183000
*   2 OH_RESOLVE   BIT(64),                                             00184000
*     3 OH_RESOLVE1 BIT(8),  /* Reserved */                             00185000
*     3 OH_RESOLVE2 BIT(8),  /* Reserved */                             00186000
*     3 OH_RESOLVE3 BIT(8),  /* Reserved */                             00187000
*     3 OH_RESOLVE4 BIT(8),  /* Reserved */                             00188000
*     3 OH_RESOLVE5 BIT(8),  /* Reserved */                             00189000
*     3 OH_RESOLVE6 BIT(8),  /* Reserved */                             00190000
*     3 OH_RESOLVE7 BIT(8),  /* Reserved */                             00191000
*     3 OH_RESOLVE8 BIT(8),  /* Resolve flags */                        00192000
*       5 *                     BIT(2),  /* Reserved */                 00193000
*       5 RESOLVE_CACHED        BIT(1),                                 00194000
*       5 RESOLVE_IN_ROOT       BIT(1),                                 00195000
*       5 RESOLVE_BENEATH       BIT(1),                                 00196000
*       5 RESOLVE_NO_SYMLINKS   BIT(1),                                 00197000
*       5 RESOLVE_NO_MAGICLINKS BIT(1),                                 00198000
*       5 RESOLVE_NO_XDEV       BIT(1);                                 00199000
*@LOGIC;                                                                00200000
*#PRAGMA TOOL=PADI.                                                     00201000
*#PADIDELETE.O_HOW_LEN                                                  00202000
*#EPRAGMA.                                                              00203000
*@ENDLOGIC;                                                             00204000
*/* End of PL/X Source                                               */ 00205000
* %IF BPXYOHOW_LIST = 'NO' !                                            00206000
*    ZCBPRINT = 'NO' %THEN                                              00207000
* %DO;                                                                  00208000
*   @LIST POP NOECHO;                                                   00209000
* %END;                                                                 00210000
* %END;                                                                 00211000
