*        %GOTO IOC6PRO  ;         /* Bilingual header                   00010000
         MACRO                                                          00020000
         BPXYIOC6  &DSECT=MEANINGLESS,&LIST=YES                         00030000
         GBLB  &IOC6411                                                 00040000
         GBLC  &SYSAM64       Variable set by SYSSTATE AMODE64=YES @P2A 00050000
         AIF   (&IOC6411 EQ 1).Z411                                     00060000
&IOC6411 SETB  1                                                        00070000
         AIF   ('&LIST' EQ 'YES').A411                                  00080000
         PUSH  PRINT  BPXYIOC6: Pre-Router IPV6 Structures              00090000
         PRINT OFF                                                      00100000
         AGO   .A411                                                    00110000
*                                  */                                   00120000
*%IOC6PRO : ;                                                           00130000
*/****START OF SPECIFICATIONS****************************************** 00140000
*                                                                       00150000
*    $MAC (BPXYIOC6 ) COMP(SCPX1) PROD(BPX):                            00160000
*                                                                       00170000
*01* MACRO NAME: BPXYIOC6                                               00180000
*                                                                       00190000
*01* DSECT NAME: N/A                                                    00200000
*                                                                       00210000
*01* DESCRIPTIVE NAME: Ioctl network mapping information for IPV6       00220000
*                                                                       00230000
*02*   ACRONYM: N/A                                                     00240000
**/                                                                     00250000
*/*01* PROPRIETARY STATEMENT=                                        */ 00260000
*/***PROPRIETARY_STATEMENT********************************************/ 00270000
*/*                                                                  */ 00280000
*/*                                                                  */ 00290000
*/* LICENSED MATERIALS - PROPERTY OF IBM                             */ 00300000
*/* 5694-A01 COPYRIGHT IBM CORP. 1993, 2010                          */ 00301000
*/*                                                                  */ 00320000
*/* STATUS= HBB7770                                                  */ 00321000
*/*                                                                  */ 00340000
*/***END_OF_PROPRIETARY_STATEMENT*************************************/ 00350000
*/*                                                                     00360000
*                                                                       00370000
*01* EXTERNAL CLASSIFICATION:  GUPI                                     00380000
*01* END OF EXTERNAL CLASSIFICATION:                                    00390000
*                                                                       00400000
*01* FUNCTION:                                                          00410000
*      Contains Constants and declarations for Tcp/Ip IOCTL function    00420000
*      calls for IPV6                                                   00430000
*                                                                       00440000
*                                                                       00450000
*01* METHOD OF ACCESS:                                                  00460000
*                                                                       00470000
*02*   PL/X:                                                            00480000
*        %INCLUDE SYSLIB(BPXYIOC6 )                                     00490000
*                                                                       00500000
*02*   ASM:                                                             00510000
*                                                                       00520000
*        None                                                           00530000
*                                                                       00540000
*01* SIZE: N/A                                                          00550000
*                                                                       00560000
*01* POINTED TO BY: N/A                                                 00570000
*                                                                       00580000
*01* CREATED BY: N/A                                                    00590000
*                                                                       00600000
*01* DELETED BY: N/A                                                    00610000
*                                                                       00620000
*01* STORAGE ATTRIBUTES:                                                00630000
*02*   SUBPOOL/DATASPACE:  N/A                                          00640000
*02*   KEY:                N/A                                          00650000
*02*   RESIDENCY:          N/A                                          00660000
*                                                                       00670000
*01* FREQUENCY: N/A                                                     00680000
*                                                                       00690000
*01* SERIALIZATION: N/A                                                 00700000
*                                                                       00710000
*01* DEPENDENCIES: None                                                 00720000
*                                                                       00730000
*01* NOTES:                                                             00740000
*                                                                       00750000
*                                                                       00760000
*01* COMPONENT: OpenMVS (SCPX1)                                         00770000
*                                                                       00780000
*01* DISTRIBUTION LIBRARY:  APLSLIB                                     00790000
*                                                                       00800000
*01* EYE-CATCHER: Rmsg                                                  00810000
*02*   OFFSET:  0                                                       00820000
*02*   LENGTH:  4                                                       00830000
*                                                                       00840000
*01* CHANGE-ACTIVITY:                                                   00850000
* $D0=DYVA574  HBB7707 010523 PDNU: IPV6 Initialization (A574.01)       00860000
* $P0=PYV0438  HBB7707 020223 PDNU: IFCONF6 to HOMEIF6                  00870000
* $P1=PYN0220  HBB7708 020301 PDFO: Bilingual fixup                     00880000
* $xx=TYN1055  HBB7708 020415 PDNU: Rollup IPV6                         00890000
* $xx=TJK0336  HBB7709 020430 PDNU: Rollup IPV6                         00900000
* $P2=PJK0634  HBB7709 030715 PDNU: SIOCGHOMEIF6 64-Bit version         00910000
* $D1=DDEA845  HBB7730 040715 PDNU: Route Precedence                    00920000
* $D2=DDEA846  HBB7730 050320 PD2R: Route Modification                  00930000
* $P3=ME04521  HBB7730 050920 PD2R: Add Loopback Interface flag         00940000
* $D3=OA13217  HBB7707 050816 PDJT: SiocGifConf6                SPE     00950000
* $P4=ME06737  HBB7740 060831 PD2R: Fixed external classification       00960000
* $P5=ME11959  HBB7750 070910 PD2R: Add GRT6RTMTU - OA22044             00970000
* $P6=ME17232  HBB7770 090922 PD2R: Add two IPv6 Flags - SE IP addr.    00971000
*  xx=ME17548  HBB7770 091026 PD2R: Remove ME17232 Updates (@P6)        00972000
* $D4=ME17708  HBB7770 091106 PD2R: Add DVIPA flag - B864.00            00973002
*                                                                       00980000
****END OF SPECIFICATIONS*********************************************/ 00990000
*        %GOTO  IOC6PLX ;      /* Bilingual header                      01000000
**********************************************************************  01010000
* NetConfHdr Structure                                               *  01020000
**********************************************************************  01030000
*                                                                       01040000
.A411    ANOP  ,                                                        01050000
         AIF   ('&DSECT' EQ 'NO').B411                                  01060000
NETCONFHDR           DSECT ,                                            01070000
         AGO   .C411                                                    01080000
.B411    ANOP  ,                                                        01090000
NETCONFHDR           DS    0F                                           01100000
.C411    ANOP  ,                                                        01110000
         AIF   ('&SYSAM64' EQ 'YES').AM64A                         @P2A 01120000
* ------------- 32-Bit Version                                     @P2A 01130000
NCHEYECATCHER        DS    CL4    Eye catcher                           01140000
NCHIOCTL             DS    F      Ioctl being processed (RAS)           01150000
NCHBUFFERLENGTH      DS    F      Buffer Length                         01160000
NCHBUFFERPTR         DS    F      Buffer Pointer                        01170000
NCHNUMENTRYRET       DS    F      Number of HomeIF returned via        *01180000
                                       SIOCGHOMEIF6 or the number of   *01190000
                                       GRT6RtEntry's returned via      *01200000
                                       SIOCGRT6TABLE.                   01210000
         AGO   .AM64B                                              @P2A 01220000
.AM64A   ANOP  ,                                                   @P2A 01230000
* ------------- 64-Bit Version                                     @P2A 01240000
NCHEYECATCHER        DS    CL4    Eye catcher                      @P2A 01250000
NCHIOCTL             DS    F      Ioctl being processed (RAS)      @P2A 01260000
NCHNUMENTRYRET       DS    F      Number of HomeIF returned via    @P2A*01270000
                                       SIOCGHOMEIF6 or number of   @P2A*01280000
                                       GRT6RtEntry's returned via  @P2A*01290000
                                       SIOCGRT6TABLE.              @P2A 01300000
NCHBUFFERLENGTH      DS    F      Buffer Length                    @P2A 01310000
NCHBUFFERPTR         DS    D      64-bit Buffer Pointer            @P2A 01320000
.AM64B   ANOP  ,                                                   @P2A 01330000
NETCONFHDR#LENGTH    EQU   *-NETCONFHDR   Length of NETCONFHDR          01340000
*                                                                       01350000
**********************************************************************  01360000
* HomeIf Structure                                                   *  01370000
**********************************************************************  01380000
*                                                                       01390000
         AIF   ('&DSECT' EQ 'NO').D411                                  01400000
HOMEIF               DSECT ,      HomeIf structure                      01410000
         AGO   .E411                                                    01420000
.D411    ANOP  ,                                                        01430000
HOMEIF               DS    0F     HomeIf Structure                      01440000
.E411    ANOP  ,                                                        01450000
HomeIfAddress        DS    CL16   Home Interface Address                01460000
*                                                                       01470000
HomeIf#LENGTH        EQU   *-HOMEIF   Length of HOMEIF                  01480000
*                                                                       01490000
**********************************************************************  01500000
* GRT6RtEntry Structure                                              *  01510000
**********************************************************************  01520000
*                                                                       01530000
         AIF   ('&DSECT' EQ 'NO').F411                                  01540000
GRT6RTENTRY          DSECT ,      GRT6RtEntry Structure                 01550000
         AGO   .G411                                                    01560000
.F411    ANOP  ,                                                        01570000
GRT6RTENTRY          DS    0F     GRT6RtEntry Structure                 01580000
.G411    ANOP  ,                                                        01590000
*                                                                       01600000
GRT6DESTINATION      DS    CL16 Destination IP Address                  01610000
GRT6GATEWAY          DS    CL16 First HOP on the trip if going through *01620000
                                 a gateway                              01630000
GRT6DESTPREFIXLEN    DS    F    Destination's Prefix Length which is a *01640000
                                 decimal value that specifies how many *01650000
                                 of the leftmost contiguous bits of the*01660000
                                 address comprise the prefix            01670000
GRT6RTMETRIC         DS    F    Metric - hop count. Currently Tcp/Ip   *01680000
                                 returns 1 for indirect routes and 0   *01690000
                                 for direct routes. If route is from   *01700000
                                 routing daemon, metric is whatever    *01710000
                                 routing daemon set it to.              01720000
GRT6RTFLAGS          DS    F    IPV6 Route Flags.  Mapped by            01730000
*                               IPV6RtFlags structure            @P5C   01740000
*                                                                       01750000
GRT6RTENTRY#LENGTH   EQU   *-GRT6RTENTRY   Length of GRT6RTENTRY        01760000
*                                                                       01770000
**********************************************************************  01780000
* RT6Entry Structure                                                 *  01790000
**********************************************************************  01800000
*                                                                       01810000
         AIF   ('&DSECT' EQ 'NO').H411                                  01820000
RT6ENTRY          DSECT ,         Rt6Entry Structure                    01830000
         AGO   .I411                                                    01840000
.H411    ANOP  ,                                                        01850000
RT6ENTRY             DS    0F     Rt6Entry Structure                    01860000
.I411    ANOP  ,                                                        01870000
*                                                                       01880000
RT6DESTINATION       DS    CL28   Destination IP address (in an IPV6   *01890000
                                    sockaddr structure)                 01900000
RT6GATEWAY           DS    CL28   First HOP on the trip if going       *01910000
                                    through a gateway (in an IPV6      *01920000
                                    sockaddr structure)                 01930000
RT6DESTPREFIXLEN     DS    F      Destination's Prefix Length,         *01940000
                                      which is a decimal value         *01950000
                                      that specifies how many of       *01960000
                                      the leftmost contiguous          *01970000
                                      bits of the address              *01980000
                                      comprise the prefix.              01990000
RT6METRIC            DS    F      Metric - hop count                   *02000000
                                     Currently Tcp/IP returns          *02010000
                                      1 for indirect route and         *02020000
                                      0 for direct route.              *02030000
                                     If route is from routing          *02040000
                                     daemon, metric is whatever        *02050000
                                     routing daemon set it to.          02060000
RT6FLAGS             DS    F      IPV6 Route Flags.                     02070000
*                                                                       02080000
RT6ENTRY#LENGTH      EQU   *-RT6ENTRY   Length of RT6ENTRY              02090000
*                                                                       02100000
**********************************************************************  02110000
* GRT6RtEntryV2 Structure                                            *  02120000
**********************************************************************  02130000
*                                                                       02140000
         AIF   ('&DSECT' EQ 'NO').J411                                  02150000
GRT6RTENTRYV2        DSECT ,      New Route Entry used with DCR A846 - *02160000
                                  Route Modification                    02170000
         AGO   .K411                                                    02180000
.J411    ANOP  ,                                                        02190000
GRT6RTENTRYV2        DS    0F     New Route Entry used with DCR A846 - *02200000
                                  Modification                          02210000
.K411    ANOP  ,                                                        02220000
*                                                                       02230000
GRT6OLDRTENTRY       DS    CL44   Old GRT6 Route Entry                  02240000
GRT6RTHOMEIFIDX      DS    F      Route's Home Interface Idx            02250000
GRT6RTIFINDEX        DS    F      Route's Interface Index        @P5A   02260000
GRT6RTMTU            DS    H      Route's MTU Value              @P5A   02270000
                     DS    H      Reserved                       @P5C   02280000
                     DS    F      Reserved                       @P5C   02290000
                     DS    F      Reserved                       @P5C   02300000
*                                                                       02310000
GRT6RTENTRYV2#LENGTH   EQU   *-GRT6RTENTRYV2   Length of GRT6RTENTRYV2  02320000
*                                                                       02330000
**********************************************************************  02340000
* RT6EntryV2 Structure                                               *  02350000
**********************************************************************  02360000
*                                                                       02370000
         AIF   ('&DSECT' EQ 'NO').L411                                  02380000
RT6ENTRYV2           DSECT ,      New Route Entry Used with A846       *02390000
                                  MSADDRT6V2/MSDELRT6V2 IOCTLs          02400000
         AGO   .M411                                                    02410000
.L411    ANOP  ,                                                        02420000
RT6ENTRYV2           DS    0F     New Route Entry Used with A846       *02430000
                                  MSADDRT6V2/MSDELRT6V2 IOCTLs          02440000
.M411    ANOP  ,                                                        02450000
*                                                                       02460000
RT6OLDENTRY          DS    CL68   Old Route Entry used before A846     *02470000
                                  with SIOCMSADDRT6/SIOCMSDELRT6 IOCTL  02480000
RT6RTHOMEIFIDX       DS    F      Route's Home Interface Idx            02490000
                     DS    F      Reserved                              02500000
                     DS    F      Reserved                              02510000
                     DS    F      Reserved                              02520000
                     DS    F      Reserved                              02530000
*                                                                       02540000
RT6ENTRYV2#LENGTH    EQU   *-RT6ENTRYV2    Length of RT6ENTRYV2         02550000
*                                                                       02560000
**********************************************************************  02570000
* IPV6RtFlags Structure                                              *  02580000
**********************************************************************  02590000
*                                                                       02600000
         AIF   ('&DSECT' EQ 'NO').N411                                  02610000
IPV6RTFLAGS       DSECT ,         IPV6RtFlags Structure                 02620000
         AGO   .O411                                                    02630000
.N411    ANOP  ,                                                        02640000
IPV6RTFLAGS          DS    0F     IPV6RtFlags Structure                 02650000
.O411    ANOP  ,                                                        02660000
*                                                                       02670000
IPV6FLGROUTETYPE     DS    XL1   Route Type                    @D1C     02680000
IPV6FLGBYTE2         DS    XL1    Reserved                              02690000
IPV6FLGBYTE3         DS    XL1    Reserved                              02700000
IPV6FLGBYTE4         DS    XL1    FLAGS:                                02710000
*                    EQU   X'80'  Reserved                              02720000
IPV6BITDVIPA         EQU   X'40'  1 = DVIPA interface            @D4A   02730002
IPV6BITV3            EQU   X'20'  1 = Version 3 fields included: @P5A   02740000
*                                       - interface index               02750000
*                                       - MTU value                     02760000
IPV6BITLOOPBACK      EQU   X'10'  1 = Loopback Interface                02770000
IPV6BITHOME          EQU   X'08'  1 = Home interface                    02780000
IPV6BITHOST          EQU   X'04'  1 = Host Route. 0 = Network Route     02790000
IPV6BITGATE          EQU   X'02'  1 = Gateway                           02800000
IPV6BITRTUP          EQU   X'01'  1 = Route is active                   02810000
*                                                                       02820000
* *------------------------------------------------------------------*  02830000
* * SiocGifConf6 - Get IPv6 Interface Configuration.             @D3A*  02840000
* *                                                                  *  02850000
* *  Net_IfConf6Header is passed as the argument of the ioctl and    *  02860000
* *  is returned with the number of entries and entry length of the  *  02870000
* *  Net_IfConf6Entry structs that were written to the output buffer.*  02880000
* *                                                                  *  02890000
* *  If Buflen=0=Buffer a Query function is performed and the        *  02900000
* *  header is returned with: (1) the maximum supported version,     *  02910000
* *  (2) the total number of entries that would be output and        *  02920000
* *  (3) the length of each individual entry.                        *  02930000
* *                                                                  *  02940000
* *  If a call to get information fails with RC=ERANGE or with       *  02950000
* *  (RC=EINVAL & Nif6h_Version is changed) the call is converted    *  02960000
* *  into a Query function and the content of the output buffer      *  02970000
* *  is unpredictable.                                               *  02980000
* *                                                                  *  02990000
* *  For information on the data returned in this structure refer    *  03000000
* *  to the z/OS Communication Server's IP Configuration Guide and   *  03010000
* *  IPv6 Network and Application Design Guide.                      *  03020000
* *                                                                  *  03030000
* *------------------------------------------------------------------*  03040000
         AIF   ('&DSECT' EQ 'NO').L0004                                 03050000
NET_IFCONF6HEADER DSECT   Header                                 @D3A   03060000
         AGO   .L0005                                                   03070000
.L0004   ANOP                                                           03080000
NET_IFCONF6HEADER DS 0F  Header                                         03090000
.L0005   ANOP                                                           03100000
NIF6H_VERSION DS F       Input for Get IfConf6 Output for Query         03110000
NIF6H_ENTRIES DS F       Output: number of entries returned in output  *03120000
                         buffer                                         03130000
NIF6H_ENTRYLEN DS F      Output: length of an entry                     03140000
NIF6H_BUFLEN DS F        Input: length of buffer                        03150000
NIF6H_BUFFER64 DS 0CL8   Input: Amode(64) Buffer ptr                    03160000
NIF6H_BUFFER64H DS F                                                    03170000
NIF6H_BUFFER DS A        Input: Amode(31) Buffer ptr to output buffer  *03180000
                         that will be filled with an array of          *03190000
                         Net_IfConf6Entrys.                             03200000
NET_IFCONF6HEADER_LEN EQU *-NET_IFCONF6HEADER                           03210000
*                                                                       03220000
         AIF   ('&DSECT' EQ 'NO').L0007                                 03230000
NET_IFCONF6ENTRY DSECT   Entry                                   @D3A   03240000
         AGO   .L0008                                                   03250000
.L0007   ANOP                                                           03260000
NET_IFCONF6ENTRY DS 0F   Entry                                          03270000
.L0008   ANOP                                                           03280000
NIF6E_NAME DS  CL16      x00 interface name (blank padded - no null)    03290000
NIF6E_STACKNAME DS CL8   x10 tcpip stack name (blank padded - no null)  03300000
NIF6E_ADDR DS  CL28      x18 Sock_Inet6_SockAddr of the interface       03310000
NIF6E_ROUTEMETRIC DS F   x34 route metric                               03320000
NIF6E_PREFIXLEN DS H     x38 routing prefix length                      03330000
NIF6E_PREFIXORIGIN DS X  x3A prefix origin, see below                   03340000
NIF6E_STATUS DS X        x3B status, see below                          03350000
NIF6E_FLAGS DS 0BL4      x3C Flags:                                     03360000
NIF6E_FLAGS1 DS B                                                       03370000
NIF6E_FLAGS2 DS B                                                       03380000
NIF6E_FLAGS3 DS 0B                                                      03390000
NIF6E_VIRTUAL EQU X'40'                                                 03400000
NIF6E_MULTIPOINT EQU X'08'                                              03410000
NIF6E_MULTICASTCAPABLE EQU X'04'                                        03420000
         ORG   NIF6E_FLAGS3+1                                           03430000
NIF6E_FLAGS4 DS 0B                                                      03440000
NIF6E_POINT2POINT EQU X'10'                                             03450000
NIF6E_LOOPBACK EQU X'08'                                                03460000
NIF6E_ONLINK EQU X'01'                                                  03470000
         ORG   NIF6E_FLAGS+4                                            03480000
NIF6E_MTU DS   F         x40 mtu                                        03490000
*                                                                       03500000
*    *****************************************************************  03510000
*    *                                                               *  03520000
*    * Constants for nif6h_version                               @D3A   03530000
*    *                                                               *  03540000
*    *****************************************************************  03550000
*                                                                       03560000
*                                                                       03570000
NIF6H#VER EQU  1         Current Version                                03580000
NIF6H#VER1 EQU 1         Initial Version                                03590000
*                                                                       03600000
*    *****************************************************************  03610000
*    *                                                               *  03620000
*    * Constants for nif6e_prefixorigin                          @D3A   03630000
*    *                                                               *  03640000
*    *****************************************************************  03650000
*                                                                       03660000
*                                                                       03670000
NIF6H#WELLKNOWN EQU 1                                                   03680000
NIF6H#MANUAL EQU 2                                                      03690000
NIF6H#RTRADV EQU 3                                                      03700000
NIF6H#OTHER EQU 8                                                       03710000
*                                                                       03720000
*    *****************************************************************  03730000
*    *                                                               *  03740000
*    * Constants for nif6e_status                                @D3A   03750000
*    *                                                               *  03760000
*    *****************************************************************  03770000
*                                                                       03780000
*                                                                       03790000
NIF6H#PREFERRED EQU 1                                                   03800000
NIF6H#DEPRECATED EQU 2                                                  03810000
NIF6H#INVALID EQU 3                                                     03820000
NIF6H#INACCESSIBLE EQU 4                                                03830000
NIF6H#UNKNOWN EQU 5                                                     03840000
NIF6H#TENTATIVE EQU 6                                                   03850000
NIF6H#DUPLICATE EQU 7                                                   03860000
NET_IFCONF6ENTRY_LEN EQU *-NET_IFCONF6ENTRY                             03870000
*                                      End SiocGifConf6 -------- @D3A   03880000
*                                                                       03890000
* ********************************************************************  03900000
* *                                                                  *  03910000
* *   Constants                                                      *  03920000
* *                                                                  *  03930000
* ********************************************************************  03940000
*                                                                       03950000
*                                                                       03960000
IOC6_#HOMEIFPREFIXLEN EQU 128 The prefix length for a home interface   *03970000
                         address returned on the SIOCGHOMEIF6 IOCTL.    03980000
IOC6_NCH#EYE EQU C'6NCH' IPV6 Network Configuration Header EyeCatcher.  03990000
IOC6_NCH64#EYE EQU C'6N64' IPV6 NetConfHdr EyeCatcher 64-BIT            04000000
*                                                                       04010000
* ********************************************************************  04020000
* *                                                                  *  04030000
* * Maximum hop count for the Metric fields:                         *  04040000
* *    GRT6RtMetric                                                  *  04050000
* *    Rt6Metric                                                     *  04060000
* *                                                                  *  04070000
* ********************************************************************  04080000
*                                                                       04090000
*                                                                       04100000
IOC6_#MAXHOPMETRIC EQU 16                                               04110000
*                                                                       04120000
* ********************************************************************  04130000
* *                                                                  *  04140000
* *   Constants used for size of control areas                       *  04150000
* *                                                                  *  04160000
* ********************************************************************  04170000
*                                                                       04180000
*                                                                       04190000
IOC6_#MAXROUTES EQU 600                                                 04200000
IOC6_#GRT6ROUTELEN EQU 44                                               04210000
*                                                                       04220000
*    *****************************************************************  04230000
*     Initial buffer size for SIOCGHOMEIF6 and SIOCGRT6TABLE.           04240000
*    *****************************************************************  04250000
*                                                                       04260000
*                                                                       04270000
IOC6_#MAXGRT6LEN EQU 26400                                              04280000
IOC6_#NETCONFHDRLEN EQU 20                                              04290000
IOC6_#GRT6V2ROUTELEN EQU 64                                             04300000
IOC6_#MAXGRT6V2LEN EQU 38400                                            04310000
*                                                                       04320000
** BPXYIOC6 End                                                         04330000
         SPACE 3                                                        04340000
         AIF   ('&LIST' EQ 'YES').Z411                                  04350000
         POP   PRINT                                                    04360000
.Z411    ANOP  ,                                                        04370000
         MEND  ,                  Terminating PL/X comment           */ 04380000
*%IOC6PLX : ;                                                           04390000
*                                                                       04400000
*                                                                       04410000
*/********************************************************************/ 04420000
*/* The following code was requested by Raleigh                      */ 04430000
*/********************************************************************/ 04440000
*%dcl bpxyioc6_inc fixed external;                                      04450000
*%If bpxyioc6_inc = 0                                                   04460000
*  %Then                                                                04470000
*   %Do;                                                                04480000
*    %bpxyioc6_inc=1;                                                   04490000
*                                                                       04500000
*                                                                       04510000
*/********************************************************************/ 04520000
*/*                                                                  */ 04530000
*/*  Internet Protocol address type                                  */ 04540000
*/*                                                                  */ 04550000
*/********************************************************************/ 04560000
*Declare                                                                04570000
* IPV6Addr Type Char(16);            /* IPV6 IP Address Type         */ 04580000
*                                                                       04590000
*/********************************************************************/ 04600000
*/*                                                                  */ 04610000
*/* The network configuration header is used with the SIOCGHOMEIF6   */ 04620000
*/* and SIOCGRT6TABLE IOCTLs.                                        */ 04630000
*/*                                                                  */ 04640000
*/* When the USS Pre-Router issues the SIOCGHOMEIF6 IOCTL, it passes */ 04650000
*/* the NetConfHdr filled in with the EyeCatcher, IOCTL, buffer      */ 04660000
*/* length and buffer ptr. The stack returns HomeIf records in       */ 04670000
*/* the supplied buffer and sets NchNumEntryRet with the number      */ 04680000
*/* HomeIf records being returned.                                   */ 04690000
*/*                                                                  */ 04700000
*/* When the USS Pre-Router issues the SIOCGRT6TABLE IOCTL, it passes*/ 04710000
*/* the NetConfHdr filled in with the EyeCacther, IOCTL, buffer      */ 04720000
*/* length and buffer ptr. The stack returns GRT6RtEntry records     */ 04730000
*/* in the supplied buffer and sets NchNumEntryRet with the          */ 04740000
*/* number of GRT6RtEntry records being returned.                    */ 04750000
*/*                                                                  */ 04760000
*/*                                                                  */ 04770000
*/********************************************************************/ 04780000
*Declare                                                                04790000
* 1 NetConfHdr Bdy(Word) Based, /* Network Configuration Header      */ 04800000
*  3 NchEyeCatcher Char(4),     /* Eye Catcher '6NCH'                */ 04810000
*  3 NchIOCTL Fixed(32),        /* The IOCTL being processed            04820000
*                                       with this instance of the       04830000
*                                       NetConfHdr. (RAS item)       */ 04840000
*  3 NchBufferLength Fixed(31), /* Buffer Length                     */ 04850000
*  3 NchBufferPtr    Ptr(31),   /* Buffer Pointer                    */ 04860000
*  3 NchNumEntryRet Fixed(31);  /* Number of HomeIF returned via        04870000
*                                       SIOCGHOMEIF6 or the number of   04880000
*                                       GRT6RtEntry's returned via      04890000
*                                       SIOCGRT6TABLE.               */ 04900000
*/*--------------------------------------------------------------@P2A*/ 04910000
*/* 64-Bit version of NetConfHdr                                     */ 04920000
*/*--------------------------------------------------------------@P2A*/ 04930000
*%IF AsaxmacP64 = ''                                           /*@P2A*/ 04940000
*   %Then %AsaxmacP64 = 'Char(8)';                             /*@P2A*/ 04950000
*Declare                                                                04960000
* 1 NetConfHdr64 Bdy(DWord) Based,/* 64-Bit NetConfHdr           @P2A*/ 04970000
*  3 Nch64EyeCatcher Char(4),     /* Eye Catcher '6N64'          @P2A*/ 04980000
*  3 Nch64IOCTL Fixed(32),        /* The IOCTL being processed          04990000
*                                       with this instance of the       05000000
*                                       NetConfHdr. (RAS item)   @P2A*/ 05010000
*  3 Nch64NumEntryRet Fixed(31),  /* Number of HomeIF returned via      05020000
*                                       SIOCGHOMEIF6 or the number of   05030000
*                                       GRT6RtEntry's returned via      05040000
*                                       SIOCGRT6TABLE.           @P2A*/ 05050000
*  3 Nch64BufferLength Fixed(31), /* Buffer Length               @P2A*/ 05060000
*  3 Nch64BufferPtr AsaxmacP64;   /* 64-Bit Buffer Pointer       @P2A*/ 05070000
*/********************************************************************/ 05080000
*/*                                                                  */ 05090000
*/*The mapping for the home interface record that is returned via the*/ 05100000
*/*SIOCGHOMEIF6 IOCTL.                                               */ 05110000
*/*                                                                  */ 05120000
*/********************************************************************/ 05130000
*Declare                                                                05140000
* 1 HomeIf Bdy(Word) Based,              /* Home Interface Structure */ 05150000
*  3 HomeIfAddress(*) Isa(IPV6Addr);     /* Home Interface Address   */ 05160000
*                                                                       05170000
*/********************************************************************/ 05180000
*/*                                                                  */ 05190000
*/* The mapping for the Pre-Router Route Entry that is returned by   */ 05200000
*/* the stack via SIOCGRT6TABLE.                                     */ 05210000
*/*                                                                  */ 05220000
*/* NOTE: The only difference between this route entry and the       */ 05230000
*/*       route entry used with the SIOCMSADDRT6 and SIOCMSDELRT6    */ 05240000
*/*       IOCTLs is that "destination" and "gateway" are IP addresses*/ 05250000
*/*       not SockAddr Structures. The reason for that is because    */ 05260000
*/*       the Pre-Router only needs the IP address so additional     */ 05270000
*/*       buffer storage should not be obtained to hold SockAddr     */ 05280000
*/*       fields that are not used.                                  */ 05290000
*/*                                                                  */ 05300000
*/*       The reasons why a SockAddr structure was used with the     */ 05310000
*/*       SIOCMSADDRT6 and SIOCMSDELRT6 route entry is:              */ 05320000
*/*        (1) This interface may be externalized via SIOCADDRT6 and */ 05330000
*/*            SIOCDELRT6 which will use a Sockaddr structure between*/ 05340000
*/*            routing daemons and the stack.                        */ 05350000
*/*        (2) If the Pre-Router "intercepts" these IOCTLs, it could */ 05360000
*/*            process them thus eliminating the need for the stack  */ 05370000
*/*            to send a SIOCMSADDRT6/DELRT6 IOCTL to the Pre-Router */ 05380000
*/*            for route updates received from a routing daemon.     */ 05390000
*/*                                                                  */ 05400000
*/********************************************************************/ 05410000
*Declare                                                                05420000
* 1 GRT6RtEntry  Type  Bdy(Word), /* Route entry used with the          05430000
*                                           SIOCGRT6TABLE IOCTL.     */ 05440000
*  3 GRT6Destination Isa(IPV6Addr), /* Destination IP address.       */ 05450000
*  3 GRT6Gateway     Isa(IPV6Addr), /* First HOP on the trip if         05460000
*                                           going through a gateway. */ 05470000
*  3 GRT6DestPrefixLen Fixed(31),   /* Destination's Prefix Length      05480000
*                                           which is a decimal value    05490000
*                                           that specifies how many of  05500000
*                                           the leftmost contiguous     05510000
*                                           bits of the address         05520000
*                                           comprise the prefix.     */ 05530000
*  3 GRT6RtMetric     Fixed(31),    /* Metric - hop count               05540000
*                                           Currently Tcp/IP returns    05550000
*                                            1 for indirect route and   05560000
*                                            0 for direct route.        05570000
*                                           If route is from routing    05580000
*                                           daemon, metric is whatever  05590000
*                                           routing daemon set it to.*/ 05600000
*  3 GRT6RtFlags Isa(Ipv6RtFlags); /* IPV6 Route Flags.              */ 05610000
*                                                                       05620000
*/********************************************************************/ 05630000
*/*                                                                  */ 05640000
*/* The mapping for the Route Entry that is specified on the         */ 05650000
*/* SIOCMSADDRT6 and SIOCMSDELRT6 IOCTLs.                            */ 05660000
*/*                                                                  */ 05670000
*/* NOTE: This structure uses SockAddr structures for the            */ 05680000
*/*       "destination" and "gateway" addresses, the Grt6RtEntry     */ 05690000
*/*       uses Ip addresses. See the Grt6RtEntry structure for       */ 05700000
*/*       the reasons.                                               */ 05710000
*/*                                                                  */ 05720000
*/********************************************************************/ 05730000
*Declare                                                                05740000
* 1 Rt6Entry  Type  Bdy(Word),     /* Route entry used with the         05750000
*                                       SIOCMSADDRT6/DELRT6 IOCTLs   */ 05760000
*                                                                       05770000
*  3 Rt6Destination                  /* Destination IP address (in a */ 05780000
*           Isa(Sock_Inet6_SockAddr),/*  sockaddr structure)         */ 05790000
*                                                                       05800000
*  3 Rt6Gateway                      /* First HOP on the trip if     */ 05810000
*           Isa(Sock_Inet6_SockAddr),/*   going through a gateway.   */ 05820000
*                                                                       05830000
*  3 Rt6DestPrefixLen Fixed(31),/* Destination's Prefix Length,         05840000
*                                          which is a decimal value     05850000
*                                          that specifies how many of   05860000
*                                          the leftmost contiguous      05870000
*                                          bits of the address          05880000
*                                          comprise the prefix.      */ 05890000
*  3 Rt6Metric     Fixed(31),        /* Metric - hop count              05900000
*                                         Currently Tcp/IP returns      05910000
*                                          1 for indirect route and     05920000
*                                          0 for direct route.          05930000
*                                         If route is from routing      05940000
*                                         daemon, metric is whatever    05950000
*                                         routing daemon set it to.  */ 05960000
*  3 Rt6Flags Isa(Ipv6RtFlags);    /* IPV6 Route Flags.              */ 05970000
*                                                                       05980000
*/********************************************************************/ 05990000
*/*                                                                  */ 06000000
*/* Declare a new GRT6RtEntry mapping for DCR A846.00 - Route        */ 06010000
*/* Modification - New SIOCMSMODHOMEIF6 IOCTL                        */ 06020000
*/*                                                                  */ 06030000
*/* In this mapping TCP/IP will be passing Route's home interface    */ 06040000
*/* index.  This is used in SIOCMSMODHOMEIF6 IOCTL processing.       */ 06050000
*/*                                                                  */ 06060000
*/*                                                                  */ 06070000
*/*                                                                  */ 06080000
*/********************************************************************/ 06090000
*Declare                                                                06100000
* 1 GRT6RtEntryV2  Type  Bdy(Word), /* New Route Entry used with DCR    06110000
*                                           A846 - Route Modification*/ 06120000
*  3 GRT6OldRtEntry  Isa(GRT6RtEntry),  /* Old GRT6 Route Entry      */ 06130000
*  3 GRT6RtHomeIfIdx  Fixed(32),   /* Route's Home Interface Idx @D2A*/ 06140000
*  3 GRT6RtIfIndex    Fixed(32),   /* Route's Interface Index    @P5A*/ 06150000
*  3 GRT6RtMTU        Fixed(16),   /* Route's MTU Value          @P5A*/ 06160000
*  3 *                Fixed(16),   /* Reserved                       */ 06170000
*  3 *                Fixed(32),   /* Reserved                       */ 06180000
*  3 *                Fixed(32);   /* Reserved                       */ 06190000
*                                                                       06200000
*/********************************************************************/ 06210000
*/*                                                                  */ 06220000
*/* Declare a new mapping for RT6Entry for DCR A846.00,Route         */ 06230000
*/* Modification, that is specified on the SIOCMSADDRT6V2, and       */ 06240000
*/* SIOCMSDELRT6V2 IOCTLs.                                           */ 06250000
*/*                                                                  */ 06260000
*/* In this new mapping TCP/IP will be passing Route's home          */ 06270000
*/* interface index.                                                 */ 06280000
*/*                                                                  */ 06290000
*/********************************************************************/ 06300000
*Declare                                                                06310000
* 1 Rt6EntryV2  Type  Bdy(Word),     /* New Route Entry Used with A846  06320000
*                                       MSADDRT6V2/MSDELRT6V2 IOCTLs */ 06330000
*  3 Rt6OldEntry  Isa(RT6Entry),     /* Old Route Entry used before  */ 06340000
*                                    /* A846 with SIOCMSADDRT6/      */ 06350000
*                                    /* SIOCMSDELRT6 IOCTL           */ 06360000
*  3 Rt6RtHomeIfIdx Fixed(32),       /* Route's Home Interface Idx   */ 06370000
*  3 *              Fixed(32),       /* Reserved                     */ 06380000
*  3 *              Fixed(32),       /* Reserved                     */ 06390000
*  3 *              Fixed(32),       /* Reserved                     */ 06400000
*  3 *              Fixed(32);       /* Reserved                     */ 06410000
*                                                                       06420000
*/********************************************************************/ 06430000
*/*                                                                  */ 06440000
*/* The mapping for the route flags                                  */ 06450000
*/*                                                                  */ 06460000
*/********************************************************************/ 06470000
*Declare                                                                06480000
* 1 IPV6RtFlags Type,              /* Route Flags                    */ 06490000
*  3 IPV6FlgRouteType Fixed(8),    /* Route Type(from the stack) @D1C*/ 06500000
*  3 IPV6FlgByte2 Bit(8),          /* Reserved                       */ 06510000
*  3 IPV6FlgByte3 Bit(8),          /* Reserved                       */ 06520000
*  3 IPV6FlgByte4 Bit(8),          /* Reserved                       */ 06530000
*   5 *              Bit(1),       /* Reserved           @D4C@P3C@P5C*/ 06540002
*   5 IPV6BitDVIPA   Bit(1),       /* 1 = DVIPA Interface        @D4A*/ 06541002
*   5 IPV6BitV3      Bit(1),       /* 1 = Version 3 Fields Incl. @P5A*/ 06550000
*   5 IPV6BitLoopback Bit(1),      /* 1 = Loopback Interface     @P3A*/ 06560000
*   5 IPV6BitHome    Bit(1),       /* 1 = Home Interface             */ 06570000
*   5 IPV6BitHost    Bit(1),       /* 1 = Host Route, 0=Network route*/ 06580000
*   5 IPV6BitGate    Bit(1),       /* 1 = Gateway                    */ 06590000
*   5 IPV6BitRtUp    Bit(1);       /* 1 = Route is active            */ 06600000
*                                                                       06610000
*/*------------------------------------------------------------------*/ 06620000
*/* SiocGifConf6 - Get IPv6 Interface Configuration.             @D3A*/ 06630000
*/*                                                                  */ 06640000
*/*  Net_IfConf6Header is passed as the argument of the ioctl and    */ 06650000
*/*  is returned with the number of entries and entry length of the  */ 06660000
*/*  Net_IfConf6Entry structs that were written to the output buffer.*/ 06670000
*/*                                                                  */ 06680000
*/*  If Buflen=0=Buffer a Query function is performed and the        */ 06690000
*/*  header is returned with: (1) the maximum supported version,     */ 06700000
*/*  (2) the total number of entries that would be output and        */ 06710000
*/*  (3) the length of each individual entry.                        */ 06720000
*/*                                                                  */ 06730000
*/*  If a call to get information fails with RC=ERANGE or with       */ 06740000
*/*  (RC=EINVAL & Nif6h_Version is changed) the call is converted    */ 06750000
*/*  into a Query function and the content of the output buffer      */ 06760000
*/*  is unpredictable.                                               */ 06770000
*/*                                                                  */ 06780000
*/*  For information on the data returned in this structure refer    */ 06790000
*/*  to the z/OS Communication Server's IP Configuration Guide and   */ 06800000
*/*  IPv6 Network and Application Design Guide.                      */ 06810000
*/*------------------------------------------------------------------*/ 06820000
*Dcl 1 Net_IfConf6Header Based Bdy(Word),   /* Header            @D3A*/ 06830000
*      2 nif6h_version  Fixed(32), /* Input for Get IfConf6             06840000
*                                     Output for Query               */ 06850000
*      2 nif6h_entries  Fixed(32), /* Output: number of entries         06860000
*                                          returned in output buffer */ 06870000
*      2 nif6h_entrylen Fixed(32), /* Output: length of an entry     */ 06880000
*                                                                       06890000
*      2 nif6h_buflen   Fixed(32), /* Input:  length of buffer       */ 06900000
*                                                                       06910000
*      2 nif6h_buffer64,           /* Input:  Amode(64) Buffer ptr   */ 06920000
*        3 nif6h_buffer64H Fixed(32),                                   06930000
*        3 nif6h_buffer    Ptr ;   /* Input:  Amode(31) Buffer ptr      06940000
*                              to output buffer that will be filled     06950000
*                              with an array of Net_IfConf6Entry's.  */ 06960000
*                                                                       06970000
*Dcl 1 Net_IfConf6Entry Based Bdy(Word),    /* Entry             @D3A*/ 06980000
*      2 nif6e_name Char(16),      /*x00 interface name (blank padded   06990000
*                                                     - no null)     */ 07000000
*      2 nif6e_stackname Char(8),  /*x10 tcpip stack name (blank        07010000
*                                                padded - no null)   */ 07020000
*      2 nif6e_addr      Char(28), /*x18 Sock_Inet6_SockAddr of         07030000
*                                                   the interface    */ 07040000
*      2 nif6e_routemetric Fixed(32), /*x34 route metric             */ 07050000
*      2 nif6e_prefixlen   Fixed(16), /*x38 routing prefix length    */ 07060000
*      2 nif6e_prefixorigin Fixed(8), /*x3A prefix origin, see below */ 07070000
*      2 nif6e_status      Fixed(8),  /*x3B status, see below        */ 07080000
*      2 nif6e_flags       Bit(32),   /*x3C Flags:                   */ 07090000
*        3 nif6e_flags1     Bit(8),                                     07100000
*        3 nif6e_flags2     Bit(8),                                     07110000
*        3 nif6e_flags3     Bit(8),                                     07120000
*          5  *                     Bit(1),                             07130000
*          5 nif6e_Virtual          Bit(1),                             07140000
*          5  *                     Bit(2),                             07150000
*          5 nif6e_MultiPoint       Bit(1),                             07160000
*          5 nif6e_MulticastCapable Bit(1),                             07170000
*          5  *                     Bit(2),                             07180000
*        3 nif6e_flags4     Bit(8),                                     07190000
*          5  *                   Bit(3),                               07200000
*          5 nif6e_Point2point    Bit(1),                               07210000
*          5 nif6e_Loopback       Bit(1),                               07220000
*          5  *                   Bit(2),                               07230000
*          5 nif6e_OnLink         Bit(1),                               07240000
*      2 nif6e_mtu Fixed(32);         /*x40 mtu                      */ 07250000
*                                                                       07260000
*                /* Constants for nif6h_version                  @D3A*/ 07270000
*    Dcl Nif6h#Ver Fixed(32) Constant(Nif6h#Ver1),/* Current Version */ 07280000
*        Nif6h#Ver1 Fixed(32) Constant(1);        /* Initial Version */ 07290000
*                                                                       07300000
*                /* Constants for nif6e_prefixorigin             @D3A*/ 07310000
*    Dcl Nif6h#WellKnown Constant(1) Fixed(8),                          07320000
*        Nif6h#Manual    Constant(2) Fixed(8),                          07330000
*        Nif6h#RtrAdv    Constant(3) Fixed(8),                          07340000
*        Nif6h#Other     Constant(8) Fixed(8);                          07350000
*                                                                       07360000
*                /* Constants for nif6e_status                   @D3A*/ 07370000
*    Dcl Nif6h#Preferred     Constant(1) Fixed(8),                      07380000
*        Nif6h#Deprecated    Constant(2) Fixed(8),                      07390000
*        Nif6h#Invalid       Constant(3) Fixed(8),                      07400000
*        Nif6h#Inaccessible  Constant(4) Fixed(8),                      07410000
*        Nif6h#Unknown       Constant(5) Fixed(8),                      07420000
*        Nif6h#Tentative     Constant(6) Fixed(8),                      07430000
*        Nif6h#Duplicate     Constant(7) Fixed(8);                      07440000
*    /*-------------------------------------End SiocGifConf6 --- @D3A*/ 07450000
*                                                                       07460000
*/********************************************************************/ 07470000
*/*                                                                  */ 07480000
*/*   Constants                                                      */ 07490000
*/*                                                                  */ 07500000
*/********************************************************************/ 07510000
*Declare                                                                07520000
*  IOC6_#HomeIfPrefixLen Constant(128);   /* The prefix length for a    07530000
*                                            home interface address     07540000
*                                            returned on the            07550000
*                                            SIOCGHOMEIF6 IOCTL.    */  07560000
*Declare                                                                07570000
* IOC6_Nch#Eye Char(4)  Constant('6NCH'); /* IPV6 Network Configuration 07580000
*                                            Header EyeCatcher.      */ 07590000
*Declare                                                                07600000
* IOC6_Nch64#Eye Char(4)  Constant('6N64'); /* IPV6 NetConfHdr          07610000
*                                             EyeCatcher 64-BIT  @P2A*/ 07620000
*/********************************************************************/ 07630000
*/*                                                                  */ 07640000
*/* Maximum hop count for the Metric fields:                         */ 07650000
*/*    GRT6RtMetric                                                  */ 07660000
*/*    Rt6Metric                                                     */ 07670000
*/*                                                                  */ 07680000
*/********************************************************************/ 07690000
*Declare                                                                07700000
*  IOC6_#MaxHopMetric  Fixed(31) constant(16);                          07710000
*                                                                       07720000
*/********************************************************************/ 07730000
*/*                                                                  */ 07740000
*/*   Constants used for size of control areas                       */ 07750000
*/*                                                                  */ 07760000
*/********************************************************************/ 07770000
*Declare                                                                07780000
*  IOC6_#MaxRoutes     Fixed(31) Constant(600),                         07790000
*  IOC6_#Grt6RouteLen  Fixed(31) Constant(Length(GRT6RtEntry)),         07800000
*  /******************************************************************/ 07810000
*  /* Initial buffer size for SIOCGHOMEIF6 and SIOCGRT6TABLE.        */ 07820000
*  /******************************************************************/ 07830000
*  IOC6_#MAXGRT6Len    Fixed(31) Constant(IOC6_#MaxRoutes *             07840000
*                                          Ioc6_#Grt6RouteLen),         07850000
*  IOC6_#NetConfHdrLen Fixed(31) Constant(Length(NetConfHdr)),          07860000
*  IOC6_#Grt6V2RouteLen Fixed(31) Constant(Length(GRT6RtEntryV2)),      07870000
*  IOC6_#MAXGRT6V2Len  Fixed(31) Constant(IOC6_#MaxRoutes *             07880000
*                                          IOC6_#Grt6V2RouteLen);       07890000
*                                                                       07900000
*                                                                       07910000
*   %End; /* End if bpxyioc6_inc = 1       */                           07920000
