*        %GOTO CONSPRO  ;         /* Bilingual header                           
         MACRO                                                                  
         BPXYCONS  &DSECT=MEANINGLESS,&LIST=YES               8@D1A             
         GBLB  &CONS411                                                         
         AIF   (&CONS411 EQ 1).E411                                             
&CONS411 SETB  1                                                                
         AIF   ('&LIST' EQ 'YES').A411                                          
         PUSH  PRINT  BPXYCONS: Syscall Constants                               
         PRINT OFF                                                              
         AGO   .A411                                                            
*                                  */                                           
*%CONSPRO : ;                                                                   
*/****START OF SPECIFICATIONS******************************************         
*                                                                               
*    $MAC (BPXYCONS) COMP(SCPX1) PROD(BPX):                                     
*                                                                               
*01* MACRO NAME: BPXYCONS                                                       
*                                                                               
*01* DSECT NAME: N/A                                                            
*                                                                               
*01* DESCRIPTIVE NAME: Syscall Constants                                        
*                                                                               
*02*   ACRONYM: N/A                                                             
**/                                                                             
*/*01* PROPRIETARY STATEMENT=                                        */         
*/***PROPRIETARY_STATEMENT********************************************/         
*/*                                                                  */         
*/*                                                                  */         
*/* LICENSED MATERIALS - PROPERTY OF IBM                             */         
*/* 5650-ZOS COPYRIGHT IBM CORP. 1993, 2023                          */         
*/*                                                                  */         
*/* STATUS= HBB77D0                                                  */         
*/*                                                                  */         
*/***END_OF_PROPRIETARY_STATEMENT*************************************/         
*/*                                                                             
*01* EXTERNAL CLASSIFICATION:  PI                                               
*01* END OF EXTERNAL CLASSIFICATION:                                            
*                                                                               
*01* FUNCTION:                                                                  
*      Contains Constants used for syscalls                                     
*                                                                               
*01* METHOD OF ACCESS:                                                          
*                                                                               
*02*   PL/X:                                                                    
*        %INCLUDE SYSLIB(BPXYCONS)                                              
*                                                                               
*02*   ASM:                                                                     
*       BPXYCONS                                                                
*                                                                               
*01* SIZE: N/A                                                                  
*                                                                               
*01* POINTED TO BY: N/A                                                         
*                                                                               
*01* CREATED BY: N/A                                                            
*                                                                               
*01* DELETED BY: N/A                                                            
*                                                                               
*01* STORAGE ATTRIBUTES:                                                        
*02*   SUBPOOL/DATASPACE:  N/A                                                  
*02*   KEY:                N/A                                                  
*02*   RESIDENCY:          N/A                                                  
*                                                                               
*01* FREQUENCY: N/A                                                             
*                                                                               
*01* SERIALIZATION: N/A                                                         
*                                                                               
*01* DEPENDENCIES: None                                                         
*                                                                               
*01* NOTES: None.                                                               
*                                                                               
*01* COMPONENT: OpenMVS (SCPX1)                                                 
*                                                                               
*01* DISTRIBUTION LIBRARY:  AMACLIB                                             
*                                                                               
*01* EYE-CATCHER: None                                                          
*02*   OFFSET:  -                                                               
*02*   LENGTH:  -                                                               
*                                                                               
*01* CHANGE-ACTIVITY:                                                           
* $L0=POSIXXP  HOM1110 921201 PDHR: OpenMVS Initial Release                     
* $D1=DL70019  HOM1110 921201 PDJM: Assembler macro fixup                       
* $D2=DL70014  HOM1110 921104 PDJI: Pthread support                             
* $P1=PL70568  HOM1110 921208 PDHR: Add 2_CHAR_TERM rm STREAM_MAX               
* $P2=PL70597  HOM1110 930104 PDJM: Use "OpenMVS"                               
* $P3=PL70669  HOM1110 930302 PDJJ: Add assembler comments for BPX1PSI          
* $D3=DL70038  HOM1110 930310 PDJQ: Quiesce threads support                     
* $D4=DL70042  HOM1110 930322 PDJQ: LE Enclave Clenaup Support                  
* $L1=OMVS1    HOM1110 920305 PDI6: OpenMVS 2nd Release                         
* $D5=DOAA011  HOM1120 930604 PDJQ: MWTQ support                                
* $P4=PL70740  HOM1110 930502 PDJJ: Add pthread_query                           
* $D6=DOAA003  HOM1120,930519,PDJJ: Ptrace support for multi-thread             
* $D7=DOAA011  HOM1120 930812 PDJH: Set_thread_limits (DCR A011.02)             
* $D8=DPFA065  HOM1130 930126 PDI6: Universal Unix    (DCR A065.02)             
* $D9=DPFA079  HOM1130 940315 PDND: DCR A079.01 Spawn Support                   
* $DB=DPFA065  HOM1130 940503 PDAX: A065.05 Rlimits/Rusage                      
* $DC=DPFA065  HOM1130 940627 PDEA: A065.06 Wait Extention                      
* $DA=DPFA065  HOM1130 940928 PDJM: DCR A065.03 mmap  Support                   
* $DB=DPFA051  HOM1130 950303 PDI6: DCR A051.24 renice Support                  
* $DC=DPFA124  HOM1130 950328 PDJI: querydub status codes (A124.00)             
* $DE=DRGA129  HOM1140 950508 PDJM: DCR A129.0 TTY GID                          
* $P5=PPF0371  HOM1130 950511 PDKF: OSMF version support                        
* $P6=PRG0007  HOM1140 950531 PDJQ: Rollup REL3 DCR A126.00                     
* $P7=PRG0017  HOM1140 950620 PDKG: Rollup Rel3 DCRs A130.00 A111.00            
* $01=OW17358  HOM1130 951206 PDI6: DFP Close Cleanup Exit Support              
* $DF=DSPA164  HOM1150 960202 PDJJ: DCR A164.01 console modify/stop/wto         
* $P8=PSP0054  HOM1150 960327 PDJQ: Rollup OW15865 (RACF-DCE SPE)               
* $P9=PQC1585  HBB6603 960618 PDJM: Env Vars to Kernel OapbIPFP....             
* $DG=DSPA175  HOM1150 960618 PDJJ: DCR A175.01 SRB support                     
* $PA=PQC1535  HBB6603 960624 PDJJ: Fix EQUs for console cmd                    
* $02=OW22143  HOM1130 960816 PDI6: Dub Task Acee Fix                           
* $PB=PQC2408  HBB6603 960916 PDI6: WLM Enclave Fix                             
* $PC=PQC2590  HBB6603 960926 PDI6: WLM Disconnect conditional change           
* $DH=DSYA183  JBB6604 960917 PDFV: LFS Cache  A183.01                          
* $DI=DUXA217  HBB6605 970312 PDJJ: Multi-line __console() (A217.10)            
* $DJ=DUXA217  HBB6605 970421 PD2J: Non Swap Service  A217.04                   
* $PD=PUX0156  HBB6605 970509 PDFV: LFS Cache Fix                               
* $PE=PUX0149  HBB6605 970505 PD2J: Non Swap Design Fix                         
* $PF=PUX0140  HBB6605 970528 PDSZ: Certificate Support (OW26857)               
* $DK=DVZA237  HBB6606 970620 PDKG: __Security A237.00                          
* $DL=DVZ0241  HBB6606 971001 PDPY: A241.00 Shmem Memmap                        
* $DM=DVTA237  HBB6606 971009 PDJQ: A237.01 Pid Affinity                        
* $DN=DWAA247  JBB6607 980121 PDND: get error text pfsctl                       
* $DO=DWAA282  JBB6607 980123 PDKG: A282.00 Certificate registration            
* $PG=PWA0236  JBB6607 980615 PD16: Internals Support                           
* $DP=DWK0285  HBB6608 980923 PDKG: A285.01 CICS QR - BPX1DSD syscall           
* $DQ=DWKA320  HBB6608 980715 PDJI: osenv get/set/unset support A320.00         
* $DR=PWA0327  HBB6608 980923 PDKG: A327.02 CICS OTE - HFSLOAD changes          
* $PH=PWY0213  JBB6609 990317 PDJT: PFS Recycle                 A311.02         
* $PI=PWY0510  JBB6609 990602 PDND: get sysnames                                
* $DS=DXDA378  HBB7703 990907 PDJM: New server / WLM Constant (A378.00)         
* $03=OW40460  JBB6609 990820 PDJT: Named Token Tdx & Tdnames                   
*                                   get sysnames (change pc# number)            
* $04=OW39092  JBB6609 990913 PDKG: BPX1SDD w/ option to defer dub              
* $PK=PWY0944  JBB6609 991018 PDND: add pfsctl for hfs stats                    
* $DT=DXVA309  HBB7704 000213 PDJN: Filesys CDS Utility A309.07                 
* $DU=DXVA409  HBB7704 000227 PDJI: A409.01 Quick_Freeze_Exit_Reg               
* $DV=DXVA502  HBB7704 000508 PDFV: A502.00 Soft ShutDown                       
* $PL=PWV0170  HBB7704 000511 PDJN: Change PC#SfsDiag to upper case             
* $DW=DCRA539  HBB7705 001105 PDSZ: No signal support                           
* $05=OW46710  HBB7705 010105 PD2R: User specified signal for BRLM loc.         
* $DX=DYNA519  HBB7708 010131 PDJQ: A519.03 PidXfer support                     
* $DY=DYMA511  HBB7706 010305 PDI6: OMVS Restart Support                        
* $DZ=DX0A534  HBB7708 001113 PDAE: Set posix identity from task ACEE           
* $E0=DYN0519  HBB7708 010501 PDZJ: A519.11 MEMLIMIT                            
* $E1=DYN0519  HBB7708 010501 PDZJ: A519.09 (QueryMode support)                 
* $E2=DYN0519  HBB7708 010812 PDZJ: A519.14 64 bit Page size                    
* $E3=DX0A569  HBB7706 010725 PDSZ: A569. TLS Certificate                       
* $PM=PYN0220  HBB7708 020301 PDFO: Bilingual fixup                             
* $E4=DYVA568  HBB7707,010725,PDAE: DCR A568 Process start/end exit             
* $E5=DYNA567  HBB7708 020405 PDJQ: A567.00 MLS rollup                          
* $PN=PJK1051  HBB7709 031014 PDJQ: For query_amode add new return              
*                                   value for amode not initialized             
* $06=OA09697  HBB7707 040918 PDJT: Directed GetHost                            
* $E6=ME02888  HBB7730 050105 PDJJ: TLS_TASK_ACEE_USP#                          
* $E7=DCRA863  HBB7730 050422 PDSK: zfs sysplex pfsctl for shutdown             
*                                   ME03409                                     
* $E8=DCRA980  HBB7730 050516 PDJJ: New function code for ptsec                 
* $E9=DCRA986  HBB7730 051114 PDJJ: Set/Query Must Stay Clean                   
* $EA=DcrA863  HBB7730 060218 PDJT: PC_ErrorText                                
* $EB=DCRB041  HBB7740 061210 PDJQ: B041.00 password phrase support             
* $EC=DCRB231  HBB7750 070124 PDJC: Extended LoadHFS                            
* $ED=DCRB241  HBB7750 070531 PDSK: LFS support for zFS                         
* $EE=DCRB421  HBB7760 071029 PDHA: Change DFLT_ARG_MAX to 4,128,768            
* $07=OA20171  HBB7730 071025 PDKG: BPX1SDD w/ option no ACEE sharing           
* $EF=DCRB231  HBB7750 070124 PDJC: Extended LoadHFS fix comments               
* $F1=DCRB448  HBB7760 080507 PDJJ: Fail Dub when kernel not ready              
* $EG=ME13542  HBB7760 080523 PDHA: DCR B421 withdrawn                          
* $F2=DCRB781  HBB7770 090303 PDMX: mmap for NFS                                
* $F3=DCRB864  HBB7770 090427 PDJT: RFC 5014 APIs                               
* $F4=ME16903  HBB7770 090813 PDND: Add PC#IOcounts                             
* $F5=ME19251  HBB7780 100519 PDND: Add PC#MntFailCd                            
* $F6=DCRC247  HBB7790 110404 PDX8: Add PC#ResolveSym                           
* $PO=ME21648  HBB7790 110615 PDSK: Check owner change with PFS                 
* $F7=DCRC509  HBB7790 120430 PDGY: Add Unicode comp ID for bpxmtext            
* $F8=DCRC595  HBB77A0 130415 PDSK: AMODE64                                     
* $08=OA45056  HBB77A0 140701 PDMX: AutoCvt constants for Bpx1Env               
* $F9=ME28338  HBB77A0 141122 PDJN: Undub notification                          
* $09=OA49896  HBB7780 160121 PDJN: Enable/Disable PgmAuth (WI108049)           
* $FA=DCRC923  HBB77B0 160415 PDX8: HFS->ZFS pfsctl rename filesys              
* $FB=DCRC893  HBB77B0 160401 PDJQ: Syscall Exits (DCR C893.00)                 
* $FC=DCRC923  HBB77B0 160422 PDGY: Add H2Z migrations pfsctl constants         
* $FD=DCRC923  HBB77B0 170125 PDX8: HFS->ZFS add rename fs error buff           
* $0A=OA50999  HBB7790 160723 PDJN: Inetd PC#UnsecureServices                   
* $FE=EA26976  HBB77C0 180410 PDX8: Add PC#MigStart/Stop for zFS->zFS           
* $FF=WI247729 HBB77C0 180419 PDX8: Change PC#MigStart/Stop func code           
* $0B=OA54218  HBB77B0 171016 PDGY: Enable/Disable FileAuth                     
* $FG=WI294676 HBB77C0 190129 PDLZ: Notify zFS on Stop PFS                      
* $FH=WI169636 HBB77D0 200120 PDCL: memmap31 API changes (309076)               
* $FI=WI408959 HBB77D0 210720 PDX8: Add PC#RemountDone                          
* $FJ=WI381519 HBB77D0 210727 PDTS: Add PC#DISABLEUFS                           
* $FK=                                                                          
* $FL=                                                                          
* $FM=                                                                          
* $FN=                                                                          
* $FO=                                                                          
* $FP=WI412354 HBB77D0 220125 PDSA: wait4() support                             
* $FQ=                                                                          
* $FR=WI401043 HBB77D0 220908 PDSA: Add XPLATFORM level                         
*                                                                               
****END OF SPECIFICATIONS*********************************************/         
*                                                               @EJECT;         
*        %GOTO CONSPLS  ;         /* Bilingual header                           
.A411    ANOP  ,                                                                
** BPXYCONS: Syscall constants                                                  
**  Used By: Many syscalls                                                      
DFLT_ARG_MAX         EQU   1048576  Constant for default ARG_MAX  @EGC          
DFLT_CHILD_MAX       EQU   6    Constant for default CHILD_MAX                  
*                               (_POSIX_CHILD_MAX)                              
DFLT_CLK_TCK         EQU   100  Constant for default CLK_TCK                    
*                               (100 ticks per second)                          
DFLT_NGROUPS_MAX     EQU   8191 Constant for default NGROUPS_MAX                
*                               (RACF Maximum value)                            
DFLT_OPEN_MAX        EQU   16   Constant for default OPEN_MAX                   
*                               (_POSIX_OPEN_MAX)                               
DFLT_TZNAME_MAX      EQU   9    Constant for default TZNAME_MAX                 
DFLT_JOB_CONTROL     EQU   1    Constant for default JOB_CONTROL                
DFLT_SAVED_IDS       EQU   1    Constant for default SAVED_IDS                  
DFLT_VERSION         EQU   199009  Constant for default VERSION                 
DFLT_THREAD_TASKS_MAX_NP  EQU  50  Constant default THREAD_TASKS_MAX_NP         
DFLT_USERIDLEN_MAX   EQU   8    Max characters for a userid       @DKA          
DFLT_PASSWDLEN_MAX   EQU   8    Max characters for a password     @DKA          
DFLT_PASSWDPHRLEN_MAX EQU  100 Max characters for password phrase @EBA          
DFLT_2_CHAR_TERM     EQU   1    Constant default SC_2_CHAR_TERM  @P1A           
                 SPACE ,                                                        
* items from sysconf()                                                          
SC_ARG_MAX           EQU   1    Constant for querying ARG_MAX                   
SC_CHILD_MAX         EQU   2    Constant for querying CHILD_MAX                 
SC_CLK_TCK           EQU   3    Constant for querying CLK_TCK                   
SC_JOB_CONTROL       EQU   4    Constant for querying JOB_CONTROL               
SC_NGROUPS_MAX       EQU   5    Constant for querying NGROUPS_MAX               
SC_OPEN_MAX          EQU   6    Constant for querying OPEN_MAX                  
SC_SAVED_IDS         EQU   7    Constant for querying SAVED_IDS                 
SC_TZNAME_MAX        EQU   9    Constant for querying TZNAME_MAX                
SC_VERSION           EQU   10   Constant for querying VERSION                   
SC_THREAD_TASKS_MAX_NP EQU 11   Constant to query THREAD_TASKS_MAX_NP           
SC_2_CHAR_TERM       EQU   12   Constant for querying VERSION    @P1A           
SC_THREADS_MAX_NP    EQU   13   Constant to query THREADS_MAX_NP @D5A           
SC_MMAP_MEM_MAX_NP   EQU   14   Constant to query MMAP_MEM_MAX_NP@DAA           
SC_TTY_GROUP         EQU   15   Constant to query TTY GROUP      @PEA           
SC_PAGESIZE          EQU   16   Constant to query Page Size      @D2A           
SC_PAGE_SIZE         EQU   16   Constant to query Page Size      @D2A           
                 SPACE ,                                                        
* wait function code                                             @DCA           
#WAIT3               EQU   1    wait3() function code            @DCA           
#WAITID              EQU   2    waitid() function code           @DCA           
#WAIT4               EQU   3    wait4() function code            @FPA           
                 SPACE ,                                                        
* items from waitf()                                                            
WNOHANG              EQU   1    Wait, do not suspend execution                  
WUNTRACED            EQU   2    Wait, return status of stopped child            
WCONTINUED           EQU   4    Wait, return status of continued child          
*                                                                @DCA           
WEXITED              EQU   8    Wait for process that have exited               
*                                                                @DCA           
WSTOPPED             EQU  16    Wait, return status of stopped child            
*                                                                @DCA           
WNOWAIT              EQU  32    Wait, return status of a child without          
*                               changing the state.  The child can be           
*                               waited for again.                @DCA           
                 SPACE ,                                                        
* waitid() id type options                                       @DCA           
P_PID                EQU   0    Wait for the child with a process ID            
*                                                                @DCA           
P_PGID               EQU   1    Wait for any child with a process               
*                               group ID                         @DCA           
P_ALL                EQU   2    Wait for any child               @DCA           
                 SPACE ,                                                        
* BPX1PTX Options                                                               
PTEXITTHREAD         EQU   0    Pthread exit                                    
PTGETNEWTHREAD       EQU   1    Pthread get new                                 
PTFAILIFLASTTHREAD   EQU   2    Pthread fail if last thread      @D4A           
                 SPACE ,                                                        
QUIESCE_TERM         EQU   1    Quiesce threads type = term      @D3A           
QUIESCE_FORCE        EQU   2    Quiesce threads type = force     @D3A           
QUIESCE_QUERY        EQU   3    Alias of pthread_query           @P4C           
PTHREAD_QUERY        EQU   3    Quiesce threads type = query     @P4A           
QUIESCE_FREEZE       EQU   4    Quiesce threads type = freeze    @D6A           
QUIESCE_UNFREEZE     EQU   5    Quiesce threads type = unfreeze  @D6A           
FREEZE_THIS_THREAD   EQU   6    Quiesce threads type = freezeme  @D6A           
* Skip 7 because of collision with BPXZCONS Freeze_Force                        
FREEZE_EXIT          EQU   8    Quiesce threads type = freeze_exit              
QUIESCE_SRB          EQU   9    Quiesce threads type = SRBs      @DGA           
* Skip 10 and 11 due to collision with BPXZCONS Freeze/Unfreeze Fast            
*                                                                @P6A           
                 SPACE ,                                                        
PTHREAD_INTR_ENABLE#       EQU 0  Cancel request type = enabled                 
PTHREAD_INTR_DISABLE#      EQU 1  Cancel request type = disabled                
PTHREAD_INTR_CONTROLLED#   EQU 0  Cancel request type = controlled              
PTHREAD_INTR_ASYNCHRONOUS# EQU 1  Cancel request type = Asynchronous            
                 SPACE ,                                                        
STDIN_FILENO         EQU   0    Standard input value, file descriptor           
STDOUT_FILENO        EQU   1    Standard output value, file descriptor          
STDERR_FILENO        EQU   2    Standard error value, file descriptor           
                 SPACE ,                                                        
DUBTHREAD            EQU   0    Dub a thread default setting     @L1A           
DUBPROCESS           EQU   1    Dub a process default setting    @L1A           
DUBTASKACEE          EQU   2    Dub a task ACEE setting          @02A           
DUBPROCESSDEFER      EQU   4    Dub a process - but defer dub    @04A           
DUBNOSIGNALS         EQU   8    Dub a process - no signals       @DWA           
DUBJOBPERM           EQU   16   Dub as a permanent Job           @DYA           
DUBNOJSTUNDUB        EQU   32   Dub process such that jobstep does not          
*                               get undubbed when last non-jst undubs           
*                                                                @DYA           
DUBABENDCALLS        EQU   64   Dub process such that system calls              
*                               abend during a shutdown/restart window          
*                                                                @DYA           
DUBUNIQUEACEE        EQU   128                                   @07A           
DUBFAILNOTREADY      EQU   256  Fail dub if kernel is not up     @F1A           
                 SPACE ,                                                        
STL_MAX_TASKS        EQU   1    Replace MaxThreadTask only       @D7A           
STL_MAX_THREADS      EQU   2    Replace MaxThreads only          @D7A           
STL_SET_BOTH         EQU   3    Replace both limits              @D7A           
                 SPACE ,                                                        
NICE_ZERO            EQU   20   Default Process Scheduling Priority             
                 SPACE ,                                                        
PRIO_PROCESS         EQU   1    Looking for a specific process ID               
PRIO_PGRP            EQU   2    Looking for processes in a process grp          
PRIO_USER            EQU   3    Looking for processes for a user ID             
                 SPACE ,                                                        
CPRIO_ABSOLUTE       EQU   1    Priority value is an absolute value             
CPRIO_RELATIVE       EQU   2    Priority value is a relative value              
                 SPACE ,                                                        
*   Define equates for memory map                                               
PROT_READ            EQU   1    Mapped data can be read          @DAA           
PROT_WRITE           EQU   2    Mapped data can be written       @DAA           
PROT_NONE            EQU   4    Mapped data cannot be accessed   @DAA           
PROT_EXEC            EQU   8    Mapped data can be executed (treated            
*                               as PROT_READ)                    @DAA           
                 SPACE ,                                                        
MAP_PRIVATE          EQU   1    Changes to the mapped data are private          
MAP_SHARED           EQU   2    Changes to the mapped data are shared           
MAP_FIXED            EQU   4    Interpret map address exactly    @DAA           
MAP_MEGA             EQU   8    Use megabyte allocations         @D4A           
MAP_64               EQU  16    Above the bar features           @FHA           
                 SPACE ,                                                        
MS_SYNC              EQU   1    Performs synchronous writes      @DAA           
MS_ASYNC             EQU   2    Performs asynchronous writes     @DAA           
MS_INVALIDATE        EQU   4    Invalidate the cached memory mapped             
*                               pages                            @DAA           
                 SPACE ,                                                        
*   Define equates for spawn                                   @D9A             
SPAWN_FDCLOSED       EQU  -1    Do not inherit this file desc  @D9A             
                 SPACE ,                                                        
RLIMIT_CORE          EQU   4    Limit size of core dump          @DBA           
RLIMIT_CPU           EQU   0    Limit CPU time per process       @DBA           
RLIMIT_FSIZE         EQU   1    Limit file size                  @DBA           
RLIMIT_NOFILE        EQU   6    Limit number of open files       @DBA           
RLIMIT_AS            EQU   5    Limit address space size         @DBA           
RLIMIT_MEMLIMIT      EQU   7    Limit storage above the bar      @E0A           
                 SPACE ,                                                        
RLIM_INFINITY        EQU   2147483647 No limit value             @DBA           
                 SPACE ,                                                        
RUSAGE_SELF          EQU   0    Rusage for current process       @DBA           
RUSAGE_CHILDREN      EQU  -1    Rusage for terminated children   @DBA           
                 SPACE ,                                                        
*   Define equates for querydub output status                                   
QDB_DUBBED_FIRST     EQU   1    Task has already been dubbed.                   
*                               This task and this RB caused the                
*                               dub.                             @DCA           
QDB_DUBBED           EQU   2    Task has already been dubbed.                   
*                               Other task or other RB caused                   
*                               the dub                          @DCA           
QDB_DUB_MAY_FAIL     EQU   4    Task has not been dubbed, but may               
*                               fail if attempted.  Most likely                 
*                               reason for failure will be a missing            
*                               or incomplete user security profile,            
*                               or OMVS segment not defined      @DCA           
QDB_DUB_OKAY         EQU   8    Task has not been dubbed, and should            
*                               succeed if attempted             @DCA           
QDB_DUB_AS_PROCESS   EQU   16   Task has not been dubbed, but its               
*                               address space has. New task will dub            
*                               as another process within the address           
*                               space                            @DCA           
QDB_DUB_AS_THREAD    EQU   32   Task has not been dubbed, but its               
*                               address space has. New task will dub as         
*                               a thread within the process      @DCA           
                 SPACE ,                                                        
*   Define equates for oe_env_np syscall function codes                         
ENQWAIT_PROCESS      EQU   1    Examine/Change ENQ wait interruption            
*                               state                            @P6A           
FREEZE_EXIT_REG      EQU   2    Register/deregister an exit                     
*                               for pthread_quiesce(freeze_exit) @P6A           
MVS_USERID           EQU   3    Retrieve MVS userid of invoker   @P7A           
ENV_TOGGLE_SEC       EQU   4    Toggle btw task/process security @P7A           
DFP_CLEANUP_EXIT_REG EQU   5    Register DFP Close cleanup exit  @01A           
BPXK_PARAMETER       EQU   6    Env Vars to Kernel               @P9A           
ENV_STOR_SERVICE     EQU   7    Swappable or Non-Swappable                      
*                               address space                    @DJA           
QUICK_FREEZE_EXIT_REG EQU  8    Register/deregister an exit for                 
*                               fast pthread_quiesce_and_get     @DUA           
SHUTDOWN_REG         EQU  9     Register/block for shutdown                     
*                               processing                       @DXA           
WRITE_DOWN           EQU  10    Query/Alter write_down state of an              
*                               ACEE (MLS support)               @E5A           
PIDXFER_QUERY        EQU  11    Query if process image is a result of           
*                               a PIDXFER                        @DXA           
QUERY_MODE           EQU  12    Query AMODE/RMODE/AMODE capability of           
*                               target proess                    @E1A           
MUST_STAY_CLEAN      EQU  13    ENABLE/QUERY Must Stay Clean state of           
*                               the invoking process             @E9A           
XPLATFORM_PROCESS    EQU  14    ENABLE/QUERY XPlatform level for                
*                               the caller's process             @FRA           
                 SPACE ,                                                        
*   Define equates for XPLATFORM_PROCESS function of BPX1ENV     @FRA           
*                                                                               
XPLATFORM_MAX        EQU   1    Maximum supported XPLATFORM level               
*                                                                @FRA           
                 SPACE ,                                                        
*   Define equates for possible options of ENV_STOR_SERVICE                     
*   For future additions, make equates multiples of 2                           
*                                                               4@PED           
BPX_SWAP         EQU   1    Make the address space swappable     @PEC           
BPX_NONSWAP      EQU   2    Make the address space non-swappable                
*                                                                @PEC           
                 SPACE ,                                                        
*                                                                @E9A           
*   Define equates for possible options of MUST_STAY_CLEAN       @E9A           
* @E9A                                                                          
MSC_QUERY        EQU   0    Query current Must Stay Clean state  @E9A           
MSC_ENABLE       EQU   1    Enable Must Stay Clean state         @E9A           
*                                                                @E9A           
*   Define possible output for MSC_QUERY option                  @E9A           
* @E9A                                                                          
MSC_DISABLED     EQU   0     Query result: disabled              @E9A           
MSC_ENABLED      EQU   1     Query result: enabled even accoss Job              
*                            Step termination                    @E9A           
MSC_ENABLED_COND EQU   2     Query result: enabled conditionally,               
*                            Job Step termination will disable   @E9A           
*                                                                               
*   Define equates for all possible options for WRITE_DOWN function             
*   code of BPX1ENV                                                             
*                                                                               
WD_OUERY         EQU   0     Query write_down                    @E5A           
WD_ACTIVATE      EQU   1     Activate write_down                 @E5A           
WD_INACTIVATE    EQU   2     Inactivate write_down               @E5A           
WD_RESET         EQU   3     Reset write_down to default         @E5A           
*                                                                               
WD_SCOPE_AS      EQU   1     Target ACEE is AS                   @E5A           
WD_SCOPE_THD     EQU   2     Target ACEE is task                 @E5A           
*                                                                               
WD_IS_ACTIVE     EQU   1     Query result: active                @E5A           
WD_IS_INACTIVE   EQU   0     Query result: inactive              @E5A           
*                                                                               
*   Define equates for QUERY_MODE return values                  @E1A           
*                                                                @E1A           
BIT24_MODE           EQU   1    24 bit AMODE, RMODE or AMODE cap.@E1A           
BIT31_MODE           EQU   2    31 bit AMODE, RMODE or AMODE cap.@E1A           
BIT64_MODE           EQU   3    64 bit AMODE, RMODE or AMODE cap.@E1A           
AMODE_INITIALIZING   EQU   4    AMODE for process not known yet  @PNA           
                 SPACE ,                                                        
*   Define equates for possible options of ENV_SHUTDOWN_REG                     
*                                                                @DYA           
ENV_REGISTERBLOCK     EQU  1   Register to Block Shutdown        @DYA           
ENV_REGISTERPERMP     EQU  2   Register as a Permanent job/proc  @DYA           
ENV_DEREGISTERBLOCK   EQU  3   Dereg as a blocking job/proc      @DYA           
ENV_DEREGISTERPERM    EQU  4   Dereg as a permanent job/proc     @DYA           
ENV_REGISTERNOTIFY    EQU  5   Register as a notify job/proc     @DYA           
ENV_DEREGISTERNOTIFY  EQU  6   Dereg as a notify job/proc        @DYA           
ENV_REGISTERJOB       EQU  1   Register Job                      @DYA           
ENV_REGISTERPROC      EQU  2   Register Process                  @DYA           
*                                                                @DYA           
                 SPACE ,                                                        
*   Define equates for PIDXFER_QUERY return values               @DXA           
*                                                                @DXA           
PIDXFER_YES          EQU   1    Process was PIDXFERed            @DXA           
PIDXFER_NO           EQU   2    Process was not PIDXFERed        @DXC           
                 SPACE ,                                                        
*   Define equates for versions of OSMF on BPXESMF syscall                      
OSMF_VER_HOM1110     EQU   1    Version 1 of OSMF, for HOM1110   @P5A           
OSMF_VER_HOM1120     EQU   2    Version 2 of OSMF, for HOM1120   @P5A           
OSMF_VER_HOM1130     EQU   3    Version 3 of OSMF, for HOM1130   @P5A           
                 SPACE ,                                                        
*   Define equates for task ecurity syscall function codes                      
TLS_CREATE_THREAD_SEC# EQU 1    Build Task Security              @P7A           
TLS_DELETE_THREAD_SEC# EQU 2    Delete Task Security             @P7A           
TLS_TASK_ACEE#         EQU 3    set posix identity from task ACEE@DYA           
TLS_TASK_ACEE_USP#     EQU 4    User passed ACEE/USP pair        @E6A           
TLS_DAEMON_THREAD_SEC# EQU 5    Build unauthenticated Security   @E8A           
TLS_IDENTITY_USERID#   EQU 1    User identity: 1-8 char userid   @P7A           
TLS_IDENTITY_UID#      EQU 2    User identity: 4-byte uid        @P7A           
TLS_IDENTITY_CERT#     EQU 4    User identity: CERT structure    @PFA           
                 SPACE ,                                                        
*   Define equates for __Security syscall                                       
*   __Security function code                                                    
SECURITY_CREATE#       EQU 1    Create new security environment  @DKA           
SECURITY_CERTREG#      EQU 2    Register certificate with caller @DOA           
SECURITY_CERTDEREG#    EQU 3    DeReg certificate from caller    @DOA           
SECURITY_CERTAUTH#     EQU 4    Authorize certificate from caller@E3A           
*   __Security user identity                                                    
SECURITY_USERID#       EQU 1    User identity is 1-8 char userid @DKA           
SECURITY_CERTIFICATE#  EQU 2    User identity is a certificate   @DKA           
                 SPACE ,                                                        
*   Define equates for convert_id_np (BPX1CID) syscall function codes           
CID_GET_UUID#          EQU 1    Retrieve UUID                    @P8A           
CID_GET_USERID#        EQU 2    Retrieve userid                  @P8A           
                 SPACE ,                                                        
*   Define equates for __pid_affinity (BPX1PAF) syscall function codes          
PAF_ADD_PID#           EQU 1    Add PID to affinity list         @DMA           
PAF_DELETE_PID#        EQU 2    Delete PID from affinity list    @DMA           
                 SPACE ,                                                        
* Define equates for auth_check_resource_np  syscall access types               
ACK_READ#              EQU 1    Test READ access                 @P8A           
ACK_UPDATE#            EQU 2    Test UPDATE access               @P8A           
ACK_CONTROL#           EQU 3    Test CONTROL access              @P8A           
ACK_ALTER#             EQU 4    Test ALTER access                @P8A           
                 SPACE ,                                                        
*   The high order two bytes of the reason codes returned by                    
*   OpenMVS services contains a value that is used to qualify                   
*   the contents of the low order two bytes. If the contents of                 
*   the high-order two bytes are within the range of #CMID_LO to                
*   #CMID_HI, the error represented by the reason code is defined               
*   by OpenMVS. If the contents of the high order two bytes lie                 
*   outside the range, the error represented by the reason code                 
*   is not an OpenMVS reason code.                                              
#CMID_LOW            EQU   0000   Low range                                     
#CMID_HI             EQU   8447   High range                                    
*   Define equates for console cmd                                              
CC_MAX_MSG_LENGTH       EQU 17850 Max Wto string length for SUs   @DIC          
CC_MAX_MSG_LENGTH_NONSU EQU 17780 Max Wto string length for nonSU @DIC          
CC_MODIFY_BUFFER_LENGTH EQU 128  Length of Modify Buffer          @PAC          
CONSOLE_MODIFY          EQU   1  Service interrupted by Modify    @PAC          
CONSOLE_STOP            EQU   2  Service interrupted by Stop      @PAC          
*   Define equates for server_init syscall ManagerType parameter                
SRV_WORKMGR             EQU   1  Work Manager services requested  @DGA          
SRV_QUEUEMGR            EQU   2  Queue Mgr services requested     @DGA          
SRV_SERVERMGR           EQU   4  Server Mgr services requested    @DGA          
SRV_SERVERMGRDYNAMIC    EQU   8  Server Mgr With Dynamic mngt     @DSA          
*   Define equates for server_pwu syscall FcnCode parameter                     
SRV_PUT_NEWWRK          EQU   1  Put new work function requested  @DGA          
SRV_PUT_SUBWRK          EQU   2  Put sub work function requested  @DGA          
SRV_TRANSFER_WRK        EQU   4  Transfer work function requested @DGA          
SRV_GET_WRK             EQU   8  Get work function requested      @DGA          
SRV_REFRESH_WRK         EQU  16  Refresh work fcn requested       @DGA          
SRV_END_WRK             EQU  32  End work function requested      @DGA          
SRV_DEL_ENC             EQU  64  Delete Enclave Fcn requested     @DGA          
SRV_DISCONNECT          EQU 128  Disconnect from WLM              @PBA          
SRV_DISCONNECT_COND     EQU 256  Disconnect conditional from WLM  @PCA          
*                       EQU 512  Reserved for internal use        @PGA          
*                                See BPXZCONS                     @PGA          
*   Define equates for BPX1SLK syscall LockFcnCode parameter                    
SLK_OBTAIN              EQU   1  Obtain function request          @DZA          
SLK_OBTAIN_COND         EQU   2  Obtain conditional function req  @DZA          
SLK_INIT                EQU   4  Initialization function request  @DZA          
SLK_DESTROY             EQU   8  Destroy function request         @DZA          
SLK_RELEASE             EQU  16  Release function request         @DZA          
*   Define equates for BPX1SLK syscall LockReqType parameter                    
SLK_NORMAL              EQU   1  Normal request type              @DZA          
SLK_ERRORCHECK          EQU   2  Errorcheck request type          @DZA          
SLK_RECURSIVE           EQU   4  Recursive request type           @DZA          
*   Define equates for BPX1SLK syscall LockType parameter                       
SLK_EXCLUSIVE           EQU   1  Exclusive lock type              @DZA          
SLK_SHARED              EQU   2  Shared lock type                 @DZA          
*                                                                               
* Constants for BPX1PCT pfsctl                                                  
*                                                                               
*  Constants for BPXVRCAC - LFS Cache                             @DHA          
PC#ADDFILE              EQU X'80000007' Filecache cmd '80000007'x @PDC          
PC#DELETEFILE           EQU X'80000008' Filecache cmd '80000008'x @PDC          
PC#PURGECACHE           EQU X'8000000A' Filecache cmd '8000000A'x @PDC          
PC#REFRESHCACHE         EQU X'80000009' Filecache cmd '80000009'x @PDC          
PC#SHUTDOWNFILESYS      EQU X'8000000B' Soft Shutdown '8000000B'x @DVA          
PC#PfsRecycle           EQU X'8000000C' Shutdown PFS for recycle                
PC#PfsRestart           EQU X'8000000D' Restart the PFS                         
*                                                                               
PC#SETIBMASYIO          EQU X'C0000006' SetIbm AsyncIO 'C0000006'x@PDC          
PC#SETIBMOPTCMD         EQU X'C0000005' SetIBMOpt TCP  'C0000005'x@PDC          
PC#ERRORTEXT            EQU X'C000000B' Get error text 'C000000B'x@DNA          
*                                                     -1073741813 @DNA          
PC#SYSNAMES             EQU X'C000000E' Get sysnames   'C000000C'x@PxA          
PC#TDNAMES              EQU X'C000000F' GET CINET TDNAMES         @03A          
PC#HFSSTATS             EQU X'C0000010' GET HFS Stats             @PKA          
PC#BRLMSRVR             EQU X'C0000011' GET brlm server name      @PKA          
PC#SFSDIAG              EQU X'80000012' Shared-FS Diagnose        @DTA          
PC#USERSIGNAL           EQU X'C0000013' Set Lost Locks Signal(@05)@06A          
PC#DIRGETHOST           EQU X'C0000014' Directed GetHost          @06A          
PC#SHUTTINGDOWNFS       EQU X'C0000015' File system shutdown      @E7A          
PC#RECYCLEDONE          EQU X'C0000016' recycle is complete       @EDA          
*  PC#GetVnodeToken - Allocate Vde & insert an open                             
PC#GETVNODETOKEN        EQU X'80000017'                           @F2A          
*         inet6_is_srcaddr() function                             @F3A          
PC#ISSRCADDR            EQU X'C0000018' inet6_is_srcaddr          @F3A          
PC#OWNEROK              EQU X'C000001C' owner query               @POA          
PC#MODIFYPFS            EQU X'C000001D' F OMVS,PFS=               @F8A          
PC#THREADUNDUB          EQU X'C000001E' Reserved for Thread undub @F9A          
PC#EnablePgmAuth        EQU X'C000001F' Enable Program Authorization.           
*                                       Services will bypass user               
*                                       identity auth check if                  
*                                       invoked by authorized pgm.              
*                                       Invoking program must be                
*                                       authorized to use.        @09A          
PC#DisablePgmAuth       EQU X'C0000020' Disable Program Authorization.          
*                                       Invoking program does not               
*                                       need to be authorized.    @09A          
PC#RENAMEFS             EQU X'C0000021' Rename filesystem         @FAA          
PC#EnableFileAuth       EQU X'C0000025' Enable File Authorization.              
*                                       Services will be treated as             
*                                       a superuser when performing             
*                                       auth check for files if                 
*                                       invoked by authorized pgm.              
*                                       Invoking program must be                
*                                       authorized to enable.     @0BA          
PC#DisableFileAuth      EQU X'C0000026' Disable                                 
*                                       File Authorization.                     
*                                       Invoking program does not               
*                                       need to be authorized.    @0BA          
PC#STOPPFS              EQU X'C0000031' notify the pfs a STOPPFS  @FGA          
*                                       was issued                              
*  PC#ErrorText Subfunctions   - Request type:                                  
PC#ETDESC               EQU X'0000'     Get description text      @DNA          
PC#ETACTION             EQU X'0001'     Get action text           @DNA          
PC#ETMODNAME            EQU X'0002'     Get module name           @DNA          
*  PC#ErrorText Error code type                                                 
PC#ETREASON             EQU X'0000'     Reason code input         @DNA          
PC#ETERRNO              EQU X'0001'     Errno code input          @DNA          
*  PFS specific component ID for reason codes                                   
PC#COMPIDUNI            EQU X'E4'       unicode conversion        @F7A          
*  PC#ShuttingDownFS args                                                       
PC#TYPEFILESYS          EQU X'00000001' shutdown=filesys          @E7A          
PC#TYPEFILEOWNER        EQU X'00000002' shutdown=fileowner        @E7A          
PC#TYPEOMVS             EQU X'00000003' omvs shutdown             @E7A          
*                                                                               
* Constants for BPX1LOD  - HFS load - options                     @EFC          
*                                                                               
LOD_ERROR_ST_EXLINK     EQU X'80000000'  Error if sticky/ext lnk  @DRA          
LOD_IGNORE_STICKY       EQU X'40000000'  Skip sticky check        @DRA          
*                                                                               
*                                                                               
* Constants for BPX1LDX  - extended HFS load - options            @EFC          
*                          and directed load returned parameters                
*                                                                               
LOD_DIRECTED            EQU X'20000000'  Directed loadhfs         @ECA          
*                                                                               
DIRECTEDLOADRETURNEDPARMS   DSECT ,                               @ECA          
DIRECTEDLOADMODULELENGTH64  DS  FD Directed Load Mod Len AMODE64  @ECA          
                            ORG DIRECTEDLOADMODULELENGTH64        @ECA          
                            DS  F                                 @ECA          
DIRECTEDLOADMODULELENGTH    DS  F  Directed Load Mod Len AMODE31  @ECA          
*                                                                               
DIRECTEDLOADMODULESTART64   DS  AD Directed Load Mod Start AMODE64@ECA          
                            ORG DIRECTEDLOADMODULESTART64         @ECA          
                            DS  F                                 @ECA          
DIRECTEDLOADMODULESTART     DS  A  Directed Load Mod Start AMODE31@ECA          
*                                                                               
DIRECTEDLOADMODULEENTRYPT64 DS  AD Directed Load Mod Entry AMODE64@ECA          
                            ORG DIRECTEDLOADMODULEENTRYPT64       @ECA          
                            DS  F                                 @ECA          
DIRECTEDLOADMODULEENTRYPT   DS  A  Directed Load Mod Entry AMODE31@ECA          
*                                                                               
* Constants for BPX1DSD                                           @DPA          
*                                                                               
SW_SIGDLV_ENABLE#       EQU 1                                     @DPA          
SW_SIGDLV_DISABLE#      EQU 2                                     @DPA          
*                                                                               
*   Define equates for BPX1OSE syscall function_code parameter                  
OSENV_GET               EQU   1  get function                     @DQA          
OSENV_SET               EQU   2  set function                     @DQA          
OSENV_UNSET             EQU   4  unset function                   @DQA          
OSENV_PERSIST           EQU   8  persist function                 @DQA          
OSENV_UNPERSIST         EQU   16 unpersist function               @DQA          
*   Define equates for BPX1OSE syscall Request_Flags parameter                  
OSENV_WLM               EQU   1  WLM Enclave membership           @DQA          
OSENV_SECURITY          EQU   2  pthread security environment     @DQA          
*                                                                               
*   Define equates for BPX1PQG syscall RequestType parameter                    
THDQ_FREEZE             EQU   2  Freezes the threads identified in              
*                                the THDQ Data List array (BPXYTHDQ)            
*                                                                 @DUA          
THDQ_UNFREEZE_ALL       EQU   8  Unfreezes all threads that are frozen          
*                                in the caller process            @DUA          
THDQ_GET_STATE          EQU   1  Retrieves the state data for the               
*                                threads identified in the THDQ data            
*                                list array or for all threads.                 
*                                This value can only be specified with          
*                                THDQ_FREEZE                      @DUA          
*                                                                               
** BPXYCONS End                                                                 
         SPACE 3                                                                
         AIF   ('&LIST' EQ 'YES').E411                        6@D1A             
         POP   PRINT                                                            
.E411    ANOP  ,                                                                
         MEND  ,                  Terminating PL/X comment           */         
*%CONSPLS : ;                                                                   
*%IF AsaxmacP64 = ''                                          /* @ECA*/         
*   %Then %AsaxmacP64 = 'Char(8)';                            /* @ECA*/         
*%IF AsaxmacF64 = ''                                          /* @ECA*/         
*   %Then %AsaxmacF64 = 'Char(8)';                            /* @ECA*/         
*%IF AsaxmacF63 = ''                                          /* @ECA*/         
*   %Then %AsaxmacF63 = 'Char(8)';                            /* @ECA*/         
*Declare                                                                        
*  DFLT_ARG_MAX Fixed(31) Constant(1048576), /* Constant for default            
*                                   ARG_MAX (1M)                 @EGC*/         
*  DFLT_CHILD_MAX Fixed(31) CONSTANT(6), /* Constant for default                
*                                   CHILD_MAX (_POSIX_CHILD_MAX)     */         
*  DFLT_CLK_TCK Fixed(31) CONSTANT(100),  /* Constant for default               
*                                   CLK_TCK (100 ticks per second)   */         
*  DFLT_NGROUPS_MAX Fixed(31) CONSTANT(8191), /* Constant for default           
*                                   NGROUPS_MAX (RACF maximum value) */         
*  DFLT_OPEN_MAX Fixed(31) CONSTANT(16), /* Constant for default                
*                                   OPEN_MAX (_POSIX_OPEN_MAX)       */         
*  DFLT_TZNAME_MAX Fixed(31) CONSTANT(9), /* Constant for default               
*                                   TZNAME_MAX                       */         
*  DFLT_JOB_CONTROL Fixed(31) CONSTANT(1), /* Constant for default              
*                                   JOB_CONTROL                      */         
*  DFLT_SAVED_IDS Fixed(31) CONSTANT(1), /* Constant for default                
*                                   SAVED_IDS                        */         
*  DFLT_VERSION Fixed(31) CONSTANT(199009), /* Constant for default             
*                                   VERSION                          */         
*  DFLT_THREAD_TASKS_NP Fixed(31) CONSTANT(50), /* Constant for default         
*                                    THREAD_TASKS_MAX_NP             */         
*  DFLT_USERIDLEN_MAX   Fixed(31) Constant(8),  /* Max chars allowed            
*                                                  for USERID    @DKA*/         
*  DFLT_PASSWDLEN_MAX   Fixed(31) Constant(8),  /* Max chars allowed            
*                                                  for Password  @DKA*/         
*  DFLT_PASSWDPHRLEN_MAX Fixed(31) Constant(100), /* Max chars allowed          
*                                            for password phrase @EBA*/         
*  DFLT_2_CHAR_TERM Fixed(31) CONSTANT(1); /* Constant for default              
*                                    2_CHAR_TERM            @P7C @P1A*/         
*Declare                                                                        
*  SC_ARG_MAX Fixed(31) CONSTANT(1),  /* Constant for querying                  
*                                   ARG_MAX from sysconf()           */         
*  SC_CHILD_MAX Fixed(31) CONSTANT(2),  /* Constant for querying                
*                                   CHILD_MAX from sysconf()         */         
*  SC_CLK_TCK Fixed(31) CONSTANT(3),    /* Constant for querying                
*                                   CLK_TCK from sysconf()           */         
*  SC_JOB_CONTROL Fixed(31) CONSTANT(4), /* Constant for querying               
*                                   JOB_CONTROL from sysconf()       */         
*  SC_NGROUPS_MAX Fixed(31) CONSTANT(5), /* Constant for querying               
*                                   NGROUPS_MAX from sysconf()       */         
*  SC_OPEN_MAX Fixed(31) CONSTANT(6), /* Constant for querying                  
*                                   OPEN_MAX from sysconf()          */         
*  SC_SAVED_IDS Fixed(31) CONSTANT(7), /* Constant for querying                 
*                                   SAVED_IDS from sysconf()         */         
*  SC_TZNAME_MAX Fixed(31) CONSTANT(9), /* Constant for querying                
*                                   TZNAME_MAX from sysconf()        */         
*  SC_VERSION Fixed(31) CONSTANT(10), /* Constant for querying                  
*                                   VERSION from sysconf()           */         
*  SC_THREAD_TASKS_MAX_NP Fixed(31) CONSTANT(11),/* Constant to query           
*                                    THREAD_TASKS_MAX from sysconf() */         
*  SC_2_CHAR_TERM Fixed(31) CONSTANT(12), /* Constant to query                  
*                                    2_CHAR_TERM from sysconf()  @P1A*/         
*  SC_THREADS_MAX_NP      Fixed(31) CONSTANT(13),/* Constant to query           
*                                  THREADS_MAX_NP from sysconf() @D5A*/         
*  SC_MMAP_MEM_MAX        Fixed(31) CONSTANT(14), /* Constant to query          
*                                  MMAP_STG_MAX                  @DAA*/         
*  SC_TTY_GROUP           Fixed(31) CONSTANT(15), /* Constant to query          
*                                  TTY_GROUP                     @DEA*/         
*  SC_PAGESIZE            Fixed(31) CONSTANT(16), /* Constant to query          
*                                  Page Size                     @D2A*/         
*  SC_PAGE_SIZE           Fixed(31) CONSTANT(16); /* Constant to query          
*                                  Page Size                     @D2A*/         
*                                                                               
*Declare                            /*  wait extension function codes           
*                                                                @DCA*/         
*  #WAIT3        Fixed(32) Constant(1), /* wait3() function code @DCA*/         
*  #WAITID       Fixed(32) Constant(2), /* waitid() function cde @DCA*/         
*  #WAIT4        Fixed(32) Constant(3); /* wait4() function code @FPA*/         
*Declare                            /*  WUNCTRACED/WNOHANG           */         
*  WNOHANG       Fixed(32) Constant(1),                                         
*  WUNTRACED     Fixed(32) Constant(2),                                         
*  WCONTINUED    Fixed(32) Constant(4),  /* wait for a continued child          
*                                                                @DCA*/         
*  WEXITED       Fixed(32) Constant(8),  /* wait for processes that             
*                                  have exited                   @DCA*/         
*  WSTOPPED      Fixed(32) Constant(16), /* wait for child process that         
*                                  has stopped                   @DCA*/         
*  WNOWAIT       Fixed(32) Constant(32); /* Wait, return status of a            
*                                  child without changing the state.            
*                                  The child can be waited for again            
*                                  later.                        @DCA*/         
*Declare                            /*  waitid() id_type options @DCA*/         
*  P_PID         Fixed(32) Constant(0),  /* wait for the child with a           
*                                  process ID                    @DCA*/         
*  P_PGID        Fixed(32) Constant(1),  /* wait for any child with a           
*                                  process group ID              @DCA*/         
*  P_ALL         Fixed(32) Constant(2);  /* wait for any child   @DCA*/         
*Declare                            /*  BPX1PTX Options              */         
*  PTEXITTHREAD   Fixed(32) Constant(0),                                        
*  PTGETNEWTHREAD Fixed(32) Constant(1),                                        
*  PTFAILIFLASTTHREAD Fixed(32) Constant(2);                 /*  @D4A*/         
*Declare                            /*  Quiesce threads types        */         
*  QUIESCE_TERM    Fixed(32) Constant(1),                                       
*  QUIESCE_FORCE   Fixed(32) Constant(2),                                       
*  QUIESCE_QUERY   Fixed(32) Constant(3), /* pthread_query alias @P4C*/         
*  PTHREAD_QUERY   Fixed(32) Constant(3), /* new query name      @P4A*/         
*  QUIESCE_FREEZE  Fixed(32) Constant(4),                     /* @D6A*/         
*  QUIESCE_UNFREEZE Fixed(32) Constant(5),                    /* @D6A*/         
*  FREEZE_THIS_THREAD Fixed(32) Constant(6),                  /* @D6A*/         
*  FREEZE_EXIT Fixed(32) Constant(8), /* Skip 7, see BPXZCONS    @P6A*/         
*  QUIESCE_SRB Fixed(32) Constant(9);                         /* @DGA*/         
*                                   /* Skip 10-11 see BPXZCONS   @DYA*/         
*DECLARE                            /*  Pthread cancellation type    */         
*  PTHREAD_INTR_ENABLE#       FIXED(32) CONSTANT(0), /* Enabled      */         
*  PTHREAD_INTR_DISABLE#      FIXED(32) CONSTANT(1), /* Disabled     */         
*  PTHREAD_INTR_CONTROLLED#   FIXED(32) CONSTANT(0), /* controlled   */         
*  PTHREAD_INTR_ASYNCHRONOUS# FIXED(32) CONSTANT(1); /* Asynchronous */         
*Declare                            /*  Dub default service settings */         
*  DUBTHREAD Fixed(32) Constant(0),  /* Dub a thread default setting            
*                                                                @L1A*/         
*  DUBPROCESS Fixed(32) Constant(1), /* Dub a process default setting           
*                                                                @L1A*/         
*  DUBTASKACEE Fixed(32) Constant(2), /* Dub each thread task's ACEE            
*                                         (Init_USP) setting     @02A*/         
*  DUBPROCESSDEFER Fixed(32) Constant(4), /* Defer process dub   @04A*/         
*  DUBNOSIGNALS    Fixed(32) Constant(8), /* no signals          @DWA*/         
*  DUBNODUBLOW     Fixed(32) Constant(16),/* Start of range of non-             
*                                            dubbing options     @DYA*/         
*  DUBJOBPERM      Fixed(32) Constant(16),/* Dub as a permanent Job             
*                                                                @DYA*/         
*  DUBNOJSTUNDUB   Fixed(32) Constant(32),/* Dub process such that              
*                                         jobstep does not get undubbed         
*                                         when last non-jst undubs              
*                                                                @DYA*/         
*  DUBABENDCALLS   Fixed(32) Constant(64), /* Dub process such that             
*                                         system calls abend during             
*                                         a shutdown/restart window             
*                                                                @DYA*/         
*  DUBUNIQUEACEE   Fixed(32) Constant(128), /* None of the tasks in the         
*                        address space share ACEEs               @07A*/         
*  DUBFAILNOTREADY Fixed(32) Constant(256),/* Fail dub if kernel not            
*                                            ready               @F1A*/         
*  DUBNODUBRSV3    Fixed(32) Constant(512),/* Reserved for non-dubbing          
*                                            option              @DYA*/         
*  DUBNODUBHIGH    Fixed(32) Constant(512);/* End of range of non-              
*                                            dubbing options     @DYA*/         
*Declare                             /*  STL Actions             @D7A*/         
*  STL_MAX_TASKS   Fixed(32) Constant(1), /* Replace Task limit  @D7A*/         
*  STL_MAX_THREADS Fixed(32) Constant(2), /* Replace thread limit               
*                                                                @D7A*/         
*  STL_SET_BOTH    Fixed(32) Constant(3); /* Replace both limits @D7A*/         
*                                                                               
*Declare                             /*  NICE Zero Value         @D7A*/         
*  NICE_ZERO       Fixed(32) Constant(20); /*Default Process Scheduling         
*                                             Priority           @D8A*/         
*Declare                       /* Setprio/Getprio Which values   @D8A*/         
*  PRIO_PROCESS    Fixed(32) Constant(1), /* Looking for a specific             
*                                            process             @D8A*/         
*  PRIO_PGRP       Fixed(32) Constant(2), /* Looking for processes in           
*                                            a process group     @D8A*/         
*  PRIO_USER       Fixed(32) Constant(3); /* Looking for processes for          
*                                            a user ID           @D8A*/         
*Declare                       /* Chpriority PriorityType Values @DBA*/         
*  CPRIO_ABSOLUTE  Fixed(32) Constant(1), /* Priority value is an               
*                                            absolute value      @DBA*/         
*  CPRIO_RELATIVE  Fixed(32) Constant(2); /* Priority value is a                
*                                            relative value      @DBA*/         
*Declare                       /* memory map protect values          */         
*  PROT_READ     Fixed(32) Constant(1), /* Mapped data can be read              
*                                                                @DAA*/         
*  PROT_WRITE    Fixed(32) Constant(2), /* Mapped data can be                   
*                                          written               @DAA*/         
*  PROT_NONE     Fixed(32) Constant(4), /* Mapped data cannot be                
*                                          accessed              @DAA*/         
*  PROT_EXEC     Fixed(32) Constant(8); /* Mapped data can be                   
*                                          executed. Treated same as            
*                                          PROT_READ.            @DAA*/         
*Declare                       /* memory map map_type values         */         
*  MAP_PRIVATE   Fixed(32) Constant(1), /* Changes to mapped data               
*                                          are private           @DAA*/         
*  MAP_SHARED    Fixed(32) Constant(2), /* Changes to mapped data               
*                                          are shared            @DAA*/         
*  MAP_FIXED     Fixed(32) Constant(4), /* Interpret map address                
*                                          exactly               @DAA*/         
*  MAP_MEGA     Fixed(32) Constant(8), /* Use megabyte allocations              
*                                                                @D4A*/         
*  MAP_64       Fixed(32) Constant(16); /* Above the bar features               
*                                                                @FHA*/         
*Declare                       /* memory map msync options           */         
*  MS_SYNC       Fixed(32) Constant(1), /* Performs synchronous                 
*                                          writes                @DAA*/         
*  MS_ASYNC      Fixed(32) Constant(2), /* Performs asynchronous                
*                                          writes                @DAA*/         
*  MS_INVALIDATE Fixed(32) Constant(4); /* Invalidate the cached                
*                                          memory mapped pages   @DAA*/         
*Declare                       /* spawn constants                @D9A*/         
*  SPAWN_FDCLOSED Fixed(31) Constant(-1); /* Do not inherit this                
*                                            file descriptor     @D9A*/         
*Declare                                                                        
*  RLIMIT_CORE   Fixed(32) Constant(4), /* Limit size of core dump              
*                                                                @DBA*/         
*  RLIMIT_CPU    Fixed(32) Constant(0), /* Limit CPU time per process           
*                                                                @DBA*/         
*  RLIMIT_FSIZE  Fixed(32) Constant(1), /* Limit file size                      
*                                                                @DBA*/         
*  RLIMIT_NOFILE Fixed(32) Constant(6), /* Limit number of open files           
*                                                                @DBA*/         
*  RLIMIT_AS     Fixed(32) Constant(5), /* Limit address space size             
*                                                                @DBA*/         
*  RLIMIT_MEMLIMIT Fixed(32) Constant(7); /* Limit storage above the            
*                                            2 Gigabyte bar      @E0A*/         
*Declare                                                                        
*  RLIM_INFINITY Fixed(32) Constant(2147483647); /* No limit value              
*                                                                @DBA*/         
* Declare                                                                       
*   RUSAGE_SELF   Fixed(31) Constant(0), /* Rusage for current process          
*                                                                @DBA*/         
*   RUSAGE_CHILDREN Fixed(31) Constant(-1); /* Rusage for terminated            
*                                          children              @DBA*/         
*/*   Define constants for querydub output status                    */         
*                                                                               
*Declare                                                                        
*  QDB_DUBBED_FIRST   Fixed(32) Constant(1), /* Task has already been           
*                               dubbed. This task and this RB caused            
*                               the dub.                        @DCA*/          
*  QDB_DUBBED         Fixed(32) Constant(2), /* Task has already been           
*                               dubbed. Other task or other RB caused           
*                               the dub.                        @DCA*/          
*  QDB_DUB_MAY_FAIL   Fixed(32) Constant(4), /* Task has not been               
*                               dubbed, but may fail if attempted.              
*                               Most likely reason for failure is               
*                               a missing or incomplete user                    
*                               security profile, or                            
*                               OMVS segment not defined.        @DCA*/         
*  QDB_DUB_OKAY       Fixed(32) Constant(8), /* Task has not been               
*                               dubbed, and should succeed if attempted         
*                                                                @DCA*/         
*  QDB_DUB_AS_PROCESS Fixed(32) Constant(16), /* Task has not been              
*                               dubbed, but its address space has.              
*                               New task will dub as another                    
*                               process within the address space @DCA*/         
*  QDB_DUB_AS_THREAD  Fixed(32) Constant(32); /* Task has not been              
*                               dubbed, but its address space has.              
*                               New task will dub a thread within               
*                               the process                      @DCA*/         
*                                                                               
*/*   Define constants for oe_env_np syscall function codes          */         
*                                                                               
* Declare                                                                       
*   ENQWAIT_PROCESS   Fixed(32) Constant(1), /* Examine/Change ENQ wait         
*                                interruption state for the callers             
*                                process                         @P6A*/         
*   FREEZE_EXIT_REG   Fixed(32) Constant(2), /* Register/deregister an          
*                                exit for pthread_quiesce(freeze_exit)          
*                                                                @P6A*/         
*   MVS_USERID        Fixed(32) Constant(3), /* Retrieve the MVS                
*                                userid of the invoker           @P6A*/         
*   ENV_TOGGLE_SEC    Fixed(32) Constant(4), /* Toggle between task and         
*                                process security environments   @P7A*/         
*   DFP_CLEANUP_EXIT_REG Fixed(32) Constant(5), /* Register DFP                 
*                                Close Cleanup Exit              @01A*/         
*   BPXK_PARAMETER  Fixed(32) Constant(6), /* Env Vars to Kernel @DJC*/         
*   ENV_STOR_SERVICE  Fixed(32) Constant(7), /* Swappable or                    
*                                non-swappable  address space    @DUC*/         
*   QUICK_FREEZE_EXIT_REG Fixed(32) Constant(8), /* Register/deregister         
*                                an exit for pthread quiesce_and_get            
*                                                                @DUA*/         
*   SHUTDOWN_REG Fixed(32) Constant(9), /* Register/block for shutdown          
*                                                                    */         
*   WRITE_DOWN   Fixed(32) Constant(10), /* write_down service for MLS          
*                                                                @E5A*/         
*   PIDXFER_QUERY     Fixed(32) Constant(11), /* Query if the callers           
*                                process was PIDXFERed           @DXA*/         
*   QUERY_MODE        Fixed(32) Constant(12), /* Query AMODE/RMODE and          
*                                AMODE capability of target PID  @E1A*/         
*   MUST_STAY_CLEAN   Fixed(32) Constant(13), /* ENABLE/QUERY                   
*                                Must Stay Clean state of invoking              
*                                process                         @E9A*/         
*   XPLATFORM_PROCESS Fixed(32) Constant(14); /* ENABLE/QUERY                   
*                                XPlatform level for the caller's               
*                                process                         @FRA*/         
*                                                                               
*/*  Define constants for XPLATFORM_PROCESS function of BPX1ENV  @FRA*/         
*                                                                               
* DECLARE                                                                       
*   XPLATFORM_MAX     Fixed Constant(1); /* Maximum supported                   
*                                XPLATFORM level                 @FRA*/         
*                                                                               
*/*  Define constants for Must Stay Clean function of BPX1ENV    @E9A*/         
*                                                                               
* DECLARE                                                                       
*   MSC_QUERY         Fixed Constant(0), /* Query state          @E9A*/         
*   MSC_ENABLE        Fixed Constant(1); /* Enable state         @E9A*/         
* DECLARE                                                                       
*   MSC_DISABLED      Fixed Constant(0), /* State disabled       @E9A*/         
*   MSC_ENABLED       Fixed Constant(1), /* State enabled even across           
*                                           Job Step termination @E5A*/         
*   MSC_ENABLED_COND  Fixed Constant(2); /* State enabled conditionally         
*                                           JST will disable     @E5A*/         
*                                                                               
*/*  Define constants for writedown registration function of BPX1ENV */         
*                                                                               
* DECLARE                                                                       
*   WD_OUERY          Fixed Constant(0), /* query write_down     @E5A*/         
*   WD_ACTIVATE       Fixed Constant(1), /* activate write_down  @E5A*/         
*   WD_INACTIVATE     Fixed Constant(2), /* inactivate write_down               
*                                                                @E5A*/         
*   WD_RESET          Fixed Constant(3); /* reset write_down to                 
*                                           default              @E5A*/         
* DECLARE                                                                       
*   WD_SCOPE_AS       Fixed Constant(1), /* target ACEE is AS    @E5A*/         
*   WD_SCOPE_THD      Fixed Constant(2); /* target ACEE is task  @E5A*/         
*                                                                               
* DECLARE                                                                       
*   WD_IS_ACTIVE      Fixed Constant(1), /* query result: active @E5A*/         
*   WD_IS_INACTIVE    Fixed Constant(0); /* query result: inact  @E5A*/         
*/*   Define constants for shutdown registration function of BPX1ENV */         
*                                                                               
* DECLARE                                                                       
*   ENV_RegisterBlock Fixed Constant(1), /* Reg block            @DYA*/         
*   ENV_RegisterPermP Fixed Constant(2), /* Reg permanent proc   @DYA*/         
*   ENV_DeRegisterBlock Fixed Constant(3), /* DeReg block        @DYA*/         
*   ENV_DeRegisterPermP Fixed Constant(4), /* DeReg permanent proc   */         
*   ENV_RegisterNotify Fixed Constant(5), /* Reg Notify          @DYA*/         
*   ENV_DeRegisterNotify Fixed Constant(6); /* DeReg Notify      @DYA*/         
* DECLARE                                                                       
*   ENV_RegisterJob Fixed Constant(1),  /* Reg job               @DYA*/         
*   ENV_RegisterProc Fixed Constant(2); /* Reg process           @DYA*/         
*                                                                               
*/*   Define constants for Task Security syscal function codes       */         
* Declare                                                                       
*     TLS_CREATE_THREAD_SEC#          /* Build Task Security     @P7A*/         
*                       Fixed(32) Constant(1),                                  
*     TLS_DELETE_THREAD_SEC#          /* Delete Task Security    @P7A*/         
*                       Fixed(32) Constant(2),                                  
*     TLS_TASK_ACEE#                  /* Set Posix identity      @DYA*/         
*                       Fixed(32) Constant(3),                                  
*     TLS_TASK_ACEE_USP#              /* Set Posix identity      @E6A*/         
*                       Fixed(32) Constant(4),                                  
*     TLS_DAEMON_THREAD_SEC#          /* Bld Unauthenticated sec @E8A*/         
*                       Fixed(32) Constant(5),                                  
*     TLS_IDENTITY_USERID#            /* User identity:          @P7A*/         
*                       Fixed(32) Constant(1), /* 1-8 char userid    */         
*     TLS_IDENTITY_UID#               /* User identity:          @P7A*/         
*                       Fixed(32) Constant(2), /* 4-byte uid         */         
*     TLS_IDENTITY_UUID#              /* User identity:          @P7A*/         
*                       Fixed(32) Constant(3), /* x-byte uuid        */         
*     TLS_IDENTITY_CERT#              /* User identity:          @PFA*/         
*                       Fixed(32) Constant(4); /* CERT stucture  @PFA*/         
*                                                                               
*/*   Define constants for __Security syscall                    @DKA*/         
*/*   __Security Function Codes                                  @DKA*/         
*Dcl SECURITY_CREATE#         Fixed(32) Constant(1),                            
*    SECURITY_CERTREG#        Fixed(32) Constant(2),          /* @DOA*/         
*    SECURITY_CERTDEREG#      Fixed(32) Constant(3),          /* @DOA*/         
*    SECURITY_CERTAUTH#       Fixed(32) Constant(4),          /* @E3A*/         
*/*   __Security user identities                                 @DKA*/         
*    SECURITY_USERID#         Fixed(32) Constant(1),                            
*    SECURITY_CERTIFICATE#    Fixed(32) Constant(2);          /* @DKA*/         
*                                                                               
*/*   Define constants for __pid_affinity (BPX1PAF) syscall functions*/         
*                                                                               
* Declare                                                                       
*     PAF_ADD_PID#                    /* Add PID to list         @DMA*/         
*                       Fixed(32) Constant(1),                                  
*     PAF_DELETE_PID#                 /* Delete PID from list    @DMA*/         
*                       Fixed(32) Constant(2);                                  
*                                                                               
*/*   Define constants for convert_id_np (BPX1CID) syscall functions */         
*                                                                               
* Declare                                                                       
*     CID_GET_UUID#                   /* Retrieve UUID           @P8A*/         
*                       Fixed(32) Constant(1),                                  
*     CID_GET_USERID#                 /* Retrieve userid         @P8A*/         
*                       Fixed(32) Constant(2);                                  
*                                                                               
*/* Define constants for auth_check_resource_np  (BPX1ACK) syscall              
*   access types                                                     */         
*                                                                               
* Declare                                                                       
*     ACK_READ#                       /* Test READ access        @P8A*/         
*                       Fixed(32) Constant(1),                                  
*     ACK_UPDATE#                     /* Test UPDATE access      @P8A*/         
*                       Fixed(32) Constant(2),                                  
*     ACK_CONTROL#                    /* Test CONTROL access     @P8A*/         
*                       Fixed(32) Constant(3),                                  
*     ACK_ALTER#                      /* Test ALTER access       @P8A*/         
*                       Fixed(32) Constant(4);                                  
*                                                                               
*/*   Define constants for versions of OSMF on BPXESMF syscall       */         
*                                                                               
* Declare                                                                       
*   OSMF_VER_HOM1110  Fixed(8)  Constant(1), /* Version 1 of OSMF, used         
*                                               in HOM1110       @P5A*/         
*   OSMF_VER_HOM1120  Fixed(8)  Constant(2), /* Version 2 of OSMF, used         
*                                               in HOM1120       @P5A*/         
*   OSMF_VER_HOM1130  Fixed(8)  Constant(3); /* Version 3 of OSMF, used         
*                                               in HOM1130       @P5A*/         
*                                                                               
*/*   The high order two bytes of the reason codes returned by                  
*     OpenMVS services contains a value that is used to qualify                 
*     the contents of the low order two bytes. If the contents of               
*     the high-order two bytes are within the range of #CMID_LO to              
*     #CMID_HI, the error represented by the reason code is defined             
*     by OpenMVS. If the contents of the high order two bytes lie               
*     outside the range, the error represented by the reason code               
*     is not an OpenMVS reason code.                                 */         
*DECLARE                                                                        
*  #CMID_LOW  Fixed(32) Constant(0000x), /* Low range                */         
*  #CMID_HI   Fixed(32) Constant(20FFx); /* High range               */         
*                                                                               
*/*   Define constants for Console Communication service             */         
*                                                                               
* Declare                                                                       
*     CC_Max_Msg_Length                                                         
*         Fixed(32) Constant(17850);/* Max Wto string length for SUs            
*                                                                @DIC*/         
* Declare                                                                       
*     CC_Max_Msg_Length_NonSU                                                   
*         Fixed(32) Constant(17780);/* Max Wto string length for NonSUs         
*                                                                @DIC*/         
* Declare                                                                       
*     CC_Modify_Buffer_Length                                                   
*         Fixed(32) Constant(128);/* Length of Modify Buffer     @DFA*/         
* Declare                                                                       
*     CONSOLE_MODIFY                                                            
*         Fixed(32) Constant(1);/* Service interrupted by Modify @DFA*/         
* Declare                                                                       
*     CONSOLE_STOP                                                              
*         Fixed(32) Constant(2);/* Service interrupted by Stop   @DFA*/         
*                                                                               
*/********************************************************************/         
*/*   Define constants for srv_ callable service interfaces      @DGA*/         
*/********************************************************************/         
* Declare   /* Constants for srvinit_np() ManagerType parameter  @DGA*/         
*    SRV_WORKMGR                                                                
*       Fixed(32) Constant(1),/* Work Manager services requested @DGA*/         
*    SRV_QUEUEMGR                                                               
*       Fixed(32) Constant(2),/* Queue Mgr services requested    @DGA*/         
*    SRV_SERVERMGR                                                              
*       Fixed(32) Constant(4),/* Server Mgr services requested   @DGA*/         
*    SRV_SERVERMGRDYNAMIC                                                       
*       Fixed(32) Constant(8);/* Server Mgr With Dynamic mngt    @DSA*/         
*                                                                               
* Declare   /* Constants for srvpwu_np() FcnCode parameter       @DGA*/         
*    SRV_PUT_NEWWRK                                                             
*       Fixed(32) Constant(1),/* Put new work function requested @DGA*/         
*    SRV_PUT_SUBWRK                                                             
*       Fixed(32) Constant(2),/* Put sub work function requested @DGA*/         
*    SRV_TRANSFER_WRK                                                           
*       Fixed(32) Constant(4),/* Transfer work function requested@DGA*/         
*    SRV_GET_WRK                                                                
*       Fixed(32) Constant(8),/* Get work function requested     @DGA*/         
*    SRV_REFRESH_WRK                                                            
*       Fixed(32) Constant(16),/* Refresh work fcn requested     @DGA*/         
*    SRV_END_WRK                                                                
*       Fixed(32) Constant(32),/* End work function requested    @DGA*/         
*    SRV_DEL_ENC                                                                
*       Fixed(32) Constant(64),/* Delete Enclave Fcn requested   @DGA*/         
*    SRV_DISCONNECT                                                             
*       Fixed(32) Constant(128),/* Disconnect from WLM           @PBA*/         
*    SRV_DISCONNECT_COND                                                        
*       Fixed(32) Constant(256),/* Disconnect conditional from WLM              
*                                                                @PCA*/         
*    SRV_RESERVED_4_INTERNAL_USE                                                
*       Fixed(32) Constant(512);/* See BPXZCONS                                 
*                                                                @PGA*/         
*/********************************************************************/         
*/* Constants for BPX1PCT pfsctl                                 @03A*/         
*/********************************************************************/         
*/* Constants for BPXVRCAC - LFS Cache                           @DHA*/         
*Dcl                                                                            
*  PC#AddFile       Bit(32) Constant('80000007'X),            /* @DHA*/         
*  PC#DeleteFile    Bit(32) Constant('80000008'X),            /* @DHA*/         
*  PC#RefreshCache  Bit(32) Constant('80000009'X),            /* @DHA*/         
*  PC#PurgeCache    Bit(32) Constant('8000000A'X);            /* @DHA*/         
*                                                                               
*/* Misc other function codes                                    @03A*/         
*Dcl                                                                            
*  PC#SetIbmOptCmd  Bit(32) Constant('C0000005'X),            /* @DHA*/         
*  PC#SetIbmAsyIO   Bit(32) Constant('C0000006'X),            /* @DHA*/         
*  PC#ErrorText     Bit(32) Constant('C000000B'X),            /* @DNA*/         
*  PC#ShutdownFileSys  Bit(32) Constant('8000000B'X),         /* @DVA*/         
*  PC#PfsRecycle    Bit(32) Constant('8000000C'x),            /* @PHA*/         
*  PC#PfsRestart    Bit(32) Constant('8000000D'x),            /* @PHA*/         
*  PC#HfsStats      Bit(32) Constant('C0000010'X),            /* @PKA*/         
*  PC#BrlmSrvr      Bit(32) Constant('C0000011'X),            /* @PKA*/         
*  PC#SysNames      Bit(32) Constant('C000000E'X),            /* @PxA*/         
*  PC#TdNames       Bit(32) Constant('C000000F'X),            /* @03A*/         
*  PC#SfsDiag       Bit(32) Constant('80000012'X),            /* @DTA*/         
*  PC#UserSignal    Bit(32) Constant('C0000013'X),            /* @05A*/         
*  PC#DirGetHost    Bit(32) Constant('C0000014'X),            /* @06A*/         
*  PC#ShuttingDownFs  Bit(32) Constant('C0000015'X),          /* @E7A*/         
*  PC#RecycleDone     Bit(32) Constant('C0000016'X),          /* @EDA*/         
*  PC#GetVnodeToken   Bit(32) Constant('80000017'X),          /* @F2A*/         
*      /* inet6_is_srcaddr() function                            @F3A*/         
*  PC#IsSrcAddr       Bit(32) Constant('C0000018'X),          /* @F3A*/         
*  PC#IOcounts        Bit(32) Constant('80000019'X),          /* @F4A*/         
*  PC#MntFailCd       Bit(32) Constant('C000001A'X),          /* @F5A*/         
*  PC#ResolveSym      Bit(32) Constant('C000001B'X),          /* @F6A*/         
*  PC#OwnerOK         Bit(32) Constant('C000001C'X),          /* @POA*/         
*  PC#ModifyPFS       Bit(32) Constant('C000001D'x),          /* @F8A*/         
*  PC#ThreadUndub     Bit(32) Constant('C000001E'x),          /* @F9A*/         
*  PC#EnablePgmAuth   Bit(32) Constant('C000001F'x),/* Enable                   
*                                         Program Authorization.                
*                                         Services will bypass user             
*                                         identity auth check if                
*                                         invoked by authorized pgm.            
*                                         Invoking program must be              
*                                         authorized to enable.  @09A*/         
*  PC#DisablePgmAuth  Bit(32) Constant('C0000020'x),/* Disable                  
*                                         Program Authorization.                
*                                         Invoking program does not             
*                                         need to be authorized. @09A*/         
*  PC#RenameFS        Bit(32) Constant('C0000021'x),/* rename filesys           
*                                                                @FAA*/         
*  /* HFS to zFS migration functions  */                                        
*  PC#Migration   Bit(32) Constant('80000022'x),               /*@FCA*/         
*  PC#QueryMigration   Bit(32) Constant('C0000023'x),          /*@FCA*/         
*  /* Check if the mount parms specified are valid */                           
*  PC#ValidateMntParms Bit(32) Constant('C0000024'x),          /*@FCA*/         
*                                                                               
*  PC#EnableFileAuth  Bit(32) Constant('C0000025'x),/* Enable File              
*                                         Authorization. Services               
*                                         will be treadted as a                 
*                                         superuser when performing             
*                                         auth check for files if               
*                                         invoked by authorized pgm.            
*                                         Invoking program must be              
*                                         authorized to enable.  @0BA*/         
*  PC#DisableFileAuth Bit(32) Constant('C0000026'x),/* Disable                  
*                                         File Authorization.                   
*                                         Invoking program does not             
*                                         need to be authorized. @0BA*/         
*                                                                               
*  /* zFS to zFS migration start and stop functions */                          
*  PC#MigStart    Bit(32) Constant('80000027'x),               /*@FFC*/         
*  PC#MigStop     Bit(32) Constant('80000028'x),               /*@FFC*/         
*                                                                               
*  PC#RemountDone Bit(32) Constant('80000029'x),/* Notify PFS remount           
*                                                  was complete  @FIA*/         
*                                                                               
*  PC#InetdUnsecureSrvc Bit(32) Constant('80000030'x),/* Configd                
*                                        Unsecure Inetd Services @0AA*/         
*  PC#STOPPFS  Bit(32) Constant('C0000031'x), /* notify the PFS a               
*                                          STOPPFS was issued    @FGA*/         
*  PC#DISABLEUFS Bit(32) Constant('80000032'x); /* notify the UFS that          
*                                       a FS in the union was unmounted         
*                                       and all operations should be            
*                                       disabled                @FJA */         
*                                                                               
*Dcl   /* PC#ErrorText Subfunctions   - Request type, get:      6@03M*/         
*  PC#EtDesc        Bit(16) Constant('0000'X),  /* Description   @DNA*/         
*  PC#EtAction      Bit(16) Constant('0001'X),  /* Action        @DNA*/         
*  PC#EtModname     Bit(16) Constant('0002'X),  /* Module Name   @DNA*/         
*  PC#EtRqstMax     Bit(16) Constant('0002'X),                /* @DNA*/         
*      /*                             - Error code type         6@03M*/         
*  PC#EtReason      Bit(16) Constant('0000'X),  /* Reason Code   @DNA*/         
*  PC#EtErrno       Bit(16) Constant('0001'X),  /* Return Code   @DNA*/         
*  PC#EtTypeMax     Bit(16) Constant('0001'X);                /* @DNA*/         
*Dcl   /* PFS specific component ID for reason codes */                         
*  PC#CompIDUni   Char(1)  Constant('E4'x);/* Unicode conversion @F7A*/         
*                                                                               
*Dcl   /* PC#ShuttingDownFS args                                6@03M*/         
*  PC#TypeFilesys   Bit(32) Constant('00000001'X),            /* @E7A*/         
*  PC#TypeFileowner Bit(32) Constant('00000002'X),            /* @E7A*/         
*  PC#TypeOMVS      Bit(32) Constant('00000003'X);            /* @E7A*/         
*                                                                               
*                                                                               
*  /* Argument for PC#DirGetHost - Directed GetHostId/Name       @06A*/         
*  Dcl 1 PC_DirGetHostArg Based,   /* Same parms as BPX1HST:     @06A*/         
*        2 PC_Domain Fixed(32),       /* Domain to search        @06A*/         
*        2 PC_NamLen Fixed(32),       /* 0=Id, >0=Name           @06A*/         
*        2 PC_Name   Char(*);         /* Output Name Buffer      @06A*/         
*                                                                               
*  /* Argument for PC#ModifyPFS                                      */         
*  Dcl 1 PC_Modify Based,             /* Buffer for pfsctl           */         
*        3 PC_ModEye       Char(4),   /* eyecatcher "MODP"           */         
*        3 PC_ModLen       Fixed(16), /* +04 Length of PC_ModifyPFS  */         
*        3 PC_ModVers      Fixed(16), /* +06 Version                 */         
*        3 PC_ModConsId    Fixed(32), /* +08 Console ID of terminal             
*                                        that issued modify command  */         
*        3 PC_ModCART      Char(8),   /* +0C Command And Resp Token  */         
*        3 PC_ModStringLen Fixed(32), /* +14 Length of PC_ModString  */         
*        3 PC_ModString    Char(120); /* +18 modify string       @F8A*/         
*                                                                               
*  Dcl PC_Mod_Id Char(4) Constant('MODP');                    /* @F8A*/         
*  Dcl PC_Mod_V1 Fixed(16) Constant(1);                       /* @F8A*/         
*                                                                               
*  /* Argument for PC#ErrorText - Get Error Text                 @EAA*/         
*  Dcl 1 PC_ErrorText  Based,      /* Input structure:           @EAA*/         
*        2 PC_ErrRqst    Fixed(16),   /* Request Type            @EAA*/         
*        2 PC_ErrType    Fixed(16),   /* Error code type         @EAA*/         
*        2 PC_ErrReason  Fixed(32),   /* Reason code             @EAA*/         
*          3 PC_ErrComp   Fixed(8),   /*   Reason code comp id   @EAA*/         
*          3 PC_ErrMod    Fixed(8),   /*   Reason code mod id    @EAA*/         
*          3 PC_ErrVal    Fixed(16),  /*   Reason code value     @EAA*/         
*            5 PC_ErrRC    Fixed(16); /*    or Return Code value @EAA*/         
*                                                                               
*  /* Argument for PC#MntFailCd                                 6@DVA*/         
*  Dcl 1 PfsCtlBufMF Based,                                                     
*      3  PcMFHdr,                                                              
*         5 *     Fixed(32),    /* reserved */                                  
*         5 PcMFErno Fixed(32), /* mount failure errno (output) */              
*         5 PcMFRsn Fixed(32),  /* mount failure reason code (output)*/         
*      3 PcMFFsn  Char(44);     /* file system name (input) */                  
*  /*************************************************************@F9A*/         
*  /* Arguments for PC#ThreadUndub pfsctl which is an internally     */         
*  /* (LFS) issued pfsctl.                                           */         
*  /******************************************************************/         
*                                                                               
*  Dcl 1 PC_UndubArg Bdy(DWord) Based,                        /* @F9A*/         
*       2 PC_UndubCommonArea,                                                   
*        3 PC_UndubEye  Char(4),      /* EBCDIC Eye catcher          */         
*        3 PC_UndubLen  Fixed(16),    /* length of struct        @F9A*/         
*        3 PC_UndubVers Fixed(16),    /* Version                 @F9A*/         
*        3 PC_UndubType Fixed(16),    /* Undub notification type @F9A*/         
*        3 PC_UndubAsid Fixed(16),    /* ASID                    @F9A*/         
*        3 PC_UndubTCB  Ptr(31),      /* TCB address             @F9A*/         
*       2 PC_UndubTypeSpecificArea Union Bdy(DWORD), /*+10           */         
*        /************************************************************/         
*        /* EOM Timeout data                                         */         
*        /************************************************************/         
*        3 PC_UndubEomT,               /* EOM Timeout data       @F9A*/         
*         5 PC_UndubRecTok64 Char(16), /* OsiRToken 64bit PFS    @F9A*/         
*          7 PC_UndubRecTok Char(08),  /* OsiRToken 32bit PFS    @F9A*/         
*         5 PC_UndubPfsTok  Char(08),  /* VfsPfs / CjarPFSVFS    @F9A*/         
*       2 * Char(0);                                           /*@F9A*/         
*                                                                               
*  Dcl  /* PC_UndubArg constants                                 @F9A*/         
*    PC#UndubEye      Char(4)  Constant('UNDB'), /* Eye catcher  @F9A*/         
*    PC#UndubLen      Fixed(16) Constant(Length(PC_UndubArg)), /*@F9A*/         
*    PC#UndubVers     Fixed(16) Constant(1), /* Version          @F9A*/         
*    PC#UndubTypeEOMT Fixed(16) Constant(1); /* Type EOM Timeout @F9A*/         
*                                                                               
*  /*************************************************************@FAA*/         
*  /* Arguments for PC#RenameFS pfsctl which is an internally        */         
*  /* (LFS) issued pfsctl.                                           */         
*  /*************************************************************@FAA*/         
*                                                                               
*  Dcl 1 PC_Rename   Based,           /* Buffer for pfsctl           */         
*        3 PC_RenEye       Char(4),   /* eyecatcher "RENM"           */         
*        3 PC_RenLen       Fixed(16), /* +04  Length of PC_Rename    */         
*        3 PC_RenVers      Fixed(16), /* +06  Version number         */         
*        3 PC_RenOldLen    Fixed(16), /* +08  Length of old name     */         
*        3 PC_RenNewLen    Fixed(16), /* +0A  Length of new name     */         
*        3 PC_RenOldName   Char(45),  /* +0C  old name of filesystem */         
*        3 PC_RenNewName   Char(45),  /* +39  new name of filesystem */         
*        3 PC_RenErrLen    Fixed(16), /* +66  error buff length  @FDA*/         
*        3 PC_RenErrMsg    Char(1024),/* +68  error buffer       @FDA*/         
*        3 * Char(0);                 /* +468                        */         
*                                                                               
*  Dcl PC#RenEye Char(4)   Constant('RENM');                                    
*  Dcl PC#RenLen Fixed(16) Constant(Length(PC_RENAME));                         
*  Dcl PC#RenV1  Fixed(16) Constant(1);                                         
*                                                                               
*  /*************************************************************@0AA*/         
*  /* Argument for PC#InetdUnsecureSrvc pfsctl.                      */         
*  /*************************************************************@0AA*/         
*                                                                               
*  Dcl 1 PC_Inetd_Srvc Bdy(Word) Based,/* Buffer for pfsctl h        */         
*       2 PC_InetdHdr,                                                          
*        3 PC_InetdEye     Char(8),   /* eyecatcher "INETDSRV"       */         
*        3 PC_InetdLen     Fixed(16), /* +08 Length of PC_Inetd_Srvc */         
*        3 PC_InetdVers    Fixed(16), /* +0A Version number          */         
*        3 PC_InetdPid     Fixed(32), /* +0C Inetd PID (Output)      */         
*        3 PC_InetdTod     Char(8),   /* +10 Timestamp (Output)      */         
*        3 PC_InetdNumSrvc Fixed(32), /* +18 # of Unsecure Services             
*                                            (0-PC#InetdMaxSrvc)     */         
*        3 PC_InetdSeq#    Fixed(32), /* +1C Modification sequence              
*                                        number (output)             */         
*        3 *               Char(16),  /* +20 available               */         
*       2 PC_InetdSrvc(*),            /* +30 Array of Service entries*/         
*        3 PC_InetdSrvcName Char(32); /* Service name, blank padded  */         
*                                                                               
*  Dcl PC#InetdEye Char(8)   Constant('INETDSRV');                              
*  Dcl PC#InetdVers1 Fixed(16) Constant(1);                                     
*  Dcl PC#InetdLen Fixed(16) Constant(1K);                                      
*  Dcl PC#InetdMaxSrvc Fixed(32) Constant(                                      
*        (PC#InetdLen-Length(PC_InetdHdr))/Length(PC_InetdSrvc));               
*                                                                               
*/********************************************************************/         
*/* Constants for BPXMRENV - QUERY_MODE Function                 @E1A*/         
*/********************************************************************/         
*Dcl                                                         /*  @E1A*/         
*                                                            /*  @E1A*/         
*  BIT24_MODE     Fixed(32) Constant(1),                     /*  @E1A*/         
*  BIT31_MODE     Fixed(32) Constant(2),                     /*  @E1A*/         
*  BIT64_MODE     Fixed(32) Constant(3),                     /*  @E1A*/         
*  AMODE_INITIALIZING Fixed(32) Constant(4);                 /*  @PNA*/         
*/********************************************************************/         
*/* Constants for BPXMRENV - PIDXFER_QUERY Function              @DXA*/         
*/********************************************************************/         
*Dcl                                                         /*  @DXA*/         
*                                                            /*  @DXA*/         
*  PIDXFER_YES    Fixed(32) Constant(1),                     /*  @DXA*/         
*  PIDXFER_NO     Fixed(32) Constant(2);                     /*  @DXA*/         
*/********************************************************************/         
*/* Constants for BPXMRENV - ENV_STOR_SERVICE Function           @DJA*/         
*/********************************************************************/         
*Dcl                                                         /*  @DJA*/         
*                                                            /* 2@PED*/         
*  BPX_SWAP       Fixed(32) Constant(1),                     /*  @PEC*/         
*  BPX_NONSWAP    Fixed(32) Constant(2);                     /*  @PEC*/         
*/********************************************************************/         
*/*   Define equates for BPX1SLK syscall LockFcnCode parameter       */         
*/********************************************************************/         
*Dcl                                                         /*  @DZA*/         
*  SLK_OBTAIN     Fixed(32) Constant(1), /* Obtain function                     
*                                   request                      @DZA*/         
*  SLK_OBTAIN_COND Fixed(32) Constant(2),/* Obtain conditional function         
*                                   request                      @DZA*/         
*  SLK_INIT       Fixed(32) Constant(4), /* Initialization function             
*                                   request                      @DZA*/         
*  SLK_DESTROY    Fixed(32) Constant(8), /* Destroy function                    
*                                   request                      @DZA*/         
*  SLK_RELEASE    Fixed(32) Constant(16);/* Release function                    
*                                   request                      @DZA*/         
*/********************************************************************/         
*/*   Define equates for BPX1SLK syscall LockReqType parameter       */         
*/********************************************************************/         
*Dcl                                                         /*  @DZA*/         
*  SLK_NORMAL     Fixed(32) Constant(1), /* Normal request type  @DZA*/         
*  SLK_ERRORCHECK Fixed(32) Constant(2), /* Errorcheck request type             
*                                                                @DZA*/         
*  SLK_RECURSIVE  Fixed(32) Constant(4); /* Recursive request type              
*                                                                @DZA*/         
*/********************************************************************/         
*/*   Define equates for BPX1SLK syscall LockType parameter          */         
*/********************************************************************/         
*Dcl                                                         /*  @DZA*/         
*  SLK_EXCLUSIVE  Fixed(32) Constant(1), /* Exclusive lock type  @DZA*/         
*  SLK_SHARED     Fixed(32) Constant(2); /* Shared lock type     @DZA*/         
*                                                                               
*/********************************************************************/         
*/*   Define values for BPX1LOD (HFS load) option flag               */         
*/********************************************************************/         
*Dcl                                                                            
*  Lod_Error_St_ExLink  Bit(32)   Constant('80000000'X),                        
*  Lod_Ignore_Sticky    Bit(32)   Constant('40000000'X);      /* @DRA*/         
*                                                                               
*/********************************************************************/         
*/*   Define values for BPX1LDX (HFS load extended) option flags     */         
*/*   and directed load returned parameters                          */         
*/********************************************************************/         
*Dcl                                                                            
*  Lod_Directed         Bit(32)   Constant('20000000'X);      /* @ECA*/         
*                                                                               
*Dcl                                                                            
*  1 DirectedLoadReturnedParms Bdy(Dword) Based, /* Directed loadHFS            
*                                      returned parameters       @ECA*/         
*    3 DirectedLoadModuleLength64   AsaxmacF64                                  
*                                   Bdy(DWord),  /* Directed loadHFS            
*                                      module length AMODE 64    @ECA*/         
*      5 *                          Fixed(32),                                  
*      5 DirectedLoadModuleLength   Fixed(32),   /* Directed loadHFS            
*                                      module length AMODE 31    @ECA*/         
*    3 DirectedLoadModuleStart64    AsaxmacP64                                  
*                                   Bdy(DWord),  /* Directed loadHFS            
*                                      module start AMODE 64     @ECA*/         
*      5 *                          Fixed(32),                                  
*      5 DirectedLoadModuleStart    Ptr(31),     /* Directed loadHFS            
*                                      module start AMODE 31     @ECA*/         
*    3 DirectedLoadModuleEntryPt64  AsaxmacP64                                  
*                                   Bdy(DWord),  /* Directed loadHFS            
*                                      module entry AMODE 64     @ECA*/         
*      5 *                          Fixed(32),                                  
*      5 DirectedLoadModuleEntryPt  Ptr(31);     /* Directed loadHFS            
*                                      module entry AMODE 31     @ECA*/         
*/********************************************************************/         
*/*   Define values for BPX1DSD                                      */         
*/********************************************************************/         
*Dcl                                                                            
*   SW_SigDlv_Enable#   Fixed(32) Constant(1),                                  
*   SW_SigDlv_Disable#  Fixed(32) Constant(2);                /* @DPA*/         
*                                                                               
*/********************************************************************/         
*/* Define flags for BPX1OSE syscall function_code parameter      */            
*/********************************************************************/         
*DCL                                                                            
*  Osenv_get       Fixed(32) Constant(1), /* get function        @DQA*/         
*  Osenv_set       Fixed(32) Constant(2), /* set function        @DQA*/         
*  Osenv_unset     Fixed(32) Constant(4), /* unset function      @DQA*/         
*  Osenv_persist   Fixed(32) Constant(8), /* persist function    @DQA*/         
*  Osenv_unpersist Fixed(32) Constant(16);/* unpersist function  @DQA*/         
*                                                                               
*/********************************************************************/         
*/*  Define flags for BPX1OSE syscall Request_Flags parameter        */         
*/********************************************************************/         
*Dcl                                                                            
*  1 Osenv_ReqFlags  Bit(32) Based, /* Request flags             @DQA*/         
*    3 *              Bit(30),      /* reserved                  @DQA*/         
*    3 Osenv_Security Bit(1),       /* pthread security environment             
*                                                                @DQA*/         
*    3 Osenv_WLM      Bit(1);       /* WLM Enclave membership    @DQA*/         
*/********************************************************************/         
*/* Define flags for BPX1PQG syscall RequestType parameter           */         
*/********************************************************************/         
*DCL                                                                            
*  Thdq_Freeze       Fixed(32) Constant(2), /* Freezes the threads              
*                                      identified in the THDQ Data              
*                                      List array (BPXYTHDQ)     @DUA*/         
*  Thdq_UnFreeze_All Fixed(32) Constant(8), /* Unfreezes all threads            
*                                      that are frozen in the caller            
*                                      process                   @DUA*/         
*  Thdq_Get_State    Fixed(32) Constant(1);   /* Retrieves the state            
*                                      data for the threads listed in           
*                                      the THDQ data list array, or             
*                                      for all threads.  This value             
*                                      can only be specified with               
*                                      THDQ_FREEZE               @DUA*/         
*/********************************************************************/         
*/* Define names for the Process Exits (input to CSVDYNEX)       @E4A*/         
*/********************************************************************/         
*DCL                                                                            
*  BPX_PREPROC_INIT Char(16) Constant('BPX_PREPROC_INIT'),                      
*  BPX_POSPROC_INIT Char(16) Constant('BPX_POSPROC_INIT'),                      
*  BPX_IMAGE_INIT   Char(16) Constant('BPX_IMAGE_INIT  '),                      
*  BPX_PREPROC_TERM Char(16) Constant('BPX_PREPROC_TERM');    /* @E4A*/         
*/********************************************************************/         
*/* Define names for the Syscall Exits (input to CSVDYNEX)       @FBA*/         
*/********************************************************************/         
*DCL                                                                            
*  BPX_PRE_SYSCALL  Char(16) Constant('BPX_PRE_SYSCALL '),                      
*  BPX_POST_SYSCALL Char(16) Constant('BPX_POST_SYSCALL');    /* @FBA*/         
*/********************************************************************/         
*/* Define constants for Bpx1Env call to query/set _BPXK_AUTOCVT     */         
*/********************************************************************/         
*DCL                                                          /*7@08A*/         
*  Env016           Char(13)  Constant('_BPXK_AUTOCVT'),                        
*  BpxK_SetNewVar   Fixed(31) Constant(1),  /* Set new variable      */         
*  BpxK_ChgVar      Fixed(31) Constant(2),  /* Changed var           */         
*  BpxK_DelVar      Fixed(31) Constant(3),  /* Deleted var           */         
*  BpxK_ClrVar      Fixed(31) Constant(4),  /* Clear all vars        */         
*  BpxK_QryVar      Fixed(31) Constant(5);  /* Query var             */         
