*        %GOTO PGPSPRO ;        /* Bilingual header                     00010000
         MACRO                                                          00020000
         BPXYPGPS  &DSECT=YES,&LIST=YES,&VARLEN=              8@D1A     00030000
         GBLB  &PGPS411                                                 00040000
         AIF   (&PGPS411 EQ 1).E411                                     00050000
&PGPS411 SETB  1                                                        00060000
         AIF   ('&LIST' EQ 'YES').A411                                  00070000
         PUSH  PRINT  BPXYPGPS: w_getpsent return data structure        00080000
         PRINT OFF                                                      00090000
         AGO   .A411                                                    00100000
*                               */                                      00110000
*%PGPSPRO : ;                                                           00120000
*/****START OF SPECIFICATIONS****************************************** 00130000
*  $MAC (BPXYPGPS) COMP(SCPX1) PROD(BPX):                               00140000
*01* MACRO NAME: BPXYPGPS                                               00150000
*01* DSECT NAME: BPXYPGPS                                               00160000
*01* DESCRIPTIVE NAME: w_getpsent return data mapping                   00170000
*02*   ACRONYM: PGPS                                                    00180000
**/                                                                     00190000
*/*01* PROPRIETARY STATEMENT=                                        */ 00200000
*/***PROPRIETARY_STATEMENT********************************************/ 00210000
*/*                                                                  */ 00220000
*/*                                                                  */ 00230000
*/* LICENSED MATERIALS - PROPERTY OF IBM                             */ 00240000
*/* THIS MACRO IS "RESTRICTED MATERIALS OF IBM"                      */ 00250000
*/* 5650-ZOS COPYRIGHT IBM CORP. 1993, 2017                          */ 00260001
*/*                                                                  */ 00270000
*/* STATUS= HBB77B0                                                  */ 00280001
*/*                                                                  */ 00290000
*/***END_OF_PROPRIETARY_STATEMENT*************************************/ 00300000
*/*                                                                     00310000
*                                                                       00320000
*01* EXTERNAL CLASSIFICATION:  GUPI                                     00330000
*01* END OF EXTERNAL CLASSIFICATION:                                    00340000
*                                                                       00350000
*01* FUNCTION:  Provides PL/S and BAL mapping of the output information 00360000
*               returned by the getpsent (BPX1GPS) service routine.     00370000
*01* METHOD OF ACCESS:                                                  00380000
*02*   PL/X:  %INCLUDE(BPXYPGPS)                                        00390000
*             To contain the mapping of the OpenMVS getpsent            00400000
*02*   ASM:                                                             00410000
*        With DSECT=NO, storage is allocated in line                    00420000
*        and addressability is provided thru that DSECT or CSECT.       00430000
*        With DSECT=YES, a DSECT is produced and "USING PGPS,reg"       00440000
*        is required for addressability.  Here "reg" contains the       00450000
*        address of PGPS#LENGTH bytes of storage.                       00460000
*        The default is DSECT=YES.                                      00470000
*01* SIZE: PGPS#LENGTH                                                  00480000
*01* POINTED TO BY: Local to caller                                     00490000
*01* CREATED BY: Caller.                                                00500000
*01* DELETED BY: Caller.                                                00510000
*01* STORAGE ATTRIBUTES:                                                00520000
*02*   SUBPOOL:   As defined by the caller.                             00530000
*02*   KEY:       User's key                                            00540000
*02*   RESIDENCY: Invoker's primary address space                       00550000
*01* FREQUENCY: N/A                                                     00560000
*01* SERIALIZATION: N/A                                                 00570000
*01* NOTES: PGPSLENERR is the mechinism to determine when the           00580000
*           invoker and SYSCALL are not using the same level            00590000
*           BPXYPGPS.                                                   00600000
*01* COMPONENT: OpenMVS (SCPX1)                                         00610000
*01* DISTRIBUTION LIBRARY:  AMACLIB                                     00620000
*01* EYE-CATCHER: None.                                                 00630000
*01* CHANGE-ACTIVITY:                                                   00640000
* $L0=POSIXXP  FRF4438 921201 PDJM: OpenMVS Initial Release             00650000
* $D1=DL70019  HOM1130 921201 PDJM: Assembler macro fixup               00660000
* $D2=DL70014  HOM1130 921201 PDJM: Pthread/Improvment Changes          00670000
* $P3=PL70597  HOM1130 930104 PDJM: Use "OpenMVS"                       00680000
* $L1=OMVS1MP  HOM1130 930408 PDJM: Multi processes per address space   00690000
* $D3=DOAA009  HOM1130 930902 PDJM: DCR A009.04 NFS                     00700000
* $D4=DPFA051  HOM1130 940217 PDJM: DCR A051.04 Initial XPG4 IPC        00710000
* $D5=DOAA009  HOM1110 940408 PDJM: DCR A009.05 changes to .04          00720000
* $P4=PUX0155  HBB6605 970515 PDJM: Comment added to PgpsCmdBuf         00730000
* $P5=PUX0221  HBB6605 970609 PDJM: Cleanup for external documenation   00740000
* $P6=DVTA242  HBB6606 970922 PDJM: A247.01 Add ASID, JBN Suppress      00750000
* $P7=PYN0220  HBB7708 020301 PDFO: Bilingual fixup                     00760000
* $D6=DCRC995  HBB77B0 160909 PDMX: 2038/2042                           00761000
****END OF SPECIFICATIONS*********************************************/ 00770000
*        %GOTO PGPSPLS ;        /* Bilingual header                     00780000
.A411    ANOP  ,                                                        00790000
         LCLA  &VAR                                                     00800000
.*  first operand of VARLEN - controlling terminal                      00810000
         LCLC  &VAR1A,&VAR1B,&VAR1C,&VAR1L                              00820000
&VAR1C   SETC  '&VARLEN(1)'               Pick up 1st length            00830000
         AIF   ('&VAR1C' EQ '').VAR1D     Branch if absent to default   00840000
&VAR     SETA  &VAR1C                     Use specified value           00850000
         AIF   (&VAR GE 4).VAR1N0                                       00860000
&VAR1A   SETC  '0C'                       No buffer at all              00870000
&VAR1L   SETC  '0'                        Length buffer                 00880000
&VAR1B   SETC  '0FL4'                     No length                     00890000
&VAR1C   SETC  '0C'                       No data                       00900000
         AGO   .VAR1OK                                                  00910000
.VAR1N0  ANOP  ,                                                        00920000
&VAR1A   SETC  '0CL'.'&VAR'               Buffer passed                 00930000
&VAR1L   SETC  '&VAR'                     Length buffer                 00940000
&VAR1B   SETC  'FL4'                      Define for length field       00950000
&VAR     SETA  &VAR-4                     Length character portion      00960000
&VAR1C   SETC  'CL'.'&VAR'                Define for length field       00970000
         AGO   .VAR1OK                                                  00980000
.VAR1D   ANOP  ,                                                        00990000
&VAR1A   SETC  '0CL1028'                  Buffer passed                 01000000
&VAR1L   SETC  '1028'                     Length buffer                 01010000
&VAR1B   SETC  'FL4'                      Length passed back            01020000
&VAR1C   SETC  'CL1024'                   Data passed pack              01030000
.VAR1OK  ANOP  ,                                                        01040000
.*  second operand of VARLEN - pathname                                 01050000
         LCLC  &VAR2A,&VAR2B,&VAR2C,&VAR2L                              01060000
&VAR2C   SETC  '&VARLEN(2)'               Pick up 2nd length            01070000
         AIF   ('&VAR2C' EQ '').VAR2D     Branch if absent to default   01080000
&VAR     SETA  &VAR2C                     Use specified value           01090000
         AIF   (&VAR GE 4).VAR2N0                                       01100000
&VAR2A   SETC  '0C'                       No buffer at all              01110000
&VAR2L   SETC  '0'                        Length buffer                 01120000
&VAR2B   SETC  '0FL4'                     No length                     01130000
&VAR2C   SETC  '0C'                       No data                       01140000
         AGO   .VAR2OK                                                  01150000
.VAR2N0  ANOP  ,                                                        01160000
&VAR2A   SETC  '0CL'.'&VAR'               Buffer passed                 01170000
&VAR2L   SETC  '&VAR'                     Length buffer                 01180000
&VAR2B   SETC  'FL4'                      Define for length field       01190000
&VAR     SETA  &VAR-4                     Length character portion      01200000
&VAR2C   SETC  'CL'.'&VAR'                Define for length field       01210000
         AGO   .VAR2OK                                                  01220000
.VAR2D   ANOP  ,                                                        01230000
&VAR2A   SETC  '0CL1028'                  Buffer passed                 01240000
&VAR2L   SETC  '1028'                     Length buffer                 01250000
&VAR2B   SETC  'FL4'                      Length passed back            01260000
&VAR2C   SETC  'CL1024'                   Data passed pack              01270000
.VAR2OK  ANOP  ,                                                        01280000
.*  third operand of VARLEN - command                                   01290000
         LCLC  &VAR3A,&VAR3B,&VAR3C,&VAR3L                              01300000
&VAR3C   SETC  '&VARLEN(3)'               Pick up 3rd length            01310000
         AIF   ('&VAR3C' EQ '').VAR3D     Branch if absent to default   01320000
&VAR     SETA  &VAR3C                     Use specified value           01330000
         AIF   (&VAR GE 4).VAR3N0                                       01340000
&VAR3A   SETC  '0C'                       No buffer at all              01350000
&VAR3L   SETC  '0'                        Length buffer                 01360000
&VAR3B   SETC  '0FL4'                     No length                     01370000
&VAR3C   SETC  '0C'                       No data                       01380000
         AGO   .VAR3OK                                                  01390000
.VAR3N0  ANOP  ,                                                        01400000
&VAR3A   SETC  '0CL'.'&VAR'               Buffer passed                 01410000
&VAR3L   SETC  '&VAR'                     Length buffer                 01420000
&VAR3B   SETC  'FL4'                      Define for length field       01430000
&VAR     SETA  &VAR-4                     Length character portion      01440000
&VAR3C   SETC  'CL'.'&VAR'                Define for length field       01450000
         AGO   .VAR3OK                                                  01460000
.VAR3D   ANOP  ,                                                        01470000
&VAR3A   SETC  '0CL1028'                  Buffer passed                 01480000
&VAR3L   SETC  '1028'                     Length buffer                 01490000
&VAR3B   SETC  'FL4'                      Length passed back            01500000
&VAR3C   SETC  'CL1024'                   Data passed pack              01510000
.VAR3OK  ANOP  ,                                                        01520000
.*                                                                      01530000
** BPXYPGPS: w_getpsent return data structure                           01540000
**  Used By: GPS                                                        01550000
         AIF   ('&DSECT' EQ 'NO').B411                        7@D1A     01560000
PGPS                 DSECT ,                                            01570000
         AGO   .C411                                                    01580000
.B411    ANOP  ,                                                        01590000
PGPS                 DS    0F                                           01600000
.C411    ANOP  ,                                                        01610000
PGPSSTATUS0          DS    B         MVS status                         01620000
PGPSSWAP             EQU   X'80'       Swapped out                      01630000
*                    EQU   X'7F'       Not Used                         01640000
                     SPACE ,                                            01650000
PGPSSTATUS1          DS    B         Process status                     01660000
PGPSSTOPPED          EQU   X'80'       Stopped process                  01670000
PGPSTRACE            EQU   X'40'       PTrace active                    01680000
PGPSMULTHREAD        EQU   X'20'        0=One open task in process      01690000
PGPSPTHREAD          EQU   X'10'        0=No pthread task in process    01700000
PGPSMULPROCESS       EQU   X'08'        0=One process in addr space     01710000
*                    EQU   X'07'       Not Used                         01720000
                     SPACE ,                                            01730000
PGPSSTATUS2          DS    B         System Call Status                 01740000
PGPSLENERR           EQU   X'80'       PGPSLENGTH conflict              01750000
*                    EQU   X'7F'       Not Used                         01760000
                     SPACE ,                                            01770000
PGPSSTATUS3          DS    CL1       State of reported task - with      01780000
*                          PGPSPTHREAD=0 the most recent created thread 01790000
*                          PGPSPTHREAD=1 the initial pthread task (IPT) 01800000
PGPSMSGRCV           EQU   C'A'      IPC MSGRCV WAIT                    01810000
PGPSMSGSND           EQU   C'B'      IPC MSGSND WAIT                    01820000
PGPSWAITC            EQU   C'C'      COMM KERNELWAIT                    01830000
PGPSSEMOP            EQU   C'D'      IPC SEMOP WAIT                     01840000
PGPSFREEZE           EQU   C'E'      QUIESCEFREEZE                      01850000
PGPSWAITF            EQU   C'F'      F S  KERNEL WAIT                   01860000
PGPSMVSPAUSE         EQU   C'G'      MVSPAUSE                           01870000
PGPSZOMBIE2          EQU   C'L'      PROCESS TERMINATED AND STILL       01880000
*                                    SESSION OR PROCESS GROUP LEADER    01890000
PGPSWAITO            EQU   C'K'      OTHER KERNEL WAIT                  01900000
PGPSQUIESCET         EQU   C'Q'      QUIESCE TEMRINATION WAIT           01910000
PGPSRUN              EQU   C'R'      NOT KERNEL WAIT                    01920000
PGPSSLEEP            EQU   C'S'      SLEEP() ISSUED                     01930000
PGPSCHILD            EQU   C'W'      WAITING FOR CHILD                  01940000
PGPSFORK             EQU   C'X'      FORK NEW PROCESS                   01950000
PGPSZOMBIE           EQU   C'Z'      PROCESS TERMINATED AND PARENT      01960000
*                                    HAS NOT ISSUED WAIT SYSCALL        01970000
                     SPACE ,                                            01980000
PGPSPID              DS    F         Process ID                         01990000
PGPSPPID             DS    F         Parent ID                          02000000
PGPSSID              DS    F         Session ID (leader)                02010000
PGPSPGPID            DS    F         Process Group                      02020000
PGPSFGPID            DS    F         Foreground Process Group           02030000
PGPSEUID             DS    F         Effective User ID                  02040000
PGPSRUID             DS    F         Real User ID                       02050000
PGPSSUID             DS    F         Saved Set User ID                  02060000
PGPSEGID             DS    F         Effective Group ID                 02070000
PGPSRGID             DS    F         Real Group ID                      02080000
PGPSSGID             DS    F         Saved Set Group ID                 02090000
PGPSTSIZE            DS    F         Total size                         02100000
PGPSSTARTTIME        DS    F         Starting time, GMT since EPOCH     02110000
PGPSUSERTIME         DS    F         User CPU time (clock_t)            02120000
PGPSSYSTIME          DS    F         System CPU time (clock_t)          02130000
                     SPACE ,                                            02140000
PGPSCONTTYBLEN       DC    A(&VAR1L)        L'PGPSCONTTYBUF             02150000
PGPSCONTTYPTR        DC    A(PGPSCONTTYBUF) ->PGPSCONTTYBUF             02160000
PGPSPATHBLEN         DC    A(&VAR2L)        L'PGPSPATHBUF               02170000
PGPSPATHPTR          DC    A(PGPSPATHBUF)   ->PGPSPATHBUF               02180000
PGPSCMDBLEN          DC    A(&VAR3L)        L'PGPSCMDBUF                02190000
PGPSCMDPTR           DC    A(PGPSCMDBUF)    ->PGPSCMDBUF                02200000
                     SPACE ,                                            02210000
PGPSSERVERTYPE       DS    F         Server type (FILE=1, LOCK=2)       02220000
PGPSSERVERNAME       DS    CL32      Name supplied on registration      02230000
PGPSMAXVNODETOKENS   DS    F         Max number of VNode Toks allowed   02240000
PGPSVNODETOKENCOUNT  DS    F         Current number of VNode Tokens     02250000
PGPSSERFLAGS         DS    F         Server flags                       02260000
PGPSSYSCALLCOUNT     DS    F         Count of syscalls this process     02270000
PGPSJOBNAME          DS    CL8       AscbJBNI/JBNS  JobName             02280000
PGPSWAITTIME         DS    F         Since Kern Wait Started            02290000
PGPSASID             DS    FL2       Address space ID                   02300000
                     DS    CL6                                  @D6A    02301004
PGPSSTARTTIME64      DS    D         Start time, since Epoch    @D6A    02303004
                     SPACE ,                                            02310000
PGPS#LENGTH          EQU   *-PGPS    Length of this structure           02320000
* Variable portion - Controlling terminal buffer                        02330000
*                                                                       02340000
* Notes on format of controlling terminal string in PGPSCONTTYBUF       02350000
* 1. Controlling terminal string returned in PGPSCONTTY is              02360000
*    null-terminated.                                                   02370000
* 2. The PGPSCONTTYLEN value does NOT include the terminating           02380000
*    null character.                                                    02390000
PGPSCONTTYBUF        DS    &VAR1A    ConTty Len+Buf                     02400000
PGPSCONTTYLEN        DS    &VAR1B    Length ConTty returned             02410000
PGPSCONTTY           DS    &VAR1C    ConTty (len+1-th char=null)        02420000
*                                                                       02430000
* Notes on format of path string in PGPSPATHBUF:                        02440000
* 1. Pathname returned in PGPSPATH is null-terminated.                  02450000
* 2. The PGPSPATHLEN value does NOT include the terminating null        02460000
*    character.                                                         02470000
* 3. TSO (non-shell) pathnames may be padded with spaces to eight       02480000
*    characters.                                                        02490000
PGPSPATHBUF          DS    &VAR2A    Pathname Len+Buf                   02500000
PGPSPATHLEN          DS    &VAR2B    Length Pathname returned           02510000
PGPSPATH             DS    &VAR2C    Pathname (len+1-th char=null)      02520000
*                                                                       02530000
* Notes on format of PGPSCMDBUF:                                        02540000
* 1. PGPSCMD consists of one or more character fields representing      02550000
*    the command and its arguments (if any).                            02560000
* 2. Each character field consists of a four byte length field and      02570000
*    a null-terminated character string.                                02580000
* 3. TSO (non-shell) commands may be padded with spaces to eight        02590000
*    characters.                                                        02600000
* 4. Unlike PGPSCONTTYLEN and PGPSPATHLEN, each character field         02610000
*    length value DOES include the null-terminating character.          02620000
* 5. The PGPSCMDLEN value is the sum of all character fields (length    02630000
*    fields and character strings).                                     02640000
PGPSCMDBUF           DS    &VAR3A    Command Len+Buf                    02650000
PGPSCMDLEN           DS    &VAR3B    Length Command returned            02660000
PGPSCMD              DS    &VAR3C    Command (array of len, element)    02670000
PGPS#STORAGE         EQU   *-PGPS    Length, total area used            02680000
** BPXYPGPS End                                                         02690000
         SPACE 3                                                        02700000
         AIF   ('&LIST' EQ 'YES').E411                        6@D1A     02710000
         POP   PRINT                                                    02720000
.E411    ANOP  ,                                                        02730000
         MEND  ,                  Terminating PL/X comment           */ 02740000
*%PGPSPLS : ;                                                           02750000
*  Declare 1 PGPS Based Bdy(Word), /* getpsent data          */         02760000
*  2   PgpsOut            ,    /*Area to clear before moves  */         02770000
*  3   *           BIT(32),    /*PGPS Status bits            */         02780000
*   4  PgpsStatus0 BIT(8),     /*MVS status                  */         02790000
*    5 PgpsSwap      BIT(1),   /*Swapped out                 */         02800000
*    5 PgpsWaitP     BIT(1),   /*Ptrace Kernel Wait          */         02810000
*   4  PgpsStatus1 BIT(8),     /*Process status              */         02820000
*    5 PgpsStopped   BIT(1),   /*Stopped process             */         02830000
*    5 PgpsTrace     BIT(1),   /*PTrace active               */         02840000
*    5 PgpsMulThread BIT(1),   /*0=One open task in process  */         02850000
*    5 PgpsPthread   BIT(1),   /*0=No pthread task in process*/         02860000
*    5 PgpsMulProcess BIT(1),  /*0=One process in addr space @L1A*/     02870000
*   4  PgpsStatus2 BIT(8),     /*SysCall Status              */         02880000
*    5 PgpsLenErr    BIT(1),   /*PgpsLength conflict         */         02890000
*   4  PgpsStatus3 CHAR(1),    /*State of reported task - with          02900000
*          PgpsPthread=0 the most recent created thread,                02910000
*          PgpsPthread=1 the initial pthread task (IPT)      */         02920000
*  3   PgpsPid     FIXED(31),  /*Process ID                  */         02930000
*  3   PgpsPPid    FIXED(31),  /*Parent ID                   */         02940000
*  3   PgpsSid     FIXED(31),  /*Session ID                  */         02950000
*  3   PgpsPgPid   FIXED(31),  /*Progess Group               */         02960000
*  3   PgpsFgPid   FIXED(31),  /*Foreground process group    */         02970000
*  3   PgpsEUid    FIXED(31),  /*Effective User ID           */         02980000
*  3   PgpsRUid    FIXED(31),  /*Real User ID                */         02990000
*  3   PgpsSUid    FIXED(31),  /*Saved Set User ID           */         03000000
*  3   PgpsEGid    FIXED(31),  /*Effective Group ID          */         03010000
*  3   PgpsRGid    FIXED(31),  /*Real Group ID               */         03020000
*  3   PgpsSGid    FIXED(31),  /*Saved Set Group ID          */         03030000
*  3   PgpsTSize   FIXED(31),  /*Total size                  */         03040000
*  3   PgpsStartTime FIXED(31), /*Start time, since EPOCH    */         03050000
*  3   PgpsUserTime FIXED(31), /*User CPU time               */         03060000
*  3   PgpsSysTime FIXED(31),  /*System CPU time             */         03070000
*                                                                       03080000
*  2   *                    ,                                           03090000
*   3  PgpsConTtyBLen FIXED(31), /*Len ConTty buffer         */         03100000
*   3  PgpsConTtyPtr PTR(31),  /*Controlling Terminal buf loc*/         03110000
*   3  PgpsPathBLen FIXED(31), /*Len path buffer             */         03120000
*   3  PgpsPathPtr PTR(31),    /*Path name buffer location   */         03130000
*   3  PgpsCmdBLen FIXED(31),  /*Len cmd buffer              */         03140000
*   3  PgpsCmdPtr  PTR(31),    /*Command and arguments bufloc*/         03150000
*                                                                       03160000
*  2   PgpsOut2           ,       /*Area to clear before moves    */    03170000
*   3  PgpsServerType Fixed(32),  /* Server type (FILE=1, LOCK=2) */    03180000
*   3  PgpsServerName Char(32),   /* Name supplied on registration*/    03190000
*   /* delete PgpsMaxBRLMPids PgpsBRLMPids                    @D5D*/    03200000
*                                                                       03210000
*   3  PgpsMaxVNodeTokens  Fixed(32),                                   03220000
*                                 /* Max number of VNode Tokens         03230000
*                                      allowed for this server    */    03240000
*   3  PgpsVNodeTokenCount Fixed(32),                                   03250000
*                                 /* Current number VNode Tokens  */    03260000
*   3  PgpsSerFlags Fixed(32),    /* Server flags                 */    03270000
*                                                                       03280000
*   3  PgpsSysCallCount  Fixed(32), /* OapbSysCallCount       @P6A*/    03290000
*   3  PgpsJobName  Char(8),      /* AscbJBNI/JBNS ->Char(8)  @P6A*/    03300000
*   3  PgpsWaitTime Fixed(32),    /* WaiTing Time (.01 secs   @P6A*/    03310000
*   3  PgpsAsid     Fixed(16),    /* AscbASID                 @P6A*/    03320000
*   3  *            Char(6),      /*                          @D6A*/    03321004
*   3  PgpsStartTime64 Fixed(64)  /* Start time, since Epoch  @D6A*/    03322005
*                   Bdy(Word);    /* (+A0)                        */    03323005
*  Declare                              /* PgpsStatus3 values @D2A*/    03340000
*   PgpsMsgrcv   CHAR(1) CONSTANT('A'), /*IPC msgrcv wait     @D4A*/    03350000
*   PgpsMsgsnd   CHAR(1) CONSTANT('B'), /*IPC msgsnd wait     @D4A*/    03360000
*   PgpsWaitC    CHAR(1) CONSTANT('C'), /*Comm KernelWait     @D2A*/    03370000
*   PgpsSemop    CHAR(1) CONSTANT('D'), /*IPC semop wait      @D4A*/    03380000
*   PgpsFreeze   CHAR(1) CONSTANT('E'), /*QuiesceFreeze       @D4A*/    03390000
*   PgpsWaitF    CHAR(1) CONSTANT('F'), /*F S  Kernel Wait    @D2A*/    03400000
*   PgpsMVSPause CHAR(1) CONSTANT('G'), /*MVSPause            @D4A*/    03410000
*   /* used by display OMVS      ('H')   for multi PThreads       */    03420000
*   PgpsZombie2  CHAR(1) CONSTANT('L'), /*Process terminated and        03430000
*                                         still session or process      03440000
*                                         group leader        @D4A*/    03450000
*/* used by D OMVS and ps command('M')    for multi threads       */    03460000
*/* used by D OMVS and ps command('P'),   Ptrace kernel wait      */    03470000
*   PgpsQuiesceT CHAR(1) CONSTANT('Q'), /*Quiesce termination wait*/    03480000
*   PgpsWaitO    CHAR(1) CONSTANT('K'), /*Other Kernel Wait   @D2A*/    03490000
*   PgpsRun      CHAR(1) CONSTANT('R'), /*Not kernel wait     @D2A*/    03500000
*   PgpsSleep    CHAR(1) CONSTANT('S'), /*sleep() issued      @D2A*/    03510000
*   PgpsChild    CHAR(1) CONSTANT('W'), /*Waiting for child   @D2A*/    03520000
*   PgpsFork     CHAR(1) CONSTANT('X'), /*fork new process    @D2A*/    03530000
*   PgpsZombie   CHAR(1) CONSTANT('Z'); /*Process terminated and        03540000
*                                         parent has not issued a       03550000
*                                         wait syscall        @D4C*/    03560000
*                                                                       03570000
*  Declare                                                              03580000
*   PgpsLength Fixed(31)  Constant(Length(PGPS));                       03590000
*                                                                       03600000
*  Declare                           /*ConTty, Path, Cmd     */         03610000
*  1   PgpsBufs Based     Bdy(Byte), /*                      */         03620000
*   3  PgpsDLen Fixed(31) Bdy(Byte), /*Length of PgpsData    */         03630000
*   3  PgpsData Char(*);      /* cmd has struct array here   */         03640000
*                                                                       03650000
*/*ConTtyPtr-> DLen / Data   (max 1027)  Dlen+1-th char=null */         03660000
*/*PathPtr  -> DLen / Data   (max 1027)  Dlen+1-th char=null */         03670000
*/*CmdPtr   -> DLen / DLen0 / Data0 / DLen1 / Data1 / etc.   */         03680000
*/*   ending at DLen, possibly mid DLenX or DataX. (max 1024)*/         03690000
*/*   each DlenX-th char=null, add DlenX+4 for next      @D1A*/         03700000
*/* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * */  03710000
