*                                                                       00001000
* %DCL BPXZODMV_INCLUDED CHAR EXT;                                      00002000
* %DEACTIVATE BPXZODMV_INCLUDED;                                        00003000
* %IF BPXZODMV_INCLUDED = '' %THEN                                      00004000
* %DO;                                                                  00005000
*/* Macro made bi-lingual on 18171. CBGEN compile date 15295         */ 00006000
*% /*                                                                   00007000
         MACRO                                                          00008000
         BPXZODMV &DSECT=YES,&LIST=YES,&TITLE=YES,&ODMV=YES,           *00009000
               &ODMVOUT=COND,&ODMVOUTARRAY=COND,&ODMVTHDARRAY=COND,    *00010000
               &ODMVFILE=COND,&ODMVPROCESS=COND,&ODMVTHREADS=COND,     *00011000
               &ODMVPFS=COND,&ODMVSYSL=COND,&ODMVPRCL=COND,            *00012000
               &ODMVEXTOPTIONSDATA=COND,&ODMVIPV6=COND,&ODMVCINET=COND,*00013000
               &ODMVCINET6=COND,&ODMVSERHDR=COND,&ODMVSEROBJ=COND,     *00014000
               &ODMVUMTBHDR=COND,&ODMVUMTBELEMNT=COND,                 *00015000
               &ODMVPIPESUMHDR=COND,&ODMVPIPESUMELEMNT=COND,           *00016000
               &ODMVPIPEUIDHDR=COND,&ODMVPIPEUIDELEMNT=COND,           *00017000
               &ODMVSERREQ=COND,&ODMVDWHEADER=COND,&ODMVDWELEMENT=COND,*00018000
               &ODMVSOCKET=COND,&ODMVDYNSERV=COND,&ODMVDYNACT=COND,    *00019000
               &ODMVDYNACTITEM=COND,&ODMVMFHEADER=COND,                *00020000
               &ODMVMFENTRY=COND                                        00021000
         GBLC  &BPXZODMV_INCLUDED                                       00022000
         GBLC  &ZCBPRINT                                                00023000
&BPXZODMV_INCLUDED SETC 'YES'                                           00024000
         AIF   ('&LIST' EQ 'NONE').P0                                   00025000
         AIF   ('&TITLE' EQ 'NO').P5                                    00026000
 TITLE   'BPXZODMV  - OpenMVS Display Command Interface               '*00027000
                                                                        00028000
.P5      ANOP                                                           00029000
**/ BPXZODMV_1:;                                                        00030000
*/****START OF SPECIFICATIONS****************************************** 00031000
*                                                                       00032000
*    $MAC (BPXZODMV) COMP(SCPX1) PROD(BPX):                             00033000
*                                                                       00034000
*01* MACRO NAME: BPXZODMV                                               00035000
*                                                                       00036000
*01* DSECT NAME: BPXZODMV                                               00037000
*                                                                       00038000
*01* DESCRIPTIVE NAME: OpenMVS Display Command Interface                00039000
*                                                                       00040000
*02*   ACRONYM: ODMV                                                    00041000
**/                                                                     00042000
*/*01* PROPRIETARY STATEMENT=                                        */ 00043000
*/***PROPRIETARY_STATEMENT********************************************/ 00044000
*/*                                                                  */ 00045000
*/*                                                                  */ 00046000
*/* LICENSED MATERIALS - PROPERTY OF IBM                             */ 00047000
*/*   5650-ZOS COPYRIGHT IBM CORP. 1993, 2019                        */ 00048000
*/*                                                                  */ 00049000
*/* STATUS= HBB77C0                                                  */ 00050000
*/*                                                                  */ 00051000
*/**END_OF_PROPRIETARY_STATEMENT**************************************/ 00052000
*/*                                                                     00053000
*                                                                       00054000
*01* EXTERNAL CLASSIFICATION:  GUPI                                     00055000
*01* END OF EXTERNAL CLASSIFICATION:                                    00056000
*                                                                       00057000
*01* FUNCTION:                                                          00058000
*                                                                       00059000
*    This file contains the mapping of the DISPLAY OMVS interface       00060000
*    between BPXOMAST, BPXAMRMF and BPXODMVS                            00061000
*                                                                       00062000
*                                                                       00063000
*01* METHOD OF ACCESS:                                                  00064000
*                                                                       00065000
*02*   PL/X:                                                            00066000
*                                                                       00067000
*        %INCLUDE SYSLIB(BPXZODMV)                                      00068000
*                                                                       00069000
*        There is no default for basing the ODMV.                       00070000
*        Obtain a sufficiently large buffer for this structure          00071000
*        and base ODMV on the pointer to this buffer.                   00072000
*                                                                       00073000
*02*   ASM:                                                             00074000
*                                                                       00075000
*        None                                                           00076000
*                                                                       00077000
*01* SIZE: Release dependent.  Refer to the mapping.                    00078000
*            ODMVPIPEUIDHDR     -- X'0010' bytes                        00079000
*            ODMVPIPEUIDELEMNT  -- X'0010' bytes                        00080000
*            ODMVPIPESUMHDR     -- X'0010' bytes                        00081000
*            ODMVPIPESUMELEMNT  -- X'0010' bytes                        00082000
*            ODMVSOCKET         -- X'0090' bytes                        00083000
*            ODMVDYNSERV        -- X'0014' bytes                        00084000
*            ODMVDYNACT         -- X'0070' bytes                        00085000
*            ODMVDYNACTITEM     -- X'0008' bytes                        00086000
*            ODMVMFHEADER       -- X'001C' bytes                        00087000
*            ODMVMFENTRY        -- X'00F0' bytes                        00088000
*            ODMVIPV6           -- X'0010' bytes                        00089000
*            ODMVCINET6         -- X'0044' bytes                        00090000
*            ODMVDWHEADER       -- X'003C' bytes                        00091000
*            ODMVDWELEMENT      -- X'01EC' bytes                        00092000
*            ODMVSERHDR         -- X'000C' bytes                        00093000
*            ODMVSEROBJ         -- X'0028' bytes                        00094000
*            ODMVSERREQ         -- X'001C' bytes                        00095000
*            ODMVEXTOPTIONSDATA -- X'0164' bytes                        00096000
*            ODMVSYSL           -- X'0094' bytes                        00097000
*            ODMVPRCL           -- X'00AC' bytes                        00098000
*            ODMV               -- X'0060' bytes                        00099000
*            ODMVOUT            -- X'0670' bytes                        00100000
*            ODMVOUTARRAY       -- X'0004' bytes                        00101000
*            ODMVTHDARRAY       -- X'0004' bytes                        00102000
*            ODMVFILE           -- X'02A8' bytes                        00103000
*            ODMVPROCESS        -- X'00B4' bytes                        00104000
*            ODMVTHREADS        -- X'00B0' bytes                        00105000
*            ODMVPFS            -- X'01C8' bytes                        00106000
*            ODMVCINET          -- X'0044' bytes                        00107000
*            ODMVUMTBHDR        -- X'0008' bytes                        00108000
*            ODMVUMTBELEMNT     -- X'0008' bytes                        00109000
*                                                                       00110000
*01* POINTED TO BY: Pointer passed as input parameter.                  00111000
*                                                                       00112000
*01* CREATED BY: Display OMVS  Command  (BPXOMAST)                      00113000
*                                                                       00114000
*01* DELETED BY: Display OMVS  Command  (BPXOMAST)                      00115000
*                                                                       00116000
*01* STORAGE ATTRIBUTES:                                                00117000
*02*   RESIDENCY: Data Space                                            00118000
*                                                                       00119000
*01* FREQUENCY: 1 per Display OMVS operator command                     00120000
*                                                                       00121000
*01* SERIALIZATION: None                                                00122000
*                                                                       00123000
*01* DEPENDENCIES:                                                      00124000
*      Data space provides enough storage to contain either             00125000
*      all process information or file information to be displayed.     00126000
*                                                                       00127000
*01* NOTES: This is a CBGEN macro and the following conventions apply:  00128000
*                                                                       00129000
*  1) Extract the BPXZODMV.CBG part from CMVC.                          00130000
*  2) Make your changes to the PLX section only, the ASM section will   00131000
*     be totally replaced in step 3.                                    00132000
*  3) Generate a new executable macro through the TSO CBGEN panel.      00133000
*     Do a test assemble of the generated macro.                        00134000
*  4) Transmit the new generated object as the new CBG part in CMVC.    00135000
*     This is so the CMVC library object will have the current level    00136000
*     of the ASM section.   B390 will generate a new macro for the      00137000
*     compile maclibs, i.e. B390.fmid.MACLIB.  This should match        00138000
*     the one you generated, and transmitted as the .CBG part.          00139000
*                                                                       00140000
*01* COMPONENT: OpenMVS (SCPX1)                                         00141000
*                                                                       00142000
*01* DISTRIBUTION LIBRARY:  AMACLIB                                     00143000
*                                                                       00144000
*01* EYE-CATCHER: ODMV                                                  00145000
*02*   OFFSET:  0                                                       00146000
*02*   LENGTH:  4                                                       00147000
*                                                                       00148000
*                                                                       00149000
*01* CHANGE-ACTIVITY:                                                   00150000
*                                                                       00151000
*  $L0=POSIXXOD, HOM1110, 921201, PDJD: OpenMVS Initial release         00152000
*  $D1=DL70014 , HOM1110, 921031, PDJD: Pthread Support                 00153000
*  $D2=DOAA009 , HOM1120, 930830, PDJD: Wellington support for NFS      00154000
*                                       (Hit to DISPLAY OMVS)           00155000
*  $D3=DPFA051 , HOM1130, 940231, PDJD: A051.04 Initial XPG4 IPC        00156000
*  $D4=DOAA052 , HOM1130, 940831, PDJD: A052.06 NFS Client Support      00157000
*  $D5=DSPA112 , HOM1150, 951022, PDKF: A112.00 Permanent Kernel        00158000
*  $D6=DSPA166 , HOM1150, 960304, PDJC: A166.03 Display OMVS display    00159000
*                                       threads                         00160000
*  $P0=PSP0076 , HOM1150, 960501, PDJC: Display threads rework          00161000
*  $P1=PSY0227 , JBB6604, 970110, PDJV: Add mount mode for filesystems  00162000
*  $D7=DVTA242 , HBB6606, 970922, PDJM: A242.00 Argument Suppression    00163000
*  $D8=DWKA311 , HBB6608, 980713, PDSZ: A311.00 SETOMVS RESET + cleanup 00164000
*  $P2=PWK0280 , HBB6608, 981005, PDJQ: Fix MaxQueuedSigs               00165000
*  $D9=DWKA309 , HBB6609, 981015, PDSZ: Sysplex file support    A309    00166000
*  $DA=DWKA311 , HBB6609, 981215, PDNU: A311.01 D OMVS,PFS              00167000
*  $DB=DWKA311 , HBB6609, 990301, PDNU: A311.03 D OMVS,CINET            00168000
*  $DC=DWYA315 , JBB6609, 990201, PDAE: A315.00 SHRLIB support          00169000
*  $DD=DWYA309 , JBB6609, 990401, PDSZ: A309.04 VERSION keyword         00170000
*  $P3=PWY0586 , JBB6609, 990602, PDSZ: Sysplex= support                00171000
*  $DE=DXDA382 , HBB7703, 990919, PDQR: A382.00/made bilingual          00172000
*  $P4=PXD0724 , HBB7703, 991116, PDQR: Resolved informational messages 00173000
*  $DF=DXVA405 , HBB7704, 991026, PDUA: A405 D OMVS,LIMITS              00174000
*  $DG=DXDA405 , HBB7703, 000103, RDRD: A405.04 Socket Highwater mark   00175000
*  $01=OW41995 , JBB6609, 991122, PDJS: Add BrlmSrv to options (PXD0837 00176000
*  $DH=DXDA405 , HBB7703, 000118, PD2R: (DCR A405.04) BRL wait Display  00177000
*  $P5=PXV0116 , HBB7704, 000328, PDUA: Resolved change conflict to R10 00178000
*  $DI=PX00514 , HBB7705, 000721, PDUA: A514 Add Resolver_Proc option   00179000
*  $DJ=DX0A412 , HBB7705, 000424, PDAE: A412.00 AutoCvt & Mount tag     00180000
*  $P6=PX01116 , HBB7705, 001219, PDJV: Updated comments in filesys     00181000
*                                       section                         00182000
*                                                                       00183000
*  $DK=DYMA511 , HBB7706, 010305, PDPY: OMVS Restart Support            00184000
*  $DL=DYN0519 , HBB7708, 010315, PDZJ: A519.00 Memlimit support        00185000
*  $DM=DYMA547 , HBB7707, 010328, PDSZ: A457 sanction list              00186000
*  $02=OW50400 , HBB7707, 011002, PDKG: Correct ODMVASID asm length     00187000
*  $DM=DYVA574 , HBB7707, 011008, PD2R: IpV6 D OMVS, CINET (A574.02)    00188000
*  $DN=DYVA579 , HBB7707, 011110, PDFV: Automove syslist   (A579.00)    00189000
*  $DO=DYVA584 , HBB7707, 011122  PDJN: D OMVS,F Aggregate Name         00190000
*  $DP=DYNA519 , HBB7709, 011108, PDAE: A519.15 Multiplier              00191000
*  $T0=TJK0312 , HBB7709, 020328, PDAE: move Multiplier fields to       00192000
*                                       Extended Options Data area      00193000
*  $T1=TJK0336 , HBB7709, 020505, PD2R: Rollup IPV6 - A574.02           00194000
*  $DQ=DYNA600 , HBB7709, 020521  PD2R: Rollup A600 SWA above           00195000
*  $DR=DJKA586 , HBB7709, 020505, PDI6: Shared Condvar Support          00196000
*  $P7=PYN0719 , HBB7708, 021024  PDJJ: Seclabel support                00197000
*  $DS=DYNA597 , HBB7708, 021004  PDJS: MLS display ROSeclabel          00198000
* TYN1343                                                               00199000
*  $DU=DJKA613 , HBB7709, 021201, PDSZ: Dub msg wait A613.02            00200000
*  $xx         , HBB7709, 030624, PDNU: Backed out D OMVS,MF declares   00201000
*  $DT=DYNA621   HBB7720  021201  PDNU: Process MOUNT via SET OMVS=(xx) 00202000
*  $DV=DDEA709 , HBB7720, 031117, PDGY: A709.00   D OMVS,SOCKETS        00203000
*  $DW=DDEA708   HBB7720  040106  PDNU: D OMVS,WAITERS                  00204000
*  $DX=DDEA657 , HBB7720, 031215, PDI6: Dynamic Service Activation      00205000
*  $P8=PDE0334   HBB7720  040429  PDNU: INADDRANYPORT / COUNT           00206000
*  $DY=DDEA630 , HBB7720, 040604, PDGY: D OMVS,PID=,BRL Enhancement     00207000
*  $P9=ME02408   HBB7720  041124  PDJT: Set Waiters Element Length]     00208000
*  $DZ=ME02334 , HBB7730, 050120, PDFV: D OMVS,F Filtering  A879.00     00209000
*  $03=OA10392   HBB7720  050126  PDMJ: Remove PID Leading Zeros        00210000
*  $E0=DDEA846   HBB7730  050301  PD2R: Add Hex HIF @ to OdmvCinet      00211000
*  $E1=DCRA585   HBB7730  050217  PDKG: inittab/respawn                 00212000
*  $E2=ME03593   HBB7730  041201  PDGY: D OMVS,WAITERS Part 2           00213000
*  $E3=ME03714   HBB7730  050613  PDGY: D OMVS,WAITERS HSM hook         00214000
*  $E4=DCRA857   HBB7730  050704  PDMX: Recoverable Brlm                00215000
*  $PA=ME04164   HBB7730  050726  PD2R: Add Host and Net route types    00216000
*  $PB=ME07222   HBB7740  060718  PDGY: Need extra varariable to hold   00217000
*                                       latchnum for VFS holder         00218000
*  $04=OA17535   HBB7730  060803  PDKG: Ensure all fields start ODMV    00219000
*  $PC=ME08277   HBB7740  061024  PDGY: Clarify ME07222 changes         00220000
*  $05=OA17319   HBB7730  061005  PDGY: Add versioning for waiters      00221000
*                                       Change flag is @04 in R8        00222000
*  $E5=DCRB241   HBB7750  070219  PDGY: Add pfs status to D OMVS,F      00223000
*  $E6=DCRB395   HBB7760, 070915, PDI6: User Syscall Trace              00224000
*  $E7=DCRB564   HBB7760  080321  PDKY: Add timestamp to OdmvDWelement  00225000
*  $E8=DCRB545   HBB7760, 080429, PD2R: ALTROOT Support                 00226000
*  $E9=DCRB564   HBB7760  080512  PDKY: Add start time and PFS status   00227000
*                                       lines to OdmvPFS                00228000
*  $PD=ME15771   HBB7760  090312  PDJN: Dup ODMVPFSBLANK                00229000
*  $EA=DCRC028   HBB7780  100111  PD2R: Mount Granularity     C028.01   00230000
*  $EB=DCRB950   HBB7780  091005  PDGY: D OMVS,W Enhancements           00231000
*  $PE=ME19238   HBB7780  100521  PDGY: Move non-mutually exclusive     00232000
*                                       flags to OdmvInFlags            00233000
*  $EC=DCRC028   HBB7780  100620  PDX8: Mount Granularity     C028.04   00234000
*  $ED=DCRC034   HBB7780  100606  PDMX: Lost msg detection              00235000
*  $EE=DCRC028   HBB7780  100720  PDX8: Mount Granularity     C028.05   00236000
*  $EF=DCRC034   HBB7780  100606  PDMX: Lost msg detection              00237000
*  $EG=DCRC412   HBB7790  120310  PDJN: Pipe MAXPIPES Limit and         00238000
*                                       D OMVS,PIPES                    00239000
*  $EH=DCRC412   HBB7790  120512  PDJN: D OMVS,PIPES,UID=     C412.01   00240000
*  $EI=DCRC509   HBB7790  120505  PDMX: Unicode                         00241000
*  $EJ=DCRC403   HBB7790  120723  PDJQ: D OMVS,STORAGE        C403.00   00242000
*  $EK=DCRC412   HBB7790  120728  PDJN: MAXPIPEUSER statement C412.02   00243000
*  $EL=ME24829,  HBB7790, 120912, PDJQ: Rework for DCR C403.00          00244000
*  $EM=DCRC114   HBB7790, 121113, PDKG: Process wait time               00245000
*  $EN=DCRC595   HBB77A0  130508  PDJN: AMODE64 FSRB/FLKS Above the Bar 00246000
*  $EO=ME26955   HBB77A0  131215  PDJQ: zIIP time                       00247000
*  $EP=DCRC625   HBB77A0  140814  PDGY: KERNELSTACKS                    00248000
*  $EQ=ME26666   HBB77B0  150504  PDLZ: Display security mode D OMVS,F  00249000
*  $ER=DCRC937   HBB77B0  151130  PDX8: VERSION UNMOUNT                 00250000
*  $ES=DCRC893   HBB77B0, 151130, PDLO: SYSCALL Exits                   00251000
*  $06=OA51000   HBB77B0  161031  PDLZ: UMASK new parmlib statement     00252000
*                                       (Rollup DCRD018)                00253000
*  $PF=WI148727  HBB77B0  170105  PDLZ: plx/asm mapping mixmatch        00254000
*  $ET=DCRC923   HBB77B0  161207  PDLZ: vfs mirroring d omvs,f msg      00255000
*  $EU=W227416   HBB77C0  180504  PDKG: Disable forkcopy(COW)           00256000
*                                                                       00257000
*            <<<See Note above about CBGEN>>>                           00258000
****END OF SPECIFICATIONS*********************************************/ 00259000
*% /*                                                                   00260000
.P0      ANOP                                                           00261000
         AIF   ('&ZCBPRINT' EQ 'NO').P1                                 00262000
         AIF   ('&LIST' EQ 'YES').P2                                    00263000
.P1      ANOP                                                           00264000
         PUSH  PRINT                                                    00265000
         PRINT OFF                                                      00266000
.P2      ANOP                                                           00267000
         AIF   ('&ODMV' EQ 'NO').L0002                                  00268000
         AIF   ('&DSECT' EQ 'YES').L0003                                00269000
         AIF   ('&ODMV' NE 'YES').L0002                                 00270000
.L0003   ANOP                                                           00271000
*                                                                       00272000
*   Mapping of ODMV data area supplied to BPXEKDA                       00273000
*                                                                       00274000
*                                                                       00275000
         AIF   ('&DSECT' EQ 'YES').L0004                                00276000
ODMV     DS    0D                                                       00277000
         AGO   .L0005                                                   00278000
.L0004   ANOP                                                           00279000
ODMV     DSECT                                                          00280000
.L0005   ANOP                                                           00281000
ODMVID   DS    CL4       EBCDIC ID - ODMV                               00282000
ODMVOUTPTR DS  A         Address of Output area ODMVOUT                 00283000
*                                                                       00284000
*   Input parm area supplied to BPXEKDA                                 00285000
*                                                                       00286000
*                                                                       00287000
ODMVINPUTPARMS DS CL88   Input parameters                               00288000
         ORG   ODMVINPUTPARMS                                           00289000
ODMVINFLAGS DS BL4       Input Flags (Non-mutually exclusive)           00290000
         ORG   ODMVINFLAGS                                              00291000
ODMVINBYTE1 DS B                                                        00292000
*  Bit definitions:                                                     00293000
ODMVSUMMARY EQU X'80'    Summary specified or defaulted                 00294000
ODMVBRLS EQU   X'40'     Byte Range Lock Wait for                       00295000
*                                                                       00296000
*      ***************************************************************  00297000
*      *                                                             *  00298000
*      * Process. Only processed when OdmvPIDs=On                       00299000
*      *                                                             *  00300000
*      ***************************************************************  00301000
*                                                                       00302000
*                                                                       00303000
ODMVRESETSYSLHW EQU X'20' Reset Highwatermark of System before         *00304000
                         gathering limit data                           00305000
ODMVVSERVER EQU X'10'    VSERVER Specified                              00306000
ODMVOWNER EQU  X'08'     D OMVS,F,OWNER= @PEM                           00307000
ODMVTYPE EQU   X'04'     D OMVS,F,TYPE= @PEM                            00308000
ODMVNAME EQU   X'02'     D OMVS,F,NAME= @PEM                            00309000
ODMVEXCEPTION EQU X'01'  D OMVS,F,EXCEPTION @PEM                        00310000
ODMVINBYTE2 DS B                                                        00311000
*  Bit definitions:                                                     00312000
ODMVWLATCHES EQU X'80'   D OMVS,W,LATCHES @PEM                          00313000
ODMVWMESSAGES EQU X'40'  D OMVS,W,MESSAGES @PEM                         00314000
ODMVWOTHER EQU X'20'     D OMVS,W,OTHER @PEM                            00315000
ODMVWAGE EQU   X'10'     D OMVS,W,AGE @PEM                              00316000
ODMVWSPECIAL EQU X'08'   D OMVS,W,SPECIAL @PEM                          00317000
ODMVFSUID EQU  X'04'     D OMVS,F,UID=                                  00318000
ODMVPIPESRESET EQU X'02' Reset Pipe HIGHWATER USER info                 00319000
*                                                                       00320000
*      ***************************************************************  00321000
*      *                                                             *  00322000
*      * OdmvInFlagsM contains mutually exclusive flags. Specifying  *  00323000
*      * more than one is an error. BPXEKDA validates that only one  *  00324000
*      * flag is specified. BPXOMAST does not validate this. *********  00325000
*        *************************************************              00326000
*                                                                       00327000
*      ***************************************************************  00328000
*                                                                       00329000
*                                                                       00330000
         ORG   ODMVINFLAGS+4                                            00331000
ODMVINFLAGSM DS BL4      Mutually Exclusive Input Flags                 00332000
         ORG   ODMVINFLAGSM                                             00333000
ODMVINBYTEM1 DS B                                                       00334000
*  Bit definitions:                                                     00335000
ODMVFILES EQU  X'80'     FILE operand specified                         00336000
ODMVASIDALLS EQU X'40'   ASID=ALL or VSERVER specified                  00337000
ODMVASIDS EQU  X'20'     ASID specified and not ALL                     00338000
ODMVUS   EQU   X'10'     User Name specified                            00339000
ODMVSTORAGE EQU X'08'    STORAGE specified                              00340000
ODMVOPTIONS EQU X'04'    OPTIONS specified                              00341000
ODMVPIDS EQU   X'02'     PID specified                                  00342000
ODMVPFSBIT EQU X'01'     PFS operand specified                          00343000
ODMVINBYTEM2 DS B                                                       00344000
*  Bit definitions:                                                     00345000
ODMVCINETALL EQU X'80'   CINET=ALL specified                            00346000
ODMVCINETTP EQU X'40'    CINET=tpname specified                         00347000
ODMVLIMITS EQU X'20'     LIMITS specified. Gathers                      00348000
*                                                                       00349000
*      ***************************************************************  00350000
*      *                                                             *  00351000
*      * System or Process Limit Data. PID is set                       00352000
*      * in OdmvPidParm then Process Limits are                         00353000
*      * returned, else Sustem Limits.                                  00354000
*      *                                                             *  00355000
*      ***************************************************************  00356000
*                                                                       00357000
*                                                                       00358000
ODMVSER  EQU   X'10'     SER specified. Gathers USS Serialization data  00359000
ODMVSHORTMF EQU X'08'    MF specified                                   00360000
ODMVALLMF EQU  X'04'     MF=ALL specified                               00361000
ODMVPURGEMF EQU X'02'    MF=PURGE specified                             00362000
ODMVACTSERV EQU X'01'    ACTIVATE=SERVICE                               00363000
ODMVINBYTEM3 DS B                                                       00364000
*  Bit definitions:                                                     00365000
ODMVSOCKETS EQU X'80'    SOCKETS specified                              00366000
ODMVWAITERS EQU X'40'    D OMVS,WAITERS                                 00367000
ODMVUSRMNT EQU X'20'     D OMVS,USERMOUNTS                              00368000
ODMVPIPES EQU  X'10'     D OMVS,PIPES                                   00369000
ODMVPIPESALL EQU X'08'   D OmVS,PIPES,ALL                               00370000
ODMVPIPEUID EQU X'04'    D OMVS,PIPES,UID=                              00371000
ODMVADUBWS EQU X'02'     D OMVS,ASID=DUBW                               00372000
ODMVSTORAGERESET EQU X'01' D OMVS,STORAGE,RESET                         00373000
ODMVINBYTEM4 DS B                                                       00374000
ODMVPIDPARM DS F         PID valid when OdmvPIDs=On                     00375000
ODMVASIDPARM DS H        ASID valid when OdmvASIDs=On                   00376000
ODMVUPARM DS   CL8       User name valid when OdmvUd=On or sysname     *00377000
                         when OdmvOwner or type when OdmvType           00378000
ODMVCINETTPNAME DS CL8   When OdmvCinetTP, this field holds tpname      00379000
ODMVUPARM2 DS  CL44      Filename valid when OdmvName is given          00380000
         DS    CL2       Available                                      00381000
ODMVUIDPARM DS F         UID value when OdmvFSuid=on ! OdmvPipeUid=ON   00382000
ODMVRESERVED1 DS CL8     Reserved @EEC                                  00383000
ODMVINPUTEND DS 0C       End of Input Block                             00384000
ODMV_LEN EQU   *-ODMV                                                   00385000
.L0002   ANOP                                                           00386000
         AIF   ('&ODMVOUT' EQ 'NO').L0006                               00387000
         AIF   ('&DSECT' EQ 'YES').L0007                                00388000
         AIF   ('&ODMVOUT' NE 'YES').L0006                              00389000
.L0007   ANOP                                                           00390000
*                                                                       00391000
*   Output area returned by BPXEKDA                                     00392000
*                                                                       00393000
*                                                                       00394000
         AIF   ('&DSECT' EQ 'YES').L0008                                00395000
ODMVOUT  DS    0D                                                       00396000
         AGO   .L0009                                                   00397000
.L0008   ANOP                                                           00398000
ODMVOUT  DSECT                                                          00399000
.L0009   ANOP                                                           00400000
ODMVVERNUM DS  F         Version Number of Output Area                  00401000
ODMVSUMMARYDATA DS CL52  Summary data returned on all invocations       00402000
         ORG   ODMVSUMMARYDATA                                          00403000
ODMVOMVSPROC DS CL8      OMVS Procedure name                            00404000
ODMVGEN01 DS   F                                                        00405000
         ORG   ODMVGEN01                                                00406000
ODMVGEN02 DS   H                                                        00407000
ODMVKERNELASID DS H      Kernel's address space                         00408000
ODMVPARMMEMLIST DS CL40  List of OMVS Parmlib member suffixes          *00409000
                         (XX,YY,ZZ,..)                                  00410000
ODMVOPTIONSDATA DS CL1060 Options data returned for OdmvOptions         00411000
         ORG   ODMVOPTIONSDATA                                          00412000
ODMVMAXPROCSYS DS F      Max processes on system                        00413000
ODMVCHILDMAX DS F        Max processes per User ID                      00414000
ODMVMAXFILEPROC DS F     Max number of allocated files for a single    *00415000
                         process                                        00416000
ODMVMAXFILESIZE DS F     Max file size                                  00417000
ODMVMAXCPUTIME DS F      Max CPU time                                   00418000
ODMVMAXUSERS DS F        Max number of users on system                  00419000
ODMVMAXRTYS DS F         Max number of remote-terminal sessions         00420000
ODMVMAXPTYS DS F         Max number of pseudo-terminal sessions         00421000
ODMVMAXMMAPAREA DS F     Max size of Memory Map Area in PAGES           00422000
ODMVMAXASSIZE DS F       Max address space size                         00423000
ODMVMAXTHREADS DS F      Max # of Threads                               00424000
ODMVMAXTHREADTASKS DS F  Max number of tasks running Pthreads per      *00425000
                         process                                        00426000
ODMVMAXCORESIZE DS F     Max core size                                  00427000
ODMVMAXSHRPAGES DS F     Maximum number of pages that can be in a      *00428000
                         shared relationship in the system              00429000
ODMVMAXMSGNIDS DS F      Max system message queue IDs                   00430000
ODMVMAXMSGQBYTES DS F    Max bytes per message queue                    00431000
ODMVMAXMSGQMNUM DS F     Max messages per queue                         00432000
ODMVMAXSHMNIDS DS F      Max system shared memory IDs                   00433000
ODMVMAXSHMSPAGES DS F    Max system shared memory pages for all        *00434000
                         segements                                      00435000
ODMVMAXSHMMPAGES DS F    Max shared memory pages per segment            00436000
ODMVMAXSHMNSEGS DS F     Max shared memory segments per process         00437000
ODMVMAXSEMNIDS DS F      Max system semaphore IDs                       00438000
ODMVMAXSEMNSEMS DS F     Max number of semaphores per semaphore set     00439000
ODMVMAXSEMNOPS DS F      Max number of operations per BPX1SOP (SEMOP)  *00440000
                         call                                           00441000
ODMVSUPERUSER DS CL8     SuperUser                                      00442000
ODMVSTEPLIBLISTLEN DS X  Length of STEPLIB name                         00443000
ODMVSTEPLIBLIST DS CL255 Name of STEPLIB dataset                        00444000
ODMVSETPPGCNT DS X       Priority PG count                              00445000
ODMVSETPGOALCNT DS X     Priority Goal count                            00446000
ODMVUSERIDTABLELEN DS X  Length of table name                           00447000
ODMVRESERVED02 DS CL2    Reserved                                       00448000
ODMVUSERIDTABLE DS CL255 Name of Userid table                           00449000
ODMVPRIORITYPG DS H      performance group numbers for compatibility   *00450000
                         mode 40 possible entries                       00451000
         ORG   ODMVPRIORITYPG+80                                        00452000
ODMVRESERVED10 DS CL4    Reserved                                       00453000
ODMVGEN04 DS   0C        Ensure array on DWD                            00454000
ODMVPRIORITYGOAL DS CL8  service classes for goal mode 40 possible     *00455000
                         entries                                        00456000
         ORG   ODMVPRIORITYGOAL+320                                     00457000
ODMVRESERVED09 DS CL4    Reserved                                       00458000
ODMVTTYGROUP DS CL8      TTY Group name                                 00459000
ODMVMAXQUEUEDSIGS DS F   MaxQueuedSigs from Optn                        00460000
ODMVSHRLIBRGNSIZE DS F   ShrLibRgnSize from Optn                        00461000
ODMVSHRLIBMAXPAGES DS F  ShrLibMaxPages from Optn                       00462000
ODMVVERSION DS CL8       OS/390 Version String                          00463000
ODMVFLAGWORD01 DS F      Flag word                                      00464000
         ORG   ODMVFLAGWORD01                                           00465000
ODMVFLAGBYTE01 DS B                                                     00466000
*  Bit definitions:                                                     00467000
ODMVSYSCALL_COUNTS EQU X'40' ON = counts being traced OFF= counts not  *00468000
                         being done                                     00469000
ODMVSYSPLEX EQU X'20'    ON= IPLed sysplex = Y OFF= local system        00470000
ODMVSETPEXIST EQU X'10'  If SETP was created                            00471000
ODMVLIMMSGSYS EQU X'08'  Level of warning messages for                  00472000
ODMVLIMMSGPROC EQU X'04' reached limits. Can be SYS=OFF PROC=OFF is    *00473000
                         NONE SYS=ON PROC=OFF is SYSTEM SYS=ON PROC=ON *00474000
                         is ALL                                         00475000
ODMVAUTOCVT EQU X'02'    AutoCvt On or Off                              00476000
ODMVSWAABOVE EQU X'01'   SWA above if on                                00477000
ODMVFLAGBYTE02 DS B                                                     00478000
*  Bit definitions:                                                     00479000
ODMVMAXCORESIZEBIN EQU X'80' MaxCoreSize type On = BinMult, Off = Bin   00480000
ODMVALTROOT EQU X'40'    ALTROOT Active=mounted                         00481000
ODMVUMTBBUILT EQU X'20'  On = Nonprivileged user mounts table built    *00482000
                         successfully                                   00483000
ODMVLOSTMSG EQU X'10'    LostMsg On or Off                              00484000
ODMVAUTOCVTALL EQU X'08' AutoCvt All                                    00485000
ODMVKSTACKSABOVE EQU X'04' Kernal stacks above if on                    00486000
ODMVVERSIONUNMNT EQU X'02' UNMOUNT in VERSION if on                     00487000
         ORG   ODMVOPTIONSDATA+1060                                     00488000
ODMVSECONDARYDATA DS CL100 Secondary Output Data                        00489000
         ORG   ODMVSECONDARYDATA                                        00490000
ODMVOUTARRAYSIZE DS F    Number of entries in secondary output data    *00491000
                         pointer array                                  00492000
ODMVOUTARRAYPTR DS A     Address of output data pointer array           00493000
ODMVTHDARRAYSIZE DS F    Number of entries in output thread data       *00494000
                         pointer array                                  00495000
ODMVTHDARRAYPTR DS A     Address of thread data pointer array           00496000
ODMVPFSCOUNTS DS CL12    Counts of PFS Array entries                    00497000
         ORG   ODMVPFSCOUNTS                                            00498000
ODMVPFSTYPECOUNT DS F    Number of PFS 'type' entries                   00499000
ODMVPFSNAMECOUNT DS F    Number of PFS 'name' entries                   00500000
ODMVPFSPARMCOUNT DS F    Number of Parm entries                         00501000
ODMVCINETCOUNTS DS CL12  Counts of CINET Array entries                  00502000
         ORG   ODMVCINETCOUNTS                                          00503000
ODMVCINETHOMECNT DS F    Number of CINET home entries                   00504000
ODMVCINETHOSTCNT DS F    Number of CINET host entries                   00505000
ODMVCINETNETWCNT DS F    Number of CINET netw entries                   00506000
ODMVFLAGWORD02 DS F      Flag word                                      00507000
*  Bit definitions:                                                     00508000
ODMVPARTIAL EQU X'80'    Partial thread data                            00509000
ODMVSYSLIMITS EQU X'40'  Sytem Limits returned                          00510000
ODMVPRCLIMITS EQU X'20'  Process Limits returned                        00511000
ODMVBRLMSRV DS CL8       ByterangelockMgr Server                        00512000
ODMVLIMITSPTR DS A       Address of limits data pointer When           *00513000
                         OdmvSysLimits is on it points to a structure  *00514000
                         OdmvSysL. When OdmvPrcLimits is on it points  *00515000
                         to a structure OdmvPrcL                        00516000
ODMVEXTOPTDATAPTR DS A   Address of pointer to the Extended Options    *00517000
                         Dat                                            00518000
ODMVIPV6PTR DS A         Address of pointer to the OdmvIpv6 structure   00519000
ODMVSERPTR DS  A         Address of serialization data header          *00520000
                         OdmvSerHdr                                     00521000
ODMVDYNSERVPTR DS A      Address of ACTIVATE=SERVICE Data header       *00522000
                         OdmvDynServ                                    00523000
ODMVUSRMNTTBPTR DS A     Address of nonprivileged user mounts table    *00524000
                         header.                                        00525000
ODMVUMASK DS   CL4       UMASK value                                    00526000
ODMVRESERVED11 DS CL20   Reserved for future extensions. Consider      *00527000
                         adding only pointers to structures here ]]]    00528000
ODMVRESERVEDDATA DS CL432 Reserved Output Area for Operating System    *00529000
                         Usage                                          00530000
         ORG   ODMVRESERVEDDATA                                         00531000
ODMVCBGEN06 DS CL8       Address of output area                         00532000
         ORG   ODMVCBGEN06                                              00533000
ODMVOUTPUTALETADDR DS CL8 Assembler users can use this                  00534000
         ORG   ODMVOUTPUTALETADDR                                       00535000
ODMVOUTPUTALET DS F                                                     00536000
ODMVOUTPUTADDR DS A                                                     00537000
ODMVSTOKEN DS  CL8       Stoken of Data Space                           00538000
ODMVODCA DS    A         Address of Odca                                00539000
ODMVRETCODE DS F         Return Code from BPXODMVS                      00540000
ODMVCINETMSGNUM DS F     Error Message Number                           00541000
ODMVFLAGWORD03 DS F      Flag word                                      00542000
*  Bit definitions:                                                     00543000
ODMVCAPS EQU   X'80'     CAPS Specified on D OMVS                       00544000
ODMVPROTPGPTR DS A       Ptr. to begin of prot. Pg.                     00545000
ODMVAUTHPGMLISTLEN DS X  Length of Authpgm name                         00546000
ODMVAUTHPGMLIST DS CL255 Name of Authpgm dataset                        00547000
ODMVSERVLINKLIBLEN DS X  Length of Serv_Linklib DS                      00548000
ODMVSERVLINKLIB DS CL44  Name of Serv_Linklib DS                        00549000
ODMVSERVLPALIBLEN DS X   Length of Serv_Lpalib DS                       00550000
ODMVSERVLPALIB DS CL44   Name of Serv_Lpalib DS                         00551000
ODMVSERVLINKLIBVOLLEN DS X Length of Serv_Lpalib DS                     00552000
ODMVSERVLINKLIBVOL DS CL6 Name of Serv_Lpalib DS                        00553000
ODMVSERVLPALIBVOLLEN DS X Length of Serv_Lpalib DS                      00554000
ODMVSERVLPALIBVOL DS CL6 Name of Serv_Lpalib DS                         00555000
ODMVCINETPORT DS H       INADDRANYPORT                                  00556000
ODMVCINETCOUNT DS H      INADDRANYCOUNT                                 00557000
ODMVMAXIOBUFUSER DS F    MaxIoBufUser                                   00558000
ODMVPWTE DS    CL6       PWT value SMF/ENV/SMFENV                       00559000
ODMVRESERVED03 DS CL6    reserved                                       00560000
ODMVPVTSTGCURRENT DS F   reserved                                       00561000
ODMVPVTSTGHIGHWATER DS F reserved                                       00562000
ODMVSYSSTKINUSE DS F     reserved                                       00563000
         ORG   ODMVSYSSTKINUSE                                          00564000
ODMVSYSTHDINUSE DS F     threads in use                                 00565000
ODMVSYSSTKHIGHWATER DS F reserved                                       00566000
         ORG   ODMVSYSSTKHIGHWATER                                      00567000
ODMVSYSTHDHIGHWATER DS F threads in use hw mark                         00568000
ODMVEND  DS    0C        End of Block                                   00569000
ODMVOUT_LEN EQU *-ODMVOUT                                               00570000
.L0006   ANOP                                                           00571000
         AIF   ('&ODMVOUTARRAY' EQ 'NO').L000A                          00572000
         AIF   ('&DSECT' EQ 'YES').L000B                                00573000
         AIF   ('&ODMVOUTARRAY' NE 'YES').L000A                         00574000
.L000B   ANOP                                                           00575000
*                                                                       00576000
* ********************************************************************  00577000
* * Output area array returned for OdmvFiles, OdmvPIDs, OdmvVserver, *  00578000
* *  OdmvAsidAlls, OdmvAsids, OdmvPFSBit, OdmvCinetTp, OdmvCinetAll  *  00579000
* *  or OdmvUs that contains the list of pointers to the associated  *  00580000
* *  output areas.                                                      00581000
* ********************************************************************  00582000
*                                                                       00583000
*                                                                       00584000
         AIF   ('&DSECT' EQ 'YES').L000C                                00585000
ODMVOUTARRAY DS 0F                                                      00586000
         AGO   .L000D                                                   00587000
.L000C   ANOP                                                           00588000
ODMVOUTARRAY DSECT                                                      00589000
.L000D   ANOP                                                           00590000
ODMVOUTARRAYELEMPTR DS A                                                00591000
ODMVOUTARRAY_LEN EQU *-ODMVOUTARRAY                                     00592000
.L000A   ANOP                                                           00593000
         AIF   ('&ODMVTHDARRAY' EQ 'NO').L000E                          00594000
         AIF   ('&DSECT' EQ 'YES').L000F                                00595000
         AIF   ('&ODMVTHDARRAY' NE 'YES').L000E                         00596000
.L000F   ANOP                                                           00597000
*                                                                       00598000
* ********************************************************************  00599000
* * Output area array returned for OdmvPIDs for the list of pointers *  00600000
* *  to the thread data areas for the returned process                  00601000
* ********************************************************************  00602000
*                                                                       00603000
*                                                                       00604000
         AIF   ('&DSECT' EQ 'YES').L0010                                00605000
ODMVTHDARRAY DS 0F                                                      00606000
         AGO   .L0011                                                   00607000
.L0010   ANOP                                                           00608000
ODMVTHDARRAY DSECT                                                      00609000
.L0011   ANOP                                                           00610000
ODMVTHDARRAYELEMPTR DS A                                                00611000
ODMVTHDARRAY_LEN EQU *-ODMVTHDARRAY                                     00612000
.L000E   ANOP                                                           00613000
         AIF   ('&ODMVFILE' EQ 'NO').L0012                              00614000
         AIF   ('&DSECT' EQ 'YES').L0013                                00615000
         AIF   ('&ODMVFILE' NE 'YES').L0012                             00616000
.L0013   ANOP                                                           00617000
*                                                                       00618000
* ********************************************************************  00619000
* * Mapping of file data returned for OdmvFiles - the actual data    *  00620000
* * comes from fields in the BPXYMNTE.  During processing of Display *  00621000
* * OMVS it is moved into BPXZODMV. (Code Review)                       00622000
* ********************************************************************  00623000
*                                                                       00624000
*                                                                       00625000
         AIF   ('&DSECT' EQ 'YES').L0014                                00626000
ODMVFILE DS    0F                                                       00627000
         AGO   .L0015                                                   00628000
.L0014   ANOP                                                           00629000
ODMVFILE DSECT                                                          00630000
.L0015   ANOP                                                           00631000
ODMVDEVICE DS  F         Device Name the st_dev value that is returned *00632000
                         by the stat system call for each file in the  *00633000
                         file system.                                   00634000
ODMVTYPENAME DS CL8      File System Type name from the FILESYSTYPE    *00635000
                         parmlib statement                              00636000
ODMVSTATUS DS  F         Status matches MSG BPXO45Ie 1= FORCE UNMOUNT  *00637000
                         2= DRAIN UNMOUNT 3= IMMEDIATE UNMOUNT 4=      *00638000
                         NORMAL UNMOUNT 5= RESET UNMOUNT 6= IMMEDIATE  *00639000
                         UNMOUNT ATTEMPTED 7= ACTIVE 8= QUIESCED 9=    *00640000
                         NOT ACTIVE 10= MOUNT IN PROGRESS 11= ASYNCH   *00641000
                         MOUNT IN PROGRESS 12= IN RECOVERY 13= UNOWNED *00642000
                         14= SUPERQUIESCED 15= RECYCLING 16=           *00643000
                         RECYCLING,ASYNCH MOUNTING 17= RECYCLING,NOT   *00644000
                         ACTIVE                                         00645000
ODMVQJOBNAME DS CL8      Quiesce Job Name                               00646000
ODMVQPID DS    F         Quiesce Process ID                             00647000
ODMVMOUNTMODE DS F       Mount mode for filesystem 1 = R/W, 2 = R/O     00648000
ODMVFSNAME DS  CL44      File System name for PDSE/X                    00649000
ODMVPATH DS    CL63      Path or Directory name converted to upper     *00650000
                         case characters                                00651000
ODMVMOUNTPARM DS CL57    Mount parm truncated and optionally converted *00652000
                         to upper case                                  00653000
ODMVFSOWNER DS CL8       FS Owner name                                  00654000
ODMVFSNOAUTOMOVE DS F    1 = fs is AUTOMOVEable 2 = fs is Not          *00655000
                         AUTOMOVEable 3 = AUTOMOVE = U 4 = AUTOMOVE =  *00656000
                         I 5 = AUTOMOVE = E                             00657000
ODMVQSYSTEM DS CL8       Quiesce system                                 00658000
ODMVFSCLIENT DS F        1 = Yes is a client 2 = No is not a client     00659000
ODMVFSFILETAG DS CL4     Mount TAG data @DNC                            00660000
ODMVSYSLIST DS CL260     System list                                    00661000
         ORG   ODMVSYSLIST                                              00662000
ODMVSLNUM DS   H         Number of systems in list                      00663000
         DS    H                                                        00664000
ODMVSLNAME DS  CL8       System names                                   00665000
         ORG   ODMVSYSLIST+260                                          00666000
ODMVAGGNAME DS CL44      Aggregate Name                                 00667000
ODMVROSECL DS  CL8       ROSeclabel                                     00668000
ODMVFSLATNUM DS F        File System Latch Number                       00669000
ODMVFSQLATNUM DS F       Quiesce Latch Number                           00670000
ODMVFSMTDATA DS CL18     Mount Date,time in EBCDIC                      00671000
         ORG   ODMVFSMTDATA                                             00672000
ODMVFSMTDATE DS CL10     yyyy/mm/dd                                     00673000
         ORG   ODMVFSMTDATE                                             00674000
ODMVFSMTYEAR DS CL4      yyyy                                           00675000
         ORG   ODMVFSMTYEAR                                             00676000
         DS    CL2       yy (2004...the 20)                             00677000
ODMVFSMTYY DS  CL2       yy (2004...the 04)                             00678000
ODMVFSSLASH1 DS CL1      /                                              00679000
ODMVFSMTMONTH DS CL2     mm                                             00680000
ODMVFSSLASH2 DS CL1      /                                              00681000
ODMVFSMTDAY DS CL2       dd                                             00682000
ODMVFSMTTIME DS CL8      hh:mm:ss                                       00683000
         ORG   ODMVFSMTTIME                                             00684000
ODMVFSHH DS    CL2       hh                                             00685000
ODMVFSDOT1 DS  CL1       :                                              00686000
ODMVFSMM DS    CL2       mm                                             00687000
ODMVFSDOT2 DS  CL1       :                                              00688000
ODMVFSSS DS    CL2       ss                                             00689000
ODMVFSPFSNORMALSTATUS DS CL56 Pfs normal status                         00690000
ODMVFSPFSEXCPSTATUS DS CL56 Pfs exception status                        00691000
ODMVFSFLAGS DS B                                                        00692000
*  Bit definitions:                                                     00693000
ODMVFSNOSUID EQU X'80'   NOSETUID                                       00694000
ODMVFSNOSEC EQU X'40'    NOSECURITY                                     00695000
ODMVFSUNMNTVER EQU X'20' Auto-unmnt version FS                          00696000
ODMVFSMIRROR EQU X'10'   vfs MIRRORING                                  00697000
         DS    CL1       available                                      00698000
ODMVFSUSRMNTUID DS F     UID of user that mounted the file system.     *00699000
                         Always 0 for the privileged user mounts        00700000
ODMVFILE_LEN EQU *-ODMVFILE                                             00701000
.L0012   ANOP                                                           00702000
         AIF   ('&ODMVPROCESS' EQ 'NO').L0016                           00703000
         AIF   ('&DSECT' EQ 'YES').L0017                                00704000
         AIF   ('&ODMVPROCESS' NE 'YES').L0016                          00705000
.L0017   ANOP                                                           00706000
*                                                                       00707000
* ********************************************************************  00708000
* * Mapping of process data returned for OdmvPids, OdmvAsidAlls,     *  00709000
* *   OdmvAsids                                                      *  00710000
* ********************************************************************  00711000
*                                                                       00712000
*                                                                       00713000
         AIF   ('&DSECT' EQ 'YES').L0018                                00714000
ODMVPROCESS DS 0F                                                       00715000
         AGO   .L0019                                                   00716000
.L0018   ANOP                                                           00717000
ODMVPROCESS DSECT                                                       00718000
.L0019   ANOP                                                           00719000
ODMVJOBNAME DS CL8       Job name from ASCBJBNI or ASCBJBNS             00720000
ODMVUSER DS    CL8       User Name from OasbLoginName                   00721000
ODMVPID  DS    F         Process ID                                     00722000
ODMVPPID DS    F         Parent's Process ID                            00723000
ODMVASID DS    H         Address space ID or zero for zombie state      00724000
ODMVRESERVED04 DS CL5    Reserved                                       00725000
ODMVSTARTYD DS CL7       Local Start Time YYYYDDD                       00726000
         ORG   ODMVSTARTYD                                              00727000
ODMVSTYY DS    CL4       Start Time Year                                00728000
ODMVSTDD DS    CL3       Start Time Day of year (1-366)                 00729000
ODMVSTART DS   CL6       Start Time hhmmss                              00730000
         ORG   ODMVSTART                                                00731000
ODMVSTHH DS    CL2       Start Time hours                               00732000
ODMVSTMM DS    CL2       Start Time minutes                             00733000
ODMVSTSS DS    CL2       Start Time seconds                             00734000
ODMVCT   DS    CL8       Process system and user compute time           00735000
ODMVCSTATE DS  BL4       Process state                                  00736000
         ORG   ODMVCSTATE                                               00737000
ODMVSTATUS1 DS B         MVS status                                     00738000
*  Bit definitions:                                                     00739000
ODMVSWAP EQU   X'80'     Swapped out                                    00740000
ODMVWAITP EQU  X'40'     Ptrace Kernel Wait                             00741000
ODMVSTATUS2 DS B         Process status                                 00742000
*  Bit definitions:                                                     00743000
ODMVSTOPPED EQU X'80'    Stopped process                                00744000
ODMVGEN05 EQU  X'40'                                                    00745000
ODMVMULTHREAD EQU X'20'  0=One OpenMVS active task                      00746000
ODMVPTHREAD EQU X'10'    0=No pthread task in process                   00747000
ODMVBLOCKREG EQU X'08'   registered blocker                             00748000
ODMVPERMREG EQU X'04'    registered permanent proc                      00749000
ODMVRESPAWN EQU X'02'    process started with respawn capability        00750000
ODMVUTRACED EQU X'01'    process being user traced                      00751000
ODMVSTATUS3 DS CL1       State of reported task - with PgpsPthread=0   *00752000
                         the most recent created thread, PgpsPthread=1 *00753000
                         the initial pthread task (IPT)                 00754000
ODMVRESERVED05 DS B      Reserved                                       00755000
ODMVLATCHWAITPID DS F    Latch Process ID the process is waiting for   *00756000
                         (Zero=not waiting)                             00757000
ODMVGENERALFLAGS DS BL4  General flags                                  00758000
*  Bit definitions:                                                     00759000
ODMVSERVER EQU X'80'     OdmvServerInfo data is valid                   00760000
ODMVSERVERINFO DS CL44   Server Information                             00761000
         ORG   ODMVSERVERINFO                                           00762000
ODMVSERVERNAME DS CL32   SabServerName SERVER=                          00763000
ODMVACTIVEFILES DS F     SabVDECount AF=                                00764000
ODMVMAXFILES DS F        SabMaxFiles MF=                                00765000
ODMVSERVERTYPE DS F      SabServerType TYPE= See NRegSType information *00766000
                         in BPXYNREG for definition of Server Types.    00767000
ODMVCMD  DS    CL40      Command String buffer                          00768000
ODMVRUID DS    F         Process Real User Id                           00769000
ODMVEUID DS    F         Process Effective User Id                      00770000
ODMVSTORAGEINFO DS CL8   STORAGE specified                              00771000
         ORG   ODMVSTORAGEINFO                                          00772000
ODMVSTACKSINUSE DS F     Space switch stacks in use by the process      00773000
ODMVTHREADCNT DS F       Count of pthread_created threads in process    00774000
ODMVSECLABEL DS CL8      Process Seclabel                               00775000
ODMVCTZIIP DS  CL8       Process system and user compute time on zIIP   00776000
ODMVPROCESS_LEN EQU *-ODMVPROCESS                                       00777000
.L0016   ANOP                                                           00778000
         AIF   ('&ODMVTHREADS' EQ 'NO').L001A                           00779000
         AIF   ('&DSECT' EQ 'YES').L001B                                00780000
         AIF   ('&ODMVTHREADS' NE 'YES').L001A                          00781000
.L001B   ANOP                                                           00782000
*                                                                       00783000
* ********************************************************************  00784000
* * Mapping of threads data returned for OdmvPids                       00785000
* ********************************************************************  00786000
*                                                                       00787000
*                                                                       00788000
         AIF   ('&DSECT' EQ 'YES').L001C                                00789000
ODMVTHREADS DS 0F        Thread info                                    00790000
         AGO   .L001D                                                   00791000
.L001C   ANOP                                                           00792000
ODMVTHREADS DSECT        Thread info                                    00793000
.L001D   ANOP                                                           00794000
ODMVTHDID DS   CL8       Thread ID                                      00795000
ODMVTHDTCB DS  A         TCB address                                    00796000
ODMVTHDJOBNAME DS CL8    Primary Address space job name, if primary ^= *00797000
                         home, otherwise blanks                         00798000
ODMVTHDUSERNAME DS CL8   User name if a task level security            *00799000
                         environment created by pthread_security_np    *00800000
                         exists, otherwise blanks                       00801000
ODMVTHDSYSCALL DS F      Syscall code                                   00802000
ODMVTHDTTIME DS BL8      TCB's accumulated CPU time                     00803000
ODMVTHDTAG DS  CL65      Tag data                                       00804000
ODMVTHDSTATUS1 DS CL1    Pthread created/Dubbed                         00805000
ODMVTHDSTATUS2 DS CL1    Wait/Running status                            00806000
ODMVTHDSTATUS3 DS CL1    Creation type                                  00807000
ODMVTHDSTATUS4 DS CL1    Detached/undetached                            00808000
ODMVTHDSTATUS5 DS CL1    Ptrace held                                    00809000
ODMVTHDFLAGS DS B        Thread flags                                   00810000
*  Bit definitions:                                                     00811000
ODMVTHDTAGSET EQU X'80'  Thread has tag data                            00812000
ODMVRESERVED06 DS CL1    Reserved                                       00813000
ODMVTHDBRL DS  CL28      Byte Range Lock Waiter Data valid for OdmvBrl *00814000
                         only                                           00815000
         ORG   ODMVTHDBRL                                               00816000
ODMVTHDBRLDEVNO DS F     Dev # of BRL Wait File                         00817000
ODMVTHDBRLINO DS F       Inode # of BRL Wait File                       00818000
ODMVTHDBRLOWNERPID DS F  BRL Wait FileOwner PID                         00819000
ODMVTHDBRLFILE DS CL16   BRL Wait File Name                             00820000
ODMVRESERVEDDATA2 DS CL36 For BRLM usage only                           00821000
         ORG   ODMVRESERVEDDATA2                                        00822000
ODMVTHDBRLOFTE DS A      No longer used                                 00823000
ODMVTHDBRLVNOD DS A      For use in frbrl getlk call                    00824000
         DS    CL4       Reserved added for alignment                   00825000
ODMVTHDBRLREQPTR DS ADL8                                                00826000
ODMVTHDBRLSYSNAME DS CL8 System of blocking process                     00827000
ODMVTHDBRLRESERVEDATA DS CL8 possible size change                       00828000
ODMVTHDEND DS  0C        End of thread info                             00829000
ODMVTHREADS_LEN EQU *-ODMVTHREADS                                       00830000
.L001A   ANOP                                                           00831000
         AIF   ('&ODMVPFS' EQ 'NO').L001E                               00832000
         AIF   ('&DSECT' EQ 'YES').L001F                                00833000
         AIF   ('&ODMVPFS' NE 'YES').L001E                              00834000
.L001F   ANOP                                                           00835000
*                                                                       00836000
* ********************************************************************  00837000
* *  Mapping of PFS data returned for OdmvPfsBit.                       00838000
* ********************************************************************  00839000
*                                                                       00840000
*                                                                       00841000
         AIF   ('&DSECT' EQ 'YES').L0020                                00842000
ODMVPFS  DS    0F                                                       00843000
         AGO   .L0021                                                   00844000
.L0020   ANOP                                                           00845000
ODMVPFS  DSECT                                                          00846000
.L0021   ANOP                                                           00847000
ODMVPFSCHARS DS CL212    EBCDIC data                                    00848000
         ORG   ODMVPFSCHARS                                             00849000
ODMVPFSNAME DS CL8       PFS name!type from the GFS                     00850000
ODMVPFSDESCRIPTION DS CL20 Brief description of PFS                     00851000
         ORG   ODMVPFSDESCRIPTION                                       00852000
ODMVPFSSOCKET DS CL8     if socket, the word SOCKET                     00853000
ODMVPFSVFS DS  CL12      if socket, AF_INET, etc.                       00854000
ODMVPFSENTRY DS CL8      EntryPoint name                                00855000
ODMVPFSSTATUS DS CL5     Status                                         00856000
ODMVPFSFLAGS DS CL3      Flags                                          00857000
ODMVPFSPARMS DS CL165    Parameter data                                 00858000
         ORG   ODMVPFSPARMS                                             00859000
ODMVPFSBLANK DS CL1      a blank - special for HFS                      00860000
ODMVGEN07 DS   CL164                                                    00861000
ODMVRESERVED07 DS CL3    Reserved                                       00862000
ODMVPFSNUMS DS CL28      NUMERIC data                                   00863000
         ORG   ODMVPFSNUMS                                              00864000
ODMVPFSMAXSOCK DS F      MAXSOCKETS                                     00865000
ODMVPFSOPNSOCK DS F      Open Sockets                                   00866000
ODMVPFSHWMSOCK DS F      Highwater mark                                 00867000
ODMVPFSPARMLEN DS F      The length of OdmvPFSparms                     00868000
ODMVPFSCURRENTVALUES DS CL8 Data for CURRENT VALUES                     00869000
         ORG   ODMVPFSCURRENTVALUES                                     00870000
ODMVPFSFIXED DS F        FIXED                                          00871000
ODMVPFSVIRTUAL DS F      VIRTUAL                                        00872000
ODMVPFSRECYSTATUS DS F   PFS Recycle status                             00873000
ODMVPFSRECYTIME DS CL8   hh:mm:ss Recycle time                          00874000
         ORG   ODMVPFSRECYTIME                                          00875000
ODMVPFSHH DS   CL2       hh                                             00876000
ODMVPFSDOT1 DS CL1       :                                              00877000
ODMVPFSMM DS   CL2       mm                                             00878000
ODMVPFSDOT2 DS CL1       :                                              00879000
ODMVPFSSS DS   CL2       ss                                             00880000
ODMVPFSSTARTTIME DS CL20 PFS Start time                                 00881000
         ORG   ODMVPFSSTARTTIME                                         00882000
ODMVPFSDATE DS CL10      Date                                           00883000
         DS    CL1       blank space                                    00884000
ODMVPFSTIME DS CL8       Time                                           00885000
         DS    CL1       blank space                                    00886000
ODMVPFSASNAME DS CL8     ASName                                         00887000
ODMVPFSSTATUSINFO DS CL180                                              00888000
         ORG   ODMVPFSSTATUSINFO                                        00889000
ODMVPFSSTLINE1 DS CL60   PFS Status Line 1                              00890000
ODMVPFSSTLINE2 DS CL60   PFS Status Line 2                              00891000
ODMVPFSSTLINE3 DS CL60   PFS Status LIne 3                              00892000
*                                                                       00893000
* ********************************************************************  00894000
* *  Constants for PFS recycle status                                   00895000
* ********************************************************************  00896000
*                                                                       00897000
*                                                                       00898000
ODMV#RECYCLING EQU 1                                                    00899000
ODMV#RECYCLEMOUNTING EQU 2                                              00900000
ODMV#RECYCLEMOUNTSPEND EQU 3                                            00901000
ODMVPFS_LEN EQU *-ODMVPFS                                               00902000
.L001E   ANOP                                                           00903000
         AIF   ('&ODMVSYSL' EQ 'NO').L0022                              00904000
         AIF   ('&DSECT' EQ 'YES').L0023                                00905000
         AIF   ('&ODMVSYSL' NE 'YES').L0022                             00906000
.L0023   ANOP                                                           00907000
*                                                                       00908000
* ********************************************************************  00909000
* *  Mapping of System Limit Data - Highwater and Current Usage         00910000
* ********************************************************************  00911000
*                                                                       00912000
*                                                                       00913000
         AIF   ('&DSECT' EQ 'YES').L0024                                00914000
ODMVSYSL DS    0F                                                       00915000
         AGO   .L0025                                                   00916000
.L0024   ANOP                                                           00917000
ODMVSYSL DSECT                                                          00918000
.L0025   ANOP                                                           00919000
ODMVSYSLFCHANGED DS BL4  Flag field for changed System limits           00920000
         ORG   ODMVSYSLFCHANGED                                         00921000
ODMVSYSLFBYTE1 DS B                                                     00922000
*  Bit definitions:                                                     00923000
ODMVSYSLFMAXPROCSYS EQU X'80' MaxProcSys changed                        00924000
ODMVSYSLFMAXUIDS EQU X'40' MaxUids changed                              00925000
ODMVSYSLFMAXPTYS EQU X'20' MaxPtys changed                              00926000
ODMVSYSLFMAXMMAPAREA EQU X'10' MaxMmapArea changed                      00927000
ODMVSYSLFMAXSHRPAGES EQU X'08' MaxShrPages changed                      00928000
ODMVSYSLFIPCMSGNIDS EQU X'04' IpcMsgNids changed                        00929000
ODMVSYSLFIPCSEMNIDS EQU X'02' IpcSemNids changed                        00930000
ODMVSYSLFIPCSHMNIDS EQU X'01' IpcShmNids changed                        00931000
ODMVSYSLFBYTE2 DS B                                                     00932000
*  Bit definitions:                                                     00933000
ODMVSYSLFIPCSHMSPAGES EQU X'80' IpcShmSPages changed                    00934000
ODMVSYSLFIPCMSGQBYTES EQU X'40'                                         00935000
ODMVSYSLFIPCMSGQMNUM EQU X'20'                                          00936000
ODMVSYSLFIPCSHMMPAGES EQU X'10'                                         00937000
ODMVSYSLFSHRLIBRGNSIZE EQU X'08' ShrLibRgnSize changed                  00938000
ODMVSYSLFSHRLIBMAXPAGES EQU X'04' ShrLibMaxPages changed                00939000
ODMVSYSLFMAXUSRMNTSYS EQU X'02' MAXUSERMOUNTSYS changed                 00940000
ODMVSYSLFMAXUSRMNTUSR EQU X'01' MAXUSERMOUNTUSER changed                00941000
ODMVSYSLFBYTE3 DS B                                                     00942000
ODMVSYSLFBYTE4 DS B                                                     00943000
ODMVSYSLMAXPROCSYSC DS F Current # of processes                         00944000
ODMVSYSLMAXPROCSYSH DS F Highwater # of processes                       00945000
ODMVSYSLMAXUIDSC DS F    Current # of userids                           00946000
ODMVSYSLMAXUIDSH DS F    Highwater # of userids                         00947000
ODMVSYSLMAXPTYSC DS F    Current # of ptys in use                       00948000
ODMVSYSLMAXPTYSH DS F    Highwater # of ptys in use                     00949000
ODMVSYSLMAXMMAPAREAC DS F Current # of mmap pages                       00950000
ODMVSYSLMAXMMAPAREAH DS F Highwater # of mmap pages                     00951000
ODMVSYSLMAXSHRPAGESC DS F Current # of shared pages                     00952000
ODMVSYSLMAXSHRPAGESH DS F Highwater # of shared pages                   00953000
ODMVSYSLIPCMSGNIDSC DS F Current # of message queue IDs in use          00954000
ODMVSYSLIPCMSGNIDSH DS F Highwater # of message queue IDs in use        00955000
ODMVSYSLIPCSEMNIDSC DS F Current # of semaphore IDs in use              00956000
ODMVSYSLIPCSEMNIDSH DS F Highwater # of semaphore IDs in use            00957000
ODMVSYSLIPCSHMNIDSC DS F Current # of shared memory IDs in use          00958000
ODMVSYSLIPCSHMNIDSH DS F Highwater # of shared memory IDs in use        00959000
ODMVSYSLIPCSHMSPAGESC DS F Current # of shared memory pages in use      00960000
ODMVSYSLIPCSHMSPAGESH DS F Highwater # of shared memory pages in use    00961000
ODMVSYSLIPCMSGQBYTESH DS F Highwater # of bytes used in a msg queue    *00962000
                         for process                                    00963000
ODMVSYSLIPCMSGQBYTESM DS F Maximum # of bytes allowed in a msg queue   *00964000
                         for process                                    00965000
ODMVSYSLIPCMSGQMNUMH DS F Highwater # of msgs used in a msg queue for  *00966000
                         process                                        00967000
ODMVSYSLIPCMSGQMNUMM DS F Maximum # of msgs allowed in a msg queue for *00968000
                         process                                        00969000
ODMVSYSLIPCSHMMPAGESH DS F Highwater # of shr mem pages in a segment   *00970000
                         for process                                    00971000
ODMVSYSLIPCSHMMPAGESM DS F Maximum # of shr mem pages allowed in       *00972000
                         segment for process                            00973000
ODMVSYSLSHRLIBRGNSIZEC DS F Current usage of system shared library     *00974000
                         region                                         00975000
ODMVSYSLSHRLIBRGNSIZEH DS F Highwater usage of system shared library   *00976000
                         region                                         00977000
ODMVSYSLSHRLIBMAXPAGESC DS F Current # of pages of user shared library *00978000
                         region                                         00979000
ODMVSYSLSHRLIBMAXPAGESH DS F Highwater # of pages of user shared       *00980000
                         library pgms                                   00981000
ODMVSYSLIPCSHMMPAGESMBM DS F Maximum # of shr mem pages allowed in     *00982000
                         segment for process in BinMult form            00983000
ODMVSYSLMAXUSRMNTSYSCUR DS F Current # of MAXUSERMOUNTSYS               00984000
ODMVSYSLMAXUSRMNTSYSHW DS F HighWater mark of MAXUSERMOUNTSYS           00985000
ODMVSYSLMAXUSRMNTUSRCUR DS F Current # of MAXUSERMOUNTUSER              00986000
ODMVSYSLMAXUSRMNTUSRHW DS F HighWater mark of MAXUSERMOUNTUSER          00987000
ODMVSYSLMAXPIPESLMT DS F MAXPIPES Limit needed here because not a      *00988000
                         BPXPRMxx option                                00989000
ODMVSYSLMAXPIPESCUR DS F Current usage of Pipe PFS Queues               00990000
ODMVSYSLMAXPIPESHW DS F  Highwater usage of Pipe PFS Queues             00991000
ODMVSYSL_LEN EQU *-ODMVSYSL                                             00992000
.L0022   ANOP                                                           00993000
         AIF   ('&ODMVPRCL' EQ 'NO').L0026                              00994000
         AIF   ('&DSECT' EQ 'YES').L0027                                00995000
         AIF   ('&ODMVPRCL' NE 'YES').L0026                             00996000
.L0027   ANOP                                                           00997000
*                                                                       00998000
* ********************************************************************  00999000
* *  Mapping of Process Limit Data -                                    01000000
* *           Highwater, Maximum  and Current Usage                     01001000
* *                                                                     01002000
* * RESERVED field will not be filled with valid data]                  01003000
* ********************************************************************  01004000
*                                                                       01005000
*                                                                       01006000
         AIF   ('&DSECT' EQ 'YES').L0028                                01007000
ODMVPRCL DS    0F                                                       01008000
         AGO   .L0029                                                   01009000
.L0028   ANOP                                                           01010000
ODMVPRCL DSECT                                                          01011000
.L0029   ANOP                                                           01012000
ODMVPRCLFCHANGED DS BL4  Flag field for changed process limits          01013000
         ORG   ODMVPRCLFCHANGED                                         01014000
ODMVPRCLFBYTE1 DS B                                                     01015000
*  Bit definitions:                                                     01016000
ODMVPRCLFMAXASSIZE EQU X'80' RESERVED MaxAsSize changed                 01017000
ODMVPRCLFMAXCPU EQU X'40' RESERVED MaxCpu changed                       01018000
ODMVPRCLFMAXFILEPROC EQU X'20' MaxFileProc changed                      01019000
ODMVPRCLFMAXPROCUSER EQU X'10' MaxProcUser changed                      01020000
ODMVPRCLFMAXQUEUEDSIGS EQU X'08' MaxQueuedSigs changed                  01021000
ODMVPRCLFMAXTHREADS EQU X'04' MaxThreads changed                        01022000
ODMVPRCLFMAXTHREADTASKS EQU X'02' MaxThreadTasks changed                01023000
ODMVPRCLFIPCSHMNSEGS EQU X'01' IpcShmNSegs changed                      01024000
ODMVPRCLFBYTE2 DS B                                                     01025000
*  Bit definitions:                                                     01026000
ODMVPRCLFCORESIZSBIN EQU X'80' Soft Core value is bin                   01027000
ODMVPRCLFMAXFILESIZE EQU X'40' MaxFileSize changed                      01028000
ODMVPRCLFMAXMEMLIMIT EQU X'20' MaxMemLimit changed                      01029000
ODMVPRCLFMAXMLIMITSET EQU X'10' Set MaxMemLimit                         01030000
ODMVPRCLFMAXMEMLSBIN EQU X'08' Soft MLimit value is bin                 01031000
ODMVPRCLFMAXMEMLHBIN EQU X'04' Hard MLimit value is bin                 01032000
ODMVPRCLFMAXCORESIZE EQU X'02' MaxCoreSize changed                      01033000
ODMVPRCLFBYTE3 DS B                                                     01034000
*  Bit definitions:                                                     01035000
ODMVPRCLFCORESIZHBIN EQU X'80' Hard Core value is bin                   01036000
ODMVPRCLFBYTE4 DS B                                                     01037000
ODMVPRCLMAXASSIZEC DS F  RESERVED Current user region usage for        *01038000
                         address space                                  01039000
ODMVPRCLMAXASSIZEH DS F  RESERVED Highw. user region usage for address *01040000
                         space                                          01041000
ODMVPRCLMAXASSIZEM DS F  RESERVED Max. user region size for address    *01042000
                         space                                          01043000
ODMVPRCLMAXCPUC DS F     RESERVED Current CPU usage for address space   01044000
ODMVPRCLMAXCPUH DS F     RESERVED Highwater CPU usage for address      *01045000
                         space                                          01046000
ODMVPRCLMAXCPUM DS F     RESERVED Max. CPU usage for address space      01047000
ODMVPRCLMAXFILEPROCC DS F Current # of files in use for process         01048000
ODMVPRCLMAXFILEPROCH DS F Highwater # of files in use for process       01049000
ODMVPRCLMAXFILEPROCMSL DS F Soft Maximum # of files allowed for        *01050000
                         process                                        01051000
ODMVPRCLMAXFILEPROCMHL DS F Hard Maximum # of files allowed for        *01052000
                         process                                        01053000
ODMVPRCLMAXFILESIZEMSL DS F Soft Maximum size of files allowed for     *01054000
                         process                                        01055000
ODMVPRCLMAXFILESIZEMHL DS F Hard Maximum size of files allowed for     *01056000
                         process                                        01057000
ODMVPRCLMAXPROCUSERC DS F Current # of processes for user               01058000
ODMVPRCLMAXPROCUSERH DS F Highwater # of processes for user             01059000
ODMVPRCLMAXPROCUSERM DS F Maximum # of processes allowed for user       01060000
ODMVPRCLMAXQUEUEDSIGSC DS F Current # of queued signals for process     01061000
ODMVPRCLMAXQUEUEDSIGSH DS F Highwater # of queued sigs for process      01062000
ODMVPRCLMAXQUEUEDSIGSM DS F Maximum # of queued signals for process     01063000
ODMVPRCLMAXTHREADSC DS F Current # of threads for process               01064000
ODMVPRCLMAXTHREADSH DS F Highwater # of threads for process             01065000
ODMVPRCLMAXTHREADSM DS F Maximum # of threads for process               01066000
ODMVPRCLMAXTHREADTASKSC DS F Current # of thd tasks for process         01067000
ODMVPRCLMAXTHREADTASKSH DS F Highwater # of thd tasks for process       01068000
ODMVPRCLMAXTHREADTASKSM DS F Maximum # of thd tasks for process         01069000
ODMVPRCLIPCSHMNSEGSC DS F Current # of shr mem allowed segments in a   *01070000
                         process                                        01071000
ODMVPRCLIPCSHMNSEGSH DS F Highwater shr mem allowed segments in a      *01072000
                         process                                        01073000
ODMVPRCLIPCSHMNSEGSM DS F Maximum # of shr mem allowed segments in a   *01074000
                         process                                        01075000
ODMVPRCLMAXCORESIZEMSL DS F Max Size core dumps SOFT                    01076000
*                                                                       01077000
*      ***************************************************************  01078000
*      *                                                             *  01079000
*      * See OdmvPrcLFCoreSizSBin, off - fullword Binary value, on - *  01080000
*      * binary value with a multiplier                                 01081000
*      *                                                             *  01082000
*      ***************************************************************  01083000
*                                                                       01084000
*                                                                       01085000
ODMVPRCLMAXCORESIZEMHL DS F Max Size core dumps HARD                    01086000
*                                                                       01087000
*      ***************************************************************  01088000
*      *                                                             *  01089000
*      * See OdmvPrcLFCoreSizHBin, off - fullword Binary value, on - *  01090000
*      * binary value with a multiplier                                 01091000
*      *                                                             *  01092000
*      ***************************************************************  01093000
*                                                                       01094000
*                                                                       01095000
ODMVPRCLMAXMEMLIMITCDW DS CL8 Current process memlimit                  01096000
         ORG   ODMVPRCLMAXMEMLIMITCDW                                   01097000
ODMVPRCLMAXMEMLIMITCH DS F                                              01098000
ODMVPRCLMAXMEMLIMITCL DS F                                              01099000
ODMVPRCLMAXMEMLIMITHDW DS CL8 High process memlimit                     01100000
         ORG   ODMVPRCLMAXMEMLIMITHDW                                   01101000
ODMVPRCLMAXMEMLIMITHH DS F                                              01102000
ODMVPRCLMAXMEMLIMITHL DS F                                              01103000
ODMVPRCLMAXMEMLIMITMDWS DS F                                            01104000
*                                                                       01105000
*      ***************************************************************  01106000
*      *                                                             *  01107000
*      * asid memlimit soft See OdmvPrcLFMaxMemLSBin, off - fullword *  01108000
*      * Binary value, on - binary value with a multiplier              01109000
*      *                                                             *  01110000
*      ***************************************************************  01111000
*                                                                       01112000
*                                                                       01113000
         ORG   ODMVPRCLMAXMEMLIMITMDWS                                  01114000
ODMVPRCLMAXMEMLIMITMDWSBIN DS FL3 binary value                          01115000
ODMVPRCLMAXMEMLIMITMDWSM DS CL1 Multiplier                              01116000
ODMVPRCLMAXMEMLIMITMDWH DS F                                            01117000
*                                                                       01118000
*      ***************************************************************  01119000
*      *                                                             *  01120000
*      * asid memlimit hard See OdmvPrcLFMaxMemLSBin, off - fullword *  01121000
*      * Binary value, on - binary value with a multiplier              01122000
*      *                                                             *  01123000
*      ***************************************************************  01124000
*                                                                       01125000
*                                                                       01126000
         ORG   ODMVPRCLMAXMEMLIMITMDWH                                  01127000
ODMVPRCLMAXMEMLIMITMDWHBIN DS FL3 binary value                          01128000
ODMVPRCLMAXMEMLIMITMDWHM DS CL1 Multiplier                              01129000
ODMVMAXFILESIZEMHLBINM DS F                                             01130000
*                                                                       01131000
*      ***************************************************************  01132000
*      *                                                             *  01133000
*      * BinMult version of MaxFileSize hardlimit. Valid only if     *  01134000
*      * equal to OdmvPrcLMaxFileSizeMHL. This is how it was entered *  01135000
*      * via SETOMVS.                                                   01136000
*      *                                                             *  01137000
*      ***************************************************************  01138000
*                                                                       01139000
*                                                                       01140000
ODMVMAXFILESIZEMSLBINM DS F                                             01141000
*                                                                       01142000
*      ***************************************************************  01143000
*      *                                                             *  01144000
*      * BinMult version of MaxFileSize softlimit. Valid only if     *  01145000
*      * equal to OdmvPrcLMaxFileSizeMSL. This is how it was entered *  01146000
*      * via SETOMVS.                                                   01147000
*      *                                                             *  01148000
*      ***************************************************************  01149000
*                                                                       01150000
*                                                                       01151000
         DS    CL20      Reserved for future use                        01152000
ODMVPRCL_LEN EQU *-ODMVPRCL                                             01153000
.L0026   ANOP                                                           01154000
         AIF   ('&ODMVEXTOPTIONSDATA' EQ 'NO').L002A                    01155000
         AIF   ('&DSECT' EQ 'YES').L002B                                01156000
         AIF   ('&ODMVEXTOPTIONSDATA' NE 'YES').L002A                   01157000
.L002B   ANOP                                                           01158000
*                                                                       01159000
* ********************************************************************  01160000
* *  Mapping of Extended Options Data                           @DIA *  01161000
* ********************************************************************  01162000
*                                                                       01163000
*                                                                       01164000
         AIF   ('&DSECT' EQ 'YES').L002C                                01165000
ODMVEXTOPTIONSDATA DS 0F                                                01166000
         AGO   .L002D                                                   01167000
.L002C   ANOP                                                           01168000
ODMVEXTOPTIONSDATA DSECT                                                01169000
.L002D   ANOP                                                           01170000
ODMVRESPROCLEN DS F      Length of String                               01171000
ODMVRESPROCNAME DS CL8   Name of Resolver started procedure or         *01172000
                         NONE/RESOLVER                                  01173000
ODMVMAXFILESIZEBINM DS F MaxFileSize BinMult                            01174000
         ORG   ODMVMAXFILESIZEBINM                                      01175000
ODMVMAXFILESIZEBIN DS FL3 Bin part of BinMult                           01176000
ODMVMAXFILESIZEM DS CL1  Multiplier part of BinM                        01177000
ODMVMAXCORESIZEBINM DS F MaxCoreSize BinMult                            01178000
         ORG   ODMVMAXCORESIZEBINM                                      01179000
ODMVMAXCORESIZEB DS FL3  Bin part of BinMult                            01180000
ODMVMAXCORESIZEM DS CL1  Multiplier part of BinM                        01181000
ODMVMAXASSIZEBINM DS F   MaxASSize BinMult                              01182000
         ORG   ODMVMAXASSIZEBINM                                        01183000
ODMVMAXASSIZEBIN DS FL3  Bin part of BinMult                            01184000
ODMVMAXASSIZEM DS CL1    Multiplier part of BinM                        01185000
ODMVMAXMMAPAREABINM DS F MaxMMapArea BinMult                            01186000
         ORG   ODMVMAXMMAPAREABINM                                      01187000
ODMVMAXMMAPAREABIN DS FL3 Bin part of BinMult                           01188000
ODMVMAXMMAPAREAM DS CL1  Multiplier part of BinM                        01189000
ODMVMAXSHRPAGESBINM DS F MaxShrPages BinMult                            01190000
         ORG   ODMVMAXSHRPAGESBINM                                      01191000
ODMVMAXSHRPAGESBIN DS FL3 Bin part of BinMult                           01192000
ODMVMAXSHRPAGESM DS CL1  Multiplier part of BinM                        01193000
ODMVMAXSHMSPAGESBM DS F  MaxIPCSHMSPages BinMult                        01194000
         ORG   ODMVMAXSHMSPAGESBM                                       01195000
ODMVMAXSHMSPAGESBIN DS FL3 Bin part of BinMult                          01196000
ODMVMAXSHMSPAGESM DS CL1 Multiplier part of BinM                        01197000
ODMVMAXSHMMPAGESBM DS F  MaxIPCSHMMPages BinMult                        01198000
         ORG   ODMVMAXSHMMPAGESBM                                       01199000
ODMVMAXSHMMPAGESBIN DS FL3 Bin part of BinMult                          01200000
ODMVMAXSHMMPAGESM DS CL1 Multiplier part of BinM                        01201000
ODMVALTROOTFS DS CL44    ALTROOT FS Name                                01202000
ODMVUSERMNTSSYSLIMIT DS F USERMOUNTS - Sys Limit                        01203000
ODMVUSERMNTSUSRLIMIT DS F USERMOUNTS - Usr Limit                        01204000
ODMVNONEMPTYMNTPT DS X   NONEMPTYMOUNTPT                                01205000
         DS    CL3       Reserved                                       01206000
ODMVMAXPIPEUSER DS F     MAXPIPEUSER                                    01207000
ODMVSCEXITSTABLELEN DS X Length of table name                           01208000
ODMVSCEXITSTABLE DS CL255 Name of ScExits table                         01209000
ODMVEXTOPTIONSDATA_LEN EQU *-ODMVEXTOPTIONSDATA                         01210000
.L002A   ANOP                                                           01211000
         AIF   ('&ODMVIPV6' EQ 'NO').L002E                              01212000
         AIF   ('&DSECT' EQ 'YES').L002F                                01213000
         AIF   ('&ODMVIPV6' NE 'YES').L002E                             01214000
.L002F   ANOP                                                           01215000
*                                                                       01216000
* ********************************************************************  01217000
* *  Mapping of IPV6 Cinet Data                                 @T1A *  01218000
* ********************************************************************  01219000
*                                                                       01220000
*                                                                       01221000
         AIF   ('&DSECT' EQ 'YES').L0030                                01222000
ODMVIPV6 DS    0F        IPV6 Data                                      01223000
         AGO   .L0031                                                   01224000
.L0030   ANOP                                                           01225000
ODMVIPV6 DSECT           IPV6 Data                                      01226000
.L0031   ANOP                                                           01227000
ODMVCINETHOMECNT6 DS F   Number of CINET6 home.                         01228000
ODMVCINETHOSTCNT6 DS F   Number of CINET6 host.                         01229000
ODMVCINETNETWCNT6 DS F   Number of CINET6 net.                          01230000
ODMVCINET6PTR DS A       Ptr to the first OdmvCinet6 in OdmvOutPut     *01231000
                         area.                                          01232000
*                                                                       01233000
* ********************************************************************  01234000
* * Declare Constants for the PFS output data:                       *  01235000
* ********************************************************************  01236000
*                                                                       01237000
*                                                                       01238000
ODMVPFS#HFS_0TO3 EQU C'HFS ' This is the first 4-byte segment of an    *01239000
                         8-byte constant.                               01240000
ODMVPFS#HFS_4TO7 EQU C'    ' This is the second 4-byte segment of an   *01241000
                         8-byte constant.                               01242000
ODMVIPV6_LEN EQU *-ODMVIPV6                                             01243000
.L002E   ANOP                                                           01244000
         AIF   ('&ODMVCINET' EQ 'NO').L0032                             01245000
         AIF   ('&DSECT' EQ 'YES').L0033                                01246000
         AIF   ('&ODMVCINET' NE 'YES').L0032                            01247000
.L0033   ANOP                                                           01248000
*                                                                       01249000
* ********************************************************************  01250000
* *  Mapping of CINET data returned for OdmvCinetTp or OdmvCinetAll  *  01251000
* *  For IPV4 Addresses.                                             *  01252000
* ********************************************************************  01253000
*                                                                       01254000
*                                                                       01255000
         AIF   ('&DSECT' EQ 'YES').L0034                                01256000
ODMVCINET DS   0F                                                       01257000
         AGO   .L0035                                                   01258000
.L0034   ANOP                                                           01259000
ODMVCINET DSECT                                                         01260000
.L0035   ANOP                                                           01261000
ODMVCINETETPNAME DS CL8  Tp name                                        01262000
ODMVCINETHOME@ DS CL12   Home IP address in EBCDIC                      01263000
         ORG   ODMVCINETHOME@                                           01264000
         DS    CL8       Not Specified                                  01265000
ODMVCINETRTYPE DS CL4    Host and Net route Type                        01266000
ODMVCINETHOST@ DS CL12   Host IP address in EBCDIC                      01267000
ODMVCINETNETW@ DS CL12   Net IP address in EBCDIC                       01268000
ODMVCINETMASK DS CL12    Net Mask in EBCDIC                             01269000
ODMVCINETMETRIC DS F     Metric                                         01270000
ODMVCINETFLAGS DS CL3    Flags                                          01271000
ODMVRESERVED08 DS B      Reserved                                       01272000
*  Bit definitions:                                                     01273000
ODMVCINETHIFACTIVE EQU X'01' On=active Off=Inactive                     01274000
ODMVCINETHOMEIF@ DS F    Home Interface @ in Hex                        01275000
ODMVCINET_LEN EQU *-ODMVCINET                                           01276000
.L0032   ANOP                                                           01277000
         AIF   ('&ODMVCINET6' EQ 'NO').L0036                            01278000
         AIF   ('&DSECT' EQ 'YES').L0037                                01279000
         AIF   ('&ODMVCINET6' NE 'YES').L0036                           01280000
.L0037   ANOP                                                           01281000
*                                                                       01282000
* ********************************************************************  01283000
* *  Mapping of CINET data returned for OdmvCinetTp or OdmvCinetAll  *  01284000
* *  For IPV6 Addresses.                                             *  01285000
* ********************************************************************  01286000
*                                                                       01287000
*                                                                       01288000
         AIF   ('&DSECT' EQ 'YES').L0038                                01289000
ODMVCINET6 DS  0F                                                       01290000
         AGO   .L0039                                                   01291000
.L0038   ANOP                                                           01292000
ODMVCINET6 DSECT                                                        01293000
.L0039   ANOP                                                           01294000
ODMVCINET6ETPNAME DS CL8 Tp name                                        01295000
ODMVCINET6IPV6@ DS CL32  IPV6 Address in EBCDIC                         01296000
ODMVCINET6PLEN DS CL12   Net Prefix Length                              01297000
ODMVCINET6METRIC DS F    Metric                                         01298000
ODMVCINET6FLAGS DS CL3   Flags for display                              01299000
ODMVCINET6BITS DS B      Flags for testing                              01300000
*  Bit definitions:                                                     01301000
ODMVCINET6HOME EQU X'04' Home route                                     01302000
ODMVCINET6HOST EQU X'02' Host route                                     01303000
ODMVCINET6NET EQU X'01'  Net route                                      01304000
ODMVCINET6RTYPE DS CL4   Host and Net Route Type                        01305000
         DS    CL4       Must be as long as OdmvCinet                   01306000
ODMVCINET6_#LEN EQU 68                                                  01307000
ODMVCINET6_LEN EQU *-ODMVCINET6                                         01308000
.L0036   ANOP                                                           01309000
         AIF   ('&ODMVSERHDR' EQ 'NO').L003A                            01310000
         AIF   ('&DSECT' EQ 'YES').L003B                                01311000
         AIF   ('&ODMVSERHDR' NE 'YES').L003A                           01312000
.L003B   ANOP                                                           01313000
*                                                                       01314000
* ********************************************************************  01315000
* *  Mapping of Serialization Header Area                       @DRA *  01316000
* ********************************************************************  01317000
*                                                                       01318000
*                                                                       01319000
         AIF   ('&DSECT' EQ 'YES').L003C                                01320000
ODMVSERHDR DS  0F        Serialization Header                           01321000
         AGO   .L003D                                                   01322000
.L003C   ANOP                                                           01323000
ODMVSERHDR DSECT         Serialization Header                           01324000
.L003D   ANOP                                                           01325000
ODMVSERVERNUM DS F       Version Number Of SER Data                     01326000
ODMVSERRESCNT DS F       Number of resources                            01327000
ODMVSERRESPTR DS A       Ptr to the first OdmvSerObj structure. Each   *01328000
                         Subsequent odmvSerObj element follows         *01329000
                         sequentially in storage after the last        *01330000
                         OdmvSerReq entry for the prior OdmvSerObj     *01331000
                         element.                                       01332000
ODMVSERHDR_LEN EQU *-ODMVSERHDR                                         01333000
.L003A   ANOP                                                           01334000
         AIF   ('&ODMVSEROBJ' EQ 'NO').L003E                            01335000
         AIF   ('&DSECT' EQ 'YES').L003F                                01336000
         AIF   ('&ODMVSEROBJ' NE 'YES').L003E                           01337000
.L003F   ANOP                                                           01338000
*                                                                       01339000
* ********************************************************************  01340000
* *  Mapping of OdmvSerObj, one OdmvSerObj is returned for each      *  01341000
* *  serialization object reported on via ODMVSER                    *  01342000
* ********************************************************************  01343000
*                                                                       01344000
*                                                                       01345000
         AIF   ('&DSECT' EQ 'YES').L0040                                01346000
ODMVSEROBJ DS  0F                                                       01347000
         AGO   .L0041                                                   01348000
.L0040   ANOP                                                           01349000
ODMVSEROBJ DSECT                                                        01350000
.L0041   ANOP                                                           01351000
ODMVSERTYPE DS CL8       Resource Type                                  01352000
ODMVSERREQCNT DS F       Number of requestor entries                    01353000
ODMVSERLOCID DS F        Resource Location, for a Mutex or Condvar     *01354000
                         this will be a shared memory ID                01355000
ODMVSERADDR DS CL8       Resource Address, for a Mutex or Condvar this *01356000
                         will be a shared memory segment offset         01357000
         ORG   ODMVSERADDR                                              01358000
ODMVSERADDRHI DS A       High end of address                            01359000
ODMVSERADDRLO DS A       Low end of address                             01360000
ODMVSERLOCIDA DS F       Resource Location - For a Condvar this will   *01361000
                         be the associated mutex's shared memory ID     01362000
ODMVSERADDRA DS CL8      Resource Address - For a Condvar this will be *01363000
                         the associated mutex's shared memory segment  *01364000
                         offset                                         01365000
         ORG   ODMVSERADDRA                                             01366000
ODMVSERADDRHIA DS A      High end of address                            01367000
ODMVSERADDRLOA DS A      Low end of address                             01368000
ODMVSERREQPTR DS A       Ptr to the 1st OdmvSerReq area Subsequent     *01369000
                         OdmvSerReq areas following sequentially in    *01370000
                         storage.                                       01371000
ODMVSEROBJ_LEN EQU *-ODMVSEROBJ                                         01372000
.L003E   ANOP                                                           01373000
         AIF   ('&ODMVUMTBHDR' EQ 'NO').L0042                           01374000
         AIF   ('&DSECT' EQ 'YES').L0043                                01375000
         AIF   ('&ODMVUMTBHDR' NE 'YES').L0042                          01376000
.L0043   ANOP                                                           01377000
*                                                                       01378000
* ********************************************************************  01379000
* *  Mapping of nonprivileged user mount table.                      *  01380000
* ********************************************************************  01381000
*                                                                       01382000
*                                                                       01383000
         AIF   ('&DSECT' EQ 'YES').L0044                                01384000
ODMVUMTBHDR DS 0F        Header of nonprivileged user mounts table      01385000
         AGO   .L0045                                                   01386000
.L0044   ANOP                                                           01387000
ODMVUMTBHDR DSECT        Header of nonprivileged user mounts table      01388000
.L0045   ANOP                                                           01389000
ODMVUMTBELECNT DS F      +00 Number of elements in OdmvUmTbElemnt       01390000
ODMVUMTBARRAYPTR DS A    +04 Address of nonprivileged user mounts      *01391000
                         table                                          01392000
ODMVUMTBHDR_LEN EQU *-ODMVUMTBHDR                                       01393000
.L0042   ANOP                                                           01394000
         AIF   ('&ODMVUMTBELEMNT' EQ 'NO').L0046                        01395000
         AIF   ('&DSECT' EQ 'YES').L0047                                01396000
         AIF   ('&ODMVUMTBELEMNT' NE 'YES').L0046                       01397000
ODMVUMTBELEMNT DS 0F     Nonprivileged user mounts table. Element(0)   *01398000
                         is for the privileged user mnts                01399000
         AGO   .L0048                                                   01400000
.L0047   ANOP                                                           01401000
ODMVUMTBELEMNT DSECT     Nonprivileged user mounts table. Element(0)   *01402000
                         is for the privileged user mnts                01403000
.L0048   ANOP                                                           01404000
ODMVUMTBUID DS F         +00 UID who did mounts                         01405000
ODMVUMTBCOUNTS DS F      +04 number of file systems                     01406000
ODMVUMTBELEMNT_LEN EQU *-ODMVUMTBELEMNT                                 01407000
.L0046   ANOP                                                           01408000
         AIF   ('&ODMVPIPESUMHDR' EQ 'NO').L0049                        01409000
         AIF   ('&DSECT' EQ 'YES').L004A                                01410000
         AIF   ('&ODMVPIPESUMHDR' NE 'YES').L0049                       01411000
.L004A   ANOP                                                           01412000
*                                                                       01413000
* ********************************************************************  01414000
* *  Mapping of PIPE Summary Structures D OMVS,PIPES                 *  01415000
* ********************************************************************  01416000
*                                                                       01417000
*                                                                       01418000
         AIF   ('&DSECT' EQ 'YES').L004B                                01419000
ODMVPIPESUMHDR DS 0F     Header of PIPE usage summary information       01420000
         AGO   .L004C                                                   01421000
.L004B   ANOP                                                           01422000
ODMVPIPESUMHDR DSECT     Header of PIPE usage summary information       01423000
.L004C   ANOP                                                           01424000
ODMVPSHELECNT DS F       +00 Number of elements in OdmvPipeSumElemnt    01425000
ODMVPSHELETABPTR DS A    +04 Address of Pipe summary usage table        01426000
ODMVPSHFLAGS DS F        +08 Control information                        01427000
*  Bit definitions:                                                     01428000
ODMVPSHHWUSAGE EQU X'80' 1-indicates first element in the table is the *01429000
                         HIGHWATER USER info 0-indicates no HIGHWATER  *01430000
                         USER info in the table. (Most likely due to a *01431000
                         RESET                                          01432000
ODMVPSHMAXPIPEUSER DS F  +0C MAXPIPEUSER value                          01433000
ODMVPIPESUMHDR_LEN EQU *-ODMVPIPESUMHDR                                 01434000
.L0049   ANOP                                                           01435000
         AIF   ('&ODMVPIPESUMELEMNT' EQ 'NO').L004D                     01436000
         AIF   ('&DSECT' EQ 'YES').L004E                                01437000
         AIF   ('&ODMVPIPESUMELEMNT' NE 'YES').L004D                    01438000
ODMVPIPESUMELEMNT DS 0F  Pipe Summary Usage information. Element(1) is *01439000
                         the HIGHWATER USER info if OdmvPshHwUsage is  *01440000
                         set                                            01441000
         AGO   .L004F                                                   01442000
.L004E   ANOP                                                           01443000
ODMVPIPESUMELEMNT DSECT   Pipe Summary Usage information. Element(1)   *01444000
                         is the HIGHWATER USER info if OdmvPshHwUsage  *01445000
                         is set                                         01446000
.L004F   ANOP                                                           01447000
ODMVPSEUID DS  F         +00 Real UID of creator                        01448000
ODMVPSEACTCNT DS H       +04 Current pipe usage                         01449000
ODMVPSEHWCNT DS H        +06 Highwater usage                            01450000
ODMVPSEUSERID DS CL8     +08 USERID of pipe creator                     01451000
ODMVPIPESUMELEMNT_LEN EQU *-ODMVPIPESUMELEMNT                           01452000
.L004D   ANOP                                                           01453000
         AIF   ('&ODMVPIPEUIDHDR' EQ 'NO').L0050                        01454000
         AIF   ('&DSECT' EQ 'YES').L0051                                01455000
         AIF   ('&ODMVPIPEUIDHDR' NE 'YES').L0050                       01456000
ODMVPIPEUIDHDR DS 0F     Header of PIPE usage detailed UID (PIPES,U=)  *01457000
                         info                                           01458000
         AGO   .L0052                                                   01459000
.L0051   ANOP                                                           01460000
ODMVPIPEUIDHDR DSECT     Header of PIPE usage detailed UID (PIPES,U=)  *01461000
                         info                                           01462000
.L0052   ANOP                                                           01463000
ODMVPUTOTCNT DS F        +00 Total pipe usage for the specified UID     01464000
ODMVPUELECNT DS F        +04 Number of elements in OdmvPipeUidElemnt    01465000
ODMVPUELETABPTR DS A     +08 Address of Pipe UID usage table            01466000
ODMVPUFLAGS DS BL4       +0C Control flags                              01467000
*  Bit definitions:                                                     01468000
ODMVPUMORE EQU X'80'     PID entries excluded due to table size limit   01469000
         ORG   ODMVPIPEUIDHDR+16                                        01470000
ODMVPIPEUIDHDR_LEN EQU *-ODMVPIPEUIDHDR                                 01471000
.L0050   ANOP                                                           01472000
         AIF   ('&ODMVPIPEUIDELEMNT' EQ 'NO').L0053                     01473000
         AIF   ('&DSECT' EQ 'YES').L0054                                01474000
         AIF   ('&ODMVPIPEUIDELEMNT' NE 'YES').L0053                    01475000
ODMVPIPEUIDELEMNT DS 0F  Pipe UID Usage information.                    01476000
         AGO   .L0055                                                   01477000
.L0054   ANOP                                                           01478000
ODMVPIPEUIDELEMNT DSECT   Pipe UID Usage information.                   01479000
.L0055   ANOP                                                           01480000
ODMVPUPID DS   F         +00 Process ID                                 01481000
ODMVPUACTCNT DS F        +04 Current PID pipe usage                     01482000
ODMVPUSYSNAME DS CL8     +08 System NAME associated with this PID       01483000
ODMVPIPEUID#MAXENT EQU 10 Maximum number of OdmvPipeUidElemnt s         01484000
*                                                                       01485000
* ********************************************************************  01486000
* * Declare Constants for the OdmvSer Output data:                   *  01487000
* ********************************************************************  01488000
*                                                                       01489000
*                                                                       01490000
ODMVSER#MUTEX_0TO3 EQU C'MUTE' This is the first 4-byte segment of an  *01491000
                         8-byte constant.                               01492000
ODMVSER#MUTEX_4TO7 EQU C'X   ' This is the second 4-byte segment of an *01493000
                         8-byte constant.                               01494000
ODMVSER#CONDVAR_0TO3 EQU C'COND' This is the first 4-byte segment of   *01495000
                         an 8-byte constant.                            01496000
ODMVSER#CONDVAR_4TO7 EQU C'VAR ' This is the second 4-byte segment of  *01497000
                         an 8-byte constant.                            01498000
ODMVSERVER#01 EQU 1                                                     01499000
ODMVPIPEUIDELEMNT_LEN EQU *-ODMVPIPEUIDELEMNT                           01500000
.L0053   ANOP                                                           01501000
         AIF   ('&ODMVSERREQ' EQ 'NO').L0056                            01502000
         AIF   ('&DSECT' EQ 'YES').L0057                                01503000
         AIF   ('&ODMVSERREQ' NE 'YES').L0056                           01504000
.L0057   ANOP                                                           01505000
*                                                                       01506000
* ********************************************************************  01507000
* *  Mapping of OdmvSerReq returned for serialization resources fro  *  01508000
* *  OdmvSer.  This area describes a requestor (owner/waiter)        *  01509000
* *  of a serialization resource.                                    *  01510000
* ********************************************************************  01511000
*                                                                       01512000
*                                                                       01513000
         AIF   ('&DSECT' EQ 'YES').L0058                                01514000
ODMVSERREQ DS  0F                                                       01515000
         AGO   .L0059                                                   01516000
.L0058   ANOP                                                           01517000
ODMVSERREQ DSECT                                                        01518000
.L0059   ANOP                                                           01519000
ODMVSERFLAGS DS H        Requestor Flags                                01520000
*  Bit definitions:                                                     01521000
ODMVSEROWNER EQU X'80'   1=Owner of resource                            01522000
ODMVSERWAITER EQU X'40'  1=Waiter for resource                          01523000
ODMVSEREXC EQU X'20'     1=Exclusive request                            01524000
ODMVSERSHR EQU X'10'     1=Shared request                               01525000
ODMVSERASID DS H         Requestor Address Space ID                     01526000
ODMVSERJOBNAME DS CL8    Requestor Jobname                              01527000
ODMVSERPID DS  F         Requestor Process ID                           01528000
ODMVSERTCB DS  A         Requestor Tcb Address                          01529000
ODMVSERUSERDATA DS CL8   Requestor User Data                            01530000
         ORG   ODMVSERUSERDATA                                          01531000
ODMVSERUSERDATAHI DS A                                                  01532000
ODMVSERUSERDATALO DS A                                                  01533000
ODMVSERREQ_LEN EQU *-ODMVSERREQ                                         01534000
.L0056   ANOP                                                           01535000
         AIF   ('&ODMVDWHEADER' EQ 'NO').L005A                          01536000
         AIF   ('&DSECT' EQ 'YES').L005B                                01537000
         AIF   ('&ODMVDWHEADER' NE 'YES').L005A                         01538000
.L005B   ANOP                                                           01539000
*                                                                       01540000
*  --------------------------------------------------------------       01541000
*   HEADER mapping for D OMVS,WAITERS                                   01542000
*  --------------------------------------------------------------       01543000
*   Since BPXZODMV now needs a constant declared in BPXZFSSH,           01544000
*   the declares for OdmvDWheader and Element were enclosed in          01545000
*   the macro code so that other includers of BPXZODMV don't break.     01546000
*  --------------------------------------------------------------       01547000
*                                                                       01548000
*                                                                       01549000
         AIF   ('&DSECT' EQ 'YES').L005C                                01550000
ODMVDWHEADER DS 0F                                                      01551000
         AGO   .L005D                                                   01552000
.L005C   ANOP                                                           01553000
ODMVDWHEADER DSECT                                                      01554000
.L005D   ANOP                                                           01555000
ODMVDWHMLHCNT DS A       1 = There's a mount latch holder               01556000
ODMVDWHMLHPTR DS A       Address of Holder's Element                    01557000
ODMVDWHMLWCNT DS F       Number of mount latch waiters                  01558000
ODMVDWHMLWPTR DS A       Address of 1st Waiter's Element                01559000
ODMVDWHXSENTCNT DS F     Number of SENT xsys messages                   01560000
ODMVDWHXSENTPTR DS A     Address of 1st "SENT" Element                  01561000
ODMVDWHXRECVCNT DS F     Number of RECEIVED xsys msgs                   01562000
ODMVDWHXRECVPTR DS A     Address of 1st "RECV" Element                  01563000
ODMVDWHFLAGS DS BL2      Header Flags @E2C                              01564000
         ORG   ODMVDWHFLAGS                                             01565000
ODMVDWHFLAGS1 DS B       Flags Byte 1 @05A                              01566000
*  Bit definitions:                                                     01567000
ODMVDWHSYSPLEX EQU X'80' 1 = Member of a Sysplex                        01568000
ODMVDWHFLAGS2 DS B       Flags Byte 2                                   01569000
         ORG   ODMVDWHFLAGS2                                            01570000
ODMVDWHDRLEN DS X        Header Length not used @05C                    01571000
         ORG   ODMVDWHDRLEN                                             01572000
ODMVDWHVERSION DS X      Version of waiters area                        01573000
ODMVDWHELEN DS H         Element Length, for growth                     01574000
ODMVDWHVLCCNT DS F       Number of Vfs latches causing                  01575000
*                                                                       01576000
*      ***************************************************************  01577000
*      *                                                             *  01578000
*      * contention                                                     01579000
*      *                                                             *  01580000
*      ***************************************************************  01581000
*                                                                       01582000
*                                                                       01583000
ODMVDWHVLHPTR DS A       Address of 1st VFS holder                      01584000
ODMVDWHOWTCNT DS F       Number of other waiting threads                01585000
ODMVDWHOWTPTR DS A       Address of 1st other waiters                   01586000
ODMVDWHFLCCNT DS F       Number of file latches causing contention      01587000
ODMVDWHFLHPTR DS A       Address of 1st file latch holderEAA            01588000
ODMVDWHEAD_#LEN EQU 60                                                  01589000
ODMVDWHVERSION#ZERO EQU 0 Original waiters display                      01590000
ODMVDWHVERSION#ONE EQU 1 File system latch and Other                    01591000
*                                                                       01592000
*      ***************************************************************  01593000
*      *                                                             *  01594000
*      * Waiters table                                                  01595000
*      *                                                             *  01596000
*      ***************************************************************  01597000
*                                                                       01598000
*                                                                       01599000
ODMVDWHVERSION#TWO EQU 2 New OdmvDWeVLHLatNum var                       01600000
ODMVDWHVERSION#THREE EQU 3 File latch holders/waiters                   01601000
ODMVDWHEADER_LEN EQU *-ODMVDWHEADER                                     01602000
.L005A   ANOP                                                           01603000
         AIF   ('&ODMVDWELEMENT' EQ 'NO').L005E                         01604000
         AIF   ('&DSECT' EQ 'YES').L005F                                01605000
         AIF   ('&ODMVDWELEMENT' NE 'YES').L005E                        01606000
.L005F   ANOP                                                           01607000
*                                                                       01608000
*  --------------------------------------------------------------       01609000
*   HOLDER and WAITERS mapping for D OMVS,WAITERS                       01610000
*                                                                       01611000
*                                                                       01612000
*   For the file system latch holders table, ODMV data will be          01613000
*   structured to contain sets of holders and waiters. There will be    01614000
*   a set for each latch being held, that is causing contention.        01615000
*   Holders for a given latch will appear first followed by their       01616000
*   respective waiters.                                                 01617000
*                                                                       01618000
*   OdmvDWhVLHPTR will point to the first holder of the                 01619000
*   first holder/waiter pair. OdmvDWhVLCCnt will contain the amount     01620000
*   of holder/waiter pairs. OdmvDWhVLWCnt will be set for the last      01621000
*   holder of each holder/waiter pair, and will contain the amount      01622000
*   of waiters that are waiting for this latch.                         01623000
*                                                                       01624000
*   In the example below, OdmvDWhVLHPTR points to the first holder      01625000
*   and OdmvDWhVLCCnt has a value of 2 indicating that there are 2      01626000
*   holder/waiter pairs. The first pair contains 2 holders with the     01627000
*   second one having OdmvDWeVLWCnt set to 1 indicating that there      01628000
*   is one waiter. The second pair has 1 holder and OdmvDWeVLWCnt       01629000
*   set to 2 for its 2 waiters.                                         01630000
*                                                                       01631000
*     -------------------------                                         01632000
*    ! OdmvDWheader            !                                        01633000
*    !   OdmvDWhVLHPTR---------+--.                                     01634000
*    !   OdmvDWhVLHCnt = 2     !  !   <----Odmv waters header           01635000
*    !                         !  !                                     01636000
*    !-------------------------!<-'                                     01637000
*    ! OdmvDWelement Lat#1     !                                        01638000
*    !  OdmvDWeIsVfsHolder = 1 !      <----Holder for latch #1          01639000
*    !  OdmvDWeVLWCnt = 0      !                                        01640000
*    !-------------------------!                                        01641000
*    ! OdmvDWelement Lat#1     !                                        01642000
*    !  OdmvDWeIsVfsHolder = 1 !      <----Holder for latch #1          01643000
*    !  OdmvDWeVLWCnt = 1      !      <----Last holder waiters count    01644000
*    !-------------------------!                                        01645000
*    ! OdmvDWelement Lat#1     !                                        01646000
*    !  OdmvDWeIsVfsHolder = 0 !      <----Waiter for latch #1          01647000
*    !  OdmvDWeVLWCnt = N/A    !                                        01648000
*    !-------------------------!                                        01649000
*    ! OdmvDWelement Lat#2     !                                        01650000
*    !  OdmvDWeIsVfsHolder = 1 !      <----Holder for latch #2          01651000
*    !  OdmvDWeVLWCnt = 2      !      <----Last holder waiters count    01652000
*    !-------------------------!                                        01653000
*    ! OdmvDWelement Lat#2     !                                        01654000
*    !  OdmvDWeIsVfsHolder = 0 !      <----Waiter for latch #2          01655000
*    !  OdmvDWeVLWCnt = N/A    !                                        01656000
*    !-------------------------!                                        01657000
*    ! OdmvDWelement Lat#2     !                                        01658000
*    !  OdmvDWeIsVfsHolder = 0 !      <----Waiter for latch #2          01659000
*    !  OdmvDWeVLWCnt = N/A    !                                        01660000
*     -------------------------                                         01661000
*                                                                       01662000
*  --------------------------------------------------------------       01663000
*                                                                       01664000
*                                                                       01665000
         AIF   ('&DSECT' EQ 'YES').L0060                                01666000
ODMVDWELEMENT DS 0F      Mount Latch / Xsys Elem                        01667000
         AGO   .L0061                                                   01668000
.L0060   ANOP                                                           01669000
ODMVDWELEMENT DSECT      Mount Latch / Xsys Elem                        01670000
.L0061   ANOP                                                           01671000
*                                                                       01672000
*  ------------------------------------------------------------------   01673000
*   HOLDER IS DOING:                                                    01674000
*  ------------------------------------------------------------------   01675000
*                                                                       01676000
*                                                                       01677000
ODMVDWEPFSNAME DS CL8    Pfs Name / Glue Exit Name                      01678000
ODMVDWEOP DS   CL12      Vfs or Vnod Operation                          01679000
ODMVDWESTATE DS CL16     State of operation                             01680000
*                                                                       01681000
* ********************************************************************  01682000
* * OdmvDWeLatNum renamed to OdmvDWeLatWaitNum to clarify its use.   *  01683000
* * OdmvDWeLatWaitNum should be used to obtain the latch number when *  01684000
* * OdmvDWeState indicates that the thread is in a latch wait.       *  01685000
* *                                                                  *  01686000
* * Use OdmvDWeVLHLatNum for the latch number of a file system latch *  01687000
* * holder causing contention.                                       *  01688000
* ***************************************************************       01689000
*                                                                       01690000
*                                                                       01691000
ODMVDWELATNUM DS F       Latch Number                                   01692000
         ORG   ODMVDWELATNUM                                            01693000
ODMVDWELATWAITNUM DS F   New name                                       01694000
ODMVDWESYSNAME DS CL9    BROADCAST or Xsys Member Name                  01695000
         ORG   ODMVDWESYSNAME                                           01696000
ODMVDWESYSNAME8 DS CL8   8 char member name                             01697000
ODMVDWESYSNAME1 DS CL1   T when BROADCAST or blank                      01698000
*                                                                       01699000
*  ------------------------------------------------------------------   01700000
*   common section for the latch holder, waiters and XSYS Message.      01701000
*  ------------------------------------------------------------------   01702000
*                                                                       01703000
*                                                                       01704000
ODMVDWEFLAGS DS B        Flags                                          01705000
*  Bit definitions:                                                     01706000
ODMVDWEFLAGFS EQU X'80'  1 = OdmvDweFileSys has name                    01707000
ODMVDWEFLAG99 EQU X'40'  1 = OdmvDweHrs > 99                            01708000
ODMVDWELATCH EQU X'20'   1 = Holder has latch number                    01709000
ODMVDWEISDOING EQU X'10' 1 = display ID DOING data                      01710000
ODMVDWELATACC EQU X'08'  1 = Latch held EXCL for HOLDING line           01711000
ODMVDWEVFSACC EQU X'04'  1 = Latch held EXCL for File system latch     *01712000
                         table                                          01713000
ODMVDWEISVFSHOLDER EQU X'02' 1 = Vfs table holder                       01714000
ODMVDWEVNODFILEOP EQU X'01' 1 = display FILE data                       01715000
ODMVDWEASID DS H         Asid of holder,waiter,XSYS                     01716000
ODMVDWEUSERID DS CL8     Userid of holder,waiter,XSYS                   01717000
ODMVDWESYSMEM DS CL8     Sysplex Member name                            01718000
ODMVDWETCB DS  F         Tcb of holder,waiter,XSYS                      01719000
ODMVDWEREASON DS CL20    Reason for holding,waiting                     01720000
ODMVDWEAGE DS  F         Age holding,waiting,XSYS                       01721000
         ORG   ODMVDWEAGE                                               01722000
ODMVDWEHRS DS  X         Hours                                          01723000
ODMVDWEMINS DS X         Minutes                                        01724000
ODMVDWESECS DS X         Seconds                                        01725000
         DS    X         Reserved                                       01726000
ODMVDWEFILESYS DS CL44   File System of holder,waiter                   01727000
*                                                                       01728000
*  ------------------------------------------------------------------   01729000
*   Unique declares for XSYS Messages.                                  01730000
*  ------------------------------------------------------------------   01731000
*                                                                       01732000
*                                                                       01733000
ODMVDWEUNION DS CL284                                                   01734000
         ORG   ODMVDWEUNION                                             01735000
ODMVDWEXSYS DS CL284                                                    01736000
         ORG   ODMVDWEXSYS                                              01737000
ODMVDWEMSGTYPE DS CL12   Message Type                                   01738000
ODMVDWEFCODE DS H        Function Code                                  01739000
ODMVDWEREQUEST DS CL1    * = ASYNC, blank = SYNC                        01740000
         DS    CL1       Reserved (padding)                             01741000
ODMVDWEONTCB DS F        On TCB for RECV Xsys MSG                       01742000
ODMVDWEREQID DS CL4      Request Id                                     01743000
         ORG   ODMVDWEREQID                                             01744000
ODMVDWESYSNUM DS X       System Number                                  01745000
ODMVDWESEQNO DS FL3      Sequence Number                                01746000
ODMVDWEMEMCNT DS F       Number of OdmvDWeMemName                       01747000
ODMVDWEMEMNAME DS CL8    broadcast members @E2C                         01748000
*                                                                       01749000
*  ------------------------------------------------------------------   01750000
*   File latch activity table                                           01751000
*  ------------------------------------------------------------------   01752000
*                                                                       01753000
*                                                                       01754000
         ORG   ODMVDWEUNION                                             01755000
ODMVDWEFILELAT DS CL75                                                  01756000
         ORG   ODMVDWEFILELAT                                           01757000
ODMVDWEFILELATFILENAME DS CL64 Files name 64 characters                 01758000
ODMVDWEFILELATDEVNO DS F Files device number                            01759000
ODMVDWEFILELATINO DS F   Files Inode number                             01760000
ODMVDWEFILELATLSET DS CL2 Files latch set ID                            01761000
ODMVDWEFILELATFILETYPE DS X Files type                                  01762000
*                                                                       01763000
*  ------------------------------------------------------------------   01764000
*   File system latch activity table                                    01765000
*  ------------------------------------------------------------------   01766000
*                                                                       01767000
*                                                                       01768000
         ORG   ODMVDWEUNION+284                                         01769000
ODMVDWEVLWCNT DS F       Number of Vfs latch waiters                    01770000
*                                                                       01771000
*      ***************************************************************  01772000
*      *                                                             *  01773000
*      * Only valid on last holder                                      01774000
*      * for each latch                                                 01775000
*      *                                                             *  01776000
*      ***************************************************************  01777000
*                                                                       01778000
* *------------------------------------------------------------------*  01779000
* * HOLDING:                                                            01780000
* *------------------------------------------------------------------*  01781000
*                                                                       01782000
*                                                                       01783000
ODMVDWEHELDLATNUM DS F                                                  01784000
*                                                                       01785000
*  ------------------------------------------------------------------   01786000
*   FILE:                                                               01787000
*  ------------------------------------------------------------------   01788000
*                                                                       01789000
*                                                                       01790000
ODMVDWEFILENAME DS CL16  Files name                                     01791000
ODMVDWEDEVNO DS F        Files device number                            01792000
ODMVDWEINO DS  F         Files Inode number                             01793000
*                                                                       01794000
*  ------------------------------------------------------------------   01795000
*   OTHER WAITING THREADS:                                              01796000
*  ------------------------------------------------------------------   01797000
*                                                                       01798000
*                                                                       01799000
ODMVDWEPID DS  F         Pid of waiter                                  01800000
ODMVDWEFLAGS2 DS B       Flags2                                         01801000
*  Bit definitions:                                                     01802000
ODMVDWEHSM EQU X'80'     1 = Doing an HSM recall                        01803000
         DS    CL3       Reserved                                       01804000
*                                                                       01805000
* ********************************************************************  01806000
* * OdmvDWeVLHLatNum contains the latch number for a file system     *  01807000
* * latch holder causing contention.  This is the value that shows   *  01808000
* * up under the FILE SYSTEM LATCH ACTIVITY table.  It is only set   *  01809000
* * for the holder. This field is used for the file system and file  *  01810000
* * latch activty tables.                                            *  01811000
* ***************************************************************       01812000
*                                                                       01813000
*                                                                       01814000
ODMVDWEVLHLATNUM DS F    VFS/Vnod holder latch num                      01815000
ODMVTIMESTAMP DS CL20    Timestamp of start activity                    01816000
         ORG   ODMVTIMESTAMP                                            01817000
ODMVDATE DS    CL10      Date                                           01818000
ODMVBLANK DS   CL1       blank space                                    01819000
ODMVTIME DS    CL8       Time                                           01820000
         DS    CL1       blank space                                    01821000
ODMVDWEXCFSEQUENCE DS F  XCF sequence                                   01822000
ODMVDWELEM_#LEN EQU 492                                                 01823000
ODMVDWELEMENT_LEN EQU *-ODMVDWELEMENT                                   01824000
.L005E   ANOP                                                           01825000
         AIF   ('&ODMVSOCKET' EQ 'NO').L0062                            01826000
         AIF   ('&DSECT' EQ 'YES').L0063                                01827000
         AIF   ('&ODMVSOCKET' NE 'YES').L0062                           01828000
.L0063   ANOP                                                           01829000
*                                                                       01830000
* ********************************************************************  01831000
* * Mapping OdmvSocket, one is returned for each open socket    @DVA *  01832000
* ********************************************************************  01833000
*                                                                       01834000
*                                                                       01835000
         AIF   ('&DSECT' EQ 'YES').L0064                                01836000
ODMVSOCKET DS  0F                                                       01837000
         AGO   .L0065                                                   01838000
.L0064   ANOP                                                           01839000
ODMVSOCKET DSECT                                                        01840000
.L0065   ANOP                                                           01841000
ODMVSOCKETJOBNAME DS CL8 Job name of socket owner                       01842000
ODMVINODENUM DS F        Socket inode number                            01843000
ODMVPINODENUM DS F       Socket peer inode number                       01844000
ODMVSTATE DS   F         Current socket state                           01845000
ODMVBYTESREAD DS F       Bytes read on socket                           01846000
ODMVBYTESWRITTEN DS F    Bytes written on socket                        01847000
ODMVSOCKETNAMEFLG DS CL1 Non 0 indicates socket has a name              01848000
ODMVSOCKETNAME DS CL57   Sockets name                                   01849000
ODMVPEERNAMEFLG DS CL1   Non 0 indicates peer has a name                01850000
ODMVPEERNAME DS CL57     Sockets peer name                              01851000
*                                                                       01852000
* ********************************************************************  01853000
* * Decalre constant for OdmvSockets                            @DVA *  01854000
* ********************************************************************  01855000
* *  ***********************************************                 *  01856000
* *  Constants for OdmvState                    @DVA                 *  01857000
* *  ***********************************************                 *  01858000
*                                                                       01859000
*                                                                       01860000
ODMV#STRM EQU  1         Unconnected stream socket                      01861000
ODMV#DGRAM EQU 2         Datagram socket                                01862000
ODMV#LISTEN EQU 3        Stream socket that accepts conections          01863000
ODMV#ACP EQU   4         Accepted stream socket                         01864000
ODMV#CONN EQU  5         Connected stream socket                        01865000
ODMVSOCKET_LEN EQU *-ODMVSOCKET                                         01866000
.L0062   ANOP                                                           01867000
         AIF   ('&ODMVDYNSERV' EQ 'NO').L0066                           01868000
         AIF   ('&DSECT' EQ 'YES').L0067                                01869000
         AIF   ('&ODMVDYNSERV' NE 'YES').L0066                          01870000
.L0067   ANOP                                                           01871000
*                                                                       01872000
* ********************************************************************  01873000
* * Structures for Dynamic Service Activation Query Service             01874000
* ********************************************************************  01875000
* * Dynamic service activation header                                   01876000
*                                                                       01877000
*                                                                       01878000
         AIF   ('&DSECT' EQ 'YES').L0068                                01879000
ODMVDYNSERV DS 0F        Dynamic Service Header                         01880000
         AGO   .L0069                                                   01881000
.L0068   ANOP                                                           01882000
ODMVDYNSERV DSECT        Dynamic Service Header                         01883000
.L0069   ANOP                                                           01884000
ODMVDYNSERVVERNUM DS F   Version Number Of OdmvDynServ Structure        01885000
ODMVDYNSERVACTCNT DS F   Number of dynamic service activations          01886000
ODMVDYNSERVCSASTG DS F   Amount of CSA storage used for all            *01887000
                         activations                                    01888000
ODMVDYNSERVPVTSTG DS F   Amount of OMVS PVT storage used for all       *01889000
                         activations                                    01890000
ODMVDYNSERVACTPTR DS A   Ptr to the first DynAct structure.             01891000
ODMVDYNSERV_LEN EQU *-ODMVDYNSERV                                       01892000
.L0066   ANOP                                                           01893000
         AIF   ('&ODMVDYNACT' EQ 'NO').L006A                            01894000
         AIF   ('&DSECT' EQ 'YES').L006B                                01895000
         AIF   ('&ODMVDYNACT' NE 'YES').L006A                           01896000
.L006B   ANOP                                                           01897000
*                                                                       01898000
* ********************************************************************  01899000
* *  Mapping of OdmvDynAct, one is returned for each dynamic service *  01900000
* *  activation.  The most recent activation is returned first       *  01901000
* *  followed by the next most recent one and so on...               *  01902000
* ********************************************************************  01903000
*                                                                       01904000
*                                                                       01905000
         AIF   ('&DSECT' EQ 'YES').L006C                                01906000
ODMVDYNACT DS  0F                                                       01907000
         AGO   .L006D                                                   01908000
.L006C   ANOP                                                           01909000
ODMVDYNACT DSECT                                                        01910000
.L006D   ANOP                                                           01911000
ODMVDYNACTLINKLIB DS CL44 LinkLib library name                          01912000
ODMVDYNACTLINKLIBVOL DS CL6 LinkLib volume                              01913000
ODMVDYNACTLPALIB DS CL44 Lpalib library name                            01914000
ODMVDYNACTLPAVOL DS CL6  Lpalib volume                                  01915000
ODMVDYNACTITEMCNT DS F   Number of Service Items in the activation     *01916000
                         instance                                       01917000
ODMVDYNACTNEXTPTR DS A   Address of Next OdmvDynAct                     01918000
ODMVDYNACTITEMPTR DS A   Address of 1st OdmvDynActItem                  01919000
ODMVDYNACT_LEN EQU *-ODMVDYNACT                                         01920000
.L006A   ANOP                                                           01921000
         AIF   ('&ODMVDYNACTITEM' EQ 'NO').L006E                        01922000
         AIF   ('&DSECT' EQ 'YES').L006F                                01923000
         AIF   ('&ODMVDYNACTITEM' NE 'YES').L006E                       01924000
.L006F   ANOP                                                           01925000
*                                                                       01926000
* ********************************************************************  01927000
* *  Mapping of OdmvDynActItem, one is returned for each service item*  01928000
* *  up to OdmvDynActItemCnt.  The 2-n OdmvDynActItem elements       *  01929000
* *  immediately follow the first OdmvDynActItem in the returned     *  01930000
* *  output area.                                                    *  01931000
* ********************************************************************  01932000
*                                                                       01933000
*                                                                       01934000
         AIF   ('&DSECT' EQ 'YES').L0070                                01935000
ODMVDYNACTITEM DS 0X     Service items in dynamic activation            01936000
         AGO   .L0071                                                   01937000
.L0070   ANOP                                                           01938000
ODMVDYNACTITEM DSECT     Service items in dynamic activation            01939000
.L0071   ANOP                                                           01940000
ODMVDYNACTITEMNAME DS CL7 Service Item Name                             01941000
         DS    CL1                                                      01942000
ODMVDYNACTITEM_LEN EQU *-ODMVDYNACTITEM                                 01943000
.L006E   ANOP                                                           01944000
         AIF   ('&ODMVMFHEADER' EQ 'NO').L0072                          01945000
         AIF   ('&DSECT' EQ 'YES').L0073                                01946000
         AIF   ('&ODMVMFHEADER' NE 'YES').L0072                         01947000
.L0073   ANOP                                                           01948000
*                                                                       01949000
*  --------------------------------------------------------------       01950000
*   Mapping for Mount Failure Header (D OMVS,MF or D OMVS,MF=ALL)       01951000
*  ------------------------------------------------------------------   01952000
*   The structure will be based off OdmvOutPutPtr.                      01953000
*  ------------------------------------------------------------------   01954000
*                                                                       01955000
*                                                                       01956000
         AIF   ('&DSECT' EQ 'YES').L0074                                01957000
ODMVMFHEADER DS 0F       Mount Failure Header                           01958000
         AGO   .L0075                                                   01959000
.L0074   ANOP                                                           01960000
ODMVMFHEADER DSECT       Mount Failure Header                           01961000
.L0075   ANOP                                                           01962000
ODMVMFHCOUNT DS F        Count of Mount Failures                        01963000
ODMVMFHENTRYPTR DS A     Ptr to 1st OdmvMFEntry                         01964000
ODMVMFHPTIME DS CL18     Purge date & time in EBCDIC                    01965000
         ORG   ODMVMFHPTIME                                             01966000
ODMVMFHDATE DS CL10      yyyy/mm/dd                                     01967000
         ORG   ODMVMFHDATE                                              01968000
ODMVMFHYEAR DS CL4                                                      01969000
ODMVMFHSLASH1 DS CL1                                                    01970000
ODMVMFHMONTH DS CL2                                                     01971000
ODMVMFHSLASH2 DS CL1                                                    01972000
ODMVMFHDAY DS  CL2                                                      01973000
ODMVMFHTIME DS CL8       hh:mm:ss                                       01974000
         ORG   ODMVMFHTIME                                              01975000
ODMVMFHHH DS   CL2                                                      01976000
ODMVMFHDOT1 DS CL1                                                      01977000
ODMVMFHMM DS   CL2                                                      01978000
ODMVMFHDOT2 DS CL1                                                      01979000
ODMVMFHSS DS   CL2                                                      01980000
         DS    CL2       Alignment                                      01981000
ODMVMFHEND DS  0C                                                       01982000
ODMVMFHDR#LEN EQU 28                                                    01983000
ODMVMFHEADER_LEN EQU *-ODMVMFHEADER                                     01984000
.L0072   ANOP                                                           01985000
         AIF   ('&ODMVMFENTRY' EQ 'NO').L0076                           01986000
         AIF   ('&DSECT' EQ 'YES').L0077                                01987000
         AIF   ('&ODMVMFENTRY' NE 'YES').L0076                          01988000
.L0077   ANOP                                                           01989000
*                                                                       01990000
*  --------------------------------------------------------------       01991000
*                                                                       01992000
*   Mapping for Mount Failure Entry (D OMVS,MF or D OMVS,MF=ALL)        01993000
*                                                                       01994000
*  ------------------------------------------------------------------   01995000
*                                                                       01996000
*                                                                       01997000
         AIF   ('&DSECT' EQ 'YES').L0078                                01998000
ODMVMFENTRY DS 0F        Mount Failure Entry                            01999000
         AGO   .L0079                                                   02000000
.L0078   ANOP                                                           02001000
ODMVMFENTRY DSECT        Mount Failure Entry                            02002000
.L0079   ANOP                                                           02003000
ODMVMFNEXT DS  A         +00 Next OdmvMF on the chain                   02004000
*                                                                       02005000
*   -----------------------------------------------------------------   02006000
*    Any changes to OdmvMFDspInfo should also be made to                02007000
*    MfdbDspInfo.                                                       02008000
*   -----------------------------------------------------------------   02009000
*                                                                       02010000
*                                                                       02011000
ODMVMFDSPINFO DS CL236   Displayable Information:                       02012000
         ORG   ODMVMFDSPINFO                                            02013000
ODMVMFMNTCODE DS F       +04 Mount Entry Code                           02014000
ODMVMFRETCODE DS F       +08 Failing Return Code                        02015000
ODMVMFRSNCODE DS F       +0C Failing Reason Code                        02016000
ODMVMFPATHNAMELEN DS F   +10 Path Name Length                           02017000
ODMVMFPARMDATALEN DS F   +14 Parameter Length                           02018000
ODMVMFTODEBC DS CL18     +18 OdmvMFTOD in EBCDIC                        02019000
         ORG   ODMVMFTODEBC                                             02020000
ODMVMFDATE DS  CL10      +18 yyyy/mm/dd                                 02021000
         ORG   ODMVMFDATE                                               02022000
ODMVMFYEAR DS  CL4                                                      02023000
ODMVMFSLASH1 DS CL1                                                     02024000
ODMVMFMONTH DS CL2                                                      02025000
ODMVMFSLASH2 DS CL1                                                     02026000
ODMVMFDAY DS   CL2                                                      02027000
ODMVMFTIME DS  CL8       +22 hh:mm:ss                                   02028000
         ORG   ODMVMFTIME                                               02029000
ODMVMFHH DS    CL2                                                      02030000
ODMVMFDOT1 DS  CL1                                                      02031000
ODMVMFMM DS    CL2                                                      02032000
ODMVMFDOT2 DS  CL1                                                      02033000
ODMVMFSS DS    CL2                                                      02034000
ODMVMFFLAGS DS BL2       +2A Flags                                      02035000
*  Bit definitions:                                                     02036000
ODMVMFMOVEFAILURE EQU X'80' Move operation failed                       02037000
ODMVMFFSTYPE DS CL8      +2C File System Type                           02038000
ODMVMFDDNAME DS CL8      +34 DD Name (or zeros)                         02039000
ODMVMFSYSNAME DS CL8     +3C System Name (or zeros)                     02040000
ODMVMFPARMMEM DS CL8     +44 Parmlib member (or zeros)                  02041000
ODMVMFFSNAME DS CL44     +4C File System Name                           02042000
ODMVMFPATHNAME DS CL60   +78 Path Name Buffer                           02043000
ODMVMFPARMDATA DS CL60   +B4 Parameter Buffer                           02044000
ODMVMFEND DS   0C        +F0                                            02045000
ODMVMFENTRY#LEN EQU 240                                                 02046000
*                                                                       02047000
* ********************************************************************  02048000
* *VersionNumber values are defined here                        @DEA *  02049000
* ********************************************************************  02050000
*                                                                       02051000
*                                                                       02052000
ODMVVER#ONE EQU 16       Version 1.0 Constant                           02053000
ODMVVER#ONEONE EQU 17    Version 1.1 Constant                           02054000
ODMVVER#ONETWO EQU 18    Version 1.2 Constant                           02055000
*                                                                       02056000
* ********************************************************************  02057000
* * Return Code values are defined here                         @DEA *  02058000
* ********************************************************************  02059000
*                                                                       02060000
*                                                                       02061000
ODMVSUCCESS EQU 0        Execution successful                           02062000
ODMVNOTFOUND EQU 4       ASID or UID not found                          02063000
ODMVFSGMNERROR EQU 8     Error calling FSGMN                            02064000
ODMVBUFFER EQU 12        Buffer to small                                02065000
ODMVFLAGS EQU  16        Input flags invalid                            02066000
ODMVAUTH EQU   20        Wrong authority                                02067000
ODMVINVPTR EQU 24        Ptr. to ODMVOUT zero                           02068000
ODMVOMVSINACT EQU 28     OMVS Inactive                                  02069000
ODMV#MFDBLATCH EQU 29    Mfdb latch failure                             02070000
ODMV#ISGLSLSPERR EQU 32  ISGLSLSP failed                                02071000
*                                                                       02072000
* ********************************************************************  02073000
* * OdmvPrcLimits/OdmvSystemLimits constant defined here                02074000
* ********************************************************************  02075000
*                                                                       02076000
*                                                                       02077000
ODMV#UNLIMITED EQU X'FFFFFFFF'                                          02078000
*                                                                       02079000
* ********************************************************************  02080000
* * OdmvStatus/OdmvThdStatus constants are defined here                 02081000
* ********************************************************************  02082000
*                                                                       02083000
*    *****************************************************************  02084000
*    *                                                               *  02085000
*    * Constants for OdmvStatus3                                     *  02086000
*    *                                                               *  02087000
*    *****************************************************************  02088000
*                                                                       02089000
*                                                                       02090000
ODMVZOMBIE EQU C'Z'      Process terminated and parent has not         *02091000
                         complete wait                                  02092000
ODMVZOMBIE2 EQU C'L'     Process terminated and still session or       *02093000
                         process group leader                           02094000
ODMVQUIESCET EQU C'Q'    Quiese termination wait                        02095000
*                                                                       02096000
*    *****************************************************************  02097000
*    *                                                               *  02098000
*    * Constants for OdmvStatus3 and OdmvThdStatus2                  *  02099000
*    *                                                               *  02100000
*    *****************************************************************  02101000
*                                                                       02102000
*                                                                       02103000
ODMVMSGRCV EQU C'A'      IPC msgrcv wait                                02104000
ODMVMSGSND EQU C'B'      IPC msgsnd wait                                02105000
ODMVWAITC EQU  C'C'      Comm KernelWait                                02106000
*                                                                       02107000
*    When a PID value is present in the message, D means Semop          02108000
*    When there is no PID yet, D means waiting to be dubbed             02109000
*                                                                       02110000
*                                                                       02111000
ODMVSEMOP EQU  C'D'      IPC semop wait                                 02112000
ODMVDUBWAIT EQU C'D'     Waiting for DUB                                02113000
ODMVWAITF EQU  C'F'      File System Kernel Wait                        02114000
ODMVMVSPAUSE EQU C'G'    MVSPause                                       02115000
ODMVRUN  EQU   C'R'      Not kernel wait                                02116000
ODMVSLEEP EQU  C'S'      sleep() issued                                 02117000
ODMVBRL  EQU   C'T'      Byte Range Lock WaiT                           02118000
ODMVFORK EQU   C'X'      fork new process                               02119000
ODMVCHILD EQU  C'W'      Waiting for child                              02120000
*                                                                       02121000
*    *****************************************************************  02122000
*    *                                                               *  02123000
*    * Constants for OdmvStatus3 and OdmvThdStatus5                  *  02124000
*    *                                                               *  02125000
*    *****************************************************************  02126000
*                                                                       02127000
*                                                                       02128000
ODMVFREEZE EQU C'E'      Quiesce Freeze                                 02129000
*                                                                       02130000
*    *****************************************************************  02131000
*    *                                                               *  02132000
*    * Constants for OdmvThdStatus1                                  *  02133000
*    *                                                               *  02134000
*    *****************************************************************  02135000
*                                                                       02136000
*                                                                       02137000
ODMVPTHDCREATED EQU C'J' Pthread created                                02138000
*                                                                       02139000
*    *****************************************************************  02140000
*    *                                                               *  02141000
*    * Constants for OdmvThdStatus2                                  *  02142000
*    *                                                               *  02143000
*    *****************************************************************  02144000
*                                                                       02145000
*                                                                       02146000
ODMVMVSWAIT EQU C'Y'     MVS wait                                       02147000
*                                                                       02148000
*    *****************************************************************  02149000
*    *                                                               *  02150000
*    * Constants for OdmvThdStatus3                                  *  02151000
*    *                                                               *  02152000
*    *****************************************************************  02153000
*                                                                       02154000
*                                                                       02155000
ODMVMEDIUMWGHT EQU C'N'  Medium weight thread                           02156000
ODMVASYNCH EQU C'O'      Asynchronous thread                            02157000
ODMVIPT  EQU   C'U'      Initial process thread                         02158000
*                                                                       02159000
*    *****************************************************************  02160000
*    *                                                               *  02161000
*    * Constants for OdmvThdStatus4                                  *  02162000
*    *                                                               *  02163000
*    *****************************************************************  02164000
*                                                                       02165000
*                                                                       02166000
ODMVDETACHED EQU C'V'    Thread is detached                             02167000
*                                                                       02168000
*    *****************************************************************  02169000
*    *                                                               *  02170000
*    * Constants for OdmvThdStatus5                                  *  02171000
*    *                                                               *  02172000
*    *****************************************************************  02173000
*                                                                       02174000
*                                                                       02175000
ODMVPTRACE EQU C'P'      Ptrace kernel wait                             02176000
*                                                                       02177000
*    *****************************************************************  02178000
*    *                                                               *  02179000
*    * Constants for OdmvThdStatus6                                  *  02180000
*    *                                                               *  02181000
*    *****************************************************************  02182000
*                                                                       02183000
*                                                                       02184000
ODMVBLOCKED EQU C'B'     registered blocker                             02185000
ODMVPERM EQU   C'P'      registered perm process                        02186000
ODMVCRESPAWN EQU C'R'    respawnable process                            02187000
*                                                                       02188000
*    *****************************************************************  02189000
*    *                                                               *  02190000
*    * Constants for OdmvThdStatus7                                  *  02191000
*    *                                                               *  02192000
*    *****************************************************************  02193000
*                                                                       02194000
*                                                                       02195000
ODMVCUTRACED EQU C'T'    User Traced process                            02196000
*                                                                       02197000
*    *****************************************************************  02198000
*    *                                                               *  02199000
*    * Following constant are not returned by BPXEKDA. See remarks   *  02200000
*    * how to get those information                                  *  02201000
*    *                                                               *  02202000
*    *****************************************************************  02203000
*                                                                       02204000
*                                                                       02205000
ODMVONETASK EQU C'1'     Only one dubbed task                           02206000
*                                                                       02207000
*      ***************************************************************  02208000
*      *                                                             *  02209000
*      * OdmvMulThread=On                                               02210000
*      *                                                             *  02211000
*      ***************************************************************  02212000
*                                                                       02213000
*                                                                       02214000
ODMVMULTTHDS EQU C'M'    Multiple threads which were NOT               *02215000
                         pthread_create()'ed and has not issued a wait  02216000
*                                                                       02217000
*      ***************************************************************  02218000
*      *                                                             *  02219000
*      * OdmvPthread=On                                                 02220000
*      *                                                             *  02221000
*      ***************************************************************  02222000
*                                                                       02223000
*                                                                       02224000
ODMVPTHREADS EQU C'H'    Multiple threads exist. Some created by       *02225000
                         pthread_create                                 02226000
*                                                                       02227000
*      ***************************************************************  02228000
*      *                                                             *  02229000
*      * OdmvStopped=On                                                 02230000
*      *                                                             *  02231000
*      ***************************************************************  02232000
*                                                                       02233000
*                                                                       02234000
ODMVSTOPST EQU C'T'      stopped                                        02235000
*                                                                       02236000
*      ***************************************************************  02237000
*      *                                                             *  02238000
*      * OdmvSwap=On                                                    02239000
*      *                                                             *  02240000
*      ***************************************************************  02241000
*                                                                       02242000
*                                                                       02243000
ODMVSWAPPED EQU C'I'     Swapped out                                    02244000
*                                                                       02245000
*    *****************************************************************  02246000
*    *                                                               *  02247000
*    * Reserved Constants                                               02248000
*    *                                                               *  02249000
*    *****************************************************************  02250000
*                                                                       02251000
*                                                                       02252000
ODMVWAITO EQU  C'K'      Other Kernel Wait                              02253000
ODMVMFENTRY_LEN EQU *-ODMVMFENTRY                                       02254000
.L0076   ANOP                                                           02255000
         AIF   ('&ZCBPRINT' EQ 'NO').P3                                 02256000
         AIF   ('&LIST' EQ 'YES').P4                                    02257000
.P3      ANOP                                                           02258000
         POP   PRINT                                                    02259000
.P4      ANOP                                                           02260000
.P_EXIT  ANOP                                                           02261000
         MEND                                                           02262000
**/ BPXZODMV_2:;                                                        02263000
* %BPXZODMV_INCLUDED = 'YES';                                           02264000
* %DCL ZCBPRINT CHAR EXT;                                               02265000
* %DEACTIVATE ZCBPRINT;                                                 02266000
* %DCL BPXZODMV_LIST CHAR EXT;                                          02267000
* %DEACTIVATE BPXZODMV_LIST;                                            02268000
* %IF BPXZODMV_LIST ^= 'NO' &                                           02269000
*    ZCBPRINT ^= 'NO' %THEN                                             02270000
*   %GOTO BPXZODMV_3;                                                   02271000
*   @LIST PUSH NOECHO;                                                  02272000
*   @LIST NOASSEMBLE NOECHO;                                            02273000
*   @LIST OFF C NOECHO;                                                 02274000
* %BPXZODMV_3:;                                                         02275000
*/* Start of PL/X Source                                             */ 02276000
*                                                                       02277000
* DCL OdmvPtr  Ptr(31) noreg;       /* Pointer to the BPXZODMV   @P4C*/ 02278000
* DCL OdmvALET Ptr(31);             /* Pointer to the ALET           */ 02279000
*/* Mapping of ODMV data area supplied to BPXEKDA                    */ 02280000
*DCL                                                                    02281000
* 1   ODMV             BASED    Bdy(Dword),                             02282000
*  3  OdmvID           Char(4),     /* EBCDIC ID - ODMV              */ 02283000
*  3  OdmvOutPtr       Ptr(31),     /* Address of Output area ODMVOUT*/ 02284000
*/* Input parm area supplied to BPXEKDA                         */      02285000
*  3  OdmvInputParms,               /* Input parameters              */ 02286000
*     5 OdmvInFlags    Bit(32),     /* Input Flags (Non-mutually        02287000
*                                       exclusive)               @DEC*/ 02288000
*      6 OdmvInByte1   Bit(8),                               /* @DFA */ 02289000
*       7 OdmvSummary  Bit(1),      /* Summary specified or defaulted*/ 02290000
*       7 OdmvBrls     Bit(1),      /* Byte Range Lock Wait for      */ 02291000
*                   /* Process. Only processed when OdmvPIDs=On @DFA */ 02292000
*       7 OdmvResetSyslHW Bit(1),   /* Reset Highwatermark of System    02293000
*                                   before gathering limit data @DFA */ 02294000
*       7 OdmvVSERVER  Bit(1),      /* VSERVER Specified         @PEM*/ 02295000
*       7 OdmvOWNER    Bit(1),      /* D OMVS,F,OWNER=       @PEM@DZA*/ 02296000
*       7 OdmvTYPE     Bit(1),      /* D OMVS,F,TYPE=        @PEM@DZA*/ 02297000
*       7 OdmvNAME     Bit(1),      /* D OMVS,F,NAME=        @PEM@DZA*/ 02298000
*       7 OdmvEXCEPTION Bit(1),     /* D OMVS,F,EXCEPTION    @PEM@DZA*/ 02299000
*      6 OdmvInByte2   Bit(8),                                 /*@PEA*/ 02300000
*       7 OdmvWLatches   Bit(1),    /* D OMVS,W,LATCHES      @PEM@EBA*/ 02301000
*       7 OdmvWMessages  Bit(1),    /* D OMVS,W,MESSAGES     @PEM@EBA*/ 02302000
*       7 OdmvWOther     Bit(1),    /* D OMVS,W,OTHER        @PEM@EBA*/ 02303000
*       7 OdmvWAge       Bit(1),    /* D OMVS,W,AGE          @PEM@EBA*/ 02304000
*       7 OdmvWSpecial   Bit(1),    /* D OMVS,W,SPECIAL      @PEM@EBA*/ 02305000
*       7 OdmvFSuid      Bit(1),    /* D OMVS,F,UID=             @EEA*/ 02306000
*       7 OdmvPipeSRESET Bit(1),    /* Reset Pipe HIGHWATER USER        02307000
*                                      info                      @EGA*/ 02308000
*     /***************************************************************/ 02309000
*     /* OdmvInFlagsM contains mutually exclusive flags. Specifying  */ 02310000
*     /* more than one is an error.  BPXEKDA validates that only one */ 02311000
*     /* flag is specified.  BPXOMAST does not validate this.        */ 02312000
*     /**********************************************************@PEA*/ 02313000
*     5 OdmvInFlagsM   Bit(32),     /* Mutually Exclusive Input Flags   02314000
*                                                                @DEA*/ 02315000
*      6 OdmvInByteM1  Bit(8),                                 /*@DFC*/ 02316000
*       7 OdmvFILEs    Bit(1),      /* FILE operand specified        */ 02317000
*       7 OdmvASIDALLs Bit(1),      /* ASID=ALL or VSERVER specified */ 02318000
*       7 OdmvASIDs    Bit(1),      /* ASID specified and not ALL    */ 02319000
*       7 OdmvUs       Bit(1),      /* User Name specified           */ 02320000
*       7 OdmvSTORAGE  Bit(1),      /* STORAGE specified         @EJC*/ 02321000
*       7 OdmvOptions  Bit(1),      /* OPTIONS specified             */ 02322000
*       7 OdmvPIDs     Bit(1),      /* PID specified                 */ 02323000
*       7 OdmvPfsBit   Bit(1),      /* PFS operand specified         */ 02324000
*      6 OdmvInByteM2  Bit(8),                                 /*@DFC*/ 02325000
*       7 OdmvCinetAll Bit(1),      /* CINET=ALL specified           */ 02326000
*       7 OdmvCinetTp  Bit(1),      /* CINET=tpname specified        */ 02327000
*       7 OdmvLimits   Bit(1),      /* LIMITS specified. Gathers @DFA*/ 02328000
*                  /* System or Process Limit Data. PID is set   @DFA*/ 02329000
*                  /* in OdmvPidParm then Process Limits are     @DFA*/ 02330000
*                  /* returned, else Sustem Limits.              @DFA*/ 02331000
*       7 OdmvSer      Bit(1),      /* SER    specified. Gathers        02332000
*                                      USS Serialization data    @DRA*/ 02333000
*       7 OdmvShortMF  Bit(1),      /* MF specified              @DTA*/ 02334000
*       7 OdmvAllMF    Bit(1),      /* MF=ALL specified          @DTA*/ 02335000
*       7 OdmvPurgeMF  Bit(1),      /* MF=PURGE specified        @DTA*/ 02336000
*       7 OdmvActServ  Bit(1),      /* ACTIVATE=SERVICE          @DXA*/ 02337000
*                                                                       02338000
*      6 OdmvInByteM3  Bit(8),                                 /*@DFC*/ 02339000
*       7 OdmvSockets  Bit(1),      /* SOCKETS specified         @DVA*/ 02340000
*       7 OdmvWAITERS  Bit(1),      /* D OMVS,WAITERS            @DWA*/ 02341000
*       7 OdmvUsrMnt   Bit(1),      /* D OMVS,USERMOUNTS         @EEC*/ 02342000
*       7 OdmvPipeS    Bit(1),      /* D OMVS,PIPES              @EGA*/ 02343000
*       7 OdmvPipeSall Bit(1),      /* D OmVS,PIPES,ALL          @EGA*/ 02344000
*       7 OdmvPipeUid  Bit(1),      /* D OMVS,PIPES,UID=         @EHA*/ 02345000
*       7 OdmvADUBWs  Bit(1),       /* D OMVS,ASID=DUBW          @03A*/ 02346000
*       7 OdmvSTORAGEReset Bit(1),  /* D OMVS,STORAGE,RESET      @ELA*/ 02347000
*                                                                       02348000
*      6 OdmvInByteM4  Bit(8),                                 /*@DFC*/ 02349000
*                                                                       02350000
*     5 OdmvPIDparm   Fixed(32),    /* PID valid when OdmvPIDs=On       02351000
*                                                                @P5M*/ 02352000
*     5 OdmvASIDparm   Fixed(16),   /* ASID valid when OdmvASIDs=On  */ 02353000
*     5 OdmvUparm      Char(8),     /* User name valid when OdmvUd=On*/ 02354000
*                                   /* or sysname when OdmvOwner @DZA*/ 02355000
*                                   /* or type when OdmvType     @DZA*/ 02356000
*     5 OdmvCinetTpName Char(8),    /* When OdmvCinetTP, this field     02357000
*                                       holds tpname             @DEA*/ 02358000
*     5 OdmvUparm2     Char(44),    /* Filename valid when       @DZA*/ 02359000
*                                   /* OdmvName is given         @DZA*/ 02360000
*     5 *              Char(2),     /* Available                 @EEA*/ 02361000
*     5 OdmvUIDparm   Fixed(32),    /* UID value when OdmvFSuid=on !    02362000
*                                      OdmvPipeUid=ON       @EHC @EEA*/ 02363000
*     5 OdmvReserved1  Char(8),     /* Reserved              @EEC@P5C*/ 02364000
*     5 OdmvInputEnd   Char(0) Bdy(Dword);  /*End of Input Block @DEA*/ 02365000
*                                                               @SPACE; 02366000
*                                                                       02367000
*/* Output area returned by BPXEKDA                         */          02368000
*DCL                                                                    02369000
*1   ODMVOUT          BASED(OdmvOutPtr) Bdy(Dword),         /* @DEA */  02370000
* 3  OdmvVerNum        Fixed(32),   /* Version Number of Output Area    02371000
*                                                               @DEA*/  02372000
* 3  OdmvSummaryData,               /* Summary data returned on all     02373000
*                                      invocations              @DEA*/  02374000
*  5  OdmvOmvsProc     Char(8),     /* OMVS Procedure name           */ 02375000
*  5  OdmvGen01  Fixed(32),                                 /* @DEC */  02376000
*   7    OdmvGen02      Fixed(16),                                      02377000
*   7    OdmvKernelAsid Fixed(16), /* Kernel's address space    @D5A*/  02378000
*  5  OdmvParmMemList  Char(40),    /* List of OMVS Parmlib     @D5A*/  02379000
*                                   /* member suffixes (XX,YY,ZZ,..)*/  02380000
* 3  OdmvOptionsData,               /* Options data returned for        02381000
*                                      OdmvOptions               @DEA*/ 02382000
*  5  OdmvMaxProcSys   Fixed(31),   /* Max processes on system   @D5A*/ 02383000
*  5  OdmvChildMax     Fixed(31),   /* Max processes per User ID @D5A*/ 02384000
*  5  OdmvMaxFileProc  Fixed(31),   /* Max number of allocated files    02385000
*                                      for a single process      @D5A*/ 02386000
*  5  OdmvMaxFileSize  Fixed(31),   /* Max file size             @D5A*/ 02387000
*  5  OdmvMaxCPUTime   Fixed(31),   /* Max CPU time              @D5A*/ 02388000
*  5  OdmvMaxUsers     Fixed(31),   /* Max number of users on system    02389000
*                                                                @D5A*/ 02390000
*  5  OdmvMaxRtys      Fixed(31),   /* Max number of remote-terminal    02391000
*                                      sessions                  @D5A*/ 02392000
*  5  OdmvMaxPtys      Fixed(31),   /* Max number of pseudo-terminal    02393000
*                                      sessions                  @D5A*/ 02394000
*  5  OdmvMaxMMapArea  Fixed(31),   /* Max size of Memory Map Area      02395000
*                                      in PAGES                  @D5A*/ 02396000
*  5  OdmvMaxASSize    Fixed(31),   /* Max address space size    @D5A*/ 02397000
*  5  OdmvMAXThreads   Fixed(32),   /* Max # of Threads          @D5A*/ 02398000
*  5  OdmvMaxThreadTasks Fixed(32), /* Max number of tasks running      02399000
*                                      Pthreads per process      @D5A*/ 02400000
*  5  OdmvMaxCoreSize  Fixed(31),   /* Max core size             @D5A*/ 02401000
*  5  OdmvMaxShrPages  Fixed(32),   /* Maximum number of pages that     02402000
*                                      can be in a shared relationship  02403000
*                                      in the system             @D5A*/ 02404000
*  5  OdmvMaxMsgNIDs   Fixed(31),   /* Max system message queue IDs     02405000
*                                                                @D5A*/ 02406000
*  5  OdmvMaxMsgQBytes Fixed(31),   /* Max bytes per message queue      02407000
*                                                                @D5A*/ 02408000
*  5  OdmvMaxMsgQMNum  Fixed(31),   /* Max messages per queue    @D5A*/ 02409000
*  5  OdmvMaxShmNIDs   Fixed(31),   /* Max system shared memory IDs     02410000
*                                                                @D5A*/ 02411000
*  5  OdmvMaxShmSpages Fixed(31),   /* Max system shared memory         02412000
*                                      pages for all segements   @D5A*/ 02413000
*  5  OdmvMaxShmMpages Fixed(31),   /* Max shared memory pages per      02414000
*                                      segment                   @D5A*/ 02415000
*  5  OdmvMaxShmNSegs  Fixed(31),   /* Max shared memory segments       02416000
*                                      per process               @D5A*/ 02417000
*  5  OdmvMaxSemNIDs   Fixed(31),   /* Max system semaphore IDs  @D5A*/ 02418000
*  5  OdmvMaxSemNSEMS  Fixed(31),   /* Max number of semaphores per     02419000
*                                      semaphore set             @D5A*/ 02420000
*  5  OdmvMaxSemNOPS   Fixed(31),   /* Max number of operations per     02421000
*                                      BPX1SOP (SEMOP) call      @D5A*/ 02422000
*  5  OdmvSuperUser    Char(8),     /* SuperUser                 @D5A*/ 02423000
*  5  OdmvSTEPLIBLISTLen Fixed(8),  /* Length of STEPLIB name    @D5A*/ 02424000
*  5  OdmvSTEPLIBLIST    Char(255), /* Name of STEPLIB dataset   @D5A*/ 02425000
*  5  OdmvSETPPGCnt      Fixed(8),  /* Priority PG count         @D5A*/ 02426000
*  5  OdmvSETPGoalCnt    Fixed(8),  /* Priority Goal count       @D5A*/ 02427000
*  5  OdmvUSERIDTABLELen Fixed(8),  /* Length of table name      @D5A*/ 02428000
*  5  OdmvReserved02     Char(2),   /* Reserved                  @DEA*/ 02429000
*  5  OdmvUSERIDTABLE    Char(255), /* Name of Userid table      @D5A*/ 02430000
*  5  OdmvPriorityPG (40) Fixed(16), /* performance group numbers    */ 02431000
*                                    /* for compatibility mode       */ 02432000
*                                    /* 40 possible entries      @D5A*/ 02433000
*  5  OdmvReserved10     Char(4),    /* Reserved                 @P4A*/ 02434000
*  5  OdmvGen04          Char(0) Bdy(DWord), /* Ensure array on DWD  */ 02435000
*                                                              /*@DEC*/ 02436000
*  5  OdmvPriorityGoal (40) Char(8), /* service classes              */ 02437000
*                                    /* for goal mode                */ 02438000
*                                    /* 40 possible entries      @D5A*/ 02439000
*  5  ODMVReserved09   Char(4),     /* Reserved                  @04C*/ 02440000
*  5  OdmvTTYGroup     Char(8),     /* TTY Group name            @D8A*/ 02441000
*  5  OdmvMaxQueuedSigs Fixed(32),  /* MaxQueuedSigs from Optn   @P2A*/ 02442000
*  5  OdmvShrLibRgnSize Fixed(32),  /* ShrLibRgnSize from Optn   @DCA*/ 02443000
*  5  OdmvShrLibMaxPages Fixed(32), /* ShrLibMaxPages from Optn  @DCA*/ 02444000
*  5  OdmvVersion       Char(8),    /* OS/390 Version String     @DDA*/ 02445000
*  5  OdmvFlagWord01   Fixed(32),   /* Flag word                 @DEC*/ 02446000
*    7 OdmvFlagByte01  Bit(8),                                          02447000
*     9  *             Bit(1),      /* Available                 @EUC*/ 02448000
*     9  OdmvSyscall_counts bit(1), /* ON = counts being traced         02449000
*                                      OFF= counts not being done@D8A*/ 02450000
*     9  OdmvSysplex   Bit(1),      /* ON= IPLed sysplex = Y     @P3A*/ 02451000
*                                   /* OFF= local system         @P3A*/ 02452000
*     9  OdmvSetPExist Bit(1),      /* If SETP was created       @DEA*/ 02453000
*     9  OdmvLimMsgSys  Bit(1),     /* Level of warning messages for */ 02454000
*     9  OdmvLimMsgProc Bit(1),     /* reached limits. Can be           02455000
*                                      SYS=OFF PROC=OFF is NONE         02456000
*                                      SYS=ON  PROC=OFF is SYSTEM       02457000
*                                      SYS=ON  PROC=ON  is ALL   @DFA*/ 02458000
*     9  OdmvAutoCvt    Bit(1),     /* AutoCvt On or Off         @DJA*/ 02459000
*     9  OdmvSWAAbove   Bit(1),     /* SWA above if on           @DQA*/ 02460000
*    7 OdmvFlagByte02  Bit(8),                                          02461000
*     9  OdmvMaxCoreSizeBin Bit(1), /* MaxCoreSize type          @D?A*/ 02462000
*                                   /* On = BinMult, Off = Bin   @D?A*/ 02463000
*     9  OdmvAltRoot    Bit(1),     /* ALTROOT Active=mounted    @E8A*/ 02464000
*     9  OdmvUMTBbuilt  Bit(1),     /* On = Nonprivileged user mounts   02465000
*                                      table built successfully  @ECA*/ 02466000
*     9  OdmvLostMsg    Bit(1),     /* LostMsg On or Off         @EFA*/ 02467000
*     9  OdmvAutoCvtAll Bit(1),     /* AutoCvt All               @EIA*/ 02468000
*     9  OdmvKStacksAbove Bit(1),   /* Kernal stacks above if on @EPA*/ 02469000
*     9  OdmvVersionUnmnt Bit(1),   /* UNMOUNT in VERSION  if on @ERA*/ 02470000
*3  OdmvSecondaryData,              /* Secondary Output Data     @DEA*/ 02471000
*  5  OdmvOutArraySize Fixed(32),   /* Number of entries in secondary   02472000
*                                      output data pointer array     */ 02473000
*  5  OdmvOutArrayPtr  Ptr(31),     /* Address of output data pointer   02474000
*                                      array                     @DEA*/ 02475000
*  5  OdmvThdArraySize Fixed(32),   /* Number of entries in output      02476000
*                                      thread data pointer array @DEA*/ 02477000
*  5  OdmvThdArrayPtr  Ptr(31),     /* Address of thread data pointer   02478000
*                                      array                     @DEA*/ 02479000
*  5  OdmvPFSCounts,                 /* Counts of PFS Array entries  */ 02480000
*     7 OdmvPFStypecount Fixed(31),  /*  Number of PFS 'type' entries*/ 02481000
*     7 OdmvPFSnamecount Fixed(31),  /*  Number of PFS 'name' entries*/ 02482000
*     7 OdmvPFSparmcount Fixed(31),  /*  Number of Parm entries      */ 02483000
*  5  OdmvCinetCounts,               /* Counts of CINET Array entries*/ 02484000
*     7 OdmvCinetHomeCnt Fixed(31),  /*  Number of CINET home entries*/ 02485000
*     7 OdmvCinetHostCnt Fixed(31),  /*  Number of CINET host entries*/ 02486000
*     7 OdmvCinetNetwCnt Fixed(31),  /*  Number of CINET netw entries*/ 02487000
*  5  OdmvFlagWord02   Fixed(32),   /* Flag word                 @DEA*/ 02488000
*     7  OdmvPartial  Bit(1),       /* Partial thread data       @DEA*/ 02489000
*     7  OdmvSysLimits Bit(1),      /* Sytem Limits returned     @DFA*/ 02490000
*     7  OdmvPrcLimits Bit(1),      /* Process Limits returned   @DFA*/ 02491000
*  5  OdmvBrlmSrv     Char(8),      /* ByterangelockMgr Server   @01A*/ 02492000
*  5  OdmvLimitsPtr    Ptr(31),     /* Address of limits data pointer   02493000
*                                      When OdmvSysLimits is on it      02494000
*                                      points to a structure OdmvSysL.  02495000
*                                      When OdmvPrcLimits is on it      02496000
*                                      points to a structure OdmvPrcL   02497000
*                                                                @DFA*/ 02498000
*  5  OdmvExtOptDataPtr Ptr(31),   /* Address of pointer to the         02499000
*                                     Extended Options Dat     @DIA */  02500000
*  5  OdmvIpv6Ptr       Ptr(31),   /* Address of pointer to the         02501000
*                                     OdmvIpv6 structure        @DMA*/  02502000
*  5  OdmvSerPtr        Ptr(31),   /* Address of serialization data     02503000
*                                     header    OdmvSerHdr      @DRA*/  02504000
*  5  OdmvDynServPtr    Ptr(31),   /* Address of ACTIVATE=SERVICE Data  02505000
*                                     header    OdmvDynServ     @DXA*/  02506000
*  5  OdmvUsrMntTbPtr   Ptr(31),   /* Address of nonprivileged user     02507000
*                                     mounts table header.      @ECA*/  02508000
*  5  OdmvUMASK         Char(4),   /* UMASK value               @06A*/  02509000
*  5  OdmvReserved11    Char(20),  /* Reserved for future extensions.   02510000
*                                     Consider adding only pointers     02511000
*                                     to structures here ]]]     @06C*/ 02512000
*                                                                       02513000
*3  OdmvReservedData,              /* Reserved Output Area for          02514000
*                                      Operating System Usage    @DEA*/ 02515000
*  5 OdmvCbGen06 Union,             /* Address of output area     */    02516000
*    7 OdmvOutputPtr VIAPOINTER,    /* For PLX it's an VIAPOINTER */    02517000
*    7 OdmvOutputALETADDR,          /* Assembler users can use this  */ 02518000
*      9 OdmvOutputALET Fixed(32),                                      02519000
*      9 OdmvOutputADDR Ptr(31),                                        02520000
*  5  OdmvStoken       Char(8),     /* Stoken of Data Space      @DEM*/ 02521000
*  5  OdmvOdca         Ptr(31),     /* Address of Odca           @DEM*/ 02522000
*  5  OdmvRetCode      Fixed(32),   /* Return Code from BPXODMVS @DEM*/ 02523000
*  5  OdmvCinetMsgNum  Fixed(31),   /*  Error Message Number     @DEA*/ 02524000
*  5  OdmvFlagWord03   Fixed(32),   /* Flag word                 @DEA*/ 02525000
*     7  OdmvCaps     Bit(1),       /* CAPS Specified on D OMVS  @DEM*/ 02526000
*  5  OdmvProtPgPtr    Ptr(31),     /* Ptr. to begin of prot. Pg.@DEA*/ 02527000
*  5  OdmvAUTHPGMLISTLen Fixed(8),  /* Length of Authpgm name    @DMA*/ 02528000
*  5  OdmvAUTHPGMLIST    Char(255), /* Name of Authpgm dataset   @DMA*/ 02529000
*  5  OdmvServLinkLibLen Fixed(8),  /* Length of Serv_Linklib DS @DMA*/ 02530000
*  5  OdmvServLinkLib    Char(44),  /* Name of Serv_Linklib DS   @DMA*/ 02531000
*  5  OdmvServLpaLibLen  Fixed(8),  /* Length of Serv_Lpalib  DS @DMA*/ 02532000
*  5  OdmvServLpaLib     Char(44),  /* Name of Serv_Lpalib  DS   @DMA*/ 02533000
*  5  OdmvServLinkLibVolLen Fixed(8),/* Length of Serv_Lpalib DS @DMA*/ 02534000
*  5  OdmvServLinkLibVol Char(06),  /* Name of Serv_Lpalib  DS   @DMA*/ 02535000
*  5  OdmvServLpaLibVolLen  Fixed(8),/* Length of Serv_Lpalib DS @DMA*/ 02536000
*  5  OdmvServLpaLibVol  Char(06),  /* Name of Serv_Lpalib  DS   @DMA*/ 02537000
*  5  OdmvCinetPort    Fixed(16),   /* INADDRANYPORT             @P8A*/ 02538000
*  5  OdmvCinetCount   Fixed(16),   /* INADDRANYCOUNT            @P8A*/ 02539000
*  5  OdmvMaxIoBufUser Fixed(32),   /* MaxIoBufUser              @EIA*/ 02540000
*  5  OdmvPWTE         Char(6),     /* PWT value SMF/ENV/SMFENV  @EMA*/ 02541000
*  5  OdmvReserved03   Char(6),     /* reserved                  @EMC*/ 02542000
*  5  OdmvPvtStgCurrent    Fixed(32), /* reserved                @ELA*/ 02543000
*  5  OdmvPvtStgHighWater  Fixed(32), /* reserved                @ELA*/ 02544000
*  5  OdmvSysStkInUse   Fixed(32),    /* reserved                @ELA*/ 02545000
*    7  OdmvSysThdInUse   Fixed(32),    /* threads in use        @EPA*/ 02546000
*  5  OdmvSysStkHighWater Fixed(32),  /* reserved                @ELA*/ 02547000
*    7  OdmvSysThdHighWater Fixed(32),  /* threads in use hw mark@EPA*/ 02548000
* 3  OdmvEnd  Char(0) Bdy(Dword);  /* End of Block                   */ 02549000
*                                                                       02550000
*/********************************************************************/ 02551000
*/* Output area array returned for OdmvFiles, OdmvPIDs, OdmvVserver, */ 02552000
*/*  OdmvAsidAlls, OdmvAsids, OdmvPFSBit, OdmvCinetTp, OdmvCinetAll  */ 02553000
*/*  or OdmvUs that contains the list of pointers to the associated  */ 02554000
*/*  output areas.                                               @DEA*/ 02555000
*/********************************************************************/ 02556000
*Dcl                                                                    02557000
* 1 OdmvOutArray(*)  BASED(OdmvOutArrayPtr) Bdy(word),        /* @DEA*/ 02558000
*   3 OdmvOutArrayElemPtr Ptr(31);                                      02559000
*                                                                       02560000
*/********************************************************************/ 02561000
*/* Output area array returned for OdmvPIDs for the list of pointers */ 02562000
*/*  to the thread data areas for the returned process           @DEA*/ 02563000
*/********************************************************************/ 02564000
*Dcl                                                                    02565000
* 1 OdmvThdArray(*)  BASED(OdmvThdArrayPtr) Bdy(word),        /* @DEA*/ 02566000
*   3 OdmvThdArrayElemPtr Ptr(31);                                      02567000
*                                                                       02568000
*/********************************************************************/ 02569000
*/* Mapping of file data returned for OdmvFiles - the actual data    */ 02570000
*/* comes from fields in the BPXYMNTE.  During processing of Display */ 02571000
*/* OMVS it is moved into BPXZODMV. (Code Review)                @DEA*/ 02572000
*/********************************************************************/ 02573000
*Dcl                                                                    02574000
*  1 OdmvFILE Based Bdy(Word),                               /*  @DEC*/ 02575000
*    3 OdmvDevice   Fixed(32),      /* Device Name  the st_dev value */ 02576000
*                                   /* that is returned by the stat  */ 02577000
*                                   /* system call for each file in  */ 02578000
*                                   /* the file system.              */ 02579000
*    3 OdmvTYPENAME CHAR(8),        /* File System Type name from the*/ 02580000
*                                   /* FILESYSTYPE parmlib statement */ 02581000
*    3 OdmvSTATUS   Fixed(32),      /* Status matches MSG BPXO45Ie   */ 02582000
*                                   /* 1= FORCE UNMOUNT              */ 02583000
*                                   /* 2= DRAIN UNMOUNT              */ 02584000
*                                   /* 3= IMMEDIATE UNMOUNT          */ 02585000
*                                   /* 4= NORMAL UNMOUNT             */ 02586000
*                                   /* 5= RESET UNMOUNT              */ 02587000
*                                   /* 6= IMMEDIATE UNMOUNT ATTEMPTED*/ 02588000
*                                   /* 7= ACTIVE                     */ 02589000
*                                   /* 8= QUIESCED                   */ 02590000
*                                   /* 9= NOT ACTIVE                 */ 02591000
*                                   /* 10= MOUNT IN PROGRESS         */ 02592000
*                                   /* 11= ASYNCH MOUNT IN PROGRESS  */ 02593000
*                                   /* 12= IN RECOVERY           @D9A*/ 02594000
*                                   /* 13= UNOWNED               @D9A*/ 02595000
*                                   /* 14= SUPERQUIESCED         @ETA*/ 02596000
*                                   /* 15= RECYCLING             @ETA*/ 02597000
*                                   /* 16= RECYCLING,ASYNCH MOUNTING */ 02598000
*                                   /* 17= RECYCLING,NOT ACTIVE  @ETA*/ 02599000
*    3 OdmvQJobName CHAR(8),        /* Quiesce Job Name              */ 02600000
*                                                                       02601000
*    3 OdmvQPID     Fixed(32),      /* Quiesce Process ID            */ 02602000
*    3 OdmvMountMode Fixed(32),     /* Mount mode for filesystem @P1A*/ 02603000
*                                   /* 1 = R/W, 2 = R/O              */ 02604000
*    3 OdmvFsNAME   Char(44),       /* File System name for PDSE/X   */ 02605000
*    3 OdmvPATH     Char(63),       /* Path or Directory name converted 02606000
*                                      to upper case characters      */ 02607000
*    3 OdmvMountParm Char(57),      /* Mount parm truncated and         02608000
*                                      optionally converted to upper    02609000
*                                      case                      @D4A*/ 02610000
*    3 OdmvFSOwner   Char(8),       /* FS Owner name             @D9A*/ 02611000
*    3 OdmvFSNoAutoMove Fixed(32),  /* 1 = fs is AUTOMOVEable        */ 02612000
*                                   /* 2 = fs is Not AUTOMOVEable    */ 02613000
*                                   /* 3 = AUTOMOVE = U          @ETA*/ 02614000
*                                   /* 4 = AUTOMOVE = I          @ETA*/ 02615000
*                                   /* 5 = AUTOMOVE = E          @ETA*/ 02616000
*    3 OdmvQSystem Char(8),         /* Quiesce system            @D9A*/ 02617000
*    3 OdmvFSClient  Fixed(32),     /* 1 = Yes is a client       @D9A*/ 02618000
*                                   /* 2 = No is not a client    @D9A*/ 02619000
*    3 OdmvFsFileTag Char(4),       /* Mount TAG data        @DNC@DJA*/ 02620000
*    3 OdmvSyslist,                 /* System list               @DNA*/ 02621000
*      5 OdmvSlNum   Fixed(16),     /* Number of systems in list @DNA*/ 02622000
*      5 *           Fixed(16),     /*                           @DNA*/ 02623000
*      5 OdmvSlName(32) Char(8),    /* System names              @DNA*/ 02624000
*    3 OdmvAggName Char(44),        /* Aggregate Name            @DOA*/ 02625000
*    3 OdmvROSecl  Char(8),         /* ROSeclabel                @DWC*/ 02626000
*                                                                       02627000
*    3 OdmvFSLatNum Fixed(31),      /* File System Latch Number  @DWA*/ 02628000
*    3 OdmvFSQLatNum Fixed(31),     /* Quiesce Latch Number      @DWA*/ 02629000
*    3 OdmvFSMtData   Char (18),    /* Mount Date,time in EBCDIC @DWA*/ 02630000
*     5 OdmvFSMtDate   Char(10),    /* yyyy/mm/dd                @DWA*/ 02631000
*      7 OdmvFSMtYear  Char(4),     /*  yyyy                     @DWA*/ 02632000
*       9 *            Char(2),     /*  yy (2004...the 20)       @DWA*/ 02633000
*       9 OdmvFSMtYY   Char(2),     /*  yy (2004...the 04)       @DWA*/ 02634000
*      7 OdmvFSSlash1  Char(1),     /*  /                        @DWA*/ 02635000
*      7 OdmvFSMtMonth Char(2),     /*  mm                       @DWA*/ 02636000
*      7 OdmvFSSlash2  Char(1),     /*  /                        @DWA*/ 02637000
*      7 OdmvFSMtDay   Char(2),     /*  dd                       @DWA*/ 02638000
*     5 OdmvFSMtTime   Char( 8),    /* hh:mm:ss                  @DWA*/ 02639000
*      7 OdmvFShh      Char(2),     /*  hh                       @DWA*/ 02640000
*      7 OdmvFSDot1    Char(1),     /*  :                        @DWA*/ 02641000
*      7 OdmvFSmm      Char(2),     /*  mm                       @DWA*/ 02642000
*      7 OdmvFSDot2    Char(1),     /*  :                        @DWA*/ 02643000
*      7 OdmvFSss      Char(2),     /*  ss                       @DWA*/ 02644000
*                                                                       02645000
*    3 OdmvFSPfsNormalStatus Char(56), /* Pfs normal status      @E5C*/ 02646000
*    3 OdmvFSPfsExcpStatus   Char(56), /* Pfs exception status   @E5A*/ 02647000
*    3 OdmvFSFlags           BIT(8),   /*                        @EQC*/ 02648000
*     5 OdmvFSNoSUID         BIT(1),   /* NOSETUID               @EQA*/ 02649000
*     5 OdmvFSNoSec          BIT(1),   /* NOSECURITY             @EQA*/ 02650000
*     5 OdmvFSUnmntVer       BIT(1),   /* Auto-unmnt version FS  @ERA*/ 02651000
*     5 OdmvFSMirror         BIT(1),   /* vfs MIRRORING          @ETA*/ 02652000
*     5 *                    BIT(4),   /* available          @ETC@EQA*/ 02653000
*    3 *                     char(1),  /* available              @EQC*/ 02654000
*    3 OdmvFSUsrMntUID       Fixed(32);/* UID of user that mounted the  02655000
*                                         file system. Always 0 for     02656000
*                                         the privileged user mounts    02657000
*                                                                @ECA*/ 02658000
*/********************************************************************/ 02659000
*/* Mapping of process data returned for OdmvPids, OdmvAsidAlls,     */ 02660000
*/*   OdmvAsids                                                      */ 02661000
*/********************************************************************/ 02662000
*Dcl                                                                    02663000
*  1 OdmvPROCESS Based Bdy(Word),                             /* @DEC*/ 02664000
*    3 OdmvJobName Char(8),         /* Job name from ASCBJBNI or        02665000
*                                      ASCBJBNS                      */ 02666000
*    3 OdmvUser    Char(8),         /* User Name from OasbLoginName  */ 02667000
*    3 OdmvPID     Fixed(32),       /* Process ID                    */ 02668000
*    3 OdmvPPID    Fixed(32),       /* Parent's Process ID           */ 02669000
*    3 OdmvASID    Fixed(16),       /* Address space ID or zero for     02670000
*                                      zombie state                  */ 02671000
*    3 OdmvReserved04 Char(5),      /* Reserved                  @P4C*/ 02672000
*    3 OdmvStartYD   Char(7),       /* Local Start Time YYYYDDD      */ 02673000
*      5 OdmvStYY  Char(4),         /* Start Time Year               */ 02674000
*      5 OdmvStDD  Char(3),         /* Start Time Day of year (1-366)*/ 02675000
*    3 OdmvStart   Char(6),         /* Start Time hhmmss             */ 02676000
*      5 OdmvStHH    Char(2),       /* Start Time hours              */ 02677000
*      5 OdmvStMM    Char(2),       /* Start Time minutes            */ 02678000
*      5 OdmvStSS    Char(2),       /* Start Time seconds            */ 02679000
*    3 OdmvCT      Char(8),         /* Process system and user compute  02680000
*                                      time                          */ 02681000
*    3 OdmvCState  Bit(32),         /* Process state                 */ 02682000
*     4  OdmvStatus1 BIT(8),        /* MVS status                    */ 02683000
*      5 OdmvSwap      BIT(1),      /* Swapped out                   */ 02684000
*      5 OdmvWaitP     BIT(1),      /* Ptrace Kernel Wait            */ 02685000
*     4  OdmvStatus2 BIT(8),        /* Process status                */ 02686000
*      5 OdmvStopped   BIT(1),      /* Stopped process               */ 02687000
*      5 OdmvGen05     BIT(1),      /*                               */ 02688000
*      5 OdmvMulThread BIT(1),      /* 0=One OpenMVS active task     */ 02689000
*      5 OdmvPthread   BIT(1),      /* 0=No pthread task in process  */ 02690000
*      5 OdmvBlockReg  BIT(1),      /* registered blocker        @DKA*/ 02691000
*      5 OdmvPermReg   BIT(1),      /* registered permanent proc @DKA*/ 02692000
*      5 OdmvRespawn   BIT(1),      /* process started with          */ 02693000
*                                   /* respawn capability        @E1A*/ 02694000
*      5 OdmvUTraced   BIT(1),      /* process being user traced @E6A*/ 02695000
*     4  OdmvStatus3 CHAR(1),       /* State of reported task - with    02696000
*            PgpsPthread=0 the most recent created thread,              02697000
*            PgpsPthread=1 the initial pthread task (IPT)        @D1C*/ 02698000
*     4  OdmvReserved05 BIT(8),        /* Reserved              */      02699000
*   3 OdmvLatchWaitPID Fixed(32) Bdy(Word),   /* Latch Process ID the   02700000
*                         process is waiting for (Zero=not waiting)*/   02701000
*   3 OdmvGeneralFlags   Bit(32),  /* General flags       @D2A */       02702000
*     5 OdmvServer        Bit(1),   /* OdmvServerInfo data is valid */  02703000
*   3 OdmvServerInfo,              /* Server Information @D2A       */  02704000
*     5 OdmvServerName    Char(32), /* SabServerName   SERVER=       */ 02705000
*     5 OdmvActiveFiles   Fixed(32),/* SabVDECount     AF=           */ 02706000
*     5 OdmvMaxFiles      Fixed(32),/* SabMaxFiles     MF=           */ 02707000
*     5 OdmvServerType    Fixed(32),/* SabServerType   TYPE=         */ 02708000
*                                   /* See NRegSType information     */ 02709000
*                                   /* in BPXYNREG for definition of */ 02710000
*                                   /* Server Types.                 */ 02711000
*   3 OdmvCMD      Char(40),        /* Command String buffer         */ 02712000
*   3 OdmvRUid    Fixed(32),        /* Process Real User Id          */ 02713000
*   3 OdmvEUid    Fixed(32),        /* Process Effective User Id     */ 02714000
*   3 OdmvSTORAGEInfo,              /* STORAGE specified         @EJA*/ 02715000
*     5 OdmvStacksInUse   Fixed(32),/* Space switch stacks in use by    02716000
*                                      the process               @EJA*/ 02717000
*     5 OdmvThreadCnt     Fixed(32),/* Count of pthread_created threads 02718000
*                                      in process                @EJA*/ 02719000
*   3 OdmvSeclabel Char(8),         /* Process Seclabel          @EOC*/ 02720000
*   3 OdmvCTzIIP   Char(8);         /* Process system and user compute  02721000
*                                      time on zIIP              @EOA*/ 02722000
*/********************************************************************/ 02723000
*/* Mapping of threads data returned for OdmvPids                @DEC*/ 02724000
*/********************************************************************/ 02725000
*Dcl                                                                    02726000
*  1 OdmvThreads Based Bdy(Word),   /* Thread info               @DEC*/ 02727000
*    3 OdmvThdID Char(8) Bdy(Word), /* Thread ID                 @D6A*/ 02728000
*    3 OdmvThdTcb   Ptr(31),        /* TCB address               @D6A*/ 02729000
*    3 OdmvThdJobName  Char(8),     /* Primary Address space job        02730000
*                                      name, if primary ^= home,        02731000
*                                      otherwise blanks          @D6A*/ 02732000
*    3 OdmvThdUserName Char(8),     /* User name if a task level        02733000
*                                      security environment created by  02734000
*                                      pthread_security_np exists,      02735000
*                                      otherwise blanks          @D6A*/ 02736000
*    3 OdmvThdSysCall Fixed(32),    /* Syscall code              @D6A*/ 02737000
*    3 OdmvThdTTime Bit(64),        /* TCB's accumulated CPU time       02738000
*                                                                @D6A*/ 02739000
*    3 OdmvThdTag   Char(65),       /* Tag data                  @D6A*/ 02740000
*    3 OdmvThdStatus1 Char(1),      /* Pthread created/Dubbed    @D6A*/ 02741000
*    3 OdmvThdStatus2 Char(1),      /* Wait/Running status       @D6A*/ 02742000
*    3 OdmvThdStatus3 Char(1),      /* Creation type             @D6A*/ 02743000
*    3 OdmvThdStatus4 Char(1),      /* Detached/undetached       @D6A*/ 02744000
*    3 OdmvThdStatus5 Char(1),      /* Ptrace held               @D6A*/ 02745000
*    3 OdmvThdFlags   Bit(8),       /* Thread flags              @D6A*/ 02746000
*      5 OdmvThdTagSet Bit(1),      /* Thread has tag data       @D6A*/ 02747000
*    3 OdmvReserved06 Char(1),      /* Reserved                  @D6A*/ 02748000
*    3 OdmvThdBrl,                  /* Byte Range Lock Waiter Data   */ 02749000
*                                   /* valid for OdmvBrl only    @DHA*/ 02750000
*      5 OdmvThdBrlDevNo Fixed(32), /* Dev # of BRL Wait File    @DHA*/ 02751000
*      5 OdmvThdBrlINo   Fixed(32), /* Inode # of BRL Wait File  @DHA*/ 02752000
*      5 OdmvThdBrlOwnerPid Fixed(32), /* BRL Wait FileOwner PID @DHA*/ 02753000
*      5 OdmvThdBrlFile  Char(16),  /* BRL Wait File Name        @DHA*/ 02754000
*                                                              /*@DHA*/ 02755000
*    3 OdmvReservedData2,   /* For BRLM usage only               @DHA*/ 02756000
*                                                                       02757000
*      5 OdmvThdBrlOfte  Ptr(31), /* No longer used         @DYC @DHA*/ 02758000
*      5 OdmvThdBrlVnod  Ptr(31), /* For use in frbrl getlk call @DHA*/ 02759000
*      5 *                Char(4), /*Reserved added for alignment@PFA*/ 02760000
*      5 OdmvThdBrlReqPtr Ptr(64) BDY(Word),            /*  @ENC @E4A*/ 02761000
*      5 OdmvThdBrlSysName Char(8),/* System of blocking process @DYA*/ 02762000
*      5 OdmvThdBrlReserveData char(8),                        /*@DHA*/ 02763000
*                                        /* possible size change @DHA*/ 02764000
*                                                                       02765000
*    3 OdmvThdEnd   Char(0);        /* End of thread info        @D6A*/ 02766000
*                                                                       02767000
*/********************************************************************/ 02768000
*/*  Mapping of PFS data returned for OdmvPfsBit.                @DEC*/ 02769000
*/********************************************************************/ 02770000
*Declare                                                                02771000
*  1 OdmvPFS    Based Bdy(Word),                              /* @DEC*/ 02772000
*    3 OdmvPFSchars,                 /*  EBCDIC data                 */ 02773000
*     5 OdmvPFSName Char(8),         /*   PFS name!type from the GFS */ 02774000
*     5 OdmvPFSdescription Char(20), /*   Brief description of PFS   */ 02775000
*      7 OdmvPFSsocket Char(8),      /*    if socket, the word SOCKET*/ 02776000
*      7 OdmvPFSvfs    Char(12),     /*    if socket, AF_INET, etc.  */ 02777000
*     5 OdmvPFSentry Char(8),        /*   EntryPoint name            */ 02778000
*     5 OdmvPFSstatus Char(5),       /*   Status                     */ 02779000
*     5 OdmvPFSflags  Char(3),       /*   Flags                      */ 02780000
*     5 OdmvPFSParms  Char(165),     /*   Parameter data             */ 02781000
*      7 OdmvPFSBlank Char(1),       /*    a blank - special for HFS */ 02782000
*      7 OdmvGen07    Char(164),     /*                              */ 02783000
*     5 OdmvReserved07 Char(3),       /*  Reserved                   */ 02784000
*    3 OdmvPFSnums,                  /*  NUMERIC data                */ 02785000
*     5 OdmvPFSMaxSock Fixed(32),    /*   MAXSOCKETS                 */ 02786000
*     5 OdmvPFSOpnSock Fixed(32),    /*   Open Sockets               */ 02787000
*     5 OdmvPFSHWMSock Fixed(32),    /*   Highwater mark         @DGA*/ 02788000
*     5 OdmvPFSParmLen Fixed(32),    /*   The length of OdmvPFSparms */ 02789000
*     5 OdmvPFSCurrentValues,        /*   Data for CURRENT VALUES    */ 02790000
*       7 OdmvPFSfixed   Fixed(32),  /*    FIXED                     */ 02791000
*       7 OdmvPFSvirtual Fixed(32),  /*    VIRTUAL                   */ 02792000
*     5 OdmvPFSRecyStatus Fixed(32), /* PFS Recycle status       @E5A*/ 02793000
*    3 OdmvPFSRecyTime  Char(8),     /* hh:mm:ss Recycle time    @E5A*/ 02794000
*     5 OdmvPFShh       Char(2),     /*  hh                      @E5A*/ 02795000
*     5 OdmvPFSDot1     Char(1),     /*  :                       @E5A*/ 02796000
*     5 OdmvPFSmm       Char(2),     /*  mm                      @E5A*/ 02797000
*     5 OdmvPFSDot2     Char(1),     /*  :                       @E5A*/ 02798000
*     5 OdmvPFSss       Char(2),     /*  ss                      @E5A*/ 02799000
*    3 OdmvPFSStartTime Char(20),    /* PFS Start time           @E9A*/ 02800000
*     5 OdmvPFSDate     Char(10),    /* Date                     @E9A*/ 02801000
*     5 *               Char(1),     /* blank space        @PDC  @E9A*/ 02802000
*     5 OdmvPFSTime     Char(8),     /* Time                     @E9A*/ 02803000
*     5 *               Char(1),     /* blank space              @E9A*/ 02804000
*    3 OdmvPFSAsName    Char(8),     /* ASName                   @E9A*/ 02805000
*    3 OdmvPFSStatusInfo,                                               02806000
*     5 OdmvPFSStLine1  Char(60),    /* PFS Status Line 1        @E9A*/ 02807000
*     5 OdmvPFSStLine2  Char(60),    /* PFS Status Line 2        @E9A*/ 02808000
*     5 OdmvPFSStLine3  Char(60);    /* PFS Status LIne 3        @E9A*/ 02809000
*                                                                       02810000
*                                                                       02811000
*/********************************************************************/ 02812000
*/*  Constants for PFS recycle status                            @E5A*/ 02813000
*/********************************************************************/ 02814000
*                                                                       02815000
* Dcl Odmv#Recycling            Constant(1);                   /*@E5A*/ 02816000
* Dcl Odmv#RecycleMounting      Constant(2);                   /*@E5A*/ 02817000
* Dcl Odmv#RecycleMountsPend    Constant(3);                   /*@E5A*/ 02818000
*                                                                       02819000
*/********************************************************************/ 02820000
*/*  Mapping of System Limit Data - Highwater and Current Usage  @DFA*/ 02821000
*/********************************************************************/ 02822000
*Declare                                                                02823000
*  1 OdmvSysL Based Bdy(Word),                              /* @DFA  */ 02824000
*     3 OdmvSysLFChanged     Bit(32),   /* Flag field for changed    */ 02825000
*                                       /* System limits             */ 02826000
*      4 OdmvSysLFByte1        Bit(8),                                  02827000
*       5 OdmvSysLFMaxProcSys  Bit(1),  /* MaxProcSys changed        */ 02828000
*       5 OdmvSysLFMaxUids     Bit(1),  /* MaxUids changed           */ 02829000
*       5 OdmvSysLFMaxPtys     Bit(1),  /* MaxPtys changed           */ 02830000
*       5 OdmvSysLFMaxMmapArea Bit(1),  /* MaxMmapArea changed       */ 02831000
*       5 OdmvSysLFMaxShrPages Bit(1),  /* MaxShrPages changed       */ 02832000
*       5 OdmvSysLFIpcMsgNids  Bit(1),  /* IpcMsgNids  changed       */ 02833000
*       5 OdmvSysLFIpcSemNids  Bit(1),  /* IpcSemNids  changed       */ 02834000
*       5 OdmvSysLFIpcShmNids  Bit(1),  /* IpcShmNids  changed       */ 02835000
*      4 OdmvSysLFByte2        Bit(8),                                  02836000
*       5 OdmvSysLFIpcShmSPages Bit(1), /* IpcShmSPages changed      */ 02837000
*       5 OdmvSysLFIpcMsgQBytes Bit(1),                                 02838000
*       5 OdmvSysLFIpcMsgQMNum  Bit(1),                                 02839000
*       5 OdmvSysLFIpcShmMPages Bit(1),                                 02840000
*       5 OdmvSysLFShrLibRgnSize Bit(1),/* ShrLibRgnSize changed     */ 02841000
*       5 OdmvSysLFShrLibMaxPages Bit(1),/* ShrLibMaxPages changed   */ 02842000
*       5 OdmvSysLFMaxUsrMntSys Bit(1),  /* MAXUSERMOUNTSYS changed     02843000
*                                                                @ECA*/ 02844000
*       5 OdmvSysLFMaxUsrMntUsr Bit(1),  /* MAXUSERMOUNTUSER changed    02845000
*                                                                @ECA*/ 02846000
*      4 OdmvSysLFByte3        Bit(8),                                  02847000
*      4 OdmvSysLFByte4        Bit(8),                                  02848000
*     3 OdmvSysLMaxProcSysC  Fixed(32), /* Current # of processes    */ 02849000
*     3 OdmvSysLMaxProcSysH  Fixed(32), /* Highwater # of processes  */ 02850000
*     3 OdmvSysLMaxUidsC     Fixed(32), /* Current # of userids      */ 02851000
*     3 OdmvSysLMaxUidsH     Fixed(32), /* Highwater # of userids    */ 02852000
*     3 OdmvSysLMaxPtysC     Fixed(32), /* Current # of ptys in use  */ 02853000
*     3 OdmvSysLMaxPtysH     Fixed(32), /* Highwater # of ptys in use*/ 02854000
*     3 OdmvSysLMaxMmapAreaC Fixed(32), /* Current # of mmap pages   */ 02855000
*     3 OdmvSysLMaxMmapAreaH Fixed(32), /* Highwater # of mmap pages */ 02856000
*     3 OdmvSysLMaxShrPagesC Fixed(32), /* Current # of shared pages */ 02857000
*     3 OdmvSysLMaxShrPagesH Fixed(32), /* Highwater # of shared pages  02858000
*                                                                    */ 02859000
*     3 OdmvSysLIpcMsgNidsC  Fixed(32), /* Current # of message queue   02860000
*                                          IDs in use                */ 02861000
*     3 OdmvSysLIpcMsgNidsH  Fixed(32), /* Highwater # of message queue 02862000
*                                          IDs in use                */ 02863000
*     3 OdmvSysLIpcSemNidsC  Fixed(32), /* Current # of semaphore       02864000
*                                          IDs in use                */ 02865000
*     3 OdmvSysLIpcSemNidsH  Fixed(32), /* Highwater # of semaphore     02866000
*                                          IDs in use                */ 02867000
*     3 OdmvSysLIpcShmNidsC  Fixed(32), /* Current # of shared memory   02868000
*                                          IDs in use                */ 02869000
*     3 OdmvSysLIpcShmNidsH  Fixed(32), /* Highwater # of shared memory 02870000
*                                          IDs in use                */ 02871000
*     3 OdmvSysLIpcShmSPagesC Fixed(32),/* Current # of shared memory   02872000
*                                          pages in use              */ 02873000
*     3 OdmvSysLIpcShmSPagesH Fixed(32),/* Highwater # of shared memory 02874000
*                                          pages in use              */ 02875000
*     3 OdmvSysLIpcMsgQBytesH Fixed(32),/* Highwater # of bytes used in 02876000
*                                          a msg queue for process   */ 02877000
*     3 OdmvSysLIpcMsgQBytesM Fixed(32),/* Maximum # of bytes allowed   02878000
*                                          in a msg queue for process*/ 02879000
*                                                                       02880000
*     3 OdmvSysLIpcMsgQMNumH  Fixed(32),/* Highwater # of msgs used in  02881000
*                                          a msg queue for process   */ 02882000
*     3 OdmvSysLIpcMsgQMNumM  Fixed(32),/* Maximum # of msgs allowed    02883000
*                                          in a msg queue for process*/ 02884000
*     3 OdmvSysLIpcShmMPagesH Fixed(32),/* Highwater # of shr mem pages 02885000
*                                          in a segment for process  */ 02886000
*     3 OdmvSysLIpcShmMPagesM Fixed(32),/* Maximum # of shr mem pages   02887000
*                                     allowed in segment for process */ 02888000
*     3 OdmvSysLShrLibRgnSizeC Fixed(32),/* Current usage of system     02889000
*                                          shared library region     */ 02890000
*     3 OdmvSysLShrLibRgnSizeH Fixed(32),/* Highwater usage of system   02891000
*                                          shared library region     */ 02892000
*     3 OdmvSysLShrLibMaxPagesC Fixed(32),/* Current # of pages of user 02893000
*                                          shared library region     */ 02894000
*     3 OdmvSysLShrLibMaxPagesH Fixed(32),/* Highwater # of pages of    02895000
*                                          user shared library pgms  */ 02896000
*     3 OdmvSysLIpcShmMPagesMBM Fixed(32),/* Maximum # of shr mem pages 02897000
*                                     allowed in segment for process    02898000
*                                     in BinMult form            @DPA*/ 02899000
*     3 OdmvSysLMaxUsrMntSysCur Fixed(32),/* Current # of               02900000
*                                               MAXUSERMOUNTSYS  @ECA*/ 02901000
*     3 OdmvSysLMaxUsrMntSysHw  Fixed(32),/* HighWater mark of          02902000
*                                               MAXUSERMOUNTSYS  @ECA*/ 02903000
*     3 OdmvSysLMaxUsrMntUsrCur Fixed(32),/* Current # of               02904000
*                                               MAXUSERMOUNTUSER @ECA*/ 02905000
*     3 OdmvSysLMaxUsrMntUsrHw  Fixed(32),/* HighWater mark of          02906000
*                                               MAXUSERMOUNTUSER @ECA*/ 02907000
*     3 OdmvSysLMaxPipesLmt     Fixed(32),/* MAXPIPES Limit             02908000
*                                            needed here because not    02909000
*                                            a BPXPRMxx option   @EGA*/ 02910000
*     3 OdmvSysLMaxPipesCur     FIXED(32),/* Current usage of Pipe      02911000
*                                            PFS Queues          @EGA*/ 02912000
*     3 OdmvSysLMaxPipesHw      FIXED(32);/* Highwater usage of Pipe    02913000
*                                            PFS Queues          @EGA*/ 02914000
*                                                                       02915000
*/********************************************************************/ 02916000
*/*  Mapping of Process Limit Data -                             @DFA*/ 02917000
*/*           Highwater, Maximum  and Current Usage              @DFA*/ 02918000
*/*                                                              @DFA*/ 02919000
*/* RESERVED field will not be filled with valid data]           @DFA*/ 02920000
*/********************************************************************/ 02921000
*Declare                                                                02922000
*  1 OdmvPrcL Based Bdy(Word),                                 /*@DFA*/ 02923000
*     3 OdmvPrcLFChanged     Bit(32),   /* Flag field for changed    */ 02924000
*                                       /* process limits            */ 02925000
*      4 OdmvPrcLFByte1        Bit(8),                                  02926000
*       5 OdmvPrcLFMaxAsSize   Bit(1),  /* RESERVED MaxAsSize changed*/ 02927000
*       5 OdmvPrcLFMaxCpu      Bit(1),  /* RESERVED MaxCpu    changed*/ 02928000
*       5 OdmvPrcLFMaxFileProc Bit(1),  /* MaxFileProc changed       */ 02929000
*       5 OdmvPrcLFMaxProcUser Bit(1),  /* MaxProcUser changed       */ 02930000
*       5 OdmvPrcLFMaxQueuedSigs Bit(1),/* MaxQueuedSigs changed     */ 02931000
*       5 OdmvPrcLFMaxThreads    Bit(1),/* MaxThreads changed        */ 02932000
*       5 OdmvPrcLFMaxThreadTasks Bit(1),/* MaxThreadTasks changed   */ 02933000
*       5 OdmvPrcLFIpcShmNSegs  Bit(1), /* IpcShmNSegs  changed      */ 02934000
*      4 OdmvPrcLFByte2         Bit(8),                                 02935000
*       5 OdmvPrcLFCoreSizSBin  Bit(1), /* Soft Core   value is bin  */ 02936000
*       5 OdmvPrcLFMaxFileSize  Bit(1), /* MaxFileSize changed       */ 02937000
*       5 OdmvPrcLFMaxMemLimit  Bit(1), /* MaxMemLimit changed       */ 02938000
*       5 OdmvPrcLFMaxMLimitSet Bit(1), /* Set MaxMemLimit           */ 02939000
*       5 OdmvPrcLFMaxMemLSBin  Bit(1), /* Soft MLimit value is bin  */ 02940000
*       5 OdmvPrcLFMaxMemLHBin  Bit(1), /* Hard MLimit value is bin  */ 02941000
*       5 OdmvPrcLFMaxCoreSize  Bit(1), /* MaxCoreSize changed       */ 02942000
*      4 OdmvPrcLFByte3         Bit(8),                                 02943000
*       5 OdmvPrcLFCoreSizHBin  Bit(1), /* Hard Core   value is bin  */ 02944000
*      4 OdmvPrcLFByte4         Bit(8),                                 02945000
*                                                                       02946000
*     3 OdmvPrcLMaxAsSizeC   Fixed(32), /* RESERVED Current user region 02947000
*                                          usage for address space   */ 02948000
*     3 OdmvPrcLMaxAsSizeH   Fixed(32), /* RESERVED Highw. user region  02949000
*                                          usage for address space   */ 02950000
*     3 OdmvPrcLMaxAsSizeM   Fixed(32), /* RESERVED Max. user region    02951000
*                                          size for address space    */ 02952000
*                                                                       02953000
*     3 OdmvPrcLMaxCpuC      Fixed(32), /* RESERVED Current CPU usage   02954000
*                                          for address space         */ 02955000
*     3 OdmvPrcLMaxCpuH      Fixed(32), /* RESERVED Highwater CPU usage 02956000
*                                          for address space         */ 02957000
*     3 OdmvPrcLMaxCpuM      Fixed(32), /* RESERVED Max. CPU usage      02958000
*                                          for address space         */ 02959000
*                                                                       02960000
*     3 OdmvPrcLMaxFileProcC Fixed(32), /* Current # of files in use    02961000
*                                          for process               */ 02962000
*     3 OdmvPrcLMaxFileProcH Fixed(32), /* Highwater # of files in use  02963000
*                                          for process               */ 02964000
*     3 OdmvPrcLMaxFileProcMSL Fixed(32), /* Soft Maximum # of files    02965000
*                                          allowed for process       */ 02966000
*     3 OdmvPrcLMaxFileProcMHL Fixed(32), /* Hard Maximum # of files    02967000
*                                          allowed for process       */ 02968000
*                                                                       02969000
*     3 OdmvPrcLMaxFileSizeMSL Fixed(31), /* Soft Maximum size of files 02970000
*                                          allowed for process       */ 02971000
*     3 OdmvPrcLMaxFileSizeMHL Fixed(31), /* Hard Maximum size of files 02972000
*                                          allowed for process       */ 02973000
*                                                                       02974000
*     3 OdmvPrcLMaxProcUserC Fixed(32), /* Current # of processes for   02975000
*                                          user                      */ 02976000
*     3 OdmvPrcLMaxProcUserH Fixed(32), /* Highwater # of processes for 02977000
*                                          user                      */ 02978000
*     3 OdmvPrcLMaxProcUserM Fixed(32), /* Maximum # of processes       02979000
*                                          allowed for user          */ 02980000
*                                                                       02981000
*     3 OdmvPrcLMaxQueuedSigsC Fixed(32),/* Current # of queued signals 02982000
*                                          for process               */ 02983000
*     3 OdmvPrcLMaxQueuedSigsH Fixed(32),/* Highwater # of queued sigs  02984000
*                                          for process               */ 02985000
*     3 OdmvPrcLMaxQueuedSigsM Fixed(32),/* Maximum # of queued signals 02986000
*                                          for process               */ 02987000
*                                                                       02988000
*     3 OdmvPrcLMaxThreadsC  Fixed(32), /* Current # of threads         02989000
*                                          for process               */ 02990000
*     3 OdmvPrcLMaxThreadsH  Fixed(32), /* Highwater # of threads       02991000
*                                          for process               */ 02992000
*     3 OdmvPrcLMaxThreadsM  Fixed(32), /* Maximum # of threads         02993000
*                                          for process */               02994000
*     3 OdmvPrcLMaxThreadTasksC  Fixed(32), /* Current # of thd tasks   02995000
*                                          for process               */ 02996000
*     3 OdmvPrcLMaxThreadTasksH  Fixed(32), /* Highwater # of thd tasks 02997000
*                                          for process               */ 02998000
*     3 OdmvPrcLMaxThreadTasksM  Fixed(32), /* Maximum # of thd tasks   02999000
*                                          for process               */ 03000000
*     3 OdmvPrcLIpcShmNSegsC  Fixed(32),/* Current # of shr mem allowed 03001000
*                                          segments in a process  */    03002000
*     3 OdmvPrcLIpcShmNSegsH  Fixed(32),/* Highwater shr mem allowed    03003000
*                                          segments in a process */     03004000
*     3 OdmvPrcLIpcShmNSegsM  Fixed(32),/* Maximum # of shr mem allowed 03005000
*                                          segments in a process */     03006000
*                                                                       03007000
*                                                                       03008000
*     3 OdmvPrcLMaxCoreSizeMSL Fixed(31),/* Max Size core dumps SOFT */ 03009000
*                               /* See OdmvPrcLFCoreSizSBin,         */ 03010000
*                               /*  off - fullword Binary value,     */ 03011000
*                               /*  on  - binary value with a        */ 03012000
*                               /*        multiplier             @DLA*/ 03013000
*     3 OdmvPrcLMaxCoreSizeMHL Fixed(31),/* Max Size core dumps HARD */ 03014000
*                               /* See OdmvPrcLFCoreSizHBin,         */ 03015000
*                               /*  off - fullword Binary value,     */ 03016000
*                               /*  on  - binary value with a        */ 03017000
*                               /*        multiplier             @DLA*/ 03018000
*     3 OdmvPrcLMaxMemlimitCdw, /* Current process memlimit      @DLA*/ 03019000
*       5 OdmvPrcLMaxMemLimitCH    Fixed(32),                 /* @DLA*/ 03020000
*       5 OdmvPrcLMaxMemLimitCL    Fixed(32),                 /* @DLA*/ 03021000
*     3 OdmvPrcLMaxMemLimitHdw, /* High process memlimit         @DLA*/ 03022000
*       5 OdmvPrcLMaxMemLimitHH    Fixed(32),                 /* @DLA*/ 03023000
*       5 OdmvPrcLMaxMemLimitHL    Fixed(32),                 /* @DLA*/ 03024000
*     3 OdmvPrcLMaxMemLimitMdws Fixed(32) Bdy(Word),                    03025000
*                               /* asid memlimit soft                */ 03026000
*                               /* See OdmvPrcLFMaxMemLSBin,         */ 03027000
*                               /*  off - fullword Binary value,     */ 03028000
*                               /*  on  - binary value with a        */ 03029000
*                               /*        multiplier             @DLA*/ 03030000
*       5 OdmvPrcLMaxMemLimitMdwsBin Fixed(24) Bdy(Byte),               03031000
*                                               /* binary value  @DLA*/ 03032000
*       5 OdmvPrcLMaxMemLimitMdwsM  Char(1),   /* Multiplier     @DLA*/ 03033000
*     3 OdmvPrcLMaxMemLimitMdwh Fixed(32) Bdy(Word),                    03034000
*                               /* asid memlimit hard                */ 03035000
*                               /* See OdmvPrcLFMaxMemLSBin,         */ 03036000
*                               /*  off - fullword Binary value,     */ 03037000
*                               /*  on  - binary value with a        */ 03038000
*                               /*        multiplier             @DLA*/ 03039000
*       5 OdmvPrcLMaxMemLimitMdwhBin Fixed(24) Bdy(Byte),               03040000
*                                               /* binary value  @DLA*/ 03041000
*       5 OdmvPrcLMaxMemLimitMdwhM  Char(1),   /* Multiplier     @DLA*/ 03042000
*     3 OdmvMaxFileSizeMHLBinM Fixed(32) Bdy(Word),                     03043000
*                               /* BinMult version of MaxFileSize    */ 03044000
*                               /* hardlimit. Valid only if equal to */ 03045000
*                               /* OdmvPrcLMaxFileSizeMHL. This is   */ 03046000
*                               /* how it was entered via SETOMVS.   */ 03047000
*                               /*                               @DPA*/ 03048000
*     3 OdmvMaxFileSizeMSLBinM Fixed(32) Bdy(Word),                     03049000
*                               /* BinMult version of MaxFileSize    */ 03050000
*                               /* softlimit. Valid only if equal to */ 03051000
*                               /* OdmvPrcLMaxFileSizeMSL. This is   */ 03052000
*                               /* how it was entered via SETOMVS.   */ 03053000
*                               /*                               @DPA*/ 03054000
*     3 *             Char(20); /* Reserved for future use       @DPA*/ 03055000
*                                                                       03056000
*                                                                       03057000
*                                                                       03058000
*/********************************************************************/ 03059000
*/*  Mapping of Extended Options Data                           @DIA */ 03060000
*/********************************************************************/ 03061000
*                                                                       03062000
*Declare                                                                03063000
*  1 OdmvExtOptionsData Based Bdy(Word),                       /*@DIA*/ 03064000
*    3 OdmvResProcLen     Fixed(31),     /* Length of String     @DIA*/ 03065000
*    3 OdmvResProcName    Char(8),       /* Name of Resolver started    03066000
*                                           procedure or NONE/RESOLVER  03067000
*                                                                @DIA*/ 03068000
*    3   OdmvMaxFileSizeBinM Fixed(32),/* MaxFileSize BinMult    @T0M*/ 03069000
*      5 OdmvMaxFileSizeBin  Fixed(24) Bdy(Byte),                       03070000
*                                      /* Bin part of BinMult    @T0M*/ 03071000
*      5 OdmvMaxFileSizeM   Char(1),   /* Multiplier part of BinM@T0M*/ 03072000
*    3   OdmvMaxCoreSizeBinM Fixed(32),/* MaxCoreSize BinMult    @T0M*/ 03073000
*      5 OdmvMaxCoreSizeB    Fixed(24) Bdy(Byte),                       03074000
*                                      /* Bin part of BinMult    @T0M*/ 03075000
*      5 OdmvMaxCoreSizeM   Char(1),   /* Multiplier part of BinM@T0M*/ 03076000
*    3   OdmvMaxAsSizeBinM   Fixed(32),/* MaxASSize BinMult      @T0M*/ 03077000
*      5 OdmvMaxASSizeBin    Fixed(24) Bdy(Byte),                       03078000
*                                      /* Bin part of BinMult    @T0M*/ 03079000
*      5 OdmvMaxAsSizeM     Char(1),   /* Multiplier part of BinM@T0M*/ 03080000
*    3   OdmvMaxMMapAreaBinM Fixed(32),/* MaxMMapArea BinMult    @T0M*/ 03081000
*      5 OdmvMaxMMapAreaBin  Fixed(24) Bdy(Byte),                       03082000
*                                      /* Bin part of BinMult    @T0M*/ 03083000
*      5 OdmvMaxMMapAreaM   Char(1),   /* Multiplier part of BinM@T0M*/ 03084000
*    3   OdmvMaxShrPagesBinM Fixed(32),/* MaxShrPages BinMult    @T0M*/ 03085000
*      5 OdmvMaxShrPagesBin  Fixed(24) Bdy(Byte),                       03086000
*                                      /* Bin part of BinMult    @T0M*/ 03087000
*      5 OdmvMaxShrPagesM   Char(1),   /* Multiplier part of BinM@T0M*/ 03088000
*    3 OdmvMaxShmSpagesBM Fixed(32),   /* MaxIPCSHMSPages BinMult@T0M*/ 03089000
*      5 OdmvMaxShmSpagesBin Fixed(24) Bdy(Byte),                       03090000
*                                      /* Bin part of BinMult    @T0M*/ 03091000
*      5 OdmvMaxShmSpagesM Char(1),    /* Multiplier part of BinM@T0M*/ 03092000
*    3 OdmvMaxShmMpagesBM Fixed(32),   /* MaxIPCSHMMPages BinMult@T0M*/ 03093000
*      5 OdmvMaxShmMpagesBin Fixed(24) Bdy(Byte),                       03094000
*                                      /* Bin part of BinMult    @T0M*/ 03095000
*      5 OdmvMaxShmMpagesM Char(1),    /* Multiplier part of BinM@T0M*/ 03096000
*    3 OdmvAltRootFS       Char(44),   /* ALTROOT FS Name        @E8A*/ 03097000
*    3 OdmvUserMntsSysLimit Fixed(32), /* USERMOUNTS - Sys Limit @EAA*/ 03098000
*    3 OdmvUserMntsUsrLimit Fixed(32), /* USERMOUNTS - Usr Limit @EAA*/ 03099000
*    3 OdmvNonEmptyMntPt    Fixed(8),  /* NONEMPTYMOUNTPT        @EAA*/ 03100000
*    3 *                    Char(3),   /* Reserved               @EKA*/ 03101000
*    3 OdmvMaxPipeUser      Fixed(31), /* MAXPIPEUSER            @EKA*/ 03102000
*    3 OdmvSCExitsTableLen Fixed(8),   /* Length of table name   @ESA*/ 03103000
*    3 OdmvSCExitsTable    Char(255);  /* Name of ScExits table  @ESA*/ 03104000
*                                                                       03105000
*/********************************************************************/ 03106000
*/*  Mapping of IPV6 Cinet Data                                 @T1A */ 03107000
*/********************************************************************/ 03108000
*                                                                       03109000
*Declare                                                                03110000
*  1 OdmvIpv6  Based Bdy(Word),        /* IPV6 Data              @T1A*/ 03111000
*    3 OdmvCinetHomeCnt6 Fixed(31),    /* Number of CINET6 home. @T1A*/ 03112000
*    3 OdmvCinetHostCnt6 Fixed(31),    /* Number of CINET6 host. @T1A*/ 03113000
*    3 OdmvCinetNetwCnt6 Fixed(31),    /* Number of CINET6 net.  @T1A*/ 03114000
*    3  OdmvCinet6Ptr    Ptr(31);      /* Ptr to the first OdmvCinet6*/ 03115000
*                                      /* in OdmvOutPut area.    @T1A*/ 03116000
*                                                                       03117000
*/********************************************************************/ 03118000
*/* Declare Constants for the PFS output data:                       */ 03119000
*/********************************************************************/ 03120000
*Declare                                                                03121000
*  OdmvPfs#hfs   Constant('HFS     ') Char(8);                /* @DAA*/ 03122000
*                                                                       03123000
*/********************************************************************/ 03124000
*/*  Mapping of CINET data returned for OdmvCinetTp or OdmvCinetAll  */ 03125000
*/*  For IPV4 Addresses.                                             */ 03126000
*/********************************************************************/ 03127000
*Declare                                                                03128000
*  1 OdmvCinet  Based Bdy(Word),                            /* 12@DBA*/ 03129000
*     3 OdmvCinetETpName Char(8),    /*  Tp name                     */ 03130000
*     3 OdmvCinetHome@  Char(12),    /*  Home IP address in EBCDIC   */ 03131000
*      5 *              Char(8),     /*  Not Specified           @PAA*/ 03132000
*      5 OdmvCinetRType Char(4),     /*  Host and Net route Type @PAA*/ 03133000
*     3 OdmvCinetHost@  Char(12),    /*  Host IP address in EBCDIC   */ 03134000
*     3 OdmvCinetNetw@  Char(12),    /*  Net  IP address in EBCDIC   */ 03135000
*     3 OdmvCinetMask   Char(12),    /*  Net Mask in EBCDIC          */ 03136000
*     3 OdmvCinetMetric Fixed(32),   /*  Metric                      */ 03137000
*     3 OdmvCinetFlags  Char(3)  ,   /*  Flags                       */ 03138000
*     3 OdmvReserved08  Bit(8)   ,   /*  Reserved                    */ 03139000
*       5 *             Bit(7),      /*  Reserved                @E0A*/ 03140000
*       5 OdmvCinetHIFActive Bit(1), /*  On=active Off=Inactive  @E0A*/ 03141000
*     3 OdmvCinetHomeIF@ Fixed(32);  /*  Home Interface @ in Hex @E0A*/ 03142000
*                                                                       03143000
*                                                                       03144000
*/********************************************************************/ 03145000
*/*  Mapping of CINET data returned for OdmvCinetTp or OdmvCinetAll  */ 03146000
*/*  For IPV6 Addresses.                                             */ 03147000
*/********************************************************************/ 03148000
*Declare                                                                03149000
*  1 OdmvCinet6 Based Bdy(Word),                            /* 12@T1A*/ 03150000
*     3 OdmvCinet6ETpName Char(8),   /*  Tp name                     */ 03151000
*     3 OdmvCinet6IPV6@  Char(32),   /*  IPV6 Address in EBCDIC      */ 03152000
*     3 OdmvCinet6Plen   Char(12),   /*  Net Prefix Length           */ 03153000
*     3 OdmvCinet6Metric Fixed(32),  /*  Metric                      */ 03154000
*     3 OdmvCinet6Flags  Char(3)  ,  /*  Flags for display           */ 03155000
*     3 OdmvCinet6Bits   Bit(8),     /*  Flags for testing           */ 03156000
*      5 *                Bit(5),                                       03157000
*      5 OdmvCinet6Home   Bit(1),    /*  Home route                  */ 03158000
*      5 OdmvCinet6Host   Bit(1),    /*  Host route                  */ 03159000
*      5 OdmvCinet6Net    Bit(1),    /*  Net  route                  */ 03160000
*     3 OdmvCinet6RType  Char(4),    /*  Host and Net Route Type @PAA*/ 03161000
*     3 *                Char(4);    /* Must be as long as OdmvCinet */ 03162000
*                                                                       03163000
*Declare                                                                03164000
* OdmvCinet6_#Len Constant(Length(OdmvCinet6));                         03165000
*                                                                       03166000
*/********************************************************************/ 03167000
*/*  Mapping of Serialization Header Area                       @DRA */ 03168000
*/********************************************************************/ 03169000
*Declare                                                                03170000
*  1 OdmvSerHdr Based Bdy(Word),       /* Serialization Header   @DRA*/ 03171000
*    3 OdmvSerVerNum     Fixed(31),    /* Version Number Of SER Data    03172000
*                                                                @DRA*/ 03173000
*    3 OdmvSerResCnt     Fixed(31),    /* Number of resources    @DRA*/ 03174000
*    3 OdmvSerResPtr     Ptr(31);      /* Ptr to the first OdmvSerObj   03175000
*                                         structure.  Each Subsequent   03176000
*                                         odmvSerObj element follows    03177000
*                                         sequentially in storage       03178000
*                                         after the last OdmvSerReq     03179000
*                                         entry for the prior           03180000
*                                         OdmvSerObj element.    @DRA*/ 03181000
*                                                                       03182000
*/********************************************************************/ 03183000
*/*  Mapping of OdmvSerObj, one OdmvSerObj is returned for each      */ 03184000
*/*  serialization object reported on via ODMVSER           */          03185000
*/********************************************************************/ 03186000
*Declare                                                                03187000
*  1 OdmvSerObj    Based Bdy(Word),                         /* 12@DRA*/ 03188000
*     3 OdmvSerType      Char(8),    /*  Resource Type               */ 03189000
*     3 OdmvSerReqCnt   Fixed(32),   /*  Number of requestor entries */ 03190000
*     3 OdmvSerLocId    Fixed(32),   /*  Resource Location, for a Mutex 03191000
*                                        or Condvar this will be a      03192000
*                                        shared memory ID            */ 03193000
*     3 OdmvSerAddr,                 /*  Resource Address, for a Mutex  03194000
*                                        or Condvar this will be a      03195000
*                                        shared memory segment offset*/ 03196000
*      5 OdmvSerAddrHi  Ptr(31),     /*  High end of address         */ 03197000
*      5 OdmvSerAddrLo  Ptr(31),     /*  Low  end of address         */ 03198000
*     3 OdmvSerLocIdA   Fixed(32),   /*  Resource Location - For a      03199000
*                                        Condvar this will be the       03200000
*                                        associated mutex's             03201000
*                                        shared memory ID            */ 03202000
*     3 OdmvSerAddrA,                /*  Resource Address  - For a      03203000
*                                        Condvar this will be the       03204000
*                                        associated mutex's             03205000
*                                        shared memory segment offset*/ 03206000
*      5 OdmvSerAddrHiA Ptr(31),     /*  High end of address         */ 03207000
*      5 OdmvSerAddrLoA Ptr(31),     /*  Low  end of address         */ 03208000
*     3 OdmvSerReqPtr   Ptr(31);     /*  Ptr to the 1st OdmvSerReq area 03209000
*                                        Subsequent OdmvSerReq areas    03210000
*                                        following sequentially in      03211000
*                                        storage.                    */ 03212000
*                                                                       03213000
*/********************************************************************/ 03214000
*/*  Mapping of nonprivileged user mount table.                      */ 03215000
*/********************************************************************/ 03216000
*Declare                                                    /*  6@ECA*/ 03217000
*  1 OdmvUmTbHdr   BASED  Bdy(Word),    /* Header of nonprivileged      03218000
*                                             user mounts table      */ 03219000
*   3 OdmvUmTbEleCnt Fixed(32),       /* +00 Number of elements         03220000
*                                                in OdmvUmTbElemnt   */ 03221000
*   3 OdmvUmTbArrayPtr Ptr(31);       /* +04 Address of nonprivileged   03222000
*                                                user mounts table   */ 03223000
*                                                                       03224000
*Declare                                                     /* 8@ECA*/ 03225000
*  1 OdmvUmTbElemnt(0:*) BASED Bdy(Word),/* Nonprivileged user mounts   03226000
*                                            table. Element(0) is for   03227000
*                                            the privileged user mnts*/ 03228000
*   3 OdmvUmTbUID    Fixed(32),        /* +00 UID who did mounts     */ 03229000
*   3 OdmvUmTbCounts Fixed(32);        /* +04 number of file systems */ 03230000
*                                                                       03231000
*/********************************************************************/ 03232000
*/*  Mapping of PIPE Summary Structures D OMVS,PIPES                 */ 03233000
*/********************************************************************/ 03234000
*Declare                                                       /*@EGA*/ 03235000
*  1 OdmvPipeSumHdr BASED  Bdy(Word), /* Header of PIPE usage           03236000
*                                        summary information         */ 03237000
*   3 OdmvPshEleCnt Fixed(31),        /* +00 Number of elements         03238000
*                                            in OdmvPipeSumElemnt    */ 03239000
*   3 OdmvPshEleTabPtr Ptr(31),       /* +04 Address of Pipe            03240000
*                                            summary usage table     */ 03241000
*   3 OdmvPshFlags  Fixed(32),        /* +08 Control information     */ 03242000
*     5 OdmvPshHwUsage Bit(1),        /*     1-indicates first element  03243000
*                                              in the table is the      03244000
*                                              HIGHWATER USER info      03245000
*                                            0-indicates no             03246000
*                                              HIGHWATER USER info      03247000
*                                              in the table. (Most      03248000
*                                              likely due to a RESET */ 03249000
*   3 OdmvPshMaxPipeUser Fixed(31);   /* +0C MAXPIPEUSER value   @EKA*/ 03250000
*                                                                       03251000
*Declare                                                     /* 8@ECA*/ 03252000
*  1 OdmvPipeSumElemnt(*) BASED Bdy(Word),/* Pipe Summary Usage         03253000
*                                            information.  Element(1)   03254000
*                                            is the HIGHWATER USER      03255000
*                                            info if OdmvPshHwUsage     03256000
*                                            is set                  */ 03257000
*   3 OdmvPseUID     Fixed(32),        /* +00 Real UID of creator    */ 03258000
*   3 OdmvPseActCnt  Fixed(16),        /* +04 Current pipe usage     */ 03259000
*   3 OdmvPseHwCnt   Fixed(16),        /* +06 Highwater usage        */ 03260000
*   3 OdmvPseUserId  Char(8);          /* +08 USERID of pipe creator */ 03261000
*                                                                       03262000
*Declare                                                       /*@EHA*/ 03263000
*  1 OdmvPipeUidHdr BASED  Bdy(Word), /* Header of PIPE usage detailed  03264000
*                                        UID (PIPES,U=) info         */ 03265000
*   3 OdmvPuTotCnt Fixed(31),         /* +00 Total pipe usage for       03266000
*                                            the specified UID       */ 03267000
*   3 OdmvPuEleCnt Fixed(31),         /* +04 Number of elements         03268000
*                                            in OdmvPipeUidElemnt    */ 03269000
*   3 OdmvPuEleTabPtr Ptr(31),        /* +08 Address of Pipe            03270000
*                                            UID usage table         */ 03271000
*   3 OdmvPuFlags   Bit(32),          /* +0C Control flags           */ 03272000
*     5 OdmvPuMore Bit(01);           /*     PID entries excluded due   03273000
*                                            to table size limit     */ 03274000
*                                                                       03275000
*Declare                                                      /* @EHA*/ 03276000
*  1 OdmvPipeUidElemnt(*) BASED Bdy(Word),/* Pipe UID Usage             03277000
*                                            information.            */ 03278000
*   3 OdmvPuPID      Fixed(32),        /* +00 Process ID             */ 03279000
*   3 OdmvPuActCnt   Fixed(31),        /* +04 Current PID pipe usage */ 03280000
*   3 OdmvPuSysName  Char(8);          /* +08 System NAME associated    03281000
*                                             with this PID          */ 03282000
*Declare                                                                03283000
*    OdmvPipeUid#MaxEnt Fixed(32) Constant(10); /* Maximum number       03284000
*                                    of OdmvPipeUidElemnt s      @EHA*/ 03285000
*                                                                       03286000
*/********************************************************************/ 03287000
*/* Declare Constants for the OdmvSer Output data:                   */ 03288000
*/********************************************************************/ 03289000
*Declare                                                                03290000
*  OdmvSer#Mutex Constant('MUTEX   ') Char(8);                /* @DRA*/ 03291000
*                                                                       03292000
*Declare                                                                03293000
*  OdmvSer#Condvar Constant('CONDVAR ') Char(8);              /* @DRA*/ 03294000
*                                                                       03295000
*Declare                                                                03296000
*  OdmvSerVer#01     Fixed(31) Constant(1);                   /* @DRA*/ 03297000
*                                                                       03298000
*                                                                       03299000
*/********************************************************************/ 03300000
*/*  Mapping of OdmvSerReq returned for serialization resources fro  */ 03301000
*/*  OdmvSer.  This area describes a requestor (owner/waiter)        */ 03302000
*/*  of a serialization resource.                                    */ 03303000
*/********************************************************************/ 03304000
*Declare                                                                03305000
*  1 OdmvSerReq Based Bdy(Word),                            /* 12@DRA*/ 03306000
*     3 OdmvSerFlags    Fixed(16),   /*  Requestor Flags             */ 03307000
*      5 OdmvSerOwner   Bit(1),      /*  1=Owner of resource         */ 03308000
*      5 OdmvSerWaiter  Bit(1),      /*  1=Waiter for resource       */ 03309000
*      5 OdmvSerExc     Bit(1),      /*  1=Exclusive request         */ 03310000
*      5 OdmvSerShr     Bit(1),      /*  1=Shared request            */ 03311000
*     3 OdmvSerAsid     Fixed(16),   /*  Requestor Address Space ID  */ 03312000
*     3 OdmvSerJobName  Char(8),     /*  Requestor Jobname           */ 03313000
*     3 OdmvSerPid      Fixed(32),   /*  Requestor Process ID        */ 03314000
*     3 OdmvSerTcb      Ptr(31),     /*  Requestor Tcb Address       */ 03315000
*     3 OdmvSerUserData,             /*  Requestor User Data         */ 03316000
*      5 OdmvSerUserDataHi Ptr(31),                                     03317000
*      5 OdmvSerUserDataLo Ptr(31);                                     03318000
*                                                                       03319000
*/*--------------------------------------------------------------@DWA*/ 03320000
*/* HEADER mapping for D OMVS,WAITERS                                */ 03321000
*/*--------------------------------------------------------------@DWA*/ 03322000
*/* Since BPXZODMV now needs a constant declared in BPXZFSSH,        */ 03323000
*/* the declares for OdmvDWheader and Element were enclosed in       */ 03324000
*/* the macro code so that other includers of BPXZODMV don't break.  */ 03325000
*/*--------------------------------------------------------------@DWA*/ 03326000
*%IF Translate(BPXZODMV_WAITERS) = 'Y' %THEN               /*    @DWA*/ 03327000
*%DO;                                                      /*    @DWA*/ 03328000
*Declare                                                                03329000
* 1 OdmvDWheader Bdy(Word) Based, /*                             @DWA*/ 03330000
*  3 OdmvDWhMLHCnt    Ptr  (31),  /* 1 = There's a mount latch holder*/ 03331000
*  3 OdmvDWhMLHPtr    Ptr  (31),  /* Address of Holder's Element     */ 03332000
*  3 OdmvDWhMLWCnt    Fixed(31),  /* Number of mount latch waiters   */ 03333000
*  3 OdmvDWhMLWPtr    Ptr  (31),  /* Address of 1st Waiter's Element */ 03334000
*  3 OdmvDWhXSentCnt  Fixed(31),  /* Number of SENT xsys messages    */ 03335000
*  3 OdmvDWhXSentPtr  Ptr  (31),  /* Address of 1st "SENT" Element   */ 03336000
*  3 OdmvDWhXRecvCnt  Fixed(31),  /* Number of RECEIVED xsys msgs    */ 03337000
*  3 OdmvDWhXRecvPtr  Ptr  (31),  /* Address of 1st "RECV" Element   */ 03338000
*  3 OdmvDWhFlags     Bit  (16),  /* Header Flags            @E2C@P9C*/ 03339000
*   5 OdmvDwhFlags1    Bit ( 8),  /*  Flags Byte 1           @05A@E2D*/ 03340000
*     7 OdmvDWhSysPlex Bit ( 1),  /*   1 = Member of a Sysplex       */ 03341000
*   5 OdmvDwhFlags2    Bit ( 8),  /*  Flags Byte 2               @05A*/ 03342000
*     7 OdmvDWhdrLen  Fixed( 8),  /* Header Length not used  @05C@E2C*/ 03343000
*      9 OdmvDwhVersion Fixed(8), /* Version of waiters area     @05A*/ 03344000
*  3 OdmvDWhElen      Fixed(16),  /* Element Length, for growth  @P9A*/ 03345000
*  3 OdmvDWhVLCCnt    Fixed(31),  /* Number of Vfs latches causing   */ 03346000
*                                 /* contention                  @E2A*/ 03347000
*  3 OdmvDWhVLHPtr    Ptr  (31),  /* Address of 1st VFS holder   @E2A*/ 03348000
*  3 OdmvDWhOWTCnt    Fixed(31),/*Number of other waiting threads@E2A*/ 03349000
*  3 OdmvDWhOWTPtr    Ptr  (31),  /* Address of 1st other waiters@E2A*/ 03350000
*  3 OdmvDWhFLCCnt     Fixed(31),  /*Number of file latches causing     03351000
*                                   contention                   @EBA*/ 03352000
*  3 OdmvDWhFLHPtr    Ptr  (31);/*Address of 1st file latch holderEAA*/ 03353000
*                                                                       03354000
*Declare                                                                03355000
* OdmvDWhead_#Len Constant(Length(OdmvDWheader));             /* @DWA*/ 03356000
*                                                                       03357000
*Declare                                                                03358000
* OdmvDWhVersion#Zero Constant(0), /* Original waiters display   @05A*/ 03359000
*                                                                       03360000
* OdmvDWhVersion#One  Constant(1),/* File system latch and Other @05A*/ 03361000
*                                  /*  Waiters table             @05A*/ 03362000
*                                                                       03363000
* OdmvDWhVersion#Two  Constant(2),/* New OdmvDWeVLHLatNum var    @05A*/ 03364000
*                                                                       03365000
* OdmvDWhVersion#Three Constant(3);/* File latch holders/waiters @EBA*/ 03366000
*                                                                       03367000
*/*--------------------------------------------------------------@DWA*/ 03368000
*/* HOLDER and WAITERS mapping for D OMVS,WAITERS                    */ 03369000
*/*                                                                  */ 03370000
*/*                                                                  */ 03371000
*/* For the file system latch holders table, ODMV data will be       */ 03372000
*/* structured to contain sets of holders and waiters. There will be */ 03373000
*/* a set for each latch being held, that is causing contention.     */ 03374000
*/* Holders for a given latch will appear first followed by their    */ 03375000
*/* respective waiters.                                              */ 03376000
*/*                                                                  */ 03377000
*/* OdmvDWhVLHPTR will point to the first holder of the              */ 03378000
*/* first holder/waiter pair. OdmvDWhVLCCnt will contain the amount  */ 03379000
*/* of holder/waiter pairs. OdmvDWhVLWCnt will be set for the last   */ 03380000
*/* holder of each holder/waiter pair, and will contain the amount   */ 03381000
*/* of waiters that are waiting for this latch.                      */ 03382000
*/*                                                                  */ 03383000
*/* In the example below, OdmvDWhVLHPTR points to the first holder   */ 03384000
*/* and OdmvDWhVLCCnt has a value of 2 indicating that there are 2   */ 03385000
*/* holder/waiter pairs. The first pair contains 2 holders with the  */ 03386000
*/* second one having OdmvDWeVLWCnt set to 1 indicating that there   */ 03387000
*/* is one waiter. The second pair has 1 holder and OdmvDWeVLWCnt    */ 03388000
*/* set to 2 for its 2 waiters.                                      */ 03389000
*/*                                                                  */ 03390000
*/*   -------------------------                                      */ 03391000
*/*  ! OdmvDWheader            !                                     */ 03392000
*/*  !   OdmvDWhVLHPTR---------+--.                                  */ 03393000
*/*  !   OdmvDWhVLHCnt = 2     !  !   <----Odmv waters header        */ 03394000
*/*  !                         !  !                                  */ 03395000
*/*  !-------------------------!<-'                                  */ 03396000
*/*  ! OdmvDWelement Lat#1     !                                     */ 03397000
*/*  !  OdmvDWeIsVfsHolder = 1 !      <----Holder for latch #1       */ 03398000
*/*  !  OdmvDWeVLWCnt = 0      !                                     */ 03399000
*/*  !-------------------------!                                     */ 03400000
*/*  ! OdmvDWelement Lat#1     !                                     */ 03401000
*/*  !  OdmvDWeIsVfsHolder = 1 !      <----Holder for latch #1       */ 03402000
*/*  !  OdmvDWeVLWCnt = 1      !      <----Last holder waiters count */ 03403000
*/*  !-------------------------!                                     */ 03404000
*/*  ! OdmvDWelement Lat#1     !                                     */ 03405000
*/*  !  OdmvDWeIsVfsHolder = 0 !      <----Waiter for latch #1       */ 03406000
*/*  !  OdmvDWeVLWCnt = N/A    !                                     */ 03407000
*/*  !-------------------------!                                     */ 03408000
*/*  ! OdmvDWelement Lat#2     !                                     */ 03409000
*/*  !  OdmvDWeIsVfsHolder = 1 !      <----Holder for latch #2       */ 03410000
*/*  !  OdmvDWeVLWCnt = 2      !      <----Last holder waiters count */ 03411000
*/*  !-------------------------!                                     */ 03412000
*/*  ! OdmvDWelement Lat#2     !                                     */ 03413000
*/*  !  OdmvDWeIsVfsHolder = 0 !      <----Waiter for latch #2       */ 03414000
*/*  !  OdmvDWeVLWCnt = N/A    !                                     */ 03415000
*/*  !-------------------------!                                     */ 03416000
*/*  ! OdmvDWelement Lat#2     !                                     */ 03417000
*/*  !  OdmvDWeIsVfsHolder = 0 !      <----Waiter for latch #2       */ 03418000
*/*  !  OdmvDWeVLWCnt = N/A    !                                     */ 03419000
*/*   -------------------------                                      */ 03420000
*/*                                                                  */ 03421000
*/*--------------------------------------------------------------@DWA*/ 03422000
*Declare                                                                03423000
* 1 OdmvDWelement  Bdy(Word) Based, /* Mount Latch / Xsys Elem   @DWA*/ 03424000
*/*------------------------------------------------------------------*/ 03425000
*/* HOLDER IS DOING:                                                 */ 03426000
*/*------------------------------------------------------------------*/ 03427000
*  3 OdmvDWePfsName Char( 8),       /* Pfs Name / Glue Exit Name     */ 03428000
*  3 OdmvDWeOp      Char(12),       /* Vfs or Vnod Operation         */ 03429000
*  3 OdmvDWeState   Char(16),       /* State of operation            */ 03430000
*/********************************************************************/ 03431000
*/* OdmvDWeLatNum renamed to OdmvDWeLatWaitNum to clarify its use.   */ 03432000
*/* OdmvDWeLatWaitNum should be used to obtain the latch number when */ 03433000
*/* OdmvDWeState indicates that the thread is in a latch wait.       */ 03434000
*/*                                                                  */ 03435000
*/* Use OdmvDWeVLHLatNum for the latch number of a file system latch */ 03436000
*/* holder causing contention.                                       */ 03437000
*/***************************************************************@PCA*/ 03438000
*  3 OdmvDWeLatNum  Fixed(32),      /* Latch Number              @E2C*/ 03439000
*   5 OdmvDWeLatWaitNum Fixed(32),  /* New name                  @PCA*/ 03440000
*  3 OdmvDWeSysName Char( 9),       /* BROADCAST or Xsys Member Name */ 03441000
*   5 OdmvDWeSysName8 Char( 8),     /* 8 char member name            */ 03442000
*   5 OdmvDWeSysName1 Char( 1),     /* T when BROADCAST or blank     */ 03443000
*/*------------------------------------------------------------------*/ 03444000
*/* common section for the latch holder, waiters and XSYS Message.   */ 03445000
*/*------------------------------------------------------------------*/ 03446000
*  3 OdmvDWeFlags   Bit  ( 8),      /* Flags                         */ 03447000
*   5 OdmvDWeFlagFS Bit  ( 1),      /*  1 = OdmvDweFileSys has name  */ 03448000
*   5 OdmvDWeFlag99 Bit  ( 1),      /*  1 = OdmvDweHrs > 99          */ 03449000
*   5 OdmvDWelatch  Bit  ( 1),      /*  1 = Holder has latch number  */ 03450000
*   5 OdmvDWeIsDoing Bit ( 1),      /*  1 = display ID DOING data    */ 03451000
*   5 OdmvDWeLatAcc Bit  ( 1),      /*  1 = Latch held EXCL      @E2A*/ 03452000
*                                   /*    for HOLDING line           */ 03453000
*   5 OdmvDWeVfsAcc Bit  ( 1),      /*  1 = Latch held EXCL      @E2A*/ 03454000
*                                   /*    for File system latch table*/ 03455000
*   5 OdmvDWeIsVfsHolder Bit ( 1),  /*  1 = Vfs table holder     @E2A*/ 03456000
*   5 OdmvDWeVnodFileOp  Bit ( 1),  /*  1 = display FILE data    @E2A*/ 03457000
*  3 OdmvDWeAsid    Fixed(16),      /* Asid   of holder,waiter,XSYS  */ 03458000
*  3 OdmvDWeUserid  Char ( 8),      /* Userid of holder,waiter,XSYS  */ 03459000
*  3 OdmvDWeSysMem  Char ( 8),      /* Sysplex Member name           */ 03460000
*  3 OdmvDWeTcb     Fixed(32),      /* Tcb    of holder,waiter,XSYS  */ 03461000
*  3 OdmvDWeReason  Char (20),      /* Reason for holding,waiting    */ 03462000
*  3 OdmvDWeAge     Fixed(32),      /* Age holding,waiting,XSYS      */ 03463000
*   5 OdmvDWeHrs    Fixed( 8),      /*  Hours                        */ 03464000
*   5 OdmvDWeMins   Fixed( 8),      /*  Minutes                      */ 03465000
*   5 OdmvDWeSecs   Fixed( 8),      /*  Seconds                      */ 03466000
*   5 *             Fixed( 8),      /* Reserved                      */ 03467000
*  3 OdmvDWeFileSys Char (44),      /* File System of holder,waiter  */ 03468000
*/*------------------------------------------------------------------*/ 03469000
*/* Unique declares for XSYS Messages.                               */ 03470000
*/*------------------------------------------------------------------*/ 03471000
* 3 OdmvDWeUnion Union Char(284) Bdy(Word),                    /*@EBA*/ 03472000
*  5 OdmvDWeXsys,                                              /*@EBA*/ 03473000
*   7 OdmvDWeMsgType Char (12),      /* Message Type                 */ 03474000
*   7 OdmvDWeFcode   Fixed(16),      /* Function Code                */ 03475000
*   7 OdmvDWeRequest Char ( 1),      /* * = ASYNC, blank = SYNC      */ 03476000
*   7 *              Char ( 1),      /* Reserved (padding)           */ 03477000
*   7 OdmvDWeOnTcb   Fixed(32),      /* On TCB for RECV Xsys MSG     */ 03478000
*   7 OdmvDWeReqId   Char ( 4),      /* Request Id                   */ 03479000
*     9 OdmvDWeSysNum  Fixed(8),     /*  System Number               */ 03480000
*     9 OdmvDWeSeqNo   Fixed(24) Bdy(Byte), /* Sequence Number       */ 03481000
*   7 OdmvDWeMemCnt  Fixed(32),      /* Number of OdmvDWeMemName     */ 03482000
*%IF BPXZODMV_CBGENing ^= 'Y' %THEN                            /*@P9A*/ 03483000
*%Do;                                                          /*@P9A*/ 03484000
*                                                             /*1@E2C*/ 03485000
*   7 OdmvDWeMemName(Fssh_MAX_SYS) Char(8), /* broadcast member names*/ 03486000
*%End;                                                         /*@P9A*/ 03487000
*%Else               /* BPXZFSSH has lots of CBGEN problems so   @P9A*/ 03488000
*%Do;                /*   we have to avoid any dependency on it. @P9A*/ 03489000
*   7 OdmvDWeMemName( 32 ) Char(8),   /* broadcast members   @E2C@P9A*/ 03490000
*%End;                                                         /*@P9A*/ 03491000
*/*------------------------------------------------------------------*/ 03492000
*/* File latch activity table                                        */ 03493000
*/*------------------------------------------------------------------*/ 03494000
*  5 OdmvDWeFileLat,                                           /*@EBA*/ 03495000
*   7 OdmvDWeFileLatFileName Char(64),/* Files name 64 characters@EBA*/ 03496000
*   7 OdmvDWeFileLatDevno Fixed(32), /* Files device number      @EBA*/ 03497000
*   7 OdmvDWeFileLatIno   Fixed(32), /* Files Inode number       @EBA*/ 03498000
*   7 OdmvDWeFileLatLSet  Char(2),   /* Files latch set ID       @EBA*/ 03499000
*   7 OdmvDWeFileLatFileType  Fixed(8),  /* Files type           @EBA*/ 03500000
*/*------------------------------------------------------------------*/ 03501000
*/* File system latch activity table                             @E2A*/ 03502000
*/*------------------------------------------------------------------*/ 03503000
* 3 OdmvDWeVLWCnt     Fixed(32),   /* Number of Vfs latch waiters@E2A*/ 03504000
*                                  /* Only valid on last holder  @E2A*/ 03505000
*                                  /* for each latch             @E2A*/ 03506000
*/*------------------------------------------------------------------*/ 03507000
*/* HOLDING:                                                     @E2A*/ 03508000
*/*------------------------------------------------------------------*/ 03509000
* 3 OdmvDWeHeldLatNum Fixed(32),   /*                            @E2A*/ 03510000
*/*------------------------------------------------------------------*/ 03511000
*/* FILE:                                                        @E2A*/ 03512000
*/*------------------------------------------------------------------*/ 03513000
* 3 OdmvDWeFileName   Char(16),    /* Files name                 @E2A*/ 03514000
* 3 OdmvDWeDevno      Fixed(32),   /* Files device number        @E2A*/ 03515000
* 3 OdmvDWeIno        Fixed(32),   /* Files Inode number         @E2A*/ 03516000
*/*------------------------------------------------------------------*/ 03517000
*/* OTHER WAITING THREADS:                                       @E2A*/ 03518000
*/*------------------------------------------------------------------*/ 03519000
* 3 OdmvDWePid        Fixed(32),   /* Pid of waiter              @E2A*/ 03520000
* 3 OdmvDWeFlags2  Bit  ( 8),      /* Flags2                     @E3A*/ 03521000
*   5 OdmvDWeHsm    Bit  ( 1),     /* 1 = Doing an HSM recall    @E3A*/ 03522000
* 3 *                 Char(3),     /* Reserved                   @PBA*/ 03523000
*/********************************************************************/ 03524000
*/* OdmvDWeVLHLatNum contains the latch number for a file system     */ 03525000
*/* latch holder causing contention.  This is the value that shows   */ 03526000
*/* up under the FILE SYSTEM LATCH ACTIVITY table.  It is only set   */ 03527000
*/* for the holder. This field is used for the file system and file  */ 03528000
*/* latch activty tables.                                            */ 03529000
*/***************************************************************@PCA*/ 03530000
* 3 OdmvDWeVLHLatNum  Fixed(32),   /* VFS/Vnod holder latch num  @PBA*/ 03531000
* 3 OdmvTimestamp     char(20),    /* Timestamp of start activity@E7A*/ 03532000
*   5 OdmvDate        char(10),    /* Date                       @E7A*/ 03533000
*   5 OdmvBlank       char(1),     /* blank space                @E7A*/ 03534000
*   5 OdmvTime        char(8),     /* Time                       @E7A*/ 03535000
*   5 *               char(1),     /* blank space                @E7A*/ 03536000
* 3 OdmvDWeXcfSequence Fixed(32);  /* XCF sequence               @EDA*/ 03537000
*                                                                       03538000
* ?ASAADMAC NAME(BPXZFSSH) Listopt(COND);                               03539000
*                                                                       03540000
*Declare                                                                03541000
* OdmvDWelem_#Len Constant(Length(OdmvDWelement));           /* @DWA */ 03542000
*%END;                                                       /* @DWA */ 03543000
*                                                                       03544000
*/********************************************************************/ 03545000
*/* Mapping OdmvSocket, one is returned for each open socket    @DVA */ 03546000
*/********************************************************************/ 03547000
*Dcl                                                                    03548000
* 1 OdmvSocket Based Bdy(Word),                                         03549000
*    3 OdmvSocketJobName  Char(8),    /* Job name of socket owner    */ 03550000
*    3 OdmvInodenum       Fixed(32),  /* Socket inode number         */ 03551000
*    3 OdmvPInodenum      Fixed(32),  /* Socket peer inode number    */ 03552000
*    3 OdmvState          Fixed(32),  /* Current socket state        */ 03553000
*    3 OdmvBytesRead      Fixed(32),  /* Bytes read on socket        */ 03554000
*    3 OdmvBytesWritten   Fixed(32),  /* Bytes written on socket     */ 03555000
*    3 OdmvSocketNameFlg  Char(1),    /* Non 0 indicates socket has a   03556000
*                                        name                        */ 03557000
*    3 OdmvSocketName     Char(57),   /* Sockets name                */ 03558000
*    3 OdmvPeerNameFlg    Char(1),    /* Non 0 indicates peer has a     03559000
*                                        name                        */ 03560000
*    3 OdmvPeerName       Char(57);   /* Sockets peer name           */ 03561000
*                                                                       03562000
*/********************************************************************/ 03563000
*/* Decalre constant for OdmvSockets                            @DVA */ 03564000
*/********************************************************************/ 03565000
*                                                                       03566000
*  /*************************************************/                  03567000
*  /*Constants for OdmvState                    @DVA*/                  03568000
*  /*************************************************/                  03569000
*Dcl                                                                    03570000
*  Odmv#STRM   Fixed(32) CONSTANT(1), /* Unconnected stream socket   */ 03571000
*  Odmv#DGRAM  Fixed(32) CONSTANT(2), /* Datagram socket             */ 03572000
*  Odmv#LISTEN Fixed(32) CONSTANT(3), /* Stream socket that accepts     03573000
*                                        conections                  */ 03574000
*  Odmv#ACP    Fixed(32) CONSTANT(4), /* Accepted stream socket      */ 03575000
*  Odmv#CONN   Fixed(32) CONSTANT(5); /* Connected stream socket     */ 03576000
*                                                                       03577000
*/********************************************************************/ 03578000
*/* Structures for Dynamic Service Activation Query Service      @DXA*/ 03579000
*/********************************************************************/ 03580000
*/* Dynamic service activation header                            @DXA*/ 03581000
*Declare                                                      /* @DXA*/ 03582000
*  1 OdmvDynServ Bdy(Word) Based,      /* Dynamic Service Header     */ 03583000
*    3 OdmvDynServVerNum Fixed(32),    /* Version Number Of OdmvDynServ 03584000
*                                         Structure                  */ 03585000
*    3 OdmvDynServActCnt Fixed(32),    /* Number of dynamic service     03586000
*                                         activations                */ 03587000
*    3 OdmvDynServCsaStg Fixed(32),    /* Amount of CSA storage used    03588000
*                                         for all activations        */ 03589000
*    3 OdmvDynServPvtStg Fixed(32),    /* Amount of OMVS PVT storage    03590000
*                                       used for all activations     */ 03591000
*    3 OdmvDynServActPtr Ptr(31);      /* Ptr to the first DynAct       03592000
*                                         structure.                 */ 03593000
*/********************************************************************/ 03594000
*/*  Mapping of OdmvDynAct, one is returned for each dynamic service */ 03595000
*/*  activation.  The most recent activation is returned first       */ 03596000
*/*  followed by the next most recent one and so on...               */ 03597000
*/********************************************************************/ 03598000
*                                                                       03599000
*Declare                                                                03600000
*  1 OdmvDynAct Bdy(Word) Based,                              /* @DXA*/ 03601000
*    3 OdmvDynActLinkLib Char(44),   /*  LinkLib library name        */ 03602000
*    3 OdmvDynActLinkLibVol Char(6), /*  LinkLib volume              */ 03603000
*    3 OdmvDynActLpaLib Char(44),    /*  Lpalib library name         */ 03604000
*    3 OdmvDynActLpaVol Char(6),     /*  Lpalib volume               */ 03605000
*    3 OdmvDynActItemCnt Fixed(32),  /*  Number of Service Items in     03606000
*                                        the activation instance     */ 03607000
*    3 OdmvDynActNextPtr Ptr(31),    /*  Address of Next OdmvDynAct     03608000
*                                                                    */ 03609000
*    3 OdmvDynActItemPtr Ptr(31);    /*  Address of 1st OdmvDynActItem  03610000
*                                                                    */ 03611000
*/********************************************************************/ 03612000
*/*  Mapping of OdmvDynActItem, one is returned for each service item*/ 03613000
*/*  up to OdmvDynActItemCnt.  The 2-n OdmvDynActItem elements       */ 03614000
*/*  immediately follow the first OdmvDynActItem in the returned     */ 03615000
*/*  output area.                                                    */ 03616000
*/********************************************************************/ 03617000
*Declare                                                                03618000
*  1  OdmvDynActItem Char(8) Based,  /*  Service items in               03619000
*                                        dynamic activation          */ 03620000
*   3  OdmvDynActItemName Char(7),   /*  Service Item Name           */ 03621000
*   3  *                  Char(1);   /*                              */ 03622000
*                                                                       03623000
*/********************************************************************/ 03624000
*/*  For convenience a Ptr to parse through the OutArrays       @DEA */ 03625000
*/********************************************************************/ 03626000
*Dcl OdmvArrayElement Ptr(31) Based;  /*A based pointer for arrays      03627000
*                                                                @DEA*/ 03628000
*                                                                       03629000
*/*--------------------------------------------------------------@DTA*/ 03630000
*/* Mapping for Mount Failure Header (D OMVS,MF or D OMVS,MF=ALL)    */ 03631000
*/*------------------------------------------------------------------*/ 03632000
*/* The structure will be based off OdmvOutPutPtr.                   */ 03633000
*/*------------------------------------------------------------------*/ 03634000
*Declare                                                                03635000
* 1 OdmvMFHeader   Based Bdy(Word),  /* Mount Failure Header     @DTA*/ 03636000
*  3 OdmvMFHCount   Fixed(32),       /* Count of Mount Failures      */ 03637000
*  3 OdmvMFHEntryPtr  Ptr(31),       /* Ptr to 1st OdmvMFEntry       */ 03638000
*  3 OdmvMFHPTime   Char (18),       /* Purge date & time in EBCDIC  */ 03639000
*   5 OdmvMFHDate    Char(10),       /* yyyy/mm/dd                   */ 03640000
*    7 OdmvMFHYear   Char(4),                                           03641000
*    7 OdmvMFHSlash1 Char(1),                                           03642000
*    7 OdmvMFHMonth  Char(2),                                           03643000
*    7 OdmvMFHSlash2 Char(1),                                           03644000
*    7 OdmvMFHDay    Char(2),                                           03645000
*   5 OdmvMFHTime    Char( 8),       /* hh:mm:ss                     */ 03646000
*    7 OdmvMFHHH     Char(2),                                           03647000
*    7 OdmvMFHDot1   Char(1),                                           03648000
*    7 OdmvMFHMM     Char(2),                                           03649000
*    7 OdmvMFHDot2   Char(1),                                           03650000
*    7 OdmvMFHSS     Char(2),                                           03651000
*                                                                       03652000
*  3 *              Char(2),         /* Alignment                    */ 03653000
*  3 OdmvMFHEnd     Char(0)  Bdy(Word);                                 03654000
*                                                                       03655000
*Declare                                                                03656000
* OdmvMFHdr#Len Fixed(32) Constant(Length(OdmvMFHeader));               03657000
*                                                                       03658000
*/*--------------------------------------------------------------@DTA*/ 03659000
*/*                                                                  */ 03660000
*/* Mapping for Mount Failure Entry (D OMVS,MF or D OMVS,MF=ALL)     */ 03661000
*/*                                                                  */ 03662000
*/*------------------------------------------------------------------*/ 03663000
*Declare                                                                03664000
* 1 OdmvMFEntry   Based Bdy(Word), /* Mount Failure Entry        @DTA*/ 03665000
*  3 OdmvMFNext   Ptr(31),         /* +00 Next OdmvMF on the chain   */ 03666000
*                                                                       03667000
* /*-----------------------------------------------------------------*/ 03668000
* /* Any changes to OdmvMFDspInfo should also be made to             */ 03669000
* /* MfdbDspInfo.                                                    */ 03670000
* /*-----------------------------------------------------------------*/ 03671000
*  3 OdmvMFDspInfo,                /* Displayable Information:       */ 03672000
*   5 OdmvMFMntCode     Fixed(31), /* +04 Mount Entry Code           */ 03673000
*   5 OdmvMFRetCode     Fixed(32), /* +08 Failing Return Code        */ 03674000
*   5 OdmvMFRsnCode     Fixed(32), /* +0C Failing Reason Code        */ 03675000
*   5 OdmvMFPathNameLen Fixed(32), /* +10 Path Name Length           */ 03676000
*   5 OdmvMFParmDataLen Fixed(32), /* +14 Parameter Length           */ 03677000
*                                                                       03678000
*   5 OdmvMFTODEBC  Char (18),     /* +18 OdmvMFTOD in EBCDIC        */ 03679000
*    7 OdmvMFDate   Char(10),      /* +18 yyyy/mm/dd                 */ 03680000
*     9 OdmvMFYear    Char(4),                                          03681000
*     9 OdmvMFSlash1  Char(1),                                          03682000
*     9 OdmvMFMonth   Char(2),                                          03683000
*     9 OdmvMFSlash2  Char(1),                                          03684000
*     9 OdmvMFDay     Char(2),                                          03685000
*    7 OdmvMFTime    Char(8),      /* +22 hh:mm:ss                   */ 03686000
*     9 OdmvMFHH      Char(2),                                          03687000
*     9 OdmvMFDot1    Char(1),                                          03688000
*     9 OdmvMFMM      Char(2),                                          03689000
*     9 OdmvMFDot2    Char(1),                                          03690000
*     9 OdmvMFSS      Char(2),                                          03691000
*                                                                       03692000
*   5 OdmvMFflags     Bit(16),     /* +2A Flags                      */ 03693000
*     7 OdmvMFMoveFailure Bit(1),  /*     Move operation failed  @DTA*/ 03694000
*                                                                       03695000
*   5 OdmvMFFStype   Char ( 8),    /* +2C File System Type           */ 03696000
*   5 OdmvMFDDName   Char ( 8),    /* +34 DD Name        (or zeros)  */ 03697000
*   5 OdmvMFSysName  Char ( 8),    /* +3C System Name    (or zeros)  */ 03698000
*   5 OdmvMFParmMem  Char ( 8),    /* +44 Parmlib member (or zeros)  */ 03699000
*   5 OdmvMFFSName   Char (44),    /* +4C File System Name           */ 03700000
*   5 OdmvMFPathName Char (60),    /* +78 Path Name Buffer           */ 03701000
*   5 OdmvMFParmData Char (60),    /* +B4 Parameter Buffer           */ 03702000
*                                                                       03703000
*  3 OdmvMFEnd Char(0) Bdy(Word);  /* +F0                            */ 03704000
*                                                                       03705000
*Declare                                                                03706000
* OdmvMFEntry#Len Fixed(32) Constant(Length(OdmvMFEntry));              03707000
*                                                                       03708000
*                                                                       03709000
*/********************************************************************/ 03710000
*/*VersionNumber values are defined here                        @DEA */ 03711000
*/********************************************************************/ 03712000
*Dcl                                                                    03713000
*  OdmvVer#One  Fixed(32)           /* Version 1.0 Constant     @DEA */ 03714000
*                   Constant(00000010x),                                03715000
*  OdmvVer#OneOne Fixed(32)         /* Version 1.1 Constant     @DFA */ 03716000
*                   Constant(00000011x),                                03717000
*  OdmvVer#OneTwo Fixed(32)         /* Version 1.2 Constant     @DFA */ 03718000
*                   Constant(00000012x);                                03719000
*                                                                       03720000
*/********************************************************************/ 03721000
*/* Return Code values are defined here                         @DEA */ 03722000
*/********************************************************************/ 03723000
*Dcl                                                                    03724000
*  OdmvSuccess  Fixed(32) Constant(0),   /* Execution successful @DEA*/ 03725000
*  OdmvNOTFOUND Fixed(32) Constant(4),   /* ASID or UID not found@DEA*/ 03726000
*  OdmvFSGMNerror Fixed(32) Constant(8), /* Error calling FSGMN  @DEA*/ 03727000
*  OdmvBuffer   Fixed(32) Constant(12),  /* Buffer to small      @DEA*/ 03728000
*  OdmvFlags    Fixed(32) Constant(16),  /* Input flags invalid  @DEA*/ 03729000
*  OdmvAuth     Fixed(32) Constant(20),  /* Wrong authority      @DEA*/ 03730000
*  OdmvInvPtr   Fixed(32) Constant(24),  /* Ptr. to ODMVOUT zero @DEA*/ 03731000
*  OdmvOmvsInact Fixed(32) Constant(28), /* OMVS Inactive        @DLA*/ 03732000
*  Odmv#MfdbLatch Fixed(32) Constant(29), /* Mfdb latch failure  @DTA*/ 03733000
*  Odmv#ISGLSLSPErr Fixed(32) Constant(32);/* ISGLSLSP failed    @E2A*/ 03734000
*                                                                       03735000
*/********************************************************************/ 03736000
*/* OdmvPrcLimits/OdmvSystemLimits constant defined here         @DFA*/ 03737000
*/********************************************************************/ 03738000
*Dcl                                                                    03739000
* Odmv#Unlimited Bit(32)  Constant('FFFFFFFF'X);               /*@DFA*/ 03740000
*                                                                       03741000
*/********************************************************************/ 03742000
*/* OdmvStatus/OdmvThdStatus constants are defined here          @DEA*/ 03743000
*/********************************************************************/ 03744000
*                                                                       03745000
*   /************************************************/                  03746000
*   /* Constants for OdmvStatus3                    */                  03747000
*   /************************************************/                  03748000
*Dcl                                                                    03749000
* OdmvZombie   CHAR(1) CONSTANT('Z'), /*Process terminated and parent   03750000
*                                       has not complete wait        */ 03751000
* OdmvZombie2  CHAR(1) CONSTANT('L'), /* Process terminated and         03752000
*                                        still session or process       03753000
*                                        group leader            @D3A*/ 03754000
* OdmvQuiesceT CHAR(1) CONSTANT('Q'); /* Quiese termination wait @D3A*/ 03755000
*                                                                       03756000
*   /************************************************/                  03757000
*   /* Constants for OdmvStatus3 and OdmvThdStatus2 */                  03758000
*   /************************************************/                  03759000
*Dcl                                                                    03760000
* OdmvMsgrcv   CHAR(1) CONSTANT('A'), /*IPC msgrcv wait          @D3A*/ 03761000
* OdmvMsgsnd   CHAR(1) CONSTANT('B'), /*IPC msgsnd wait          @D3A*/ 03762000
* OdmvWaitC    CHAR(1) CONSTANT('C'), /*Comm KernelWait          @D1A*/ 03763000
* /* When a PID value is present in the message, D means Semop       */ 03764000
* /* When there is no PID yet, D means waiting to be dubbed          */ 03765000
* OdmvSemop    CHAR(1) CONSTANT('D'), /*IPC semop wait           @D3A*/ 03766000
* OdmvDubWait  CHAR(1) CONSTANT('D'), /*Waiting for DUB          @DUM*/ 03767000
* OdmvWaitF    CHAR(1) CONSTANT('F'), /*File System Kernel Wait  @D1A*/ 03768000
* OdmvMVSPause CHAR(1) CONSTANT('G'), /*MVSPause                 @D3A*/ 03769000
* OdmvRun      CHAR(1) CONSTANT('R'), /*Not kernel wait          @D1A*/ 03770000
* OdmvSleep    CHAR(1) CONSTANT('S'), /*sleep() issued           @D1A*/ 03771000
* OdmvBRL      CHAR(1) CONSTANT('T'), /*Byte Range Lock WaiT     @DFA*/ 03772000
* OdmvFork     CHAR(1) CONSTANT('X'), /*fork new process         @D1A*/ 03773000
* OdmvChild    CHAR(1) CONSTANT('W'); /*Waiting for child        @D1A*/ 03774000
*                                                                       03775000
*   /************************************************/                  03776000
*   /* Constants for OdmvStatus3 and OdmvThdStatus5 */                  03777000
*   /************************************************/                  03778000
*Dcl                                                                    03779000
* OdmvFreeze   CHAR(1) CONSTANT('E'); /*Quiesce Freeze           @D3A*/ 03780000
*                                                                       03781000
*   /************************************************/                  03782000
*   /* Constants for OdmvThdStatus1                 */                  03783000
*   /************************************************/                  03784000
*Dcl                                                                    03785000
* OdmvPthdCreated CHAR(1) CONSTANT('J'); /*Pthread created       @D6A*/ 03786000
*                                                                       03787000
*   /************************************************/                  03788000
*   /* Constants for OdmvThdStatus2                 */                  03789000
*   /************************************************/                  03790000
*Dcl                                                                    03791000
* OdmvMVSWait  Char(1) CONSTANT('Y'); /*MVS wait                 @D6A*/ 03792000
*                                                                       03793000
*   /************************************************/                  03794000
*   /* Constants for OdmvThdStatus3                 */                  03795000
*   /************************************************/                  03796000
*Dcl                                                                    03797000
* OdmvMediumWght  CHAR(1) CONSTANT('N'), /*Medium weight thread  @D6A*/ 03798000
* OdmvAsynch   CHAR(1) CONSTANT('O'), /*Asynchronous thread      @D6A*/ 03799000
* OdmvIPT      CHAR(1) CONSTANT('U'); /*Initial process thread   @D6A*/ 03800000
*                                                                       03801000
*   /************************************************/                  03802000
*   /* Constants for OdmvThdStatus4                 */                  03803000
*   /************************************************/                  03804000
*Dcl                                                                    03805000
* OdmvDetached CHAR(1) CONSTANT('V'); /*Thread is detached       @D6A*/ 03806000
*                                                                       03807000
*   /************************************************/                  03808000
*   /* Constants for OdmvThdStatus5                 */                  03809000
*   /************************************************/                  03810000
*Dcl                                                                    03811000
* OdmvPtrace   CHAR(1) CONSTANT('P'); /* Ptrace kernel wait      @D3A*/ 03812000
*                                                                       03813000
*   /************************************************/                  03814000
*   /* Constants for OdmvThdStatus6                 */                  03815000
*   /************************************************/                  03816000
*Dcl                                                                    03817000
* OdmvBlocked  CHAR(1) CONSTANT('B'), /* registered blocker      @DKA*/ 03818000
* OdmvPerm     CHAR(1) CONSTANT('P'), /* registered perm process @DKA*/ 03819000
* OdmvCRespawn CHAR(1) CONSTANT('R'); /* respawnable process     @D1A*/ 03820000
*                                                                       03821000
*   /************************************************/                  03822000
*   /* Constants for OdmvThdStatus7                 */                  03823000
*   /************************************************/                  03824000
*Dcl                                                                    03825000
* OdmvCUTraced CHAR(1) CONSTANT('T'); /* User Traced process     @E6A*/ 03826000
*                                                                       03827000
*   /*****************************************************/             03828000
*   /* Following constant are not returned by            */             03829000
*   /* BPXEKDA. See remarks how to get those information */             03830000
*   /*****************************************************/             03831000
*Dcl                                                                    03832000
*           /*******************************/                           03833000
*           /* OdmvPthread=Off    AND  @DEA*/                           03834000
*           /* OdmvMulThread=Off       @DEA*/                           03835000
*           /*******************************/                           03836000
* OdmvOneTask  CHAR(1) CONSTANT('1'), /*Only one dubbed task     @D3A*/ 03837000
*           /*******************************/                           03838000
*           /* OdmvMulThread=On        @DEA*/                           03839000
*           /*******************************/                           03840000
* OdmvMultThds CHAR(1) CONSTANT('M'), /* Multiple threads which were    03841000
*                                        NOT pthread_create()'ed and    03842000
*                                        has not issued a wait   @D3C*/ 03843000
*           /*******************************/                           03844000
*           /* OdmvPthread=On          @DEA*/                           03845000
*           /*******************************/                           03846000
* OdmvPthreads CHAR(1) CONSTANT('H'), /* Multiple threads exist.  Some  03847000
*                                      created by pthread_create @D3A*/ 03848000
*           /*******************************/                           03849000
*           /* OdmvStopped=On          @DEA*/                           03850000
*           /*******************************/                           03851000
* OdmvStopSt   CHAR(1) CONSTANT('T'), /*stopped                  @D3A*/ 03852000
*           /*******************************/                           03853000
*           /* OdmvSwap=On             @DEA*/                           03854000
*           /*******************************/                           03855000
* OdmvSwapped  CHAR(1) CONSTANT('I'); /*Swapped out              @D3A*/ 03856000
*                                                                       03857000
*   /*******************************************/                       03858000
*   /* Reserved Constants                 @DEA */                       03859000
*   /*******************************************/                       03860000
*Dcl                                                                    03861000
* OdmvWaitO    CHAR(1) CONSTANT('K'); /*Other Kernel Wait        @D1A*/ 03862000
*                                                                       03863000
*@LOGIC;                                                                03864000
*#PRAGMA TOOL=CBGEN.                                                    03865000
*#USEORG.                                                               03866000
*#LINE.%BPXZODMV_WAITERS = 'Y';                                         03867000
*#LINE.%BPXZODMV_CBGENing = 'Y';                                        03868000
*#LINE.%INCLUDE SYSLIB(BPXZODMV);                                       03869000
*#DELETE.OdmvOutputPtr                                                  03870000
*#EPRAGMA.                                                              03871000
*@ENDLOGIC;                                                             03872000
*/* End of PL/X Source                                               */ 03873000
* %IF BPXZODMV_LIST ^= 'NO' &                                           03874000
*    ZCBPRINT ^= 'NO' %THEN                                             03875000
*   %GOTO BPXZODMV_4;                                                   03876000
*   @LIST POP NOECHO;                                                   03877000
* %BPXZODMV_4:;                                                         03878000
* %END;                                                                 03879000
