*/*PROPRIETARY V3 STATEMENT                                          */ 00100000
*/*LICENSED MATERIALS - PROPERTY OF IBM                              */ 00150000
*/*"RESTRICTED MATERIALS OF IBM"                                     */ 00200000
*/*5695-DF1                                                          */ 00250000
*/*COPYRIGHT 1992, 2011 IBM CORP.                                    */ 00300000
*/*END PROPRIETARY V3 STATEMENT                                      */ 00350000
*/*                                                                  */ 00450000
         MACRO                                                          00800000
&NAME    BUILDRCD   &POOL,&NO,&LTH,&REC,&RECL,&MF=I                     01600000
         GBLC  &SYSAM64    GLOBAL VARIABLE SET BY SYSSTATE MACRO   @L1A 01616600
         GBLC  &SYSASCE    GLOBAL VARIABLE SET BY SYSSTATE MACRO   @L1A 01633200
         LCLB  &NOGO                                                    01650000
         LCLC  &PAREN,&CHAR                                             02400000
.*                                                                      02410000
.*         RELEASE 22 DELETIONS/CHANGES                                 02500000
.*         RELEASE 21 DELETIONS/CHANGES                                 02550000
.*    040000-144000,160000-184000,200000-216000,232000,272000-   M1754  02600000
.*    280000,296000,320000,352000-384000,400000.416000.432000,   M1754  02650000
.*    464000,480000-496000,576000,600000,624000-648000,672000-   M1754  02700000
.*    712000,728000-736000,760000-768000,784000-929000           M1754  02750000
.*         RELEASE 20 DELETIONS/CHANGES                                 02760000
.*                                                                      02800000
.* $L1=64BIT,JDZ1D10,20100303,SVLJH: 64 bit message               @L1A  02850000
.*                                                                      02900000
         SYSSTATE TEST    TEST HOW MACROS ARE TO EXPAND            @L1A 02950000
         AIF   ('&SYSAM64' EQ 'YES').E0    GO IF AMODE64=YES       @L1A 03000000
         AIF   (('&SYSASCE' NE '') AND ('&SYSASCE' NE 'P')).E1     @L1A 03050000
         AIF   ('&MF(1)' EQ 'E').EXEC   Go if execute form              03100000
         AIF   ('&MF' EQ 'L').LIST      Go if list form           M1754 03150000
         AIF   ('&MF' EQ 'I').T2        Go if standard form       M1754 03200000
         IHBERMAC   35,&MF,&MF          INVALID MACRO FORM        M1754 03250000
         AGO   .TERM                                              M1754 03300000
.* Expand the standard form (non-reentrant).                       @L1A 03350000
.T2      AIF   ('&POOL' NE '').T3                                 M1754 03400000
&NOGO    SETB  1                                                  M1754 03450000
         IHBERMAC   02,009              BUF POOL ADR NOT SPEC.    M1754 03500000
.T3      AIF   ('&NO' NE '').T4                                   M1754 03550000
&NOGO    SETB  1                                                  M1754 03600000
         IHBERMAC   03,009              BUF NO. NOT SPECIFIED     M1754 03650000
.T4      AIF   ('&LTH' NE '').T5                                  M1754 03700000
&NOGO    SETB  1                                                  M1754 03750000
         IHBERMAC   04,009              REC LENGTH NOT SPECIFIED  M1754 03800000
.T5      AIF   ('&REC' NE '').STAND                               M1754 03850000
         IHBERMAC   05,009              REC AREA NOT SPECIFIED    M1754 03900000
         AGO   .TERM                                              M1754 03950000
.* Expand the list form (parameter list only).                    @L1A  04000000
.LIST    AIF   ('&POOL' EQ '&POOL(1)').LT3 BUF POOL A SUBLIST     M1754 04050000
&NOGO    SETB  1                        YES. INVALID OPERAND      M1754 04100000
         IHBERMAC   36,,&POOL           BUF POOL ADR INVALID      M1754 04150000
.LT3     AIF   ('&NO' EQ '&NO(1)').LT4  BUF NO A SUBLIST          M1754 04200000
&NOGO    SETB  1                        YES. INVALID OPERAND      M1754 04250000
         IHBERMAC   37,,&NO             BUF NO. INVALID           M1754 04300000
.LT4     AIF   ('&LTH' EQ '&LTH(1)').LT5 BUF LENGTH A SUB LIST    M1754 04350000
&NOGO    SETB  1                        YES. BUF LENGTH INVALID   M1754 04400000
         IHBERMAC   38,,&LTH            REC LENGTH INVALID        M1754 04450000
.LT5     AIF   ('&REC' EQ '&REC(1)').LT6 REC ADR A SUB LIST       M1754 04500000
&NOGO    SETB  1                        YES. REC ADR INVALID      M1754 04550000
         IHBERMAC   39,,&REC            REC AREA INVALID OPERAND  M1754 04600000
.LT6     AIF   ('&RECL' EQ '&RECL(1)').LT7 REC LEN A SUB LIST     M1754 04650000
&NOGO    SETB  1                        YES. REC LEN INVALID      M1754 04700000
         IHBERMAC 44,,&RECL             REC LEN INVALID OPERAND   M1754 04750000
.LT7     AIF   (&NOGO EQ 1).TERM                                  M1754 04800000
&NAME    DS    0F                  Parameter list                       04850000
         AGO   .A1                                                      08800000
.* Start expanding the standard form.                              @L1A 08850000
.STAND   AIF   (&NOGO EQ 1).TERM   Go if any error so far         M1754 08900000
         CNOP  0,4                 Ensure word alignment                08950000
         AIF   ('&RECL' EQ '').SHORT                              M1754 09000000
&NAME    BAS   1,*+20              BRANCH AROUND PARAMETER LIST    @L1C 09050000
         AGO   .A1                                                      12000000
.SHORT   ANOP                                                     M1754 12050000
&NAME    BAS   1,*+16              BRANCH AROUND PARAMETER LIST    @L1C 12100000
.* Continue standard or list form.                                 @L1A 12150000
.A1      AIF   ('&POOL' EQ '').A                                  M1754 12200000
         AIF   ('&POOL' NE '&POOL(1)').A                          M1754 12250000
         DC    A(&POOL)            ADDRESS OF BUFFER POOL               12300000
         AGO   .B                                                       15200000
.A       DC    A(0)                ADDRESS OF BUFFER POOL               15250000
.B       AIF   ('&NO' EQ '').C                                    M1754 15300000
         AIF   ('&NO' NE '&NO(1)').C                              M1754 15350000
         DC    AL2(&NO)            NUMBER OF BUFFERS                    15400000
         AGO   .D                                                       19200000
.C       DC    AL2(0)              NUMBER OF BUFFERS                    19250000
.D       AIF   ('&LTH' EQ '').E                                   M1754 19300000
         AIF   ('&LTH' NE '&LTH(1)').E                            M1754 19350000
         DC    AL2(&LTH)           LENGTH OF BUFFERS                    19400000
         AGO   .F                                                       22400000
.E       DC    AL2(0)              LENGTH OF BUFFERS                    22450000
.F       AIF   ('&RECL' EQ '').G                                        24000000
         DC    AL1(0)              ALIGNMENT FIELD                      24050000
         AGO   .H                                                       25600000
.G       DC    AL1(128)            END OF PARAMETER LIST FLAG           25650000
.H       AIF   ('&REC' EQ '').I                                   M1754 25700000
         AIF   ('&REC' NE '&REC(1)').I                            M1754 25750000
         DC    AL3(&REC)           ADDRESS OF RECORD AREA               25800000
         AGO   .J                                                       28800000
.I       DC    AL3(0)              ADDRESS OF RECORD AREA               28850000
.J       AIF   ('&RECL' EQ '').STORE                                    30400000
         DC    AL1(128)            END OF PARAMETER LIST FLAG           30450000
         AIF   ('&RECL' EQ '&RECL(1)').K                          M1754 30500000
         DC    AL3(0)              LENGTH OF RECORD AREA                30550000
         AGO   .STORE                                                   33600000
.K       DC    AL3(&RECL)          LENGTH OF RECORD AREA                33650000
.STORE   AIF   ('&MF' NE 'I').END                                  @L1C 33700000
.* Generate instructions to store into the parameter list.         @L1A 33750000
         AIF   ('&POOL' EQ '&POOL(1)').M                           @L1C 33800000
         ST    &POOL(1),0(0,1)     MOVE BUFFER POOL ADDR INTO LIST      33850000
.M       AIF   ('&NO' EQ '&NO(1)').N                                    39200000
         STH   &NO(1),4(0,1)       MOVE BUFFER NUMBER INTO LIST         39250000
.N       AIF   ('&LTH' EQ '&LTH(1)').O                                  40800000
         STH   &LTH(1),6(0,1)      MOVE BUFFER POOL LENGTH INTO LIST    40850000
.O       AIF   ('&REC' EQ '&REC(1)').P                                  42400000
         ST    &REC(1),8(0,1)      MOVE RECORD AREA ADDR INTO LIST      42450000
         AIF   ('&RECL' NE '').P                                        44000000
         OI    8(1),X'80'          TURN ON END OF PARM LIST FLAG        44050000
.P       AIF   ('&RECL' EQ '&RECL(1)').Q                                45600000
         ST    &RECL(1),12(0,1)    MOVE RECORD AREA LENGTH INTO LIST    45650000
         OI    12(1),X'80'         TURN ON END OF PARM LIST FLAG        45700000
.Q       LINK  EP=IGG019B0         LINK TO BUILDRCD ROUTINE       M1754 45750000
         MEXIT                                                          48800000
.* Generate the execute form, that modifies a separate param.list. @L1A 48850000
.EXEC    AIF   ('&NAME' EQ '').NONAME                             M1754 48900000
&NAME    DS    0H                                                       49650000
.NONAME  ANOP                                                     M1754 49700000
&CHAR    SETC  '&MF(2)'                                                 50400000
&PAREN   SETC  '&CHAR'(1,1)                                             51200000
         AIF   ('&PAREN' EQ '(').R                                      52000000
         LA    1,&MF(2)            LOAD PARAMETER LIST ADDR INTO REG 1  52050000
         AGO   .TEST                                                    53600000
.R       AIF   ('&MF(2)' EQ '(1)').TEST                                 54400000
         LR    1,&MF(2)            LOAD PARMAMETER LIST ADDR INTO REG 1 54450000
.TEST    AIF   ('&POOL' EQ '').CON1                                     56000000
         AIF   ('&POOL' EQ '&POOL(1)').NUMB                             56800000
         ST    &POOL(1),0(0,1)     MOVE BUFFER POOL ADDR INTO LIST      56850000
         AGO   .CON1                                                    58400000
.NUMB    LA    0,&POOL                                                  59200000
         ST    0,0(0,1)            MOVE BUFFER POOL ADDR INTO LIST      59250000
.CON1    AIF   ('&NO' EQ '').CON2                                       60800000
         AIF   ('&NO' EQ '&NO(1)').NUMC                                 61600000
         STH   &NO(1),4(0,1)       MOVE BUFFER NUMBER INTO LIST         61650000
         AGO   .CON2                                                    63200000
.USEDC   B     *+6                 BRANCH AROUND VALUE                  63250000
         DC    AL2(&NO)            NUMBER OF BUFFERS                    63300000
         MVC   4(2,1),*-2          MOVE BUFFER NUMBER INTO LIST         63350000
         AGO   .CON2                                              M1754 63400000
.NUMC    AIF   (T'&NO NE 'N').USEDC                               M1754 63450000
         AIF   (&NO GT 4095).USEDC                                M1754 63500000
         LA    0,&NO               LOAD BUFFER NUMBER                   63550000
         STH   0,4(0,1)            STORE BUFFER NUMBER INTO LIST        63600000
.CON2    AIF   ('&LTH' EQ '').CON3                                      65600000
         AIF   ('&LTH' EQ '&LTH(1)').NUMD                               66400000
         STH   &LTH(1),6(0,1)      STORE BUFFER POOL LENGTH INTO LIST   66450000
         AGO   .CON3                                                    68000000
.USEDCL  B     *+6                 BRANCH AROUND VALUE                  68050000
         DC    AL2(&LTH)           BUFFER POOL LENGTH                   68100000
         MVC   6(2,1),*-2          MOVE BUFFER POOL LENGTH INTO LIST    68150000
         AGO   .CON3                                              M1754 68200000
.NUMD    AIF   (T'&LTH NE 'N').USEDCL                             M1754 68250000
         AIF   (&LTH GT 4095).USEDCL                              M1754 68300000
         LA    0,&LTH              LOAD BUFFER POOL LENGTH              68350000
         STH   0,6(0,1)            MOVE BUFFER POOL LENGTH INTO LIST    68400000
.CON3    AIF   ('&REC' EQ '').CON4                                      70400000
         AIF   ('&REC' EQ '&REC(1)').NUME                               72000000
         STCM  &REC(1),B'0111',9(1) MOVE RECORD AREA ADDR TO LIST  @L1C 72050000
         AGO   .CON4                                                    74400000
.NUME    LA    15,&REC             LOAD RECORD AREA ADDR                74450000
         STCM  15,B'0111',9(1)     MOVE REC AREA ADDR INTO LIST    @L1C 74500000
.CON4    AIF   ('&RECL' EQ '').Q                                        77600000
         AIF   ('&RECL' EQ '&RECL(1)').NUMF                             79200000
         STCM  &RECL(1),B'0111',13(0,1) STORE REC LENGTH IN LIST   @L1C 79250000
         AGO   .Q                                                       81600000
.USEDCR  B     *+8                 BRANCH AROUND VALUE                  81650000
         DC    AL4(&RECL)          RECORD LENGTH                        81700000
         MVC   13(3,1),*-3         MOVE RECORD LENGTH INTO LIST         81750000
         AGO   .Q                                                 M1754 81800000
.NUMF    AIF   (T'&RECL NE 'N').USEDCR                            M1754 81850000
         AIF   (&RECL GT 4095).USEDCR                             M1754 81900000
         LA    15,&RECL            LOAD RECORD LENGTH                   81950000
         STCM  15,B'0111',13(1)    STORE RECORD LENGTH INTO LIST   @L1C 82000000
         AGO   .Q                                                       84800000
.TERM    AIF   ('&NAME' EQ '').END                                M1754 84850000
&NAME    DS    0H                                                       84900000
         MEXIT                                                     @L1A 84950000
.E0      IGGERMAC 203,BUILDRCD THE BUILDRCD MACRO DOES NOT SUPPORT @L1A 85000000
         MEXIT                   SYSSTATE AMODE64=YES              @L1A 85050000
.E1      IGGERMAC 204,BUILDRCD THE BUILDRCD MACRO DOES NOT SUPPORT @L1A 85100000
         MEXIT                   SYSSTATE ASCENV=AR OR ANY         @L1A 85150000
.END     MEND                                                           92800000
