*        %GOTO ADUPRO;                                                  00050000
         MACRO                                                          00100000
         CBRADUP                                                        00150000
*%ADUPRO: ;                                                             00200000
*/********************************************************************/ 00250000
*/*                                                                  */ 00300000
*/*  $MAC(CBRADUP) COMP(OSMC) PROD(OAM):                             */ 00350000
*/*                                                                  */ 00400000
*/*  MACRO NAME       = CBRADUP                                      */ 00450000
*/*                                                                  */ 00500000
*/*  DESCRIPTIVE NAME = AUTO DELETE USER PARAMETER LIST              */ 00550000
*/*                                                                  */ 00600000
*/*  STATUS           = VERSION 1, RELEASE 1, MODIFICATION LEVEL 0   */ 00650000
*/*                                                                  */ 00657100
*/*PROPRIETARY V3 STATEMENT                                          */ 00664200
*/*LICENSED MATERIALS - PROPERTY OF IBM                              */ 00671300
*/*"RESTRICTED MATERIALS OF IBM"                                     */ 00678400
*/*5650-ZOS                                                          */ 00683800
*/*COPYRIGHT IBM CORP. 1989, 2017                                    */ 00689200
*/*END PROPRIETARY V3 STATEMENT                                      */ 00694600
*/*                                                                  */ 00700000
*/*  INVOCATION       = PLAS:  %INCLUDE SYSLIB(CBRADUP)              */ 00750000
*/*                     ASMH:           CBRADUP ,                    */ 00800000
*/*                                                                  */ 00850000
*/*  CHANGE ACTIVITY  = NONE                                         */ 00900000
*/*                                                                  */ 00950000
*/*    $L0=OAM,110,062687,TD41:   INITIAL RELEASE                    */ 00983300
*/*    $L1=JDP3227,320,890606,TUCLJS:  RELEASE 1 OF OAM              */ 01016600
*/*    $00=OA12039,1G0,050511,TUCSMC: ADD NEW INPUTS FOR DB2SSID     */ 01027700
*/*                                   AND DB2 STORAGE GROUP NAME     */ 01038800
*/*    $P1=PROBLEM,180,050913,TUCSMC: BAD COMMENT FIXED          @P1A*/ 01044400
*/*    $L2=OAMR23M,R23,160311,TUCJFX: Multi OAM AS Stage 1       @L2A*/ 01044401
*/*    $P2=298255 ,R24,190204,TUCAED: Correct CBRADUP and CBRHADUX   */ 01044402
*/*                                   comments for return codes  @P2A*/ 01044403
*/*                                                                  */ 01050000
*/********************************************************************/ 01100000
*%GOTO ADUPLAS;                     /*                                  01150000
         SPACE 2                                                        01200000
CBRADUP  DSECT                                                          01250000
ADUHDR   DS     0F                HEADER SECTION                        01300000
ADUID    DS     CL4               BLOCK ID 'ADU '                       01350000
ADULEN   DS     1F                LENGTH OF PARAMETER LIST              01400000
ADUVER   DS     1X                VERSION NUMBER                        01450000
ADUREV   DS     1X                REVISION NUMBER                       01500000
ADUSP    DS     1X                SUBPOOL NUMBER                        01550000
         DS     1X                RESERVED                              01600000
         DS     1F                RESERVED                              01650000
         SPACE 1                                                        01700000
ADULINK  DS     0F                QUEUE LINKAGE SECTION                 01750000
         DS     1F                RESERVED FOR COMPATIBILITY            01800000
         DS     1F                RESERVED FOR COMPATIBILITY            01850000
         SPACE 2                                                        01900000
*********************************************************************** 01950000
*                                                                     * 02000000
*    FUNCTION OF THIS INVOCATION                                      * 02050000
*                                                                     * 02100000
*********************************************************************** 02150000
ADUFUNC  DS     1X                FUNCTION FLAG                         02200000
         DS     3X                RESERVED                              02250000
         SPACE 2                                                        02300000
*********************************************************************** 02350000
*                                                                     * 02400000
*    INPUT TO THE EXIT ROUTINE                                        * 02450000
*                                                                     * 02500000
*********************************************************************** 02550000
ADUOBJCL DS     0CL89             STRUCTURE FOR OBJ & COL NAMES @D1A    02575000
ADUONAME DS     CL44              THE OBJECT NAME                       02600000
ADUBLANK DS     CL1               SEPARATOR BLANK IN VERIFY FILE @D1A   02616600
ADUCLNAM DS     CL44              COLLECTION NAME @D1A                  02633200
ADUCDAT  DS     CL10              OBJECT CREATION DATE                  02650000
         DS     CL1               RESERVED                              02675000
ADUSCLEN DS     H                 LENGTH OF STORAGE CLASS NAME          02700000
ADUSCNAM DS     CL30              THE NAME OF THE STORAGE CLASS         02725000
*                                 TO WHICH THE OBJECT BELONGS           02750000
ADUMCLEN DS     H                 LENGTH OF MANAGEMENT CLASS NAME       02770000
ADUMCNAM DS     CL30              THE NAME OF THE MANAGEMENT CLASS      02790000
*                                 TO WHICH THE OBJECT BELONGS           02810000
ADUSGLEN DS     F                 THE LENGTH OF THE STORAGE GROUP NAME  02830000
*                                 TO WHICH THE OBJECT BELONGS           02850000
ADUSGNAM DS     CL8               SMS STORAGE GROUP NAME OF OBJ  @00C   02890000
ADUSGDB2 DS     CL8               DB2 TABLE STOR GROUP NAME             02930000
*                                 OR HIGH LEVEL QUALIFIER        @L2C   02930001
ADUDSSID DS     CL4               THE NAME OF DB2 SSID                  02970000
*                                 CLASSIC OAM: DB2SSID IN OAM           02970001
*                                 PARMLIB MEMBER IGDSMSxx               02970002
*                                 MULTI OAM: D=xxxx IN OAM              02970003
*                                 PROCLIB MEMBER                 @L2C   02970004
*                                                                       02970005
*                                 RESERVED SPACE NOW TAKEN       @00C   03010000
         SPACE 1                                                        03050000
*********************************************************************** 03100000
*                                                                     * 03150000
*       USER FIELD PASSED BETWEEN EXIT INVOCATIONS                    * 03200000
*                                                                     * 03250000
*********************************************************************** 03300000
ADUUFLD  DS     CL32              USER FIELD                            03350000
         DS     CL16              RESERVED                              03400000
         SPACE 1                                                        03450000
*********************************************************************** 03500000
*                                                                     * 03550000
*       CONSTANTS USED FOR VALUES WITHIN SPECIFIC FIELDS              * 03600000
*                                                                     * 03650000
*********************************************************************** 03700000
         SPACE 1                                                        03750000
*********************************************************************** 03800000
*       HEADER SECTION VALUES                                         * 03850000
*********************************************************************** 03900000
ADUIDV   EQU    C'ADU '           CONTROL BLOCK ID                      03950000
ADUVERV  EQU    1                 VERSION NUMBER                        04000000
ADUREVV  EQU    0                 REVISION NUMBER                       04050000
ADUSPV   EQU    0                 SUBPOOL NUMBER                        04100000
         SPACE 1                                                        04150000
*********************************************************************** 04200000
*       FUNCTION VALUES                                               * 04250000
*********************************************************************** 04300000
ADUNOTFY EQU    1                 NOTIFY DELETE CALL                    04350000
ADUDONE  EQU    2                 END OF AUTO DELETE CYCLE CALL         04400000
         SPACE 1                                                        04450000
*********************************************************************** 04500000
*       REGISTER 15 RETURN CODE VALUES                                * 04550000
*********************************************************************** 04600000
ADUDELOK EQU    0                 ALLOWS FOR EXPIRATION OF THE OBJECT   04650000
*                                 TO CONTINUE AND TO CONTINUE CALLING   04650001
*                                 THE USER EXIT FOR OSMC PROCESSING     04650002
*                                                                  @P2C 04650003
ADUNODEL EQU    4                 DO NOT ALLOW EXPIRATION OF THIS       04700000
*                                 OBJECT FOR THIS INSTANCE OF OSMC FOR  04700001
*                                 THIS STORAGE GROUP               @P2C 04700002
ADUFAILC EQU    8                 EXPIRE ALL OBJECTS IN THIS STORAGE    04750000
*                                 GROUP FOR THIS INSTANCE OF OSMC BUT   04800000
*                                 DO NOT CALL THE USER EXIT AGAIN  @P2C 04850000
ADUFAILN EQU    12                DO NOT EXPIRE ANY OBJECTS WITHIN THIS 04900000
*                                 STORAGE GROUP AND DO NOT CALL THIS    04950000
*                                 EXIT AGAIN FOR THIS INSTANCE OF OSMC  05000000
*                                 FOR THIS STORAGE GROUP           @P2C 05000001
         MEND  ,                                                     */ 05050000
*%ADUPLAS: ;                                                            05100000
*@SPACE(2);                                                             05150000
*DCL 1 CBRADUP BASED,               /* CLASS SELECTION PARM LIST     */ 05200000
*@SPACE(1);                                                             05250000
*      3 ADUHDR,                    /* HEADER SECTION                */ 05300000
*        5 ADUID    CHAR(4),        /* BLOCK ID 'ADU '               */ 05350000
*        5 ADULEN   FIXED(31),      /* LENGTH OF PARAMETER LIST      */ 05400000
*        5 ADUVER   FIXED(8),       /* VERSION NUMBER                */ 05450000
*        5 ADUREV   FIXED(8),       /* REVISION NUMBER               */ 05500000
*        5 ADUSP    FIXED(8),       /* SUBPOOL NUMBER                */ 05550000
*        5 *        FIXED(8),       /* RESERVED                      */ 05600000
*        5 *        FIXED(31),      /* RESERVED                      */ 05650000
*@SPACE(1);                                                             05700000
*      3 ADULINK,                   /* QUEUE LINKAGE SECTION         */ 05750000
*        5 *        PTR(31),        /* RESERVED FOR COMPATIBILITY -  */ 05800000
*                                   /* MUST CONTAIN ZERO             */ 05850000
*        5 *        PTR(31),        /* RESERVED FOR COMPATIBILITY -  */ 05900000
*                                   /* MUST CONTAIN ZERO             */ 05950000
*@SPACE(1);                                                             06000000
*/********************************************************************/ 06050000
*/*                                                                  */ 06100000
*/*     FUNCTION OF THIS INVOCATION                                  */ 06150000
*/*                                                                  */ 06200000
*/********************************************************************/ 06250000
*      3 ADUFUNC FIXED(8),          /* FUNCTION FLAGS                */ 06300000
*      3 *        BIT(24),          /* RESERVED                      */ 06350000
*@SPACE(1);                                                             06400000
*/********************************************************************/ 06450000
*/*                                                                  */ 06500000
*/*     INPUT TO THE SELECTION ROUTINE                               */ 06550000
*/*                                                                  */ 06600000
*/********************************************************************/ 06650000
*      3 ADUOBJCL,                  /* OBJ & COLLECTION NAMES @D1A   */ 06670000
*        5 ADUONAME CHAR(44),       /* THE OBJECT NAME        @D1C   */ 06690000
*        5 ADUBLANK CHAR(1),        /* SEPARATOR              @P2C   */ 06710000
*        5 ADUCLNAM CHAR(44),       /* COLLECTION NAME        @D1A   */ 06730000
*      3 ADUCDAT  CHAR(10),         /* OBJECT CREQTION DATE          */ 06750000
*      3 *        CHAR(1),          /* RESERVED                      */ 06775000
*      3 ADUSCLEN FIXED(15),        /* LENGTH OF STORAGE CLASS NAME  */ 06800000
*      3 ADUSCNAM CHAR(30),         /* THE NAME OF THE STORAGE CLASS */ 06825000
*                                   /* TO WHICH THIS OBJECT BELONGS  */ 06850000
*      3 ADUMCLEN FIXED(15),        /* LENGTH OF MGMT CLASS NAME     */ 06883300
*      3 ADUMCNAM CHAR(30),         /* NAME OF THE MANAGEMENT CLASS */  06916600
*                                   /* TO WHICH THIS OBJECT BELONGS  */ 06950000
*      3 ADUSGLEN FIXED(31),        /* LENGTH OF THE STORAGE GROUP  */  06975000
*      3 ADUSGNAM CHAR(8),          /* SMS STOR GRP NAME OF OBJ @00C*/  07010000
*      3 ADUSGDB2 CHAR(8),          /* DB2 TABLE STOR GROUP NAME     */ 07045000
*                                   /* OR HIGH LEVEL QUALIFIER   @L2C*/ 07045001
*      3 ADUDSSID CHAR(4),          /* THE NAME OF DB2 SSID          */ 07080000
*                                   /* CLASSIC OAM: DB2SSID IN OAM   */ 07080001
*                                   /* PARMLIB MEMBER IGDSMSxx       */ 07080002
*                                   /* MULTI OAM: D=xxxx IN OAM      */ 07080003
*                                   /* PROCLIB MEMBER            @L2C*/ 07080004
*                                   /* RESERVED SPACE USED      @00C*/  07115000
*@SPACE(1);                                                             07150000
*/********************************************************************/ 07200000
*/*                                                                  */ 07250000
*/*     USER FIELD PASSED BETWEEN INVOCATIONS                        */ 07300000
*/*                                                                  */ 07350000
*/********************************************************************/ 07400000
*      3 ADUUFLD  CHAR(32),         /* USER FIELD                    */ 07450000
*      3 *        CHAR(16);         /* RESERVED                      */ 07500000
*@SPACE(1);                                                             07550000
*/********************************************************************/ 07600000
*/*                                                                  */ 07650000
*/*     CONSTANTS USED FOR VALUES WITHIN SPECIFIC FIELDS             */ 07700000
*/*                                                                  */ 07750000
*/********************************************************************/ 07800000
*@SPACE(1);                                                             07850000
*/********************************************************************/ 07900000
*/*     HEADER SECTION VALUES                                        */ 07950000
*/********************************************************************/ 08000000
*DCL ADUIDV CHAR(4) CONSTANT('ADU '),/* CONTROL BLOCK ID             */ 08050000
*    ADUVERV FIXED(8) CONSTANT(1),  /* VERSION NUMBER                */ 08100000
*    ADUREVV FIXED(8) CONSTANT(0),  /* REVISION NUMBER               */ 08150000
*    ADUSPV FIXED(8) CONSTANT(0);   /* SUBPOOL NUMBER                */ 08200000
*@SPACE(1);                                                             08250000
*/********************************************************************/ 08300000
*/*     FUNCTION VALUES                                              */ 08350000
*/********************************************************************/ 08400000
*DCL ADUNOTFY FIXED(8) CONSTANT(1), /* NOTIFY DELETE CALL            */ 08450000
*    ADUDONE  FIXED(8) CONSTANT(2); /* END OF AUTO DELETE CYCLE CALL */ 08500000
*@SPACE(1);                                                             08550000
*/********************************************************************/ 08600000
*/*     REGISTER 15 RETURN CODE VALUES                               */ 08650000
*/********************************************************************/ 08700000
*DCL ADUDELOK CONSTANT(0),          /* ALLOWS FOR EXPIRATION OF THE  */ 08750000
*                                   /* OBJECT TO CONTINUE AND TO     */ 08750001
*                                   /* CONTINUE CALLING THE USER EXIT*/ 08750002
*                                   /* FOR OSMC PROCESSING       @P2C*/ 08750003
*    ADUNODEL CONSTANT(4),          /* DO NOT ALLOW EXPIRATION OF    */ 08800000
*                                   /* THIS OBJECT FOR THIS INSTANCE */ 08800001
*                                   /* OF OSMC FOR THIS STORAGE GROUP*/ 08800002
*                                   /*                           @P2C*/ 08800003
*    ADUFAILC CONSTANT(8),          /* EXPIRE ALL OBJECTS IN THIS    */ 08850000
*                                   /* STORAGE GROUP FOR THIS        */ 08900000
*                                   /* INSTANCE OF OSMC BUT DO NOT   */ 08950000
*                                   /* CALL THE USER EXIT AGAIN  @P2C*/ 08950001
*    ADUFAILN CONSTANT(12);         /* DO NOT EXPIRE ANY OBJECTS     */ 09000000
*                                   /* WITHIN THIS STORAGE GROUP AND */ 09050000
*                                   /* DO NOT CALL THIS EXIT AGAIN   */ 09100000
*                                   /* FOR THIS INSTANCE OF OSMC FOR */ 09100001
*                                   /* THIS STORAGE GROUP        @P2C*/ 09100002
