*/** START OF SPECIFICATIONS *****************************************/ 00002804
*/*                                                                  */ 00005600
*/*  $MAC(CBRSMF) COMP(SS) PROD(OAM):                                */ 00008400
*/*                                                                  */ 00011200
*/*  MACRO NAME = CBRSMF                                             */ 00014004
*/*                                                                  */ 00016800
*/********************************************************************/ 00019600
*/*PROPRIETARY V3 STATEMENT                                          */ 00022400
*/*LICENSED MATERIALS - PROPERTY OF IBM                              */ 00025200
*/*5650-ZOS                                                          */ 00034500
*/*COPYRIGHT IBM CORP. 1997, 2021                                    */ 00041009
*/*END PROPRIETARY V3 STATEMENT                                      */ 00047600
*/********************************************************************/ 00050400
*/*                                                                  */ 00053200
*/*  STATUS = VERSION 1 RELEASE 3                                    */ 00056000
*/*                                                                  */ 00058800
*/*  DESCRIPTIVE NAME = OAM SMF RECORD MAPPING MACRO.                */ 00061600
*/*                                                                  */ 00064400
*/*01* SIZE =                                                        */ 00064505
*/*                                                                  */ 00064605
*/*01*                                                               */ 00064705
*/*                                                                  */ 00064805
*/*  POINTED TO BY = SMF85PTR - LOCAL POINTER DECLARED IN THIS   @P5C*/ 00067200
*/*                             MAPPING MACRO.                       */ 00070000
*/*                                                                  */ 00072800
*/*  CREATED BY = ALL OAM MODULES RECORDING OAM SMF RECORDS.         */ 00075600
*/*                                                                  */ 00078400
*/*  SERIALIZATION = NONE.                                           */ 00081200
*/*                                                                  */ 00084000
*/*  INVOCATION = ASM:                                               */ 00086800
*/*                                                                  */ 00089600
*/*               CBRSMF                                             */ 00092400
*/*                                                                  */ 00095200
*/*  INVOCATION = PL/X-370: MACRO VARIABLE SMFBASE MAY BE USED TO    */ 00098000
*/*                         SET THE BASING EXPRESSION:               */ 00100800
*/*                                                                  */ 00103600
*/*                        1. WHEN SMFBASE IS NOT SPECIFIED (IT HAS  */ 00106400
*/*                           A NULL VALUE)                          */ 00109200
*/*                                                                  */ 00112000
*/*                           %INCLUDE SYSLIB(CBRSMF)                */ 00114800
*/*                                                                  */ 00117600
*/*                           CBRSMF85 IS DECLARED AS LOCAL          */ 00120400
*/*                           AUTOMATIC STRUCTURE.                   */ 00123200
*/*                                                                  */ 00126000
*/*                        2. WHEN SMFBASE IS SPECIFIED:             */ 00128800
*/*                                                                  */ 00131600
*/*                           %SMFBASE = 'SMF85PTR'                  */ 00134400
*/*                           %INCLUDE SYSLIB(CBRSMF)                */ 00137200
*/*                                                                  */ 00140000
*/*                           CBRSMF85 IS BASED ON THE VALUE         */ 00142800
*/*                           ASSIGNED TO MACRO VARIABLE SMFBASE.    */ 00145600
*/*                                                                  */ 00148400
*/*                       THE DEFAULT IS TO INCLUDE THE MAPPING FOR  */ 00151200
*/*                                                                  */ 00154000
*/*                         1. THE STANDARD SMF RECORD HEADER        */ 00156800
*/*                         2. THE OAM PRODUCT IDENTIFICATION SECTION*/ 00159600
*/*                                                                  */ 00162400
*/*                       IF YOU WANT THE SUBTYPE DATA SECTION TO    */ 00165200
*/*                       INCLUDED FOR A PARTICULAR RECORD SUBTYPE,  */ 00168000
*/*                       THEN SET PL/X MACRO VARIABLE SMF85SXX      */ 00170800
*/*                       TO A NON-NULL VALUE.  WHERE XX IS THE      */ 00173600
*/*                       SUBTYPE NUMBER BETWEEN 00 AND 93.      @L9C*/ 00176400
*/*                                                                  */ 00179200
*/*                       FOR EXAMPLE, TO INCLUDE THE SUBTYPE SECTION*/ 00182000
*/*                       FOR SUBTYPE 1, SET MACRO VARIABLE          */ 00184800
*/*                       SMS85S01 TO A NON-NULL VALUE PRIOR TO      */ 00187600
*/*                       INCLUDING MAPPING MACRO CBRSMF. AS FOLLOWS:*/ 00190400
*/*                                                                  */ 00193200
*/*                           %SMF85S01 = 'YES'                      */ 00196000
*/*                           %INCLUDE SYSLIB(CBRSMF)                */ 00198800
*/*                                                                  */ 00201600
*/*  CHANGE ACTIVITY = NONE.                                         */ 00204400
*/*                                                                  */ 00207200
*/*  $L0=OAMSMF   140 060194 TUCTWB: OAM SMF RECORDING               */ 00210000
*/*  $P0=K140384  140 121196 TUCBLC: ADD SUBTYPE 88              @P0A*/ 00211400
*/*  $L1=OAMPSS   150 073197 TUCTNN: PARALLEL SYSPLEX SUPPORT    @L1A*/ 00212100
*/*  $L2=OAMMOB   R13 000901 TUCBLC: MULT OBJ BACKUP SUPPORT     @L2A*/ 00212400
*/*  $P1=K170390  R13 010221 TUCTNN: CORRECT COMMENTS            @P1C*/ 00212600
*/*  $L3=OAMIVM   R15 010827 TUCTNN: IMPROVED VOLUME MGMT        @L3A*/ 00212700
*/*  $L4=OAMIVM2  R17 031112 TUCGPW: IMPROVED VOLUME MGMT PH-2   @L4A*/ 00213600
*/*  $P2=K1K0760  R17 050202 TUCGPW: MISSING ASSEMBLY ST38       @P2A*/ 00214000
*/*  $L5=OAMBRI   R18 050315 TUCSPP: BLOB, RECYCLE, IMM BKUP     @L5A*/ 00214200
*/*  $P3=K180058  R17 050607 TUCSPP: ST39 ASM FORMAT IN ERROR    @P3A*/ 00214300
*/*  $L6=OAMR19   R19 060220 TUCBJF: OAM TAPE SUBLEVEL           @L6A*/ 00214400
*/*  $P4=K190128  R19 060711 TUCSPP: ST32 NOT IN SYN WITH HCS32  @P4A*/ 00214800
*/*  $L7=OAMR1A   R1A 070419 TUCGPW: OAM2G Phase 1               @L7A*/ 00214900
*/*  $01=OA21590  R17 070306 TUCSMC: ST38 STILL MISSING FIELDS   @01A*/ 00215000
*/*  $P5=K1A0884  R1A 070712 TUCGPW: Spelling errors             @P5A*/ 00215100
*/*  $P6=K1A1060  R1A 070808 TUCGPW: Spelling errors             @P6A*/ 00215200
*/*  $P7=K1A2308  R1A 080228 TUCGPW: Clarify Comment             @P7A*/ 00215300
*/*  $L8=OAMR1B   R1B 080801 TUCDVH: OAMARE Arch Ret (K1B0190)   @L8A*/ 00215400
*/*  $P8=K1C0255  R1C 090609 TUCGPW: ST32VSN1 Comment Update     @P8A*/ 00216100
*/*  $L9=OAMR1D   R1D 100406 TUCTMD: OAMR1D File System Stage 1  @L9A*/ 00216400
*/*  $LA=OAMR1D   R1D 100715 TUCPSS: OAMR1D OAM RAS              @LAA*/ 00216600
*/*  $P9=K1D0647  R1D 101020 TUCTMD: Bug/Sug #144 fix comments   @P9A*/ 00217000
*/*  $PA=K1D0869  R1D 110115 TUCBLC: Fix comments                @PAA*/ 00217200
*/*  $PB=K1D0936  R1D 110215 TUCTMD: Fix ")" in column 72        @PBA*/ 00217300
*/*  $LB=OAMR21R  R21 110315 TUCDEW: OAMR21 Auto Backup Delete   @LBA*/ 00217400
*/*  $LC=OAMR21F  R21 110509 TUCYHL: OAMR21 File System Stage 2  @LCA*/ 00217700
*/*  $PC=K210867  R21 111109 TUCTMD: XML_METAFILE_ENABLEMENT     @PCA*/ 00217800
*/*  $LD=OAMR22B  R22 120206 TUCDEW: OAMR22 64-bit buffers       @LDA*/ 00217900
*/*  $LE=OAMR23M  R23 160328 TUCAED: Multi OAM AS Stage 1        @LEA*/ 00218000
*/*  $PD=270925   R24 190129 TUCPSS: Add support for CBGENC      @PDA*/ 00218001
*/*                                  to generate C header file   @PDA*/ 00218002
*/*  $PE=298441   R24 190205 TUCPSS: Move PFX setting outside    @PEA*/ 00218003
*/*                                  of ST1-10 include check     @PEA*/ 00218004
*/*  $PF=300682   R24 190227 TUCAED: Build C version             @PFA*/ 00218050
*/*  $LF=OA55700  R23 180301 TUCPSS: Cloud Tier Stage 1          @LFA*/ 00218051
*/*  $LG=OA59615  R23 200706 TUCPSS: Cloud Tier Stage 2          @LGA*/ 00218052
*/** END OF SPECIFICATIONS *******************************************/ 00218300
*        %GOTO CBRSMFPL; /*                                             00218400
         MACRO                                                          00221200
&NAME    CBRSMF                                                         00224000
         EJECT                                                          00226800
*********************************************************************** 00229600
*                                                                     * 00232400
* SMF RECORD TYPE 85 - STANDARD SMF RECORD HEADER SUPPORTING SUBTYPES * 00235200
*                                                                     * 00238000
*********************************************************************** 00240800
CBRSMF85 DSECT                     SMF RECORD 85                        00243600
SMF85HDR EQU   *                   HEADER SEGMENT                       00246400
SMF85LEN DS    BL2'0'              RECORD LENGTH                        00249200
SMF85SEG DS    BL2'0'              SEGMENT DESCRIPTOR                   00252000
SMF85FLG DS    BL1'0'              HEADER FLAG BYTE                     00254800
SMF85FL1 EQU   X'40'               SUBTYPE ARE VALID                    00257600
SMF85RTY DS    BL1'0'              RECORD TYPE 85                       00260400
SMF85TME DS    BL4'0'              TIME SINCE MIDNIGHT, IN HUNDREDTHS   00263200
*                                  OF SECOND, RECORD WAS PRESENTED      00266000
*                                  TO SMF                               00268800
SMF85DTE DS    PL4'0000'           DATE RECORD WAS PRESENTED TO SMF,    00271600
*                                  IN THE FORM OCYYDDDF, WHERE F IS     00274400
*                                  THE SIGN.                            00277200
SMF85SID DS    CL4' '              SYSTEM IDENTIFICATION (FROM SID      00280000
*                                  PARAMETER)                           00282800
SMF85SSI DS    CL4' '              SUBSYSTEM IDENTIFICATION,            00285600
*                                  CONTAINS 'OAM ' FOR ALL OAM          00288400
*                                  SMF RECORDS.                         00291200
SMF85STY DS    CL2' '              RECORD SUBTYPE                       00294000
SMF85TRN DS    BL2'0'              NUMBER OF TRIPLETS IN THIS           00296800
*                                  RECORD.  A TRIPLET IS A SET OF       00299600
*                                  OFFSET/LENGTH/VALUES THAT DEFINE     00302400
*                                  A SECTION OF THE RECORD.             00305200
SMF85PSO DS    BL4'0'              OFFSET TO OAM PRODUCT IDENTIFICATION 00308000
*                                  SECTION                              00310800
SMF85PSL DS    BL2'0'              LENGTH OF OAM PRODUCT IDENTIFICATION 00313600
*                                  SECTION                              00316400
SMF85PSN DS    BL2'0'              NUMBER OF OAM PRODUCT IDENTIFICATION 00319200
*                                  SECTIONS                             00322000
SMF85OSO DS    BL4'0'              OFFSET TO OAM SUBTYPE DATA SECTION   00324800
SMF85OSL DS    BL2'0'              LENGTH OF OAM SUBYTPE DATA SECTION   00327600
SMF85OSN DS    BL2'0'              NUMBER OF OAM SUBTYPE DATA SECTIONS  00330400
         DS    CL6' '              RESERVED                             00333200
SMF85END DS    0C                  END OF SMF RECORD 85 HEADER          00336000
         EJECT                                                          00338800
*********************************************************************** 00341600
*                                                                     * 00344400
* SMF RECORD TYPE 85 - OAM PRODUCT IDENTIFICATION SECTION             * 00347200
*                                                                     * 00350000
*********************************************************************** 00352800
SMF85PIS DSECT                    PRODUCT IDENTIFICATION SECTION        00355600
R85PCID  DS    CL9' '             COMPONENT ID FOR OAM. FOR             00358400
*                                 DFSMS/MVS CONTAINS THE                00361200
*                                 CHARACTERS '5695DF180'.               00364000
R85PVID  DS    BL1'0'             VERSION NUMBER IN BINARY.             00366800
*                                 FROM DFARELS.DFAVER.           @LAC   00369600
R85PRID  DS    BL1'0'             RELEASE NUMBER IN BINARY.             00372400
*                                 FROM DFARELS.DFARLSE.          @LAC   00375200
R85PMID  DS    BL1'0'             MODIFICATION LEVEL IN BINARY.         00378000
*                                 FROM DFARELS.DFAMOD.           @LAC   00380800
R85PFMID DS    CL8' '             SMP/E FMID FOR OAM                    00383600
R85PID   DS    BL1'0'             PRODUCT ID IN BINARY.                 00385000
*                                 FROM DFARELS.DFAPROD.          @LAA   00386400
         DS    CL3' '             RESERVED                       @LAC   00387800
R85PCPUI DS    CL8' '             CPU ID AS STORED BY STIPD             00389200
R85PJOBN DS    CL8' '             JOB NAME                              00392000
R85PSTPN DS    CL8' '             STEP NAME                             00394800
R85PPRCN DS    CL8' '             PROCEDURE NAME                        00397600
R85PPGMN DS    CL8' '             PROGRAM NAME                          00400400
R85USRID DS    CL8' '             USER IDENTIFICATION                   00403200
R85PTRXN DS    CL8' '             TRANSACTION NAME                      00406000
R85PSTRT DS    CL8' '             STARTING TIME OF FUNCTION, IN         00408800
*                                 8-BYTE S/390 STORE CLOCK (STCK)       00411600
*                                 INSTRUCTION FORMAT.                   00414400
R85PENDT DS    CL8' '             ENDING TIME OF FUNCTION, IN           00417200
*                                 8-BYTE S/390 STORE CLOCK (STCK)       00420000
*                                 INSTRUCTION FORMAT.                   00422800
R85PRESP DS    BL4'0'             ELAPSED TIME OF FUNCTION,      @P5C   00425600
*                                 IN MILLISECONDS (.001                 00428400
*                                 SECOND UNITS)                         00431200
R85POSUB DS    CL4' '             OAM SUBSYSTEM ID               @LEA   00431201
R85PSSID DS    CL4' '             DB2 SUBSYSTEM ID ASSOCIATED WITH      00431202
*                                 OAM SUBSYSTEM                  @LEA   00431203
         DS    CL4' '             RESERVED                       @LEC   00434000
R85PEND  DS    0C                 END OF OAM PRODUCT ID SECTION         00436800
         EJECT                                                          00439600
*********************************************************************** 00442400
*                                                                     * 00445200
* OAM SUBTYPE SECTION, FOR SUBTYPES 1 - 10.                       @P7C* 00448000
*                                                                     * 00450800
* SUBTYPE FUNCTION                                                    * 00453600
* ------- ---------------------------------------------------         * 00456400
*       1 OSREQ ACCESS                                                * 00459200
*       2 OSREQ STORE                                                 * 00462000
*       3 OSREQ RETRIEVE                                              * 00464800
*       4 OSREQ QUERY                                                 * 00467600
*       5 OSREQ CHANGE                                                * 00470400
*       6 OSREQ DELETE                                                * 00473200
*       7 OSREQ UNACCESS                                              * 00476000
*       8 OSREQ STOREBEG                                          @L7A* 00476700
*       9 OSREQ STOREPRT                                          @L7A* 00477400
*      10 OSREQ STOREEND                                          @L7A* 00478100
*                                                                     * 00478800
*********************************************************************** 00481600
ST1      DSECT                    SUBTYPES 1 - 10                 @P7C  00484400
ST1COLN  DS    CL44' '            COLLECTION NAME                       00487200
ST1OBJN  DS    CL44' '            OBJECT NAME                           00490000
ST1SGN   DS    CL8' '             STORAGE GROUP NAME                    00492800
ST1SCN   DS    CL8' '             STORAGE CLASS NAME                    00495600
ST1MCN   DS    CL8' '             MANAGEMENT CLASS NAME                 00498400
ST1OFF   DS    BL4'0'             OFFSET FOR PARTIAL OBJECT             00501200
*                                 RETRIEVE (SUBTYPE 3), ZERO FOR        00504000
*                                 ALL OTHERS.                           00506800
ST1LEN   DS    BL4'0'             LENGTH,                               00509600
*                                 SUBTYPE 1 - UNUSED                    00512400
*                                 SUBTYPE 2 - LENGTH OF OBJECT STORED   00515200
*                                 SUBTYPE 3 - NUMBER OF BYTES RETRIEVED 00518000
*                                 SUBTYPE 4 - NUMBER OF QEL ELEMENTS    00520800
*                                             RETURNED.                 00523600
*                                 SUBTYPE 5 - UNUSED                    00526400
*                                 SUBTYPE 6 - LENGTH OF OBJECT DELETED  00529200
*                                 SUBTYPE 7 - UNUSED                    00532000
*                                 SUBTYPE 8 - LENGTH OF OBJECT STORED   00532700
*                                 SUBTYPE 9 - LENGTH OF OBJECT PART     00533400
*                                 SUBTYPE10 - LENGTH OF OBJECT STORED   00534100
ST1TTOK  DS    CL16' '            OSREQ TRACKING TOKEN, SUPPLIED        00534800
*                                 WITH TTOKEN KEYWORD ON OSREQ          00537600
*                                 MACRO                                 00540400
ST1TOK   DS    CL8' '             OSREQ ACCESS TOKEN                    00543200
ST1VSN   DS    CL6' '             VOLUME SERIAL NUMBER                  00546000
ST1VMT   DS    CL2' '             VOLUME MEDIA TYPE                     00548800
ST1RC    DS    BL4'0'             OSREQ RETURN CODE, IN REGISTER 15     00551600
*                                 FOLLOWING OSREQ MACRO                 00554400
ST1RS    DS    BL4'0'             OSREQ REASON CODE, IN REGISTER 15     00557200
*                                 FOLLOWING OSREQ MACRO                 00560000
ST1FLGS  DS    BL4'0'             PROCESSING FLAGS. MEANING             00562800
*                                 DEPENDENT ON RECORD SUBTYPE.          00565600
ST1STOK  DS    CL16               OSREQ STOKEN.  Valid for subtypes     00566000
*                                 8, 9, and 10.                   @L7A  00566400
ST1RC2   DS    BL4'0'             OSREQ Return Code 2.  Valid for       00566800
*                                 subtypes 2, 3, and 10           @L7A  00567200
ST1STOUT DS    BL4'0'             STIMEOUT in seconds   SUB=8     @L8A  00567300
ST1OLRD  DS    CL10' '            Last refer date: OLD  SUB=3,5   @L8A  00567400
ST1NLRD  DS    CL10' '            Last refer date: NEW  SUB=3,5   @L8A  00567500
ST1INST  DS    BL4'0'             Instance ID. For SUB 2,3,6,10   @L9A  00567800
ST1CLDID DS    BL2'0'             Cloud ID. For SUB 2,3,6,10      @LFA  00567801
         DS    BL2'0'             Reserved                        @LFA  00567802
ST1CINST DS    BL4'0'             Cloud Instance ID. For 2,3,6,10 @LFA  00567803
ST1PRCAB DS    BL4'0'             OSREQ return code for primary         00567804
*                                 object retrieve failure with          00567805
*                                 automatic access to backup            00567806
*                                 enabled. For SUB 3.             @LGA  00567807
ST1PRSAB DS    BL4'0'             OSREQ reason code for primary         00567808
*                                 object retrieve failure with          00567809
*                                 automatic access to backup            00567810
*                                 enabled. For SUB 3.             @LGA  00567811
*                                                                 @L7A  00568100
*********************************************************************** 00568400
*                                                                     * 00568700
* SUBTYPE 1 - OSREQ ACCESS FLAGS                                      * 00569000
*                                                                     * 00569300
*********************************************************************** 00569600
ST1FLGS0 EQU   X'80'             When on,IADDRESS was specified on      00569900
*                                the OSREQ request                @L9A  00570200
*********************************************************************** 00570500
*                                                                     * 00571200
* SUBTYPE 2 - OSREQ STORE FLAGS                                       * 00574000
*                                                                     * 00576800
*********************************************************************** 00579600
ST2FLGS0 EQU   X'80'             OBJECT STORE TO Disk           @L9C    00582400
ST2FLGS1 EQU   X'40'             OBJECT STORE TO OPTICAL                00585200
ST2FLGS2 EQU   X'20'             OBJECT STORE TO TAPE                   00588000
ST2FLGS3 EQU   X'10'             OBJECT STORE TO CLOUD          @LFC    00590800
ST2FLGS4 EQU   X'08'             UNUSED                                 00593600
ST2FLGS5 EQU   X'04'             WHEN ON, THE OSREQ STORE               00596400
*                                REQUEST RESULTED IN THE MOUNTING       00599200
*                                OF A SHELF-RESIDENT REMOVABLE          00602000
*                                MEDIA VOLUME (TAPE OR OPTICAL)         00604800
*                                BY A HUMAN OPERATOR. ONLY VALID        00607600
*                                IF BIT 1 OR 2 IS ON.                   00610400
ST2FLGS6 EQU   X'02'             WHEN ON, THE OSREQ STORE               00613200
*                                REQUEST RESULTED IN THE MOUNTING       00616000
*                                OF A LIBRARY-RESIDENT REMOVABLE        00618800
*                                MEDIA VOLUME (TAPE OR OPTICAL)         00621600
*                                BY A HUMAN OPERATOR. ONLY VALID        00624400
*                                IF BIT 1 OR 2 IS ON.                   00627200
ST2FLGS7 EQU   X'01'             WHEN ON, THE OSREQ STORE               00630000
*                                REQUEST WAS SATISFIED USING     @P5C   00632800
*                                AN ALREADY MOUNTED REMOVEABLE          00635600
*                                MEDIA VOLUME (TAPE OR OPTICAL).        00638400
*                                ONLY VALID                             00641200
*                                IF BIT 1 OR 2 IS ON.                   00644000
ST2FLGS8 EQU    X'80'            WHEN ON, AN IMMEDIATE BACKUP COPY      00644900
*                                WAS SCHEDULED FOR THIS OBJECT.  @L5A   00645800
ST2FLGS9 EQU    X'40'            WHEN ON, THE OBJECT IS STORED          00646100
*                                TO LOB STORAGE STRUCTURE        @L5A   00646400
ST2FLGS10 EQU   X'20'            WHEN ON, OBJECT STORED ON SUBLEVEL 1   00646900
*                                VOLUME.                         @L6A   00647400
ST2FLGS11 EQU   X'10'            WHEN ON, OBJECT STORED ON SUBLEVEL 2   00647900
*                                VOLUME.                         @L6A   00648400
ST2FLGS12 EQU   X'08'            UNUSED                          @L8A   00648500
ST2FLGS13 EQU   X'04'            DELHOLD=HOLD                    @L8A   00648600
ST2FLGS14 EQU   X'02'            Retention-protected             @L8A   00648700
ST2FLGS15 EQU   X'01'            Deletion-protected              @L8A   00648800
ST2FLGS16 EQU   X'80'            Event-based-retention           @L8A   00648900
ST2FLGS17 EQU   X'40'            Reserved                        @PCA   00649100
ST2FLGS18 EQU   X'20'            Stored from 64-bit buffer       @LDA   00649200
*********************************************************************** 00649300
*                                                                     * 00649600
* SUBTYPE 3 - OSREQ RETRIEVE FLAGS                                    * 00652400
*                                                                     * 00655200
*********************************************************************** 00658000
ST3FLGS0 EQU    X'80'            WHEN ON, PRIMARY COPY OF OBJECT        00660800
*                                RETRIEVED FROM Disk.            @L9C   00663600
ST3FLGS1 EQU    X'40'            WHEN ON, PRIMARY COPY OF OBJECT        00666400
*                                RETRIEVED FROM OPTICAL.                00669200
ST3FLGS2 EQU    X'20'            WHEN ON, PRIMARY COPY OF OBJECT        00672000
*                                RETRIEVED FROM TAPE.                   00674800
ST3FLGS3 EQU    X'10'            WHEN ON, EITHER THE FIRST OR THE       00677000
*                                SECOND BACKUP COPY OF THE OBJECT WAS   00679200
*                                RETRIEVED FROM OPTICAL AS RESULT OF    00681400
*                                VIEW=BACKUP OR VIEW=BACKUP2 BEING      00683600
*                                SPECIFIED ON THE OSREQ MACRO.          00686000
*                                REFER TO BIT 10 TO INDICATE WHICH      00687600
*                                BACKUP COPY WAS RETRIEVED.      @L2C   00689200
ST3FLGS4 EQU    X'08'            WHEN ON, EITHER THE FIRST OR THE       00690800
*                                SECOND BACKUP COPY OF THE OBJECT WAS   00692400
*                                RETRIEVED FROM TAPE AS RESULT OF       00694000
*                                VIEW=BACKUP OR VIEW=BACKUP2 BEING      00695600
*                                SPECIFIED ON THE OSREQ MACRO.          00697200
*                                REFER TO BIT 10 TO INDICATE WHICH      00699600
*                                BACKUP COPY WAS RETRIEVED.      @P1C   00702000
ST3FLGS5 EQU    X'04'            WHEN ON, EITHER THE FIRST OR THE       00704400
*                                SECOND BACKUP COPY OF THE OBJECT WAS   00706800
*                                RETRIEVED FROM OPTICAL AS A RESULT     00709200
*                                OF THE PRIMARY COPY OF THE OBJECT      00711600
*                                BEING UNAVAILABLE AND THE AUTOMATIC    00714000
*                                ACCESS TO BACKUP BEING ACTIVE. @P9C    00716400
*                                REFER TO BIT 10 TO INDICATE WHICH      00718800
*                                BACKUP COPY WAS RETRIEVED.      @P1C   00720000
ST3FLGS6 EQU    X'02'            WHEN ON, EITHER THE FIRST OR THE       00721200
*                                SECOND BACKUP COPY OF THE OBJECT WAS   00723600
*                                RETRIEVED FROM TAPE AS A RESULT        00726000
*                                OF THE PRIMARY COPY OF THE OBJECT      00728400
*                                BEING UNAVAILABLE AND THE AUTOMATIC    00731000
*                                ACCESS TO BACKUP BEING ACTIVE. @P9C    00733600
*                                REFER TO BIT 10 TO INDICATE WHICH      00736200
*                                BACKUP COPY WAS RETRIEVED.      @P1C   00737700
ST3FLGS7 EQU    X'01'            WHEN ON, THE OSREQ RETRIEVE            00739200
*                                REQUEST RESULTED IN THE MOUNTING       00742000
*                                OF A SHELF-RESIDENT REMOVABLE          00744800
*                                MEDIA VOLUME (TAPE OR OPTICAL)         00747600
*                                BY A HUMAN OPERATOR. ONLY VALID        00750400
*                                IF BIT 1, 2, 3, 4, 5 OR 6 IS ON. @PAC  00753200
ST3FLGS8 EQU    X'80'            WHEN ON, THE OSREQ RETRIEVE            00756000
*                                REQUEST RESULTED IN THE MOUNTING       00758800
*                                OF A LIBRARY-RESIDENT REMOVABLE        00761600
*                                MEDIA VOLUME (TAPE OR OPTICAL)         00764400
*                                BY A HUMAN OPERATOR. ONLY VALID        00767200
*                                IF BIT 1, 2, 3, 4, 5 OR 6 IS ON. @PAC  00770000
ST3FLGS9 EQU    X'40'            WHEN ON, THE OSREQ RETRIEVE            00772800
*                                REQUEST WAS SATISFIED USING      @P5C  00775600
*                                AN ALREADY MOUNTED REMOVEABLE          00778400
*                                MEDIA VOLUME (TAPE OR OPTICAL).        00781200
*                                ONLY VALID                             00784000
*                                IF BIT 1, 2, 3, 4, 5 OR 6 IS ON. @PAC  00785500
ST3FLGS10 EQU    X'20'           WHEN ON, THE SECOND BACKUP COPY OF     00787100
*                                THE OBJECT WAS RETRIEVED         @L4C  00787400
ST3FLGS11 EQU    X'10'           WHEN ON, A RECALL WAS SCHEDULED        00787700
*                                FOR THIS OBJECT                  @L4A  00788000
ST3FLGS12 EQU    X'08'           WHEN ON, A RECALL WAS EXPLICITLY @P5C  00788300
*                                SPECIFIED ON THE OSREQ RETRIEVE        00788600
*                                REQUEST                          @L4A  00788900
ST3FLGS13 EQU    X'04'           WHEN ON, THE PRIMARY COPY OF           00789000
*                                THE OBJECT WAS RETRIEVED FROM          00789100
*                                A LOB STORAGE STRUCTURE          @L5A  00789200
ST3FLGS14 EQU    X'02'           WHEN ON, OBJECT RETR. FROM SUBLEVEL 1  00789600
*                                VOLUME.                          @L6A  00790000
ST3FLGS15 EQU    X'01'           WHEN ON, OBJECT RETR. FROM SUBLEVEL 2  00790400
*                                VOLUME.                          @L6A  00790800
ST3FLGS16 EQU    X'80'           Reserved                         @PCA  00791000
ST3FLGS17 EQU    X'40'           Retrieved to 64-bit buffer       @LDA  00791100
ST3FLGS18 EQU    X'20'           WHEN ON, PRIMARY COPY OF OBJECT        00791101
*                                RETRIEVED FROM CLOUD             @LFA  00791102
ST3FLGS19 EQU    X'10'           WHEN ON, FIRST OR SECOND BACKUP        00791103
*                                COPY OF OBJECT RETRIEVED FROM          00791104
*                                CLOUD DUE TO VIEW=BACKUP OR            00791105
*                                VIEW=BACKUP2                     @LGA  00791106
ST3FLGS20 EQU    X'08'           WHEN ON, FIRST OR SECOND BACKUP        00791107
*                                COPY OF OBJECT RETRIEVED FROM          00791108
*                                FILE SYSTEM DUE TO VIEW=BACKUP OR      00791109
*                                VIEW=BACKUP2                     @LGA  00791110
ST3FLGS21 EQU    X'04'           WHEN ON, FIRST OR SECOND BACKUP        00791111
*                                COPY OF OBJECT RETRIEVED FROM          00791112
*                                CLOUD DUE TO AUTOMATIC ACCESS          00791113
*                                TO BACKUP                        @LGA  00791114
ST3FLGS22 EQU    X'02'           WHEN ON, FIRST OR SECOND BACKUP        00791115
*                                COPY OF OBJECT RETRIEVED FROM          00791116
*                                FILE SYSTEM DUE TO AUTOMATIC ACCESS    00791117
*                                TO BACKUP                        @LGA  00791118
*                                                                       00791200
*********************************************************************** 00791600
*                                                                     * 00792400
* SUBTYPE 4 - OSREQ QUERY FLAGS                                       * 00795200
*                                                                     * 00798000
*********************************************************************** 00800800
ST4FLGS0 EQU    X'80'            WHEN ON, the QUERY BACKUP OPTION has   00801100
*                                been disabled by specifying QB=N in    00801400
*                                the IEFSSNxx PARMLIB member.           00801700
*                                When OFF, the QUERY BACKUP OPTION is   00802000
*                                enabled, either by default or by       00802300
*                                specifying QB=Y in the IEFSSNxx        00802600
*                                PARMLIB member.                  @L7A  00802900
                                                                        00803200
*********************************************************************** 00803600
*                                                                     * 00806400
* SUBTYPE 5 - OSREQ CHANGE FLAGS                                      * 00809200
*                                                                     * 00812000
*********************************************************************** 00814800
ST5FLG0  EQU    X'80'            WHEN ON, MANAGEMENT CLASS              00817600
*                                SPECIFIED ON OSREQ CHANGE.             00820400
ST5FLG1  EQU    X'40'            WHEN ON, STORAGE CLASS                 00823200
*                                SPECIFIED ON OSREQ CHANGE.             00826000
ST5FLG2  EQU    X'20'            WHEN ON, RETENTION PERIOD              00828800
*                                SPECIFIED ON OSREQ CHANGE.             00831600
ST5FLG3  EQU    X'10'            RETPD=-1                        @L8A   00832000
ST5FLG4  EQU    X'08'            RETPD=-2                        @L8A   00832400
ST5FLG5  EQU    X'04'            RETPD=X'7FFFFFFF'               @L8A   00832800
ST5FLG6  EQU    X'02'            EVENTEXP supplied               @L8A   00833200
ST5FLG7  EQU    X'01'            DELHOLD=HOLD                    @L8A   00833600
ST5FLG8  EQU    X'80'            DELHOLD=NOHOLD                  @L8A   00834000
*********************************************************************** 00834400
*                                                                     * 00837200
* SUBTYPE 6 - OSREQ DELETE FLAGS                                      * 00840000
*                                                                     * 00842800
*********************************************************************** 00845600
ST6FLG0  EQU    X'80'            WHEN ON, PRIMARY COPY OF OBJECT        00848400
*                                DELETED FROM Disk.                @L9C 00851200
ST6FLG1  EQU    X'40'            WHEN ON, PRIMARY COPY OF OBJECT        00854000
*                                DELETED FROM OPTICAL.                  00856800
ST6FLG2  EQU    X'20'            WHEN ON, PRIMARY COPY OF OBJECT        00859600
*                                DELETED FROM TAPE.                     00862400
ST6FLG3  EQU    X'10'            WHEN ON, BACKUP COPY OF OBJECT         00865200
*                                DELETED FROM OPTICAL.                  00868000
ST6FLG4  EQU    X'08'            WHEN ON, BACKUP COPY OF OBJECT         00870800
*                                DELETED FROM TAPE.                     00873600
ST6FLG5  EQU    X'04'            WHEN ON, 2ND BACKUP COPY OF OBJECT     00874100
*                                DELETED FROM OPTICAL.             @L2A 00874600
ST6FLG6  EQU    X'02'            WHEN ON, 2ND BACKUP COPY OF OBJECT     00875100
*                                DELETED FROM TAPE.                @L2A 00875600
ST6FLG7  EQU    X'01'            WHEN ON, THE PRIMARY COPY OF           00875800
*                                THE OBJECT WAS DELETED FROM            00876000
*                                A LOB STORAGE STRUCTURE           @P6C 00876300
ST6FLG8 EQU    X'80'            WHEN ON, OBJECT DELETED FROM SUBLEVEL 1 00876700
*                               VOLUME.                            @L6A 00877200
ST6FLG9 EQU    X'40'            WHEN ON, OBJECT DELETED FROM SUBLEVEL 2 00877700
*                               VOLUME.                            @L6A 00878200
ST6FLG10 EQU    X'20'           Reserved                           @PCA 00878400
ST6FLG11 EQU    X'10'           WHEN ON, PRIMARY COPY OF OBJECT         00878401
*                               DELETED FROM CLOUD                 @LFA 00878402
ST6FLG12 EQU    X'08'           WHEN ON, FIRST BACKUP COPY OF OBJECT    00878403
*                               DELETED FROM CLOUD                 @LGA 00878404
ST6FLG13 EQU    X'04'           WHEN ON, FIRST BACKUP COPY OF OBJECT    00878405
*                               DELETED FROM FILE SYSTEM           @LGA 00878406
ST6FLG14 EQU    X'02'           WHEN ON, SECOND BACKUP COPY OF OBJECT   00878407
*                               DELETED FROM CLOUD                 @LGA 00878408
ST6FLG15 EQU    X'01'           WHEN ON, SECOND BACKUP COPY OF OBJECT   00878409
*                               DELETED FROM FILE SYSTEM           @LGA 00878410
*********************************************************************** 00878700
*                                                                     * 00879200
* SUBTYPE 7 - OSREQ UNACCESS FLAGS                                    * 00882000
*                                                                     * 00884800
*********************************************************************** 00887600
*********************************************************************** 00887700
*                                                                     * 00887800
* SUBTYPE 8 - OSREQ STOREBEG FLAGS                                @L7A* 00887900
*                                                                     * 00888000
*********************************************************************** 00888100
*********************************************************************** 00888200
*                                                                     * 00888300
* SUBTYPE 9 - OSREQ STOREPRT FLAGS                                @L7A* 00888400
*                                                                     * 00888500
*********************************************************************** 00888600
*********************************************************************** 00888700
*                                                                     * 00888800
* SUBTYPE 10 - OSREQ STOREEND FLAGS                               @L7A* 00888900
*                                                                     * 00889000
*********************************************************************** 00889100
ST10FLGS0 EQU   X'80'            When on, the object is stored to Disk. 00889200
*                                                                  @L9C 00889300
ST10FLGS1 EQU   X'40'            UNUSED                            @L8A 00889400
ST10FLGS2 EQU   X'20'            Object store to Tape              @L8A 00889500
ST10FLGS3 EQU   X'10'            Object store to Cloud             @LFC 00889600
ST10FLGS4 EQU   X'08'            UNUSED                                 00889700
ST10FLGS5 EQU   X'04'            Volume on shelf                   @L8A 00889800
ST10FLGS6 EQU   X'02'            Volume in library                 @L8A 00889900
ST10FLGS7 EQU   X'01'            Volume on drive                   @L8A 00890000
ST10FLGS8 EQU   X'80'            Immediate backup copy was sched   @L8A 00890100
ST10FLGS9 EQU   X'40'            WHEN ON, THE OBJECT IS STORED          00890200
*                                TO LOB STORAGE STRUCTURE               00890300
ST10FLGS10 EQU  X'20'            Obj. store to sublvl1             @L8A 00890400
ST10FLGS11 EQU  X'10'            Obj. store to sublvl2             @L8A 00890500
ST10FLGS12 EQU  X'08'            When on, the CANCEL=YES keyword was    00890600
*                                specified indicating the store         00890700
*                                sequence was successfully cancelled.   00890800
ST10FLGS13 EQU  X'04'            DELHOLD=HOLD                      @L8A 00891000
ST10FLGS14 EQU  X'02'            Retention-protected               @L8A 00891300
ST10FLGS15 EQU  X'01'            Deletion-protected                @L8A 00891600
ST10FLGS16 EQU  X'80'            Event-based-retention             @L8A 00891900
ST10FLGS17 EQU  X'40'            Reserved                          @PCA 00892000
                                                                        00892200
         EJECT                                                          00892500
*********************************************************************** 00893200
*                                                                     * 00896000
*   OAM SUBTYPE SECTION, FOR SUBTYPES 32 - 35                         * 00898800
*                                                                     * 00901600
*   SUBTYPE FUNCTION                                                  * 00904400
*   ------- ---------------------------------------------------       * 00907200
*        32 OSMC STORAGE GROUP PROCESSING                             * 00910000
*        33 OSMC DASD SPACE MANAGEMENT PROCESSING                     * 00912800
*        34 OSMC OPTICAL DISK RECOVERY UTILITY                        * 00915600
*        35 OSMC MOVE VOLUME (MOVEVOL) UTILITY                        * 00918400
*                                                                     * 00921200
*********************************************************************** 00924000
ST32     DSECT                   SUBTYPES 32 - 35                       00926800
ST32SGN  DS     CL8' '           STORAGE GROUP NAME                     00929600
ST32VSN0 DS     CL6' '           VOLUME SERIAL NUMBER OF A TAPE OR      00931900
*                                OPTICAL VOLUME.  ONLY VALID FOR        00934200
*                                SUBTYPES 34 AND 35, THIS FIELD         00936500
*                                CONTAINS BLANKS FOR ALL OTHER          00938800
*                                SUBTYPES.                       @P8C   00941100
ST32VSN1 DS     CL6' '           VOLUME SERIAL NUMBER OF OPPOSITE       00943600
*                                SIDE OF AN OPTICAL VOLUME.             00945100
*                                ONLY VALID FOR SUBTYPES 34 and 35.     00946600
*                                IF THE VOLUME SERIAL NUMBER CONTAINED  00948100
*                                IN FIELD ST32VSN0 IS THE VOLUME        00949600
*                                SERIAL NUMBER OF A TAPE VOLUME, THIS   00951100
*                                FIELD WILL BE 'N/A'.  THIS FIELD       00952600
*                                CONTAINS BLANKS FOR ALL OTHER          00954100
*                                SUBTYPES.                       @P8C   00955600
ST32OMT  DS     CL2' '           OPTICAL MEDIA TYPE. ONLY VALID         00957600
*                                FOR SUBTYPES 34 AND 35, CONTAINS       00960400
*                                BLANKS FOR OTHER SUBTYPES.             00963200
         DS     CL2' '           RESERVED                               00966000
*********************************************************************** 00968800
* COUNTS OF PRIMARY OBJECTS (AND KILOBYTES) WRITTEN, READ AND           00971600
* DELETED FROM DISK SUBLEVEL 1 (DSL1).                             @LAC 00974400
*********************************************************************** 00977200
ST32PDWO DS     BL4'0'           NUMBER OF PRIMARY OBJECTS              00980000
*                                WRITTEN TO DSL1.                  @LAC 00982800
ST32PDWK DS     BL4'0'           NUMBER OF KILOBYTES PRIMARY            00985600
*                                OBJECTS WRITTEN TO DSL1.               00987000
*                                SUPERSEDED BY ST32PDWB.                00988400
*                                SEE NOTE 1.                       @LAC 00989800
ST32PDRO DS     BL4'0'           NUMBER OF PRIMARY OBJECTS              00991200
*                                READ FROM DSL1.                   @LAC 00994000
ST32PDRK DS     BL4'0'           NUMBER OF KILOBYTES PRIMARY            00996800
*                                OBJECTS READ FROM DSL1.                00998200
*                                SUPERSEDED BY ST32PDRB.                00999600
*                                SEE NOTE 1.                       @LAC 01001000
ST32PDDO DS     BL4'0'           NUMBER OF PRIMARY OBJECTS              01002400
*                                DELETED FROM DSL1.                @LAC 01005200
ST32PDDK DS     BL4'0'           NUMBER OF KILOBYTES OF PRIMARY         01008000
*                                OBJECTS DELETED FROM DSL1.             01009400
*                                SUPERSEDED BY ST32PDDB.                01010800
*                                SEE NOTE 1.                       @LAC 01012200
*********************************************************************** 01013600
* COUNTS OF PRIMARY OBJECTS (AND KILOBYTES) WRITTEN, READ AND           01016400
* DELETED FROM OPTICAL.                                                 01019200
*********************************************************************** 01022000
ST32POWO DS     BL4'0'           NUMBER OF PRIMARY OBJECTS              01024800
*                                WRITTEN TO OPTICAL.                    01027600
ST32POWK DS     BL4'0'           NUMBER OF KILOBYTES OF PRIMARY         01030400
*                                OBJECTS WRITTEN TO OPTICAL.            01033200
*                                SUPERSEDED BY ST32POWB.                01034100
*                                SEE NOTE 1.                       @LAC 01035000
ST32PORO DS     BL4'0'           NUMBER OF PRIMARY OBJECTS              01036000
*                                READ FROM OPTICAL.                     01038800
ST32PORK DS     BL4'0'           NUMBER OF KILOBYTES OF PRIMARY         01041600
*                                OBJECTS READ FROM OPTICAL.             01044400
*                                SUPERSEDED BY ST32PORB.                01045300
*                                SEE NOTE 1.                       @LAC 01046200
ST32PODO DS     BL4'0'           NUMBER OF PRIMARY OBJECTS              01047200
*                                DELETED FROM OPTICAL.                  01050000
ST32PODK DS     BL4'0'           NUMBER OF KILOBYTES OF PRIMARY         01052800
*                                OBJECTS DELETED FROM OPTICAL.          01055600
*                                SUPERSEDED BY ST32PODB.                01056500
*                                SEE NOTE 1.                       @LAC 01057400
*********************************************************************** 01058400
* COUNTS OF PRIMARY OBJECTS (AND KILOBYTES) WRITTEN, READ AND           01061200
* DELETED FROM TAPE.                                                    01064000
*********************************************************************** 01066800
ST32PTWO DS     BL4'0'           NUMBER OF PRIMARY OBJECTS              01069600
*                                WRITTEN TO TAPE.                       01072400
ST32PTWK DS     BL4'0'           NUMBER OF KILOBYTES OF PRIMARY         01075200
*                                OBJECTS WRITTEN TO TAPE.               01078000
*                                SUPERSEDED BY ST32PTWB.                01078900
*                                SEE NOTE 1.                       @LAC 01079800
ST32PTRO DS     BL4'0'           NUMBER OF PRIMARY OBJECTS              01080800
*                                READ FROM TAPE.                        01083600
ST32PTRK DS     BL4'0'           NUMBER OF KILOBYTES OF PRIMARY         01086400
*                                OBJECTS READ FROM TAPE.                01089200
*                                SUPERSEDED BY ST32PTRB.                01090100
*                                SEE NOTE 1.                       @LAC 01091000
ST32PTDO DS     BL4'0'           NUMBER OF PRIMARY OBJECTS              01092000
*                                LOGICALLY DELETED FROM TAPE.           01094800
ST32PTDK DS     BL4'0'           NUMBER OF KILOBYTES OF PRIMARY         01097600
*                                OBJECTS LOGICALLY DELETED FROM         01100400
*                                TAPE. SUPERSEDED BY ST32PTDB.          01101300
*                                SEE NOTE 1.                       @LAC 01102200
*********************************************************************** 01103300
* COUNTS OF BACKUP OBJECTS (AND KILOBYTES) WRITTEN, READ AND            01109400
* DELETED FROM OPTICAL.                                                 01111600
*********************************************************************** 01114400
ST32BOWO DS     BL4'0'           NUMBER OF BACKUP  OBJECTS              01117200
*                                WRITTEN TO OPTICAL.                    01120000
ST32BOWK DS     BL4'0'           NUMBER OF KILOBYTES OF BACKUP          01122800
*                                OBJECTS WRITTEN TO OPTICAL.            01125600
*                                SUPERSEDED BY ST32BOWB.                01126500
*                                SEE NOTE 1.                       @LAC 01127400
ST32BORO DS     BL4'0'           NUMBER OF BACKUP OBJECTS               01128400
*                                READ FROM OPTICAL.                     01131200
ST32BORK DS     BL4'0'           NUMBER OF KILOBYTES OF BACKUP          01134000
*                                OBJECTS READ FROM OPTICAL.             01136800
*                                SUPERSEDED BY ST32BORB.                01137700
*                                SEE NOTE 1.                       @LAC 01138600
ST32BODO DS     BL4'0'           NUMBER OF BACKUP  OBJECTS              01139600
*                                DELETED FROM OPTICAL.                  01142400
ST32BODK DS     BL4'0'           NUMBER OF KILOBYTES OF BACKUP          01145200
*                                OBJECTS DELETED FROM OPTICAL.          01148000
*                                SUPERSEDED BY ST32BODB.                01148900
*                                SEE NOTE 1.                       @LAC 01149800
*********************************************************************** 01150800
* COUNTS OF BACKUP OBJECTS (AND KILOBYTES) WRITTEN, READ AND            01153600
* DELETED FROM TAPE.                                                    01156400
*********************************************************************** 01159200
ST32BTWO DS     BL4'0'           NUMBER OF BACKUP  OBJECTS              01162000
*                                WRITTEN TO TAPE.                       01164800
ST32BTWK DS     BL4'0'           NUMBER OF KILOBYTES OF BACKUP          01167600
*                                OBJECTS WRITTEN TO TAPE.               01170400
*                                SUPERSEDED BY ST32BTWB.                01171300
*                                SEE NOTE 1.                       @LAC 01172200
ST32BTRO DS     BL4'0'           NUMBER OF BACKUP  OBJECTS              01173200
*                                READ FROM TAPE.                        01176000
ST32BTRK DS     BL4'0'           NUMBER OF KILOBYTES OF BACKUP          01178800
*                                OBJECTS READ FROM TAPE.                01181600
*                                SUPERSEDED BY ST32BTRB.                01182500
*                                SEE NOTE 1.                       @LAC 01183400
ST32BTDO DS     BL4'0'           NUMBER OF BACKUP  OBJECTS              01184400
*                                LOGICALLY DELETED FROM TAPE.           01187200
ST32BTDK DS     BL4'0'           NUMBER OF KILOBYTES OF BACKUP          01190000
*                                OBJECTS LOGICALLY DELETED FROM         01192800
*                                TAPE. SUPERSEDED BY ST32BTDB.          01193700
*                                SEE NOTE 1.                       @LAC 01194600
*********************************************************************** 01195700
* COUNTS OF BACKUP2 OBJECTS (AND KILOBYTES) WRITTEN, READ AND    @L2A   01195800
* DELETED FROM OPTICAL.                                          @L2A   01195900
*********************************************************************** 01196000
ST32B2OWO DS     BL4'0'          NUMBER OF BACKUP2 OBJECTS       @L2A   01196100
*                                WRITTEN TO OPTICAL.             @L2A   01196200
ST32B2OWK DS     BL4'0'          NUMBER OF KILOBYTES OF BACKUP2  @L2A   01196300
*                                OBJECTS WRITTEN TO OPTICAL.     @L2A   01196400
*                                SUPERSEDED BY ST32B2OWB.        @LAC   01196500
*                                SEE NOTE 1.                     @LAC   01196600
ST32B2ORO DS     BL4'0'          NUMBER OF BACKUP2 OBJECTS       @L2A   01196700
*                                READ FROM OPTICAL.              @L2A   01196800
ST32B2ORK DS     BL4'0'          NUMBER OF KILOBYTES OF BACKUP2  @L2A   01196900
*                                OBJECTS READ FROM OPTICAL.      @L2A   01197000
*                                SUPERSEDED BY ST32B2ORB.        @LAC   01197100
*                                SEE NOTE 1.                     @LAC   01197200
ST32B2ODO DS     BL4'0'          NUMBER OF BACKUP2  OBJECTS      @L2A   01197300
*                                DELETED FROM OPTICAL.           @L2A   01197400
ST32B2ODK DS     BL4'0'          NUMBER OF KILOBYTES OF BACKUP2  @L2A   01197500
*                                OBJECTS DELETED FROM OPTICAL.   @L2A   01197600
*                                SUPERSEDED BY ST32B2ODB.        @LAC   01197700
*                                SEE NOTE 1.                     @LAC   01197800
*********************************************************************** 01197900
* COUNTS OF BACKUP2 OBJECTS (AND KILOBYTES) WRITTEN, READ AND    @L2A   01198000
* DELETED FROM TAPE.                                             @L2A   01198100
*********************************************************************** 01198200
ST32B2TWO DS     BL4'0'          NUMBER OF BACKUP2 OBJECTS       @L2A   01198300
*                                WRITTEN TO TAPE.                @L2A   01198400
ST32B2TWK DS     BL4'0'          NUMBER OF KILOBYTES OF BACKUP2  @L2A   01198500
*                                OBJECTS WRITTEN TO TAPE.        @L2A   01198600
*                                SUPERSEDED BY ST32B2TWB.        @LAC   01198700
*                                SEE NOTE 1.                     @LAC   01198800
ST32B2TRO DS     BL4'0'          NUMBER OF BACKUP2 OBJECTS       @L2A   01198900
*                                READ FROM TAPE.                 @L2A   01199000
ST32B2TRK DS     BL4'0'          NUMBER OF KILOBYTES OF BACKUP2  @L2A   01199100
*                                OBJECTS READ FROM TAPE.         @L2A   01199200
*                                SUPERSEDED BY ST32B2TRB.        @LAC   01199300
*                                SEE NOTE 1.                     @LAC   01199400
ST32B2TDO DS     BL4'0'          NUMBER OF BACKUP2 OBJECTS       @L2A   01199500
*                                LOGICALLY DELETED FROM TAPE.    @L2A   01199600
ST32B2TDK DS     BL4'0'          NUMBER OF KILOBYTES OF BACKUP2  @L2A   01199700
*                                OBJECTS LOGICALLY DELETED FROM  @L2A   01199800
*                                TAPE. SUPERSEDED BY ST32B2TDB.  @LAC   01199900
*                                SEE NOTE 1.                     @LAC   01200000
*********************************************************************** 01200100
* COUNTS OF ACTIVITY AGAINST THE OBJECT STORAGE DATABASE                01201200
* (OBJECT DIRECTORY TABLE, 4K OBJECT STORAGE TABLE AND 32K              01204000
* OBJECT STORAGE TABLE).                                                01206800
*********************************************************************** 01209600
ST32DTUP DS     BL4'0'           NUMBER OF ROWS UPDATED IN THE          01212400
*                                OBJECT DIRECTORY TABLE.                01215200
ST32DTDE DS     BL4'0'           NUMBER OF ROWS DELETED FROM THE        01218000
*                                OBJECT DIRECTORY TABLE.                01220800
ST324KIN DS     BL4'0'           NUMBER OF ROWS INSERTED INTO THE       01223600
*                                4K OBJECT STORAGE TABLE.               01226400
ST324KDE DS     BL4'0'           NUMBER OF ROWS DELETED FROM THE        01229200
*                                4K OBJECT STORAGE TABLE.               01232000
ST3232KI DS     BL4'0'           NUMBER OF ROWS INSERTED INTO THE       01234800
*                                32K OBJECT STORAGE TABLE.              01237600
ST3232KD DS     BL4'0'           NUMBER OF ROWS DELETED FROM THE        01240400
*                                32K OBJECT STORAGE TABLE.              01243200
ST32NCE  DS     BL4'0'           NUMBER OF OPTICAL CARTRIDGES           01246000
*                                EXPIRED.  VALID ONLY FOR               01248800
*                                SUBTYPE 32.                            01251600
ST32FLGS DS     BL4'0'           PROCESSING FLAGS                       01254400
ST32FLG0 EQU    X'80'            WHEN ON, THIS PROCESS WAS              01257200
*                                INVOKED AUTOMATICALLY UNDER            01260000
*                                SOFTWARE CONTROL.                      01262800
ST32FLG1 EQU    X'40'            WHEN ON, THIS PROCESS WAS              01265600
*                                INVOKED BY A MODIFY OAM,START          01268400
*                                COMMAND.                               01271200
ST32FLG2 EQU    X'20'            WHEN ON, THIS PROCESS WAS              01274000
*                                INVOKED USING AN ISMF LINE             01276800
*                                OPERATOR.                              01279600
ST32FLG3 EQU    X'10'            WHEN ON, VOL RECOVERY WAS              01280000
*                                INVOKED W/ BACKUP1 KEYWORD OR          01280400
*                                DEFAULTED TO BACKUP1            @L2A   01280800
ST32FLG4 EQU    X'08'            WHEN ON, VOL RECOVERY WAS              01281200
*                                INVOKED W/ BACKUP2 KEYWORD      @L2A   01281400
ST32FLG5 EQU    X'04'            WHEN ON, VOL RECOVERY OR MOVEVOL WAS   01281600
*                                SPECIFIED WITH DELETE OPTION    @L3A   01281800
ST32FLG6 EQU    X'02'            WHEN ON, VOL RECOVERY OR MOVEVOL WAS   01282000
*                                SPECIFIED WITH RECYCLE OPTION   @L3A   01282200
ST32FLG7 EQU    X'01'            WHEN ON, INDICATED PROCESSING OBJECT   01282400
*                                STORAGE GROUP                   @L3A   01282600
ST32FLG8 EQU    X'80'            WHEN ON, INDICATED PROCESSING BACKUP   01282800
*                                OBJECT STORAGE GROUP            @L3A   01283000
ST32FLG9 EQU    X'40'            WHEN ON, CYCLE ENDTIME EXCEEDED @L3A   01283200
*                                                                       01283400
ST32FL10 EQU    X'20'            When on, automatic backup delete @LBA  01283500
*                                was enabled during this cycle          01283600
ST32NTE  DS     BL4'0'           NUMBER OF TAPE VOLUMES EXPIRED         01283700
*                                VALID ONLY FOR SUBTYPE 32       @L3A   01283800
ST32RCLD DS     BL4'0'           NUMBER OF RECALLED OBJECTS             01283900
*                                VALID ONLY FOR SUBTYPE 32       @P4A   01284000
ST32RCLK DS     BL4'0'           NUMBER OF KILOBYTES OF                 01284100
*                                RECALLED OBJECTS                       01284200
*                                SUPERSEDED BY ST32RCLB.                01284300
*                                SEE NOTE 1.                     @LAC   01284400
*                                VALID ONLY FOR SUBTYPE 32       @P4A   01284500
ST32LOBI DS     BL4'0'           NUMBER OF LOB ROWS INSERTED            01284600
*                                VALID ONLY FOR SUBTYPE 32       @P4A   01284700
ST32LOBD DS     BL4'0'           NUMBER OF LOB ROWS DELETED             01284800
*                                VALID ONLY FOR SUBTYPE 32       @P4A   01284900
*********************************************************************** 01285000
* COUNTS OF PRIMARY OBJECTS (AND KILOBYTES) WRITTEN, READ AND           01285100
* DELETED FROM TAPE SUBLEVEL 2 (TSL2).                            @L6A  01285200
*********************************************************************** 01285300
ST32PUWO DS     BL4'0'           NUMBER OF PRIMARY OBJECTS              01285400
*                                WRITTEN TO TSL2.                 @L6A  01285500
ST32PUWK DS     BL4'0'           NUMBER OF KILOBYTES OF PRIMARY         01285600
*                                OBJECTS WRITTEN TO TSL2.               01285700
*                                SUPERSEDED BY ST32PUWB.                01285800
*                                SEE NOTE 1.                      @LAC  01285900
ST32PURO DS     BL4'0'           NUMBER OF PRIMARY OBJECTS              01286000
*                                READ FROM TSL2.                  @L6A  01286100
ST32PURK DS     BL4'0'           NUMBER OF KILOBYTES OF PRIMARY         01286200
*                                OBJECTS READ FROM TSL2.                01286300
*                                SUPERSEDED BY ST32PURB.                01286400
*                                SEE NOTE 1.                      @LAC  01286500
ST32PUDO DS     BL4'0'           NUMBER OF PRIMARY OBJECTS              01286600
*                                LOGICALLY DELETED FROM TSL2.     @L6A  01286700
ST32PUDK DS     BL4'0'           NUMBER OF KILOBYTES OF PRIMARY         01286800
*                                OBJECTS LOGICALLY DELETED FROM         01287000
*                                TSL2. SUPERSEDED BY ST32PUDB.          01287100
*                                SEE NOTE 1.                      @LAC  01287200
*********************************************************************** 01287300
* COUNTS OF PRIMARY OBJECTS WRITTEN, READ, AND DELETED FROM             01287400
* DISK SUBLEVEL 2 (DSL2).                                         @LAA  01287500
*********************************************************************** 01287600
ST32PEWO DS     BL4'0'           NUMBER OF PRIMARY OBJECTS              01287700
*                                WRITTEN TO DSL2.                 @LAA  01287900
ST32PERO DS     BL4'0'           NUMBER OF PRIMARY OBJECTS              01288100
*                                READ FROM DSL2.                  @LAA  01288300
ST32PEDO DS     BL4'0'           NUMBER OF PRIMARY OBJECTS              01288500
*                                LOGICALLY DELETED FROM DSL2.     @LAA  01288600
*********************************************************************** 01288700
* BYTE COUNTS OF PRIMARY OBJECTS WRITTEN, READ AND                      01288800
* DELETED FROM DISK SUBLEVEL 1 (DSL1).                            @LAA  01288900
*********************************************************************** 01289000
ST32PDWB DS     BL8'0'           NUMBER OF BYTES OF PRIMARY             01289100
*                                OBJECTS WRITTEN TO DSL1.         @LAA  01289200
ST32PDRB DS     BL8'0'           NUMBER OF BYTES OF PRIMARY             01289300
*                                OBJECTS READ FROM DSL1.          @LAA  01289400
ST32PDDB DS     BL8'0'           NUMBER OF BYTES OF PRIMARY             01289500
*                                OBJECTS DELETED FROM DSL1.       @LAA  01289600
*********************************************************************** 01289700
* BYTE COUNTS OF PRIMARY OBJECTS WRITTEN, READ AND                      01289800
* DELETED FROM OPTICAL.                                           @LAA  01289900
*********************************************************************** 01290000
ST32POWB DS     BL8'0'           NUMBER OF BYTES OF PRIMARY             01290100
*                                OBJECTS WRITTEN TO OPTICAL.      @LAA  01290200
ST32PORB DS     BL8'0'           NUMBER OF BYTES OF PRIMARY             01290300
*                                OBJECTS READ FROM OPTICAL.       @LAA  01290400
ST32PODB DS     BL8'0'           NUMBER OF BYTES OF PRIMARY             01290500
*                                OBJECTS DELETED FROM OPTICAL.    @LAA  01290600
*********************************************************************** 01290700
* BYTE COUNTS OF PRIMARY OBJECTS WRITTEN, READ AND                      01290800
* DELETED FROM TAPE.                                              @LAA  01290900
*********************************************************************** 01291000
ST32PTWB DS     BL8'0'           NUMBER OF BYTES OF PRIMARY             01291100
*                                OBJECTS WRITTEN TO TAPE.         @LAA  01291200
ST32PTRB DS     BL8'0'           NUMBER OF BYTES OF PRIMARY             01291300
*                                OBJECTS READ FROM TAPE.          @LAA  01291400
ST32PTDB DS     BL8'0'           NUMBER OF BYTES OF PRIMARY             01291500
*                                OBJECTS LOGICALLY DELETED FROM         01291600
*                                TAPE.                            @LAA  01291700
*********************************************************************** 01291800
* BYTE COUNTS OF BACKUP OBJECTS WRITTEN, READ AND                       01291900
* DELETED FROM OPTICAL.                                           @LAA  01292000
*********************************************************************** 01292100
ST32BOWB DS     BL8'0'           NUMBER OF BYTES OF BACKUP              01292200
*                                OBJECTS WRITTEN TO OPTICAL.      @LAA  01292300
ST32BORB DS     BL8'0'           NUMBER OF BYTES OF BACKUP              01292400
*                                OBJECTS READ FROM OPTICAL.       @PCC  01292500
ST32BODB DS     BL8'0'           NUMBER OF BYTES OF BACKUP              01292600
*                                OBJECTS DELETED FROM OPTICAL.    @LAA  01292700
*********************************************************************** 01292800
* BYTE COUNTS OF BACKUP OBJECTS WRITTEN, READ AND                       01292900
* DELETED FROM TAPE.                                              @LAA  01293000
*********************************************************************** 01293100
ST32BTWB DS     BL8'0'           NUMBER OF BYTES OF BACKUP              01293200
*                                OBJECTS WRITTEN TO TAPE.         @LAA  01293300
ST32BTRB DS     BL8'0'           NUMBER OF BYTES OF BACKUP              01293400
*                                OBJECTS READ FROM TAPE.          @LAA  01293500
ST32BTDB DS     BL8'0'           NUMBER OF BYTES OF BACKUP              01293600
*                                OBJECTS LOGICALLY DELETED FROM         01293700
*                                TAPE.                            @LAA  01293800
*********************************************************************** 01293900
* BYTE COUNTS OF BACKUP2 OBJECTS WRITTEN, READ AND                      01294000
* DELETED FROM OPTICAL.                                           @LAA  01294100
*********************************************************************** 01294200
ST32B2OWB DS     BL8'0'          NUMBER OF BYTES OF BACKUP2             01294300
*                                OBJECTS WRITTEN TO                     01294400
*                                OPTICAL.                         @LAA  01294500
ST32B2ORB DS     BL8'0'          NUMBER OF BYTES OF BACKUP2             01294600
*                                OBJECTS READ FROM OPTICAL.       @LAA  01294700
ST32B2ODB DS     BL8'0'          NUMBER OF BYTES OF BACKUP2             01294800
*                                OBJECTS DELETED FROM                   01294900
*                                OPTICAL.                         @LAA  01295000
*********************************************************************** 01295100
* BYTE COUNTS OF BACKUP2 OBJECTS WRITTEN, READ AND                      01295200
* DELETED FROM TAPE.                                              @LAA  01295300
*********************************************************************** 01295400
ST32B2TWB DS     BL8'0'          NUMBER OF BYTES OF BACKUP2             01295500
*                                OBJECTS WRITTEN TO TAPE.         @LAA  01295600
ST32B2TRB DS     BL8'0'          NUMBER OF BYTES OF BACKUP2             01295700
*                                OBJECTS READ FROM TAPE.          @LAA  01295800
ST32B2TDB DS     BL8'0'          NUMBER OF BYTES OF BACKUP2             01295900
*                                OBJECTS LOGICALLY DELETED FROM         01296000
*                                TAPE.                            @LAA  01296100
*********************************************************************** 01296200
* BYTE COUNTS OF RECALLED OBJECTS                                 @LAA  01296300
*********************************************************************** 01296400
ST32RCLB DS      BL8'0'          NUMBER OF BYTES OF                     01296500
*                                RECALLED OBJECTS.                @LAA  01296600
*********************************************************************** 01296700
* BYTE COUNTS OF PRIMARY OBJECTS WRITTEN, READ AND                      01296800
* DELETED FROM TAPE SUBLEVEL 2 (TSL2).                                  01296900
*********************************************************************** 01297000
ST32PUWB DS      BL8'0'          NUMBER OF BYTES OF PRIMARY             01297100
*                                OBJECTS WRITTEN TO TSL2.         @LAA  01297200
ST32PURB DS      BL8'0'          NUMBER OF BYTES OF PRIMARY             01297300
*                                OBJECTS READ FROM TSL2.          @LAA  01297400
ST32PUDB DS      BL8'0'          NUMBER OF BYTES OF PRIMARY             01297500
*                                OBJECTS LOGICALLY DELETED FROM         01297600
*                                TSL2.                            @LAA  01297700
*********************************************************************** 01297800
* BYTE COUNTS OF PRIMARY OBJECTS WRITTEN, READ AND                      01297900
* DELETED FROM DISK SUBLEVEL 2 (DSL2).                            @LAA  01298000
*********************************************************************** 01298100
ST32PEWB DS      BL8'0'          NUMBER OF BYTES OF PRIMARY             01298200
*                                OBJECTS WRITTEN TO DSL2.         @LAA  01298300
ST32PERB DS      BL8'0'          NUMBER OF BYTES OF PRIMARY             01298400
*                                OBJECTS READ FROM DSL2.          @LAA  01298500
ST32PEDB DS      BL8'0'          NUMBER OF BYTES OF PRIMARY             01298600
*                                OBJECTS LOGICALLY DELETED FROM         01298700
*                                DSL2.                            @LAA  01298800
*********************************************************************** 01299000
*                                                                     * 01299200
* NOTE 1: 4 BYTE FIELDS REPORTING KILOBYTE VALUES HAVE BEEN           * 01299400
*         SUPERSEDED BY CORRESPONDING 8 BYTE FIELDS REPORTING VALUES  * 01299600
*         IN BYTES. THE EXISTING 4 BYTE FIELDS WILL CONTAIN           * 01299800
*         X'FFFF FFFF' IF AN OVERFLOW CONDITION OCCURS.               * 01300000
*                                                                     * 01300200
*********************************************************************** 01300400
*********************************************************************** 01300500
* Counts of number of backup copies and bytes deleted as a result       01300600
* of automatic backup deletion during storage group processing    @LBA  01300700
*********************************************************************** 01300800
ST32BOAO  DS    BL4'0'           Number of backup objects auto          01300900
*                                deleted from optical             @LBA  01301000
ST32B2OAO DS    BL4'0'           Number of backup 2 objects auto        01301100
*                                deleted from optical             @LBA  01301200
ST32BTAO  DS    BL4'0'           Number of backup objects auto          01301300
*                                deleted from tape                @LBA  01301400
ST32B2TAO DS    BL4'0'           Number of backup 2 objects auto        01301500
*                                deleted from tape                @LBA  01301600
ST32BOAB  DS    BL8'0'           Number of bytes of backup objects      01301700
*                                auto deleted from optical        @LBA  01301800
ST32B2OAB DS    BL8'0'           Number of bytes of backup 2 objects    01301900
*                                auto deleted from optical        @LBA  01302000
ST32BTAB  DS    BL8'0'           Number of bytes of backup objects      01302100
*                                auto deleted from tape           @LBA  01302200
ST32B2TAB DS    BL8'0'           Number of bytes of backup 2 objects    01302300
*                                auto deleted from tape           @LBA  01302400
*********************************************************************** 01302401
* BYTE COUNTS OF PRIMARY OBJECTS WRITTEN, READ, AND DELETED             01302402
* FROM CLOUD.                                                           01302404
*********************************************************************** 01302405
ST32PCWB  DS    BL8'0'           NUMBER OF BYTES OF PRIMARY             01302406
*                                OBJECTS WRITTEN TO CLOUD.        @LFA  01302407
ST32PCRB  DS    BL8'0'           NUMBER OF BYTES OF PRIMARY             01302408
*                                OBJECTS READ FROM CLOUD.         @LFA  01302409
ST32PCDB  DS    BL8'0'           NUMBER OF BYTES OF PRIMARY             01302410
*                                OBJECTS DELETED FROM CLOUD.      @LFA  01302411
*********************************************************************** 01302412
* BYTE COUNTS OF BACKUP OBJECTS WRITTEN, READ, AND DELETED              01302413
* FROM CLOUD.                                                           01302414
*********************************************************************** 01302415
ST32BCWB  DS    BL8'0'           NUMBER OF BYTES OF BACKUP              01302416
*                                OBJECTS WRITTEN TO CLOUD.        @LGC  01302417
ST32BCRB  DS    BL8'0'           NUMBER OF BYTES OF BACKUP              01302418
*                                OBJECTS READ FROM CLOUD.         @LGA  01302419
ST32BCDB  DS    BL8'0'           NUMBER OF BYTES OF BACKUP              01302420
*                                OBJECTS DELETED FROM CLOUD.      @LGA  01302421
*********************************************************************** 01302422
* BYTE COUNTS OF BACKUP2 OBJECTS WRITTEN, READ, AND DELETED             01302423
* FROM CLOUD.                                                           01302424
*********************************************************************** 01302425
ST32B2CWB DS    BL8'0'           NUMBER OF BYTES OF BACKUP2             01302426
*                                OBJECTS WRITTEN TO CLOUD.        @LGA  01302427
ST32B2CRB DS    BL8'0'           NUMBER OF BYTES OF BACKUP2             01302428
*                                OBJECTS READ FROM CLOUD.         @LGA  01302429
ST32B2CDB DS    BL8'0'           NUMBER OF BYTES OF BACKUP2             01302430
*                                OBJECTS DELETED FROM CLOUD.      @LGA  01302431
*********************************************************************** 01302432
* COUNTS OF PRIMARY OBJECTS WRITTEN, READ, AND DELETED                  01302433
* FROM CLOUD.                                                           01302434
*********************************************************************** 01302435
ST32PCWO  DS    BL4'0'           NUMBER OF PRIMARY OBJECTS              01302436
*                                WRITTEN TO CLOUD.                @LFA  01302437
ST32PCRO  DS    BL4'0'           NUMBER OF PRIMARY OBJECTS              01302438
*                                READ FROM CLOUD.                 @LFA  01302439
ST32PCDO  DS    BL4'0'           NUMBER OF PRIMARY OBJECTS              01302440
*                                DELETED FROM CLOUD.              @LFA  01302441
*********************************************************************** 01302442
* COUNTS OF BACKUP OBJECTS WRITTEN, READ, AND DELETED                   01302443
* FROM CLOUD.                                                           01302444
*********************************************************************** 01302445
ST32BCWO  DS    BL4'0'           NUMBER OF BACKUP OBJECTS               01302446
*                                WRITTEN TO CLOUD.                @LGA  01302447
ST32BCRO  DS    BL4'0'           NUMBER OF BACKUP OBJECTS               01302448
*                                READ FROM CLOUD.                 @LGA  01302449
ST32BCDO  DS    BL4'0'           NUMBER OF BACKUP OBJECTS               01302450
*                                DELETED FROM CLOUD.              @LGA  01302451
*********************************************************************** 01302453
* COUNTS OF BACKUP2 OBJECTS WRITTEN, READ, AND DELETED                  01302454
* FROM CLOUD.                                                           01302455
*********************************************************************** 01302456
ST32B2CWO DS    BL4'0'           NUMBER OF BACKUP2 OBJECTS              01302457
*                                WRITTEN TO CLOUD.                @LGA  01302458
ST32B2CRO DS    BL4'0'           NUMBER OF BACKUP2 OBJECTS              01302459
*                                READ FROM CLOUD.                 @LGA  01302460
ST32B2CDO DS    BL4'0'           NUMBER OF BACKUP2 OBJECTS              01302461
*                                DELETED FROM CLOUD.              @LGA  01302462
          DS    BL4'0'           RESERVED                         @LGA  01302463
*********************************************************************** 01302464
* BYTE COUNTS OF BACKUP OBJECTS WRITTEN, READ, AND DELETED              01302465
* FROM FILE SYSTEM.                                                     01302466
*********************************************************************** 01302467
ST32BEWB  DS    BL8'0'           NUMBER OF BYTES OF BACKUP              01302468
*                                OBJECTS WRITTEN TO FILE SYSTEM.  @LGA  01302469
ST32BERB  DS    BL8'0'           NUMBER OF BYTES OF BACKUP              01302470
*                                OBJECTS READ FROM FILE SYSTEM.   @LGA  01302471
ST32BEDB  DS    BL8'0'           NUMBER OF BYTES OF BACKUP              01302472
*                                OBJECTS DELETED FROM FILE SYSTEM.@LGA  01302473
*********************************************************************** 01302474
* BYTE COUNTS OF BACKUP2 OBJECTS WRITTEN, READ, AND DELETED             01302475
* FROM FILE SYSTEM.                                                     01302476
*********************************************************************** 01302477
ST32B2EWB DS    BL8'0'           NUMBER OF BYTES OF BACKUP2             01302478
*                                OBJECTS WRITTEN TO FILE SYSTEM.  @LGA  01302479
ST32B2ERB DS    BL8'0'           NUMBER OF BYTES OF BACKUP2             01302480
*                                OBJECTS READ FROM FILE SYSTEM.   @LGA  01302481
ST32B2EDB DS    BL8'0'           NUMBER OF BYTES OF BACKUP2             01302482
*                                OBJECTS DELETED FROM FILE SYSTEM.@LGA  01302483
*********************************************************************** 01302484
* COUNTS OF BACKUP OBJECTS WRITTEN, READ, AND DELETED                   01302485
* FROM FILE SYSTEM.                                                     01302486
*********************************************************************** 01302487
ST32BEWO  DS    BL4'0'           NUMBER OF BACKUP OBJECTS               01302488
*                                WRITTEN TO FILE SYSTEM.          @LGA  01302489
ST32BERO  DS    BL4'0'           NUMBER OF BACKUP OBJECTS               01302490
*                                READ FROM FILE SYSTEM.           @LGA  01302491
ST32BEDO  DS    BL4'0'           NUMBER OF BACKUP OBJECTS               01302492
*                                DELETED FROM FILE SYSTEM.        @LGA  01302493
*********************************************************************** 01302494
* COUNTS OF BACKUP2 OBJECTS WRITTEN, READ, AND DELETED                  01302495
* FROM FILE SYSTEM.                                                     01302496
*********************************************************************** 01302497
ST32B2EWO DS    BL4'0'           NUMBER OF BACKUP2 OBJECTS              01302498
*                                WRITTEN TO FILE SYSTEM.          @LGA  01302499
ST32B2ERO DS    BL4'0'           NUMBER OF BACKUP2 OBJECTS              01302500
*                                READ FROM FILE SYSTEM.           @LGA  01302501
ST32B2EDO DS    BL4'0'           NUMBER OF BACKUP2 OBJECTS              01302502
*                                DELETED FROM FILE SYSTEM.        @LGA  01302503
*********************************************************************** 01302504
* COUNTS OF NUMBER OF BACKUP AND BACKUP2 COPIES AND BYTES DELETED       01302505
* FROM CLOUD AND FILE SYSTEM AS A RESULT OF AUTOMATIC BACKUP            01302521
* DELETION DURING STORAGE GROUP PROCESSING.                             01302522
*********************************************************************** 01302523
ST32BCAO  DS    BL4'0'           NUMBER OF UNNEEDED BACKUP OBJECTS      01302524
*                                DELETED FROM CLOUD.              @LGA  01302525
ST32B2CAO DS    BL4'0'           NUMBER OF UNNEEDED BACKUP2 OBJECTS     01302526
*                                DELETED FROM CLOUD.              @LGA  01302527
ST32BEAO  DS    BL4'0'           NUMBER OF UNNEEDED BACKUP OBJECTS      01302528
*                                DELETED FROM FILE SYSTEM.        @LGA  01302529
ST32B2EAO DS    BL4'0'           NUMBER OF UNNEEDED BACKUP2 OBJECTS     01302530
*                                DELETED FROM FILE SYSTEM.        @LGA  01302531
ST32BCAB  DS    BL8'0'           NUMBER OF BYTES OF UNNEEDED BACKUP     01302533
*                                OBJECTS DELETED FROM CLOUD.      @LGA  01302534
ST32B2CAB DS    BL8'0'           NUMBER OF BYTES OF UNNEEDED BACKUP2    01302535
*                                OBJECTS DELETED FROM CLOUD.      @LGA  01302536
ST32BEAB  DS    BL8'0'           NUMBER OF BYTES OF UNNEEDED BACKUP     01302537
*                                OBJECTS DELETED FROM FILE SYSTEM.@LGA  01302538
ST32B2EAB DS    BL8'0'           NUMBER OF BYTES OF UNNEEDED BACKUP2    01302539
*                                OBJECTS DELETED FROM FILE SYSTEM.@LGA  01302540
         EJECT                                                          01302542
*********************************************************************** 01302600
*                                                                     * 01302700
*   OAM SUBTYPE SECTION, FOR SUBTYPE 36                               * 01302800
*                                                                     * 01302900
*   SUBTYPE FUNCTION                                                  * 01303000
*   ------- ---------------------------------------------------       * 01303100
*        36 OSMC SINGLE OBJECT RECOVERY UTILITY                       * 01303200
*                                                                     * 01304800
*********************************************************************** 01307600
ST36     DSECT                   SUBTYPE 36                             01310400
ST36COLN DS     CL44' '          COLLECTION NAME                        01313200
ST36CNID DS     BL4'0'           COLLECTION ID                          01316000
ST36OBJN DS     CL44' '          OBJECT NAME                            01318800
ST36SGN  DS     CL8' '           STORAGE GROUP NAME                     01321600
ST36OLEN DS     BL4'0'           OBJECT LENGTH                          01324400
ST36BVSN DS     CL6' '           VOLUME SERIAL NUMBER OF OPTICAL        01327200
*                                VOLUME OR TAPE VOLUME FROM WHICH       01330000
*                                THE BACKUP COPY OF THE OBJECT          01332800
*                                WAS READ.                              01335600
ST36BMT  DS     CL2' '           MEDIA TYPE OF THE VOLUME FROM          01338400
*                                WHICH THE BACKUP COPY OF THE           01341200
*                                BACKUP COPY OF THE OBJECT WAS          01344000
*                                READ.                                  01346800
ST36BTKN DS     BL4'0'           VOLUME LOCATION TOKEN ASSOCIATED       01349600
*                                WITH BACKUP COPY OF THE OBJECT         01352400
*                                ON THE VOLUME SPECIFIED IN THE         01355200
*                                ST36BVSN FIELD.                        01358000
ST36TVSN DS     CL6' '           VOLUME SERIAL NUMBER OF OPTICAL        01360800
*                                VOLUME OR TAPE VOLUME TO WHICH         01363600
*                                THE NEW PRIMARY COPY OF THE            01366400
*                                OBJECT WAS WRITTEN.  THIS FIELD        01369200
*                                CONTAINS BLANKS IF THE NEW             01372000
*                                LOCATION IS NOT IN THE OPTICAL         01374800
*                                OR TAPE LEVEL OF THE STORAGE           01374801
*                                HEIRARCHY.                       @LFC  01374802
ST36TMT  DS     CL2' '           MEDIA TYPE OF THE VOLUME TO            01380400
*                                WHICH THE NEW PRIMARY COPY OF          01383200
*                                OBJECT WAS WRITTEN.  THIS FIELD        01386000
*                                CONTAINS BLANKS IF THE NEW             01386001
*                                LOCATION IS NOT IN THE OPTICAL         01386002
*                                OR TAPE LEVEL OF THE STORAGE           01386003
*                                HEIRARCHY.                       @LFC  01386004
ST36OVSN DS     CL6' '           VOLUME SERIAL NUMBER OF THE      @P5C  01388800
*                                ORIGINAL OPTICAL OR TAPE VOLUME        01391600
*                                ON WHICH THE PRIMARY COPY OF THE       01394400
*                                OBJECT RESIDED PRIOR TO THE            01397200
*                                START OF THE SINGLE OBJECT             01400000
*                                RECOVERY UTILITY.  THIS FIELD          01402800
*                                CONTAINS BLANKS IF THE NEW             01402801
*                                LOCATION IS NOT IN THE OPTICAL         01402802
*                                OR TAPE LEVEL OF THE STORAGE           01402803
*                                HEIRARCHY.                       @LFC  01402804
ST36OMT  DS     CL2' '           MEDIA TYPE OF THE ORIGINAL             01414000
*                                OPTICAL OR TAPE VOLUME ON WHICH        01416800
*                                THE PRIMARY COPY OF THE OBJECT         01419600
*                                RESIDED PRIOR TO THE START OF          01422400
*                                THE SINGLE OBJECT RECOVERY             01425200
*                                UTILITY. THIS FIELD CONTAINS           01428000
*                                BLANKS IF THE NEW LOCATION IS          01428001
*                                NOT IN THE OPTICAL OR TAPE LEVEL       01428002
*                                OF THE STORAGE HEIRARCHY         @LFC  01428003
ST36FLGS DS     BL4'0'           PROCESSING FLAGS             @L2C      01438400
*                                                                       01440400
ST36FLG0 EQU    X'80'            WHEN ON, OBJECT RECOVERY               01442400
*                                INVOKED W/ BACKUP1 KEYWORD             01442800
*                                OR DEFAULTED TO BACKUP1      @L2A      01443200
ST36FLG1 EQU    X'40'            WHEN ON, OBJECT RECOVERY               01443600
*                                INVOKED W/ BACKUP2 KEYWORD   @L2A      01444000
ST36FLG2 EQU    X'20'            WHEN ON, BACKUP COPY IS                01444001
*                                RETRIEVED FROM CLOUD             @LGA  01444002
ST36FLG3 EQU    X'10'            WHEN ON, BACKUP COPY IS                01444003
*                                RETRIEVED FROM FILE SYSTEM       @LGA  01444004
ST36DSL  DS     CL2' '           Disk sublevel associated with the      01444100
*                                recovered object.  This field is       01444200
*                                only valid when the ST36TVSN field     01444300
*                                contains blanks and the ST36TCLID      01444301
*                                field is zero.                   @LFC  01444302
ST36TCLID DS    BL2'0'           Cloud ID.                        @LFA  01444401
ST36BCLID DS    BL2'0'           Cloud ID of the backup copy            01444402
*                                retrieved from cloud.            @LGA  01444403
         EJECT                                                          01444800
*********************************************************************** 01447600
*                                                                     * 01450400
*   OAM SUBTYPE SECTION, FOR SUBTYPE 37                               * 01453200
*                                                                     * 01456000
*   SUBTYPE FUNCTION                                                  * 01458800
*   ------- ---------------------------------------------------       * 01461600
*        37 OSMC LIBRARY SPACE MANAGEMENT UTILITY                     * 01464400
*                                                                     * 01467200
*********************************************************************** 01470000
ST37     DSECT                   SUBTYPE 37                             01472800
ST37LIBN DS     CL8' '           OPTICAL LIBRARY NAME                   01475600
ST37LIBD DS     CL8' '           OPTICAL LIBRARY DEVICE TYPE            01478400
ST37NOCE DS     BL4'0'           NUMBER OF OPTICAL DISK                 01481200
*                                CARTRIDGES EJECTED.                    01484000
ST37FLGS DS     BL4'0'           PROCESSING FLAGS                       01486800
ST37FLG0 EQU    X'80'            WHEN ON, LIBRARY SPACE MANAGEMENT      01489600
*                                WAS INVOKED AUTOMATICALLY UNDER        01492400
*                                SOFTWARE CONTROL, DUE TO A             01495200
*                                "STORAGE GROUP OUT-OF-SPACE"           01498000
*                                CONDITION IN THE SPECIFIED             01500800
*                                LIBRARY.                               01503600
ST37FLG1 EQU    X'40'            WHEN ON, LIBRARY SPACE MANAGEMENT      01506400
*                                WAS INVOKED BY A "F OAM,START          01509200
*                                LIBMGT,LIBNAME" COMMAND ISSUED         01512000
*                                FROM AN MVS CONSOLE.                   01514800
         EJECT                                                          01514900
*********************************************************************** 01515000
*                                                                     * 01515100
*   OAM SUBTYPE SECTION, FOR SUBTYPE 38                               * 01515200
*                                                                     * 01515300
*   SUBTYPE FUNCTION                                                  * 01515400
*   ------- ---------------------------------------------------       * 01515500
*        38 OSMC SINGLE OBJECT RECALL UTILITY                 @P2A    * 01515600
*                                                                     * 01515700
*********************************************************************** 01515800
ST38     DSECT                   SUBTYPE 38                   @P2A      01515900
ST38COLN DS     CL44' '          COLLECTION NAME              @P2A      01516000
ST38CNID DS     BL4'0'           COLLECTION ID                @P2A      01516100
ST38OBJN DS     CL44' '          OBJECT NAME                  @P2A      01516200
ST38SGN  DS     CL8' '           STORAGE GROUP NAME           @P2A      01516300
ST38OLEN DS     BL4'0'           OBJECT LENGTH                @P2A      01516400
ST38VSN  DS     CL6' '           VOLUME SERIAL NUMBER OF OPTICAL        01516500
*                                VOLUME OR TAPE VOLUME FROM WHICH       01516600
*                                THE COPY OF THE OBJECT WAS             01516700
*                                READ. THIS FIELD CONTAINS BLANKS       01516800
*                                IF THE OBJECT WAS RECALLED             01516801
*                                FROM THE CLOUD LEVEL.        @LFC      01516802
ST38MT   DS     CL2' '           MEDIA TYPE OF THE VOLUME FROM          01516900
*                                WHICH THE COPY OF THE OBJECT           01517000
*                                WAS READ. THIS FIELD CONTAINS          01517100
*                                BLANKS IF THE OBJECT WAS               01517101
*                                RECALLED FROM THE CLOUD                01517102
*                                LEVEL.                       @LFC      01517103
ST38TKN  DS     BL4'0'           VOLUME LOCATION TOKEN ASSOCIATED       01517200
*                                WITH THE COPY OF THE OBJECT            01517300
*                                ON THE VOLUME SPECIFIED IN THE         01517400
*                                ST38VSN FIELD. THIS FIELD              01517500
*                                CONTAINS ZERO IF THE OBJECT            01517501
*                                WAS RECALLED FROM THE CLOUD            01517502
*                                LEVEL.                       @LFC      01517503
ST38RCLD DS     BL4'0'           NUMBER OF DAYS THIS OBJECT             01517600
*                                IS TO REMAIN IN RECALLED               01517700
*                                MODE.                        @01A      01517800
ST38VT   DS     CL1' '           VOLUME TYPE OF THE VOLUME              01517900
*                                SPECIFIED IN THE ST38VSN FIELD         01518000
*                                G = VOLUME IS A GROUPED VOLUME         01518100
*                                BELONGING TO AN OBJECT STORAGE         01518200
*                                GROUP.                                 01518300
*                                B = VOLUME IS A GROUPED VOLUME         01518400
*                                BELONGING TO AN OBJECT BACKUP          01518500
*                                STORAGE GROUP                @01C      01518600
ST38BT   DS     CL1' '           BACKUP TYPE OF THE VOLUME              01518700
*                                SPECIFIED IN THE ST38VSN FIELD         01518800
*                                1 = BACKUP1 VOLUME                     01518900
*                                2 = BACKUP2 VOLUME           @01C      01519000
ST38DSL  DS     CL2' '           Disk sublevel associated with the      01519100
*                                recalled object.                 @L9C  01519200
ST38FLGS DS     BL4'0'           PROCESSING FLAGS             @P2A      01519300
*                                                                       01519400
ST38FLG0 EQU    X'80'            WHEN ON, OBJECT RECALL                 01519500
*                                WAS SUCCESSFUL.              @P2A      01519600
ST38CLDID DS    BL2'0'           CLOUD ID                         @LFA  01519601
         EJECT                                                          01519700
*********************************************************************** 01519800
*                                                                     * 01519900
*   OAM SUBTYPE SECTION, FOR SUBTYPE 39                           @L5A* 01520000
*                                                                     * 01520100
*   SUBTYPE FUNCTION                                              @L5A* 01520200
*   ------- ---------------------------------------------------       * 01520300
*        39 OSMC IMMEDIATE BACKUP COPY                            @L5A* 01520400
*                                                                     * 01520500
*********************************************************************** 01520600
ST39     DSECT                   SUBTYPE 39                        @L5A 01520700
ST39COLN DS     CL44' '          COLLECTION NAME                   @L5A 01520800
ST39CNID DS     BL4'0'           COLLECTION ID                     @L5A 01520900
ST39OBJN DS     CL44' '          OBJECT NAME                       @L5A 01521000
ST39SGN  DS     CL8' '           STORAGE GROUP NAME                @L5A 01521100
ST39MCN  DS     CL8' '           MANAGEMENT CLASS NAME             @L5A 01521200
ST39OLEN DS     BL4'0'           OBJECT LENGTH                     @L5A 01521300
ST39SVSN DS     CL6' '           SOURCE VOLUME SERIAL NUMBER OF         01521400
*                                 OPTICAL VOLUME OR TAPE VOLUME         01521500
*                                 FROM WHICH THE PRIMARY OBJECT         01521600
*                                 WAS READ.                             01521700
*                                 ONLY VALID IF THE BIT 1 OR 2          01521800
*                                 IS ON IN FIELD ST39FLGS          @L5A 01521900
ST39SMT  DS     CL2' '           SOURCE MEDIA TYPE OF THE VOLUME        01522000
*                                 FROM WHICH THE PRIMARY OBJECT         01522100
*                                 WAS READ.                             01522200
*                                ONLY VALID IF THE BIT 1 OR 2           01522300
*                                 IS ON IN FIELD ST39FLGS          @L5A 01522400
ST39TVSN DS     CL6' '           TARGET VOLUME SERIAL NUMBER OF         01522500
*                                 OPTICAL VOLUME OR TAPE VOLUME         01522600
*                                 ON WHICH THE BACKUP COPY OF           01522700
*                                 THE OBJECT WAS WRITTEN.               01522800
*                                 ONLY VALID IF THE BIT 1 OR 2          01522900
*                                 IS ON IN FIELD ST39FLGS          @L5A 01523000
ST39TMT  DS     CL2' '           TARGET MEDIA TYPE OF THE VOLUME        01523100
*                                 ON WHICH THE BACKUP COPY OF           01523200
*                                 THE OBJECT WAS WRITTEN.               01523300
*                                 ONLY VALID IF THE BIT 1 OR 2          01523400
*                                 IS ON IN FIELD ST39FLGS          @L5A 01523500
ST39BTKN DS     BL4'0'          VOLUME LOCATION TOKEN ASSOCIATED        01523600
*                                 WITH THE COPY OF THE OBJECT           01523700
*                                 ON THE VOLUME SPECIFIED IN THE        01523800
*                                 ST39TVSN FIELD.                  @L5A 01523900
ST39FLGS DS     BL4'0'          PROCESSING FLAGS                   @L5A 01524000
ST39FLG0 EQU    X'80'           WHEN ON, THE PRIMARY COPY               01524100
*                                 IS STORED TO DISK.               @L9C 01524200
ST39FLG1 EQU    X'40'           WHEN ON, THE PRIMARY COPY               01524300
*                                 IS STORED TO OPTICAL.            @L5A 01524400
ST39FLG2 EQU    X'20'           WHEN ON, THE PRIMARY COPY               01524500
*                                 IS STORED TO TAPE.               @L5A 01524600
ST39FLG3 EQU    X'10'           WHEN ON, THE PRIMARY COPY               01524700
*                                 IS STORED TO CLOUD.              @LFC 01524701
ST39FLG4 EQU    X'08'           RESERVED                           @L5A 01524800
ST39FLG5 EQU    X'04'           WHEN ON, THE BACKUP COPY                01524900
*                                 IS STORED TO OPTICAL.            @L5A 01525000
ST39FLG6 EQU    X'02'           WHEN ON, THE BACKUP COPY                01525100
*                                 IS STORED TO TAPE.               @L5A 01525200
ST39FLG7 EQU    X'01'           RESERVED                           @L5A 01525300
ST39FLG8 EQU    X'80'           WHEN ON, WRITE TO BACKUP COPY           01525400
*                                 WAS SUCCESSFUL.                  @L5A 01525500
ST39FLG9 EQU    X'00'           RESERVED                           @L9A 01525600
ST39FLG10 EQU   X'20'           When on, primary is stored on SL1  @L9A 01525700
ST39FLG11 EQU   X'10'           When on, primary is stored on SL2  @L9A 01525800
ST39FLG12 EQU   X'08'           When on, the backup copy is stored      01525801
*                               to cloud.                          @LGA 01525802
ST39FLG13 EQU   X'04'           When on, the backup copy is stored      01525803
*                               to file system.                    @LGA 01525804
ST39SCLID DS    BL2'0'          Cloud ID.                          @LFA 01525806
ST39BCLID DS    BL2'0'          Cloud ID of the backup copy             01525807
*                               stored to cloud.                   @LGA 01525808
         EJECT                                                          01525900
*********************************************************************** 01526000
*                                                                     * 01526100
*   OAM SUBTYPE SECTION, FOR SUBTYPE 40                               * 01526200
*                                                                     * 01526300
*   SUBTYPE FUNCTION                                                  * 01526400
*   ------- ---------------------------------------------------       * 01526500
*        40 OSMC COMMAND RECYCLE                                 @L5A * 01526600
*                                                                     * 01526700
*********************************************************************** 01526800
ST40     DSECT                   SUBTYPE 40                             01526900
ST40STRD DS     CL10' '          DATE RECYCLE COMMAND STARTED     @L5A  01527000
ST40ENDD DS     CL10' '          DATE RECYCLE COMMAND ENDED       @L5A  01527100
ST40VOLN DS     BL2'0'           NUMBER OF VOLSERS COMPLETED      @L5A  01527200
ST40PCTV DS     BL2'0'           PERCENT VALID USED FOR COMMAND   @L5A  01527300
ST40LIM  DS     BL2'0'           LIMIT USED FOR COMMAND           @L5A  01527400
ST40SUBL DS     CL1' '           TAPE SUBLEVEL USED FOR COMMAND:        01527500
*                                A=ALL,                                 01527600
*                                -=TSL NOT SPECIFIED ON CMD,            01527700
*                                1=TAPE SUBLEVEL 1,                     01527800
*                                2=TAPE SUBLEVEL 2.                     01527900
*                                                                 @L6A  01528000
         DS     BL1'0'           RESERVED                         @L6C  01528100
ST40END  DS     0C               END OF BASE SECTION              @L5A  01528200
*********************************************************************** 01528300
* SUBTYPE 40 VOLUME ARRAY SECTION                                     * 01528400
*********************************************************************** 01528500
ST40VOLD DSECT                   ARRAY OF VOLS COMPLETED RECYCLE @L5A   01528600
ST40VSN  DS     40CL6' '         VOLSER                          @L5A   01528700
*********************************************************************** 01528800
*                                                                     * 01528900
*   OAM SUBTYPE SECTION, FOR SUBTYPES 64 - 67                         * 01529000
*                                                                     * 01529100
*   SUBTYPE FUNCTION                                                  * 01531600
*   ------- ---------------------------------------------------       * 01534400
*        64 LCS OPTICAL OPTICAL DRIVE VARY ONLINE                     * 01537200
*        65 LCS OPTICAL OPTICAL DRIVE VARY OFFLINE                    * 01540000
*        66 LCS OPTICAL OPTICAL LIBRARY VARY ONLINE                   * 01542800
*        67 LCS OPTICAL OPTICAL LIBRARY VARY OFFLINE                  * 01545600
*                                                                     * 01548400
*********************************************************************** 01551200
ST64     DSECT                   SUBTYPES 64 - 67                       01554000
ST64OLN  DS     CL8' '           OPTICAL LIBRARY NAME                   01556800
ST64OLDT DS     CL8' '           OPTICAL LIBRARY DEVICE TYPE            01559600
ST64OLDN DS     CL4' '           MVS DEVICE NUMBER CORRESPONDING        01562400
*                                TO THE OPTICAL LIBRARY                 01565200
ST64ODN  DS     CL8' '           OPTICAL DRIVE NAME, ONLY VALID         01568000
*                                FOR SUBTYPES 64 AND 65.                01570800
ST64ODDT DS     CL8' '           OPTICAL DRIVE DEVICE TYPE, ONLY        01573600
*                                VALID FOR SUBTYPES 64 AND 65.          01576400
ST64ODDN DS     CL4' '           MVS DEVICE NUMBER CORRESPONDING        01579200
*                                TO THE OPTICAL DRIVE.  ONLY            01582000
*                                VALID FOR SUBTYPES 64 AND 65.          01584800
ST64VSN0 DS     CL6' '           OPTICAL VOLUME SERIAL NUMBER OF        01587600
*                                CURRENTLY MOUNTED VOLUME.              01590400
*                                VALID FOR SUBTYPES 64 AND 65,          01593200
*                                CONTAINS BLANKS FOR OTHER              01596000
*                                SUBTYPES.                              01598800
ST64VSN1 DS     CL6' '           OPPOSITE SIDE OF                       01601600
*                                CURRENTLY MOUNTED VOLUME.              01604400
*                                VALID FOR SUBTYPES 64 AND 65,          01607200
*                                CONTAINS BLANKS FOR OTHER              01610000
*                                SUBTYPES.                              01612800
ST64OMT  DS     CL2' '           OPTICAL MEDIA TYPE OF CURRENTLY        01615600
*                                MOUNTED OPTICAL VOLUME.                01618400
ST64ODT  DS     CL1' '           OPTICAL DRIVE TYPE.  L=LIBRARY         01621200
*                                RESIDENT, S=STANDALONE.                01624000
*                                VALID FOR SUBTYPES 64 AND 65,          01626800
*                                CONTAINS BLANKS FOR OTHER              01629600
*                                SUBTYPES.                              01632400
ST64OVT  DS     CL1' '           OPTICAL VOLUME TYPE.                   01635200
*                                G = OBJECT STORAGE GROUP,              01638000
*                                B = OBJECT BACKUP STOR GROUP,          01640800
*                                S = SCRATCH OPTICAL VOLUME.            01643600
*                                VALID FOR SUBTYPES 64 AND 65,          01646400
*                                CONTAINS BLANKS FOR OTHER              01649200
*                                SUBTYPES.                              01652000
ST64SGN  DS     CL8' '           STORAGE GROUP NAME.  ONLY VALID        01654800
*                                IF ST64VSN0 CONTAINS VOLSER,           01657600
*                                BLANKS OTHERWISE.                      01660400
*                                VALID FOR SUBTYPES 64 AND 65,          01663200
*                                CONTAINS BLANKS FOR OTHER              01666000
*                                SUBTYPES.                              01668800
ST64LIQT DS     BL4'0'           AMOUNT OF TIME (IN MILLISECONDS)       01671600
*                                THIS REQUEST SPENT ON THE LCS          01674400
*                                INPUT-WORK-QUEUE WAITING TO            01677200
*                                PROCESSED.                             01680000
ST64LDQT DS     BL4'0'           AMOUNT OF TIME (IN MILLISECONDS)       01682800
*                                THIS REQUEST SPENT ON THE LCS          01685600
*                                DISPATCHER-QUEUE WAITING TO            01688400
*                                PROCESSED.                             01691200
ST64LEQT DS     BL4'0'           AMOUNT OF TIME (IN MILLISECONDS)       01694000
*                                THIS REQUEST SPENT ON THE LCS          01696800
*                                EXECUTION-QUEUE BEING                  01699600
*                                PROCESSED.                             01702400
ST64LTQT DS     BL4'0'           LIBRARY TASK QUEUE TIME.               01705200
*                                AMOUNT OF TIME (IN MILLISECONDS)       01708000
*                                THIS REQUEST SPENT ON THE LCS          01710800
*                                LIBRARY TASK QUEUE (LQE QUEUE)         01713600
*                                WAITING TO BE PROCESSED.               01716400
*                                NORMALLY, THIS FIELD REPRESENTS        01719200
*                                CARTRIDGES TRANSPORT MECHANISM         01722000
*                                WAIT TIME.  THAT IS, THE AMOUNT        01724800
*                                OF TIME WAITING FOR THE CARTRIDGE      01727600
*                                TRANSPORT MECHANISM (ROBOT) TO         01730400
*                                BECOME AVAILABLE WITHIN AN             01733200
*                                AUTOMATED STORAGE LIBRARY.             01736000
ST64LTPT DS     BL4'0'           LIBRARY TASK PROCESSING TIME.          01738800
*                                AMOUNT OF TIME (IN MILLISECONDS)       01741600
*                                THIS REQUEST TOOK TO BE                01744400
*                                PROCESSED BY THE LIBRARY TASK.         01747200
*                                WAITING TO BE PROCESSED.               01750000
*                                NORMALLY, THIS FIELD REPRESENTS        01752800
*                                CARTRIDGES TRANSPORT MECHANISM         01755600
*                                SERVICE TIME.  THAT IS, THE            01758400
*                                TIME SPENT BY THE                      01761200
*                                CARTRIDGE TRANSPORT MECHANISM          01764000
*                                (ROBOT) TO MOVE CARTRIDGES WITHIN      01766800
*                                THE OPTICAL DISK LIBRARY.              01769600
ST64RC   DS     BL4'0'           LCS RETURN CODE                        01772400
ST64RS   DS     BL4'0'           LCS REASON CODE                        01775200
ST64FLGS DS     BL4'0'           PROCESSING FLAGS, RESERVED.            01778000
         EJECT                                                          01780800
*********************************************************************** 01783600
*                                                                     * 01786400
*   OAM SUBTYPE SECTION, FOR SUBTYPES 68 - 71                         * 01789200
*                                                                     * 01792000
*   SUBTYPE FUNCTION                                                  * 01794800
*   ------- ---------------------------------------------------       * 01797600
*        68 LCS OPTICAL CARTRIDGE ENTRY                               * 01800400
*        69 LCS OPTICAL CARTRIDGE EJECT                               * 01803200
*        70 LCS OPTICAL CARTRIDGE LABEL                               * 01806000
*        71 LCS OPTICAL VOLUME AUDIT                                  * 01808800
*        72 LCS OPTICAL VOLUME MOUNT                                  * 01811600
*        73 LCS OPTICAL VOLUME DEMOUNT                                * 01814400
*                                                                     * 01817200
*********************************************************************** 01820000
ST68     DSECT                   SUBTYPES 68 - 73                       01822800
ST68OLN  DS     CL8' '           OPTICAL LIBRARY NAME                   01825600
ST68OLDT DS     CL8' '           OPTICAL LIBRARY DEVICE TYPE            01828400
ST68OLDN DS     CL4' '           MVS DEVICE NUMBER CORRESPONDING        01831200
*                                TO THE OPTICAL LIBRARY                 01834000
ST68ODN  DS     CL8' '           OPTICAL DRIVE NAME                     01836800
ST68ODDT DS     CL8' '           OPTICAL DRIVE DEVICE TYPE              01839600
ST68ODDN DS     CL4' '           MVS DEVICE NUMBER CORRESPONDING        01842400
*                                TO THE OPTICAL DRIVE.                  01845200
ST68VSN0 DS     CL6' '           OPTICAL VOLUME SERIAL NUMBER           01848000
ST68VSN1 DS     CL6' '           OPPOSITE SIDE OF                       01850800
*                                VOLSER IN FIELD ST68VSN0               01853600
ST68OMT  DS     CL2' '           OPTICAL MEDIA TYPE                     01856400
ST68ODT  DS     CL1' '           OPTICAL DRIVE TYPE.  L=LIBRARY         01859200
*                                RESIDENT, S=STANDALONE.                01862000
ST68OVT  DS     CL1' '           OPTICAL VOLUME TYPE.                   01864800
*                                G = OBJECT STORAGE GROUP,              01867600
*                                B = OBJECT BACKUP STOR GROUP,          01870400
*                                S = SCRATCH OPTICAL VOLUME.            01873200
ST68SGN  DS     CL8' '           STORAGE GROUP NAME.                    01876000
ST68LIQT DS     BL4'0'           AMOUNT OF TIME (IN MILLISECONDS)       01878800
*                                THIS REQUEST SPENT ON THE LCS          01881600
*                                INPUT-WORK-QUEUE WAITING TO            01884400
*                                PROCESSED.                             01887200
ST68LDQT DS     BL4'0'           AMOUNT OF TIME (IN MILLISECONDS)       01890000
*                                THIS REQUEST SPENT ON THE LCS          01892800
*                                DISPATCHER-QUEUE WAITING TO            01895600
*                                PROCESSED.                             01898400
ST68LEQT DS     BL4'0'           AMOUNT OF TIME (IN MILLISECONDS)       01901200
*                                THIS REQUEST SPENT ON THE LCS          01904000
*                                EXECUTION-QUEUE BEING                  01906800
*                                PROCESSED.                             01909600
ST68LTQT DS     BL4'0'           LIBRARY TASK QUEUE TIME.               01912400
*                                AMOUNT OF TIME (IN MILLISECONDS)       01915200
*                                THIS REQUEST SPENT ON THE LCS          01918000
*                                LIBRARY TASK QUEUE (LQE QUEUE)         01920800
*                                WAITING TO BE PROCESSED.               01923600
*                                NORMALLY, THIS FIELD REPRESENTS        01926400
*                                CARTRIDGE TRANSPORT MECHANISM          01929200
*                                WAIT TIME.  THAT IS, THE AMOUNT        01932000
*                                OF TIME WAITING FOR THE CARTRIDGE      01934800
*                                TRANSPORT MECHANISM (ROBOT) TO         01937600
*                                BECOME AVAILABLE WITHIN AN             01940400
*                                AUTOMATED STORAGE LIBRARY.             01943200
ST68LTPT DS     BL4'0'           LIBRARY TASK PROCESSING TIME.          01946000
*                                AMOUNT OF TIME (IN MILLISECONDS)       01948800
*                                THIS REQUEST TOOK TO BE                01951600
*                                PROCESSED BY THE LIBRARY TASK.         01954400
*                                WAITING TO BE PROCESSED.               01957200
*                                NORMALLY, THIS FIELD REPRESENTS        01960000
*                                CARTRIDGES TRANSPORT MECHANISM         01962800
*                                SERVICE TIME.  THAT IS, THE            01965600
*                                TIM SPENT BY THE                       01968400
*                                CARTRIDGE TRANSPORT MECHANISM          01971200
*                                (ROBOT) TO MOVE CARTRIDGES WITHIN      01974000
*                                THE OPTICAL DISK LIBRARY.              01976800
ST68RC   DS     BL4'0'           LCS RETURN CODE                        01979600
ST68RS   DS     BL4'0'           LCS REASON CODE                        01982400
ST68FLGS DS     BL4'0'           PROCESSING FLAGS, RESERVED.            01985200
*********************************************************************** 01988000
* SUBTYPE 68 (OPTICAL CARTRIDGE ENTRY) FLAGS.                         * 01990800
*********************************************************************** 01993600
ST68FLG0 EQU    X'80'            WHEN ON, THE VOLUME SERIAL             01996400
*                                NUMBER DESCRIBED BY FIELD              01999200
*                                ST68VSN0 REQUIRED FORMATTING AS        02002000
*                                PART OF OPTICAL CARTRIDGE ENTRY        02004800
*                                PROCESSING.                            02007600
ST68FLG1 EQU    X'40'            WHEN ON, THE VOLUME SERIAL             02010400
*                                NUMBER DESCRIBED BY FIELD              02013200
*                                ST68VSN1 REQUIRED FORMATTING AS        02016000
*                                PART OF OPTICAL CARTRIDGE ENTRY        02018800
*                                PROCESSING.                            02021600
ST68FLG2 EQU    X'20'            WHEN ON, THE VOLUME SERIAL             02024400
*                                NUMBER DESCRIBED BY FIELD              02027200
*                                ST68VSN0 WAS NOT KNOWN TO OAM          02030000
*                                AT THE TIME OF BEING ENTERED           02032800
*                                INTO THE OPTICAL LIBRARY, MEANING      02035600
*                                THAT THERE WAS NOT ROW FOR THIS        02038400
*                                OPTICAL DISK VOLUME IN THE VOLUME      02041200
*                                TABLE IN THE OPTICAL                   02044000
*                                CONFIGURATION DATABASE (ODCB).         02046800
ST68FLG3 EQU    X'10'            WHEN ON, THE VOLUME SERIAL             02049600
*                                NUMBER DESCRIBED BY FIELD              02052400
*                                ST68VSN1 WAS NOT KNOWN TO OAM          02055200
*                                AT THE TIME OF BEING ENTERED           02058000
*                                INTO THE OPTICAL LIBRARY, MEANING      02060800
*                                THAT THERE WAS NOT ROW FOR THIS        02063600
*                                OPTICAL DISK VOLUME IN THE VOLUME      02066400
*                                TABLE IN THE OPTICAL                   02069200
*                                CONFIGURATION DATABASE (ODCB).         02072000
ST68TMNT DS     BL4'0'           ELAPSED TIME (IN MILLISECONDS) @P5C    02074800
*                                THAT OPTICAL DISK VOLUME WAS           02077600
*                                MOUNTED.                               02080400
*                                ONLY VALID FOR SUBTYPE 73 AND          02083200
*                                SUBTYPE 69 (IN ONE SPECIAL             02086000
*                                CASE).                                 02088800
ST68NOW  DS     BL4'0'           NUMBER OF OBJECT WRITTEN TO THIS       02091600
*                                OPTICAL DISK VOLUME WHILE IT           02094400
*                                WAS MOUNTED.                           02097200
*                                ONLY VALID FOR SUBTYPE 73 AND          02100000
*                                SUBTYPE 69 (IN ONE SPECIAL             02102800
*                                CASE).                                 02105600
ST68NKBW DS     BL4'0'           NUMBER OF KILOBYTES OF OBJECT          02108400
*                                DATA WRITTEN TO THIS OPTICAL           02111200
*                                DISK VOLUME WHILE IT WAS MOUNTED.      02114000
*                                ONLY VALID FOR SUBTYPE 73 AND          02116800
*                                SUBTYPE 69 (IN ONE SPECIAL             02119600
*                                CASE).                                 02122400
ST68NOR  DS     BL4'0'           NUMBER OF OBJECT READ FROM THIS        02125200
*                                OPTICAL DISK VOLUME WHILE IT           02128000
*                                WAS MOUNTED.                           02130800
*                                ONLY VALID FOR SUBTYPE 73 AND          02133600
*                                SUBTYPE 69 (IN ONE SPECIAL             02136400
*                                CASE).                                 02139200
ST68NKBR DS     BL4'0'           NUMBER OF KILOBYTES OF OBJECT          02142000
*                                DATA READ FROM THIS OPTICAL            02144800
*                                DISK VOLUME WHILE IT WAS MOUNTED.      02147600
*                                ONLY VALID FOR SUBTYPE 73 AND          02150400
*                                SUBTYPE 69 (IN ONE SPECIAL             02153200
*                                CASE).                                 02156000
ST68NOD  DS     BL4'0'           NUMBER OF OBJECT DELETED FROM          02158800
*                                THIS OPTICAL DISK VOLUME WHILE         02161600
*                                IT WAS MOUNTED.                        02164400
*                                ONLY VALID FOR SUBTYPE 73 AND          02167200
*                                SUBTYPE 69 (IN ONE SPECIAL             02170000
*                                CASE).                                 02172800
ST68NKBD DS     BL4'0'           NUMBER OF KILOBYTES OF OBJECT          02175600
*                                DATA DELETED FROM THIS OPTICAL   @P5C  02178400
*                                DISK VOLUME WHILE IT WAS MOUNTED.      02181200
*                                ONLY VALID FOR SUBTYPE 73 AND          02184000
*                                SUBTYPE 69 (IN ONE SPECIAL             02186800
*                                CASE).                                 02189600
*********************************************************************** 02192400
* SUBTYPE 69 (OPTICAL CARTRIDGE EJECT) FLAGS.                         * 02195200
*********************************************************************** 02198000
ST69FLG0 EQU    X'80'            WHEN ON, THIS OPTICAL CARTRIDGE        02200800
*                                WAS AUTOMATICALLY EJECTED BY           02203600
*                                THE SYSTEM DUE TO AN ERROR             02206400
*                                CONDITION AND THIS CONDITION           02209200
*                                IS KNOWN AS A "SYSTEM INITIATED        02212000
*                                EJECT" REQUEST.                        02214800
*********************************************************************** 02217600
* SUBTYPE 70 (OPTICAL CARTRIDGE LABEL) FLAGS.                         * 02220400
*********************************************************************** 02223200
*  ALL FLAGS CURRENTLY UNUSED AND RESERVED.                           * 02226000
*********************************************************************** 02228800
* SUBTYPE 71 (OPTICAL VOLUME AUDIT) FLAGS.                            * 02231600
*********************************************************************** 02234400
*  ALL FLAGS CURRENTLY UNUSED AND RESERVED.                           * 02237200
*********************************************************************** 02240000
* SUBTYPE 72 (OPTICAL VOLUME MOUNT) FLAGS.                            * 02242800
*********************************************************************** 02245600
*  ALL FLAGS CURRENTLY UNUSED AND RESERVED.                           * 02248400
*********************************************************************** 02251200
* SUBTYPE 73 (OPTICAL VOLUME DEMOUNT) FLAGS                           * 02254000
*********************************************************************** 02256800
*  ALL FLAGS CURRENTLY UNUSED AND RESERVED.                           * 02259600
         EJECT                                                          02262400
*********************************************************************** 02265200
*                                                                     * 02268000
*   OAM SUBTYPE SECTION, FOR SUBTYPES 74 - 77                         * 02270800
*                                                                     * 02273600
*   SUBTYPE FUNCTION                                                  * 02276400
*   ------- ---------------------------------------------------       * 02279200
*        74 LCS OPTICAL WRITE REQUEST                            @L1A * 02282000
*        75 LCS OPTICAL READ REQUEST                             @L1A * 02284800
*        76 LCS OPTICAL (LOGICAL) DELETE REQUEST                      * 02287600
*        77 LCS OPTICAL (PHYSICAL) DELETE REQUEST                     * 02290400
*                                                                     * 02293200
*********************************************************************** 02296000
ST74     DSECT                   SUBTYPES 74 - 77                       02298800
ST74ORMN DS     CL16' '          OAM REQUEST MEMBER NAME          @L1A  02299700
ST74OTMN DS     CL16' '          OAM TARGET  MEMBER NAME          @L1A  02300600
ST74OLN  DS     CL8' '           OPTICAL LIBRARY NAME                   02301600
ST74OLDT DS     CL8' '           OPTICAL LIBRARY DEVICE TYPE            02304400
ST74OLDN DS     CL4' '           MVS DEVICE NUMBER CORRESPONDING        02307200
*                                TO THE OPTICAL LIBRARY                 02310000
ST74ODN  DS     CL8' '           OPTICAL DRIVE NAME                     02312800
ST74ODDT DS     CL8' '           OPTICAL DRIVE DEVICE TYPE              02315600
ST74ODDN DS     CL4' '           MVS DEVICE NUMBER CORRESPONDING        02318400
*                                TO THE OPTICAL DRIVE.                  02321200
ST74ODT  DS     CL1' '           OPTICAL DRIVE TYPE.  L=LIBRARY         02324000
*                                RESIDENT, S=STANDALONE.                02326800
ST74OVT  DS     CL1' '           OPTICAL VOLUME TYPE.                   02329600
*                                G = OBJECT STORAGE GROUP,              02332400
*                                B = OBJECT BACKUP STOR GROUP,          02335200
*                                S = SCRATCH OPTICAL VOLUME.            02338000
ST74SGN  DS     CL8' '           STORAGE GROUP NAME.                    02340800
ST74LIQT DS     BL4'0'           AMOUNT OF TIME (IN                     02343600
*                                MILLISECONDS) THIS REQUEST             02346400
*                                SPENT ON THE LCS                       02349200
*                                INPUT-WORK-QUEUE WAITING               02352000
*                                TO PROCESSED.                          02354800
ST74LDQT DS     BL4'0'           AMOUNT OF TIME (IN                     02357600
*                                MILLISECONDS) THIS REQUEST             02360400
*                                SPENT ON THE LCS                       02363200
*                                DISPATCHER-QUEUE WAITING               02366000
*                                TO PROCESSED.                          02368800
ST74LEQT DS     BL4'0'           AMOUNT OF TIME (IN                     02371600
*                                MILLISECONDS) THIS REQUEST             02374400
*                                SPENT ON THE LCS                       02377200
*                                EXECUTION-QUEUE BEING                  02380000
*                                PROCESSED.                             02382800
ST74LXQT DS     BL4'0'           AMOUNT OF TIME (IN                     02383300
*                                MILLISECONDS) THIS REQUEST             02383800
*                                SPENT ON THE XCF CROSS SYSTEM-         02384300
*                                QUEUE BEING PROCESSED.          @L1A   02384800
ST74OVMT DS     BL4'0'           OPTICAL VOLUME MOUNT TIME.             02385600
*                                THIS IS THE AMOUNT OF TIME             02388400
*                                (IN MILLISECONDS) THAT IT        @P5C  02391200
*                                TOOK TO MOUNTED THE                    02394000
*                                OPTICAL DISK VOLUME THAT               02396800
*                                WAS REQUIRED BY THIS                   02399600
*                                REQUEST. THE FIELD IS ONLY             02402400
*                                VALID IF BIT 1, 2 OR 3 IN              02405200
*                                FIELD ST74FLSGS IS ON.                 02408000
*                                THIS FIELD IS ONLY VALID               02410800
*                                FOR SUBTYPES 74, 75 AND                02413600
*                                77.                                    02416400
ST74OVDT DS     BL4'0'           OPTICAL VOLUME DEMOUNT                 02419200
*                                TIME.  THIS IS THE AMOUNT              02422000
*                                OF TIME (IN MILLISECONDS)        @P5C  02424800
*                                THAT IT TOOK TO DEMOUNT                02427600
*                                THE OPTICAL DISK VOLUME                02430400
*                                THAT CURRENTLY MOUNTED                 02433200
*                                PRIOR TO MOUNTING THAT                 02436000
*                                OPTICAL DISK VOLUME THAT               02438800
*                                WAS REQUIRED BY THE                    02441600
*                                REQUEST. THE FIELD IS ONLY             02444400
*                                VALID IF BIT 3 IN FIELD                02447200
*                                ST74FLSGS IS ON.  THIS                 02450000
*                                FIELD IS ONLY VALID FOR                02452800
*                                SUBTYPES 74, 75 AND 77.                02455600
*                                                                       02458400
ST74FLGS DS     BL4'0'           PROCESSING FLAGS, RESERVED.            02461200
*********************************************************************** 02464000
* SUBTYPE 74 PROCESSING FLAGS                                         * 02466800
*********************************************************************** 02469600
ST74FLG0 EQU    X'80'            WHEN ON, THIS REQUEST WAS              02472400
*                                PROCESSED USING A CURRENTLY            02475200
*                                MOUNTED OPTICAL VOLUME AND DID         02478000
*                                NOT REQUIRE AN UNMOUNTED OPTICAL       02480800
*                                DISK VOLUME TO BE MOUNTED.             02483600
*                                ONLY VALID FOR SUBTYPES 74, 75         02486400
*                                AND 77.  NOT VALID FOR OTHER           02489200
*                                SUBTYPES.                         @P6C 02492000
ST74FLG1 EQU    X'40'            WHEN ON, THIS REQUEST WAS              02494800
*                                PROCESSED USING THE OPPOSITE           02497600
*                                OF A CURRENTLY                         02500400
*                                MOUNTED OPTICAL VOLUME AND             02503200
*                                NOT REQUIRE AN UNMOUNTED OPTICAL       02506000
*                                DISK VOLUME.  THEREFORE, THE           02508800
*                                REQUEST REQUIRED THE OPTICAL DISK      02511600
*                                VOLUME TO BE FLIPPED OVER TO           02514400
*                                ACCESS THE VOLUME ON THE               02517200
*                                OPPOSITE SIDE OF THE CURRENTLY         02520000
*                                MOUNTED VOLUME.                        02522800
*                                ONLY VALID FOR SUBTYPES 74, 75         02525600
*                                AND 77.  NOT VALID FOR OTHER           02528400
*                                SUBTYPES.                         @P6C 02531200
*                                                                       02534000
ST74FLG2 EQU    X'20'            WHEN ON, THIS REQUEST REQUIRED         02536800
*                                AN UNMOUNTED OPTICAL DISK VOLUME       02539600
*                                AND THE OPTICAL DISK DRIVE USED        02542400
*                                TO PROCESS THIS REQUEST WAS            02545200
*                                EMPTY AT THE START OF PROCESSING       02548000
*                                THIS REQUEST.  THEREFORE, THIS         02550800
*                                REQUEST DID NOT REQUIRE A              02553600
*                                CURRENTLY MOUNTED OPTICAL DISK         02556400
*                                VOLUME TO BE DEMOUNTED PRIOR           02559200
*                                TO MOUNTED THE REQUIRED OPTICAL        02562000
*                                DISK VOLUME.                           02564800
*                                ONLY VALID FOR SUBTYPES 74, 75         02567600
*                                AND 77.  NOT VALID FOR OTHER           02570400
*                                SUBTYPES.                              02573200
ST74FLG3 EQU    X'10'            WHEN ON, THIS REQUEST REQUIRED         02576000
*                                AN UNMOUNTED OPTICAL DISK VOLUME       02578800
*                                AND THE OPTICAL DISK DRIVE USED        02581600
*                                TO PROCESS THIS REQUEST WAS            02584400
*                                FULL AT THE START OF PROCESSING        02587200
*                                THIS REQUEST.  THEREFORE, THIS         02590000
*                                REQUEST REQUIRED A                     02592800
*                                CURRENTLY MOUNTED OPTICAL DISK         02595600
*                                VOLUME TO BE DEMOUNTED PRIOR           02598400
*                                TO MOUNTING THE REQUIRED OPTICAL       02601200
*                                DISK VOLUME.                           02604000
*                                ONLY VALID FOR SUBTYPES 74, 75         02606800
*                                AND 77.  NOT VALID FOR OTHER           02609600
*                                SUBTYPES.                              02612400
ST74NOBJ DS     BL4'0'           TOTAL NUMBER OF OBJECTS                02615200
*                                PROCESSED IN THIS REQUEST              02618000
ST74NKBP DS     BL4'0'           NUMBER OF KILOBYTES OF OBJECT          02620800
*                                DATA IN THIS REQUEST                   02623600
ST74SOBJ DS     BL4'0'           TOTAL NUMBER OF OBJECTS                02626400
*                                IN THIS REQUEST PROCESSED              02629200
*                                SUCCESSFULLY.                     @P5C 02632000
ST74SKBP DS     BL4'0'           NUMBER OF KILOBYTES OF OBJECT          02634800
*                                DATA SUCCESSFULLY PROCESSED IN    @P5C 02637600
*                                THIS REQUEST.                          02640400
         DS     CL14' '          RESERVED.                              02643200
ST74END  DS     0C               END OF SUBTYPE 74 BASE SECTION         02646000
*********************************************************************** 02648800
* SUBTYPE 74,75,76 AND 77 OBJECT ARRAY SECTION                        * 02651600
*********************************************************************** 02654400
ST74OBJD DSECT                   ARRAY OF OBJECTS IN THIS REQUEST       02657200
ST74COLN DS     CL44' '          COLLECTION NAME                        02660000
ST74OBJN DS     CL44' '          OBJECT NAME                            02662800
ST74OLEN DS     BL4'0'           OBJECT LENGTH                          02665600
ST74OOFF DS     BL4'0'           OBJECT OFFSET, ONLY VALID              02668400
*                                ON SUBTYPE 75 FOR A PARTIAL            02671200
*                                OBJECT READ.                           02674000
ST74VSN  DS     CL6' '           OPTICAL VOLUME SERIAL NUMBER           02676800
ST74OMT  DS     CL2' '           OPTICAL MEDIA TYPE.                    02679600
ST74OTKN DS     BL4'0'           OBJECT LOCATION TOKEN                  02682400
ST74RC   DS     BL4'0'           LCS RETURN CODE                        02685200
ST74RS   DS     BL4'0'           LCS REASON CODE                        02688000
         EJECT                                                          02690800
*********************************************************************** 02693600
*                                                                     * 02696400
*   OAM SUBTYPE SECTION, FOR SUBTYPES 78, 79 AND 88               @P0C* 02699200
*                                                                     * 02702000
*   SUBTYPE FUNCTION                                                  * 02704800
*   ------- ---------------------------------------------------       * 02707600
*        78 LCS TAPE WRITE REQUEST                                    * 02710400
*        79 LCS TAPE READ REQUEST                                 @L1A* 02712500
*        88 LCS TAPE LOGICAL DELETE REQUEST                       @P0A* 02714600
*                                                                     * 02716000
*********************************************************************** 02718800
ST78     DSECT                   SUBTYPES 78, 79 AND 88                 02721600
ST78ORMN DS     CL16' '          OAM REQUEST MEMBER NAME          @L1A  02722500
ST78OTMN DS     CL16' '          OAM TARGET  MEMBER NAME          @L1A  02723400
ST78TDUN DS     CL8' '           TAPE DRIVE UNIT NAME                   02724400
ST78TDDN DS     CL4' '           MVS DEVICE NUMBER OF TAPE DRIV         02727200
ST78TVT  DS     CL1' '           TAPE VOLUME TYPE.                      02730000
*                                G = OBJECT STORAGE GROUP,              02732800
*                                B = OBJECT BACKUP STOR GROUP,          02735600
*                                S = SCRATCH OPTICAL VOLUME.            02738400
         DS     CL3' '           RESERVED                               02741200
ST78SGN  DS     CL8' '           STORAGE GROUP NAME.                    02744000
*                                                                       02746800
ST78LIQT DS     BL4'0'           LCS INPUT-WORK-QUEUE TIME.             02749600
*                                AMOUNT OF TIME (IN MILLISECONDS)       02752400
*                                THIS REQUEST SPENT ON THE LCS          02755200
*                                INPUT-WORK-QUEUE WAITING TO            02758000
*                                PROCESSED.                             02760800
ST78LDQT DS     BL4'0'           LCS DISPATCHER-QUEUE TIME.             02763600
*                                AMOUNT OF TIME (IN MILLISECONDS)       02766400
*                                THIS REQUEST SPENT ON THE LCS          02769200
*                                DISPATCHER-QUEUE WAITING TO            02772000
*                                PROCESSED.                             02774800
ST78LEQT DS     BL4'0'           LCS EXECUTION-QUEUE TIME.              02777600
*                                AMOUNT OF TIME (IN MILLISECONDS)       02780400
*                                THIS REQUEST SPENT ON THE LCS          02783200
*                                EXECUTION-QUEUE BEING                  02786000
*                                PROCESSED.                             02788800
ST78LXQT DS     BL4'0'           AMOUNT OF TIME (IN                     02789300
*                                MILLISECONDS) THIS REQUEST             02789800
*                                SPENT ON THE XCF CROSS SYSTEM-         02790300
*                                QUEUE BEING PROCESSED.          @L1A   02790800
ST78LMAT DS     BL4'0'           MVS DYNAMIC ALLOCATION (SVC 99)        02791600
*                                TIME.  THIS IS THE AMOUNT OF           02794400
*                                TIME (IN MILLISECONDS) THAT WAS        02797200
*                                REQUIRED BY MVS DYNAMIC                02800000
*                                ALLOCATION TO DYNAMICALLY              02802800
*                                ALLOCATE THE TAPE DRIVE.  THIS         02805600
*                                FIELD IS ONLY VALID IF BIT 1 IN        02808400
*                                FIELD ST78FLGS IS ON.                  02811200
ST78LMDT DS     BL4'0'           MVS DYNAMIC DEALLOCATION (SVC 99)      02814000
*                                TIME.  THIS IS THE AMOUNT OF           02816800
*                                TIME (IN MILLISECONDS) THAT WAS        02819600
*                                REQUIRED BY MVS DYNAMIC                02822400
*                                DEALOCATION TO DYNAMICALLY             02825200
*                                DEALLOCATE THE TAPE DRIVE.  THIS       02828000
*                                FIELD IS ONLY VALID IF BIT 2 IN        02830800
*                                FIELD ST78FLGS IS ON.                  02833600
ST78LDCT DS     BL4'0'           DFSMS CLOSE TIME.                      02836400
*                                THIS IS THE AMOUNT OF                  02839200
*                                TIME (IN MILLISECONDS) THAT WAS        02842000
*                                REQUIRED BY DFSMS TO CLOSE AN          02844800
*                                ALREADY-OPENED TAPE DATA SET.          02847600
*                                THIS FIELD IS ONLY VALID IF BIT 2      02850400
*                                IN FIELD ST78FLGS IS ON.               02853200
ST78LDOT DS     BL4'0'           DFSMS OPEN TIME.                       02856000
*                                THIS IS THE AMOUNT OF                  02858800
*                                TIME (IN MILLISECONDS) THAT WAS        02861600
*                                REQUIRED BY DFSMS OPEN PROCESSING      02864400
*                                TO OPEN THE TAPE DATA SET.             02867200
*                                THIS FIELD IS ONLY VALID IF BIT 1      02870000
*                                OR BIT 2 IN FIELD ST78FLGS IS ON.      02872800
ST78LDPT DS     BL4'0'           DFSMS POINT TIME.  THIS IS             02875600
*                                THE AMOUNT OF TIME (IN                 02878400
*                                MILLISECONDS) THAT WAS                 02881200
*                                REQUIRED BY DFSMS POINT                02884000
*                                PROCESSING TO POSITION TO THE          02886800
*                                CORRECT BLOCK-ID ON THE MEDIA.         02889600
*                                THIS FIELD                             02892400
*                                IS ONLY VALID IF BIT 1 OR              02895200
*                                BIT 2 IN FIELD ST78FLGS IS             02898000
*                                ON.                                    02900800
ST78LBRT DS     BL4'0'           BSAM READ TIME.  THIS IS               02903600
*                                THE AMOUNT OF TIME (IN                 02906400
*                                MILLISECONDS) THAT LCS SPENT           02909200
*                                IN BSAM READ PROCESSING READING        02912000
*                                DATA FROM THE TAPE VOLUME.  ONLY       02914800
*                                VALID FOR SUBTYPE 79.                  02917600
ST78LBWT DS     BL4'0'           BSAM WRITE TIME.  THIS IS              02920400
*                                THE AMOUNT OF TIME (IN                 02923200
*                                MILLISECONDS) THAT LCS SPENT           02926000
*                                IN BSAM WRITE PROCESSING WRITING       02928800
*                                DATA TO THE TAPE VOLUME.  ONLY         02931600
*                                VALID FOR SUBTYPE 78.                  02934400
ST78LBCT DS     BL4'0'           BSAM CHECK TIME.  THIS IS              02937200
*                                THE AMOUNT OF TIME (IN                 02940000
*                                MILLISECONDS) THAT LCS SPENT           02942800
*                                IN BSAM CHECK PROCESSING WAITING       02945600
*                                FOR I/O OPERATIONS TO COMPLETED.       02948400
*                                VALID FOR SUBTYPES 78 AND 79.          02951200
*********************************************************************** 02954000
* SUBTYPE 78 PROCESSING FLAGS                                         * 02956800
*********************************************************************** 02959600
ST78FLGS DS     BL4'0'           PROCESSING FLAGS, RESERVED.            02962400
ST78FLG0 EQU    X'80'            WHEN ON, THIS REQUEST WAS              02965200
*                                PROCESSED USING A CURRENTLY            02968000
*                                MOUNTED TAPE VOLUME AND DID            02970800
*                                NOT REQUIRE AN UNMOUNTED TAPE          02973600
*                                VOLUME TO BE MOUNTED.             @P6C 02976400
ST78FLG1 EQU    X'40'            WHEN ON, THIS REQUEST REQUIRED         02979200
*                                AN UNMOUNTED TAPE VOLUME               02982000
*                                AND THE TAPE DRIVE USED                02984800
*                                TO PROCESS THIS REQUEST WAS            02987600
*                                EMPTY AT THE START OF PROCESSING       02990400
*                                THIS REQUEST.  THEREFORE, THIS         02993200
*                                REQUEST DID NOT REQUIRE A              02996000
*                                CURRENTLY MOUNTED TAPE                 02998800
*                                VOLUME TO BE DEMOUNTED PRIOR           03001600
*                                TO MOUNTING THE REQUIRED TAPE          03004400
*                                VOLUME.                                03007200
ST78FLG2 EQU    X'20'            WHEN ON, THIS REQUEST REQUIRED AN      03010000
*                                UNMOUNTED TAPE VOLUME TO BE            03012800
*                                MOUNTED AND THE TAPE DRIVE TASK        03015600
*                                USED TO PROCESS THIS REQUEST           03018400
*                                ALREADY HAD A TAPE DRIVE               03021200
*                                ALLOCATED AND A DIFFERENT TAPE         03024000
*                                VOLUME MOUNTED.  THEREFORE, THIS       03026800
*                                REQUEST REQUIRED A CURRENTLY           03029600
*                                MOUNTED TAPE VOLUME TO BE              03032400
*                                DEMOUNTED PRIOR TO MOUNTING THE        03035200
*                                REQUIRED TAPE VOLUME.                  03038000
ST78FLG3 EQU    X'10'            THIS REQUEST WAS PROCESSED             03040800
*                                USING A TAPE DRIVE INSIDE AN           03043600
*                                IBM AUTOMATED TAPE LIBRARY             03046400
*                                DATASERVER.                            03049200
ST78FLG4 EQU    X'08'            THIS REQUEST WAS PROCESSED             03049600
*                                USING A TAPE VOLUME ASSOCIATED         03050000
*                                WITH SUBLEVEL1            @L6A         03050400
ST78FLG5 EQU    X'04'            THIS REQUEST WAS PROCESSED             03050800
*                                USING A TAPE VOLUME ASSOCIATED         03051200
*                                WITH SUBLEVEL2            @L6A         03051600
ST78NOBJ DS     BL4'0'           TOTAL NUMBER OF OBJECTS                03052000
*                                PROCESSED IN THIS REQUEST              03054800
ST78NKBP DS     BL4'0'           NUMBER OF KILOBYTES OF OBJECT          03057600
*                                DATA IN THIS REQUEST                   03060400
ST78SOBJ DS     BL4'0'           TOTAL NUMBER OF OBJECTS                03063200
*                                IN THIS REQUEST PROCESSED              03066000
*                                SUCCESSFULLY.                    @P5C  03068800
ST78SKBP DS     BL4'0'           NUMBER OF KILOBYTES OF OBJECT          03071600
*                                DATA SUCCESSFULLY                @P5C  03074400
*                                PROCESSED IN THIS REQUEST              03077200
         DS     CL16' '          RESERVED.                              03080000
ST78END  DS     0C               END OF SUBTYPE 78 BASE SECTION         03082800
*********************************************************************** 03085600
* SUBTYPE 78,79 & 88 OBJECT ARRAY SECTION                         @P0C* 03088400
*********************************************************************** 03091200
ST78OBJD DSECT                   ARRAY OF OBJECTS IN THIS REQUEST       03094000
ST78COLN DS     CL44' '          COLLECTION NAME                        03096800
ST78OBJN DS     CL44' '          OBJECT NAME                            03099600
ST78OLEN DS     BL4'0'           OBJECT LENGTH                          03102400
ST78OOFF DS     BL4'0'           OBJECT OFFSET, ONLY VALID              03105200
*                                ON SUBTYPE 79 FOR A                    03108000
*                                PARTIAL OBJECT READ.                   03110800
ST78VSN  DS     CL6' '           OPTICAL VOLUME SERIAL NUMBER           03113600
ST78TMT  DS     CL2' '           TAPE MEDIA TYPE.                       03116400
*                                02 = IBM 3480 STANDARD CAPACITY        03119200
*                                     CARTRIDGE SYSTEM TAPE.            03122000
*                                04 = IBM 3480 ENHANCED CAPACITY        03124800
*                                     CARTRIDGE SYSTEM TAPE.            03127600
*                                05 = IBM 3590 HIGH PERFORMANCE         03130400
*                                     CARTRIDGE TAPE.                   03133200
ST78OTKN DS     BL4'0'           OBJECT LOCATION TOKEN                  03136000
ST78RC   DS     BL4'0'           LCS RETURN CODE                        03138800
ST78RS   DS     BL4'0'           LCS REASON CODE                        03141600
         EJECT                                                          03144400
*********************************************************************** 03147200
*                                                                     * 03150000
*   OAM SUBTYPE SECTION, FOR SUBTYPES 80 - 81                         * 03152800
*                                                                     * 03155600
*   SUBTYPE FUNCTION                                                  * 03158400
*   ------- ---------------------------------------------------       * 03161200
*        80 LCS TAPE LIBRARY VARY ONLINE                              * 03164000
*        81 LCS TAPE LIBRARY VARY OFFLINE                             * 03166800
*                                                                     * 03169600
*********************************************************************** 03172400
ST80     DSECT                   SUBTYPES 80 AND 81                     03175200
ST80TLN  DS     CL8' '           TAPE LIBRARY NAME                      03178000
ST80TLDT DS     CL8' '           TAPE LIBRARY DEVICE TYPE               03180800
ST80LTQT DS     BL4'0'           LCS LIBRARY TASK QUEUE TIME.           03183600
*                                THE AMOUNT OF TIME (IN                 03186400
*                                MILLISECONDS) THAT THIS REQUEST        03189200
*                                SPENT ON THE LCS LIBRARY QUEUE         03192000
*                                (LQE QUEUE) WAITING TO BE              03194800
*                                PROCESSED.                             03197600
ST80LTPT DS     BL4'0'           LCS LIBRARY TASK PROCESSING TIME.      03200400
*                                THE AMOUNT OF TIME (IN                 03203200
*                                MILLISECONDS) THAT THIS REQUEST        03206000
*                                TOOK TO BE PROCESSED BY THE            03208800
*                                LIBRARY TASK.                          03211600
ST80RC   DS     BL4'0'           LCS RETURN CODE                        03214400
ST80RS   DS     BL4'0'           LCS REASON CODE                        03217200
ST80FLGS DS     BL4'0'           PROCESSING FLAGS, RESERVED.            03220000
         EJECT                                                          03222800
*********************************************************************** 03225600
*                                                                     * 03228400
*   OAM SUBTYPE SECTION, FOR SUBTYPES 82 - 86                         * 03231200
*                                                                     * 03234000
*   SUBTYPE FUNCTION                                                  * 03236800
*   ------- ---------------------------------------------------       * 03239600
*        82 LCS TAPE LIBRARY VOLUME ENTRY                             * 03242400
*        83 LCS TAPE LIBRARY VOLUME EJECT                             * 03245200
*        84 LCS TAPE LIBRARY VOLUME AUDIT                             * 03248000
*        85 LCS TAPE LIBRARY VOLUME MOUNT                             * 03250800
*        86 LCS TAPE LIBRARY VOLUME DEMOUNT                           * 03253600
*                                                                     * 03256400
*********************************************************************** 03259200
ST82     DSECT                   SUBTYPES 82 - 86                       03262000
ST82TLN  DS     CL8' '           TAPE LIBRARY NAME                      03264800
ST82TLDT DS     CL8' '           TAPE LIBRARY DEVICE TYPE               03267600
ST82TDDT DS     CL4' '           TAPE DRIVE UCB DEVICE TYPE.            03270400
*                                VALID FOR SUBTYPES 85 AND 86,          03273200
*                                CONTAINS ZEROS FOR OTHERS.             03276000
ST82TDDN DS     CL4' '           MVS DEVICE NUMBER CORRESPONDING        03278800
*                                TO TAPE DRIVE.                         03281600
*                                VALID FOR SUBTYPES 85 AND 86,          03284400
*                                CONTAINS ZEROS FOR OTHERS.             03287200
ST82VSN  DS     CL6' '           TAPE VOLUME SERIAL NUMBER              03290000
ST82TMT  DS     CL2' '           TAPE MEDIA TYPE                        03292800
*                                02 = IBM 3480 STANDARD CAPACITY        03295600
*                                     CARTRIDGE SYSTEM TAPE.            03298400
*                                04 = IBM 3480 ENHANCED CAPACITY        03301200
*                                     CARTRIDGE SYSTEM TAPE.            03304000
*                                05 = IBM 3590 HIGH PERFORMANCE         03306800
*                                     CARTRIDGE TAPE.                   03309600
ST82LIQT DS     BL4'0'           AMOUNT OF TIME (IN MILLISECONDS)       03312400
*                                THIS REQUEST SPENT ON THE LCS          03315200
*                                INPUT-WORK-QUEUE WAITING TO            03318000
*                                PROCESSED.                             03320800
ST82LDQT DS     BL4'0'           AMOUNT OF TIME (IN MILLISECONDS)       03323600
*                                THIS REQUEST SPENT ON THE LCS          03326400
*                                DISPATCHER-QUEUE WAITING TO            03329200
*                                PROCESSED.                             03332000
ST82LTQT DS     BL4'0'           LIBRARY TASK QUEUE TIME.               03334800
*                                AMOUNT OF TIME (IN MILLISECONDS)       03337600
*                                THIS REQUEST SPENT ON THE LCS          03340400
*                                LIBRARY TASK QUEUE (LQE QUEUE)         03343200
*                                WAITING TO BE PROCESSED.               03346000
*                                NORMALLY, THIS FIELD REPRESENTS        03348800
*                                CARTRIDGE TRANSPORT MECHANISM          03351600
*                                WAIT TIME.  THAT IS, THE AMOUNT        03354400
*                                OF TIME WAITING FOR THE CARTRIDGE      03357200
*                                TRANSPORT MECHANISM (ROBOT) TO         03360000
*                                BECOME AVAILABLE WITHIN AN             03362800
*                                AUTOMATED STORAGE LIBRARY.             03365600
ST82LTPT DS     BL4'0'           LIBRARY TASK PROCESSING TIME.          03368400
*                                AMOUNT OF TIME (IN MILLISECONDS)       03371200
*                                THIS REQUEST TOOK TO BE                03374000
*                                PROCESSED BY THE LIBRARY TASK.         03376800
*                                WAITING TO BE PROCESSED.               03379600
*                                NORMALLY, THIS FIELD REPRESENTS        03382400
*                                CARTRIDGES TRANSPORT MECHANISM         03385200
*                                SERVICE TIME.  THAT IS, THE            03388000
*                                TIM SPENT BY THE                       03390800
*                                CARTRIDGE TRANSPORT MECHANISM          03393600
*                                (ROBOT) TO MOVE CARTRIDGES WITHIN      03396400
*                                THE OPTICAL DISK LIBRARY.              03399200
ST82RC   DS     BL4'0'           LCS RETURN CODE                        03402000
ST82RS   DS     BL4'0'           LCS REASON CODE                        03404800
ST82FLGS DS     BL4'0'           PROCESSING FLAGS, RESERVED.            03407600
         EJECT                                                          03410400
*********************************************************************** 03413200
*                                                                     * 03416000
*   OAM SUBTYPE SECTION, FOR SUBTYPE 87                               * 03418800
*                                                                     * 03421600
*   SUBTYPE FUNCTION                                                  * 03424400
*   ------- ---------------------------------------------------       * 03427200
*        87 OAM OWNED TAPE VOLUME DEMOUNT                             * 03430000
*                                                                     * 03432800
*********************************************************************** 03435600
ST87     DSECT                   SUBTYPE 87                             03438400
ST87TDDN DS     CL4' '           MVS DEVICE NUMBER CORRESPONDING        03441200
*                                TO TAPE DRIVE.                         03444000
ST87TDDT DS     CL4' '           TAPE DRIVE UCB DEVICE TYPE             03446800
ST87TVUN DS     CL8' '           TAPE VOLUME UNIT NAME                  03449600
ST87VSN  DS     CL6' '           TAPE VOLUME SERIAL NUMBER              03452400
ST87TMT  DS     CL2' '           TAPE MEDIA TYPE                        03455200
*                                02 = IBM 3480 STANDARD CAPACITY        03458000
*                                     CARTRIDGE SYSTEM TAPE.            03460800
*                                04 = IBM 3480 ENHANCED CAPACITY        03463600
*                                     CARTRIDGE SYSTEM TAPE.            03466400
*                                05 = IBM 3590 HIGH PERFORMANCE         03469200
*                                     CARTRIDGE TAPE.                   03472000
ST87TVT  DS     CL1' '           TAPE VOLUME TYPE.                      03474800
*                                G = TAPE VOLUME IS A GROUPED           03477600
*                                VOLUME BELONGING TO AN OBJECT          03480400
*                                STORAGE GROUP.                         03483200
*                                B = TAPE VOLUME IS A GROUPED           03486000
*                                VOLUME BELONGING TO AN OBJECT          03488800
*                                BACKUP STORAGE GROUP.                  03491600
         DS     CL3' '           RESERVED.                              03494400
ST87SGN  DS     CL8' '           STORAGE GROUP NAME.                    03497200
ST87RC   DS     BL4'0'           LCS RETURN CODE                        03500000
ST87RS   DS     BL4'0'           LCS REASON CODE                        03502800
*********************************************************************** 03503500
* SUBTYPE 87 PROCESSING FLAGS                                         * 03504200
*********************************************************************** 03504900
ST87FLGS DS     BL4'0'           PROCESSING FLAGS.                      03505400
ST87FLG0 EQU    X'80'            THIS REQUEST WAS PROCESSED             03506000
*                                USING A TAPE VOLUME ASSOCIATED         03506400
*                                WITH SUBLEVEL1            @L6A         03506800
ST87FLG1 EQU    X'40'            THIS REQUEST WAS PROCESSED             03507200
*                                USING A TAPE VOLUME ASSOCIATED         03507600
*                                WITH SUBLEVEL2            @L6A         03508000
ST87TMNT DS     BL4'0'           ELAPSED TIME (IN MILLISECONDS) @P5C    03509600
*                                THAT TAPE VOLUME WAS MOUNTED,          03511200
*                                MEASURED FROM COMPLETION OF THE        03514000
*                                DFSMS OPEN MACRO TO COMPLETION         03516800
*                                OF THE DFSMS CLOSE MACRO.              03519600
ST87NOW  DS     BL4'0'           NUMBER OF OBJECT WRITTEN TO THIS       03522400
*                                TAPE VOLUME WHILE IT                   03525200
*                                WAS MOUNTED.                           03528000
ST87NKBW DS     BL4'0'           NUMBER OF KILOBYTES OF OBJECT          03530800
*                                DATA WRITTEN TO THIS TAPE              03533600
*                                VOLUME WHILE IT WAS MOUNTED.           03536400
*                                SUPERSEDED BY ST87NBW.                 03537300
*                                SEE NOTE 1.                       @LAC 03538200
ST87NOR  DS     BL4'0'           NUMBER OF OBJECT READ FROM THIS        03539200
*                                TAPE VOLUME WHILE IT                   03542000
*                                WAS MOUNTED.                           03544800
ST87NKBR DS     BL4'0'           NUMBER OF KILOBYTES OF OBJECT          03547600
*                                DATA READ FROM THIS TAPE               03550400
*                                VOLUME WHILE IT WAS MOUNTED.           03553200
*                                SUPERSEDED BY ST87NBR.                 03553300
*                                SEE NOTE 1.                       @LAC 03553400
         DS     BL4'0'           RESERVED                          @LAA 03553500
ST87NBW  DS     BL8'0'           NUMBER OF BYTES OF OBJECT              03553800
*                                DATA WRITTEN TO THIS TAPE              03554100
*                                VOLUME WHILE IT WAS MOUNTED.      @LAA 03554400
ST87NBR  DS     BL8'0'           NUMBER OF BYTES OF OBJECT              03554700
*                                DATA READ FROM THIS TAPE               03555000
*                                VOLUME WHILE IT WAS MOUNTED.      @LAA 03555300
*********************************************************************** 03555600
*                                                                     * 03555900
* NOTE 1: 4 BYTE FIELDS REPORTING KILOBYTE VALUES HAVE BEEN           * 03556200
*         SUPERSEDED BY CORRESPONDING 8 BYTE FIELDS REPORTING VALUES  * 03556500
*         IN BYTES. THE EXISTING 4 BYTE FIELDS WILL CONTAIN           * 03556800
*         X'FFFF FFFF' IF AN OVERFLOW CONDITION OCCURS.               * 03557100
*                                                                     * 03557400
*********************************************************************** 03557700
         EJECT                                                          03558000
*********************************************************************** 03558800
*                                                                     * 03561600
*   OAM SUBTYPE SECTION, FOR SUBTYPE 90,91,92,93                      * 03561700
*                                                                     * 03561800
*   SUBTYPE FUNCTION                                                  * 03561900
*   ------- ---------------------------------------------------       * 03562000
*        90 LCS File System Write Request                             * 03562100
*        91 LCS File System Read  Request                             * 03562200
*        92 LCS File System Physical Delete Request                   * 03562300
*        93 LCS File System Physical Delete Request for uncommitted   * 03562400
*           Store cleanup                                             * 03562500
*********************************************************************** 03562600
ST90     DSECT                   SUBTYPE 90                        @L9A 03562700
ST90DIR  DS     CL30' '          File system directory             @L9A 03562800
ST90SGN  DS     CL8' '           OBJECT storage group name         @L9A 03562900
ST90COLN DS     CL44' '          Collection name                   @L9A 03563000
ST90OBJN DS     CL44' '          Object name                       @L9A 03563100
ST90FST  DS     CL2' '           File system type                  @L9A 03563200
*                                  Only valid for subtypes 90 and 91    03563300
ST90INST DS     BL4'0'           Instance ID                       @L9A 03563400
ST90FLGS DS     BL4'0'           Processing Flags                  @L9A 03563500
ST90FLG0 EQU    X'80'            When on, request originated within@L9A 03563600
*                                the OAM address space                  03563700
ST90FLG1 EQU    X'40'            When on, request originated       @L9A 03563800
*                                outside of the OAM address space       03563900
ST90FLG2 EQU    X'20'            Reserved                          @PCA 03564000
ST90OLEN DS     BL4'0'           Object length                     @L9A 03564100
*                                  Only valid for subtypes 90 and 91    03564200
ST90OOFF DS     BL4'0'           Object offset                     @L9A 03564300
*                                  Valid for a subtype 91 partial read  03564400
ST90LIQT DS     BL4'0'           LCS input-work-queue time         @PBC 03564500
*                                 (in milliseconds, only for 90 and 91) 03564600
ST90LDQT DS     BL4'0'           LCS dispatcher-queue time         @PBC 03564700
*                                 (in milliseconds, only for 90 and 91) 03564800
ST90LEQT DS     BL4'0'           LCS execution-queue time          @PBC 03564900
*                                 (in milliseconds, only for 90 and 91) 03565000
ST90RC   DS     BL4'0'           LCS Return code                   @L9A 03565100
ST90RS   DS     BL4'0'           LCS Reason code                   @L9A 03565200
*                                                                       03565300
         EJECT                                                          03565400
*********************************************************************** 03565401
*                                                                     * 03565402
*   OAM SUBTYPE SECTION, FOR SUBTYPE 100, 101, 102, 103               * 03565403
*                                                                     * 03565404
*   SUBTYPE FUNCTION                                                  * 03565405
*   ------- ---------------------------------------------------       * 03565406
*       100 LCS Cloud Write Request                                   * 03565407
*       101 LCS Cloud Read  Request                                   * 03565408
*       102 LCS Cloud Physical Delete Request                         * 03565409
*       103 LCS Cloud Physical Delete Request for uncommitted         * 03565410
*           OSREQ Store                                               * 03565411
*********************************************************************** 03565412
ST100     DSECT                   SUBTYPE 100                           03565413
ST100CID  DS     BL2'0'           Cloud ID                         @LFA 03565414
          DS     BL2'0'           Reserved                         @LFA 03565415
ST100SGN  DS     CL8' '           Object storage group name        @LFA 03565416
ST100COLN DS     CL44' '          Collection name                  @LFA 03565417
ST100OBJN DS     CL44' '          Object name                      @LFA 03565418
ST100INST DS     BL4'0'           Instance ID                      @LFA 03565419
ST100FLGS DS     BL4'0'           Processing Flags                 @LFA 03565420
ST100FLG0 EQU    X'80'            When on, request originated within    03565421
*                                 the OAM address space            @LFA 03565422
ST100FLG1 EQU    X'40'            When on, request originated           03565423
*                                 outside of the OAM address space @LFA 03565424
ST100OLEN DS     BL4'0'           Object length                         03565425
*                                 Only valid for 100 and 101       @LFA 03565426
ST100OOFF DS     BL4'0'           Object offset                         03565427
*                                 Valid for a 101 partial read     @LFA 03565428
ST100LIQT DS     BL4'0'           LCS input-work-queue time             03565429
*                                 (in ms, only for 100 and 101)    @LFA 03565430
ST100LDQT DS     BL4'0'           LCS dispatcher-queue time             03565431
*                                 (in ms, only for 100 and 101)    @LFA 03565432
ST100LEQT DS     BL4'0'           LCS execution-queue time              03565433
*                                 (in ms, only for 100 and 101)    @LFA 03565434
ST100LCLT DS     BL4'0'           Cloud Data Access Time. Amount        03565435
*                                 of time (in ms) this request spent    03565436
*                                 in Cloud Data Access Services.   @LFA 03565437
ST100RC   DS     BL4'0'           LCS Return code                  @LFA 03565438
ST100RS   DS     BL4'0'           LCS Reason code                  @LFA 03565439
          EJECT                                                         03565440
*********************************************************************** 03565500
*                                                                     * 03565600
*   OAM SMF RECORD 85 SUBTYPES                                        * 03565700
*                                                                     * 03567200
*********************************************************************** 03570000
SMFST01  EQU     X'01'           OSREQ ACCESS                           03572800
SMFST02  EQU     X'02'           OSREQ STORE                            03575600
SMFST03  EQU     X'03'           OSREQ RETRIEVE                         03578400
SMFST04  EQU     X'04'           OSREQ QUERY                            03581200
SMFST05  EQU     X'05'           OSREQ CHANGE                           03584000
SMFST06  EQU     X'06'           OSREQ DELETE                           03586800
SMFST07  EQU     X'07'           OSREQ UNACCESS                         03589600
SMFST08  EQU     X'08'           OSREQ STOREBEG                    @L7A 03590300
SMFST09  EQU     X'09'           OSREQ STOREPRT                    @L7A 03591000
SMFST10  EQU     X'0A'           OSREQ STOREEND                    @L7A 03591700
SMFST32  EQU     X'20'           OSMC STOR GRP PROCESSING               03592400
SMFST33  EQU     X'21'           OSMC DASD SPACE MANAGEMENT             03595200
SMFST34  EQU     X'22'           OSMC OPTICAL DISK RECOVERY UTILITY     03598000
SMFST35  EQU     X'23'           OSMC MOVEVOL UTILITY                   03600800
SMFST36  EQU     X'24'           OSMC SINGLE OBJECT RECOVERY UTILITY    03603600
SMFST37  EQU     X'25'           OSMC LIBRARY SPACE MANAGEMENT          03606400
SMFST38  EQU     X'26'           OSMC OBJECT RECALL                @L4A 03607800
SMFST39  EQU     X'27'           OSMC OBJECT BACKUP                @L5A 03608500
SMFST40  EQU     X'28'           OSMC COMMAND RECYCLE              @L5A 03608800
SMFST64  EQU     X'40'           LCS OPTICAL DRIVE VARY ONLINE          03609200
SMFST65  EQU     X'41'           LCS OPTICAL DRIVE VARY OFFLINE         03612000
SMFST66  EQU     X'42'           LCS OPTICAL LIBRARY VARY ONLINE        03614800
SMFST67  EQU     X'43'           LCS OPTICAL LIBRARY VARY OFFLINE       03617600
SMFST68  EQU     X'44'           LCS OPTICAL CARTRIDGE ENTRY            03620400
SMFST69  EQU     X'45'           LCS OPTICAL CARTRIDGE EJECT            03623200
SMFST70  EQU     X'46'           LCS OPTICAL CARTRIDGE LABEL            03626000
SMFST71  EQU     X'47'           LCS OPTICAL VOLUME AUDIT               03628800
SMFST72  EQU     X'48'           LCS OPTICAL VOLUME MOUNT               03631600
SMFST73  EQU     X'49'           LCS OPTICAL VOLUME DEMOUNT             03634400
SMFST74  EQU     X'4A'           LCS OPTICAL WRITE REQUEST              03637200
SMFST75  EQU     X'4B'           LCS OPTICAL READ REQUEST               03640000
SMFST76  EQU     X'4C'           LCS OPTICAL LOGICAL DELETE REQ    @P0C 03642800
SMFST77  EQU     X'4D'           LCS OPTICAL PHYSICAL DELETE REQUEST    03645600
SMFST78  EQU     X'4E'           LCS TAPE WRITE REQUEST                 03648400
SMFST79  EQU     X'4F'           LCS TAPE READ REQUEST                  03651200
SMFST80  EQU     X'50'           LCS TAPE LIBRARY VARY ONLINE           03654000
SMFST81  EQU     X'51'           LCS TAPE LIBRARY VARY OFFLINE          03656800
SMFST82  EQU     X'52'           LCS TAPE LIBRARY VOLUME ENTRY          03659600
SMFST83  EQU     X'53'           LCS TAPE LIBRARY VOLUME EJECT          03662400
SMFST84  EQU     X'54'           LCS TAPE LIBRARY VOLUME AUDIT          03665200
SMFST85  EQU     X'55'           LCS TAPE LIBRARY VOLUME MOUNT          03668000
SMFST86  EQU     X'56'           LCS TAPE LIBRARY VOLUME DEMOUNT        03670800
SMFST87  EQU     X'57'           OAM TAPE VOLUME DEMOUNT                03673600
SMFST88  EQU     X'58'           LCS TAPE LOGICAL DELETE REQUEST   @P0A 03673700
SMFST90  EQU     X'5A'           LCS FILE SYSTEM WRITE REQUEST     @L9A 03675000
SMFST91  EQU     X'5B'           LCS FILE SYSTEM READ  REQUEST     @L9A 03676300
SMFST92  EQU     X'5C'           LCS FILE SYSTEM PHYSICAL DELETE   @L9A 03677600
SMFST93  EQU     X'5D'           LCS FILE SYS DELETE-STORE CLEANUP @L9A 03678900
SMFST100 EQU     X'64'           LCS CLOUD WRITE REQUEST           @LFA 03678901
SMFST101 EQU     X'65'           LCS CLOUD READ REQUEST            @LFA 03678902
SMFST102 EQU     X'66'           LCS CLOUD DELETE REQUEST          @LFA 03678903
SMFST103 EQU     X'67'           LCS CLOUD DELETE CLEANUP REQUEST  @LFA 03678904
         EJECT                                                          03680200
*********************************************************************** 03681500
*                                                                     * 03682800
*   CONSTANTS FOR CHECKING OPTICAL MEDIA TYPE (IN SUCH FIELDS AS      * 03684100
*   ST32OMT, ST36OMT, ST64OMT, ST68OMT).                              * 03685400
*                                                                     * 03686700
*********************************************************************** 03688000
OMTLMSI  EQU     C'00'           LMSI 12-INCH 2.0 GB OPTICAL MEDIA      03689300
OMT1XRW  EQU     C'01'           3995 5.25-INCH 1X CAPACITY (650 MB)    03690600
*                                REWRITABLE OPTICAL DISK MEDIA          03691900
OMT1XWO  EQU     C'03'           3995 5.25-INCH 1X CAPACITY (650 MB)    03693200
*                                WRITE-ONCE-READ-MANY (WORM)            03694500
*                                OPTICAL DISK MEDIA                     03695800
OMT2XRW  EQU     C'11'           3995 5.25-INCH 2X CAPACITY (1300 MB)   03697100
*                                REWRITABLE OPTICAL DISK MEDIA          03698400
OMT2XWO  EQU     C'13'           3995 5.25-INCH 2X CAPACITY (1300 MB)   03699700
*                                WRITE-ONCE-READ-MANY (WORM)            03701000
*                                OPTICAL DISK MEDIA                     03702300
OMT4XRW  EQU     C'21'           3995 5.25-INCH 4X CAPACITY (2600 MB)   03703600
*                                REWRITABLE OPTICAL DISK MEDIA          03704900
OMT4XWO  EQU     C'23'           3995 5.25-INCH 4X CAPACITY (2600 MB)   03706200
*                                PERMANENT WRITE-ONCE-READ-MANY (WORM)  03707500
*                                OPTICAL DISK MEDIA                     03708800
OMT4XCC  EQU     C'25'           3995 5.25-INCH 4X CAPACITY (2600 MB)   03710100
*                                CONTINUOUS COMPOSITE WRITE (CCW)       03711400
*                                WRITE-ONCE-READ-MANY (WORM)            03712700
*                                OPTICAL DISK MEDIA                     03714000
*********************************************************************** 03715300
*                                                                     * 03716600
*   CONSTANTS FOR CHECKING TAPE MEDIA TYPE (IN SUCH FIELDS AS         * 03717900
*   ST36TMT, ST78TMT, ST82TMT, AND ST87TMT).                          * 03719200
*                                                                     * 03720500
*********************************************************************** 03721800
TMT3490S EQU     C'02'           3490 STANDARD CAPACITY CARTRIDGE       03723100
*                                SYSTEM TAPE (CST)                      03724400
TMT3490E EQU     C'04'           3490 ENHANCED CAPACITY CARTRIDGE       03725700
*                                SYSTEM TAPE (ECCST)                    03727000
TMT3590S EQU     C'05'           3590 HIGH PERFORMANCE CARTRIDGE        03728300
*                                TAPE                                   03729600
*********************************************************************** 03730900
*                                                                     * 03732200
*   CONSTANTS FOR CHECKING OPTICAL VOLUME TYPE (SUCH AS FIELDS        * 03733500
*   ST64OVT, ST68OVT AND ST74OVT).                                    * 03734800
*                                                                     * 03736100
*********************************************************************** 03737400
OVTSCRTC EQU     C'S'            OPTICAL VOLUME IS A SCRATCH VOLUME     03738700
OVTGROUP EQU     C'G'            OPTICAL VOLUME IS A GROUPED VOLUME     03740000
*                                ASSIGNED TO AN OBJECT STORAGE GROUP    03741300
OVTBACKP EQU     C'B'            OPTICAL VOLUME IS A BACKUP VOLUME      03742600
*                                ASSIGNED TO AN OBJECT BACKUP STORAGE   03743900
*                                GROUP                                  03745200
         MEND            */                                             03746500
 %CBRSMFPL:                                                             03747800
    /* STANDARD SMF RECORD HEADER FOR OAM SMF RECORD                 */ 03750000
  IF SMFBASE = '' %THEN                                                 03800008
   %DO;                                                                 03850000
     %IF IBM_CBGENC ^= 'YES' %THEN                                      03860008
     %DO;                                                               03870008
      DECLARE 1 CBRSMF85 BDY(DWORD), /* OAM SMF RECORD               */ 03900000
     %END;                                                              03910008
     %ELSE %DO;                                                         03920008
      DECLARE 1 CBRSMF85 BASED BDY(DWORD), /* OAM SMF RECORD         */ 03921008
     %END;                                                              03930008
   %END;                                                                03950000
 %ELSE                                                                  04000000
   %DO;                                                                 04050000
      DECLARE 1 CBRSMF85 BASED(SMFBASE) BDY(DWORD),/* OAM SMF RECORD */ 04100000
   %END;                                                                04150000
      3 SMF85HDR,                   /* SMF RECORD TYPE 85 HEADER     */ 04200000
        5 SMF85LEN FIXED(16),       /* RECORD LENGTH                 */ 04250000
        5 SMF85SEG FIXED(16),       /* RECORD SEGMENT                */ 04300000
        5 SMF85FLG BIT(8),          /* SYSTEM INDICATOR              */ 04350000
          7 SMF85FL0  BIT(1),       /* RESERVED                      */ 04400000
          7 SMF85FL1  BIT(1),       /* SUBTYPES ARE VALID            */ 04450000
          7 SMF85FL2  BIT(1),       /* RESERVED                      */ 04500000
          7 SMF85FL3  BIT(1),       /* MVS/SP VERSION 4 (MVS/ESA) AND   04525000
                                       ABOVE.  BITS 3, 4, 5 AND 6 ARE   04550000
                                       ON.                           */ 04575000
          7 SMF85FL4  BIT(1),       /* MVS/SP VERSION 3 (MVS/ESA).      04600000
                                       BITS 4, 5 AND 6 ARE ON.       */ 04625000
          7 SMF85FL5  BIT(1),       /* MVS/SP VERSION 2 (MVS/XA)        04650000
                                       BITS 5 AND 6 ARE ON.          */ 04675000
          7 SMF85FL6  BIT(1),       /* VS2                           */ 04700000
          7 SMF85FL7  BIT(1),       /* RESERVED                      */ 04750000
        5 SMF85RTY FIXED(8),        /* RECORD TYPE                   */ 04800000
        5 SMF85TME FIXED(32) BDY(WORD,3), /* TIME SINCE MIDNIGHT, IN    04850000
                                       HUNDREDTHS OF SECONDS, RECORD    04900000
                                       WAS PRESENTED TO SMF */          04950000
        5 SMF85DTE CHAR(4),         /* DATE RECORD WAS PRESENTED TO SMF,05000000
                                       IN THE FORM OCYYDDDF, WHERE F IS 05050000
                                       THE SIGN.                     */ 05100000
        5 SMF85SID CHAR(4),         /* SYSTEM IDENTIFICATION (FROM SID  05150000
                                       PARAMETER)                    */ 05200000
        5 SMF85SSI CHAR(4),         /* SUBSYSTEM IDENTIFICATION,        05250000
                                       CONTAINS 'OAM ' FOR ALL OAM      05300000
                                       SMF RECORDS.                  */ 05350000
        5 SMF85STY FIXED(16),       /* RECORD SUBTYPE                */ 05400000
        5 SMF85TRN FIXED(16),       /* NUMBER OF TRIPLETS IN THIS       05450000
                                       RECORD.  A TRIPLET IS A SET OF   05500000
                                       OFFSET/LENGTH/VALUES THAT DEFINE 05550000
                                       A SECTION OF THE RECORD.      */ 05600000
        5 SMF85PSO FIXED(32) BDY(WORD,3), /* OFFSET TO OAM PROD SEC  */ 05650000
        5 SMF85PSL FIXED(16),       /* LENGTH OF OAM PRODUCT SECTION */ 05700000
        5 SMF85PSN FIXED(16),       /* NUMBER OF OAM PRODUCT SECTIONS*/ 05750000
        5 SMF85OSO FIXED(32) BDY(WORD,3),/* OFFSET TO OAM SUBTYPE SEC */05800000
        5 SMF85OSL FIXED(16),       /* LENGTH OF OAM SUBTYPE SECTION */ 05850000
        5 SMF85OSN FIXED(16),       /* NUMBER OF OAM SUBTYPE SECTIONS*/ 05900000
        5 *        CHAR(6),         /* RESERVED                      */ 05950000
        5 SMF85END CHAR(0),         /* END OF SMF HEADER             */ 05975000
 @EJECT;                                                                06000000
 %CBRSMF_PFX = 'R85';                                         /* @PDA*/ 06010000
 %CBRSMF_PF2 = 'SMF';                                         /* @PDA*/ 06011001
 %CBRSMF_PF3 = 'SMF';                                         /* @PDA*/ 06012002
 %IF IBM_CBGENC = 'YES' %THEN %CBRSMF_PFX = 'SMF85';          /* @PDA*/ 06020003
 %IF IBM_CBGENC = 'YES' %THEN %CBRSMF_PF2 = 'SMF85';          /* @PDA*/ 06030003
 %IF IBM_CBGENC = 'YES' %THEN %CBRSMF_PF3 = 'SMF85k';         /* @PDA*/ 06040003
        /* OAM PRODUCT IDENTIFICATION SECTION                        */ 06050000
     3 SMF85PIS,                    /* PRODUCT IDENTIFICATION SECTION*/ 06100000
        5 CBRSMF_PFX%%PCID CHAR(9), /* COMPONENT ID FOR OAM. FOR        06150000
                                       DFSMS/MVS CONTAINS THE           06200000
                                       CHARACTERS '5695DF180'.       */ 06250000
        5 CBRSMF_PFX%%PVID FIXED(8), /* VERSION NUMBER IN BINARY.       06300000
                                       FROM DFARELS.DFAVER.      @LAC*/ 06350000
        5 CBRSMF_PFX%%PRID FIXED(8), /* RELEASE NUMBER IN BINARY.       06400000
                                       FROM DFARELS.DFARLSE.     @LAC*/ 06450000
        5 CBRSMF_PFX%%PMID FIXED(8), /* MODIFICATION LEVEL IN BINARY.   06500000
                                       FROM DFARELS.DFAMOD.      @LAC*/ 06550000
        5 CBRSMF_PFX%%PFMID CHAR(8), /* SMP/E FMID FOR OAM.          */ 06600000
        5 CBRSMF_PFX%%PID FIXED(8), /* PRODUCT ID IN BINARY.            06625000
                                       FROM DFARELS.DFAPROD.     @LAA*/ 06650000
        5 *        CHAR(3),         /* RESERVED                  @LAC*/ 06675000
        5 CBRSMF_PFX%%PCPUI CHAR(8), /* CPU ID AS STORED BY STIPD    */ 06700000
        5 CBRSMF_PFX%%PJOBN CHAR(8), /* JOB NAME                     */ 06750000
        5 CBRSMF_PFX%%PSTPN CHAR(8), /* STEP NAME                    */ 06800000
        5 CBRSMF_PFX%%PPRCN CHAR(8), /* PROCEDURE NAME               */ 06850000
        5 CBRSMF_PFX%%PPGMN CHAR(8), /* PROGRAM NAME                 */ 06900000
        5 CBRSMF_PFX%%USRID CHAR(8), /* USER IDENTIFICATION          */ 06950000
        5 CBRSMF_PFX%%PTRXN CHAR(8), /* TRANSACTION NAME             */ 07000000
        5 CBRSMF_PFX%%PSTRT CHAR(8), /* STARTING TIME OF FUNCTION, IN   07050000
                                       8-BYTE S/390 STORE CLOCK (STCK)  07100000
                                       INSTRUCTION FORMAT.           */ 07150000
        5 CBRSMF_PFX%%PENDT CHAR(8), /* ENDING TIME OF FUNCTION, IN     07200000
                                       8-BYTE S/390 STORE CLOCK (STCK)  07250000
                                       INSTRUCTION FORMAT.           */ 07300000
        5 CBRSMF_PFX%%PRESP FIXED(32), /* ELAPSED TIME OF FUNCTION,     07350000
                                       IN MILLISECONDS (.001            07400000
                                       SECOND UNITS)                    07433300
                                                                 @P5C*/ 07466600
        5 CBRSMF_PFX%%POSUB CHAR(4), /* OAM SUBSYSTEM ID         @LEA*/ 07466700
        5 CBRSMF_PFX%%PSSID CHAR(4), /* DB2 SUBSYSTEM ID ASSOCIATED WITH07466800
                                       THE OAM SUBSYSTEM         @LEA*/ 07466900
        5 *        CHAR(4),         /* RESERVED                  @LEC*/ 07500000
        5 CBRSMF_PFX%%PEND CHAR(0); /* END OF OAM PRODUCT ID SECTION */ 07550000
 %CBRSMF_PFX = '';                                            /* @PEA*/ 07550001
 %IF IBM_CBGENC = 'YES' %THEN %CBRSMF_PFX = 'SMF85';          /* @PEA*/ 07550002
 %IF IBM_CBGENC = 'YES' !                                     /* @PDC*/ 07600000
     SMF85S01 ^= '' !                                                   07610000
     SMF85S02 ^= '' !                                                   07650000
     SMF85S03 ^= '' !                                                   07700000
     SMF85S04 ^= '' !                                                   07750000
     SMF85S05 ^= '' !                                                   07800000
     SMF85S06 ^= '' !                                                   07850000
     SMF85S08 ^= '' !                                                   07870000
     SMF85S09 ^= '' !                                                   07890000
     SMF85S10 ^= '' !                                                   07910000
     SMF85S07 ^= '' %THEN                                       ] @L7C  07930000
   %DO;                                                                 07950000
 @EJECT;                            /*                               */ 08000000
 /********************************************************************/ 08050000
 /*                                                                  */ 08100000
 /* OAM SUBTYPE SECTION, FOR SUBTYPES 1 - 10.                    @P7C*/ 08150000
 /*                                                                  */ 08200000
 /* SUBTYPE FUNCTION                                                 */ 08250000
 /* ------- ---------------------------------------------------      */ 08300000
 /*       1 OSREQ ACCESS                                             */ 08350000
 /*       2 OSREQ STORE                                              */ 08400000
 /*       3 OSREQ RETRIEVE                                           */ 08450000
 /*       4 OSREQ QUERY                                              */ 08500000
 /*       5 OSREQ CHANGE                                             */ 08550000
 /*       6 OSREQ DELETE                                             */ 08600000
 /*       7 OSREQ UNACCESS                                           */ 08650000
 /*       8 OSREQ STOREBEG                                       @L7A*/ 08662500
 /*       9 OSREQ STOREPRT                                       @L7A*/ 08675000
 /*      10 OSREQ STOREEND                                       @L7A*/ 08687500
 /*                                                                  */ 08700000
 /********************************************************************/ 08750000
 %CBRSMF_DEF = 'DEFINED(R85PEND)';                            /* @PDA*/ 08760001
 %IF IBM_CBGENC = 'YES' %THEN %CBRSMF_DEF = 'BASED';          /* @PDA*/ 08770001
 DECLARE                            /*                               */ 08800000
     1 CBRSMF_PFX%%ST1 CBRSMF_DEF,  /* SUBTYPES 1 - 10           @P7C*/ 08850001
       3 CBRSMF_PFX%%ST1COLN CHAR(44), /* COLLECTION NAME            */ 08900001
       3 CBRSMF_PFX%%ST1OBJN CHAR(44), /* OBJECT NAME                */ 08950001
       3 CBRSMF_PFX%%ST1SGN CHAR(8), /* STORAGE GROUP NAME           */ 09000001
       3 CBRSMF_PFX%%ST1SCN CHAR(8), /* STORAGE CLASS NAME           */ 09050001
       3 CBRSMF_PFX%%ST1MCN CHAR(8), /* MANAGEMENT CLASS NAME        */ 09100001
       3 CBRSMF_PFX%%ST1OFF FIXED(32), /* OFFSET FOR PARTIAL OBJECT     09150001
                                       RETRIEVE (SUBTYPE 3), ZERO FOR   09200000
                                       ALL OTHERS.                   */ 09250000
       3 CBRSMF_PFX%%ST1LEN FIXED(32), /* LENGTH,                       09300001
                                       SUBTYPE 1 - UNUSED               09350000
                                       SUBTYPE 2 - LENGTH OF OBJECT     09400000
                                                   STORED               09450000
                                       SUBTYPE 3 - NUMBER OF BYTES      09500000
                                                   RETRIEVED            09550000
                                       SUBTYPE 4 - NUMBER OF QEL        09600000
                                                   ELEMENTS RETURNED.   09650000
                                       SUBTYPE 5 - UNUSED               09700000
                                       SUBTYPE 6 - LENGTH OF OBJECT     09750000
                                                   DELETED              09800000
                                       SUBTYPE 7 - UNUSED               09812500
                                       SUBTYPE 8 - LENGTH OF OBJECT     09825000
                                                   STORED               09837500
                                       SUBTYPE 9 - LENGTH OF OBJECT     09850000
                                                   PART STORED          09862500
                                       SUBTYPE10 - LENGTH OF OBJECT     09875000
                                                   STORED        @L7C*/ 09887500
       3 CBRSMF_PFX%%ST1TTOK CHAR(16), /* OSREQ TRACKING TOKEN, SUPPLIED09900001
                                       WITH TTOKEN KEYWORD ON OSREQ     09950000
                                       MACRO                         */ 10000000
       3 CBRSMF_PFX%%ST1TOK CHAR(8), /* OSREQ ACCESS TOKEN           */ 10050001
       3 CBRSMF_PFX%%ST1VSN CHAR(6), /* VOLUME SERIAL NUMBER         */ 10100001
       3 CBRSMF_PFX%%ST1VMT CHAR(2), /* VOLUME MEDIA TYPE            */ 10150001
       3 CBRSMF_PFX%%ST1RC FIXED(31), /* OSREQ RETURN CODE, IN REGISTER 10200001
                                       15 FOLLOWING OSREQ MACRO      */ 10250000
       3 CBRSMF_PFX%%ST1RS FIXED(31), /* OSREQ REASON CODE, IN REGISTER 10300001
                                       15 FOLLOWING OSREQ MACRO      */ 10350000
       3 CBRSMF_PFX%%ST1FLGS BIT(32), /* PROCESSING FLAGS. MEANING      10366601
                                       DEPENDENT ON RECORD SUBTYPE.     10383200
                                                                 @L7C*/ 10399800
       3 CBRSMF_PFX%%ST1STOK CHAR(16), /* OSREQ STOKEN. Valid for       10416401
                                       subtypes 8, 9, and 10.    @L7A*/ 10433000
       3 CBRSMF_PFX%%ST1RC2 FIXED(31), /* OSREQ Return Code 2. Valid    10449601
                                       for subtypes 2, 3, and 10 @L8C*/ 10456200
       3 CBRSMF_PFX%%ST1STOUT FIXED(31), /*                             10462801
                                 STIMEOUT in seconds   SUB=8     @L8A*/ 10462901
       3 CBRSMF_PFX%%ST1OLRD CHAR(10), /*                               10469401
                                 Last refer date: OLD  SUB=3,5   @L8A*/ 10469501
       3 CBRSMF_PFX%%ST1NLRD CHAR(10), /*                               10470801
                                 Last refer date: NEW  SUB=3,5   @L9C*/ 10470901
       3 CBRSMF_PFX%%ST1INST FIXED(31), /*                              10472201
                                 Instance ID. For SUB 2,3,6,10   @LFC*/ 10472301
       3 CBRSMF_PFX%%ST1CLDID FIXED(15), /*                             10472302
                                 Cloud ID. For SUB 2,3,6,10      @LFA*/ 10472303
       3 *        FIXED(15),  /* Reserved                        @LFA*/ 10472304
       3 CBRSMF_PFX%%ST1CINST FIXED(31), /*                             10472305
                                 Cloud Instance ID. For 2,3,6,10 @LGC*/ 10472306
       3 CBRSMF_PFX%%ST1PRCAB FIXED(31), /*                             10472307
                                 OSREQ return code for primary          10472308
                                 object retrieve failure with           10472309
                                 automatic access to backup             10472310
                                 enabled. For SUB 3.             @LGA*/ 10472311
       3 CBRSMF_PFX%%ST1PRSAB FIXED(31);  /*                            10472312
                                 OSREQ reason code for primary          10472313
                                 object retrieve failure with           10472314
                                 automatic access to backup             10472315
                                 enabled. For SUB 3.             @LGA*/ 10472316
                                                                        10473600
 %CBRSMF_DEF = 'DEFINED(ST1FLGS)';                            /* @PDA*/ 10473701
 %IF IBM_CBGENC = 'YES' %THEN %CBRSMF_DEF = 'BASED';          /* @PDA*/ 10473801
    DECLARE                         /*                               */ 10475000
      1 CBRSMF_PFX%%ST_ONE_FLGS BIT(32) CBRSMF_DEF, /*                  10476401
                                       MEANING OF FLAGS FOR             10476501
                                       SUBTYPE 1 (OSREQ ACCESS)      */ 10477800
         3 CBRSMF_PFX%%ST1FLGS0 BIT(1), /*                              10479201
                                       When on,IADDRESS was specified*/ 10479301
         3 *        BIT(31);        /* RESERVED                  @L9A*/ 10480600
                                                                        10482800
    DECLARE                         /*                               */ 10500000
      1 CBRSMF_PFX%%ST2FLGS BIT(32) CBRSMF_DEF, /* MEANING OF FLAGS FOR 10550001
                                       SUBTYPE 2 (OSREQ STORE)       */ 10600000
         3 CBRSMF_PFX%%ST2FLGS0 BIT(1), /* OBJECT STORE TO DISK  @L9C*/ 10650001
         3 CBRSMF_PFX%%ST2FLGS1 BIT(1), /* OBJECT STORE TO OPTICAL   */ 10700001
         3 CBRSMF_PFX%%ST2FLGS2 BIT(1), /* OBJECT STORE TO TAPE      */ 10750001
         3 CBRSMF_PFX%%ST2FLGS3 BIT(1), /* OBJECT STORE TO CLOUD @LFC*/ 10800001
         3 CBRSMF_PFX%%ST2FLGS4 BIT(1), /* UNUSED                    */ 10850001
         3 CBRSMF_PFX%%ST2FLGS5 BIT(1), /* WHEN ON, THE OSREQ STORE     10900001
                                       REQUEST RESULTED IN THE MOUNTING 10950000
                                       OF A SHELF-RESIDENT REMOVABLE    11000000
                                       MEDIA VOLUME (TAPE OR OPTICAL)   11050000
                                       BY A HUMAN OPERATOR. ONLY VALID  11100000
                                       IF BIT 1 OR 2 IS ON.          */ 11150000
         3 CBRSMF_PFX%%ST2FLGS6 BIT(1), /* WHEN ON, THE OSREQ STORE     11200001
                                       REQUEST RESULTED IN THE MOUNTING 11250000
                                       OF A LIBRARY-RESIDENT REMOVABLE  11300000
                                       MEDIA VOLUME (TAPE OR OPTICAL)   11350000
                                       BY A HUMAN OPERATOR. ONLY VALID  11400000
                                       IF BIT 1 OR 2 IS ON.          */ 11450000
         3 CBRSMF_PFX%%ST2FLGS7 BIT(1), /* WHEN ON, THE OSREQ STORE     11500001
                                       REQUEST WAS SATISFIED USING @P5C 11550000
                                       AN ALREADY MOUNTED REMOVEABLE    11600000
                                       MEDIA VOLUME (TAPE OR OPTICAL).  11650000
                                       ONLY VALID                       11700000
                                       IF BIT 1 OR 2 IS ON.          */ 11750000
         3 CBRSMF_PFX%%ST2FLGS8 BIT(1), /* WHEN ON, AN IMMEDIATE BACKUP 11770001
                                       COPY WAS SCHEDULED FOR THIS      11790000
                                       OBJECT.                   @L5A*/ 11810000
         3 CBRSMF_PFX%%ST2FLGS9 BIT(1), /* WHEN ON, THE OBJECT IS STORED11820001
                                       TO LOB STORAGE STRUCTURE. @L5A*/ 11830000
         3 CBRSMF_PFX%%ST2FLGS10 BIT(1), /* WHEN ON, OBJECT STORED ON   11833301
                                       SUBLEVEL 1 VOLUME         @L6A*/ 11836600
         3 CBRSMF_PFX%%ST2FLGS11 BIT(1), /* WHEN ON, OBJECT STORED ON   11839901
                                       SUBLEVEL 2 VOLUME         @L6A*/ 11843200
         3 CBRSMF_PFX%%ST2FLGS12 BIT(1), /* UNUSED               @L8A*/ 11844101
         3 CBRSMF_PFX%%ST2FLGS13 BIT(1), /* DELHOLD=HOLD         @L8A*/ 11845001
         3 CBRSMF_PFX%%ST2FLGS14 BIT(1), /* Retention-protected  @L8A*/ 11845901
         3 CBRSMF_PFX%%ST2FLGS15 BIT(1), /* Deletion-protected   @L8A*/ 11846801
         3 CBRSMF_PFX%%ST2FLGS16 BIT(1), /* Event-based-retention @L8A*/11847701
         3 CBRSMF_PFX%%ST2FLGS17 BIT(1), /* Reserved             @PCA*/ 11848401
         3 *        BIT(14);        /* RESERVED                  @LCC*/ 11849100
    DECLARE                         /*                               */ 11850000
      1 CBRSMF_PFX%%ST3FLGS BIT(32) CBRSMF_DEF, /* MEANING OF FLAGS FOR 11900001
                                       SUBTYPE 3 (OSREQ RETRIEVE)    */ 11950000
         3 CBRSMF_PFX%%ST3FLGS0 BIT(1), /*                              12000001
                                       WHEN ON, PRIMARY COPY OF OBJECT  12010001
                                       RETRIEVED FROM DISK.      @L9C*/ 12050000
         3 CBRSMF_PFX%%ST3FLGS1 BIT(1), /*                              12100001
                                       WHEN ON, PRIMARY COPY OF OBJECT  12110001
                                       RETRIEVED FROM OPTICAL.       */ 12150000
         3 CBRSMF_PFX%%ST3FLGS2 BIT(1), /*                              12200001
                                       WHEN ON, PRIMARY COPY OF OBJECT  12210001
                                       RETRIEVED FROM TAPE.          */ 12250000
         3 CBRSMF_PFX%%ST3FLGS3 BIT(1), /*                              12284801
                                WHEN ON, EITHER THE FIRST OR THE        12284901
                                SECOND BACKUP COPY OF THE OBJECT WAS    12319600
                                RETRIEVED FROM OPTICAL AS RESULT OF     12354400
                                VIEW=BACKUP OR VIEW=BACKUP2 BEING       12389200
                                SPECIFIED ON THE OSREQ MACRO.           12424000
                                REFER TO BIT 10 TO INDICATE WHICH       12458800
                                BACKUP COPY WAS RETRIEVED.      @P1C */ 12493600
         3 CBRSMF_PFX%%ST3FLGS4 BIT(1), /*                              12528401
                                WHEN ON, EITHER THE FIRST OR THE        12528501
                                SECOND BACKUP COPY OF THE OBJECT WAS    12563200
                                RETRIEVED FROM TAPE AS RESULT OF        12598000
                                VIEW=BACKUP OR VIEW=BACKUP2 BEING       12632800
                                SPECIFIED ON THE OSREQ MACRO.           12667600
                                REFER TO BIT 10 TO INDICATE WHICH       12702400
                                BACKUP COPY WAS RETRIEVED.      @P1C */ 12737200
         3 CBRSMF_PFX%%ST3FLGS5 BIT(1), /*                              12772001
                                WHEN ON, EITHER THE FIRST OR THE        12773001
                                SECOND BACKUP COPY OF THE OBJECT WAS    12806800
                                RETRIEVED FROM OPTICAL AS A RESULT      12841600
                                OF THE PRIMARY COPY OF THE OBJECT       12876400
                                BEING UNAVAILABLE AND THE AUTOMATIC     12922800
                                ACCESS TO BACKUP BEING ACTIVE.  @P9C    12969200
                                REFER TO BIT 10 TO INDICATE WHICH       13015600
                                BACKUP COPY WAS RETRIEVED.      @P1C */ 13050400
         3 CBRSMF_PFX%%ST3FLGS6 BIT(1), /*                              13085201
                                WHEN ON, EITHER THE FIRST OR THE        13085301
                                SECOND BACKUP COPY OF THE OBJECT WAS    13120000
                                RETRIEVED FROM TAPE AS A RESULT         13154800
                                OF THE PRIMARY COPY OF THE OBJECT       13189600
                                BEING UNAVAILABLE AND THE AUTOMATIC     13236000
                                ACCESS TO BACKUP BEING ACTIVE.  @P9C    13282400
                                REFER TO BIT 10 TO INDICATE WHICH       13328800
                                BACKUP COPY WAS RETRIEVED.      @P1C */ 13363600
         3 CBRSMF_PFX%%ST3FLGS7 BIT(1), /*                              13400001
                                       WHEN ON, THE OSREQ RETRIEVE      13410001
                                       REQUEST RESULTED IN THE MOUNTING 13450000
                                       OF A SHELF-RESIDENT REMOVABLE    13500000
                                       MEDIA VOLUME (TAPE OR OPTICAL)   13550000
                                       BY A HUMAN OPERATOR. ONLY VALID  13600000
                                       IF BIT 1,2,3,4,5 OR 6 ON. @PAC*/ 13650000
         3 CBRSMF_PFX%%ST3FLGS8 BIT(1), /*                              13700001
                                       WHEN ON, THE OSREQ RETRIEVE      13710001
                                       REQUEST RESULTED IN THE MOUNTING 13750000
                                       OF A LIBRARY-RESIDENT REMOVABLE  13800000
                                       MEDIA VOLUME (TAPE OR OPTICAL)   13850000
                                       BY A HUMAN OPERATOR. ONLY VALID  13900000
                                       IF BIT 1,2,3,4,5 OR 6 ON. @PAC*/ 13950000
         3 CBRSMF_PFX%%ST3FLGS9 BIT(1), /*                              14000001
                                       WHEN ON, THE OSREQ RETRIEVE      14010001
                                       REQUEST WAS SATISFIED USING      14050000
                                       AN ALREADY MOUNTED REMOVEABLE    14100000
                                       MEDIA VOLUME (TAPE OR OPTICAL).  14150000
                                       ONLY VALID                       14200000
                                       IF BIT 1,2,3,4,5 OR 6 ON. @PAC*/ 14230500
         3 CBRSMF_PFX%%ST3FLGS10 BIT(1), /*                             14261101
                                    WHEN ON, THE SECOND BACKUP COPY OF  14261201
                                    THE OBJECT WAS RETRIEVED     @L4C*/ 14272200
         3 CBRSMF_PFX%%ST3FLGS11 BIT(1), /*                             14283301
                                       WHEN ON, A RECALL WAS SCHEDULED  14283401
                                       FOR THIS OBJECT.          @L4A*/ 14294400
         3 CBRSMF_PFX%%ST3FLGS12 BIT(1), /*                             14305501
                                       WHEN ON, A RECALL WAS EXPLICITLY 14305601
                                       SPECIFIED ON THE OSREQ RETRIEVE  14316600
                                       REQUEST.                  @L4A*/ 14327700
         3 CBRSMF_PFX%%ST3FLGS13 BIT(1), /*                             14332101
                                       WHEN ON, THE PRIMARY COPY OF     14332201
                                       THE OBJECT WAS RETRIEVED FROM    14336500
                                       A LOB STORAGE STRUCTURE.  @L5A*/ 14340900
         3 CBRSMF_PFX%%ST3FLGS14 BIT(1), /*                             14342401
                                       WHEN ON, OBJECT RETR. FROM       14342501
                                       SUBLEVEL 1 VOLUME         @L6A*/ 14343900
         3 CBRSMF_PFX%%ST3FLGS15 BIT(1), /*                             14345401
                                       WHEN ON, OBJECT RETR. FROM       14345501
                                       SUBLEVEL 2 VOLUME         @L6A*/ 14346900
         3 CBRSMF_PFX%%ST3FLGS16 BIT(1), /*                             14347901
                                       Reserved                  @PCA*/ 14348001
         3 CBRSMF_PFX%%ST3FLGS17 BIT(1), /*                             14348002
                                       Retrieved to 64-bit              14348003
                                       buffer                    @LFA*/ 14348004
         3 CBRSMF_PFX%%ST3FLGS18 BIT(1), /*                             14348005
                                       WHEN ON, PRIMARY COPY OF         14348006
                                       OBJECT RETRIEVED FROM CLD @LFA*/ 14348007
         3 CBRSMF_PFX%%ST3FLGS19 BIT(1), /*                             14348008
                                       WHEN ON, FIRST OR SECOND BACKUP  14348009
                                       COPY OF OBJECT RETRIEVED FROM    14348010
                                       CLOUD DUE TO VIEW=BACKUP OR      14348011
                                       VIEW=BACKUP2              @LGA*/ 14348012
         3 CBRSMF_PFX%%ST3FLGS20 BIT(1), /*                             14348013
                                       WHEN ON, FIRST OR SECOND BACKUP  14348014
                                       COPY OF OBJECT RETRIEVED FROM    14348015
                                       FILE SYSTEM DUE TO VIEW=BACKUP   14348016
                                       OR VIEW=BACKUP2           @LGA*/ 14348017
         3 CBRSMF_PFX%%ST3FLGS21 BIT(1), /*                             14348018
                                       WHEN ON, FIRST OR SECOND BACKUP  14348019
                                       COPY OF OBJECT RETRIEVED FROM    14348020
                                       CLOUD DUE TO AUTOMATIC ACCESS    14348021
                                       TO BACKUP                 @LGA*/ 14348022
         3 CBRSMF_PFX%%ST3FLGS22 BIT(1), /*                             14348023
                                       WHEN ON, FIRST OR SECOND BACKUP  14348024
                                       COPY OF OBJECT RETRIEVED FROM    14348025
                                       FILE SYSTEM DUE TO AUTOMATIC     14348026
                                       ACCESS TO BACKUP          @LGA*/ 14348027
         3 *        BIT(9);         /* RESERVED.                 @LGC*/ 14348900
    DECLARE                         /*                               */ 14350000
      1 CBRSMF_PFX%%ST4FLGS BIT(32) CBRSMF_DEF, /*                      14361501
                                       SUBTYPE 4 (OSREQ QUERY)          14361601
                                       FLAGS.                    @L7C*/ 14373000
         3 CBRSMF_PFX%%ST4FLG0 BIT(1), /* WHEN ON, the QUERY BACKUP     14384501
                                       OPTION has been disabled by      14396000
                                       specifying QB=N in the IEFSSNxx  14407500
                                       PARMLIB member.                  14419000
                                       WHEN OFF, the QUERY BACKUP       14430500
                                       OPTION is enabled, either by     14442000
                                       default or by specifying QB=Y    14453500
                                       in the IEFSSNxx PARMLIB          14465000
                                       member.                   @L7A*/ 14476500
         3 *       BIT(31);         /* RESERVED                  @L7A*/ 14488000
    DECLARE                         /*                               */ 14500000
      1 CBRSMF_PFX%%ST5FLGS BIT(32) CBRSMF_DEF, /*                      14550001
                                       SUBTYPE 5 (OSREQ CHANGE)         14560001
                                       FLAGS.                        */ 14600000
         3 CBRSMF_PFX%%ST5FLG0 BIT(1), /* WHEN ON, MANAGEMENT CLASS     14650001
                                       SPECIFIED ON OSREQ CHANGE.    */ 14700000
         3 CBRSMF_PFX%%ST5FLG1 BIT(1), /* WHEN ON, STORAGE CLASS        14750001
                                       SPECIFIED ON OSREQ CHANGE.    */ 14800000
         3 CBRSMF_PFX%%ST5FLG2 BIT(1), /* WHEN ON, RETENTION PERIOD     14850001
                                       SPECIFIED ON OSREQ CHANGE.    */ 14900000
         3 CBRSMF_PFX%%ST5FLG3 BIT(1), /* RETPD=-1               @L8A*/ 14912501
         3 CBRSMF_PFX%%ST5FLG4 BIT(1), /* RETPD=-2               @L8A*/ 14925001
         3 CBRSMF_PFX%%ST5FLG5 BIT(1), /* RETPD=X'7FFFFFFF'      @L8A*/ 14937501
         3 CBRSMF_PFX%%ST5FLG6 BIT(1), /* EVENTEXP supplied      @L8A*/ 14950001
         3 CBRSMF_PFX%%ST5FLG7 BIT(1), /* DELHOLD=HOLD           @L8A*/ 14962501
         3 CBRSMF_PFX%%ST5FLG8 BIT(1), /* DELHOLD=NOHOLD         @L8A*/ 14975001
         3 *        BIT(23);        /* RESERVED.                 @L8C*/ 14987500
    DECLARE                         /*                               */ 15000000
      1 CBRSMF_PFX%%ST6FLGS BIT(32) CBRSMF_DEF, /*                      15050001
                                       SUBTYPE 5 (OSREQ DELETE)         15060001
                                       FLAGS.                        */ 15100000
         3 CBRSMF_PFX%%ST6FLG0 BIT(1), /*                               15150001
                                       WHEN ON, PRIMARY COPY OF OBJECT  15160001
                                       DELETED FROM DISK.        @L9C*/ 15200000
         3 CBRSMF_PFX%%ST6FLG1 BIT(1), /*                               15250001
                                       WHEN ON, PRIMARY COPY OF OBJECT  15260001
                                       DELETED FROM OPTICAL.         */ 15300000
         3 CBRSMF_PFX%%ST6FLG2 BIT(1), /*                               15350001
                                       WHEN ON, PRIMARY COPY OF OBJECT  15360001
                                       DELETED FROM TAPE.            */ 15400000
         3 CBRSMF_PFX%%ST6FLG3 BIT(1), /*                               15450001
                                       WHEN ON, BACKUP COPY OF OBJECT   15460001
                                       DELETED FROM OPTICAL.         */ 15500000
         3 CBRSMF_PFX%%ST6FLG4 BIT(1), /*                               15550001
                                       WHEN ON, BACKUP COPY OF OBJECT   15560001
                                       DELETED FROM TAPE.            */ 15600000
         3 CBRSMF_PFX%%ST6FLG5 BIT(1), /*                               15616601
                                       WHEN ON, 2ND BACKUP COPY OF      15616701
                                       OBJECT DELETED FROM OPT.  @L2A*/ 15633200
         3 CBRSMF_PFX%%ST6FLG6 BIT(1), /*                               15649801
                                       WHEN ON, 2ND BACKUP COPY OF      15649901
                                       OBJECT DELETED FROM TAPE. @L2A*/ 15666400
         3 CBRSMF_PFX%%ST6FLG7 BIT(1), /*                               15673101
                                       WHEN ON, THE PRIMARY COPY OF     15673201
                                       THE OBJECT WAS DELETED FROM      15679800
                                       A LOB STORAGE STRUCTURE.  @L5A*/ 15686500
         3 CBRSMF_PFX%%ST6FLG8 BIT(1), /*                               15688701
                                       WHEN ON, OBJECT DELETED FROM     15688801
                                       SUBLEVEL 1 VOLUME         @L7C*/ 15690900
         3 CBRSMF_PFX%%ST6FLG9 BIT(1), /*                               15693101
                                       WHEN ON, OBJECT DELETED FROM     15693201
                                       SUBLEVEL 2 VOLUME         @L7C*/ 15695300
         3 CBRSMF_PFX%%ST6FLG10 BIT(1), /* Reserved              @PCA*/ 15696800
         3 CBRSMF_PFX%%ST6FLG11 BIT(1), /*                              15696801
                                       WHEN ON, PRIMARY COPY OF         15696802
                                       OBJECT DELETED FROM CLD   @LFA*/ 15696803
         3 CBRSMF_PFX%%ST6FLG12 BIT(1), /*                              15696804
                                       WHEN ON, FIRST BACKUP COPY       15696805
                                       OF OBJECT DELETED FROM           15696806
                                       CLOUD                     @LGA*/ 15696807
         3 CBRSMF_PFX%%ST6FLG13 BIT(1), /*                              15696808
                                       WHEN ON, FIRST BACKUP COPY       15696809
                                       OF OBJECT DELETED FROM           15696810
                                       FILE SYSTEM               @LGA*/ 15696811
         3 CBRSMF_PFX%%ST6FLG14 BIT(1), /*                              15696812
                                       WHEN ON, SECOND BACKUP COPY      15696813
                                       OF OBJECT DELETED FROM           15696814
                                       CLOUD                     @LGA*/ 15696815
         3 CBRSMF_PFX%%ST6FLG15 BIT(1), /*                              15696816
                                       WHEN ON, SECOND BACKUP COPY      15696817
                                       OF OBJECT DELETED FROM           15696818
                                       FILE SYSTEM               @LGA*/ 15696819
         3 *        BIT(1),         /* RESERVED.                 @LGA*/ 15696820
         3 *        BIT(15);        /* RESERVED.                 @LGC*/ 15698300
    DECLARE                         /*                               */ 15700000
        CBRSMF_PFX%%ST7FLGS BIT(32) CBRSMF_DEF; /*                      15750001
                                       SUBTYPE 7 (OSREQ UNACCESS)       15760001
                                       FLAGS.  ALL BITS RESERVED.    */ 15800000
    DECLARE                         /*                               */ 15801600
        CBRSMF_PFX%%ST8FLGS BIT(32) CBRSMF_DEF; /*                      15803201
                                       SUBTYPE 8 (OSREQ STOREBEG)       15803301
                                       FLAGS.  ALL BITS RESERVED.@L7A*/ 15804800
    DECLARE                         /*                               */ 15806400
        CBRSMF_PFX%%ST9FLGS BIT(32) CBRSMF_DEF; /*                      15808001
                                       SUBTYPE 9 (OSREQ STOREPRT)       15809001
                                       FLAGS.  ALL BITS RESERVED.@L7A*/ 15809600
    DECLARE                         /*                               */ 15811200
      1 CBRSMF_PFX%%ST10FLGS BIT(32) CBRSMF_DEF, /* SUBTYPE 10          15812801
                                       (OSREQ STOREEND) FLAGS.   @L7A*/ 15814400
        3 CBRSMF_PFX%%ST10FLGS0 BIT(1), /* When ON, the object is stored15816001
                                       to DISK                   @L9C*/ 15817600
        3 CBRSMF_PFX%%ST10FLGS1 BIT(1), /* RESERVED              @L7A*/ 15819201
        3 CBRSMF_PFX%%ST10FLGS2 BIT(1), /* Object store to Tape  @L8C*/ 15820801
        3 CBRSMF_PFX%%ST10FLGS3 BIT(1), /* Object store to Cloud @LFC*/ 15822401
        3 CBRSMF_PFX%%ST10FLGS4 BIT(1), /* RESERVED              @L7A*/ 15824001
        3 CBRSMF_PFX%%ST10FLGS5 BIT(1), /* Volume on shelf       @L8C*/ 15825601
        3 CBRSMF_PFX%%ST10FLGS6 BIT(1), /* Volume in library     @L8C*/ 15827201
        3 CBRSMF_PFX%%ST10FLGS7 BIT(1), /* Volume on drive       @L8C*/ 15828801
        3 CBRSMF_PFX%%ST10FLGS8 BIT(1), /* Immediate backup copy @L8C*/ 15830401
        3 CBRSMF_PFX%%ST10FLGS9 BIT(1), /* When ON, the object is stored15832001
                                       to LOB Storage Structure  @L7A*/ 15833600
        3 CBRSMF_PFX%%ST10FLGS10 BIT(1), /* Obj. store to sublvl1 @L8C*/15835201
        3 CBRSMF_PFX%%ST10FLGS11 BIT(1), /* Obj. store to sublvl2 @L8C*/15836801
        3 CBRSMF_PFX%%ST10FLGS12 BIT(1), /*                             15838401
                                       When ON, the CANCEL=YES keyword  15838501
                                       was specified indicating the     15840000
                                       store sequence was               15841600
                                       successfully cancelled.   @L7A*/ 15843200
        3 CBRSMF_PFX%%ST10FLGS13 BIT(1), /* DELHOLD=HOLD         @L8A*/ 15843701
        3 CBRSMF_PFX%%ST10FLGS14 BIT(1), /* Retention-protected  @L8A*/ 15844201
        3 CBRSMF_PFX%%ST10FLGS15 BIT(1), /* Deletion-protected   @L8A*/ 15844701
        3 CBRSMF_PFX%%ST10FLGS16 BIT(1), /* Event-based-retention @L8A*/15845201
        3 CBRSMF_PFX%%ST10FLGS17 BIT(1), /* Reserved             @PCA*/ 15845601
        3 *          BIT(14);       /* RESERVED                  @LCC*/ 15846000
                                                                        15846400
    DECLARE                         /*                               */ 15850000
      CBRSMF_PF2%%ST1L                                                  15900001
              FIXED(31) CONSTANT(LENGTH(SMF85HDR)+LENGTH(SMF85PIS)+     15910001
                                 LENGTH(CBRSMF_PFX%%ST1)),              15950001
      CBRSMF_PF2%%ST2L                                                  16000001
              FIXED(31) CONSTANT(LENGTH(SMF85HDR)+LENGTH(SMF85PIS)+     16010001
                                 LENGTH(CBRSMF_PFX%%ST1)),              16050001
      CBRSMF_PF2%%ST3L                                                  16100001
              FIXED(31) CONSTANT(LENGTH(SMF85HDR)+LENGTH(SMF85PIS)+     16110001
                                 LENGTH(CBRSMF_PFX%%ST1)),              16150001
      CBRSMF_PF2%%ST4L                                                  16200001
              FIXED(31) CONSTANT(LENGTH(SMF85HDR)+LENGTH(SMF85PIS)+     16210001
                                 LENGTH(CBRSMF_PFX%%ST1)),              16250001
      CBRSMF_PF2%%ST5L                                                  16300001
              FIXED(31) CONSTANT(LENGTH(SMF85HDR)+LENGTH(SMF85PIS)+     16310001
                                 LENGTH(CBRSMF_PFX%%ST1)),              16350001
      CBRSMF_PF2%%ST6L                                                  16400001
              FIXED(31) CONSTANT(LENGTH(SMF85HDR)+LENGTH(SMF85PIS)+     16410001
                                 LENGTH(CBRSMF_PFX%%ST1)),              16450001
      CBRSMF_PF2%%ST7L                                                  16500001
              FIXED(31) CONSTANT(LENGTH(SMF85HDR)+LENGTH(SMF85PIS)+     16510001
                                 LENGTH(CBRSMF_PFX%%ST1)),    /* @L7C*/ 16512501
      CBRSMF_PF2%%ST8L                                                  16525001
              FIXED(31) CONSTANT(LENGTH(SMF85HDR)+LENGTH(SMF85PIS)+     16526001
                                 LENGTH(CBRSMF_PFX%%ST1)),    /* @L7A*/ 16537501
      CBRSMF_PF2%%ST9L                                                  16550001
              FIXED(31) CONSTANT(LENGTH(SMF85HDR)+LENGTH(SMF85PIS)+     16560001
                                 LENGTH(CBRSMF_PFX%%ST1)),    /* @L7A*/ 16562501
      CBRSMF_PF2%%ST10L                                                 16575001
               FIXED(31) CONSTANT(LENGTH(SMF85HDR)+LENGTH(SMF85PIS)+    16576001
                                 LENGTH(CBRSMF_PFX%%ST1));    /* @L7A*/ 16587501
   %END;                                                                16600000
 %IF IBM_CBGENC = 'YES' !                                     /* @PDC*/ 16610000
     SMF85S32 ^= '' !                                                   16650000
     SMF85S33 ^= '' !                                                   16700000
     SMF85S34 ^= '' !                                                   16750000
     SMF85S35 ^= '' %THEN                                               16800000
   %DO;                                                                 16850000
 @EJECT;                            /*                               */ 16900000
 /********************************************************************/ 16950000
 /*                                                                  */ 17000000
 /* OAM SUBTYPE SECTION, FOR SUBTYPES 32 - 35                        */ 17050000
 /*                                                                  */ 17100000
 /* SUBTYPE FUNCTION                                                 */ 17150000
 /* ------- ---------------------------------------------------      */ 17200000
 /*      32 OSMC STORAGE GROUP PROCESSING                            */ 17250000
 /*      33 OSMC DASD SPACE MANAGEMENT PROCESSING                    */ 17300000
 /*      34 OSMC OPTICAL DISK RECOVERY UTILITY                       */ 17350000
 /*      35 OSMC MOVE VOLUME (MOVEVOL) UTILITY                       */ 17400000
 /*                                                                  */ 17450000
 /********************************************************************/ 17500000
 %CBRSMF_DEF = 'DEFINED(R85PEND)';                            /* @PDA*/ 17510001
 %IF IBM_CBGENC = 'YES' %THEN %CBRSMF_DEF = 'BASED';          /* @PDA*/ 17520001
 DECLARE                            /*                               */ 17550000
     1 CBRSMF_PFX%%ST32 CBRSMF_DEF, /* SUBTYPES 32 - 35              */ 17600001
       3 CBRSMF_PFX%%ST32SGN CHAR(8), /* STORAGE GROUP NAME          */ 17650001
       3 CBRSMF_PFX%%ST32VSN0 CHAR(6), /* VOLUME SERIAL NUMBER OF A TAPE17691601
                                       OR OPTICAL VOLUME.  ONLY VALID   17733200
                                       FOR SUBTYPES 34 AND 35. THIS     17774800
                                       FIELD CONTAINS BLANKS FOR ALL    17816400
                                       OTHER SUBTYPES.           @P8C*/ 17858000
       3 CBRSMF_PFX%%ST32VSN1 CHAR(6), /*                               17900001
                                       VOLUME SERIAL NUMBER OF OPPOSITE 17910001
                                       SIDE OF AN OPTICAL VOLUME.       17925000
                                       ONLY VALID FOR SUBTYPES 34 & 35. 17950000
                                       IF THE VOLUME SERIAL NUMBER      17975000
                                       CONTAINED IN FIELD ST32VSN0 IS   18000000
                                       THE VOLUME SERIAL NUMBER OF A    18025000
                                       TAPE VOLUME, THIS FIELD WILL BE  18050000
                                       'N/A'.  THIS FIELD CONTAINS      18075000
                                       BLANKS FOR ALL OTHER             18100000
                                       SUBYTPES                  @P8C*/ 18125000
       3 CBRSMF_PFX%%ST32OMT CHAR(2), /* OPTICAL MEDIA TYPE. ONLY VALID 18150001
                                       FOR SUBTYPES 34 AND 35, CONTAINS 18200000
                                       BLANKS FOR OTHER SUBTYPES.    */ 18250000
       3 *        CHAR(2),          /* RESERVED                      */ 18300000
       /* COUNTS OF PRIMARY OBJECTS (AND KILOBYTES) WRITTEN, READ AND   18350000
          DELETED FROM DISK SUBLEVEL 1 (DSL1).                   @LAC*/ 18400000
       3 CBRSMF_PFX%%ST32PDWO FIXED(32), /* NUMBER OF PRIMARY OBJECTS   18450001
                                       WRITTEN TO DSL1.          @LAC*/ 18500000
       3 CBRSMF_PFX%%ST32PDWK FIXED(32), /* NUMBER OF KILOBYTES PRIMARY 18550001
                                       OBJECTS WRITTEN TO DSL1.         18575000
                                       SUPERSEDED BY ST32PDWB.          18600000
                                       SEE NOTE 1.               @LAC*/ 18625000
       3 CBRSMF_PFX%%ST32PDRO FIXED(32), /* NUMBER OF PRIMARY OBJECTS   18650001
                                       READ FROM DSL1.           @LAC*/ 18700000
       3 CBRSMF_PFX%%ST32PDRK FIXED(32), /* NUMBER OF KILOBYTES PRIMARY 18750001
                                       OBJECTS READ FROM DSL1.          18775000
                                       SUPERSEDED BY ST32PDRB.          18800000
                                       SEE NOTE 1.               @LAC*/ 18825000
       3 CBRSMF_PFX%%ST32PDDO FIXED(32), /* NUMBER OF PRIMARY OBJECTS   18850001
                                       DELETED FROM DSL1.        @LAC*/ 18900000
       3 CBRSMF_PFX%%ST32PDDK FIXED(32), /*                             18950001
                                       NUMBER OF KILOBYTES OF PRIMARY   18960001
                                       OBJECTS DELETED FROM DSL1.       18975000
                                       SUPERSEDED BY ST32PDDB.          19000000
                                       SEE NOTE 1.               @LAC*/ 19025000
       /* COUNTS OF PRIMARY OBJECTS (AND KILOBYTES) WRITTEN, READ AND   19050000
          DELETED FROM OPTICAL. */                                      19100000
       3 CBRSMF_PFX%%ST32POWO FIXED(32), /* NUMBER OF PRIMARY OBJECTS   19150001
                                       WRITTEN TO OPTICAL.           */ 19200000
       3 CBRSMF_PFX%%ST32POWK FIXED(32), /*                             19250001
                                       NUMBER OF KILOBYTES OF PRIMARY   19260001
                                       OBJECTS WRITTEN TO OPTICAL.      19275000
                                       SUPERSEDED BY ST32POWB.          19300000
                                       SEE NOTE 1.               @LAC*/ 19325000
       3 CBRSMF_PFX%%ST32PORO FIXED(32), /* NUMBER OF PRIMARY OBJECTS   19350001
                                       READ FROM OPTICAL.            */ 19400000
       3 CBRSMF_PFX%%ST32PORK FIXED(32), /*                             19450001
                                       NUMBER OF KILOBYTES OF PRIMARY   19460001
                                       OBJECTS READ FROM OPTICAL.       19475000
                                       SUPERSEDED BY ST32PORB.          19500000
                                       SEE NOTE 1.               @LAC*/ 19525000
       3 CBRSMF_PFX%%ST32PODO FIXED(32), /* NUMBER OF PRIMARY OBJECTS   19550001
                                       DELETED FROM OPTICAL.         */ 19600000
       3 CBRSMF_PFX%%ST32PODK FIXED(32), /*                             19650001
                                       NUMBER OF KILOBYTES OF PRIMARY   19660001
                                       OBJECTS DELETED FROM OPTICAL.    19675000
                                       SUPERSEDED BY ST32PODB.          19700000
                                       SEE NOTE 1.               @LAC*/ 19725000
       /* COUNTS OF PRIMARY OBJECTS (AND KILOBYTES) WRITTEN, READ AND   19750000
          DELETED FROM TAPE. */                                         19800000
       3 CBRSMF_PFX%%ST32PTWO FIXED(32), /* NUMBER OF PRIMARY OBJECTS   19850001
                                       WRITTEN TO TAPE.              */ 19900000
       3 CBRSMF_PFX%%ST32PTWK FIXED(32), /*                             19950001
                                       NUMBER OF KILOBYTES OF PRIMARY   19960001
                                       OBJECTS WRITTEN TO TAPE.         19975000
                                       SUPERSEDED BY ST32PTWB.          20000000
                                       SEE NOTE 1.               @LAC*/ 20025000
       3 CBRSMF_PFX%%ST32PTRO FIXED(32), /* NUMBER OF PRIMARY OBJECTS   20050001
                                       READ FROM TAPE.               */ 20100000
       3 CBRSMF_PFX%%ST32PTRK FIXED(32), /*                             20150001
                                       NUMBER OF KILOBYTES OF PRIMARY   20160001
                                       OBJECTS READ FROM TAPE.          20175000
                                       SUPERSEDED BY ST32PTRB.          20200000
                                       SEE NOTE 1.               @LAC*/ 20225000
       3 CBRSMF_PFX%%ST32PTDO FIXED(32), /* NUMBER OF PRIMARY OBJECTS   20250001
                                       LOGICALLY DELETED FROM TAPE.  */ 20300000
       3 CBRSMF_PFX%%ST32PTDK FIXED(32), /*                             20350001
                                       NUMBER OF KILOBYTES OF PRIMARY   20360001
                                       OBJECTS LOGICALLY DELETED FROM   20400000
                                       TAPE. SUPERSEDED BY ST32PTDB.    20433300
                                       SEE NOTE 1.               @LAC*/ 20466600
       /* COUNTS OF BACKUP OBJECTS (AND KILOBYTES) WRITTEN, READ AND    20500000
          DELETED FROM OPTICAL. */                                      20550000
       3 CBRSMF_PFX%%ST32BOWO FIXED(32), /* NUMBER OF BACKUP OBJECTS    20600001
                                       WRITTEN TO OPTICAL.           */ 20650000
       3 CBRSMF_PFX%%ST32BOWK FIXED(32), /*                             20700001
                                       NUMBER OF KILOBYTES OF BACKUP    20710001
                                       OBJECTS WRITTEN TO OPTICAL.      20725000
                                       SUPERSEDED BY ST32BOWB.          20750000
                                       SEE NOTE 1.               @LAC*/ 20775000
       3 CBRSMF_PFX%%ST32BORO FIXED(32), /* NUMBER OF BACKUP OBJECTS    20800001
                                       READ FROM OPTICAL.            */ 20850000
       3 CBRSMF_PFX%%ST32BORK FIXED(32), /*                             20900001
                                       NUMBER OF KILOBYTES OF BACKUP    20910001
                                       OBJECTS READ FROM OPTICAL.       20925000
                                       SUPERSEDED BY ST32BORB.          20950000
                                       SEE NOTE 1.               @LAC*/ 20975000
       3 CBRSMF_PFX%%ST32BODO FIXED(32), /* NUMBER OF BACKUP OBJECTS    21000001
                                       DELETED FROM OPTICAL.         */ 21050000
       3 CBRSMF_PFX%%ST32BODK FIXED(32), /*                             21100001
                                       NUMBER OF KILOBYTES OF BACKUP    21110001
                                       OBJECTS DELETED FROM OPTICAL.    21125000
                                       SUPERSEDED BY ST32BODB.          21150000
                                       SEE NOTE 1.               @LAC*/ 21175000
       /* COUNTS OF BACKUP OBJECTS (AND KILOBYTES) WRITTEN, READ AND    21200000
          DELETED FROM TAPE. */                                         21250000
       3 CBRSMF_PFX%%ST32BTWO FIXED(32), /* NUMBER OF BACKUP OBJECTS    21300001
                                       WRITTEN TO TAPE.              */ 21350000
       3 CBRSMF_PFX%%ST32BTWK FIXED(32), /*                             21400001
                                       NUMBER OF KILOBYTES OF BACKUP    21410001
                                       OBJECTS WRITTEN TO TAPE.         21425000
                                       SUPERSEDED BY ST32BTWB.          21450000
                                       SEE NOTE 1.               @LAC*/ 21475000
       3 CBRSMF_PFX%%ST32BTRO FIXED(32), /* NUMBER OF BACKUP OBJECTS    21500001
                                       READ FROM TAPE.               */ 21550000
       3 CBRSMF_PFX%%ST32BTRK FIXED(32), /*                             21600001
                                       NUMBER OF KILOBYTES OF BACKUP    21610001
                                       OBJECTS READ FROM TAPE.          21625000
                                       SUPERSEDED BY ST32BTRB.          21650000
                                       SEE NOTE 1.               @LAC*/ 21675000
       3 CBRSMF_PFX%%ST32BTDO FIXED(32), /* NUMBER OF BACKUP OBJECTS    21700001
                                       LOGICALLY DELETED FROM TAPE.  */ 21750000
       3 CBRSMF_PFX%%ST32BTDK FIXED(32), /*                             21800001
                                       NUMBER OF KILOBYTES OF BACKUP    21810001
                                       OBJECTS LOGICALLY DELETED FROM   21850000
                                       TAPE. SUPERSEDED BY ST32BTDB.    21867200
                                       SEE NOTE 1.               @LAC*/ 21884400
       /* COUNTS OF BACKUP2 OBJECTS (AND KILOBYTES) WRITTEN, READ AND   21901600
          DELETED FROM OPTICAL.                                  @L2A*/ 21903200
       3 CBRSMF_PFX%%ST32B2OWO FIXED(32), /* NUMBER OF BACKUP2 OBJECTS  21904801
                                       WRITTEN TO OPTICAL.       @L2A*/ 21906400
       3 CBRSMF_PFX%%ST32B2OWK FIXED(32), /*                            21908001
                                       NUMBER OF KILOBYTES OF BACKUP2   21908101
                                       OBJS WRITTEN TO OPTICAL.         21908800
                                       SUPERSEDED BY ST32B2OWB.         21909600
                                       SEE NOTE 1.               @LAC*/ 21910400
       3 CBRSMF_PFX%%ST32B2ORO FIXED(32), /* NUMBER OF BACKUP2 OBJECTS  21911201
                                       READ FROM OPTICAL.        @L2A*/ 21912800
       3 CBRSMF_PFX%%ST32B2ORK FIXED(32), /*                            21914401
                                       NUMBER OF KILOBYTES OF BACKUP2   21914501
                                       OBJS READ FROM OPTICAL.          21915200
                                       SUPERSEDED BY ST32B2ORB.         21916000
                                       SEE NOTE 1.               @LAC*/ 21916800
       3 CBRSMF_PFX%%ST32B2ODO FIXED(32), /* NUMBER OF BACKUP2 OBJECTS  21917601
                                       DELETED FROM OPTICAL.     @L2A*/ 21919200
       3 CBRSMF_PFX%%ST32B2ODK FIXED(32), /*                            21920801
                                       NUMBER OF KILOBYTES OF BACKUP2   21920901
                                       OBJS DELETED FROM OPTICAL.       21921600
                                       SUPERSEDED BY ST32B2ODB.         21922400
                                       SEE NOTE 1.               @LAC*/ 21923200
       /* COUNTS OF BACKUP2 OBJECTS (AND KILOBYTES) WRITTEN, READ AND   21924000
          DELETED FROM TAPE.                                     @L2A*/ 21925600
       3 CBRSMF_PFX%%ST32B2TWO FIXED(32), /* NUMBER OF BACKUP2 OBJECTS  21927201
                                       WRITTEN TO TAPE.          @L2A*/ 21928800
       3 CBRSMF_PFX%%ST32B2TWK FIXED(32), /*                            21930401
                                       NUMBER OF KILOBYTES OF BACKUP2   21930501
                                       OBJECTS WRITTEN TO TAPE.         21931200
                                       SUPERSEDED BY ST32B2TWB.         21932000
                                       SEE NOTE 1.               @LAC*/ 21932800
       3 CBRSMF_PFX%%ST32B2TRO FIXED(32), /* NUMBER OF BACKUP2 OBJECTS  21933601
                                       READ FROM TAPE.           @L2A*/ 21935200
       3 CBRSMF_PFX%%ST32B2TRK FIXED(32), /*                            21936801
                                       NUMBER OF KILOBYTES OF BACKUP2   21936901
                                       OBJECTS READ FROM TAPE.          21937600
                                       SUPERSEDED BY ST32B2TRB.         21938400
                                       SEE NOTE 1.               @LAC*/ 21939200
       3 CBRSMF_PFX%%ST32B2TDO FIXED(32), /* NUMBER OF BACKUP2 OBJECTS  21940001
                                       LOGICALLY DELETED FROM TAPE      21941600
                                                                 @L2A*/ 21943200
       3 CBRSMF_PFX%%ST32B2TDK FIXED(32), /*                            21944801
                                       NUMBER OF KILOBYTES OF BACKUP2   21944901
                                       OBJECTS LOGICALLY DELETED FROM   21946400
                                       TAPE. SUPERSEDED BY ST32B2TDB.   21947600
                                       SEE NOTE 1.               @LAC*/ 21948800
       /* COUNTS OF ACTIVITY AGAINST THE OBJECT STORAGE DATABASE        21950000
          (OBJECT DIRECTORY TABLE, 4K OBJECT STORAGE TABLE AND 32K      22000000
          OBJECT STORAGE TABLE).                                    */  22050000
       3 CBRSMF_PFX%%ST32DTUP FIXED(32), /*                             22100001
                                       NUMBER OF ROWS UPDATED IN THE    22110001
                                       OBJECT DIRECTORY TABLE.       */ 22150000
       3 CBRSMF_PFX%%ST32DTDE FIXED(32), /*                             22200001
                                       NUMBER OF ROWS DELETED FROM THE  22210001
                                       OBJECT DIRECTORY TABLE.       */ 22250000
       3 CBRSMF_PFX%%ST324KIN FIXED(32), /*                             22300001
                                       NUMBER OF ROWS INSERTED INTO THE 22310001
                                       4K OBJECT STORAGE TABLE.      */ 22350000
       3 CBRSMF_PFX%%ST324KDE FIXED(32), /*                             22400001
                                       NUMBER OF ROWS DELETED FROM THE  22410001
                                       4K OBJECT STORAGE TABLE.      */ 22450000
       3 CBRSMF_PFX%%ST3232KI FIXED(32), /*                             22500001
                                       NUMBER OF ROWS INSERTED INTO THE 22510001
                                       32K OBJECT STORAGE TABLE.      */22550000
       3 CBRSMF_PFX%%ST3232KD FIXED(32), /*                             22600001
                                       NUMBER OF ROWS DELETED FROM THE  22610001
                                       32K OBJECT STORAGE TABLE.      */22650000
       3 CBRSMF_PFX%%ST32NCE FIXED(32), /* NUMBER OF OPTICAL CARTRIDGES 22653301
                                       EXPIRED.  VALID ONLY FOR         22656600
                                       SUBTYPE 32.                   */ 22659900
       3 CBRSMF_PFX%%ST32FLGS BIT(32), /* PROCESSING FLAGS           */ 22663201
         5 CBRSMF_PFX%%ST32FLG0 BIT(1), /* WHEN ON, THIS PROCESS WAS    22666501
                                       INVOKED AUTOMATICALLY UNDER      22669800
                                       SOFTWARE CONTROL.             */ 22673100
         5 CBRSMF_PFX%%ST32FLG1 BIT(1), /* WHEN ON, THIS PROCESS WAS    22676401
                                       INVOKED BY A MODIFY OAM,START    22679700
                                       COMMAND.                      */ 22683000
         5 CBRSMF_PFX%%ST32FLG2 BIT(1), /* WHEN ON, THIS PROCESS WAS    22686301
                                       INVOKED USING AN ISMF LINE       22689600
                                       OPERATOR.                     */ 22692900
         5 CBRSMF_PFX%%ST32FLG3 BIT(1), /* WHEN ON, VOL RECOVERY WAS    22693901
                                       INVOKED W/ BACKUP1 KEYWD         22694900
                                       OR DEFAULTED TO BACKUP1   @L2A*/ 22695900
         5 CBRSMF_PFX%%ST32FLG4 BIT(1), /* WHEN ON, VOL RECOVERY WAS    22696901
                                       INVOKED W/ BACKUP2 KEYWD  @L2A*/ 22697900
         5 CBRSMF_PFX%%ST32FLG5 BIT(1), /*                              22698001
                                 WHEN ON,VOL RECOVERY OR MOVEVOL WAS    22698101
                                 SPECIFIED WITH DELETE OPTION    @L3A*/ 22698201
         5 CBRSMF_PFX%%ST32FLG6 BIT(1), /*                              22698301
                                 WHEN ON,VOL RECOVERY OR MOVEVOL WAS    22698401
                                 SPECIFIED WITH RECYCLEOPTION    @L3A*/ 22698501
         5 CBRSMF_PFX%%ST32FLG7 BIT(1), /* WHEN ON, INDICATED PROCESSING22698601
                                     OBJECT STORAGE GROUP        @L3A*/ 22698701
         5 CBRSMF_PFX%%ST32FLG8 BIT(1), /* WHEN ON, INDICATED PROCESSING22698801
                                     BACKUP OBJECT STORAGE GROUP @L3A*/ 22698901
         5 CBRSMF_PFX%%ST32FLG9 BIT(1), /*                              22699001
                                 WHEN ON, CYCLE ENDTIME EXCEEDED @L3A*/ 22699101
         5 CBRSMF_PFX%%ST32FL10 BIT(1), /* When on, automatic backup    22699401
                                       delete was enabled        @LBA*/ 22700000
         5 *        BIT(21),        /* RESERVED.                 @LBC*/ 22700600
       3 CBRSMF_PFX%%ST32NTE FIXED(32), /*                              22701401
                                       NUMBER OF TAPE VOLUMES EXPIRED   22701501
                                       VALID ONLY FOR SUBTYPE 32 @L3A*/ 22701800
       3 CBRSMF_PFX%%ST32RCLD FIXED(32), /* NUMBER OF RECALLED OBJECTS  22702201
                                       VALID ONLY FOR SUBTYPE 32 @P4A*/ 22702600
       3 CBRSMF_PFX%%ST32RCLK FIXED(32), /* NUMBER OF KILOBYTES OF      22703001
                                       RECALLED OBJECTS                 22703400
                                       VALID ONLY FOR SUBTYPE 32        22703600
                                       SUPERSEDED BY ST32RCLB.          22703800
                                       SEE NOTE 1.               @LAC*/ 22704000
       3 CBRSMF_PFX%%ST32LOBI FIXED(32), /* NUMBER OF LOB ROWS INSERTED 22704201
                                       VALID ONLY FOR SUBTYPE 32 @P4A*/ 22704600
       3 CBRSMF_PFX%%ST32LOBD FIXED(32), /* NUMBER OF LOB ROWS DELETED  22705001
                                       VALID ONLY FOR SUBTYPE 32 @P4A*/ 22705400
       /* COUNTS OF PRIMARY OBJECTS (AND KILOBYTES) WRITTEN, READ AND   22706400
          DELETED FROM TAPE SUBLEVEL 2 (TSL2).                   @L6A*/ 22708900
       3 CBRSMF_PFX%%ST32PUWO FIXED(32), /* NUMBER OF PRIMARY OBJECTS   22711401
                                       WRITTEN TO TSL2.          @L6A*/ 22713900
       3 CBRSMF_PFX%%ST32PUWK FIXED(32), /*                             22716401
                                       NUMBER OF KILOBYTES OF PRIMARY   22716501
                                       OBJECTS WRITTEN TO TSL2.         22717600
                                       SUPERSEDED BY ST32PUWB.          22718800
                                       SEE NOTE 1.               @LAC*/ 22720000
       3 CBRSMF_PFX%%ST32PURO FIXED(32), /* NUMBER OF PRIMARY OBJECTS   22721401
                                       READ FROM TSL2.           @L6A*/ 22723900
       3 CBRSMF_PFX%%ST32PURK FIXED(32), /*                             22726401
                                       NUMBER OF KILOBYTES OF PRIMARY   22726501
                                       OBJECTS READ FROM TSL2.          22727600
                                       SUPERSEDED BY ST32PURB.          22728800
                                       SEE NOTE 1.               @LAC*/ 22730000
       3 CBRSMF_PFX%%ST32PUDO FIXED(32), /* NUMBER OF PRIMARY OBJECTS   22731401
                                       LOGICALLY DELETED FROM TSL2      22733900
                                                                 @L6A*/ 22736400
       3 CBRSMF_PFX%%ST32PUDK FIXED(32), /*                             22738901
                                       NUMBER OF KILOBYTES OF PRIMARY   22739001
                                       OBJECTS LOGICALLY DELETED FROM   22741400
                                       TSL2. SUPERSEDED BY ST32PUDB.    22741500
                                       SEE NOTE 1.               @LAC*/ 22741600
       /* COUNTS OF PRIMARY OBJECTS WRITTEN, READ, AND DELETED          22741800
          FROM DISK SUBLEVEL 2 (DSL2).                           @LAA*/ 22742000
       3 CBRSMF_PFX%%ST32PEWO FIXED(32), /* NUMBER OF PRIMARY OBJECTS   22742201
                                WRITTEN TO DSL2.                 @LAA*/ 22742600
       3 CBRSMF_PFX%%ST32PERO FIXED(32), /* NUMBER OF PRIMARY OBJECTS   22743001
                                READ FROM DSL2.                  @LAA*/ 22743400
       3 CBRSMF_PFX%%ST32PEDO FIXED(32), /* NUMBER OF PRIMARY OBJECTS   22743801
                                LOGICALLY DELETED FROM DSL2.     @LAA*/ 22744400
       /* BYTE COUNTS OF PRIMARY OBJECTS WRITTEN, READ AND              22745000
          DELETED FROM DISK SUBLEVEL 1 (DSL1).                   @LAA*/ 22745600
       3 CBRSMF_PFX%%ST32PDWB FIXED(64), /* NUMBER OF BYTES OF PRIMARY  22746201
                                       OBJECTS WRITTEN TO DSL1.  @LAA*/ 22746800
       3 CBRSMF_PFX%%ST32PDRB FIXED(64), /* NUMBER OF BYTES OF PRIMARY  22747401
                                       OBJECTS READ FROM DSL1.   @LAA*/ 22748000
       3 CBRSMF_PFX%%ST32PDDB FIXED(64), /* NUMBER OF BYTES OF PRIMARY  22748601
                                       OBJECTS DELETED FROM DSL1.@LAA*/ 22749200
       /* BYTE COUNTS OF PRIMARY OBJECTS WRITTEN, READ AND              22749800
          DELETED FROM OPTICAL.                                  @LAA*/ 22750400
       3 CBRSMF_PFX%%ST32POWB FIXED(64), /* NUMBER OF BYTES OF PRIMARY  22751001
                                       OBJECTS WRITTEN TO               22751600
                                       OPTICAL.                  @LAA*/ 22752200
       3 CBRSMF_PFX%%ST32PORB FIXED(64), /* NUMBER OF BYTES OF PRIMARY  22752801
                                       OBJECTS READ FROM                22753400
                                       OPTICAL.                  @LAA*/ 22754000
       3 CBRSMF_PFX%%ST32PODB FIXED(64), /* NUMBER OF BYTES OF PRIMARY  22754601
                                       OBJECTS DELETED FROM             22755200
                                       OPTICAL.                  @LAA*/ 22755800
       /* BYTE COUNTS OF PRIMARY OBJECTS WRITTEN, READ AND              22756400
          DELETED FROM TAPE.                                         */ 22757000
       3 CBRSMF_PFX%%ST32PTWB FIXED(64), /* NUMBER OF BYTES OF PRIMARY  22757601
                                       OBJECTS WRITTEN TO TAPE.  @LAA*/ 22758200
       3 CBRSMF_PFX%%ST32PTRB FIXED(64), /* NUMBER OF BYTES OF PRIMARY  22758801
                                       OBJECTS READ FROM TAPE.   @LAA*/ 22759400
       3 CBRSMF_PFX%%ST32PTDB FIXED(64), /* NUMBER OF BYTES OF PRIMARY  22760001
                                       OBJECTS LOGICALLY DELETED        22760600
                                       FROM TAPE.                @LAA*/ 22761200
       /* BYTE COUNTS OF BACKUP OBJECTS WRITTEN, READ AND               22761800
          DELETED FROM OPTICAL.                                  @LAA*/ 22762400
       3 CBRSMF_PFX%%ST32BOWB FIXED(64), /* NUMBER OF BYTES OF BACKUP   22763001
                                       OBJECTS WRITTEN TO               22763600
                                       OPTICAL.                  @LAA*/ 22764200
       3 CBRSMF_PFX%%ST32BORB FIXED(64), /* NUMBER OF BYTES OF BACKUP   22764801
                                       OBJECTS READ FROM                22765400
                                       OPTICAL.                  @LAA*/ 22766000
       3 CBRSMF_PFX%%ST32BODB FIXED(64), /* NUMBER OF BYTES OF BACKUP   22766601
                                       OBJECTS DELETED FROM             22767200
                                       OPTICAL.                  @LAA*/ 22767800
       /* BYTE COUNTS OF BACKUP OBJECTS WRITTEN, READ AND               22768400
          DELETED FROM TAPE.                                     @LAA*/ 22769000
       3 CBRSMF_PFX%%ST32BTWB FIXED(64), /* NUMBER OF BYTES OF BACKUP   22769601
                                       OBJECTS WRITTEN TO TAPE.  @LAA*/ 22770200
       3 CBRSMF_PFX%%ST32BTRB FIXED(64), /* NUMBER OF BYTES OF BACKUP   22770801
                                       OBJECTS READ FROM TAPE.   @LAA*/ 22771400
       3 CBRSMF_PFX%%ST32BTDB FIXED(64), /* NUMBER OF BYTES OF BACKUP   22772001
                                       OBJECTS LOGICALLY DELETED        22772600
                                       FROM TAPE.                @LAA*/ 22773200
       /* BYTE COUNTS OF BACKUP2 OBJECTS WRITTEN, READ AND              22773800
          DELETED FROM OPTICAL.                                  @LAA*/ 22774400
       3 CBRSMF_PFX%%ST32B2OWB FIXED(64), /* NUMBER OF BYTES OF BACKUP2 22775001
                                       OBJECTS WRITTEN TO               22775600
                                       OPTICAL.                  @LAA*/ 22776200
       3 CBRSMF_PFX%%ST32B2ORB FIXED(64), /* NUMBER OF BYTES OF BACKUP2 22776801
                                       OBJECTS READ FROM OPTICAL.@LAA*/ 22777400
       3 CBRSMF_PFX%%ST32B2ODB FIXED(64), /* NUMBER OF BYTES OF BACKUP2 22778001
                                       OBJECTS DELETED FROM             22778600
                                       OPTICAL.                  @LAA*/ 22779200
       /* BYTE COUNTS OF BACKUP2 OBJECTS WRITTEN, READ AND              22779800
          DELETED FROM TAPE.                                     @LAA*/ 22780400
       3 CBRSMF_PFX%%ST32B2TWB FIXED(64), /* NUMBER OF BYTES OF BACKUP2 22781001
                                       OBJECTS WRITTEN TO TAPE.  @LAA*/ 22781600
       3 CBRSMF_PFX%%ST32B2TRB FIXED(64), /* NUMBER OF BYTES OF BACKUP2 22782201
                                       OBJECTS READ FROM TAPE.   @LAA*/ 22782800
       3 CBRSMF_PFX%%ST32B2TDB FIXED(64), /* NUMBER OF BYTES OF BACKUP2 22783401
                                       OBJECTS LOGICALLY DELETED        22784000
                                       FROM TAPE.                @LAA*/ 22784600
       /* BYTE COUNTS OF RECALLED OBJECTS.                       @LAA*/ 22785200
       3 CBRSMF_PFX%%ST32RCLB FIXED(64), /* NUMBER OF BYTES OF          22785801
                                       RECALLED OBJECTS          @LAA*/ 22786400
       /* BYTE COUNTS OF PRIMARY OBJECTS WRITTEN, READ AND              22787000
          DELETED FROM TAPE SUBLEVEL 2 (TSL2).                   @LAA*/ 22787600
       3 CBRSMF_PFX%%ST32PUWB FIXED(64), /* NUMBER OF BYTES OF PRIMARY  22788201
                                       OBJECTS WRITTEN TO TSL2.  @LAA*/ 22788800
       3 CBRSMF_PFX%%ST32PURB FIXED(64), /* NUMBER OF BYTES OF PRIMARY  22789401
                                       OBJECTS READ FROM TSL2.   @LAA*/ 22790000
       3 CBRSMF_PFX%%ST32PUDB FIXED(64), /* NUMBER OF BYTES OF PRIMARY  22790601
                                       OBJECTS LOGICALLY DELETED        22791200
                                       FROM TSL2.                @LAA*/ 22791800
       /* BYTE COUNTS OF PRIMARY OBJECTS WRITTEN, READ AND              22792400
          DELETED FROM DISK SUBLEVEL 2 (DSL2).                   @LAA*/ 22793000
       3 CBRSMF_PFX%%ST32PEWB FIXED(64), /* NUMBER OF BYTES OF PRIMARY  22793601
                                       OBJECTS WRITTEN TO DSL2.  @LAA*/ 22794200
       3 CBRSMF_PFX%%ST32PERB FIXED(64), /* NUMBER OF BYTES OF PRIMARY  22794801
                                       OBJECTS READ FROM DSL2.   @LAA*/ 22795400
       3 CBRSMF_PFX%%ST32PEDB FIXED(64), /* NUMBER OF BYTES OF PRIMARY  22796001
                                       OBJECTS LOGICALLY DELETED        22796600
                                       FROM DSL2.                @LBC*/ 22796700
       /* Object counts and byte counts of backups deleted as a         22796800
          result of automatic backup deletion.                   @LBA*/ 22796900
       3 CBRSMF_PFX%%ST32BOAO FIXED(32), /* Number of backup objects    22797001
                                       auto deleted from optical @LBA*/ 22797100
       3 CBRSMF_PFX%%ST32B2OAO FIXED(32), /* Number of backup 2 objects 22797201
                                       auto deleted from optical @LBA*/ 22797300
       3 CBRSMF_PFX%%ST32BTAO FIXED(32), /* Number of backup objects    22797401
                                       auto deleted from tape    @LBA*/ 22797500
       3 CBRSMF_PFX%%ST32B2TAO FIXED(32), /* Number of backup 2 objects 22797601
                                       auto deleted from tape    @LBA*/ 22797700
       3 CBRSMF_PFX%%ST32BOAB FIXED(64), /* Number of bytes of backup   22797801
                                       objects auto deleted from        22797900
                                       optical                   @LBA*/ 22798000
       3 CBRSMF_PFX%%ST32B2OAB FIXED(64), /* Number of bytes of backup  22798101
                                       objects auto deleted from        22798200
                                       optical                   @LBA*/ 22798300
       3 CBRSMF_PFX%%ST32BTAB FIXED(64), /* Number of bytes of backup   22798401
                                       objects auto deleted from        22798500
                                       tape                      @LBA*/ 22798600
       3 CBRSMF_PFX%%ST32B2TAB FIXED(64), /* Number of bytes of backup  22798701
                                       objects auto deleted from        22798800
                                       tape                      @LFC*/ 22798900
       /* Byte counts of primary objects written, read, and             22798901
          deleted from cloud.                                    @LFA*/ 22798902
       3 CBRSMF_PFX%%ST32PCWB  FIXED(64), /* Number of bytes of primary 22798903
                                       objects written to cloud. @LFA*/ 22798904
       3 CBRSMF_PFX%%ST32PCRB  FIXED(64), /* Number of bytes of primary 22798905
                                       objects read from cloud.  @LFA*/ 22798906
       3 CBRSMF_PFX%%ST32PCDB  FIXED(64), /* Number of bytes of primary 22798907
                                       objects deleted from             22798908
                                       cloud.                    @LFA*/ 22798909
       /* Byte counts of backup objects written, read, and deleted      22798910
          from cloud.                                                */ 22798911
       3 CBRSMF_PFX%%ST32BCWB  FIXED(64), /* Number of bytes of backup  22798912
                                       objects written to cloud. @LGC*/ 22798913
       3 CBRSMF_PFX%%ST32BCRB  FIXED(64), /* Number of bytes of backup  22798914
                                       objects read from cloud.  @LGA*/ 22798915
       3 CBRSMF_PFX%%ST32BCDB  FIXED(64), /* Number of bytes of backup  22798916
                                       objects deleted from             22798917
                                       cloud.                    @LGA*/ 22798918
       /* Byte counts of backup2 objects written, read, and deleted     22798919
          from cloud.                                                */ 22798920
       3 CBRSMF_PFX%%ST32B2CWB FIXED(64), /* Number of bytes of backup2 22798921
                                       objects written to cloud. @LGA*/ 22798922
       3 CBRSMF_PFX%%ST32B2CRB FIXED(64), /* Number of bytes of backup2 22798923
                                       objects read from cloud.  @LGA*/ 22798924
       3 CBRSMF_PFX%%ST32B2CDB FIXED(64), /* Number of bytes of backup2 22798925
                                       objects deleted from             22798926
                                       cloud.                    @LGA*/ 22798927
       /* Counts of primary objects written, read, and                  22798929
          deleted from cloud.                                    @LFA*/ 22798930
       3 CBRSMF_PFX%%ST32PCWO  FIXED(32), /* Number of primary objects  22798931
                                       written to cloud.         @LFA*/ 22798932
       3 CBRSMF_PFX%%ST32PCRO  FIXED(32), /* Number of primary objects  22798933
                                       read from cloud.          @LFA*/ 22798934
       3 CBRSMF_PFX%%ST32PCDO  FIXED(32), /* Number of primary objects  22798935
                                       deleted from cloud.       @LGC*/ 22798936
       /* Counts of backup objects written, read, and deleted           22798937
          from cloud.                                                */ 22798938
       3  CBRSMF_PFX%%ST32BCWO  FIXED(32), /* Number of backup objects  22798939
                                       written to cloud.         @LGA*/ 22798940
       3  CBRSMF_PFX%%ST32BCRO  FIXED(32), /* Number of backup objects  22798941
                                       read from cloud.          @LGA*/ 22798942
       3  CBRSMF_PFX%%ST32BCDO  FIXED(32), /* Number of backup objects  22798943
                                       deleted from cloud.       @LGA*/ 22798944
       /* Counts of backup2 objects written, read, and deleted          22798945
          from cloud.                                                */ 22798946
       3  CBRSMF_PFX%%ST32B2CWO FIXED(32), /* Number of backup2 objects 22798947
                                       written to cloud.         @LGA*/ 22798948
       3  CBRSMF_PFX%%ST32B2CRO FIXED(32), /* Number of backup2 objects 22798949
                                       read from cloud.          @LGA*/ 22798950
       3  CBRSMF_PFX%%ST32B2CDO FIXED(32), /* Number of backup2 objects 22798951
                                       deleted from cloud.       @LGA*/ 22798952
       3 *         FIXED(32),       /* Reserved.                 @LGA*/ 22798953
       /* Byte counts of backup objects written, read, and deleted      22798954
          from file system.                                          */ 22798955
       3  CBRSMF_PFX%%ST32BEWB  FIXED(64), /* Number of bytes of backup 22798956
                                       objects written to file          22798957
                                       system.                   @LGA*/ 22798958
       3  CBRSMF_PFX%%ST32BERB  FIXED(64), /* Number of bytes of backup 22798959
                                       objects read from file           22798960
                                       system.                   @LGA*/ 22798961
       3  CBRSMF_PFX%%ST32BEDB  FIXED(64), /* Number of bytes of backup 22798962
                                       objects deleted from file        22798963
                                       system.                   @LGA*/ 22798964
       /* Byte counts of backup2 objects written, read, and deleted     22798965
          from file system.                                          */ 22798966
       3  CBRSMF_PFX%%ST32B2EWB FIXED(64), /* Number of bytes of        22798967
                                       backup2 objects written to       22798968
                                       file system.              @LGA*/ 22798969
       3  CBRSMF_PFX%%ST32B2ERB FIXED(64), /* Number of bytes of        22798970
                                       backup2 objects read from        22798971
                                       file system.              @LGA*/ 22798972
       3  CBRSMF_PFX%%ST32B2EDB FIXED(64), /* Number of bytes of        22798973
                                       backup2 objects deleted from     22798974
                                       file system.              @LGA*/ 22798975
       /* Counts of backup objects written, read, and deleted           22798976
          from file system.                                          */ 22798977
       3  CBRSMF_PFX%%ST32BEWO  FIXED(32), /* Number of backup objects  22798978
                                       written to file system.   @LGA*/ 22798979
       3  CBRSMF_PFX%%ST32BERO  FIXED(32), /* Number of backup objects  22798980
                                       read from file system.    @LGA*/ 22798981
       3  CBRSMF_PFX%%ST32BEDO  FIXED(32), /* Number of backup objects  22798982
                                       deleted from file system. @LGA*/ 22798983
       /* Counts of backup2 objects written, read, and deleted          22798984
          from file system.                                          */ 22798985
       3  CBRSMF_PFX%%ST32B2EWO FIXED(32), /* Number of backup2 objects 22798986
                                       written to file system.   @LGA*/ 22798987
       3  CBRSMF_PFX%%ST32B2ERO FIXED(32), /* Number of backup2 objects 22798988
                                       read from file system.    @LGA*/ 22798989
       3  CBRSMF_PFX%%ST32B2EDO FIXED(32), /* Number of backup2 objects 22798990
                                       deleted from file system. @LGA*/ 22798991
       /* Counts of number of backup and backup2 copies and bytes       22798992
          deleted from cloud and file system as a result of automatic   22798993
          backup deletion during storage group processing.           */ 22798994
       3  CBRSMF_PFX%%ST32BCAO  FIXED(32), /* Number of unneeded backup 22798995
                                       objects deleted from             22798996
                                       cloud.                    @LGA*/ 22798997
       3  CBRSMF_PFX%%ST32B2CAO FIXED(32), /* Number of unneeded        22798998
                                       backup2 objects deleted from     22798999
                                       cloud.                    @LGA*/ 22799000
       3  CBRSMF_PFX%%ST32BEAO  FIXED(32), /* Number of unneeded backup 22799001
                                       objects deleted from file        22799002
                                       system.                   @LGA*/ 22799003
       3  CBRSMF_PFX%%ST32B2EAO FIXED(32), /* Number of unneeded        22799004
                                       backup2 objects deleted from     22799005
                                       file system.              @LGA*/ 22799006
       3  CBRSMF_PFX%%ST32BCAB  FIXED(64), /* Number of bytes of        22799007
                                       unneeded backup objects deleted  22799008
                                       from cloud.               @LGA*/ 22799009
       3  CBRSMF_PFX%%ST32B2CAB FIXED(64), /* Number of bytes of        22799010
                                       unneeded backup2 objects deleted 22799011
                                       from cloud.               @LGA*/ 22799012
       3  CBRSMF_PFX%%ST32BEAB  FIXED(64), /* Number of bytes of        22799013
                                       unneeded backup objects deleted  22799014
                                       from file system.         @LGA*/ 22799015
       3  CBRSMF_PFX%%ST32B2EAB FIXED(64); /* Number of bytes of        22799016
                                       unneeded backup2 objects deleted 22799017
                                       from file system.         @LGA*/ 22799018
    DECLARE                         /*                               */ 22799019
      CBRSMF_PF2%%ST32L                                                 22799101
               FIXED(31) CONSTANT(LENGTH(SMF85HDR)+LENGTH(SMF85PIS)+    22799201
                                 LENGTH(CBRSMF_PFX%%ST32)),             22800001
      CBRSMF_PF2%%ST33L                                                 22850001
               FIXED(31) CONSTANT(LENGTH(SMF85HDR)+LENGTH(SMF85PIS)+    22860001
                                 LENGTH(CBRSMF_PFX%%ST32)),             22900001
      CBRSMF_PF2%%ST34L                                                 22950001
               FIXED(31) CONSTANT(LENGTH(SMF85HDR)+LENGTH(SMF85PIS)+    22960001
                                 LENGTH(CBRSMF_PFX%%ST32)),             23000001
      CBRSMF_PF2%%ST35L                                                 23050001
               FIXED(31) CONSTANT(LENGTH(SMF85HDR)+LENGTH(SMF85PIS)+    23060001
                                 LENGTH(CBRSMF_PFX%%ST32));             23100001
   %END;                                                                23150000
 /********************************************************************/ 23155500
 /*                                                                  */ 23161000
 /* NOTE 1: 4 BYTE FIELDS REPORTING KILOBYTE VALUES HAVE BEEN        */ 23166500
 /*         SUPERSEDED BY CORRESPONDING 8 BYTE FIELDS REPORTING      */ 23172000
 /*         VALUES IN BYTES. THE EXISTING 4 BYTE FIELDS WILL CONTAIN */ 23177500
 /*         X'FFFF FFFF' IF AN OVERFLOW CONDITION OCCURS.            */ 23183000
 /*                                                                  */ 23188500
 /********************************************************************/ 23194000
 %IF IBM_CBGENC = 'YES' !                                     /* @PDC*/ 23195000
     SMF85S36 ^= '' %THEN                                               23200000
   %DO;                                                                 23250000
 @EJECT;                            /*                               */ 23300000
 /********************************************************************/ 23350000
 /*                                                                  */ 23400000
 /* OAM SUBTYPE SECTION, FOR SUBTYPES 36                             */ 23450000
 /*                                                                  */ 23500000
 /* SUBTYPE FUNCTION                                                 */ 23550000
 /* ------- ---------------------------------------------------      */ 23600000
 /*      36 OSMC SINGLE OBJECT RECOVERY UTILITY                      */ 23650000
 /*                                                                  */ 23700000
 /********************************************************************/ 23750000
 %CBRSMF_DEF = 'DEFINED(R85PEND)';                            /* @PDA*/ 23760001
 %IF IBM_CBGENC = 'YES' %THEN %CBRSMF_DEF = 'BASED';          /* @PDA*/ 23770001
 DECLARE                            /*                               */ 23800000
     1 CBRSMF_PFX%%ST36 CBRSMF_DEF, /* SUBTYPE 36                    */ 23850001
       3 CBRSMF_PFX%%ST36COLN CHAR(44), /* COLLECTION NAME           */ 23900001
       3 CBRSMF_PFX%%ST36CNID FIXED(32), /* COLLECTION ID            */ 23950001
       3 CBRSMF_PFX%%ST36OBJN CHAR(44), /* OBJECT NAME               */ 24000001
       3 CBRSMF_PFX%%ST36SGN CHAR(8), /* STORAGE GROUP NAME          */ 24050001
       3 CBRSMF_PFX%%ST36OLEN FIXED(32), /* OBJECT LENGTH            */ 24100001
  3 CBRSMF_PFX%%ST36BVSN CHAR(6),   /* VOLUME SERIAL NUMBER OF OPTICAL  24150001
                                       VOLUME OR TAPE VOLUME FROM WHICH 24200000
                                       THE BACKUP COPY OF THE OBJECT    24250000
                                       WAS READ.                     */ 24300000
       3 CBRSMF_PFX%%ST36BMT CHAR(2), /* MEDIA TYPE OF THE VOLUME FROM  24350001
                                       WHICH THE BACKUP COPY OF THE     24400000
                                       BACKUP COPY OF THE OBJECT WAS    24450000
                                       READ.                         */ 24500000
  3 CBRSMF_PFX%%ST36BTKN FIXED(32), /* VOLUME LOCATION TOKEN ASSOCIATED 24550001
                                       WITH BACKUP COPY OF THE OBJECT   24600000
                                       ON THE VOLUME SPECIFIED IN THE   24650000
                                       ST36BVSN FIELD.           @P5C*/ 24700000
  3 CBRSMF_PFX%%ST36TVSN CHAR(6),   /* VOLUME SERIAL NUMBER OF OPTICAL  24750001
                                       VOLUME OR TAPE VOLUME TO WHICH   24800000
                                       THE NEW PRIMARY COPY OF THE      24850000
                                       OBJECT WAS WRITTEN.  THIS FIELD  24900000
                                       CONTAINS BLANKS IF THE NEW       24950000
                                       LOCATION IS NOT IN THE OPTICAL   25000000
                                       OR TAPE LEVEL OF THE STORAGE     25000001
                                       HEIRARCHY.                @LFC*/ 25000002
       3 CBRSMF_PFX%%ST36TMT CHAR(2), /* MEDIA TYPE OF THE VOLUME TO    25100001
                                       WHICH THE NEW PRIMARY COPY OF    25150000
                                       OBJECT WAS WRITTEN.  THIS FIELD  25200000
                                       CONTAINS BLANKS IF THE NEW       25200001
                                       LOCATION IS NOT IN THE OPTICAL   25200002
                                       OR TAPE LEVEL OF THE STORAGE     25200003
                                       HEIRARCHY.                @LFC*/ 25200004
       3 CBRSMF_PFX%%ST36OVSN CHAR(6), /* VOLUME SERIAL NUMBER OF THE   25250001
                                       ORIGINAL OPTICAL OR TAPE VOLUME  25300000
                                       ON WHICH THE PRIMARY COPY OF THE 25350000
                                       OBJECT RESIDED PRIOR TO THE      25400000
                                       START OF THE SINGLE OBJECT       25450000
                                       RECOVERY UTILITY.  THIS FIELD    25500000
                                       CONTAINS BLANKS IF THE NEW       25500001
                                       LOCATION IS NOT IN THE OPTICAL   25500002
                                       OR TAPE LEVEL OF THE STORAGE     25500003
                                       HEIRARCHY.                @LFC*/ 25500004
       3 CBRSMF_PFX%%ST36OMT CHAR(2), /* MEDIA TYPE OF THE ORIGINAL     25700001
                                       OPTICAL OR TAPE VOLUME ON WHICH  25750000
                                       THE PRIMARY COPY OF THE OBJECT   25800000
                                       RESIDED PRIOR TO THE START OF    25850000
                                       THE SINGLE OBJECT RECOVERY       25900000
                                       UTILITY.  THIS FIELD CONTAINS    25950000
                                       BLANKS IF THE NEW LOCATION       25950001
                                       IS NOT IN THE OPTICAL OR TAPE    25950002
                                       LEVEL OF THE STORAGE             25950003
                                       HEIRARCHY.                @LFC*/ 25950004
       3 CBRSMF_PFX%%ST36FLGS BIT(32), /* PROCESSING FLAGS       @L2C*/ 26118701
         5 CBRSMF_PFX%%ST36FLG0 BIT(1), /* WHEN ON, OBJ RECOVERY WAS    26137401
                                       INVOKED W/ BACKUP1 KEYWD         26156100
                                       OR DEFAULTED TO BACKUP1.  @L2A*/ 26174800
         5 CBRSMF_PFX%%ST36FLG1 BIT(1), /* WHEN ON, OBJ RECOVERY WAS    26193501
                                       INVOKED W/ BACKUP2 KEYWD  @L2A*/ 26212200
         5 CBRSMF_PFX%%ST36FLG2 BIT(1), /* WHEN ON, BACKUP COPY IS      26212201
                                       RETRIEVED FROM CLOUD      @LGA*/ 26212203
         5 CBRSMF_PFX%%ST36FLG3 BIT(1), /* WHEN ON, BACKUP COPY IS      26212204
                                       RETRIEVED FROM FILE SYSTEM@LGA*/ 26212206
         5 *        BIT(28),        /* RESERVED.                 @LGC*/ 26217600
       3 CBRSMF_PFX%%ST36DSL CHAR(2), /* Disk sublevel associated with  26223001
                                       the recovered object.  This      26228400
                                       field is only valid when the     26233800
                                       ST36TVSN field contains blanks   26239200
                                       and the ST36TCLID field is       26239201
                                       zero.                     @LFC*/ 26244600
       3 CBRSMF_PFX%%ST36TCLID FIXED(15), /* Cloud ID.           @LGC*/ 26244601
       3 CBRSMF_PFX%%ST36BCLID FIXED(15); /*                            26244602
                                       Cloud ID of the backup copy      26244603
                                       retrieved from cloud.     @LGA*/ 26244604
    DECLARE                         /*                               */ 26250000
      CBRSMF_PF2%%ST36L                                                 26300001
               FIXED(31) CONSTANT(LENGTH(SMF85HDR)+LENGTH(SMF85PIS)+    26310001
                                 LENGTH(CBRSMF_PFX%%ST36));             26350001
   %END;                                                                26400000
 %IF IBM_CBGENC = 'YES' !                                     /* @PDC*/ 26410000
     SMF85S37 ^= '' %THEN                                               26450000
   %DO;                                                                 26500000
 @EJECT;                            /*                               */ 26550000
 /********************************************************************/ 26600000
 /*                                                                  */ 26650000
 /* OAM SUBTYPE SECTION, FOR SUBTYPE 37                              */ 26700000
 /*                                                                  */ 26750000
 /* SUBTYPE FUNCTION                                                 */ 26800000
 /* ------- ---------------------------------------------------      */ 26850000
 /*      37 OSMC LIBRARY SPACE MANAGEMENT UTILITY                    */ 26900000
 /*                                                                  */ 26950000
 /********************************************************************/ 27000000
 %CBRSMF_DEF = 'DEFINED(R85PEND)';                            /* @PDA*/ 27010001
 %IF IBM_CBGENC = 'YES' %THEN %CBRSMF_DEF = 'BASED';          /* @PDA*/ 27020001
 DECLARE                            /*                               */ 27050000
     1 CBRSMF_PFX%%ST37 CBRSMF_DEF, /* SUBTYPE 37                    */ 27100001
       3 CBRSMF_PFX%%ST37LIBN CHAR(8), /* OPTICAL LIBRARY NAME       */ 27150001
       3 CBRSMF_PFX%%ST37LIBD CHAR(8), /* OPTICAL LIBRARY DEVICE TYPE */27200001
       3 CBRSMF_PFX%%ST37NOCE FIXED(32), /* NUMBER OF OPTICAL DISK      27250001
                                       CARTRIDGES EJECTED.           */ 27300000
       3 CBRSMF_PFX%%ST37FLGS BIT(32), /* PROCESSING FLAGS           */ 27350001
         5 CBRSMF_PFX%%ST37FLG0 BIT(1), /*                              27400001
                                       WHEN ON, LIBRARY SPACE MANAGEMENT27410001
                                       WAS INVOKED AUTOMATICALLY UNDER  27450000
                                       SOFTWARE CONTROL, DUE TO A       27500000
                                       "STORAGE GROUP OUT-OF-SPACE"     27550000
                                       CONDITION IN THE SPECIFIED       27600000
                                       LIBRARY.                      */ 27650000
         5 CBRSMF_PFX%%ST37FLG1 BIT(1), /*                              27700001
                                       WHEN ON, LIBRARY SPACE MANAGEMENT27710001
                                       WAS INVOKED BY A "F OAM,START    27750000
                                       LIBMGT,LIBNAME" COMMAND ISSUED   27800000
                                       FROM AN MVS CONSOLE.          */ 27850000
         5 *        BIT(30);        /* RESERVED                      */ 27900000
    DECLARE                         /*                               */ 27950000
      CBRSMF_PF2%%ST37L                                                 28000001
               FIXED(31) CONSTANT(LENGTH(SMF85HDR)+LENGTH(SMF85PIS)+    28010001
                                 LENGTH(CBRSMF_PFX%%ST37));             28050001
   %END;                                                                28100000
 %IF IBM_CBGENC = 'YES' !                                     /* @PDC*/ 28101000
     SMF85S38 ^= '' %THEN                                               28101200
   %DO;                                                                 28102400
 @EJECT;                            /*                               */ 28103600
 /********************************************************************/ 28104800
 /*                                                                  */ 28106000
 /* OAM SUBTYPE SECTION, FOR SUBTYPES 38                             */ 28107200
 /*                                                                  */ 28108400
 /* SUBTYPE FUNCTION                                                 */ 28109600
 /* ------- ---------------------------------------------------      */ 28110800
 /*      38 OSMC SINGLE OBJECT RECALL FUNCTION                   @L4A*/ 28112000
 /*                                                                  */ 28113200
 /********************************************************************/ 28114400
 %CBRSMF_DEF = 'DEFINED(R85PEND)';                            /* @PDA*/ 28114501
 %IF IBM_CBGENC = 'YES' %THEN %CBRSMF_DEF = 'BASED';          /* @PDA*/ 28114601
 DECLARE                            /*                               */ 28115600
     1 CBRSMF_PFX%%ST38 CBRSMF_DEF, /* SUBTYPE 38                @L4A*/ 28116801
       3 CBRSMF_PFX%%ST38COLN CHAR(44), /* COLLECTION NAME       @L4A*/ 28118001
       3 CBRSMF_PFX%%ST38CNID FIXED(32), /* COLLECTION ID        @L4A*/ 28119201
       3 CBRSMF_PFX%%ST38OBJN CHAR(44), /* OBJECT NAME           @L4A*/ 28120401
       3 CBRSMF_PFX%%ST38SGN CHAR(8), /* STORAGE GROUP NAME      @L4A*/ 28121601
       3 CBRSMF_PFX%%ST38OLEN FIXED(32), /* OBJECT LENGTH        @L4A*/ 28122801
       3 CBRSMF_PFX%%ST38VSN CHAR(6), /* VOLUME SERIAL NUMBER OF OPTICAL28124001
                                       VOLUME OR TAPE VOLUME FROM WHICH 28125200
                                       THE COPY OF THE OBJECT           28126400
                                       WAS READ. THIS FIELD CONTAINS    28127600
                                       BLANKS IF THE OBJECT WAS         28127601
                                       RECALLED FROM THE CLOUD          28127602
                                       LEVEL.                    @LFC*/ 28127603
       3 CBRSMF_PFX%%ST38MT CHAR(2), /* MEDIA TYPE OF THE VOLUME FROM   28128801
                                       WHICH THE COPY OF THE OBJECT     28130000
                                       WAS READ. THIS FIELD CONTAINS    28131200
                                       BLANKS IF THE OBJECT WAS         28131201
                                       RECALLED FROM THE CLOUD          28131202
                                       LEVEL.                    @LFC*/ 28131203
  3 CBRSMF_PFX%%ST38TKN FIXED(32),  /* VOLUME LOCATION TOKEN ASSOCIATED 28132401
                                       WITH THE COPY OF THE OBJECT      28133600
                                       ON THE VOLUME SPECIFIED IN THE   28134800
                                       ST38BVSN FIELD. THIS FIELD       28136000
                                       CONTAINS ZERO IF THE OBJECT      28136001
                                       WAS RECALLED FROM THE CLOUD      28136002
                                       LEVEL.                    @LFC*/ 28136003
       3 CBRSMF_PFX%%ST38RCLD FIXED(31), /* NUMBER OF DAYS THIS OBJECT  28136101
                                       IS TO REMAIN IN RECALLED         28136200
                                       MODE.                     @01A*/ 28136300
       3 CBRSMF_PFX%%ST38VT CHAR(1), /* VOLUME TYPE OF THE VOLUME       28136401
                                       SPECIFIED IN THE ST38VSN FIELD   28136500
                                       G = VOLUME IS A GROUPED VOLUME   28136600
                                       BELONGING TO AN OBJECT STORAGE   28136700
                                       GROUP.                           28136800
                                       B = VOLUME IS A GROUPED VOLUME   28136900
                                       BELONGING TO AN OBJECT BACKUP    28137000
                                      STORAGE GROUP             @01C*/  28137100
       3 CBRSMF_PFX%%ST38BT CHAR(1), /* VOLUME BACKUP TYPE OF VOLUME    28137201
                                       SPECIFIED IN THE ST38VSN FIELD   28137300
                                       1 = BACKUP1 VOLUME               28137400
                                       2 = BACKUP2 VOLUME        @01C*/ 28137500
       3 CBRSMF_PFX%%ST38DSL CHAR(2), /* Disk sublevel associated with  28138201
                                       the recalled object.      @L9C*/ 28138900
       3 CBRSMF_PFX%%ST38FLGS BIT(32), /* PROCESSING FLAGS       @L4A*/ 28139601
         5 CBRSMF_PFX%%ST38FLG0 BIT(1), /* WHEN ON, OBJECT RECALL WAS   28140801
                                       SUCCESSFUL                @L4A*/ 28142000
         5 *        BIT(31),        /* RESERVED.                 @LFC*/ 28143200
       3 CBRSMF_PFX%%ST38CLDID FIXED(15); /* CLOUD ID            @LFA*/ 28143201
    DECLARE                         /*                               */ 28144400
      CBRSMF_PF2%%ST38L                                                 28145601
               FIXED(31) CONSTANT(LENGTH(SMF85HDR)+LENGTH(SMF85PIS)+    28145701
                                 LENGTH(CBRSMF_PFX%%ST38));   /* @L4A*/ 28146801
   %END;                                                      /* @L4A*/ 28148000
 %IF IBM_CBGENC = 'YES' !                                     /* @PDC*/ 28149000
     SMF85S39 ^= '' %THEN                                               28152200
   %DO;                                                                 28152800
 @EJECT;                            /*                               */ 28153400
 /********************************************************************/ 28154000
 /*                                                                  */ 28154600
 /* OAM SUBTYPE SECTION, FOR SUBTYPES 39                             */ 28155200
 /*                                                                  */ 28155800
 /* SUBTYPE FUNCTION                                                 */ 28156400
 /* ------- ---------------------------------------------------      */ 28157000
 /*      39 OSMC IMMEDIATE BACKUP COPY FOR THIS OBJECT           @L5A*/ 28157600
 /*                                                                  */ 28158200
 /********************************************************************/ 28158800
 %CBRSMF_DEF = 'DEFINED(R85PEND)';                            /* @PDA*/ 28158901
 %IF IBM_CBGENC = 'YES' %THEN %CBRSMF_DEF = 'BASED';          /* @PDA*/ 28159001
 DECLARE                            /*                               */ 28159400
     1 CBRSMF_PFX%%ST39 CBRSMF_DEF, /* SUBTYPE 39                @L5A*/ 28160001
       3 CBRSMF_PFX%%ST39COLN CHAR(44), /* COLLECTION NAME       @L5A*/ 28160601
       3 CBRSMF_PFX%%ST39CNID FIXED(32), /* COLLECTION ID        @L5A*/ 28161201
       3 CBRSMF_PFX%%ST39OBJN CHAR(44), /* OBJECT NAME           @L5A*/ 28161801
       3 CBRSMF_PFX%%ST39SGN CHAR(8), /* STORAGE GROUP NAME      @L5A*/ 28162401
       3 CBRSMF_PFX%%ST39MCN CHAR(8), /* MANAGEMENT CLASS NAME   @L5A*/ 28163001
       3 CBRSMF_PFX%%ST39OLEN FIXED(32), /* OBJECT LENGTH        @L5A*/ 28163601
       3 CBRSMF_PFX%%ST39SVSN CHAR(6), /* SOURCE VOLUME SERIAL NUMBER OF28164201
                                       OPTICAL VOLUME OR TAPE VOLUME    28164800
                                       FROM WHICH THE PRIMARY OBJECT    28165400
                                       WAS READ.                        28166000
                                       ONLY VALID IF THE BIT 1 OR 2     28166600
                                       IS ON IN FIELD ST39FLGS   @L5A*/ 28167200
       3 CBRSMF_PFX%%ST39SMT CHAR(2), /* SOURCE MEDIA TYPE OF THE VOLUME28167801
                                       FROM WHICH THE PRIMARY OBJECT    28168400
                                       WAS READ.                        28169000
                                       ONLY VALID IF THE BIT 1 OR 2     28169600
                                       IS ON IN FIELD ST39FLGS   @L5A*/ 28170200
       3 CBRSMF_PFX%%ST39TVSN CHAR(6), /* TARGET VOLUME SERIAL NUMBER OF28170801
                                       OPTICAL VOLUME OR TAPE VOLUME    28171400
                                       ON WHICH THE BACKUP COPY OF      28172000
                                       THE OBJECT WAS WRITTEN.          28172600
                                       ONLY VALID IF THE BIT 1 OR 2     28173200
                                       IS ON IN FIELD ST39FLGS   @L5A*/ 28173800
       3 CBRSMF_PFX%%ST39TMT CHAR(2), /* TARGET MEDIA TYPE OF THE VOLUME28174401
                                       ON WHICH THE BACKUP COPY OF      28175000
                                       THE OBJECT WAS WRITTEN.          28175600
                                       ONLY VALID IF THE BIT 1 OR 2     28176200
                                       IS ON IN FIELD ST39FLGS   @L5A*/ 28176800
  3 CBRSMF_PFX%%ST39BTKN FIXED(32), /* VOLUME LOCATION TOKEN ASSOCIATED 28177401
                                       WITH THE COPY OF THE OBJECT      28178000
                                       ON THE VOLUME SPECIFIED IN THE   28178600
                                       ST39TVSN FIELD.           @L5A*/ 28179200
       3 CBRSMF_PFX%%ST39FLGS BIT(32), /* PROCESSING FLAGS       @L5A*/ 28179801
         5 CBRSMF_PFX%%ST39FLG0 BIT(1), /* WHEN ON, THE PRIMARY COPY    28180401
                                       IS STORED TO DISK.        @L9C*/ 28181000
         5 CBRSMF_PFX%%ST39FLG1 BIT(1), /* WHEN ON, THE PRIMARY COPY    28181601
                                       IS STORED TO OPTICAL.     @L5A*/ 28182200
         5 CBRSMF_PFX%%ST39FLG2 BIT(1), /* WHEN ON, THE PRIMARY COPY    28182801
                                       IS STORED TO TAPE.        @L5A*/ 28183400
         5 CBRSMF_PFX%%ST39FLG3 BIT(1), /*  WHEN ON, THE PRIMARY COPY   28184001
                                            IS STORED TO CLOUD.  @LFC*/ 28184002
         5 CBRSMF_PFX%%ST39FLG4 BIT(1), /* RESERVED              @L5A*/ 28184601
         5 CBRSMF_PFX%%ST39FLG5 BIT(1), /* WHEN ON, THE BACKUP COPY     28185201
                                       IS STORED TO OPTICAL.     @L5A*/ 28185800
         5 CBRSMF_PFX%%ST39FLG6 BIT(1), /* WHEN ON, THE BACKUP COPY     28186401
                                       IS STORED TO TAPE.        @L5A*/ 28187000
         5 CBRSMF_PFX%%ST39FLG7 BIT(1), /* RESERVED              @L5A*/ 28187601
         5 CBRSMF_PFX%%ST39FLG8 BIT(1), /* WHEN ON, WRITE TO BACKUP     28188201
                                       COPY WAS SUCCESSFUL.      @L5A*/ 28188800
         5 *        BIT(1),         /* reserved                  @L9C*/ 28189000
         5 CBRSMF_PFX%%ST39FLG10 BIT(1), /*                             28189201
                                       When on, primary on SL1   @L9A*/ 28189301
         5 CBRSMF_PFX%%ST39FLG11 BIT(1), /*                             28189401
                                       When on, primary on SL2   @L9A*/ 28189501
         5 CBRSMF_PFX%%ST39FLG12 BIT(1), /*                             28189502
                                       When on, the backup copy is      28189503
                                       stored to cloud.          @LGA*/ 28189504
         5 CBRSMF_PFX%%ST39FLG13 BIT(1), /*                             28189505
                                       When on, the backup copy is      28189506
                                       stored to file system.    @LGA*/ 28189507
         5 *        BIT(18),        /* RESERVED                  @LGC*/ 28189600
       3 CBRSMF_PFX%%ST39SCLID FIXED(15), /* Cloud ID.           @LGC*/ 28189601
       3 CBRSMF_PFX%%ST39BCLID FIXED(15); /*                            28189602
                                       Cloud ID of the backup           28189603
                                       copy stored to cloud.     @LGA*/ 28189604
    DECLARE                         /*                               */ 28190000
      CBRSMF_PF2%%ST39L                                                 28190601
               FIXED(31) CONSTANT(LENGTH(SMF85HDR)+LENGTH(SMF85PIS)+    28190701
                                 LENGTH(CBRSMF_PFX%%ST39));   /* @L5A*/ 28191201
   %END;                                                      /* @L5A*/ 28191800
 %IF IBM_CBGENC = 'YES' !                                     /* @PDC*/ 28191900
     SMF85S40 ^= '' %THEN                                               28192000
   %DO;                                                                 28192200
 @EJECT;                            /*                           @L5A*/ 28192400
 /********************************************************************/ 28192600
 /*                                                                  */ 28192800
 /* OAM SUBTYPE SECTION, FOR SUBTYPE 40                              */ 28193000
 /*                                                                  */ 28193200
 /* SUBTYPE FUNCTION                                                 */ 28193400
 /* ------- ---------------------------------------------------      */ 28193600
 /*      40 OSMC COMMAND RECYCLE UTILITY                             */ 28193800
 /*                                                              @L5A*/ 28194000
 /********************************************************************/ 28194200
 %CBRSMF_DEF = 'DEFINED(R85PEND)';                            /* @PDA*/ 28194301
 %IF IBM_CBGENC = 'YES' %THEN %CBRSMF_DEF = 'BASED';          /* @PDA*/ 28194401
 DECLARE                            /*                               */ 28194500
     1 CBRSMF_PFX%%ST40 CBRSMF_DEF, /* SUBTYPE 40                @L5A*/ 28194601
  3 CBRSMF_PFX%%ST40STRD CHAR(10),  /* RECYCLE COMMAND STARTDATE @L5A*/ 28194801
  3 CBRSMF_PFX%%ST40ENDD CHAR(10),  /* RECYCLE COMMAND END DATE  @L5A*/ 28195001
       3 CBRSMF_PFX%%ST40VOLN FIXED(15), /* # VOLS COMPLETED     @L5A*/ 28195201
       3 CBRSMF_PFX%%ST40PCTV FIXED(15), /* PERCENT VALID        @L5A*/ 28195401
       3 CBRSMF_PFX%%ST40LIM FIXED(15), /* LIMIT                 @L5A*/ 28195601
       3 CBRSMF_PFX%%ST40SUBL CHAR(1), /* TAPE SUBLEVEL:                28195701
                                       A=ALL,                           28195800
                                       -=TSL NOT SPECIFIED ON COMMAND,  28195900
                                       1=SUBLEVEL 1,                    28196000
                                       2=SUBLEVEL 2.                    28196100
                                                                 @L6A*/ 28196200
       3  *       FIXED(8),         /* RESERVED                  @L6C*/ 28196300
       3 CBRSMF_PFX%%ST40END CHAR(0); /* END                     @L5A*/ 28196401
    /* SUBTYPE 40 VOLUME ARRAY SECTION                           @L5A*/ 28196500
 %CBRSMF_DEF = 'DEFINED(ST40END)';                            /* @PDA*/ 28196601
 %IF IBM_CBGENC = 'YES' %THEN %CBRSMF_DEF = 'BASED';          /* @PDA*/ 28196701
    DECLARE                         /*                               */ 28196800
       1 CBRSMF_PFX%%ST40VOLD(*) CBRSMF_DEF, /*                         28196901
                                       ARRAY OF VOLUMES COMPLETED       28197001
                                         DURING RECYCLE PROCESS  @L5A*/ 28197101
          3 CBRSMF_PFX%%ST40VSN CHAR(6); /* VOLSER               @L5A*/ 28197201
    DECLARE                         /*                           @L5A*/ 28197301
      CBRSMF_PF2%%ST40L                                                 28197401
               FIXED(31) CONSTANT(LENGTH(SMF85HDR)+LENGTH(SMF85PIS)+    28197501
                                 LENGTH(CBRSMF_PFX%%ST40)+240);         28197601
                                              /*                 @L5A*/ 28197800
   %END;                                                                28198000
 %IF IBM_CBGENC = 'YES' !                                     /* @PDC*/ 28198100
     SMF85S64 ^= '' !                                                   28198200
     SMF85S65 ^= '' !                                                   28200000
     SMF85S66 ^= '' !                                                   28250000
     SMF85S67 ^= '' %THEN                                               28300000
   %DO;                                                                 28350000
 @EJECT;                            /*                               */ 28400000
 /********************************************************************/ 28450000
 /*                                                                  */ 28500000
 /* OAM SUBTYPE SECTION, FOR SUBTYPES 64 - 67                        */ 28550000
 /*                                                                  */ 28600000
 /* SUBTYPE FUNCTION                                                 */ 28650000
 /* ------- ---------------------------------------------------      */ 28700000
 /*      64 LCS OPTICAL OPTICAL DRIVE VARY ONLINE                    */ 28750000
 /*      65 LCS OPTICAL OPTICAL DRIVE VARY OFFLINE                   */ 28800000
 /*      66 LCS OPTICAL OPTICAL LIBRARY VARY ONLINE                  */ 28850000
 /*      67 LCS OPTICAL OPTICAL LIBRARY VARY OFFLINE                 */ 28900000
 /*                                                                  */ 28950000
 /********************************************************************/ 29000000
 %CBRSMF_DEF = 'DEFINED(R85PEND)';                            /* @PDA*/ 29010001
 %IF IBM_CBGENC = 'YES' %THEN %CBRSMF_DEF = 'BASED';          /* @PDA*/ 29020001
 DECLARE                            /*                               */ 29050000
     1 CBRSMF_PFX%%ST64 CBRSMF_DEF, /* SUBTYPES 64 - 67              */ 29100001
       3 CBRSMF_PFX%%ST64OLN CHAR(8), /* OPTICAL LIBRARY NAME        */ 29150001
       3 CBRSMF_PFX%%ST64OLDT CHAR(8), /* OPTICAL LIBRARY DEVICE TYPE */29200001
  3 CBRSMF_PFX%%ST64OLDN CHAR(4),   /* MVS DEVICE NUMBER CORRESPONDING  29250001
                                       TO THE OPTICAL LIBRARY        */ 29300000
       3 CBRSMF_PFX%%ST64ODN CHAR(8), /* OPTICAL DRIVE NAME, ONLY VALID 29350001
                                       FOR SUBTYPES 64 AND 65.       */ 29400000
  3 CBRSMF_PFX%%ST64ODDT CHAR(8),   /* OPTICAL DRIVE DEVICE TYPE, ONLY  29450001
                                       VALID FOR SUBTYPES 64 AND 65. */ 29500000
  3 CBRSMF_PFX%%ST64ODDN CHAR(4),   /* MVS DEVICE NUMBER CORRESPONDING  29550001
                                       TO THE OPTICAL DRIVE.  ONLY      29600000
                                       VALID FOR SUBTYPES 64 AND 65. */ 29650000
  3 CBRSMF_PFX%%ST64VSN0 CHAR(6),   /* OPTICAL VOLUME SERIAL NUMBER OF  29700001
                                       CURRENTLY MOUNTED VOLUME.        29750000
                                       VALID FOR SUBTYPES 64 AND 65,    29800000
                                       CONTAINS BLANKS FOR OTHER        29850000
                                       SUBTYPES.                     */ 29900000
       3 CBRSMF_PFX%%ST64VSN1 CHAR(6), /* OPPOSITE SIDE OF              29950001
                                       CURRENTLY MOUNTED VOLUME.        30000000
                                       VALID FOR SUBTYPES 64 AND 65,    30050000
                                       CONTAINS BLANKS FOR OTHER        30100000
                                       SUBTYPES.                     */ 30150000
       3 CBRSMF_PFX%%ST64OMT CHAR(2), /* OPTICAL MEDIA TYPE OF CURRENTLY30200001
                                       MOUNTED OPTICAL VOLUME.       */ 30250000
       3 CBRSMF_PFX%%ST64ODT CHAR(1), /* OPTICAL DRIVE TYPE. L=LIBRARY  30300001
                                       RESIDENT, S=STANDALONE.          30350000
                                       VALID FOR SUBTYPES 64 AND 65,    30400000
                                       CONTAINS BLANKS FOR OTHER        30450000
                                       SUBTYPES.                     */ 30500000
       3 CBRSMF_PFX%%ST64OVT CHAR(1), /* OPTICAL VOLUME TYPE.           30550001
                                       G = OBJECT STORAGE GROUP,        30600000
                                       B = OBJECT BACKUP STOR GROUP,    30650000
                                       S = SCRATCH OPTICAL VOLUME.      30700000
                                       VALID FOR SUBTYPES 64 AND 65,    30750000
                                       CONTAINS BLANKS FOR OTHER        30800000
                                       SUBTYPES.                     */ 30850000
       3 CBRSMF_PFX%%ST64SGN CHAR(8), /* STORAGE GROUP NAME. ONLY VALID 30900001
                                       IF ST64VSN0 CONTAINS VOLSER,     30950000
                                       BLANKS OTHERWISE.                31000000
                                       VALID FOR SUBTYPES 64 AND 65,    31050000
                                       CONTAINS BLANKS FOR OTHER        31100000
                                       SUBTYPES.                     */ 31150000
  3 CBRSMF_PFX%%ST64LIQT FIXED(32), /* AMOUNT OF TIME (IN MILLISECONDS) 31200001
                                       THIS REQUEST SPENT ON THE LCS    31250000
                                       INPUT-WORK-QUEUE WAITING TO      31300000
                                       PROCESSED.                    */ 31350000
  3 CBRSMF_PFX%%ST64LDQT FIXED(32), /* AMOUNT OF TIME (IN MILLISECONDS) 31400001
                                       THIS REQUEST SPENT ON THE LCS    31450000
                                       DISPATCHER-QUEUE WAITING TO      31500000
                                       PROCESSED.                    */ 31550000
  3 CBRSMF_PFX%%ST64LEQT FIXED(32), /* AMOUNT OF TIME (IN MILLISECONDS) 31600001
                                       THIS REQUEST SPENT ON THE LCS    31650000
                                       EXECUTION-QUEUE BEING            31700000
                                       PROCESSED.                    */ 31750000
       3 CBRSMF_PFX%%ST64LTQT FIXED(32), /* LIBRARY TASK QUEUE TIME.    31800001
                                       AMOUNT OF TIME (IN MILLISECONDS) 31850000
                                       THIS REQUEST SPENT ON THE LCS    31900000
                                       LIBRARY TASK QUEUE (LQE QUEUE)   31950000
                                       WAITING TO BE PROCESSED.         32000000
                                       NORMALLY, THIS FIELD REPRESENTS  32050000
                                       CARTRIDGES TRANSPORT MECHANISM   32100000
                                       WAIT TIME.  THAT IS, THE AMOUNT  32150000
                                       OF TIME WAITING FOR THE CARTRIDGE32200000
                                       TRANSPORT MECHANISM (ROBOT) TO   32250000
                                       BECOME AVAILABLE WITHIN AN       32300000
                                       AUTOMATED STORAGE LIBRARY.    */ 32350000
  3 CBRSMF_PFX%%ST64LTPT FIXED(32), /* LIBRARY TASK PROCESSING TIME.    32400001
                                       AMOUNT OF TIME (IN MILLISECONDS) 32450000
                                       THIS REQUEST TOOK TO BE          32500000
                                       PROCESSED BY THE LIBRARY TASK.   32550000
                                       WAITING TO BE PROCESSED.         32600000
                                       NORMALLY, THIS FIELD REPRESENTS  32650000
                                       CARTRIDGES TRANSPORT MECHANISM   32700000
                                       SERVICE TIME.  THAT IS, THE      32750000
                                       TIME SPENT BY THE                32800000
                                       CARTRIDGE TRANSPORT MECHANISM    32850000
                                       (ROBOT) TO MOVE CARTRIDGES WITHIN32900000
                                       THE OPTICAL DISK LIBRARY.     */ 32950000
       3 CBRSMF_PFX%%ST64RC FIXED(32), /* LCS RETURN CODE            */ 33000001
       3 CBRSMF_PFX%%ST64RS FIXED(32), /* LCS REASON CODE            */ 33050001
       3 CBRSMF_PFX%%ST64FLGS BIT(32); /* PROCESSING FLAGS, RESERVED. */33100001
    DECLARE                         /*                               */ 33150000
      CBRSMF_PF2%%ST64L                                                 33200001
               FIXED(31) CONSTANT(LENGTH(SMF85HDR)+LENGTH(SMF85PIS)+    33210001
                                 LENGTH(CBRSMF_PFX%%ST64)),             33250001
      CBRSMF_PF2%%ST65L                                                 33300001
               FIXED(31) CONSTANT(LENGTH(SMF85HDR)+LENGTH(SMF85PIS)+    33310001
                                 LENGTH(CBRSMF_PFX%%ST64)),             33350001
      CBRSMF_PF2%%ST66L                                                 33400001
               FIXED(31) CONSTANT(LENGTH(SMF85HDR)+LENGTH(SMF85PIS)+    33410001
                                 LENGTH(CBRSMF_PFX%%ST64)),             33450001
      CBRSMF_PF2%%ST67L                                                 33500001
               FIXED(31) CONSTANT(LENGTH(SMF85HDR)+LENGTH(SMF85PIS)+    33510001
                                 LENGTH(CBRSMF_PFX%%ST64));             33550001
   %END;                                                                33600000
 %IF IBM_CBGENC = 'YES' !                                     /* @PDC*/ 33610000
     SMF85S68 ^= '' !                                                   33650000
     SMF85S69 ^= '' !                                                   33700000
     SMF85S70 ^= '' !                                                   33750000
     SMF85S71 ^= '' !                                                   33800000
     SMF85S72 ^= '' !                                                   33850000
     SMF85S73 ^= '' %THEN                                               33900000
   %DO;                                                                 33950000
 @EJECT;                            /*                               */ 34000000
 /********************************************************************/ 34050000
 /*                                                                  */ 34100000
 /* OAM SUBTYPE SECTION, FOR SUBTYPES 68 - 71                        */ 34150000
 /*                                                                  */ 34200000
 /* SUBTYPE FUNCTION                                                 */ 34250000
 /* ------- ---------------------------------------------------      */ 34300000
 /*      68 LCS OPTICAL CARTRIDGE ENTRY                              */ 34350000
 /*      69 LCS OPTICAL CARTRIDGE EJECT                              */ 34400000
 /*      70 LCS OPTICAL CARTRIDGE LABEL                              */ 34450000
 /*      71 LCS OPTICAL VOLUME AUDIT                                 */ 34500000
 /*      72 LCS OPTICAL VOLUME MOUNT                                 */ 34550000
 /*      73 LCS OPTICAL VOLUME DEMOUNT                               */ 34600000
 /*                                                                  */ 34650000
 /********************************************************************/ 34700000
 %CBRSMF_DEF = 'DEFINED(R85PEND)';                            /* @PDA*/ 34710001
 %IF IBM_CBGENC = 'YES' %THEN %CBRSMF_DEF = 'BASED';          /* @PDA*/ 34720001
 DECLARE                            /*                               */ 34750000
     1 CBRSMF_PFX%%ST68 CBRSMF_DEF, /* SUBTYPES 68 - 73              */ 34800001
       3 CBRSMF_PFX%%ST68OLN CHAR(8), /* OPTICAL LIBRARY NAME        */ 34850001
       3 CBRSMF_PFX%%ST68OLDT CHAR(8), /* OPTICAL LIBRARY DEVICE TYPE */34900001
  3 CBRSMF_PFX%%ST68OLDN CHAR(4),   /* MVS DEVICE NUMBER CORRESPONDING  34950001
                                       TO THE OPTICAL LIBRARY        */ 35000000
       3 CBRSMF_PFX%%ST68ODN CHAR(8), /* OPTICAL DRIVE NAME          */ 35050001
       3 CBRSMF_PFX%%ST68ODDT CHAR(8), /* OPTICAL DRIVE DEVICE TYPE  */ 35100001
  3 CBRSMF_PFX%%ST68ODDN CHAR(4),   /* MVS DEVICE NUMBER CORRESPONDING  35150001
                                       TO THE OPTICAL DRIVE.         */ 35200000
  3 CBRSMF_PFX%%ST68VSN0 CHAR(6),   /* OPTICAL VOLUME SERIAL NUMBER  */ 35250001
       3 CBRSMF_PFX%%ST68VSN1 CHAR(6), /* OPPOSITE SIDE OF              35300001
                                       VOLSER IN FIELD ST68VSN0      */ 35350000
       3 CBRSMF_PFX%%ST68OMT CHAR(2), /* OPTICAL MEDIA TYPE          */ 35400001
       3 CBRSMF_PFX%%ST68ODT CHAR(1), /* OPTICAL DRIVE TYPE. L=LIBRARY  35450001
                                       RESIDENT, S=STANDALONE.       */ 35500000
       3 CBRSMF_PFX%%ST68OVT CHAR(1), /* OPTICAL VOLUME TYPE.           35550001
                                       G = OBJECT STORAGE GROUP,        35600000
                                       B = OBJECT BACKUP STOR GROUP,    35650000
                                       S = SCRATCH OPTICAL VOLUME.   */ 35700000
       3 CBRSMF_PFX%%ST68SGN CHAR(8), /* STORAGE GROUP NAME.         */ 35750001
  3 CBRSMF_PFX%%ST68LIQT FIXED(32), /* AMOUNT OF TIME (IN MILLISECONDS) 35800001
                                       THIS REQUEST SPENT ON THE LCS    35850000
                                       INPUT-WORK-QUEUE WAITING TO      35900000
                                       PROCESSED.                    */ 35950000
  3 CBRSMF_PFX%%ST68LDQT FIXED(32), /* AMOUNT OF TIME (IN MILLISECONDS) 36000001
                                       THIS REQUEST SPENT ON THE LCS    36050000
                                       DISPATCHER-QUEUE WAITING TO      36100000
                                       PROCESSED.                    */ 36150000
  3 CBRSMF_PFX%%ST68LEQT FIXED(32), /* AMOUNT OF TIME (IN MILLISECONDS) 36200001
                                       THIS REQUEST SPENT ON THE LCS    36250000
                                       EXECUTION-QUEUE BEING            36300000
                                       PROCESSED.                    */ 36350000
       3 CBRSMF_PFX%%ST68LTQT FIXED(32), /* LIBRARY TASK QUEUE TIME.    36400001
                                       AMOUNT OF TIME (IN MILLISECONDS) 36450000
                                       THIS REQUEST SPENT ON THE LCS    36500000
                                       LIBRARY TASK QUEUE (LQE QUEUE)   36550000
                                       WAITING TO BE PROCESSED.         36600000
                                       NORMALLY, THIS FIELD REPRESENTS  36650000
                                       CARTRIDGE TRANSPORT MECHANISM    36700000
                                       WAIT TIME.  THAT IS, THE AMOUNT  36750000
                                       OF TIME WAITING FOR THE CARTRIDGE36800000
                                       TRANSPORT MECHANISM (ROBOT) TO   36850000
                                       BECOME AVAILABLE WITHIN AN       36900000
                                       AUTOMATED STORAGE LIBRARY.    */ 36950000
  3 CBRSMF_PFX%%ST68LTPT FIXED(32), /* LIBRARY TASK PROCESSING TIME.    37000001
                                       AMOUNT OF TIME (IN MILLISECONDS) 37050000
                                       THIS REQUEST TOOK TO BE          37100000
                                       PROCESSED BY THE LIBRARY TASK.   37150000
                                       WAITING TO BE PROCESSED.         37200000
                                       NORMALLY, THIS FIELD REPRESENTS  37250000
                                       CARTRIDGES TRANSPORT MECHANISM   37300000
                                       SERVICE TIME.  THAT IS, THE      37350000
                                       TIM SPENT BY THE                 37400000
                                       CARTRIDGE TRANSPORT MECHANISM    37450000
                                       (ROBOT) TO MOVE CARTRIDGES WITHIN37500000
                                       THE OPTICAL DISK LIBRARY.     */ 37550000
       3 CBRSMF_PFX%%ST68RC FIXED(32), /* LCS RETURN CODE            */ 37600001
       3 CBRSMF_PFX%%ST68RS FIXED(32), /* LCS REASON CODE            */ 37650001
       3 CBRSMF_PFX%%ST68FLGS BIT(32), /* PROCESSING FLAGS, RESERVED. */37700001
         5 CBRSMF_PFX%%ST68FLG0 BIT(1), /* WHEN ON, THE VOLUME SERIAL   37701601
                                       NUMBER DESCRIBED BY FIELD        37703200
                                       ST68VSN0 REQUIRED FORMATTING AS  37704800
                                       PART OF OPTICAL CARTRIDGE ENTRY  37706400
                                       PROCESSING.                   */ 37708000
         5 CBRSMF_PFX%%ST68FLG1 BIT(1), /* WHEN ON, THE VOLUME SERIAL   37709601
                                       NUMBER DESCRIBED BY FIELD        37711200
                                       ST68VSN1 REQUIRED FORMATTING AS  37712800
                                       PART OF OPTICAL CARTRIDGE ENTRY  37714400
                                       PROCESSING.                   */ 37716000
         5 CBRSMF_PFX%%ST68FLG2 BIT(1), /* WHEN ON, THE VOLUME SERIAL   37717601
                                       NUMBER DESCRIBED BY FIELD        37719200
                                       ST68VSN0 WAS NOT KNOWN TO OAM    37720800
                                       AT THE TIME OF BEING ENTERED     37722400
                                       INTO THE OPTICAL LIBRARY, MEANING37724000
                                       THAT THERE WAS NOT A ROW FOR THIS37725600
                                       OPTICAL DISK VOLUME IN THE VOLUME37727200
                                       TABLE IN THE OPTICAL             37728800
                                       CONFIGURATION DATABASE (ODCB).*/ 37730400
         5 CBRSMF_PFX%%ST68FLG3 BIT(1), /* WHEN ON, THE VOLUME SERIAL   37732001
                                       NUMBER DESCRIBED BY FIELD        37733600
                                       ST68VSN1 WAS NOT KNOWN TO OAM    37735200
                                       AT THE TIME OF BEING ENTERED     37736800
                                       INTO THE OPTICAL LIBRARY, MEANING37738400
                                       THAT THERE WAS NOT ROW FOR THIS  37740000
                                       OPTICAL DISK VOLUME IN THE VOLUME37741600
                                       TABLE IN THE OPTICAL             37743200
                                       CONFIGURATION DATABASE (ODCB).*/ 37744800
         5 *         BIT(28),       /* RESERVED                      */ 37746400
  3 CBRSMF_PFX%%ST68TMNT FIXED(32), /* ELAPSED TIME (IN MILLISECONDS)   37773201
                                       THAT OPTICAL DISK VOLUME WAS     37800000
                                       MOUNTED.                         37850000
                                       ONLY VALID FOR SUBTYPE 73 AND    37900000
                                       SUBTYPE 69 (IN ONE SPECIAL       37950000
                                       CASE).                    @P5C*/ 38000000
  3 CBRSMF_PFX%%ST68NOW FIXED(32),  /* NUMBER OF OBJECT WRITTEN TO THIS 38050001
                                       OPTICAL DISK VOLUME WHILE IT     38100000
                                       WAS MOUNTED.                     38150000
                                       ONLY VALID FOR SUBTYPE 73 AND    38200000
                                       SUBTYPE 69 (IN ONE SPECIAL       38250000
                                       CASE).                        */ 38300000
  3 CBRSMF_PFX%%ST68NKBW FIXED(32), /* NUMBER OF KILOBYTES OF OBJECT    38350001
                                       DATA WRITTEN TO THIS OPTICAL     38400000
                                       DISK VOLUME WHILE IT WAS MOUNTED.38450000
                                       ONLY VALID FOR SUBTYPE 73 AND    38500000
                                       SUBTYPE 69 (IN ONE SPECIAL       38550000
                                       CASE).                        */ 38600000
  3 CBRSMF_PFX%%ST68NOR FIXED(32),  /* NUMBER OF OBJECT READ FROM THIS  38650001
                                       OPTICAL DISK VOLUME WHILE IT     38700000
                                       WAS MOUNTED.                     38750000
                                       ONLY VALID FOR SUBTYPE 73 AND    38800000
                                       SUBTYPE 69 (IN ONE SPECIAL       38850000
                                       CASE).                        */ 38900000
  3 CBRSMF_PFX%%ST68NKBR FIXED(32), /* NUMBER OF KILOBYTES OF OBJECT    38950001
                                       DATA READ FROM THIS OPTICAL      39000000
                                       DISK VOLUME WHILE IT WAS MOUNTED.39050000
                                       ONLY VALID FOR SUBTYPE 73 AND    39100000
                                       SUBTYPE 69 (IN ONE SPECIAL       39150000
                                       CASE).                        */ 39200000
       3 CBRSMF_PFX%%ST68NOD FIXED(32), /* NUMBER OF OBJECT DELETED FROM39250001
                                       THIS OPTICAL DISK VOLUME WHILE   39300000
                                       IT WAS MOUNTED.                  39350000
                                       ONLY VALID FOR SUBTYPE 73 AND    39400000
                                       SUBTYPE 69 (IN ONE SPECIAL       39450000
                                       CASE).                        */ 39500000
  3 CBRSMF_PFX%%ST68NKBD FIXED(32); /* NUMBER OF KILOBYTES OF OBJECT    39550001
                                       DATA DELETED FROM THIS OPTICAL   39600000
                                       DISK VOLUME WHILE IT WAS MOUNTED.39650000
                                       ONLY VALID FOR SUBTYPE 73 AND    39700000
                                       SUBTYPE 69 (IN ONE SPECIAL       39750000
                                       CASE).                    @P5C*/ 39787500
    /* SUBTYPE 69 (OPTICAL CARTRIDGE EJECT) FLAGS.                   */ 39825000
 %CBRSMF_DEF = 'DEFINED(ST68FLGS)';                           /* @PDA*/ 39826001
 %IF IBM_CBGENC = 'YES' %THEN %CBRSMF_DEF = 'BASED';          /* @PDA*/ 39827001
    DECLARE                         /*                               */ 39850000
      1 CBRSMF_PFX%%ST69FLGS BIT(32) CBRSMF_DEF, /* SUBTYPE 69 (OPTICAL 39853001
                                       CARTRIDGE EJECT) FLAGS        */ 39856000
    3 CBRSMF_PFX%%ST69FLG0 BIT(1),  /* WHEN ON, THIS OPTICAL CARTRIDGE  39859001
                                       WAS AUTOMATICALLY EJECTED BY     39862000
                                       THE SYSTEM DUE TO AN ERROR       39865000
                                       CONDITION AND THIS CONDITION     39868000
                                       IS KNOWN AS A "SYSTEM INITIATED  39871000
                                       EJECT" REQUEST.               */ 39874000
         3 *        BIT(31);        /* RESERVED                      */ 39877000
    /* SUBTYPE 70 (OPTICAL CARTRIDGE LABEL) FLAGS.                   */ 39880000
    DECLARE                         /*                               */ 39883000
      1 CBRSMF_PFX%%ST70FLGS BIT(32) CBRSMF_DEF, /* SUBTYPE 70 (OPTICAL 39886001
                                       CARTRIDGE LABEL) FLAGS        */ 39889000
         3 *        BIT(32);        /* RESERVED                      */ 39892000
    /* SUBTYPE 71 (OPTICAL VOLUME AUDIT) FLAGS.                      */ 39895000
    DECLARE                         /*                               */ 39898000
      1 CBRSMF_PFX%%ST71FLGS BIT(32) CBRSMF_DEF, /* SUBTYPE 71 (OPTICAL 39901001
                                       VOLUME AUDIT) FLAGS           */ 39904000
         3 *        BIT(32);        /* RESERVED                      */ 39907000
    /* SUBTYPE 72 (OPTICAL VOLUME MOUNT) FLAGS.                      */ 39910000
    DECLARE                         /*                               */ 39913000
      1 CBRSMF_PFX%%ST72FLGS BIT(32) CBRSMF_DEF, /* SUBTYPE 72 (OPTICAL 39916001
                                       VOLUME MOUNT) FLAGS           */ 39919000
         3 *        BIT(32);        /* RESERVED                      */ 39922000
    /* SUBTYPE 73 (OPTICAL VOLUME DEMOUNT) FLAGS                     */ 39925000
    DECLARE                         /*                               */ 39928000
      1 CBRSMF_PFX%%ST73FLGS BIT(32) CBRSMF_DEF, /* SUBTYPE 73 (OPTICAL 39931001
                                       VOLUME DEMOUNT) FLAGS         */ 39934000
         3 *        BIT(32);        /* RESERVED                      */ 39937000
    /* SUBTYPE 68-73 LENGTH CONSTANTS                                */ 39940000
    DECLARE                         /*                               */ 39943000
      CBRSMF_PF2%%ST68L                                                 39946001
               FIXED(31) CONSTANT(LENGTH(SMF85HDR)+LENGTH(SMF85PIS)+    39947001
                                 LENGTH(CBRSMF_PFX%%ST68)),             39950001
      CBRSMF_PF2%%ST69L                                                 40000001
               FIXED(31) CONSTANT(LENGTH(SMF85HDR)+LENGTH(SMF85PIS)+    40010001
                                 LENGTH(CBRSMF_PFX%%ST68)),             40050001
      CBRSMF_PF2%%ST70L                                                 40100001
               FIXED(31) CONSTANT(LENGTH(SMF85HDR)+LENGTH(SMF85PIS)+    40110001
                                 LENGTH(CBRSMF_PFX%%ST68)),             40150001
      CBRSMF_PF2%%ST71L                                                 40200001
               FIXED(31) CONSTANT(LENGTH(SMF85HDR)+LENGTH(SMF85PIS)+    40210001
                                 LENGTH(CBRSMF_PFX%%ST68)),             40250001
      CBRSMF_PF2%%ST72L                                                 40300001
               FIXED(31) CONSTANT(LENGTH(SMF85HDR)+LENGTH(SMF85PIS)+    40310001
                                 LENGTH(CBRSMF_PFX%%ST68)),             40350001
      CBRSMF_PF2%%ST73L                                                 40400001
               FIXED(31) CONSTANT(LENGTH(SMF85HDR)+LENGTH(SMF85PIS)+    40410001
                                 LENGTH(CBRSMF_PFX%%ST68));             40450001
   %END;                                                                40500000
 %IF IBM_CBGENC = 'YES' !                                     /* @PDC*/ 40510000
     SMF85S74 ^= '' !                                                   40550000
     SMF85S75 ^= '' !                                                   40600000
     SMF85S76 ^= '' !                                                   40650000
     SMF85S77 ^= '' %THEN                                               40700000
   %DO;                                                                 40750000
 @EJECT;                            /*                               */ 40800000
 /********************************************************************/ 40850000
 /*                                                                  */ 40900000
 /* OAM SUBTYPE SECTION, FOR SUBTYPES 74 - 77                        */ 40950000
 /*                                                                  */ 41000000
 /* SUBTYPE FUNCTION                                                 */ 41050000
 /* ------- ---------------------------------------------------      */ 41100000
 /*      74 LCS OPTICAL WRITE REQUEST                            @L1A*/ 41150000
 /*      75 LCS OPTICAL READ REQUEST                             @L1A*/ 41200000
 /*      76 LCS OPTICAL (LOGICAL) DELETE REQUEST                     */ 41250000
 /*      77 LCS OPTICAL (PHYSICAL) DELETE REQUEST                    */ 41300000
 /*                                                                  */ 41350000
 /********************************************************************/ 41400000
 %CBRSMF_DEF = 'DEFINED(R85PEND)';                            /* @PDA*/ 41410001
 %IF IBM_CBGENC = 'YES' %THEN %CBRSMF_DEF = 'BASED';          /* @PDA*/ 41420001
 DECLARE                            /*                               */ 41450000
     1 CBRSMF_PFX%%ST74 CBRSMF_DEF, /* SUBTYPES 74 - 77              */ 41500001
  3 CBRSMF_PFX%%ST74ORMN CHAR(16),  /* OAM REQUEST MEMBER NAME   @L1A*/ 41516601
       3 CBRSMF_PFX%%ST74OTMN CHAR(16), /* OAM TARGET MEMBER NAME @L1A*/41533201
       3 CBRSMF_PFX%%ST74OLN CHAR(8), /* OPTICAL LIBRARY NAME        */ 41550001
       3 CBRSMF_PFX%%ST74OLDT CHAR(8), /* OPTICAL LIBRARY DEVICE TYPE */41600001
  3 CBRSMF_PFX%%ST74OLDN CHAR(4),   /* MVS DEVICE NUMBER CORRESPONDING  41650001
                                       TO THE OPTICAL LIBRARY        */ 41700000
       3 CBRSMF_PFX%%ST74ODN CHAR(8), /* OPTICAL DRIVE NAME          */ 41750001
       3 CBRSMF_PFX%%ST74ODDT CHAR(8), /* OPTICAL DRIVE DEVICE TYPE  */ 41800001
  3 CBRSMF_PFX%%ST74ODDN CHAR(4),   /* MVS DEVICE NUMBER CORRESPONDING  41850001
                                       TO THE OPTICAL DRIVE.         */ 41900000
       3 CBRSMF_PFX%%ST74ODT CHAR(1), /* OPTICAL DRIVE TYPE. L=LIBRARY  42150001
                                       RESIDENT, S=STANDALONE.       */ 42200000
       3 CBRSMF_PFX%%ST74OVT CHAR(1), /* OPTICAL VOLUME TYPE.           42250001
                                       G = OBJECT STORAGE GROUP,        42300000
                                       B = OBJECT BACKUP STOR GROUP,    42350000
                                       S = SCRATCH OPTICAL VOLUME.   */ 42400000
       3 CBRSMF_PFX%%ST74SGN CHAR(8), /* STORAGE GROUP NAME.         */ 42450001
       3 CBRSMF_PFX%%ST74LIQT FIXED(32) BDY(BYTE), /* AMOUNT OF TIME (IN42489201
                                       MILLISECONDS) THIS REQUEST       42528400
                                       SPENT ON THE LCS                 42567600
                                       INPUT-WORK-QUEUE WAITING         42606800
                                       TO PROCESSED.  */                42646000
       3 CBRSMF_PFX%%ST74LDQT FIXED(32) BDY(BYTE), /* AMOUNT OF TIME (IN42685201
                                       MILLISECONDS) THIS REQUEST       42724400
                                       SPENT ON THE LCS                 42763600
                                       DISPATCHER-QUEUE WAITING         42802800
                                       TO PROCESSED.  */                42842000
       3 CBRSMF_PFX%%ST74LEQT FIXED(32) BDY(BYTE), /* AMOUNT OF TIME (IN42881201
                                       MILLISECONDS) THIS REQUEST       42920400
                                       SPENT ON THE LCS                 42959600
                                       EXECUTION-QUEUE BEING            43000000
                                       PROCESSED.  */                   43044800
       3 CBRSMF_PFX%%ST74LXQT FIXED(32) BDY(BYTE), /* AMOUNT OF TIME (IN43052201
                                       MILLISECONDS) THIS REQUEST       43059600
                                       SPENT ON THE XCF CROSS           43067000
                                       SYSTEM-QUEUE BEING               43074400
                                       PROCESSED.  @L1A*/               43081800
       3 CBRSMF_PFX%%ST74OVMT FIXED(32) BDY(BYTE), /*                   43089601
                                          OPTICAL VOLUME MOUNT TIME.    43089701
                                       THIS IS THE AMOUNT OF TIME       43134400
                                       (IN MILLISECONDS) THAT IT        43179200
                                       TOOK TO MOUNTED THE              43224000
                                       OPTICAL DISK VOLUME THAT         43268800
                                       WAS REQUIRED BY THIS             43313600
                                       REQUEST. THE FIELD IS ONLY       43358400
                                       VALID IF BIT 1, 2 OR 3 IN        43403200
                                       FIELD ST74FLSGS IS ON.           43448000
                                       THIS FIELD IS ONLY VALID         43492800
                                       FOR SUBTYPES 74, 75 AND          43537600
                                       77.                       @P5C*/ 43582400
  3 CBRSMF_PFX%%ST74OVDT FIXED(32) BDY(BYTE), /* OPTICAL VOLUME DEMOUNT 43627201
                                       TIME.  THIS IS THE AMOUNT        43672000
                                       OF TIME (IN MILLISECONDS)        43716800
                                       THAT IT TOOK TO DEMOUNT          43761600
                                       THE OPTICAL DISK VOLUME          43806400
                                       THAT CURRENTLY MOUNTED           43851200
                                       PRIOR TO MOUNTING THAT           43896000
                                       OPTICAL DISK VOLUME THAT         43940800
                                       WAS REQUIRED BY THE              43985600
                                       REQUEST. THE FIELD IS ONLY       44030400
                                       VALID IF BIT 3 IN FIELD          44075200
                                       ST74FLSGS IS ON.  THIS           44120000
                                       FIELD IS ONLY VALID FOR          44164800
                                       SUBTYPES 74, 75 AND 77.          44209600
                                                                 @P5C*/ 44254800
       3 CBRSMF_PFX%%ST74FLGS BIT(32), /* PROCESSING FLAGS, RESERVED. */44300001
         5 CBRSMF_PFX%%ST74FLG0 BIT(1), /* WHEN ON, THIS REQUEST WAS    44350001
                                       PROCESSED USING A CURRENTLY      44400000
                                       MOUNTED OPTICAL VOLUME AND DID   44450000
                                       NOT REQUIRE AN UNMOUNTED OPTICAL 44500000
                                       DISK VOLUME TO BE MOUNTED.       44550000
                                       ONLY VALID FOR SUBTYPES 74, 75   44600000
                                       AND 77.  NOT VALID FOR OTHER     44650000
                                       SUBTYPES.                 @P6C*/ 44700000
         5 CBRSMF_PFX%%ST74FLG1 BIT(1), /* WHEN ON, THIS REQUEST WAS    44750001
                                       PROCESSED USING THE OPPOSITE     44800000
                                       OF A CURRENTLY                   44850000
                                       MOUNTED OPTICAL VOLUME AND       44900000
                                       NOT REQUIRE AN UNMOUNTED OPTICAL 44950000
                                       DISK VOLUME.  THEREFORE, THE     45000000
                                       REQUEST REQUIRED THE OPTICAL DISK45050000
                                       VOLUME TO BE FLIPPED OVER TO     45100000
                                       ACCESS THE VOLUME ON THE         45150000
                                       OPPOSITE SIDE OF THE CURRENTLY   45200000
                                       MOUNTED VOLUME.                  45250000
                                       ONLY VALID FOR SUBTYPES 74, 75   45300000
                                       AND 77.  NOT VALID FOR OTHER     45350000
                                       SUBTYPES.                 @P6C*/ 45400000
         5 CBRSMF_PFX%%ST74FLG2 BIT(1), /*                              45450001
                                       WHEN ON, THIS REQUEST REQUIRED   45460001
                                       AN UNMOUNTED OPTICAL DISK VOLUME 45500000
                                       AND THE OPTICAL DISK DRIVE USED  45550000
                                       TO PROCESS THIS REQUEST WAS      45600000
                                       EMPTY AT THE START OF PROCESSING 45650000
                                       THIS REQUEST.  THEREFORE, THIS   45700000
                                       REQUEST DID NOT REQUIRE A        45750000
                                       CURRENTLY MOUNTED OPTICAL DISK   45800000
                                       VOLUME TO BE DEMOUNTED PRIOR     45850000
                                       TO MOUNTED THE REQUIRED OPTICAL  45900000
                                       DISK VOLUME.                     45950000
                                       ONLY VALID FOR SUBTYPES 74, 75   46000000
                                       AND 77.  NOT VALID FOR OTHER     46050000
                                       SUBTYPES.                     */ 46100000
         5 CBRSMF_PFX%%ST74FLG3 BIT(1), /*                              46150001
                                       WHEN ON, THIS REQUEST REQUIRED   46160001
                                       AN UNMOUNTED OPTICAL DISK VOLUME 46200000
                                       AND THE OPTICAL DISK DRIVE USED  46250000
                                       TO PROCESS THIS REQUEST WAS      46300000
                                       FULL AT THE START OF PROCESSING  46350000
                                       THIS REQUEST.  THEREFORE, THIS   46400000
                                       REQUEST REQUIRED A               46450000
                                       CURRENTLY MOUNTED OPTICAL DISK   46500000
                                       VOLUME TO BE DEMOUNTED PRIOR     46550000
                                       TO MOUNTING THE REQUIRED OPTICAL 46600000
                                       DISK VOLUME.                     46650000
                                       ONLY VALID FOR SUBTYPES 74, 75   46700000
                                       AND 77.  NOT VALID FOR OTHER     46750000
                                       SUBTYPES.                     */ 46800000
         5 *      BIT(28),          /* RESERVED                      */ 46850000
  3 CBRSMF_PFX%%ST74NOBJ FIXED(32) BDY(BYTE), /* TOTAL NUMBER OF OBJECTS46900001
                                       PROCESSED IN THIS REQUEST     */ 46950000
       3 CBRSMF_PFX%%ST74NKBP FIXED(32) BDY(BYTE), /*                   47000001
                                          NUMBER OF KILOBYTES OF OBJECT 47010001
                                       DATA IN THIS REQUEST          */ 47050000
  3 CBRSMF_PFX%%ST74SOBJ FIXED(32) BDY(BYTE), /* TOTAL NUMBER OF OBJECTS47100001
                                       IN THIS REQUEST PROCESSED        47150000
                                       SUCCESSFULLY.             @P5C*/ 47200000
       3 CBRSMF_PFX%%ST74SKBP FIXED(32) BDY(BYTE), /*                   47250001
                                          NUMBER OF KILOBYTES OF OBJECT 47260001
                                       DATA SUCCESSFULLY PROCESSED IN   47288000
                                       THIS REQUEST.             @P5C*/ 47326000
       3 *        CHAR(14),         /* RESERVED.                     */ 47364200
  3 CBRSMF_PFX%%ST74END CHAR(0);    /* END OF SUBTYPE 74 BASE SECTION*/ 47378401
 @EJECT;                            /*                               */ 47392600
    /* SUBTYPE 74,75,76 AND 77 OBJECT ARRAY SECTION                  */ 47406800
 %CBRSMF_DEF = 'DEFINED(ST74END)';                            /* @PDA*/ 47406901
 %IF IBM_CBGENC = 'YES' %THEN %CBRSMF_DEF = 'BASED';          /* @PDA*/ 47407001
    DECLARE                         /*                               */ 47421000
       1 CBRSMF_PFX%%ST74OBJD(*) CBRSMF_DEF, /* ARRAY OF OBJECTS IN THIS47435201
                                       REQUEST                       */ 47450000
          3 CBRSMF_PFX%%ST74COLN CHAR(44), /* COLLECTION NAME        */ 47500001
          3 CBRSMF_PFX%%ST74OBJN CHAR(44), /* OBJECT NAME            */ 47550001
     3 CBRSMF_PFX%%ST74OLEN FIXED(32) BDY(BYTE), /* OBJECT LENGTH  */   47600001
          3 CBRSMF_PFX%%ST74OOFF FIXED(32) BDY(BYTE), /*                47650001
                                               OBJECT OFFSET, ONLY VALID47660001
                                       ON SUBTYPE 75 FOR A PARTIAL      47700000
                                       OBJECT READ.                  */ 47744400
     3 CBRSMF_PFX%%ST74VSN CHAR(6), /* OPTICAL VOLUME SERIAL NUMBER  */ 47788801
          3 CBRSMF_PFX%%ST74OMT CHAR(2), /* OPTICAL MEDIA TYPE.      */ 47833201
          3 CBRSMF_PFX%%ST74OTKN FIXED(32) BDY(BYTE),/*                 47877601
                                             OBJECT LOCATION TOKEN   */ 47877701
     3 CBRSMF_PFX%%ST74RC FIXED(32) BDY(BYTE), /* LCS RETURN CODE    */ 47922001
     3 CBRSMF_PFX%%ST74RS FIXED(32) BDY(BYTE); /* LCS REASON CODE    */ 47966401
    DECLARE                         /*                               */ 48010800
      CBRSMF_PF2%%ST74L                                                 48055201
               FIXED(31) CONSTANT(LENGTH(SMF85HDR)+LENGTH(SMF85PIS)+    48055301
                                 LENGTH(CBRSMF_PFX%%ST74)),             48055401
      CBRSMF_PF2%%ST75L                                                 48150001
               FIXED(31) CONSTANT(LENGTH(SMF85HDR)+LENGTH(SMF85PIS)+    48160001
                                 LENGTH(CBRSMF_PFX%%ST74)),             48200001
      CBRSMF_PF2%%ST76L                                                 48250001
               FIXED(31) CONSTANT(LENGTH(SMF85HDR)+LENGTH(SMF85PIS)+    48260001
                                 LENGTH(CBRSMF_PFX%%ST74)),             48300001
      CBRSMF_PF2%%ST77L                                                 48350001
               FIXED(31) CONSTANT(LENGTH(SMF85HDR)+LENGTH(SMF85PIS)+    48360001
                                 LENGTH(CBRSMF_PFX%%ST74));             48400001
   %END;                                                                48450000
 %IF IBM_CBGENC = 'YES' !                                     /* @PDC*/ 48460000
     SMF85S78 ^= '' !                                                   48500000
     SMF85S79 ^= '' %THEN                                               48550000
   %DO;                                                                 48600000
 @EJECT;                            /*                               */ 48650000
 /********************************************************************/ 48700000
 /*                                                                  */ 48750000
 /* OAM SUBTYPE SECTION, FOR SUBTYPES 78 - 79 & 88               @P0C*/ 48800000
 /*                                                                  */ 48850000
 /* SUBTYPE FUNCTION                                                 */ 48900000
 /* ------- ---------------------------------------------------      */ 48950000
 /*      78 LCS TAPE WRITE REQUEST                                   */ 49000000
 /*      79 LCS TAPE READ REQUEST                                @L1A*/ 49037500
 /*      88 LCS TAPE LOGICAL DELETE REQUEST                      @P0A*/ 49075000
 /*                                                                  */ 49100000
 /********************************************************************/ 49150000
 %CBRSMF_DEF = 'DEFINED(R85PEND)';                            /* @PDA*/ 49160001
 %IF IBM_CBGENC = 'YES' %THEN %CBRSMF_DEF = 'BASED';          /* @PDA*/ 49170001
 DECLARE                            /*                               */ 49200000
     1 CBRSMF_PFX%%ST78 CBRSMF_DEF, /* SUBTYPES 78, 79 AND 88    @P0C*/ 49250001
  3 CBRSMF_PFX%%ST78ORMN CHAR(16),  /* OAM REQUEST MEMBER NAME   @L1A*/ 49266601
       3 CBRSMF_PFX%%ST78OTMN CHAR(16), /* OAM TARGET MEMBER NAME @L1A*/49283201
       3 CBRSMF_PFX%%ST78TDUN CHAR(8), /* TAPE DRIVE UNIT NAME       */ 49300001
  3 CBRSMF_PFX%%ST78TDDN CHAR(4),   /* MVS DEVICE NUMBER OF TAPE DRIV*/ 49350001
       3 CBRSMF_PFX%%ST78TVT CHAR(1), /* TAPE VOLUME TYPE.              49500001
                                       G = OBJECT STORAGE GROUP,        49550000
                                       B = OBJECT BACKUP STOR GROUP,    49600000
                                       S = SCRATCH OPTICAL VOLUME.   */ 49650000
       3 *        CHAR(3),          /* RESERVED                      */ 49700000
       3 CBRSMF_PFX%%ST78SGN CHAR(8), /* STORAGE GROUP NAME.         */ 49750001
       3 CBRSMF_PFX%%ST78LIQT FIXED(32), /* LCS INPUT-WORK-QUEUE TIME.  49783301
                                       AMOUNT OF TIME (IN MILLISECONDS) 49816600
                                       THIS REQUEST SPENT ON THE LCS    49850000
                                       INPUT-WORK-QUEUE WAITING TO      49900000
                                       PROCESSED.                    */ 49950000
       3 CBRSMF_PFX%%ST78LDQT FIXED(32), /* LCS DISPATCHER-QUEUE TIME.  49983301
                                       AMOUNT OF TIME (IN MILLISECONDS) 50016600
                                       THIS REQUEST SPENT ON THE LCS    50050000
                                       DISPATCHER-QUEUE WAITING TO      50100000
                                       PROCESSED.                    */ 50150000
       3 CBRSMF_PFX%%ST78LEQT FIXED(32), /* LCS EXECUTION-QUEUE TIME.   50183301
                                       AMOUNT OF TIME (IN MILLISECONDS) 50216600
                                       THIS REQUEST SPENT ON THE LCS    50250000
                                       EXECUTION-QUEUE BEING            50300000
                                       PROCESSED.                    */ 50350000
       3 CBRSMF_PFX%%ST78LXQT FIXED(32), /* XCF CROSS SYSTEM-QUEUE TIME.50358301
                                       AMOUNT OF TIME (IN MILLISECONDS) 50366600
                                       THIS REQUEST SPENT ON THE XCF    50374900
                                       CROSS SYSTEM-QUEUE BEING         50383200
                                       PROCESSED.                @L1A*/ 50391500
  3 CBRSMF_PFX%%ST78LMAT FIXED(32), /* MVS DYNAMIC ALLOCATION (SVC 99)  50400001
                                       TIME.  THIS IS THE AMOUNT OF     50450000
                                       TIME (IN MILLISECONDS) THAT WAS  50500000
                                       REQUIRED BY MVS DYNAMIC          50550000
                                       ALLOCATION TO DYNAMICALLY        50600000
                                       ALLOCATE THE TAPE DRIVE.  THIS   50650000
                                       FIELD IS ONLY VALID IF BIT 1 IN  50700000
                                       FIELD ST78FLGS IS ON.         */ 50705500
  3 CBRSMF_PFX%%ST78LMDT FIXED(32), /* MVS DYNAMIC DEALLOCATION (SVC 99)50711001
                                       TIME.  THIS IS THE AMOUNT OF     50716500
                                       TIME (IN MILLISECONDS) THAT WAS  50722000
                                       REQUIRED BY MVS DYNAMIC          50727500
                                       DEALOCATION TO DYNAMICALLY       50733000
                                       DEALLOCATE THE TAPE DRIVE.  THIS 50738500
                                       FIELD IS ONLY VALID IF BIT 2 IN  50744000
                                       FIELD ST78FLGS IS ON.         */ 50750000
       3 CBRSMF_PFX%%ST78LDCT FIXED(32), /* DFSMS CLOSE TIME.           50800001
                                       THIS IS THE AMOUNT OF            50850000
                                       TIME (IN MILLISECONDS) THAT WAS  50900000
                                       REQUIRED BY DFSMS TO CLOSE AN    50950000
                                       ALREADY-OPENED TAPE DATA SET.    51000000
                                       THIS FIELD IS ONLY VALID IF BIT 251050000
                                       IN FIELD ST78FLGS IS ON.         51100000
                                       */                               51150000
       3 CBRSMF_PFX%%ST78LDOT FIXED(32), /* DFSMS OPEN TIME.            51200001
                                       THIS IS THE AMOUNT OF            51250000
                                       TIME (IN MILLISECONDS) THAT WAS  51300000
                                       REQUIRED BY DFSMS OPEN PROCESSING51350000
                                       TO OPEN THE TAPE DATA SET.       51400000
                                       THIS FIELD IS ONLY VALID IF BIT 151450000
                                       OR BIT 2 IN FIELD ST78FLGS IS ON.51500000
                                                                     */ 51550000
       3 CBRSMF_PFX%%ST78LDPT FIXED(32), /* DFSMS POINT TIME. THIS IS   51600001
                                       THE AMOUNT OF TIME (IN           51650000
                                       MILLISECONDS) THAT WAS           51700000
                                       REQUIRED BY DFSMS POINT          51750000
                                       PROCESSING TO POSITION TO THE    51800000
                                       CORRECT BLOCK-ID ON THE MEDIA.   51850000
                                       THIS FIELD                       51900000
                                       IS ONLY VALID IF BIT 1 OR        51950000
                                       BIT 2 IN FIELD ST78FLGS IS       52000000
                                       ON.                           */ 52007500
       3 CBRSMF_PFX%%ST78LBRT FIXED(32), /* BSAM READ TIME. THIS IS     52015001
                                       THE AMOUNT OF TIME (IN           52022500
                                       MILLISECONDS) THAT LCS SPENT     52030000
                                       IN BSAM READ PROCESSING READING  52037500
                                       DATA FROM THE TAPE VOLUME.  ONLY 52045000
                                       VALID FOR SUBTYPE 79.         */ 52052500
       3 CBRSMF_PFX%%ST78LBWT FIXED(32), /* BSAM WRITE TIME. THIS IS    52060001
                                       THE AMOUNT OF TIME (IN           52067500
                                       MILLISECONDS) THAT LCS SPENT     52075000
                                       IN BSAM WRITE PROCESSING WRITING 52082500
                                       DATA TO THE TAPE VOLUME.  ONLY   52090000
                                       VALID FOR SUBTYPE 78.         */ 52097500
       3 CBRSMF_PFX%%ST78LBCT FIXED(32), /* BSAM CHECK TIME. THIS IS    52105001
                                       THE AMOUNT OF TIME (IN           52112500
                                       MILLISECONDS) THAT LCS SPENT     52120000
                                       IN BSAM CHECK PROCESSING WAITING 52127500
                                       FOR I/O OPERATIONS TO COMPLETED. 52135000
                                       VALID FOR SUBTYPES 78 AND 79. */ 52142500
       3 CBRSMF_PFX%%ST78FLGS BIT(32), /* PROCESSING FLAGS, RESERVED. */52150001
         5 CBRSMF_PFX%%ST78FLG0 BIT(1), /* WHEN ON, THIS REQUEST WAS    52200001
                                       PROCESSED USING A CURRENTLY      52250000
                                       MOUNTED TAPE VOLUME AND DID      52300000
                                       NOT REQUIRE AN UNMOUNTED TAPE    52350000
                                       VOLUME TO BE MOUNTED.        */  52400000
         5 CBRSMF_PFX%%ST78FLG1 BIT(1), /*                              52450001
                                       WHEN ON, THIS REQUEST REQUIRED   52460001
                                       AN UNMOUNTED TAPE VOLUME         52500000
                                       AND THE TAPE DRIVE USED          52550000
                                       TO PROCESS THIS REQUEST WAS      52600000
                                       EMPTY AT THE START OF PROCESSING 52650000
                                       THIS REQUEST.  THEREFORE, THIS   52700000
                                       REQUEST DID NOT REQUIRE A        52750000
                                       CURRENTLY MOUNTED TAPE           52800000
                                       VOLUME TO BE DEMOUNTED PRIOR     52850000
                                       TO MOUNTING THE REQUIRED TAPE    52900000
                                       VOLUME.                   @P6C*/ 52950000
         5 CBRSMF_PFX%%ST78FLG2 BIT(1), /*                              53000001
                                       WHEN ON, THIS REQUEST REQUIRED AN53010001
                                       UNMOUNTED TAPE VOLUME TO BE      53050000
                                       MOUNTED AND THE TAPE DRIVE TASK  53100000
                                       USED TO PROCESS THIS REQUEST     53150000
                                       ALREADY HAD A TAPE DRIVE         53200000
                                       ALLOCATED AND A DIFFERENT TAPE   53250000
                                       VOLUME MOUNTED.  THEREFORE, THIS 53300000
                                       REQUEST REQUIRED A CURRENTLY     53350000
                                       MOUNTED TAPE VOLUME TO BE        53400000
                                       DEMOUNTED PRIOR TO MOUNTING THE  53450000
                                       REQUIRED TAPE VOLUME.  */        53500000
         5 CBRSMF_PFX%%ST78FLG3 BIT(1), /* THIS REQUEST WAS PROCESSED   53550001
                                       USING A TAPE DRIVE INSIDE AN     53600000
                                       IBM AUTOMATED TAPE LIBRARY       53650000
                                       DATASERVER.                   */ 53700000
         5 CBRSMF_PFX%%ST78FLG4 BIT(1), /* THIS REQUEST WAS PROCESSED   53712501
                                       USING A SUBLEVEL1 TAPE           53725000
                                       VOLUME.                   @L6A*/ 53737500
         5 CBRSMF_PFX%%ST78FLG5 BIT(1), /* THIS REQUEST WAS PROCESSED   53750001
                                       USING A SUBLEVEL2 TAPE           53762500
                                       VOLUME.                   @L6A*/ 53775000
         5 *        BIT(26),        /* RESERVED                  @L6C*/ 53787500
       3 CBRSMF_PFX%%ST78NOBJ FIXED(32), /* TOTAL NUMBER OF OBJECTS     53800001
                                       PROCESSED IN THIS REQUEST     */ 53850000
  3 CBRSMF_PFX%%ST78NKBP FIXED(32), /* NUMBER OF KILOBYTES OF OBJECT    53900001
                                       DATA IN THIS REQUEST          */ 53950000
       3 CBRSMF_PFX%%ST78SOBJ FIXED(32), /* TOTAL NUMBER OF OBJECTS     54000001
                                       IN THIS REQUEST PROCESSED        54050000
                                       SUCCESSFULLY.             @P5C*/ 54100000
  3 CBRSMF_PFX%%ST78SKBP FIXED(32), /* NUMBER OF KILOBYTES OF OBJECT    54150001
                                       DATA SUCCESSFULLY                54188000
                                       PROCESSED IN THIS REQUEST @P5C*/ 54226000
       3 *        CHAR(16),         /* RESERVED.                     */ 54264200
  3 CBRSMF_PFX%%ST78END CHAR(0);    /* END OF SUBTYPE 78 BASE SECTION*/ 54278401
 @EJECT;                            /*                               */ 54292600
    /* SUBTYPE 78,79 & 88 OBJECT ARRAY SECTION                   @P0C*/ 54306800
 %CBRSMF_DEF = 'DEFINED(ST78END)';                            /* @PDA*/ 54306901
 %IF IBM_CBGENC = 'YES' %THEN %CBRSMF_DEF = 'BASED';          /* @PDA*/ 54307001
    DECLARE                         /*                               */ 54321000
       1 CBRSMF_PFX%%ST78OBJD(*) CBRSMF_DEF, /* ARRAY OF OBJECTS IN THIS54335201
                                       REQUEST                       */ 54350000
          3 CBRSMF_PFX%%ST78COLN CHAR(44), /* COLLECTION NAME        */ 54400001
          3 CBRSMF_PFX%%ST78OBJN CHAR(44), /* OBJECT NAME            */ 54450001
     3 CBRSMF_PFX%%ST78OLEN FIXED(32) BDY(BYTE), /* OBJECT LENGTH  */   54500001
          3 CBRSMF_PFX%%ST78OOFF FIXED(32) BDY(BYTE), /*                54550001
                                               OBJECT OFFSET, ONLY VALID54560001
                                       ON SUBTYPE 79 FOR A              54600000
                                       PARTIAL OBJECT READ.             54650000
                                       */                               54700000
     3 CBRSMF_PFX%%ST78VSN CHAR(6), /* OPTICAL VOLUME SERIAL NUMBER  */ 54725001
          3 CBRSMF_PFX%%ST78TMT CHAR(2), /* TAPE MEDIA TYPE.            54750001
                                       02 = IBM 3490 STANDARD CAPACITY  54775000
                                            CARTRIDGE SYSTEM TAPE.      54800000
                                       04 = IBM 3490 ENHANCED CAPACITY  54825000
                                            CARTRIDGE SYSTEM TAPE.      54850000
                                       05 = IBM 3590 HIGH PERFORMANCE   54875000
                                            CARTRIDGE TAPE.          */ 54900000
          3 CBRSMF_PFX%%ST78OTKN FIXED(32) BDY(BYTE), /*                54925001
                                              OBJECT LOCATION TOKEN */  54926001
     3 CBRSMF_PFX%%ST78RC FIXED(32) BDY(BYTE), /* LCS RETURN CODE */    54950001
     3 CBRSMF_PFX%%ST78RS FIXED(32) BDY(BYTE); /* LCS REASON CODE  */   54975001
    DECLARE                         /*                               */ 55000000
      CBRSMF_PF2%%ST78L                                                 55025001
               FIXED(31) CONSTANT(LENGTH(SMF85HDR)+LENGTH(SMF85PIS)+    55026001
                                 LENGTH(CBRSMF_PFX%%ST78)),             55050001
      CBRSMF_PF2%%ST79L                                                 55100001
               FIXED(31) CONSTANT(LENGTH(SMF85HDR)+LENGTH(SMF85PIS)+    55110001
                                 LENGTH(CBRSMF_PFX%%ST78)),    /*@P0C*/ 55125001
      CBRSMF_PF2%%ST88L                                                 55150001
               FIXED(31) CONSTANT(LENGTH(SMF85HDR)+LENGTH(SMF85PIS)+    55160001
                                 LENGTH(CBRSMF_PFX%%ST78));    /*@P0A*/ 55175001
   %END;                                                                55200000
 %IF IBM_CBGENC = 'YES' !                                     /* @PDC*/ 55210000
     SMF85S80 ^= '' !                                                   55250000
     SMF85S81 ^= '' %THEN                                               55300000
   %DO;                                                                 55350000
 @EJECT;                            /*                               */ 55400000
 /********************************************************************/ 55450000
 /*                                                                  */ 55500000
 /* OAM SUBTYPE SECTION, FOR SUBTYPES 80 - 81                        */ 55550000
 /*                                                                  */ 55600000
 /* SUBTYPE FUNCTION                                                 */ 55650000
 /* ------- ---------------------------------------------------      */ 55700000
 /*      80 LCS TAPE LIBRARY VARY ONLINE                             */ 55750000
 /*      81 LCS TAPE LIBRARY VARY OFFLINE                            */ 55800000
 /*                                                                  */ 55850000
 /********************************************************************/ 55900000
 %CBRSMF_DEF = 'DEFINED(R85PEND)';                            /* @PDA*/ 55910001
 %IF IBM_CBGENC = 'YES' %THEN %CBRSMF_DEF = 'BASED';          /* @PDA*/ 55920001
 DECLARE                            /*                               */ 55950000
     1 CBRSMF_PFX%%ST80 CBRSMF_DEF, /* SUBTYPES 80 AND 81            */ 56000001
       3 CBRSMF_PFX%%ST80TLN CHAR(8), /* TAPE LIBRARY NAME           */ 56050001
       3 CBRSMF_PFX%%ST80TLDT CHAR(8), /* TAPE LIBRARY DEVICE TYPE   */ 56100001
       3 CBRSMF_PFX%%ST80LTQT FIXED(32), /* LCS LIBRARY TASK QUEUE TIME.56150001
                                       THE AMOUNT OF TIME (IN           56200000
                                       MILLISECONDS) THAT THIS REQUEST  56250000
                                       SPENT ON THE LCS LIBRARY QUEUE   56300000
                                       (LQE QUEUE) WAITING TO BE        56350000
                                       PROCESSED.                    */ 56400000
  3 CBRSMF_PFX%%ST80LTPT FIXED(32), /* LCS LIBRARY TASK PROCESSING TIME.56450001
                                       THE AMOUNT OF TIME (IN           56500000
                                       MILLISECONDS) THAT THIS REQUEST  56550000
                                       TOOK TO BE PROCESSED BY THE      56600000
                                       LIBRARY TASK.                 */ 56650000
       3 CBRSMF_PFX%%ST80RC FIXED(32), /* LCS RETURN CODE            */ 56700001
       3 CBRSMF_PFX%%ST80RS FIXED(32), /* LCS REASON CODE            */ 56750001
       3 CBRSMF_PFX%%ST80FLGS BIT(32); /* PROCESSING FLAGS, RESERVED. */56800001
    DECLARE                         /*                               */ 56850000
      CBRSMF_PF2%%ST80L                                                 56900001
               FIXED(31) CONSTANT(LENGTH(SMF85HDR)+LENGTH(SMF85PIS)+    56910001
                                 LENGTH(CBRSMF_PFX%%ST80)),             56950001
      CBRSMF_PF2%%ST81L                                                 57000001
               FIXED(31) CONSTANT(LENGTH(SMF85HDR)+LENGTH(SMF85PIS)+    57010001
                                 LENGTH(CBRSMF_PFX%%ST80));             57050001
   %END;                                                                57100000
 %IF IBM_CBGENC = 'YES' !                                     /* @PDC*/ 57110000
     SMF85S82 ^= '' !                                                   57150000
     SMF85S83 ^= '' !                                                   57200000
     SMF85S84 ^= '' !                                                   57250000
     SMF85S85 ^= '' !                                                   57300000
     SMF85S86 ^= '' %THEN                                               57350000
   %DO;                                                                 57400000
 @EJECT;                            /*                               */ 57450000
 /********************************************************************/ 57500000
 /*                                                                  */ 57550000
 /* OAM SUBTYPE SECTION, FOR SUBTYPES 82 - 86                        */ 57600000
 /*                                                                  */ 57650000
 /* SUBTYPE FUNCTION                                                 */ 57700000
 /* ------- ---------------------------------------------------      */ 57750000
 /*      82 LCS TAPE LIBRARY VOLUME ENTRY                            */ 57800000
 /*      83 LCS TAPE LIBRARY VOLUME EJECT                            */ 57850000
 /*      84 LCS TAPE LIBRARY VOLUME AUDIT                            */ 57900000
 /*      85 LCS TAPE LIBRARY VOLUME MOUNT                            */ 57950000
 /*      86 LCS TAPE LIBRARY VOLUME DEMOUNT                          */ 58000000
 /*                                                                  */ 58050000
 /********************************************************************/ 58100000
 %CBRSMF_DEF = 'DEFINED(R85PEND)';                            /* @PDA*/ 58110001
 %IF IBM_CBGENC = 'YES' %THEN %CBRSMF_DEF = 'BASED';          /* @PDA*/ 58120001
 DECLARE                            /*                               */ 58150000
     1 CBRSMF_PFX%%ST82 CBRSMF_DEF, /* SUBTYPES 82 - 86              */ 58200001
       3 CBRSMF_PFX%%ST82TLN CHAR(8), /* TAPE LIBRARY NAME           */ 58250001
       3 CBRSMF_PFX%%ST82TLDT CHAR(8), /* TAPE LIBRARY DEVICE TYPE   */ 58300001
       3 CBRSMF_PFX%%ST82TDDT CHAR(4), /* TAPE DRIVE UCB DEVICE TYPE.   58350001
                                       VALID FOR SUBTYPES 85 AND 86,    58400000
                                       CONTAINS ZEROS FOR OTHERS.    */ 58450000
  3 CBRSMF_PFX%%ST82TDDN CHAR(4),   /* MVS DEVICE NUMBER CORRESPONDING  58500001
                                       TO TAPE DRIVE.                   58550000
                                       VALID FOR SUBTYPES 85 AND 86,    58600000
                                       CONTAINS ZEROS FOR OTHERS.    */ 58650000
       3 CBRSMF_PFX%%ST82VSN CHAR(6), /* TAPE VOLUME SERIAL NUMBER   */ 58700001
       3 CBRSMF_PFX%%ST82TMT CHAR(2), /* TAPE MEDIA TYPE                58712501
                                       02 = IBM 3490 STANDARD CAPACITY  58725000
                                            CARTRIDGE SYSTEM TAPE.      58737500
                                       04 = IBM 3490 ENHANCED CAPACITY  58750000
                                            CARTRIDGE SYSTEM TAPE.      58762500
                                       05 = IBM 3590 HIGH PERFORMANCE   58775000
                                            CARTRIDGE TAPE.          */ 58787500
  3 CBRSMF_PFX%%ST82LIQT FIXED(32), /* AMOUNT OF TIME (IN MILLISECONDS) 58800001
                                       THIS REQUEST SPENT ON THE LCS    58850000
                                       INPUT-WORK-QUEUE WAITING TO      58900000
                                       PROCESSED.                    */ 58950000
  3 CBRSMF_PFX%%ST82LDQT FIXED(32), /* AMOUNT OF TIME (IN MILLISECONDS) 59000001
                                       THIS REQUEST SPENT ON THE LCS    59050000
                                       DISPATCHER-QUEUE WAITING TO      59100000
                                       PROCESSED.                    */ 59150000
       3 CBRSMF_PFX%%ST82LTQT FIXED(32), /* LIBRARY TASK QUEUE TIME.    59200001
                                       AMOUNT OF TIME (IN MILLISECONDS) 59250000
                                       THIS REQUEST SPENT ON THE LCS    59300000
                                       LIBRARY TASK QUEUE (LQE QUEUE)   59350000
                                       WAITING TO BE PROCESSED.         59400000
                                       NORMALLY, THIS FIELD REPRESENTS  59450000
                                       CARTRIDGE TRANSPORT MECHANISM    59500000
                                       WAIT TIME.  THAT IS, THE AMOUNT  59550000
                                       OF TIME WAITING FOR THE CARTRIDGE59600000
                                       TRANSPORT MECHANISM (ROBOT) TO   59650000
                                       BECOME AVAILABLE WITHIN AN       59700000
                                       AUTOMATED STORAGE LIBRARY.    */ 59750000
  3 CBRSMF_PFX%%ST82LTPT FIXED(32), /* LIBRARY TASK PROCESSING TIME.    59800001
                                       AMOUNT OF TIME (IN MILLISECONDS) 59850000
                                       THIS REQUEST TOOK TO BE          59900000
                                       PROCESSED BY THE LIBRARY TASK.   59950000
                                       WAITING TO BE PROCESSED.         60000000
                                       NORMALLY, THIS FIELD REPRESENTS  60050000
                                       CARTRIDGES TRANSPORT MECHANISM   60100000
                                       SERVICE TIME.  THAT IS, THE      60150000
                                       TIM SPENT BY THE                 60200000
                                       CARTRIDGE TRANSPORT MECHANISM    60250000
                                       (ROBOT) TO MOVE CARTRIDGES WITHIN60300000
                                       THE OPTICAL DISK LIBRARY.     */ 60350000
       3 CBRSMF_PFX%%ST82RC FIXED(32), /* LCS RETURN CODE            */ 60400001
       3 CBRSMF_PFX%%ST82RS FIXED(32), /* LCS REASON CODE            */ 60450001
       3 CBRSMF_PFX%%ST82FLGS BIT(32); /* PROCESSING FLAGS, RESERVED. */60500001
    DECLARE                         /*                               */ 60550000
      CBRSMF_PF2%%ST82L                                                 60600001
               FIXED(31) CONSTANT(LENGTH(SMF85HDR)+LENGTH(SMF85PIS)+    60610001
                                 LENGTH(CBRSMF_PFX%%ST82)),             60650001
      CBRSMF_PF2%%ST83L                                                 60700001
               FIXED(31) CONSTANT(LENGTH(SMF85HDR)+LENGTH(SMF85PIS)+    60710001
                                 LENGTH(CBRSMF_PFX%%ST82)),             60750001
      CBRSMF_PF2%%ST84L                                                 60800001
               FIXED(31) CONSTANT(LENGTH(SMF85HDR)+LENGTH(SMF85PIS)+    60810001
                                 LENGTH(CBRSMF_PFX%%ST82)),             60850001
      CBRSMF_PF2%%ST85L                                                 60900001
               FIXED(31) CONSTANT(LENGTH(SMF85HDR)+LENGTH(SMF85PIS)+    60910001
                                 LENGTH(CBRSMF_PFX%%ST82)),             60950001
      CBRSMF_PF2%%ST86L                                                 61000001
               FIXED(31) CONSTANT(LENGTH(SMF85HDR)+LENGTH(SMF85PIS)+    61010001
                                 LENGTH(CBRSMF_PFX%%ST82));             61050001
   %END;                                                                61100000
 %IF IBM_CBGENC = 'YES' !                                     /* @PDC*/ 61110000
     SMF85S87 ^= '' %THEN                                               61150000
   %DO;                                                                 61200000
 @EJECT;                            /*                               */ 61250000
 /********************************************************************/ 61300000
 /*                                                                  */ 61350000
 /* OAM SUBTYPE SECTION, FOR SUBTYPE 87                              */ 61400000
 /*                                                                  */ 61450000
 /* SUBTYPE FUNCTION                                                 */ 61500000
 /* ------- ---------------------------------------------------      */ 61550000
 /*      87 OAM OWNED TAPE VOLUME DEMOUNT                            */ 61600000
 /*                                                                  */ 61650000
 /********************************************************************/ 61700000
 %CBRSMF_DEF = 'DEFINED(R85PEND)';                            /* @PDA*/ 61710001
 %IF IBM_CBGENC = 'YES' %THEN %CBRSMF_DEF = 'BASED';          /* @PDA*/ 61720001
 DECLARE                            /*                               */ 61750000
     1 CBRSMF_PFX%%ST87 CBRSMF_DEF, /* SUBTYPE 87                    */ 61800001
  3 CBRSMF_PFX%%ST87TDDN CHAR(4),   /* MVS DEVICE NUMBER CORRESPONDING  61850001
                                       TO TAPE DRIVE.                */ 61900000
       3 CBRSMF_PFX%%ST87TDDT CHAR(4), /* TAPE DRIVE UCB DEVICE TYPE */ 61950001
       3 CBRSMF_PFX%%ST87TVUN CHAR(8), /* TAPE VOLUME UNIT NAME      */ 62000001
       3 CBRSMF_PFX%%ST87VSN CHAR(6), /* TAPE VOLUME SERIAL NUMBER   */ 62050001
       3 CBRSMF_PFX%%ST87TMT CHAR(2), /* TAPE MEDIA TYPE                62062501
                                       02 = IBM 3490 STANDARD CAPACITY  62075000
                                            CARTRIDGE SYSTEM TAPE.      62087500
                                       04 = IBM 3490 ENHANCED CAPACITY  62100000
                                            CARTRIDGE SYSTEM TAPE.      62112500
                                       05 = IBM 3590 HIGH PERFORMANCE   62125000
                                            CARTRIDGE TAPE.          */ 62137500
       3 CBRSMF_PFX%%ST87TVT CHAR(1), /* TAPE VOLUME TYPE.              62150001
                                       G = TAPE VOLUME IS A GROUPED     62200000
                                       VOLUME BELONGING TO AN OBJECT    62250000
                                       STORAGE GROUP.                   62300000
                                       B = TAPE VOLUME IS A GROUPED     62350000
                                       VOLUME BELONGING TO AN OBJECT    62400000
                                       BACKUP STORAGE GROUP.         */ 62450000
       3 *        CHAR(3),          /* RESERVED.                     */ 62500000
       3 CBRSMF_PFX%%ST87SGN CHAR(8), /* STORAGE GROUP NAME.         */ 62550001
       3 CBRSMF_PFX%%ST87RC FIXED(32), /* LCS RETURN CODE            */ 62600001
       3 CBRSMF_PFX%%ST87RS FIXED(32), /* LCS REASON CODE            */ 62650001
       3 CBRSMF_PFX%%ST87FLGS BIT(32), /* PROCESSING FLAGS.          */ 62678101
         5 CBRSMF_PFX%%ST87FLG0 BIT(1), /* THIS REQUEST PROCESSED USING 62706201
                                       A VOLUME ASSOCIATED WITH         62712400
                                       SUBLEVEL1.                L6A*/  62718600
         5 CBRSMF_PFX%%ST87FLG1 BIT(1), /* THIS REQUEST PROCESSED USING 62724801
                                       A VOLUME ASSOCIATED WITH         62731000
                                       SUBLEVEL2.                L6A*/  62737200
         5 *        BIT(30),        /* RESERVED                  L6A*/  62743400
  3 CBRSMF_PFX%%ST87TMNT FIXED(32), /* ELAPSED TIME (IN MILLISECONDS)   62771701
                                       THAT TAPE VOLUME WAS MOUNTED,    62800000
                                       MEASURED FROM COMPLETION OF THE  62850000
                                       DFSMS OPEN MACRO TO COMPLETION   62900000
                                       OF THE DFSMS CLOSE MACRO. @P5C*/ 62950000
  3 CBRSMF_PFX%%ST87NOW FIXED(32),  /* NUMBER OF OBJECT WRITTEN TO THIS 63000001
                                       TAPE VOLUME WHILE IT             63050000
                                       WAS MOUNTED.                  */ 63100000
  3 CBRSMF_PFX%%ST87NKBW FIXED(32), /* NUMBER OF KILOBYTES OF OBJECT    63150001
                                       DATA WRITTEN TO THIS TAPE        63200000
                                       VOLUME WHILE IT WAS MOUNTED.     63225000
                                       SUPERSEDED BY ST87NBW.           63250000
                                       SEE NOTE 1.               @LAC*/ 63275000
  3 CBRSMF_PFX%%ST87NOR FIXED(32),  /* NUMBER OF OBJECT READ FROM THIS  63300001
                                       TAPE VOLUME WHILE IT             63350000
                                       WAS MOUNTED.                  */ 63400000
  3 CBRSMF_PFX%%ST87NKBR FIXED(32), /* NUMBER OF KILOBYTES OF OBJECT    63450001
                                       DATA READ FROM THIS TAPE         63500000
                                       VOLUME WHILE IT WAS              63508300
                                       MOUNTED.                         63512400
                                       SUPERSEDED BY ST87NBR.           63516500
                                       SEE NOTE 1.               @LAC*/ 63520600
       3 *        FIXED(32),        /* RESERVED                  @LAA*/ 63524900
       3 CBRSMF_PFX%%ST87NBW FIXED(64), /* NUMBER OF BYTES OF OBJECT    63533201
                                       DATA WRITTEN TO THIS TAPE        63541500
                                       VOLUME WHILE IT WAS              63549800
                                       MOUNTED.                  @LAA*/ 63558100
       3 CBRSMF_PFX%%ST87NBR FIXED(64); /* NUMBER OF BYTES OF OBJECT    63566401
                                       DATA READ FROM THIS TAPE         63574700
                                       VOLUME WHILE IT WAS              63583000
                                       MOUNTED.                  @LAA*/ 63591300
    DECLARE                         /*                               */ 63600000
      CBRSMF_PF2%%ST87L                                                 63650001
               FIXED(31) CONSTANT(LENGTH(SMF85HDR)+LENGTH(SMF85PIS)+    63660001
                                 LENGTH(CBRSMF_PFX%%ST87));             63700001
   %END;                                                                63750000
 /********************************************************************/ 63755500
 /*                                                                  */ 63761000
 /* NOTE 1: 4 BYTE FIELDS REPORTING KILOBYTE VALUES HAVE BEEN        */ 63766500
 /*         SUPERSEDED BY CORRESPONDING 8 BYTE FIELDS REPORTING      */ 63772000
 /*         VALUES IN BYTES. THE EXISTING 4 BYTE FIELDS WILL CONTAIN */ 63777500
 /*         X'FFFF FFFF' IF AN OVERFLOW CONDITION OCCURS.            */ 63783000
 /*                                                                  */ 63788500
 /********************************************************************/ 63794000
 @EJECT;                            /*                               */ 63800000
                                                                        63800800
 %IF IBM_CBGENC = 'YES' !                                     /* @PDC*/ 63800900
     SMF85S90 ^= '' !                                                   63801600
     SMF85S91 ^= '' !                                                   63802400
     SMF85S92 ^= '' !                                                   63803200
     SMF85S93 ^= '' %THEN                                               63804000
   %DO;                                                                 63804800
 @EJECT;                            /*                               */ 63805600
 /********************************************************************/ 63806400
 /*                                                                  */ 63807200
 /* OAM SUBTYPE SECTION, FOR SUBTYPE 90, 91, 92, 93                  */ 63808000
 /*                                                                  */ 63808800
 /* SUBTYPE FUNCTION                                                 */ 63809600
 /* ------- ---------------------------------------------------      */ 63810400
 /*      90 LCS File System Write Request                            */ 63811200
 /*      91 LCS File System Read  Request                            */ 63812000
 /*      92 LCS File System Physical Delete Request                  */ 63812800
 /*      93 LCS File System Physical Delete Request (for uncommitted */ 63813600
 /*                                                  OSREQ Store)    */ 63814400
 /********************************************************************/ 63815200
 %CBRSMF_DEF = 'DEFINED(R85PEND)';                            /* @PDA*/ 63815301
 %IF IBM_CBGENC = 'YES' %THEN %CBRSMF_DEF = 'BASED';          /* @PDA*/ 63815401
 DECLARE                                                                63816000
     1 CBRSMF_PFX%%ST90 CBRSMF_DEF, /* SUBTYPE 90                @L9A*/ 63816801
       3 CBRSMF_PFX%%ST90DIR CHAR(30), /* File system directory  @L9A*/ 63817601
  3 CBRSMF_PFX%%ST90SGN CHAR(8), /* OBJECT storage group name    @L9A*/ 63818401
       3 CBRSMF_PFX%%ST90COLN CHAR(44), /* Collection name       @L9A*/ 63819201
       3 CBRSMF_PFX%%ST90OBJN CHAR(44), /* Object name           @L9A*/ 63820001
       3 CBRSMF_PFX%%ST90FST CHAR(2), /*                                63820801
                                File system type (90 & 91 only)  @L9A*/ 63820901
                             /* '00' ZFS                             */ 63821600
                             /* '01' NFS                             */ 63822400
       3 CBRSMF_PFX%%ST90INST FIXED(32) BDY(BYTE), /* Instance ID @L9A*/63823201
       3 CBRSMF_PFX%%ST90FLGS BIT(32), /* Processing Flags       @L9A*/ 63824001
         5 CBRSMF_PFX%%ST90FLG0 BIT(1), /*                              63824801
                                0 When on, request originated    @L9A*/ 63824901
                             /*   within OAM                         */ 63825600
         5 CBRSMF_PFX%%ST90FLG1 BIT(1), /*                              63826401
                                1 When on, request originated    @L9A*/ 63826501
                             /*   outside OAM                        */ 63827200
         5 CBRSMF_PFX%%ST90FLG2 BIT(1), /* Reserved              @PCA*/ 63827701
         5 *        BIT(29), /* 3-31 are reserved                @LCC*/ 63828200
  3 CBRSMF_PFX%%ST90OLEN FIXED(32) BDY(BYTE),/* Object length    @L9A*/ 63828801
                                      /* valid for 90 & 91 only      */ 63829600
       3 CBRSMF_PFX%%ST90OOFF FIXED(32) BDY(BYTE),/*                    63830401
                                         Object offset. Valid    @L9A*/ 63830501
                                      /* for 91 partial read         */ 63831200
       3 CBRSMF_PFX%%ST90LIQT FIXED(32) BDY(BYTE),/*                    63832001
                                         LCS input-work-queue tim@L9A*/ 63832101
                                      /* milliseconds (90,91 only    */ 63832800
       3 CBRSMF_PFX%%ST90LDQT FIXED(32) BDY(BYTE),/*                    63833601
                                         LCS dispatcher-queue tim@L9A*/ 63833701
                                      /* milliseconds (90,91 only    */ 63834400
       3 CBRSMF_PFX%%ST90LEQT FIXED(32) BDY(BYTE),/*                    63835201
                                         LCS execution-queue time@L9A*/ 63835301
                                      /* milliseconds (90,91 only    */ 63836000
  3 CBRSMF_PFX%%ST90RC FIXED(32) BDY(BYTE),/* LCS Return code    @L9A*/ 63836801
       3 CBRSMF_PFX%%ST90RS FIXED(32) BDY(BYTE);/*LCS Reason code @L9A*/63837601
    DECLARE                                                             63838400
      CBRSMF_PF2%%ST90L                                                 63839201
               FIXED(31) CONSTANT(LENGTH(SMF85HDR)+LENGTH(SMF85PIS)+    63839301
                                 LENGTH(CBRSMF_PFX%%ST90)),             63840001
      CBRSMF_PF2%%ST91L                                                 63840801
               FIXED(31) CONSTANT(LENGTH(SMF85HDR)+LENGTH(SMF85PIS)+    63840901
                                 LENGTH(CBRSMF_PFX%%ST90)),             63841601
      CBRSMF_PF2%%ST92L                                                 63842401
               FIXED(31) CONSTANT(LENGTH(SMF85HDR)+LENGTH(SMF85PIS)+    63842501
                                 LENGTH(CBRSMF_PFX%%ST90)),             63843201
      CBRSMF_PF2%%ST93L                                                 63844001
               FIXED(31) CONSTANT(LENGTH(SMF85HDR)+LENGTH(SMF85PIS)+    63844101
                                 LENGTH(CBRSMF_PFX%%ST90));  /* @L9A */ 63844801
   %END;                                                                63845000
 %IF IBM_CBGENC = 'YES' !                                     /* @LFC*/ 63845001
     SMF85S100 ^= '' !                                                  63845002
     SMF85S101 ^= '' !                                                  63845003
     SMF85S102 ^= '' !                                                  63845004
     SMF85S103 ^= '' %THEN                                              63845005
   %DO;                                                                 63845006
 @EJECT;                                                                63845007
 /********************************************************************/ 63845008
 /*                                                                  */ 63845009
 /* OAM SUBTYPE SECTION, FOR SUBTYPE 100, 101, 102, 103              */ 63845010
 /*                                                                  */ 63845011
 /* SUBTYPE FUNCTION                                                 */ 63845012
 /* ------- ---------------------------------------------------      */ 63845013
 /*     100 LCS Cloud Write Request                                  */ 63845014
 /*     101 LCS Cloud System Read Request                            */ 63845015
 /*     102 LCS Cloud Physical Delete Request                        */ 63845016
 /*     103 LCS Cloud Physical Delete Request (for uncommitted       */ 63845017
 /*                                            OSREQ Store)          */ 63845018
 /********************************************************************/ 63845019
 %CBRSMF_DEF = 'DEFINED(R85PEND)';                            /* @LFA*/ 63845020
 %IF IBM_CBGENC = 'YES' %THEN %CBRSMF_DEF = 'BASED';          /* @LFA*/ 63845021
 DECLARE                                                                63845022
     1 CBRSMF_PFX%%ST100 CBRSMF_DEF, /* SUBTYPE 100              @LFA*/ 63845620
       3 CBRSMF_PFX%%ST100CID  FIXED(15), /*                            63845621
                                 Cloud ID                        @LFA*/ 63845622
       3 *         FIXED(15), /* Reserved                        @LFA*/ 63845623
       3 CBRSMF_PFX%%ST100SGN  CHAR(8),   /*                            63845624
                                 Object storage group name       @LFA*/ 63845625
       3 CBRSMF_PFX%%ST100COLN CHAR(44),  /*                            63845626
                                 Collection name                 @LFA*/ 63845627
       3 CBRSMF_PFX%%ST100OBJN CHAR(44),  /*                            63845628
                                 Object name                     @LFA*/ 63845629
       3 CBRSMF_PFX%%ST100INST FIXED(32) BDY(BYTE), /*                  63845630
                                 Instance ID                     @LFA*/ 63845631
       3 CBRSMF_PFX%%ST100FLGS BIT(32),   /*                            63845632
                                 Processing Flags                @LFA*/ 63845633
         5 CBRSMF_PFX%%ST100FLG0 BIT(1),  /*                            63845634
                                 0 When on, request originated          63845635
                                 within OAM                      @LFA*/ 63845636
         5 CBRSMF_PFX%%ST100FLG1 BIT(1),  /*                            63845637
                                 1 When on, request originated          63845638
                                 outside OAM                     @LFA*/ 63845639
         5 *        BIT(30),  /* 2-31 are reserved               @LFA*/ 63845640
       3 CBRSMF_PFX%%ST100OLEN FIXED(32) BDY(BYTE),/*                   63845641
                                 Object length                          63845642
                                 Only valid for 100 and 101      @LFA*/ 63845643
       3 CBRSMF_PFX%%ST100OOFF FIXED(32) BDY(BYTE),/*                   63845644
                                 Object offset                          63845645
                                 Valid for 101 partial read      @LFA*/ 63845646
       3 CBRSMF_PFX%%ST100LIQT FIXED(32) BDY(BYTE),/*                   63845647
                                 LCS input-work-queue time ms           63845648
                                 Only for 100 and 101            @LFA*/ 63845649
       3 CBRSMF_PFX%%ST100LDQT FIXED(32) BDY(BYTE),/*                   63845650
                                 LCS dispatcher-queue time ms           63845651
                                 Only for 100 and 101            @LFA*/ 63845652
       3 CBRSMF_PFX%%ST100LEQT FIXED(32) BDY(BYTE),/*                   63845653
                                 LCS execution-queue time ms            63845654
                                 Only for 100 and 101            @LFA*/ 63845655
       3 CBRSMF_PFX%%ST100LCLT FIXED(32) BDY(BYTE),/*                   63845656
                                 Cloud Data Access Time.                63845657
                                 Amount of time (in ms) this            63845658
                                 request spent in Cloud                 63845659
                                 Data Access Services.           @LFA*/ 63845660
       3 CBRSMF_PFX%%ST100RC   FIXED(32) BDY(BYTE),/*                   63845661
                                          LCS Return code        @LFA*/ 63845662
       3 CBRSMF_PFX%%ST100RS   FIXED(32) BDY(BYTE);/*                   63845663
                                          LCS Reason code        @LFA*/ 63845664
    DECLARE                                                             63845665
      CBRSMF_PF2%%ST100L                                                63845666
               FIXED(31) CONSTANT(LENGTH(SMF85HDR)+LENGTH(SMF85PIS)+    63845667
                                 LENGTH(CBRSMF_PFX%%ST100)),            63845668
      CBRSMF_PF2%%ST101L                                                63845669
               FIXED(31) CONSTANT(LENGTH(SMF85HDR)+LENGTH(SMF85PIS)+    63845670
                                 LENGTH(CBRSMF_PFX%%ST100)),            63845671
      CBRSMF_PF2%%ST102L                                                63845672
               FIXED(31) CONSTANT(LENGTH(SMF85HDR)+LENGTH(SMF85PIS)+    63845673
                                 LENGTH(CBRSMF_PFX%%ST100)),            63845674
      CBRSMF_PF2%%ST103L                                                63845675
               FIXED(31) CONSTANT(LENGTH(SMF85HDR)+LENGTH(SMF85PIS)+    63845676
                                 LENGTH(CBRSMF_PFX%%ST100));  /* @LFA*/ 63845677
   %END;                                                                63845678
 /********************************************************************/ 63850000
 /*                                                                  */ 63900000
 /* OAM SMF RECORD 85 SUBTYPES                                       */ 63950000
 /*                                                                  */ 64000000
 /********************************************************************/ 64050000
    DECLARE                         /*                               */ 64100000
      CBRSMF_PF3%%ST01 FIXED(31) CONSTANT(1), /* OSREQ ACCESS        */ 64150002
      CBRSMF_PF3%%ST02 FIXED(31) CONSTANT(2), /* OSREQ STORE         */ 64200002
      CBRSMF_PF3%%ST03 FIXED(31) CONSTANT(3), /* OSREQ RETRIEVE      */ 64250002
      CBRSMF_PF3%%ST04 FIXED(31) CONSTANT(4), /* OSREQ QUERY         */ 64300002
      CBRSMF_PF3%%ST05 FIXED(31) CONSTANT(5), /* OSREQ CHANGE        */ 64350002
      CBRSMF_PF3%%ST06 FIXED(31) CONSTANT(6), /* OSREQ DELETE        */ 64400002
      CBRSMF_PF3%%ST07 FIXED(31) CONSTANT(7), /* OSREQ UNACCESS      */ 64450002
      CBRSMF_PF3%%ST08 FIXED(31) CONSTANT(8), /* OSREQ STOREBEG  @L7A*/ 64462502
      CBRSMF_PF3%%ST09 FIXED(31) CONSTANT(9), /* OSREQ STOREPRT  @L7A*/ 64475002
      CBRSMF_PF3%%ST10 FIXED(31) CONSTANT(10),/* OSREQ STOREEND  @L7A*/ 64487502
      CBRSMF_PF3%%ST32                                                  64500002
              FIXED(31) CONSTANT(32),/* OSMC STOR GRP PROCESSING     */ 64510001
      CBRSMF_PF3%%ST33                                                  64550002
              FIXED(31) CONSTANT(33),/* OSMC DASD SPACE MANAGEMENT   */ 64560001
      CBRSMF_PF3%%ST34                                                  64600002
              FIXED(31) CONSTANT(34),/* OSMC OPTICAL DISK REC UTIL   */ 64610001
      CBRSMF_PF3%%ST35                                                  64650002
              FIXED(31) CONSTANT(35),/* OSMC MOVEVOL UTILITY         */ 64660001
      CBRSMF_PF3%%ST36                                                  64700002
              FIXED(31) CONSTANT(36),/* OSMC SINGLE OBJ RECV UTIL   */  64710001
      CBRSMF_PF3%%ST37                                                  64750002
              FIXED(31) CONSTANT(37),/* OSMC LIB SPACE MANAGEMENT    */ 64760001
      CBRSMF_PF3%%ST38                                                  64775002
              FIXED(31) CONSTANT(38),/* OSMC OBJECT RECALL       @L4A*/ 64776001
      CBRSMF_PF3%%ST39                                                  64787502
              FIXED(31) CONSTANT(39),/* OSMC IMMEDIATE BKUP COPY @L5A*/ 64787601
      CBRSMF_PF3%%ST40                                                  64793702
              FIXED(31) CONSTANT(40),/* OSMC COMMAND RECYCLE     @L5A*/ 64793801
      CBRSMF_PF3%%ST64                                                  64800002
              FIXED(31) CONSTANT(64),/* LCS OPT DRIVE VARY ONLINE    */ 64810001
      CBRSMF_PF3%%ST65                                                  64850002
              FIXED(31) CONSTANT(65),/* LCS OPT DRIVE VARY OFFLINE   */ 64860001
      CBRSMF_PF3%%ST66                                                  64900002
              FIXED(31) CONSTANT(66),/* LCS OPT LIB VARY ONLINE      */ 64910001
      CBRSMF_PF3%%ST67                                                  64950002
              FIXED(31) CONSTANT(67),/* LCS OPT LIB VARY OFFLINE     */ 64960001
      CBRSMF_PF3%%ST68                                                  65000002
              FIXED(31) CONSTANT(68),/* LCS OPTICAL CART ENTRY       */ 65010001
      CBRSMF_PF3%%ST69                                                  65050002
              FIXED(31) CONSTANT(69),/* LCS OPTICAL CART EJECT       */ 65060001
      CBRSMF_PF3%%ST70                                                  65100002
              FIXED(31) CONSTANT(70),/* LCS OPTICAL CART LABEL       */ 65110001
      CBRSMF_PF3%%ST71                                                  65150002
              FIXED(31) CONSTANT(71),/* LCS OPTICAL CART AUDIT       */ 65160001
      CBRSMF_PF3%%ST72                                                  65200002
              FIXED(31) CONSTANT(72),/* LCS OPTICAL CART MOUNT       */ 65210001
      CBRSMF_PF3%%ST73                                                  65250002
              FIXED(31) CONSTANT(73),/* LCS OPTICAL CART DEMOUNT     */ 65260001
      CBRSMF_PF3%%ST74                                                  65300002
              FIXED(31) CONSTANT(74),/* LCS OPTICAL WRITE REQUEST    */ 65310001
      CBRSMF_PF3%%ST75                                                  65350002
              FIXED(31) CONSTANT(75),/* LCS OPTICAL READ REQUEST     */ 65360001
      CBRSMF_PF3%%ST76                                                  65400002
              FIXED(31) CONSTANT(76),/* LCS OPTICAL LOG DELETE   @P0C*/ 65410001
      CBRSMF_PF3%%ST77                                                  65450002
              FIXED(31) CONSTANT(77),/* LCS OPTICAL PHY DELETE REQ   */ 65460001
      CBRSMF_PF3%%ST78                                                  65500002
              FIXED(31) CONSTANT(78),/* LCS TAPE WRITE REQUEST       */ 65510001
      CBRSMF_PF3%%ST79                                                  65550002
              FIXED(31) CONSTANT(79),/* LCS TAPE READ REQUEST        */ 65560001
      CBRSMF_PF3%%ST80                                                  65600002
              FIXED(31) CONSTANT(80),/* LCS TAPE LIB VARY ONLINE     */ 65610001
      CBRSMF_PF3%%ST81                                                  65650002
              FIXED(31) CONSTANT(81),/* LCS TAPE LIB VARY OFFLINE    */ 65660001
      CBRSMF_PF3%%ST82                                                  65700002
              FIXED(31) CONSTANT(82),/* LCS TAPE LIB VOL ENTRY       */ 65710001
      CBRSMF_PF3%%ST83                                                  65750002
              FIXED(31) CONSTANT(83),/* LCS TAPE LIB VOL EJECT       */ 65760001
      CBRSMF_PF3%%ST84                                                  65800002
              FIXED(31) CONSTANT(84),/* LCS TAPE LIB VOL AUDIT       */ 65810001
      CBRSMF_PF3%%ST85                                                  65850002
              FIXED(31) CONSTANT(85),/* LCS TAPE LIB VOL MOUNT       */ 65860001
      CBRSMF_PF3%%ST86                                                  65900002
              FIXED(31) CONSTANT(86),/* LCS TAPE LIB VOL DEMOUNT     */ 65910001
      CBRSMF_PF3%%ST87                                                  65933302
              FIXED(31) CONSTANT(87),/* OAM TAPE VOLUME DEMOUNT  @P0C*/ 65933401
      CBRSMF_PF3%%ST88                                                  65966602
              FIXED(31) CONSTANT(88),/* LCS TAPE LOGICAL DELETE  @LFC*/ 65966701
      CBRSMF_PF3%%ST90                                                  65966702
              FIXED(31) CONSTANT(90),/* LCS FILE SYSTEM WRITE    @LFA*/ 65966800
      CBRSMF_PF3%%ST91                                                  65966801
              FIXED(31) CONSTANT(91),/* LCS FILE SYSTEM READ     @LFA*/ 65966802
      CBRSMF_PF3%%ST92                                                  65966803
              FIXED(31) CONSTANT(92),/* LCS FILE SYSTEM DELETE   @LFA*/ 65966804
      CBRSMF_PF3%%ST93                                                  65966805
              FIXED(31) CONSTANT(93),/* LCS FS DELETE CLEANUP    @LFA*/ 65966806
      CBRSMF_PF3%%ST100                                                 65966807
              FIXED(31) CONSTANT(100),/* LCS CLOUD WRITE         @LFA*/ 65966808
      CBRSMF_PF3%%ST101                                                 65966809
              FIXED(31) CONSTANT(101),/* LCS CLOUD READ          @LFA*/ 65966810
      CBRSMF_PF3%%ST102                                                 65966811
              FIXED(31) CONSTANT(102),/* LCS CLOUD DELETE        @LFA*/ 65966812
      CBRSMF_PF3%%ST103                                                 65966813
              FIXED(31) CONSTANT(103);/* LCS CLD DELETE CLEANUP  @LFA*/ 65966814
 @EJECT;                            /*                               */ 66000000
 /********************************************************************/ 66050000
 /*                                                                  */ 66100000
 /* OAM SMF RECORD POINTER AND SUBSYSTEM PC ROUTINES.                */ 66150000
 /*                                                                  */ 66200000
 /********************************************************************/ 66250000
    DECLARE                         /*                               */ 66300000
      SMF85PTR PTR(31),             /* POINTER TO SMF TYPE 85 RECORD */ 66350000
      CBRSMF_PFX%%MAX_SMF_RECORD                                        66400001
                     FIXED(31) CONSTANT(32756);/* MAXIMUM SIZE OF AN    66410001
                                       SMF RECORD                    */ 66450000
