*                                                                       00001000
* %DCL CSRSIIDF_INCLUDED CHAR EXT;                                      00002000
* %DEACTIVATE CSRSIIDF_INCLUDED;                                        00003000
* %IF CSRSIIDF_INCLUDED = '' %THEN                                      00004000
* %DO;                                                                  00005000
*/* Macro made bi-lingual on 22220. CBGEN compile date 21138         */ 00006000
*% /*                                                                   00007000
         MACRO                                                          00008000
         CSRSIIDF &DSECT=YES,&LIST=YES,&TITLE=YES,&SI00=YES,&SIV1=COND,*00009000
               &SIV1V2=COND,&SIV1V2V3=COND,&SIV1V3=COND,&SIV2=COND,    *00010000
               &SIV2V3=COND,&SIV3=COND,&SI11V1=COND,&SI22V1=COND,      *00011000
               &SI22V1ALT=COND,&SI22V2=COND,&SI22V3=COND,              *00012000
               &SI22V3DB=COND                                           00013000
         GBLC  &CSRSIIDF_INCLUDED                                       00014000
         GBLC  &ZCBPRINT                                                00015000
&CSRSIIDF_INCLUDED SETC 'YES'                                           00016000
         AIF   ('&LIST' EQ 'NONE').P0                                   00017000
         AIF   ('&TITLE' EQ 'NO').P5                                    00018000
 TITLE   'CSRSIIDF  - CSRSI IDF (return codes and output area maps)  '  00019000
.P5      ANOP                                                           00020000
**/ ;                                                                   00021000
*/* START OF SPECIFICATIONS ******************************************* 00022000
*                                                                       00023000
*  **PROPRIETARY_STATEMENT********************************************  00024000
***01* PROPRIETARY STATEMENT=                                        *  00025000
*                                                                    *  00026000
*                                                                    *  00027000
*   LICENSED MATERIALS - PROPERTY OF IBM                             *  00028000
*   5650-ZOS COPYRIGHT IBM CORP. 1999, 2019                          *  00029000
*                                                                    *  00030000
*   STATUS= HBB77C0                                                  *  00031000
*                                                                    *  00032000
*  **END_OF_PROPRIETARY_STATEMENT*************************************  00033000
*                                                                       00034000
*01* DESCRIPTIVE NAME:  CSRSI IDF (return codes and output area maps)   00035000
*02*  ACRONYM:  SI00                                                    00036000
*                                                                       00037000
*01* MACRO NAME:  CSRSIIDF                                              00038000
*                                                                       00039000
*01* EXTERNAL CLASSIFICATION: PI                                        00040000
*01* END OF EXTERNAL CLASSIFICATION:                                    00041000
*                                                                       00042000
*01* DSECT NAME:                                                        00043000
*           SI00                                                        00044000
*           SIV1                                                        00045000
*           SIV1V2                                                      00046000
*           SIV1V2V3                                                    00047000
*           SIV1V3                                                      00048000
*           SIV2                                                        00049000
*           SIV2V3                                                      00050000
*           SIV3                                                        00051000
*           SI11V1                                                      00052000
*           SI22V1                                                      00053000
*           SI22V1ALT                                                   00054000
*           SI22V2                                                      00055000
*           SI22V3                                                      00056000
*           SI22V3DB                                                    00057000
*                                                                       00058000
*01* COMPONENT:  CSR (SCCSR)                                            00059000
*                                                                       00060000
*01* EYE-CATCHER:  NONE                                                 00061000
*                                                                       00062000
*01* STORAGE ATTRIBUTES:                                                00063000
*02*  SUBPOOL:  Caller-supplied                                         00064000
*02*  KEY:  Caller-supplied                                             00065000
*02*  RESIDENCY:  Caller-supplied                                       00066000
*                                                                       00067000
*01* SIZE:  Variable                                                    00068000
*           SI00      -- X'0040' bytes                                  00069000
*           SIV1      -- X'2040' bytes                                  00070000
*           SIV1V2    -- X'3040' bytes                                  00071000
*           SIV1V2V3  -- X'4040' bytes                                  00072000
*           SIV1V3    -- X'3040' bytes                                  00073000
*           SIV2      -- X'1040' bytes                                  00074000
*           SIV2V3    -- X'2040' bytes                                  00075000
*           SIV3      -- X'1040' bytes                                  00076000
*           SI11V1    -- X'1000' bytes                                  00077000
*           SI22V1    -- X'1000' bytes                                  00078000
*           SI22V1ALT -- X'0FD8' bytes                                  00079000
*           SI22V2    -- X'1000' bytes                                  00080000
*           SI22V3    -- X'1000' bytes                                  00081000
*           SI22V3DB  -- X'0040' bytes                                  00082000
*                                                                       00083000
*01* CREATED BY:                                                        00084000
*     Caller and passed as parameter on InfoArea parameter              00085000
*      on call to CSRSI                                                 00086000
*                                                                       00087000
*01* POINTED TO BY:                                                     00088000
*     CSRSI parameter list                                              00089000
*                                                                       00090000
*01* SERIALIZATION:                                                     00091000
*     None required                                                     00092000
*                                                                       00093000
*01* FUNCTION:                                                          00094000
*02* Provides return code equates for the CSRSI service.                00095000
*02* Maps the InfoArea data returned by the CSRSI service.              00096000
*                                                                       00097000
*02* The data returned depends upon the request.                        00098000
*03* SIV1 DSECT maps the data returned when only V1CPC_MACHINE data     00099000
*    is requested.                                                      00100000
*03* SIV1V2 DSECT maps the data returned when only V1CPC_MACHINE data   00101000
*    and V2CPC_LPAR data are requested.                                 00102000
*03* SIV1V2V3 DSECT maps the data returned when V1CPC_MACHINE data,     00103000
*    V2CPC_LPAR data, and V3CPC_VM data are requested.                  00104000
*03* SIV1V3 DSECT maps the data returned when only V1CPC_MACHINE data   00105000
*    and V3CPC_VM data are requested.                                   00106000
*03* SIV2 DSECT maps the data returned when only V2CPC_LPAR data        00107000
*    is requested.                                                      00108000
*03* SIV2V3 DSECT maps the data returned when only V2CPC_LPAR data      00109000
*    and V3CPC_VM data are requested.                                   00110000
*03* SIV3 DSECT maps the data returned when only V3CPC_VM data          00111000
*    is requested.                                                      00112000
*03* SI00 DSECT maps "starter" information (including STIDP)            00113000
*03* SI11V1 DSECT maps the general configuration information for a      00114000
*      machine                                                          00115000
*03* SI22V1 DSECT maps multiple CPU information for a machine.          00116000
*03* SI22V1ALT DSECT maps the alternate information according to        00117000
*      field SI22V1Format                                               00118000
*03* SI22V2 DSECT maps multiple CPU information for an LPAR.            00119000
*03* SI22V3 DSECT maps multiple CPU information when running under VM.  00120000
*                                                                       00121000
*02*   The SI00ValidityFlags fields indicates whether the data          00122000
*      returned for each requested area (other than SI00) is valid.     00123000
*      There is no bit for the SI00 area itself since that              00124000
*      area is always valid.                                            00125000
*                                                                       00126000
*02*   The infoarea length must match the length of the DSECT           00127000
*      that maps the requested data.                                    00128000
*                                                                       00129000
*02*   Much of the information corresponds to data returned by the STSI 00130000
*      instruction.                                                     00131000
*      Additional information about the fields may be found in the STSI 00132000
*      instruction writeup within the z/Architecture Principles of      00133000
*      Operation. DSECT SIyzVx corresponds to STSI SYSIB x.y.z          00134000
*      (for example, DSECT SI22V1 corresponds to SYSIB 1.2.2) within    00135000
*      the z/Architecture Principles of Operation.                      00136000
*                                                                       00137000
*01* METHOD OF ACCESS:                                                  00138000
*02*  ASM:                                                              00139000
*      CSRSIIDF                                                         00140000
*           DSECT=YES!NO  -- Request DSECT definition                   00141000
*           SI00=YES!NO!COND -- Map header information                  00142000
*                            USING on SI00                              00143000
*           SIV1=YES!NO!COND -- Map V1CPC_MACHINE information           00144000
*                            USING on SIV1                              00145000
*           SIV1V2=YES!NO!COND -- Map V1CPC_MACHINE                     00146000
*                            and V2CPC_LPAR information                 00147000
*                            USING on SIV1V2                            00148000
*           SIV1V2V3=YES!NO!COND -- Map V1CPC_MACHINE, V2CPC_LPAR,      00149000
*                            and V3CPC_VM information                   00150000
*                            USING on SIV1V2V3                          00151000
*           SIV1V3=YES!NO!COND -- Map V1CPC_MACHINE                     00152000
*                            and V3CPC_VM information                   00153000
*                            USING on SIV1V3                            00154000
*           SIV2=YES!NO!COND -- Map V2CPC_LPAR information              00155000
*                            USING on SIV2                              00156000
*           SIV2V3=YES!NO!COND -- Map V2CPC_LPAR                        00157000
*                            and V3CPC_VM information                   00158000
*                            USING on SIV2V3                            00159000
*           SIV3=YES!NO!COND -- Map V3CPC_VM information                00160000
*                            USING on SIV3                              00161000
*           SI11V1=YES!NO!COND -- Map general configuration for machine 00162000
*                            USING on SI11V1                            00163000
*           SI22V1=YES!NO!COND -- Map multiple CPU for machine          00164000
*                            USING on SI22V1                            00165000
*           SI22V1ALT=YES!NO!COND -- Map alternate info for multiple    00166000
*                            CPU for machine                            00167000
*                            USING on SI22V1ALT                         00168000
*           SI22V2=YES!NO!COND -- Map multiple CPU for LPAR             00169000
*                            USING on SI22V2                            00170000
*           SI22V3=YES!NO!COND -- Map multiple CPU for VM               00171000
*                            USING on SI22V3                            00172000
*           SI22V3DB=YES!NO!COND -- Map directory block for VM          00173000
*                            USING on SI22V3DB                          00174000
*     Default: DSECT=YES,SI00=YES,                                      00175000
*              SIV1=COND,SIV1V2=COND,SIV1V2V3=COND,SIV1V3=COND,         00176000
*              SIV2=COND,SIV2V3=COND,SIV3=COND,                         00177000
*              SI11V1=COND,SI22V1=COND,SI22V1ALT=COND,                  00178000
*              SI22V2=COND,SI22V3=COND,SI22V3DB=COND                    00179000
*     Notes: name=YES  => expand                                        00180000
*            name=NO   => do not expand                                 00181000
*            name=COND => expand only if DSECT=YES                      00182000
*                                                                       00183000
*02*  PL/X:                                                             00184000
*      %INCLUDE SYSLIB(CSRSIIDF)                                        00185000
*                                                                       00186000
*01* DELETED BY:  Caller                                                00187000
*                                                                       00188000
*01* FREQUENCY:  Created for response to CSRSI service                  00189000
*                                                                       00190000
*01* DEPENDENCIES:  None                                                00191000
*                                                                       00192000
*01* DISTRIBUTION LIBRARY:  AMACLIB                                     00193000
*                                                                       00194000
*01* CHANGE ACTIVITY:                                                   00195000
*   $00=STSICBG  ,HBB6601,990206,PD00XB: OW38489 STSI                   00196000
*   $01=STSICSR  ,HBB6601,990206,PD00XB: OW38489 STSI                   00197000
*   $L1=STSICSR  ,HBB7707,011201,PD00XB: si22v1alt                      00198000
*   $L2=GT16WAY  ,HBB7709,021211,PD00XB: PCCA_CPU_ADDRESS_MASK          00199000
*   $H1=STSICSR  ,HBB7709,031106,PD00XB: Model capacity identifier      00200000
*   $H2=IFA       HBB7709 031205 PD00XB: IFA support                    00201000
*   $L3=ME04541  ,HBB7730,051001,PD00XB: SI22V2 LPAR origin             00202000
*   $H3=P001      HBB7730 061231 PD00XB: SI11V1Diag                     00203000
*   $H4=ME10199  ,HBB7750 070510 PD00XB: Support                        00204000
*   $L4=G64CPU   ,HBB7760 080612 PD00BS: Greater than 64 CPU support    00205000
*   $L5=ME15238  ,HBB7760 081212 PD00XB: SI11V1CAI                      00206000
*   $L6=ME16442  ,HBB7770 090623 PD00XB: SI11V1NOMxxx, TypeNPctg        00207000
*   $L7=ME17284  ,HBB7770 090928 PD00XB: BFP                            00208000
*   $02=ME18956  ,HBB7780 100408 PD00XB: Last Event Timestamp           00209000
*   $03=OA30968  ,HBB7770 100608 3241AK: SI11V1_Transient               00210000
*   $L8=SIM4I    ,HBB7790 120531 PD00D0: SIM4I support                  00211000
*   $L9=ZZSIM2   ,HBB77A0 121203 PD00D0: ZZSIM2 support                 00212000
*   $LA=ZZSIM2   ,HBB77A0 130426 PD0AAA: New fields in SI22V1           00213000
*   $04=OA43366  ,HBB77A0 131029 PD0AAA: ZZSIM2 rollup                  00214000
*   $LD=Z14ZR1   ,HBB7790 180131 PD00D0: Z14ZR1                         00215000
*   $LB=W138872  ,HBB77B0 161027 PD0AAA: FirmwareID                     00216000
*   $LE=W254908  ,HBB77C0 180523 PD00XB: AR10900                        00217000
*   $LC=zCBP     ,HBB77C0 171024 PD00NJ: zCBP                           00218000
*   $05=OA62744  ,HBB77C0 220513 PD00NJ: Support SI22V3ExtVMName        00219000
*                                                                       00220000
* END OF SPECIFICATIONS *********************************************/  00221000
*% /*                                                                   00222000
.P0      ANOP                                                           00223000
         AIF   ('&ZCBPRINT' EQ 'NO').P1                                 00224000
         AIF   ('&LIST' EQ 'YES').P2                                    00225000
.P1      ANOP                                                           00226000
         PUSH  PRINT                                                    00227000
         PRINT OFF                                                      00228000
.P2      ANOP                                                           00229000
         AIF   ('&SI00' EQ 'NO').L0002                                  00230000
         AIF   ('&DSECT' EQ 'YES').L0003                                00231000
         AIF   ('&SI00' NE 'YES').L0002                                 00232000
.L0003   ANOP                                                           00233000
*                                                                       00234000
* ********************************************************************  00235000
* * SI00 represents the "starter" information                        *  00236000
* ********************************************************************  00237000
*                                                                       00238000
*                                                                       00239000
         AIF   ('&DSECT' EQ 'YES').L0004                                00240000
SI00     DS    0D                                                       00241000
         AGO   .L0005                                                   00242000
.L0004   ANOP                                                           00243000
SI00     DSECT                                                          00244000
.L0005   ANOP                                                           00245000
SI00CPCVARIETY DS X      SI00CPCVariety_V1CPC_Machine,                 *00246000
                         SI00CPCVariety_V2CPC_LPAR, or                 *00247000
                         SI00CPCVariety_V3CPC_VM                        00248000
SI00VALIDITYFLAGS DS B   Validity flags                                 00249000
*  Bit definitions:                                                     00250000
SI00VALIDSI11V1 EQU X'80' SI11V1 was requested and the information     *00251000
                         returned is valid                              00252000
SI00VALIDSI22V1 EQU X'40' SI22V1 was requested and the information     *00253000
                         returned is valid                              00254000
SI00VALIDSI22V2 EQU X'20' SI22V2 was requested and the information     *00255000
                         returned is valid                              00256000
SI00VALIDSI22V3 EQU X'10' SI22V3 was requested and the information     *00257000
                         returned is valid                              00258000
         DS    CL2       Reserved                                       00259000
SI00PCCACPID DS CL12     PCCACPID value (CPU ID) for this CPU           00260000
SI00PCCACPUA DS CL2      PCCACPUA value for this CPU                    00261000
SI00PCCACAFM DS CL2      PCCACAFM value for this CPU. This has         *00262000
                         information only about CPUs 0-15               00263000
         DS    CL4       Reserved                                       00264000
SI00LASTUPDATETIMESTAMP DS CL8 STCK timestamp when system last         *00265000
                         re-issued STSI to retrieve the most current   *00266000
                         information. A capacity upgrade on demand     *00267000
                         event is one event that results in this       *00268000
                         update. The field is 0's if the information   *00269000
                         has not been retrieved since IPL.              00270000
SI00PCCA_PARTIALCPUMASK DS CL8 PCCA_PartialCpuMask value for this CPU.  00271000
         ORG   SI00PCCA_PARTIALCPUMASK                                  00272000
SI00PCCA_CPU_ADDRESS_MASK DS CL8 PCCA_CPU_ADDRESS_MASK value for this  *00273000
                         CPU.                                           00274000
SI00PCCA_PARTIALCPUMASKOFFSET DS H PCCA_PartialCpuMaskOffset value for *00275000
                         this CPU                                       00276000
         ORG   SI00PCCA_PARTIALCPUMASKOFFSET                            00277000
SI00PCCA_CPU_ADDRESS_MASK_OFFSET DS H PCCA_CPU_ADDRESS_MASK_OFFSET     *00278000
                         value for this CPU                             00279000
         DS    CL14      Reserved                                       00280000
SI00NONINTERFACE DS CL8  Not a programming interface                    00281000
*                                                                       00282000
* ********************************************************************  00283000
* * SI00 Constants                                                   *  00284000
* ********************************************************************  00285000
*                                                                       00286000
*                                                                       00287000
SI00CPCVARIETY_V1CPC_MACHINE EQU 1 Value for a V1 CPC (not LPAR, not   *00288000
                         VM)                                            00289000
SI00CPCVARIETY_V2CPC_LPAR EQU 2 Value for a V2 CPC (LPAR)               00290000
SI00CPCVARIETY_V3CPC_VM EQU 3 Value for a V3 CPC (VM)                   00291000
*                                                                       00292000
* ********************************************************************  00293000
* *      Constants for Parameters and Return Codes                   *  00294000
* ********************************************************************  00295000
*   Store System Information Constants                                  00296000
*                                                                       00297000
*                                                                       00298000
CSRSI_REQUEST_V1CPC_MACHINE EQU 1 Requests information about a V1 CPC  *00299000
                         (not LPAR, not VM)                             00300000
CSRSI_REQUEST_V2CPC_LPAR EQU 2 Requests information about a V2 CPC     *00301000
                         (LPAR)                                         00302000
CSRSI_REQUEST_V3CPC_VM EQU 4 Requests information about a V3 CPC (VM)   00303000
*                                                                       00304000
*   Store System Information Return Codes                               00305000
*   Note: 0C4 abend if bad address provided in parmlist or user data    00306000
*                                                                       00307000
*                                                                       00308000
CSRSI_SUCCESS EQU 0      CSRSI service completed successfully           00309000
CSRSI_STSINOTAVAILABLE EQU 4 STSI instruction is not available on this *00310000
                         system. Only the SI00PCCACPID, SI00PCCACPUA,  *00311000
                         SI00PCCACAFM fields are valid.                 00312000
CSRSI_SERVICENOTAVAILABLE EQU 8 CSRSI service is not available on this *00313000
                         system.                                        00314000
CSRSI_BADREQUEST EQU 12  The request parameter did not specify a word  *00315000
                         with a value formed from adding any           *00316000
                         combination of CSRSI_Request_V1CPC_Machine,   *00317000
                         CSRSI_Request_V2CPC_LPAR, and                 *00318000
                         CSRSI_Request_V3CPC_VM.                        00319000
CSRSI_BADINFOAREALEN EQU 16 The value of the InfoAreaLen parameter     *00320000
                         does not match the length needed to           *00321000
                         accomodate the requested data.                 00322000
CSRSI_BADLOCK EQU 20     Service was called holding a system lock      *00323000
                         other than CPU, LOCAL/CML, CMS                 00324000
SI00_LEN EQU   *-SI00                                                   00325000
.L0002   ANOP                                                           00326000
         AIF   ('&SIV1' EQ 'NO').L0006                                  00327000
         AIF   ('&DSECT' EQ 'YES').L0007                                00328000
         AIF   ('&SIV1' NE 'YES').L0006                                 00329000
.L0007   ANOP                                                           00330000
*                                                                       00331000
* ********************************************************************  00332000
* * SIV1 represents the information returned when V1CPC_Machine      *  00333000
* * data is requested                                                *  00334000
* ********************************************************************  00335000
*                                                                       00336000
*                                                                       00337000
         AIF   ('&DSECT' EQ 'YES').L0008                                00338000
SIV1     DS    0D                                                       00339000
         AGO   .L0009                                                   00340000
.L0008   ANOP                                                           00341000
SIV1     DSECT                                                          00342000
.L0009   ANOP                                                           00343000
SIV1SI00 DS    CL64      Area mapped by dsect SI00                      00344000
SIV1SI11V1 DS  CL4096    Area mapped by dsect SI11V1                    00345000
SIV1SI22V1 DS  CL4096    Area mapped by dsect SI22V1                    00346000
SIV1_LEN EQU   *-SIV1                                                   00347000
.L0006   ANOP                                                           00348000
         AIF   ('&SIV1V2' EQ 'NO').L000A                                00349000
         AIF   ('&DSECT' EQ 'YES').L000B                                00350000
         AIF   ('&SIV1V2' NE 'YES').L000A                               00351000
.L000B   ANOP                                                           00352000
*                                                                       00353000
* ********************************************************************  00354000
* * SIV1V2 represents the information returned when V1CPC_Machine    *  00355000
* * data and V2CPC_LPAR data is requested                            *  00356000
* ********************************************************************  00357000
*                                                                       00358000
*                                                                       00359000
         AIF   ('&DSECT' EQ 'YES').L000C                                00360000
SIV1V2   DS    0D                                                       00361000
         AGO   .L000D                                                   00362000
.L000C   ANOP                                                           00363000
SIV1V2   DSECT                                                          00364000
.L000D   ANOP                                                           00365000
SIV1V2SI00 DS  CL64      Area mapped by dsect SI00                      00366000
SIV1V2SI11V1 DS CL4096   Area mapped by dsect SI11V1                    00367000
SIV1V2SI22V1 DS CL4096   Area mapped by dsect SI22V1                    00368000
SIV1V2SI22V2 DS CL4096   Area mapped by dsect SI22V2                    00369000
SIV1V2_LEN EQU *-SIV1V2                                                 00370000
.L000A   ANOP                                                           00371000
         AIF   ('&SIV1V2V3' EQ 'NO').L000E                              00372000
         AIF   ('&DSECT' EQ 'YES').L000F                                00373000
         AIF   ('&SIV1V2V3' NE 'YES').L000E                             00374000
.L000F   ANOP                                                           00375000
*                                                                       00376000
* ********************************************************************  00377000
* * SIV1V2V3 represents the information returned when V1CPC_Machine  *  00378000
* * data, V2CPC_LPAR data and V3CPC_VM data is requested             *  00379000
* ********************************************************************  00380000
*                                                                       00381000
*                                                                       00382000
         AIF   ('&DSECT' EQ 'YES').L0010                                00383000
SIV1V2V3 DS    0D                                                       00384000
         AGO   .L0011                                                   00385000
.L0010   ANOP                                                           00386000
SIV1V2V3 DSECT                                                          00387000
.L0011   ANOP                                                           00388000
SIV1V2V3SI00 DS CL64     Area mapped by dsect SI00                      00389000
SIV1V2V3SI11V1 DS CL4096 Area mapped by dsect SI11V1                    00390000
SIV1V2V3SI22V1 DS CL4096 Area mapped by dsect SI22V1                    00391000
SIV1V2V3SI22V2 DS CL4096 Area mapped by dsect SI22V2                    00392000
SIV1V2V3SI22V3 DS CL4096 Area mapped by dsect SI22V3                    00393000
SIV1V2V3_LEN EQU *-SIV1V2V3                                             00394000
.L000E   ANOP                                                           00395000
         AIF   ('&SIV1V3' EQ 'NO').L0012                                00396000
         AIF   ('&DSECT' EQ 'YES').L0013                                00397000
         AIF   ('&SIV1V3' NE 'YES').L0012                               00398000
.L0013   ANOP                                                           00399000
*                                                                       00400000
* ********************************************************************  00401000
* * SIV1V3 represents the information returned when V1CPC_Machine    *  00402000
* * data and V3CPC_VM data is requested                              *  00403000
* ********************************************************************  00404000
*                                                                       00405000
*                                                                       00406000
         AIF   ('&DSECT' EQ 'YES').L0014                                00407000
SIV1V3   DS    0D                                                       00408000
         AGO   .L0015                                                   00409000
.L0014   ANOP                                                           00410000
SIV1V3   DSECT                                                          00411000
.L0015   ANOP                                                           00412000
SIV1V3SI00 DS  CL64      Area mapped by dsect SI00                      00413000
SIV1V3SI11V1 DS CL4096   Area mapped by dsect SI11V1                    00414000
SIV1V3SI22V1 DS CL4096   Area mapped by dsect SI22V1                    00415000
SIV1V3SI22V3 DS CL4096   Area mapped by dsect SI22V3                    00416000
SIV1V3_LEN EQU *-SIV1V3                                                 00417000
.L0012   ANOP                                                           00418000
         AIF   ('&SIV2' EQ 'NO').L0016                                  00419000
         AIF   ('&DSECT' EQ 'YES').L0017                                00420000
         AIF   ('&SIV2' NE 'YES').L0016                                 00421000
.L0017   ANOP                                                           00422000
*                                                                       00423000
* ********************************************************************  00424000
* * SIV2 represents the information returned when V2CPC_LPAR         *  00425000
* * data is requested                                                *  00426000
* ********************************************************************  00427000
*                                                                       00428000
*                                                                       00429000
         AIF   ('&DSECT' EQ 'YES').L0018                                00430000
SIV2     DS    0D                                                       00431000
         AGO   .L0019                                                   00432000
.L0018   ANOP                                                           00433000
SIV2     DSECT                                                          00434000
.L0019   ANOP                                                           00435000
SIV2SI00 DS    CL64      Area mapped by dsect SI00                      00436000
SIV2SI22V2 DS  CL4096    Area mapped by dsect SI22V2                    00437000
SIV2_LEN EQU   *-SIV2                                                   00438000
.L0016   ANOP                                                           00439000
         AIF   ('&SIV2V3' EQ 'NO').L001A                                00440000
         AIF   ('&DSECT' EQ 'YES').L001B                                00441000
         AIF   ('&SIV2V3' NE 'YES').L001A                               00442000
.L001B   ANOP                                                           00443000
*                                                                       00444000
* ********************************************************************  00445000
* * SIV2V3 represents the information returned when V2CPC_LPAR       *  00446000
* * and V3CPC_VM data is requested                                   *  00447000
* ********************************************************************  00448000
*                                                                       00449000
*                                                                       00450000
         AIF   ('&DSECT' EQ 'YES').L001C                                00451000
SIV2V3   DS    0D                                                       00452000
         AGO   .L001D                                                   00453000
.L001C   ANOP                                                           00454000
SIV2V3   DSECT                                                          00455000
.L001D   ANOP                                                           00456000
SIV2V3SI00 DS  CL64      Area mapped by dsect SI00                      00457000
SIV2V3SI22V2 DS CL4096   Area mapped by dsect SI22V2                    00458000
SIV2V3SI22V3 DS CL4096   Area mapped by dsect SI22V3                    00459000
SIV2V3_LEN EQU *-SIV2V3                                                 00460000
.L001A   ANOP                                                           00461000
         AIF   ('&SIV3' EQ 'NO').L001E                                  00462000
         AIF   ('&DSECT' EQ 'YES').L001F                                00463000
         AIF   ('&SIV3' NE 'YES').L001E                                 00464000
.L001F   ANOP                                                           00465000
*                                                                       00466000
* ********************************************************************  00467000
* * SIV3 represents the information returned when V3CPC_VM           *  00468000
* * data is requested                                                *  00469000
* ********************************************************************  00470000
*                                                                       00471000
*                                                                       00472000
         AIF   ('&DSECT' EQ 'YES').L0020                                00473000
SIV3     DS    0D                                                       00474000
         AGO   .L0021                                                   00475000
.L0020   ANOP                                                           00476000
SIV3     DSECT                                                          00477000
.L0021   ANOP                                                           00478000
SIV3SI00 DS    CL64      Area mapped by dsect SI00                      00479000
SIV3SI22V3 DS  CL4096    Area mapped by dsect SI22V3                    00480000
SIV3_LEN EQU   *-SIV3                                                   00481000
.L001E   ANOP                                                           00482000
         AIF   ('&SI11V1' EQ 'NO').L0022                                00483000
         AIF   ('&DSECT' EQ 'YES').L0023                                00484000
         AIF   ('&SI11V1' NE 'YES').L0022                               00485000
.L0023   ANOP                                                           00486000
*                                                                       00487000
* ********************************************************************  00488000
* * SI11V1 represents the output for a level-1 configuration when    *  00489000
* * general configuration information is requrested                  *  00490000
* ********************************************************************  00491000
*                                                                       00492000
*                                                                       00493000
         AIF   ('&DSECT' EQ 'YES').L0024                                00494000
SI11V1   DS    0D                                                       00495000
         AGO   .L0025                                                   00496000
.L0024   ANOP                                                           00497000
SI11V1   DSECT                                                          00498000
.L0025   ANOP                                                           00499000
SI11V1FLAGS DS B         Flag(s)                                        00500000
*  Bit definitions:                                                     00501000
SI11V1_TYPENPCTGV EQU X'80' When 1, the type-percentage bytes, located *00502000
                         in words 40-41, are valid. When 0, the bytes  *00503000
                         are stored as zeroes but have no meaning       00504000
SI11V1_MTINSTALLED EQU X'02'                                            00505000
SI11V1_TRANSIENT EQU X'01' When 1, indicates that the condition        *00506000
                         represented by SI11V1CCR and SI11V1CAI fields *00507000
                         is relatively transient                        00508000
         DS    CL1       Reserved                                       00509000
SI11V1CCR DS   X         Capacity-Change Reason. When SI11V1CAI is     *00510000
                         nonzero, SI11V1CCR indicates the reason which *00511000
                         is associated with the present values         *00512000
                         contained in SI11V1. When SI11V1CAI is zero,  *00513000
                         SI11V1CCR is undefined and stored as zero.     00514000
SI11V1CAI DS   X         Capacity-Adjustment Indication. When zero,    *00515000
                         the indication is not reported. When in the   *00516000
                         range 1-99, some amount of reduction is       *00517000
                         indicated. When 100, the machine is operating *00518000
                         at its normal capacity.                        00519000
         DS    CL20      Reserved                                       00520000
SI11V1FIRMWAREID DS CL8  When non-zero, information about currently    *00521000
                         installed internal code. The definition of    *00522000
                         the information conveyed is model-dependent.   00523000
SI11V1CPCMANUFACTURER DS CL16 The 16-character (0-9 or uppercase A-Z)  *00524000
                         EBCDIC name of the manufacturer of the        *00525000
                         configuration. The name is left-justified     *00526000
                         with trailing blank characters if necessary.   00527000
SI11V1CPCTYPE DS CL4     The 4-character (0-9) EBCDIC type identifier  *00528000
                         of the configuration.                          00529000
SI11V1CPCMAXPU DS H      When non-zero, the maximum processing cores   *00530000
                         potentially available.                         00531000
         DS    CL2       Reserved                                       00532000
         DS    CL8       Reserved                                       00533000
SI11V1CPCMODEL DS CL16   The 16-character (0-9 or uppercase A-Z)       *00534000
                         EBCDIC model identifier of the configuration. *00535000
                         The identifier is left-justified with         *00536000
                         trailing blank characters if necessary. Valid *00537000
                         only if the first word of SI11V1CPCModel1 is  *00538000
                         zero                                           00539000
         ORG   SI11V1CPCMODEL                                           00540000
SI11V1CPCMODELCAPIDENT DS CL16 The 16-character (0-9 or uppercase A-Z) *00541000
                         EBCDIC model capacity identifier of the       *00542000
                         configuration. The identifier is              *00543000
                         left-justified with trailing blank characters *00544000
                         if necessary.                                  00545000
SI11V1CPCSEQUENCECODE DS CL16 The 16-character (0-9 or uppercase A-Z)  *00546000
                         EBCDIC sequence code of the configuration.    *00547000
                         The sequence code is right-justified with     *00548000
                         leading EBCDIC zeroes if necessary.            00549000
SI11V1CPCPLANTOFMANUFACTURE DS CL4 The 4-character (0-9 or uppercase   *00550000
                         A-Z) EBCDIC plant code that identifies the    *00551000
                         plant of manufacture for the configuration.   *00552000
                         The plant code is left-justified with         *00553000
                         trailing blank characters if necessary.        00554000
SI11V1CPCMODEL1 DS CL16  The 16-character (0-9 or uppercase A-Z)       *00555000
                         EBCDIC model identifier of the configuration. *00556000
                         The identifier is left-justified with         *00557000
                         trailing blank characters if necessary. Valid *00558000
                         only when first word is not zero. Otherwise,  *00559000
                         field SI111VCPCModelCapIdent represents both  *00560000
                         the model-capacity identifier and the model.   00561000
SI11V1CPCMODELPERMCAPIDENT DS CL16 When non-zero, the 16-character     *00562000
                         (0-9 or uppercase A-Z) EBCDIC model permanent *00563000
                         capacity identifier of the configuration. The *00564000
                         identifier is left-justified with trailing    *00565000
                         blank characters if necessary.                 00566000
SI11V1CPCMODELTEMPCAPIDENT DS CL16 When non-zero, the 16-character     *00567000
                         (0-9 or uppercase A-Z) EBCDIC model temporary *00568000
                         capacity identifier of the configuration. The *00569000
                         identifier is left-justified with trailing    *00570000
                         blank characters if necessary.                 00571000
SI11V1CPCMODELCAPRATING DS F When non-zero, an unsigned integer whose  *00572000
                         value is associated with the model capacity   *00573000
                         as identified by field                        *00574000
                         SI11V1CPCModelCapIdent.                        00575000
SI11V1CPCMODELPERMCAPRATING DS F When non-zero, an unsigned integer    *00576000
                         whose value is associated with the model      *00577000
                         permanent capacity as identified by field     *00578000
                         SI11V1CPCModelPermCapIdent.                    00579000
SI11V1CPCMODELTEMPCAPRATING DS F When non-zero, an unsigned integer    *00580000
                         whose value is associated with the model      *00581000
                         temporary capacity as identified by field     *00582000
                         SI11V1CPCModelTempCapIdent.                    00583000
SI11V1DIAG DS  CL8       Name no longer used                            00584000
         ORG   SI11V1DIAG                                               00585000
SI11V1TYPENPCTG DS CL8   Type N Pctg: Each of the byte fields contains *00586000
                         an 8-bit unsigned binary integer whose value  *00587000
                         is in the range 0-100 and represents a        *00588000
                         percentage. When non-zero, the percentage may *00589000
                         be used to affect the use and allowed         *00590000
                         utilization of the secondary-CPUs whose CPU   *00591000
                         type corresponds to the particular byte. When *00592000
                         a byte in this range contains a value of      *00593000
                         zero, use rules of the corresponding          *00594000
                         secondary-CPU type are not overridden.         00595000
         ORG   SI11V1TYPENPCTG                                          00596000
SI11V1_TYPE1PCTG DS X                                                   00597000
SI11V1_TYPE2PCTG DS X                                                   00598000
SI11V1_TYPE3PCTG DS X                                                   00599000
SI11V1_TYPE4PCTG DS X                                                   00600000
SI11V1_TYPE5PCTG DS X                                                   00601000
         DS    CL3       Reserved                                       00602000
SI11V1_NOMMCR DS F       Nominal Model-Capacity Rating. When non-zero, *00603000
                         an unsigned integer whose value is associated *00604000
                         with the nominal model capacity as identified *00605000
                         by SI11V1CPCModelCapIdent                      00606000
SI11V1_NOMMPCR DS F      Nominal Model-Permanent-Capacity. Rating.     *00607000
                         When non-zero, an unsigned integer whose      *00608000
                         value is associated with the nominal          *00609000
                         model-permanent capacity as identified by     *00610000
                         SI11V1CPCModelPermCapIdent                     00611000
SI11V1_NOMMTCR DS F      Nominal Model-Temporary-Capacity Rating. When *00612000
                         non-zero, an unsigned integer whose value is  *00613000
                         associated with the nominal model-temporary   *00614000
                         capacity as identified by                     *00615000
                         SI11V1CPCModelTempCapIdent                     00616000
         DS    CL12      Reserved                                       00617000
SI11V1_ZCBP_MCI DS CL16  zCBP Model-Capacity Identifier. When          *00618000
                         nonzero,a 16-Character EBCDIC model-capacity  *00619000
                         identifier of the zCBP configuration. The     *00620000
                         field is left justified with trailing blanks  *00621000
                         if necessary.                                  00622000
SI11V1_ZCBP_MCR DS F     zCBP Model-Capacity Rating. When non-zero, an *00623000
                         unsigned integer whose value is associated    *00624000
                         with the zCBP model capacity as identified by *00625000
                         SI11V1_zCBP_MCI                                00626000
SI11V1_ZCBP_NOMMCR DS F  zCBP Nominal Model-Capacity Rating. When      *00627000
                         nonzero, an unsigned integer whose value is   *00628000
                         associated with the nominal zCBP model        *00629000
                         capacity as identified by SI11V1_zCBP_MCI.    *00630000
                         Attributes of this field are similar to those *00631000
                         of SI11V1_NomMCR.                              00632000
SI11V1_DIAG0D8 DS CL48   Diagnostic data for IBM use only               00633000
SI11V1_LINUXLICENSETIER DS H When non-zero, a 16-bit unsigned integer  *00634000
                         whose value represents the tier of embedded   *00635000
                         Linux license entitled on the system.          00636000
         DS    CL2       Reserved                                       00637000
         DS    CL3828    Reserved                                       00638000
SI11V1_LEN EQU *-SI11V1                                                 00639000
.L0022   ANOP                                                           00640000
         AIF   ('&SI22V1' EQ 'NO').L0026                                00641000
         AIF   ('&DSECT' EQ 'YES').L0027                                00642000
         AIF   ('&SI22V1' NE 'YES').L0026                               00643000
.L0027   ANOP                                                           00644000
*                                                                       00645000
* ********************************************************************  00646000
* * SI22V1 represents the output for a level-1 configuration when    *  00647000
* * information is requested about the set of CPUs                   *  00648000
* ********************************************************************  00649000
*                                                                       00650000
*                                                                       00651000
         AIF   ('&DSECT' EQ 'YES').L0028                                00652000
SI22V1   DS    0D                                                       00653000
         AGO   .L0029                                                   00654000
.L0028   ANOP                                                           00655000
SI22V1   DSECT                                                          00656000
.L0029   ANOP                                                           00657000
SI22V1FORMAT DS X        When the value is 1, the ACCOffset field is   *00658000
                         valid                                          00659000
         DS    CL1       Reserved                                       00660000
SI22V1ACCOFFSET DS H     Alternate Cpu Capability Offset. A 16-bit     *00661000
                         unsigned binary integer that specifies the    *00662000
                         offset in bytes of the                        *00663000
                         alternate-CPU-capability area (which is       *00664000
                         physically within the SI22V1 area, and is     *00665000
                         mapped by DSECT SI22V1ALT)                     00666000
SI22V1_MT_INSTALLED_INFO DS B Data about MT                             00667000
*  Bit definitions:                                                     00668000
SI22V1_MT_INSTALLED EQU X'80' MT facility installed                     00669000
SI22V1_MT_MAXTHREADID EQU X'1F' The maximum thread ID for a core.       00670000
SI22V1_MT_GENERAL_INFO DS B Data about MT. Meaningful only when        *00671000
                         SI22V1_MT_Installed                            00672000
*  Bit definitions:                                                     00673000
SI22V1_DIAG005 EQU X'20' Diagnostic data. This field is for IBM use    *00674000
                         only                                           00675000
SI22V1_MT_CPMAXTHREADID EQU X'1F' The maximum configurable thread ID   *00676000
                         for a core comprising general CPUs             00677000
         DS    BL2       Reserved                                       00678000
         DS    CL8       Reserved                                       00679000
SI22V1PRIMARYCPUSPEED DS F Primary CPU Speed (cycles per microsecond)   00680000
SI22V1SECONDARYCPUSPEED DS F Secondary CPU Speed (cycles per           *00681000
                         microsecond)                                   00682000
SI22V1_NOMCC DS F        Nominal CPU Capability. When not 0, this word *00683000
                         is formatted and encoded the same as the CPU  *00684000
                         Capability word. When SI11V1CAI is zero, this *00685000
                         word is 0. The nonzero value equals the value *00686000
                         in SI22V1CpuCapability when SI11V1CAI is 100. *00687000
                         When SI11V1CAI is nonzero and less than 100,  *00688000
                         this field indicates a CPU speed greater than *00689000
                         the CPU speed in SI22V1CpuCapability           00690000
SI22V1SECONDARYCPUCAPABILITY DS CL4 If bits 0-8 are 0, this is an      *00691000
                         unsigned 32-bit binary integer. Otherwise     *00692000
                         this is a 32-bit binary floating point short  *00693000
                         format number. When not zero, this field      *00694000
                         specifies a secondary capability that may be  *00695000
                         applied to certain types of CPUs in the       *00696000
                         configuration. Regardless of encoding, a      *00697000
                         lower number indicates a proportionally       *00698000
                         higher CPU capability. There is no formal     *00699000
                         description of the algorithm used to generate  00700000
*                        this integer, except that it is the same      *00701000
                         algorithm used to generate the CPU            *00702000
                         capability. The integer is used as an         *00703000
                         indication of the capability of a CPU         *00704000
                         relative to the capability of other CPU       *00705000
                         models, and also relative to the capability   *00706000
                         of other CPU types within a model. When the   *00707000
                         value is zero, all CPUs of any CPU type in    *00708000
                         the configuration have the same capability,   *00709000
                         as specified by the CPU capability.            00710000
SI22V1CPUCAPABILITY DS CL4 If bits 0-8 are 0, this is an unsigned      *00711000
                         32-bit binary integer. Otherwise this is a    *00712000
                         32-bit binary floating point short format     *00713000
                         number. Regardless of encoding, a lower       *00714000
                         number indicates a proportionally higher CPU  *00715000
                         capability. This field specifies the          *00716000
                         capability of one of the CPUs contained in    *00717000
                         the configuration. There is no formal         *00718000
                         description of the algorithm used to generate *00719000
                         this integer. It is used as an indication of   00720000
*                        the capability of the CPU relative to the     *00721000
                         capability of other CPU models.                00722000
SI22V1TOTALCPUCOUNT DS BL2 A 16-bit unsigned binary integer that       *00723000
                         specifies the total number of CPUs contained  *00724000
                         in the physical machine configuration. This   *00725000
                         number includes all CPUs in the configured    *00726000
                         state, the standby state, or the reserved     *00727000
                         state.                                         00728000
SI22V1CONFIGUREDCPUCOUNT DS BL2 A 16-bit unsigned binary integer that  *00729000
                         specifies the total number of CPUs that are   *00730000
                         in the configured state in the physical       *00731000
                         machine configuration. A CPU is in the        *00732000
                         configured state when it is in the            *00733000
                         configuration and available to be used to     *00734000
                         execute programs.                              00735000
SI22V1STANDBYCPUCOUNT DS BL2 A 16-bit unsigned binary integer that     *00736000
                         specifies the total number of CPUs that are   *00737000
                         in the standby state in the physical machine  *00738000
                         configuration. A CPU is in the standby state  *00739000
                         when it is in the configuration, is not       *00740000
                         available to be used to execute programs, but *00741000
                         can be used to execute programs by issuing    *00742000
                         instructions to place it in the configured    *00743000
                         state. It may be possible to place a reserved *00744000
                         CPU in the standby or configured state by      00745000
*                        means of manual actions.                       00746000
SI22V1RESERVEDCPUCOUNT DS BL2 A 16-bit unsigned binary integer that    *00747000
                         specifies the total number of CPUs that are   *00748000
                         in the reserved state in the physical machine *00749000
                         configuration. A CPU is in the reserved state *00750000
                         when it is in the configuration, is not       *00751000
                         available to be used to execute programs, and *00752000
                         cannot be made available by issuing           *00753000
                         instructions to place it in the configured    *00754000
                         state. It may be possible to place a reserved *00755000
                         CPU in the standby or configured state by      00756000
*                        means of manual actions.                       00757000
SI22V1MPCPUCAPABILITYAFS DS CL4052 A series of contiguous 2-byte       *00758000
                         fields, each containing a 16-bit unsigned     *00759000
                         binary integer which is an adjustment factor  *00760000
                         (fraction) for the value contained in the     *00761000
                         CPU-capability field. Such a fraction is      *00762000
                         developed by using the value (V) of the first *00763000
                         two-byte field according to one of the        *00764000
                         following methods: - If V is in the range 0 < *00765000
                         V <= 100, a denominator of 100 is indicated   *00766000
                         which produces a fraction of V/100. - If V is  00767000
*                        in the range 100 < V <= 255, a denominator of *00768000
                         255 is indicated which produces a fraction of *00769000
                         V/255. - If V is in the range 255 < V <=      *00770000
                         65,535, a denominator of 65,535 is indicated  *00771000
                         which produces a fraction of V/65,535. Thus,  *00772000
                         the fraction represented by each two-byte     *00773000
                         field is then developed by dividing the       *00774000
                         contents of a twobyte field by the indicated  *00775000
                         denominator. The number of adjustment-factor  *00776000
                         fields is one less than the number of CPUs     00777000
*                        specified in the total-CPU-count field. The   *00778000
                         adjustment-factor fields correspond to        *00779000
                         configurations with increasing numbers of     *00780000
                         CPUs in the configured state. The first       *00781000
                         adjustment-factor field corresponds to a      *00782000
                         configuration with two CPUs. Each successive  *00783000
                         adjustment-factor field corresponds to a      *00784000
                         configuration with a number of CPUs that is   *00785000
                         one more than that for the preceding field.    00786000
         ORG   SI22V1MPCPUCAPABILITYAFS                                 00787000
SI22V1MPCPUCAPABILITYAF DS CL2 Each individual adjustment factor.       00788000
         ORG   SI22V1MPCPUCAPABILITYAFS+4052                            00789000
SI22V1_LEN EQU *-SI22V1                                                 00790000
.L0026   ANOP                                                           00791000
         AIF   ('&SI22V1ALT' EQ 'NO').L002A                             00792000
         AIF   ('&DSECT' EQ 'YES').L002B                                00793000
         AIF   ('&SI22V1ALT' NE 'YES').L002A                            00794000
.L002B   ANOP                                                           00795000
*                                                                       00796000
* ********************************************************************  00797000
* * SI22V1Alt maps the area located within the SI22V1 area by the    *  00798000
* * SI22V1AccOffset field, when the SI22V1Format field has a value   *  00799000
* * of one.                                                          *  00800000
* ********************************************************************  00801000
*                                                                       00802000
*                                                                       00803000
         AIF   ('&DSECT' EQ 'YES').L002C                                00804000
SI22V1ALT DS   0F                                                       00805000
         AGO   .L002D                                                   00806000
.L002C   ANOP                                                           00807000
SI22V1ALT DSECT                                                         00808000
.L002D   ANOP                                                           00809000
SI22V1ALTCPUCAPABILITY DS F If bits 0-8 are 0, this is an unsigned     *00810000
                         32-bit binary integer. Otherwise this is a    *00811000
                         32-bit binary floating point short format     *00812000
                         number. This field specifies the announced    *00813000
                         capability of one of the CPUs in the          *00814000
                         configuration. There is no formal description *00815000
                         of the algorithm used to generate this        *00816000
                         integer. The integer is used as an indication *00817000
                         of the announced capability of the CPU        *00818000
                         relative to the announced capability of other  00819000
*                        CPU models. The alternate-capability value    *00820000
                         applies to each of the CPUs in the            *00821000
                         configuration. That is, all CPUs in the       *00822000
                         configuraiton have the same alternate         *00823000
                         capability.                                    00824000
SI22V1ALTMPCPUCAPABILITYAFS DS CL4052 A series of contiguous 2-byte    *00825000
                         fields, each containing a 16-bit unsigned     *00826000
                         binary integer which is an adjustment factor  *00827000
                         (fraction) for the value contained in the     *00828000
                         altternate-CPU- capability field. Such a      *00829000
                         fraction is developed by using the value (V)  *00830000
                         of the first two-byte field according to one  *00831000
                         of the following methods: - If V is in the    *00832000
                         range 0 < V <= 100, a denominator of 100 is   *00833000
                         indicated which produces a fraction of V/100.  00834000
*                        - If V is in the range 100 < V <= 255, a      *00835000
                         denominator of 255 is indicated which         *00836000
                         produces a fraction of V/255. - If V is in    *00837000
                         the range 255 < V <= 65,535, a denominator of *00838000
                         65,535 is indicated which produces a fraction *00839000
                         of V/65,535. Thus, the fraction represented   *00840000
                         by each two-byte field is then developed by   *00841000
                         dividing the contents of a twobyte field by   *00842000
                         the indicated denominator. The number of      *00843000
                         alternate-adjustment-factor fields is one      00844000
*                        less than the number of CPUs specified in the *00845000
                         total-CPU-count field. The alternate-         *00846000
                         adjustment-factor fields correspond to        *00847000
                         configurations with increasing numbers of     *00848000
                         CPUs in the configured state. The first       *00849000
                         alternate-adjustment-factor field corresponds *00850000
                         to a configuration with two CPUs in the       *00851000
                         configured state. Each successive alternate-  *00852000
                         adjustment-factor field corresponds to a      *00853000
                         configuration with a number of CPUs in the     00854000
*                        configurd state that is more than that for    *00855000
                         the preceding field.                           00856000
         ORG   SI22V1ALTMPCPUCAPABILITYAFS                              00857000
SI22V1ALTMPCPUCAPABILITYAF DS CL2 Each individual adjustment factor.    00858000
         ORG   SI22V1ALT+4056                                           00859000
SI22V1ALT_LEN EQU *-SI22V1ALT                                           00860000
.L002A   ANOP                                                           00861000
         AIF   ('&SI22V2' EQ 'NO').L002E                                00862000
         AIF   ('&DSECT' EQ 'YES').L002F                                00863000
         AIF   ('&SI22V2' NE 'YES').L002E                               00864000
.L002F   ANOP                                                           00865000
*                                                                       00866000
* ********************************************************************  00867000
* * SI22V2 represents the output for a level-2 configuration when    *  00868000
* * information is requested about the set of CPUs                   *  00869000
* ********************************************************************  00870000
*                                                                       00871000
*                                                                       00872000
         AIF   ('&DSECT' EQ 'YES').L0030                                00873000
SI22V2   DS    0D                                                       00874000
         AGO   .L0031                                                   00875000
.L0030   ANOP                                                           00876000
SI22V2   DSECT                                                          00877000
.L0031   ANOP                                                           00878000
         DS    CL32      Reserved                                       00879000
SI22V2LPARNUMBER DS BL2  A 16-bit unsigned binary integer which is the *00880000
                         number of the level-2 configuration. This     *00881000
                         number distinguishes the configuration from   *00882000
                         all other level-2 configurations provided by  *00883000
                         the same logical-partition hypervisor          00884000
         ORG   SI22V2LPARNUMBER                                         00885000
SI22V2CPCNUMBER DS BL2                                                  00886000
         DS    CL1       Reserved                                       00887000
SI22V2LCPUCHARACTERISTICS DS CL1 The characteristics of the logical    *00888000
                         CPUs that are provided for the level-2        *00889000
                         configuration                                  00890000
*  Bit definitions:                                                     00891000
SI22V2LCPUDEDICATED EQU X'80' When one, indicates that one or more of  *00892000
                         the logical CPUs for this level-2             *00893000
                         configuration are provided using level-1 CPUs *00894000
                         that are dedicated to this level-2            *00895000
                         configuration and are not used to provide     *00896000
                         logical CPUs for any other level-2            *00897000
                         configuration. The number of logical CPUs     *00898000
                         that are provided using dedicated level-1     *00899000
                         CPUs is specified by the dedicated-LCPU-count *00900000
                         value. When zero, bit 0 indicates that none    00901000
*                        of the logical CPUs for this level-2          *00902000
                         configuration are provided using level-1 CPUs *00903000
                         that are dedicated to this level-2            *00904000
                         configuration.                                 00905000
SI22V2LCPUSHARED EQU X'40' When one, indicates that one or more of the *00906000
                         logical CPUs for this level-2 configuration   *00907000
                         are provided using level-1 CPUs that can be   *00908000
                         used to provide logical CPUs for other        *00909000
                         level-2 configurations. The number of logical *00910000
                         CPUs that are provided using shared V1 CPUs   *00911000
                         is specified by the shared-LCPU-count value.  *00912000
                         When zero, it indicates that none of the      *00913000
                         logical CPUs for this level-2 configuration   *00914000
                         are provided using shared level-1 CPUs.        00915000
SI22V2LCPUULIMIT EQU X'20' Utilization limit: When one, indicates that *00916000
                         the amount of use of the level-1 CPUs that    *00917000
                         are used to provide the logical CPUs for this *00918000
                         level-2 configuration is limited. When zero,  *00919000
                         it indicates that the amount of use of the    *00920000
                         level-1 CPUs that are used to provide the     *00921000
                         logical CPUs for this level-2 configuration   *00922000
                         is unlimited.                                  00923000
SI22V2TOTALLCPUCOUNT DS BL2 A 16-bit unsigned binary integer that      *00924000
                         specifies the total number of logical CPUs    *00925000
                         that are provided for this level-2            *00926000
                         configuration. This number includes all of    *00927000
                         the logical CPUs that are in the configured   *00928000
                         state, the standby state, and the reserved    *00929000
                         state.                                         00930000
SI22V2CONFIGUREDLCPUCOUNT DS BL2 A 16-bit unsigned binary integer that *00931000
                         specifies the total number of logical CPUs    *00932000
                         for this level-2 configuration that are in    *00933000
                         the configured state. A logical CPU is in the *00934000
                         configured state when it is in the level-2    *00935000
                         configuration definition and is available to  *00936000
                         be used to execute programs.                   00937000
SI22V2STANDBYLCPUCOUNT DS BL2 A 16-bit unsigned binary integer that    *00938000
                         specifies the number of logical CPUs for this *00939000
                         level-2 configuration that are in the standby *00940000
                         state. A logical CPU is in the standby state  *00941000
                         when it is in the level-2 configuration, is   *00942000
                         not available to be used to execute programs, *00943000
                         and can be made available by issuing          *00944000
                         instructions to place it in the the           *00945000
                         configured state.                              00946000
SI22V2RESERVEDLCPUCOUNT DS BL2 A 16-bit unsigned binary integer that   *00947000
                         specifies the total number of CPUs for this   *00948000
                         level-2 configuration that are in the         *00949000
                         reserved state. A logical CPU is in the       *00950000
                         reserved state when it is in the level-2      *00951000
                         configuration, is not available to be used to *00952000
                         execute programs, and cannot be made          *00953000
                         available by issuing instructions to place it *00954000
                         in the configured state. It may be possible   *00955000
                         to place the reserved CPU in the standby or    00956000
*                        configured state through manually initiated   *00957000
                         actions                                        00958000
SI22V2LPARNAME DS CL8    The 8-character EBCDIC name of this level-2   *00959000
                         configuration. The name is left-justified     *00960000
                         with trailing blank characters if necessary.   00961000
         ORG   SI22V2LPARNAME                                           00962000
SI22V2CPCNAME DS CL8                                                    00963000
SI22V2LPARCAPABILITYAF DS CL4 Capability Adjustment Factor (CAF). An   *00964000
                         32-bit unsigned binary integer with a value   *00965000
                         of 1000 or less. The adjustment factor        *00966000
                         specifies the amount of the underlying        *00967000
                         level-1-configuration capability that is      *00968000
                         allowed to be used for this level-2           *00969000
                         configuration by the LPAR hypervisor. The     *00970000
                         fraction of level-1-configuration capability  *00971000
                         is determined by dividing the CAF value by    *00972000
                         1000.                                          00973000
         ORG   SI22V2LPARCAPABILITYAF                                   00974000
SI22V2CPCCAPABILITYAF DS CL4                                            00975000
SI22V2LPARORIGIN DS CL8  A 64-bit unsigned binary integer, called a    *00976000
                         logical partition origin, which represents    *00977000
                         the relocation-zone origin of the logical     *00978000
                         partition                                      00979000
SI22V2_MT_INSTALLED_INFO DS B                                           00980000
*  Bit definitions:                                                     00981000
SI22V2_MT_INSTALLED EQU X'80' MT facility installed                     00982000
SI22V2_MT_MAXTHREADID EQU X'1F' The maximum thread ID for a core.       00983000
SI22V2_MT_GENERAL_INFO DS B                                             00984000
*  Bit definitions:                                                     00985000
SI22V2_DIAG040 EQU X'20' Diagnostic data. This field is for IBM use    *00986000
                         only                                           00987000
SI22V2_MT_CPMAXTHREADID EQU X'1F' The maximum configurable thread ID   *00988000
                         for a core comprising general CPUs             00989000
SI22V2_PSMTID_INFO DS B                                                 00990000
*  Bit definitions:                                                     00991000
SI22V2_PSMTID EQU X'1F'                                                 00992000
         DS    CL5       Reserved                                       00993000
SI22V2DEDICATEDLCPUCOUNT DS BL2 A 16-bit unsigned binary integer that  *00994000
                         specifies the number of configured-state      *00995000
                         logical CPUs for this level-2 configuration   *00996000
                         that are provided using dedicated level-1     *00997000
                         CPUs. (See the description of bit             *00998000
                         SI22V2LCPUDedicated.)                          00999000
SI22V2SHAREDLCPUCOUNT DS BL2 A 16-bit unsigned binary integer that     *01000000
                         specifies the number of configured-state      *01001000
                         logical CPUs for this level-2 configuration   *01002000
                         that are provided using shared level-1 CPUs.  *01003000
                         (See the description of bit                   *01004000
                         SI22V2LCPUShared.)                             01005000
         DS    CL3       Reserved                                       01006000
SI22V2VSNAMEENCODING DS X an 8-bit unsigned integer indicating whether *01007000
                         virtual-server information is provided in     *01008000
                         fields SI22V2VSName and SI22V2VSUUID, and if  *01009000
                         so, the encoding of the virtual-server-name   *01010000
                         field, SI22V2VSName, as follows: Value        *01011000
                         Meaning Equate 0 Virtual-server information   *01012000
                         is not provided SI22_ExtNameNotProvided 1     *01013000
                         EBCDIC SI22_ExtNameEbcdic 2 UTF-8             *01014000
                         SI22_ExtNameUTF8 3-255 Reserved                01015000
SI22V2VSUUID DS CL16     When virtual-server information is provided,  *01016000
                         contains a 128- bit binary universally-unique *01017000
                         identification (UUID, also known as a handle) *01018000
                         of the virtual server for this configuration. *01019000
                         Set to zeros when virtual-server information  *01020000
                         is not provided.                               01021000
         DS    CL160     Reserved                                       01022000
SI22V2VSNAME DS CL256    When virtual-server information is provided,  *01023000
                         contain a 256-byte name of the virtual server *01024000
                         for this configuration. The virtual-server    *01025000
                         name is left justified in the field. If the   *01026000
                         name is less than 256 bytes, the field is     *01027000
                         padded on the right with zeros.               *01028000
                         SI22V2VSNameEncoding indicates the encoding   *01029000
                         of the virtual-server-name field. When        *01030000
                         virtual-server information is not provided,   *01031000
                         SI22V2VSName is reserved and may be stored as  01032000
*                        zeros or may remain unchanged.                 01033000
         DS    CL3584    Reserved                                       01034000
SI22V2_LEN EQU *-SI22V2                                                 01035000
.L002E   ANOP                                                           01036000
         AIF   ('&SI22V3' EQ 'NO').L0032                                01037000
         AIF   ('&DSECT' EQ 'YES').L0033                                01038000
         AIF   ('&SI22V3' NE 'YES').L0032                               01039000
.L0033   ANOP                                                           01040000
*                                                                       01041000
* ********************************************************************  01042000
* * SI22V3 represents the output for a level-3 configuration when    *  01043000
* * information is requested about the set of CPUs                   *  01044000
* ********************************************************************  01045000
*                                                                       01046000
*                                                                       01047000
         AIF   ('&DSECT' EQ 'YES').L0034                                01048000
SI22V3   DS    0D                                                       01049000
         AGO   .L0035                                                   01050000
.L0034   ANOP                                                           01051000
SI22V3   DSECT                                                          01052000
.L0035   ANOP                                                           01053000
         DS    CL28      Reserved                                       01054000
         DS    CL3       Reserved                                       01055000
SI22V3DBCOUNTFIELD DS B                                                 01056000
*  Bit definitions:                                                     01057000
SI22V3DBCOUNT EQU X'0F'  Description Block Count. A 4-bit unsigned     *01058000
                         binary integer that indicates the number (up  *01059000
                         to 8) of virtual machine description blocks   *01060000
                         that are stored in the SI22V3DBs field.        01061000
SI22V3DBS DS   CL512     From 1 to 8 64-byte virtual machine           *01062000
                         description blocks, depending on the number   *01063000
                         of nested level-3 configurations, if any, and *01064000
                         their processing characteristics.              01065000
         ORG   SI22V3DBS                                                01066000
SI22V3DBE DS   CL64      An individual entry, mapped by dsect SI22V3DB  01067000
         ORG   SI22V3DBS+512                                            01068000
         DS    CL1504    Reserved                                       01069000
SI22V3EXTVMNAMES DS CL2048 Array of 256-byte extended virtual machine  *01070000
                         names. For each provided SI22V3DBE, there is  *01071000
                         a corresponding SI22V3ExtVMName. The          *01072000
                         SI22V3DBExtVmNameEncoding field of a SI22V3DB *01073000
                         indicates the encoding of the corresponding   *01074000
                         extended VM name. When                        *01075000
                         SI22V3DBExtVmNameEncoding is zero, the        *01076000
                         corresponding extended-VM name field is       *01077000
                         stored as zeros.                               01078000
         ORG   SI22V3EXTVMNAMES                                         01079000
SI22V3EXTVMNAME DS CL256 An individual extended-VM-name entry          *01080000
                         corresponding to the SI22V3DBE. Left          *01081000
                         justified and padded to the right with zeros. *01082000
                         If the leftmost byte contains zeros, no       *01083000
                         extended VM name is provided regardless of    *01084000
                         the corresponding SI22V3DBExtVmNameEncoding   *01085000
                         value.                                         01086000
         ORG   SI22V3EXTVMNAMES+2048                                    01087000
SI22V3_LEN EQU *-SI22V3                                                 01088000
.L0032   ANOP                                                           01089000
         AIF   ('&SI22V3DB' EQ 'NO').L0036                              01090000
         AIF   ('&DSECT' EQ 'YES').L0037                                01091000
         AIF   ('&SI22V3DB' NE 'YES').L0036                             01092000
.L0037   ANOP                                                           01093000
*                                                                       01094000
* ********************************************************************  01095000
* * SI22V3DB is a description block that comprises part of the       *  01096000
* * SI22V3 data.                                                     *  01097000
* ********************************************************************  01098000
*                                                                       01099000
*                                                                       01100000
         AIF   ('&DSECT' EQ 'YES').L0038                                01101000
SI22V3DB DS    0D        V3 Description Block. When a level-3          *01102000
                         configuration is provided by a                *01103000
                         virtual-machine control program and the       *01104000
                         control program is being executed by a        *01105000
                         level-3 configuration provided by another     *01106000
                         virtual-machine control program, the level-3  *01107000
                         configurations are said to be "nested."       *01108000
                         Level-3 configurations can be nested in this  *01109000
                         way for several levels. The collection of     *01110000
                         nested level-3 configurations that is in the   01111000
*                        path between a program being executed by a    *01112000
                         level-3 configuration and the basic machine   *01113000
                         is called a "level-3 configuration stack."    *01114000
                         The level-3 configurations provided by a      *01115000
                         virtual-machine control program being         *01116000
                         executed by either a level-2 configuration or *01117000
                         a level-1 configuration is the                *01118000
                         lowest-numbered (0) level-3 configuration in  *01119000
                         the stack. The level-3 configuration that is  *01120000
                         executing the program containing this          01121000
*                        instruction is the highest numbered (N)       *01122000
                         level-3 configuration in the stack. If more   *01123000
                         than one virtual-machine description block is *01124000
                         stored, the blocks are stored according to    *01125000
                         the following rules: 1.The collection of      *01126000
                         level-3 configurations described is a         *01127000
                         contiguous subset of the total collection of  *01128000
                         level-3 configurations in the level-3         *01129000
                         configuration stack. The subset always        *01130000
                         includes the highest numbered level-3          01131000
*                        configuration in the stack. One or more       *01132000
                         level-3 configuraitons at the bottom of the   *01133000
                         stack may not be described because STSI is    *01134000
                         not implemented by the highest of those       *01135000
                         configurations or the limit of eight          *01136000
                         description blocks would be exceeded. 2.The   *01137000
                         highest-numbered level-3 configuration in the *01138000
                         level-3 configuration stack is always         *01139000
                         described by the first description block. The *01140000
                         lowest-numbered level-3 configuration in the   01141000
*                        stack, of those that are included in the      *01142000
                         subset that is described, is described by the *01143000
                         last description block provided.               01144000
         AGO   .L0039                                                   01145000
.L0038   ANOP                                                           01146000
SI22V3DB DSECT           V3 Description Block. When a level-3          *01147000
                         configuration is provided by a                *01148000
                         virtual-machine control program and the       *01149000
                         control program is being executed by a        *01150000
                         level-3 configuration provided by another     *01151000
                         virtual-machine control program, the level-3  *01152000
                         configurations are said to be "nested."       *01153000
                         Level-3 configurations can be nested in this  *01154000
                         way for several levels. The collection of     *01155000
                         nested level-3 configurations that is in the   01156000
*                        path between a program being executed by a    *01157000
                         level-3 configuration and the basic machine   *01158000
                         is called a "level-3 configuration stack."    *01159000
                         The level-3 configurations provided by a      *01160000
                         virtual-machine control program being         *01161000
                         executed by either a level-2 configuration or *01162000
                         a level-1 configuration is the                *01163000
                         lowest-numbered (0) level-3 configuration in  *01164000
                         the stack. The level-3 configuration that is  *01165000
                         executing the program containing this          01166000
*                        instruction is the highest numbered (N)       *01167000
                         level-3 configuration in the stack. If more   *01168000
                         than one virtual-machine description block is *01169000
                         stored, the blocks are stored according to    *01170000
                         the following rules: 1.The collection of      *01171000
                         level-3 configurations described is a         *01172000
                         contiguous subset of the total collection of  *01173000
                         level-3 configurations in the level-3         *01174000
                         configuration stack. The subset always        *01175000
                         includes the highest numbered level-3          01176000
*                        configuration in the stack. One or more       *01177000
                         level-3 configuraitons at the bottom of the   *01178000
                         stack may not be described because STSI is    *01179000
                         not implemented by the highest of those       *01180000
                         configurations or the limit of eight          *01181000
                         description blocks would be exceeded. 2.The   *01182000
                         highest-numbered level-3 configuration in the *01183000
                         level-3 configuration stack is always         *01184000
                         described by the first description block. The *01185000
                         lowest-numbered level-3 configuration in the   01186000
*                        stack, of those that are included in the      *01187000
                         subset that is described, is described by the *01188000
                         last description block provided.               01189000
.L0039   ANOP                                                           01190000
         DS    CL4       Reserved                                       01191000
SI22V3DBTOTALLCPUCOUNT DS BL2 A 16-bit unsigned binary integer that    *01192000
                         specifies the number of logical CPUs for this *01193000
                         level-3 configuration. This number includes   *01194000
                         all of the logical CPUs that are in the       *01195000
                         configured state, the standby state, and the  *01196000
                         reserved state.                                01197000
SI22V3DBCONFIGUREDLCPUCOUNT DS BL2 A 16-bit unsigned binary integer    *01198000
                         that specifies the number of logical CPUs for *01199000
                         this level-3 configuration that are in the    *01200000
                         configured state. A logical CPU is in the     *01201000
                         configured state when it is in the level-3    *01202000
                         configuration and is available to be used to  *01203000
                         execute programs.                              01204000
SI22V3DBSTANDBYLCPUCOUNT DS BL2 A 16-bit unsigned binary integer that  *01205000
                         specifies the number of logical CPUs for this *01206000
                         level-3 configuration that are in the standby *01207000
                         state. A logical CPU is in the standby state  *01208000
                         when it is in the level-3 configuration, is   *01209000
                         not available to be used to execute programs, *01210000
                         and can be made available by issuing          *01211000
                         instructions to place it in the configured    *01212000
                         state.                                         01213000
SI22V3DBRESERVEDLCPUCOUNT DS BL2 A 16-bit unsigned binary integer that *01214000
                         specifies the number of logical CPUs for this *01215000
                         level-3 configuration that are in the         *01216000
                         reserved state. A logical CPU is in the       *01217000
                         reserved state when it is in the level-3      *01218000
                         configuration, is not available to be used to *01219000
                         execute programs, and cannot be made          *01220000
                         available by issuing instructions to place it *01221000
                         in the configured state. It may be possible   *01222000
                         to place the CPU in the standby or configured  01223000
*                        state through manual actions                   01224000
SI22V3DBVMNAME DS CL8    The 8-character EBCDIC name of this level-3   *01225000
                         configuration. The name is left-justified     *01226000
                         with trailing blank characters if necessary.   01227000
         ORG   SI22V3DBVMNAME                                           01228000
SI22V3DBCPCNAME DS CL8                                                  01229000
SI22V3DBVMCAF DS CL4     A 4-byte unsigned binary integer that         *01230000
                         specifies an adjustment factor. The           *01231000
                         adjustment factor specifies the amount of the *01232000
                         underlying level-1-, level-2-, or             *01233000
                         level-3-configuration cpability that is       *01234000
                         allowed to be used for this level-3           *01235000
                         configuration by the virtual-machine control  *01236000
                         program. The fraction of the underlying       *01237000
                         capability is determined by dividing the CAF  *01238000
                         value by 1000.                                 01239000
         ORG   SI22V3DBVMCAF                                            01240000
SI22V3DBCPCCAF DS CL4                                                   01241000
SI22V3DBCPIDENTIFIER DS CL16 The 16-character EBCDIC identifier of the *01242000
                         virtual-machine control program that provides *01243000
                         this level-3 configuration. This identifier   *01244000
                         may include qualifiers such as version number *01245000
                         and release level. The identifier is          *01246000
                         left-justified with trailing blank characters *01247000
                         if necessary.                                  01248000
         ORG   SI22V3DBCPIDENTIFIER                                     01249000
SI22V3DBVMHPIDENTIFIER DS CL16                                          01250000
         DS    CL3       Reserved                                       01251000
SI22V3DBEXTVMNAMEENCODING DS X Extended Virtual Machine Name Encoding  *01252000
                         -- an 8-bit unsigned integer indicating       *01253000
                         whether a corresponding SI22V3ExtVMName is    *01254000
                         provided, and if so, the encoding of the      *01255000
                         SI22V3ExtVMName as follows: Value Meaning     *01256000
                         Equate 0 Extended virtual-machine name is not *01257000
                         provided SI22_ExtNameNotProvided 1 EBCDIC     *01258000
                         SI22_ExtNameEbcdic 2 UTF-8 SI22_ExtNameUTF8   *01259000
                         3-255 Reserved. When zero, an extended        *01260000
                         virtual machine name is not provided for this  01261000
*                        configuration.                                 01262000
         DS    CL4       Reserved                                       01263000
SI22V3DBUUID DS CL16     Universally-Unique Identification (UUID):     *01264000
                         When not zero, comprises a UUID of the        *01265000
                         virtual machine configuration. When zero, no  *01266000
                         UUID was provided.                             01267000
SI22_EXTNAMENOTPROVIDED EQU 0 Extended name is not provided             01268000
SI22_EXTNAMEEBCDIC EQU 1 Extended name is EBCDIC encoded                01269000
SI22_EXTNAMEUTF8 EQU 2   Extended name is UTF-8 encoded                 01270000
SI22V3DB_LEN EQU *-SI22V3DB                                             01271000
.L0036   ANOP                                                           01272000
         AIF   ('&ZCBPRINT' EQ 'NO').P3                                 01273000
         AIF   ('&LIST' EQ 'YES').P4                                    01274000
.P3      ANOP                                                           01275000
         POP   PRINT                                                    01276000
.P4      ANOP                                                           01277000
.P_EXIT  ANOP                                                           01278000
         MEND                                                           01279000
**/ ;                                                                   01280000
* %CSRSIIDF_INCLUDED = 'YES';                                           01281000
* %DCL ZCBPRINT CHAR EXT;                                               01282000
* %DEACTIVATE ZCBPRINT;                                                 01283000
* %DCL CSRSIIDF_LIST CHAR EXT;                                          01284000
* %DEACTIVATE CSRSIIDF_LIST;                                            01285000
* %IF CSRSIIDF_LIST = 'NO' !                                            01286000
*    ZCBPRINT = 'NO' %THEN                                              01287000
* %DO;                                                                  01288000
*   @LIST PUSH NOECHO;                                                  01289000
*   @LIST NOASSEMBLE NOECHO;                                            01290000
*   @LIST OFF C NOECHO;                                                 01291000
* %END;                                                                 01292000
*/* Start of PL/X Source                                             */ 01293000
*                                                                       01294000
*/********************************************************************/ 01295000
*/* SI00 represents the "starter" information                        */ 01296000
*/********************************************************************/ 01297000
*DCL 1 SI00 CHAR(64) BDY(DWORD) TYPE /*                          @01A*/ 01298000
*    ,2 SI00CPCVariety FIXED(8) /* SI00CPCVariety_V1CPC_Machine,        01299000
*                                 SI00CPCVariety_V2CPC_LPAR, or         01300000
*                                 SI00CPCVariety_V3CPC_VM        @01A*/ 01301000
*    ,2 SI00ValidityFlags BIT(8)  /* Validity flags              @01A*/ 01302000
*      ,3 SI00ValidSI11V1 BIT(1) /* SI11V1 was requested and the        01303000
*                                 information returned is valid  @01A*/ 01304000
*      ,3 SI00ValidSI22V1 BIT(1) /* SI22V1 was requested and the        01305000
*                                 information returned is valid  @01A*/ 01306000
*      ,3 SI00ValidSI22V2 BIT(1) /* SI22V2 was requested and the        01307000
*                                 information returned is valid  @01A*/ 01308000
*      ,3 SI00ValidSI22V3 BIT(1) /* SI22V3 was requested and the        01309000
*                                 information returned is valid  @01A*/ 01310000
*      ,3 * BIT(4)             /* Reserved                       @01A*/ 01311000
*    ,2 * CHAR(2)              /* Reserved                       @01A*/ 01312000
*    ,2 SI00PCCACPID CHAR(12)  /* PCCACPID value (CPU ID) for this      01313000
*                                 CPU                            @01A*/ 01314000
*    ,2 SI00PCCACPUA CHAR(2)   /* PCCACPUA value for this CPU    @01A*/ 01315000
*    ,2 SI00PCCACAFM CHAR(2)   /* PCCACAFM value for this CPU.          01316000
*                                 This has information only about       01317000
*                                 CPUs 0-15                      @L2C*/ 01318000
*    ,2 * CHAR(4)              /* Reserved                       @01A*/ 01319000
*    ,2 SI00LastUpdateTimestamp CHAR(8)  /* STCK timestamp when system  01320000
*                                 last re-issued STSI to retrieve the   01321000
*                                 most current information. A           01322000
*                                 capacity upgrade on demand event      01323000
*                                 is one event that results in this     01324000
*                                 update. The field is 0's if the       01325000
*                                 information has not been retrieved    01326000
*                                 since IPL.                     @01A*/ 01327000
*    ,2 SI00PCCA_PartialCpuMask CHAR(8) /* PCCA_PartialCpuMask          01328000
*                                 value for this CPU.            @L8A*/ 01329000
*      ,3 SI00PCCA_CPU_Address_Mask CHAR(8) /* PCCA_CPU_ADDRESS_MASK    01330000
*                                 value for this CPU.            @L8C*/ 01331000
*    ,2 SI00PCCA_PartialCpuMaskOffset FIXED(16) /*                      01332000
*                                 PCCA_PartialCpuMaskOffset value       01333000
*                                 for this CPU                   @L8A*/ 01334000
*      ,3 SI00PCCA_CPU_Address_Mask_Offset FIXED(16) /*                 01335000
*                                 PCCA_CPU_ADDRESS_MASK_OFFSET value    01336000
*                                 for this CPU                   @L8C*/ 01337000
*    ,2 * CHAR(14)             /* Reserved                       @02C*/ 01338000
*    ,2 SI00NonInterface       /* Not a programming interface    @02A*/ 01339000
*      ,3 SI00NonInterfac1     /* Not a programming interface    @02A*/ 01340000
*        ,5 SI00LastEventTimestamp CHAR(8)                    /* @02A*/ 01341000
*    ,2 * CHAR(0) BDY(DWORD)   /* Reserved                       @01A*/ 01342000
*    ;                         /* Reserved                       @01A*/ 01343000
*                                                                       01344000
*/********************************************************************/ 01345000
*/* SI00 Constants                                                   */ 01346000
*/********************************************************************/ 01347000
*                                                                       01348000
*DCL SI00CPCVariety_V1CPC_Machine  FIXED(31) CONSTANT(1);  /* Value     01349000
*                 for a V1 CPC (not LPAR, not VM)                @01A*/ 01350000
*DCL SI00CPCVariety_V2CPC_LPAR     FIXED(31) CONSTANT(2);  /* Value     01351000
*                 for a V2 CPC (LPAR)                            @01A*/ 01352000
*DCL SI00CPCVariety_V3CPC_VM       FIXED(31) CONSTANT(3);  /* Value     01353000
*                 for a V3 CPC (VM)                              @01A*/ 01354000
*                                                                       01355000
*/********************************************************************  01356000
* *      Constants for Parameters and Return Codes                   *  01357000
* ********************************************************************/ 01358000
*                                                                       01359000
*/* Store System Information Constants                               */ 01360000
*                                                                       01361000
*DCL CSRSI_Request_V1CPC_Machine   FIXED(31) CONSTANT(1);  /* Requests  01362000
*                 information about a V1 CPC (not LPAR, not VM)  @01A*/ 01363000
*DCL CSRSI_Request_V2CPC_LPAR      FIXED(31) CONSTANT(2);  /* Requests  01364000
*                 information about a V2 CPC (LPAR)              @01A*/ 01365000
*DCL CSRSI_Request_V3CPC_VM        FIXED(31) CONSTANT(4);  /* Requests  01366000
*                 information about a V3 CPC (VM)                @01A*/ 01367000
*                                                                       01368000
*/* Store System Information Return Codes                            */ 01369000
*/* Note: 0C4 abend if bad address provided in parmlist or user data */ 01370000
*                                                                       01371000
*DCL CSRSI_Success                 FIXED(31) CONSTANT(0);  /*           01372000
*                 CSRSI service completed successfully           @01A*/ 01373000
*                                                                       01374000
*DCL CSRSI_STSINotAvailable        FIXED(31) CONSTANT(4);  /*           01375000
*                 STSI instruction is not available on this system.     01376000
*                 Only the SI00PCCACPID, SI00PCCACPUA, SI00PCCACAFM     01377000
*                 fields are valid.                                     01378000
*                                                                @01A*/ 01379000
*                                                                       01380000
*DCL CSRSI_ServiceNotAvailable     FIXED(31) CONSTANT(8);  /*           01381000
*                 CSRSI service is not available on this system.        01382000
*                                                                @01A*/ 01383000
*                                                                       01384000
*DCL CSRSI_BadRequest              FIXED(31) CONSTANT(12); /* The       01385000
*                 request parameter did not specify a word with a       01386000
*                 value formed from adding any combination of           01387000
*                 CSRSI_Request_V1CPC_Machine,                          01388000
*                 CSRSI_Request_V2CPC_LPAR, and                         01389000
*                 CSRSI_Request_V3CPC_VM.                        @01A*/ 01390000
*DCL CSRSI_BadInfoAreaLen          FIXED(31) CONSTANT(16); /* The       01391000
*                 value of the InfoAreaLen parameter does not match     01392000
*                 the length needed to accomodate the requested data.   01393000
*                                                                @01A*/ 01394000
*DCL CSRSI_BadLock                 FIXED(31) CONSTANT(20);  /*          01395000
*                 Service was called holding a system lock              01396000
*                 other than CPU, LOCAL/CML, CMS                 @01A*/ 01397000
*                                                                       01398000
*/* Service Entry Declarations                                      */  01399000
*                                                                       01400000
*%DCL EHAMAPS CHAR EXTERNAL;             /*                      @01A*/ 01401000
*%IF INDEX(EHAMAPS,'XM@')=0 %THEN        /*                      @01A*/ 01402000
*   %EHAMAPS = EHAMAPS !! 'XM@';         /*                      @01A*/ 01403000
*                                                                       01404000
*DCL CSRSIRequest Fixed(31) TYPE;        /*                      @01A*/ 01405000
*DCL CSRSIInfoAreaLen Fixed(31) TYPE;    /*                      @01A*/ 01406000
*DCL CSRSIInfoArea CHAR(*) TYPE;         /*                      @01A*/ 01407000
*DCL CSRSIReturnCode Fixed(31) TYPE;     /*                      @01A*/ 01408000
*                                                                       01409000
*DCL CSRSI ENTRY                                                        01410000
*     (Request:=Isa(CSRSIRequest) INPUT  ] Request type                 01411000
*     ,InfoAreaLen:=Isa(CSRSIInfoAreaLen) INPUT                         01412000
*     ,InfoArea:=Isa(CSRSIInfoArea) OUTPUT                              01413000
*     ,ReturnCode:=Isa(CSRSIReturnCode) OUTPUT) ] return code           01414000
*    OPTIONS(AMODE(31) ENV(PRIMARY))                                    01415000
*    BASED (((XM@CVT+0220x)->I031P+30x)->I031P)                         01416000
*    VALRG(*);                           /*                      @01A*/ 01417000
*                                                                       01418000
*/********************************************************************/ 01419000
*/* SIV1 represents the information returned when V1CPC_Machine      */ 01420000
*/* data is requested                                                */ 01421000
*/********************************************************************/ 01422000
*DCL 1 SIV1 TYPE               /*                                @01A*/ 01423000
*      ,3 SIV1SI00 CHAR(LENGTH(SI00)) BDY(DWORD)   /* Area mapped       01424000
*                                 by dsect SI00                  @01A*/ 01425000
*      ,3 SIV1SI11V1 CHAR(LENGTH(SI11V1)) BDY(DWORD)   /* Area mapped   01426000
*                                 by dsect SI11V1                @01A*/ 01427000
*      ,3 SIV1SI22V1 CHAR(LENGTH(SI22V1)) BDY(DWORD)   /* Area mapped   01428000
*                                 by dsect SI22V1                @01A*/ 01429000
*      ;                                                                01430000
*                                                                       01431000
*/********************************************************************/ 01432000
*/* SIV1V2 represents the information returned when V1CPC_Machine    */ 01433000
*/* data and V2CPC_LPAR data is requested                            */ 01434000
*/********************************************************************/ 01435000
*DCL 1 SIV1V2 TYPE             /*                                @01A*/ 01436000
*      ,3 SIV1V2SI00 CHAR(LENGTH(SI00)) BDY(DWORD) /* Area mapped       01437000
*                                 by dsect SI00                  @01A*/ 01438000
*      ,3 SIV1V2SI11V1 CHAR(LENGTH(SI11V1)) BDY(DWORD) /* Area mapped   01439000
*                                 by dsect SI11V1                @01A*/ 01440000
*      ,3 SIV1V2SI22V1 CHAR(LENGTH(SI22V1)) BDY(DWORD) /* Area mapped   01441000
*                                 by dsect SI22V1                @01A*/ 01442000
*      ,3 SIV1V2SI22V2 CHAR(LENGTH(SI22V2)) BDY(DWORD) /* Area mapped   01443000
*                                 by dsect SI22V2                @01A*/ 01444000
*      ;                                                                01445000
*                                                                       01446000
*/********************************************************************/ 01447000
*/* SIV1V2V3 represents the information returned when V1CPC_Machine  */ 01448000
*/* data, V2CPC_LPAR data and V3CPC_VM data is requested             */ 01449000
*/********************************************************************/ 01450000
*DCL 1 SIV1V2V3 TYPE           /*                                @01A*/ 01451000
*      ,3 SIV1V2V3SI00 CHAR(LENGTH(SI00)) BDY(DWORD) /* Area mapped     01452000
*                                 by dsect SI00                  @01A*/ 01453000
*      ,3 SIV1V2V3SI11V1 CHAR(LENGTH(SI11V1)) BDY(DWORD) /* Area mapped 01454000
*                                 by dsect SI11V1                @01A*/ 01455000
*      ,3 SIV1V2V3SI22V1 CHAR(LENGTH(SI22V1)) BDY(DWORD) /* Area mapped 01456000
*                                 by dsect SI22V1                @01A*/ 01457000
*      ,3 SIV1V2V3SI22V2 CHAR(LENGTH(SI22V2)) BDY(DWORD) /* Area mapped 01458000
*                                 by dsect SI22V2                @01A*/ 01459000
*      ,3 SIV1V2V3SI22V3 CHAR(LENGTH(SI22V3)) BDY(DWORD) /* Area mapped 01460000
*                                 by dsect SI22V3                @01A*/ 01461000
*      ;                                                                01462000
*                                                                       01463000
*/********************************************************************/ 01464000
*/* SIV1V3 represents the information returned when V1CPC_Machine    */ 01465000
*/* data and V3CPC_VM data is requested                              */ 01466000
*/********************************************************************/ 01467000
*DCL 1 SIV1V3 TYPE             /*                                @01A*/ 01468000
*      ,3 SIV1V3SI00 CHAR(LENGTH(SI00)) BDY(DWORD) /* Area mapped       01469000
*                                 by dsect SI00                  @01A*/ 01470000
*      ,3 SIV1V3SI11V1 CHAR(LENGTH(SI11V1)) BDY(DWORD) /* Area mapped   01471000
*                                 by dsect SI11V1                @01A*/ 01472000
*      ,3 SIV1V3SI22V1 CHAR(LENGTH(SI22V1)) BDY(DWORD) /* Area mapped   01473000
*                                 by dsect SI22V1                @01A*/ 01474000
*      ,3 SIV1V3SI22V3 CHAR(LENGTH(SI22V3)) BDY(DWORD) /* Area mapped   01475000
*                                 by dsect SI22V3                @01A*/ 01476000
*      ;                                                                01477000
*                                                                       01478000
*/********************************************************************/ 01479000
*/* SIV2 represents the information returned when V2CPC_LPAR         */ 01480000
*/* data is requested                                                */ 01481000
*/********************************************************************/ 01482000
*DCL 1 SIV2 TYPE               /*                                @01A*/ 01483000
*      ,3 SIV2SI00 CHAR(LENGTH(SI00)) BDY(DWORD)   /* Area mapped       01484000
*                                 by dsect SI00                  @01A*/ 01485000
*      ,3 SIV2SI22V2 CHAR(LENGTH(SI22V2)) BDY(DWORD)   /* Area mapped   01486000
*                                 by dsect SI22V2                @01A*/ 01487000
*      ;                                                                01488000
*                                                                       01489000
*/********************************************************************/ 01490000
*/* SIV2V3 represents the information returned when V2CPC_LPAR       */ 01491000
*/* and V3CPC_VM data is requested                                   */ 01492000
*/********************************************************************/ 01493000
*DCL 1 SIV2V3 TYPE             /*                                @01A*/ 01494000
*      ,3 SIV2V3SI00 CHAR(LENGTH(SI00)) BDY(DWORD) /* Area mapped       01495000
*                                 by dsect SI00                  @01A*/ 01496000
*      ,3 SIV2V3SI22V2 CHAR(LENGTH(SI22V2)) BDY(DWORD) /* Area mapped   01497000
*                                 by dsect SI22V2                @01A*/ 01498000
*      ,3 SIV2V3SI22V3 CHAR(LENGTH(SI22V3)) BDY(DWORD) /* Area mapped   01499000
*                                 by dsect SI22V3                @01A*/ 01500000
*      ;                                                                01501000
*                                                                       01502000
*/********************************************************************/ 01503000
*/* SIV3 represents the information returned when V3CPC_VM           */ 01504000
*/* data is requested                                                */ 01505000
*/********************************************************************/ 01506000
*DCL 1 SIV3 TYPE               /*                                @01A*/ 01507000
*      ,3 SIV3SI00 CHAR(LENGTH(SI00)) BDY(DWORD)   /* Area mapped       01508000
*                                 by dsect SI00                  @01A*/ 01509000
*      ,3 SIV3SI22V3 CHAR(LENGTH(SI22V3)) BDY(DWORD)   /* Area mapped   01510000
*                                 by dsect SI22V3                @01A*/ 01511000
*      ;                                                                01512000
*                                                                       01513000
*/********************************************************************/ 01514000
*/* SI11V1 represents the output for a level-1 configuration when    */ 01515000
*/* general configuration information is requrested                  */ 01516000
*/********************************************************************/ 01517000
*DCL 1 SI11V1 CHAR(4096) BDY(DWORD) TYPE  /*                     @01A*/ 01518000
*    ,2 SI11V1FLAGS BIT(8)     /* Flag(s)                        @01A*/ 01519000
*      ,3 SI11V1_TypeNPctgV Bit(1)   /* When 1, the type-percentage     01520000
*                                 bytes, located in words 40-41, are    01521000
*                                 valid. When 0, the bytes are stored   01522000
*                                 as zeroes but have no meaning  @L6A*/ 01523000
*      ,3 * Bit(5)             /* Reserved                       @L9C*/ 01524000
*      ,3 SI11V1_MTInstalled Bit(1)                           /* @04A*/ 01525000
*      ,3 SI11V1_Transient  Bit(1)   /* When 1, indicates that the      01526000
*                                 condition represented by SI11V1CCR    01527000
*                                 and SI11V1CAI fields is relatively    01528000
*                                 transient                      @03A*/ 01529000
*    ,2 * CHAR(1)              /* Reserved                       @01A*/ 01530000
*    ,2 SI11V1CCR FIXED(8)     /* Capacity-Change Reason.               01531000
*                                 When SI11V1CAI is nonzero, SI11V1CCR  01532000
*                                 indicates the reason which is         01533000
*                                 associated with the present values    01534000
*                                 contained in SI11V1.                  01535000
*                                 When SI11V1CAI is zero, SI11V1CCR     01536000
*                                 is undefined and stored as zero.      01537000
*                                                                @L6A*/ 01538000
*    ,2 SI11V1CAI FIXED(8)     /* Capacity-Adjustment Indication.       01539000
*                                 When zero, the indication is not      01540000
*                                 reported. When in the range 1-99,     01541000
*                                 some amount of reduction is           01542000
*                                 indicated. When 100, the machine is   01543000
*                                 operating at its normal capacity.     01544000
*                                                                @L6A*/ 01545000
*    ,2 * CHAR(5*4)            /* Reserved                       @LBC*/ 01546000
*    ,2 SI11V1FirmwareID CHAR(8) /* When non-zero, information about    01547000
*                                 currently installed internal code.    01548000
*                                 The definition of the information     01549000
*                                 conveyed is model-dependent.          01550000
*                                                                @LBA*/ 01551000
*    ,2 SI11V1CPCManufacturer CHAR(16) /* The 16-character (0-9 or      01552000
*                                 uppercase A-Z) EBCDIC name of the     01553000
*                                 manufacturer of the configuration.    01554000
*                                 The name                              01555000
*                                 is left-justified with trailing blank 01556000
*                                 characters if necessary.              01557000
*                                                                @01A*/ 01558000
*    ,2 SI11V1CPCType CHAR(4)          /* The 4-character (0-9)         01559000
*                                 EBCDIC type identifier of the         01560000
*                                 configuration.                        01561000
*                                                                @01A*/ 01562000
*    ,2 SI11V1CPCMaxPU FIXED(15) /* When non-zero, the maximum          01563000
*                                 processing cores potentially          01564000
*                                 available.                     @LDA*/ 01565000
*    ,2 * CHAR(2)              /* Reserved                       @LDA*/ 01566000
*    ,2 * CHAR(2*4)            /* Reserved                       @LDC*/ 01567000
*    ,2 SI11V1CPCModel CHAR(16)        /* The 16-character (0-9 or      01568000
*                                 uppercase A-Z) EBCDIC model           01569000
*                                 identifier of the configuration.      01570000
*                                 The identifier is left-justified      01571000
*                                 with trailing blank characters        01572000
*                                 if necessary. Valid only if the       01573000
*                                 first word of SI11V1CPCModel1         01574000
*                                 is zero                        @01A*/ 01575000
*      ,3 SI11V1CPCModelCapIdent CHAR(16) /* The 16-character (0-9 or   01576000
*                                 uppercase A-Z) EBCDIC model capacity  01577000
*                                 identifier of the configuration.      01578000
*                                 The identifier is left-justified      01579000
*                                 with trailing blank characters        01580000
*                                 if necessary.                  @H1C*/ 01581000
*    ,2 SI11V1CPCSequenceCode CHAR(16) /* The 16-character (0-9 or      01582000
*                                 uppercase A-Z) EBCDIC sequence        01583000
*                                 code of the configuration. The        01584000
*                                 sequence code is right-justified      01585000
*                                 with leading EBCDIC zeroes            01586000
*                                 if necessary.                         01587000
*                                                                @01A*/ 01588000
*    ,2 SI11V1CPCPlantOfManufacture CHAR(4) /* The 4-character (0-9 or  01589000
*                                 uppercase A-Z) EBCDIC plant code      01590000
*                                 that identifies the plant of          01591000
*                                 manufacture for the configuration.    01592000
*                                 The plant code is left-justified with 01593000
*                                 trailing blank characters             01594000
*                                 if necessary.                         01595000
*                                                                @01A*/ 01596000
*    ,2 SI11V1CPCModel1 CHAR(16)        /* The 16-character (0-9 or     01597000
*                                 uppercase A-Z) EBCDIC model           01598000
*                                 identifier of the configuration.      01599000
*                                 The identifier is left-justified      01600000
*                                 with trailing blank characters        01601000
*                                 if necessary. Valid only when         01602000
*                                 first word is not zero. Otherwise,    01603000
*                                 field SI111VCPCModelCapIdent          01604000
*                                 represents both the                   01605000
*                                 model-capacity identifier             01606000
*                                 and the model.                 @H1A*/ 01607000
*    ,2 SI11V1CPCModelPermCapIdent CHAR(16) /* When non-zero,           01608000
*                                 the 16-character (0-9 or              01609000
*                                 uppercase A-Z) EBCDIC model           01610000
*                                 permanent capacity identifier         01611000
*                                 of the configuration.                 01612000
*                                 The identifier is left-justified      01613000
*                                 with trailing blank characters        01614000
*                                 if necessary.                  @H4A*/ 01615000
*    ,2 SI11V1CPCModelTempCapIdent CHAR(16) /* When non-zero,           01616000
*                                 the 16-character (0-9 or              01617000
*                                 uppercase A-Z) EBCDIC model           01618000
*                                 temporary capacity identifier         01619000
*                                 of the configuration.                 01620000
*                                 The identifier is left-justified      01621000
*                                 with trailing blank characters        01622000
*                                 if necessary.                  @H4A*/ 01623000
*    ,2 SI11V1CPCModelCapRating FIXED(32) /* When non-zero,             01624000
*                                 an unsigned integer whose value is    01625000
*                                 associated with the model capacity    01626000
*                                 as identified by field                01627000
*                                 SI11V1CPCModelCapIdent.               01628000
*                                                                @H4A*/ 01629000
*    ,2 SI11V1CPCModelPermCapRating FIXED(32) /* When non-zero,         01630000
*                                 an unsigned integer whose value is    01631000
*                                 associated with the model permanent   01632000
*                                 capacity as identified by field       01633000
*                                 SI11V1CPCModelPermCapIdent.           01634000
*                                                                @H4A*/ 01635000
*    ,2 SI11V1CPCModelTempCapRating FIXED(32) /* When non-zero,         01636000
*                                 an unsigned integer whose value is    01637000
*                                 associated with the model temporary   01638000
*                                 capacity as identified by field       01639000
*                                 SI11V1CPCModelTempCapIdent.           01640000
*                                                                @H4A*/ 01641000
*    ,2 SI11V1DIAG CHAR(8)     /* Name no longer used            @H3A*/ 01642000
*    ,3 SI11V1TypeNPctg CHAR(8)   /*                                    01643000
*   Type N Pctg: Each of the byte fields contains an 8-bit              01644000
*   unsigned binary integer whose value is in the range 0-100           01645000
*   and represents a percentage. When non-zero, the percentage          01646000
*   may be used to affect the use and allowed utilization of            01647000
*   the secondary-CPUs whose CPU type corresponds to the                01648000
*   particular byte.  When a byte in this range contains a              01649000
*   value of zero, use rules of the corresponding secondary-CPU         01650000
*   type are not overridden.                                         */ 01651000
*      ,4 SI11V1_TYPE1Pctg Fixed(8)                           /* @L6A*/ 01652000
*      ,4 SI11V1_TYPE2Pctg Fixed(8)                           /* @L6A*/ 01653000
*      ,4 SI11V1_TYPE3Pctg Fixed(8)                           /* @L6A*/ 01654000
*      ,4 SI11V1_TYPE4Pctg Fixed(8)                           /* @L6A*/ 01655000
*      ,4 SI11V1_TYPE5Pctg Fixed(8)                           /* @L6A*/ 01656000
*      ,4 * CHAR(3)            /* Reserved                       @L6A*/ 01657000
*    ,2 SI11V1_NomMCR Fixed(32)  /* Nominal Model-Capacity Rating.      01658000
*                                 When non-zero, an unsigned integer    01659000
*                                 whose value is associated with the    01660000
*                                 nominal model capacity as             01661000
*                                 identified by                         01662000
*                                 SI11V1CPCModelCapIdent         @L6A*/ 01663000
*    ,2 SI11V1_NomMPCR Fixed(32) /* Nominal Model-Permanent-Capacity.   01664000
*                                 Rating.                               01665000
*                                 When non-zero, an unsigned integer    01666000
*                                 whose value is associated with the    01667000
*                                 nominal model-permanent capacity as   01668000
*                                 identified by                         01669000
*                                 SI11V1CPCModelPermCapIdent     @L6A*/ 01670000
*    ,2 SI11V1_NomMTCR Fixed(32) /* Nominal Model-Temporary-Capacity    01671000
*                                 Rating.                               01672000
*                                 When non-zero, an unsigned integer    01673000
*                                 whose value is associated with the    01674000
*                                 nominal model-temporary capacity as   01675000
*                                 identified by                         01676000
*                                 SI11V1CPCModelTempCapIdent     @L6A*/ 01677000
*    ,2 * CHAR(3*4)            /* Reserved                       @LCA*/ 01678000
*    ,2 SI11V1_zCBP_MCI Char(16) /* zCBP Model-Capacity Identifier.     01679000
*                                 When nonzero,a 16-Character EBCDIC    01680000
*                                 model-capacity identifier of the zCBP 01681000
*                                 configuration. The field is left      01682000
*                                 justified with trailing blanks if     01683000
*                                 necessary.                     @LCA*/ 01684000
*    ,2 SI11V1_zCBP_MCR Fixed(32) /* zCBP Model-Capacity Rating.        01685000
*                                 When non-zero, an unsigned integer    01686000
*                                 whose value is associated with the    01687000
*                                 zCBP model capacity as identified by  01688000
*                                 SI11V1_zCBP_MCI                @LCA*/ 01689000
*    ,2 SI11V1_zCBP_NomMCR Fixed(32) /* zCBP Nominal Model-Capacity     01690000
*                                 Rating. When nonzero, an unsigned     01691000
*                                 integer whose value is associated     01692000
*                                 with the nominal zCBP model capacity  01693000
*                                 as identified by SI11V1_zCBP_MCI.     01694000
*                                 Attributes of this field are similar  01695000
*                                 to those of SI11V1_NomMCR.     @LCA*/ 01696000
*    ,2 SI11V1_Diag0D8 Char(48) /* Diagnostic data for IBM use only     01697000
*                                                                @LCA*/ 01698000
*    ,2 SI11V1_LinuxLicenseTier Fixed(16) /* When non-zero, a 16-bit    01699000
*                                 unsigned integer whose value          01700000
*                                 represents the tier of embedded       01701000
*                                 Linux license entitled on the         01702000
*                                 system.                        @LEA*/ 01703000
*    ,2 * CHAR(2)              /* Reserved                       @LEA*/ 01704000
*    ,2 * CHAR(957*4)          /* Reserved                       @LEC*/ 01705000
*    ,2 * CHAR(0) BDY(DWORD);  /* DWORD-align the ending         @01A*/ 01706000
*                                                                       01707000
*/********************************************************************/ 01708000
*/* SI22V1 represents the output for a level-1 configuration when    */ 01709000
*/* information is requested about the set of CPUs                   */ 01710000
*/********************************************************************/ 01711000
*DCL 1 SI22V1 CHAR(4096) BDY(DWORD) TYPE /*                      @01A*/ 01712000
*    ,2 SI22V1Format Fixed(8)           /* When the value is 1,         01713000
*                                 the ACCOffset field is valid   @L1A*/ 01714000
*    ,2 * CHAR(1)              /* Reserved                       @L1A*/ 01715000
*    ,2 SI22V1ACCOffset Fixed(16)       /* Alternate Cpu Capability     01716000
*                                 Offset. A 16-bit unsigned binary      01717000
*                                 integer that specifies the offset in  01718000
*                                 bytes of the alternate-CPU-capability 01719000
*                                 area (which is physically within      01720000
*                                 the SI22V1 area, and is mapped by     01721000
*                                 DSECT SI22V1ALT)               @L1A*/ 01722000
*    ,2 SI22V1_MT_Installed_Info Bit(8)     /* Data about MT     @04A*/ 01723000
*      ,3 SI22V1_MT_Installed Bit(1)    /* MT facility installed @04A*/ 01724000
*      ,3 * Bit(2)             /* Reserved                       @04A*/ 01725000
*      ,3 SI22V1_MT_MaxThreadID Bit(5)  /* The maximum thread           01726000
*                                 ID for a core.                 @04A*/ 01727000
*    ,2 SI22V1_MT_General_Info Bit(8)   /* Data about MT.               01728000
*                                 Meaningful only when                  01729000
*                                 SI22V1_MT_Installed            @04A*/ 01730000
*      ,3 * Bit(2)             /* Reserved                       @04A*/ 01731000
*      ,3 SI22V1_Diag005 Bit(1)  /* Diagnostic data. This field is      01732000
*                                 for IBM use only               @04A*/ 01733000
*      ,3 SI22V1_MT_CpMaxThreadID Bit(5)  /* The maximum                01734000
*                                 configurable thread ID for a core     01735000
*                                 comprising general CPUs        @04A*/ 01736000
*    ,2 * Bit(16)              /* Reserved                       @04A*/ 01737000
*    ,2 * CHAR(2*4)            /* Reserved                       @04C*/ 01738000
*    ,2 SI22V1PrimaryCPUSpeed Fixed(32)   /* Primary CPU Speed (cycles  01739000
*                                            per microsecond)    @04A*/ 01740000
*    ,2 SI22V1SecondaryCPUSpeed Fixed(32) /* Secondary CPU Speed        01741000
*                                           (cycles per microsecond)    01742000
*                                                                @04A*/ 01743000
*    ,2 SI22V1_NomCC Fixed(32) /* Nominal CPU Capability.               01744000
*                                 When not 0, this word is formatted    01745000
*                                 and encoded the same as the CPU       01746000
*                                 Capability word. When SI11V1CAI is    01747000
*                                 zero, this word is 0. The nonzero     01748000
*                                 value equals the value in             01749000
*                                 SI22V1CpuCapability when SI11V1CAI    01750000
*                                 is 100. When                          01751000
*                                 SI11V1CAI is nonzero and less than    01752000
*                                 100, this field indicates a           01753000
*                                 CPU speed greater than the CPU speed  01754000
*                                 in SI22V1CpuCapability         @L6A*/ 01755000
*    ,2 SI22V1SecondaryCPUCapability CHAR(4) /*                         01756000
*                                 If bits 0-8 are 0, this is            01757000
*                                 an unsigned 32-bit binary integer.    01758000
*                                 Otherwise this is a 32-bit binary     01759000
*                                 floating point short format number.   01760000
*                                 When not zero, this field specifies   01761000
*                                 a secondary capability that may be    01762000
*                                 applied to certain types of CPUs in   01763000
*                                 the configuration.                    01764000
*                                 Regardless of encoding, a lower       01765000
*                                 number indicates a proportionally     01766000
*                                 higher CPU capability.                01767000
*                                 There is no formal description of the 01768000
*                                 algorithm used to generate this       01769000
*                                 integer, except that it is the same   01770000
*                                 algorithm used to generate the CPU    01771000
*                                 capability. The integer is used as an 01772000
*                                 indication of the capability of a CPU 01773000
*                                 relative to the capability of other   01774000
*                                 CPU models, and also relative to the  01775000
*                                 capability of other CPU types within  01776000
*                                 a model.                              01777000
*                                 When the value is zero, all CPUs of   01778000
*                                 any CPU type in the configuration     01779000
*                                 have the same capability, as          01780000
*                                 specified by the CPU capability.      01781000
*                                                                @H2A*/ 01782000
*    ,2 SI22V1CpuCapability CHAR(4)     /*                              01783000
*                                 If bits 0-8 are 0, this is            01784000
*                                 an unsigned 32-bit binary integer.    01785000
*                                 Otherwise this is a 32-bit binary     01786000
*                                 floating point short format number.   01787000
*                                 Regardless of encoding, a lower       01788000
*                                 number indicates a proportionally     01789000
*                                 higher CPU capability.                01790000
*                                 This field                            01791000
*                                 specifies the capability of one       01792000
*                                 of the CPUs contained in the          01793000
*                                 configuration.                        01794000
*                                 There is no formal description of the 01795000
*                                 algorithm used to generate this       01796000
*                                 integer.                              01797000
*                                 It is used as an indication of the    01798000
*                                 capability of the CPU relative to     01799000
*                                 the capability of other CPU models.   01800000
*                                                                @01A*/ 01801000
*    ,2 SI22V1TotalCpuCount BIT(16)     /* A 16-bit unsigned binary     01802000
*                                 integer that specifies the total      01803000
*                                 number of CPUs contained in the       01804000
*                                 physical machine configuration.       01805000
*                                 This number includes all CPUs         01806000
*                                 in the configured state, the standby  01807000
*                                 state, or the reserved state.         01808000
*                                                                @01A*/ 01809000
*    ,2 SI22V1ConfiguredCpuCount BIT(16) /* A 16-bit unsigned binary    01810000
*                                 integer that specifies the total      01811000
*                                 number of CPUs that are in the        01812000
*                                 configured state in the physical      01813000
*                                 machine configuration. A CPU is in    01814000
*                                 the configured state when it is       01815000
*                                 in the configuration                  01816000
*                                 and available to be                   01817000
*                                 used to execute programs.             01818000
*                                                                @01A*/ 01819000
*    ,2 SI22V1StandbyCpuCount BIT(16)   /* A 16-bit unsigned binary     01820000
*                                 integer that specifies the total      01821000
*                                 number of CPUs that are in the        01822000
*                                 standby state in the physical machine 01823000
*                                 configuration. A CPU is in the        01824000
*                                 standby state when it is              01825000
*                                 in the configuration,                 01826000
*                                 is not available to be                01827000
*                                 used to execute programs, but can     01828000
*                                 be used to execute programs by        01829000
*                                 issuing instructions to place it in   01830000
*                                 the configured state. It may be       01831000
*                                 possible to place a reserved CPU in   01832000
*                                 the standby or configured state       01833000
*                                 by means of manual actions.           01834000
*                                                                @01A*/ 01835000
*    ,2 SI22V1ReservedCpuCount BIT(16)   /* A 16-bit unsigned binary    01836000
*                                 integer that specifies the total      01837000
*                                 number of CPUs that are in the        01838000
*                                 reserved state in the physical        01839000
*                                 machine configuration. A CPU is in    01840000
*                                 the reserved state when it is         01841000
*                                 in the configuration,                 01842000
*                                 is not available to be                01843000
*                                 used to execute programs, and cannot  01844000
*                                 be made available                     01845000
*                                 by issuing                            01846000
*                                 instructions to place it in the       01847000
*                                 configured state. It may be possible  01848000
*                                 to place a reserved CPU in the        01849000
*                                 standby or configured state by means  01850000
*                                 of manual actions.                    01851000
*                                                                @01A*/ 01852000
*    ,2 SI22V1MpCpuCapabilityAFs CHAR(1013*4)  /*                       01853000
*                                 A series of contiguous 2-byte fields, 01854000
*                                 each containing a 16-bit unsigned     01855000
*                                 binary integer which is an adjustment 01856000
*                                 factor (fraction) for the value       01857000
*                                 contained in the CPU-capability       01858000
*                                 field.                                01859000
*                                 Such a fraction is developed by using 01860000
*                                 the value (V) of the first two-byte   01861000
*                                 field according to one of the         01862000
*                                 following methods:                    01863000
*                                 - If V is in the range 0 < V <= 100,  01864000
*                                 a denominator of 100 is indicated     01865000
*                                 which produces a fraction of V/100.   01866000
*                                 - If V is in the range 100 < V <=     01867000
*                                 255, a denominator of 255 is          01868000
*                                 indicated which produces a fraction   01869000
*                                 of V/255.                             01870000
*                                 - If V is in the range 255 < V <=     01871000
*                                 65,535, a denominator of 65,535 is    01872000
*                                 indicated which produces a fraction   01873000
*                                 of V/65,535.                          01874000
*                                 Thus, the fraction represented by     01875000
*                                 each two-byte field is then developed 01876000
*                                 by dividing the contents of a twobyte 01877000
*                                 field by the indicated denominator.   01878000
*                                 The number of adjustment-factor       01879000
*                                 fields is one less than the number    01880000
*                                 of CPUs specified in the              01881000
*                                 total-CPU-count field. The            01882000
*                                 adjustment-factor fields correspond   01883000
*                                 to configurations with increasing     01884000
*                                 numbers of CPUs in the configured     01885000
*                                 state. The first adjustment-factor    01886000
*                                 field corresponds to a                01887000
*                                 configuration with                    01888000
*                                 two CPUs. Each successive             01889000
*                                 adjustment-factor field corresponds   01890000
*                                 to a configuration                    01891000
*                                 with a number of CPUs                 01892000
*                                 that is one more than that for        01893000
*                                 the preceding field.                  01894000
*                                                                @L1C*/ 01895000
*    ,3 SI22V1MpCpuCapabilityAF CHAR(2) /* Each individual              01896000
*                                 adjustment factor.                    01897000
*                                                                @01A*/ 01898000
*    ,2 * CHAR(0) BDY(DWORD);  /* DWORD-align the ending         @01A*/ 01899000
*/********************************************************************/ 01900000
*/* SI22V1Alt maps the area located within the SI22V1 area by the    */ 01901000
*/* SI22V1AccOffset field, when the SI22V1Format field has a value   */ 01902000
*/* of one.                                                          */ 01903000
*/********************************************************************/ 01904000
*DCL 1 SI22V1Alt CHAR(4056) TYPE BDY(WORD) /*                   @L1A*/  01905000
*    ,2 SI22V1AltCpuCapability Fixed(32)  /*                            01906000
*                                 If bits 0-8 are 0, this is            01907000
*                                 an unsigned 32-bit binary integer.    01908000
*                                 Otherwise this is a 32-bit binary     01909000
*                                 floating point short format number.   01910000
*                                 This field specifies the announced    01911000
*                                 capability of one of the CPUs in the  01912000
*                                 configuration. There is no formal     01913000
*                                 description of the algorithm used to  01914000
*                                 generate this integer. The integer is 01915000
*                                 used as an indication of the          01916000
*                                 announced capability of the CPU       01917000
*                                 relative to the announced capability  01918000
*                                 of other CPU models.                  01919000
*                                 The alternate-capability value        01920000
*                                 applies to each of the CPUs in the    01921000
*                                 configuration. That is, all CPUs in   01922000
*                                 the configuraiton have the same       01923000
*                                 alternate capability.                 01924000
*                                                                @L1A*/ 01925000
*    ,2 SI22V1AltMpCpuCapabilityAFs CHAR(1013*4)  /*                    01926000
*                                 A series of contiguous 2-byte fields, 01927000
*                                 each containing a 16-bit unsigned     01928000
*                                 binary integer which is an adjustment 01929000
*                                 factor (fraction) for the value       01930000
*                                 contained in the altternate-CPU-      01931000
*                                 capability field.                     01932000
*                                 Such a fraction is developed by using 01933000
*                                 the value (V) of the first two-byte   01934000
*                                 field according to one of the         01935000
*                                 following methods:                    01936000
*                                 - If V is in the range 0 < V <= 100,  01937000
*                                 a denominator of 100 is indicated     01938000
*                                 which produces a fraction of V/100.   01939000
*                                 - If V is in the range 100 < V <=     01940000
*                                 255, a denominator of 255 is          01941000
*                                 indicated which produces a fraction   01942000
*                                 of V/255.                             01943000
*                                 - If V is in the range 255 < V <=     01944000
*                                 65,535, a denominator of 65,535 is    01945000
*                                 indicated which produces a fraction   01946000
*                                 of V/65,535.                          01947000
*                                 Thus, the fraction represented by     01948000
*                                 each two-byte field is then developed 01949000
*                                 by dividing the contents of a twobyte 01950000
*                                 field by the indicated denominator.   01951000
*                                 The number of                         01952000
*                                 alternate-adjustment-factor           01953000
*                                 fields is one less than the number    01954000
*                                 of CPUs specified in the              01955000
*                                 total-CPU-count field. The alternate- 01956000
*                                 adjustment-factor fields correspond   01957000
*                                 to configurations                     01958000
*                                 with increasing numbers of CPUs in    01959000
*                                 the configured state. The first       01960000
*                                 alternate-adjustment-factor           01961000
*                                 field corresponds to a configuration  01962000
*                                 with two CPUs in the configured       01963000
*                                 state. Each successive alternate-     01964000
*                                 adjustment-factor field corresponds   01965000
*                                 to a configuration with a number of   01966000
*                                 CPUs in the configurd state that is   01967000
*                                 more than that for the preceding      01968000
*                                 field.                         @L1A*/ 01969000
*      ,3 SI22V1AltMpCpuCapabilityAF CHAR(2) /* Each individual         01970000
*                                 adjustment factor.             @L1A*/ 01971000
*    ;                                                                  01972000
*/********************************************************************/ 01973000
*/* SI22V2 represents the output for a level-2 configuration when    */ 01974000
*/* information is requested about the set of CPUs                   */ 01975000
*/********************************************************************/ 01976000
*DCL 1 SI22V2 CHAR(4096) BDY(DWORD) TYPE /*                      @01A*/ 01977000
*    ,2 * CHAR(8*4)            /* Reserved                       @01A*/ 01978000
*    ,2 SI22V2LparNumber BIT(16)  /* A 16-bit unsigned binary integer   01979000
*                                 which is the number of the            01980000
*                                 level-2 configuration.                01981000
*                                 This number distinguishes the         01982000
*                                 configuration from all other level-2  01983000
*                                 configurations provided               01984000
*                                 by the same logical-partition         01985000
*                                 hypervisor                            01986000
*                                                                @01A*/ 01987000
*      ,3 SI22V2CpcNumber BIT(16)                                       01988000
*    ,2 * CHAR(1)              /* Reserved                       @01A*/ 01989000
*    ,2 SI22V2LCPUCharacteristics CHAR(1)  /* The characteristics of    01990000
*                                 the logical CPUs that are provided    01991000
*                                 for the level-2 configuration         01992000
*                                                                @01A*/ 01993000
*      ,3 SI22V2LCPUDedicated BIT(1)  /* When one, indicates that one   01994000
*                                 or more of the logical CPUs for this  01995000
*                                 level-2 configuration are provided    01996000
*                                 using level-1 CPUs that are dedicated 01997000
*                                 to this level-2 configuration         01998000
*                                 and are not used to provide logical   01999000
*                                 CPUs for any other level-2            02000000
*                                 configuration. The number of logical  02001000
*                                 CPUs that are provided using          02002000
*                                 dedicated level-1 CPUs is specified   02003000
*                                 by the dedicated-LCPU-count value.    02004000
*                                 When zero, bit 0 indicates that none  02005000
*                                 of the logical CPUs for this level-2  02006000
*                                 configuration are provided using      02007000
*                                 level-1 CPUs that are dedicated to    02008000
*                                 this level-2 configuration.           02009000
*                                                                @01A*/ 02010000
*      ,3 SI22V2LCPUShared BIT(1)  /* When one, indicates that one      02011000
*                                 or more of the logical CPUs for this  02012000
*                                 level-2 configuration are provided    02013000
*                                 using level-1 CPUs                    02014000
*                                 that can be used to provide logical   02015000
*                                 CPUs for other level-2                02016000
*                                 configurations. The                   02017000
*                                 number of logical CPUs that are       02018000
*                                 provided using shared V1 CPUs is      02019000
*                                 specified by the shared-LCPU-count    02020000
*                                 value.                                02021000
*                                 When zero, it indicates that none     02022000
*                                 of the logical CPUs for this          02023000
*                                 level-2 configuration are provided    02024000
*                                 using shared level-1 CPUs.            02025000
*                                                                @01A*/ 02026000
*      ,3 SI22V2LCPUULIMIT BIT(1)   /* Utilization limit: When one,     02027000
*                                 indicates that the amount of use      02028000
*                                 of the level-1 CPUs that are used to  02029000
*                                 provide the logical CPUs for this     02030000
*                                 level-2 configuration is limited.     02031000
*                                 When zero, it indicates that the      02032000
*                                 amount of use of the level-1 CPUs     02033000
*                                 that are used to provide the logical  02034000
*                                 CPUs for this level-2                 02035000
*                                 configuration is unlimited.           02036000
*                                                                @01A*/ 02037000
*      ,3 * BIT(5)                  /* Reserved                  @01A*/ 02038000
*    ,2 SI22V2TotalLCPUCount BIT(16)    /* A 16-bit unsigned binary     02039000
*                                 integer that specifies the total      02040000
*                                 number of logical CPUs that are       02041000
*                                 provided for this level-2             02042000
*                                 configuration. This number            02043000
*                                 includes all of the logical CPUs that 02044000
*                                 are in the configured state, the      02045000
*                                 standby state, and the reserved       02046000
*                                 state.                                02047000
*                                                                @01A*/ 02048000
*    ,2 SI22V2ConfiguredLCPUCount BIT(16) /* A 16-bit unsigned binary   02049000
*                                 integer that specifies the total      02050000
*                                 number of logical CPUs for this       02051000
*                                 level-2 configuration                 02052000
*                                 that are in the configured            02053000
*                                 state. A logical CPU is in the        02054000
*                                 configured state when it is           02055000
*                                 in the level-2                        02056000
*                                 configuration                         02057000
*                                 definition and is available to be     02058000
*                                 used to execute programs.             02059000
*                                                                @01A*/ 02060000
*    ,2 SI22V2StandbyLCPUCount BIT(16)  /* A 16-bit unsigned binary     02061000
*                                 integer that specifies the number of  02062000
*                                 logical CPUs for this level-2         02063000
*                                 configuration that are in the         02064000
*                                 standby state.                        02065000
*                                 A logical CPU is in the standby state 02066000
*                                 when it is in the level-2             02067000
*                                 configuration, is not available to be 02068000
*                                 used to execute programs, and can be  02069000
*                                 made available by issuing             02070000
*                                 instructions to place it in the       02071000
*                                 the configured state.                 02072000
*                                                                @01A*/ 02073000
*    ,2 SI22V2ReservedLCPUCount BIT(16)  /* A 16-bit unsigned binary    02074000
*                                 integer that specifies the total      02075000
*                                 number of CPUs for this level-2       02076000
*                                 configuration that are in the         02077000
*                                 reserved state.                       02078000
*                                 A logical CPU is in the               02079000
*                                 reserved state when it is in the      02080000
*                                 level-2 configuration,                02081000
*                                 is not available to be                02082000
*                                 used to execute programs, and cannot  02083000
*                                 be made available                     02084000
*                                 by issuing                            02085000
*                                 instructions to place it in the       02086000
*                                 configured state. It may be possible  02087000
*                                 to place the reserved CPU in the      02088000
*                                 standby or configured state through   02089000
*                                 manually initiated actions            02090000
*                                                                @01A*/ 02091000
*    ,2 SI22V2LparName CHAR(8)    /* The 8-character EBCDIC name        02092000
*                                 of this level-2 configuration.        02093000
*                                 The name is                           02094000
*                                 left-justified with trailing blank    02095000
*                                 characters if necessary.              02096000
*                                                                @01A*/ 02097000
*      ,3 SI22V2CpcName CHAR(8)                                         02098000
*    ,2 SI22V2LparCapabilityAF CHAR(4)  /* Capability Adjustment Factor 02099000
*                                 (CAF). An 32-bit unsigned binary      02100000
*                                 integer with a value of               02101000
*                                 1000 or less. The adjustment factor   02102000
*                                 specifies the amount of the           02103000
*                                 underlying level-1-configuration      02104000
*                                 capability that is allowed to be used 02105000
*                                 for this level-2 configuration by     02106000
*                                 the LPAR hypervisor. The fraction of  02107000
*                                 level-1-configuration capability is   02108000
*                                 determined by dividing the CAF        02109000
*                                 value by 1000.                        02110000
*                                                                @01A*/ 02111000
*      ,3 SI22V2CPCCapabilityAF CHAR(4)                                 02112000
*    ,2 SI22V2LparOrigin CHAR(8)  /* A 64-bit unsigned binary           02113000
*                                 integer, called a logical partition   02114000
*                                 origin, which represents the          02115000
*                                 relocation-zone origin of the         02116000
*                                 logical partition              @L3A*/ 02117000
*    ,2 SI22V2_MT_Installed_Info Bit(8)                                 02118000
*      ,3 SI22V2_MT_Installed Bit(1)   /* MT facility installed  @04A*/ 02119000
*      ,3 * Bit(2)                                                      02120000
*      ,3 SI22V2_MT_MaxThreadID Bit(5) /* The maximum thread            02121000
*                                 ID for a core.                 @04A*/ 02122000
*    ,2 SI22V2_MT_General_Info Bit(8)                                   02123000
*      ,3 * Bit(2)                                                      02124000
*      ,3 SI22V2_Diag040 Bit(1) /* Diagnostic data. This field is       02125000
*                                 for IBM use only               @04A*/ 02126000
*      ,3 SI22V2_MT_CpMaxThreadID Bit(5)   /* The maximum               02127000
*                                 configurable thread ID for a core     02128000
*                                 comprising general CPUs        @04A*/ 02129000
*    ,2 SI22V2_PSMTID_Info Bit(8)                                       02130000
*      ,3 * Bit(3)                                                      02131000
*      ,3 SI22V2_PSMTID Bit(5)                                          02132000
*    ,2 * CHAR(5)              /* Reserved                       @04C*/ 02133000
*    ,2 SI22V2DedicatedLCPUCount BIT(16)  /* A 16-bit unsigned binary   02134000
*                                 integer that specifies the number of  02135000
*                                 configured-state logical CPUs for     02136000
*                                 this level-2 configuration that are   02137000
*                                 provided using dedicated level-1      02138000
*                                 CPUs. (See the                        02139000
*                                 description of bit                    02140000
*                                 SI22V2LCPUDedicated.)                 02141000
*                                                                @01A*/ 02142000
*    ,2 SI22V2SharedLCPUCount BIT(16)  /* A 16-bit unsigned binary      02143000
*                                 integer that specifies the number of  02144000
*                                 configured-state logical CPUs for     02145000
*                                 this level-2 configuration that are   02146000
*                                 provided using shared level-1         02147000
*                                 CPUs. (See the                        02148000
*                                 description of bit                    02149000
*                                 SI22V2LCPUShared.)                    02150000
*                                                                @01A*/ 02151000
*    ,2 * CHAR(3)              /* Reserved                       @05C*/ 02152000
*    ,2 SI22V2VSNameEncoding Fixed(8) /* an 8-bit unsigned integer      02153000
*                                 indicating whether virtual-server     02154000
*                                 information is provided in fields     02155000
*                                 SI22V2VSName and SI22V2VSUUID, and    02156000
*                                 if so, the encoding of the            02157000
*                                 virtual-server-name field,            02158000
*                                 SI22V2VSName, as follows:             02159000
*                                                                       02160000
*                                 Value Meaning Equate                  02161000
*                                 0     Virtual-server information is   02162000
*                                       not provided                    02163000
*                                               SI22_ExtNameNotProvided 02164000
*                                 1     EBCDIC  SI22_ExtNameEbcdic      02165000
*                                 2     UTF-8   SI22_ExtNameUTF8        02166000
*                                 3-255 Reserved                 @05A*/ 02167000
*    ,2 SI22V2VSUUID Char(16) /* When virtual-server information is     02168000
*                                 provided, contains a 128- bit binary  02169000
*                                 universally-unique identification     02170000
*                                 (UUID, also known as a handle) of the 02171000
*                                 virtual server for this               02172000
*                                 configuration. Set to zeros when      02173000
*                                 virtual-server information is not     02174000
*                                 provided.                      @05A*/ 02175000
*    ,2 * CHAR((64-24)*4)      /* Reserved                       @05A*/ 02176000
*    ,2 SI22V2VSName Char(256) /* When virtual-server information is    02177000
*                                 provided, contain a 256-byte name of  02178000
*                                 the virtual server for this           02179000
*                                 configuration. The virtual-server     02180000
*                                 name is left justified in the field.  02181000
*                                 If the name is less than 256 bytes,   02182000
*                                 the field is padded on the right with 02183000
*                                 zeros. SI22V2VSNameEncoding           02184000
*                                 indicates the encoding of the         02185000
*                                 virtual-server-name field.  When      02186000
*                                 virtual-server information is not     02187000
*                                 provided, SI22V2VSName is reserved    02188000
*                                 and may be stored as zeros or may     02189000
*                                 remain unchanged.              @05A*/ 02190000
*    ,2 * CHAR((1024-128)*4)   /* Reserved                       @05A*/ 02191000
*    ,2 * CHAR(0) BDY(DWORD);  /* DWORD-align the ending         @01A*/ 02192000
*                                                                       02193000
*/********************************************************************/ 02194000
*/* SI22V3 represents the output for a level-3 configuration when    */ 02195000
*/* information is requested about the set of CPUs                   */ 02196000
*/********************************************************************/ 02197000
*DCL 1 SI22V3 CHAR(4096) BDY(DWORD) TYPE /*                      @01A*/ 02198000
*    ,2 * CHAR(7*4)            /* Reserved                       @01A*/ 02199000
*    ,2 * CHAR(3)              /* Reserved                       @01A*/ 02200000
*    ,2 SI22V3DBCountField BIT(8)            /*                  @01A*/ 02201000
*      ,3 * BIT(4)             /* Reserved                       @01A*/ 02202000
*      ,3 SI22V3DBCount BIT(4) /* Description Block Count.              02203000
*                                 A 4-bit unsigned binary integer that  02204000
*                                 indicates the number (up to 8) of     02205000
*                                 virtual machine description blocks    02206000
*                                 that are stored in the                02207000
*                                 SI22V3DBs field.                      02208000
*                                                                @01A*/ 02209000
*    ,2 SI22V3DBs Char(8*64)   /* From 1 to 8 64-byte virtual machine   02210000
*                                 description blocks, depending         02211000
*                                 on the number of nested level-3       02212000
*                                 configurations, if any,               02213000
*                                 and their processing                  02214000
*                                 characteristics.                      02215000
*                                                                @01A*/ 02216000
*      ,3 SI22V3DBE CHAR(64)    /* An individual entry, mapped by       02217000
*                                 dsect SI22V3DB                        02218000
*                                                                @01A*/ 02219000
*    ,2 * CHAR((512-136)*4)    /* Reserved                       @05A*/ 02220000
*    ,2 SI22V3ExtVMNames Char(8*256) /* Array of 256-byte extended      02221000
*                                 virtual machine names.  For each      02222000
*                                 provided SI22V3DBE, there is a        02223000
*                                 corresponding SI22V3ExtVMName.        02224000
*                                                                       02225000
*                                 The SI22V3DBExtVmNameEncoding field   02226000
*                                 of a SI22V3DB indicates the encoding  02227000
*                                 of the corresponding extended VM      02228000
*                                 name.  When SI22V3DBExtVmNameEncoding 02229000
*                                 is zero, the corresponding            02230000
*                                 extended-VM name field is stored as   02231000
*                                 zeros.                                02232000
*                                                                @05A*/ 02233000
*      ,3 SI22V3ExtVMName CHAR(256) /* An individual extended-VM-name   02234000
*                                 entry corresponding to the SI22V3DBE. 02235000
*                                 Left justified and padded to the      02236000
*                                 right with zeros. If the leftmost     02237000
*                                 byte contains zeros, no extended VM   02238000
*                                 name is provided regardless of the    02239000
*                                 corresponding                         02240000
*                                 SI22V3DBExtVmNameEncoding value.      02241000
*                                                                @05A*/ 02242000
*    ,2 * CHAR(0) BDY(DWORD);  /* DWORD-align the ending         @01A*/ 02243000
*                                                                       02244000
*                                                                       02245000
*/********************************************************************/ 02246000
*/* SI22V3DB is a description block that comprises part of the       */ 02247000
*/* SI22V3 data.                                                     */ 02248000
*/********************************************************************/ 02249000
*DCL 1 SI22V3DB CHAR(64) BDY(DWORD) TYPE /* V3 Description Block.       02250000
*                                 When a level-3 configuration is       02251000
*                                 provided by a virtual-machine control 02252000
*                                 program and the control program is    02253000
*                                 being executed by a level-3           02254000
*                                 configuration provided by another     02255000
*                                 virtual-machine control program, the  02256000
*                                 level-3 configurations are said to    02257000
*                                 be "nested." Level-3 configurations   02258000
*                                 can be nested in this way for several 02259000
*                                 levels.                               02260000
*                                 The collection of nested level-3      02261000
*                                 configurations that is in the path    02262000
*                                 between a program being executed by   02263000
*                                 a level-3 configuration and the       02264000
*                                 basic machine is called a "level-3    02265000
*                                 configuration stack." The level-3     02266000
*                                 configurations provided by a          02267000
*                                 virtual-machine control program being 02268000
*                                 executed by either a level-2          02269000
*                                 configuration or a level-1            02270000
*                                 configuration is the lowest-numbered  02271000
*                                 (0) level-3 configuration in the      02272000
*                                 stack. The level-3 configuration that 02273000
*                                 is executing the program containing   02274000
*                                 this instruction is the highest       02275000
*                                 numbered (N) level-3 configuration    02276000
*                                 in the stack.                         02277000
*                                 If more than one virtual-machine      02278000
*                                 description block is stored, the      02279000
*                                 blocks are stored according to the    02280000
*                                 following rules:                      02281000
*                                 1.The collection of level-3           02282000
*                                   configurations described is a       02283000
*                                   contiguous subset of the total      02284000
*                                   collection of level-3               02285000
*                                   configurations in the level-3       02286000
*                                   configuration stack. The subset     02287000
*                                   always includes the highest         02288000
*                                   numbered level-3 configuration in   02289000
*                                   the stack. One or more level-3      02290000
*                                   configuraitons at the bottom of the 02291000
*                                   stack may not be described because  02292000
*                                   STSI is not implemented by the      02293000
*                                   highest of those configurations     02294000
*                                   or the limit of eight description   02295000
*                                   blocks would be exceeded.           02296000
*                                 2.The highest-numbered level-3        02297000
*                                   configuration in the level-3        02298000
*                                   configuration stack is always       02299000
*                                   described by the first description  02300000
*                                   block. The lowest-numbered level-3  02301000
*                                   configuration in the stack, of      02302000
*                                   those that are included in the      02303000
*                                   subset that is described, is        02304000
*                                   described by the last description   02305000
*                                   block provided.                     02306000
*                                                                @01A*/ 02307000
*    ,2 * CHAR(1*4)            /* Reserved                       @01A*/ 02308000
*    ,2 SI22V3DBTotalLCPUCount BIT(16)    /* A 16-bit unsigned binary   02309000
*                                 integer that specifies the number of  02310000
*                                 logical CPUs for this level-3         02311000
*                                 configuration. This number            02312000
*                                 includes all of the logical CPUs that 02313000
*                                 are in the configured state, the      02314000
*                                 standby state, and the reserved       02315000
*                                 state.                                02316000
*                                                                @01A*/ 02317000
*    ,2 SI22V3DBConfiguredLCPUCount BIT(16)   /* A 16-bit unsigned      02318000
*                                 binary integer that specifies the     02319000
*                                 number of logical CPUs for this       02320000
*                                 level-3 configuration                 02321000
*                                 that are in the configured            02322000
*                                 state. A logical CPU is in the        02323000
*                                 configured state when it is in the    02324000
*                                 level-3 configuration and is          02325000
*                                 available to be used to execute       02326000
*                                 programs.                             02327000
*                                                                @01A*/ 02328000
*    ,2 SI22V3DBStandbyLCPUCount BIT(16)    /* A 16-bit unsigned binary 02329000
*                                 integer that specifies the            02330000
*                                 number of logical CPUs for this       02331000
*                                 level-3 configuration                 02332000
*                                 that are in the standby state.        02333000
*                                 A logical CPU is in the               02334000
*                                 standby state when it is in the       02335000
*                                 level-3 configuration,                02336000
*                                 is not available to be                02337000
*                                 used to execute programs, and can     02338000
*                                 be made available by issuing          02339000
*                                 instructions to place it in           02340000
*                                 the configured state.                 02341000
*                                                                @01A*/ 02342000
*    ,2 SI22V3DBReservedLCPUCount BIT(16)    /* A 16-bit unsigned       02343000
*                                 binary integer that specifies the     02344000
*                                 number of logical CPUs for this       02345000
*                                 level-3 configuration                 02346000
*                                 that are in the reserved state.       02347000
*                                 A logical CPU is in the               02348000
*                                 reserved state when it is in the      02349000
*                                 level-3 configuration,                02350000
*                                 is not available to be                02351000
*                                 used to execute programs, and cannot  02352000
*                                 be made available by issuing          02353000
*                                 instructions to place it in the       02354000
*                                 configured state. It may be possible  02355000
*                                 to place the CPU in the standby       02356000
*                                 or configured state through           02357000
*                                 manual actions                        02358000
*                                                                @01A*/ 02359000
*    ,2 SI22V3DBVMName CHAR(8)    /* The 8-character EBCDIC name        02360000
*                                 of this level-3 configuration. The    02361000
*                                 name is                               02362000
*                                 left-justified with trailing blank    02363000
*                                 characters if necessary.              02364000
*                                                                @01A*/ 02365000
*      ,3 SI22V3DBCPCName CHAR(8)                                       02366000
*    ,2 SI22V3DBVMCAF CHAR(4)     /* A 4-byte unsigned binary           02367000
*                                 integer that specifies an adjustment  02368000
*                                 factor. The adjustment factor         02369000
*                                 specifies the amount of the           02370000
*                                 underlying level-1-, level-2-, or     02371000
*                                 level-3-configuration cpability that  02372000
*                                 is allowed to be used for this        02373000
*                                 level-3 configuration by the          02374000
*                                 virtual-machine control program. The  02375000
*                                 fraction of the underlying capability 02376000
*                                 is determined by dividing the CAF     02377000
*                                 value by 1000.                        02378000
*                                                                @01A*/ 02379000
*      ,3 SI22V3DBCPCCAF CHAR(4)                                        02380000
*    ,2 SI22V3DBCPIdentifier CHAR(16)    /* The 16-character EBCDIC     02381000
*                                 identifier of the virtual-machine     02382000
*                                 control program that provides this    02383000
*                                 level-3 configuration. This           02384000
*                                 identifier may include qualifiers     02385000
*                                 such as version number and release    02386000
*                                 level. The identifier is              02387000
*                                 left-justified with trailing blank    02388000
*                                 characters if necessary.              02389000
*                                                                @01A*/ 02390000
*      ,3 SI22V3DBVMHPIdentifier CHAR(16)                               02391000
*    ,2 * CHAR(3)              /* Reserved                       @05C*/ 02392000
*    ,2 SI22V3DBExtVmNameEncoding Fixed(8) /* Extended Virtual Machine  02393000
*                                 Name Encoding -- an 8-bit unsigned    02394000
*                                 integer indicating whether a          02395000
*                                 corresponding SI22V3ExtVMName         02396000
*                                 is provided, and if so,               02397000
*                                 the encoding of the                   02398000
*                                 SI22V3ExtVMName                       02399000
*                                 as follows:                           02400000
*                                                                       02401000
*                                 Value Meaning Equate                  02402000
*                                 0     Extended virtual-machine name   02403000
*                                       is not provided                 02404000
*                                               SI22_ExtNameNotProvided 02405000
*                                 1     EBCDIC  SI22_ExtNameEbcdic      02406000
*                                 2     UTF-8   SI22_ExtNameUTF8        02407000
*                                 3-255 Reserved.                       02408000
*                                                                       02409000
*                                 When zero, an extended virtual        02410000
*                                 machine name is not provided for this 02411000
*                                 configuration.                        02412000
*                                                                @05A*/ 02413000
*    ,2 * CHAR(4)              /* Reserved                       @05C*/ 02414000
*    ,2 SI22V3DBUUID Char(16)  /* Universally-Unique Identification     02415000
*                                 (UUID): When not zero, comprises a    02416000
*                                 UUID of the virtual machine           02417000
*                                 configuration. When zero, no UUID was 02418000
*                                 provided.                      @05C*/ 02419000
*    ,2 * CHAR(0) BDY(DWORD);  /* DWORD-align the ending         @01A*/ 02420000
* Dcl SI22_ExtNameNotProvided Fixed(8) Constant(0); /* Extended name    02421000
*                                 is not provided                @05A*/ 02422000
* Dcl SI22_ExtNameEbcdic Fixed(8) Constant(1); /* Extended name is      02423000
*                                 EBCDIC encoded                 @05A*/ 02424000
* Dcl SI22_ExtNameUTF8   Fixed(8) Constant(2); /* Extended name is      02425000
*                                 UTF-8 encoded                  @05A*/ 02426000
*                                                                       02427000
*                                                                       02428000
* @LOGIC;                                                               02429000
* #PRAGMA TOOL=CBGEN.                                                   02430000
* #USEORG.                                                              02431000
* #DELETE.SI00NonInterfac1                                              02432000
* #EPRAGMA.                                                             02433000
* @ENDLOGIC;                                                            02434000
*/* End of PL/X Source                                               */ 02435000
* %IF CSRSIIDF_LIST = 'NO' !                                            02436000
*    ZCBPRINT = 'NO' %THEN                                              02437000
* %DO;                                                                  02438000
*   @LIST POP NOECHO;                                                   02439000
* %END;                                                                 02440000
* %END;                                                                 02441000
