*                                                                       00001000
* %DCL CSRYCMPS_INCLUDED CHAR EXT;                                      00002000
* %DEACTIVATE CSRYCMPS_INCLUDED;                                        00003000
* %IF CSRYCMPS_INCLUDED = '' %THEN                                      00004000
* %DO;                                                                  00005000
*/* Macro made bi-lingual on 16341. CBGEN compile date 15295         */ 00006000
*% /*                                                                   00007000
         MACRO                                                          00008000
         CSRYCMPS &DSECT=YES,&LIST=YES,&TITLE=YES,&CMPSC=YES,          *00009000
               &CMPSCEE=COND                                            00010000
         GBLC  &CSRYCMPS_INCLUDED                                       00011000
         GBLC  &ZCBPRINT                                                00012000
&CSRYCMPS_INCLUDED SETC 'YES'                                           00013000
         AIF   ('&LIST' EQ 'NONE').P0                                   00014000
         AIF   ('&TITLE' EQ 'NO').P5                                    00015000
 TITLE   'CSRYCMPS  - Compression parameter block                    '  00016000
.P5      ANOP                                                           00017000
**/ CSRYCMPS_1:;                                                        00018000
*/* START OF SPECIFICATIONS ******************************************* 00019000
*                                                                       00020000
*  **PROPRIETARY_STATEMENT********************************************  00021000
***01* PROPRIETARY STATEMENT=                                        *  00022000
*                                                                    *  00023000
*                                                                    *  00024000
*   LICENSED MATERIALS - PROPERTY OF IBM                             *  00025000
*   5694-A01 COPYRIGHT IBM CORP. 1992, 2010                          *  00026000
*                                                                    *  00027000
*   STATUS= HBB7770                                                  *  00028000
*                                                                    *  00029000
*  **END_OF_PROPRIETARY_STATEMENT*************************************  00030000
*                                                                       00031000
*01* DESCRIPTIVE NAME:  Compression parameter block                     00032000
*02*  ACRONYM:  CMPSC                                                   00033000
*                                                                       00034000
*01* MACRO NAME:  CSRYCMPS                                              00035000
*                                                                       00036000
*01* EXTERNAL CLASSIFICATION: GUPI                                      00037000
*01* END OF EXTERNAL CLASSIFICATION:                                    00038000
*                                                                       00039000
*01* DSECT NAME:                                                        00040000
*     CMPSC                                                             00041000
*     CMPSCEE                                                           00042000
*                                                                       00043000
*01* COMPONENT:  Callable Services (SCCSR)                              00044000
*                                                                       00045000
*01* EYE-CATCHER:  NONE                                                 00046000
*                                                                       00047000
*01* STORAGE ATTRIBUTES:                                                00048000
*02*  SUBPOOL:  Caller-supplied                                         00049000
*02*  KEY:  Caller-supplied                                             00050000
*02*  RESIDENCY:  Caller-supplied                                       00051000
*                                                                       00052000
*01* SIZE:                                                              00053000
*                CMPSC   -- X'0024' bytes                               00054000
*                CMPSCEE -- X'0040' bytes                               00055000
*                                                                       00056000
*01* CREATED BY:                                                        00057000
*     Caller of CSRCMPSC service and passed as parameter on CBLOCK      00058000
*     keyword on CSRCMPSC                                               00059000
*                                                                       00060000
*01* POINTED TO BY:                                                     00061000
*     Not applicable                                                    00062000
*                                                                       00063000
*01* SERIALIZATION:                                                     00064000
*     None required                                                     00065000
*                                                                       00066000
*01* FUNCTION:                                                          00067000
*02* Maps the compression service parameter area.                       00068000
*02* It represents the data needed by the compression service           00069000
*    for which it is to be specified on the CBLOCK keyword.             00070000
*    Use DSECT CMPSCEE when requesting entropy encoding expansion.      00071000
*    Use DSECT CMPSC when not requesting entropy encoding.              00072000
*    (Do not use CSRCMPSC for entropy encoding compression)             00073000
*02* Provides equates for return codes from the compression service.    00074000
*                                                                       00075000
*01* METHOD OF ACCESS:                                                  00076000
*02*  ASM:                                                              00077000
*      CSRYCMPS                                                         00078000
*           DSECT=YES!NO  -- Request DSECT definition                   00079000
*           CMPSC=YES!NO  -- Request mapping of CMPSC                   00080000
*           CMPSCEE=YES!NO -- Request mapping of CMPSCEE                00081000
*     Default: DSECT=YES,CMPSC=YES,CMPSCEE=COND                         00082000
*02*  PL/AS:                                                            00083000
*      %INCLUDE SYSLIB(CSRYCMPS)                                        00084000
*                                                                       00085000
*01* DELETED BY:  Caller                                                00086000
*                                                                       00087000
*01* FREQUENCY:  Created for invoking CSRCMPSC                          00088000
*                                                                       00089000
*01* DEPENDENCIES:  None                                                00090000
*                                                                       00091000
*01* DISTRIBUTION LIBRARY:  AMACLIB                                     00092000
*                                                                       00093000
*01* CHANGE ACTIVITY:                                                   00094000
*   $T0=OY59584C ,HBB4430,920901,PD00XB: Compression parameter block    00095000
*   $T1=OY59584  ,HBB4430,920901,PD00XB: Compression parameter block    00096000
*   $L1=ME17284  ,HBB7770,090928,PD00XB: ZeroPaddingOK                  00097000
*   $01=OA49967  ,HBB7790,150901,PD00XB: BadED                          00098000
*                                                                       00099000
* END OF SPECIFICATIONS *********************************************/  00100000
*% /*                                                                   00101000
.P0      ANOP                                                           00102000
         AIF   ('&ZCBPRINT' EQ 'NO').P1                                 00103000
         AIF   ('&LIST' EQ 'YES').P2                                    00104000
.P1      ANOP                                                           00105000
         PUSH  PRINT                                                    00106000
         PRINT OFF                                                      00107000
.P2      ANOP                                                           00108000
         AIF   ('&CMPSC' EQ 'NO').L0002                                 00109000
         AIF   ('&DSECT' EQ 'YES').L0003                                00110000
         AIF   ('&CMPSC' NE 'YES').L0002                                00111000
CMPSC    DS    0F        Compression parameter block                    00112000
         AGO   .L0004                                                   00113000
.L0003   ANOP                                                           00114000
CMPSC    DSECT           Compression parameter block                    00115000
.L0004   ANOP                                                           00116000
CMPSC_FLAGS DS BL4       Flag bits within which only the SymSize,      *00117000
                         ZeroPaddingOK, and Expand bits should be set. *00118000
                         All other fields must be 0.                    00119000
         ORG   CMPSC_FLAGS                                              00120000
CMPSC_FLAGS_BYTE0 DS B   Byte 0 of flags                                00121000
CMPSC_FLAGS_BYTE1 DS B   Byte 1 of flags                                00122000
*  Bit definitions:                                                     00123000
CMPSC_ZEROPADDINGOK EQU X'02' Zero padding of the output operand on    *00124000
                         the right up to the operand length and up to  *00125000
                         a model-dependant integral boundary is OK.    *00126000
                         IBM suggests that you specify this bit. The   *00127000
                         bit will be ignored if the machine does not   *00128000
                         support the capability, so the bit can be set *00129000
                         unconditionally.                               00130000
CMPSC_FLAGS_BYTE2 DS B   Byte 2 of flags                                00131000
*  Bit definitions:                                                     00132000
CMPSC_SYMSIZE EQU X'F0'  When 8 is added, indicates size in bits of a  *00133000
                         compressed entry. Must be 1-5. You can use    *00134000
                         the assembler CMPSC_SYMSIZE equate to define  *00135000
                         a value that you can use to clear the field   *00136000
                         prior to use. You can use the assembler       *00137000
                         equates CMPSC_SYMSIZE_n to set the field       00138000
CMPSC_EXPAND EQU X'01'   If on, do an expand operation. Otherwise      *00139000
                         compress                                       00140000
CMPSC_FLAGS_BYTE3 DS B   Byte 3 of flags                                00141000
CMPSC_DICTADDR DS A      Address of the dictionary for the             *00142000
                         compress/expand function on a page boundary.  *00143000
                         Low order 12 bits of the field are treated as *00144000
                         0s when forming the address. Low order 3 bits *00145000
                         contain a bit number.                          00146000
         ORG   CMPSC_DICTADDR                                           00147000
         DS    BL3                                                      00148000
CMPSC_DICTADDR_BYTE3 DS B                                               00149000
*  Bit definitions:                                                     00150000
CMPSC_BITNUM EQU X'07'   If compressing, place the first compression   *00151000
                         symbol at this bit in the leftmost byte. If   *00152000
                         expanding, expand beginning with the          *00153000
                         compression symbol that begins with this bit  *00154000
                         in the left-most byte. Normally, this bit     *00155000
                         should be set to 0 for the start of           *00156000
                         compression. For expansion, it should be set  *00157000
                         to the same value used for the start of       *00158000
                         compression. Upon completion of the           *00159000
                         operation, the value is set to the bit number  00160000
*                        of the bit following the last bit of          *00161000
                         compressed data.                               00162000
         ORG   CMPSC_DICTADDR+4                                         00163000
CMPSC_TARGETADDR DS A    Address of area to which                      *00164000
                         compression/expansion is to be done. Upon     *00165000
                         completion of the request, this address has   *00166000
                         been increased by the number of bytes         *00167000
                         processed.                                     00168000
CMPSC_TARGETLEN DS F     Length of area to which compression/expansion *00169000
                         is to be done. Upon completion of the         *00170000
                         request, this length has been decreased by    *00171000
                         the number of bytes processed.                 00172000
CMPSC_SOURCEADDR DS A    Address of area from which                    *00173000
                         compression/expansion is to be done. Upon     *00174000
                         completion of the request, this address has   *00175000
                         been increased by the number of bytes         *00176000
                         processed.                                     00177000
CMPSC_SOURCELEN DS F     Length of area from which                     *00178000
                         compression/expansion is to be done. For      *00179000
                         expansion, the length should be the           *00180000
                         difference between the TargetLen at           *00181000
                         completion of compression and the TargetLen   *00182000
                         at start of compression, incremented by 1 if  *00183000
                         field CMPSC_BITNUM was non-zero upon          *00184000
                         completion of compression. Upon completion of *00185000
                         the request, this length has been decreased   *00186000
                         by the number of bytes processed.              00187000
CMPSC_TARGETALET DS F    The ALET of the space in which the target     *00188000
                         area resides. Should be 0 for primary ASC     *00189000
                         mode callers.                                  00190000
CMPSC_SOURCEALET DS F    The ALET of the space in which the source     *00191000
                         area resides. Also the ALET of the space in   *00192000
                         which the dictionary resides. Should be 0 for *00193000
                         primary ASC mode callers.                      00194000
CMPSC_WORKAREAADDR DS A  Address of a 192-byte work area for use by    *00195000
                         the compression service. This area does not   *00196000
                         need to be provided if you have verified, by  *00197000
                         checking that bit CVTCMPSH is on, that the    *00198000
                         hardware CMPSC instruction is present. This   *00199000
                         work area should begin on a doubleword        *00200000
                         boundary.                                      00201000
*                                                                       00202000
*    *****************************************************************  00203000
*    *                                                               *  00204000
*    * Constants for setting CMPSC_SYMSIZE bits within               *  00205000
*    * CMPSC_FLAGS_BYTE2                                             *  00206000
*    *                                                               *  00207000
*    *****************************************************************  00208000
*                                                                       00209000
*                                                                       00210000
CMPSC_SYMSIZE_1 EQU B'00010000' Symbol size of 1                        00211000
CMPSC_SYMSIZE_2 EQU B'00100000' Symbol size of 2                        00212000
CMPSC_SYMSIZE_3 EQU B'00110000' Symbol size of 3                        00213000
CMPSC_SYMSIZE_4 EQU B'01000000' Symbol size of 4                        00214000
CMPSC_SYMSIZE_5 EQU B'01010000' Symbol size of 5                        00215000
*                                                                       00216000
*    *****************************************************************  00217000
*    *                                                               *  00218000
*    * Return codes                                                  *  00219000
*    *                                                               *  00220000
*    *****************************************************************  00221000
*                                                                       00222000
*                                                                       00223000
CMPSC_RETCODE_OK EQU 0   No errors detected.                            00224000
CMPSC_RETCODE_TARGET EQU 4 Target operand exhausted before source.      00225000
CMPSC_RETCODE_MISSINGOP EQU 16 An operand is missing.                   00226000
CMPSC_RETCODE_BADSYMSIZE EQU 20 Value in CMPSC_SYMSIZE is not          *00227000
                         supported. Must be 1-5.                        00228000
CMPSC_RETCODE_NOWORK EQU 24 No work to do. The compression area length *00229000
                         (the target for compression, the source for   *00230000
                         expansion) is not large enough to hold even   *00231000
                         one compression symbol.                        00232000
CMPSC_RETCODE_SYMBOLTOOLONG EQU 28 Compression dictionary processing   *00233000
                         exceeded the limit of 260 for the length of a *00234000
                         compressed symbol                              00235000
CMPSC_RETCODE_TOOMANYCHILDREN EQU 32 A dictionary entry exceeded the   *00236000
                         limit of 260 total children                    00237000
CMPSC_RETCODE_BADCHILDCOUNT EQU 36 A dictionary entry exceeded the     *00238000
                         limit of a child count of 6                    00239000
CMPSC_RETCODE_BADEXTCOUNT EQU 40 A dictionary entry exceeded the limit *00240000
                         of 4 extension characters when there were 0   *00241000
                         or 1 children                                  00242000
CMPSC_RETCODE_BADSIBCOUNT EQU 44 A sibling descriptor dictionary entry *00243000
                         has a count of 0                               00244000
CMPSC_RETCODE_TOOMANYENTRIES EQU 48 Expansion of a symbol used more    *00245000
                         than 127 dictionary entries                    00246000
CMPSC_RETCODE_BADED EQU 52 Entry descriptor for Entropy Encoding is    *00247000
                         not valid                                      00248000
CMPSC_RETCODE_COMP_WITH_EE EQU 56 Compression requested with Entropy   *00249000
                         Encoding                                       00250000
CMPSC_RETCODE_EE_DICT_BAD_SIZE EQU 60 The dictionary, as indicated by  *00251000
                         the offset to the entropy descriptors, is not *00252000
                         a valid size                                   00253000
CMPSC_LEN EQU  *-CMPSC                                                  00254000
.L0002   ANOP                                                           00255000
         AIF   ('&CMPSCEE' EQ 'NO').L0005                               00256000
         AIF   ('&DSECT' EQ 'YES').L0006                                00257000
         AIF   ('&CMPSCEE' NE 'YES').L0005                              00258000
.L0006   ANOP                                                           00259000
*                                                                       00260000
*    Use the CMPSCEE DSECT if invoking CSRCMPSC to simulate             00261000
*    expansion of data compressed using entropy encoding.               00262000
*    Do not use it for compression.                                     00263000
*    The first word of the CMPSCEE DSECT matches the first word         00264000
*    of the CMPSC DSECT, except that the bit CMPSCEE_EntropyEncoding    00265000
*    is provided which (when on) indicates that the CMPSCEE DSECT is    00266000
*    being used.                                                        00267000
*                                                                       00268000
*                                                                       00269000
         AIF   ('&DSECT' EQ 'YES').L0007                                00270000
CMPSCEE  DS    0D        Compression parameter block                    00271000
         AGO   .L0008                                                   00272000
.L0007   ANOP                                                           00273000
CMPSCEE  DSECT           Compression parameter block                    00274000
.L0008   ANOP                                                           00275000
CMPSCEE_FLAGS DS BL4     Flag bits within which only the               *00276000
                         EntropyEncoding and Expand bits should be     *00277000
                         set. All other fields must be 0.               00278000
         ORG   CMPSCEE_FLAGS                                            00279000
CMPSCEE_FLAGS_BYTE0 DS B Byte 0 of flags                                00280000
CMPSCEE_FLAGS_BYTE1 DS B Byte 1 of flags                                00281000
*  Bit definitions:                                                     00282000
CMPSCEE_ENTROPYENCODING EQU X'08' Use only on expand and only when bit *00283000
                         CvtEntropyEncoding is on.                      00284000
CMPSCEE_FLAGS_BYTE2 DS B Byte 2 of flags                                00285000
*  Bit definitions:                                                     00286000
CMPSCEE_EXPAND EQU X'01' If on, do an expand operation.                 00287000
CMPSCEE_FLAGS_BYTE3 DS B Byte 3 of flags                                00288000
         DS    BL4       Reserved. Must be 0.                           00289000
CMPSCEE_DICTADDR DS AD   Address of the dictionary for the             *00290000
                         compress/expand function on a page boundary.  *00291000
                         Low order 12 bits of the field are treated as *00292000
                         0s when forming the address. Bits 52-60 for   *00293000
                         entropy encoding identify the offset to the   *00294000
                         entropy descriptors. Bits 61-63 contain a bit *00295000
                         number. The address is assumed to be a 64-bit *00296000
                         address regardless of the caller's AMODE.      00297000
         ORG   CMPSCEE_DICTADDR                                         00298000
CMPSCEE_DICTADDR_BYTES0TO5 DS CL6 Bits 0-47                             00299000
CMPSCEE_DICTADDR_BYTES6TO7  DS BL2 Bits 48-63                           00300000
CMPSCEE_ED_OFFSET EQU X'0FF8'  Mask to isolate bits                    *00301000
                         52-60 within CMPSCEE_DictAddr_Bytes6To7.      *00302000
                         For entropy encoding, these 9 bits, with      *00303000
                         7 zeroes appended on the right, are the       *00304000
                         offset from the start of the dictionary to    *00305000
                         the start of the entropy descriptors. After   *00306000
                         ANDing with the mask, shift left by 4 bits    *00307000
                         to get the offset.                             00308000
CMPSCEE_BITNUM EQU X'0007'     Mask to isolate bits 61-63              *00309000
                         within CMPSCEE_DictAddr_Bytes6To7.            *00310000
                         Expand beginning with the compression         *00311000
                         symbol that begins with this bit in the       *00312000
                         left-most byte. Use the same BitNum value     *00313000
                         used when the data was compressed.            *00314000
                         Upon completion of the expansion,             *00315000
                         bits 61-63 are set to the bit                 *00316000
                         number of the bit following the last bit      *00317000
                         of expanded data.                              00318000
CMPSCEE_TARGETADDR DS AD Address of area to which expansion is to be   *00319000
                         done. Upon completion of the request, this    *00320000
                         address has been increased by the number of   *00321000
                         bytes processed. The address is assumed to be *00322000
                         a 64-bit address regardless of the caller's   *00323000
                         AMODE.                                         00324000
CMPSCEE_TARGETLEN DS FL8 Length of area to which expansion is to be    *00325000
                         done. Upon completion of the request, this    *00326000
                         length has been decreased by the number of    *00327000
                         bytes processed. Do not specify a value >=    *00328000
                         2**55.                                         00329000
CMPSCEE_SOURCEADDR DS AD Address of area from which expansion is to be *00330000
                         done. Upon completion of the request, this    *00331000
                         address has been increased by the number of   *00332000
                         bytes processed. The address is assumed to be *00333000
                         a 64-bit address regardless of the caller's   *00334000
                         AMODE.                                         00335000
CMPSCEE_SOURCELEN DS FL8 Length of area from which expansion is to be  *00336000
                         done. The length should be the difference     *00337000
                         between the TargetLen at completion of        *00338000
                         compression and the TargetLen at start of     *00339000
                         compression, incremented by 1 if field        *00340000
                         CMPSCEE_BITNUM was non-zero upon completion   *00341000
                         of compression. Upon completion of the        *00342000
                         request, this length has been decreased by    *00343000
                         the number of bytes processed. Do not specify *00344000
                         a value >= 2**55.                              00345000
CMPSCEE_TARGETALET DS F  The ALET of the space in which the target     *00346000
                         area resides. Should be 0 for primary ASC     *00347000
                         mode callers.                                  00348000
CMPSCEE_SOURCEALET DS F  The ALET of the space in which the source     *00349000
                         area resides. Also the ALET of the space in   *00350000
                         which the dictionary resides. Should be 0 for *00351000
                         primary ASC mode callers.                      00352000
CMPSCEE_WORKAREAADDR DS AD Address of a 256-byte work area for use by  *00353000
                         the CSRCMPSC service. This work area should   *00354000
                         begin on a doubleword boundary. The address   *00355000
                         is assumed to be a 64-bit address regardless  *00356000
                         of the caller's AMODE. It may be above 2G.     00357000
CMPSCEE_LEN EQU *-CMPSCEE                                               00358000
.L0005   ANOP                                                           00359000
         AIF   ('&ZCBPRINT' EQ 'NO').P3                                 00360000
         AIF   ('&LIST' EQ 'YES').P4                                    00361000
.P3      ANOP                                                           00362000
         POP   PRINT                                                    00363000
.P4      ANOP                                                           00364000
.P_EXIT  ANOP                                                           00365000
         MEND                                                           00366000
**/ CSRYCMPS_2:;                                                        00367000
* %CSRYCMPS_INCLUDED = 'YES';                                           00368000
* %DCL ZCBPRINT CHAR EXT;                                               00369000
* %DEACTIVATE ZCBPRINT;                                                 00370000
* %DCL CSRYCMPS_LIST CHAR EXT;                                          00371000
* %DEACTIVATE CSRYCMPS_LIST;                                            00372000
* %IF CSRYCMPS_LIST ^= 'NO' &                                           00373000
*    ZCBPRINT ^= 'NO' %THEN                                             00374000
*   %GOTO CSRYCMPS_3;                                                   00375000
*   @LIST PUSH NOECHO;                                                  00376000
*   @LIST NOASSEMBLE NOECHO;                                            00377000
*   @LIST OFF C NOECHO;                                                 00378000
* %CSRYCMPS_3:;                                                         00379000
*/* Start of PL/X Source                                             */ 00380000
*DCL 1 CMPSC BASED,         /* Compression parameter block       @T1A*/ 00381000
*     2 CMPSC_Flags BIT(32),    /* Flag bits within which only          00382000
*                             the SymSize, ZeroPaddingOK, and Expand    00383000
*                             bits should be set. All other fields      00384000
*                             must be 0.                         @T1A*/ 00385000
*       3 CMPSC_Flags_Byte0 BIT(8),    /* Byte 0 of flags        @T1A*/ 00386000
*       3 CMPSC_Flags_Byte1 BIT(8),    /* Byte 1 of flags        @T1A*/ 00387000
*         4 * BIT(4),                  /* Reserved               @01C*/ 00388000
*         4 * BIT(1),                  /* Entropy encoding, use         00389000
*                             CMPSCEE instead                    @01A*/ 00390000
*         4 * BIT(1),                  /* Order preservation, not       00391000
*                             supported                          @01A*/ 00392000
*         4 CMPSC_ZeroPaddingOK BIT(1),  /* Zero padding of the output  00393000
*                             operand on the right up to the operand    00394000
*                             length and up to a model-dependant        00395000
*                             integral boundary is OK. IBM suggests     00396000
*                             that you specify this bit. The bit will   00397000
*                             be ignored if the machine does not        00398000
*                             support the capability, so the bit can    00399000
*                             be set unconditionally.            @L1A*/ 00400000
*         4 * BIT(1),                  /*                        @L1A*/ 00401000
*       3 CMPSC_Flags_Byte2 BIT(8),    /* Byte 2 of flags        @T1A*/ 00402000
*         4 CMPSC_SymSize BIT(4), /* When 8 is added, indicates size    00403000
*                             in bits of a compressed entry. Must       00404000
*                             be 1-5. You can use the assembler         00405000
*                             CMPSC_SYMSIZE equate to define a value    00406000
*                             that you can use to clear the field       00407000
*                             prior to use. You can use the assembler   00408000
*                             equates CMPSC_SYMSIZE_n to set the field  00409000
*                                                                @T1A*/ 00410000
*         4 * BIT(3),                  /* Must be zero           @T1A*/ 00411000
*         4 CMPSC_Expand BIT(1),       /* If on, do an expand           00412000
*                             operation. Otherwise compress      @T1A*/ 00413000
*       3 CMPSC_Flags_Byte3 BIT(8),    /* Byte 3 of flags        @T1A*/ 00414000
*     2 CMPSC_DictAddr PTR(31), /* Address of the dictionary            00415000
*                             for the compress/expand function on a     00416000
*                             page boundary. Low order 12 bits of the   00417000
*                             field are treated as 0s when forming the  00418000
*                             address. Low order 3 bits contain a       00419000
*                             bit number.                        @T1A*/ 00420000
*       3 * BIT(24),            /*                               @T1A*/ 00421000
*       3 CMPSC_DictAddr_Byte3 BIT(8),   /*                      @T1A*/ 00422000
*         4 * BIT(5),           /* Must be zero                  @T1A*/ 00423000
*         4 CMPSC_BitNum BIT(3),  /*                                    00424000
*                   If compressing, place the first compression         00425000
*                   symbol at this bit in the leftmost byte.            00426000
*                   If expanding, expand beginning                      00427000
*                   with the compression symbol that begins with        00428000
*                   this bit in the left-most byte.                     00429000
*                   Normally, this bit                                  00430000
*                   should be set to 0 for the start of compression.    00431000
*                   For expansion, it should be set to the same         00432000
*                   value used for the start of compression.            00433000
*                   Upon completion of the operation, the value is set  00434000
*                   to the bit number of the bit following the last     00435000
*                   bit of compressed data.                             00436000
*                                                                @T1A*/ 00437000
*     2 CMPSC_TargetAddr PTR(31), /* Address of area to which           00438000
*                             compression/expansion is to be done.      00439000
*                             Upon completion of the request, this      00440000
*                             address has been increased by the         00441000
*                             number of bytes processed.                00442000
*                                                                @T1A*/ 00443000
*     2 CMPSC_TargetLen FIXED(32), /* Length of area to which           00444000
*                             compression/expansion is to be done.      00445000
*                             Upon completion of the request, this      00446000
*                             length has been decreased by the          00447000
*                             number of bytes processed.                00448000
*                                                                @T1A*/ 00449000
*     2 CMPSC_SourceAddr PTR(31), /* Address of area from which         00450000
*                             compression/expansion is to be done.      00451000
*                             Upon completion of the request, this      00452000
*                             address has been increased by the         00453000
*                             number of bytes processed.                00454000
*                                                                @T1A*/ 00455000
*     2 CMPSC_SourceLen FIXED(32), /* Length of area from which         00456000
*                             compression/expansion is to               00457000
*                             be done. For expansion, the length        00458000
*                             should be the difference between          00459000
*                             the TargetLen at completion of            00460000
*                             compression and the TargetLen at          00461000
*                             start of compression,                     00462000
*                             incremented by 1 if field CMPSC_BITNUM    00463000
*                             was non-zero upon completion of           00464000
*                             compression.                              00465000
*                             Upon completion of the request, this      00466000
*                             length has been decreased by the          00467000
*                             number of bytes processed.                00468000
*                                                                @T1A*/ 00469000
*     2 CMPSC_TargetALET FIXED(32), /* The ALET                         00470000
*                             of the space in which the target area     00471000
*                             resides. Should be 0 for primary ASC      00472000
*                             mode callers.                      @T1A*/ 00473000
*     2 CMPSC_SourceALET FIXED(32), /* The ALET                         00474000
*                             of the space in which the source area     00475000
*                             resides. Also the ALET of the space in    00476000
*                             which the dictionary resides.             00477000
*                             Should be 0 for primary ASC               00478000
*                             mode callers.                      @T1A*/ 00479000
*     2 CMPSC_WorkAreaAddr PTR(31),  /* Address of a 192-byte work      00480000
*                             area for use by the compression service.  00481000
*                             This area does not need to be provided    00482000
*                             if you have verified, by checking that    00483000
*                             bit CVTCMPSH is on, that the hardware     00484000
*                             CMPSC instruction is present.             00485000
*                             This work area should begin on a          00486000
*                             doubleword boundary.               @T1A*/ 00487000
*     2 * CHAR(0);             /* End of mapping                 @T1A*/ 00488000
*                                                                       00489000
*            /* Constants for setting CMPSC_SYMSIZE bits within         00490000
*               CMPSC_FLAGS_BYTE2                                    */ 00491000
* DCL CMPSC_SYMSIZE_1 BIT(4) CONSTANT('0001'B);   /* Symbol size of 1   00492000
*                                                                @T1A*/ 00493000
* DCL CMPSC_SYMSIZE_2 BIT(4) CONSTANT('0010'B);   /* Symbol size of 2   00494000
*                                                                @T1A*/ 00495000
* DCL CMPSC_SYMSIZE_3 BIT(4) CONSTANT('0011'B);   /* Symbol size of 3   00496000
*                                                                @T1A*/ 00497000
* DCL CMPSC_SYMSIZE_4 BIT(4) CONSTANT('0100'B);   /* Symbol size of 4   00498000
*                                                                @T1A*/ 00499000
* DCL CMPSC_SYMSIZE_5 BIT(4) CONSTANT('0101'B);   /* Symbol size of 5   00500000
*                                                                @T1A*/ 00501000
*            /* Return codes */                                         00502000
* DCL CMPSC_Retcode_OK Fixed(31) Constant(0);   /* No errors            00503000
*                             detected.                          @T1A*/ 00504000
* DCL CMPSC_Retcode_Target Fixed(31) Constant(4);   /* Target operand   00505000
*                             exhausted before source.           @T1A*/ 00506000
* DCL CMPSC_Retcode_MissingOp Fixed(31) Constant(16);  /* An operand    00507000
*                             is missing.                        @T1A*/ 00508000
* DCL CMPSC_Retcode_BadSymSize Fixed(31) Constant(20);  /* Value in     00509000
*                             CMPSC_SYMSIZE is not supported.           00510000
*                             Must be 1-5.                       @T1A*/ 00511000
* DCL CMPSC_Retcode_NoWork Fixed(31) Constant(24);  /* No work to       00512000
*                             do. The compression area length (the      00513000
*                             target for compression, the source for    00514000
*                             expansion) is not large enough to         00515000
*                             hold even one compression symbol.  @T1A*/ 00516000
* DCL CMPSC_Retcode_SymbolTooLong Fixed(31) Constant(28);  /*           00517000
*                             Compression dictionary processing         00518000
*                             exceeded the limit of 260 for the length  00519000
*                             of a compressed symbol             @T1A*/ 00520000
* DCL CMPSC_Retcode_TooManyChildren Fixed(31) Constant(32);  /*         00521000
*                             A dictionary entry exceeded the limit     00522000
*                             of 260 total children                     00523000
*                                                                @T1A*/ 00524000
* DCL CMPSC_Retcode_BadChildCount Fixed(31) Constant(36);  /*           00525000
*                             A dictionary entry exceeded the limit     00526000
*                             of a child count of 6                     00527000
*                                                                @T1A*/ 00528000
* DCL CMPSC_Retcode_BadExtCount Fixed(31) Constant(40);  /*             00529000
*                             A dictionary entry exceeded the limit     00530000
*                             of 4 extension characters when there      00531000
*                             were 0 or 1 children                      00532000
*                                                                @T1A*/ 00533000
* DCL CMPSC_Retcode_BadSibCount Fixed(31) Constant(44);  /*             00534000
*                             A sibling descriptor dictionary           00535000
*                             entry has a count of 0                    00536000
*                                                                @T1A*/ 00537000
* DCL CMPSC_Retcode_TooManyEntries Fixed(31) Constant(48);  /*          00538000
*                             Expansion of a symbol used more than      00539000
*                             127 dictionary entries                    00540000
*                                                                @T1A*/ 00541000
* DCL CMPSC_Retcode_BadED Fixed(31) Constant(52);  /* Entry descriptor  00542000
*                             for Entropy Encoding is not valid  @01A*/ 00543000
* DCL CMPSC_Retcode_Comp_With_EE Fixed(31) Constant(56);  /*            00544000
*                             Compression requested with Entropy        00545000
*                             Encoding                           @01A*/ 00546000
* DCL CMPSC_Retcode_EE_Dict_Bad_Size Fixed(31) Constant(60);  /*        00547000
*                             The dictionary, as indicated by the       00548000
*                             offset to the entropy descriptors, is not 00549000
*                             a valid size                       @01A*/ 00550000
* /* Use the CMPSCEE DSECT if invoking CSRCMPSC to simulate             00551000
*    expansion of data compressed using entropy encoding.               00552000
*    Do not use it for compression.                                     00553000
*    The first word of the CMPSCEE DSECT matches the first word         00554000
*    of the CMPSC DSECT, except that the bit CMPSCEE_EntropyEncoding    00555000
*    is provided which (when on) indicates that the CMPSCEE DSECT is    00556000
*    being used.                                                 @01A*/ 00557000
*DCL 1 CMPSCEE BASED,       /* Compression parameter block       @01A*/ 00558000
*     2 CMPSCEE_Flags BIT(32),  /* Flag bits within which only          00559000
*                             the EntropyEncoding and Expand bits       00560000
*                             should be set. All other fields           00561000
*                             must be 0.                         @01A*/ 00562000
*       3 CMPSCEE_Flags_Byte0 BIT(8),  /* Byte 0 of flags        @01A*/ 00563000
*       3 CMPSCEE_Flags_Byte1 BIT(8),  /* Byte 1 of flags        @01A*/ 00564000
*         4 * BIT(4),                  /* Reserved               @01C*/ 00565000
*         4 CMPSCEE_EntropyEncoding Bit(1), /* Use only on expand and   00566000
*                             only when bit CvtEntropyEncoding is       00567000
*                             on.                                @01A*/ 00568000
*         4 * BIT(1),                  /* Order preservation, not       00569000
*                             supported                          @01A*/ 00570000
*         4 * BIT(1),                  /* Zero padding OK, not          00571000
*                             supported for expansion simulation @01A*/ 00572000
*         4 * BIT(1),                  /*                        @01A*/ 00573000
*       3 CMPSCEE_Flags_Byte2 BIT(8),  /* Byte 2 of flags        @01A*/ 00574000
*         4 * BIT(4),             /* These 4 bits apply only when       00575000
*                             using the CMPSC mapping            @01A*/ 00576000
*         4 * BIT(3),                  /* Must be zero           @01A*/ 00577000
*         4 CMPSCEE_Expand BIT(1),     /* If on, do an expand           00578000
*                             operation.                         @01A*/ 00579000
*       3 CMPSCEE_Flags_Byte3 BIT(8),  /* Byte 3 of flags        @01A*/ 00580000
*     2 * BIT(32),          /* Reserved. Must be 0.              @01A*/ 00581000
*     2 CMPSCEE_DictAddr PTR(64), /* Address of the dictionary          00582000
*                             for the compress/expand function on a     00583000
*                             page boundary. Low order 12 bits of the   00584000
*                             field are treated as 0s when forming the  00585000
*                             address. Bits 52-60 for entropy encoding  00586000
*                             identify the offset to the entropy        00587000
*                             descriptors. Bits 61-63 contain a         00588000
*                             bit number. The address is assumed        00589000
*                             to be a 64-bit address regardless of      00590000
*                             the caller's AMODE.                @01A*/ 00591000
*       3 CMPSCEE_DictAddr_Bytes0To5 Char(6),  /* Bits 0-47      @01A*/ 00592000
*       3 CMPSCEE_DictAddr_Bytes6To7 Char(2),    /* Bits                00593000
*                                             48-63              @01A*/ 00594000
*         5 * Bit(4),                      /* Bits 48-51         @01A*/ 00595000
*         5 CMPSCEE_ED_Offset Bit(9),      /* Bits 52-60: For entropy   00596000
*                   encoding, these 9 bits, with 7 zeroes appended      00597000
*                   on the right, identify the offset from the start    00598000
*                   of the dictionary to the start of the entropy       00599000
*                   descriptors                                  @01A*/ 00600000
*         5 CMPSCEE_BitNum BIT(3), /* Bits 61-63:                       00601000
*                   Expand beginning with the compression symbol that   00602000
*                   begins with this bit in the left-most byte.         00603000
*                   It should be set to the same value used for the     00604000
*                   start of compression. Upon completion of the        00605000
*                   operation, the value is set to the bit number of    00606000
*                   the bit following the last bit of compressed        00607000
*                   data.                                        @01A*/ 00608000
*     2 CMPSCEE_TargetAddr PTR(64), /* Address of area to which         00609000
*                             expansion is to be done.                  00610000
*                             Upon completion of the request, this      00611000
*                             address has been increased by the         00612000
*                             number of bytes processed.                00613000
*                             The address is assumed                    00614000
*                             to be a 64-bit address regardless of      00615000
*                             the caller's AMODE.                @01A*/ 00616000
*     2 CMPSCEE_TargetLen FIXED(64), /* Length of area to which         00617000
*                             expansion is to be done.                  00618000
*                             Upon completion of the request, this      00619000
*                             length has been decreased by the          00620000
*                             number of bytes processed.                00621000
*                             Do not specify a value >= 2**55.   @01A*/ 00622000
*     2 CMPSCEE_SourceAddr PTR(64), /* Address of area from which       00623000
*                             expansion is to be done.                  00624000
*                             Upon completion of the request, this      00625000
*                             address has been increased by the         00626000
*                             number of bytes processed.                00627000
*                             The address is assumed                    00628000
*                             to be a 64-bit address regardless of      00629000
*                             the caller's AMODE.                @01A*/ 00630000
*     2 CMPSCEE_SourceLen FIXED(64), /* Length of area from which       00631000
*                             expansion is to                           00632000
*                             be done. The length                       00633000
*                             should be the difference between          00634000
*                             the TargetLen at completion of            00635000
*                             compression and the TargetLen at          00636000
*                             start of compression,                     00637000
*                             incremented by 1 if field CMPSCEE_BITNUM  00638000
*                             was non-zero upon completion of           00639000
*                             compression.                              00640000
*                             Upon completion of the request, this      00641000
*                             length has been decreased by the          00642000
*                             number of bytes processed.                00643000
*                             Do not specify a value >= 2**55.   @01A*/ 00644000
*     2 CMPSCEE_TargetALET FIXED(32), /* The ALET                       00645000
*                             of the space in which the target area     00646000
*                             resides. Should be 0 for primary ASC      00647000
*                             mode callers.                      @01A*/ 00648000
*     2 CMPSCEE_SourceALET FIXED(32), /* The ALET                       00649000
*                             of the space in which the source area     00650000
*                             resides. Also the ALET of the space in    00651000
*                             which the dictionary resides.             00652000
*                             Should be 0 for primary ASC               00653000
*                             mode callers.                      @01A*/ 00654000
*     2 CMPSCEE_WorkAreaAddr PTR(64), /* Address of a 256-byte work     00655000
*                             area for use by the CSRCMPSC service.     00656000
*                             This work area should begin on a          00657000
*                             doubleword boundary.                      00658000
*                             The address is assumed                    00659000
*                             to be a 64-bit address regardless of      00660000
*                             the caller's AMODE. It may be above       00661000
*                             2G.                                @01A*/ 00662000
*     2 * CHAR(0);             /* End of mapping                 @01A*/ 00663000
* @LOGIC;                                                               00664000
* #PRAGMA TOOL=CBGEN.                                                   00665000
* #USEORG.                                                              00666000
* #DELETE.CMPSCEE_ED_OFFSET                                             00667000
* #DELETE.CMPSCEE_BITNUM                                                00668000
* #REPLACENOH.CMPSCEE_DICTADDR_BYTES6TO7                                00669000
*CMPSCEE_DICTADDR_BYTES6TO7  DS BL2 Bits 48-63                          00670000
*CMPSCEE_ED_OFFSET EQU X'0FF8'  Mask to isolate bits                  * 00671000
*                         52-60 within CMPSCEE_DictAddr_Bytes6To7.    * 00672000
*                         For entropy encoding, these 9 bits, with    * 00673000
*                         7 zeroes appended on the right, are the     * 00674000
*                         offset from the start of the dictionary to  * 00675000
*                         the start of the entropy descriptors. After * 00676000
*                         ANDing with the mask, shift left by 4 bits  * 00677000
*                         to get the offset.                            00678000
*CMPSCEE_BITNUM EQU X'0007'     Mask to isolate bits 61-63            * 00679000
*                         within CMPSCEE_DictAddr_Bytes6To7.          * 00680000
*                         Expand beginning with the compression       * 00681000
*                         symbol that begins with this bit in the     * 00682000
*                         left-most byte. Use the same BitNum value   * 00683000
*                         used when the data was compressed.          * 00684000
*                         Upon completion of the expansion,           * 00685000
*                         bits 61-63 are set to the bit               * 00686000
*                         number of the bit following the last bit    * 00687000
*                         of expanded data.                             00688000
* #EREPLACE.                                                            00689000
* #EPRAGMA.                                                             00690000
* @ENDLOGIC;                                                            00691000
*/* End of PL/X Source                                               */ 00692000
* %IF CSRYCMPS_LIST ^= 'NO' &                                           00693000
*    ZCBPRINT ^= 'NO' %THEN                                             00694000
*   %GOTO CSRYCMPS_4;                                                   00695000
*   @LIST POP NOECHO;                                                   00696000
* %CSRYCMPS_4:;                                                         00697000
* %END;                                                                 00698000
