*                                                                       00001000
* %DCL CSVAPSMF_INCLUDED CHAR EXT;                                      00002000
* %DEACTIVATE CSVAPSMF_INCLUDED;                                        00003000
* %IF CSVAPSMF_INCLUDED = '' %THEN                                      00004000
* %DO;                                                                  00005000
*/* Macro made bi-lingual on 19035. CBGEN compile date 15295         */ 00006000
*% /*                                                                   00007000
         MACRO                                                          00008000
         CSVAPSMF &DSECT=YES,&LIST=YES,&TITLE=YES,&SMF90T37=YES         00009000
         GBLC  &CSVAPSMF_INCLUDED                                       00010000
         GBLC  &ZCBPRINT                                                00011000
&CSVAPSMF_INCLUDED SETC 'YES'                                           00012000
         AIF   ('&LIST' EQ 'NONE').P0                                   00013000
         AIF   ('&TITLE' EQ 'NO').P5                                    00014000
 TITLE   'CSVAPSMF  - Dynamic APF SMF record 90 subtype 37           '  00015000
.P5      ANOP                                                           00016000
**/ CSVAPSMF_1:;                                                        00017000
*/* START OF SPECIFICATIONS ******************************************* 00018000
*                                                                       00019000
*  **PROPRIETARY_STATEMENT********************************************  00020000
***01* PROPRIETARY STATEMENT=                                        *  00021000
*                                                                    *  00022000
*                                                                    *  00023000
*   LICENSED MATERIALS - PROPERTY OF IBM                             *  00024000
*   5650-ZOS COPYRIGHT IBM CORP. 2017                                *  00025000
*                                                                    *  00026000
*   STATUS= HBB77B0                                                  *  00027000
*                                                                    *  00028000
*  **END_OF_PROPRIETARY_STATEMENT*************************************  00029000
*                                                                       00030000
*01* DESCRIPTIVE NAME:  Dynamic APF SMF record 90 subtype 37            00031000
*02*  ACRONYM:  APSM                                                    00032000
*                                                                       00033000
*01* MACRO NAME:  CSVAPSMF                                              00034000
*                                                                       00035000
*01* EXTERNAL CLASSIFICATION: PI                                        00036000
*01* END OF EXTERNAL CLASSIFICATION:                                    00037000
*                                                                       00038000
*01* DSECT NAME:                                                        00039000
*     SMF90T37                                                          00040000
*                                                                       00041000
*01* COMPONENT:  Contents Supervision (SC1CJ)                           00042000
*                                                                       00043000
*01* EYE-CATCHER:  NONE                                                 00044000
*                                                                       00045000
*01* STORAGE ATTRIBUTES:                                                00046000
*02*  SUBPOOL:  N/A                                                     00047000
*02*  KEY:  N/A                                                         00048000
*02*  RESIDENCY:  N/A                                                   00049000
*                                                                       00050000
*01* SIZE:                                                              00051000
*                SMF90T37 -- X'00B0' bytes                              00052000
*                                                                       00053000
*01* CREATED BY:                                                        00054000
*     Dynamic APF processing, and written to SMF data set               00055000
*      upon change to the APF list (or its format)                      00056000
*                                                                       00057000
*01* POINTED TO BY:                                                     00058000
*     N/A                                                               00059000
*                                                                       00060000
*01* SERIALIZATION:                                                     00061000
*     None required                                                     00062000
*                                                                       00063000
*01* FUNCTION:                                                          00064000
*02* Maps the data provided for SMF record type 90 subtype 37           00065000
*                                                                       00066000
*                                                                       00067000
*                                                                       00068000
*01* METHOD OF ACCESS:                                                  00069000
*02*  IFASMFR ,                                                         00070000
*     Notes: To find the address of the SMF90T37 area, add the address  00071000
*            of the SMF record plus field SMF90DOF                      00072000
*                                                                       00073000
*02*  PL/AS:                                                            00074000
*      %INCLUDE SYSLIB(IFASMFR)                                         00075000
*                                                                       00076000
*01* DELETED BY:  SMF processing                                        00077000
*                                                                       00078000
*01* FREQUENCY:  Created for APF update                                 00079000
*                                                                       00080000
*01* DEPENDENCIES:  None                                                00081000
*                                                                       00082000
*01* DISTRIBUTION LIBRARY:  AMACLIB                                     00083000
*                                                                       00084000
*01* CHANGE ACTIVITY:                                                   00085000
*   $L0=DYAPFCBG ,HBB77A0 140401 PD00XB: Dynamic APF                    00086000
*   $L1=ME27684  ,HBB77A0 140401 PD00XB: Dynamic APF                    00087000
*   $L2=ME28615  ,HBB77A0 150108 PD00XB: Dynamic APF                    00088000
*   $L3=WI81762  ,HBB77B0 150501 PD00XB: APFSMFALL                      00089000
*   $L4=WI91716  ,HBB77B0 150806 PD00XB: Consname                       00090000
*                                                                       00091000
* END OF SPECIFICATIONS *********************************************/  00092000
*% /*                                                                   00093000
.P0      ANOP                                                           00094000
         AIF   ('&ZCBPRINT' EQ 'NO').P1                                 00095000
         AIF   ('&LIST' EQ 'YES').P2                                    00096000
.P1      ANOP                                                           00097000
         PUSH  PRINT                                                    00098000
         PRINT OFF                                                      00099000
.P2      ANOP                                                           00100000
         AIF   ('&SMF90T37' EQ 'NO').L0002                              00101000
         AIF   ('&DSECT' EQ 'YES').L0003                                00102000
         AIF   ('&SMF90T37' NE 'YES').L0002                             00103000
SMF90T37 DS    0D        SMF record (type 90 subtype 37) data           00104000
         AGO   .L0004                                                   00105000
.L0003   ANOP                                                           00106000
SMF90T37 DSECT           SMF record (type 90 subtype 37) data           00107000
.L0004   ANOP                                                           00108000
SMF90T37FUNCTION DS X    See equates SMF90T37Add, SMF90T37Delete,      *00109000
                         SMF90T37DynFormat, SMF90T37StatFormat          00110000
SMF90T37FLAGS DS 0B      Flags                                          00111000
SMF90T37_SETPROG EQU X'80' Update via SETPROG command                   00112000
SMF90T37_SET_PROG EQU X'40' Update via SET PROG command                 00113000
SMF90T37_CSVAPF EQU X'20' Update via CSVAPF macro                       00114000
SMF90T37_ALREADYASNEEDED EQU X'01' The APF list already has the        *00115000
                         requested data or format. This bit will not   *00116000
                         be on for an ADD unless the APFSMFALL option  *00117000
                         (usually via PROGxx) is in effect              00118000
         ORG   SMF90T37FLAGS+1                                          00119000
SMF90T37PARMMEMSUFFIX DS CL2 When SMF90T37_SET_PROG, the PROGxx        *00120000
                         parmlib member name's "xx".                    00121000
SMF90T37DSNAME DS CL44   The data set name when function is not        *00122000
                         "DynFormat" or "StatFormat" (otherwise        *00123000
                         undefined)                                     00124000
SMF90T37VOLUME DS CL6    The volume when function is not "DynFormat"   *00125000
                         or "StatFormat" (otherwise undefined). This   *00126000
                         will be zeroes for an add or delete           *00127000
                         indicating SMS-managed (such as by SMS on     *00128000
                         SETPROG APF ADD)                               00129000
         DS    CL2       Reserved                                       00130000
SMF90T37TIMESTAMP DS CL8 Time value (via STCK) of the update            00131000
SMF90T37JOBNAME DS CL8   The jobname of issuer of the APF request. For *00132000
                         a SETPROG command or SET PROG processing,     *00133000
                         this will be the job name of the ASID         *00134000
                         processing the command (ASID 1 - *MASTER*)     00135000
SMF90T37CHKEY DS CL8     The CHKEY field from the CSCB (for a started  *00136000
                         task, this is the stepname). Zeroes if there  *00137000
                         is no CSCB.                                    00138000
SMF90T37CONSID DS F      Console ID of issuer of the APF request. The  *00139000
                         value is -1 if the request was via the CSVAPF *00140000
                         macro                                          00141000
         DS    CL4       Reserved                                       00142000
SMF90T37UTOKEN DS 0CL80  Security product user token of issuer of the  *00143000
                         APF request, mapped by ICHRUTKN. You can tell *00144000
                         if the UToken is encrypted or not by bit      *00145000
                         TOKENCR defined by ICHRUTKN                    00146000
         DS    CL64      Part of user token                             00147000
SMF90T37UTOKENUSERID DS CL8 TOKUSER (userid) field of user token        00148000
         DS    CL8       Part of user token                             00149000
SMF90T37CONSNAME DS CL8  Console name of issuer of the APF request.    *00150000
                         The value is zeroes if the request was via    *00151000
                         the CSVAPF macro or if there was no console   *00152000
                         name                                           00153000
SMF90T37ADD EQU 1        This record is a result of ADD to APF          00154000
SMF90T37DELETE EQU 2     This record is a result of DELETE from APF     00155000
SMF90T37DYNFORMAT EQU 4  This record is a result of changing to        *00156000
                         dynamic format                                 00157000
SMF90T37STATFORMAT EQU 6 This record is a result of changing to static *00158000
                         format                                         00159000
SMF90T37_LEN EQU *-SMF90T37                                             00160000
.L0002   ANOP                                                           00161000
         AIF   ('&ZCBPRINT' EQ 'NO').P3                                 00162000
         AIF   ('&LIST' EQ 'YES').P4                                    00163000
.P3      ANOP                                                           00164000
         POP   PRINT                                                    00165000
.P4      ANOP                                                           00166000
.P_EXIT  ANOP                                                           00167000
         MEND                                                           00168000
**/ CSVAPSMF_2:;                                                        00169000
* %CSVAPSMF_INCLUDED = 'YES';                                           00170000
* %DCL ZCBPRINT CHAR EXT;                                               00171000
* %DEACTIVATE ZCBPRINT;                                                 00172000
* %DCL CSVAPSMF_LIST CHAR EXT;                                          00173000
* %DEACTIVATE CSVAPSMF_LIST;                                            00174000
* %IF CSVAPSMF_LIST ^= 'NO' &                                           00175000
*    ZCBPRINT ^= 'NO' %THEN                                             00176000
*   %GOTO CSVAPSMF_3;                                                   00177000
*   @LIST PUSH NOECHO;                                                  00178000
*   @LIST NOASSEMBLE NOECHO;                                            00179000
*   @LIST OFF C NOECHO;                                                 00180000
* %CSVAPSMF_3:;                                                         00181000
*/* Start of PL/X Source                                             */ 00182000
* %SELECT(APSMF_BASED);            /*                            @L1A*/ 00183000
*   %WHEN('')                      /* Not specified?             @L1A*/ 00184000
*     %APSMF_BASED = 'BASED(ADDR(SMFRCD90)+SMF90DOF)'; /*               00185000
*                                   Default to simply based      @L1A*/ 00186000
*   %WHEN('NO')                    /* Don't want it based?       @L1A*/ 00187000
*       %APSMF_BASED = '';         /* Nullify the basing expression     00188000
*                                                                @L1A*/ 00189000
*   %OTHERWISE %;                  /* Else leave what user supplied     00190000
*                                                                @L1A*/ 00191000
* %END SELECT;                     /*                            @L1A*/ 00192000
*   DECLARE                                                             00193000
*     1    SMF90T37 APSMF_BASED,      /* SMF record (type 90 subtype    00194000
*                                   37) data                     @L1A*/ 00195000
*       3    SMF90T37Function FIXED(8),     /* See equates SMF90T37Add, 00196000
*                     SMF90T37Delete,                                   00197000
*                     SMF90T37DynFormat, SMF90T37StatFormat      @L1A*/ 00198000
*       3    SMF90T37Flags BIT(8),    /* Flags                   @L2A*/ 00199000
*         5 SMF90T37_SETPROG Bit(1),  /* Update via SETPROG             00200000
*                     command                                    @L2A*/ 00201000
*         5 SMF90T37_SET_PROG Bit(1), /* Update via SET PROG            00202000
*                     command                                    @L2A*/ 00203000
*         5 SMF90T37_CSVAPF Bit(1),   /* Update via CSVAPF              00204000
*                     macro                                      @L2A*/ 00205000
*         5 * BIT(4),                 /*                         @L2A*/ 00206000
*         5 SMF90T37_AlreadyAsNeeded Bit(1), /* The APF list already    00207000
*                     has the requested data or format. This bit will   00208000
*                     not be on for an ADD unless the APFSMFALL option  00209000
*                     (usually via PROGxx) is in effect          @L3A*/ 00210000
*       3    SMF90T37ParmMemSuffix CHAR(2), /* When SMF90T37_SET_PROG,  00211000
*                     the PROGxx parmlib member name's "xx".     @L2A*/ 00212000
*       3    SMF90T37Dsname CHAR(44), /* The data set name when         00213000
*                     function is not "DynFormat" or "StatFormat"       00214000
*                     (otherwise undefined)                      @L1A*/ 00215000
*       3    SMF90T37Volume CHAR(6),  /* The volume when function is    00216000
*                     not "DynFormat" or "StatFormat" (otherwise        00217000
*                     undefined).                                       00218000
*                     This will be zeroes for an add or                 00219000
*                     delete indicating SMS-managed (such as by         00220000
*                     SMS on SETPROG APF ADD)                    @L1A*/ 00221000
*       3    * CHAR(2),               /* Reserved                @L1A*/ 00222000
*       3    SMF90T37TimeStamp CHAR(8), /* Time value (via STCK) of     00223000
*                                    the update                  @L1A*/ 00224000
*       3    SMF90T37Jobname CHAR(8), /* The jobname of issuer of the   00225000
*                                    APF request. For a SETPROG         00226000
*                                    command or SET PROG processing,    00227000
*                                    this will be the job name of the   00228000
*                                    ASID processing the command (ASID  00229000
*                                    1 - *MASTER*)               @L1A*/ 00230000
*       3    SMF90T37CHKey CHAR(8),   /* The CHKEY field from the       00231000
*                                    CSCB (for a started task, this     00232000
*                                    is the stepname). Zeroes if        00233000
*                                    there is no CSCB.           @L1A*/ 00234000
*       3    SMF90T37Consid FIXED(32),  /* Console ID of issuer of      00235000
*                     the APF request. The value is -1 if the request   00236000
*                     was via the CSVAPF macro                   @L1A*/ 00237000
*       3    * CHAR(4),               /* Reserved                @L1A*/ 00238000
*       3    SMF90T37UToken CHAR(80),   /* Security product user token  00239000
*                                   of issuer of the APF request,       00240000
*                                   mapped by ICHRUTKN. You can tell    00241000
*                                   if the UToken is encrypted or not   00242000
*                                   by bit TOKENCR defined by           00243000
*                                   ICHRUTKN                     @L1A*/ 00244000
*         5  * CHAR(64),              /* Part of user token      @L1A*/ 00245000
*         5  SMF90T37UTokenUserid Char(8),  /* TOKUSER (userid) field   00246000
*                                   of user token                @L1A*/ 00247000
*         5  * CHAR(8),               /* Part of user token      @L1A*/ 00248000
*       3    SMF90T37Consname CHAR(8),  /* Console name of issuer of    00249000
*                     the APF request. The value is zeroes if the       00250000
*                     request was via the CSVAPF macro or if there      00251000
*                     was no console name                        @L4A*/ 00252000
*       3    * CHAR(0) Bdy(DWORD);    /* End of SMF area         @L1A*/ 00253000
*                                                                       00254000
*   DECLARE                                                             00255000
*     SMF90T37Add CONSTANT(1);        /* This record is a result of     00256000
*                                        ADD to APF              @L1A*/ 00257000
*   DECLARE                                                             00258000
*     SMF90T37Delete CONSTANT(2);     /* This record is a result of     00259000
*                                        DELETE from APF         @L1A*/ 00260000
*   DECLARE                                                             00261000
*     SMF90T37DynFormat Constant(4);  /* This record is a result of     00262000
*                     changing to dynamic format                 @L1A*/ 00263000
*   DECLARE                                                             00264000
*     SMF90T37StatFormat Constant(6); /* This record is a result of     00265000
*                     changing to static format                  @L1A*/ 00266000
* @LOGIC;                                                               00267000
* #PRAGMA TOOL=CBGEN.                                                   00268000
* #USEORG.                                                              00269000
* #AlignOp.                                                             00270000
* #NotUpper.                                                            00271000
* #EPRAGMA.                                                             00272000
* @ENDLOGIC;                                                            00273000
*/* End of PL/X Source                                               */ 00274000
* %IF CSVAPSMF_LIST ^= 'NO' &                                           00275000
*    ZCBPRINT ^= 'NO' %THEN                                             00276000
*   %GOTO CSVAPSMF_4;                                                   00277000
*   @LIST POP NOECHO;                                                   00278000
* %CSVAPSMF_4:;                                                         00279000
* %END;                                                                 00280000
