*                                                                       00001000
* %DCL CSVEXTI_INCLUDED CHAR EXT;                                       00002000
* %DEACTIVATE CSVEXTI_INCLUDED;                                         00003000
* %IF CSVEXTI_INCLUDED = '' %THEN                                       00004000
* %DO;                                                                  00005000
*/* Macro made bi-lingual on 21014. CBGEN compile date 20027         */ 00006000
*% /*                                                                   00007000
         MACRO                                                          00008000
         CSVEXTI &DSECT=YES,&LIST=YES,&TITLE=YES,&EXTI=YES,            *00009000
               &EXTIXE=COND                                             00010000
         GBLC  &CSVEXTI_INCLUDED                                        00011000
         GBLC  &ZCBPRINT                                                00012000
&CSVEXTI_INCLUDED SETC 'YES'                                            00013000
         AIF   ('&LIST' EQ 'NONE').P0                                   00014000
         AIF   ('&TITLE' EQ 'NO').P5                                    00015000
 TITLE   'CSVEXTI  - LOAD EXTInfo parameter mapping                 '   00016000
.P5      ANOP                                                           00017000
**/ CSVEXTI_1:;                                                         00018000
*/* START OF SPECIFICATIONS ******************************************* 00019000
*                                                                       00020000
*                                                                       00021000
*  **PROPRIETARY_STATEMENT********************************************  00022000
***01* PROPRIETARY STATEMENT=                                        *  00023000
*                                                                    *  00024000
*                                                                    *  00025000
*   LICENSED MATERIALS - PROPERTY OF IBM                             *  00026000
*   5650-ZOS COPYRIGHT IBM CORP. 2002, 2021                          *  00027000
*                                                                    *  00028000
*   STATUS= HBB77D0                                                  *  00029000
*                                                                    *  00030000
*  **END_OF_PROPRIETARY_STATEMENT*************************************  00031000
*                                                                       00032000
*01* DESCRIPTIVE NAME:  LOAD EXTInfo parameter mapping                  00033000
*02*  ACRONYM:  EXTI                                                    00034000
*                                                                       00035000
*01* MACRO NAME:  CSVEXTI                                               00036000
*                                                                       00037000
*01* EXTERNAL CLASSIFICATION: PI                                        00038000
*01* END OF EXTERNAL CLASSIFICATION:                                    00039000
*                                                                       00040000
*01* DSECT NAME:                                                        00041000
*     EXTI                                                              00042000
*     EXTIXE                                                            00043000
*                                                                       00044000
*01* COMPONENT:  Contents Supervision (SC1CJ)                           00045000
*                                                                       00046000
*01* EYE-CATCHER:  NONE                                                 00047000
*                                                                       00048000
*01* STORAGE ATTRIBUTES:                                                00049000
*02*  SUBPOOL:  Caller-supplied                                         00050000
*02*  KEY:  Caller-supplied                                             00051000
*02*  RESIDENCY:  Caller-supplied                                       00052000
*                                                                       00053000
*01* SIZE:  Variable                                                    00054000
*                EXTI   -- X'0130' bytes                                00055000
*                EXTIXE -- X'0010' bytes                                00056000
*                                                                       00057000
*01* CREATED BY:                                                        00058000
*     Caller and passed as parameter on EXTINFO keyword                 00059000
*      on LOAD                                                          00060000
*                                                                       00061000
*01* POINTED TO BY:                                                     00062000
*     LOAD parameter list                                               00063000
*                                                                       00064000
*01* SERIALIZATION:                                                     00065000
*     None required                                                     00066000
*                                                                       00067000
*01* FUNCTION:                                                          00068000
*02* Maps the data returned by the LOAD macro EXTINFO keyword.          00069000
*                                                                       00070000
*                                                                       00071000
*01* METHOD OF ACCESS:                                                  00072000
*02*  ASM:                                                              00073000
*      CSVEXTI                                                          00074000
*           DSECT=YES!NO  -- Request DSECT definition                   00075000
*           EXTI=YES!NO!COND -- Request Header record mapping           00076000
*                            USING on EXTI                              00077000
*           EXTIXE=YES!NO!COND -- Request Header record mapping         00078000
*                            USING on EXTIXE                            00079000
*     Default: DSECT=YES,EXTI=YES,EXTIXE=COND                           00080000
*     Notes: name=YES  => expand                                        00081000
*            name=NO   => do not expand                                 00082000
*            name=COND => expand only if DSECT=YES                      00083000
*                                                                       00084000
*02*  PL/X:                                                             00085000
*      %INCLUDE SYSLIB(CSVEXTI)                                         00086000
*                                                                       00087000
*01* DELETED BY:  Caller                                                00088000
*                                                                       00089000
*01* FREQUENCY:  Created for response to LOAD EXTINFO=e                 00090000
*                                                                       00091000
*01* DEPENDENCIES:  None                                                00092000
*                                                                       00093000
*01* DISTRIBUTION LIBRARY:  AMACLIB                                     00094000
*                                                                       00095000
*01* CHANGE ACTIVITY:                                                   00096000
*   $L0=DYNLLCBG ,HBB7705,000111,PD00XB: 64-bit Virtual                 00097000
*                                                                       00098000
* END OF SPECIFICATIONS *********************************************/  00099000
*% /*                                                                   00100000
.P0      ANOP                                                           00101000
         AIF   ('&ZCBPRINT' EQ 'NO').P1                                 00102000
         AIF   ('&LIST' EQ 'YES').P2                                    00103000
.P1      ANOP                                                           00104000
         PUSH  PRINT                                                    00105000
         PRINT OFF                                                      00106000
.P2      ANOP                                                           00107000
         AIF   ('&EXTI' EQ 'NO').L0002                                  00108000
         AIF   ('&DSECT' EQ 'YES').L0003                                00109000
         AIF   ('&EXTI' NE 'YES').L0002                                 00110000
.L0003   ANOP                                                           00111000
*                                                                       00112000
*                                                                       00113000
*                                                                       00114000
         AIF   ('&DSECT' EQ 'YES').L0004                                00115000
EXTI     DS    0D        EXTINFO mapping                                00116000
         AGO   .L0005                                                   00117000
.L0004   ANOP                                                           00118000
EXTI     DSECT           EXTINFO mapping                                00119000
.L0005   ANOP                                                           00120000
EXTI_VERSION DS X        Must be initialized to 0                       00121000
EXTI_NUMEXTENTS DS X     1 to 16                                        00122000
EXTI_AUTH DS   X         Authorization                                  00123000
         DS    CL5       Reserved                                       00124000
EXTI_EPA_BASSM DS CL8    Entry Point address. This address is in the   *00125000
                         format needed to BASSM to the target routine. *00126000
                         Thus, an AMODE 64 target will have bit 63 on. *00127000
                         An AMODE 31 target will have bit 32 on. An    *00128000
                         AMODE 24 target will have neither.             00129000
         ORG   EXTI_EPA_BASSM                                           00130000
EXTI_EPA_BASSM_H DS CL4  High half                                      00131000
EXTI_EPA_BASSM_L DS CL4  Low half                                       00132000
EXTI_EPA DS    CL8       Entry Point address. This has no AMODE bits   *00133000
                         on.                                            00134000
         ORG   EXTI_EPA                                                 00135000
EXTI_EPA_H DS  CL4       High half                                      00136000
EXTI_EPA_L DS  CL4       Low half                                       00137000
EXTI_XATTR1 DS CL8       Extended attributes                            00138000
         DS    CL16      Reserved                                       00139000
EXTI_EXTENT_AREA DS CL256 EXTI_NUMEXTENTS contiguous entries each      *00140000
                         mapped by DSECT EXTIXE                         00141000
EXTI_LEN EQU   *-EXTI                                                   00142000
.L0002   ANOP                                                           00143000
         AIF   ('&EXTIXE' EQ 'NO').L0006                                00144000
         AIF   ('&DSECT' EQ 'YES').L0007                                00145000
         AIF   ('&EXTIXE' NE 'YES').L0006                               00146000
EXTIXE   DS    0F        Extinfo Extent Entry                           00147000
         AGO   .L0008                                                   00148000
.L0007   ANOP                                                           00149000
EXTIXE   DSECT           Extinfo Extent Entry                           00150000
.L0008   ANOP                                                           00151000
EXTIXE_ADDR DS CL8       Address                                        00152000
         ORG   EXTIXE_ADDR                                              00153000
EXTIXE_ADDR_H DS CL4     High half                                      00154000
EXTIXE_ADDR_L DS CL4     Low half                                       00155000
EXTIXE_LENGTH DS CL8     Length                                         00156000
         ORG   EXTIXE_LENGTH                                            00157000
EXTIXE_LENGTH_H DS CL4   High half                                      00158000
EXTIXE_LENGTH_L DS CL4   Low half                                       00159000
EXTIXE_LEN EQU *-EXTIXE                                                 00160000
.L0006   ANOP                                                           00161000
         AIF   ('&ZCBPRINT' EQ 'NO').P3                                 00162000
         AIF   ('&LIST' EQ 'YES').P4                                    00163000
.P3      ANOP                                                           00164000
         POP   PRINT                                                    00165000
.P4      ANOP                                                           00166000
.P_EXIT  ANOP                                                           00167000
         MEND                                                           00168000
**/ CSVEXTI_2:;                                                         00169000
* %CSVEXTI_INCLUDED = 'YES';                                            00170000
* %DCL ZCBPRINT CHAR EXT;                                               00171000
* %DEACTIVATE ZCBPRINT;                                                 00172000
* %DCL CSVEXTI_LIST CHAR EXT;                                           00173000
* %DEACTIVATE CSVEXTI_LIST;                                             00174000
* %IF CSVEXTI_LIST = 'NO' !                                             00175000
*    ZCBPRINT = 'NO' %THEN                                              00176000
* %DO;                                                                  00177000
*   @LIST PUSH NOECHO;                                                  00178000
*   @LIST NOASSEMBLE NOECHO;                                            00179000
*   @LIST OFF C NOECHO;                                                 00180000
* %END;                                                                 00181000
*/* Start of PL/X Source                                             */ 00182000
*?ASAXMAC SetEsameInfo;                /*                        @L1A*/ 00183000
*%IF EXTI_ATTR = '' %THEN                                               00184000
*  %EXTI_ATTR = 'TYPE';                                                 00185000
*DCL 1 EXTI EXTI_ATTR BDY(DWORD)       /* EXTINFO mapping        @L1A*/ 00186000
*     ,3 EXTI_VERSION FIXED(8)         /* Must be initialized to 0      00187000
*                                                                @L1A*/ 00188000
*     ,3 EXTI_NUMEXTENTS FIXED(8)      /* 1 to 16                @L1A*/ 00189000
*     ,3 EXTI_AUTH FIXED(8)            /* Authorization          @L1A*/ 00190000
*     ,3 * CHAR(5)                     /* Reserved               @L1A*/ 00191000
*     ,3 EXTI_EPA_BASSM AsaxmacP64 BDY(DWORD) /* Entry Point address.   00192000
*                         This address is in the format needed to       00193000
*                         BASSM to the target routine.  Thus, an        00194000
*                         AMODE 64 target will have bit 63 on.          00195000
*                         An AMODE 31 target will have bit 32 on.       00196000
*                         An AMODE 24 target will have neither.  @L1A*/ 00197000
*       ,5 EXTI_EPA_BASSM_H CHAR(4)    /* High half              @L1A*/ 00198000
*       ,5 EXTI_EPA_BASSM_L CHAR(4)    /* Low  half              @L1A*/ 00199000
*     ,3 EXTI_EPA AsaxmacP64 BDY(DWORD) /* Entry Point address.         00200000
*                         This has no AMODE bits on.             @L1A*/ 00201000
*       ,5 EXTI_EPA_H CHAR(4)          /* High half              @L1A*/ 00202000
*       ,5 EXTI_EPA_L CHAR(4)          /* Low  half              @L1A*/ 00203000
*     ,3 EXTI_XATTR1 CHAR(8)           /* Extended attributes    @L1A*/ 00204000
*     ,3 * CHAR(16)                    /* Reserved               @L1A*/ 00205000
*     ,3 EXTI_EXTENT_AREA CHAR(256) BDY(DWORD)  /*                      00206000
*                                         EXTI_NUMEXTENTS contiguous    00207000
*                                         entries each mapped by DSECT  00208000
*                                         EXTIXE                 @L1A*/ 00209000
*     ,3 * CHAR(0) BDY(DWORD);  /* DWord-align the ending        @L1A*/ 00210000
*%IF EXTIXE_ATTR = '' %THEN                                             00211000
*  %EXTIXE_ATTR = 'TYPE';                                               00212000
*DCL 1 EXTIXE EXTIXE_ATTR              /* Extinfo Extent Entry   @L1A*/ 00213000
*     ,3 EXTIXE_ADDR AsaxmacP64        /* Address                @L1A*/ 00214000
*       ,5 EXTIXE_ADDR_H CHAR(4)       /* High half              @L1A*/ 00215000
*       ,5 EXTIXE_ADDR_L CHAR(4)       /* Low  half              @L1A*/ 00216000
*     ,3 EXTIXE_LENGTH AsaxmacF64      /* Length                 @L1A*/ 00217000
*       ,5 EXTIXE_LENGTH_H CHAR(4)     /* High half              @L1A*/ 00218000
*       ,5 EXTIXE_LENGTH_L CHAR(4)     /* Low  half              @L1A*/ 00219000
*     ,3 * CHAR(0) BDY(WORD);  /* Word-align the ending          @L1A*/ 00220000
* @LOGIC;                                                               00221000
* #PRAGMA TOOL=CBGEN.                                                   00222000
* #USEORG.                                                              00223000
* #EPRAGMA.                                                             00224000
* @ENDLOGIC;                                                            00225000
*/* End of PL/X Source                                               */ 00226000
* %IF CSVEXTI_LIST = 'NO' !                                             00227000
*    ZCBPRINT = 'NO' %THEN                                              00228000
* %DO;                                                                  00229000
*   @LIST POP NOECHO;                                                   00230000
* %END;                                                                 00231000
* %END;                                                                 00232000
