*                                                                       00001000
* %DCL CSVLPSMF_INCLUDED CHAR EXT;                                      00002000
* %DEACTIVATE CSVLPSMF_INCLUDED;                                        00003000
* %IF CSVLPSMF_INCLUDED = '' %THEN                                      00004000
* %DO;                                                                  00005000
*/* Macro made bi-lingual on 19035. CBGEN compile date 15295         */ 00006000
*% /*                                                                   00007000
         MACRO                                                          00008000
         CSVLPSMF &DSECT=YES,&LIST=YES,&TITLE=YES,&SMF90T31=YES         00009000
         GBLC  &CSVLPSMF_INCLUDED                                       00010000
         GBLC  &ZCBPRINT                                                00011000
&CSVLPSMF_INCLUDED SETC 'YES'                                           00012000
         AIF   ('&LIST' EQ 'NONE').P0                                   00013000
         AIF   ('&TITLE' EQ 'NO').P5                                    00014000
 TITLE   'CSVLPSMF  - Dynamic LPA SMF record 90 subtype 31           '  00015000
.P5      ANOP                                                           00016000
**/ CSVLPSMF_1:;                                                        00017000
*/* START OF SPECIFICATIONS ******************************************* 00018000
*                                                                       00019000
*  **PROPRIETARY_STATEMENT********************************************  00020000
***01* PROPRIETARY STATEMENT=                                        *  00021000
*                                                                    *  00022000
*                                                                    *  00023000
*   LICENSED MATERIALS - PROPERTY OF IBM                             *  00024000
*   5650-ZOS COPYRIGHT IBM CORP. 1997, 2017                          *  00025000
*                                                                    *  00026000
*   STATUS= HBB77B0                                                  *  00027000
*                                                                    *  00028000
*  **END_OF_PROPRIETARY_STATEMENT*************************************  00029000
*                                                                       00030000
*01* DESCRIPTIVE NAME:  Dynamic LPA SMF record 90 subtype 31            00031000
*02*  ACRONYM:  LPSM                                                    00032000
*                                                                       00033000
*01* MACRO NAME:  CSVLPSMF                                              00034000
*                                                                       00035000
*01* EXTERNAL CLASSIFICATION: GUPI                                      00036000
*01* END OF EXTERNAL CLASSIFICATION:                                    00037000
*                                                                       00038000
*01* DSECT NAME:                                                        00039000
*     SMF90T31                                                          00040000
*                                                                       00041000
*01* COMPONENT:  Contents Supervision (SC1CJ)                           00042000
*                                                                       00043000
*01* EYE-CATCHER:  NONE                                                 00044000
*                                                                       00045000
*01* STORAGE ATTRIBUTES:                                                00046000
*02*  SUBPOOL:  N/A                                                     00047000
*02*  KEY:  N/A                                                         00048000
*02*  RESIDENCY:  N/A                                                   00049000
*                                                                       00050000
*01* SIZE:                                                              00051000
*                SMF90T31 -- X'0088' bytes                              00052000
*                           +Length(LPMEA)*number-of-modules            00053000
*                                                                       00054000
*01* CREATED BY:                                                        00055000
*     Dynamic LPA processing, and written to SMF data set               00056000
*      upon addition to, or deletion from, LPA                          00057000
*                                                                       00058000
*01* POINTED TO BY:                                                     00059000
*     N/A                                                               00060000
*                                                                       00061000
*01* SERIALIZATION:                                                     00062000
*     None required                                                     00063000
*                                                                       00064000
*01* FUNCTION:                                                          00065000
*02* Maps the data provided for SMF record type 90 subtype 31           00066000
*                                                                       00067000
*                                                                       00068000
*                                                                       00069000
*01* METHOD OF ACCESS:                                                  00070000
*02*  IFASMFR ,                                                         00071000
*     Notes: To find the address of the SMF90T31 area, add the address  00072000
*            of the SMF record plus field SMF90DOF                      00073000
*                                                                       00074000
*02*  PL/AS:                                                            00075000
*      %INCLUDE SYSLIB(IFASMFR)                                         00076000
*                                                                       00077000
*01* DELETED BY:  SMF processing                                        00078000
*                                                                       00079000
*01* FREQUENCY:  Created for ACTIVATE request                           00080000
*                                                                       00081000
*01* DEPENDENCIES:  None                                                00082000
*                                                                       00083000
*01* DISTRIBUTION LIBRARY:  AMACLIB                                     00084000
*                                                                       00085000
*01* CHANGE ACTIVITY:                                                   00086000
*   $D0=DYLPACBG ,JBB6604,961001,PD00XB: Dynamic LPA                    00087000
*   $D1=DSY0001  ,JBB6604,961001,PD00XB: Dynamic LPA                    00088000
*   $L1=WI91716  ,HBB77B0 150806 PD00XB: Consname                       00089000
*                                                                       00090000
* END OF SPECIFICATIONS *********************************************/  00091000
*% /*                                                                   00092000
.P0      ANOP                                                           00093000
         AIF   ('&ZCBPRINT' EQ 'NO').P1                                 00094000
         AIF   ('&LIST' EQ 'YES').P2                                    00095000
.P1      ANOP                                                           00096000
         PUSH  PRINT                                                    00097000
         PRINT OFF                                                      00098000
.P2      ANOP                                                           00099000
         AIF   ('&SMF90T31' EQ 'NO').L0002                              00100000
         AIF   ('&DSECT' EQ 'YES').L0003                                00101000
         AIF   ('&SMF90T31' NE 'YES').L0002                             00102000
SMF90T31 DS    0D        SMF record (type 90 subtype 31) data           00103000
         AGO   .L0004                                                   00104000
.L0003   ANOP                                                           00105000
SMF90T31 DSECT           SMF record (type 90 subtype 31) data           00106000
.L0004   ANOP                                                           00107000
SMF90T31ADDORDELETE DS X See equates SMF90T31ADD and SMF90T31DELETE    *00108000
                         for values                                     00109000
         DS    CL3       Reserved                                       00110000
SMF90T31NUMMODS DS H     Number of modules in this record. Module info *00111000
                         is in field SMF90T31MODS                       00112000
SMF90T31MODOFFSET DS H   Offset from SMF90T31 to start of MODENTRIES.  *00113000
                         The modentries are contiguous in this area,   *00114000
                         each mapped by DSECT LPMEA within macro       *00115000
                         CSVLPRET                                       00116000
SMF90T31NUMMODSREMAINING DS F Number of module entries to be written   *00117000
                         in subsequent records                          00118000
SMF90T31REQUESTOR DS CL16 The requestor ID provided via CSVDYLPA        00119000
SMF90T31TIMESTAMP DS CL8 Time value (from STCK) of the activation       00120000
SMF90T31CONSID DS F      Console ID of issuer of the LPA request. The  *00121000
                         value is -1 if the request was via the        *00122000
                         CSVDYLPA macro                                 00123000
SMF90T31UTOKEN DS 0CL80  Security product user token of issuer of the  *00124000
                         LPA request, mapped by ICHRUTKN. You can tell *00125000
                         if the UToken is encrypted or not by bit      *00126000
                         TOKENCR defined by ICHRUTKN                    00127000
         DS    CL64      Part of user token                             00128000
SMF90T31_UTOKENUSERID DS CL8 TOKUSER (userid) field of user token       00129000
         ORG   SMF90T31UTOKEN+80                                        00130000
SMF90T31CONSNAME DS CL8  Console name of issuer of the activation       00131000
         DS    CL8       Reserved                                       00132000
SMF90T31ADD EQU 0        This record is a result of ADD to LPA          00133000
SMF90T31DELETE EQU 1     This record is a result of DELETE from LPA     00134000
SMF90T31_LEN EQU *-SMF90T31                                             00135000
.L0002   ANOP                                                           00136000
         AIF   ('&ZCBPRINT' EQ 'NO').P3                                 00137000
         AIF   ('&LIST' EQ 'YES').P4                                    00138000
.P3      ANOP                                                           00139000
         POP   PRINT                                                    00140000
.P4      ANOP                                                           00141000
.P_EXIT  ANOP                                                           00142000
         MEND                                                           00143000
**/ CSVLPSMF_2:;                                                        00144000
* %CSVLPSMF_INCLUDED = 'YES';                                           00145000
* %DCL ZCBPRINT CHAR EXT;                                               00146000
* %DEACTIVATE ZCBPRINT;                                                 00147000
* %DCL CSVLPSMF_LIST CHAR EXT;                                          00148000
* %DEACTIVATE CSVLPSMF_LIST;                                            00149000
* %IF CSVLPSMF_LIST ^= 'NO' &                                           00150000
*    ZCBPRINT ^= 'NO' %THEN                                             00151000
*   %GOTO CSVLPSMF_3;                                                   00152000
*   @LIST PUSH NOECHO;                                                  00153000
*   @LIST NOASSEMBLE NOECHO;                                            00154000
*   @LIST OFF C NOECHO;                                                 00155000
* %CSVLPSMF_3:;                                                         00156000
*/* Start of PL/X Source                                             */ 00157000
* %SELECT(LPSMF_BASED);            /*                            @D1A*/ 00158000
*   %WHEN('')                      /* Not specified?             @D1A*/ 00159000
*     %LPSMF_BASED = 'BASED(ADDR(SMFRCD90)+SMF90DOF)'; /*               00160000
*                                   Default to simply based      @D1A*/ 00161000
*   %WHEN('NO')                    /* Don't want it based?       @D1A*/ 00162000
*       %LPSMF_BASED = '';         /* Nullify the basing expression     00163000
*                                                                @D1A*/ 00164000
*   %OTHERWISE %;                  /* Else leave what user supplied     00165000
*                                                                @D1A*/ 00166000
* %END SELECT;                     /*                            @D1A*/ 00167000
*   DECLARE                                                             00168000
*     1    SMF90T31 LPSMF_BASED,      /* SMF record (type 90 subtype    00169000
*                                   31) data                     @D1A*/ 00170000
*       3    SMF90T31AddOrDelete FIXED(8),  /* See equates SMF90T31ADD  00171000
*                     and SMF90T31DELETE for values              @D1A*/ 00172000
*       3    * CHAR(3),               /* Reserved                @D1A*/ 00173000
*       3    SMF90T31NumMods FIXED(16),   /* Number of modules in       00174000
*                                    this record. Module info is in     00175000
*                                    field SMF90T31MODS          @D1A*/ 00176000
*       3    SMF90T31MODOFFSET FIXED(16),  /* Offset from SMF90T31      00177000
*                                    to start of MODENTRIES.            00178000
*                                    The modentries are contiguous in   00179000
*                                    this area, each mapped by          00180000
*                                    DSECT LPMEA within macro CSVLPRET  00181000
*                                                                @D1A*/ 00182000
*       3    SMF90T31NumModsRemaining FIXED(31),  /* Number of module   00183000
*                                    entries to be written in           00184000
*                                    subsequent records          @D1A*/ 00185000
*       3    SMF90T31Requestor CHAR(16),  /* The requestor ID           00186000
*                                    provided via CSVDYLPA       @D1A*/ 00187000
*       3    SMF90T31TimeStamp CHAR(8), /* Time value (from STCK) of    00188000
*                                    the activation              @D1A*/ 00189000
*       3    SMF90T31Consid FIXED(32),  /* Console ID of issuer of      00190000
*                                    the LPA request. The value is      00191000
*                                    -1 if the request was via          00192000
*                                    the CSVDYLPA macro          @D1A*/ 00193000
*       3    SMF90T31UToken CHAR(80),   /* Security product user token  00194000
*                                   of issuer of the LPA request,       00195000
*                                   mapped by ICHRUTKN. You can tell    00196000
*                                   if the UToken is encrypted or not   00197000
*                                   by bit TOKENCR defined by           00198000
*                                   ICHRUTKN                     @L1A*/ 00199000
*         5  * CHAR(64),              /* Part of user token      @L1A*/ 00200000
*         5  SMF90T31_UTokenUserid Char(8), /* TOKUSER (userid) field   00201000
*                                   of user token                @L1A*/ 00202000
*       3    SMF90T31Consname CHAR(8), /* Console name of issuer of     00203000
*                                    the activation              @L1A*/ 00204000
*       3    * CHAR(8),               /* Reserved                @L1A*/ 00205000
*       3    * CHAR(0) Bdy(DWORD);    /* End of SMF area         @D1A*/ 00206000
*                                                                       00207000
*   DECLARE                                                             00208000
*     SMF90T31ADD CONSTANT(0);        /* This record is a result of     00209000
*                                        ADD to LPA              @D1A*/ 00210000
*   DECLARE                                                             00211000
*     SMF90T31DELETE CONSTANT(1);     /* This record is a result of     00212000
*                                        DELETE from LPA         @D1A*/ 00213000
* @LOGIC;                                                               00214000
* #PRAGMA TOOL=CBGEN.                                                   00215000
* #USEORG.                                                              00216000
* #ALIGNOP.                                                             00217000
* #NOTUPPER.                                                            00218000
* #EPRAGMA.                                                             00219000
* @ENDLOGIC;                                                            00220000
*/* End of PL/X Source                                               */ 00221000
* %IF CSVLPSMF_LIST ^= 'NO' &                                           00222000
*    ZCBPRINT ^= 'NO' %THEN                                             00223000
*   %GOTO CSVLPSMF_4;                                                   00224000
*   @LIST POP NOECHO;                                                   00225000
* %CSVLPSMF_4:;                                                         00226000
* %END;                                                                 00227000
