*                                                                       00001000
* %DCL CSVLPRET_INCLUDED CHAR EXT;                                      00002000
* %DEACTIVATE CSVLPRET_INCLUDED;                                        00003000
* %IF CSVLPRET_INCLUDED = '' %THEN                                      00004000
* %DO;                                                                  00005000
*/* Macro made bi-lingual on 19035. CBGEN compile date 15295         */ 00006000
*% /*                                                                   00007000
         MACRO                                                          00008000
         CSVLPRET &DSECT=YES,&LIST=YES,&TITLE=YES,&LPMEA=YES,          *00009000
               &LPMEAX=COND,&LPMEA64=COND,&LPMEAQ=COND,&LPMED=COND      00010000
         GBLC  &CSVLPRET_INCLUDED                                       00011000
         GBLC  &ZCBPRINT                                                00012000
&CSVLPRET_INCLUDED SETC 'YES'                                           00013000
         AIF   ('&LIST' EQ 'NONE').P0                                   00014000
         AIF   ('&TITLE' EQ 'NO').P5                                    00015000
 TITLE   'CSVLPRET  - Dynamic LPA Return Information                 '  00016000
.P5      ANOP                                                           00017000
**/ CSVLPRET_1:;                                                        00018000
*/* START OF SPECIFICATIONS ******************************************* 00019000
*                                                                       00020000
*  **PROPRIETARY_STATEMENT********************************************  00021000
***01* PROPRIETARY STATEMENT=                                        *  00022000
*                                                                    *  00023000
*                                                                    *  00024000
*   LICENSED MATERIALS - PROPERTY OF IBM                             *  00025000
*   5650-ZOS COPYRIGHT IBM CORP. 2015                                *  00026000
*                                                                    *  00027000
*   STATUS= HBB77B0                                                  *  00028000
*                                                                    *  00029000
*  **END_OF_PROPRIETARY_STATEMENT*************************************  00030000
*                                                                       00031000
*01* DESCRIPTIVE NAME:  Dynamic LPA Return Information                  00032000
*02*  ACRONYM:  LPRET                                                   00033000
*                                                                       00034000
*01* MACRO NAME:  CSVLPRET                                              00035000
*                                                                       00036000
*01* EXTERNAL CLASSIFICATION: PI                                        00037000
*01* END OF EXTERNAL CLASSIFICATION:                                    00038000
*                                                                       00039000
*01* DSECT NAME:                                                        00040000
*     LPMEA                                                             00041000
*     LPMEAX                                                            00042000
*     LPMEAQ                                                            00043000
*     LPMEA64                                                           00044000
*     LPMED                                                             00045000
*                                                                       00046000
*01* COMPONENT:  Contents Supervision (SC1CJ)                           00047000
*                                                                       00048000
*01* EYE-CATCHER:  NONE                                                 00049000
*                                                                       00050000
*01* STORAGE ATTRIBUTES:                                                00051000
*02*  SUBPOOL:  Caller-supplied                                         00052000
*02*  KEY:  Caller-supplied                                             00053000
*02*  RESIDENCY:  Caller-supplied                                       00054000
*                                                                       00055000
*01* SIZE:  Variable                                                    00056000
*                LPMEA   -- X'0028' bytes                               00057000
*                LPMEAX  -- X'0010' bytes                               00058000
*                LPMEAQ  -- X'0024' bytes                               00059000
*                LPMEA64 -- X'0030' bytes                               00060000
*                LPMED   -- X'0014' bytes                               00061000
*                                                                       00062000
*01* CONTROL BLOCK CHANGES:                                             00063000
*02*  CSVLPRET                                                          00064000
*02*   5.3                                                              00065000
*03*    New                                                             00066000
*03*    Migration Considerations: NONE                                  00067000
*01* END CONTROL BLOCK CHANGES                                          00068000
*                                                                       00069000
*01* CREATED BY:                                                        00070000
*     Caller and passed as parameter on MODINFO keyword                 00071000
*      on CSVDYLPA ADD and DELETE                                       00072000
*     System and passed as parameter to exit CSVDYLPA                   00073000
*     System and provided as information within                         00074000
*      SMF Type 90 Subtype 31 record                                    00075000
*                                                                       00076000
*01* POINTED TO BY:                                                     00077000
*     CSVDYLPA parameter list                                           00078000
*     Parameter passed to exit CSVDYLPA                                 00079000
*     Area within SMF Type 90 Subtype 31 record                         00080000
*                                                                       00081000
*01* SERIALIZATION:                                                     00082000
*     None required                                                     00083000
*                                                                       00084000
*01* FUNCTION:                                                          00085000
*02* The MODINFO area is a contiguous array of entries,                 00086000
*    mapped by the LPMEA (for ADD) or LPMED (for DELETE) DSECT          00087000
*    An LPMEAX can be provided for ADD, which is also a contiguous      00088000
*    array of entries. Each LPMEAX entry is related to the              00089000
*    corresponding LPMEA entry.                                         00090000
*    An LPMEA64 can be returned on output for ADD. It is also a         00091000
*    contiguous array of entries. Each LPMEA64 entry is related to      00092000
*    the corresponding LPMEA entry.                                     00093000
*    An LPMEAQ must be provided when QueryOnly=YES is specified.        00094000
*02* An area of contiguous entries mapped by the LPMEA DSECT            00095000
*    is provided to exit CSVDYLPA                                       00096000
*02* An area of contiguous entries mapped by the LPMEA DSECT            00097000
*    is provided within the SMF Type 90 Subtype 31 record               00098000
*                                                                       00099000
*01* METHOD OF ACCESS:                                                  00100000
*02*  ASM:                                                              00101000
*      CSVLPRET                                                         00102000
*           DSECT=YES!NO  -- Request DSECT definition                   00103000
*           LPMEA=YES!NO!COND -- Request module info ADD mapping        00104000
*                            USING on LPMEA                             00105000
*           LPMEAQ=YES!NO!COND -- Request module info ADD mapping       00106000
*                            USING on LPMEAQ                            00107000
*           LPMEAX=YES!NO!COND -- Request module info ADD mapping       00108000
*                            USING on LPMEAX                            00109000
*           LPMEA64=YES!NO!COND -- Request module info ADD mapping      00110000
*                            USING on LPMEA64                           00111000
*           LPMED=YES!NO!COND -- Request module info DELETE mapping     00112000
*                            USING on LPMED                             00113000
*     Default: DSECT=YES,LPMEA=YES,LPMED=COND                           00114000
*     Notes: name=YES  => expand                                        00115000
*            name=NO   => do not expand                                 00116000
*            name=COND => expand only if DSECT=YES                      00117000
*                                                                       00118000
*02*  PL/AS:                                                            00119000
*      %INCLUDE SYSLIB(CSVLPRET)                                        00120000
*                                                                       00121000
*01* DELETED BY:  Caller                                                00122000
*                                                                       00123000
*01* FREQUENCY:  Created for input/response to CSVDYLPA ADD/DELETE      00124000
*                                                                       00125000
*01* DEPENDENCIES:  None                                                00126000
*                                                                       00127000
*01* DISTRIBUTION LIBRARY:  AMACLIB                                     00128000
*                                                                       00129000
*01* CHANGE ACTIVITY:                                                   00130000
*   $L0=DYLPACBG ,JBB6604,941231,PD00XB: Dynamic LPA                    00131000
*   $L1=DYLPACSV ,JBB6604,941231,PD00XB: Dynamic LPA                    00132000
*   $L2=64BITCSV  HBB7703 981204 PD00XB: ESAME                          00133000
*   $P1=PYM0416   HBB7706 010810 PD00XB: No AMODE 64 BYADDR in esa/390  00134000
*   $P2=ME01563   HBB7720 040820 PD00XB: LPA size query                 00135000
*   $L3=PEV       HBB7730 050415 PD00XB: AddAlias                       00136000
*   $L4=ME11053   HBB7750 070901 PD00XB: LPA pathname                   00137000
*   $L5=CSV11     HBB7760 071201 PD00XB: LPA pathname ByAddr=No         00138000
*   $L6=MExxxxx   HBB7703 981204 PD00XB: LPMEAX                         00139000
*   $L7=ME14270   HBB7760 080801 PD00XB: DefLPAState                    00140000
*   $P3=ME15419   HBB7770 090301 PD00XB: Misc                           00141000
*   $P4=ME15682   HBB7760 090305 PD00XB: Auth check for pathname        00142000
*   $L8=RMODE64   HBB77B0 150901 PD00XB: RMODE 64                       00143000
*   $01=OA54010   HBB7790 170922 PD00XB: LNKAUTH=APFTAB case            00144000
*                                                                       00145000
* END OF SPECIFICATIONS *********************************************/  00146000
*% /*                                                                   00147000
.P0      ANOP                                                           00148000
         AIF   ('&ZCBPRINT' EQ 'NO').P1                                 00149000
         AIF   ('&LIST' EQ 'YES').P2                                    00150000
.P1      ANOP                                                           00151000
         PUSH  PRINT                                                    00152000
         PRINT OFF                                                      00153000
.P2      ANOP                                                           00154000
         AIF   ('&LPMEA' EQ 'NO').L0002                                 00155000
         AIF   ('&DSECT' EQ 'YES').L0003                                00156000
         AIF   ('&LPMEA' NE 'YES').L0002                                00157000
LPMEA    DS    0F        Modinfo entry for ADD                          00158000
         AGO   .L0004                                                   00159000
.L0003   ANOP                                                           00160000
LPMEA    DSECT           Modinfo entry for ADD                          00161000
.L0004   ANOP                                                           00162000
LPMEAINPUTINFO DS CL10   Information provided by caller of dynamic LPA *00163000
                         services. Provided to exit CSVDYLPA. Mapping  *00164000
                         of module entries within Type 90 Subtype 31   *00165000
                         SMF records.                                   00166000
         ORG   LPMEAINPUTINFO                                           00167000
LPMEANAME DS   CL8       The module name                                00168000
LPMEAINPUTFLAGS DS BL2   Flags set by the caller Not applicable to     *00169000
                         exit CSVDYLPA or SMF record.                   00170000
         ORG   LPMEAINPUTFLAGS                                          00171000
LPMEAINPUTFLAGS0 DS B    Byte 0 of Flags. Not applicable when          *00172000
                         BYADDR=YES.                                    00173000
*  Bit definitions:                                                     00174000
LPMEAFIXED EQU X'80'     If on, page-fix this module                    00175000
LPMEAPAGEPROTPAGE EQU X'40' If on, page-protect only the whole pages   *00176000
                         of this module. If off, page-protect all      *00177000
                         bytes of this module. Be aware that when      *00178000
                         page-protecting all bytes of the module,      *00179000
                         storage utilization for the module may        *00180000
                         increase, as the system allocates a number of *00181000
                         whole pages for the module, rather than just  *00182000
                         the amount of storage that is truly necessary *00183000
                         to load the module.                            00184000
LPMEASTORAGEOWNERSYSTEM EQU X'20' If on, the storage in which the      *00185000
                         module is placed is to be OWNER=SYSTEM. If    *00186000
                         off, it is OWNER=HOME.                         00187000
LPMEAINPUTFLAGS1 DS B    Byte 1 of Flags. Not applicable when          *00188000
                         BYADDR=YES.                                    00189000
*  Bit definitions:                                                     00190000
LPMEASVC EQU   X'80'     This entry is an SVC. The SVC number is in    *00191000
                         LpmeaxSvcnum.                                  00192000
LPMEAESVC EQU  X'40'     This entry is an extended SVC. The SVC number *00193000
                         is in LpmeaxSvcnum. The extended svc routing  *00194000
                         code is in LpmeaxESvcrnum.                     00195000
         ORG   LPMEAINPUTINFO+10                                        00196000
LPMEAOUTPUTINFO DS CL30                                                 00197000
         ORG   LPMEAOUTPUTINFO                                          00198000
LPMEAOUTPUTFLAGS DS BL2  Output: Flags                                  00199000
         ORG   LPMEAOUTPUTFLAGS                                         00200000
LPMEAOUTPUTFLAGS0 DS B   Byte 0 of Flags. Only bits LpmeaSuccess and   *00201000
                         LpmeaRmode64 are applicable to exit CSVDYLPA  *00202000
                         or SMF record - the module entry is only      *00203000
                         valid when bit LpmeaSuccess is on.             00204000
*  Bit definitions:                                                     00205000
LPMEASUCCESS EQU X'80'   Successfully processed                         00206000
LPMEAMODPROB EQU X'40'   A problem occurred processing this entry.     *00207000
                         Function with problem is indicated by         *00208000
                         LpmeaModprobFunction.                          00209000
LPMEAMODPROBABENDINFO EQU X'20' An unexpected abend occurred while     *00210000
                         processing this entry. Further information is *00211000
                         in the LpmeaAbendRsnCodes area.                00212000
LPMEAMODPROBRETURNCODEINFO EQU X'10' An unexpected return code was     *00213000
                         received while processing this entry. Further *00214000
                         information is in the LpmeaRetRsnCodes area.   00215000
LPMEARMODE64 EQU X'01'   When LpmeaSuccess is on, the entry point      *00216000
                         address and/or a load point address is Rmode  *00217000
                         64 (above 2G). This will correlate to a value *00218000
                         of 7FFFFBAD in LpmeaEntryPointAddr and/or     *00219000
                         LpmeaLoadPointAddr and/or                     *00220000
                         LpmeaLoadPointAddr2, indicating that the full *00221000
                         address is available only within the Lpmea64  *00222000
                         data (which is not present for SMF records).   00223000
LPMEAMODPROBFUNCTION DS X Function with problem. See equates below     *00224000
                         that have names beginning with LpmeaModprob.  *00225000
                         Valid when LpmeaModprob is on.                 00226000
         ORG   LPMEAMODPROBFUNCTION                                     00227000
LPMEASUCCESSCONCATNUM DS X The concatenation number (0 to n)           *00228000
                         representing the data set in which the module *00229000
                         was located. This will be 0 when the input    *00230000
                         was by data set (as opposed to by DDNAME or   *00231000
                         DCB address). It is only valid when           *00232000
                         LpmeaSuccess is on, or for exit CSVDYLPA or   *00233000
                         SMF record. It is not valid for ByADDR=YES or *00234000
                         when PATHNAME is used.                         00235000
LPMEASTUFF DS  CL28                                                     00236000
         ORG   LPMEASTUFF                                               00237000
LPMEASUCCESSINFO DS CL28 Valid only when LpmeaSuccess is on.            00238000
         ORG   LPMEASUCCESSINFO                                         00239000
LPMEADELETETOKEN DS CL8  Output: Token to be used on DELETE for this   *00240000
                         module.                                        00241000
LPMEAENTRYPOINTADDR DS A Output: The entry point. (Input for           *00242000
                         BYADDR=YES. When MODINFO64 is used, field     *00243000
                         Lpmea64EntryPointAddr is used, and field      *00244000
                         LpmeaEntryPointAddr is not used.) If this is  *00245000
                         a DELETE event either for exit CSVDYLPA or    *00246000
                         for an SMF record, then this field represents *00247000
                         the entry point address of the now-current    *00248000
                         LPA copy of the module, or has a value of     *00249000
                         X'7FFFFFFF' when there is no remaining LPA    *00250000
                         copy of the module (in which case the          00251000
*                        LoadPointAddr and Length fields are not       *00252000
                         valid). A value of x'7FFFFBAD' in output for  *00253000
                         an ADD event indicates that the address was   *00254000
                         above 2G. The LPMEA64 structure, if provided, *00255000
                         contains the full information.                 00256000
         ORG   LPMEAENTRYPOINTADDR                                      00257000
LPMEAENTRYPOINTADDRBYTES0TO2 DS BL3                                     00258000
*  Bit definitions:                                                     00259000
LPMEAENTRYPOINTADDRBIT0 EQU X'80' On if AMODE=31 or if the caller is   *00260000
                         AMODE 31 and the entry is AMODE=ANY            00261000
LPMEAENTRYPOINTADDRBYTE3 DS B                                           00262000
*  Bit definitions:                                                     00263000
LPMEAENTRYPOINTADDRBIT31 EQU X'01' On if AMODE=64                       00264000
         ORG   LPMEAENTRYPOINTADDR+4                                    00265000
LPMEALOADPOINTADDR DS A  Output: The load point. (Input for            *00266000
                         BYADDR=YES. When MODINFO64 is used, field     *00267000
                         Lpmea64LoadPointAddr is used, and field       *00268000
                         LpmeaLoadPointAddr is not used.) A value of   *00269000
                         x'7FFFFBAD' in output for an ADD event        *00270000
                         indicates that the address was above 2G. The  *00271000
                         LPMEA64 structure, if provided, contains the  *00272000
                         full information.                              00273000
LPMEAMODLEN DS F         Output: The length. (Input for BYADDR=YES.)    00274000
LPMEALOADPOINTADDR2 DS A Output: The load point of the secondary area. *00275000
                         A PDSE module may be split into two parts of  *00276000
                         differing RMODEs. When the module is not      *00277000
                         split, this will be 0. (Input for BYADDR=YES. *00278000
                         When MODINFO64 is used, field                 *00279000
                         Lpmea64LoadPointAddr2 is used, and field      *00280000
                         LpmeaLoadPointAddr2 is not used.) A value of  *00281000
                         x'7FFFFBAD' in output for an ADD event        *00282000
                         indicates that the address was above 2G. The  *00283000
                         LPMEA64 structure, if provided, contains the   00284000
*                        full information. For BYADDR=YES, this field  *00285000
                         is ignored if LpmeaModLen2 is 0.               00286000
LPMEAMODLEN2 DS F        Output: The length of the secondary area.     *00287000
                         When the module is not split, this will be 0. *00288000
                         (Input for BYADDR=YES.)                        00289000
         ORG   LPMEASTUFF                                               00290000
LPMEARETRSNCODES DS CL8  Valid when LpmeaModprobReturnCodeInfo          00291000
         ORG   LPMEARETRSNCODES                                         00292000
LPMEARETCODE DS F        Output: Return code from function designated  *00293000
                         in LpmeaModprobFunction                        00294000
LPMEARSNCODE DS F        Output: Reason code from function designated  *00295000
                         in LpmeaModprobFunction                        00296000
         ORG   LPMEASTUFF                                               00297000
LPMEAABENDRSNCODES DS CL8 Valid when LpmeaModprobAbendInfo              00298000
         ORG   LPMEAABENDRSNCODES                                       00299000
LPMEAABENDCODE DS F      Output: Abend code from function designated   *00300000
                         in LpmeaModprobFunction                        00301000
LPMEAABENDRSNCODE DS F   Output: Abend reason code from function       *00302000
                         designated in LpmeaModprobFunction             00303000
         ORG   LPMEAOUTPUTINFO+30                                       00304000
LPMEA_LEN_V0 EQU 40      Version 0 length                               00305000
LPMEAMODPROBNOTFOUND EQU 1 The module could not be located via the     *00306000
                         data set, ddname, or DCB@ that was provided    00307000
LPMEAMODPROBNOTAUTH EQU 2 Not authorized to add this module to LPA      00308000
LPMEAMODPROBDIRECTORY EQU 3 Directory processing produced an           *00309000
                         unexpected return code                         00310000
LPMEAMODPROBFETCH EQU 4  FETCH produced an unexpected return code       00311000
LPMEAMODPROBPAGEPROT EQU 6 PGSER PROTECT produced an unexpected abend   00312000
LPMEAMODPROBTOOMANYEXTENTS EQU 7 Only load modules with 1 or 2 extents *00313000
                         defined can be processed.                      00314000
LPMEAMODPROBNOTEXECUTABLE EQU 8 The module is not executable            00315000
LPMEAMODPROBDESERVDESL EQU 10 Directory processing produced an         *00316000
                         unexpected return code                         00317000
LPMEAMODPROBDUPLICATE EQU 11 The member is a duplicate of another      *00318000
                         member.                                        00319000
LPMEAMODPROBAMODE64NOTZARCH EQU 12 Attempt to create an LPA module     *00320000
                         byaddr that is AMODE 64 but the system is not *00321000
                         running in z/Architecture mode                 00322000
LPMEAMODPROBBPX4LOD EQU 13 Bpx4lod produced an unexpected return code   00323000
LPMEAMODPROBNOTAPFPROG EQU 14 The module to be loaded via pathname was *00324000
                         not marked as an APF program via the UNIX     *00325000
                         extattr command with the +a attribute.         00326000
LPMEAMODPROBNOTAPFDS EQU 15 The module to be loaded was to be located  *00327000
                         by the LNKLST DCB while requesting            *00328000
                         APFREQUIRED=YES. LNKAUTH=APFTAB was in        *00329000
                         effect. The data set containing the module    *00330000
                         was not APF-authorized.                        00331000
LPMEAMODPROBUNEXPECTEDABEND EQU 20 An unexpected abend resulted while  *00332000
                         processing. Fields LpmeaAbendcode and         *00333000
                         LpmeaAbendrsncode contain the abend code and  *00334000
                         abend reason code.                             00335000
LPMEA_LEN EQU  *-LPMEA                                                  00336000
.L0002   ANOP                                                           00337000
         AIF   ('&LPMEAX' EQ 'NO').L0005                                00338000
         AIF   ('&DSECT' EQ 'YES').L0006                                00339000
         AIF   ('&LPMEAX' NE 'YES').L0005                               00340000
LPMEAX   DS    0F        Modinfo entry for ADD                          00341000
         AGO   .L0007                                                   00342000
.L0006   ANOP                                                           00343000
LPMEAX   DSECT           Modinfo entry for ADD                          00344000
.L0007   ANOP                                                           00345000
LPMEAXVERSION DS X       This is an input field. Should be 0, but is   *00346000
                         not checked.                                   00347000
LPMEAXMOREINPUTINFO DS CL15 Information provided by the caller          00348000
         ORG   LPMEAXMOREINPUTINFO                                      00349000
LPMEAXSVCNUM DS X        Input SVC num                                  00350000
LPMEAXESVCRNUM DS X      Input extended SVC routing number              00351000
         DS    CL13      Reserved                                       00352000
LPMEAX_LEN_V0 EQU 16     Version 0 length                               00353000
LPMEAX_LEN EQU *-LPMEAX                                                 00354000
.L0005   ANOP                                                           00355000
         AIF   ('&LPMEA64' EQ 'NO').L0008                               00356000
         AIF   ('&DSECT' EQ 'YES').L0009                                00357000
         AIF   ('&LPMEA64' NE 'YES').L0008                              00358000
LPMEA64  DS    0D        Modinfo entry for ADD                          00359000
         AGO   .L000A                                                   00360000
.L0009   ANOP                                                           00361000
LPMEA64  DSECT           Modinfo entry for ADD                          00362000
.L000A   ANOP                                                           00363000
LPMEA64VERSION DS X      This is an input field. Should be 0, but is   *00364000
                         not checked.                                   00365000
         DS    CL7       Reserved                                       00366000
LPMEA64ENTRYPOINTADDR DS AD Output: The entry point. (Input for        *00367000
                         BYADDR=YES. When MODINFO64 is provided,       *00368000
                         MODINFO field LpmeaEntryPointAddr is not      *00369000
                         used.) If this is a DELETE event either for   *00370000
                         exit CSVDYLPA, then this field represents the *00371000
                         entry point address of the now-current LPA    *00372000
                         copy of the module, or has a value of         *00373000
                         X'00000000_7FFFFFFF' when there is no         *00374000
                         remaining LPA copy of the module (in which    *00375000
                         case the LoadPointAddr and Length fields are   00376000
*                        not valid).                                    00377000
         ORG   LPMEA64ENTRYPOINTADDR                                    00378000
LPMEA64ENTRYPOINTADDR_0TO3 DS CL4                                       00379000
LPMEA64ENTRYPOINTADDR_4TO7 DS CL4                                       00380000
         ORG   LPMEA64ENTRYPOINTADDR_4TO7                               00381000
LPMEA64ENTRYPOINTADDR_4TO6 DS BL3                                       00382000
*  Bit definitions:                                                     00383000
LPMEA64ENTRYPOINTADDRBIT32 EQU X'80' On if AMODE=31 or if the caller   *00384000
                         is AMODE 31 and the entry is AMODE=ANY         00385000
LPMEA64ENTRYPOINTADDRBYTE7 DS B                                         00386000
*  Bit definitions:                                                     00387000
LPMEA64ENTRYPOINTADDRBIT63 EQU X'01' On if AMODE=64                     00388000
         ORG   LPMEA64ENTRYPOINTADDR+8                                  00389000
LPMEA64LOADPOINTADDR DS AD Output: The load point. (Input for          *00390000
                         BYADDR=YES. When MODINFO64 is provided,       *00391000
                         MODINFO field LpmeaLoadPointAddr is not       *00392000
                         used.)                                         00393000
         ORG   LPMEA64LOADPOINTADDR                                     00394000
LPMEA64LOADPOINTADDR_0TO3 DS CL4                                        00395000
LPMEA64LOADPOINTADDR_4TO7 DS CL4                                        00396000
LPMEA64LOADPOINTADDR2 DS AD Output: The load point of the secondary    *00397000
                         area. A PDSE module may be split into two     *00398000
                         parts of differeing RMODEs. When the module   *00399000
                         is not split, this will be 0. (Input for      *00400000
                         BYADDR=YES. When MODINFO64 is provided,       *00401000
                         MODINFO field LpmeaLoadPointAddr2 is not      *00402000
                         used.) For BYADDR=YES, this field is ignored  *00403000
                         if LpmeaModLen2 is 0.                          00404000
         ORG   LPMEA64LOADPOINTADDR2                                    00405000
LPMEA64LOADPOINTADDR2_0TO3 DS CL4                                       00406000
LPMEA64LOADPOINTADDR2_4TO7 DS CL4                                       00407000
         DS    CL16      Reserved                                       00408000
LPMEA64_LEN EQU *-LPMEA64                                               00409000
.L0008   ANOP                                                           00410000
         AIF   ('&LPMEAQ' EQ 'NO').L000B                                00411000
         AIF   ('&DSECT' EQ 'YES').L000C                                00412000
         AIF   ('&LPMEAQ' NE 'YES').L000B                               00413000
LPMEAQ   DS    0D        Modinfo entry for ADD with QUERYONLY=YES       00414000
         AGO   .L000D                                                   00415000
.L000C   ANOP                                                           00416000
LPMEAQ   DSECT           Modinfo entry for ADD with QUERYONLY=YES       00417000
.L000D   ANOP                                                           00418000
LPMEAQVERSION DS X       Initial version: 0 This is an output field.    00419000
         DS    CL3       Reserved                                       00420000
LPMEAQCSAREQ DS F        Amount of CSA needed                           00421000
LPMEAQECSAREQ DS F       Amount of ECSA needed                          00422000
LPMEAQSQAREQ DS F        Amount of SQA needed                           00423000
LPMEAQESQAREQ DS F       Amount of ESQA needed                          00424000
LPMEAQHVCOMMONREQ DS CL8 Amount of high virtual common (byte-based).   *00425000
                         The value range is 0 - 2**64-1. Each          *00426000
                         individual request less than 128K is rounded  *00427000
                         up to a power of 2. Each individual request   *00428000
                         greater than 128K is rounded up to a 1M       *00429000
                         multiple.                                      00430000
         DS    CL8       Reserved                                       00431000
LPMEAQ_LEN_V0 EQU 36     Version 0 length                               00432000
LPMEAQ_LEN EQU *-LPMEAQ                                                 00433000
.L000B   ANOP                                                           00434000
         AIF   ('&LPMED' EQ 'NO').L000E                                 00435000
         AIF   ('&DSECT' EQ 'YES').L000F                                00436000
         AIF   ('&LPMED' NE 'YES').L000E                                00437000
LPMED    DS    0F        Modinfo entry for DELETE                       00438000
         AGO   .L0010                                                   00439000
.L000F   ANOP                                                           00440000
LPMED    DSECT           Modinfo entry for DELETE                       00441000
.L0010   ANOP                                                           00442000
LPMEDINPUTINFO DS CL18   Information provided by caller                 00443000
         ORG   LPMEDINPUTINFO                                           00444000
LPMEDNAME DS   CL8       The module name                                00445000
LPMEDDELETETOKEN DS CL8  Token returned when this module was added.    *00446000
                         Identifies the copy to delete.                 00447000
LPMEDINPUTFLAGS DS BL2   Flags set by the caller                        00448000
         ORG   LPMEDINPUTFLAGS                                          00449000
LPMEDINPUTFLAGS0 DS B    Byte 0 of Flags                                00450000
LPMEDINPUTFLAGS1 DS B    Byte 0 of Flags                                00451000
LPMEDOUTPUTINFO DS CL2   Information provided by the system.            00452000
         ORG   LPMEDOUTPUTINFO                                          00453000
LPMEDOUTPUTFLAGS DS BL2  Output: Flags                                  00454000
         ORG   LPMEDOUTPUTFLAGS                                         00455000
LPMEDOUTPUTFLAGS0 DS B   Byte 0 of Flags                                00456000
*  Bit definitions:                                                     00457000
LPMEDSUCCESS EQU X'80'   Successfully processed                         00458000
LPMEDMODPROB EQU X'40'   Problem occurred processing this entry.       *00459000
                         Function with problem is indicated by         *00460000
                         LpmedModprobFunction.                          00461000
LPMEDMODPROBFUNCTION DS X Function with problem. See equates beginning *00462000
                         with LpmedModprob. Valid when LpmedModprob is *00463000
                         on                                             00464000
LPMED_LEN_V0 EQU 20      Version 0 length                               00465000
LPMEDMODPROBNOTFOUND EQU 1 The module was not part of dynamic LPA.      00466000
LPMEDMODPROBNOTAUTH EQU 2 Not authorized to delete this module from    *00467000
                         LPA                                            00468000
LPMEDMODPROBUNEXPECTEDABEND EQU 3 An unexpected abend resulted while   *00469000
                         processing.                                    00470000
*                                                                       00471000
*    *****************************************************************  00472000
*    *                                                               *  00473000
*    * Format constants returned for CSVDYLPA REQUEST(QUERYDYN)      *  00474000
*    *                                                               *  00475000
*    *****************************************************************  00476000
*                                                                       00477000
*                                                                       00478000
CSVDYLPADYNNOTAVAILABLE EQU 0                                           00479000
CSVDYLPADYNAVAILABLE EQU 1                                              00480000
*                                                                       00481000
*    *****************************************************************  00482000
*    *                                                               *  00483000
*    * Deferred LPA State constants returned for CSVDYLPA            *  00484000
*    * REQUEST(QUERYDEFLPA)                                          *  00485000
*    *                                                               *  00486000
*    *****************************************************************  00487000
*                                                                       00488000
*                                                                       00489000
CSVDYLPADEFLPASTATE_INCOMPLETE EQU 0                                    00490000
CSVDYLPADEFLPASTATE_COMPLETE EQU 1                                      00491000
*                                                                       00492000
*    *****************************************************************  00493000
*    *                                                               *  00494000
*    * Function constants for exit CSVDYLPA                          *  00495000
*    *                                                               *  00496000
*    *****************************************************************  00497000
*                                                                       00498000
*                                                                       00499000
CSVDYLPAFUNCTIONADD EQU 0                                               00500000
CSVDYLPAFUNCTIONDELETE EQU 1                                            00501000
*                                                                       00502000
*    *****************************************************************  00503000
*    *                                                               *  00504000
*    * Return Code Information It is guaranteed that no reason code  *  00505000
*    * will be reused (i.e., the same reason code will not be used   *  00506000
*    * for more than one return code). Also note carefully that bits *  00507000
*    * 0-15 of the reason code may contain component-diagnostic data *  00508000
*    * and must not be assumed to be 0.                              *  00509000
*    *                                                               *  00510000
*    *****************************************************************  00511000
*                                                                       00512000
*                                                                       00513000
CSVDYLPARSNCODEMASK EQU X'0000FFFF' Use this mask to isolate the non   *00514000
                         component-diagnostic portion of the reason    *00515000
                         code.                                          00516000
*                                                                       00517000
*   CSVDYLPA Return and Reason Code definitions                         00518000
*                                                                       00519000
*                                                                       00520000
CSVDYLPARC_OK EQU X'00000000' Meaning: CSVDYLPA request successful.    *00521000
                         Action: None required.                         00522000
CSVDYLPARC_WARN EQU X'00000004' Meaning: Warning Action: Refer to the  *00523000
                         action provided with the specific reason      *00524000
                         code.                                          00525000
CSVDYLPARSNNOTALLSUCCESSFUL EQU X'00000401' Meaning: For ADD and       *00526000
                         DELETE request, at least one input module     *00527000
                         could not be processed successfully.          *00528000
                         Information about the problem is contained    *00529000
                         within the MODINFO entry for that module, in  *00530000
                         field LpmeaOutputFlags (for ADD) or field     *00531000
                         LpmedOutputFlags (for DELETE). The system     *00532000
                         continued to process entries after the one    *00533000
                         for which the problem occurred. Action: Fix   *00534000
                         the problem before requesting the function     00535000
*                        again.                                         00536000
CSVDYLPARC_INVPARM EQU X'00000008' Meaning: CSVDYLPA request specifies *00537000
                         parmeters that are not valid. For ADD and     *00538000
                         DELETE, when the problem occurred while       *00539000
                         processing a particular MODINFO entry, the    *00540000
                         system will not process any additional        *00541000
                         MODINFO entries. Action: Refer to the action  *00542000
                         provided with the specific reason code.        00543000
CSVDYLPARSNBADPARMLIST EQU X'00000801' Meaning: Unable to access       *00544000
                         parameter list. Action: Check for possible    *00545000
                         storage overlay.                               00546000
CSVDYLPARSNSRBMODE EQU X'00000802' Meaning: SRB mode. Action: Avoid    *00547000
                         requesting this function in SRB mode.          00548000
CSVDYLPARSNNOTENABLED EQU X'00000803' Meaning: Not Enabled. Action:    *00549000
                         Avoid requesting this function while not      *00550000
                         enabled.                                       00551000
CSVDYLPARSNHOMENOTPRIMARY EQU X'00000805' Meaning: Home address space  *00552000
                         different from primary address space. Action: *00553000
                         Avoid requesting this function in this        *00554000
                         environment.                                   00555000
CSVDYLPARSNBADREQUESTTYPE EQU X'00000809' Meaning: Request type is not *00556000
                         valid. Action: Check for possible storage     *00557000
                         overlay of the parameter list.                 00558000
CSVDYLPARSNBADESTAEX EQU X'0000080A' Meaning: Unable to establish      *00559000
                         ESTAEX. "xxxx" contains the ESTAEX return     *00560000
                         code. There could be an FRR established.      *00561000
                         Action: Refer to documentation for ESTAEX     *00562000
                         return code "xxxx".                            00563000
CSVDYLPARSNRESERVEDNOT0 EQU X'0000080B' Meaning: Reserved field not 0. *00564000
                         Action: Check for possible storage overlay of *00565000
                         the parameter list.                            00566000
CSVDYLPARSNBADPARMLISTALET EQU X'0000080D' Meaning: Unable to use ALET *00567000
                         of parameter list. Action: Make sure that the *00568000
                         ALET of the parameter list is valid. The      *00569000
                         access register might not have been set up    *00570000
                         correctly.                                     00571000
CSVDYLPARSNBADVERSION EQU X'0000080E' Meaning: Bad version number.     *00572000
                         Action: Check for possible storage overlay of *00573000
                         the parameter list or for use on a downlevel  *00574000
                         system that does not support this version.     00575000
CSVDYLPARSNLOCKED EQU X'0000080F' Meaning: Locked Action: Avoid        *00576000
                         requesting this function in this environment.  00577000
CSVDYLPARSNBADDSNAMEAREA EQU X'00000815' Meaning: Unable to access     *00578000
                         data set name. Action: Make sure that the     *00579000
                         DSNAME area is valid.                          00580000
CSVDYLPARSNBADMODINFOAREA EQU X'00000816' Meaning: Unable to access    *00581000
                         MODINFO area. Action: Make sure that the      *00582000
                         MODINFO area is valid.                         00583000
CSVDYLPARSNBADMODINFOALET EQU X'00000817' Meaning: Unable to use ALET  *00584000
                         of MODINFO area. Action: Make sure that the   *00585000
                         ALET of the MODINFO area is valid. The access *00586000
                         register might not have been set up           *00587000
                         correctly.                                     00588000
CSVDYLPARSNBADOPEN EQU X'00000818' Meaning: Unable to open specified   *00589000
                         data set. Action: Make sure that you          *00590000
                         specified the proper data set, that it is a   *00591000
                         PDS or PDSE program library, and that it can  *00592000
                         be located by the system.                      00593000
CSVDYLPARSNBADNUMMOD EQU X'0000081D' Meaning: The value provided by    *00594000
                         the NUMMOD parameter is 0 or exceeds 256.     *00595000
                         Action: Specify a non-zero NUMMOD parameter   *00596000
                         value. Instead of providing more than 256     *00597000
                         entries in a single call, use multiple calls  *00598000
                         each of which provides no more than 256       *00599000
                         entries.                                       00600000
CSVDYLPARSNBADDSNAMEALET EQU X'00000820' Meaning: Bad dsname ALET.     *00601000
                         Action: Make sure that the ALET of the DSNAME *00602000
                         area is valid. The access register might not  *00603000
                         have been set up correctly.                    00604000
CSVDYLPARSNBADMODULENAME EQU X'00000822' Meaning: Bad modulename -     *00605000
                         first character is 0 or blank. Action:        *00606000
                         Provide a valid module name.                   00607000
CSVDYLPARSNBADDSNAME EQU X'00000823' Meaning: Bad DSNAME - first       *00608000
                         character is 0 or blank. Action: Provide a    *00609000
                         valid data set name.                           00610000
CSVDYLPARSNBADALLOC EQU X'00000829' Meaning: Unable to allocate data   *00611000
                         set. Action: Make sure that you specified the *00612000
                         proper data set, that it is a PDS or PDSE     *00613000
                         program library, and that it can be located   *00614000
                         by the system.                                 00615000
CSVDYLPARSNFUNCTIONNOTAVAILABLE EQU X'0000082B'                         00616000
*                                                                       00617000
*                                      Meaning: Required DFSMS          00618000
*                                      function or dynamic allocation   00619000
*                                      is not available or request      00620000
*                                      issued prior to the LNKLST       00621000
*                                      being available. Action: Make    00622000
*                                      sure that the required DFSMS     00623000
*                                      support is installed. Avoid      00624000
*                                      requesting the function in an    00625000
*                                      environment where dynamic        00626000
*                                      allocation is not available.     00627000
*                                      Avoid requesting the function    00628000
*                                      until the LNKLST is available.   00629000
*                                      Avoid requesting dynamic LPA     00630000
*                                      services via the PROG=xx         00631000
*                                      parameter of the IEASYSxx        00632000
*                                      parmlib member.                  00633000
*                                                                       00634000
CSVDYLPARSNNOTAUTHDCB EQU X'0000082C' Meaning: Not authorized to use   *00635000
                         DCB option. Must be supervisor state, PKM     *00636000
                         allowing key 0-7, PSW key 0-7, or APF         *00637000
                         authorized. Action: Avoid using the DCB       *00638000
                         option without the required authorization.     00639000
CSVDYLPARSNNOTAUTHCONCAT EQU X'0000082D' Meaning: If not supervisor    *00640000
                         state, PKM allowing key 0-7, PSW key 0-7, or  *00641000
                         APF authorized, or if APFREQUIRED=YES is      *00642000
                         specified or defaulted, the concatenation     *00643000
                         represented by the input DDNAME or DCB, when  *00644000
                         it is not the LNKLST, must be APF authorized. *00645000
                         Action: Avoid using a non-APF authorized      *00646000
                         concatenation without the required            *00647000
                         authorization.                                 00648000
CSVDYLPARSNNOTAUTHMEMBERMASK EQU X'0000082E' Meaning: Not authorized   *00649000
                         to use MemberMask option. Must be supervisor  *00650000
                         state, PKM allowing key 0-7, PSW key 0-7, or  *00651000
                         APF authorized. Action: Avoid using the       *00652000
                         MODINFOTYPE=MEMBERMASK function without the   *00653000
                         required authorization.                        00654000
CSVDYLPARSNBADMODINFOXAREA EQU X'00000830' Meaning: Unable to access   *00655000
                         MODINFOX area. Action: Make sure that the     *00656000
                         MODINFOX area is valid.                        00657000
CSVDYLPARSNBADMODINFOXALET EQU X'00000831' Meaning: Unable to use ALET *00658000
                         of MODINFOX area. Action: Make sure that the  *00659000
                         ALET of the MODINFOX area is valid. The       *00660000
                         access register might not have been set up    *00661000
                         correctly.                                     00662000
CSVDYLPARSNESVC EQU X'00000832' Meaning: A non-extended SVC was        *00663000
                         selected, but the specified SVC number is an  *00664000
                         extended SVC. Action: Fix the SVC number.      00665000
CSVDYLPARSNNOTESVC EQU X'00000833' Meaning: An extended SVC was        *00666000
                         selected, but the specified SVC number is not *00667000
                         an extended SVC. Action: Fix the SVC number.   00668000
CSVDYLPARSNBADESVCRNUM EQU X'00000834' Meaning: The routing number for *00669000
                         the selected extended SVC exceeded the number *00670000
                         of entries for that extended SVC that were    *00671000
                         defined at IPL. Action: Fix the extended SVC  *00672000
                         routine number.                                00673000
CSVDYLPARSNNOTPARTITIONED EQU X'0000083C' Meaning: For ADD request,    *00674000
                         the data set is not partitioned. Action: Make *00675000
                         sure that you specified the proper data set   *00676000
                         and that it is a PDS or PDSE program library.  00677000
CSVDYLPARSNBADBYADDRINFO EQU X'0000083D' Meaning: For ADD request with *00678000
                         BYADDR=YES, the module information is         *00679000
                         incorrect. Action: Make sure that the entry   *00680000
                         point and load point addresses represent      *00681000
                         common area storage. Make sure that the entry *00682000
                         point lies within the primary load segment.    00683000
CSVDYLPARSNNOTAUTHBYADDR EQU X'0000083E' Meaning: Not authorized to    *00684000
                         use BYADDR=YES option. Must be supervisor     *00685000
                         state, PKM allowing key 0-7, PSW key 0-7, or  *00686000
                         APF authorized. Action: Avoid using           *00687000
                         BYADDR=YES without the required               *00688000
                         authorization.                                 00689000
CSVDYLPARSNBADDCBAREA EQU X'0000083F' Meaning: Unable to access the    *00690000
                         opened DCB. Action: Make sure that the DCB    *00691000
                         has been opened.                               00692000
CSVDYLPARSNENQHELDSHARED EQU X'00000840' Meaning: The ENQ resource     *00693000
                         with QNAME SYSZCSV and RNAME CSVDYLPA was     *00694000
                         held in the shared state on entry to dynamic  *00695000
                         LPA services. Action: Avoid holding the ENQ   *00696000
                         shared when using dynamic LPA services.        00697000
CSVDYLPARSNBADLPMEAQAREA EQU X'00000841' Meaning: Unable to access     *00698000
                         LPMEAQ area. Action: Make sure that the       *00699000
                         LPMEAQ area is valid.                          00700000
CSVDYLPARSNBADLPMEAQALET EQU X'00000842' Meaning: Unable to use ALET   *00701000
                         of LPMEAQ area. Action: Make sure that the    *00702000
                         ALET of the LPMEAQ area is valid. The access  *00703000
                         register might not have been set up           *00704000
                         correctly.                                     00705000
CSVDYLPARSNNOTAUTHADDALIAS EQU X'00000843' Meaning: Not authorized to  *00706000
                         use the ADDALIAS=YES function. Must be        *00707000
                         supervisor state, PKM allowing key 0-7, PSW   *00708000
                         key 0-7, or APF authorized. Action: Avoid     *00709000
                         using the ADDALIAS=YES function without the   *00710000
                         required authorization.                        00711000
CSVDYLPARSNBADPATHNAMELEN EQU X'00000844' Meaning: The PATHNAMELEN     *00712000
                         parameter value is not in the range 1-1023.   *00713000
                         Action: Provide a valid PATHNAMELEN parameter *00714000
                         value.                                         00715000
CSVDYLPARSNBADPATHNAMEAREA EQU X'00000845' Meaning: Unable to access   *00716000
                         the pathname. Action: Make sure that the      *00717000
                         PATHNAME area is valid.                        00718000
CSVDYLPARSNBADPATHNAMEALET EQU X'00000846' Meaning: Unable to use ALET *00719000
                         of PATHNAME area. Action: Make sure that the  *00720000
                         ALET of the PATHNAME area is valid. The       *00721000
                         access register might not have been set up    *00722000
                         correctly.                                     00723000
CSVDYLPARSNBADPATHNAMENUMMOD EQU X'00000847' Meaning: PATHNAME was     *00724000
                         specified and the value provided by the       *00725000
                         NUMMOD parameter is not 1. Action: Provide    *00726000
                         only 1 entry per call.                         00727000
CSVDYLPARSNNOTAUTHDEFLPAWAIT EQU X'00000848' Meaning: Not authorized   *00728000
                         to use REQUEST=DEFLPAWAIT. Must be supervisor *00729000
                         state, PKM allowing key 0-7, PSW key 0-7, or  *00730000
                         APF authorized. Action: Avoid using           *00731000
                         REQUEST=DEFLPAWAIT without the required       *00732000
                         authorization.                                 00733000
CSVDYLPARSNBADMODINFO64AREA EQU X'00000849' Meaning: Unable to access  *00734000
                         MODINFO64 area. Action: Make sure that the    *00735000
                         MODINFO64 area is valid.                       00736000
CSVDYLPARSNBADMODINFO64ALET EQU X'0000084A' Meaning: Unable to use     *00737000
                         ALET of MODINFO64 area. Action: Make sure     *00738000
                         that the ALET of the MODINFO64 area is valid. *00739000
                         You might not have set up its access register *00740000
                         properly.                                      00741000
CSVDYLPARSNSVCRMODE64 EQU X'0000084B' Meaning: A module identified as  *00742000
                         an SVC (or extended SVC) routine was found to *00743000
                         require above the bar storage. Action: Avoid  *00744000
                         using an RMODE 64 module as an SVC routine.    00745000
CSVDYLPARC_ENV EQU X'0000000C' Meaning: Environmental error Action:    *00746000
                         Refer to the action provided with the         *00747000
                         specific reason code.                          00748000
CSVDYLPARSNNOSTORAGE EQU X'00000C02' Meaning: There is not sufficient  *00749000
                         storage to complete the request. Action:      *00750000
                         Contact your system programmer. There is a    *00751000
                         shortage of common storage.                    00752000
CSVDYLPARSNBADDIRECTORY EQU X'00000C04' Meaning: When using the        *00753000
                         MemberMask option, the data set directory was *00754000
                         in error. Either an I/O error occurred        *00755000
                         accessing the directory, or the format of a   *00756000
                         directory entry was incorrect. Action: Fix    *00757000
                         the data set directory. Make sure that the    *00758000
                         data set is a PDS or PDSE program library.     00759000
CSVDYLPARSNSTORAGELIMEXCEEDED EQU X'00000C05' Meaning: For ADD         *00760000
                         request, the amount of module storage needed  *00761000
                         for the request would have caused the amount  *00762000
                         of CSA or ECSA remaining to fall below the    *00763000
                         threshold specified by the system programmer  *00764000
                         using the LPA CSAMIN statement of PROGxx or   *00765000
                         the SETPROG LPA,CSAMIN system command.        *00766000
                         Action: Specify that fewer modules be added,  *00767000
                         or have the system programmer reduce the      *00768000
                         CSAMIN amounts.                                00769000
CSVDYLPARC_COMPERROR EQU X'00000010' Meaning: Unexpected failure.      *00770000
                         Action: Refer to the action provided with the *00771000
                         specific reason code.                          00772000
CSVDYLPARSNCOMPERROR EQU X'00001001' Meaning: Unexpected failure. The  *00773000
                         state of the request is unpredictable.        *00774000
                         Action: Contact your system programmer.        00775000
LPMED_LEN EQU  *-LPMED                                                  00776000
.L000E   ANOP                                                           00777000
         AIF   ('&ZCBPRINT' EQ 'NO').P3                                 00778000
         AIF   ('&LIST' EQ 'YES').P4                                    00779000
.P3      ANOP                                                           00780000
         POP   PRINT                                                    00781000
.P4      ANOP                                                           00782000
.P_EXIT  ANOP                                                           00783000
         MEND                                                           00784000
**/ CSVLPRET_2:;                                                        00785000
* %CSVLPRET_INCLUDED = 'YES';                                           00786000
* %DCL ZCBPRINT CHAR EXT;                                               00787000
* %DEACTIVATE ZCBPRINT;                                                 00788000
* %DCL CSVLPRET_LIST CHAR EXT;                                          00789000
* %DEACTIVATE CSVLPRET_LIST;                                            00790000
* %IF CSVLPRET_LIST ^= 'NO' &                                           00791000
*    ZCBPRINT ^= 'NO' %THEN                                             00792000
*   %GOTO CSVLPRET_3;                                                   00793000
*   @LIST PUSH NOECHO;                                                  00794000
*   @LIST NOASSEMBLE NOECHO;                                            00795000
*   @LIST OFF C NOECHO;                                                 00796000
* %CSVLPRET_3:;                                                         00797000
*/* Start of PL/X Source                                             */ 00798000
*DCL 1 LPMEA Type,                 /* Modinfo entry for ADD             00799000
*                                                                @L1A*/ 00800000
*     2 LpmeaInputInfo,       /* Information provided by caller of      00801000
*                    dynamic LPA services. Provided to exit CSVDYLPA.   00802000
*                    Mapping of module entries within                   00803000
*                    Type 90 Subtype 31 SMF records.             @L1A*/ 00804000
*       3 LpmeaNAME CHAR(8), /* The module name                  @L1A*/ 00805000
*       3 LpmeaInputFLAGS BIT(16), /* Flags set by the caller           00806000
*                    Not applicable to exit CSVDYLPA or SMF record.     00807000
*                                                                @L1A*/ 00808000
*         4 LpmeaInputFLAGS0 BIT(8), /* Byte 0 of Flags.                00809000
*                    Not applicable when BYADDR=YES.                    00810000
*                                                                @L1A*/ 00811000
*           5 LpmeaFixed Bit(1), /* If on, page-fix                     00812000
*                                   this module                  @L1A*/ 00813000
*           5 LpmeaPageProtPage Bit(1), /* If on, page-protect only the 00814000
*                    whole pages of this module. If off, page-protect   00815000
*                    all bytes of this module. Be aware that when       00816000
*                    page-protecting all bytes of the module, storage   00817000
*                    utilization for the module may increase, as the    00818000
*                    system allocates a number of whole pages for the   00819000
*                    module, rather than just the amount of storage     00820000
*                    that is truly necessary to load the module. @L1A*/ 00821000
*           5 LpmeaStorageOwnerSystem Bit(1), /* If on, the storage     00822000
*                    in which the module is placed is to be             00823000
*                    OWNER=SYSTEM. If off, it is OWNER=HOME.            00824000
*                                                                @L1A*/ 00825000
*         4 LpmeaInputFLAGS1 BIT(8), /* Byte 1 of Flags.                00826000
*                    Not applicable when BYADDR=YES.                    00827000
*                                                                @L1A*/ 00828000
*           5 LpmeaSvc Bit(1),     /* This entry is an SVC.             00829000
*                    The SVC number is in LpmeaxSvcnum.          @L6A*/ 00830000
*           5 LpmeaESvc Bit(1),    /* This entry is an extended SVC.    00831000
*                    The SVC number is in LpmeaxSvcnum.                 00832000
*                    The extended svc routing code is in                00833000
*                    LpmeaxESvcrnum.                             @L6A*/ 00834000
*     2 LpmeaOutputInfo Bdy(Word,3), /* Information provided by the     00835000
*                                system (except where noted for         00836000
*                                BYADDR=YES). Provided to exit          00837000
*                                CSVDYLPA which should not modify       00838000
*                                this information                @L1A*/ 00839000
*       3 LpmeaOutputFLAGS BIT(16), /* Output: Flags             @L1A*/ 00840000
*         4 LpmeaOutputFLAGS0 BIT(8), /* Byte 0 of Flags.               00841000
*                  Only bits LpmeaSuccess and LpmeaRmode64              00842000
*                  are applicable to exit                               00843000
*                  CSVDYLPA or SMF record - the module entry is         00844000
*                  only valid when bit LpmeaSuccess is on.       @L1A*/ 00845000
*           5 LpmeaSuccess BIT(1), /* Successfully processed     @L1A*/ 00846000
*           5 LpmeaModprob BIT(1), /* A problem occurred processing     00847000
*                  this entry. Function with problem is indicated by    00848000
*                  LpmeaModprobFunction.                         @L1A*/ 00849000
*           5 LpmeaModprobAbendInfo BIT(1),    /* An unexpected abend   00850000
*                 occurred while processing this entry. Further         00851000
*                 information is in the LpmeaAbendRsnCodes area. @L1A*/ 00852000
*           5 LpmeaModprobReturnCodeInfo BIT(1), /* An unexpected       00853000
*                  return code was received while processing this       00854000
*                  entry. Further information is in the                 00855000
*                  LpmeaRetRsnCodes area.                        @L1A*/ 00856000
*           5 * BIT(3),                                       /* @L7A*/ 00857000
*           5 LpmeaRmode64 BIT(1), /* When LpmeaSuccess is on,          00858000
*                  the entry point address and/or a load point          00859000
*                  address is Rmode 64 (above 2G). This will            00860000
*                  correlate to a value of 7FFFFBAD in                  00861000
*                  LpmeaEntryPointAddr and/or LpmeaLoadPointAddr        00862000
*                  and/or LpmeaLoadPointAddr2, indicating that          00863000
*                  the full address is available only within the        00864000
*                  Lpmea64 data (which is not present for SMF           00865000
*                  records).                                     @L7A*/ 00866000
*         4 LpmeaModprobFunction FIXED(8),      /* Function with        00867000
*                                   problem. See equates below that     00868000
*                                   have names beginning                00869000
*                                   with LpmeaModprob. Valid when       00870000
*                                   LpmeaModprob is on.          @L1A*/ 00871000
*           5 LpmeaSuccessConcatNum FIXED(8),    /* The concatenation   00872000
*                     number (0 to n) representing the data set in      00873000
*                     which the module was located. This will be 0      00874000
*                     when the input was by data set (as opposed to     00875000
*                     by DDNAME or DCB address). It is only valid       00876000
*                     when LpmeaSuccess is on, or for exit              00877000
*                     CSVDYLPA or SMF record. It is not valid for       00878000
*                     ByADDR=YES or when PATHNAME is used.       @L5C*/ 00879000
*       3 LpmeaStuff UNION,        /*                            @L1A*/ 00880000
*        4 LpmeaSuccessInfo,       /* Valid only when LpmeaSuccess is   00881000
*                    on.                                         @L1A*/ 00882000
*         5 LpmeaDeleteToken CHAR(8), /* Output: Token to be used on    00883000
*                                      DELETE for this module.   @L1A*/ 00884000
*         5 LpmeaEntryPointAddr PTR, /* Output: The entry point.        00885000
*                    (Input for BYADDR=YES. When MODINFO64 is used,     00886000
*                    field Lpmea64EntryPointAddr is used, and           00887000
*                    field LpmeaEntryPointAddr is not used.)            00888000
*                    If this is a DELETE event either for exit          00889000
*                    CSVDYLPA or for an SMF record, then this field     00890000
*                    represents the entry point address of the          00891000
*                    now-current LPA copy of the module, or has         00892000
*                    a value of X'7FFFFFFF' when there is no remaining  00893000
*                    LPA copy of the module (in which case the          00894000
*                    LoadPointAddr and Length fields are not            00895000
*                    valid).                                            00896000
*                    A value of x'7FFFFBAD' in output for an ADD        00897000
*                    event indicates that the address was above 2G.     00898000
*                    The LPMEA64 structure, if provided, contains       00899000
*                    the full information.                              00900000
*                                                                @L1A*/ 00901000
*           7 LpmeaEntryPointAddrBytes0To2 Bit(24),  /*          @L2A*/ 00902000
*              9 LpmeaEntryPointAddrBit0 BIT(1), /* On if AMODE=31      00903000
*                    or if the caller is AMODE 31 and the               00904000
*                    entry is AMODE=ANY                          @L1A*/ 00905000
*           7 LpmeaEntryPointAddrByte3 Bit(8),       /*          @L2A*/ 00906000
*              9 * Bit(7),                       /* Not mapped   @L2A*/ 00907000
*              9 LpmeaEntryPointAddrBit31 BIT(1), /* On if AMODE=64     00908000
*                                                                @L2A*/ 00909000
*         5 LpmeaLoadPointAddr PTR, /* Output: The load point.          00910000
*                     (Input for BYADDR=YES. When MODINFO64 is used,    00911000
*                     field Lpmea64LoadPointAddr is used, and           00912000
*                     field LpmeaLoadPointAddr is not used.)            00913000
*                     A value of x'7FFFFBAD' in output for an ADD       00914000
*                     event indicates that the address was above 2G.    00915000
*                     The LPMEA64 structure, if provided, contains      00916000
*                     the full information.                      @L1A*/ 00917000
*         5 LpmeaModLen FIXED,   /* Output: The length.                 00918000
*                                       (Input for BYADDR=YES.)         00919000
*                                                                @L1A*/ 00920000
*         5 LpmeaLoadPointAddr2 PTR, /* Output: The load point of the   00921000
*                     secondary area. A PDSE module may be split into   00922000
*                     two parts of differing RMODEs. When               00923000
*                     the module is not split, this will be 0.          00924000
*                     (Input for BYADDR=YES. When MODINFO64 is used,    00925000
*                     field Lpmea64LoadPointAddr2 is used, and          00926000
*                     field LpmeaLoadPointAddr2 is not used.)           00927000
*                     A value of x'7FFFFBAD' in output for an ADD       00928000
*                     event indicates that the address was above 2G.    00929000
*                     The LPMEA64 structure, if provided, contains      00930000
*                     the full information.                             00931000
*                     For BYADDR=YES, this field is ignored if          00932000
*                     LpmeaModLen2 is 0.                                00933000
*                                                                @L1A*/ 00934000
*         5 LpmeaModLen2 FIXED,   /* Output: The length of the          00935000
*                     secondary area. When the module is not split,     00936000
*                     this will be 0.                                   00937000
*                     (Input for BYADDR=YES.)                           00938000
*                                                                @L1A*/ 00939000
*        4 LpmeaRetRsnCodes,       /* Valid when                        00940000
*                     LpmeaModprobReturnCodeInfo                 @L1A*/ 00941000
*         5 LpmeaRetcode FIXED,      /* Output: Return code             00942000
*                     from function designated in LpmeaModprobFunction  00943000
*                                                                @L1A*/ 00944000
*         5 LpmeaRsncode FIXED,     /* Output: Reason code              00945000
*                     from function designated in LpmeaModprobFunction  00946000
*                                                                @L1A*/ 00947000
*        4 LpmeaAbendRsnCodes,     /* Valid when                        00948000
*                     LpmeaModprobAbendInfo                      @L1A*/ 00949000
*         5 LpmeaAbendCode FIXED,    /* Output: Abend code              00950000
*                     from function designated in LpmeaModprobFunction  00951000
*                                                                @L1A*/ 00952000
*         5 LpmeaAbendRsnCode FIXED,  /* Output: Abend reason           00953000
*                code from function designated in LpmeaModprobFunction  00954000
*                                                                @L1A*/ 00955000
*     2 * CHAR(0) Bdy(Word);  /* Word-align the ending           @L1A*/ 00956000
*Dcl Lpmea_Len_V0 Constant(Length(Lpmea));     /* Version 0 length      00957000
*                                                                @L1A*/ 00958000
*Dcl LpmeaModprobNotFound Constant(1);         /* The module could not  00959000
*                  be located via the data set, ddname, or DCB@         00960000
*                  that was provided                             @L1A*/ 00961000
*Dcl LpmeaModprobNotAuth Constant(2);          /* Not authorized to     00962000
*                  add this module to LPA                        @L1A*/ 00963000
*Dcl LpmeaModprobDirectory Constant(3);        /* Directory processing  00964000
*                  produced an unexpected return code            @L1A*/ 00965000
*Dcl LpmeaModprobFetch Constant(4);            /* FETCH produced an     00966000
*                  unexpected return code                        @L1A*/ 00967000
*Dcl LpmeaModprobPageProt Constant(6);         /* PGSER PROTECT         00968000
*                  produced an unexpected abend                  @L1A*/ 00969000
*Dcl LpmeaModprobTooManyExtents Constant(7); /* Only load modules       00970000
*                  with 1 or 2 extents defined can be processed.        00971000
*                                                                @L1A*/ 00972000
*Dcl LpmeaModprobNotExecutable Constant(8);    /* The module            00973000
*                  is not executable                             @L1A*/ 00974000
*Dcl LpmeaModprobDeservDESL Constant(10);      /* Directory processing  00975000
*                  produced an unexpected return code            @L1A*/ 00976000
*Dcl LpmeaModprobDuplicate Constant(11);      /* The member is a        00977000
*                  duplicate of another member.                  @L1A*/ 00978000
*Dcl LpmeaModprobAmode64NotZARCH Constant(12);/* Attempt to create      00979000
*                  an LPA module byaddr that is AMODE 64 but the        00980000
*                  system is not running in z/Architecture mode  @P1A*/ 00981000
*Dcl LpmeaModprobBpx4lod Constant(13);         /* Bpx4lod produced an   00982000
*                  unexpected return code                        @L5A*/ 00983000
*Dcl LpmeaModprobNotApfProg Constant(14);      /* The module to be      00984000
*                  loaded via pathname was not marked as an APF         00985000
*                  program via the UNIX extattr command with the        00986000
*                  +a attribute.                                 @P3A*/ 00987000
*Dcl LpmeaModprobNotApfDS Constant(15);        /* The module to be      00988000
*                  loaded was to be located by the LNKLST DCB while     00989000
*                  requesting APFREQUIRED=YES. LNKAUTH=APFTAB was in    00990000
*                  effect. The data set containing the module was not   00991000
*                  APF-authorized.                               @01A*/ 00992000
*Dcl LpmeaModprobUnexpectedAbend Constant(20); /* An unexpected abend   00993000
*                  resulted while processing. Fields LpmeaAbendcode and 00994000
*                  LpmeaAbendrsncode contain the abend code and         00995000
*                  abend reason code.                                   00996000
*                                                                @L1A*/ 00997000
*                                                                       00998000
*DCL 1 LPMEAX Type Bdy(Word),      /* Modinfo entry for ADD      @L6A*/ 00999000
*     2 LpmeaxVersion Fixed(8),    /* This is an input field. Should be 01000000
*                                     0, but is not checked.     @L6A*/ 01001000
*     2 LpmeaxMoreInputInfo,       /* Information provided by the       01002000
*                                     caller                     @L6A*/ 01003000
*       3 LpmeaxSvcnum Fixed(8),   /* Input SVC num              @L6a*/ 01004000
*       3 LpmeaxESvcrNum Fixed(8),  /* Input extended SVC routing       01005000
*                                      number                    @L6A*/ 01006000
*       3 * Char(13),              /* Reserved                   @L6a*/ 01007000
*     2 * CHAR(0) Bdy(Word);  /* Word-align the ending           @L6A*/ 01008000
*Dcl Lpmeax_Len_V0 Constant(Length(Lpmeax));   /* Version 0 length      01009000
*                                                                @L1A*/ 01010000
*DCL 1 LPMEA64 Type Bdy(DWord),    /* Modinfo entry for ADD      @L7C*/ 01011000
*     2 Lpmea64Version Fixed(8),   /* This is an input field. Should be 01012000
*                                     0, but is not checked.     @L6A*/ 01013000
*     2 * Char(7),                 /* Reserved                   @L7C*/ 01014000
*     2 Lpmea64EntryPointAddr PTR(64), /* Output: The entry point.      01015000
*                (Input for BYADDR=YES. When MODINFO64 is provided,     01016000
*                MODINFO field LpmeaEntryPointAddr is not used.)        01017000
*                If this is a DELETE event either for exit              01018000
*                CSVDYLPA, then this field                              01019000
*                represents the entry point address of the              01020000
*                now-current LPA copy of the module, or has             01021000
*                a value of X'00000000_7FFFFFFF'                        01022000
*                when there is no remaining                             01023000
*                LPA copy of the module (in which case the              01024000
*                LoadPointAddr and Length fields are not                01025000
*                valid).                                         @L7A*/ 01026000
*       7 Lpmea64EntryPointAddr_0To3 Char(4), /*                 @L7A*/ 01027000
*       7 Lpmea64EntryPointAddr_4To7 Char(4), /*                 @L7A*/ 01028000
*         9 Lpmea64EntryPointAddr_4To6 Bit(24), /*               @L7A*/ 01029000
*           11 Lpmea64EntryPointAddrBit32 BIT(1), /* On if AMODE=31     01030000
*                or if the caller is AMODE 31 and the                   01031000
*                entry is AMODE=ANY                              @L7A*/ 01032000
*         9 Lpmea64EntryPointAddrByte7 Bit(8),       /*          @L7A*/ 01033000
*           11 * Bit(7),                         /* Not mapped   @L7A*/ 01034000
*           11 Lpmea64EntryPointAddrBit63 BIT(1), /* On if AMODE=64     01035000
*                                                                @L7A*/ 01036000
*     2 Lpmea64LoadPointAddr Ptr(64), /* Output: The load point.        01037000
*                (Input for BYADDR=YES. When MODINFO64 is provided,     01038000
*                MODINFO field LpmeaLoadPointAddr is not used.)         01039000
*                                                                @L7A*/ 01040000
*       7 Lpmea64LoadPointAddr_0To3 Char(4),  /*                 @L7A*/ 01041000
*       7 Lpmea64LoadPointAddr_4To7 Char(4),  /*                 @L7A*/ 01042000
*     2 Lpmea64LoadPointAddr2 Ptr(64), /* Output: The load point of the 01043000
*                secondary area. A PDSE module may be split into        01044000
*                two parts of differeing RMODEs. When                   01045000
*                the module is not split, this will be 0.               01046000
*                (Input for BYADDR=YES. When MODINFO64 is provided,     01047000
*                MODINFO field LpmeaLoadPointAddr2 is not used.)        01048000
*                For BYADDR=YES, this field is ignored if               01049000
*                LpmeaModLen2 is 0.                                     01050000
*                                                                @L7A*/ 01051000
*       7 Lpmea64LoadPointAddr2_0To3 Char(4), /*                 @L7A*/ 01052000
*       7 Lpmea64LoadPointAddr2_4To7 Char(4), /*                 @L7A*/ 01053000
*     2 * Char(16),                /* Reserved                   @L7A*/ 01054000
*     2 * CHAR(0) Bdy(DWord);      /* Align the ending           @L7A*/ 01055000
*DCL 1 LPMEAQ Type Bdy(DWord),     /* Modinfo entry for ADD             01056000
*                                     with QUERYONLY=YES         @L7C*/ 01057000
*     2 LpmeaqVersion Fixed(8),    /* Initial version: 0                01058000
*                                     This is an output field.   @P2A*/ 01059000
*     2 * Char(3),                 /* Reserved                   @P2A*/ 01060000
*     2 LpmeaqCSAReq Fixed(31),    /* Amount of CSA needed       @P2A*/ 01061000
*     2 LpmeaqECSAReq Fixed(31), /* Amount of ECSA needed        @P2A*/ 01062000
*     2 LpmeaqSQAReq Fixed(31),    /* Amount of SQA needed       @P2A*/ 01063000
*     2 LpmeaqESQAReq Fixed(31), /* Amount of ESQA needed        @P2A*/ 01064000
*     2 LpmeaqHVCommonReq Char(8), /* Amount of high virtual            01065000
*                     common (byte-based). The value range is           01066000
*                     0 - 2**64-1. Each individual request less than    01067000
*                     128K is rounded up to a power of 2. Each          01068000
*                     individual request greater than 128K is rounded   01069000
*                     up to a 1M multiple.                       @L7A*/ 01070000
*     2 * Char(8),                 /* Reserved                   @L7C*/ 01071000
*     2 * CHAR(0) Bdy(Word);  /* Word-align the ending           @P2A*/ 01072000
*Dcl Lpmeaq_Len_V0 Constant(Length(LPMEAQ));   /* Version 0 length      01073000
*                                                                @P2A*/ 01074000
*                                                                       01075000
*DCL 1 LPMED Type,                 /* Modinfo entry for DELETE          01076000
*                                                                @L1A*/ 01077000
*     2 LpmedInputInfo,       /* Information provided by caller  @L1A*/ 01078000
*       3 LpmedNAME CHAR(8), /* The module name                  @L1A*/ 01079000
*       3 LpmedDeleteToken CHAR(8),  /* Token returned when this        01080000
*                     module was added. Identifies the copy to delete.  01081000
*                                                                @L1A*/ 01082000
*       3 LpmedInputFLAGS BIT(16), /* Flags set by the caller    @L1A*/ 01083000
*         4 LpmedInputFLAGS0 BIT(8), /* Byte 0 of Flags          @L1A*/ 01084000
*         4 LpmedInputFLAGS1 BIT(8), /* Byte 0 of Flags          @L1A*/ 01085000
*     2 LpmedOutputInfo,      /* Information provided by the            01086000
*                                system.                         @L1A*/ 01087000
*       3 LpmedOutputFLAGS BIT(16), /* Output: Flags             @L1A*/ 01088000
*         4 LpmedOutputFLAGS0 BIT(8), /* Byte 0 of Flags         @L1A*/ 01089000
*           5 LpmedSuccess BIT(1), /* Successfully processed     @L1A*/ 01090000
*           5 LpmedModprob BIT(1), /* Problem occurred processing this  01091000
*                  entry. Function with problem is indicated by         01092000
*                  LpmedModprobFunction.                         @L1A*/ 01093000
*         4 LpmedModprobFunction FIXED(8),      /* Function with        01094000
*                                   problem. See equates beginning      01095000
*                                   with LpmedModprob. Valid when       01096000
*                                   LpmedModprob is on           @L1A*/ 01097000
*     2 * CHAR(0) Bdy(Word);  /* Word-align the ending           @L1A*/ 01098000
*Dcl Lpmed_Len_V0 Constant(Length(Lpmed));     /* Version 0 length      01099000
*                                                                @L1A*/ 01100000
*Dcl LpmedModprobNotFound Constant(1);         /* The module was not    01101000
*                  part of dynamic LPA.                          @L1A*/ 01102000
*Dcl LpmedModprobNotAuth Constant(2);          /* Not authorized to     01103000
*                  delete this module from LPA                   @L1A*/ 01104000
*Dcl LpmedModprobUnexpectedAbend Constant(3); /* An unexpected abend    01105000
*                  resulted while processing.                    @L1A*/ 01106000
*                                                                       01107000
*                                                                       01108000
*    /* Format constants returned for CSVDYLPA REQUEST(QUERYDYN)     */ 01109000
*DCL CsvdylpaDynNotAvailable Fixed(8) Constant(0);            /* @L1A*/ 01110000
*DCL CsvdylpaDynAvailable Fixed(8) Constant(1);               /* @L1A*/ 01111000
*                                                                       01112000
*    /* Deferred LPA State constants returned for                       01113000
*       CSVDYLPA REQUEST(QUERYDEFLPA)                                */ 01114000
*Dcl CsvdylpaDefLPAState_Incomplete Constant(0);              /* @L7A*/ 01115000
*Dcl CsvdylpaDefLPAState_Complete Constant(1);                /* @L7A*/ 01116000
*                                                                       01117000
*    /* Function constants for exit CSVDYLPA                         */ 01118000
*DCL CsvdylpaFunctionAdd Fixed(8) Constant(0);                /* @L1A*/ 01119000
*DCL CsvdylpaFunctionDelete Fixed(8) Constant(1);             /* @L1A*/ 01120000
*                                                                       01121000
*    /* Return Code Information                                      */ 01122000
*                                                                       01123000
*    /* It is guaranteed that                                           01124000
*       no reason code will be reused (i.e., the same reason code       01125000
*       will not be used for more than one return code).            */  01126000
*                                                                       01127000
*    /* Also note carefully that bits 0-15 of the reason code           01128000
*       may contain component-diagnostic data and must not be           01129000
*       assumed to be 0.                                            */  01130000
*                                                                       01131000
*Dcl CsvdylpaRsnCodeMask Bit(32) Constant('0000FFFF'X); /* Use this     01132000
*               mask to isolate the non component-diagnostic            01133000
*               portion of the reason code.                      @L1A*/ 01134000
*/* CSVDYLPA Return and Reason Code definitions                      */ 01135000
*DCL CsvdylpaRc_OK Bit(32) Constant('00000000'X) ; /*                   01136000
*                        Meaning: CSVDYLPA request successful.          01137000
*                        Action: None required.                      */ 01138000
*DCL CsvdylpaRc_Warn Bit(32) Constant('00000004'X) ; /*                 01139000
*                        Meaning: Warning                               01140000
*                        Action: Refer to the action provided with the  01141000
*                        specific reason code.                       */ 01142000
*DCL CsvdylpaRsnNotAllSuccessful Bit(32) Constant('00000401'X) ; /*     01143000
*                        Meaning: For ADD and DELETE request, at least  01144000
*                        one input module could not be processed        01145000
*                        successfully. Information about the problem is 01146000
*                        contained within the MODINFO entry for that    01147000
*                        module, in field LpmeaOutputFlags (for ADD) or 01148000
*                        field LpmedOutputFlags (for DELETE). The       01149000
*                        system continued to process entries after the  01150000
*                        one for which the problem occurred.            01151000
*                        Action: Fix the problem before requesting the  01152000
*                        function again.                             */ 01153000
*DCL CsvdylpaRc_InvParm Bit(32) Constant('00000008'X) ; /*              01154000
*                        Meaning: CSVDYLPA request specifies parmeters  01155000
*                        that are not valid. For ADD and DELETE, when   01156000
*                        the problem occurred while processing a        01157000
*                        particular MODINFO entry, the system will not  01158000
*                        process any additional MODINFO entries.        01159000
*                        Action: Refer to the action provided with the  01160000
*                        specific reason code.                       */ 01161000
*DCL CsvdylpaRsnBadParmlist Bit(32) Constant('00000801'X) ; /*          01162000
*                        Meaning: Unable to access parameter list.      01163000
*                        Action: Check for possible storage overlay. */ 01164000
*DCL CsvdylpaRsnSrbMode Bit(32) Constant('00000802'X) ; /*              01165000
*                        Meaning: SRB mode.                             01166000
*                        Action: Avoid requesting this function in SRB  01167000
*                        mode.                                       */ 01168000
*DCL CsvdylpaRsnNotEnabled Bit(32) Constant('00000803'X) ; /*           01169000
*                        Meaning: Not Enabled.                          01170000
*                        Action: Avoid requesting this function while   01171000
*                        not enabled.                                */ 01172000
*DCL CsvdylpaRsnHomeNotPrimary Bit(32) Constant('00000805'X) ; /*       01173000
*                        Meaning: Home address space different from     01174000
*                        primary address space.                         01175000
*                        Action: Avoid requesting this function in this 01176000
*                        environment.                                */ 01177000
*DCL CsvdylpaRsnBadRequestType Bit(32) Constant('00000809'X) ; /*       01178000
*                        Meaning: Request type is not valid.            01179000
*                        Action: Check for possible storage overlay of  01180000
*                        the parameter list.                         */ 01181000
*DCL CsvdylpaRsnBadEstaex Bit(32) Constant('0000080A'X) ; /*            01182000
*                        Meaning: Unable to establish ESTAEX. "xxxx"    01183000
*                        contains the ESTAEX return code. There could   01184000
*                        be an FRR established.                         01185000
*                        Action: Refer to documentation for ESTAEX      01186000
*                        return code "xxxx".                         */ 01187000
*DCL CsvdylpaRsnReservedNot0 Bit(32) Constant('0000080B'X) ; /*         01188000
*                        Meaning: Reserved field not 0.                 01189000
*                        Action: Check for possible storage overlay of  01190000
*                        the parameter list.                         */ 01191000
*DCL CsvdylpaRsnBadParmlistALET Bit(32) Constant('0000080D'X) ; /*      01192000
*                        Meaning: Unable to use ALET of parameter list. 01193000
*                        Action: Make sure that the ALET of the         01194000
*                        parameter list is valid. The access register   01195000
*                        might not have been set up correctly.       */ 01196000
*DCL CsvdylpaRsnBadVersion Bit(32) Constant('0000080E'X) ; /*           01197000
*                        Meaning: Bad version number.                   01198000
*                        Action: Check for possible storage overlay of  01199000
*                        the parameter list or for use on a downlevel   01200000
*                        system that does not support this version.  */ 01201000
*DCL CsvdylpaRsnLocked Bit(32) Constant('0000080F'X) ; /*               01202000
*                        Meaning: Locked                                01203000
*                        Action: Avoid requesting this function in this 01204000
*                        environment.                                */ 01205000
*DCL CsvdylpaRsnBadDsnameArea Bit(32) Constant('00000815'X) ; /*        01206000
*                        Meaning: Unable to access data set name.       01207000
*                        Action: Make sure that the DSNAME area is      01208000
*                        valid.                                      */ 01209000
*DCL CsvdylpaRsnBadModinfoArea Bit(32) Constant('00000816'X) ; /*       01210000
*                        Meaning: Unable to access MODINFO area.        01211000
*                        Action: Make sure that the MODINFO area is     01212000
*                        valid.                                      */ 01213000
*DCL CsvdylpaRsnBadModinfoALET Bit(32) Constant('00000817'X) ; /*       01214000
*                        Meaning: Unable to use ALET of MODINFO area.   01215000
*                        Action: Make sure that the ALET of the MODINFO 01216000
*                        area is valid. The access register might not   01217000
*                        have been set up correctly.                 */ 01218000
*DCL CsvdylpaRsnBadOpen Bit(32) Constant('00000818'X) ; /*              01219000
*                        Meaning: Unable to open specified data set.    01220000
*                        Action: Make sure that you specified the       01221000
*                        proper data set, that it is a PDS or PDSE      01222000
*                        program library, and that it can be located by 01223000
*                        the system.                                 */ 01224000
*DCL CsvdylpaRsnBadNumMod Bit(32) Constant('0000081D'X) ; /*            01225000
*                        Meaning: The value provided by the NUMMOD      01226000
*                        parameter is 0 or exceeds 256.                 01227000
*                        Action: Specify a non-zero NUMMOD parameter    01228000
*                        value. Instead of providing more than 256      01229000
*                        entries in a single call, use multiple calls   01230000
*                        each of which provides no more than 256        01231000
*                        entries.                                    */ 01232000
*DCL CsvdylpaRsnBadDsnameALET Bit(32) Constant('00000820'X) ; /*        01233000
*                        Meaning: Bad dsname ALET.                      01234000
*                        Action: Make sure that the ALET of the DSNAME  01235000
*                        area is valid. The access register might not   01236000
*                        have been set up correctly.                 */ 01237000
*DCL CsvdylpaRsnBadModuleName Bit(32) Constant('00000822'X) ; /*        01238000
*                        Meaning: Bad modulename - first character is 0 01239000
*                        or blank.                                      01240000
*                        Action: Provide a valid module name.        */ 01241000
*DCL CsvdylpaRsnBadDsname Bit(32) Constant('00000823'X) ; /*            01242000
*                        Meaning: Bad DSNAME - first character is 0 or  01243000
*                        blank.                                         01244000
*                        Action: Provide a valid data set name.      */ 01245000
*DCL CsvdylpaRsnBadAlloc Bit(32) Constant('00000829'X) ; /*             01246000
*                        Meaning: Unable to allocate data set.          01247000
*                        Action: Make sure that you specified the       01248000
*                        proper data set, that it is a PDS or PDSE      01249000
*                        program library, and that it can be located by 01250000
*                        the system.                                 */ 01251000
*DCL CsvdylpaRsnFunctionNotAvailable Bit(32) Constant('0000082B'X) ; /* 01252000
*                        Meaning: Required DFSMS function or dynamic    01253000
*                        allocation is not available or request issued  01254000
*                        prior to the LNKLST being available.           01255000
*                        Action: Make sure that the required DFSMS      01256000
*                        support is installed. Avoid requesting the     01257000
*                        function in an environment where dynamic       01258000
*                        allocation is not available. Avoid requesting  01259000
*                        the function until the LNKLST is available.    01260000
*                        Avoid requesting dynamic LPA services via the  01261000
*                        PROG=xx parameter of the IEASYSxx parmlib      01262000
*                        member.                                     */ 01263000
*DCL CsvdylpaRsnNotAuthDCB Bit(32) Constant('0000082C'X) ; /*           01264000
*                        Meaning: Not authorized to use DCB option.     01265000
*                        Must be supervisor state, PKM allowing key     01266000
*                        0-7, PSW key 0-7, or APF authorized.           01267000
*                        Action: Avoid using the DCB option without the 01268000
*                        required authorization.                     */ 01269000
*DCL CsvdylpaRsnNotAuthConcat Bit(32) Constant('0000082D'X) ; /*        01270000
*                        Meaning: If not supervisor state, PKM allowing 01271000
*                        key 0-7, PSW key 0-7, or APF authorized, or if 01272000
*                        APFREQUIRED=YES is specified or defaulted, the 01273000
*                        concatenation represented by the input DDNAME  01274000
*                        or DCB, when it is not the LNKLST, must be APF 01275000
*                        authorized.                                    01276000
*                        Action: Avoid using a non-APF authorized       01277000
*                        concatenation without the required             01278000
*                        authorization.                              */ 01279000
*DCL CsvdylpaRsnNotAuthMemberMask Bit(32) Constant('0000082E'X) ; /*    01280000
*                        Meaning: Not authorized to use MemberMask      01281000
*                        option. Must be supervisor state, PKM allowing 01282000
*                        key 0-7, PSW key 0-7, or APF authorized.       01283000
*                        Action: Avoid using the MODINFOTYPE=MEMBERMASK 01284000
*                        function without the required authorization.   01285000
*                                                                    */ 01286000
*DCL CsvdylpaRsnBadModinfoxArea Bit(32) Constant('00000830'X) ; /*      01287000
*                        Meaning: Unable to access MODINFOX area.       01288000
*                        Action: Make sure that the MODINFOX area is    01289000
*                        valid.                                      */ 01290000
*DCL CsvdylpaRsnBadModinfoxALET Bit(32) Constant('00000831'X) ; /*      01291000
*                        Meaning: Unable to use ALET of MODINFOX area.  01292000
*                        Action: Make sure that the ALET of the         01293000
*                        MODINFOX area is valid. The access register    01294000
*                        might not have been set up correctly.       */ 01295000
*DCL CsvdylpaRsnESVC Bit(32) Constant('00000832'X) ; /*                 01296000
*                        Meaning: A non-extended SVC was selected, but  01297000
*                        the specified SVC number is an extended SVC.   01298000
*                        Action: Fix the SVC number.                 */ 01299000
*DCL CsvdylpaRsnNotESVC Bit(32) Constant('00000833'X) ; /*              01300000
*                        Meaning: An extended SVC was selected, but the 01301000
*                        specified SVC number is not an extended SVC.   01302000
*                        Action: Fix the SVC number.                 */ 01303000
*DCL CsvdylpaRsnBadESvcrnum Bit(32) Constant('00000834'X) ; /*          01304000
*                        Meaning: The routing number for the selected   01305000
*                        extended SVC exceeded the number of entries    01306000
*                        for that extended SVC that were defined at     01307000
*                        IPL.                                           01308000
*                        Action: Fix the extended SVC routine number.   01309000
*                                                                    */ 01310000
*DCL CsvdylpaRsnNotPartitioned Bit(32) Constant('0000083C'X) ; /*       01311000
*                        Meaning: For ADD request, the data set is not  01312000
*                        partitioned.                                   01313000
*                        Action: Make sure that you specified the       01314000
*                        proper data set and that it is a PDS or PDSE   01315000
*                        program library.                            */ 01316000
*DCL CsvdylpaRsnBadByaddrInfo Bit(32) Constant('0000083D'X) ; /*        01317000
*                        Meaning: For ADD request with BYADDR=YES, the  01318000
*                        module information is incorrect.               01319000
*                        Action: Make sure that the entry point and     01320000
*                        load point addresses represent common area     01321000
*                        storage. Make sure that the entry point lies   01322000
*                        within the primary load segment.            */ 01323000
*DCL CsvdylpaRsnNotAuthByaddr Bit(32) Constant('0000083E'X) ; /*        01324000
*                        Meaning: Not authorized to use BYADDR=YES      01325000
*                        option. Must be supervisor state, PKM allowing 01326000
*                        key 0-7, PSW key 0-7, or APF authorized.       01327000
*                        Action: Avoid using BYADDR=YES without the     01328000
*                        required authorization.                     */ 01329000
*DCL CsvdylpaRsnBadDcbArea Bit(32) Constant('0000083F'X) ; /*           01330000
*                        Meaning: Unable to access the opened DCB.      01331000
*                        Action: Make sure that the DCB has been        01332000
*                        opened.                                     */ 01333000
*DCL CsvdylpaRsnEnqHeldShared Bit(32) Constant('00000840'X) ; /*        01334000
*                        Meaning: The ENQ resource with QNAME SYSZCSV   01335000
*                        and RNAME CSVDYLPA was held in the shared      01336000
*                        state on entry to dynamic LPA services.        01337000
*                        Action: Avoid holding the ENQ shared when      01338000
*                        using dynamic LPA services.                 */ 01339000
*DCL CsvdylpaRsnBadLPMEAQArea Bit(32) Constant('00000841'X) ; /*        01340000
*                        Meaning: Unable to access LPMEAQ area.         01341000
*                        Action: Make sure that the LPMEAQ area is      01342000
*                        valid.                                      */ 01343000
*DCL CsvdylpaRsnBadLPMEAQALET Bit(32) Constant('00000842'X) ; /*        01344000
*                        Meaning: Unable to use ALET of LPMEAQ area.    01345000
*                        Action: Make sure that the ALET of the LPMEAQ  01346000
*                        area is valid. The access register might not   01347000
*                        have been set up correctly.                 */ 01348000
*DCL CsvdylpaRsnNotAuthAddAlias Bit(32) Constant('00000843'X) ; /*      01349000
*                        Meaning: Not authorized to use the             01350000
*                        ADDALIAS=YES function. Must be supervisor      01351000
*                        state, PKM allowing key 0-7, PSW key 0-7, or   01352000
*                        APF authorized.                                01353000
*                        Action: Avoid using the ADDALIAS=YES function  01354000
*                        without the required authorization.         */ 01355000
*DCL CsvdylpaRsnBadPathnameLen Bit(32) Constant('00000844'X) ; /*       01356000
*                        Meaning: The PATHNAMELEN parameter value is    01357000
*                        not in the range 1-1023.                       01358000
*                        Action: Provide a valid PATHNAMELEN parameter  01359000
*                        value.                                      */ 01360000
*DCL CsvdylpaRsnBadPathnameArea Bit(32) Constant('00000845'X) ; /*      01361000
*                        Meaning: Unable to access the pathname.        01362000
*                        Action: Make sure that the PATHNAME area is    01363000
*                        valid.                                      */ 01364000
*DCL CsvdylpaRsnBadPathnameALET Bit(32) Constant('00000846'X) ; /*      01365000
*                        Meaning: Unable to use ALET of PATHNAME area.  01366000
*                        Action: Make sure that the ALET of the         01367000
*                        PATHNAME area is valid. The access register    01368000
*                        might not have been set up correctly.       */ 01369000
*DCL CsvdylpaRsnBadPathnameNumMod Bit(32) Constant('00000847'X) ; /*    01370000
*                        Meaning: PATHNAME was specified and the value  01371000
*                        provided by the NUMMOD parameter is not 1.     01372000
*                        Action: Provide only 1 entry per call.      */ 01373000
*DCL CsvdylpaRsnNotAuthDEFLPAWAIT Bit(32) Constant('00000848'X) ; /*    01374000
*                        Meaning: Not authorized to use                 01375000
*                        REQUEST=DEFLPAWAIT. Must be supervisor state,  01376000
*                        PKM allowing key 0-7, PSW key 0-7, or APF      01377000
*                        authorized.                                    01378000
*                        Action: Avoid using REQUEST=DEFLPAWAIT without 01379000
*                        the required authorization.                 */ 01380000
*DCL CsvdylpaRsnBadModinfo64Area Bit(32) Constant('00000849'X) ; /*     01381000
*                        Meaning: Unable to access MODINFO64 area.      01382000
*                        Action: Make sure that the MODINFO64 area is   01383000
*                        valid.                                      */ 01384000
*DCL CsvdylpaRsnBadModinfo64ALET Bit(32) Constant('0000084A'X) ; /*     01385000
*                        Meaning: Unable to use ALET of MODINFO64 area. 01386000
*                        Action: Make sure that the ALET of the         01387000
*                        MODINFO64 area is valid. You might not have    01388000
*                        set up its access register properly.        */ 01389000
*DCL CsvdylpaRsnSvcRMODE64 Bit(32) Constant('0000084B'X) ; /*           01390000
*                        Meaning: A module identified as an SVC (or     01391000
*                        extended SVC) routine was found to require     01392000
*                        above the bar storage.                         01393000
*                        Action: Avoid using an RMODE 64 module as an   01394000
*                        SVC routine.                                */ 01395000
*DCL CsvdylpaRc_Env Bit(32) Constant('0000000C'X) ; /*                  01396000
*                        Meaning: Environmental error                   01397000
*                        Action: Refer to the action provided with the  01398000
*                        specific reason code.                       */ 01399000
*DCL CsvdylpaRsnNoStorage Bit(32) Constant('00000C02'X) ; /*            01400000
*                        Meaning: There is not sufficient storage to    01401000
*                        complete the request.                          01402000
*                        Action: Contact your system programmer. There  01403000
*                        is a shortage of common storage.            */ 01404000
*DCL CsvdylpaRsnBadDirectory Bit(32) Constant('00000C04'X) ; /*         01405000
*                        Meaning: When using the MemberMask option, the 01406000
*                        data set directory was in error. Either an I/O 01407000
*                        error occurred accessing the directory, or the 01408000
*                        format of a directory entry was incorrect.     01409000
*                        Action: Fix the data set directory. Make sure  01410000
*                        that the data set is a PDS or PDSE program     01411000
*                        library.                                    */ 01412000
*DCL CsvdylpaRsnStoragelimExceeded Bit(32) Constant('00000C05'X) ; /*   01413000
*                        Meaning: For ADD request, the amount of module 01414000
*                        storage needed for the request would have      01415000
*                        caused the amount of CSA or ECSA remaining to  01416000
*                        fall below the threshold specified by the      01417000
*                        system programmer using the LPA CSAMIN         01418000
*                        statement of PROGxx or the SETPROG LPA,CSAMIN  01419000
*                        system command.                                01420000
*                        Action: Specify that fewer modules be added,   01421000
*                        or have the system programmer reduce the       01422000
*                        CSAMIN amounts.                             */ 01423000
*DCL CsvdylpaRC_CompError Bit(32) Constant('00000010'X) ; /*            01424000
*                        Meaning: Unexpected failure.                   01425000
*                        Action: Refer to the action provided with the  01426000
*                        specific reason code.                       */ 01427000
*DCL CsvdylpaRsnCompError Bit(32) Constant('00001001'X) ; /*            01428000
*                        Meaning: Unexpected failure. The state of the  01429000
*                        request is unpredictable.                      01430000
*                        Action: Contact your system programmer.     */ 01431000
*/* End of CSVDYLPA Return and Reason Code definitions               */ 01432000
* @LOGIC;                                                               01433000
* #PRAGMA TOOL=CBGEN.                                                   01434000
* #USEORG.                                                              01435000
* #EPRAGMA.                                                             01436000
* @ENDLOGIC;                                                            01437000
*/* End of PL/X Source                                               */ 01438000
* %IF CSVLPRET_LIST ^= 'NO' &                                           01439000
*    ZCBPRINT ^= 'NO' %THEN                                             01440000
*   %GOTO CSVLPRET_4;                                                   01441000
*   @LIST POP NOECHO;                                                   01442000
* %CSVLPRET_4:;                                                         01443000
* %END;                                                                 01444000
