         MACRO                                                                  
&LABEL   CUNAIXRF &CCSID=                                                       
.*********************************************************************          
.*                                                                   *          
.* LICENSED MATERIALS - PROPERTY OF IBM                              *          
.*                                                                   *          
.* 5650-ZOS                                                          *          
.*                                                                   *          
.* COPYRIGHT IBM CORP.  2001, 2019                                   *          
.*                                                                   *          
.* STATUS = HUN77B0                                                  *          
.*                                                                   *          
.*********************************************************************          
.*********************************************************************          
.*                                                                   *          
.* THIS MACRO GENERATE SUFFIXES FOR THE IBM SUPPLIED KNOWLEDGE BASE  *          
.* ENTRIES                                                           *          
.*                                                                   *          
.* SAMPLE INVOCATIONS:                                               *          
.*                                                                   *          
.*       CUNAIXRF CCSID=00037    -> GENERATES A      DC   CL2'AA'    *          
.*       CUNAIKBG CCSID=00850    -> GENERATES A      DC   CL2'EB'    *          
.*                                                                   *          
.* CHANGE HISTORY:                                                   *          
.* 25/05/2000 INITIAL                                                *          
.* $D1=GB18030  HUNI2A0 010604 PDM: GB18030 PH-1 INTEGRATION TO   D1A*          
.*                                INCLUDE NEW SUFFIX FOR GB18030  D1A*          
.* $D2=MG00227  HUN7707 010921 PDM: GB18030 PH-2 INTEGRATION TO   D2A*          
.*                                INCLUDE SUFFIX FOR GB18030 PH2  D2A*          
.*                                AND UNICODE V3.1 (UCS2)         D2A*          
.* $D3=MG01568  HUN7708 030120 SVP: DEFINE SUFFIXES OF NEW CCSIDS D3A*          
.* $D4=HC2      HUN7709 030120 SVP: DEFINE SUFFIXES OF NEW CCSIDS D4A*          
.* $A1=OA14238  HUN7707 060223 CAP: PROVIDE CONVERSION TABLE FOR @A1A*          
.*                             CCSID 5473 (T-CHINESE HOST FOR    @A1A*          
.*                             HKSCS-2001 EXTENSION) TO UNICODE  @A1A*          
.* $F1=B144.00  HUN7740 060425  JR:PROVIDE SUPPORT FOR CCSID 1202@F1A*          
.* $A2=OA11742  HUN7740 060818 CAP: SUPPORT OF HKSCS STANDARD &  @A2A*          
.*                             UPDATE CCSID 1386 <-> 1200 TABLES @A2A*          
.* $D5=MG08209  HUN7740 061012 CA: Support CCSID-53668           @D5A*          
.* $F2=B35900  HUN7750 070701 LMM: HQN - Extended Translation        *          
.*                                 Facility 3                        *          
.* $A3=OA22720  HUN7740 071115 CA: Conversion support for MBCS CCSID *          
.*                                 62383 and CCSID-54191 to/from     *          
.*                                 Unicode.                          *          
.* $O6=B655.00  HUN7760 081214 RO: JIS X 0213 Support                *          
.*                                 New DBCS CCSID                    *          
.* $L1=OA23858  HUN7760 090312 LB: Conversion support for CCSID      *          
.*                                 00876 to/from Unicode             *          
.* $C1=B902.00  HUN7780 100127 CJB:PROVIDE SUPPORT FOR CCSID 1210@C1A*          
.* $T1=LI231    HUN7790 101102 TVC:add support for 17338 and 21434   *          
.* $C2=OA34499  HUN7790 110303 CJB: Rollup for APAR OA34499          *          
.*                                  Conversion support for MBCS      *          
.*                                  CCSIDs 05486 and 05495 to and    *          
.*                                  from Unicode.                    *          
.* $W1=OA38391  HUN7790 120412 WS:  Conversion support for CCSIDs    *          
.*                                  05233, 62373 and 62273 to and    *          
.*                                  from Unicode. Add suffixes for   *          
.*                                  CCSIDs defined in later          *          
.*                                  releases: 17338, 21434, 25528    *          
.*                                  and 37818                        *          
.* $L2=LI2610.3 HUN7790 120609 DJG: Add UR for CCSID 42160       @L2A*          
.*                                  support                      @L2A*          
.* $F3=MG18349 HUN7790 120926 FKAI: Add CCSID 9566,9567,9568,9569@F3A*          
.*                                  13662,13664                  @F3A*          
.* $D6=OA43021 HUN77A0 140325 DJG:  HKSCS-2008 to Unicode 4.0    @D6A*          
.*                                  support                      @D6A*          
.* $F4=OA44703 HUN77A0 140414 FKAI: Add CCSID 1175               @F4A*          
.* $D7=OA46713 HUN77B0 150909 LC:   CCSID 29509 to Unicode 4.0   @D7A*          
.*                                  support                      @D7A*          
.* $D8=FP1334  HUN77B0 160308 LHL:  Add U2 to support CCISD 5474 @D8A*          
.*                                  Add U3 to support CCISD 5475 @D8A*          
.*                                  Add U4 to support CCISD 1378 @D8A*          
.*                                  Add U5 to support CCISD 1379 @D8A*          
.* $D9=FP1900  HUN77B0 160418 LC:   Add U6 to support CCSID 5255 @D9A*          
.*                                  Add U7 to support CCSID 9563 @D9A*          
.*                                  Add U8 to support CCSID 17219@D9A*          
.* $DA=OA46713 HUN77B0 160518 LC:   Add U9 to support CCSID 21868@DAA*          
.* $DB=FP1335  HUN77B0 170302 DJG:  Add VA to support CCSID 54448@DBA*          
.* $DC=OA56512 HUN77B0 190108 DJG:  Add VB to support CCSID 28972@DCA*          
.*                                  13678, 13687                 @DCA*          
.*                                  to support Japanese new era. @DCA*          
.*                                                                   *          
.*********************************************************************          
         AIF   (T'&CCSID NE 'O').OKAY                                           
         MNOTE 8,'CCSID MUST BE SPECIFIED'                                      
         MEXIT                                                                  
.OKAY    ANOP                                                                   
.*********************************************************************          
.* ADD LINES FOR EACH CCSID XREF ENTRY BELOW THIS SET OF COMMENTS:   *          
.*                                                                   *          
.*     "&REF     SETC  'XX'                                          *          
.*               AIF   ('&CCSID' EQ 'NNNNN').END"                    *          
.*********************************************************************          
&REF     SETC  'AA'                                                             
         AIF   ('&CCSID' EQ '00037').END                                        
&REF     SETC  'AB'                                                             
         AIF   ('&CCSID' EQ '04133').END                                        
&REF     SETC  'AC'                                                             
         AIF   ('&CCSID' EQ '08229').END                                        
&REF     SETC  'AD'                                                             
         AIF   ('&CCSID' EQ '12325').END                                        
&REF     SETC  'AE'                                                             
         AIF   ('&CCSID' EQ '16421').END                                        
&REF     SETC  'AF'                                                             
         AIF   ('&CCSID' EQ '20517').END                                        
&REF     SETC  'AG'                                                             
         AIF   ('&CCSID' EQ '24613').END                                        
&REF     SETC  'AH'                                                             
         AIF   ('&CCSID' EQ '28709').END                                        
&REF     SETC  'AI'                                                             
         AIF   ('&CCSID' EQ '32805').END                                        
&REF     SETC  'AJ'                                                             
         AIF   ('&CCSID' EQ '00256').END                                        
&REF     SETC  'AK'                                                             
         AIF   ('&CCSID' EQ '08448').END                                        
&REF     SETC  'AL'                                                             
         AIF   ('&CCSID' EQ '12544').END                                        
&REF     SETC  'AM'                                                             
         AIF   ('&CCSID' EQ '61696').END                                        
&REF     SETC  'AN'                                                             
         AIF   ('&CCSID' EQ '61697').END                                        
&REF     SETC  'AO'                                                             
         AIF   ('&CCSID' EQ '61698').END                                        
&REF     SETC  'AP'                                                             
         AIF   ('&CCSID' EQ '00259').END                                        
&REF     SETC  'AQ'                                                             
         AIF   ('&CCSID' EQ '61699').END                                        
&REF     SETC  'AR'                                                             
         AIF   ('&CCSID' EQ '61700').END                                        
&REF     SETC  'AS'                                                             
         AIF   ('&CCSID' EQ '61710').END                                        
&REF     SETC  'AT'                                                             
         AIF   ('&CCSID' EQ '61711').END                                        
&REF     SETC  'AU'                                                             
         AIF   ('&CCSID' EQ '61712').END                                        
&REF     SETC  'AV'                                                             
         AIF   ('&CCSID' EQ '00273').END                                        
&REF     SETC  'AW'                                                             
         AIF   ('&CCSID' EQ '04369').END                                        
&REF     SETC  'AX'                                                             
         AIF   ('&CCSID' EQ '00274').END                                        
&REF     SETC  'AY'                                                             
         AIF   ('&CCSID' EQ '04370').END                                        
&REF     SETC  'AZ'                                                             
         AIF   ('&CCSID' EQ '00275').END                                        
&REF     SETC  'A0'                                                             
         AIF   ('&CCSID' EQ '04371').END                                        
&REF     SETC  'A1'                                                             
         AIF   ('&CCSID' EQ '04372').END                                        
&REF     SETC  'A2'                                                             
         AIF   ('&CCSID' EQ '00277').END                                        
&REF     SETC  'A3'                                                             
         AIF   ('&CCSID' EQ '04373').END                                        
&REF     SETC  'A4'                                                             
         AIF   ('&CCSID' EQ '00278').END                                        
&REF     SETC  'A5'                                                             
         AIF   ('&CCSID' EQ '04374').END                                        
&REF     SETC  'A6'                                                             
         AIF   ('&CCSID' EQ '00280').END                                        
&REF     SETC  'A7'                                                             
         AIF   ('&CCSID' EQ '04376').END                                        
&REF     SETC  'A8'                                                             
         AIF   ('&CCSID' EQ '00281').END                                        
&REF     SETC  'A9'                                                             
         AIF   ('&CCSID' EQ '00282').END                                        
&REF     SETC  'BA'                                                             
         AIF   ('&CCSID' EQ '04378').END                                        
&REF     SETC  'BB'                                                             
         AIF   ('&CCSID' EQ '00284').END                                        
&REF     SETC  'BC'                                                             
         AIF   ('&CCSID' EQ '04380').END                                        
&REF     SETC  'BD'                                                             
         AIF   ('&CCSID' EQ '08476').END                                        
&REF     SETC  'BE'                                                             
         AIF   ('&CCSID' EQ '00285').END                                        
&REF     SETC  'BF'                                                             
         AIF   ('&CCSID' EQ '04381').END                                        
&REF     SETC  'BG'                                                             
         AIF   ('&CCSID' EQ '00286').END                                        
&REF     SETC  'BH'                                                             
         AIF   ('&CCSID' EQ '00290').END                                        
&REF     SETC  'BI'                                                             
         AIF   ('&CCSID' EQ '04386').END                                        
&REF     SETC  'BJ'                                                             
         AIF   ('&CCSID' EQ '08482').END                                        
&REF     SETC  'BK'                                                             
         AIF   ('&CCSID' EQ '33058').END                                        
&REF     SETC  'BL'                                                             
         AIF   ('&CCSID' EQ '00293').END                                        
&REF     SETC  'BM'                                                             
         AIF   ('&CCSID' EQ '04389').END                                        
&REF     SETC  'BN'                                                             
         AIF   ('&CCSID' EQ '00297').END                                        
&REF     SETC  'BO'                                                             
         AIF   ('&CCSID' EQ '04393').END                                        
&REF     SETC  'BP'                                                             
         AIF   ('&CCSID' EQ '08489').END                                        
&REF     SETC  'BQ'                                                             
         AIF   ('&CCSID' EQ '00300').END                                        
&REF     SETC  'BR'                                                             
         AIF   ('&CCSID' EQ '04396').END                                        
&REF     SETC  'BS'                                                             
         AIF   ('&CCSID' EQ '08492').END                                        
&REF     SETC  'BT'                                                             
         AIF   ('&CCSID' EQ '12588').END                                        
&REF     SETC  'BU'                                                             
         AIF   ('&CCSID' EQ '16684').END                                        
&REF     SETC  'BV'                                                             
         AIF   ('&CCSID' EQ '00301').END                                        
&REF     SETC  'BW'                                                             
         AIF   ('&CCSID' EQ '04397').END                                        
&REF     SETC  'BX'                                                             
         AIF   ('&CCSID' EQ '08493').END                                        
&REF     SETC  'BY'                                                             
         AIF   ('&CCSID' EQ '24877').END                                        
&REF     SETC  'BZ'                                                             
         AIF   ('&CCSID' EQ '00310').END                                        
&REF     SETC  'B0'                                                             
         AIF   ('&CCSID' EQ '00367').END                                        
&REF     SETC  'B1'                                                             
         AIF   ('&CCSID' EQ '00420').END                                        
&REF     SETC  'B2'                                                             
         AIF   ('&CCSID' EQ '04516').END                                        
&REF     SETC  'B3'                                                             
         AIF   ('&CCSID' EQ '08612').END                                        
&REF     SETC  'B4'                                                             
         AIF   ('&CCSID' EQ '12708').END                                        
&REF     SETC  'B5'                                                             
         AIF   ('&CCSID' EQ '16804').END                                        
&REF     SETC  'B6'                                                             
         AIF   ('&CCSID' EQ '00421').END                                        
&REF     SETC  'B7'                                                             
         AIF   ('&CCSID' EQ '04517').END                                        
&REF     SETC  'B8'                                                             
         AIF   ('&CCSID' EQ '00423').END                                        
&REF     SETC  'B9'                                                             
         AIF   ('&CCSID' EQ '04519').END                                        
&REF     SETC  'CA'                                                             
         AIF   ('&CCSID' EQ '00424').END                                        
&REF     SETC  'CB'                                                             
         AIF   ('&CCSID' EQ '04520').END                                        
&REF     SETC  'CC'                                                             
         AIF   ('&CCSID' EQ '08616').END                                        
&REF     SETC  'CD'                                                             
         AIF   ('&CCSID' EQ '12712').END                                        
&REF     SETC  'CE'                                                             
         AIF   ('&CCSID' EQ '00437').END                                        
&REF     SETC  'CF'                                                             
         AIF   ('&CCSID' EQ '04533').END                                        
&REF     SETC  'CG'                                                             
         AIF   ('&CCSID' EQ '08629').END                                        
&REF     SETC  'CH'                                                             
         AIF   ('&CCSID' EQ '12725').END                                        
&REF     SETC  'CI'                                                             
         AIF   ('&CCSID' EQ '16821').END                                        
&REF     SETC  'CJ'                                                             
         AIF   ('&CCSID' EQ '20917').END                                        
&REF     SETC  'CK'                                                             
         AIF   ('&CCSID' EQ '25013').END                                        
&REF     SETC  'CL'                                                             
         AIF   ('&CCSID' EQ '29109').END                                        
&REF     SETC  'CM'                                                             
         AIF   ('&CCSID' EQ '33205').END                                        
&REF     SETC  'CN'                                                             
         AIF   ('&CCSID' EQ '37301').END                                        
&REF     SETC  'CO'                                                             
         AIF   ('&CCSID' EQ '41397').END                                        
&REF     SETC  'CP'                                                             
         AIF   ('&CCSID' EQ '45493').END                                        
&REF     SETC  'CQ'                                                             
         AIF   ('&CCSID' EQ '49589').END                                        
&REF     SETC  'CR'                                                             
         AIF   ('&CCSID' EQ '00500').END                                        
&REF     SETC  'CS'                                                             
         AIF   ('&CCSID' EQ '04596').END                                        
&REF     SETC  'CT'                                                             
         AIF   ('&CCSID' EQ '08692').END                                        
&REF     SETC  'CU'                                                             
         AIF   ('&CCSID' EQ '12788').END                                        
&REF     SETC  'CV'                                                             
         AIF   ('&CCSID' EQ '16884').END                                        
&REF     SETC  'CW'                                                             
         AIF   ('&CCSID' EQ '20980').END                                        
&REF     SETC  'CX'                                                             
         AIF   ('&CCSID' EQ '25076').END                                        
&REF     SETC  'CY'                                                             
         AIF   ('&CCSID' EQ '29172').END                                        
&REF     SETC  'CZ'                                                             
         AIF   ('&CCSID' EQ '33268').END                                        
&REF     SETC  'C0'                                                             
         AIF   ('&CCSID' EQ '37364').END                                        
&REF     SETC  'C1'                                                             
         AIF   ('&CCSID' EQ '41460').END                                        
&REF     SETC  'C2'                                                             
         AIF   ('&CCSID' EQ '45556').END                                        
&REF     SETC  'C3'                                                             
         AIF   ('&CCSID' EQ '49652').END                                        
&REF     SETC  'C4'                                                             
         AIF   ('&CCSID' EQ '53748').END                                        
&REF     SETC  'C5'                                                             
         AIF   ('&CCSID' EQ '00720').END                                        
&REF     SETC  'C6'                                                             
         AIF   ('&CCSID' EQ '00737').END                                        
&REF     SETC  'C7'                                                             
         AIF   ('&CCSID' EQ '25313').END                                        
&REF     SETC  'C8'                                                             
         AIF   ('&CCSID' EQ '00775').END                                        
&REF     SETC  'C9'                                                             
         AIF   ('&CCSID' EQ '25351').END                                        
&REF     SETC  'DA'                                                             
         AIF   ('&CCSID' EQ '00803').END                                        
&REF     SETC  'DB'                                                             
         AIF   ('&CCSID' EQ '04899').END                                        
&REF     SETC  'DC'                                                             
         AIF   ('&CCSID' EQ '00806').END                                        
&REF     SETC  'DD'                                                             
         AIF   ('&CCSID' EQ '04902').END                                        
&REF     SETC  'DE'                                                             
         AIF   ('&CCSID' EQ '00807').END                                        
&REF     SETC  'DF'                                                             
         AIF   ('&CCSID' EQ '00813').END                                        
&REF     SETC  'DG'                                                             
         AIF   ('&CCSID' EQ '04909').END                                        
&REF     SETC  'DH'                                                             
         AIF   ('&CCSID' EQ '00819').END                                        
&REF     SETC  'DI'                                                             
         AIF   ('&CCSID' EQ '00833').END                                        
&REF     SETC  'DJ'                                                             
         AIF   ('&CCSID' EQ '04929').END                                        
&REF     SETC  'DK'                                                             
         AIF   ('&CCSID' EQ '09025').END                                        
&REF     SETC  'DL'                                                             
         AIF   ('&CCSID' EQ '13121').END                                        
&REF     SETC  'DM'                                                             
         AIF   ('&CCSID' EQ '00834').END                                        
&REF     SETC  'DN'                                                             
         AIF   ('&CCSID' EQ '04930').END                                        
&REF     SETC  'DO'                                                             
         AIF   ('&CCSID' EQ '09026').END                                        
&REF     SETC  'DP'                                                             
         AIF   ('&CCSID' EQ '13122').END                                        
&REF     SETC  'DQ'                                                             
         AIF   ('&CCSID' EQ '17218').END                                        
&REF     SETC  'DR'                                                             
         AIF   ('&CCSID' EQ '00835').END                                        
&REF     SETC  'DS'                                                             
         AIF   ('&CCSID' EQ '04931').END                                        
&REF     SETC  'DT'                                                             
         AIF   ('&CCSID' EQ '09027').END                                        
&REF     SETC  'DU'                                                             
         AIF   ('&CCSID' EQ '00836').END                                        
&REF     SETC  'DV'                                                             
         AIF   ('&CCSID' EQ '04932').END                                        
&REF     SETC  'DW'                                                             
         AIF   ('&CCSID' EQ '09028').END                                        
&REF     SETC  'DX'                                                             
         AIF   ('&CCSID' EQ '13124').END                                        
&REF     SETC  'DY'                                                             
         AIF   ('&CCSID' EQ '00837').END                                        
&REF     SETC  'DZ'                                                             
         AIF   ('&CCSID' EQ '04933').END                                        
&REF     SETC  'D0'                                                             
         AIF   ('&CCSID' EQ '09029').END                                        
&REF     SETC  'D1'                                                             
         AIF   ('&CCSID' EQ '00838').END                                        
&REF     SETC  'D2'                                                             
         AIF   ('&CCSID' EQ '04934').END                                        
&REF     SETC  'D3'                                                             
         AIF   ('&CCSID' EQ '09030').END                                        
&REF     SETC  'D4'                                                             
         AIF   ('&CCSID' EQ '00839').END                                        
&REF     SETC  'D5'                                                             
         AIF   ('&CCSID' EQ '00808').END                                        
&REF     SETC  'D6'                                                             
         AIF   ('&CCSID' EQ '25384').END                                        
&REF     SETC  'D7'                                                             
         AIF   ('&CCSID' EQ '00848').END                                        
&REF     SETC  'D8'                                                             
         AIF   ('&CCSID' EQ '25424').END                                        
&REF     SETC  'D9'                                                             
         AIF   ('&CCSID' EQ '00849').END                                        
&REF     SETC  'EA'                                                             
         AIF   ('&CCSID' EQ '25425').END                                        
&REF     SETC  'EB'                                                             
         AIF   ('&CCSID' EQ '00850').END                                        
&REF     SETC  'EC'                                                             
         AIF   ('&CCSID' EQ '04946').END                                        
&REF     SETC  'ED'                                                             
         AIF   ('&CCSID' EQ '25426').END                                        
&REF     SETC  'EE'                                                             
         AIF   ('&CCSID' EQ '29522').END                                        
&REF     SETC  'EF'                                                             
         AIF   ('&CCSID' EQ '33618').END                                        
&REF     SETC  'EG'                                                             
         AIF   ('&CCSID' EQ '00851').END                                        
&REF     SETC  'EH'                                                             
         AIF   ('&CCSID' EQ '04947').END                                        
&REF     SETC  'EI'                                                             
         AIF   ('&CCSID' EQ '25427').END                                        
&REF     SETC  'EJ'                                                             
         AIF   ('&CCSID' EQ '29523').END                                        
&REF     SETC  'EK'                                                             
         AIF   ('&CCSID' EQ '33619').END                                        
&REF     SETC  'EL'                                                             
         AIF   ('&CCSID' EQ '00852').END                                        
&REF     SETC  'EM'                                                             
         AIF   ('&CCSID' EQ '04948').END                                        
&REF     SETC  'EN'                                                             
         AIF   ('&CCSID' EQ '09044').END                                        
&REF     SETC  'EO'                                                             
         AIF   ('&CCSID' EQ '25428').END                                        
&REF     SETC  'EP'                                                             
         AIF   ('&CCSID' EQ '29524').END                                        
&REF     SETC  'EQ'                                                             
         AIF   ('&CCSID' EQ '33620').END                                        
&REF     SETC  'ER'                                                             
         AIF   ('&CCSID' EQ '37716').END                                        
&REF     SETC  'ES'                                                             
         AIF   ('&CCSID' EQ '00853').END                                        
&REF     SETC  'ET'                                                             
         AIF   ('&CCSID' EQ '04949').END                                        
&REF     SETC  'EU'                                                             
         AIF   ('&CCSID' EQ '25429').END                                        
&REF     SETC  'EV'                                                             
         AIF   ('&CCSID' EQ '29525').END                                        
&REF     SETC  'EW'                                                             
         AIF   ('&CCSID' EQ '33621').END                                        
&REF     SETC  'EX'                                                             
         AIF   ('&CCSID' EQ '00855').END                                        
&REF     SETC  'EY'                                                             
         AIF   ('&CCSID' EQ '04951').END                                        
&REF     SETC  'EZ'                                                             
         AIF   ('&CCSID' EQ '09047').END                                        
&REF     SETC  'E0'                                                             
         AIF   ('&CCSID' EQ '25431').END                                        
&REF     SETC  'E1'                                                             
         AIF   ('&CCSID' EQ '29527').END                                        
&REF     SETC  'E2'                                                             
         AIF   ('&CCSID' EQ '33623').END                                        
&REF     SETC  'E3'                                                             
         AIF   ('&CCSID' EQ '37719').END                                        
&REF     SETC  'E4'                                                             
         AIF   ('&CCSID' EQ '00856').END                                        
&REF     SETC  'E5'                                                             
         AIF   ('&CCSID' EQ '04952').END                                        
&REF     SETC  'E6'                                                             
         AIF   ('&CCSID' EQ '09048').END                                        
&REF     SETC  'E7'                                                             
         AIF   ('&CCSID' EQ '13144').END                                        
&REF     SETC  'E8'                                                             
         AIF   ('&CCSID' EQ '25432').END                                        
&REF     SETC  'E9'                                                             
         AIF   ('&CCSID' EQ '29528').END                                        
&REF     SETC  'FA'                                                             
         AIF   ('&CCSID' EQ '33624').END                                        
&REF     SETC  'FB'                                                             
         AIF   ('&CCSID' EQ '37720').END                                        
&REF     SETC  'FC'                                                             
         AIF   ('&CCSID' EQ '00857').END                                        
&REF     SETC  'FD'                                                             
         AIF   ('&CCSID' EQ '04953').END                                        
&REF     SETC  'FE'                                                             
         AIF   ('&CCSID' EQ '09049').END                                        
&REF     SETC  'FF'                                                             
         AIF   ('&CCSID' EQ '25433').END                                        
&REF     SETC  'FG'                                                             
         AIF   ('&CCSID' EQ '29529').END                                        
&REF     SETC  'FH'                                                             
         AIF   ('&CCSID' EQ '33625').END                                        
&REF     SETC  'FI'                                                             
         AIF   ('&CCSID' EQ '00858').END                                        
&REF     SETC  'FJ'                                                             
         AIF   ('&CCSID' EQ '25434').END                                        
&REF     SETC  'FK'                                                             
         AIF   ('&CCSID' EQ '00859').END                                        
&REF     SETC  'FL'                                                             
         AIF   ('&CCSID' EQ '25435').END                                        
&REF     SETC  'FM'                                                             
         AIF   ('&CCSID' EQ '00860').END                                        
&REF     SETC  'FN'                                                             
         AIF   ('&CCSID' EQ '25436').END                                        
&REF     SETC  'FO'                                                             
         AIF   ('&CCSID' EQ '29532').END                                        
&REF     SETC  'FP'                                                             
         AIF   ('&CCSID' EQ '00861').END                                        
&REF     SETC  'FQ'                                                             
         AIF   ('&CCSID' EQ '25437').END                                        
&REF     SETC  'FR'                                                             
         AIF   ('&CCSID' EQ '29533').END                                        
&REF     SETC  'FS'                                                             
         AIF   ('&CCSID' EQ '00862').END                                        
&REF     SETC  'FT'                                                             
         AIF   ('&CCSID' EQ '25438').END                                        
&REF     SETC  'FU'                                                             
         AIF   ('&CCSID' EQ '29534').END                                        
&REF     SETC  'FV'                                                             
         AIF   ('&CCSID' EQ '00863').END                                        
&REF     SETC  'FW'                                                             
         AIF   ('&CCSID' EQ '25439').END                                        
&REF     SETC  'FX'                                                             
         AIF   ('&CCSID' EQ '29535').END                                        
&REF     SETC  'FY'                                                             
         AIF   ('&CCSID' EQ '00864').END                                        
&REF     SETC  'FZ'                                                             
         AIF   ('&CCSID' EQ '04960').END                                        
&REF     SETC  'F0'                                                             
         AIF   ('&CCSID' EQ '09056').END                                        
&REF     SETC  'F1'                                                             
         AIF   ('&CCSID' EQ '13152').END                                        
&REF     SETC  'F2'                                                             
         AIF   ('&CCSID' EQ '17248').END                                        
&REF     SETC  'F3'                                                             
         AIF   ('&CCSID' EQ '25440').END                                        
&REF     SETC  'F4'                                                             
         AIF   ('&CCSID' EQ '29536').END                                        
&REF     SETC  'F5'                                                             
         AIF   ('&CCSID' EQ '33632').END                                        
&REF     SETC  'F6'                                                             
         AIF   ('&CCSID' EQ '37728').END                                        
&REF     SETC  'F7'                                                             
         AIF   ('&CCSID' EQ '41824').END                                        
&REF     SETC  'F8'                                                             
         AIF   ('&CCSID' EQ '45920').END                                        
&REF     SETC  'F9'                                                             
         AIF   ('&CCSID' EQ '50016').END                                        
&REF     SETC  'GA'                                                             
         AIF   ('&CCSID' EQ '00865').END                                        
&REF     SETC  'GB'                                                             
         AIF   ('&CCSID' EQ '25441').END                                        
&REF     SETC  'GC'                                                             
         AIF   ('&CCSID' EQ '29537').END                                        
&REF     SETC  'GD'                                                             
         AIF   ('&CCSID' EQ '00866').END                                        
&REF     SETC  'GE'                                                             
         AIF   ('&CCSID' EQ '25442').END                                        
&REF     SETC  'GF'                                                             
         AIF   ('&CCSID' EQ '00867').END                                        
&REF     SETC  'GG'                                                             
         AIF   ('&CCSID' EQ '25443').END                                        
&REF     SETC  'GH'                                                             
         AIF   ('&CCSID' EQ '00868').END                                        
&REF     SETC  'GI'                                                             
         AIF   ('&CCSID' EQ '04964').END                                        
&REF     SETC  'GJ'                                                             
         AIF   ('&CCSID' EQ '09060').END                                        
&REF     SETC  'GK'                                                             
         AIF   ('&CCSID' EQ '25444').END                                        
&REF     SETC  'GL'                                                             
         AIF   ('&CCSID' EQ '29540').END                                        
&REF     SETC  'GM'                                                             
         AIF   ('&CCSID' EQ '33636').END                                        
&REF     SETC  'GN'                                                             
         AIF   ('&CCSID' EQ '37732').END                                        
&REF     SETC  'GO'                                                             
         AIF   ('&CCSID' EQ '41828').END                                        
&REF     SETC  'GP'                                                             
         AIF   ('&CCSID' EQ '00869').END                                        
&REF     SETC  'GQ'                                                             
         AIF   ('&CCSID' EQ '04965').END                                        
&REF     SETC  'GR'                                                             
         AIF   ('&CCSID' EQ '09061').END                                        
&REF     SETC  'GS'                                                             
         AIF   ('&CCSID' EQ '25445').END                                        
&REF     SETC  'GT'                                                             
         AIF   ('&CCSID' EQ '29541').END                                        
&REF     SETC  'GU'                                                             
         AIF   ('&CCSID' EQ '33637').END                                        
&REF     SETC  'GV'                                                             
         AIF   ('&CCSID' EQ '37733').END                                        
&REF     SETC  'GW'                                                             
         AIF   ('&CCSID' EQ '00870').END                                        
&REF     SETC  'GX'                                                             
         AIF   ('&CCSID' EQ '04966').END                                        
&REF     SETC  'GY'                                                             
         AIF   ('&CCSID' EQ '00871').END                                        
&REF     SETC  'GZ'                                                             
         AIF   ('&CCSID' EQ '04967').END                                        
&REF     SETC  'G0'                                                             
         AIF   ('&CCSID' EQ '00872').END                                        
&REF     SETC  'G1'                                                             
         AIF   ('&CCSID' EQ '04968').END                                        
&REF     SETC  'G2'                                                             
         AIF   ('&CCSID' EQ '25448').END                                        
&REF     SETC  'G3'                                                             
         AIF   ('&CCSID' EQ '00874').END                                        
&REF     SETC  'G4'                                                             
         AIF   ('&CCSID' EQ '04970').END                                        
&REF     SETC  'G5'                                                             
         AIF   ('&CCSID' EQ '09066').END                                        
&REF     SETC  'G6'                                                             
         AIF   ('&CCSID' EQ '25450').END                                        
&REF     SETC  'G7'                                                             
         AIF   ('&CCSID' EQ '29546').END                                        
&REF     SETC  'G8'                                                             
         AIF   ('&CCSID' EQ '00875').END                                        
&REF     SETC  'G9'                                                             
         AIF   ('&CCSID' EQ '04971').END                                        
&REF     SETC  'HA'                                                             
         AIF   ('&CCSID' EQ '00878').END                                        
&REF     SETC  'HB'                                                             
         AIF   ('&CCSID' EQ '00880').END                                        
&REF     SETC  'HC'                                                             
         AIF   ('&CCSID' EQ '04976').END                                        
&REF     SETC  'HD'                                                             
         AIF   ('&CCSID' EQ '00891').END                                        
&REF     SETC  'HE'                                                             
         AIF   ('&CCSID' EQ '25467').END                                        
&REF     SETC  'HF'                                                             
         AIF   ('&CCSID' EQ '00892').END                                        
&REF     SETC  'HG'                                                             
         AIF   ('&CCSID' EQ '00893').END                                        
&REF     SETC  'HH'                                                             
         AIF   ('&CCSID' EQ '00895').END                                        
&REF     SETC  'HI'                                                             
         AIF   ('&CCSID' EQ '00896').END                                        
&REF     SETC  'HJ'                                                             
         AIF   ('&CCSID' EQ '04992').END                                        
&REF     SETC  'HK'                                                             
         AIF   ('&CCSID' EQ '00897').END                                        
&REF     SETC  'HL'                                                             
         AIF   ('&CCSID' EQ '04993').END                                        
&REF     SETC  'HM'                                                             
         AIF   ('&CCSID' EQ '09089').END                                        
&REF     SETC  'HN'                                                             
         AIF   ('&CCSID' EQ '13185').END                                        
&REF     SETC  'HO'                                                             
         AIF   ('&CCSID' EQ '25473').END                                        
&REF     SETC  'HP'                                                             
         AIF   ('&CCSID' EQ '33665').END                                        
&REF     SETC  'HQ'                                                             
         AIF   ('&CCSID' EQ '37761').END                                        
&REF     SETC  'HR'                                                             
         AIF   ('&CCSID' EQ '00899').END                                        
&REF     SETC  'HS'                                                             
         AIF   ('&CCSID' EQ '00901').END                                        
&REF     SETC  'HT'                                                             
         AIF   ('&CCSID' EQ '25477').END                                        
&REF     SETC  'HU'                                                             
         AIF   ('&CCSID' EQ '00902').END                                        
&REF     SETC  'HV'                                                             
         AIF   ('&CCSID' EQ '25478').END                                        
&REF     SETC  'HW'                                                             
         AIF   ('&CCSID' EQ '00903').END                                        
&REF     SETC  'HX'                                                             
         AIF   ('&CCSID' EQ '25479').END                                        
&REF     SETC  'HY'                                                             
         AIF   ('&CCSID' EQ '00904').END                                        
&REF     SETC  'HZ'                                                             
         AIF   ('&CCSID' EQ '25480').END                                        
&REF     SETC  'H0'                                                             
         AIF   ('&CCSID' EQ '00905').END                                        
&REF     SETC  'H1'                                                             
         AIF   ('&CCSID' EQ '00912').END                                        
&REF     SETC  'H2'                                                             
         AIF   ('&CCSID' EQ '25488').END                                        
&REF     SETC  'H3'                                                             
         AIF   ('&CCSID' EQ '00914').END                                        
&REF     SETC  'H4'                                                             
         AIF   ('&CCSID' EQ '00915').END                                        
&REF     SETC  'H5'                                                             
         AIF   ('&CCSID' EQ '25491').END                                        
&REF     SETC  'H6'                                                             
         AIF   ('&CCSID' EQ '00916').END                                        
&REF     SETC  'H7'                                                             
         AIF   ('&CCSID' EQ '05012').END                                        
&REF     SETC  'H8'                                                             
         AIF   ('&CCSID' EQ '00918').END                                        
&REF     SETC  'H9'                                                             
         AIF   ('&CCSID' EQ '05014').END                                        
&REF     SETC  'IA'                                                             
         AIF   ('&CCSID' EQ '00920').END                                        
&REF     SETC  'IB'                                                             
         AIF   ('&CCSID' EQ '00921').END                                        
&REF     SETC  'IC'                                                             
         AIF   ('&CCSID' EQ '25497').END                                        
&REF     SETC  'ID'                                                             
         AIF   ('&CCSID' EQ '00922').END                                        
&REF     SETC  'IE'                                                             
         AIF   ('&CCSID' EQ '25498').END                                        
&REF     SETC  'IF'                                                             
         AIF   ('&CCSID' EQ '00923').END                                        
&REF     SETC  'IG'                                                             
         AIF   ('&CCSID' EQ '00924').END                                        
&REF     SETC  'IH'                                                             
         AIF   ('&CCSID' EQ '00926').END                                        
&REF     SETC  'II'                                                             
         AIF   ('&CCSID' EQ '25502').END                                        
&REF     SETC  'IJ'                                                             
         AIF   ('&CCSID' EQ '00927').END                                        
&REF     SETC  'IK'                                                             
         AIF   ('&CCSID' EQ '05023').END                                        
&REF     SETC  'IL'                                                             
         AIF   ('&CCSID' EQ '25503').END                                        
&REF     SETC  'IM'                                                             
         AIF   ('&CCSID' EQ '00928').END                                        
&REF     SETC  'IN'                                                             
         AIF   ('&CCSID' EQ '25504').END                                        
&REF     SETC  'IO'                                                             
         AIF   ('&CCSID' EQ '00929').END                                        
&REF     SETC  'IP'                                                             
         AIF   ('&CCSID' EQ '25505').END                                        
&REF     SETC  'IQ'                                                             
         AIF   ('&CCSID' EQ '00930').END                                        
&REF     SETC  'IR'                                                             
         AIF   ('&CCSID' EQ '05026').END                                        
&REF     SETC  'IS'                                                             
         AIF   ('&CCSID' EQ '09122').END                                        
&REF     SETC  'IT'                                                             
         AIF   ('&CCSID' EQ '13218').END                                        
&REF     SETC  'IU'                                                             
         AIF   ('&CCSID' EQ '17314').END                                        
&REF     SETC  'IV'                                                             
         AIF   ('&CCSID' EQ '33698').END                                        
&REF     SETC  'IW'                                                             
         AIF   ('&CCSID' EQ '00931').END                                        
&REF     SETC  'IX'                                                             
         AIF   ('&CCSID' EQ '13219').END                                        
&REF     SETC  'IY'                                                             
         AIF   ('&CCSID' EQ '33699').END                                        
&REF     SETC  'IZ'                                                             
         AIF   ('&CCSID' EQ '00932').END                                        
&REF     SETC  'I0'                                                             
         AIF   ('&CCSID' EQ '05028').END                                        
&REF     SETC  'I1'                                                             
         AIF   ('&CCSID' EQ '09124').END                                        
&REF     SETC  'I2'                                                             
         AIF   ('&CCSID' EQ '25508').END                                        
&REF     SETC  'I3'                                                             
         AIF   ('&CCSID' EQ '33700').END                                        
&REF     SETC  'I4'                                                             
         AIF   ('&CCSID' EQ '37796').END                                        
&REF     SETC  'I5'                                                             
         AIF   ('&CCSID' EQ '00933').END                                        
&REF     SETC  'I6'                                                             
         AIF   ('&CCSID' EQ '05029').END                                        
&REF     SETC  'I7'                                                             
         AIF   ('&CCSID' EQ '09125').END                                        
&REF     SETC  'I8'                                                             
         AIF   ('&CCSID' EQ '13221').END                                        
&REF     SETC  'I9'                                                             
         AIF   ('&CCSID' EQ '17317').END                                        
&REF     SETC  'JA'                                                             
         AIF   ('&CCSID' EQ '00934').END                                        
&REF     SETC  'JB'                                                             
         AIF   ('&CCSID' EQ '25510').END                                        
&REF     SETC  'JC'                                                             
         AIF   ('&CCSID' EQ '00935').END                                        
&REF     SETC  'JD'                                                             
         AIF   ('&CCSID' EQ '05031').END                                        
&REF     SETC  'JE'                                                             
         AIF   ('&CCSID' EQ '09127').END                                        
&REF     SETC  'JF'                                                             
         AIF   ('&CCSID' EQ '13223').END                                        
&REF     SETC  'JG'                                                             
         AIF   ('&CCSID' EQ '00936').END                                        
&REF     SETC  'JH'                                                             
         AIF   ('&CCSID' EQ '25512').END                                        
&REF     SETC  'JI'                                                             
         AIF   ('&CCSID' EQ '00937').END                                        
&REF     SETC  'JJ'                                                             
         AIF   ('&CCSID' EQ '05033').END                                        
&REF     SETC  'JK'                                                             
         AIF   ('&CCSID' EQ '00938').END                                        
&REF     SETC  'JL'                                                             
         AIF   ('&CCSID' EQ '25514').END                                        
&REF     SETC  'JM'                                                             
         AIF   ('&CCSID' EQ '00939').END                                        
&REF     SETC  'JN'                                                             
         AIF   ('&CCSID' EQ '05035').END                                        
&REF     SETC  'JO'                                                             
         AIF   ('&CCSID' EQ '09131').END                                        
&REF     SETC  'JP'                                                             
         AIF   ('&CCSID' EQ '00941').END                                        
&REF     SETC  'JQ'                                                             
         AIF   ('&CCSID' EQ '05037').END                                        
&REF     SETC  'JR'                                                             
         AIF   ('&CCSID' EQ '09133').END                                        
&REF     SETC  'JS'                                                             
         AIF   ('&CCSID' EQ '13229').END                                        
&REF     SETC  'JT'                                                             
         AIF   ('&CCSID' EQ '17325').END                                        
&REF     SETC  'JU'                                                             
         AIF   ('&CCSID' EQ '00942').END                                        
&REF     SETC  'JV'                                                             
         AIF   ('&CCSID' EQ '05038').END                                        
&REF     SETC  'JW'                                                             
         AIF   ('&CCSID' EQ '25518').END                                        
&REF     SETC  'JX'                                                             
         AIF   ('&CCSID' EQ '29614').END                                        
&REF     SETC  'JY'                                                             
         AIF   ('&CCSID' EQ '00943').END                                        
&REF     SETC  'JZ'                                                             
         AIF   ('&CCSID' EQ '05039').END                                        
&REF     SETC  'J0'                                                             
         AIF   ('&CCSID' EQ '09135').END                                        
.*                              For UTF-32, use entry (J1) because @F2A         
.*                              an existing gap.                   @F2A         
&REF     SETC  'J1'                                                @F2A         
         AIF   ('&CCSID' EQ '01232').END                           @F2A         
&REF     SETC  'J2'                                                             
         AIF   ('&CCSID' EQ '13231').END                                        
&REF     SETC  'J3'                                                             
         AIF   ('&CCSID' EQ '00944').END                                        
&REF     SETC  'J4'                                                             
         AIF   ('&CCSID' EQ '25520').END                                        
&REF     SETC  'J5'                                                             
         AIF   ('&CCSID' EQ '29616').END                                        
&REF     SETC  'J6'                                                             
         AIF   ('&CCSID' EQ '00946').END                                        
&REF     SETC  'J7'                                                             
         AIF   ('&CCSID' EQ '25522').END                                        
&REF     SETC  'J8'                                                             
         AIF   ('&CCSID' EQ '29618').END                                        
&REF     SETC  'J9'                                                             
         AIF   ('&CCSID' EQ '00947').END                                        
&REF     SETC  'KA'                                                             
         AIF   ('&CCSID' EQ '05043').END                                        
&REF     SETC  'KB'                                                             
         AIF   ('&CCSID' EQ '09139').END                                        
&REF     SETC  'KC'                                                             
         AIF   ('&CCSID' EQ '13235').END                                        
&REF     SETC  'KD'                                                             
         AIF   ('&CCSID' EQ '17331').END                                        
&REF     SETC  'KE'                                                             
         AIF   ('&CCSID' EQ '21427').END                                        
&REF     SETC  'KF'                                                             
         AIF   ('&CCSID' EQ '00948').END                                        
&REF     SETC  'KG'                                                             
         AIF   ('&CCSID' EQ '25524').END                                        
&REF     SETC  'KH'                                                             
         AIF   ('&CCSID' EQ '29620').END                                        
&REF     SETC  'KI'                                                             
         AIF   ('&CCSID' EQ '00949').END                                        
&REF     SETC  'KJ'                                                             
         AIF   ('&CCSID' EQ '05045').END                                        
&REF     SETC  'KK'                                                             
         AIF   ('&CCSID' EQ '25525').END                                        
&REF     SETC  'KL'                                                             
         AIF   ('&CCSID' EQ '29621').END                                        
&REF     SETC  'KM'                                                             
         AIF   ('&CCSID' EQ '33717').END                                        
&REF     SETC  'KN'                                                             
         AIF   ('&CCSID' EQ '37813').END                                        
&REF     SETC  'KO'                                                             
         AIF   ('&CCSID' EQ '00950').END                                        
&REF     SETC  'KP'                                                             
         AIF   ('&CCSID' EQ '05046').END                                        
&REF     SETC  'KQ'                                                             
         AIF   ('&CCSID' EQ '09142').END                                        
&REF     SETC  'KR'                                                             
         AIF   ('&CCSID' EQ '13238').END                                        
&REF     SETC  'KS'                                                             
         AIF   ('&CCSID' EQ '00951').END                                        
&REF     SETC  'KT'                                                             
         AIF   ('&CCSID' EQ '05047').END                                        
&REF     SETC  'KU'                                                             
         AIF   ('&CCSID' EQ '25527').END                                        
&REF     SETC  'KV'                                                             
         AIF   ('&CCSID' EQ '29623').END                                        
&REF     SETC  'KW'                                                             
         AIF   ('&CCSID' EQ '00952').END                                        
&REF     SETC  'KX'                                                             
         AIF   ('&CCSID' EQ '05048').END                                        
&REF     SETC  'KY'                                                             
         AIF   ('&CCSID' EQ '00953').END                                        
&REF     SETC  'KZ'                                                             
         AIF   ('&CCSID' EQ '05049').END                                        
&REF     SETC  'K0'                                                             
         AIF   ('&CCSID' EQ '09145').END                                        
&REF     SETC  'K1'                                                             
         AIF   ('&CCSID' EQ '00954').END                                        
&REF     SETC  'K2'                                                             
         AIF   ('&CCSID' EQ '05050').END                                        
&REF     SETC  'K3'                                                             
         AIF   ('&CCSID' EQ '09146').END                                        
&REF     SETC  'K4'                                                             
         AIF   ('&CCSID' EQ '13242').END                                        
&REF     SETC  'K5'                                                             
         AIF   ('&CCSID' EQ '33722').END                                        
&REF     SETC  'K6'                                                             
         AIF   ('&CCSID' EQ '00955').END                                        
&REF     SETC  'K7'                                                             
         AIF   ('&CCSID' EQ '00956').END                                        
&REF     SETC  'K8'                                                             
         AIF   ('&CCSID' EQ '05052').END                                        
&REF     SETC  'K9'                                                             
         AIF   ('&CCSID' EQ '00957').END                                        
&REF     SETC  'LA'                                                             
         AIF   ('&CCSID' EQ '05053').END                                        
&REF     SETC  'LB'                                                             
         AIF   ('&CCSID' EQ '00958').END                                        
&REF     SETC  'LC'                                                             
         AIF   ('&CCSID' EQ '05054').END                                        
&REF     SETC  'LD'                                                             
         AIF   ('&CCSID' EQ '00959').END                                        
&REF     SETC  'LE'                                                             
         AIF   ('&CCSID' EQ '05055').END                                        
&REF     SETC  'LF'                                                             
         AIF   ('&CCSID' EQ '00960').END                                        
&REF     SETC  'LG'                                                             
         AIF   ('&CCSID' EQ '00961').END                                        
&REF     SETC  'LH'                                                             
         AIF   ('&CCSID' EQ '05057').END                                        
&REF     SETC  'LI'                                                             
         AIF   ('&CCSID' EQ '00963').END                                        
&REF     SETC  'LJ'                                                             
         AIF   ('&CCSID' EQ '00964').END                                        
&REF     SETC  'LK'                                                             
         AIF   ('&CCSID' EQ '05060').END                                        
&REF     SETC  'LL'                                                             
         AIF   ('&CCSID' EQ '00965').END                                        
&REF     SETC  'LM'                                                             
         AIF   ('&CCSID' EQ '05061').END                                        
&REF     SETC  'LN'                                                             
         AIF   ('&CCSID' EQ '00966').END                                        
&REF     SETC  'LO'                                                             
         AIF   ('&CCSID' EQ '00970').END                                        
&REF     SETC  'LP'                                                             
         AIF   ('&CCSID' EQ '05066').END                                        
&REF     SETC  'LQ'                                                             
         AIF   ('&CCSID' EQ '17354').END                                        
&REF     SETC  'LR'                                                             
         AIF   ('&CCSID' EQ '21450').END                                        
&REF     SETC  'LS'                                                             
         AIF   ('&CCSID' EQ '25546').END                                        
&REF     SETC  'LT'                                                             
         AIF   ('&CCSID' EQ '00971').END                                        
&REF     SETC  'LU'                                                             
         AIF   ('&CCSID' EQ '05067').END                                        
&REF     SETC  'LV'                                                             
         AIF   ('&CCSID' EQ '01002').END                                        
&REF     SETC  'LW'                                                             
         AIF   ('&CCSID' EQ '01004').END                                        
&REF     SETC  'LX'                                                             
         AIF   ('&CCSID' EQ '05100').END                                        
&REF     SETC  'LY'                                                             
         AIF   ('&CCSID' EQ '25580').END                                        
&REF     SETC  'LZ'                                                             
         AIF   ('&CCSID' EQ '01006').END                                        
&REF     SETC  'L0'                                                             
         AIF   ('&CCSID' EQ '01008').END                                        
&REF     SETC  'L1'                                                             
         AIF   ('&CCSID' EQ '05104').END                                        
&REF     SETC  'L2'                                                             
         AIF   ('&CCSID' EQ '01009').END                                        
&REF     SETC  'L3'                                                             
         AIF   ('&CCSID' EQ '01010').END                                        
&REF     SETC  'L4'                                                             
         AIF   ('&CCSID' EQ '01011').END                                        
&REF     SETC  'L5'                                                             
         AIF   ('&CCSID' EQ '01012').END                                        
&REF     SETC  'L6'                                                             
         AIF   ('&CCSID' EQ '01013').END                                        
&REF     SETC  'L7'                                                             
         AIF   ('&CCSID' EQ '01014').END                                        
&REF     SETC  'L8'                                                             
         AIF   ('&CCSID' EQ '01015').END                                        
&REF     SETC  'L9'                                                             
         AIF   ('&CCSID' EQ '01016').END                                        
&REF     SETC  'MA'                                                             
         AIF   ('&CCSID' EQ '01017').END                                        
&REF     SETC  'MB'                                                             
         AIF   ('&CCSID' EQ '01018').END                                        
&REF     SETC  'MC'                                                             
         AIF   ('&CCSID' EQ '01019').END                                        
&REF     SETC  'MD'                                                             
         AIF   ('&CCSID' EQ '01020').END                                        
&REF     SETC  'ME'                                                             
         AIF   ('&CCSID' EQ '01021').END                                        
&REF     SETC  'MF'                                                             
         AIF   ('&CCSID' EQ '01023').END                                        
&REF     SETC  'MG'                                                             
         AIF   ('&CCSID' EQ '01025').END                                        
&REF     SETC  'MH'                                                             
         AIF   ('&CCSID' EQ '01026').END                                        
&REF     SETC  'MI'                                                             
         AIF   ('&CCSID' EQ '01027').END                                        
&REF     SETC  'MJ'                                                             
         AIF   ('&CCSID' EQ '05123').END                                        
&REF     SETC  'MK'                                                             
         AIF   ('&CCSID' EQ '01040').END                                        
&REF     SETC  'ML'                                                             
         AIF   ('&CCSID' EQ '25616').END                                        
&REF     SETC  'MM'                                                             
         AIF   ('&CCSID' EQ '29712').END                                        
&REF     SETC  'MN'                                                             
         AIF   ('&CCSID' EQ '01041').END                                        
&REF     SETC  'MO'                                                             
         AIF   ('&CCSID' EQ '05137').END                                        
&REF     SETC  'MP'                                                             
         AIF   ('&CCSID' EQ '25617').END                                        
&REF     SETC  'MQ'                                                             
         AIF   ('&CCSID' EQ '29713').END                                        
&REF     SETC  'MR'                                                             
         AIF   ('&CCSID' EQ '01042').END                                        
&REF     SETC  'MS'                                                             
         AIF   ('&CCSID' EQ '25618').END                                        
&REF     SETC  'MT'                                                             
         AIF   ('&CCSID' EQ '29714').END                                        
&REF     SETC  'MU'                                                             
         AIF   ('&CCSID' EQ '01043').END                                        
&REF     SETC  'MV'                                                             
         AIF   ('&CCSID' EQ '25619').END                                        
&REF     SETC  'MW'                                                             
         AIF   ('&CCSID' EQ '29715').END                                        
&REF     SETC  'MX'                                                             
         AIF   ('&CCSID' EQ '01046').END                                        
&REF     SETC  'MY'                                                             
         AIF   ('&CCSID' EQ '05142').END                                        
&REF     SETC  'MZ'                                                             
         AIF   ('&CCSID' EQ '09238').END                                        
&REF     SETC  'M0'                                                             
         AIF   ('&CCSID' EQ '01047').END                                        
&REF     SETC  'M1'                                                             
         AIF   ('&CCSID' EQ '05143').END                                        
&REF     SETC  'M2'                                                             
         AIF   ('&CCSID' EQ '01051').END                                        
&REF     SETC  'M3'                                                             
         AIF   ('&CCSID' EQ '01088').END                                        
&REF     SETC  'M4'                                                             
         AIF   ('&CCSID' EQ '25664').END                                        
&REF     SETC  'M5'                                                             
         AIF   ('&CCSID' EQ '29760').END                                        
&REF     SETC  'M6'                                                             
         AIF   ('&CCSID' EQ '01089').END                                        
&REF     SETC  'M7'                                                             
         AIF   ('&CCSID' EQ '01097').END                                        
&REF     SETC  'M8'                                                             
         AIF   ('&CCSID' EQ '01098').END                                        
&REF     SETC  'M9'                                                             
         AIF   ('&CCSID' EQ '01100').END                                        
&REF     SETC  'NA'                                                             
         AIF   ('&CCSID' EQ '01101').END                                        
&REF     SETC  'NB'                                                             
         AIF   ('&CCSID' EQ '01102').END                                        
&REF     SETC  'NC'                                                             
         AIF   ('&CCSID' EQ '01103').END                                        
&REF     SETC  'ND'                                                             
         AIF   ('&CCSID' EQ '01104').END                                        
&REF     SETC  'NE'                                                             
         AIF   ('&CCSID' EQ '01105').END                                        
&REF     SETC  'NF'                                                             
         AIF   ('&CCSID' EQ '01106').END                                        
&REF     SETC  'NG'                                                             
         AIF   ('&CCSID' EQ '01107').END                                        
&REF     SETC  'NH'                                                             
         AIF   ('&CCSID' EQ '01112').END                                        
&REF     SETC  'NI'                                                             
         AIF   ('&CCSID' EQ '01114').END                                        
&REF     SETC  'NJ'                                                             
         AIF   ('&CCSID' EQ '05210').END                                        
&REF     SETC  'NK'                                                             
         AIF   ('&CCSID' EQ '25690').END                                        
&REF     SETC  'NL'                                                             
         AIF   ('&CCSID' EQ '29786').END                                        
&REF     SETC  'NM'                                                             
         AIF   ('&CCSID' EQ '01115').END                                        
&REF     SETC  'NN'                                                             
         AIF   ('&CCSID' EQ '05211').END                                        
&REF     SETC  'NO'                                                             
         AIF   ('&CCSID' EQ '25691').END                                        
&REF     SETC  'NP'                                                             
         AIF   ('&CCSID' EQ '01122').END                                        
&REF     SETC  'NQ'                                                             
         AIF   ('&CCSID' EQ '01123').END                                        
&REF     SETC  'NR'                                                             
         AIF   ('&CCSID' EQ '01124').END                                        
&REF     SETC  'NS'                                                             
         AIF   ('&CCSID' EQ '01125').END                                        
&REF     SETC  'NT'                                                             
         AIF   ('&CCSID' EQ '01126').END                                        
&REF     SETC  'NU'                                                             
         AIF   ('&CCSID' EQ '05222').END                                        
&REF     SETC  'NV'                                                             
         AIF   ('&CCSID' EQ '25702').END                                        
&REF     SETC  'NW'                                                             
         AIF   ('&CCSID' EQ '01127').END                                        
&REF     SETC  'NX'                                                             
         AIF   ('&CCSID' EQ '25703').END                                        
&REF     SETC  'NY'                                                             
         AIF   ('&CCSID' EQ '01129').END                                        
&REF     SETC  'NZ'                                                             
         AIF   ('&CCSID' EQ '01130').END                                        
&REF     SETC  'N0'                                                             
         AIF   ('&CCSID' EQ '01131').END                                        
&REF     SETC  'N1'                                                             
         AIF   ('&CCSID' EQ '01132').END                                        
&REF     SETC  'N2'                                                             
         AIF   ('&CCSID' EQ '01133').END                                        
&REF     SETC  'N3'                                                             
         AIF   ('&CCSID' EQ '01137').END                                        
&REF     SETC  'N4'                                                             
         AIF   ('&CCSID' EQ '01139').END                                        
&REF     SETC  'N5'                                                             
         AIF   ('&CCSID' EQ '01140').END                                        
&REF     SETC  'N6'                                                             
         AIF   ('&CCSID' EQ '01141').END                                        
&REF     SETC  'N7'                                                             
         AIF   ('&CCSID' EQ '01142').END                                        
&REF     SETC  'N8'                                                             
         AIF   ('&CCSID' EQ '01143').END                                        
&REF     SETC  'N9'                                                             
         AIF   ('&CCSID' EQ '01144').END                                        
&REF     SETC  'OA'                                                             
         AIF   ('&CCSID' EQ '01145').END                                        
&REF     SETC  'OB'                                                             
         AIF   ('&CCSID' EQ '01146').END                                        
&REF     SETC  'OC'                                                             
         AIF   ('&CCSID' EQ '01147').END                                        
&REF     SETC  'OD'                                                             
         AIF   ('&CCSID' EQ '01148').END                                        
&REF     SETC  'OE'                                                             
         AIF   ('&CCSID' EQ '01149').END                                        
&REF     SETC  'OF'                                                             
         AIF   ('&CCSID' EQ '01153').END                                        
&REF     SETC  'OG'                                                             
         AIF   ('&CCSID' EQ '01154').END                                        
&REF     SETC  'OH'                                                             
         AIF   ('&CCSID' EQ '01155').END                                        
&REF     SETC  'OI'                                                             
         AIF   ('&CCSID' EQ '01156').END                                        
&REF     SETC  'OJ'                                                             
         AIF   ('&CCSID' EQ '01157').END                                        
&REF     SETC  'OK'                                                             
         AIF   ('&CCSID' EQ '01158').END                                        
&REF     SETC  'OL'                                                             
         AIF   ('&CCSID' EQ '01159').END                                        
&REF     SETC  'OM'                                                             
         AIF   ('&CCSID' EQ '01160').END                                        
&REF     SETC  'ON'                                                             
         AIF   ('&CCSID' EQ '01161').END                                        
&REF     SETC  'OO'                                                             
         AIF   ('&CCSID' EQ '01162').END                                        
&REF     SETC  'OP'                                                             
         AIF   ('&CCSID' EQ '01163').END                                        
&REF     SETC  'OQ'                                                             
         AIF   ('&CCSID' EQ '01164').END                                        
&REF     SETC  'OR'                                                             
         AIF   ('&CCSID' EQ '53685').END                                        
&REF     SETC  'OS'                                                             
         AIF   ('&CCSID' EQ '04904').END                                        
&REF     SETC  'OT'                                                             
         AIF   ('&CCSID' EQ '04944').END                                        
&REF     SETC  'OU'                                                             
         AIF   ('&CCSID' EQ '04945').END                                        
&REF     SETC  'OV'                                                             
         AIF   ('&CCSID' EQ '09042').END                                        
&REF     SETC  'OW'                                                             
         AIF   ('&CCSID' EQ '13143').END                                        
&REF     SETC  'OX'                                                             
         AIF   ('&CCSID' EQ '17240').END                                        
&REF     SETC  'OY'                                                             
         AIF   ('&CCSID' EQ '04954').END                                        
&REF     SETC  'OZ'                                                             
         AIF   ('&CCSID' EQ '04955').END                                        
&REF     SETC  'O0'                                                             
         AIF   ('&CCSID' EQ '04956').END                                        
&REF     SETC  'O1'                                                             
         AIF   ('&CCSID' EQ '04957').END                                        
&REF     SETC  'O2'                                                             
         AIF   ('&CCSID' EQ '04958').END                                        
&REF     SETC  'O3'                                                             
         AIF   ('&CCSID' EQ '04959').END                                        
&REF     SETC  'O4'                                                             
         AIF   ('&CCSID' EQ '04961').END                                        
&REF     SETC  'O5'                                                             
         AIF   ('&CCSID' EQ '04962').END                                        
&REF     SETC  'O6'                                                             
         AIF   ('&CCSID' EQ '04963').END                                        
&REF     SETC  'O7'                                                             
         AIF   ('&CCSID' EQ '13156').END                                        
&REF     SETC  'O8'                                                             
         AIF   ('&CCSID' EQ '09064').END                                        
&REF     SETC  'O9'                                                             
         AIF   ('&CCSID' EQ '13162').END                                        
&REF     SETC  'PA'                                                             
         AIF   ('&CCSID' EQ '09306').END                                        
&REF     SETC  'PB'                                                             
         AIF   ('&CCSID' EQ '13140').END                                        
&REF     SETC  'PC'                                                             
         AIF   ('&CCSID' EQ '13145').END                                        
&REF     SETC  'PD'                                                             
         AIF   ('&CCSID' EQ '13157').END                                        
&REF     SETC  'PE'                                                             
         AIF   ('&CCSID' EQ '21344').END                                        
&REF     SETC  'PF'                                                             
         AIF   ('&CCSID' EQ '01200').END                                        
&REF     SETC  'PG'                                                             
         AIF   ('&CCSID' EQ '13488').END                                        
&REF     SETC  'PH'                                                             
         AIF   ('&CCSID' EQ '17584').END                                        
&REF     SETC  'PI'                                                             
         AIF   ('&CCSID' EQ '01201').END                                        
&REF     SETC  'PJ'                                                             
         AIF   ('&CCSID' EQ '05297').END                                        
&REF     SETC  'PK'                                                             
         AIF   ('&CCSID' EQ '01208').END                                        
&REF     SETC  'PL'                                                             
         AIF   ('&CCSID' EQ '05304').END                                        
&REF     SETC  'PM'                                                             
         AIF   ('&CCSID' EQ '01209').END                                        
&REF     SETC  'PN'                                                             
         AIF   ('&CCSID' EQ '05305').END                                        
&REF     SETC  'PO'                                                             
         AIF   ('&CCSID' EQ '01250').END                                        
&REF     SETC  'PP'                                                             
         AIF   ('&CCSID' EQ '05346').END                                        
&REF     SETC  'PQ'                                                             
         AIF   ('&CCSID' EQ '01251').END                                        
&REF     SETC  'PR'                                                             
         AIF   ('&CCSID' EQ '05347').END                                        
&REF     SETC  'PS'                                                             
         AIF   ('&CCSID' EQ '01252').END                                        
&REF     SETC  'PT'                                                             
         AIF   ('&CCSID' EQ '05348').END                                        
&REF     SETC  'PU'                                                             
         AIF   ('&CCSID' EQ '01253').END                                        
&REF     SETC  'PV'                                                             
         AIF   ('&CCSID' EQ '05349').END                                        
&REF     SETC  'PW'                                                             
         AIF   ('&CCSID' EQ '01254').END                                        
&REF     SETC  'PX'                                                             
         AIF   ('&CCSID' EQ '05350').END                                        
&REF     SETC  'PY'                                                             
         AIF   ('&CCSID' EQ '01255').END                                        
&REF     SETC  'PZ'                                                             
         AIF   ('&CCSID' EQ '05351').END                                        
&REF     SETC  'P0'                                                             
         AIF   ('&CCSID' EQ '01256').END                                        
&REF     SETC  'P1'                                                             
         AIF   ('&CCSID' EQ '05352').END                                        
&REF     SETC  'P2'                                                             
         AIF   ('&CCSID' EQ '01257').END                                        
&REF     SETC  'P3'                                                             
         AIF   ('&CCSID' EQ '05353').END                                        
&REF     SETC  'P4'                                                             
         AIF   ('&CCSID' EQ '01258').END                                        
&REF     SETC  'P5'                                                             
         AIF   ('&CCSID' EQ '05354').END                                        
&REF     SETC  'P6'                                                             
         AIF   ('&CCSID' EQ '01275').END                                        
&REF     SETC  'P7'                                                             
         AIF   ('&CCSID' EQ '01276').END                                        
&REF     SETC  'P8'                                                             
         AIF   ('&CCSID' EQ '01277').END                                        
&REF     SETC  'P9'                                                             
         AIF   ('&CCSID' EQ '01279').END                                        
&REF     SETC  'QA'                                                             
         AIF   ('&CCSID' EQ '01280').END                                        
&REF     SETC  'QB'                                                             
         AIF   ('&CCSID' EQ '01281').END                                        
&REF     SETC  'QC'                                                             
         AIF   ('&CCSID' EQ '01282').END                                        
&REF     SETC  'QD'                                                             
         AIF   ('&CCSID' EQ '01283').END                                        
&REF     SETC  'QE'                                                             
         AIF   ('&CCSID' EQ '01284').END                                        
&REF     SETC  'QF'                                                             
         AIF   ('&CCSID' EQ '01285').END                                        
&REF     SETC  'QG'                                                             
         AIF   ('&CCSID' EQ '01286').END                                        
&REF     SETC  'QH'                                                             
         AIF   ('&CCSID' EQ '01350').END                                        
&REF     SETC  'QI'                                                             
         AIF   ('&CCSID' EQ '01351').END                                        
&REF     SETC  'QJ'                                                             
         AIF   ('&CCSID' EQ '01362').END                                        
&REF     SETC  'QK'                                                             
         AIF   ('&CCSID' EQ '05458').END                                        
&REF     SETC  'QL'                                                             
         AIF   ('&CCSID' EQ '09554').END                                        
&REF     SETC  'QM'                                                             
         AIF   ('&CCSID' EQ '13650').END                                        
&REF     SETC  'QN'                                                             
         AIF   ('&CCSID' EQ '01363').END                                        
&REF     SETC  'QO'                                                             
         AIF   ('&CCSID' EQ '05459').END                                        
&REF     SETC  'QP'                                                             
         AIF   ('&CCSID' EQ '09555').END                                        
&REF     SETC  'QQ'                                                             
         AIF   ('&CCSID' EQ '13651').END                                        
&REF     SETC  'QR'                                                             
         AIF   ('&CCSID' EQ '01364').END                                        
&REF     SETC  'QS'                                                             
         AIF   ('&CCSID' EQ '05460').END                                        
&REF     SETC  'QT'                                                             
         AIF   ('&CCSID' EQ '01370').END                                        
&REF     SETC  'QU'                                                             
         AIF   ('&CCSID' EQ '01371').END                                        
&REF     SETC  'QV'                                                             
         AIF   ('&CCSID' EQ '01380').END                                        
&REF     SETC  'QW'                                                             
         AIF   ('&CCSID' EQ '05476').END                                        
&REF     SETC  'QX'                                                             
         AIF   ('&CCSID' EQ '09572').END                                        
&REF     SETC  'QY'                                                             
         AIF   ('&CCSID' EQ '01381').END                                        
&REF     SETC  'QZ'                                                             
         AIF   ('&CCSID' EQ '05477').END                                        
&REF     SETC  'Q0'                                                             
         AIF   ('&CCSID' EQ '01382').END                                        
&REF     SETC  'Q1'                                                             
         AIF   ('&CCSID' EQ '05478').END                                        
&REF     SETC  'Q2'                                                             
         AIF   ('&CCSID' EQ '01383').END                                        
&REF     SETC  'Q3'                                                             
         AIF   ('&CCSID' EQ '05479').END                                        
&REF     SETC  'Q4'                                                             
         AIF   ('&CCSID' EQ '09575').END                                        
&REF     SETC  'Q5'                                                             
         AIF   ('&CCSID' EQ '13671').END                                        
&REF     SETC  'Q6'                                                             
         AIF   ('&CCSID' EQ '01385').END                                        
&REF     SETC  'Q7'                                                             
         AIF   ('&CCSID' EQ '05481').END                                        
&REF     SETC  'Q8'                                                             
         AIF   ('&CCSID' EQ '01386').END                                        
&REF     SETC  'Q9'                                                             
         AIF   ('&CCSID' EQ '05482').END                                        
&REF     SETC  'RA'                                                             
         AIF   ('&CCSID' EQ '01388').END                                        
&REF     SETC  'RB'                                                             
         AIF   ('&CCSID' EQ '05484').END                                        
&REF     SETC  'RC'                                                             
         AIF   ('&CCSID' EQ '01390').END                                        
&REF     SETC  'RD'                                                             
         AIF   ('&CCSID' EQ '01399').END                                        
&REF     SETC  'RE'                                                             
         AIF   ('&CCSID' EQ '57345').END                                        
&REF     SETC  'RF'                                                             
         AIF   ('&CCSID' EQ '61952').END                                        
&REF     SETC  'RG'                                                             
         AIF   ('&CCSID' EQ '61953').END                                        
&REF     SETC  'RH'                                                             
         AIF   ('&CCSID' EQ '61954').END                                        
&REF     SETC  'RI'                                                             
         AIF   ('&CCSID' EQ '62208').END                                        
&REF     SETC  'RJ'                                                             
         AIF   ('&CCSID' EQ '62209').END                                        
&REF     SETC  'RK'                                                             
         AIF   ('&CCSID' EQ '62210').END                                        
&REF     SETC  'RL'                                                             
         AIF   ('&CCSID' EQ '62211').END                                        
&REF     SETC  'RM'                                                             
         AIF   ('&CCSID' EQ '62212').END                                        
&REF     SETC  'RN'                                                             
         AIF   ('&CCSID' EQ '62213').END                                        
&REF     SETC  'RO'                                                             
         AIF   ('&CCSID' EQ '62214').END                                        
&REF     SETC  'RP'                                                             
         AIF   ('&CCSID' EQ '62215').END                                        
&REF     SETC  'RQ'                                                             
         AIF   ('&CCSID' EQ '62216').END                                        
&REF     SETC  'RR'                                                             
         AIF   ('&CCSID' EQ '62217').END                                        
&REF     SETC  'RS'                                                             
         AIF   ('&CCSID' EQ '62218').END                                        
&REF     SETC  'RT'                                                             
         AIF   ('&CCSID' EQ '62219').END                                        
&REF     SETC  'RU'                                                             
         AIF   ('&CCSID' EQ '62220').END                                        
&REF     SETC  'RV'                                                             
         AIF   ('&CCSID' EQ '62221').END                                        
&REF     SETC  'RW'                                                             
         AIF   ('&CCSID' EQ '62222').END                                        
&REF     SETC  'RX'                                                             
         AIF   ('&CCSID' EQ '62223').END                                        
&REF     SETC  'RY'                                                             
         AIF   ('&CCSID' EQ '62224').END                                        
&REF     SETC  'RZ'                                                             
         AIF   ('&CCSID' EQ '62225').END                                        
&REF     SETC  'R0'                                                             
         AIF   ('&CCSID' EQ '62226').END                                        
&REF     SETC  'R1'                                                             
         AIF   ('&CCSID' EQ '62227').END                                        
&REF     SETC  'R2'                                                             
         AIF   ('&CCSID' EQ '62228').END                                        
&REF     SETC  'R3'                                                             
         AIF   ('&CCSID' EQ '62229').END                                        
&REF     SETC  'R4'                                                             
         AIF   ('&CCSID' EQ '62230').END                                        
&REF     SETC  'R5'                                                             
         AIF   ('&CCSID' EQ '62231').END                                        
&REF     SETC  'R6'                                                             
         AIF   ('&CCSID' EQ '62232').END                                        
&REF     SETC  'R7'                                                             
         AIF   ('&CCSID' EQ '62233').END                                        
&REF     SETC  'R8'                                                             
         AIF   ('&CCSID' EQ '62234').END                                        
&REF     SETC  'R9'                                                             
         AIF   ('&CCSID' EQ '62235').END                                        
&REF     SETC  'SA'                                                             
         AIF   ('&CCSID' EQ '62236').END                                        
&REF     SETC  'SB'                                                             
         AIF   ('&CCSID' EQ '62237').END                                        
&REF     SETC  'SC'                                                             
         AIF   ('&CCSID' EQ '62238').END                                        
&REF     SETC  'SD'                                                             
         AIF   ('&CCSID' EQ '62239').END                                        
&REF     SETC  'SE'                                                             
         AIF   ('&CCSID' EQ '62240').END                                        
&REF     SETC  'SF'                                                             
         AIF   ('&CCSID' EQ '62241').END                                        
&REF     SETC  'SG'                                                             
         AIF   ('&CCSID' EQ '62242').END                                        
&REF     SETC  'SH'                                                             
         AIF   ('&CCSID' EQ '62243').END                                        
&REF     SETC  'SI'                                                             
         AIF   ('&CCSID' EQ '62244').END                                        
&REF     SETC  'SJ'                                                             
         AIF   ('&CCSID' EQ '62245').END                                        
&REF     SETC  'SK'                                                             
         AIF   ('&CCSID' EQ '62246').END                                        
&REF     SETC  'SL'                                                             
         AIF   ('&CCSID' EQ '62247').END                                        
&REF     SETC  'SM'                                                             
         AIF   ('&CCSID' EQ '62248').END                                        
&REF     SETC  'SN'                                                             
         AIF   ('&CCSID' EQ '62249').END                                        
&REF     SETC  'SO'                                                             
         AIF   ('&CCSID' EQ '62250').END                                        
&REF     SETC  'SP'                                                             
         AIF   ('&CCSID' EQ '65024').END                                        
&REF     SETC  'SQ'                                                             
         AIF   ('&CCSID' EQ '65025').END                                        
&REF     SETC  'SR'                                                             
         AIF   ('&CCSID' EQ '00425').END                                        
&REF     SETC  'SS'                                                             
         AIF   ('&CCSID' EQ '05056').END                                        
&REF     SETC  'ST'                                                             
         AIF   ('&CCSID' EQ '03122').END                                        
&REF     SETC  'SU'                                                             
         AIF   ('&CCSID' EQ '09148').END                                        
&REF     SETC  'SV'                                                             
         AIF   ('&CCSID' EQ '01165').END                                        
&REF     SETC  'SW'                                                             
         AIF   ('&CCSID' EQ '12578').END                                        
&REF     SETC  'SX'                                                             
         AIF   ('&CCSID' EQ '01287').END                                        
&REF     SETC  'SY'                                                             
         AIF   ('&CCSID' EQ '01288').END                                        
&REF     SETC  'SZ'                                                             
         AIF   ('&CCSID' EQ '00913').END                                        
&REF     SETC  'S0'                                                             
         AIF   ('&CCSID' EQ '09088').END                                        
&REF     SETC  'S1'                                                             
         AIF   ('&CCSID' EQ '09144').END                                        
&REF     SETC  'S2'                                                             
         AIF   ('&CCSID' EQ '09163').END                                        
&REF     SETC  'S3'                                                             
         AIF   ('&CCSID' EQ '13241').END                                        
&REF     SETC  'S4'                                                             
         AIF   ('&CCSID' EQ '17337').END                                        
&REF     SETC  'S5'                                                             
         AIF   ('&CCSID' EQ '13184').END                                        
&REF     SETC  'S6'                                                             
         AIF   ('&CCSID' EQ '13240').END                                        
&REF     SETC  'S7'                                                             
         AIF   ('&CCSID' EQ '21433').END                                        
&REF     SETC  'S8'                                                             
         AIF   ('&CCSID' EQ '13259').END                                        
&REF     SETC  'S9'                                                             
         AIF   ('&CCSID' EQ '09574').END                                        
&REF     SETC  'TA'                                                             
         AIF   ('&CCSID' EQ '17336').END                                        
&REF     SETC  'TB'                                             D1A             
         AIF   ('&CCSID' EQ '05488').END                        D1A             
&REF     SETC  'TC'                                             D1A             
         AIF   ('&CCSID' EQ '05487').END                        D1A             
&REF     SETC  'TD'                                             D1A             
         AIF   ('&CCSID' EQ '09577').END                        D1A             
&REF     SETC  'TE'                                             D1A             
         AIF   ('&CCSID' EQ '09444').END                        D1A             
&REF     SETC  'TF'                                             D2A             
         AIF   ('&CCSID' EQ '01391').END                        D2A             
&REF     SETC  'TG'                                             D2A             
         AIF   ('&CCSID' EQ '01392').END                        D2A             
&REF     SETC  'TH'                                             D2A             
         AIF   ('&CCSID' EQ '21680').END                        D2A             
&REF     SETC  'TI'                                             D3A             
         AIF   ('&CCSID' EQ '09580').END                        D3A             
&REF     SETC  'TJ'                                             D3A             
         AIF   ('&CCSID' EQ '13125').END                        D3A             
&REF     SETC  'TK'                                             D3A             
         AIF   ('&CCSID' EQ '13676').END                        D3A             
&REF     SETC  'TL'                                             D3A             
         AIF   ('&CCSID' EQ '17221').END                        D3A             
&REF     SETC  'TM'                                             D3A             
         AIF   ('&CCSID' EQ '09447').END                        D3A             
&REF     SETC  'TN'                                             D3A             
         AIF   ('&CCSID' EQ '01166').END                        D3A             
&REF     SETC  'TO'                                             D3A             
         AIF   ('&CCSID' EQ '01167').END                        D3A             
&REF     SETC  'TP'                                             D3A             
         AIF   ('&CCSID' EQ '01168').END                        D3A             
&REF     SETC  'TQ'                                             D3A             
         AIF   ('&CCSID' EQ '20780').END                        D3A             
&REF     SETC  'TR'                                             D3A             
         AIF   ('&CCSID' EQ '09219').END                        D3A             
&REF     SETC  'TS'                                             D3A             
         AIF   ('&CCSID' EQ '01169').END                        D3A             
&REF     SETC  'TT'                                             D3A             
         AIF   ('&CCSID' EQ '09448').END                        D3A             
&REF     SETC  'TU'                                             D3A             
         AIF   ('&CCSID' EQ '09449').END                        D3A             
&REF     SETC  'TV'                                             D3A             
         AIF   ('&CCSID' EQ '01393').END                        D3A             
&REF     SETC  'TW'                                             D4A             
         AIF   ('&CCSID' EQ '21314').END                        D4A             
&REF     SETC  'TX'                                             D4A             
         AIF   ('&CCSID' EQ '21317').END                        D4A             
&REF     SETC  'TY'                                            @A2A             
         AIF   ('&CCSID' EQ '01375').END                       @A2A             
&REF     SETC  'TZ'                                            @A2A             
         AIF   ('&CCSID' EQ '01374').END                       @A2A             
&REF     SETC  'T0'                                            @A2A             
         AIF   ('&CCSID' EQ '61956').END                       @A2A             
&REF     SETC  'T1'                                            @A2A             
         AIF   ('&CCSID' EQ '05471').END                       @A2A             
&REF     SETC  'T2'                                            @A2A             
         AIF   ('&CCSID' EQ '05470').END                       @A2A             
&REF     SETC  'T3'                                            @A1A             
         AIF   ('&CCSID' EQ '05473').END                       @A1A             
&REF     SETC  'T4'                                            @A1A             
         AIF   ('&CCSID' EQ '05472').END                       @A1A             
&REF     SETC  'T5'                                            @A1A             
         AIF   ('&CCSID' EQ '01377').END                       @A1A             
&REF     SETC  'T6'                                            @A1A             
         AIF   ('&CCSID' EQ '01376').END                       @A1A             
&REF     SETC  'T7'                                            @F1A             
         AIF   ('&CCSID' EQ '01202').END                       @F1A             
&REF     SETC  'T8'                                            @D5A             
         AIF   ('&CCSID' EQ '53668').END                       @D5A             
&REF     SETC  'T9'                                            @A3A             
         AIF   ('&CCSID' EQ '54191').END                       @A3A             
&REF     SETC  'UA'                                            @A3A             
         AIF   ('&CCSID' EQ '54289').END                       @A3A             
&REF     SETC  'UB'                                            @A3A             
         AIF   ('&CCSID' EQ '54189').END                       @A3A             
&REF     SETC  'UC'                                            @A3A             
         AIF   ('&CCSID' EQ '62383').END                       @A3A             
&REF     SETC  'UD'                                            @A3A             
         AIF   ('&CCSID' EQ '62337').END                       @A3A             
&REF     SETC  'UE'                                            @A3A             
         AIF   ('&CCSID' EQ '62381').END                       @A3A             
&REF     SETC  'UF'                                            @L1A             
         AIF   ('&CCSID' EQ '00876').END                       @L1A             
&REF     SETC  'UG'                                            @O6A             
         AIF   ('&CCSID' EQ '24876').END                       @O6A             
&REF     SETC  'UH'                                            @C1A             
         AIF   ('&CCSID' EQ '01210').END                       @C1A             
&REF     SETC  'UI'                                            @T1A             
         AIF   ('&CCSID' EQ '17338').END                       @T1A             
&REF     SETC  'UJ'                                            @T1A             
         AIF   ('&CCSID' EQ '21434').END                       @T1A             
&REF     SETC  'UK'                                            @T1A             
         AIF   ('&CCSID' EQ '25528').END                       @T1A             
&REF     SETC  'UL'                                            @T1A             
         AIF   ('&CCSID' EQ '37818').END                       @T1A             
&REF     SETC  'UM'                                            @C2A             
         AIF   ('&CCSID' EQ '05486').END                       @C2A             
&REF     SETC  'UN'                                            @C2A             
         AIF   ('&CCSID' EQ '05495').END                       @C2A             
&REF     SETC  'UO'                                            @W1A             
         AIF   ('&CCSID' EQ '05233').END                       @W1A             
&REF     SETC  'UP'                                            @W1A             
         AIF   ('&CCSID' EQ '62373').END                       @W1A             
&REF     SETC  'UQ'                                            @W1A             
         AIF   ('&CCSID' EQ '62273').END                       @W1A             
&REF     SETC  'UR'                                            @L2A             
         AIF   ('&CCSID' EQ '42160').END                       @L2A             
&REF     SETC  'US'                                            @F3A             
         AIF   ('&CCSID' EQ '09566').END                       @F3A             
&REF     SETC  'UT'                                            @F3A             
         AIF   ('&CCSID' EQ '09567').END                       @F3A             
&REF     SETC  'UU'                                            @F3A             
         AIF   ('&CCSID' EQ '09568').END                       @F3A             
&REF     SETC  'UV'                                            @F3A             
         AIF   ('&CCSID' EQ '09569').END                       @F3A             
&REF     SETC  'UW'                                            @F3A             
         AIF   ('&CCSID' EQ '13664').END                       @F3A             
&REF     SETC  'UX'                                            @F3A             
         AIF   ('&CCSID' EQ '13662').END                       @F3A             
&REF     SETC  'UY'                                            @D6A             
         AIF   ('&CCSID' EQ '13665').END                       @D6A             
&REF     SETC  'UZ'                                            @D6A             
         AIF   ('&CCSID' EQ '13663').END                       @D6A             
&REF     SETC  'U0'                                            @F4A             
         AIF   ('&CCSID' EQ '01175').END                       @F4A             
&REF     SETC  'U1'                                            @D7A             
         AIF   ('&CCSID' EQ '29509').END                       @D7A             
&REF     SETC  'U2'                                            @D8A             
         AIF   ('&CCSID' EQ '05474').END                       @D8A             
&REF     SETC  'U3'                                            @D8A             
         AIF   ('&CCSID' EQ '05475').END                       @D8A             
&REF     SETC  'U4'                                            @D8A             
         AIF   ('&CCSID' EQ '01378').END                       @D8A             
&REF     SETC  'U5'                                            @D8A             
         AIF   ('&CCSID' EQ '01379').END                       @D8A             
&REF     SETC  'U6'                                            @D9A             
         AIF   ('&CCSID' EQ '05255').END                       @D9A             
&REF     SETC  'U7'                                            @D9A             
         AIF   ('&CCSID' EQ '09563').END                       @D9A             
&REF     SETC  'U8'                                            @D9A             
         AIF   ('&CCSID' EQ '17219').END                       @D9A             
&REF     SETC  'U9'                                            @DAA             
         AIF   ('&CCSID' EQ '21868').END                       @DAA             
&REF     SETC  'VA'                                            @DBA             
         AIF   ('&CCSID' EQ '54448').END                       @DBA             
&REF     SETC  'VB'                                            @DCA             
         AIF   ('&CCSID' EQ '28972').END                       @DCA             
&REF     SETC  'VC'                                            @DCA             
         AIF   ('&CCSID' EQ '13678').END                       @DCA             
&REF     SETC  'VD'                                            @DCA             
         AIF   ('&CCSID' EQ '13687').END                       @DCA             
.*                                                                              
.* RESOLVE XREF TO CONSTANT     ---------------------------                     
.*                                                                              
&REF     SETC  '  '                                                             
         MNOTE 4,'SUFFIX REFERENCE FOR THIS CCSID WAS NOT FOUND'                
.END     ANOP                                                                   
&LABEL   DC    CL2'&REF.  '                                                     
         MEND                                                                   
