*%/*                                                                    03050000
         MACRO                                                          03100000
&NAME    DELETE &EP=,&EPLOC=,&DE=,&RELATED=                             03150000
.********************************************************************** 03200000
.* COPYRIGHT =                                                        * 03300000
.*   5650-ZOS                                                         * 03340000
.*   COPYRIGHT IBM CORP. 1980,2019                                    * 03380000
.*   LICENSED MATERIALS - PROPERTY OF IBM                             * 03420000
.* STATUS  = HBB77C0                                                  * 03460001
.*                                                                    * 03500000
.*01* EXTERNAL CLASSIFICATION: PI                                     * 03550000
.*01* END OF EXTERNAL CLASSIFICATION:                                 * 03600000
.*                                                                    * 03650000
.*  CHANGE-ACTIVITY:                                                  * 03660000
.*  $L1= W213454  HBB77C0 170801 PD00XB: RMODE 64                     * 03670003
.********************************************************************** 03700000
         GBLC  &SYSRM64                                            @L1A 09000000
         SYSSTATE TEST                                             @L1A 09001004
         AIF   ('&EP' NE '').EPPRES                                     09010000
         AIF   ('&EPLOC' EQ '' AND '&DE' EQ '').E1 BOTH MISSING         12000000
         AIF   ('&EPLOC' NE '' AND '&DE' NE '').E2 BOTH PRESENT         15000000
&NAME    IHBINNRA ,&EPLOC&DE                LOAD REG 0                  18000000
         AIF   ('&SYSRM64' NE 'YES').SVC                           @L1A 18010000
         LGR   1,0                          ADDR OF EP SYMBOL      @L1A 18020000
         LHI   0,1                          INDICATE RM64          @L1A 18030005
         AGO   .SVC                                                     21000000
.EPPRES  AIF   ('&EPLOC' NE '' OR '&DE' NE '').E2                       24000000
         AIF   ('&SYSRM64' EQ 'YES').RM64                          @L1A 24020000
&NAME    BRAS  0,*+12                            LOAD ADDR OF EP SYMBOL 27000000
         DC    CL8'&EP'                          EP SYMBOL              30000000
         AGO   .END_RM                                             @L1A 30010000
.RM64    ANOP                                                      @L1A 30020000
         LHI   0,1                               INDICATE RM64     @L1A 30021005
&NAME    BRAS  1,*+12                            LOAD ADDR OF EP SYMBOL 30021100
         DC    CL8'&EP'                          EP SYMBOL              30022000
.END_RM  ANOP                                                      @L1A 30030000
.SVC     SVC   9                                 ISSUE DELETE SVC       33000000
         MEXIT                                                          36000000
.E1      IHBERMAC 01,318                    PARAM MISSING               39000000
         MEXIT                                                          42000000
.E2      IHBERMAC 88,318                    TWO MANY PARAMS             45000000
         MEND                                                           48000000
**/                                                                     48050000
*DELETE: MACRO                                                          48100000
*        KEYS(EP,DE,RTCD,RELATED);                                      48150000
*        ANS('?'!!MACLABEL!!'DELETEP '!!MACLIST!!MACKEYS!!';');         48200000
*%END;                                                                  48250000
