* %GOTO EDGACTRC1; /* BILINGUAL MAPPING                                 00050000
         MACRO                                                          00100000
         EDGACTRC &LIST=NO,&DSECT=YES     **                            00150000
************************************************************** ******** 00200000
*                                                                     * 00250000
*  RMM Inventory Management Activity File Record                      * 00300000
*                                                                     * 00350000
*********************************************************************** 00400000
*                                                                     * 00433300
*  z/OS DFSMSrmm V2R4                                                 * 00466600
*                                                                     * 00500000
* PROPRIETARY V3 STATEMENT                                            * 00543700
* LICENSED MATERIALS - PROPERTY OF IBM                                * 00587400
* "RESTRICTED MATERIALS OF IBM"                                       * 00631100
* 5650-ZOS                                                            * 00674800
* COPYRIGHT IBM CORP. 1993,2019                                       * 00718500
* STATUS = HDZ2210                                                    * 00762200
* END PROPRIETARY V3 STATEMENT                                        * 00805900
*                                                                     * 00850000
*********************************************************************** 00900000
*                                                                     * 00950000
*   FUNCTION : EDGACTRC maps the RMM Inventory Management             * 01000000
*              Activity File Record                                   * 01050000
*                                                                     * 01100000
*   LOCATION : N/A                                                    * 01150000
*                                                                     * 01200000
*   METHOD OF ACCESS:                                                 * 01250000
*              ASSEMBLER - USING on ACTRC                             * 01300000
*              PL/X      - %INCLUDE EDGACTRC                          * 01350000
*                                                                     * 01400000
*   LISTING  : ASSEMBLER - specify LIST=YES on the macro              * 01450000
*              PL/X      - specify %IHALIST='YES' before INCLUDE      * 01500000
*                                                                     * 01550000
*********************************************************************** 01600000
*                                                                     * 01650000
* $MAC(EDGACTRC) COMP(DF186) PROD(RMM) : Activity File Record         * 01666600
*                                                                     * 01683200
*   CHANGE ACTIVITY:                                                  * 01700000
*                                                                     * 01750000
* $S5=OW24798,130,961112,GW : Audit Phase 1 SPE (part added)       @S5A 01800000
* $S7=OW30969,140,971217,GW : VRS Enhancements                     @S7A 01825000
* $LC=RMM150 ,150,980205,GW : Catalog Synchronization              @LCA 01837500
* $K1=K150603,150,980424,GW : Activity file for Catsynch           @K1A 01843700
* $LF=RMM210 ,210,990528,VD : RETAINBY and MOVEBY                  @LFA 01846800
* $K2=K160799,210,991125,GW : length of ACTRC_HDR_OPTIONS          @K2A 01848400
* $01=OW45053,210,000620,MWW: Add missing equ                      @01A 01849200
* $LL=RMM213 ,213,010216,BDG: >9999 tape files                     @LLA 01849600
* $MF=RMMV1R8,1R8,050517,AH : TAPE DATA SET AUTHORIZATION          @MFA 01849800
* $MV=V1R10  ,1RA,070613,BRB: Support limits for Release/Scratch   @MVA 01849900
* $K3=K1A2205,1RA,080211,BRB: correct placement of new fields      @K3A 01854100
* $N3=RMMGDG ,1RB,080404,GW : VRSEL GDG Options                    @N3A 01856200
* $NK=RMMAS1 ,1RC,090220,AP : 5.1 Cleanup VRSEL(OLD)               @NKA 01857200
* $NN=RMMARC ,1RC,090401,BG : 8.1 Reporting for EXPDTDROP          @NNA 01857700
* $NT=RMMARC ,1RC,090530,AP/GW : 8.2 Reporting for VRSRETAIN       @NTA 01858000
* $O0=RMMAS1 ,1RC,090925,WS : Volume HOLD attribute                @O0A 01860200
* $O3=RMMMAP ,1RC,091030,KHO: PLXMAP cleanups                      @O3A 01865100
* $OH=RMMRM4 ,1RD,100726,GW : 5.2.5.4 Retention Method 4           @OHA 01868400
* $OX=RMMRRE ,2R1,111006,BRB: 75.1.5.3 Report Retention Enh.       @OXA 01870000
* $M7=261985 ,2R4,180716,KG : Add EDM to inventory manag. reps.    @M7A 01870100
*********************************************************************** 01871700
* WARNING: When you change this macro, you MUST also                  * 01875000
*          Remember to update the Symbols in EDGACTSY.                * 01887500
*********************************************************************** 01900000
         PUSH  PRINT                                                    01950000
         AIF   ('&LIST' EQ 'YES').ASMLIST                               02000000
         PRINT OFF                                                      02050000
.ASMLIST ANOP                                                           02100000
         SPACE 1                                                        02150000
         AIF   ('&DSECT' EQ 'YES').GENDSCT                              02200000
         AGO   .GENSTRT                                                 02250000
.GENDSCT ANOP                                                           02300000
ACTRC DSECT                                                             02350000
.GENSTRT ANOP                                                           02400000
*********************************************************************** 02450000
*                                                                     * 02500000
*  ACTRC: RMM ACTIVITY file records                                   * 02550000
*                                                                     * 02600000
*********************************************************************** 02650000
*                                                                       02700000
ACTRC_RDW           DS  0F           record descriptor word             02750000
ACTRC_RDW_LEN       DS  H            record descriptor - length         02800000
ACTRC_RDW_SEG       DS  XL2          record descriptor - segment        02850000
*                                                                       02900000
*********************************************************************** 02950000
*  Common record prefix                                               * 03000000
*********************************************************************** 03050000
*                                                                       03100000
ACTRC_PREFIX        DS  0F           common prefix                      03150000
ACTRC_PRE_TYPE      DS  C            activity file record type          03200000
ACTRC_PRE_TYPE_HDR  EQU C'H'         header record                      03250000
ACTRC_PRE_TYPE_DSN  EQU C'D'         data set details record            03300000
ACTRC_PRE_TYPE_VOL  EQU C'V'         volume details record              03350000
                                                                        03361000
ACTRC_PRE_RETENTION_GROUP            DS  CL1                       @NNA 03372000
ACTRC_PRE_RETENTION_GROUP_VRSRETAIN  EQU C'R'                      @NNA 03383200
ACTRC_PRE_RETENTION_GROUP_VRSDROP    EQU C'D'                      @NNA 03399800
ACTRC_PRE_RETENTION_GROUP_EXPDTDROP  EQU C'X'                      @NNA 03416400
                                                                        03424700
                    DS  CL2          reserved                      @NNC 03433000
*                                                                       03450000
ACTRC_DATA          DS  0F           start overlay for details areas    03500000
*                                                                       03550000
*********************************************************************** 03600000
*  Header Record                                                      * 03650000
*********************************************************************** 03700000
*                                                                       03750000
ACTRC_HDR_DATA          ORG ACTRC_DATA    overlay for header data       03800000
*                                                                       03850000
ACTRC_HDR_RUN_DATE            DS  CL10   inventory management date      03900000
ACTRC_HDR_RUN_TIME            DS  CL6    inventory management time      03950000
ACTRC_HDR_VERIFY_DATE         DS  CL10   inventory mgmt. VERIFY date    04000000
*                                                                       04050000
ACTRC_HDR_EXEC                DS  0CL16  execution parameters           04100000
ACTRC_HDR_BACKUP              DS  C      BACKUP: Y/N                    04150000
ACTRC_HDR_DSTORE              DS  C      DSTORE: Y/N                    04200000
ACTRC_HDR_EXPROC              DS  C      EXPROC: Y/N                    04250000
ACTRC_HDR_RPTEXT              DS  C      RPTEXT: Y/N                    04300000
ACTRC_HDR_VRSEL               DS  C      VRSEL:  Y/N                    04350000
ACTRC_HDR_VERIFY              DS  C      VERIFY: Y/N                    04400000
ACTRC_HDR_DATE                DS  C      DATE for VERIFY run: Y/N       04450000
*                                                                       04500000
ACTRC_HDR_DATEFORM            DS  C      DATEFORM:                      04550000
ACTRC_HDR_DATEFORM_AMERICAN   EQU C'A'   American                       04600000
ACTRC_HDR_DATEFORM_EUROPEAN   EQU C'E'   European                       04650000
ACTRC_HDR_DATEFORM_ISO        EQU C'I'   ISO                            04700000
ACTRC_HDR_DATEFORM_JULIAN     EQU C'J'   Julian                         04750000
ACTRC_HDR_CATSYNCH            DS  C      CATSYNCH: Y/N             @K1A 04775000
                              DS  CL7    reserved                  @K1C 04787500
*                                                                       04800000
ACTRC_HDR_OPTIONS             DS  0CL31  parmlib options           @K2C 04850000
*                                                                       05000000
ACTRC_HDR_VRSJOBNAME          DS  C      VRSJOBNAME priority            05050000
ACTRC_HDR_VRSJOBNAME_FIRST    EQU C'1'   jobname first                  05100000
ACTRC_HDR_VRSJOBNAME_SECOND   EQU C'2'   jobname second                 05150000
*                                                                       05200000
ACTRC_HDR_VRSCHANGE           DS  C      VRSCHANGE:  V/I                05250000
ACTRC_HDR_VRSCHANGE_VERIFY    EQU C'V'   verify                         05300000
ACTRC_HDR_VRSCHANGE_INFO      EQU C'I'   information                    05350000
*                                                                       05400000
ACTRC_HDR_CATRETPD            DS  CL4    CATRETPD hours                 05450000
*                                                                       05550000
ACTRC_HDR_VRSMIN_COUNT        DS  CL10   VRSMIN minimum number of VRSs  05575000
ACTRC_HDR_VRSMIN_ACTION       DS  C      VRSMIN action:                 05600000
ACTRC_HDR_VRSMIN_ACTION_FAIL  EQU C'F'   fail                           05650000
ACTRC_HDR_VRSMIN_ACTION_WARN  EQU C'W'   warning                        05700000
ACTRC_HDR_VRSMIN_ACTION_INFO  EQU C'I'   information                    05750000
ACTRC_HDR_VRSMIN_ACTION_OFF   EQU C'O'   OFF                       @MVA 05750100
*                                                                       05750200
ACTRC_HDR_OPT_VRSEL           DS  C      VRSEL: N                  @S7A 05754400
ACTRC_HDR_OPT_VRSEL_NEW       EQU C'N'   new                       @S7A 05758700
*ACTRC_HDR_OPT_VRSEL_OLD       EQU C'O'   old                      @NKD 05761600
*                                                                       05764500
ACTRC_HDR_UNCATALOG           DS  C      UNCATALOG:                @S7A 05767400
ACTRC_HDR_UNCATALOG_NO        EQU C'N'   no                        @S7A 05770300
ACTRC_HDR_UNCATALOG_YES       EQU C'Y'   yes                       @S7A 05773200
ACTRC_HDR_UNCATALOG_SCRATCH   EQU C'S'   scratch volume only       @S7A 05776100
*                                                                       05779000
ACTRC_HDR_TPRACF              DS  C      TPRACF:                   @S7A 05781900
ACTRC_HDR_TPRACF_NONE         EQU C'N'   none                      @S7A 05784800
ACTRC_HDR_TPRACF_PREDEFINED   EQU C'P'   predefined profiles       @S7A 05787700
ACTRC_HDR_TPRACF_AUTOMATIC    EQU C'A'   automatic profiles        @S7A 05790600
ACTRC_HDR_TPRACF_CLEANUP      EQU C'C'   cleanup processing        @MFA 05792000
*                                                                       05793500
ACTRC_HDR_SYSID               DS  CL8    SYSID:                    @S7A 05796400
*                                                                       05800000
ACTRC_HDR_CATSYSID            DS  C      CATSYSID:                 @LCA 05808300
ACTRC_HDR_CATSYSID_NOT_SET    EQU C'N'   not set                   @LCA 05816600
ACTRC_HDR_CATSYSID_SET        EQU C'Y'   set to 1-16 sysid's       @LCA 05824900
ACTRC_HDR_CATSYSID_SHARED     EQU C'*'   set to fully shared       @LCA 05833200
*                                                                       05834100
ACTRC_HDR_OPT_RETAINBY        DS  C      RETAINBY V/S              @LFA 05835000
ACTRC_HDR_OPT_RETAINBY_VOLUME EQU C'V'   volume                    @LFA 05835900
ACTRC_HDR_OPT_RETAINBY_SET    EQU C'S'   set                       @LFA 05836800
*                                                                       05837700
ACTRC_HDR_OPT_MOVEBY          DS  C      MOVEBY V/S                @LFA 05838600
ACTRC_HDR_OPT_MOVEBY_VOLUME   EQU C'V'   volume                    @LFA 05839500
ACTRC_HDR_OPT_MOVEBY_SET      EQU C'S'   set                       @LFA 05840400
*                                                                       05840700
ACTRC_HDR_VRSDROP_COUNT         DS  CL10   VRS max # vols dropped  @K3M 05841000
ACTRC_HDR_VRSDROP_PERCENT       DS  CL3    VRS max % vols dropped  @K3M 05841300
ACTRC_HDR_VRSDROP_ACTION        DS  C      VRSDROP action:         @K3M 05841600
ACTRC_HDR_VRSDROP_ACTION_FAIL   EQU C'F'   fail                    @K3M 05841900
ACTRC_HDR_VRSDROP_ACTION_WARN   EQU C'W'   warning                 @K3M 05842200
ACTRC_HDR_VRSDROP_ACTION_INFO   EQU C'I'   information             @K3M 05842500
ACTRC_HDR_VRSDROP_ACTION_OFF    EQU C'O'   OFF                     @K3M 05842800
*                                                                       05843100
ACTRC_HDR_VRSRETAIN_COUNT       DS  CL10   VRS min # vols retained @K3M 05843400
ACTRC_HDR_VRSRETAIN_PERCENT     DS  CL3    VRS min % vols retained @K3M 05843700
ACTRC_HDR_VRSRETAIN_ACTION      DS  C      VRSRETAIN action:       @K3M 05844000
ACTRC_HDR_VRSRETAIN_ACTION_FAIL EQU C'F'   fail                    @K3M 05844300
ACTRC_HDR_VRSRETAIN_ACTION_WARN EQU C'W'   warning                 @K3M 05844600
ACTRC_HDR_VRSRETAIN_ACTION_INFO EQU C'I'   information             @K3M 05844900
ACTRC_HDR_VRSRETAIN_ACTION_OFF  EQU C'O'   OFF                     @K3M 05845200
*                                                                       05845500
ACTRC_HDR_EXPDTDROP_COUNT       DS  CL10   EXP min # vols drped    @K3M 05845800
ACTRC_HDR_EXPDTDROP_PERCENT     DS  CL3    EXP min % vols dropped  @K3M 05846100
ACTRC_HDR_EXPDTDROP_ACTION      DS  C      EXPDTDROP action:       @K3M 05846400
ACTRC_HDR_EXPDTDROP_ACTION_FAIL EQU C'F'   fail                    @K3M 05846700
ACTRC_HDR_EXPDTDROP_ACTION_WARN EQU C'W'   warning                 @K3M 05847000
ACTRC_HDR_EXPDTDROP_ACTION_INFO EQU C'I'   information             @K3M 05847300
ACTRC_HDR_EXPDTDROP_ACTION_OFF  EQU C'O'   OFF                     @K3M 05847600
                                                                        05847800
ACTRC_HDR_GDGCYCLEBY          DS  C      GDG CYCLEBY               @N3A 05848000
ACTRC_HDR_GDGC_GENERATION     EQU C'G'   in generation sequence    @N3A 05848200
ACTRC_HDR_GDGC_CRDATE         EQU C'C'   in creation sequence      @N3A 05848400
                                                                        05848600
ACTRC_HDR_GDGDUPLICATE        DS  C      GDG DUPLICATE             @N3A 05848800
ACTRC_HDR_GDGD_BUMP           EQU C'B'   bump from subchain        @N3A 05849000
ACTRC_HDR_GDGD_DROP           EQU C'D'   drop from vrs retention   @N3A 05849200
ACTRC_HDR_GDGD_KEEP           EQU C'K'   keep cycle number         @N3A 05849400
ACTRC_HDR_GDGD_COUNT          EQU C'C'   count cycle number        @N3A 05849600
                                                                        05856800
                              DS  CL32   reserved                  @NNA 05864000
ACTRC_HDR_VRS_LAST_RUNDATE    DS  CL10   VRSEL last run date       @NNA 05871200
ACTRC_HDR_VRS_LAST_RUNTIME    DS  CL6    VRSEL last run time       @NNA 05878400
                                                                        05885600
ACTRC_HDR_LEN        EQU *-ACTRC_PREFIX  length of header record        05892800
                                                                        05900000
*********************************************************************** 05950000
*  Data Set Record                                                    * 06000000
*********************************************************************** 06050000
*                                                                       06100000
ACTRC_DSN_DATA          ORG ACTRC_DATA   overlay for data set data      06150000
*                                                                       06200000
ACTRC_DSN_DSNAME              DS  CL44   data set name                  06250000
ACTRC_DSN_JOBNAME             DS  CL8    creating job name              06300000
ACTRC_DSN_VOL                 DS  CL6    volume serial number           06350000
                              DS  CL4    Reserved was dsseq        @LLC 06400000
                              DS  CL4    Reserved was PHY file seq @LLC 06450000
ACTRC_DSN_CRDATE              DS  CL10   data set creation date         06500000
ACTRC_DSN_CRTIME              DS  CL6    data set creation time         06550000
ACTRC_DSN_LOC                 DS  CL8    volume location                06600000
ACTRC_DSN_DEST                DS  CL8    volume destination             06650000
ACTRC_DSN_SMS_MC              DS  CL8    SMS management class name      06700000
ACTRC_DSN_VRS_MV              DS  CL8    VRS management value name      06750000
*                                                                       06800000
ACTRC_DSN_CATLG               DS  C      data set catalog status        06850000
ACTRC_DSN_CATLG_YES           EQU C'Y'   cataloged                      06900000
ACTRC_DSN_CATLG_NO            EQU C'N'   not cataloged                  06950000
ACTRC_DSN_CATLG_FAILED        EQU C'F'   locate failed                  07000000
ACTRC_DSN_CATLG_UNKNOWN       EQU C'U'   current status unknown    @LCC 07050000
*                                                                       07100000
ACTRC_DSN_CYCLE               DS  CL10   primary vrs               @S7C*07115000
                                          data set cycle number    @S7C 07130000
ACTRC_DSN_2CYCLE              DS  CL10   secondary vrs             @S7A*07145000
                                          data set cycle number    @S7A 07160000
ACTRC_DSN_SUBCHAIN_DROP       DS  C      primary subchain          @S7A*07175000
                                          drop reason              @S7A 07190000
ACTRC_DSN_2SUBCHAIN_DROP      DS  C      secondary subchain        @S7A*07205000
                                          drop reason              @S7A 07220000
ACTRC_DSN_OLD_CATLG           DS  C      old catalog status        @LCA 07226000
ACTRC_DSN_NEW_CATLG           DS  C      new catalog status        @LCA 07232000
*                                                                       07238000
                              DS  CL25   reserved                  @NTC 07248300
                                                                        07258600
ACTRC_DSN_VOL_DSNNO           DS  CL5    no of data sets on volume @NTA 07268900
ACTRC_DSN_VOL_INSET           DS  CL1    volume in a set: Y/N      @NTA 07279200
                                                                        07289500
ACTRC_DSN_CHANGE              DS  0CL8   changes to data set details    07300000
ACTRC_DSN_CHNG_VRS            DS  C      vital rec status:   Y/N        07341600
ACTRC_DSN_CHNG_RETDATE        DS  C      retention date:     Y/N        07383200
ACTRC_DSN_CHNG_MATCH          DS  C      matching VRS:       Y/N        07424800
ACTRC_DSN_CHNG_SUBCHAIN       DS  C      retaining Subchain: Y/N   @S7A 07466400
ACTRC_DSN_CHNG_CATALOG        DS  C      catalog status:     Y/N   @LCA 07494200
                              DS  CL3    reserved                  @LCC 07522000
*                                                                       07550000
ACTRC_DSN_OLD_VITAL           DS  C      old vital record status: Y/N   07600000
ACTRC_DSN_NEW_VITAL           DS  C      new vital record status: Y/N   07650000
*                                                                       07700000
ACTRC_DSN_DROP                DS  C      reason for non-retention:      07750000
ACTRC_DSN_DROP_WHILECATALOG   EQU C'W'   WHILECATALOG                   07800000
ACTRC_DSN_DROP_UNTILEXPIRED   EQU C'U'   UNTILEXPIRED                   07850000
ACTRC_DSN_DROP_CYCLES         EQU C'C'   cycles exceeded           @S7C 07861100
ACTRC_DSN_DROP_DAYS           EQU C'D'   days since creation       @S7A*07872200
                                          exceeded                 @S7A 07883300
ACTRC_DSN_DROP_LASTREF        EQU C'L'   days since last reference @S7A*07894400
                                          exceeded                 @S7A 07905500
ACTRC_DSN_DROP_EXTRADAYS      EQU C'X'   days since subchain start @S7A*07916600
                                          exceeded                 @S7A 07927700
ACTRC_DSN_DROP_BYDAYSCYCLE    EQU C'B'   by-days-cycles exceeded   @S7C 07938800
ACTRC_DSN_DROP_NO_MATCH       EQU C'N'   No VRS match                   07950000
ACTRC_DSN_DROP_DUP_GDG        EQU C'G'   GDG cycle; duplicate GDG       08000000
ACTRC_DSN_DROP_VOL_RELEASED   EQU C'V'   Volume released / scratch      08050000
*                                                                       08100000
ACTRC_DSN_NEW_LOC             DS  CL8    new required data set location 08150000
*                                                                       08200000
ACTRC_DSN_OLD_RETDATE         DS  CL10   old data set retention date:   08250000
ACTRC_DSN_NEW_RETDATE         DS  CL10   new data set retention date:   08300000
*                                        Format: as per DATEFORM parm.  08350000
*                                        Special date formats:          08400000
*                                        WHILECATLG                     08450000
*                                        CYCL/nnnnn                     08500000
*                                        CATRETPD                       08550000
*                                                                       08600000
ACTRC_DSN_OLD_MATCH           DS  0CL113 old matching VRS          @S7C 08650000
*                                                                       08700000
ACTRC_DSN_OLD_MTYPE           DS  C      old primary VRS type:     @S7C 08750000
ACTRC_DSN_OLD_MTYPE_DSN       EQU C'D'   data set name                  08800000
ACTRC_DSN_OLD_MTYPE_SMS       EQU C'S'   SMS mamagement class           08850000
ACTRC_DSN_OLD_MTYPE_VRS       EQU C'V'   VRS management value           08900000
ACTRC_DSN_OLD_MTYPE_MIX       EQU C'M'   DSN and VRS mgmt value         08950000
ACTRC_DSN_OLD_MTYPE_DSNSMS    EQU C'C'   DSN and SMS mgmt class         08975000
*                                                                       09000000
ACTRC_DSN_OLD_MMASK           DS  CL44   old primary VRS mask      @S7C 09014200
ACTRC_DSN_OLD_MJOB            DS  CL8    old primary VRS job name  @S7C 09028400
ACTRC_DSN_OLD_M2MASK          DS  CL8    old second. VRS mask      @S7A 09042600
ACTRC_DSN_OLD_M2JOB           DS  CL8    old second  VRS job name  @S7A 09056800
ACTRC_DSN_OLD_MNAME           DS  CL8    old primary VRS           @S7A*09071000
                                          subchain name            @S7A 09085200
ACTRC_DSN_OLD_MDATE           DS  CL10   old primary VRS           @S7A*09099400
                                          subchain start date      @S7A 09113600
ACTRC_DSN_OLD_M2NAME          DS  CL8    old second. VRS           @S7A*09127800
                                          subchain name            @S7A 09142000
ACTRC_DSN_OLD_M2DATE          DS  CL10   old second. VRS           @S7A*09156200
                                          subchain start date      @S7A 09170400
                              DS  CL8    reserved                  @S7C 09184600
*                                                                       09200000
ACTRC_DSN_NEW_MATCH           DS  0CL113 new matching VRS          @S7C 09237500
*                                                                       09275000
ACTRC_DSN_NEW_MTYPE           DS  C      old primary VRS type:     @S7C 09312500
ACTRC_DSN_NEW_MTYPE_DSN       EQU C'D'   data set name                  09350000
ACTRC_DSN_NEW_MTYPE_SMS       EQU C'S'   SMS mamagement class           09400000
ACTRC_DSN_NEW_MTYPE_VRS       EQU C'V'   VRS management value           09450000
ACTRC_DSN_NEW_MTYPE_MIX       EQU C'M'   DSN and VRS mgmt value         09500000
ACTRC_DSN_NEW_MTYPE_DSNSMS    EQU C'C'   DSN and SMS mgmt class    @01A 09525000
*                                                                       09550000
ACTRC_DSN_NEW_MMASK           DS  CL44   new primary VRS mask      @S7C 09564200
ACTRC_DSN_NEW_MJOB            DS  CL8    new primary VRS job name  @S7C 09578400
ACTRC_DSN_NEW_M2MASK          DS  CL8    new second. VRS mask      @S7A 09592600
ACTRC_DSN_NEW_M2JOB           DS  CL8    new second  VRS job name  @S7A 09606800
ACTRC_DSN_NEW_MNAME           DS  CL8    new primary VRS           @S7A*09621000
                                          subchain name            @S7A 09635200
ACTRC_DSN_NEW_MDATE           DS  CL10   new primary VRS           @S7A*09649400
                                          subchain start date      @S7A 09663600
ACTRC_DSN_NEW_M2NAME          DS  CL8    new second. VRS           @S7A*09677800
                                          subchain name            @S7A 09692000
ACTRC_DSN_NEW_M2DATE          DS  CL10   new second. VRS           @S7A*09706200
                                          subchain start date      @S7A 09720400
                              DS  CL8    reserved                  @S7C 09734600
ACTRC_DSN_DSEQ                DS  CL5    data set sequence number  @LLA 09739700
ACTRC_DSN_FILESEQ             DS  CL5    physical file sequence num@LLA 09744800
ACTRC_DSN_VRSEL_EXCLUDE       DS  C      excluded from VRSEL Y/N   @OHC 09763200
                                                                        09781600
ACTRC_DSN_LENGTH    EQU *-ACTRC_PREFIX   length of data set record      09800000
                                                                        09850000
*********************************************************************** 09900000
*  Volume Record                                                      * 09950000
*********************************************************************** 10000000
*                                                                       10050000
ACTRC_VOL_DATA         ORG ACTRC_DATA       overlay for volume data     10052100
ACTRC_VOL_DSNAME          DS  CL44          data set name          @NNA 10054100
ACTRC_VOL_JOBNAME         DS  CL8           creating job name      @NNA 10056100
ACTRC_VOL_VOL             DS  CL6           vol-serial number      @NNA 10058100
                          DS  CL8           reserved               @NNA 10060100
ACTRC_VOL_ASDATE          DS  CL10          volume ass. date       @NNA 10062100
ACTRC_VOL_ASTIME          DS  CL6           volume ass. time       @NNA 10064100
ACTRC_VOL_LOC             DS  CL8           volume location        @NNA 10066100
ACTRC_VOL_DEST            DS  CL8           volume destin.         @NNA 10068100
                                                                        10068300
ACTRC_VOL_RETMET          DS  CL1           retention method       @OHA 10068500
ACTRC_VOL_RETMET_VRSEL    EQU C'V'          VRSEL                  @OHA 10068700
ACTRC_VOL_RETMET_EXPDT    EQU C'E'          EXPDT                  @OHA 10068900
                                                                        10069100
ACTRC_VOL_RETAINBY        DS  CL1           RETAINBY               @OXA 10069200
ACTRC_VOL_RETAINBY_VOL    EQU C'V'          VOLUME                 @OXA 10069300
ACTRC_VOL_RETAINBY_SET    EQU C'S'          SET                    @OXA 10069400
ACTRC_VOL_RETAINBY_FIRST  EQU C'F'          FIRSTFILE              @OXA 10069500
                                                                        10069600
                          DS  CL33          reserved               @OXC 10069700
ACTRC_VOL_DSNNO           DS  CL5           no of datasets on vol  @NTA 10069800
ACTRC_VOL_INSET           DS  CL1           volume in set: Y/N     @NTA 10070500
                                                                        10071300
ACTRC_VOL_CHANGE          DS  0CL8          changes to volume      @NNA 10072100
ACTRC_VOL_CHNG_VRS        DS  CL1           vital status: Y/N      @NNA 10074100
ACTRC_VOL_CHNG_RETDATE    DS  CL1           retent. date: Y/N      @NNA 10076100
                          DS  CL1           reserved for rel. opt. @NNA 10078100
ACTRC_VOL_CHNG_STATUS     DS  CL1           released: Y/N          @NNA 10080100
                          DS  CL1           reserved for loc. rel. @NNA 10082100
                          DS  CL1           reserved for act. upd. @NNA 10084100
                          DS  CL2           reserved               @NNA 10086100
                                                                        10088100
ACTRC_VOL_ACTIONS_PENDING DS  0CL6          pending actions        @NNA 10090100
ACTRC_VOL_ACTPEND_RTS     DS  CL1           return to scratch      @NNA 10092100
ACTRC_VOL_ACTPEND_REPL    DS  CL1           replace                @NNA 10094100
ACTRC_VOL_ACTPEND_RTO     DS  CL1           return to owner        @NNA 10096100
ACTRC_VOL_ACTPEND_INIT    DS  CL1           init                   @NNA 10098100
ACTRC_VOL_ACTPEND_ERASE   DS  CL1           erase                  @NNA 10100100
ACTRC_VOL_ACTPEND_NOTIFY  DS  CL1           notify                 @NNA 10102100
                                                                        10104100
ACTRC_VOL_ACTIONS_RELEASE DS  0CL6          release actions        @NNA 10106100
ACTRC_VOL_ACTRLSE_RTS     DS  CL1           return to scratch      @NNA 10108100
ACTRC_VOL_ACTRLSE_REPL    DS  CL1           replace                @NNA 10110100
ACTRC_VOL_ACTRLSE_RTO     DS  CL1           return to owner        @NNA 10112100
ACTRC_VOL_ACTRLSE_INIT    DS  CL1           init                   @NNA 10114100
ACTRC_VOL_ACTRLSE_ERASE   DS  CL1           erase                  @NNA 10116100
ACTRC_VOL_ACTRLSE_NOTIFY  DS  CL1           notify                 @NNA 10118100
                                                                        10120100
ACTRC_VOL_ACTIONS_CONST_RTS    EQU C'S'     return to scratch      @NNA 10123500
ACTRC_VOL_ACTIONS_CONST_REPL   EQU C'R'     replace                @NNA 10125600
ACTRC_VOL_ACTIONS_CONST_RTO    EQU C'O'     return to owner        @NNA 10127700
ACTRC_VOL_ACTIONS_CONST_INIT   EQU C'I'     init                   @NNA 10129800
ACTRC_VOL_ACTIONS_CONST_ERASE  EQU C'E'     erase                  @NNA 10131900
ACTRC_VOL_ACTIONS_CONST_NOTIFY EQU C'N'     notify                 @NNA 10134000
                                                                        10136200
ACTRC_VOL_RETAIN_BY_SET   DS  CL1           Retain by set: Y/N     @NNA 10138400
ACTRC_VOL_OLD_VITAL       DS  CL1           old vit. stat: Y/N     @NNA 10140600
ACTRC_VOL_NEW_VITAL       DS  CL1           new vit. stat: Y/N     @NNA 10142800
                                                                        10145000
ACTRC_VOL_DROP                DS  CL1       non-retent. reason     @NNA 10147200
ACTRC_VOL_DROP_EXPDT_EXPIRED  EQU C'X'      volume eXpired         @NNA 10149400
ACTRC_VOL_DROP_EXPDT_IGNORED  EQU C'I'      EXPDT Ignored          @NNA 10151600
                                                                        10153800
ACTRC_VOL_NEW_LOC         DS  CL8           new requ'd locat.      @NNA 10156000
ACTRC_VOL_HOME_LOC        DS  CL8           home location          @NNA 10158200
ACTRC_VOL_EXPDT           DS  CL10          volume exp. date       @NNA 10160400
ACTRC_VOL_OLD_RETDATE     DS  CL10          old retent. date       @NNA 10162600
ACTRC_VOL_NEW_RETDATE     DS  CL10          new retent. date       @NNA 10164800
*                                           date format:DATEFORM() @NNA 10167600
*                                           Spec. date forms:      @NNA 10169700
*                                            - WHILECATLG          @NNA 10171800
*                                            - CYCL/nnnnn          @NNA 10173900
*                                            - CATRETPD            @NNA 10176000
ACTRC_VOL_YYYY            DS  CL113         reserved               @NNA 10177500
                                                                        10179000
ACTRC_VOL_NEW_MATCH       DS  0CL113        if retaining           @NTC 10179400
ACTRC_VOL_NEW_MTYPE       DS  C             New matching VRS type  @NTA 10179800
ACTRC_VOL_NEW_MTYPE_VOL   EQU C'V'          Volume VRS             @NTA 10180200
                                                                        10180600
ACTRC_VOL_NEW_MMASK       DS  CL6           new volume VRS mask    @NTA 10181000
                          DS  CL106         reserved               @NTA 10181400
                                                                        10182000
                          DS  0CL5          volume sequence        @NNA 10183500
                          DS  CL1           reserved               @NNA 10185000
ACTRC_VOL_VSEQ            DS  CL4           volume sequence part   @NNA 10186500
                                                                        10188000
ACTRC_VOL_LABNO1          DS  CL5           1st file data set sequ @NNA 10189500
ACTRC_VOL_HOLD            DS  C             Volume HOLD Y/N        @O0A 10190000
ACTRC_VOL_HOLD_NO         EQU C'N'          no                     @O0A 10190200
ACTRC_VOL_HOLD_YES        EQU C'Y'          yes                    @O0A 10190400
ACTRC_VOL_EDM             DS  C             Volume EDM Y/N         @M7A 10190450
ACTRC_VOL_EDM_NO          EQU C'N'          no                     @M7A 10190470
ACTRC_VOL_EDM_YES         EQU C'Y'          yes                    @M7A 10190490
ACTRC_VOL_RSV2            DS  CL4           reserved          @O0A @M7C 10190600
                                                                        10191000
ACTRC_VOL_LEN       EQU *-ACTRC_PREFIX      length of volume record     10192800
*                                                                       10200000
*********************************************************************** 10250000
*  End of ACTRC assembler mapping                                     * 10300000
*********************************************************************** 10350000
*                                                                       10400000
                    ORG ,                skip past all data             10450000
ACTRC_LEN           EQU *-ACTRC_PREFIX   maximum record length          10500000
*                                                                       10550000
         POP   PRINT                                                    10600000
         MEND  , */                                                     10650000
*%EDGACTRC1:;                                                           10700000
*%IHALPUSH = '@LISTPUSH';                                               10750000
*%IHALOFF  = '@LISTOFF';                                                10800000
*%IHALPOP  = '@LISTPOP';                                                10850000
*IHALPUSH;                                                              10900000
*%IF IHALIST='YES' %THEN                                                10950000
* %GOTO EDGACTRC22;                                                     11000000
*IHALOFF;                                                               11050000
*%EDGACTRC22:;      /* P L S M A P P I N G S T A R T */                 11100000
*/********************************************************************/ 11150000
*/*                                                                  */ 11200000
*/* Common Name:          RMM Inventory Management Activity File     */ 11205200
*/*                       Record                                     */ 11210400
*/* Macro ID:             EDGACTRC                                   */ 11215600
*/* DSECT Name:           ACTRC                                      */ 11220800
*/* Owning Component:     DFSMSrmm (DF186)                           */ 11226000
*/* Eye-Catcher ID:       None                                       */ 11231200
*/* Storage Attributes:   Subpool:   N/A                             */ 11236400
*/*                       Key:       N/A                             */ 11241600
*/*                       Residency: N/A                             */ 11246800
*/* Size:                 See STRUCTURE length                       */ 11252000
*/* Created by:           EDGHSKP                                    */ 11257200
*/* Pointed to by:        Assembler - USING on ACTRC                 */ 11262400
*/*                       PL/X      - %INCLUDE EDGACTRC              */ 11267600
*/* Serialization:        None                                       */ 11272800
*/* Function:             Maps the ACTRC structure to identify       */ 11278000
*/*                       Header details, Data set details and       */ 11283200
*/*                       Volume details within the RMM activity     */ 11288400
*/*                       file records.                              */ 11294200
*/*                                                                  */ 11300000
*/********************************************************************/ 11350000
*                                                                       11400000
*DCL                                                                    11450000
*  1 ACTRC    BASED,                    ] Activity record               11500000
*    2 ACTRC_RDW   BDY(WORD),           ] Record descriptor word        11550000
*      3 ACTRC_RDW_LEN     FIXED(15),   ] Record descriptor - length    11600000
*      3 ACTRC_RDW_SEG     BIT(16),     ] Record descriptor - segment   11650000
*                                                                       11700000
*    /****************************************************************/ 11750000
*    /*  Common record prefix                                        */ 11800000
*    /****************************************************************/ 11850000
*                                                                       11900000
*    2 ACTRC_PREFIX,                ] Common prefix                     11945800
*      3 ACTRC_PRE_TYPE    CHAR(1), ] Activity file record type         11991600
*      3 ACTRC_PRE_RETENTION_GROUP   CHAR(1),  ] One of: R, D, X   @NNA 12037500
*      3 *                           CHAR(2),  ] Reserved          @NNC 12068700
*                                                                       12100000
*    2 ACTRC_DATA  BDY(WORD) UNION, ] Overlay for details areas         12150000
*                                                                       12200000
*      /**************************************************************/ 12250000
*      /*  Header Record                                             */ 12300000
*      /**************************************************************/ 12350000
*                                                                       12400000
*      3 ACTRC_HDR_DATA,            ] Header data                       12431200
*        4 ACTRC_HDR_RUN_DATE        CHAR(10), ] Inventory management   12462400
*                                   ] date                              12493600
*        4 ACTRC_HDR_RUN_TIME        CHAR(6),  ] Inventory management   12524800
*                                   ] time                              12556000
*        4 ACTRC_HDR_VERIFY_DATE     CHAR(10), ] Inventory management   12587200
*                                   ] verify date                       12618400
*                                                                       12650000
*        4 ACTRC_HDR_EXEC,          ] Execution parameters:             12695800
*          5 ACTRC_HDR_BACKUP        CHAR(1),  ] BACKUP: Y, N           12741600
*          5 ACTRC_HDR_DSTORE        CHAR(1),  ] DSTORE: Y, N           12787400
*          5 ACTRC_HDR_EXPROC        CHAR(1),  ] EXPROC: Y, N           12833200
*          5 ACTRC_HDR_RPTEXT        CHAR(1),  ] RPTEXT: Y, N           12879000
*          5 ACTRC_HDR_VRSEL         CHAR(1),  ] VRSEL:  Y, N           12924800
*          5 ACTRC_HDR_VERIFY        CHAR(1),  ] VERIFY: Y, N           12970600
*          5 ACTRC_HDR_DATE          CHAR(1),  ] VERIFY DATE: Y, N      13016400
*          5 ACTRC_HDR_DATEFORM      CHAR(1),  ] DATEFORM: A, E, I, J   13062200
*          5 ACTRC_HDR_CATSYNCH      CHAR(1),  ] CATSYNCH: Y, N    @K1A 13108000
*          5 *                       CHAR(7),  ] Reserved          @K1C 13153800
*                                                                       13200000
*        4 ACTRC_HDR_OPTIONS,                                           13250000
*          5 ACTRC_HDR_VRSJOBNAME    CHAR(1),                           13287500
*                                   ] VRSJOBNAME priority: 1, 2         13325000
*          5 ACTRC_HDR_VRSCHANGE     CHAR(1),  ] VRSCHANGE: V, I        13362500
*          5 ACTRC_HDR_CATRETPD      CHAR(4),  ] CATRETPD hours         13400000
*          5 ACTRC_HDR_VRSMIN_COUNT  CHAR(10), ] VRSMIN count           13402700
*          5 ACTRC_HDR_VRSMIN_ACTION CHAR(1),  ] VRSMIN action:         13406900
*                                   ] F, W, I, O                        13411100
*          5 ACTRC_HDR_OPT_VRSEL     CHAR(1),  ] VRSEL: N(ew)      @NKC 13415300
*          5 ACTRC_HDR_UNCATALOG     CHAR(1),  ] UNCATALOG:             13419500
*                                   ] Y, N, S                      @S7A 13423700
*          5 ACTRC_HDR_TPRACF        CHAR(1),  ] TPRACF:                13427900
*                                   ] N, P, A, C                   @S7A 13432100
*          5 ACTRC_HDR_SYSID         CHAR(8),  ] SYSID             @S7A 13436300
*          5 ACTRC_HDR_CATSYSID      CHAR(1),  ] CATSYSID: N, Y, * @LCA 13440500
*          5 ACTRC_HDR_OPT_RETAINBY  CHAR(1),  ] RETAINBY: V, S    @LFA 13444700
*          5 ACTRC_HDR_OPT_MOVEBY    CHAR(1),  ] MOVEBY: V, S      @LFA 13448900
*          5 ACTRC_HDR_VRSDROP_COUNT     CHAR(10),                      13453100
*                                   ] VRSDROP count                @K3M 13457300
*          5 ACTRC_HDR_VRSDROP_PERCENT   CHAR(3),                       13461500
*                                   ] VRSDROP percentage           @K3M 13465700
*          5 ACTRC_HDR_VRSDROP_ACTION    CHAR(1),                       13469900
*                                   ] VRSDROP action               @K3M 13474100
*          5 ACTRC_HDR_VRSRETAIN_COUNT   CHAR(10),                      13478300
*                                   ] VRSRETAIN count              @K3M 13482500
*          5 ACTRC_HDR_VRSRETAIN_PERCENT CHAR(3),                       13486700
*                                   ] VRSRETAIN percentage         @K3M 13490900
*          5 ACTRC_HDR_VRSRETAIN_ACTION  CHAR(1),                       13495100
*                                   ] VRSRETAIN action             @K3M 13499300
*          5 ACTRC_HDR_EXPDTDROP_COUNT   CHAR(10),                      13503500
*                                   ] EXPDTDROP count              @K3M 13507700
*          5 ACTRC_HDR_EXPDTDROP_PERCENT CHAR(3),                       13511900
*                                   ] EXPDTDROP percentage         @K3M 13516100
*          5 ACTRC_HDR_EXPDTDROP_ACTION  CHAR(1),                       13520300
*                                   ] EXPDTDROP action             @K3M 13524500
*          5 ACTRC_HDR_GDGCYCLEBY        CHAR(1),                       13528700
*                                   ] GDGCYCLEBY: G, C             @K3M 13532900
*          5 ACTRC_HDR_GDGDUPLICATE      CHAR(1),                       13537100
*                                   ] GDGDUPLICATE: B, D, K, C     @K3M 13541300
*          5 *                           CHAR(32), ] Reserved      @NNA 13545500
*                                                                       13550000
*        4 ACTRC_HDR_VRS_LAST_RUNDATE CHAR(10),                         13560000
*                                   ] VRSEL last run date          @NNA 13570000
*        4 ACTRC_HDR_VRS_LAST_RUNTIME CHAR(6),                          13580000
*                                   ] VRSEL last run time          @NNA 13590000
*                                                                       13600000
*      /**************************************************************/ 13650000
*      /*  Data Set Record                                           */ 13700000
*      /**************************************************************/ 13750000
*                                                                       13800000
*      3 ACTRC_DSN_DATA,                                                13822500
*                                   ] Overlay for data set data         13845000
*        4 ACTRC_DSN_DSNAME          CHAR(44), ] Data set name          13867500
*        4 ACTRC_DSN_JOBNAME         CHAR(8),  ] Creating job name      13890000
*        4 ACTRC_DSN_VOL             CHAR(6),  ] Volume serial number   13912500
*        4 *                         CHAR(4),  ] Reserved          @LLC 13935000
*        4 *                         CHAR(4),  ] Reserved          @LLC 13957500
*        4 ACTRC_DSN_CRDATE          CHAR(10), ] Data set creation date 13980000
*        4 ACTRC_DSN_CRTIME          CHAR(6),  ] Data set creation time 14002500
*        4 ACTRC_DSN_LOC             CHAR(8),  ] Volume location        14025000
*        4 ACTRC_DSN_DEST            CHAR(8),  ] Volume destination     14047500
*        4 ACTRC_DSN_SMS_MC          CHAR(8),                           14070000
*                                   ] SMS management class name         14092500
*        4 ACTRC_DSN_VRS_MV          CHAR(8),                           14115000
*                                   ] VRS management value name         14137500
*        4 ACTRC_DSN_CATLG           CHAR(1),                           14160000
*                                   ] Data set catalog status           14182500
*        4 ACTRC_DSN_CYCLE           CHAR(10),                   ] @S7C 14205000
*                                   ] Primary VRS data set cycle        14227500
*                                   ] number                       @S7A 14250000
*        4 ACTRC_DSN_2CYCLE          CHAR(10),                   ] @S7A 14272500
*                                   ] Secondary VRS data set cycle      14295000
*                                   ] number                       @S7A 14317500
*        4 ACTRC_DSN_SUBCHAIN_DROP   CHAR(1),                    ] @S7A 14340000
*                                   ] Primary VRS subchain drop         14362500
*                                   ] reason                       @S7A 14385000
*        4 ACTRC_DSN_2SUBCHAIN_DROP  CHAR(1),                    ] @S7A 14407500
*                                   ] Secondary VRS subchain drop       14430000
*                                   ] reason                       @S7A 14452500
*        4 ACTRC_DSN_OLD_CATLG       CHAR(1),                           14475000
*                                   ] Old catalog status           @LCA 14497500
*        4 ACTRC_DSN_NEW_CATLG       CHAR(1),                           14520000
*                                   ] New catalog status           @LCA 14542500
*        4 *                         CHAR(25), ] Reserved          @NTC 14565000
*                                                                       14590000
*        4 ACTRC_DSN_VOL_DSNNO       CHAR(5),  ] Number of data         14590600
*                                   ] sets on volume               @NTA 14591200
*        4 ACTRC_DSN_VOL_INSET       CHAR(1),                           14591800
*                                   ] Volume in a set: Y, N        @NTA 14592400
*        4 ACTRC_DSN_CHANGE,        ] Changes to data set details:      14593000
*          5 ACTRC_DSN_CHNG_VRS      CHAR(1),                           14593600
*                                   ] Vital record status: Y, N         14594200
*          5 ACTRC_DSN_CHNG_RETDATE  CHAR(1),  ] Retention date: Y, N   14594800
*          5 ACTRC_DSN_CHNG_MATCH    CHAR(1),  ] Matching VRS: Y, N     14595400
*          5 ACTRC_DSN_CHNG_SUBCHAIN CHAR(1),                           14596000
*                                   ] Retaining subchain: Y, N     @S7A 14596600
*          5 ACTRC_DSN_CHNG_CATALOG  CHAR(1),                           14597200
*                                   ] Catalog status: Y, N         @LCA 14597800
*          5 *                       CHAR(3),  ] Reserved          @LCC 14598400
*                                                                       14600000
*        4 ACTRC_DSN_OLD_VITAL       CHAR(1),                           14633300
*                                   ] Old vital record status: Y, N     14666600
*        4 ACTRC_DSN_NEW_VITAL       CHAR(1),                           14699900
*                                   ] New vital record status: Y, N     14733200
*        4 ACTRC_DSN_DROP            CHAR(1),  ] Non-retention reason:  14766500
*                                   ] W, U, C, D, L, X, B, N, G, V      14799800
*        4 ACTRC_DSN_NEW_LOC         CHAR(8),                           14833100
*                                   ] New required data set location    14866400
*                                                                       14900000
*        4 ACTRC_DSN_OLD_RETDATE     CHAR(10),                          14950000
*                                   ] Old data set retention date       15000000
*        4 ACTRC_DSN_NEW_RETDATE     CHAR(10),                          15050000
*                                   ] New data set retention date.      15100000
*                                   ] Format as per DATEFORM parameter. 15150000
*                                   ] Special date formats:             15200000
*                                   ] WHILECATLG, CYCL/nnnnn, CATRETPD  15250000
*                                                                       15550000
*        4 ACTRC_DSN_OLD_MATCH,     ] Old matching VRS                  15562700
*          5 ACTRC_DSN_OLD_MTYPE     CHAR(1), ] Old primary VRS type:   15575400
*                                   ] D, S, V, M, C                @S7C 15588100
*          5 ACTRC_DSN_OLD_MMASK     CHAR(44),                          15600800
*                                   ] Old primary VRS mask         @S7C 15613500
*          5 ACTRC_DSN_OLD_MJOB      CHAR(8),  ] Old primary VRS        15626200
*                                   ] job name mask                @S7C 15638900
*          5 ACTRC_DSN_OLD_M2MASK    CHAR(8),                           15651600
*                                   ] Old secondary VRS mask       @S7A 15664300
*          5 ACTRC_DSN_OLD_M2JOB     CHAR(8),  ] Old secondary VRS      15677000
*                                   ] job name mask                @S7A 15689700
*          5 ACTRC_DSN_OLD_MNAME     CHAR(8),  ] Old primary VRS        15702400
*                                   ] subchain name                @S7A 15715100
*          5 ACTRC_DSN_OLD_MDATE     CHAR(10), ] Old primary VRS        15727800
*                                   ] subchain start date          @S7A 15740500
*          5 ACTRC_DSN_OLD_M2NAME    CHAR(8),  ] Old secondary VRS      15753200
*                                   ] subchain name                @S7A 15765900
*          5 ACTRC_DSN_OLD_M2DATE    CHAR(10), ] Old secondary VRS      15778600
*                                   ] subchain start date          @S7A 15791300
*          5 *                       CHAR(8),  ] Reserved          @S7C 15804000
*                                                                       15816700
*        4 ACTRC_DSN_NEW_MATCH,     ] New matching VRS                  15829400
*          5 ACTRC_DSN_NEW_MTYPE     CHAR(1), ] New primary VRS type:   15842100
*                                   ] D, S, V, M, C                @S7C 15854800
*          5 ACTRC_DSN_NEW_MMASK     CHAR(44),                          15867500
*                                   ] New primary VRS mask         @S7C 15880200
*          5 ACTRC_DSN_NEW_MJOB      CHAR(8),  ] New primary VRS        15892900
*                                   ] job name mask                @S7C 15905600
*          5 ACTRC_DSN_NEW_M2MASK    CHAR(8),                           15918300
*                                   ] New secondary VRS mask       @S7A 15931000
*          5 ACTRC_DSN_NEW_M2JOB     CHAR(8),  ] New secondary VRS      15943700
*                                   ] job name mask                @S7A 15956400
*          5 ACTRC_DSN_NEW_MNAME     CHAR(8),  ] New primary VRS        15969100
*                                   ] subchain name                @S7A 15981800
*          5 ACTRC_DSN_NEW_MDATE     CHAR(10), ] New primary VRS        15994500
*                                   ] subchain start date          @S7A 16007200
*          5 ACTRC_DSN_NEW_M2NAME    CHAR(8),  ] New secondary VRS      16019900
*                                   ] subchain name                @S7A 16032600
*          5 ACTRC_DSN_NEW_M2DATE    CHAR(10), ] New secondary VRS      16045300
*                                   ] subchain start date          @S7A 16058000
*          5 *                       CHAR(8),  ] Reserved          @S7C 16070700
*        4 ACTRC_DSN_DSEQ            CHAR(5),                           16083400
*                                   ] Data set sequence number     @LLA 16096100
*        4 ACTRC_DSN_FILESEQ         CHAR(5), ] Physical file           16108800
*                                   ] sequence number              @LLA 16121500
*        4 ACTRC_DSN_VRSEL_EXCLUDE   CHAR(1),  ]VRSEL excluded Y/N @OHC 16135700
*                                                                       16150000
*      /**************************************************************/ 16200000
*      /*  Volume Record                                             */ 16250000
*      /**************************************************************/ 16300000
*                                                                       16350000
*      3 ACTRC_VOL_DATA,            ] Overlay for volume data           16367400
*@LOGIC;                            ]                              @O3A 16384800
*]       4 *                         CHAR(0);  ]                   @NND 16402300
*@ENDLOGIC;                         ]                              @O3A 16403600
*        4 ACTRC_VOL_DSNAME          CHAR(44), ] Data set name     @NNA 16404900
*        4 ACTRC_VOL_JOBNAME         CHAR(8),  ] Creating job name @NNA 16406200
*        4 ACTRC_VOL_VOL             CHAR(6),                           16407500
*                                   ] Volume serial number         @NNA 16408800
*        4 *                         CHAR(8),  ] Reserved          @NNA 16410100
*        4 ACTRC_VOL_ASDATE          CHAR(10),                          16411400
*                                   ] Volume assigned date         @NNA 16412700
*        4 ACTRC_VOL_ASTIME          CHAR(6),                           16414000
*                                   ] Volume assigned time         @NNA 16415300
*        4 ACTRC_VOL_LOC             CHAR(8),  ] Volume location   @NNA 16416600
*        4 ACTRC_VOL_DEST            CHAR(8),                           16417900
*                                   ] Volume destination           @NNA 16419200
*        4 ACTRC_VOL_RETMET          CHAR(1),  ] Retention Method  @OHA 16420300
*        4 ACTRC_VOL_RETAINBY        CHAR(1),  ] RETAINBY          @OXA 16421100
*        4 *                         CHAR(33), ] Reserved          @OXC 16421900
*        4 ACTRC_VOL_DSNNO           CHAR(5),  ] Number of data sets    16422700
*                                   ] on volume                    @NTA 16423300
*        4 ACTRC_VOL_INSET           CHAR(1),                           16423900
*                                   ] Volume in set: Y, N          @NTA 16424500
*                                                                       16425300
*        4 ACTRC_VOL_CHANGE,        ] Changes to volume details:   @NNA 16427100
*          5 ACTRC_VOL_CHNG_VRS      CHAR(1),                           16428900
*                                   ] Vital record status: Y, N    @NNA 16430700
*          5 ACTRC_VOL_CHNG_RETDATE  CHAR(1),                           16432500
*                                   ] Retention date: Y, N         @NNA 16434300
*          5 *                       CHAR(1),  ] Reserved          @NNA 16436100
*          5 ACTRC_VOL_CHNG_STATUS   CHAR(1),  ] Released: Y, N    @NNA 16437900
*          5 *                       CHAR(1),  ] Reserved          @NNA 16439700
*          5 *                       CHAR(1),  ] Reserved          @NNA 16441500
*          5 *                       CHAR(2),  ] Reserved          @NNA 16443300
*                                                                       16446000
*        4 ACTRC_VOL_ACTIONS_PENDING,          ] Pending actions   @NNA 16448300
*          5 ACTRC_VOL_ACTPEND_RTS   CHAR(1),  ] Return to scratch @NNA 16450600
*          5 ACTRC_VOL_ACTPEND_REPL  CHAR(1),  ] Replace           @NNA 16452900
*          5 ACTRC_VOL_ACTPEND_RTO   CHAR(1),  ] Return to owner   @NNA 16455200
*          5 ACTRC_VOL_ACTPEND_INIT  CHAR(1),  ] Init              @NNA 16457500
*          5 ACTRC_VOL_ACTPEND_ERASE CHAR(1),  ] Erase             @NNA 16459800
*          5 ACTRC_VOL_ACTPEND_NOTIFY CHAR(1), ] Notify            @NNA 16462100
*                                                                       16464400
*        4 ACTRC_VOL_ACTIONS_RELEASE,          ] Release actions   @NNA 16466700
*          5 ACTRC_VOL_ACTRLSE_RTS   CHAR(1),  ] Return to scratch @NNA 16469000
*          5 ACTRC_VOL_ACTRLSE_REPL  CHAR(1),  ] Replace           @NNA 16471300
*          5 ACTRC_VOL_ACTRLSE_RTO   CHAR(1),  ] Return to owner   @NNA 16473600
*          5 ACTRC_VOL_ACTRLSE_INIT  CHAR(1),  ] Init              @NNA 16475900
*          5 ACTRC_VOL_ACTRLSE_ERASE CHAR(1),  ] Erase             @NNA 16478200
*          5 ACTRC_VOL_ACTRLSE_NOTIFY CHAR(1), ] Notify            @NNA 16480500
*                                                                       16482800
*        4 ACTRC_VOL_RETAIN_BY_SET   CHAR(1),                           16484200
*                                   ] Retain by set: Y, N          @NNA 16485600
*        4 ACTRC_VOL_OLD_VITAL       CHAR(1),                           16487000
*                                   ] Old vital record status:          16488400
*                                   ] Y, N                         @NNA 16489800
*        4 ACTRC_VOL_NEW_VITAL       CHAR(1),                           16491200
*                                   ] New vital record status:          16492600
*                                   ] Y, N                         @NNA 16494000
*        4 ACTRC_VOL_DROP            CHAR(1),                           16495400
*                                   ] Non-retention reason: X, I   @NNA 16496800
*        4 ACTRC_VOL_NEW_LOC         CHAR(8),                           16498200
*                                   ] New required location        @NNA 16499600
*        4 ACTRC_VOL_HOME_LOC        CHAR(8),  ] Home location     @NNA 16501000
*                                                                       16503500
*        4 ACTRC_VOL_EXPDT           CHAR(10),                          16505500
*                                   ] Expiration date              @NNA 16507500
*        4 ACTRC_VOL_OLD_RETDATE     CHAR(10),                          16509500
*                                   ] Old retention date           @NNA 16511500
*        4 ACTRC_VOL_NEW_RETDATE     CHAR(10), ]                   @NNA 16513500
*                                   ] New retention date.               16515500
*                                   ] Format as per DATEFORM parameter. 16517500
*                                   ] Special date formats:             16519500
*                                   ] WHILECATLG, CYCL/nnnnn, CATRETPD  16521500
*                                                                       16524200
*        4 ACTRC_VOL_yyyy,          ]                              @NNA 16526500
*          5 *                       CHAR(113),] Reserved          @NNA 16528800
*                                                                       16531100
*        4 ACTRC_VOL_NEW_MATCH,     ] If retaining:                @NTC 16532400
*          5 ACTRC_VOL_NEW_MTYPE     CHAR(1),  ] VRS type          @NTA 16533700
*          5 ACTRC_VOL_NEW_MMASK     CHAR(6),  ] Volume VRS mask   @NTA 16535000
*          5 *                       CHAR(106), ] Reserved         @NTA 16536200
*        4 *                         CHAR(5),  ] Volume sequence   @NNA 16537400
*          5 *                       CHAR(1),  ] Reserved          @NNA 16538600
*          5 ACTRC_VOL_VSEQ          CHAR(4),                           16539800
*                                   ] Volume sequence part         @NNA 16541000
*        4 ACTRC_VOL_LABNO1          CHAR(5),                           16542200
*                                   ] First file data set sequence @O0C 16543400
*        4 ACTRC_VOL_HOLD            CHAR(1),  ] Volume hold: Y, N @O0A 16544600
*        4 ACTRC_VOL_EDM             CHAR(1),  ] Volume EDM: Y, N  @M7A 16544700
*        4 ACTRC_VOL_RSV2            CHAR(4);  ] Reserved     @O0A @M7C 16545800
*                                                                       16547200
*/********************************************************************/ 16550000
*/*  Constants                                                       */ 16600000
*/********************************************************************/ 16650000
*                                                                       16700000
*DCL                                                                    16750000
*  ACTRC_PRE_TYPE_HDR            CHAR(1)  CONSTANT('H'),                16800000
*  ACTRC_PRE_TYPE_DSN            CHAR(1)  CONSTANT('D'),                16850000
*  ACTRC_PRE_TYPE_VOL            CHAR(1)  CONSTANT('V'),                16900000
*                                                                       16906200
*  ACTRC_PRE_RETENTION_GROUP_VRSRETAIN CHAR(1)  CONSTANT('R'),   ] @NNA 16917100
*  ACTRC_PRE_RETENTION_GROUP_VRSDROP   CHAR(1)  CONSTANT('D'),   ] @NNA 16928000
*  ACTRC_PRE_RETENTION_GROUP_EXPDTDROP CHAR(1)  CONSTANT('X'),   ] @NNA 16938900
*                                                                       16950000
*  ACTRC_HDR_VRSJOBNAME_FIRST    CHAR(1)  CONSTANT('1'),                17000000
*  ACTRC_HDR_VRSJOBNAME_SECOND   CHAR(1)  CONSTANT('2'),                17050000
*                                                                       17100000
*  ACTRC_HDR_VRSMIN_ACTION_FAIL  CHAR(1)  CONSTANT('F'),         ] @MVA 17100100
*  ACTRC_HDR_VRSMIN_ACTION_WARN  CHAR(1)  CONSTANT('W'),         ] @MVA 17100200
*  ACTRC_HDR_VRSMIN_ACTION_INFO  CHAR(1)  CONSTANT('I'),         ] @MVA 17100300
*  ACTRC_HDR_VRSMIN_ACTION_OFF   CHAR(1)  CONSTANT('O'),         ] @MVA 17100400
*                                                                       17100500
*  ACTRC_HDR_VRSDROP_ACTION_FAIL CHAR(1)  CONSTANT('F'),         ] @MVA 17100600
*  ACTRC_HDR_VRSDROP_ACTION_WARN CHAR(1)  CONSTANT('W'),         ] @MVA 17100700
*  ACTRC_HDR_VRSDROP_ACTION_INFO CHAR(1)  CONSTANT('I'),         ] @MVA 17100800
*  ACTRC_HDR_VRSDROP_ACTION_OFF  CHAR(1)  CONSTANT('O'),         ] @MVA 17100900
*                                                                       17101000
*  ACTRC_HDR_VRSRETAIN_ACTION_FAIL CHAR(1)  CONSTANT('F'),       ] @MVA 17101100
*  ACTRC_HDR_VRSRETAIN_ACTION_WARN CHAR(1)  CONSTANT('W'),       ] @MVA 17101200
*  ACTRC_HDR_VRSRETAIN_ACTION_INFO CHAR(1)  CONSTANT('I'),       ] @MVA 17101300
*  ACTRC_HDR_VRSRETAIN_ACTION_OFF  CHAR(1)  CONSTANT('O'),       ] @MVA 17101400
*                                                                       17101500
*  ACTRC_HDR_EXPDTDROP_ACTION_FAIL CHAR(1)  CONSTANT('F'),       ] @MVA 17101600
*  ACTRC_HDR_EXPDTDROP_ACTION_WARN CHAR(1)  CONSTANT('W'),       ] @MVA 17101700
*  ACTRC_HDR_EXPDTDROP_ACTION_INFO CHAR(1)  CONSTANT('I'),       ] @MVA 17101800
*  ACTRC_HDR_EXPDTDROP_ACTION_OFF  CHAR(1)  CONSTANT('O'),       ] @MVA 17101900
*                                                                       17102000
*  ACTRC_HDR_OPT_VRSEL_NEW       CHAR(1)  CONSTANT('N'),         ] @S7A 17105400
*@LOGIC;                            ]                              @O3A 17107100
* ] ACTRC_HDR_OPT_VRSEL_OLD       CHAR(1)  CONSTANT('O'),        ] @NKD 17108800
*@ENDLOGIC;                         ]                              @O3A 17110500
*                                                                       17112300
*  ACTRC_HDR_UNCATALOG_NO        CHAR(1)  CONSTANT('N'),         ] @S7A 17116400
*  ACTRC_HDR_UNCATALOG_YES       CHAR(1)  CONSTANT('Y'),         ] @S7A 17120500
*  ACTRC_HDR_UNCATALOG_SCRATCH   CHAR(1)  CONSTANT('S'),         ] @S7A 17124600
*                                                                       17128700
*  ACTRC_HDR_TPRACF_NONE         CHAR(1)  CONSTANT('N'),         ] @S7A 17131900
*  ACTRC_HDR_TPRACF_PREDEFINED   CHAR(1)  CONSTANT('P'),         ] @S7A 17135100
*  ACTRC_HDR_TPRACF_AUTOMATIC    CHAR(1)  CONSTANT('A'),         ] @S7A 17138300
*  ACTRC_HDR_TPRACF_CLEANUP      CHAR(1)  CONSTANT('C'),         ] @MFA 17141500
*                                                                       17145100
*  ACTRC_HDR_CATSYSID_NOT_SET    CHAR(1)  CONSTANT('N'),         ] @LCA 17146000
*  ACTRC_HDR_CATSYSID_SET        CHAR(1)  CONSTANT('Y'),         ] @LCA 17146900
*  ACTRC_HDR_CATSYSID_SHARED     CHAR(1)  CONSTANT('*'),         ] @LCA 17147800
*                                                                       17148700
*  ACTRC_HDR_OPT_RETAINBY_VOLUME CHAR(1)  CONSTANT('V'),         ] @LFA 17148800
*  ACTRC_HDR_OPT_RETAINBY_SET    CHAR(1)  CONSTANT('S'),         ] @LFA 17148900
*                                                                       17149000
*  ACTRC_HDR_OPT_MOVEBY_VOLUME   CHAR(1)  CONSTANT('V'),         ] @LFA 17149100
*  ACTRC_HDR_OPT_MOVEBY_SET      CHAR(1)  CONSTANT('S'),         ] @LFA 17149200
*                                                                       17149300
*  ACTRC_HDR_GDGC_GENERATION     CHAR(1)  CONSTANT('G'),         ] @N3A 17153900
*  ACTRC_HDR_GDGC_CRDATE         CHAR(1)  CONSTANT('C'),         ] @N3A 17158500
*                                                                       17163100
*  ACTRC_HDR_GDGD_BUMP           CHAR(1)  CONSTANT('B'),         ] @N3A 17167700
*  ACTRC_HDR_GDGD_DROP           CHAR(1)  CONSTANT('D'),         ] @N3A 17172300
*  ACTRC_HDR_GDGD_KEEP           CHAR(1)  CONSTANT('K'),         ] @N3A 17176900
*  ACTRC_HDR_GDGD_COUNT          CHAR(1)  CONSTANT('C'),         ] @N3A 17181500
*                                                                       17186100
*                                                                       17190700
*  ACTRC_DSN_CATLG_YES           CHAR(1)  CONSTANT('Y'),                17195300
*  ACTRC_DSN_CATLG_NO            CHAR(1)  CONSTANT('N'),                17200000
*  ACTRC_DSN_CATLG_FAILED        CHAR(1)  CONSTANT('F'),                17250000
*  ACTRC_DSN_CATLG_UNKNOWN       CHAR(1)  CONSTANT('U'),                17300000
*                                                                       17350000
*  ACTRC_DSN_OLD_MTYPE_DSN       CHAR(1) CONSTANT('D'),          ] @01A 17353800
*  ACTRC_DSN_OLD_MTYPE_SMS       CHAR(1) CONSTANT('S'),          ] @01A 17357600
*  ACTRC_DSN_OLD_MTYPE_VRS       CHAR(1) CONSTANT('V'),          ] @01A 17361400
*  ACTRC_DSN_OLD_MTYPE_MIX       CHAR(1) CONSTANT('M'),          ] @01A 17365200
*  ACTRC_DSN_OLD_MTYPE_DSNSMS    CHAR(1) CONSTANT('C'),          ] @01A 17369000
*                                                                       17372800
*  ACTRC_DSN_NEW_MTYPE_DSN       CHAR(1) CONSTANT('D'),          ] @01A 17376600
*  ACTRC_DSN_NEW_MTYPE_SMS       CHAR(1) CONSTANT('S'),          ] @01A 17380400
*  ACTRC_DSN_NEW_MTYPE_VRS       CHAR(1) CONSTANT('V'),          ] @01A 17384200
*  ACTRC_DSN_NEW_MTYPE_MIX       CHAR(1) CONSTANT('M'),          ] @01A 17388000
*  ACTRC_DSN_NEW_MTYPE_DSNSMS    CHAR(1) CONSTANT('C'),          ] @01A 17391800
*                                                                       17395600
*  ACTRC_DSN_DROP_WHILECATALOG   CHAR(1)  CONSTANT('W'),                17400000
*  ACTRC_DSN_DROP_UNTILEXPIRED   CHAR(1)  CONSTANT('U'),                17450000
*  ACTRC_DSN_DROP_CYCLES         CHAR(1)  CONSTANT('C'),         ] @S7C 17466600
*  ACTRC_DSN_DROP_DAYS           CHAR(1)  CONSTANT('D'),         ] @S7C 17483200
*  ACTRC_DSN_DROP_LASTREF        CHAR(1)  CONSTANT('L'),         ] @S7C 17499800
*  ACTRC_DSN_DROP_EXTRADAYS      CHAR(1)  CONSTANT('X'),         ] @S7C 17516400
*  ACTRC_DSN_DROP_BYDAYSCYCLE    CHAR(1)  CONSTANT('B'),         ] @S7C 17533000
*  ACTRC_DSN_DROP_NO_MATCH       CHAR(1)  CONSTANT('N'),                17550000
*  ACTRC_DSN_DROP_DUP_GDG        CHAR(1)  CONSTANT('G'),                17600000
*  ACTRC_DSN_DROP_VOL_RELEASED   CHAR(1)  CONSTANT('V'),         ] @NNC 17608300
*                                                                       17616600
*  ACTRC_VOL_ACTIONS_CONST_RTS    CHAR(1)  CONSTANT('S'),        ] @NNA 17624900
*  ACTRC_VOL_ACTIONS_CONST_REPL   CHAR(1)  CONSTANT('R'),        ] @NNA 17633200
*  ACTRC_VOL_ACTIONS_CONST_RTO    CHAR(1)  CONSTANT('O'),        ] @NNA 17641500
*  ACTRC_VOL_ACTIONS_CONST_INIT   CHAR(1)  CONSTANT('I'),        ] @NNA 17649800
*  ACTRC_VOL_ACTIONS_CONST_ERASE  CHAR(1)  CONSTANT('E'),        ] @NNA 17658100
*  ACTRC_VOL_ACTIONS_CONST_NOTIFY CHAR(1)  CONSTANT('N'),        ] @NNA 17666400
*                                                                       17674700
*  ACTRC_VOL_DROP_EXPDT_EXPIRED   CHAR(1)  CONSTANT('X'),        ] @NNA 17680300
*  ACTRC_VOL_DROP_EXPDT_IGNORED   CHAR(1)  CONSTANT('I'),        ] @NTC 17685900
*                                                                       17691500
*  ACTRC_VOL_NEW_MTYPE_VOL        CHAR(1)  CONSTANT('V'),        ] @O0C 17695700
*                                                                       17700000
*  ACTRC_VOL_HOLD_NO              CHAR(1)  CONSTANT('N'),        ] @O0A 17716600
*  ACTRC_VOL_HOLD_YES             CHAR(1)  CONSTANT('Y'),        ] @OHC 17722100
*                                                                       17700000
*  ACTRC_VOL_EDM_NO               CHAR(1)  CONSTANT('N'),        ] @M7A 17716600
*  ACTRC_VOL_EDM_YES              CHAR(1)  CONSTANT('Y'),        ] @M7A 17722100
*                                                                       17727600
*  ACTRC_VOL_RETMET_VRSEL         CHAR(1)  CONSTANT('V'),        ] @OHA 17733100
*  ACTRC_VOL_RETMET_EXPDT         CHAR(1)  CONSTANT('E'),        ] @OHA 17738600
*                                                                       17744100
*  ACTRC_VOL_RETAINBY_VOL         CHAR(1)  CONSTANT('V'),        ] @OXA 17745200
*  ACTRC_VOL_RETAINBY_SET         CHAR(1)  CONSTANT('S'),        ] @OXA 17746300
*  ACTRC_VOL_RETAINBY_FIRST       CHAR(1)  CONSTANT('F');        ] @OXA 17747400
*                                                                       17748500
*IHALPOP; /* P L S  M A P P I N G  C O M P L E T E */                   17750000
