* %GOTO EDGRSEXT1; /* BILINGUAL MAPPING                                 00050000
         MACRO                                                          00100000
         EDGRSEXT &LIST=NO,&DSECT=YES     **                            00150000
*********************************************************************** 00200000
***                                                                  ** 00250000
***      RMM REPORT EXTRACT FILE STORAGE LOCATION BIN RECORD (RSEXT) ** 00300000
***                                                                  ** 00350000
*********************************************************************** 00400000
*** z/OS DFSMSrmm V1R13                                              ** 00450000
***                                                                  ** 00850000
*** PROPRIETARY V3 STATEMENT                                         ** 00855500
*** LICENSED MATERIALS - PROPERTY OF IBM                             ** 00861000
*** "RESTRICTED MATERIALS OF IBM"                                    ** 00866500
*** 5694-A01                                                         ** 00872000
*** COPYRIGHT 1993,2011  IBM CORP.                                   ** 00877500
*** STATUS = HDZ1D10                                                 ** 00883000
*** END PROPRIETARY V3 STATEMENT                                     ** 00888500
*********************************************************************** 00894000
***                                                                  ** 00900000
***                                                                  ** 00950000
*** FUNCTION : EDGRSEXT MAPS THE RMM REPORT EXTRACT FILE STORAGE     ** 01000000
***            LOCATION BIN RECORD                                   ** 01050000
***                                                                  ** 01100000
*** LOCATION : N/A                                                   ** 01150000
***                                                                  ** 01200000
*** METHOD OF ACCESS:                                                ** 01250000
***            ASSEMBLER - USING ON RSEXT                            ** 01300000
***            PLAS      - %INCLUDE EDGRSEXT                         ** 01350000
***                                                                  ** 01400000
*** LISTING  : ASSEMBLER - SPECIFY LIST=YES ON THE MACRO             ** 01450000
***            PLAS      - SPECIFY %IHALIST='YES' BEFORE INCLUDE     ** 01500000
***                                                                  ** 01550000
*** $MAC(EDGRSEXT) COMP(DF186) PROD(RMM) : Extract file bin record   ** 01566600
***                                                                  ** 01583200
*** CHANGE ACTIVITY:                                                 ** 01600000
***            26/MAR/91   001/177178  REDUCE RECORD LENGTH   @001   ** 01650000
***            09/APR/91   002/177056  RSRMSTID               @002   ** 01700000
**      09/09/91 DSP   PRODUCT NAME CHANGE                         @RMM 01750000
*** DCR005 ,MC,110892, BILINGUAL MAINTENANCE                    @003 ** 01800000
***        ,WD,110992, correct copyright                        @004 ** 01850000
*** 271367 ,MC,060493, Correct offsets                          @005 ** 01900000
*** $06=OW06843,110,010894,WK : DELETE FIXED LEN. REPORT RECORD @06A ** 01916600
*** $S1=SPESLOC,110,043194,ADM: NEW FIELDS FOR GT 3 STORES SPE  @S1A ** 01929100
*** $07=OW20013,130,960417,MWW: Improve comments                @07A ** 01941600
*** $SC=OW49863,210,010410,AP : Minimal Bin Assignment          @SCA ** 01945800
*** $O3=RMMMAP ,1RC,091030,BRB: PLXMAP cleanups                 @O3A ** 01947900
*** $OB=RMMLCD ,1RD,100510,BRB: 30 Last change details          @OBA ** 01973900
*** $K1=K1D0764,1RD,101216,WS : Correction within PL/X part     @K1A ** 01986900
*********************************************************************** 02000000
         PUSH  PRINT                                                    02050000
         AIF   ('&LIST' EQ 'YES').ASMLIST                               02100000
         PRINT OFF                                                      02150000
.ASMLIST ANOP                                                           02200000
         SPACE 1                                                        02250000
         AIF   ('&DSECT' EQ 'YES').GENDSCT                              02300000
         AGO   .GENSTRT                                                 02350000
.GENDSCT ANOP                                                           02400000
RSEXT    DSECT                                                          02450000
.GENSTRT ANOP                                                           02500000
*********************************************************************   02506200
* RSEXT:    This macro maps the information produced for bin number *   02512400
*           records in the RMM report extract file.                 *   02518600
*           In this record the date format depends on the DATEFORM  *   02524800
*           selected by EDGHSKP execution parameter or the parmlib  *   02531000
*           specified value.                                        *   02537200
*********************************************************************   02543400
*                                                                       02550000
RSTYPE   DS    C                   RECORD TYPE C'S'                     02553400
RSTYPE2  DS    C                   BIN RECORD ID: ONE OF:               02556800
RSTYPER  EQU   C'E'                E - EMPTY BIN                   @001 02560200
RSTYPES  EQU   C'U'                U - ASSIGNED BIN                @001 02563600
RSRMSTID DS    CL8                 STORAGE LOCATION NAME           @002 02567000
         DS    C                   RESERVED                             02570400
RSBINNO  DS    CL6                 BIN NUMBER                           02573800
RSBMEDN  DS    CL8                 BIN MEDIA NAME                  @S1A 02577200
         DS    CL23                RESERVED SO CRDATE IN SAMEPLACE @S1C 02580600
*********************************************************************   02584000
*  Start of common fields:                                          *   02587400
*  The common fields are in the same place in each record type      *   02590800
*  in the report extract file.  This allows common processing of    *   02594200
*  these field across multiple record types.                        *   02597600
*********************************************************************   02601000
RSCRDATE DS    CL10                CREATE DATE of bin record            02604400
RSCRTIME DS    CL6                 CREATE TIME (HHMMSS) of bin record   02607800
RSCRSID  DS    CL8                 CREATE SYSTEM ID of bin record       02611200
RSLCDATE DS    CL10                LAST CHANGE DATE of bin record       02614600
RSLCTIME DS    CL6                 LAST CHANGE TIME (HHMMSS) of bin     02618000
*                                  record                               02621400
RSLCUID  DS    CL8                 LAST CHANGE USER ID of bin record    02624800
RSLCSID  DS    CL8                 LAST CHANGE SYSTEM ID of bin         02628200
*                                  record                               02631600
*********************************************************************   02635000
*  End of common fields                                             *   02638400
*********************************************************************   02641800
RSVOLSER DS    CL6                 Current volume                  @SCC 02643100
*                                                                       02644400
RsMovingInVol   DS  CL6            Moving-in volume                @SCA 02645700
RsMovingOutvol  DS  CL6            Moving-out volume               @SCA 02647000
RsOldVol        DS  CL6            Old volume                      @SCA 02648300
RSUCDATE        DS  CL10           LAST "USER" CHANGE DATE         @OBA 02648800
RSUCTIME        DS  CL6            LAST "USER" CHANGE TIME (HHMMSS)@OBA 02649300
*                                                                       02650000
* END OF REPORT EXTRACT STORAGE LOCATION BIN RECORD                     02700000
*                                                                       03650000
RSRCEND  DS    0C                  END OF RSEXT                    @001 03700000
RSRCLNG  EQU   RSRCEND-RSEXT       MAX LENGTH OF RSEXT                  03750000
         POP   PRINT                                                    04050000
         MEND  , */                                                     04100000
*%EDGRSEXT1:;                                                           04150000
*%IHALPUSH = '@LISTPUSH';                                               04200000
*%IHALOFF  = '@LISTOFF';                                                04250000
*%IHALPOP  = '@LISTPOP';                                                04300000
*IHALPUSH;                                                              04350000
*%IF IHALIST='YES' %THEN                                                04400000
* %GOTO EDGRSEXT7;                                                      04450000
*IHALOFF;                                                               04500000
*%EDGRSEXT7:; /* P L S M A P P I N G S T A R T */                       04550000
*/********************************************************************/ 04552300
*/*                                                                  */ 04554600
*/* Common Name:          RMM Report Extract File Storage Location   */ 04556900
*/*                       Bin Record                                 */ 04559200
*/* Macro ID:             EDGRSEXT                                   */ 04561500
*/* DSECT Name:           RSEXT                                      */ 04563800
*/* Owning Component:     DFSMSrmm (DF186)                           */ 04566100
*/* Eye-Catcher ID:       S                                          */ 04568400
*/* Storage Attributes:   Subpool:   N/A                             */ 04570700
*/*                       Key:       N/A                             */ 04573000
*/*                       Residency: N/A                             */ 04575300
*/* Size:                 See STRUCTURE length                       */ 04577600
*/* Created by:           EDGHSKP                                    */ 04579900
*/* Pointed to by:        Assembler - USING on RSEXT                 */ 04582200
*/*                       PL/X      - %INCLUDE EDGRSEXT              */ 04584500
*/* Serialization:        None                                       */ 04586800
*/* Function:             Maps the RMM report extract file storage   */ 04589100
*/*                       location bin record.                       */ 04590800
*/* In this record the date format depends on the DATEFORM selected  */ 04592500
*/* by EDGHSKP execution parameter or the parmlib specified value.   */ 04594200
*/********************************************************************/ 04596000
*DCL                                                                    04600000
*  1 RSEXT     BASED,               ]                              @06C 04628900
*    2 RSTYPE   CHAR(1),            ] Record type C'S'                  04863300
*    2 RSTYPE2  CHAR(1),            ] Bin record ID: one of E - empty   04895400
*                                   ] bin, U - assigned bin        @001 04927500
*    2 RSRMSTID CHAR(8),            ] Storage location name             04959600
*    2 *        CHAR(1),            ] Reserved                          04991700
*    2 RSBINNO  CHAR(6),            ] Bin number                        05023800
*    2 RSBMEDN  CHAR(8),            ] Bin media name               @S1A 05055900
*    2 *        CHAR(23),           ] Reserved                     @S1C 05088000
*/********************************************************************/ 05116900
*/* Start of common fields:                                          */ 05145800
*/* The common fields are in the same place in each record type      */ 05174700
*/* in the report extract file.  This allows common processing of    */ 05203600
*/* these fields across multiple record types.                       */ 05232500
*/********************************************************************/ 05261400
*    2 RSCRDATE CHAR(10),           ] Create date of bin record         05290900
*    2 RSCRTIME CHAR(6),            ] Create time (HHMMSS) of bin       05317100
*                                   ] record                            05343300
*    2 RSCRSID  CHAR(8),            ] Create system ID of bin record    05369500
*    2 RSLCDATE CHAR(10),           ] Last change date of bin record    05395700
*    2 RSLCTIME CHAR(6),            ] Last change time (HHMMSS) of bin  05421900
*                                   ] record                            05448100
*    2 RSLCUID  CHAR(8),            ] Last change user ID of bin record 05474300
*    2 RSLCSID  CHAR(8),            ] Last change system ID of bin      05500500
*                                   ] record                            05526000
*/********************************************************************/ 05551500
*/* End of common fields                                             */ 05576300
*/********************************************************************/ 05601100
*    2 RSVOLSER CHAR(6),            ] Current volume               @SCC 05626200
*    2 RsMovingInVol CHAR(6),       ] Moving-in volume             @K1C 05638100
*    2 RsMovingOutvol CHAR(6),      ] Moving-out volume            @K1C 05650000
*    2 RsOldVol CHAR(6),            ] Old volume                   @K1C 05661900
*    2 RSUCDATE CHAR(10),           ] Last "user" change date      @OBA 05673900
*    2 RSUCTIME CHAR(6),            ] Last "user" change time      @OBA 05677500
*                                   ] (HHMMSS)                     @OBA 05681100
*    2 RSRCEND  CHAR(0);            ] End of RSEXT                      05685000
*DCL                                                                    05700000
*   RSTYPER  CHAR(1) CONSTANT('E'), ] E - empty bin                     05750000
*   RSTYPES  CHAR(1) CONSTANT('U'); ] U - assigned bin                  05800000
*                                                                       05850000
*IHALPOP; /* P L S  M A P P I N G  C O M P L E T E */                   06050000
