* %GOTO EDGRREXT1; /* BILINGUAL MAPPING                                 00050000
         MACRO                                                          00100000
         EDGRREXT &LIST=NO,&DSECT=YES     **                            00150000
*********************************************************************** 00200000
***                                                                  ** 00250000
***      RMM REPORT EXTRACT FILE RACK NUMBER RECORD (RREXT)          ** 00300000
***                                                                  ** 00350000
*********************************************************************** 00400000
*  z/OS DFSMSrmm V1R13                                                * 00440000
*                                                                     * 00480000
* PROPRIETARY V3 STATEMENT                                            * 00520000
* LICENSED MATERIALS - PROPERTY OF IBM                                * 00560000
* "RESTRICTED MATERIALS OF IBM"                                       * 00600000
* 5694-A01                                                            * 00640000
* COPYRIGHT 1993,2011  IBM CORP.                                      * 00680000
* STATUS = HDZ1D10                                                    * 00720000
* END PROPRIETARY V3 STATEMENT                                        * 00760000
*********************************************************************** 00800000
***                                                                  ** 00850000
***                                                                  ** 00900000
***                                                                  ** 00950000
*** FUNCTION : EDGRREXT MAPS THE RMM REPORT EXTRACT FILE RACK        ** 01000000
***            NUMBER RECORD                                         ** 01050000
***                                                                  ** 01100000
*** LOCATION : N/A                                                   ** 01150000
***                                                                  ** 01200000
*** METHOD OF ACCESS:                                                ** 01250000
***            ASSEMBLER - USING ON RREXT                            ** 01300000
***            PLAS      - %INCLUDE EDGRREXT                         ** 01350000
***                                                                  ** 01400000
*** LISTING  : ASSEMBLER - SPECIFY LIST=YES ON THE MACRO             ** 01450000
***            PLAS      - SPECIFY %IHALIST='YES' BEFORE INCLUDE     ** 01500000
***                                                                  ** 01550000
*** $MAC(EDGRREXT) COMP(DF186) PROD(RMM) : Extract file rack record  ** 01566600
***                                                                  ** 01583200
*** CHANGE ACTIVITY:                                                 ** 01600000
***            26/MAR/91    001/177178  REDUCE RECORD LENGTH   @001  ** 01650000
**      09/09/91 DSP   PRODUCT NAME CHANGE                         @RMM 01700000
*** DCR005 ,MC,110892, BILINGUAL MAINTENANCE                    @002 ** 01750000
***        ,WD,110992, correct copyright                        @003 ** 01787500
*** $04=OW06843,120,010894,WK : DELETE FIXED LEN. REPORT RECORD @04A ** 01825000
*** $05=OW15547,120,950713,WK : Add support for sample reports  @05A ** 01837500
*** $06=OW20013,130,960417,MWW: Improve comments                @06A ** 01843700
*** $O3=RMMMAP ,1RC,091030,BRB: PLXMAP cleanups                 @O3A ** 01846800
*** $OB=RMMLCD ,1RD,100510,BRB: 30 Last change details          @OBA ** 01873400
*********************************************************************** 01900000
         PUSH  PRINT                                                    01950000
         AIF   ('&LIST' EQ 'YES').ASMLIST                               02000000
         PRINT OFF                                                      02050000
.ASMLIST ANOP                                                           02100000
         SPACE 1                                                        02150000
         AIF   ('&DSECT' EQ 'YES').GENDSCT                              02200000
         AGO   .GENSTRT                                                 02250000
.GENDSCT ANOP                                                           02300000
RREXT    DSECT                                                          02350000
.GENSTRT ANOP                                                           02400000
*********************************************************************   02406200
* RREXT:    This macro maps the information produced for rack number*   02412400
*           records in the RMM report extract file.                 *   02418600
*           In this record the date format depends on the DATEFORM  *   02424800
*           selected by EDGHSKP execution parameter or the parmlib  *   02431000
*           specified value.                                        *   02437200
*********************************************************************   02443400
*                                                                       02450000
RRTYPE   DS    C                   RECORD TYPE - C'R'                   02453100
RRTYPE2  DS    C                   RACK RECORD ID: ONE OF:              02456200
RRTYPEE  EQU   C'E'                E - EMPTY RACK                       02459300
RRTYPEF  EQU   C'F'                F - FREE/SCRATCH RACK                02462400
RRTYPEU  EQU   C'U'                U - IN USE RACK                      02465500
         DS    CL2                 RESERVED                             02468600
RRRACK   DS    CL6                 RACK NUMBER                          02471700
RRNAME   DS    CL8                 MEDIA NAME                      @05C 02474800
RRUNIT   EQU   RRNAME,8            Old name for RRNAME field       @05A 02477900
         DS    CL30                RESERVED SO CRDATE IN SAMEPLACE      02481000
*********************************************************************   02484100
*  Start of common fields:                                          *   02487200
*  The common fields are in the same place in each record type      *   02490300
*  in the report extract file.  This allows common processing of    *   02493400
*  these field across multiple record types.                        *   02496500
*********************************************************************   02499600
RRCRDATE DS    CL10                CREATE DATE of rack record           02502700
RRCRTIME DS    CL6                 CREATE TIME (HHMMSS) of rack         02505800
*                                  record                               02508900
RRCRSID  DS    CL8                 CREATE SYSTEM ID of rack record      02512000
RRLCDATE DS    CL10                LAST CHANGE DATE of rack record      02515100
RRLCTIME DS    CL6                 LAST CHANGE TIME (HHMMSS) of rack    02518200
*                                  record                               02521300
RRLCUID  DS    CL8                 LAST CHANGE USER ID of rack          02524400
*                                  record                               02527500
RRLCSID  DS    CL8                 LAST CHANGE SYSTEM ID of rack        02530600
*                                  record                               02533700
*********************************************************************   02536800
*  End of common fields                                             *   02539900
*********************************************************************   02543000
RRVOLSER DS    CL6                 ASSIGNED VOLUME SERIAL NUMBER        02546100
RRUCDATE DS    CL10                LAST "USER" CHANGE DATE         @OBA 02547400
RRUCTIME DS    CL6                 LAST "USER" CHANGE TIME (HHMMSS)@OBA 02548700
*                                                                       02550000
* END OF REPORT EXTRACT RACK NUMBER RECORD                              02600000
*                                                                       03550000
RRRCEND  DS    0C                  END OF RREXT                    @001 03600000
RRRCLNG  EQU   RRRCEND-RREXT       MAX LENGTH OF RREXT                  03650000
         POP   PRINT                                                    03950000
         MEND  , */                                                     04000000
*%EDGRREXT1:;                                                           04050000
*%IHALPUSH = '@LISTPUSH';                                               04100000
*%IHALOFF  = '@LISTOFF';                                                04150000
*%IHALPOP  = '@LISTPOP';                                                04200000
*IHALPUSH;                                                              04250000
*%IF IHALIST='YES' %THEN                                                04300000
* %GOTO EDGRREXT6;                                                      04350000
*IHALOFF;                                                               04400000
*%EDGRREXT6:; /* P L S M A P P I N G S T A R T */                       04450000
*/********************************************************************/ 04452500
*/*                                                                  */ 04455000
*/* Common Name:          RMM Report Extract File Rack Number Record */ 04457500
*/* Macro ID:             EDGRREXT                                   */ 04460000
*/* DSECT Name:           RREXT                                      */ 04462500
*/* Owning Component:     DFSMSrmm (DF186)                           */ 04465000
*/* Eye-Catcher ID:       R                                          */ 04467500
*/* Storage Attributes:   Subpool:   N/A                             */ 04470000
*/*                       Key:       N/A                             */ 04472500
*/*                       Residency: N/A                             */ 04475000
*/* Size:                 See STRUCTURE length                       */ 04477500
*/* Created by:           EDGHSKP                                    */ 04480000
*/* Pointed to by:        Assembler - USING on RREXT                 */ 04482500
*/*                       PL/X      - %INCLUDE EDGRREXT              */ 04485000
*/* Serialization:        None                                       */ 04487500
*/* Function:             Maps the RMM report extract file rack      */ 04490000
*/*                       number record.                             */ 04491800
*/* In this record the date format depends on the DATEFORM selected  */ 04493600
*/* by EDGHSKP execution parameter or the parmlib specified value.   */ 04495400
*/********************************************************************/ 04497500
*DCL                                                                    04500000
*  1 RREXT     BASED,               ]                              @04C 04526900
*    2 RRTYPE   CHAR(1),            ] Record type - C'R'                04743800
*    2 RRTYPE2  CHAR(1),            ] Rack record ID: one of E - empty  04773200
*                                   ] rack, F - free/scratch rack, U -  04802600
*                                   ] in use rack                       04832000
*    2 *        CHAR(2),            ] Reserved                          04861400
*    2 RRRACK   CHAR(6),            ] Rack number                       04890800
*    2 RRNAME   CHAR(8),            ] Media name                   @05C 04920200
*      3 RRUNIT   CHAR(8),          ] Old name for RRNAME field    @05A 04949600
*    2 *        CHAR(30),           ] Reserved                          04979000
*/********************************************************************/ 05006200
*/* Start of common fields:                                          */ 05033400
*/* The common fields are in the same place in each record type      */ 05060600
*/* in the report extract file.  This allows common processing of    */ 05087800
*/* these fields across multiple record types.                       */ 05115000
*/********************************************************************/ 05142200
*    2 RRCRDATE CHAR(10),           ] Create date of rack record        05170000
*    2 RRCRTIME CHAR(6),            ] Create time (HHMMSS) of rack      05196800
*                                   ] record                            05223600
*    2 RRCRSID  CHAR(8),            ] Create system ID of rack record   05250400
*    2 RRLCDATE CHAR(10),           ] Last change date of rack record   05277200
*    2 RRLCTIME CHAR(6),            ] Last change time (HHMMSS) of rack 05304000
*                                   ] record                            05330800
*    2 RRLCUID  CHAR(8),            ] Last change user ID of rack       05357600
*                                   ] record                            05384400
*    2 RRLCSID  CHAR(8),            ] Last change system ID of rack     05411200
*                                   ] record                            05438000
*/********************************************************************/ 05464900
*/* End of common fields                                             */ 05491800
*/********************************************************************/ 05518700
*    2 RRVOLSER CHAR(6),            ] Assigned volume serial number     05545600
*    2 RRUCDATE CHAR(10),           ] Last "user" change date      @OBA 05552400
*    2 RRUCTIME CHAR(6),            ] Last "user" change time      @OBA 05559200
*                                   ] (HHMMSS)                     @OBA 05566000
*    2 RRRCEND  CHAR(0);            ] End of RREXT                      05572800
*DCL                                                                    05600000
*   RRTYPEE  CHAR(1) CONSTANT('E'), ] E - empty rack                    05650000
*   RRTYPEF  CHAR(1) CONSTANT('F'), ] F - free/scratch rack             05700000
*   RRTYPEU  CHAR(1) CONSTANT('U'); ] U - in use rack                   05750000
*                                                                       05800000
*IHALPOP; /* P L S  M A P P I N G  C O M P L E T E */                   06050000
