* %GOTO EDGRVEXT1; /* BILINGUAL MAPPING                                 00050000
         MACRO                                                          00100000
         EDGRVEXT &LIST=NO,&DSECT=YES     **                            00150000
************************************************************ ********** 00200000
***                                                                  ** 00250000
***      RMM REPORT EXTRACT FILE VOLUME RECORD (RVEXT)               ** 00300000
***                                                                  ** 00350000
*********************************************************************** 00400000
*** z/OS DFSMSrmm V2R4                                               ** 00440000
***                                                                  ** 00480000
***PROPRIETARY V3 STATEMENT                                          ** 00530000
***LICENSED MATERIALS - PROPERTY OF IBM                              ** 00580000
***"RESTRICTED MATERIALS OF IBM"                                     ** 00630000
***5650-ZOS                                                          ** 00667500
***COPYRIGHT IBM CORP. 1993,2019                                     ** 00705000
***STATUS = HDZ2240                                                  ** 00742500
***END PROPRIETARY V3 STATEMENT                                      ** 00780000
*********************************************************************** 00960000
***                                                                  ** 01000000
*** FUNCTION : EDGRVEXT MAPS THE RMM REPORT EXTRACT FILE VOLUME      ** 01050000
***            RECORD                                                ** 01100000
***                                                                  ** 01150000
*** LOCATION : N/A                                                   ** 01200000
***                                                                  ** 01250000
*** METHOD OF ACCESS:                                                ** 01300000
***            ASSEMBLER - USING ON RVEXT                            ** 01350000
***            PLAS      - %INCLUDE EDGRVEXT                         ** 01400000
***                                                                  ** 01450000
*** LISTING  : ASSEMBLER - SPECIFY LIST=YES ON THE MACRO             ** 01500000
***            PLAS      - SPECIFY %IHALIST='YES' BEFORE INCLUDE     ** 01550000
***                                                                  ** 01600000
** $MAC(EDGRVEXT) COMP(DF186) PROD(RMM) : Extract file volume record ** 01616600
***                                                                  ** 01633200
*** CHANGE ACTIVITY:                                                 ** 01650000
***    PMR 176985 REMOVE MVDELDAT FROM MVREC - @001 GGT              ** 01700000
***     26/MAR/91    002/177178   REDUCE RECORD LENGTH          @002 ** 01750000
***     09/APR/91    003/177057   REMOVE COMMENTS               @003 ** 01800000
***     07/JUN/91    004/177258   AUL/SUL LABEL TYPES           @004 ** 01850000
***     07/JUN/91    005/177239   MVLABNO1 TRANSLATION          @005 ** 01900000
***     09/09/91 DSP   PRODUCT NAME CHANGE                         @RMM 01950000
*** 265126 ,MC,280592,INCREASE TAPE USAGE (KB)                  @006 ** 02000000
*** DCR005 ,MC,110892, BILINGUAL MAINTENANCE                    @007 ** 02050000
*** DCR011 ,MC,120892, NEW FIELDS                               @008 ** 02100000
*** 271542 ,MC,190593,Dsname missing for vol report extract     @009 ** 02150000
*** $10=OW06843,110,010894,WK : DELETE FIXED LEN. REPORT RECORD @10A ** 02166600
*** $S1=SPESLOC,110,032994,ADM: NEW FIELDS FOR > 3 STORES SPE   @S1A ** 02183200
*** $10=OW03047,110,160594,MRC: NEW FIELD LUDEV                 @10A ** 02191600
*** $S2=OW08149,110,300694,ADM: Support for VRS by job name SPE @S2A ** 02195800
*** $S4=BLYTHE ,120,950205,GEM: BLYTHE SPE                      @S4A ** 02196800
*** $12=OW15547,120,950713,WK : Add support for sample reports  @12A ** 02197900
*** $13=OW20013,130,960417,MWW: Improve comments                @13A ** 02198900
*** $S7=OW30969,140,971217,AE : VRS Enhancements                @S7A ** 02199400
*** $S8=OW36350,150,980819,GW : VTS Export/Import               @S8A ** 02199700
*** $LG=RMM210 ,210,990426,CHK: VTS Export/Import Enhancement   @LGA ** 02206400
*** $LF=RMM210 ,210,990426,CHK: VOLSET SUPPORT                  @LFA ** 02213100
*** $S9=BLYTHE2,210,990818,OB : Blythe 2 support                @S9A ** 02219800
*** $K1=K160625,210,991025,OG : Compile informational msgs      @K1A ** 02226500
*** $14=OW45430,210,000726,GB : RVSTACKED_VOLCOUNT printable    @14A ** 02236200
***                             format                          @14A ** 02240800
*** $LL=RMM213 ,213,010216,BDG: >9999 tape files                @LLA ** 02243100
* $15=OW47651,150,010418,WS : Extended extract record              @15A 02245400
* $16=OW48921,150,010428,ZB : First file creation system ID        @16A 02247700
* $SC=OW49863,210,010410,AP : Minimal Bin Assignment               @SCA 02265100
* $LS=RMMV1R5,1R5,011113,CHK: Duplicate Volser                     @LSA 02273800
* $SE=RMM213 ,213,020307,BDG: 3590 MODEL H SUPPORT                 @SeA 02278100
* $17=OW54630,213,020523,WS : >9999 tape files correction          @17A 02280300
* $18=OA02094,210,030115,WS : Report generator enhancements        @18A 02281400
* $SF=OA02206,1R3,030516,BDG: 3592 MODEL J SUPPORT                 @SFA 02281900
* $SG=OA07100,1R5,040130,WS : D/T3592 support new media types      @SGA 02282200
* $SH=OA13102,1R6,050531,WS : 3592 GEN 2 Support                   @SHA 02282400
* $K2=KFI0394,1R8,051206,MB : GT 9999 read / write error value     @K2A 02285300
* $SI=RMMV1R9,1R9,060401,BRB: Support for report 17                @SIA 02288200
* $SJ=OA17574,1R8,060728,WS : Tape Encryption Support              @SJA 02291100
* $19=OA13370,1R6,050122,WS : Media Information Support            @19A 02292500
* $20=OA23266,1R7,071214,WS : IRMM support                         @20A 02293200
* $21=OA24896,1R8,080604,LM : GT 9999 volume use count value       @21A 02293600
* $SK=OA22132,1R7,070831,WS : 3592-G3 Support                      @SKA 02293800
* $22=OA28930,1R8,090525,ZH : Change the format of some fields     @22A 02293900
* $O0=RMMAS1 ,1RB,090915,BRB: volume HOLD attribute                @O0A 02295900
* $O3=RMMMAP ,1RC,091125,WS : PLXMAP cleanups                      @O3A 02296900
* $O8=RMMESB ,1RD,100505,AP : 5.2.2.2 Expiry date set by           @O8A 02297100
* $OB=RMMLCD ,1RD,100510,BRB: 30 Last change details               @OBA 02297400
* $23=OA33070,1R9,100524,GB : 6-byte RVCONTNR_STV                  @23A 02297600
* $OG=RMMRM3 ,1RD,100726,WS : 5.2.5.3 RETENTIONMETHOD              @OGA 02297700
* $OQ=RMMLRD ,2R1,110731,WS : 75.1.1 LASTREF extra days            @OQA 02298200
* $OS=RMMMAO ,2R1,110731,WS : 75.1.2 EXPDT_RETAINBY                @OSA 02298700
* $SO=OA33958,1RC,101103,ZB : 3592-G4 Support                      @SOA 02298900
* $OV=RMMEME ,2R1,110831,WS : 75.2.1 Management class expiration   @OVA 02299000
* $M2=FP0882 ,2R2,141106,VT : New RM(EX) values support( SM03105)  @M2A 02299010
* $M5=FP1391 ,2R3,150610,VT : New Managmnt Class attr support      @M5A 02299020
* $M3=151046 ,2R3,161223,AVK: deftable setby constants             @M3A         
* $K3=258448, 2R4,180705,VD : RGE: Ensure type numeric for fields  @K3A 02299040
*                           : fixing FVT finding                   @K3A 02299045
* $M7=261985, 2R4,180716,KG : Add EDM to report extract data set   @M7A 02299050
*****************+***************************************************** 02299200
         PUSH  PRINT                                                    02300000
         AIF   ('&LIST' EQ 'YES').ASMLIST                               02350000
         PRINT OFF                                                      02400000
.ASMLIST ANOP                                                           02450000
         SPACE 1                                                        02500000
         AIF   ('&DSECT' EQ 'YES').GENDSCT                              02550000
         AGO   .GENSTRT                                                 02600000
.GENDSCT ANOP                                                           02650000
RVEXT    DSECT                                                          02700000
.GENSTRT ANOP                                                           02750000
*********************************************************************   02756200
* RVEXT:    This macro maps the information produced for volume     *   02762400
*           records in the RMM report extract file.                 *   02768600
*           In this record the date format depends on the DATEFORM  *   02774800
*           selected by EDGHSKP execution parameter or the parmlib  *   02781000
*           specified value.                                        *   02787200
*********************************************************************   02793400
*                                                                       02800000
RVTYPE   DS    C                   RECORD TYPE - C'V'                   02800500
         DS    CL3                 RESERVED                             02801000
RVVOLSER DS    CL6                 VOLUME SERIAL NUMBER                 02801500
RVPVOL   DS    CL6                 PREVIOUS VOLUME IN SEQUENCE     @12A 02802000
RVNVOL   DS    CL6                 NEXT VOLUME IN SEQUENCE         @12A 02802500
RVSTVOL  DS    CL6                 STACKED VOLUME VOLSER (SV/LV)   @SIC 02803000
*********************************************************************   02803500
* RVMDMVID: Is a unique token assigned to every volume and every    *   02804000
*           data set in a multi-volume set.                         *   02804500
*********************************************************************   02805000
RVMDMVID DS    CL8                 MULTI-DSET MULT-VOL ID          @12A 02805500
         DS    CL12                RESERVED SO CRDATE SAMEPLACE    @12C 02806000
*********************************************************************   02806500
*  Start of common fields:                                          *   02807000
*  The common fields are in the same place in each record type      *   02807500
*  in the report extract file.  This allows common processing of    *   02808000
*  these field across multiple record types.                        *   02808500
*********************************************************************   02809000
RVCRDATE DS    CL10                CREATE DATE of volume record         02809500
RVCRTIME DS    CL6                 CREATE TIME HHMMSS of volume record  02810000
RVCRSID  DS    CL8                 CREATE SYSTEM ID of volume record    02810500
RVLCDATE DS    CL10                LAST CHANGE DATE of volume record    02811000
RVLCTIME DS    CL6                 LAST CHANGE TIME HHMMSS of           02811500
*                                  volume record                        02812000
RVLCUID  DS    CL8                 LAST CHANGE USER ID of volume        02812500
*                                  record                               02813000
RVLCSID  DS    CL8                 LAST CHANGE SYSTEM ID of volume      02813500
*                                  record                               02814000
*********************************************************************   02814500
*  End of common fields                                             *   02815000
*********************************************************************   02815500
RVEXPDTO DS    CL10                EXPIRATION DATE  - original          02816000
RVEXPDT  DS    CL10                EXPIRATION DATE  - current           02816500
RVDEN    DS    CL4                 RECORDING DENSITY                    02817000
RVCOMP   DS    C                   COMPACTION USED - Y/N                02817500
RVDSNNO_OLD DS CL4                 NBR OF DSETS ON VOLUME <=9999   @17C 02818000
RVTUSE   DS    ZL10                TAPE USAGE IN KBYTES            @18C 02818500
*                             a -1 value indicates to use RVAPPUSE @SOM 02818700
RVUSE_OLD DS   CL4                 VOLUME USE COUNT   <=9999       @21C 02819000
RVLABNO1_OLD DS CL4                LABEL NO OF FIRST FILE <=9999   @17C 02819500
RVSTORID DS    CL8                 CURRENT LOCATION NAME: ONE OF:  @13C 02820000
*                                   SHELF, LOCAL, REMOTE, DISTANT  @008 02820500
*                                   INSTALLATION-DEFINED STORE,    @13A 02821000
*                                   OR SMS-DEFINED LIBRARY NAME    @008 02821500
RVDEST   DS    CL8                 DESTINATION NAME:  ONE OF:      @13C 02822000
*                                   SHELF, LOCAL, REMOTE, DISTANT  @008 02822500
*                                   INSTALLATION-DEFINED STORE,    @13A 02823000
*                                   OR SMS-DEFINED LIBRARY NAME    @008 02823500
*********************************************************************   02824000
* Bin Numbers: If a volume is not moving (RVTRANS=N), and is in a   *   02824500
*              storage location, RVSTBIN contains the current bin   *   02825000
*              number and RVOBIN the bin number in the previous     *   02825500
*              location.                                            *   02826000
*              If a volume is moving (RVTRANS=Y), and moving to a   *   02826500
*              storage location, RVSTBIN contains the target bin    *   02827000
*              number and RVOBIN the bin number in the source       *   02827500
*              location.                                            *   02828000
*********************************************************************   02828500
RVSTBIN  DS    CL6                 BIN NUMBER                           02829000
RVOBIN   DS    CL6                 PREVIOUS BIN NUMBER                  02829500
RVSTDATE DS    CL10                MOVEMENT TRACKING DATE               02830000
RVRETDAT DS    CL10                RETENTION DATE CALCULATED       @S2C 02830500
*                                   BY VRS PROCESSING              @S2A 02831000
RVLONLOC DS    CL8                 LOAN LOCATION                        02831500
RVOLNLOC DS    CL8                 PREVIOUS LOAN LOCATION               02832000
RVLRDDAT DS    CL10                DATE VOLUME LAST READ                02832500
RVLWTDAT DS    CL10                DATE VOLUME LAST WRITTEN             02833000
*********************************************************************   02833500
* Assigned date and time:                                           *   02834000
*    These fields are set each time a volume changes either from    *   02834500
*    or to scratch status.                                          *   02835000
*********************************************************************   02835500
RVASDATE DS    CL10                ASSIGNED DATE                        02836000
RVASTIME DS    CL6                 ASSIGNED TIME HHMMSS                 02836500
RVOWNID  DS    CL8                 VOLUME OWNER USERID                  02837000
RVCRUID  DS    CL8                 CREATING USERID                      02837500
RVCRJOB  DS    CL8                 CREATING JOBNAME                     02838000
RVSECLEV DS    CL8                 SECURITY LEVEL - SHORT               02838500
RVSECLNG DS    CL30                SECURITY LEVEL - LONG                02839000
RVVOLSEQ DS    CL4                 VOLUME SEQUENCE NUMBER               02839500
RVSTATUS DS    CL8                 VOLUME STATUS                        02840000
*                                  One of:     MASTER                   02840500
*                                              USER                     02841000
*                                              SCRATCH                  02841500
*                                              INIT                @008 02842000
*                                              ENTRY               @008 02842500
RVPENDRS DS    C                   VOLUME PENDING RELEASE - Y/N         02843000
RVVRS    DS    C                   VOLUME RETAINED BY VRS - Y/N         02843500
RVLOAN   DS    C                   VOLUME ON LOAN - Y/N                 02844000
RVOPEN   DS    C                   VOLUME IS OPENED - Y/N               02844500
RVOCER   DS    C                   VOLUME RECORDED BY O/C/EOV - Y/N     02845000
RVDEFRET DS    C                   PARMLIB DEFAULT RETENTION USED       02845500
*                                  TO GENERATE THE VOLUME EXPDT - Y/N   02846000
RVPPTAPE DS    C                   PROGRAM PRODUCT TAPE - Y/N           02846500
*********************************************************************   02847000
* Labels: The RVLABEL field provides information about what label   *   02847500
*         types may be written on the volume.  If BLP output has    *   02848000
*         been used, the volume may no longer match this            *   02848500
*         information.  Any BLP output beyond file 1 on a volume    *   02849000
*         is not recorded by RMM.                                   *   02849500
*********************************************************************   02850000
RVLABEL  DS    CL3                 LABEL TYPE SL/AL/NL/SUL/AUL     @004 02850500
RVBLP    DS    C                   VOLUME LAST WRITTEN BLP Y/N     @004 02851000
*********************************************************************   02851500
* Release Actions:  The following 5 fields list the actions to be   *   02852000
*              set for the volume when it is released.  These are   *   02852500
*              not the current actions.  See RVACTION for the       *   02853000
*              pending actions.                                     *   02853500
*********************************************************************   02854000
RVRETS   DS    CL8                 RETURN ACTION - OWNER/SCRATCH        02854500
RVREPL   DS    C                   REPLACE ON RELEASE - Y/N             02855000
RVINIT   DS    C                   REINITIALISE - Y/N                   02855500
RVERASE  DS    C                   SECURITY ERASE - Y/N                 02856000
RVNTFY   DS    C                   NOTIFY OWNER - Y/N                   02856500
RVOWNAC  DS    C                   OWNER ACCESS - R/U/A                 02857000
RVUSERAC DS    C                   USER ACCESS - R/U                    02857500
RVVMUSE  DS    C                   VM USE - Y/N                         02858000
RVMVSUSE DS    C                   MVS USE - Y/N                        02858500
RVNAME   DS    CL8                 MEDIA NAME                      @008 02859000
RVUNIT   EQU   RVNAME,8            Old name for RVNAME field       @008 02859500
RVRACK   DS    CL6                 RACK NUMBER                          02860000
RVTRERR_OLD DS ZL4                 TEMPORARY READ ERRORS   <=9999  @K2C 02860500
RVTWERR_OLD DS ZL4                 TEMPORARY WRITE ERRORS  <=9999  @K2C 02861000
RVPRERR_OLD DS ZL4                 PERMANENT READ ERRORS   <=9999  @K2C 02861500
RVPWERR_OLD DS ZL4                 PERMANENT WRITE ERRORS  <=9999  @K2C 02862000
*********************************************************************   02862500
* Product Information: Includes number, release and feature code    *   02863000
*********************************************************************   02863500
RVPPNUM  DS    CL8                 PROGRAM PRODUCT NUMBER               02864000
RVVER    DS    CL6                 VERSION/RELEASE/MOD NUMBER           02864500
RVFEAT   DS    CL4                 FEATURE CODE                         02865000
RVACCINF DS    CL40                ACCOUNTING INFORMATION               02865500
RVUSEFLD DS    CL30                USER DESCRIPTION                     02866000
RVACCLST DS    ZL3                 NUMBER OF ACCESS LIST ENTRIES   @K3C 02866500
RVAUTIDS DS    CL96                AUTHORISED USER IDS AREA             02867000
RVHLOC   DS    CL8                 HOME LOCATION NAME              @008 02867500
RVTRANS  DS    C                   VOLUME IN TRANSIT. ONE OF:      @008 02868000
*                                   Y-YES N-NO                     @008 02868500
RVLOCTYP DS    C                   LOCATION TYPE. ONE OF:          @008 02869000
*                                   A-AUTO, M-MANUAL, S-STORE      @008 02869500
*                                   OR BLANK                       @008 02870000
RVDESTYP DS    C                   DESTINATION TYPE. ONE OF:       @008 02870500
*                                   A-AUTO, M-MANUAL, S-STORE,     @12C 02871000
*                                   OR BLANK                       @008 02871500
RVOLOC   DS    CL8                 THE PREVIOUS LOCATION NAME      @008 02872000
RVSGNAME DS    CL8                 STORAGE GROUP NAME              @008 02872500
RVMEDREC DS    CL8                 VOLUME RECORDING FORMAT: ONE    @008 02873000
*                                   OF: *, 18TRACK, 36TRACK,       @008 02873300
*                                   128TRACK, 256TRACK, 384TRACK,  @SHC 02873500
*                                   EFMT1, EFMT2, EEFMT2,          @SJC 02873600
*                                   EFMT3, EEFMT3,                 @SOC 02873700
*                                   EFMT4, OR EEFMT4               @SOA 02873800
RVMEDTY  DS    CL8                 VOLUME MEDIA TYPE: ONE OF:      @008 02874000
*                                   *, CST, ECCST, HPCT, EHPCT,    @SFC 02874100
*                                   ETC, EWTC, EETC, EEWTC,        @SHC 02874400
*                                  EXTC, EXWTC, EATC, EAWTC, EAETC @SOC 02874700
RVMEDCMP DS    CL8                 COMPACTION TECHNIQUE: ONE OF:   @008 02875000
*                                   *, NONE, YES                   @S4C 02875500
RVMEDATR DS    CL8                 SPECIAL ATTRIBUTES: ONE OF:     @008 02876000
*                                   NONE, RDCOMPAT                 @008 02876500
RVDSNAM1 DS    CL44                FIRST FILE DATA SET NAME        @009 02877000
RVMVMODE DS    C                   MOVE MODE, ONE OF               @S1A 02877500
*                                   A-AUTOMOVE, M-MANUALMOVE       @S1A 02878000
RVDSNREC DS    CL1                 DS RECORDING: Y=YES, N=NO       @S4A 02878100
RVALVERS DS    CL2                 ANSI LABEL VERSIONS             @LBC 02878200
RVALCUR  EQU   RVALVERS,1          CURRENT  LABEL VERSION          @LBA 02878300
*                                  ONE OF BLANK, 1,3, OR 4.        @LBA 02878400
RVALREQ  EQU   RVALVERS+1,1        REQUIRED LABEL VERSION          @LBA 02878500
*                                  ONE OF BLANK, 3, OR 4.          @LBA 02878600
RVBMEDN  DS    CL8                 BIN MEDIA NAME                  @S1A 02879000
RVOBMEDN DS    CL8                 PREVIOUS BIN MEDIA NAME         @S1A 02879500
RVNLOC   DS    CL8                 REQUIRED LOCATION NAME - AS     @S1A 02880000
*                                  DETERMINED BY VRS OR COMMAND    @13A 02880500
RVLUDEV  DS    CL4                 LAST USED DRIVE                 @10A 02881000
*********************************************************************   02881500
* Pending Actions:  The following fields list the actions required  *   02882000
*              for the volume.  See RVRETS for the actions set      *   02882500
*              when the volume is released.                         *   02883000
*********************************************************************   02883500
RVACTION DS    0CL8                PENDING ACTIONS                 @12A 02884000
RVACTSCR DS    CL1                  RETURN TO SCRATCH Y/N          @12A 02884500
RVACTREP DS    CL1                  REPLACE VOLUME    Y/N          @12A 02885000
RVACTRET DS    CL1                  RETURN TO OWNER   Y/N          @12A 02885500
RVACTINI DS    CL1                  INITIALIZE        Y/N          @12A 02886000
RVACTERA DS    CL1                  ERASE             Y/N          @12A 02886500
RVACTNOT DS    CL1                  NOTIFY            Y/N          @12A 02887000
RVACTRSV DS    CL2                 RESERVED                        @12A 02887500
RVABEND  DS    CL1                 DATA SET CLOSED BY ABEND: ONE   @12A 02888000
*                                   OF: Y-YES OR N-NO              @13A 02888500
RVHOMTYP DS    CL1                 HOME LOCATION TYPE. ONE OF:     @12A 02889000
*                                   A-AUTO, M-MANUAL, OR BLANK     @12A 02889500
RVNEXTYP DS    CL1                 NEXT LOCATION TYPE. ONE OF:     @12A 02890000
*                                   A-AUTO, M-MANUAL, S-STORE,     @12A 02890500
*                                   OR BLANK.                      @12A 02891000
*                                                                  @S8A 02891500
RVVOLTYPE DS    CL1                VOLUME TYPE                     @S8A 02892000
RVVOLTYPE_LOGICAL  EQU C'L',1,C'C'                                 @LGC 02892300
RVVOLTYPE_PHYSICAL EQU C'P',1,C'C'                                 @LGC 02892600
RVVOLTYPE_STACKED  EQU C'S',1,C'C'                                 @LGA 02892900
*                                                                  @S8A 02893500
RVVRSREL DS    0CL8                VRS RELEASE OPTIONS             @S7A 02894000
RVRELIXD DS    CL1                 IGNORE EXPDT      Y/N           @S7A 02895500
RVRELSI  DS    CL1                 SCRATCH IMMEDIATE Y/N           @S7A 02897000
RVRELRSV DS    CL6                 RESERVED                        @S7A 02898500
RVCONTNR DS    CL16                IN CONTAINER NAME               @S8A 02899000
RVCONTNR_STV   EQU RVCONTNR,6      STACKED VOLUME CONTAINER        @23A 02899200
RVRQPRTY DS    CL4                 MOVEMENT PRIORITY               @S8A 02899500
RVCAPACITY DS  ZL10                Volume capacity                 @22C 02900700
*                                  RVCAPACITY is FACTORED          @SKA 02901900
RVRBYSET DS    C                   VOLUME RETAINED BY SET          @LFA 02903300
RVSTACKVOL_ENABLED DS C            STACKED VOLUME RECORD ENABLED   @LGA 02907100
*                                  AND SYNCHRONIZED.               @LGA 02910900
RVEXPTOKEN         DS CL8          UNIQUE VALUE CREATED AT START   @LGA 02914700
*                                  OF EXPORT TO A NEW STACKED      @LGA 02918500
*                                  VOLUME. ALL VOLUMES IN A STACKED@LGA 02922300
*                                  VOLUME HAVE THE SAME UNIQUE VALU@LGA 02926100
RVSTACKED_VOLCOUNT DS ZL10         COUNT OF VOLUMES STACKED ON A   @22C 02931800
*                                  VOLUME. MAINTAINED IF STACKED   @LGA 02937500
*                                  VOLUME FULLY ENABLED.           @LGA 02941300
RVPERCENT DS   ZL3                 Volume percentage full          @K3C 02943200
RVDSNNO  DS    ZL5                 NUMBER OF DATASETS ON VOLUME    @22C 02943800
RVLABNO1 DS    CL5                 LABEL NO OF FIRST FILE ON VOL   @LLA 02944400
RVDCRSID DS    CL8                 FIRST FILE CREATE SYSTEM ID     @16A 02944500
         DS    CL1                 Reserved                        @16C 02944600
*                                                                       02944700
RvDestBin      DS  CL6             Destination Bin Number          @SCA 02944800
RvDestBinMedia DS  CL8             Destination Bin Media Number    @SCA 02944900
RvVol1         DS  CL6             VOL1 label volser               @LSA 02945000
RvVendor       DS  CL8             Vendor information              @SGA 02946000
RvWWID         DS  CL24            Unique World wide ID            @SGA 02947000
RvVwmc         DS  ZL5             Write mount count               @SGA 02948000
RVTRERR        DS  ZL5             Temporary read errors           @K2A 02948200
RVTWERR        DS  ZL5             Temporary write errors          @K2A 02948400
RVPRERR        DS  ZL5             Permanent read errors           @K2A 02948600
RVPWERR        DS  ZL5             Permanent write errors          @K2A 02948800
*********************************************************************   02948900
* RvKeyLabel1/RvKeyLabel2:                                          *   02949000
*               These fields may contain unprintable characters.    *   02949100
*********************************************************************   02949200
RvKeyLabel1    DS  CL64            Encryption Key Label 1          @SJA 02949300
RvKeyEncod1    DS  CL5             Encrypt Key Encoding Method 1   @SJA 02949400
RvKeyLabel2    DS  CL64            Encryption Key Label 2          @SJA 02949500
RvKeyEncod2    DS  CL5             Encrypt Key Encoding Method 2   @SJA 02949600
*                                                                       02949700
RvMedinf       DS  CL8             Media Information               @19A 02949800
RvIRMMUSE      DS  C               IRMM USE - Y/N                  @20A 02999800
RvWORM         DS  C               WORM - Y/N                      @20A 03049800
RVFACTOR       DS  CL2             SPACE/SIZE FACTOR               @SKA 03053900
*                                  Applies to RVCAPACITY, RVAPPUSE,@SKA 03056600
*                                  RVPhys_Used                     @SOA 03059300
RVFACTOR_MB EQU C'MB'                                              @SKA 03062100
RVFACTOR_GB EQU C'GB'                                              @SKA 03066200
RVFACTOR_TB EQU C'TB'                                              @SKA 03070300
RVAPPUSE       DS  ZL10            DATA WRITTEN                    @SKA 03074400
*                                  RVAPPUSE is FACTORED            @SKA 03078500
RVUSE          DS  ZL5             VOLUME USE COUNT                @22C 03089100
RVHOLD         DS  C               VOLUME HOLD - Y/N               @O0A 03094400
RVESB          DS  CL10            Expdt set by                    @O8A 03095300
RVUCDATE       DS  CL10            LAST "USER" CHANGE DATE         @OBA 03096200
RVUCTIME       DS  CL6             LAST "USER" CHANGE TIME (HHMMSS)@OBA 03098000
RvRetMet       DS  CL5             Retention Method                @OGA 03098600
RvRMSB         DS  CL10            Retention Method Set By         @OGA 03099200
RVComp_Rat     DS  CL6             Compression ratio for the volume@SOA 03106600
*                                   in hundredths. Always showing  @SOA 03113700
*                                   2 decimal places               @SOA 03120800
RVPhys_Used    DS  ZL10            Actual space used by all files  @SOA 03127900
*                                   after compaction ( FACTORED )  @SOA 03135000
RvEXRB         DS  CL9             EXPDT Retainby                  @OSA 03138500
RVEDM          DS  C               VOLUME EDM - Y/N                @M7A 03138550
*                                                                       03142100
* END OF REPORT EXTRACT VOLUME RECORD                                   03149800
*                                                                       08000000
RVRCEND  DS    0C                  END OF RVEXT                    @002 08050000
RVRCLNG  EQU   RVRCEND-RVEXT       MAX LENGTH OF RVEXT                  08100000
         POP   PRINT                                                    08400000
         MEND  , */                                                     08450000
*%EDGRVEXT1:;                                                           08500000
*%IHALPUSH = '@LISTPUSH';                                               08550000
*%IHALOFF  = '@LISTOFF';                                                08600000
*%IHALPOP  = '@LISTPOP';                                                08650000
*IHALPUSH;                                                              08700000
*%IF IHALIST='YES' %THEN                                                08750000
* %GOTO EDGRVEXT7;                                                      08800000
*IHALOFF;                                                               08850000
*%EDGRVEXT7:; /* P L S M A P P I N G S T A R T */                       08900000
*/********************************************************************/ 08902300
*/*                                                                  */ 08904600
*/* Common Name:          RMM Extract File Volume Record             */ 08906900
*/* Macro ID:             EDGRVEXT                                   */ 08909200
*/* DSECT Name:           RVEXT                                      */ 08911500
*/* Owning Component:     DFSMSrmm (DF186)                           */ 08913800
*/* Eye-Catcher ID:       V                                          */ 08916100
*/* Storage Attributes:   Subpool:   N/A                             */ 08918400
*/*                       Key:       N/A                             */ 08920700
*/*                       Residency: N/A                             */ 08923000
*/* Size:                 See STRUCTURE length                       */ 08925300
*/* Created by:           EDGHSKP                                    */ 08927600
*/* Pointed to by:        Assembler - USING on RVEXT                 */ 08929900
*/*                       PL/X      - %INCLUDE EDGRVEXT              */ 08932200
*/* Serialization:        None                                       */ 08934500
*/* Function:             Maps the RVEXT structure to identify       */ 08936800
*/*                       the details within the RMM extract file    */ 08939100
*/*                       volume record.                             */ 08941400
*/* In this record the date format depends on the DATEFORM selected  */ 08941800
*/* by EDGHSKP execution parameter or the parmlib specified value.   */ 08942200
*/*                       -                                          */ 08942600
*/* Section RVEXT1 contains the data elements which are copied to    */ 08943000
*/*                section XVEXT1 of the extented (X) record as      */ 08943400
*/*                one block.                                        */ 08943800
*/* Section RVEXT2 contains the data elements which are copied to    */ 08944200
*/*                section XXMERGED of the extented (X) record on    */ 08944600
*/*                field level.                                      */ 08945000
*/********************************************************************/ 08946000
*DCL                                                                    08950000
*  1 RVEXT    BASED,                ]                              @10C 08977700
*  2 RVEXT1        ,                ] First data section           @15A 09027700
*    4 RVTYPE   CHAR(1),            ] Record type: C'V'                 09220000
*    4 *        CHAR(3),            ] Reserved                          09244200
*    4 RVVOLSER CHAR(6),            ] Volume serial number              09268400
*    4 RVPVOL   CHAR(6),            ] Previous volume in sequence  @12A 09292600
*    4 RVNVOL   CHAR(6),            ] Next volume in sequence      @12A 09316800
*    4 RVSTVOL  CHAR(6),            ] Stacked volume serial number @SIC 09341000
*/*******************************************************************   09365500
* RVMDMVID: Is a unique token assigned to every volume and every    *   09393200
*           data set in a multi volume set.                         *   09420900
********************************************************************/   09448600
*    4 RVMDMVID CHAR(8),            ] Multi data set multi volume ID    09476300
*    4 *        CHAR(12),           ] Reserved                          09504000
*/*******************************************************************   09531700
* Start of common fields:                                           *   09559400
* The common fields are in the same place in each record type       *   09587100
* in the report extract file.  This allows common processing of     *   09614800
* these fields across multiple record types.                        *   09642500
*********************************************************************/  09670200
*    4 RVCRDATE CHAR(10),           ] Create date of volume record      09695100
*    4 RVCRTIME CHAR(6),            ] Create time (HHMMSS) of volume    09720000
*                                   ] record                            09744900
*    4 RVCRSID  CHAR(8),            ] Create system ID of volume record 09769800
*    4 RVLCDATE CHAR(10),           ] Last change date of volume record 09794700
*    4 RVLCTIME CHAR(6),            ] Last change time (HHMMSS) of      09819600
*                                   ] volume record                     09844500
*    4 RVLCUID  CHAR(8),            ] Last change user ID of volume     09869400
*                                   ] record                            09894300
*    4 RVLCSID  CHAR(8),            ] Last change system ID of volume   09919200
*                                   ] record                            09944100
*    4 RVEXPDTO CHAR(10),           ] Expiration date - original        09969000
*    4 RVEXPDT  CHAR(10),           ] Expiration date - current         09993900
*    4 RVDEN    CHAR(4),            ] Recording density                 10018800
*    4 RVCOMP   CHAR(1),            ] Compaction used: Y, N             10043700
*    4 RVDSNNO_OLD CHAR(4),         ] Number of data sets on volume     10068600
*                                   ] <=9999                            10093500
*    4 RVTUSE   CHAR(10),           ] Tape usage in kilobytes           10118400
*    4 RVUSE_OLD CHAR(4),           ] Volume use count <=9999, a -1     10143300
*                                   ] value indicates to use RVAPPUSE   10168200
*    4 RVLABNO1_OLD CHAR(4),        ] Label number of first file <=9999 10193100
*    4 RVSTORID CHAR(8),            ] Current location name, one of:    10218000
*                                   ] SHELF, LOCAL, REMOTE, DISTANT,    10242900
*                                   ] installation-defined store,       10267800
*                                   ] SMS-defined library name          10292700
*    4 RVDEST   CHAR(8),            ] Destination name, one of:         10317600
*                                   ] SHELF, LOCAL, REMOTE, DISTANT,    10342500
*                                   ] installation-defined store,       10367400
*                                   ] SMS-defined library name          10392300
*/*******************************************************************   10418100
* Bin Numbers: If a volume is not moving (RVTRANS=N), and is in a   *   10445800
*              storage location, RVSTBIN contains the current bin   *   10473500
*              number and RVOBIN the bin number in the previous     *   10501200
*              location.                                            *   10528900
*              If a volume is moving (RVTRANS=Y), and moving to a   *   10556600
*              storage location, RVSTBIN contains the target bin    *   10584300
*              number and RVOBIN the bin number in the source       *   10612000
*              location.                                            *   10639700
*********************************************************************/  10667400
*    4 RVSTBIN  CHAR(6),            ] Store bin number                  10695100
*    4 RVOBIN   CHAR(6),            ] Old bin number                    10722800
*    4 RVSTDATE CHAR(10),           ] Date stored                       10750500
*    4 RVRETDAT CHAR(10),           ] Retention date calculated by VRS  10778200
*                                   ] processing                   @S2A 10805900
*    4 RVLONLOC CHAR(8),            ] Loan location                     10833600
*    4 RVOLNLOC CHAR(8),            ] Previous loan location            10861300
*    4 RVLRDDAT CHAR(10),           ] Date volume last read             10889000
*    4 RVLWTDAT CHAR(10),           ] Date volume last written          10916700
*/*******************************************************************   10944400
* Assigned date and time:                                           *   10972100
*    These fields are set each time a volume changes either from    *   10999800
*    or to scratch status.                                          *   11027500
*********************************************************************/  11055200
*    4 RVASDATE CHAR(10),           ] Assigned date                     11087000
*    4 RVASTIME CHAR(6),            ] Assigned time (HHMMSS)            11118800
*    4 RVOWNID  CHAR(8),            ] Volume owner user ID              11150600
*    4 RVCRUID  CHAR(8),            ] Creating user ID                  11182400
*    4 RVCRJOB  CHAR(8),            ] Creating job name                 11214200
*    4 RVSECLEV CHAR(8),            ] Security level - short            11246000
*    4 RVSECLNG CHAR(30),           ] Security level - long             11277800
*    4 RVVOLSEQ CHAR(4),            ] Volume sequence number            11309600
*    4 RVSTATUS CHAR(8),            ] Volume status, one of:            11341400
*                                   ] MASTER, USER, SCRATCH, INIT, ENTRY11373200
*    4 RVPENDRS CHAR(1),            ] Volume pending release: Y, N      11405000
*    4 RVVRS    CHAR(1),            ] Volume retained by VRS: Y, N      11436800
*    4 RVLOAN   CHAR(1),            ] Volume on load: Y, N              11468600
*    4 RVOPEN   CHAR(1),            ] Volume is opened: Y, N            11500400
*    4 RVOCER   CHAR(1),            ] Volume recorded by O/C/EOV: Y, N  11532200
*    4 RVDEFRET CHAR(1),            ] Parmlib default retention used to 11564000
*                                   ] generate the volume expiration    11595800
*                                   ] date: Y, N                        11627600
*    4 RVPPTAPE CHAR(1),            ] Program product tape: Y, N        11659400
*/*******************************************************************   11692300
* Labels: The RVLABEL field provides information about what label   *   11720000
*         types may be written on the volume.  If BLP output has    *   11747700
*         been used, the volume may no longer match this            *   11775400
*         information. Any BLP output beyond the first file on a    *   11803100
*         volume is not recorded by RMM.                            *   11830800
*********************************************************************/  11858500
*    4 RVLABEL  CHAR(3),            ] Label type: SL, AL, NL, SUL, AUL  11886200
*    4 RVBLP    CHAR(1),            ] Volume last written BLP: Y, N     11913900
*/*******************************************************************   11941600
* Release Actions: The following 5 fields list the actions to be    *   11969300
*              set for the volume when it is released.  These are   *   11997000
*              not the current actions.  See RVACTION for the       *   12024700
*              pending actions.                                     *   12052400
*********************************************************************/  12080100
*    4 RVRETS   CHAR(8),            ] Return action: OWNER, SCRATCH     12107800
*    4 RVREPL   CHAR(1),            ] Replace on release: Y, N          12135500
*    4 RVINIT   CHAR(1),            ] Reinitialize: Y, N                12163200
*    4 RVERASE  CHAR(1),            ] Security erase: Y, N              12190900
*    4 RVNTFY   CHAR(1),            ] Notify owner: Y, N                12218600
*    4 RVOWNAC  CHAR(1),            ] Owner access: R, U, A             12246300
*    4 RVUSERAC CHAR(1),            ] User access: R, U                 12274000
*    4 RVVMUSE  CHAR(1),            ] VM use: Y, N                      12301700
*    4 RVMVSUSE CHAR(1),            ] MVS use: Y, N                     12329400
*    4 RVNAME   CHAR(8),            ] Media name                        12357100
*      7 RVUNIT CHAR(8),            ] Old name for RVNAME field         12384800
*    4 RVRACK   CHAR(6),            ] Rack number                       12412500
*    4 RVTRERR_OLD CHAR(4),         ] Temporary read errors  <=9999     12440200
*    4 RVTWERR_OLD CHAR(4),         ] Temporary write errors <=9999     12467900
*    4 RVPRERR_OLD CHAR(4),         ] Permanent read errors  <=9999     12495600
*    4 RVPWERR_OLD CHAR(4),         ] Permanent write errors <=9999     12523300
*/*******************************************************************   12551000
* Product Information: Includes number, release and feature code    *   12578700
*********************************************************************/  12606400
*    4 RVPPNUM  CHAR(8),            ] Program product number            12631200
*    4 RVVER    CHAR(6),            ] Version / release / modification  12647700
*                                   ] level                             12664200
*    4 RVFEAT   CHAR(4),            ] Feature code                      12680800
*    4 RVACCINF CHAR(40),           ] Accounting information            12705600
*    4 RVUSEFLD CHAR(30),           ] User description                  12730400
*    4 RVACCLST CHAR(3),            ] Number of access list entries     12755200
*    4 RVAUTIDS CHAR(96),           ] Authorized user IDs area          12780000
*    4 RVHLOC   CHAR(8),            ] Home location name                12804800
*    4 RVTRANS  CHAR(1),            ] Volume in transit: Y, N           12829600
*    4 RVLOCTYP CHAR(1),            ] Location type, one of:            12854400
*                                   ] A-auto, M-manual, S-store, blank  12879200
*    4 RVDESTYP CHAR(1),            ] Destination type, one of:         12904000
*                                   ] A-auto, M-manual, S-store, blank  12928800
*    4 RVOLOC   CHAR(8),            ] Previous location name            12953600
*    4 RVSGNAME CHAR(8),            ] Storage group name                12978400
*    4 RVMEDREC CHAR(8),            ] Volume recording format, one of:  13003200
*                                   ] *, 18TRACK, 36TRACK, 128TRACK,    13028000
*                                   ] 256TRACK, 384TRACK, EFMT1, EFMT2, 13052800
*                                   ] EEFMT2, EFMT3, EEFMT3,       @SOC 13069300
*                                   ] EFMT4, OR EEFMT4             @SOA 13085800
*    4 RVMEDTY  CHAR(8),            ] Volume media type, one of:        13102400
*                                   ] *, CST, ECCST, HPCT, EHPCT,       13127200
*                                   ] MEDIA5 - ETC, MEDIA6 - EWTC,      13152000
*                                   ] MEDIA7 - EETC, MEDIA8 - EEWTC,    13176800
*                                   ] MEDIA9 - EXTC, MEDIA10 - EXWTC    13201600
*                                   ] MEDIA13 - EAETC              @SOA 13214000
*    4 RVMEDCMP CHAR(8),            ] Compaction technique, one of:     13226400
*                                   ] *, NONE, YES                      13251200
*    4 RVMEDATR CHAR(8),            ] Special attributes: NONE, RDCOMPAT13276000
*    4 RVDSNAM1 CHAR(44),           ] First file data set name          13300800
*    4 RVMVMODE CHAR(1),            ] Move mode: A-automove,            13325600
*                                   ] M-manualmove                      13350400
*    4 RVDSNREC CHAR(1),            ] Data set recording: Y, N          13375200
*    4 RVALVERS CHAR(2),            ] ANSI label versions               13400000
*      7 RVALCUR CHAR(1),           ] Current label version             13424800
*      7 RVALREQ CHAR(1),           ] Required label version            13449600
*    4 RVBMEDN  CHAR(8),            ] Bin media name                    13474400
*    4 RVOBMEDN CHAR(8),            ] Old bin media name                13499200
*    4 RVNLOC   CHAR(8),            ] Next location name                13524000
*    4 RVLUDEV  CHAR(4),            ] Last used drive                   13548800
*/*******************************************************************   13575900
* Pending Actions: The following fields list the actions required   *   13603600
*              for the volume. See RVRETS for the actions set       *   13631300
*              when the volume is released.                         *   13659000
*********************************************************************/  13686700
*    4 RVACTION CHAR(8),            ] Pending actions:                  13696200
*      7 RVACTSCR CHAR(1),          ] Return to scratch: Y, N           13705700
*      7 RVACTREP CHAR(1),          ] Replace volume:    Y, N           13715200
*      7 RVACTRET CHAR(1),          ] Return to owner:   Y, N           13724700
*      7 RVACTINI CHAR(1),          ] Initialize:        Y, N           13734200
*      7 RVACTERA CHAR(1),          ] Erase:             Y, N           13743700
*      7 RVACTNOT CHAR(1),          ] Notify:            Y, N           13753200
*      7 RVACTRSV CHAR(2),          ] Reserved                          13762700
*    4 RVABEND  CHAR(1),            ] Data set closed by ABEND: Y, N    13772200
*    4 RVHOMTYP CHAR(1),            ] Home location type, one of:       13781700
*                                   ] A-AUTO, M-MANUAL, blank           13791200
*    4 RVNEXTYP CHAR(1),            ] Next location type, one of:       13800700
*                                   ] A-AUTO, M-MANUAL, S-STORE, blank  13810200
*    4 RVVOLTYPE CHAR(1),           ] Volume type                       13819700
*    4 RVVRSREL CHAR(8),            ] VRS release options:              13829200
*      7 RVRELIXD CHAR(1),          ] Ignore expiration date: Y, N      13838700
*      7 RVRELSI  CHAR(1),          ] Scratch immediate Y, N            13848200
*      7 RVRELRSV CHAR(6),          ] Reserved                     @S7A 13857700
*    4 RVCONTNR CHAR(16),           ] In container name            @S8A 13867200
*      7 RVCONTNR_STV CHAR(6),      ] Stacked volume container     @23A 13870300
*      7 *            CHAR(10),     ] Reserved                     @23A 13873400
*    4 RVRQPRTY CHAR(4),            ] Movement priority            @S8A 13876700
*    4 RVCAPACITY CHAR(10),         ] Volume capacity in megabytes      13886200
*                                   ] RVCAPACITY is factored       @SKA 13895700
*    4 RVRBYSET CHAR(1),            ] Volume is retained by set: Y, N   13905200
*    4 RVSTACKVOL_ENABLED CHAR(1),  ] Stacked volume records enabled    13914700
*                                   ] and synchronized                  13924200
*    4 RVEXPTOKEN CHAR(8),          ] Export token,                     13933700
*                                   ] unique value created at start of  13943200
*                                   ] export to a new stacked volume    13952700
*    4 RVSTACKED_VOLCOUNT CHAR(10), ] Count of volumes stacked on       13962200
*                                   ] a volume                          13971700
*    4 RVPERCENT CHAR(3),           ] Volume percentage full            13981200
*    4 RVDSNNO  CHAR(5),            ] Number of data sets on volume     13990700
*    4 RVLABNO1 CHAR(5),            ] Label number of first file        14000200
*    4 RVDCRSID CHAR(8),            ] First file creation system ID     14009700
*    4 *          CHAR(1),          ] Reserved                          14019200
*  2 RVEXT2            ,            ] Second data section          @15A 14028700
*    4 RvDestBin      CHAR(6),      ] Destination bin number       @SCA 14038200
*    4 RvDestBinMedia CHAR(8),      ] Destination bin media number @SCA 14047700
*    4 RvVol1         CHAR(6),      ] VOL1 label volser            @LSA 14057200
*    4 RvVendor       CHAR(8),      ] Vendor information           @SGA 14066700
*    4 RvWWID         CHAR(24),     ] Unique world wide ID         @SGA 14076200
*    4 RvVwmc         CHAR(5),      ] Write mount count            @SGA 14085700
*    4 RVTRERR        CHAR(5),      ] Temporary read errors        @K2A 14095200
*    4 RVTWERR        CHAR(5),      ] Temporary write errors       @K2A 14104700
*    4 RVPRERR        CHAR(5),      ] Permanent read errors        @K2A 14114200
*    4 RVPWERR        CHAR(5),      ] Permanent write errors       @K2A 14123700
*/*******************************************************************   14133800
*  RvKeyLabel1/RvKeyLabel2:                                         *   14133900
*               These fields may contain unprintable characters.    *   14134000
*********************************************************************/  14134100
*    4 RvKeyLabel1    CHAR(64),     ] Encryption key label 1       @SJA 14134200
*    4 RvKeyEncod1    CHAR(5),      ] Encryption encoding method 1      14134300
*    4 RvKeyLabel2    CHAR(64),     ] Encryption key label 2       @SJA 14134400
*    4 RvKeyEncod2    CHAR(5),      ] Encryption encoding method 2      14134500
*    4 RvMedinf       CHAR(8),      ] Media information            @19A 14134600
*    4 RvIRMMUSE      CHAR(1),      ] IRMM use: Y, N               @20A 14134700
*    4 RvWORM         CHAR(1),      ] WORM: Y, N                   @20A 14134800
*    4 RVFACTOR       CHAR(2),      ] Space/size factor,           @SKA 14134900
*                                   ] applies to RVCAPACITY, RVAPPUSE,  14135000
*                                   ]  RVPhys_Used                 @SOA 14135100
*    4 RVAPPUSE       CHAR(10),     ] Data written,                @SKA 14135200
*                                   ] RVAPPUSE is factored         @SKA 14135300
*    4 RVUSE          CHAR(5),      ] Volume use count             @21A 14135400
*    4 RVHOLD         CHAR(1),      ] Volume hold: Y, N            @O0A 14135800
*    4 RVESB          CHAR(10),     ] Expdt set by                 @O8A 14135900
*    4 RVUCDATE       CHAR(10),     ] Last "user" change date      @OBA 14136000
*    4 RVUCTIME       CHAR(6),      ] Last "user" change time      @OBA 14136100
*                                   ] (HHMMSS)                     @OBA 14136200
*    4 RvRetMet       CHAR(5),      ] Retention Method             @OGA 14136300
*    4 RvRMSB         CHAR(10),     ] Retention Method Set By      @OGA 14136400
*    4 RVComp_Rat     CHAR(6),      ] Compression ratio for the    @SOA 14136600
*                                   ] volume in hundredths.        @SOA 14136700
*                                   ] Always showing 2 decimal     @SOA 14136800
*                                   ] places.                      @SOA 14136900
*    4 RVPhys_Used    CHAR(10),     ] Actual space used by all     @SOA 14137000
*                                   ] files after compaction       @SOA 14137100
*                                   ] ( FACTORED )                 @SOA 14137200
*    4 RvEXRB         CHAR(9),      ] EXPDT RetainBy               @OSA 14137300
*    4 RVEDM          CHAR(1),      ] Volume EDM: Y, N             @M7A 14137350
*  2   RVRCEND  CHAR(0);            ] End of RVEXT                      14137400
*                                                                       14137500
*/********************************************************************/ 14137600
*/*  Contants                                                        */ 14138000
*/********************************************************************/ 14140700
*                                                                       14143400
*DCL                                                              ]@S8A 14146100
*  RVVOLTYPE_LOGICAL  CHAR(1) CONSTANT('L'),                      ]@S8A 14148800
*  RVVOLTYPE_PHYSICAL CHAR(1) CONSTANT('P'),                      ]@S8A 14150600
*  RVVOLTYPE_STACKED  CHAR(1) CONSTANT('S'),                      ]@LGA 14151300
*                                                                       14151600
*  RVFACTOR_MB        CHAR(2) CONSTANT('MB'),                     ]@SKA 14152000
*  RVFACTOR_GB        CHAR(2) CONSTANT('GB'),                     ]@SKA 14152700
*  RVFACTOR_TB        CHAR(2) CONSTANT('TB'),                     ]@SKA 14152800
*                                                                       14152900
*  RVESB_UNDEFINED    CHAR(10) CONSTANT('          '),            ]@O8A 14153000
*  RVESB_CMD          CHAR(10) CONSTANT('CMD       '),            ]@O8A 14153100
*  RVESB_CMD_DEF      CHAR(10) CONSTANT('CMD_DEF   '),            ]@O8A 14153200
*  RVESB_CMD_VOLCAT   CHAR(10) CONSTANT('CMD_VOLCAT'),            ]@O8A 14153300
*  RVESB_OCE_JFCB     CHAR(10) CONSTANT('OCE_JFCB  '),            ]@O8A 14153400
*  RVESB_OCE_EXIT     CHAR(10) CONSTANT('OCE_EXIT  '),            ]@O8A 14153500
*  RVESB_OCE_DEF      CHAR(10) CONSTANT('OCE_DEF   '),            ]@O8A 14153600
*  RVESB_OCE_MAX      CHAR(10) CONSTANT('OCE_MAX   '),            ]@O8A 14153700
*  RVESB_OCE_VOLCAT   CHAR(10) CONSTANT('OCE_VOLCAT'),            ]@O8A 14153800
*  RVESB_LCS          CHAR(10) CONSTANT('LCS       '),            ]@O8A 14153900
*  RVESB_LCS_DEF      CHAR(10) CONSTANT('LCS_DEF   '),            ]@O8A 14154000
*  RVESB_TVEXTPURGE   CHAR(10) CONSTANT('TVEXTPURGE'),            ]@O8A 14154100
*  RVESB_CNVT         CHAR(10) CONSTANT('CNVT      '),            ]@O8A 14154200
*  RVESB_EXPORT       CHAR(10) CONSTANT('EXPORT    '),            ]@O8A 14154300
*  RVESB_LASTREF      CHAR(10) CONSTANT('LASTREF   '),            ]@OQA 14154400
*  RVESB_OCE_MC       CHAR(10) CONSTANT('OCE_MC    '),            ]@OVA 14154500
*  RVESB_CATRETPD     CHAR(10) CONSTANT('CATRETPD  '),            ]@M2A 14154510
*  RVESB_CATLG_DAYS   CHAR(10) CONSTANT('CATLG_DAYS'),            ]@M2A 14154520
*  RVESB_DEFTABLE     CHAR(10) CONSTANT('DEFTABLE'),              ]@M3A         
*                                                                       14154600
*  RVRETMET_VRSEL     CHAR(5) CONSTANT('VRSEL'),                  ]@OGA 14154700
*  RVRETMET_EXPDT     CHAR(5) CONSTANT('EXPDT'),                  ]@OGA 14154800
*                                                                       14154900
*  RVRMSB_UNDEFINED   CHAR(10) CONSTANT('UNDEFINED '),            ]@OGA 14155000
*  RVRMSB_CMD         CHAR(10) CONSTANT('CMD       '),            ]@OGA 14155100
*  RVRMSB_CMD_DEF     CHAR(10) CONSTANT('CMD_DEF   '),            ]@OGA 14155200
*  RVRMSB_OCE_DEF     CHAR(10) CONSTANT('OCE_DEF   '),            ]@OGA 14155300
*  RVRMSB_OCE_EXIT    CHAR(10) CONSTANT('OCE_EXIT  '),            ]@OGA 14155400
*  RVRMSB_LCS_DEF     CHAR(10) CONSTANT('LCS_DEF   '),            ]@OGA 14155500
*  RVRMSB_CNVT        CHAR(10) CONSTANT('CNVT      '),            ]@OGA 14155600
*  RVRMSB_EXPORT_DEF  CHAR(10) CONSTANT('EXPORT_DEF'),            ]@OGA 14155700
*  RVRMSB_INERS_DEF   CHAR(10) CONSTANT('INERS_DEF '),            ]@OSC 14155800
*  RVRMSB_MC_ATTR     CHAR(10) CONSTANT('MC_ATTR   '),            ]@M5A 14155810
*  RVRMSB_DEFTABLE    CHAR(10) CONSTANT('DEFTABLE'),              ]@M3A         
*                                                                       14155900
*  RVEXRB_VOLUME      CHAR(9) CONSTANT('VOLUME   '),              ]@OSA 14156000
*  RVEXRB_FIRSTFILE   CHAR(9) CONSTANT('FIRSTFILE'),              ]@OSA 14156100
*  RVEXRB_SET         CHAR(9) CONSTANT('SET      ');              ]@OSA 14156200
*/*                                                                     14157600
* END OF REPORT EXTRACT VOLUME RECORD                                   14185300
**/                                                                     14213000
*IHALPOP; /* P L S  M A P P I N G  C O M P L E T E */                   14250000
