* %GOTO EDGRXEXT1; /* BILINGUAL MAPPING                                 00050000
         MACRO                                                          00100000
         EDGRXEXT &LIST=NO,&DSECT=YES                                   00150000
*********************************************************************** 00200000
***                                                                  ** 00250000
***      RMM REPORT EXTRACT FILE EXTENDED EXTRACT RECORD (RXEXT)     ** 00300000
***                                                                  ** 00350000
*********************************************************************** 00400000
**  z/OS DFSMSrmm V2R4                                                * 00450000
**                                                                    * 00500000
** PROPRIETARY V3 STATEMENT                                           * 00550000
** LICENSED MATERIALS - PROPERTY OF IBM                               * 00600000
** "RESTRICTED MATERIALS OF IBM"                                      * 00650000
** 5650-ZOS                                                           * 00687500
** COPYRIGHT IBM CORP. 2001,2019                                      * 00725000
** STATUS = HDZ2240                                                   * 00762500
** END PROPRIETARY V3 STATEMENT                                       * 00800000
************************************************** ******************** 00850000
***                                                                  ** 00900000
*** FUNCTION : EDGRXEXT MAPS THE RMM REPORT EXTRACT FILE EXTENDED    ** 00950000
***            RECORD                                                ** 01000000
***                                                                  ** 01050000
*** LOCATION : N/A                                                   ** 01100000
***                                                                  ** 01150000
*** METHOD OF ACCESS:                                                ** 01200000
***            ASSEMBLER - USING ON RXEXT                            ** 01250000
***            PLAS      - %INCLUDE EDGRXEXT                         ** 01300000
***                                                                  ** 01350000
*** LISTING  : ASSEMBLER - SPECIFY LIST=YES ON THE MACRO             ** 01400000
***            PLAS      - SPECIFY %IHALIST='YES' BEFORE INCLUDE     ** 01450000
***                                                                  ** 01500000
* $MAC(EDGRXEXT) COMP(DF186) PROD(RMM) : Extract file extended record * 01516600
***                                                                  ** 01533200
*** CHANGE ACTIVITY:                                                 ** 01550000
* $00=OW47651,150,010418,WS : Extended extract record              @00A 01600000
* $LL=RMM213 ,213,010216,BDG: >9999 tape files                     @LLA 01633300
* $01=OW48921,150,010428,ZB : Creation System ID                   @01A 01666600
* $SC=OW49863,210,010410,AP : Minimal Bin Assignment               @SCA 01683300
* $LS=RMMV1R3,1R3,011113,CHK: Duplicate Volser                     @LSA 01687400
* $03=OA02095,1R3,030221,BDG: Support data set expiry dates        @03A 01691500
* $02=OA02094,210,030115,WS : Report generator enhancements        @02A 01695800
* $SF=OA02206,1R3,030516,BDG: 3592 MODEL J SUPPORT                 @SFA 01697900
* $SG=OA07100,1R5,040130,WS : D/T3592 support new media types      @SGA 01698900
* $K1=KFI0394,1R8,051206,MB : GT 9999 read / write error value     @K1A 01699400
* $SH=OA13102,1R6,050531,WS : 3592 GEN 2 Support                   @SHA 01699700
* $SI=RMMV1R9,1R9,060401,BRB: Support for report 17                @SIA 01699800
* $SJ=OA17574,1R8,060728,WS : Tape Encryption Support              @SJA 01699900
* $04=OA13370,1R6,050122,WS : Media Information Support            @04A 01716600
* $MX=V1R10  ,1RA,070322,SST: V1R10 Disposition DELETE             @MXA 01724900
* $05=OA23266,1R7,071214,WS : IRMM support                         @05A 01729100
* $06=OA24896,1R8,080605,LM : GT 9999 volume use count value       @06A 01731200
* $SK=OA22132,1R7,070831,WS : 3592-G3 Support                      @SKA 01732200
* $SL=OA24025,1R8,080208,KHO: CA BTE API support                   @SLA 01732700
* $07=OA28930,1R8,090512,ZH : Enlarge block count fields           @07A 01733000
* $K2=K1C0555,1RC,090922,KD : Correct blocksize comments           @K2A 01733100
* $O0=RMMAS1 ,1RB,090915,BRB: volume HOLD attribute                @O0A 01737300
* $08=OA30472,1R9,090921,LM : Add catalog status 'UNKNOWN' to DS   @08A 01741500
* $O3=RMMMAP ,1RC,091125,WS : PLXMAP cleanups                      @O3A 01743600
* $O8=RMMESB ,1RD,100505,AP:  5.2.2.2 Expiry date set by           @O8A 01744100
* $OB=RMMLCD ,1RD,100510,BRB: 30 Last change details               @OBA 01744600
* $09=OA33070,1R9,100524,GB : 6-byte XVCONTNR_STV                  @09A 01745100
* $OF=RMMVEX ,1RD,100616,BRB: 5.2.4 CD VRSELEXCLUDE                @OFA 01745400
* $OG=RMMRM3 ,1RD,100726,WS : 5.2.5.3 RETENTIONMETHOD              @OGA 01745500
* $OQ=RMMLRD ,2R1,110731,WS : 75.1.1 LASTREF extra days            @OQA 01746600
* $OS=RMMMAO ,2R1,110731,WS : 75.1.2 EXPDT_RETAINBY                @OSA 01747700
* $SO=OA33958,1RC,101103,ZB : 3592-G4 Support                      @SOA 01748200
* $OV=RMMEME ,2R1,110831,WS : 75.2.1 Management class expiration   @OVA 01748500
* $10=OA45528,1RC,140701,ZB : Correct Phys_Used/Size defin. in ASM @10A 01748600
* $M2=FP0882 ,2R2,141106,VT : New RM(EX) values support( SM03105)  @M2A 01748610
* $M5=FP1391 ,2R3,150610,VT : New Managmnt Class attr support      @M5A 01748620
* $M3=151046 ,2R3,161223,AVK: deftable setby constants             @M3A         
* $M7=214978, 2R4,180608,VD : RGE: Ensure type numeric for fields  @M7A 01748720
*                           : having numeric content               @M7A 01748740
* $K3=258448, 2R4,180705,VD : RGE: Ensure type numeric for fields  @K3A 01748742
*                           : fixing FVT finding                   @K3A 01748744
* $M7=261985, 2R4,180716,KG : Add EDM to report extract data set   @M7A 01748770
* $11=OA56852,2R2,190415,AVK: WHILECAT and EDM info in report      @11A 01748771
*********************************************************************** 01748800
         PUSH  PRINT                                                    01750000
         AIF   ('&LIST' EQ 'YES').ASMLIST                               01800000
         PRINT OFF                                                      01850000
.ASMLIST ANOP                                                           01900000
         SPACE 1                                                        01950000
         AIF   ('&DSECT' EQ 'YES').GENDSCT                              02000000
         AGO   .GENSTRT                                                 02050000
.GENDSCT ANOP                                                           02100000
RXEXT    DSECT                                                          02150000
.GENSTRT ANOP                                                           02200000
*********************************************************************   02250000
* RXEXT:  The extended extract record is a combination of the       *   02300000
*         volume record and the dataset record with two additional  *   02350000
*         data elements:                                            *   02400000
*         XVMVDSNAM1   first dataset name of a volume set           *   02450000
*         XVVOLCNT     last volume sequence number of a volume set. *   02500000
*         In this record the date format depends on the DATEFORM    *   02550000
*         selected by EDGHSKP execution parameter or the parmlib    *   02600000
*         specified value.                                          *   02650000
*********************************************************************   02700000
*                                                                       02750000
RXTYPE   DS    C                   Record type - C'X'                   02800000
         DS    CL3                 Reserved                             02850000
XVVOLSER DS    CL6                 Volume serial number                 02900000
XVPVOL   DS    CL6                 Previous volume in sequence          02950000
XVNVOL   DS    CL6                 Next volume in sequence              03000000
XVSTVOL  DS    CL6                 Stacked volume VolSer (SV/LV)   @SIC 03050000
*********************************************************************   03100000
* XVMDMVID: Is a unique token assigned to every volume and every    *   03150000
*           data set in a multi-volume set.                         *   03200000
*********************************************************************   03250000
XVMDMVID DS    CL8                 Multi-dataset multi-volume id        03300000
         DS    CL12                Reserved                             03350000
*********************************************************************   03400000
*  Start of common fields:                                          *   03450000
*  The common fields are in the same place in each record type      *   03500000
*  in the report extract file.  This allows common processing of    *   03550000
*  these field across multiple record types.                        *   03600000
*********************************************************************   03650000
XVCRDATE DS    CL10                Create date of volume record         03700000
XVCRTIME DS    CL6                 Create time volume record (hhmmss)   03750000
XVCRSID  DS    CL8                 Create system id of volume record    03800000
XVLCDATE DS    CL10                Last change date of volume record    03850000
XVLCTIME DS    CL6                 Last change time of volume record    03900000
*                                  (hhmmss)                             03950000
XVLCUID  DS    CL8                 Last change user id of volume        04000000
*                                  record                               04050000
XVLCSID  DS    CL8                 Last change system id of volume      04100000
*                                  record                               04150000
*********************************************************************   04200000
*  End of common fields                                             *   04250000
*********************************************************************   04300000
XVEXPDTO DS    CL10                Expiration date  - original          04350000
XVEXPDT  DS    CL10                Expiration date  - current           04400000
XVDEN    DS    CL4                 Recording density                    04450000
XVCOMP   DS    C                   Compaction used - Y/N                04500000
         DS    CL4                 RESERVED WAS NO DSN ON VOL      @LLC 04550000
XVTUSE   DS    ZL10                Tape usage in Kbytes            @02C 04600000
*                             A -1 value indicates to use XVAPPUSE @SKA 04625000
XVUSE_OLD DS   CL4                 VOLUME USE COUNT   <=9999       @06C 04650000
         DS    CL4                 RESERVED WAS LABEL NO OF 1 FILE @LLC 04700000
XVSTORID DS    CL8                 Current location name                04750000
*                                  one of:  SHELF,                      04800000
*                                           LOCAL,                      04850000
*                                           REMOTE,                     04900000
*                                           DISTANT,                    04950000
*                                           installation-defined store, 05000000
*                                           SMS-defined library name    05050000
XVDEST   DS    CL8                 Destination name                     05100000
*                                  one of:  SHELF,                      05150000
*                                           LOCAL,                      05200000
*                                           REMOTE,                     05250000
*                                           DISTANT,                    05300000
*                                           installation-defined store, 05350000
*                                           SMS-defined library name    05400000
*********************************************************************   05450000
* Bin Numbers: If a volume is not moving (XVTRANS=N), and is in a   *   05500000
*              storage location, XVSTBIN contains the current bin   *   05550000
*              number and XVOBIN the bin number in the previous     *   05600000
*              location.                                            *   05650000
*              If a volume is moving (XVTRANS=Y), and moving to a   *   05700000
*              storage location, XVSTBIN contains the target bin    *   05750000
*              number and XVOBIN the bin number in the source       *   05800000
*              location.                                            *   05850000
*********************************************************************   05900000
XVSTBIN  DS    CL6                 Bin number                           05950000
XVOBIN   DS    CL6                 Previous bin number                  06000000
XVSTDATE DS    CL10                Movement tracking date               06050000
XVRETDAT DS    CL10                Retention date calculated by VRS     06100000
XVLONLOC DS    CL8                 Loan location                        06150000
XVOLNLOC DS    CL8                 Previous loan location               06200000
XVLRDDAT DS    CL10                Date volume last read                06250000
XVLWTDAT DS    CL10                Date volume last written             06300000
*********************************************************************   06350000
* Assigned date and time:                                           *   06400000
*    These fields are set each time a volume changes either from    *   06450000
*    or to scratch status.                                          *   06500000
*********************************************************************   06550000
XVASDATE DS    CL10                Assigned date                        06600000
XVASTIME DS    CL6                 Assigned time (hhmmss)               06650000
XVOWNID  DS    CL8                 Volume owner user ID                 06700000
XVCRUID  DS    CL8                 Creating user ID                     06750000
XVCRJOB  DS    CL8                 Creating job name                    06800000
XVSECLEV DS    CL8                 Security level - short               06850000
XVSECLNG DS    CL30                Security level - long                06900000
XVVOLSEQ DS    ZL4                 Volume sequence number          @K3C 06950000
XVSTATUS DS    CL8                 Volume status                        07000000
*                                  one of:     MASTER,                  07050000
*                                              USER,                    07100000
*                                              SCRATCH,                 07150000
*                                              INIT,                    07200000
*                                              ENTRY                    07250000
XVPENDRS DS    C                   Volume pending release - Y/N         07300000
XVVRS    DS    C                   Volume retained by VRS - Y/N         07350000
XVLOAN   DS    C                   Volume on loan - Y/N                 07400000
XVOPEN   DS    C                   Volume is opened - Y/N               07450000
XVOCER   DS    C                   Volume recorded by O/C/EOV - Y/N     07500000
XVDEFRET DS    C                   Parmlib default retention used       07550000
*                                  to generate the volume expdt - Y/N   07600000
XVPPTAPE DS    C                   Program product tape - Y/N           07650000
*********************************************************************   07700000
* Labels: The XVLABEL field provides information about what label   *   07750000
*         types may be written on the volume.  If BLP output has    *   07800000
*         been used, the volume may no longer match this            *   07850000
*         information.  Any BLP output beyond file 1 on a volume    *   07900000
*         is not recorded by RMM.                                   *   07950000
*********************************************************************   08000000
XVLABEL  DS    CL3                 Label type SL/AL/NL/SUL/AUL          08050000
XVBLP    DS    C                   Volume last written BLP Y/N          08100000
*********************************************************************   08150000
* Release Actions:  The following 5 fields list the actions to be   *   08200000
*              set for the volume when it is released.  These are   *   08250000
*              not the current actions.  See XVACTION for the       *   08300000
*              pending actions.                                     *   08350000
*********************************************************************   08400000
XVRETS   DS    CL8                 Return action - OWNER/SCRATCH        08450000
XVREPL   DS    C                   Replace on release - Y/N             08500000
XVINIT   DS    C                   Reinitialise - Y/N                   08550000
XVERASE  DS    C                   Security erase - Y/N                 08600000
XVNTFY   DS    C                   Notify owner - Y/N                   08650000
XVOWNAC  DS    C                   Owner access - R/U/A                 08700000
XVUSERAC DS    C                   User access - R/U                    08750000
XVVMUSE  DS    C                   VM use - Y/N                         08800000
XVMVSUSE DS    C                   MVS use - Y/N                        08850000
XVNAME   DS    CL8                 Media name                           08900000
XVUNIT   EQU   XVNAME,8            Old name for XVNAME field            08950000
XVRACK   DS    CL6                 Rack number                          09000000
XVTRERR_OLD DS ZL4                 Temporary read errors   <=9999  @K1C 09050000
XVTWERR_OLD DS ZL4                 Temporary write errors  <=9999  @K1C 09100000
XVPRERR_OLD DS ZL4                 Permanent read errors   <=9999  @K1C 09150000
XVPWERR_OLD DS ZL4                 Permanent write errors  <=9999  @K1C 09200000
*********************************************************************   09250000
* Product Information: Includes number, release and feature code    *   09300000
*********************************************************************   09350000
XVPPNUM  DS    CL8                 Program product number               09400000
XVVER    DS    CL6                 Version/release/model number         09450000
XVFEAT   DS    CL4                 Feature code                         09500000
XVACCINF DS    CL40                Accounting information               09550000
XVUSEFLD DS    CL30                User description                     09600000
XVACCLST DS    ZL3                 Number of access list entries   @K3C 09650000
XVAUTIDS DS    CL96                Authorised user ids area             09700000
XVHLOC   DS    CL8                 home location name                   09750000
XVTRANS  DS    C                   Volume in transit - Y/N              09800000
XVLOCTYP DS    C                   Location type                        09850000
*                                  one of:  A-AUTO,                     09900000
*                                           M-MANUAL,                   09950000
*                                           S-STORE,                    10000000
*                                           blank                       10050000
XVDESTYP DS    C                   Destination type                     10100000
*                                  one of:  A-AUTO,                     10150000
*                                           M-MANUAL,                   10200000
*                                           S-STORE,                    10250000
*                                           blank                       10300000
XVOLOC   DS    CL8                 The previous location name           10350000
XVSGNAME DS    CL8                 Storage group name                   10400000
XVMEDREC DS    CL8                 Volume recording format              10450000
*                                  one of:  18TRACK,                    10500000
*                                           36TRACK,                    10550000
*                                           128TRACK,                   10600000
*                                           256TRACK,              @SFC 10625000
*                                           384TRACK,              @SFA 10650000
*                                           EFMT1,                 @SHC 10666600
*                                           EFMT2,                 @SJC 10677700
*                                           EEFMT2,                @SJA 10683200
*                                           EFMT3,                 @SKA 10688700
*                                           EEFMT3,                @SOC 10691500
*                                           EFMT4,                 @SOA 10694300
*                                           EEFMT4                 @SOA 10697100
XVMEDTY  DS    CL8                 Volume media type                    10700000
*                                  one of:  *,                          10750000
*                                           CST,                        10800000
*                                           ECCST,                      10850000
*                                           HPCT,                       10900000
*                                           EHPCT,                 @SFC 10933300
*                                           MEDIA5 - ETC,          @SGC 10946600
*                                           MEDIA6 - EWTC,         @SGA 10959900
*                                           MEDIA7 - EETC,         @SGA 10973200
*                                           MEDIA8 - EEWTC,        @SHC 10979900
*                                           MEDIA9 - EXTC,         @SHA 10986600
*                                           MEDIA10- EXWTC,        @SOC 10989200
*                                           MEDIA11- EATC,         @SOA 10991800
*                                           MEDIA12- EAWTC,        @SOA 10994400
*                                           MEDIA13- EAETC         @SOA 10997000
XVMEDCMP DS    CL8                 Compaction technique                 11000000
*                                  one of:  *,                          11050000
*                                           NONE,                       11100000
*                                           YES                         11150000
XVMEDATR DS    CL8                 Special attributes - NONE/RDCOMPAT   11200000
XVDSNAM1 DS    CL44                First file data set name             11250000
XVMVMODE DS    C                   Move mode - A-AUTOMOVE/M-MANUALMOVE  11300000
XVDSNREC DS    CL1                 Ds recording - Y/N                   11350000
XVALVERS DS    CL2                 ANSI label versions                  11400000
XVALCUR  EQU   XVALVERS,1          Current  label version               11450000
*                                  one of blank, 1,3, or 4.             11500000
XVALREQ  EQU   XVALVERS+1,1        Required label version               11550000
*                                  one of blank, 3, or 4.               11600000
XVBMEDN  DS    CL8                 Bin media name                       11650000
XVOBMEDN DS    CL8                 Previous bin media name              11700000
XVNLOC   DS    CL8                 Required location name - as          11750000
*                                  determined by VRS or command         11800000
XVLUDEV  DS    CL4                 Last used drive                      11850000
*********************************************************************   11900000
* Pending Actions:  The following fields list the actions required  *   11950000
*              for the volume.  See XVRETS for the actions set      *   12000000
*              when the volume is released.                         *   12050000
*********************************************************************   12100000
XVACTION DS    0CL8                                                     12150000
XVACTSCR DS    CL1                 Pending action:return to scratch Y/N 12200000
XVACTREP DS    CL1                 Pending action: replace volume   Y/N 12250000
XVACTRET DS    CL1                 Pending action: return to owner  Y/N 12300000
XVACTINI DS    CL1                 Pending action: initialize       Y/N 12350000
XVACTERA DS    CL1                 Pending action: erase            Y/N 12400000
XVACTNOT DS    CL1                 Pending action: notify           Y/N 12450000
XVACTRSV DS    CL2                 Reserved                             12500000
XVABEND  DS    CL1                 Data set closed by abend - Y/N       12550000
XVHOMTYP DS    CL1                 Home location type                   12600000
*                                  one of:  A-AUTO,                     12650000
*                                           M-MANUAL,                   12700000
*                                           blank                       12750000
XVNEXTYP DS    CL1                 Next location type                   12800000
*                                  one of:  A-AUTO,                     12850000
*                                           M-MANUAL,                   12900000
*                                           S-STORE,                    12950000
*                                           blank                       13000000
XVVOLTYPE DS    CL1                Volume type                          13050000
XVVOLTYPE_LOGICAL  EQU C'L',1,C'C'                                      13100000
XVVOLTYPE_PHYSICAL EQU C'P',1,C'C'                                      13150000
XVVOLTYPE_STACKED  EQU C'S',1,C'C'                                      13200000
*                                                                       13250000
XVVRSREL DS    0CL8                VRS release options                  13300000
XVRELIXD DS    CL1                 Ignore expdt      Y/N                13350000
XVRELSI  DS    CL1                 Scratch immediate Y/N                13400000
XVRELRSV DS    CL6                 Reserved                             13450000
XVCONTNR DS    CL16                In container name                    13500000
XVCONTNR_STV   EQU XVCONTNR,6      Stacked volume container        @09A 13525000
XVRQPRTY DS    CL4                 Movement priority                    13550000
XVCAPACITY DS  ZL10                Volume capacity in Mbytes       @07C 13587500
*                                  XVCAPACITY is FACTORED          @SKA 13625000
XVRBYSET DS    C                   Volume retained by set - Y/N         13650000
XVSTACKVOL_ENABLED DS C            Stacked volume record enabled        13700000
*                                  and synchronized.                    13750000
XVEXPTOKEN         DS CL8          Export token                         13800000
*                                  Unique value created at start        13850000
*                                  of export to a new stacked           13900000
*                                  volume. All volumes in a stacked     13950000
*                                  volume have the same unique value    14000000
XVSTACKED_VOLCOUNT DS ZL10         Count of volumes stacked on a   @07C 14050000
*                                  volume. Maintained if stacked        14100000
*                                  volume fully enabled.                14150000
XVPERCENT DS   ZL3                 Volume percentage full          @K3C 14200000
XVDSNNO  DS    ZL5                 Number of Datasets on Volume    @07C 14250000
XVLABNO1 DS    CL5                 Label No of first File on Vol   @LLA 14300000
XVDCRSID DS    CL8                 First file creation system ID   @01A 14333300
         DS    CL1                 Reserved                        @01C 14366600
*********************************************************************   14400000
*        END OF VOLUME PART                                             14450000
*********************************************************************   14500000
XVVOLCNT DS    ZL4                 Last volume sequence number     @M7C 14550000
*                                  of a volume set                      14600000
*********************************************************************   14650000
*        START OF DATASET PART                                          14700000
*********************************************************************   14750000
         DS    CL4                 Reserved                             14800000
XDDSNAME DS    CL44                Data set name                        14850000
*********************************************************************   14900000
*  Start of common fields:                                          *   14950000
*  The common fields are in the same place in each record type      *   15000000
*  in the report extract file.  This allows common processing of    *   15050000
*  these field across multiple record types.                        *   15100000
*********************************************************************   15150000
XDCRDATE DS    CL10                Create date of data set record       15200000
XDCRTIME DS    CL6                 Create time (hhmmss) of data set     15250000
XDCRSID  DS    CL8                 Create system id of data set record  15300000
XDLCDATE DS    CL10                Last change date of data set record  15350000
XDLCTIME DS    CL6                 Last change time (hhmmss) of         15400000
*                                  data set record                      15450000
XDLCUID  DS    CL8                 Last change user id of data set      15500000
*                                  record                               15550000
XDLCSID  DS    CL8                 Last change system id of data set    15600000
*                                  record                               15650000
*********************************************************************   15700000
*  End of common fields                                             *   15750000
*********************************************************************   15800000
         DS    CL6                 Reserved                             15850000
         DS    CL4                 RESERVED WAS DSEQ               @LLC 15900000
XDUNITAD DS    CL4                 Creating drive address               15950000
XDRECFM  DS    CL4                 Record format                        16000000
XDVOLSEQ DS    ZL4                 Volume sequence number          @M7C 16050000
XDLRECL  DS    CL6                 Logical record length                16100000
XDBLKSZ  DS    CL6                 Physical block size                  16150000
XDBLKCNT_OLD   DS    CL8           Block count if <= 99999999      @07C 16200000
XDOWNDSN DS    CL8                 Data set owner                       16250000
XDSECLEV DS    CL8                 Security level - short               16300000
XDSECLNG DS    CL30                Security level - long                16350000
XDCOMP   DS    C                   Compaction used - Y/N                16400000
XDLRDDAT DS    CL10                Date data set last read              16450000
XDLWTDAT DS    CL10                Date data set last written           16500000
XDMCNAME DS    CL8                 SMS management class                 16550000
XDVRSVAL DS    CL8                 VRS management value                 16600000
XDSGNAME DS    CL8                 SMS storage group name               16650000
XDSCNAME DS    CL8                 SMS storage class name               16700000
XDDCNAME DS    CL8                 SMS data class name                  16750000
XDCRTJBN DS    CL8                 Creating job name                    16800000
XDVRSTYP DS    CL1                 Matching VRS type                    16850000
*                                  one of:  D-dataset,                  16900000
*                                           S-smsmc,                    16950000
*                                           V-vrsmv,                    17000000
*                                           M-dataset and vrsmv         17050000
*                                           C-dataset and smsmc         17100000
XDVRSNAM DS    CL44                Matching VRS name                    17150000
XDVRSJBN DS    CL8                 Matching VRS job name mask           17200000
XDRETDAT DS    CL10                Retention date                       17250000
XDSTEPNM DS    CL8                 Creating step name                   17300000
XDDDNAME DS    CL8                 Creating DD name                     17350000
         DS    CL8                 Reserved                             17400000
*********************************************************************   17450000
* Data set size:  This is calculated by multiplying the blocksize   *   17500000
*                 with the number of blocks divided by 1024.       @K2C 17550000
*********************************************************************   17600000
XDDSSIZE DS    ZL10                Approx. size of file Kbytes     @02C 17650000
XDABEND  DS    CL1                 Dset closed by abend   Y/N           17700000
*/*****************************************************************     17731800
* XDCAT: Set to 'Y' either when opened after allocation determines @08C 17763600
*        VOLSER by reference to the catalog or when data set is    @08C 17795400
*        cataloged after the data set is recorded in DFSMSrmm.     @08C 17827200
*                                                                  @08C 17859000
*        Set to 'N' when it was cataloged and now is not.          @08A 17890800
*        Set to 'U' (unknown) when it was never cataloged or       @08A 17922600
*        uncataloged.                                              @08A 17954400
*******************************************************************/    17986200
XDCAT    DS    CL1                 CATALOGED Y/N/U                 @08C 18018000
XDVRSR   DS    CL1                 Retained by VRS        Y/N           18050000
XDDELETED DS   CL1                 DELETED by disposition Y/N      @MXA 18083300
XDRSVMW1  DS   CL2                 Reserved                        @MXC 18116600
         DS    CL4                 RESERVED WAS LABEL NUMBER       @LLC 18150000
*********************************************************************   18200000
* Primary VRS subchain name:                                        *   18250000
*                     This is the retaining VRS in the matching     *   18300000
*                     primary VRS chain.  It is set only if retained*   18350000
*                     by a NAME VRS subchain in the primary VRS.    *   18400000
*********************************************************************   18450000
XDVRSSCH DS    CL8                 Primary VRS subchain name            18500000
XDVRSXDS DS    CL10                Primary VRS subchain start date      18550000
*********************************************************************   18600000
* Retaining Secondary VRS name:                                     *   18650000
*                     Matching VRS name and job name are included   *   18700000
*                     where a secondary VRS also matches.           *   18750000
*                     The retaining VRS subchain NAME in this       *   18800000
*                     matching VRS is set if it is used to retain   *   18850000
*                     the data set.                                 *   18900000
*********************************************************************   18950000
XD2VNME  DS    CL8                 Secondary VRS name mask              19000000
XD2VJBN  DS    CL8                 Secondary VRS job name mask          19050000
XD2VSCH  DS    CL8                 Secondary VRS subchain name          19100000
XD2VXDS  DS    CL10                Secondary VRS subchain startdate     19150000
XDTOTAL_BLKCNT_OLD DS CL10         Total block count across this   @07C 19200000
*                                    and previous volumes               19250000
XDPERCENT DS   ZL3                 Percentage of volume used by    @M7C 19300000
*                                                       data set        19350000
XDCPGM   DS    CL8                 Creating program name                19400000
XDLPGM   DS    CL8                 Last used program name               19450000
XDLJOB   DS    CL8                 Last use job name                    19500000
XDLSTEP  DS    CL8                 Last use step name                   19550000
XDLDDNM  DS    CL8                 Last use DD name                     19600000
XDLDEVN  DS    CL4                 Last use device number               19650000
*********************************************************************   19700000
*        End of data set part                                           19750000
*********************************************************************   19800000
*                                                                       19850000
XVMVDSNAM1 DS  CL44                First dsname of a volume set         19900000
*                                                                       19950000
*********************************************************************   20000000
*        Start of mixed data area                                       20050000
*********************************************************************   20100000
XDDSNSEQ        DS  ZL5            Data set sequence number new    @K3C 20140000
XDLABNO         DS  ZL5            Label number label=(xx,ll) new  @K3C 20180000
XvDestBin       DS  CL6            Destination Bin number          @SCA 20220000
XvDestBinMedia  DS  CL8            Destination Bin Media name      @SCA 20260000
XvVol1          DS  CL6            VOL1 label volser               @LSA 20280000
XDEXPDT         DS  CL10           Data set expiration date        @03A 20285000
XDEXPDTO        DS  CL10           Original d/s expiration date    @03A 20290000
XDDEFRET        DS  CL1            Default RETPD used              @03A 20295000
XvVendor        DS  CL8            Vendor information              @SGA 20296200
XvWWID          DS  CL24           Unique World wide ID            @SGA 20297400
XvVwmc          DS  ZL5            Write mount count               @SGA 20298600
XVTRERR         DS  ZL5            Temporary read errors           @K1A 20298800
XVTWERR         DS  ZL5            Temporary write errors          @K1A 20299000
XVPRERR         DS  ZL5            Permanent read errors           @K1A 20299200
XVPWERR         DS  ZL5            Permanent write errors          @K1A 20299400
*********************************************************************   20304400
* XvKeyLabel1/XvKeyLabel2:                                              20309400
*               These fields may contain unprintable characters.        20314400
*********************************************************************   20319400
XvKeyLabel1     DS  CL64           Encryption Key Label 1          @SJA 20324400
XvKeyEncod1     DS  CL5            Encrypt Key Encoding Method 1   @SJA 20329400
XvKeyLabel2     DS  CL64           Encryption Key Label 2          @SJA 20334400
XvKeyEncod2     DS  CL5            Encrypt Key Encoding Method 2   @SJA 20339400
*                                                                       20344400
XvMedinf        DS  CL8            Media information               @04A 20346200
XvIRMMUSE       DS  C              IRMM USE - Y/N                  @05A 20346800
XvWORM          DS  C              WORM - Y/N                      @05A 20347400
XVFACTOR        DS  CL2            SPACE/SIZE FACTOR               @SKA 20347600
*                          Applies to XVCAPACITY, XVAPPUSE, XDSIZE @SKA 20347800
*                           XVPhys_Used, XDPhys_size               @SOA 20347900
XVFACTOR_MB     EQU C'MB'                                          @SKA 20348000
XVFACTOR_GB     EQU C'GB'                                          @SKA 20348200
XVFACTOR_TB     EQU C'TB'                                          @SKA 20348400
XVAPPUSE        DS  CL10           DATA WRITTEN                    @SKA 20348600
*                                  XVAPPUSE is FACTORED            @SKA 20348800
XVUSE           DS  ZL5            Volume use count                @07C 20348900
XDSIZE          DS  ZL10           SIZE OF FILE                    @SKA 20349000
*                                  XDSIZE is FACTORED              @SKA 20349200
XDBESKEY        DS  ZL10           BES key index                   @SLA 20349400
XDBLKCNT        DS  0CL20          Block count                     @07A 20355000
                DS  ZL4                                            @07A 20360600
                DS  ZL16                                           @07A 20366200
XDTOTAL_BLKCNT  DS  0CL20          Total block count across all vol@07A 20371800
                DS  ZL4                                            @07A 20377400
                DS  ZL16                                           @07A 20383000
XVHOLD          DS  C              VOLUME HOLD - Y/N               @O0A 20385800
XVESB           DS  CL10           Expdt set by - of the volume    @O8A 20386200
XDESB           DS  CL10           Expdt set by - of the data set  @O8A 20386600
XVUCDATE        DS  CL10           VOLUME LAST "USER" CHANGE DATE  @OBA 20387000
XVUCTIME        DS  CL6            VOLUME LAST "USER" CHANGE TIME  @OBA 20388200
*                                  (HHMMSS)                        @OBA 20389400
XDUCDATE        DS  CL10           DATASET LAST "USER" CHANGE DATE @OBA 20390600
XDUCTIME        DS  CL6            DATASET LAST "USER" CHANGE TIME @OBA 20391800
*                                  (HHMMSS)                        @OBA 20392600
XDVEX           DS  CL1            VRSEL Exclude Y, N              @OFA 20393400
XvRetMet        DS  CL5            Retention Method                @OGA 20393600
XvRMSB          DS  CL10           Retention Method Set By         @OGA 20393800
XVComp_Rat      DS  CL6            Compression ratio for the volume@SOA 20394500
*                                  in hundredths. Alsways showing  @SOA 20395000
*                                   2 decimal places               @SOA 20395500
XVPhys_Used     DS  ZL10           Actual space used by all files  @K3C 20396190
*                                   after compaction ( FACTORED )  @SOA 20396500
XDComp_Rat      DS CL6             Compression ratio for the file  @SOA 20397000
*                                  in hundredths. Always showing   @SOA 20397500
*                                   2 decimal places               @SOA 20398000
XDPhys_size     DS  ZL10           Actual amount of data on tape   @K3C 20398690
*                                   after compression ( FACTORED ) @SOA 20399000
XdLRED          DS  ZL5            LASTREF extra days              @K3C 20399100
XvEXRB          DS  CL9            EXPDT retainby                  @OSA 20399200
XVEDM           DS  C              VOLUME EDM - Y/N                @M7A 20399300
XDWHILECATON    DS  C              DSN WHILECATALOG ON - Y/N       @11A 20399400
XDWHILECATUX    DS  C              DSN WHILECATALOG UntilExp - Y/N @11A 20399450
RXRCEND  DS    0C                  End of RXEXT                         20399500
RXRCLNG  EQU   RXRCEND-RXEXT       Length of RXEXT                      20400000
         POP   PRINT                                                    20450000
         MEND  , */                                                     20500000
*%EDGRXEXT1:;                                                           20550000
*%IHALPUSH = '@LISTPUSH';                                               20600000
*%IHALOFF  = '@LISTOFF';                                                20650000
*%IHALPOP  = '@LISTPOP';                                                20700000
*IHALPUSH;                                                              20750000
*%IF IHALIST='YES' %THEN                                                20800000
* %GOTO EDGRXEXT7;                                                      20850000
*IHALOFF;                                                               20900000
*%EDGRXEXT7:; /* P L S M A P P I N G S T A R T */                       20950000
*/********************************************************************/ 20952100
*/*                                                                  */ 20954200
*/* Common Name:          RMM Extract File Extended Data Set Record  */ 20957300
*/* Macro ID:             EDGRXEXT                                   */ 20960500
*/* DSECT Name:           RXEXT                                      */ 20962600
*/* Owning Component:     DFSMSrmm (DF186)                           */ 20964700
*/* Eye-Catcher ID:       X                                          */ 20966800
*/* Storage Attributes:   Subpool:   N/A                             */ 20968900
*/*                       Key:       N/A                             */ 20971000
*/*                       Residency: N/A                             */ 20973100
*/* Size:                 See STRUCTURE length                       */ 20975200
*/* Created by:           EDGHSKP                                    */ 20977300
*/* Pointed to by:        Assembler - USING on RXEXT                 */ 20979400
*/*                       PL/X      - %INCLUDE EDGRXEXT              */ 20981500
*/* Serialization:        None                                       */ 20983600
*/* Function:             Maps the RXEXT structure to identify       */ 20985700
*/*                       data set details plus its volume details   */ 20987800
*/*                       within the RMM extract file extended       */ 20989900
*/*                       record.                                    */ 20992000
*/* In this record the date format depends on the DATEFORM selected  */ 20992200
*/* by EDGHSKP execution parameter or the parmlib specified value.   */ 20992400
*/*                       -                                          */ 20992600
*/* The extended extract record is a combination of the data set     */ 20992800
*/* record and the belonging volume record with two additional data  */ 20993000
*/* elements:                                                        */ 20993200
*/* XVMVDSNAM1 - first data set name of the volume set               */ 20993400
*/* XVVOLCNT - last volume sequence number of the volume set         */ 20993600
*/*                       -                                          */ 20993800
*/* The PL/X structure is divided into 5 parts on structure level 2: */ 20994000
*/*  XVEXT1 - volume section 1: same as RVEXT1 in RVEXT, 796 bytes   */ 20994200
*/*  XVVOLCNT - generated data element for X record                  */ 20994400
*/*  XDEXT1 - data set section 1: same as RDEXT1 in RDEXT, 477 bytes */ 20994600
*/*  XVMVDSNAM1 - generated data element for X record                */ 20994800
*/*  XXMERGED - mixed data area for data elements from the sections  */ 20995000
*/*             RVEXT2 and RDEXT2                                    */ 20995200
*/********************************************************************/ 20996200
*DCL                                                                    21000000
*  1 RXEXT    BASED,                                                    21050000
*   2 XVEXT1       ,                ] Section 1 of volume record        22200000
*    3 RXTYPE   CHAR(1),            ] Record type - C'X'                22250000
*    3 *        CHAR(3),            ] Reserved                          22300000
*    3 XVVOLSER CHAR(6),            ] Volume serial number              22350000
*    3 XVPVOL   CHAR(6),            ] Previous volume in sequence       22400000
*    3 XVNVOL   CHAR(6),            ] Next volume in sequence           22450000
*    3 XVSTVOL  CHAR(6),            ] Stacked volume serial number      22500000
*/*******************************************************************   22550000
* XVMDMVID: Is a unique token assigned to every volume and every    *   22600000
*           data set in a multi volume set.                         *   22650000
********************************************************************/   22700000
*    3 XVMDMVID CHAR(8),            ] Multi data set multi volume ID    22750000
*    3 *        CHAR(12),           ] Reserved                          22800000
*/*******************************************************************   22850000
*  Start of common fields:                                          *   22900000
*  The common fields are in the same place in each record type      *   22950000
*  in the report extract file.  This allows common processing of    *   23000000
*  these field across multiple record types.                        *   23050000
*********************************************************************/  23100000
*    3 XVCRDATE CHAR(10),           ] Create date of volume record      23150000
*    3 XVCRTIME CHAR(6),            ] Create time of volume record      23200000
*                                   ] (HHMMSS)                          23250000
*    3 XVCRSID  CHAR(8),            ] Create system ID of volume record 23300000
*    3 XVLCDATE CHAR(10),           ] Last change date of volume record 23350000
*    3 XVLCTIME CHAR(6),            ] Last change time of volume record 23400000
*                                   ] (HHMMSS)                          23450000
*    3 XVLCUID  CHAR(8),            ] Last change user ID of volume     23500000
*                                   ] record                            23550000
*    3 XVLCSID  CHAR(8),            ] Last change system ID of volume   23600000
*                                   ] record                            23650000
*    3 XVEXPDTO CHAR(10),           ] Expiration date - original        23700000
*    3 XVEXPDT  CHAR(10),           ] Expiration date - current         23750000
*    3 XVDEN    CHAR(4),            ] Recording density                 23800000
*    3 XVCOMP   CHAR(1),            ] Compaction used: Y, N             23850000
*    3 *        CHAR(4),            ] Reserved                          23900000
*    3 XVTUSE   CHAR(10),           ] Tape usage in kilobytes, a -1     23950000
*                                   ] value indicates to use XVAPPUSE   24000000
*    3 XVUSE_OLD CHAR(4),           ] Volume use count <=9999           24050000
*    3 *        CHAR(4),            ] Reserved                          24100000
*    3 XVSTORID CHAR(8),            ] Current location name,            24150000
*                                   ] one of: SHELF, LOCAL, REMOTE,     24200000
*                                   ] DISTANT, installation-defined     24250000
*                                   ] store, SMS-defined library name   24300000
*    3 XVDEST   CHAR(8),            ] Destination name,                 24350000
*                                   ] one of: SHELF, LOCAL, REMOTE,     24400000
*                                   ] DISTANT, installation-defined     24450000
*                                   ] store, SMS-defined library name   24500000
*/*******************************************************************   24750000
* Bin Numbers: If a volume is not moving (XVTRANS=N), and is in a   *   24800000
*              storage location, XVSTBIN contains the current bin   *   24850000
*              number and XVOBIN the bin number in the previous     *   24900000
*              location.                                            *   24950000
*              If a volume is moving (XVTRANS=Y), and moving to a   *   25000000
*              storage location, XVSTBIN contains the target bin    *   25050000
*              number and XVOBIN the bin number in the source       *   25100000
*              location.                                            *   25150000
*********************************************************************/  25200000
*    3 XVSTBIN  CHAR(6),            ] Store bin number                  25250000
*    3 XVOBIN   CHAR(6),            ] Old bin number                    25300000
*    3 XVSTDATE CHAR(10),           ] Date stored                       25350000
*    3 XVRETDAT CHAR(10),           ] Retention date calculated by VRS  25400000
*    3 XVLONLOC CHAR(8),            ] Loan location                     25450000
*    3 XVOLNLOC CHAR(8),            ] Previous loan location            25500000
*    3 XVLRDDAT CHAR(10),           ] Date volume last read             25550000
*    3 XVLWTDAT CHAR(10),           ] Date volume last written          25600000
*/*******************************************************************   25650000
* Assigned date and time:                                           *   25700000
*    These fields are set each time a volume changes either from    *   25750000
*    or to scratch status.                                          *   25800000
*********************************************************************/  25850000
*    3 XVASDATE CHAR(10),           ] Assigned date                     25900000
*    3 XVASTIME CHAR(6),            ] Assigned time (HHMMSS)            25950000
*    3 XVOWNID  CHAR(8),            ] Volume owner user ID              26000000
*    3 XVCRUID  CHAR(8),            ] Creating user ID                  26050000
*    3 XVCRJOB  CHAR(8),            ] Creating job name                 26100000
*    3 XVSECLEV CHAR(8),            ] Security level - short            26150000
*    3 XVSECLNG CHAR(30),           ] Security level - long             26200000
*    3 XVVOLSEQ CHAR(4),            ] Volume sequence number            26250000
*    3 XVSTATUS CHAR(8),            ] Volume status, one of:            26300000
*                                   ] MASTER, USER, SCRATCH, INIT, ENTRY26350000
*    3 XVPENDRS CHAR(1),            ] Volume pending release: Y, N      26400000
*    3 XVVRS    CHAR(1),            ] Volume retained by VRS: Y, N      26450000
*    3 XVLOAN   CHAR(1),            ] Volume on loan: Y, N              26500000
*    3 XVOPEN   CHAR(1),            ] Volume is opened: Y, N            26550000
*    3 XVOCER   CHAR(1),            ] Volume recorded by O/C/EOV: Y, N  26600000
*    3 XVDEFRET CHAR(1),            ] Parmlib default retention used    26650000
*                                   ] to generate the volume expiration 26700000
*                                   ] date: Y, N                        26750000
*    3 XVPPTAPE CHAR(1),            ] Program product tape: Y, N        26800000
*/*******************************************************************   27000000
* Labels: The XVLABEL field provides information about what label   *   27050000
*         types may be written on the volume.  If BLP output has    *   27100000
*         been used, the volume may no longer match this            *   27150000
*         information.  Any BLP output beyond file 1 on a volume    *   27200000
*         is not recorded by RMM.                                   *   27250000
*********************************************************************/  27300000
*    3 XVLABEL  CHAR(3),            ] Label type: SL, AL, NL, SUL, AUL  27350000
*    3 XVBLP    CHAR(1),            ] Volume last written BLP: Y, N     27400000
*/*******************************************************************   27450000
* Release Actions: The following 5 fields list the actions to be    *   27500000
*              set for the volume when it is released.  These are   *   27550000
*              not the current actions. See XVACTION for the        *   27600000
*              pending actions.                                     *   27650000
*********************************************************************/  27700000
*    3 XVRETS   CHAR(8),            ] Return action: OWNER, SCRATCH     27750000
*    3 XVREPL   CHAR(1),            ] Replace on release: Y, N          27800000
*    3 XVINIT   CHAR(1),            ] Reinitialize: Y, N                27850000
*    3 XVERASE  CHAR(1),            ] Security erase: Y, N              27900000
*    3 XVNTFY   CHAR(1),            ] Notify owner: Y, N                27950000
*    3 XVOWNAC  CHAR(1),            ] Owner access: R, U, A             28000000
*    3 XVUSERAC CHAR(1),            ] User access: R, U                 28050000
*    3 XVVMUSE  CHAR(1),            ] VM use: Y, N                      28100000
*    3 XVMVSUSE CHAR(1),            ] MVS use: Y, N                     28150000
*    3 XVNAME   CHAR(8),            ] Media name                        28200000
*     7 XVUNIT  CHAR(8),            ] Media name                        28250000
*    3 XVRACK   CHAR(6),            ] Rack number                       28300000
*    3 XVTRERR_OLD CHAR(4),         ] Temporary read errors  <=9999     28350000
*    3 XVTWERR_OLD CHAR(4),         ] Temporary write errors <=9999     28400000
*    3 XVPRERR_OLD CHAR(4),         ] Permanent read errors  <=9999     28450000
*    3 XVPWERR_OLD CHAR(4),         ] Permanent write errors <=9999     28500000
*/*******************************************************************   28550000
* Product Information: Includes number, release and feature code    *   28600000
*********************************************************************/  28650000
*    3 XVPPNUM  CHAR(8),            ] Program product number            28700000
*    3 XVVER    CHAR(6),            ] Version / release / modification  28733300
*                                   ] level                             28766600
*    3 XVFEAT   CHAR(4),            ] Feature code                      28800000
*    3 XVACCINF CHAR(40),           ] Accounting information            28850000
*    3 XVUSEFLD CHAR(30),           ] User description                  28900000
*    3 XVACCLST CHAR(3),            ] Number of access list entries     28950000
*    3 XVAUTIDS CHAR(96),           ] Authorized user IDs area          29000000
*    3 XVHLOC   CHAR(8),            ] Home location name                29050000
*    3 XVTRANS  CHAR(1),            ] Volume in transit: Y, N           29100000
*    3 XVLOCTYP CHAR(1),            ] Location type, one of:            29150000
*                                   ] A-Auto, M-Manual, S-Store, blank  29200000
*    3 XVDESTYP CHAR(1),            ] Destination type, one of:         29250000
*                                   ] A-Auto, M-Manual, S-Store, blank  29300000
*    3 XVOLOC   CHAR(8),            ] Previous location name            29350000
*    3 XVSGNAME CHAR(8),            ] Storage group name                29400000
*    3 XVMEDREC CHAR(8),            ] Volume recording format, one of:  29450000
*                                   ] *, 18TRACK, 36TRACK, 128TRACK,    29500000
*                                   ] 256TRACK, 384TRACK, EFMT1, EFMT2, 29550000
*                                   ] EEFMT2, EFMT3, EEFMT3,       @SOC 29583300
*                                   ] EFMT4, EEFMT4                @SOA 29616600
*    3 XVMEDTY  CHAR(8),            ] Volume media type, one of:        29650000
*                                   ] *, CST, ECCST, HPCT, EHPCT,       29700000
*                                   ] MEDIA5 - ETC, MEDIA6 - EWTC,      29750000
*                                   ] MEDIA7 - EETC, MEDIA8 - EEWTC,    29800000
*                                   ] MEDIA9 - EXTC, MEDIA10 - EXWTC,   29825000
*                                   ] MEDIA11 - EATC, MEDIA12 - EAWTC,  29850000
*                                   ] MEDIA13 - EAETC              @SOA 29875000
*    3 XVMEDCMP CHAR(8),            ] Compaction technique, one of:     29900000
*                                   ] *, NONE, YES                      29950000
*    3 XVMEDATR CHAR(8),            ] Special attributes: NONE, RDCOMPAT30000000
*    3 XVDSNAM1 CHAR(44),           ] First file data set name          30050000
*    3 XVMVMODE CHAR(1),            ] Move mode: A-Automove,            30100000
*                                   ] M-Manualmove                      30150000
*    3 XVDSNREC CHAR(1),            ] Data set recording: Y, N          30200000
*    3 XVALVERS CHAR(2),            ] ANSI label versions               30250000
*      5 XVALCUR CHAR(1),           ] Current label version             30300000
*      5 XVALREQ CHAR(1),           ] Required label version            30350000
*    3 XVBMEDN  CHAR(8),            ] Bin media name                    30400000
*    3 XVOBMEDN CHAR(8),            ] Old bin media name                30450000
*    3 XVNLOC   CHAR(8),            ] Next location name                30500000
*    3 XVLUDEV  CHAR(4),            ] Last used drive                   30550000
*/*******************************************************************   31100000
* Pending Actions:  The following fields list the actions required  *   31150000
*              for the volume.  See XVRETS for the actions set      *   31200000
*              when the volume is released.                         *   31250000
*********************************************************************/  31300000
*    3 XVACTION CHAR(8),            ] Pending actions                   31350000
*      5 XVACTSCR CHAR(1),          ] Return to scratch: Y, N           31400000
*      5 XVACTREP CHAR(1),          ] Replace volume:    Y, N           31450000
*      5 XVACTRET CHAR(1),          ] Return to owner:   Y, N           31500000
*      5 XVACTINI CHAR(1),          ] Initialize:        Y, N           31550000
*      5 XVACTERA CHAR(1),          ] Erase:             Y, N           31600000
*      5 XVACTNOT CHAR(1),          ] Notify:            Y, N           31650000
*      5 XVACTRSV CHAR(2),          ] Reserved                          31700000
*    3 XVABEND  CHAR(1),            ] Data set closed by ABEND: Y, N    31750000
*    3 XVHOMTYP CHAR(1),            ] Home location type, one of:       31800000
*                                   ] A-Auto, M-Manual, blank           31850000
*    3 XVNEXTYP CHAR(1),            ] Next location type, one of:       31900000
*                                   ] A-Auto, M-Manual, S-Store, blank  31950000
*    3 XVVOLTYPE CHAR(1),           ] Volume type                       32000000
*    3 XVVRSREL CHAR(8),            ] VRS release options               32050000
*      5 XVRELIXD CHAR(1),          ] Ignore expiration data: Y, N      32100000
*      5 XVRELSI  CHAR(1),          ] Scratch immediate: Y, N           32150000
*      5 XVRELRSV CHAR(6),          ] Reserved                          32200000
*    3 XVCONTNR CHAR(16),           ] In container name                 32250000
*      5 XVCONTNR_STV CHAR(6),      ] Stacked volume container     @09A 32266600
*      5 *            CHAR(10),     ] Reserved                     @09A 32283200
*    3 XVRQPRTY CHAR(4),            ] Movement priority                 32300000
*    3 XVCAPACITY CHAR(10),         ] Volume capacity in megabytes      32350000
*                                   ] XVCAPACITY is factored            32400000
*    3 XVRBYSET CHAR(1),            ] Volume is retained by set: Y, N   32450000
*    3 XVSTACKVOL_ENABLED CHAR(1),  ] Stacked volume records enabled    32500000
*                                   ] and synchronized                  32550000
*    3 XVEXPTOKEN CHAR(8),          ] Export token,                     32600000
*                                   ] unique value created at start of  32650000
*                                   ] export to a new stacked volume    32700000
*    3 XVSTACKED_VOLCOUNT CHAR(10), ] Count of volumes stacked on       32950000
*                                   ] a volume                          33000000
*    3 XVPERCENT CHAR(3),           ] Volume percentage full            33050000
*    3 XVDSNNO  CHAR(5),            ] Number of data sets on volume     33100000
*    3 XVLABNO1 CHAR(5),            ] Label number of first file        33150000
*    3 XVDCRSID  CHAR(8),           ] First file creation system ID     33200000
*    3 *         CHAR(1),           ] Reserved                          33250000
*/*******************************************************************   33300000
*  End of volume part section 1                                     *   33350000
*********************************************************************/  33400000
*   2 XVVOLCNT CHAR(4),             ] Last volume sequence number  @M7C 33450000
*                                   ] of a volume set                   33500000
*/*******************************************************************   33550000
*  Start of data set part section 1                                 *   33600000
*********************************************************************/  33650000
*   2 XDEXT1           ,            ] Data set section 1                33691100
*    3 *        CHAR(4),            ] Reserved                          33732200
*    3 XDDSNAME CHAR(44),           ] Data set name                     33773300
*    3 XDCRDATE CHAR(10),           ] Create date of data set record    33814400
*    3 XDCRTIME CHAR(6),            ] Create time (HHMMSS) of data set  33855500
*                                   ] record                            33896600
*    3 XDCRSID  CHAR(8),            ] Create system ID of data set      33937700
*                                   ] record                            33978800
*    3 XDLCDATE CHAR(10),           ] Last change date of data set      34019900
*                                   ] record                            34061000
*    3 XDLCTIME CHAR(6),            ] Last change time (HHMMSS) of      34102100
*                                   ] data set record                   34143200
*    3 XDLCUID  CHAR(8),            ] Last change user ID of data set   34184300
*                                   ] record                            34225400
*    3 XDLCSID  CHAR(8),            ] Last change system ID of data set 34266500
*                                   ] record                            34307600
*/*******************************************************************   34350000
*  End of common fields                                             *   34400000
*********************************************************************/  34450000
*    3 *        CHAR(6),            ] Reserved                          34500000
*    3 *        CHAR(4),            ] Reserved                          34550000
*    3 XDUNITAD CHAR(4),            ] Creating drive address            34600000
*    3 XDRECFM  CHAR(4),            ] Record format                     34650000
*    3 XDVOLSEQ CHAR(4),            ] Volume sequence number            34700000
*    3 XDLRECL  CHAR(6),            ] Logical record length             34750000
*    3 XDBLKSZ  CHAR(6),            ] Physical block size               34800000
*    3 XDBLKCNT_OLD CHAR(8),        ] Block count if <=99999999         34850000
*    3 XDOWNDSN CHAR(8),            ] Data set owner                    34900000
*    3 XDSECLEV CHAR(8),            ] Security level - short            34950000
*    3 XDSECLNG CHAR(30),           ] Security level - long             35000000
*    3 XDCOMP   CHAR(1),            ] Compaction used: Y, N             35050000
*    3 XDLRDDAT CHAR(10),           ] Date data set last read           35100000
*    3 XDLWTDAT CHAR(10),           ] Date data set last written        35150000
*    3 XDMCNAME CHAR(8),            ] SMS management class              35200000
*    3 XDVRSVAL CHAR(8),            ] VRS management value              35250000
*    3 XDSGNAME CHAR(8),            ] SMS storage group name            35300000
*    3 XDSCNAME CHAR(8),            ] SMS storage class name            35350000
*    3 XDDCNAME CHAR(8),            ] SMS data class name               35400000
*    3 XDCRTJBN CHAR(8),            ] Creating job name                 35450000
*    3 XDVRSTYP CHAR(1),            ] Matching VRS type, one of:        35500000
*                                   ] D(Data set), S(SMSMC), V(VRSMV),  35550000
*                                   ] M(Data set and VRSMV),            35600000
*                                   ] C(Data set and SMSMC)             35650000
*    3 XDVRSNAM CHAR(44),           ] Matching VRS name                 35700000
*    3 XDVRSJBN CHAR(8),            ] Matching VRS job name mask        35750000
*    3 XDRETDAT CHAR(10),           ] Retention date                    35800000
*    3 XDSTEPNM CHAR(8),            ] Creating step name                35850000
*    3 XDDDNAME CHAR(8),            ] Creating DD name                  35900000
*    3 *        CHAR(8),            ] Reserved                          35950000
*/*******************************************************************   36100000
* Data set size:  This is calculated by multiplying the blocksize   *   36150000
*                 with the number of blocks divided by 1024.       @K2C 36200000
*********************************************************************/  36250000
*    3 XDDSSIZE CHAR(10),           ] Approximate size of file          36282900
*                                   ] in kilobytes                      36315800
*    3 XDABEND  CHAR(1),            ] Data set closed by ABEND: Y, N    36348800
*/*****************************************************************     36381800
* XDCAT: Set to 'Y' either when opened after allocation determines @08C 36413600
*        VOLSER by reference to the catalog or when data set is    @08C 36445400
*        cataloged after the data set is recorded in DFSMSrmm.     @08C 36477200
*                                                                  @08C 36509000
*        Set to 'N' when it was cataloged and now is not.          @08A 36540800
*        Set to 'U' (unknown) when it was never cataloged or       @08A 36572600
*        uncataloged.                                              @08A 36604400
*******************************************************************/    36636200
*    3 XDCAT    CHAR(1),            ] Cataloged: Y, N, U           @08C 36671800
*    3 XDVRSR   CHAR(1),            ] Retained by VRS: Y, N             36707400
*    3 XDDELETED CHAR(1),           ] Deleted by disposition: Y, N @MXA 36743000
*    3 XDRSVMW1  CHAR(2),           ] Reserved                     @MXC 36778600
*    3 *        CHAR(4),            ] Reserved                     @LLC 36814200
*/*******************************************************************   36850000
* Primary VRS subchain name:                                        *   36900000
*                     This is the retaining VRS in the matching     *   36950000
*                     primary VRS chain. It is set only if retained *   37000000
*                     by a NAME VRS subchain in the primary VRS.    *   37050000
*********************************************************************/  37100000
*    3 XDVRSSCH CHAR(8),            ] Primary VRS subchain name         37150000
*    3 XDVRSXDS CHAR(10),           ] Primary VRS subchain start date   37200000
*/*******************************************************************   37250000
* Retaining secondary VRS name:                                     *   37300000
*                     Matching VRS name and job name are included   *   37350000
*                     where a secondary VRS also matches.           *   37400000
*                     The retaining VRS subchain name in this       *   37450000
*                     matching VRS is set if it is used to retain   *   37500000
*                     the data set.                                 *   37550000
*********************************************************************/  37600000
*    3 XD2VNME  CHAR(8),            ] Secondary VRS name mask           37650000
*    3 XD2VJBN  CHAR(8),            ] Secondary VRS job name mask       37700000
*    3 XD2VSCH  CHAR(8),            ] Secondary VRS subchain name       37750000
*    3 XD2VXDS  CHAR(10),           ] Secondary VRS subchain start date 37800000
*    3 XDTOTAL_BLKCNT_OLD CHAR(10), ] Total block count across          37850000
*                                   ] this and previous volumes         37900000
*    3 XDPERCENT CHAR(3),           ] Percentage of volume used by      37950000
*                                   ] data set                          38000000
*    3 XDCPGM  CHAR(8),             ] Creating program name             38050000
*    3 XDLPGM  CHAR(8),             ] Last use program name             38100000
*    3 XDLJOB  CHAR(8),             ] Last use job name                 38150000
*    3 XDLSTEP CHAR(8),             ] Last use step name                38200000
*    3 XDLDDNM CHAR(8),             ] Last use DD name                  38250000
*    3 XDLDEVN CHAR(4),             ] Last use device number            38300000
*/*******************************************************************   38350000
*  End of data set part section 1                                   *   38400000
*********************************************************************/  38450000
*                                                                       38500000
*   2 XVMVDSNAM1 CHAR(44),          ] First data set name of a volume   38533300
*                                   ] set                               38566600
*                                                                       38600000
*/*******************************************************************   38650000
*  Start of mixed data area from volume record section 2 and from   *   38700000
*                                data set record section 2          *   38750000
*********************************************************************/  38800000
*   2 XXMERGED ,                    ] Mixed area                        38814900
*    3 XDDSNSEQ      CHAR(5),       ] Data set sequence number          38829800
*    3 XDLABNO       CHAR(5),       ] Label number LABEL=(xx,ll)        38844700
*    3 XvDestBin     CHAR(6),       ] Destination bin number            38859600
*    3 XvDestBinMedia CHAR(8),      ] Destination bin media name        38874500
*    3 XvVol1        CHAR(6),       ] VOL1 label volume serial number   38889400
*    3 XDEXPDT       CHAR(10),      ] Data set expiration date          38904300
*    3 XDEXPDTO      CHAR(10),      ] Original data set expiration date 38919200
*    3 XDDEFRET      CHAR(1),       ] Default RETPD used                38934100
*    3 XvVendor      CHAR(8),       ] Vendor information                38949000
*    3 XvWWID        CHAR(24),      ] Unique world wide ID              38963900
*    3 XvVwmc        CHAR(5),       ] Write mount count                 38978800
*    3 XVTRERR       CHAR(5),       ] Temporary read errors             38993700
*    3 XVTWERR       CHAR(5),       ] Temporary write errors            39008600
*    3 XVPRERR       CHAR(5),       ] Permanent read errors             39023500
*    3 XVPWERR       CHAR(5),       ] Permanent write errors            39038400
*/*******************************************************************   39054400
*  XvKeyLabel1/XvKeyLabel2:                                         *   39059400
*               These fields may contain unprintable characters.    *   39064400
*********************************************************************/  39069400
*    3 XvKeyLabel1   CHAR(64),      ] Encryption key label 1            39070600
*    3 XvKeyEncod1   CHAR(5),       ] Encryption key encoding method 1  39071800
*    3 XvKeyLabel2   CHAR(64),      ] Encryption key label 2            39073000
*    3 XvKeyEncod2   CHAR(5),       ] Encryption key encoding method 2  39074200
*    3 XvMedinf      CHAR(8),       ] Media information                 39075400
*    3 XvIRMMUSE     CHAR(1),       ] IRMM use: Y, N                    39076600
*    3 XvWORM        CHAR(1),       ] WORM: Y, N                        39077800
*    3 XVFACTOR      CHAR(2),       ] Space/size factor, applies to     39079000
*                                   ] XVCAPACITY, XVAPPUSE, XDSIZE      39080200
*                                   ] XVPhys_Used, XDPhys_size     @SOA 39080800
*    3 XVAPPUSE      CHAR(10),      ] Data written,                     39081400
*                                   ] XVAPPUSE is factored              39082600
*    3 XVUSE         CHAR(5),       ] Volume use count                  39083800
*    3 XDSIZE        CHAR(10),      ] Size of file, XDSIZE is factored  39085000
*    3 XDBESKEY      CHAR(10),      ] BES key index                     39086200
*    3 XDBLKCNT      CHAR(20),      ] Block count                       39087400
*     4 *            CHAR(4),       ]                                   39088600
*     4 *            CHAR(16),      ]                                   39089800
*    3 XDTOTAL_BLKCNT CHAR(20),     ] Total block count across all      39091000
*                                   ] volumes                           39092200
*     4 *             CHAR(4),      ]                                   39093400
*     4 *             CHAR(16),     ]                                   39094600
*    3 XVHOLD         CHAR(1),      ] Volume hold: Y, N                 39095800
*    3 XVESB          CHAR(10),     ] Expdt set by - of the volume @O8A 39095900
*    3 XDESB          CHAR(10),     ] Expdt set by - of the dataset@O8A 39096000
*    3 XVUCDATE       CHAR(10),     ] Volume last "user" change    @OBA 39096100
*                                   ] date                         @OBA 39096200
*    3 XVUCTIME       CHAR(6),      ] Volume last "user" change    @OBA 39096300
*                                   ] time (HHMMSS)                @OBA 39096400
*    3 XDUCDATE       CHAR(10),     ] Dataset last "user" change   @OBA 39096500
*                                   ] date                         @OBA 39096600
*    3 XDUCTIME       CHAR(6),      ] Dataset last "user" change   @OBA 39096700
*                                   ] time (HHMMSS)                @OBA 39096800
*    3 XDVEX          CHAR(1),      ] VRSEL Exclude Y, N           @OFA 39096900
*    3 XvRetMet       CHAR(5),      ] Retention Method             @OGA 39097600
*    3 XvRMSB         CHAR(10),     ] Retention Method Set By      @OGA 39098300
*    3 XVComp_Rat     CHAR(6),      ] Compression ratio for the    @SOA 39101900
*                                   ] volume in hundredths.        @SOA 39105100
*                                   ] Always showing 2 decimal     @SOA 39108300
*                                   ] places.                      @SOA 39111500
*    3 XVPhys_Used    CHAR(10),     ] Actual space used by all     @SOA 39114700
*                                   ] files after compaction       @SOA 39117900
*                                   ] ( FACTORED )                 @SOA 39121100
*    3 XDComp_Rat     CHAR(6),      ] Compression ratio for the    @SOA 39124300
*                                   ] file in hundredths. Always   @SOA 39127500
*                                   ] showing 2 decimal places     @SOA 39130700
*    3 XDPhys_size    CHAR(10),     ] Actual amount of data on     @SOA 39133900
*                                   ] tape after compression       @SOA 39137100
*                                   ] ( FACTORED )                 @SOA 39140300
*    3 XdLRED         CHAR(5),      ] LASTFREF extra days          @OQA 39141300
*    3 XvEXRB         CHAR(9),      ] EXPDT retainby               @OSA 39142300
*    3 XVEDM          CHAR(1),      ] Volume EDM: Y, N             @M7A 39142400
*    3 XDWHILECATON   CHAR(1),      ] DSN WHILECATALOG=ON: Y, N    @11A 39142500
*    3 XDWHILECATUX   CHAR(1),      ] DSN WHILECATALOG=UX: Y, N    @11A 39142600
*   2 RXRCEND  CHAR(0);             ] End of RXEXT                      39143500
*                                                                       39146700
*/*******************************************************************   39150000
*    Contants                                                       *   39200000
*********************************************************************/  39250000
*DCL                                                                    39300000
*  XVVOLTYPE_LOGICAL  CHAR(1) CONSTANT('L'),                            39350000
*  XVVOLTYPE_PHYSICAL CHAR(1) CONSTANT('P'),                            39400000
*  XVVOLTYPE_STACKED  CHAR(1) CONSTANT('S'),                            39420000
*                                                                       39430000
*  XVFACTOR_MB        CHAR(2) CONSTANT('MB'),                           39440000
*  XVFACTOR_GB        CHAR(2) CONSTANT('GB'),                           39460000
*  XVFACTOR_TB        CHAR(2) CONSTANT('TB'),                           39461300
*                                                                       39462600
*  XESB_UNDEFINED     CHAR(10) CONSTANT('          '),            ]@O8A 39463900
*  XESB_CMD           CHAR(10) CONSTANT('CMD       '),            ]@O8A 39465200
*  XESB_CMD_DEF       CHAR(10) CONSTANT('CMD_DEF   '),            ]@O8A 39466500
*  XESB_CMD_VOLCAT    CHAR(10) CONSTANT('CMD_VOLCAT'),            ]@O8A 39467800
*  XESB_OCE_JFCB      CHAR(10) CONSTANT('OCE_JFCB  '),            ]@O8A 39469100
*  XESB_OCE_EXIT      CHAR(10) CONSTANT('OCE_EXIT  '),            ]@O8A 39470400
*  XESB_OCE_DEF       CHAR(10) CONSTANT('OCE_DEF   '),            ]@O8A 39471700
*  XESB_OCE_MAX       CHAR(10) CONSTANT('OCE_MAX   '),            ]@O8A 39473000
*  XESB_OCE_VOLCAT    CHAR(10) CONSTANT('OCE_VOLCAT'),            ]@O8A 39474300
*  XESB_LCS           CHAR(10) CONSTANT('LCS       '),            ]@O8A 39475600
*  XESB_LCS_DEF       CHAR(10) CONSTANT('LCS_DEF   '),            ]@O8A 39476900
*  XESB_TVEXTPURGE    CHAR(10) CONSTANT('TVEXTPURGE'),            ]@O8A 39478200
*  XESB_CNVT          CHAR(10) CONSTANT('CNVT      '),            ]@O8A 39479500
*  XESB_EXPORT        CHAR(10) CONSTANT('EXPORT    '),            ]@O8A 39480800
*  XESB_LASTREF       CHAR(10) CONSTANT('LASTREF   '),            ]@OQA 39481400
*  XESB_OCE_MC        CHAR(10) CONSTANT('OCE_MC    '),            ]@OVA 39481700
*  XESB_CATRETPD      CHAR(10) CONSTANT('CATRETPD  '),            ]@M2A 39481710
*  XESB_CATLG_DAYS    CHAR(10) CONSTANT('CATLG_DAYS'),            ]@M2A 39481720
*  XESB_DEFTABLE      CHAR(10) CONSTANT('DEFTABLE'),              ]@M3A         
*                                                                       39482100
*  XVRETMET_VRSEL     CHAR(5) CONSTANT('VRSEL'),                  ]@OGA 39483400
*  XVRETMET_EXPDT     CHAR(5) CONSTANT('EXPDT'),                  ]@OGA 39484700
*                                                                       39486000
*  XVRMSB_UNDEFINED   CHAR(10) CONSTANT('UNDEFINED '),            ]@OGA 39487300
*  XVRMSB_CMD         CHAR(10) CONSTANT('CMD       '),            ]@OGA 39488600
*  XVRMSB_CMD_DEF     CHAR(10) CONSTANT('CMD_DEF   '),            ]@OGA 39489900
*  XVRMSB_OCE_DEF     CHAR(10) CONSTANT('OCE_DEF   '),            ]@OGA 39491200
*  XVRMSB_OCE_EXIT    CHAR(10) CONSTANT('OCE_EXIT  '),            ]@OGA 39492500
*  XVRMSB_LCS_DEF     CHAR(10) CONSTANT('LCS_DEF   '),            ]@OGA 39493800
*  XVRMSB_CNVT        CHAR(10) CONSTANT('CNVT      '),            ]@OGA 39495100
*  XVRMSB_EXPORT_DEF  CHAR(10) CONSTANT('EXPORT_DEF'),            ]@OGA 39496400
*  XVRMSB_INERS_DEF   CHAR(10) CONSTANT('INERS_DEF '),            ]@OSC 39497000
*  XVRMSB_MC_ATTR     CHAR(10) CONSTANT('MC_ATTR   '),            ]@M5A 39497000
*  XVRMSB_DEFTABLE    CHAR(10) CONSTANT('DEFTABLE'),              ]@M3A         
*                                                                       39497600
*  XVEXRB_VOLUME      CHAR(9) CONSTANT('VOLUME   '),              ]@OSA 39498200
*  XVEXRB_FIRSTFILE   CHAR(9) CONSTANT('FIRSTFILE'),              ]@OSA 39498800
*  XVEXRB_SET         CHAR(9) CONSTANT('SET      ');              ]@OSA 39499400
*                                                                       39500000
*IHALPOP; /* P L S  M A P P I N G  C O M P L E T E */                   39550000
