* %GOTO EDGXSF_2; /* BILINGUAL MAPPING                                  00050000
         MACRO                                                          00256800
         EDGXSF &DSECT=YES,&LIST=YES,&TITLE=YES                         00288900
         GBLC  &ZCBPRINT                                                00321000
         AIF   ('&LIST' EQ 'NONE').P0                                   00353100
         AIF   ('&TITLE' EQ 'NO').P5                                    00385200
 TITLE   'EDGXSF  - API - Structure Field Introducer           '        00417300
.P5      ANOP                                                           00449400
*********************************************************************** 00502300
*** z/OS DFSMSrmm V2R5                                                * 00523102
***                                                                   * 00543900
*** PROPRIETARY V3 STATEMENT                                          * 00564700
*** LICENSED MATERIALS - PROPERTY OF IBM                              * 00585500
*** "RESTRICTED MATERIALS OF IBM"                                     * 00606300
*** 5650-ZOS                                                          * 00621900
*** COPYRIGHT IBM CORP. 1993,2021                                     * 00637502
*** STATUS = HDZ2250                                                  * 00653102
*** END PROPRIETARY V3 STATEMENT                                      * 00668700
*********************************************************************** 00689500
***                                                                  ** 00710300
*** 01 DESCRIPTIVE NAME:  API - Structure Field Introducer           ** 00731100
*** 02  ACRONYM:  SFI                                                ** 00751900
***                                                                  ** 00772700
*** 01 MACRO NAME:  EDGXSF                                           ** 00793500
***                                                                  ** 00814300
*** 01 EXTERNAL CLASSIFICATION: GUPI                                 ** 00835100
*** 01 END OF EXTERNAL CLASSIFICATION:                               ** 00855900
***                                                                  ** 00876700
*** 01 DSECT NAME:                                                   ** 00897500
***      XSF_SFI                                                     ** 00918300
***                                                                  ** 00939100
*** 01 COMPONENT:  DFSMSrmm                                          ** 00959900
***                                                                  ** 00980700
*** 01 EYE-CATCHER:  NONE                                            ** 01001500
***                                                                  ** 01022300
*** 01 STORAGE ATTRIBUTES:                                           ** 01043100
*** 02  SUBPOOL:  User Specified                                     ** 01063900
*** 02  KEY:      Any Key                                            ** 01084700
*** 02  RESIDENCY:  31 Bit                                           ** 01105500
***                                                                  ** 01126300
*** 01 SIZE:  Variable                                               ** 01147100
***             XSF_SFI -- X'0008' bytes                             ** 01167900
***                                                                  ** 01188700
*** 01 CREATED BY:                                                   ** 01209500
***     Caller                                                       ** 01230300
***                                                                  ** 01251100
*** 01 POINTED TO BY:                                                ** 01271900
***     N/A                                                          ** 01292700
***                                                                  ** 01313500
*** 01 SERIALIZATION:                                                ** 01334300
***     N/A                                                          ** 01355100
***                                                                  ** 01375900
*** 01 FUNCTION:                                                     ** 01396700
***                                                                  ** 01417500
*** 02 The XSF_SFI area is initialized by DFSMSrmm when an           ** 01438300
***    API call is made via the EDGXCI executable macro              ** 01459100
***                                                                  ** 01479900
*** 01 METHOD OF ACCESS:                                             ** 01500700
***                                                                  ** 01521500
*** 02  ASM:                                                         ** 01542300
***                                                                  ** 01563100
***      EDGXSF                                                      ** 01583900
***                                                                  ** 01604700
***           DSECT=YES!NO  -- Request DSECT definition              ** 01625500
***           TITLE=YES!NO  -- Request Title                         ** 01646300
***           LIST=YES!NO   -- Request Listing definition            ** 01667100
***                                                                  ** 01687900
***      Default: DSECT=YES,TITLE=YES,LIST=YES                       ** 01708700
***                                                                  ** 01729500
***                                                                  ** 01750300
***                                                                  ** 01771100
*** 02  PL/AS:                                                       ** 01791900
***                                                                  ** 01812700
***       %INCLUDE SYSLIB(EDGXSF)                                    ** 01833500
***                                                                  ** 01854300
*** 01 DELETED BY:  Caller                                           ** 01875100
***                                                                  ** 01895900
*** 01 FREQUENCY:   Used/Reused for each API call                    ** 01916700
***                                                                  ** 01937500
*** 01 DEPENDENCIES:  None                                           ** 01958300
***                                                                  ** 01979100
*** 01 DISTRIBUTION LIBRARY:  AMACLIB                                ** 01999900
***                                                                  ** 02020700
***    $MAC(EDGXSF)   COMP(DF186) PROD(RMM) : API SFI's              ** 02041500
***                                                                  ** 02062300
*** 01 CHANGE ACTIVITY:                                              ** 02083100
***  $LA=RMM130 ,130,971211,JPH: DFSMSRMM USER API SUPPORT       @LAA** 02103900
***  $01=OW33699,130,980520,CHK: API FOR VRS ENHANCEMENT         @01A** 02124700
***  $K1=K151122,150,980703,CHK: ADD NEW 1.5 FIELDS TO API       @K1A** 02145500
***  $S8=OW36349,140,980901,CHK: VTS IMPORT/EXPORT               @S8A** 02166300
***  $LF=RMM210 ,210,990708,CHK: Volset support                  @LFA** 02187100
***  $LG=RMM210 ,210,990708,CHK: VTS Enhancement support         @LGA** 02207900
***  $S9=BLYTHE2,210,990825,CHK: Blythe 2 support                @S9A** 02228700
***  $02=OW40710,140,991006,CHK: Add creating program name       @02A** 02249500
***  $03=OW42648,150,000118,AH : Extra Days Retention            @03A** 02270300
***  $LX=OW43476,140,000322,VD : TCDB Processing Controls        @LXA** 02291100
***  $04=OW48865,210,010321,AH : PREACS/SMSACS parmlib option    @04A** 02311900
***  $05=OW48921,150,010427,ZB : Creation system ID SFI support  @05A** 02332700
***  $SC=OW48963,210,010507,CHK: Minimal Bin Assignment          @SCA** 02353500
***  $LQ=RMMV1R5,1R5,011009,AH : Multilevel Security             @LQA** 02374300
***  $LS=RMMV1R5,1R5,011106,CHK: Duplicate Volser                @LSA** 02395100
***  $LR=RMMV1R5,1R5,011106,CHK: Backup at Any Time              @LRA** 02415900
***  $SE=RMMV1R3,1R3,020308,BDG: 3590 MODEL H SUPPORT            @SEA** 02436700
***  $LU=RMMV1R6,1R6,030612,CHK: z/OS V1R6 Client/Server support @LUA** 02457500
***  $SF=OA02206,1R3,030516,BDG: 3592 MODEL J SUPPORT            @SFA** 02478300
***  $SG=OA07100,1R5,040215,CHK: D/T3592 support new media types @SGA** 02499100
***  $K2=KMZ0173,1R7,040928,AL : Add CDS Last Update Date & Time @K2A** 02519900
***  $MC=RMMV1R8,1R8,050422,CHK: VRS Policy Management Simplif.  @MCA** 02540700
***  $ME=RMMV1R8,1R8,050608,CHK: V1R8 Enterprise Level Interface @MEA** 02561500
***  $MD=RMMV1R8,1R8,050630,WS : UTC - Universal time, coord.    @MDA** 02582300
***  $K3=KMZ0295,1R8,050708,CHK: Correct length of DBMN at PLX   @K3A** 02603100
***  $SH=OA13102,1R6,050531,WS : 3592 GEN 2 Support              @SHA** 02623900
***  $MP=RMMV1R9,1R9,060401,BRB: V1R9 Subcommand Enhancement     @MPA** 02644700
***  $MO=RMMV1R9,1R9,060406,AH : Shared Parmlib Support          @MOA** 02665500
***  $MK=RMMV1R9,1R9,060702,AH : CDS Serialization               @MKA** 02686300
***  $SJ=OA17574,1R8,060728,WS : Tape Encryption Support         @SJA** 02707100
***  $K4=KMZ0342,1R9,061130,OS : LP/SP multi volume support      @K4A** 02727900
***  $07=OA13370,1R6,051012,CHK: Media Information Support       @07A** 02748700
***  $MX=V1R10  ,1RA,070329,SST: V1R10 Disposition DELETE        @MXA** 02769500
***  $MV=V1R10  ,1RA,070613,BRB: Support limits Release/Scratch  @MVA** 02790300
***  $MR=V1R10  ,1RA,070521,AP : Prtition & OpenRule             @MRA** 02811100
***  $MY=V1R10  ,1RA,070618,GB : Volume Replacement Policy       @MYA** 02831900
***  $10=OA23266,1R7,071214,WS : IRMM support                    @10A** 02852700
***  $NB=RMMBSC ,1RB,080515,AH : Batch Synch I                   @NBA** 02873500
***  $N3=RMMGDG ,1RB,080404,GW : VRSEL GDG Options               @N3A** 02894300
***  $SK=OA22132,1R7,070820,BRB: 3592-G3 support                 @SKA** 02915100
***  $NI=RMMLCS ,1RC,090223,KHO: V1R12 LC STATUS                 @NIA** 02935900
***  $NK=RMMAS1 ,1RC,090224,AP : 5.1 Cleanup VRSEL(OLD)          @NKA** 02956700
***  $NQ=RMMIP6 ,1RC,090409,SST: 6 IPV6                          @NQA** 02977500
***  $NS=RMMLCS ,1RC,090519,KHO: V1R12 LC STATUS 10.4            @NSA** 02998300
***  $SL=OA24025,1R8,080208,KHO: CA BTE API support              @SLA** 03019100
***  $O0=RMMAS1 ,1RC,090925,WS : Volume HOLD attribute           @O0A** 03039900
***  $O3=RMMMAP ,1RC,091030,BRB: PLXMAP cleanups                 @O3A** 03060700
***  $O7=RMMSVM ,1RD,100304,SST: 29 Selective Volume Movement    @O7A** 03071100
***  $O9=RMMTEP ,1RD,100421,WS : 5.2.1 TVEXTPURGE(EXPIRE(days))  @O9A** 03076300
***  $OB=RMMLCD ,1RD,100510,BRB: 30 Last change details          @OBA** 03078900
***  $O8=RMMESB ,1RD,100510,SST: 5.2.2.2 Expiry date set by      @O8A** 03080200
***  $OF=RMMVEX ,1RD,100616,BRB: 5.2.4 CD VRSELEXCLUDE           @OFA** 03080800
***  $OG=RMMRM3 ,1RD,100726,WS : 5.2.5.3 RETENTIONMETHOD         @OGA** 03081100
***  $OQ=RMMLRD ,2R1,110731,WS : 75.1.1 LASTREF extra days       @OQA** 03081200
***  $OS=RMMMAO ,2R1,110731,WS : 75.1.2 EXPDT_RETAINBY           @OSA** 03081300
***  $SO=OA33958,1RC,101109,ZB : 3592-G4 support                 @SOA** 03081400
***  $OV=RMMEME ,2R1,110831,WS : 75.2.1 Management class expirat @OVA** 03092100
***  $M2=FP0882 ,2R2,141024,VT : RM(EX) SFI vars support(SM02967)@M2A** 03092202
***  $K5=FP0882 ,2R2,141202,VT : WCTL SFI val error (SM03131)    @K5A** 03092302
***  $M5=FP1391 ,2R3,150610,VT : New Managmnt Class attr support @M5A** 03092402
***  $M4=116303 ,2R3,160519,AVK: SV/SD/LD/LV - catalog ret. API  @M4A** 03092502
***  $M6=RMMEDM ,2R3,160525,GB : Volume EDM attribute            @M6A** 03092602
***  $M3=138923, 2R3,161028,VT : LISTCONTROL DEFTABLE support    @M3A** 03092702
***  $M3=151046 ,2R3,161223,AVK: deftable setby constants        @M3A** 03092802
***  $12=OA54871,2R1,180419,AVK: DSNEXPIRE(BLOCK) + CD FORCEEXPI @12A** 03092902
***  $K6=225780 ,2R4,180605,AVK: GDPR improvements               @K6A** 03093002
***  $M3=225783, 2R4,180703,VT : DEFTABLE Enhancements V2R4      @M8A** 03093004
***  $M7=225775, 2R4,181004,VD : CDS Threshold support           @M7A** 03093104
***  $L12=OA64283,2R4,221210,NM : Housekeeping chicken switch   @L12A**         
***  $02 =OA64912,2R4,230531,NM : PE fix for APAR OA64283        @02A**         
*********************************************************************** 03102800
*% /*                                                                   03113700
.P0      ANOP                                                           03145800
         AIF   ('&ZCBPRINT' EQ 'NO').P1                                 03177900
         AIF   ('&LIST' EQ 'YES').P2                                    03210000
.P1      ANOP                                                           03242100
         PUSH  PRINT                                                    03274200
         PRINT OFF                                                      03306300
.P2      ANOP                                                           03338400
*                                                                       03370500
* ********************************************************************  03402600
* *    Output Buffer                                                **  03434700
* ********************************************************************  03466800
*                                                                       03498900
         AIF   ('&DSECT' EQ 'YES').L0003A                               03531000
XSF_OUTBUF      DS   0F        Output Buffer                            03563100
         AGO   .L0004                                                   03595200
.L0003A  ANOP                                                           03627300
XSF_OUTBUF           DSECT    Output Buffer                             03659400
.L0004A  ANOP                                                           03691500
XSF_OUTBUF_BUFLNG    DS       1FL4    Buffer Length                     03723600
XSF_OUTBUF_RQDLNG    DS       1FL4    Required Buffer Length            03755700
XSF_OUTBUF_DATALNG   DS       1FL4    Length of Output Data             03787800
XSF_OUTBUF_FIELDS    DS       0C      Start of Structured Fields        03819900
*                                                                       03852000
* ********************************************************************  03884100
* *    Structured Field Introducers for Structured Fields           **  03916200
* ********************************************************************  03948300
*                                                                       03980400
         AIF   ('&DSECT' EQ 'YES').L0003B                               04012500
XSF_SFI         DS   0F        Structured Field Introducers             04044600
         AGO   .L0004B                                                  04076700
.L0003B  ANOP                                                           04108800
XSF_SFI         DSECT           Structured Field Introducers            04140900
.L0004B  ANOP                                                           04173000
XSF_SFI_LENGTH  DS   1FL2      Length                                   04205100
XSF_SFI_ID      DS   1CL0003   ID (identifier)                          04237200
                ORG  XSF_SFI_ID                                         04269300
XSF_SFI_IDVAL   DS   1CL0002   ID (Identifier Value)                    04301400
XSF_SFI_IDQUAL  DS   1CL0001   ID (Identifier Qualifier)                04333500
XSF_SFI_TYPE    DS   1FL1      Type                                     04365600
                DS   1CL0001   Reserved                                 04397700
XSF_SFI_DTYPE   DS   1FL1      Data type                                04429800
XSF_SFI_LEN     EQU  *-XSF_SFI                                          04461900
XSF_SFI_DATA    DS   0C        Start of Data                            04494000
*                                                                       04526100
* ********************************************************************  04558200
* **   Compound SFI definition                                     @SKA 04561700
* ********************************************************************  04565200
*                                                                       04568700
XSF_SFI_COMPTYPE1 DS  0C       Compound section                    @SKA 04572200
XSF_SFI_CompEnt   DS  0C       Compound Entry                      @SKA 04575700
XSF_SFI_CompType  DS  X        Compound type                       @SKA 04579200
XSF_SFI_Field1    DS  0XL3                                         @SKA 04582700
XSF_SFI_LEN1      DS  X        LENGTH of first field               @SKA 04586200
XSF_SFI_DTYP1     DS  X        TYPE of first field                 @SKA 04589700
XSF_SFI_Factor    DS  X        FACTOR for 2nd field                @SKA 04593200
XSF_SFI_Field2    DS  0XL2                                         @SKA 04596700
XSF_SFI_LEN2      DS  X        LENGTH of 2nd field                 @SKA 04600200
XSF_SFI_DTYP2     DS  X        TYPE of 2nd field                   @SKA 04603700
XSF_SFI_CompVal   DS  XL8      The VALUE                           @SKA 04607200
*                                                                       04610700
* ********************************************************************  04614200
* *    Data Types (XSF_SFI_DTYPE, XSF_SFI_DTYP1, XSF_SFI_DTYP2)  @SKC*  04617700
* ********************************************************************  04622400
*                                                                       04654500
XSF_SFI_DTYPE_UNDEF     EQU  X'00' Undefined data                       04686600
XSF_SFI_DTYPE_CHAR_FIX  EQU  X'01' Fixed length n-byte character        04718700
XSF_SFI_DTYPE_BITFLAG   EQU  X'02' 1-byte bit flag byte (8 bits)        04750800
XSF_SFI_DTYPE_BIN8      EQU  X'03' 1-byte (hex) value                   04782900
XSF_SFI_DTYPE_BIN15     EQU  X'04' 2-byte hex value                     04815000
XSF_SFI_DTYPE_BIN31     EQU  X'05' 4-byte hex value                     04847100
XSF_SFI_DTYPE_BIN64     EQU  X'06' 8-byte hex value                @SKA 04863100
XSF_SFI_DTYPE_CHAR_VAR  EQU  X'07' Variable length character            04879200
XSF_SFI_DTYPE_COMPOUND  EQU  X'08' Compound SFI                    @SKA 04895200
XSF_SFI_DTYPE_JDATE     EQU  X'09' 4-byte packed decimal date yyyydddC  04911300
XSF_SFI_DTYPE_TIME      EQU  X'0A' 4-byte packed decimal time hhmmsstC  04943400
*                                                                       04945100
* ********************************************************************  04946800
* *    Compound Types (XSF_SFI_CompType)                           @SKA 04948500
* ********************************************************************  04950200
*                                                                       04951900
XSF_SFI_CompType_UNDEF  EQU  X'00' Undefined type                  @SKA 04953600
XSF_SFI_CompType_Factor EQU  X'01' Factored type                   @SKA 04955300
*                                                                       04957000
* ********************************************************************  04958700
* *    Factors        (XSF_SFI_Factor)                             @SKA 04960400
* ********************************************************************  04962100
*                                                                       04963800
XSF_SFI_Factor_Bytes    EQU  X'00' Value is in Bytes               @SKA 04965500
XSF_SFI_Factor_KB       EQU  X'01' Value is in KBytes              @SKA 04967200
XSF_SFI_Factor_MB       EQU  X'02' Value is in MBytes              @SKA 04968900
XSF_SFI_Factor_GB       EQU  X'03' Value is in GBytes              @SKA 04970600
XSF_SFI_Factor_TB       EQU  X'04' Value is in TBytes              @SKA 04972300
*                                                                       04975500
* ********************************************************************  05007600
* ********************************************************************  05039700
* **   Group Begin and End SFIs                                     **  05071800
* ********************************************************************  05103900
* ********************************************************************  05136000
*                                                                       05168100
* ********************************************************************  05200200
* **   Begin and End ACCESS                                         **  05232300
* ********************************************************************  05264400
XSF_SFI_ID_ACCESS  EQU X'021000'                                        05296500
XSF_ACCESS_LENGTH  EQU X'0008'                                          05328600
                                                                        05360700
XSF_SFI_ID_EACCESS EQU X'021080'                                        05392800
XSF_EACCESS_LENGTH EQU X'0008'                                          05424900
* ********************************************************************  05457000
* **   Begin and End ACTIONS                                        **  05489100
* ********************************************************************  05521200
XSF_SFI_ID_ACTIONS  EQU X'022000'                                       05553300
XSF_ACTIONS_LENGTH  EQU X'0008'                                         05585400
                                                                        05617500
XSF_SFI_ID_EACTIONS EQU X'022080'                                       05649600
XSF_EACTIONS_LENGTH EQU X'0008'                                         05681700
* ********************************************************************  05713800
* **   Begin and End CNTL                                           **  05745900
* ********************************************************************  05778000
XSF_SFI_ID_CNTL   EQU X'024000'                                         05810100
XSF_CNTL_LENGTH   EQU X'0008'                                           05842200
                                                                        05874300
XSF_SFI_ID_ECNTL  EQU X'024080'                                         05906400
XSF_ECNTL_LENGTH  EQU X'0008'                                           05938500
* ********************************************************************  05970600
* **   Begin and End CONTROL                                        **  06002700
* ********************************************************************  06034800
XSF_SFI_ID_CONTROL  EQU X'025000'                                       06066900
XSF_CONTROL_LENGTH  EQU X'0008'                                         06099000
                                                                        06131100
XSF_SFI_ID_ECONTROL EQU X'025080'                                       06163200
XSF_ECONTROL_LENGTH EQU X'0008'                                         06195300
* ********************************************************************  06227400
* **   Begin and End DATASET                                        **  06259500
* ********************************************************************  06291600
XSF_SFI_ID_DATASET  EQU X'026000'                                       06323700
XSF_DATASET_LENGTH  EQU X'0008'                                         06355800
                                                                        06387900
XSF_SFI_ID_EDATASET EQU X'026080'                                       06420000
XSF_EDATASET_LENGTH EQU X'0008'                                         06452100
* *****************************************************************@M3A 06452202
* **   Begin and End DEFAULT                                       @M3A 06452300
* *****************************************************************@M3A 06452400
XSF_SFI_ID_DEFAULT EQU X'026500'                                   @M3A 06452500
XSF_DEFAULT_LENGTH  EQU X'0008'                                    @M3A 06452600
                                                                        06452700
XSF_SFI_ID_EDEFAULT EQU X'026580'                                  @M3A 06452800
XSF_EDEFAULT_LENGTH EQU X'0008'                                    @M3A 06452900
* ********************************************************************  06484200
* **   Begin and End LOCDEF                                         **  06516300
* ********************************************************************  06548400
XSF_SFI_ID_LOCDEF  EQU X'027000'                                        06580500
XSF_LOCDEF_LENGTH  EQU X'0008'                                          06612600
                                                                        06644700
XSF_SFI_ID_ELOCDEF EQU X'027080'                                        06676800
XSF_ELOCDEF_LENGTH EQU X'0008'                                          06708900
* **************************************************************** @07A 06712400
* **   Begin and End MEDINF                                     ** @07A 06715900
* **************************************************************** @07A 06719400
XSF_SFI_ID_MEDINF  EQU X'027500'                                   @07A 06722900
XSF_MEDINF_LENGTH  EQU X'0008'                                     @07A 06726400
                                                                        06729900
XSF_SFI_ID_EMEDINF EQU X'027580'                                   @07A 06733400
XSF_EMEDINF_LENGTH EQU X'0008'                                     @07A 06736900
* ********************************************************************  06741000
* **   Begin and End MESSAGE                                        **  06773100
* ********************************************************************  06805200
XSF_SFI_ID_MESSAGE  EQU X'028000'                                       06837300
XSF_MESSAGE_LENGTH  EQU X'0008'                                         06869400
                                                                        06901500
XSF_SFI_ID_EMESSAGE EQU X'028080'                                       06933600
XSF_EMESSAGE_LENGTH EQU X'0008'                                         06965700
* ********************************************************************  06997800
* **   Begin and End MNTMSG                                         **  07029900
* ********************************************************************  07062000
XSF_SFI_ID_MNTMSG  EQU X'029000'                                        07094100
XSF_MNTMSG_LENGTH  EQU X'0008'                                          07126200
                                                                        07158300
XSF_SFI_ID_EMNTMSG EQU X'029080'                                        07190400
XSF_EMNTMSG_LENGTH EQU X'0008'                                          07222500
* ********************************************************************  07254600
* **   Begin and End MOVES                                          **  07286700
* ********************************************************************  07318800
XSF_SFI_ID_MOVES  EQU X'02A000'                                         07350900
XSF_MOVES_LENGTH  EQU X'0008'                                           07383000
                                                                        07415100
XSF_SFI_ID_EMOVES EQU X'02A080'                                         07447200
XSF_EMOVES_LENGTH EQU X'0008'                                           07479300
* ********************************************************************  07511400
* **   Begin and End OPTION                                         **  07543500
* ********************************************************************  07575600
XSF_SFI_ID_OPTION  EQU X'02B000'                                        07607700
XSF_OPTION_LENGTH  EQU X'0008'                                          07639800
                                                                        07671900
XSF_SFI_ID_EOPTION EQU X'02B080'                                        07704000
XSF_EOPTION_LENGTH EQU X'0008'                                          07736100
* ********************************************************************  07768200
* **   Begin and End OWNER                                          **  07800300
* ********************************************************************  07832400
XSF_SFI_ID_OWNER  EQU X'02C000'                                         07864500
XSF_OWNER_LENGTH  EQU X'0008'                                           07896600
                                                                        07928700
XSF_SFI_ID_EOWNER EQU X'02C080'                                         07960800
XSF_EOWNER_LENGTH EQU X'0008'                                           07992900
* ********************************************************************  08025000
* **   Begin and End PRODUCT                                        **  08057100
* ********************************************************************  08089200
XSF_SFI_ID_PRODUCT  EQU X'02D000'                                       08121300
XSF_PRODUCT_LENGTH  EQU X'0008'                                         08153400
                                                                        08185500
XSF_SFI_ID_EPRODUCT EQU X'02D080'                                       08217600
XSF_EPRODUCT_LENGTH EQU X'0008'                                         08249700
* ********************************************************************  08281800
* **   Begin and End RACK or BIN                                    **  08313900
* ********************************************************************  08346000
XSF_SFI_ID_RACK  EQU X'02E000'                                          08378100
XSF_RACK_LENGTH  EQU X'0008'                                            08410200
                                                                        08442300
XSF_SFI_ID_ERACK EQU X'02E080'                                          08474400
XSF_ERACK_LENGTH EQU X'0008'                                            08506500
* ********************************************************************  08538600
* **   Begin and End REJECT                                         **  08570700
* ********************************************************************  08602800
XSF_SFI_ID_REJECT  EQU X'02F000'                                        08634900
XSF_REJECT_LENGTH  EQU X'0008'                                          08667000
                                                                        08699100
XSF_SFI_ID_EREJECT EQU X'02F080'                                        08731200
XSF_EREJECT_LENGTH EQU X'0008'                                          08763300
* ********************************************************************  08795400
* **   Begin and End SECCLS                                         **  08827500
* ********************************************************************  08859600
XSF_SFI_ID_SECCLS  EQU X'030000'                                        08891700
XSF_SECCLS_LENGTH  EQU X'0008'                                          08923800
                                                                        08955900
XSF_SFI_ID_ESECCLS EQU X'030080'                                        08988000
XSF_ESECCLS_LENGTH EQU X'0008'                                          09020100
* ********************************************************************  09052200
* **   Begin and End SECLVL                                         **  09084300
* ********************************************************************  09116400
XSF_SFI_ID_SECLVL  EQU X'031000'                                        09148500
XSF_SECLVL_LENGTH  EQU X'0008'                                          09180600
                                                                        09212700
XSF_SFI_ID_ESECLVL EQU X'031080'                                        09244800
XSF_ESECLVL_LENGTH EQU X'0008'                                          09276900
* ********************************************************************  09309000
* **   Begin and End STAT                                           **  09341100
* ********************************************************************  09373200
XSF_SFI_ID_STAT  EQU X'032000'                                          09405300
XSF_STAT_LENGTH  EQU X'0008'                                            09437400
                                                                        09469500
XSF_SFI_ID_ESTAT EQU X'032080'                                          09501600
XSF_ESTAT_LENGTH EQU X'0008'                                            09533700
* ********************************************************************  09565800
* **   Begin and End STORE                                          **  09597900
* ********************************************************************  09630000
XSF_SFI_ID_STORE  EQU X'033000'                                         09662100
XSF_STORE_LENGTH  EQU X'0008'                                           09694200
                                                                        09726300
XSF_SFI_ID_ESTORE EQU X'033080'                                         09758400
XSF_ESTORE_LENGTH EQU X'0008'                                           09790500
* ********************************************************************  09822600
* **   Begin and End SYSRETC                                        **  09854700
* ********************************************************************  09886800
XSF_SFI_ID_SYSRETC  EQU X'034000'                                       09918900
XSF_SYSRETC_LENGTH  EQU X'0008'                                         09951000
                                                                        09983100
XSF_SFI_ID_ESYSRETC EQU X'034080'                                       10015200
XSF_ESYSRETC_LENGTH EQU X'0008'                                         10047300
* ********************************************************************  10079400
* **   Begin and End VLPOOL                                         **  10111500
* ********************************************************************  10143600
XSF_SFI_ID_VLPOOL  EQU X'035000'                                        10175700
XSF_VLPOOL_LENGTH  EQU X'0008'                                          10207800
                                                                        10239900
XSF_SFI_ID_EVLPOOL EQU X'035080'                                        10272000
XSF_EVLPOOL_LENGTH EQU X'0008'                                          10304100
* ********************************************************************  10336200
* **   Begin and End VOL                                            **  10368300
* ********************************************************************  10400400
XSF_SFI_ID_VOL     EQU X'036000'                                        10432500
XSF_VOLGRP_LENGTH  EQU X'0008'                                          10464600
                                                                        10496700
XSF_SFI_ID_EVOL    EQU X'036080'                                        10528800
XSF_EVOLGRP_LENGTH EQU X'0008'                                          10560900
* ********************************************************************  10593000
* **   Begin and End VOLUME                                         **  10625100
* ********************************************************************  10657200
XSF_SFI_ID_VOLUME  EQU X'037000'                                        10689300
XSF_VOLUME_LENGTH  EQU X'0008'                                          10721400
                                                                        10753500
XSF_SFI_ID_EVOLUME EQU X'037080'                                        10785600
XSF_EVOLUME_LENGTH EQU X'0008'                                          10817700
* ********************************************************************  10849800
* **   Begin and End VRS                                            **  10881900
* ********************************************************************  10914000
XSF_SFI_ID_VRS     EQU X'038000'                                        10946100
XSF_VRSGRP_LENGTH  EQU X'0008'                                          10978200
                                                                        11010300
XSF_SFI_ID_EVRS    EQU X'038080'                                        11042400
XSF_EVRSGRP_LENGTH EQU X'0008'                                          11074500
* ****************************************************************@K4A  11078000
* **   Begin and End PRODUCT  VOLUMES                             @K4A  11081500
* ****************************************************************@K4A  11085000
XSF_SFI_ID_PVOL     EQU X'039000'                                 @K4A  11088500
XSF_PVOL_LENGTH     EQU X'0008'                                   @K4A  11092000
                                                                        11095500
XSF_SFI_ID_EPVOL    EQU X'039080'                                 @K4A  11099000
XSF_EPVOL_LENGTH    EQU X'0008'                                   @K4A  11102500
* **************************************************************** @MRA 11102700
* **   Begin and End OPENRULE                                   ** @MRA 11102900
* **************************************************************** @MRA 11103100
XSF_SFI_ID_OPENRULE  EQU X'03A000'                                 @MRA 11103300
XSF_OPENRULE_LENGTH  EQU X'0008'                                   @MRA 11103500
                                                                        11103700
XSF_SFI_ID_EOPENRULE EQU X'03A080'                                 @MRA 11103900
XSF_EOPENRULE_LENGTH EQU X'0008'                                   @MRA 11104100
* **************************************************************** @MRA 11104300
* **   Begin and End PRTITION                                   ** @MRA 11104500
* **************************************************************** @MRA 11104700
XSF_SFI_ID_PRTITION  EQU X'03B000'                                 @MRA 11104900
XSF_PRTITION_LENGTH  EQU X'0008'                                   @MRA 11105100
                                                                        11105300
XSF_SFI_ID_EPRTITION EQU X'03B080'                                 @MRA 11105500
XSF_EPRTITION_LENGTH EQU X'0008'                                   @MRA 11105700
* **************************************************************** @NIA 11107500
* **   Begin and End STATUS                                     ** @NIA 11109300
* **************************************************************** @NIA 11111100
XSF_SFI_ID_STATUS  EQU X'03C000'                                   @NIA 11112900
XSF_STATUS_LENGTH  EQU X'0008'                                     @NIA 11114700
                                                                        11116500
XSF_SFI_ID_ESTATUS EQU X'03C080'                                   @NIA 11118300
XSF_ESTATUS_LENGTH EQU X'0008'                                     @NIA 11120100
* **************************************************************** @NIA 11121900
* **   Begin and End TASKS                                      ** @NIA 11123700
* **************************************************************** @NIA 11125500
XSF_SFI_ID_TASKS   EQU X'03D000'                                   @NIA 11127300
XSF_TASKS_LENGTH   EQU X'0008'                                     @NIA 11129100
                                                                        11130900
XSF_SFI_ID_ETASKS  EQU X'03D080'                                   @NIA 11132700
XSF_ETASKS_LENGTH  EQU X'0008'                                     @NIA 11134500
* ********************************************************************  11136300
* ********************************************************************  11138700
* *    Return and Reason Code SFIs                                  **  11170800
* ********************************************************************  11202900
* ********************************************************************  11235000
XSF_SFI_FRC_ID  EQU X'400000' Function Reason Code                      11267100
XSF_FRC_LENGTH  EQU X'000C'                                             11299200
XSF_FRC_DTYPE   EQU X'05'                                               11331300
* ********************************************************************  11363400
XSF_SFI_FRS_ID  EQU X'401000' Function Reason Code                      11395500
XSF_FRS_LENGTH  EQU X'000C'                                             11427600
XSF_FRS_DTYPE   EQU X'05'                                               11459700
* ********************************************************************  11491800
XSF_SFI_RSNC_ID EQU X'402000' Reason Code                               11523900
XSF_RSNC_LENGTH EQU X'000C'                                             11556000
XSF_RSNC_DTYPE  EQU X'05'                                               11588100
* ********************************************************************  11620200
XSF_SFI_RTNC_ID EQU X'403000' Return Code                               11652300
XSF_RTNC_LENGTH EQU X'000C'                                             11684400
XSF_RTNC_DTYPE  EQU X'05'                                               11716500
* ********************************************************************  11748600
XSF_SFI_SVCN_ID EQU X'404000' Service Name                              11780700
XSF_SVCN_LENGTH EQU X'0010'                                             11812800
XSF_SVCN_DTYPE  EQU X'07'                                               11844900
* ********************************************************************  11877000
* ********************************************************************  11909100
* **   Messages and Message Variable SFIs                           **  11941200
* ********************************************************************  11973300
* ********************************************************************  12005400
XSF_SFI_MSGL_ID EQU X'051000' Message Line                              12037500
XSF_MSGL_LENGTH EQU X'0103'                                             12069600
XSF_MSGL_DTYPE  EQU X'07'                                               12101700
* ********************************************************************  12133800
XSF_SFI_MSGN_ID EQU X'052000' Message Number                            12165900
XSF_MSGN_LENGTH EQU X'0010'                                             12198000
XSF_MSGN_DTYPE  EQU X'01'                                               12230100
* ********************************************************************  12262200
XSF_SFI_ENTN_ID EQU X'053000' Number of Entries                         12294300
XSF_ENTN_LENGTH EQU X'000C'                                             12326400
XSF_ENTN_DTYPE  EQU X'05'                                               12358500
* **************************************************************** @K1A 12360300
XSF_SFI_KEYF_ID EQU X'054000' From Key                             @K1A 12362100
XSF_KEYF_LENGTH EQU X'0041'                                        @LUC 12363900
XSF_KEYF_DTYPE  EQU X'07'                                          @K1A 12365700
* **************************************************************** @K1A 12367500
XSF_SFI_KEYT_ID EQU X'054200' To Key                               @K1A 12369300
XSF_KEYT_LENGTH EQU X'0041'                                        @LUC 12371100
XSF_KEYT_DTYPE  EQU X'07'                                          @K1A 12372900
* **************************************************************** @K1A 12374700
XSF_SFI_TYPF_ID EQU X'055000' Type from                            @K1A 12376500
XSF_TYPF_LENGTH EQU X'0010'                                        @K1A 12378300
XSF_TYPF_DTYPE  EQU X'07'                                          @K1A 12380100
* **************************************************************** @K1A 12381900
XSF_SFI_TYPT_ID EQU X'055200' Type to                              @K1A 12383700
XSF_TYPT_LENGTH EQU X'0010'                                        @K1A 12385500
XSF_TYPT_DTYPE  EQU X'07'                                          @K1A 12387300
* **************************************************************** @MPA 12387900
XSF_SFI_CONT_ID EQU X'057000' Continue Information                 @MPA 12388500
XSF_CONT_LENGTH EQU X'005C'                                        @MPA 12389100
XSF_CONT_DTYPE  EQU X'07'                                          @MPA 12389700
* ********************************************************************  12390600
* ********************************************************************  12422700
* **   Output Data SFI IDs                                          **  12454800
* ********************************************************************  12486900
* *****************************************************************@01A 12490900
XSF_SFI_ABND_ID EQU X'800500' Closed by Abend                      @MXC 12494900
XSF_ABND_LENGTH EQU X'0009'                                        @01A 12498900
XSF_ABND_DTYPE  EQU X'03'                                          @01A 12502900
*                                                                  @01A 12506900
XSF_ABND_DATA_NO  EQU X'00'                                        @01A 12510900
XSF_ABND_DATA_YES EQU X'01'                                        @01A 12514900
* ********************************************************************  12519000
XSF_SFI_ACCT_ID EQU X'800800' Accounting Source                         12551100
XSF_ACCT_LENGTH EQU X'0009'                                             12583200
XSF_ACCT_DTYPE  EQU X'03'                                               12615300
*                                                                       12647400
XSF_ACCT_DATA_JOB  EQU X'00'                                            12679500
XSF_ACCT_DATA_STEP EQU X'01'                                            12711600
* ********************************************************************  12743700
XSF_SFI_ACN_ID EQU X'801000' Account Number                             12775800
XSF_ACN_LENGTH EQU X'0030'                                              12807900
XSF_ACN_DTYPE  EQU X'07'                                                12840000
* *************************************************************** @04A  12844000
XSF_SFI_ACS_ID EQU X'801800' SMS ACS support                      @04A  12848000
XSF_ACS_LENGTH EQU X'0009'                                        @04A  12852000
XSF_ACS_DTYPE  EQU X'03'                                          @04A  12856000
*                                                                 @04A  12860000
XSF_ACS_DATA_NO  EQU X'00'                                        @04A  12864000
XSF_ACS_DATA_YES EQU X'01'                                        @04A  12868000
* ********************************************************************  12872100
XSF_SFI_ACT_ID EQU X'802000' Actions on Release                         12904200
XSF_ACT_LENGTH EQU X'0009'                                              12936300
XSF_ACT_DTYPE  EQU X'02'                                                12968400
*                                                                       13000500
XSF_ACT_FLAG_SCRATCH EQU X'80'                                          13032600
XSF_ACT_FLAG_REPLACE EQU X'40'                                          13064700
XSF_ACT_FLAG_INIT    EQU X'20'                                          13096800
XSF_ACT_FLAG_ERASE   EQU X'10'                                          13128900
XSF_ACT_FLAG_RETURN  EQU X'08'                                          13161000
XSF_ACT_FLAG_NOTIFY  EQU X'04'                                          13193100
* ********************************************************************  13225200
XSF_SFI_ADL_ID EQU X'803001' Address Line                               13257300
XSF_ADL_LENGTH EQU X'0030'                                              13289400
XSF_ADL_DTYPE  EQU X'07'                                                13321500
* ********************************************************************  13353600
XSF_SFI_ADTJ_ID EQU X'804000' Assigned Date                             13385700
XSF_ADTJ_LENGTH EQU X'000C'                                             13417800
XSF_ADTJ_DTYPE  EQU X'09'                                               13449900
* ********************************************************************  13482000
XSF_SFI_AST_ID EQU X'805000' Action Status                              13514100
XSF_AST_LENGTH EQU X'0009'                                              13546200
XSF_AST_DTYPE  EQU X'02'                                                13578300
*                                                                       13610400
XSF_AST_FLAG_PENDING   EQU X'80'                                        13642500
XSF_AST_FLAG_CONFIRMED EQU X'40'                                        13674600
XSF_AST_FLAG_COMPLETE  EQU X'20'                                        13706700
XSF_AST_FLAG_UNKNOWN   EQU X'10'                                        13738800
* ********************************************************************  13770900
XSF_SFI_ATM_ID EQU X'806000' Assigned Time                              13803000
XSF_ATM_LENGTH EQU X'000C'                                              13835100
XSF_ATM_DTYPE  EQU X'0A'                                                13867200
* ********************************************************************  13899300
XSF_SFI_AUD_ID EQU X'807000' SMF Audit Record Number                    13931400
XSF_AUD_LENGTH EQU X'000A'                                              13963500
XSF_AUD_DTYPE  EQU X'04'                                                13995600
* ********************************************************************  14027700
XSF_SFI_AVL_ID EQU X'808000' Volume Availability                        14059800
XSF_AVL_LENGTH EQU X'0009'                                              14091900
XSF_AVL_DTYPE  EQU X'02'                                                14124000
*                                                                       14156100
XSF_AVL_FLAG_PENDREL  EQU X'40'                                         14188200
XSF_AVL_FLAG_VITALRCD EQU X'20'                                         14220300
XSF_AVL_FLAG_ONLOAN   EQU X'08'                                         14252400
XSF_AVL_FLAG_OPEN     EQU X'04'                                         14284500
* ********************************************************************  14316600
XSF_SFI_BDTJ_ID EQU X'809000' Last CDS Backup Date                      14348700
XSF_BDTJ_LENGTH EQU X'000C'                                             14380800
XSF_BDTJ_DTYPE  EQU X'09'                                               14412900
* ********************************************************************  14419300
XSF_SFI_BESK_ID EQU X'809310' BES key index                        @SLA 14425700
XSF_BESK_LENGTH EQU X'000C'                                        @SLA 14432100
XSF_BESK_DTYPE  EQU X'05'                                          @SLA 14438500
* ********************************************************************  14445000
XSF_SFI_BIN_ID EQU X'80A000' Bin Number                                 14477100
XSF_BIN_LENGTH EQU X'000E'                                              14509200
XSF_BIN_DTYPE  EQU X'01'                                                14541300
* ********************************************************************  14573400
XSF_SFI_BKPP_ID EQU X'80B000' Backup Procedure Name                     14605500
XSF_BKPP_LENGTH EQU X'0010'                                             14637600
XSF_BKPP_DTYPE  EQU X'07'                                               14669700
* ********************************************************************  14701800
XSF_SFI_BLKC_ID EQU X'80C000' Block Count                               14733900
XSF_BLKC_LENGTH EQU X'000C'                                             14766000
XSF_BLKC_DTYPE  EQU X'05'                                               14798100
* ********************************************************************  14830200
XSF_SFI_BLKS_ID EQU X'80D000' Block Size                                14862300
XSF_BLKS_LENGTH EQU X'000C'                                             14894400
XSF_BLKS_DTYPE  EQU X'05'                                               14926500
* ********************************************************************  14958600
XSF_SFI_BLKT_ID EQU X'80D030' Total Block Count                   @S9A  14965000
XSF_BLKT_LENGTH EQU X'000C'                                       @S9A  14971400
XSF_BLKT_DTYPE  EQU X'05'                                         @S9A  14977800
* ********************************************************************  14984200
XSF_SFI_BLK6_ID EQU X'80D0B0' Total Block Count                   @SOA  14985500
XSF_BLK6_LENGTH EQU X'0010'                                       @SOA  14986800
XSF_BLK6_DTYPE  EQU X'06'               (8-byte (hex) value)      @SOA  14988100
* ********************************************************************  14989400
XSF_SFI_BLP_ID EQU X'80E000' BLP Option                                 14990700
XSF_BLP_LENGTH EQU X'0009'                                              15022800
XSF_BLP_DTYPE  EQU X'03'                                                15054900
*                                                                       15087000
XSF_BLP_DATA_RMM   EQU X'00'                                            15119100
XSF_BLP_DATA_NORMM EQU X'01'                                            15151200
* ********************************************************************  15183300
XSF_SFI_BMN_ID EQU X'80F000' Bin Number Media Name                      15215400
XSF_BMN_LENGTH EQU X'0010'                                              15247500
XSF_BMN_DTYPE  EQU X'07'                                                15279600
* ********************************************************************  15311700
XSF_SFI_BTM_ID EQU X'810000' Last CDS Backup Time                       15343800
XSF_BTM_LENGTH EQU X'000C'                                              15375900
XSF_BTM_DTYPE  EQU X'0A'                                                15408000
* ********************************************************************  15440100
XSF_SFI_CACT_ID EQU X'811000' Control Active Functions                  15472200
XSF_CACT_LENGTH EQU X'0009'                                             15504300
XSF_CACT_DTYPE  EQU X'02'                                               15536400
*                                                                       15568500
XSF_CACT_FLAG_BACKUP  EQU X'80'                                         15600600
XSF_CACT_FLAG_RESTORE EQU X'40'                                         15632700
XSF_CACT_FLAG_VERIFY  EQU X'20'                                         15664800
XSF_CACT_FLAG_EXPROC  EQU X'10'                                         15696900
XSF_CACT_FLAG_EXTRACT EQU X'08'                                         15729000
XSF_CACT_FLAG_DSTORE  EQU X'04'                                         15761100
XSF_CACT_FLAG_VRSEL   EQU X'02'                                         15793200
* **************************************************************** @K1A 15796700
XSF_SFI_CATS_ID EQU X'811800' CATSYSID value                       @K1A 15800200
XSF_CATS_LENGTH EQU X'0009'                                        @K1A 15803700
XSF_CATS_DTYPE  EQU X'03'                                          @K1A 15807200
*                                                                  @K1A 15810700
XSF_CATS_DATA_SET    EQU X'00'                                     @K1A 15814200
XSF_CATS_DATA_NOTSET EQU X'01'                                     @K1A 15817700
XSF_CATS_DATA_STAR   EQU X'02'                                     @K1A 15821200
* ********************************************************************  15825300
XSF_SFI_CDS_ID EQU X'812000' Control Data Set ID                        15857400
XSF_CDS_LENGTH EQU X'0010'                                              15889500
XSF_CDS_DTYPE  EQU X'07'                                                15921600
* **************************************************************** @M7A 15921700
XSF_SFI_CDSF_ID EQU X'812400' CDSFULL Parmlib Value                @M7A 15921800
XSF_CDSF_LENGTH EQU X'000A'                                        @M7A 15921900
XSF_CDSF_DTYPE  EQU X'04'                                          @M7A 15922000
* **************************************************************** @MKA 15922400
XSF_SFI_CDSQ   EQU X'812900'  CDS id ENQ name enabled              @MKA 15923200
XSF_CDSQ_LENGTH EQU X'0009'                                        @MKA 15924000
XSF_CDSQ_DTYPE EQU X'03'                                           @MKA 15924800
*                                                                  @MKA 15925600
XSF_CDSQ_DATA_DISABLED EQU X'00'                                   @MKA 15926400
XSF_CDSQ_DATA_ENABLED  EQU X'01'                                   @MKA 15927200
* **************************************************************** @LRA 15928000
XSF_SFI_CDSU_ID EQU X'812A00' CDS percentage used                  @LRA 15934400
XSF_CDSU_LENGTH EQU X'000A'                                        @LRA 15940800
XSF_CDSU_DTYPE  EQU X'04'                                          @LRA 15947200
* ********************************************************************  15953700
XSF_SFI_CDTJ_ID EQU X'813000' Create Date                               15985800
XSF_CDTJ_LENGTH EQU X'000C'                                             16017900
XSF_CDTJ_DTYPE  EQU X'09'                                               16050000
* ********************************************************************  16082100
XSF_SFI_CJBN_ID EQU X'814000' Job Name                                  16114200
XSF_CJBN_LENGTH EQU X'0010'                                             16146300
XSF_CJBN_DTYPE  EQU X'07'                                               16178400
* ********************************************************************  16210500
XSF_SFI_CLIB_ID EQU X'815000' Current Library Name                      16242600
XSF_CLIB_LENGTH EQU X'0010'                                             16274700
XSF_CLIB_DTYPE  EQU X'07'                                               16306800
* ********************************************************************  16338900
XSF_SFI_CLS_ID EQU X'816000' Security Class Description                 16371000
XSF_CLS_LENGTH EQU X'0028'                                              16403100
XSF_CLS_DTYPE  EQU X'07'                                                16435200
* *************************************************************** @LQA  16437300
XSF_SFI_CMDD_ID EQU X'816900' COMMANDAUTH DSN                     @LQA  16439400
XSF_CMDD_LENGTH EQU X'0009'                                       @LQA  16441500
XSF_CMDD_DTYPE  EQU X'03'                                         @LQA  16443600
*                                                                 @LQA  16445700
XSF_CMDD_DATA_NO  EQU X'00'                                       @LQA  16447800
XSF_CMDD_DATA_YES EQU X'01'                                       @LQA  16449900
* *************************************************************** @LQA  16452000
XSF_SFI_CMDO_ID EQU X'8169A0' COMMANDAUTH OWNER                   @LQA  16454100
XSF_CMDO_LENGTH EQU X'0009'                                       @LQA  16456200
XSF_CMDO_DTYPE  EQU X'03'                                         @LQA  16458300
*                                                                 @LQA  16460400
XSF_CMDO_DATA_NO  EQU X'00'                                       @LQA  16462500
XSF_CMDO_DATA_YES EQU X'01'                                       @LQA  16464600
* ********************************************************************  16467300
XSF_SFI_CNT_ID EQU X'817000' Bin, Rack or Volume Count                  16499400
XSF_CNT_LENGTH EQU X'000C'                                              16531500
XSF_CNT_DTYPE  EQU X'05'                                                16563600
* **************************************************************** @02A 16570000
XSF_SFI_CPGM_ID EQU X'817820' Creating program name                @02A 16576400
XSF_CPGM_LENGTH EQU X'0010'                                        @02A 16582800
XSF_CPGM_DTYPE  EQU X'01'                                          @02A 16589200
* ********************************************************************  16590500
XSF_SFI_CRAT_ID EQU X'817890' Compression ratio in hundreths       @SOA 16591800
XSF_CRAT_LENGTH EQU X'000C'                                        @SOA 16593100
XSF_CRAT_DTYPE  EQU X'05'                                          @SOA 16594400
* ********************************************************************  16595700
XSF_SFI_CRID_ID EQU X'817900' Creating user ID                     @OBA 16602100
XSF_CRID_LENGTH EQU X'0010'                                        @OBA 16608500
XSF_CRID_DTYPE  EQU X'07'                                          @OBA 16614900
* ********************************************************************  16621300
XSF_SFI_CRP_ID EQU X'818000'  CATRETPD Retention Period                 16627800
XSF_CRP_LENGTH EQU X'000C'                                              16659900
XSF_CRP_DTYPE  EQU X'05'                                                16692000
* **************************************************************** @K1A 16698400
XSF_SFI_CSDT_ID EQU X'818800' Catalog Synchronize date             @K1A 16704800
XSF_CSDT_LENGTH EQU X'000C'                                        @K1A 16711200
XSF_CSDT_DTYPE  EQU X'09'                                          @K1A 16717600
* *****************************************************************@LUA 16718300
XSF_SFI_CSHN_ID EQU X'819200' Client/Server Host name              @LUA 16719000
XSF_CSHN_LENGTH EQU X'0047'                                        @LUA 16719700
XSF_CSHN_DTYPE  EQU X'07'                                          @LUA 16720400
* *****************************************************************@LUA 16721100
XSF_SFI_CSIP_ID EQU X'819250' Client/Server IP address             @LUA 16721800
XSF_CSIP_LENGTH EQU X'0035'                                        @NQC 16722500
XSF_CSIP_DTYPE  EQU X'07'                                          @LUA 16723200
* ********************************************************************  16724100
XSF_SFI_CSG_ID EQU X'819000' Current Storage Group                      16756200
XSF_CSG_LENGTH EQU X'0010'                                              16788300
XSF_CSG_DTYPE  EQU X'07'                                                16820400
* **************************************************************** @K1A 16821300
XSF_SFI_CSTM_ID EQU X'819400' Catalog Synchronize time             @K1A 16822200
XSF_CSTM_LENGTH EQU X'000C'                                        @K1A 16823100
XSF_CSTM_DTYPE  EQU X'0A'                                          @K1A 16824000
* **************************************************************** @LGA 16824400
XSF_SFI_CSVE_ID EQU X'819600' Stacked volume enabled status        @LGA 16824800
XSF_CSVE_LENGTH EQU X'0009'                                        @LGA 16825200
XSF_CSVE_DTYPE  EQU X'03'                                          @LGA 16825600
*                                                                  @LGA 16826000
XSF_CSVE_DATA_NONE     EQU X'00'                                   @LGA 16826400
XSF_CSVE_DATA_ENABLED  EQU X'01'                                   @LGA 16826800
XSF_CSVE_DATA_DISABLED EQU X'02'                                   @LGA 16827200
XSF_CSVE_DATA_MIXED    EQU X'03'                                   @LGA 16827600
* **************************************************************** @M2A 16828000
XSF_SFI_CTLD_ID EQU X'819785'  Catalog Days                        @M2A 16828102
XSF_CTLD_LENGTH EQU X'000C'                                        @M2A 16828202
XSF_CTLD_DTYPE  EQU X'05'                                          @M2A 16828302
* ********************************************************************  16828402
XSF_SFI_CTLG_ID EQU X'819800' Catalog status                       @01A 16829400
XSF_CTLG_LENGTH EQU X'0009'                                        @01A 16833900
XSF_CTLG_DTYPE  EQU X'03'                                          @01A 16838400
*                                                                  @01A 16842900
XSF_CTLG_DATA_UNKNOWN EQU X'00'                                    @01A 16847400
XSF_CTLG_DATA_NO      EQU X'01'                                    @K1A 16849100
XSF_CTLG_DATA_YES     EQU X'02'                                    @K1A 16850800
* ********************************************************************  16852500
XSF_SFI_CTM_ID EQU X'81A000' Create Time                                16884600
XSF_CTM_LENGTH EQU X'000C'                                              16916700
XSF_CTM_DTYPE  EQU X'0A'                                                16948800
* **************************************************************** @S8A 16955200
XSF_SFI_CTNR_ID EQU X'81A300' Container                            @S8A 16961600
XSF_CTNR_LENGTH EQU X'0018'                                        @S8A 16968000
XSF_CTNR_DTYPE  EQU X'07'                                          @S8A 16974400
* ********************************************************************  16974502
XSF_SFI_CTRT_ID EQU X'81A400' Catalog Retained                     @M4A 16974602
XSF_CTRT_LENGTH EQU X'0009'                                        @M4A 16974702
XSF_CTRT_DTYPE  EQU X'03'                                          @M4A 16974802
*                                                                  @M4A 16974902
XSF_CTRT_DATA_NO      EQU X'00'                                    @M4A 16975002
XSF_CTRT_DATA_KBC     EQU X'01'                                    @M4A 16976002
XSF_CTRT_DATA_UX      EQU X'02'                                    @M4A 16977002
XSF_CTRT_DATA_FXP     EQU X'03'                                    @12A 16978002
* ********************************************************************  16980900
XSF_SFI_DBN_ID EQU X'81B000' Bin Numbers in DISTANT                     17013000
XSF_DBN_LENGTH EQU X'000C'                                              17045100
XSF_DBN_DTYPE  EQU X'05'                                                17077200
* **************************************************************** @SCA 17080700
XSF_SFI_DBIN_ID EQU X'81A600' Destination Bin number               @SCA 17084200
XSF_DBIN_LENGTH EQU X'000E'                                        @SCA 17087700
XSF_DBIN_DTYPE  EQU X'01'                                          @SCA 17091200
* **************************************************************** @SCA 17094700
XSF_SFI_DBMN_ID EQU X'81A700' Destination Bin media name           @SCA 17098200
XSF_DBMN_LENGTH EQU X'0010'                                        @SCA 17101700
XSF_DBMN_DTYPE  EQU X'07'                                          @K3C 17105500
* ********************************************************************  17109300
XSF_SFI_DC_ID EQU X'81C000' Data Class                                  17141400
XSF_DC_LENGTH EQU X'0010'                                               17173500
XSF_DC_DTYPE  EQU X'07'                                                 17205600
* ********************************************************************  17237700
XSF_SFI_DD_ID EQU X'81D000' DD Name                                     17269800
XSF_DD_LENGTH EQU X'0010'                                               17301900
XSF_DD_DTYPE  EQU X'07'                                                 17334000
* ********************************************************************  17366100
XSF_SFI_DDTJ_ID EQU X'81E000' Delete Date or Last Store Update Date     17398200
XSF_DDTJ_LENGTH EQU X'000C'                                             17430300
XSF_DDTJ_DTYPE  EQU X'09'                                               17462400
* ********************************************************************  17462502
XSF_SFI_DEFC_ID EQU X'81E050' DEFTABLE/ entries count              @M3A 17462600
XSF_DEFC_LENGTH EQU X'000A'                                        @M3A 17462700
XSF_DEFC_DTYPE  EQU X'04'                                          @M3A 17462800
* ********************************************************************  17462900
XSF_SFI_DEFD_ID EQU X'81E100' DEFTABLE/Data set name entry         @M3A 17463000
XSF_DEFD_LENGTH EQU X'0034'                                        @M3A 17463100
XSF_DEFD_DTYPE  EQU X'07'                                          @M3A 17463200
* ********************************************************************  17463300
XSF_SFI_DEFE_ID EQU X'81E200' DEFTABLE/EXTRA RETENTION PERIOD ent. @M3A 17463400
XSF_DEFE_LENGTH EQU X'000C'                                        @M3A 17463500
XSF_DEFE_DTYPE  EQU X'05'                                          @M3A 17463600
* ********************************************************************  17463700
XSF_SFI_DEFJ_ID EQU X'81E300' DEFTABLE/JOBNAME entry               @M3A 17463800
XSF_DEFJ_LENGTH EQU X'0010'                                        @M3A 17463900
XSF_DEFJ_DTYPE  EQU X'07'                                          @M3A 17464000
* ********************************************************************  17464100
XSF_SFI_DEFK_ID EQU X'81E400' DEFTABLE/KEYDATE entry               @M3A 17464200
XSF_DEFK_LENGTH EQU X'0011'                                        @M3A 17464300
XSF_DEFK_DTYPE  EQU X'07'                                          @M3A 17464400
* ********************************************************************  17464500
XSF_SFI_DEFL_ID EQU X'81E500' DEFTABLE/LASTREF VALUE entry         @M3A 17464600
XSF_DEFL_LENGTH EQU X'000C'                                        @M3A 17464700
XSF_DEFL_DTYPE  EQU X'05'                                          @M3A 17464800
* ********************************************************************  35143500
XSF_SFI_DEFM_ID EQU X'81E550' DEFTABLE/EDM entry                   @M8A 35143600
XSF_DEFM_LENGTH EQU X'0009'                                        @M8A 35143700
XSF_DEFM_DTYPE  EQU X'03'                                          @M8A 35143800
XSF_DEFM_DATA_BLANK  EQU X'FF'                                     @M8A 35143902
XSF_DEFM_DATA_NO     EQU X'00'                                     @M8A 35144002
XSF_DEFM_DATA_YES    EQU X'01'                                     @M8A 35144102
* ********************************************************************  35141300
XSF_SFI_DEFN_ID EQU X'81E570' DEFTABLE/PROGRAM NAME entry          @M8A 35141400
XSF_DEFN_LENGTH EQU X'0010'                                        @M8A 35141500
XSF_DEFN_DTYPE  EQU X'07'                                          @M8A 35141600
* ********************************************************************  17464900
XSF_SFI_DEFO_ID EQU X'81E600' DEFTABLE/RETENTION OVERRIDE entry    @M3A 17465000
XSF_DEFO_LENGTH EQU X'0009'                                        @M3A 17465100
XSF_DEFO_DTYPE  EQU X'03'                                          @M3A 17465200
XSF_DEFO_DATA_BLANK  EQU X'FF'                                     @M3C 17465302
XSF_DEFO_DATA_NO     EQU X'00'                                     @M3C 17465402
XSF_DEFO_DATA_YES    EQU X'01'                                     @M3A 17465502
* ********************************************************************  17465600
XSF_SFI_DEFP_ID EQU X'81E700' DEFTABLE/POOL ID entry               @M3A 17465700
XSF_DEFP_LENGTH EQU X'000E'                                        @M3A 17465800
XSF_DEFP_DTYPE  EQU X'07'                                          @M3A 17465900
* ********************************************************************  17466000
XSF_SFI_DEFR_ID EQU X'81E800' DEFTABLE/RETENTION METHOD entry      @M3A 17466100
XSF_DEFR_LENGTH EQU X'0009'                                        @M3A 17466200
XSF_DEFR_DTYPE  EQU X'03'                                          @M3A 17466300
*                                                                  @M3A 35140900
XSF_DEFR_DATA_BLANK EQU X'FF'                                      @M3C 35141002
XSF_DEFR_DATA_VRSEL EQU X'00'                                      @M3C 35141100
XSF_DEFR_DATA_EXPDT EQU X'01'                                      @M3C 35141200
* ********************************************************************  35141300
XSF_SFI_DEFV_ID EQU X'81E900' DEFTABLE/VRS VALUE entry             @M3A 35141400
XSF_DEFV_LENGTH EQU X'0010'                                        @M3A 35141500
XSF_DEFV_DTYPE  EQU X'07'                                          @M3A 35141600
* ********************************************************************  35141700
XSF_SFI_DEFW_ID EQU X'81EA00' DEFTABLE/WHILECATALOG entry          @M3A 35141800
XSF_DEFW_LENGTH EQU X'0009'   GDG/non-GDG ????                     @M3A 35141900
XSF_DEFW_DTYPE  EQU X'03'                                          @M3A 35142000
*                                                                  @M3A 35143002
XSF_DEFW_DATA_BLANK        EQU X'FF'                               @M3C 35143102
XSF_DEFW_DATA_OFF          EQU X'00'                               @M3C 35143202
XSF_DEFW_DATA_ON           EQU X'01'                               @M3C 35143302
XSF_DEFW_DATA_UNTILEXPIRED EQU X'02'                               @M3C 35143402
* ********************************************************************  35143500
XSF_SFI_DEFX_ID EQU X'81EB00' DEFTABLE/VRSEL EXCLUDED entry        @M3A 35143600
XSF_DEFX_LENGTH EQU X'0009'                                        @M3A 35143700
XSF_DEFX_DTYPE  EQU X'03'                                          @M3A 35143800
XSF_DEFX_DATA_BLANK  EQU X'FF'                                     @M3C 35143902
XSF_DEFX_DATA_NO     EQU X'00'                                     @M3C 35144002
XSF_DEFX_DATA_YES    EQU X'01'                                     @M3A 35144102
* ********************************************************************  35144200
XSF_SFI_DEFY_ID EQU X'81EC00' DEFTABLE/RETAINBY VALUE entry        @M3A 35144300
XSF_DEFY_LENGTH EQU X'0009'                                        @M3A 35144400
XSF_DEFY_DTYPE  EQU X'03'                                          @M3A 35144500
*                                                                  @M3A 35144600
XSF_DEFY_DATA_BLANK  EQU X'FF'                                     @M3C 35144702
XSF_DEFY_DATA_VOLUME EQU X'00'                                     @M3C 35144802
XSF_DEFY_DATA_FIRST  EQU X'01'                                     @M3A 35144902
XSF_DEFY_DATA_SET    EQU X'02'                                     @M3A 35145002
* ********************************************************************  35143500
XSF_SFI_DEFZ_ID EQU X'81ED00' DEFTABLE/CONTINUE entry              @M8A 35143600
XSF_DEFZ_LENGTH EQU X'0009'                                        @M8A 35143700
XSF_DEFZ_DTYPE  EQU X'03'                                          @M8A 35143800
XSF_DEFZ_DATA_NO     EQU X'00'                                     @M8A 35144002
XSF_DEFZ_DATA_YES    EQU X'01'                                     @M8A 35144102
                                                                        35146102
* ********************************************************************  35146200
XSF_SFI_DEN_ID EQU X'81F000' Media Density                              35146300
XSF_DEN_LENGTH EQU X'0009'                                              35146400
XSF_DEN_DTYPE  EQU X'03'                                                35146500
*                                                                       35146600
XSF_DEN_DATA_UNDEFINED EQU X'00'                                        35146700
XSF_DEN_DATA_1600      EQU X'01'                                        35146800
XSF_DEN_DATA_6250      EQU X'02'                                        35146900
XSF_DEN_DATA_3480      EQU X'03'                                        35147000
XSF_DEN_DATA_COMPACT   EQU X'04'                                        35147100
* ********************************************************************  35147200
XSF_SFI_DESC_ID EQU X'820000' Volume or VRS Description                 35147300
XSF_DESC_LENGTH EQU X'0026'                                             35147400
XSF_DESC_DTYPE  EQU X'07'                                               35147500
* ********************************************************************  35147600
XSF_SFI_DEST_ID EQU X'821000' Destination Name                          35147700
XSF_DEST_LENGTH EQU X'0010'                                             35147800
XSF_DEST_DTYPE  EQU X'07'                                               35147900
* ********************************************************************  35148000
XSF_SFI_DEV_ID EQU X'822000'  Device Number                             35148100
XSF_DEV_LENGTH EQU X'000C'                                              35148200
XSF_DEV_DTYPE  EQU X'01'                                           @S9C 35148300
* ********************************************************************  35148400
XSF_SFI_DKBC_ID EQU X'822500' Datasets Kept By Catalog             @M2A 35148502
XSF_DKBC_LENGTH EQU X'000C'                                        @M2A 35148602
XSF_DKBC_DTYPE  EQU X'05'                                          @M2A 35148702
* *****************************************************************@MXA 35148802
XSF_SFI_DLRJ_ID EQU X'823000' Date Last Read                            35148902
XSF_DLRJ_LENGTH EQU X'000C'                                             35149002
XSF_DLRJ_DTYPE  EQU X'09'                                               35149102
* *****************************************************************@MXA 35149200
XSF_SFI_DLTD_ID EQU X'823700' DELETED by disposition               @MXA 35149300
XSF_DLTD_LENGTH EQU X'0009'                                        @MXA 35149400
XSF_DLTD_DTYPE  EQU X'03'                                          @MXA 35149500
*                                                                  @MXA 35149600
XSF_DLTD_DATA_NO  EQU X'00'                                        @MXA 35149700
XSF_DLTD_DATA_YES EQU X'01'                                        @MXA 35149800
* ********************************************************************  35149900
XSF_SFI_DLWJ_ID EQU X'824000' Date Last Written                         35150000
XSF_DLWJ_LENGTH EQU X'000C'                                             35150100
XSF_DLWJ_DTYPE  EQU X'09'                                               35150200
* ********************************************************************  35150300
XSF_SFI_DNM_ID EQU X'825000'  Data Set Name Mask                        35150400
XSF_DNM_LENGTH EQU X'0034'                                              35150500
XSF_DNM_DTYPE  EQU X'07'                                                35150600
* *************************************************************** @S9A  35150700
XSF_SFI_DPCT_ID EQU X'825E00' Percent of Volume                   @S9A  35150800
XSF_DPCT_LENGTH EQU X'0009'                                       @S9A  35150900
XSF_DPCT_DTYPE  EQU X'03'                                         @S9A  35151000
* ********************************************************************  35151100
XSF_SFI_DPT_ID EQU X'826000' Owner''s Department                        35151200
XSF_DPT_LENGTH EQU X'0030'                                              35151300
XSF_DPT_DTYPE  EQU X'07'                                                35151400
* ********************************************************************  35151500
XSF_SFI_DRP_ID EQU X'827000' Default Retention Period                   35151600
XSF_DRP_LENGTH EQU X'000C'                                              35151700
XSF_DRP_DTYPE  EQU X'05'                                                35151800
* ********************************************************************  35151900
XSF_SFI_DSC_ID EQU X'828000' Data Set Count                             35152000
XSF_DSC_LENGTH EQU X'000C'                                              35152100
XSF_DSC_DTYPE  EQU X'05'                                                35152200
* ********************************************************************  35152300
XSF_SFI_DSEQ_ID EQU X'829000' Data Set Sequence                         35152400
XSF_DSEQ_LENGTH EQU X'000C'                                             35152500
XSF_DSEQ_DTYPE  EQU X'05'                                               35152600
* ********************************************************************  35152700
XSF_SFI_DSFX_ID EQU X'829500'  Active DEFAULTS table suffix        $M3A 35152800
XSF_DSFX_LENGTH EQU X'000A'                                        @M3A 35152900
XSF_DSFX_DTYPE  EQU X'01'                                          @M3A 35153000
* ********************************************************************  35153100
XSF_SFI_DSN_ID EQU X'82A000' Data Set Name                              35153200
XSF_DSN_LENGTH EQU X'0034'                                              35153300
XSF_DSN_DTYPE  EQU X'07'                                                35153400
* **************************************************************** @K1A 35153500
XSF_SFI_DSPD_ID EQU X'82A500' Disposition DD name                  @K1A 35153600
XSF_DSPD_LENGTH EQU X'0010'                                        @K1A 35153700
XSF_DSPD_DTYPE  EQU X'07'                                          @K1A 35153800
* **************************************************************** @K1A 35153900
XSF_SFI_DSPM_ID EQU X'82AA00' Disposition message prefix           @K1A 35154000
XSF_DSPM_LENGTH EQU X'0010'                                        @K1A 35154100
XSF_DSPM_DTYPE  EQU X'07'                                          @K1A 35154200
* ********************************************************************  35154300
XSF_SFI_DSR_ID EQU X'82B000' Data Set Recording                         35154400
XSF_DSR_LENGTH EQU X'0009'                                              35154500
XSF_DSR_DTYPE  EQU X'03'                                                35154600
*                                                                       35154700
XSF_DSR_DATA_OFF EQU X'00'                                              35154800
XSF_DSR_DATA_ON  EQU X'01'                                              35154900
* **************************************************************** @SKA 35155000
XSF_SFI_DSS6_ID EQU X'82B030'     Data set size                    @SKA 35155100
XSF_DSS6_LENGTH EQU X'0016'                                        @SKA 35155200
XSF_DSS6_DTYPE  EQU X'08'         SFI type Compound                @SKA 35155300
*                                                                  @SKA 35155400
XSF_SFI_DSS6_COMPType EQU X'01'   Compound Type : Factored         @SKA 35155500
XSF_SFI_DSS6_COMPLen1 EQU X'03'   Length of first field            @SKA 35155600
XSF_SFI_DSS6_COMPTyp1 EQU X'03'   DataType first field : Binary(8) @SKA 35155700
XSF_SFI_DSS6_COMPDat1 EQU X'01'   First data field : Factor = KB   @SKA 35155800
XSF_SFI_DSS6_COMPLen2 EQU X'0A'   Length of second field           @SKA 35155900
XSF_SFI_DSS6_COMPTyp2 EQU X'06'   DataType second field: Binary(64)@SKA 35156000
* **************************************************************** @SCA 35156100
XSF_SFI_DSTT_ID EQU X'82B200' Destination Type                     @SCA 35156200
XSF_DSTT_LENGTH EQU X'0009'                                        @SCA 35156300
XSF_DSTT_DTYPE  EQU X'03'                                          @SCA 35156400
*                                                                  @SCA 35156500
XSF_DSTT_DATA_SHELF               EQU X'00'                        @SCA 35156600
XSF_DSTT_DATA_STORE_BUILTIN_BINS  EQU X'01'                        @SCA 35156700
XSF_DSTT_DATA_MANUAL              EQU X'02'                        @SCA 35156800
XSF_DSTT_DATA_AUTO                EQU X'03'                        @SCA 35156900
XSF_DSTT_DATA_STORE_BINS          EQU X'04'                        @SCA 35157000
XSF_DSTT_DATA_STORE_NOBINS        EQU X'05'                        @SCA 35158000
* **************************************************************** @12A 35159002
XSF_SFI_DSXP_ID EQU X'82B500' DSNEXPIRE(NONE/BLOCK)                @12A 35160002
XSF_DSXP_LENGTH EQU X'0009'                                        @12A 35170002
XSF_DSXP_DTYPE  EQU X'03'                                          @12A 35180002
*                                                                  @12A 35190002
XSF_DSXP_DATA_NONE                EQU X'00'                        @12A 35200002
XSF_DSXP_DATA_BLOCK               EQU X'01'                        @12A 35200102
* *****************************************************************@05A 35200200
XSF_SFI_DSYS_ID EQU X'82BB00' Creation System ID for first file    @05A 35200300
XSF_DSYS_LENGTH EQU X'0010'                                        @05A 35200400
XSF_DSYS_DTYPE  EQU X'07'                                          @05A 35200500
* ********************************************************************  35200600
XSF_SFI_DTE_ID EQU X'82C000' Installation Date Format                   35200700
XSF_DTE_LENGTH EQU X'0009'                                              35200800
XSF_DTE_DTYPE  EQU X'03'                                                35200900
*                                                                       35201000
XSF_DTE_DATA_A  EQU X'01'                                               35201100
XSF_DTE_DATA_E  EQU X'02'                                               35201200
XSF_DTE_DATA_I  EQU X'03'                                               35201300
XSF_DTE_DATA_J  EQU X'04'                                               35201400
* ********************************************************************  35201500
XSF_SFI_DTM_ID EQU X'82D000' Last Store Update Run Time                 35201600
XSF_DTM_LENGTH EQU X'000C'                                              35201700
XSF_DTM_DTYPE  EQU X'0A'                                                35201800
* **************************************************************** @SCA 35201900
XSF_SFI_EBIN_ID EQU X'82D500' Extended Bin Enabled status          @SCA 35202000
XSF_EBIN_LENGTH EQU X'0009'                                        @SCA 35202100
XSF_EBIN_DTYPE  EQU X'03'                                          @SCA 35202200
*                                                                  @SCA 35202300
XSF_EBIN_DATA_DISABLED EQU X'00'                                   @SCA 35202400
XSF_EBIN_DATA_ENABLED  EQU X'01'                                   @SCA 35202500
* **************************************************************** @M6A 35202602
XSF_SFI_EDM_ID EQU X'82D700' Volume EDM attribute                  @M6A 35202702
XSF_EDM_LENGTH EQU X'0009'                                         @M6A 35202802
XSF_EDM_DTYPE  EQU X'03'                                           @M6A 35202902
*                                                                  @M6A 35203002
XSF_EDM_DATA_NO  EQU X'00'                                         @M6A 35203102
XSF_EDM_DATA_YES EQU X'01'                                         @M6A 35203202
* **************************************************************** @MEA 35203300
XSF_SFI_EML_ID EQU X'82DFF0' Owner''s Email Address                @MEA 35203400
XSF_EML_LENGTH EQU X'0047'                                         @MEA 35203500
XSF_EML_DTYPE  EQU X'07'                                           @MEA 35203600
* ********************************************************************  35203700
XSF_SFI_EMN_ID EQU X'82E000' Owner''s Node                              35203800
XSF_EMN_LENGTH EQU X'0010'                                              35203900
XSF_EMN_DTYPE  EQU X'07'                                                35204000
* ********************************************************************  35204100
XSF_SFI_EMU_ID EQU X'82F000' Owner''s User ID                           35204200
XSF_EMU_LENGTH EQU X'0010'                                              35204300
XSF_EMU_DTYPE  EQU X'07'                                                35204400
* ********************************************************************  35204500
XSF_SFI_ETL_ID EQU X'830000' Owner''s Ext Telephone Num                 35204600
XSF_ETL_LENGTH EQU X'001C'                                              35204700
XSF_ETL_DTYPE  EQU X'07'                                                35204800
* ********************************************************************  35204900
XSF_SFI_EXRB_ID EQU X'830800' EXPDT retainBy                       @OSA 35205000
XSF_EXRB_LENGTH EQU X'0009'                                        @OSA 35205100
XSF_EXRB_DTYPE  EQU X'03'                                          @OSA 35205200
*                                                                  @OSA 35205300
XSF_EXRB_DATA_VOLUME EQU X'00'                                     @OSA 35205400
XSF_EXRB_DATA_FIRST  EQU X'01'                                     @OSA 35205500
XSF_EXRB_DATA_SET    EQU X'02'                                     @OSA 35205600
* ********************************************************************  35205700
XSF_SFI_FCD_ID EQU X'831000' Product Feature Code                       35205800
XSF_FCD_LENGTH EQU X'000C'                                              35205900
XSF_FCD_DTYPE  EQU X'07'                                                35206000
* **************************************************************** @K1A 35206100
XSF_SFI_FCSP_ID EQU X'831800' Catalog Synchronize in progress      @K1A 35206200
XSF_FCSP_LENGTH EQU X'0009'                                        @K1A 35206300
XSF_FCSP_DTYPE  EQU X'03'                                          @K1A 35206400
*                                                                  @K1A 35206500
XSF_FCSP_DATA_NO  EQU X'00'                                        @K1A 35206600
XSF_FCSP_DATA_YES EQU X'01'                                        @K1A 35206700
* ********************************************************************  35206800
XSF_SFI_FDB_ID EQU X'832000' Free Bins in DISTANT Loc                   35206900
XSF_FDB_LENGTH EQU X'000C'                                              35207000
XSF_FDB_DTYPE  EQU X'05'                                                35207100
* ********************************************************************  35207200
XSF_SFI_FILE_ID EQU X'833000' Physical File Sequence                    35207300
XSF_FILE_LENGTH EQU X'000C'                                             35207400
XSF_FILE_DTYPE  EQU X'05'                                               35207500
* ********************************************************************  35207600
XSF_SFI_FLB_ID EQU X'834000' Free Bin Numbers in LOCAL                  35207700
XSF_FLB_LENGTH EQU X'000C'                                              35207800
XSF_FLB_DTYPE  EQU X'05'                                                35207900
* ********************************************************************  35208000
XSF_SFI_FOR_ID EQU X'835000' Owner''s Forename                          35208100
XSF_FOR_LENGTH EQU X'001C'                                              35208200
XSF_FOR_DTYPE  EQU X'07'                                                35208300
* ********************************************************************  35208400
XSF_SFI_FRB_ID EQU X'836000' Free Bin Numbers in REMOTE                 35208500
XSF_FRB_LENGTH EQU X'000C'                                              35208600
XSF_FRB_DTYPE  EQU X'05'                                                35208700
* ********************************************************************  35208800
XSF_SFI_FRK_ID EQU X'837000' Free Rack Num in Library                   35208900
XSF_FRK_LENGTH EQU X'000C'                                              35209000
XSF_FRK_DTYPE  EQU X'05'                                                35209100
* ********************************************************************  35209202
XSF_SFI_FRXP_ID EQU X'837500' FORCEEXPIRE                          @K6A 35209302
XSF_FRXP_LENGTH EQU X'0009'                                        @K6A 35209402
XSF_FRXP_DTYPE  EQU X'03'                                          @K6A 35209502
*                                                                  @K6A 35209602
XSF_FRXP_DATA_NO  EQU X'00'                                        @K6A 35209702
XSF_FRXP_DATA_YES EQU X'01'                                        @K6A 35209802
* **************************************************************** @N3A 35209900
XSF_SFI_GDGC_ID           EQU X'837800'    GDG CycleBy             @N3A 35210000
XSF_GDGC_LENGTH           EQU X'0009'                              @N3A 35210100
XSF_GDGC_DTYPE            EQU X'03'                                @N3A 35210200
*                                                                  @N3A 35210300
XSF_GDGC_DATA_GENERATION  EQU X'00'                                @N3A 35210400
XSF_GDGC_DATA_CRDATE      EQU X'01'                                @N3A 35210500
* **************************************************************** @N3A 35210600
XSF_SFI_GDGD_ID           EQU X'837805'     GDG Duplicate          @N3A 35210700
XSF_GDGD_LENGTH           EQU X'0009'                              @N3A 35210800
XSF_GDGD_DTYPE            EQU X'03'                                @N3A 35210900
*                                                                  @N3A 35211000
XSF_GDGD_DATA_BUMP        EQU X'00'                                @N3A 35211100
XSF_GDGD_DATA_DROP        EQU X'01'                                @N3A 35211200
XSF_GDGD_DATA_KEEP        EQU X'02'                                @N3A 35211300
XSF_GDGD_DATA_COUNT       EQU X'03'                                @N3A 35211400
* ********************************************************************  35211502
XSF_SFI_GDRP_ID EQU X'837900'               GDG Retention Period   @M2A 35211602
XSF_GDRP_LENGTH EQU X'000C'                                        @M2A 35211702
XSF_GDRP_DTYPE  EQU X'05'                                          @M2A 35211802
* ********************************************************************  35211900
XSF_SFI_GWCT_ID            EQU X'837940'    GDG WHILECATALOG       @M2A 35212002
XSF_GWCT_LENGTH            EQU X'0009'                             @M2A 35212102
XSF_GWCT_DTYPE             EQU X'03'                               @M2A 35212202
*                                                                  @M2A 35212302
XSF_GWCT_DATA_OFF          EQU X'00'                               @M2A 35212402
XSF_GWCT_DATA_ON           EQU X'01'                               @M2A 35212502
XSF_GWCT_DATA_UNTILEXPIRED EQU X'02'                               @M2A 35212602
* ********************************************************************  35212702
XSF_SFI_GRK_ID EQU X'838000' Generic Rack Number                        35212800
XSF_GRK_LENGTH EQU X'000E'                                              35212900
XSF_GRK_DTYPE  EQU X'01'                                                35213000
* ****************************************************************@L12A         
XSF_SFI_HSKP_ID EQU X'839600' Housekeeping flag                   @L12A         
XSF_HSKP_LENGTH EQU X'0009'                                       @L12A         
XSF_HSKP_DTYPE  EQU X'03'                                         @L12A         
*                                                                 @L12A         
XSF_HSKP_DATA_NO  EQU X'00'        LIMITED                        @L12A         
XSF_HSKP_DATA_YES EQU X'01'        ALL                            @L12A         
* ********************************************************************  35213100
XSF_SFI_HLD_ID EQU X'838F40' Volume HOLD attribute                 @O0A 35213200
XSF_HLD_LENGTH EQU X'0009'                                         @O0A 35213300
XSF_HLD_DTYPE  EQU X'03'                                           @O0A 35213400
*                                                                  @O0A 35213500
XSF_HLD_DATA_NO  EQU X'00'                                         @O0A 35213600
XSF_HLD_DATA_YES EQU X'01'                                         @O0A 35213700
* ********************************************************************  35213800
XSF_SFI_HLOC_ID EQU X'839000' Home Location                             35213900
XSF_HLOC_LENGTH EQU X'0010'                                             35214000
XSF_HLOC_DTYPE  EQU X'07'                                               35214100
* **************************************************************** @SCA 35214200
XSF_SFI_HLOT_ID EQU X'839200' Home Location Type                   @SCA 35214300
XSF_HLOT_LENGTH EQU X'0009'                                        @SCA 35214400
XSF_HLOT_DTYPE  EQU X'03'                                          @SCA 35214500
*                                                                  @SCA 35214600
XSF_HLOT_DATA_SHELF               EQU X'00'                        @SCA 35214700
XSF_HLOT_DATA_MANUAL              EQU X'02'                        @SCA 35214800
XSF_HLOT_DATA_AUTO                EQU X'03'                        @SCA 35214900
* ********************************************************************  35215000
XSF_SFI_INTR_ID EQU X'83A000' Volume Intransit Status                   35215100
XSF_INTR_LENGTH EQU X'0009'                                             35215200
XSF_INTR_DTYPE  EQU X'03'                                               35215300
*                                                                       35215400
XSF_INTR_DATA_NO  EQU X'00'                                             35215500
XSF_INTR_DATA_YES EQU X'01'                                             35215600
* ********************************************************************  35215700
XSF_SFI_IPL_ID EQU X'83B000' Data Check Required in IPL                 35215800
XSF_IPL_LENGTH EQU X'0009'                                              35215900
XSF_IPL_DTYPE  EQU X'03'                                                35216000
*                                                                       35216100
XSF_IPL_DATA_NO  EQU X'00'                                              35216200
XSF_IPL_DATA_YES EQU X'01'                                              35216300
* ********************************************************************  35216400
XSF_SFI_IRMM_ID EQU X'83B830' IRMM Use                             @10A 35216500
XSF_IRMM_LENGTH EQU X'0009'                                        @10A 35216600
XSF_IRMM_DTYPE EQU X'03'                                           @10A 35216700
*                                                                  @10A 35216800
XSF_IRMM_DATA_NO EQU X'00'                                         @10A 35216900
XSF_IRMM_DATA_YES EQU X'01'                                        @10A 35217000
* ********************************************************************  35217100
XSF_SFI_ITL_ID EQU X'83C000' Owner''s Internal Tele Num                 35217200
XSF_ITL_LENGTH EQU X'0010'                                              35217300
XSF_ITL_DTYPE  EQU X'07'                                                35217400
* **************************************************************** @LRA 35217500
XSF_SFI_JBDT_ID EQU X'83CA00' Last Journal Backup Date             @LRA 35217600
XSF_JBDT_LENGTH EQU X'000C'                                        @LRA 35217700
XSF_JBDT_DTYPE  EQU X'09'                                          @LRA 35217800
* **************************************************************** @LRA 35217900
XSF_SFI_JBTM_ID EQU X'83CB00' Last Journal Backup Time             @LRA 35218000
XSF_JBTM_LENGTH EQU X'000C'                                        @LRA 35218100
XSF_JBTM_DTYPE  EQU X'0A'                                          @LRA 35218200
* ********************************************************************  35218300
XSF_SFI_JDS_ID EQU X'83D000' Journal Name                               35218400
XSF_JDS_LENGTH EQU X'0034'                                              35218500
XSF_JDS_DTYPE  EQU X'07'                                                35218600
* ********************************************************************  35218700
XSF_SFI_JRNF_ID EQU X'83E000' JOURNALFULL Parmlib Value                 35218800
XSF_JRNF_LENGTH EQU X'000A'                                             35218900
XSF_JRNF_DTYPE  EQU X'04'                                               35219000
* **************************************************************** @LRA 35219100
XSF_SFI_JRNS_ID EQU X'83EA00' Journal Status                       @LRA 35219200
XSF_JRNS_LENGTH EQU X'0009'                                        @LRA 35219300
XSF_JRNS_DTYPE  EQU X'03'                                          @LRA 35219400
*                                                                  @LRA 35219500
XSF_JRNS_DISABLED EQU X'00'                                        @LRA 35219600
XSF_JRNS_ENABLED  EQU X'01'                                        @LRA 35219700
XSF_JRNS_LOCKED   EQU X'02'                                        @LRA 35219800
* ********************************************************************  35219900
XSF_SFI_JRNT_ID EQU X'83ED00' Journal Transaction                 @NBA  35220000
XSF_JRNT_LENGTH EQU X'0009'                                       @NBA  35220100
XSF_JRNT_DTYPE  EQU X'03'                                         @NBA  35220200
*                                                                 @NBA  35220300
XSF_JRNT_DATA_NO  EQU X'00'                                       @NBA  35220400
XSF_JRNT_DATA_YES EQU X'01'                                       @NBA  35220500
* ********************************************************************  35220600
XSF_SFI_JRNU_ID EQU X'83F000' Journal Percentage Used                   35220700
XSF_JRNU_LENGTH EQU X'000A'                                             35220800
XSF_JRNU_DTYPE  EQU X'04'                                               35220900
* ********************************************************************  35221000
XSF_SFI_KEL1_ID EQU X'83F500' Encryption key label 1              @SJA  35221100
XSF_KEL1_LENGTH EQU X'0048'                                       @SJA  35221200
XSF_KEL1_DTYPE  EQU X'07'                                         @SJA  35221300
* ********************************************************************  35221400
XSF_SFI_KEL2_ID EQU X'83F505' Encryption key label 2              @SJA  35221500
XSF_KEL2_LENGTH EQU X'0048'                                       @SJA  35221600
XSF_KEL2_DTYPE  EQU X'07'                                         @SJA  35221700
* ********************************************************************  35221800
XSF_SFI_KEM1_ID EQU X'83F520' Key encoding mechanism 1            @SJA  35221900
XSF_KEM1_LENGTH EQU X'000D'                                       @SJA  35222000
XSF_KEM1_DTYPE  EQU X'07'                                         @SJA  35222100
* ********************************************************************  35222200
XSF_SFI_KEM2_ID EQU X'83F525' Key encoding mechanism 2            @SJA  35222300
XSF_KEM2_LENGTH EQU X'000D'                                       @SJA  35222400
XSF_KEM2_DTYPE  EQU X'07'                                         @SJA  35222500
* ********************************************************************  35222600
XSF_SFI_LBL_ID EQU X'840000' Volume Label                               35222700
XSF_LBL_LENGTH EQU X'0009'                                              35222800
XSF_LBL_DTYPE  EQU X'02'                                                35222900
*                                                                       35223000
XSF_LBL_FLAG_NL  EQU X'20'                                              35223100
XSF_LBL_FLAG_AL  EQU X'10'                                              35223200
XSF_LBL_FLAG_SL  EQU X'08'                                              35223300
XSF_LBL_FLAG_BLP EQU X'02'                                              35223400
XSF_LBL_FLAG_UL  EQU X'01'                                              35223500
* ********************************************************************  35223600
XSF_SFI_LBN_ID EQU X'841000' Bin Numbers in LOCAL                       35223700
XSF_LBN_LENGTH EQU X'000C'                                              35223800
XSF_LBN_DTYPE  EQU X'05'                                                35223900
* ********************************************************************  35224000
XSF_SFI_LCDJ_ID EQU X'841500' Last Change Date                     @OBA 35224100
XSF_LCDJ_LENGTH EQU X'000C'                                        @OBA 35224200
XSF_LCDJ_DTYPE  EQU X'09'                                          @OBA 35224300
* ********************************************************************  35224400
XSF_SFI_LCID_ID EQU X'842000' Last Change User ID                       35224500
XSF_LCID_LENGTH EQU X'0010'                                             35224600
XSF_LCID_DTYPE  EQU X'07'                                               35224700
* ********************************************************************  35224800
XSF_SFI_LCSI_ID EQU X'842500' Last Change System ID                @OBA 35224900
XSF_LCSI_LENGTH EQU X'0010'                                        @OBA 35225000
XSF_LCSI_DTYPE  EQU X'07'                                          @OBA 35225100
* ********************************************************************  35225200
XSF_SFI_LCT_ID EQU X'843000' Default Lines per Page                     35225300
XSF_LCT_LENGTH EQU X'000A'                                              35225400
XSF_LCT_DTYPE  EQU X'04'                                                35225500
* **************************************************************** @LUA 35225600
XSF_SFI_LCTK_ID EQU X'843100' Local task                           @LUA 35225700
XSF_LCTK_LENGTH EQU X'000C'                                        @LUA 35225800
XSF_LCTK_DTYPE  EQU X'05'                                          @LUA 35225900
* ********************************************************************  35226000
XSF_SFI_LCTM_ID EQU X'843500' Last Change Time                     @OBA 35226100
XSF_LCTM_LENGTH EQU X'000C'                                        @OBA 35226200
XSF_LCTM_DTYPE  EQU X'0A'                                          @OBA 35226300
* ********************************************************************  35226400
XSF_SFI_LCUD_ID EQU X'843600' Last "User" Change Date              @OBA 35226500
XSF_LCUD_LENGTH EQU X'000C'                                        @OBA 35226600
XSF_LCUD_DTYPE  EQU X'09'                                          @OBA 35226700
* ********************************************************************  35226800
XSF_SFI_LCUT_ID EQU X'843700' Last "User" Change Time              @OBA 35226900
XSF_LCUT_LENGTH EQU X'000C'                                        @OBA 35227000
XSF_LCUT_DTYPE  EQU X'0A'                                          @OBA 35227100
* ********************************************************************  35227200
XSF_SFI_LDD_ID EQU X'843B00' Last used dd name                     @02A 35227300
XSF_LDD_LENGTH EQU X'0010'                                         @02A 35227400
XSF_LDD_DTYPE  EQU X'01'                                           @02A 35227500
* ********************************************************************  35227600
XSF_SFI_LDDF_ID EQU X'844000' Location Definition Exists                35227700
XSF_LDDF_LENGTH EQU X'0009'                                             35227800
XSF_LDDF_DTYPE  EQU X'03'                                               35227900
*                                                                       35228000
XSF_LDDF_DATA_NO  EQU X'00'                                             35228100
XSF_LDDF_DATA_YES EQU X'01'                                             35228200
* ********************************************************************  35228300
XSF_SFI_LDEV_ID EQU X'845000' Last Drive                                35228400
XSF_LDEV_LENGTH EQU X'000C'                                             35228500
XSF_LDEV_DTYPE  EQU X'01'                                               35228600
* ********************************************************************  35228700
XSF_SFI_LDLC_ID EQU X'846000' Location Name                             35228800
XSF_LDLC_LENGTH EQU X'0010'                                             35228900
XSF_LDLC_DTYPE  EQU X'07'                                               35229000
* ********************************************************************  35229100
XSF_SFI_LDLT_ID EQU X'847000' Location Type                             35229200
XSF_LDLT_LENGTH EQU X'0009'                                             35229300
XSF_LDLT_DTYPE  EQU X'03'                                               35229400
*                                                                       35229500
XSF_LDLT_DATA_SHELF  EQU X'00'                                          35229600
XSF_LDLT_DATA_AUTO   EQU X'01'                                          35229700
XSF_LDLT_DATA_MANUAL EQU X'02'                                          35229800
XSF_LDLT_DATA_STORE  EQU X'03'                                          35229900
XSF_LDLT_DATA_HSTORE EQU X'04'                                     @05A 35230000
* ********************************************************************  35230100
XSF_SFI_LDMN_ID EQU X'848000' Location Media Name                       35230200
XSF_LDMN_LENGTH EQU X'0010'                                             35230300
XSF_LDMN_DTYPE  EQU X'07'                                               35230400
* ********************************************************************  35230500
XSF_SFI_LDMT_ID EQU X'849000' Location Management Type                  35230600
XSF_LDMT_LENGTH EQU X'0009'                                             35230700
XSF_LDMT_DTYPE  EQU X'03'                                               35230800
*                                                                       35230900
XSF_LDMT_DATA_UNDEFINED EQU X'00'                                       35231000
XSF_LDMT_DATA_BIN       EQU X'01'                                       35231100
XSF_LDMT_DATA_NOBINS    EQU X'02'                                       35231200
* ********************************************************************  35231300
XSF_SFI_LDPR_ID EQU X'84A000' Location Priority                         35231400
XSF_LDPR_LENGTH EQU X'000C'                                             35231500
XSF_LDPR_DTYPE  EQU X'05'                                               35231600
* ********************************************************************  35231700
XSF_SFI_LDAM_ID EQU X'84A100' Location Automove                    @O7A 35231800
XSF_LDAM_LENGTH EQU X'0009'                                        @O7A 35231900
XSF_LDAM_DTYPE  EQU X'03'                                          @O7A 35232000
*                                                                  @O7A 35232100
XSF_LDAM_DATA_NO  EQU X'00'                                        @O7A 35232200
XSF_LDAM_DATA_YES EQU X'01'                                        @O7A 35232300
* ********************************************************************  35232400
XSF_SFI_LINE_ID EQU X'84B000' Output Data Line                          35232500
XSF_LINE_LENGTH EQU X'0008'                                             35232600
XSF_LINE_DTYPE  EQU X'07'                                               35232700
* **************************************************************** @02A 35232800
XSF_SFI_LJOB_ID EQU X'84B420' Last used job name                   @02A 35232900
XSF_LJOB_LENGTH EQU X'0010'                                        @02A 35233000
XSF_LJOB_DTYPE  EQU X'01'                                          @02A 35233100
* ********************************************************************  35233200
XSF_SFI_LOAN_ID EQU X'84C000' Loan Location                             35233300
XSF_LOAN_LENGTH EQU X'0010'                                             35233400
XSF_LOAN_DTYPE  EQU X'07'                                               35233500
* ********************************************************************  35233600
XSF_SFI_LOC_ID EQU X'84D000' Location                                   35233700
XSF_LOC_LENGTH EQU X'0010'                                              35233800
XSF_LOC_DTYPE  EQU X'07'                                                35233900
* ********************************************************************  35234000
XSF_SFI_LOCT_ID EQU X'84E000' Location Type                             35234100
XSF_LOCT_LENGTH EQU X'0009'                                             35234200
XSF_LOCT_DTYPE  EQU X'03'                                               35234300
*                                                                       35234400
XSF_LOCT_DATA_SHELF               EQU X'00'                             35234500
XSF_LOCT_DATA_STORE_BUILTIN_BINS  EQU X'01'                             35234600
XSF_LOCT_DATA_MANUAL              EQU X'02'                             35234700
XSF_LOCT_DATA_AUTO                EQU X'03'                             35234800
XSF_LOCT_DATA_STORE_BINS          EQU X'04'                             35234900
XSF_LOCT_DATA_STORE_NOBINS        EQU X'05'                             35235000
XSF_LOCT_DATA_INCTNR              EQU X'06'                        @LGA 35235100
* **************************************************************** @02A 35235200
XSF_SFI_LPGM_ID EQU X'84E760' Last used program name               @02A 35235300
XSF_LPGM_LENGTH EQU X'0010'                                        @02A 35235400
XSF_LPGM_DTYPE  EQU X'01'                                          @02A 35235500
* ********************************************************************  35235600
XSF_SFI_LRCL_ID EQU X'84F000' Logical Record Length                     35235700
XSF_LRCL_LENGTH EQU X'000C'                                             35235800
XSF_LRCL_DTYPE  EQU X'05'                                               35235900
* ********************************************************************  35236000
XSF_SFI_LRED_ID EQU X'84F800' Lastref extra days                   @OQA 35236100
XSF_LRED_LENGTH EQU X'000C'                                        @OQA 35236200
XSF_LRED_DTYPE  EQU X'05'                                          @OQA 35236300
* ********************************************************************  35236400
XSF_SFI_LRK_ID EQU X'850000' # Library Rack Numbers                     35236500
XSF_LRK_LENGTH EQU X'000C'                                              35236600
XSF_LRK_DTYPE  EQU X'05'                                                35236700
* **************************************************************** @02A 35236800
XSF_SFI_LSTP_ID EQU X'850370' Last used step name                  @02A 35236900
XSF_LSTP_LENGTH EQU X'0010'                                        @02A 35237000
XSF_LSTP_DTYPE  EQU X'01'                                          @02A 35237100
* **************************************************************** @K1A 35237200
XSF_SFI_LVC_ID EQU X'850500' Current label version                 @K1A 35237300
XSF_LVC_LENGTH EQU X'0009'                                         @K1A 35237400
XSF_LVC_DTYPE  EQU X'03'                                           @K1A 35237500
*                                                                  @K1A 35237600
XSF_LVC_DATA_NO       EQU X'00'                                    @K1A 35237700
XSF_LVC_DATA_VERSION1 EQU X'01'                                    @K1A 35237800
XSF_LVC_DATA_VERSION3 EQU X'03'                                    @K1A 35237900
XSF_LVC_DATA_VERSION4 EQU X'04'                                    @K1A 35238000
* **************************************************************** @K1A 35238100
XSF_SFI_LVN_ID EQU X'850A00' Required label version                @K1A 35238200
XSF_LVN_LENGTH EQU X'0009'                                         @K1A 35238300
XSF_LVN_DTYPE  EQU X'03'                                           @K1A 35238400
*                                                                  @K1A 35238500
XSF_LVN_DATA_NO EQU X'00'                                          @K1A 35238600
XSF_LVN_DATA_V3 EQU X'03'                                          @K1A 35238700
XSF_LVN_DATA_V4 EQU X'04'                                          @K1A 35238800
* ********************************************************************  35238900
XSF_SFI_MC_ID EQU X'851000' Management Class                            35239000
XSF_MC_LENGTH EQU X'0010'                                               35239100
XSF_MC_DTYPE  EQU X'07'                                                 35239200
* ********************************************************************  35239300
XSF_SFI_MCAT_ID EQU X'851200' Management Class attributes          @OVA 35239400
XSF_MCAT_LENGTH EQU X'0009'                                        @OVA 35239500
XSF_MCAT_DTYPE  EQU X'03'                                          @OVA 35239600
XSF_MCAT_DATA_NONE     EQU X'00'                                   @OVA 35239700
XSF_MCAT_DATA_ALL      EQU X'01'                                   @OVA 35239800
XSF_MCAT_DATA_VRSELXDI EQU X'02'                                   @OVA 35239900
* **************************************************************** @07A 35240000
XSF_SFI_MDNF_ID EQU X'851400' Media Information Name               @07A 35240100
XSF_MDNF_LENGTH EQU X'0010'                                        @07A 35240200
XSF_MDNF_DTYPE  EQU X'01'                                          @07A 35240300
* *****************************************************************@MYA 35240400
XSF_SFI_MDRA_ID EQU X'851980' Replace Policy for Age               @MYA 35240500
XSF_MDRA_LENGTH EQU X'000C'                                        @MYA 35240600
XSF_MDRA_DTYPE  EQU X'05'                                          @MYA 35240700
* ********************************************************************  35240800
XSF_SFI_MDRP_ID EQU X'8519C0' Replace Policy for Permanent Errors  @MYA 35240900
XSF_MDRP_LENGTH EQU X'000C'                                        @MYA 35241000
XSF_MDRP_DTYPE  EQU X'05'                                          @MYA 35241100
* *****************************************************************@MYA 35241200
XSF_SFI_MDRT_ID EQU X'8519E0' Replace Policy for Temporary Errors  @MYA 35241300
XSF_MDRT_LENGTH EQU X'000C'                                        @MYA 35241400
XSF_MDRT_DTYPE  EQU X'05'                                          @MYA 35241500
* *****************************************************************@MYA 35241600
XSF_SFI_MDRW_ID EQU X'8519F0' Replace Policy for Write Mount Count @MYA 35241700
XSF_MDRW_LENGTH EQU X'000C'                                        @MYA 35241800
XSF_MDRW_DTYPE  EQU X'05'                                          @MYA 35241900
* **************************************************************** @07A 35242000
XSF_SFI_MDRX_ID EQU X'851A00' External Recording Technology        @07A 35242100
XSF_MDRX_LENGTH EQU X'0010'                                        @07A 35242200
XSF_MDRX_DTYPE  EQU X'01'                                          @07A 35242300
* ********************************************************************  35242400
XSF_SFI_MDS_ID EQU X'852000' CDS Data Set Name                          35242500
XSF_MDS_LENGTH EQU X'0034'                                              35242600
XSF_MDS_DTYPE  EQU X'07'                                                35242700
* ********************************************************************  35242800
XSF_SFI_MDTJ_ID EQU X'853000' CDS Create Date                           35242900
XSF_MDTJ_LENGTH EQU X'000C'                                             35243000
XSF_MDTJ_DTYPE  EQU X'09'                                               35243100
* **************************************************************** @07A 35243200
XSF_SFI_MDTX_ID EQU X'853400' External Media Type                  @07A 35243300
XSF_MDTX_LENGTH EQU X'0010'                                        @07A 35243400
XSF_MDTX_DTYPE  EQU X'01'                                          @07A 35243500
* ********************************************************************  35243600
XSF_SFI_MEDA_ID EQU X'854000' Media Special Attributes                  35243700
XSF_MEDA_LENGTH EQU X'0009'                                             35243800
XSF_MEDA_DTYPE  EQU X'03'                                               35243900
*                                                                       35244000
XSF_MEDA_DATA_NONE     EQU X'00'                                        35244100
XSF_MEDA_DATA_READCOMP EQU X'01'                                        35244200
* ********************************************************************  35244300
XSF_SFI_MEDC_ID EQU X'855000' Media Compaction                          35244400
XSF_MEDC_LENGTH EQU X'0009'                                             35244500
XSF_MEDC_DTYPE  EQU X'03'                                               35244600
*                                                                       35244700
XSF_MEDC_DATA_UNDEFINED EQU X'00'                                       35244800
XSF_MEDC_DATA_NO        EQU X'01'                                       35244900
XSF_MEDC_DATA_YES       EQU X'02'                                       35245000
* ********************************************************************  35245100
XSF_SFI_MEDN_ID EQU X'856000' Media Name                                35245200
XSF_MEDN_LENGTH EQU X'0010'                                             35245300
XSF_MEDN_DTYPE  EQU X'07'                                               35245400
* ********************************************************************  35245500
XSF_SFI_MEDR_ID EQU X'857000' Media Recording Format                    35245600
XSF_MEDR_LENGTH EQU X'0009'                                             35245700
XSF_MEDR_DTYPE  EQU X'03'                                               35245800
*                                                                       35245900
XSF_MEDR_DATA_NONCART EQU X'00'                                    @S9C 35246000
XSF_MEDR_DATA_18TRK   EQU X'01'                                         35246100
XSF_MEDR_DATA_36TRK   EQU X'02'                                         35246200
XSF_MEDR_DATA_128TRK  EQU X'03'                                         35246300
XSF_MEDR_DATA_256TRK  EQU X'04'                                    @S9A 35246400
XSF_MEDR_DATA_384TRK  EQU X'05'                                    @SEA 35246500
XSF_MEDR_DATA_EFMT1   EQU X'06'                                    @SFA 35246600
XSF_MEDR_DATA_EFMT2   EQU X'07'                                    @SHA 35246700
XSF_MEDR_DATA_EEFMT2  EQU X'08'                                    @SJA 35246800
XSF_MEDR_DATA_EFMT3   EQU X'09'                                    @SKA 35246900
XSF_MEDR_DATA_EEFMT3  EQU X'0A'                                    @SKA 35247000
XSF_MEDR_DATA_EFMT4   EQU X'0B'                                    @SOA 35247100
XSF_MEDR_DATA_EEFMT4  EQU X'0C'                                    @SOA 35247200
* ********************************************************************  35247300
XSF_SFI_MEDT_ID EQU X'858000' Media Type                                35247400
XSF_MEDT_LENGTH EQU X'0009'                                             35247500
XSF_MEDT_DTYPE  EQU X'03'                                               35247600
*                                                                       35247700
XSF_MEDT_DATA_UNDEFINED EQU X'00'                                       35247800
XSF_MEDT_DATA_CST       EQU X'01'                                       35247900
XSF_MEDT_DATA_ECCST     EQU X'02'                                       35248000
XSF_MEDT_DATA_HPCT      EQU X'03'                                       35248100
XSF_MEDT_DATA_EHPCT     EQU X'04'                                       35248200
XSF_MEDT_DATA_MEDIA5    EQU X'05'                                  @SFA 35248300
XSF_MEDT_DATA_ETC       EQU X'05'                                  @SGA 35248400
XSF_MEDT_DATA_EWTC      EQU X'06'                                  @SGA 35248500
XSF_MEDT_DATA_EETC      EQU X'07'                                  @SGA 35248600
XSF_MEDT_DATA_EEWTC     EQU X'08'                                  @SGA 35248700
XSF_MEDT_DATA_EXTC      EQU X'09'                                  @SHA 35248800
XSF_MEDT_DATA_EXWTC     EQU X'0A'                                  @SHA 35248900
XSF_MEDT_DATA_EATC      EQU X'0B'                                  @SOA 35249000
XSF_MEDT_DATA_EAWTC     EQU X'0C'                                  @SOA 35249100
XSF_MEDT_DATA_EAETC     EQU X'0D'                                  @SOA 35249200
* ********************************************************************  35249300
XSF_SFI_MFR_ID EQU X'859000' Source Location Name                       35249400
XSF_MFR_LENGTH EQU X'0010'                                              35249500
XSF_MFR_DTYPE  EQU X'07'                                                35249600
* ********************************************************************  35249700
XSF_SFI_MID_ID EQU X'85A000' Mount Message ID                           35249800
XSF_MID_LENGTH EQU X'0014'                                              35249900
XSF_MID_DTYPE  EQU X'07'                                                35250000
* **************************************************************** @SCA 35250100
XSF_SFI_MIV_ID EQU X'85A500' Moving-In Volume                      @SCA 35250200
XSF_MIV_LENGTH EQU X'0014'                                         @SCA 35250300
XSF_MIV_DTYPE  EQU X'01'                                           @SCA 35250400
* **************************************************************** @SCA 35250500
XSF_SFI_MOV_ID EQU X'85A900' Moving-Out Volume                     @SCA 35250600
XSF_MOV_LENGTH EQU X'0014'                                         @SCA 35250700
XSF_MOV_DTYPE  EQU X'01'                                           @SCA 35250800
* ********************************************************************  35250900
XSF_SFI_MOVM_ID EQU X'85B000' Move Mode                                 35251000
XSF_MOVM_LENGTH EQU X'0009'                                             35251100
XSF_MOVM_DTYPE  EQU X'03'                                               35251200
*                                                                       35251300
XSF_MOVM_DATA_AUTO   EQU X'00'                                          35251400
XSF_MOVM_DATA_MANUAL EQU X'01'                                          35251500
* ********************************************************************  35251600
XSF_SFI_MOP_ID EQU X'85C000' Master Overwrite                           35251700
XSF_MOP_LENGTH EQU X'0009'                                              35251800
XSF_MOP_DTYPE  EQU X'03'                                                35251900
*                                                                       35252000
XSF_MOP_DATA_ADD   EQU X'01'                                            35252100
XSF_MOP_DATA_LAST  EQU X'02'                                            35252200
XSF_MOP_DATA_MATCH EQU X'03'                                            35252300
XSF_MOP_DATA_USER  EQU X'04'                                            35252400
* ********************************************************************  35252500
XSF_SFI_MRP_ID EQU X'85D000' Maximum Retention Period                   35252600
XSF_MRP_LENGTH EQU X'000C'                                              35252700
XSF_MRP_DTYPE  EQU X'05'                                                35252800
* ********************************************************************  35252900
XSF_SFI_MSGF_ID EQU X'85E000' Case of Message Text                      35253000
XSF_MSGF_LENGTH EQU X'0009'                                             35253100
XSF_MSGF_DTYPE  EQU X'03'                                               35253200
*                                                                       35253300
XSF_MSGF_DATA_MIXED EQU X'00'                                           35253400
XSF_MSGF_DATA_UPPER EQU X'01'                                           35253500
* ********************************************************************  35253600
XSF_SFI_MST_ID EQU X'85F000' Move Status                                35253700
XSF_MST_LENGTH EQU X'0009'                                              35253800
XSF_MST_DTYPE  EQU X'03'                                                35253900
*                                                                       35254000
XSF_MST_DATA_UNKNOWN   EQU X'00'                                        35254100
XSF_MST_DATA_PENDING   EQU X'01'                                        35254200
XSF_MST_DATA_CONFIRMED EQU X'02'                                        35254300
XSF_MST_DATA_COMPLETE  EQU X'03'                                        35254400
* ********************************************************************  35254500
XSF_SFI_MTM_ID EQU X'860000' CDS Create Time                            35254600
XSF_MTM_LENGTH EQU X'000C'                                              35254700
XSF_MTM_DTYPE  EQU X'0A'                                                35254800
* ********************************************************************  35254900
XSF_SFI_MTO_ID EQU X'861000' Target Location Name                       35255000
XSF_MTO_LENGTH EQU X'0010'                                              35255100
XSF_MTO_DTYPE  EQU X'07'                                                35255200
* ********************************************************************  35255300
XSF_SFI_MTP_ID EQU X'862000' CDS Type                                   35255400
XSF_MTP_LENGTH EQU X'0009'                                              35255500
XSF_MTP_DTYPE  EQU X'03'                                                35255600
*                                                                       35255700
XSF_MTP_DATA_MASTER EQU X'00'                                           35255800
* ********************************************************************  35255900
XSF_SFI_MTY_ID EQU X'862800' Move Type                                  35256000
XSF_MTY_LENGTH EQU X'0009'                                              35256100
XSF_MTY_DTYPE  EQU X'03'                                                35256200
*                                                                       35256300
XSF_MTY_DATA_NOTRTS EQU X'00'                                           35256400
XSF_MTY_DATA_RTS    EQU X'01'                                           35256500
* ********************************************************************  35256600
XSF_SFI_MVBY_ID      EQU X'862B00' Move by                        @LFA  35256700
XSF_MVBY_LENGTH      EQU X'0009'                                  @LFA  35256800
XSF_MVBY_DTYPE       EQU X'03'                                    @LFA  35256900
*                                                                 @LFA  35257000
XSF_MVBY_DATA_VOLUME EQU X'00'                                    @LFA  35257100
XSF_MVBY_DATA_SET    EQU X'01'                                    @LFA  35257200
* ********************************************************************  35257300
XSF_SFI_MVS_ID EQU X'863000' MVS Use                                    35257400
XSF_MVS_LENGTH EQU X'0009'                                              35257500
XSF_MVS_DTYPE  EQU X'03'                                                35257600
*                                                                       35257700
XSF_MVS_DATA_NO  EQU X'00'                                              35257800
XSF_MVS_DATA_YES EQU X'01'                                              35257900
* ********************************************************************  35258000
XSF_SFI_NDRP_ID EQU X'864500' Not-GDG Retention Period             @M2A 35258102
XSF_NDRP_LENGTH EQU X'000C'                                        @M2A 35258202
XSF_NDRP_DTYPE  EQU X'05'                                          @M2A 35258302
* **************************************************************** @SCA 35258402
XSF_SFI_NLOC_ID EQU X'865000' Required Location                         35258500
XSF_NLOC_LENGTH EQU X'0010'                                             35258600
XSF_NLOC_DTYPE  EQU X'07'                                               35258700
* **************************************************************** @SCA 35258800
XSF_SFI_NLOT_ID EQU X'865200' Required Location Type               @SCA 35258900
XSF_NLOT_LENGTH EQU X'0009'                                        @SCA 35259000
XSF_NLOT_DTYPE  EQU X'03'                                          @SCA 35259100
*                                                                  @SCA 35259200
XSF_NLOT_DATA_SHELF               EQU X'00'                        @SCA 35259300
XSF_NLOT_DATA_STORE_BUILTIN_BINS  EQU X'01'                        @SCA 35259400
XSF_NLOT_DATA_MANUAL              EQU X'02'                        @SCA 35259500
XSF_NLOT_DATA_AUTO                EQU X'03'                        @SCA 35259600
XSF_NLOT_DATA_STORE_BINS          EQU X'04'                        @SCA 35259700
XSF_NLOT_DATA_STORE_NOBINS        EQU X'05'                        @SCA 35259800
* ********************************************************************  35259900
XSF_SFI_NME_ID EQU X'866000' Security Class Name                        35260000
XSF_NME_LENGTH EQU X'0010'                                              35260100
XSF_NME_DTYPE  EQU X'07'                                                35260200
* ********************************************************************  35260300
XSF_SFI_NOT_ID EQU X'866800' Notify                                     35260400
XSF_NOT_LENGTH EQU X'0009'                                              35260500
XSF_NOT_DTYPE  EQU X'03'                                                35260600
*                                                                       35260700
XSF_NOT_DATA_NO  EQU X'00'                                              35260800
XSF_NOT_DATA_YES EQU X'01'                                              35260900
* ********************************************************************  35261000
XSF_SFI_NVL_ID EQU X'867000' Next Volume                                35261100
XSF_NVL_LENGTH EQU X'000E'                                              35261200
XSF_NVL_DTYPE  EQU X'01'                                                35261300
* ********************************************************************  35261400
XSF_SFI_NVRS_ID EQU X'868000' Next VRS Name                             35261500
XSF_NVRS_LENGTH EQU X'0010'                                             35261600
XSF_NVRS_DTYPE  EQU X'07'                                               35261700
* ********************************************************************  35261802
XSF_SFI_NWCT_ID            EQU X'868500'    NON-GDG WHILECATALOG   @M2A 35261902
XSF_NWCT_LENGTH            EQU X'0009'                             @M2A 35262002
XSF_NWCT_DTYPE             EQU X'03'                               @M2A 35262102
*                                                                  @M2A 35262202
XSF_NWCT_DATA_OFF          EQU X'00'                               @M2A 35262302
XSF_NWCT_DATA_ON           EQU X'01'                               @M2A 35262402
XSF_NWCT_DATA_UNTILEXPIRED EQU X'02'                               @M2A 35262502
* ********************************************************************  35262600
XSF_SFI_OAC_ID EQU X'869000' Owner Access                               35262700
XSF_OAC_LENGTH EQU X'0009'                                              35262800
XSF_OAC_DTYPE  EQU X'03'                                                35262900
*                                                                       35263000
XSF_OAC_DATA_READ   EQU X'00'                                           35263100
XSF_OAC_DATA_UPDATE EQU X'01'                                           35263200
XSF_OAC_DATA_ALTER  EQU X'02'                                           35263300
* ********************************************************************  35263400
XSF_SFI_OBMN_ID EQU X'86A000' Old Bin Number Media Name                 35263500
XSF_OBMN_LENGTH EQU X'0010'                                             35263600
XSF_OBMN_DTYPE  EQU X'07'                                               35263700
* ********************************************************************  35263800
XSF_SFI_OBN_ID EQU X'86B000' Old Bin Number                             35263900
XSF_OBN_LENGTH EQU X'000E'                                              35264000
XSF_OBN_DTYPE  EQU X'01'                                                35264100
* ********************************************************************  35264200
XSF_SFI_OCE_ID EQU X'86B800' Vol Info Recorded at OCEOV                 35264300
XSF_OCE_LENGTH EQU X'0009'                                              35264400
XSF_OCE_DTYPE  EQU X'03'                                                35264500
*                                                                       35264600
XSF_OCE_DATA_NO  EQU X'00'                                              35264700
XSF_OCE_DATA_YES EQU X'01'                                              35264800
* ********************************************************************  35264900
XSF_SFI_OLOC_ID EQU X'86C000' Old Location                              35265000
XSF_OLOC_LENGTH EQU X'0010'                                             35265100
XSF_OLOC_DTYPE  EQU X'07'                                               35265200
* ********************************************************************  35265300
XSF_SFI_OLON_ID EQU X'86C100' Old Loan Location                    @OBA 35265400
XSF_OLON_LENGTH EQU X'0010'                                        @OBA 35265500
XSF_OLON_DTYPE  EQU X'07'                                          @OBA 35265600
* **************************************************************** @SCA 35265700
XSF_SFI_OLOT_ID EQU X'86C200' Old Location Type                    @SCA 35265800
XSF_OLOT_LENGTH EQU X'0009'                                        @SCA 35265900
XSF_OLOT_DTYPE  EQU X'03'                                          @SCA 35266000
*                                                                  @SCA 35266100
XSF_OLOT_DATA_SHELF               EQU X'00'                        @SCA 35266200
XSF_OLOT_DATA_STORE_BUILTIN_BINS  EQU X'01'                        @SCA 35266300
XSF_OLOT_DATA_MANUAL              EQU X'02'                        @SCA 35266400
XSF_OLOT_DATA_AUTO                EQU X'03'                        @SCA 35266500
XSF_OLOT_DATA_STORE_BINS          EQU X'04'                        @SCA 35266600
XSF_OLOT_DATA_STORE_NOBINS        EQU X'05'                        @SCA 35266700
XSF_OLOT_DATA_INCTNR              EQU X'06'                        @SCA 35266800
* ********************************************************************  35266900
XSF_SFI_OPL_ID EQU X'86D000' Position of Rack Number or Pool ID         35267000
XSF_OPL_LENGTH EQU X'000A'                                              35267100
XSF_OPL_DTYPE  EQU X'04'                                                35267200
* ********************************************************************  35267300
XSF_SFI_OPM_ID EQU X'86E000' Operating Mode                             35267400
XSF_OPM_LENGTH EQU X'0009'                                              35267500
XSF_OPM_DTYPE  EQU X'03'                                                35267600
*                                                                       35267700
XSF_OPM_DATA_M  EQU X'01'                                               35267800
XSF_OPM_DATA_R  EQU X'02'                                               35267900
XSF_OPM_DATA_W  EQU X'03'                                               35268000
XSF_OPM_DATA_P  EQU X'04'                                               35268100
* *****************************************************************@MRA 35268200
XSF_SFI_ORIA_ID EQU X'86E8A0' Input action                         @MRA 35268300
XSF_ORIA_LENGTH EQU X'0009'                                        @MRA 35268400
XSF_ORIA_DTYPE  EQU X'03'                                          @MRA 35268500
*                                                                       35268600
XSF_ORIA_DATA_ACCEPT EQU X'00'                                     @MRA 35268700
XSF_ORIA_DATA_IGNORE EQU X'01'                                     @MRA 35268800
XSF_ORIA_DATA_REJECT EQU X'02'                                     @MRA 35268900
* *****************************************************************@MRA 35269000
XSF_SFI_ORII_ID EQU X'86E8A8' Input IGNORE condition (BY)          @MRA 35269100
XSF_ORII_LENGTH EQU X'0009'                                        @MRA 35269200
XSF_ORII_DTYPE  EQU X'02'                                          @MRA 35269300
*                                                                       35269400
XSF_ORII_DATA_SPECIFIC     EQU X'80'                               @MRA 35269500
XSF_ORII_DATA_NONSPECIFIC  EQU X'40'                               @MRA 35269600
XSF_ORII_DATA_ANY          EQU X'C0'                               @MRA 35269700
* *****************************************************************@MRA 35269800
XSF_SFI_ORIR_ID EQU X'86E8B8' Input REJECT condition (BY)          @MRA 35269900
XSF_ORIR_LENGTH EQU X'0009'                                        @MRA 35270000
XSF_ORIR_DTYPE  EQU X'02'                                          @MRA 35270100
*                                                                       35270200
XSF_ORIR_DATA_SYSID  EQU X'80'                                     @MRA 35270300
XSF_ORIR_DATA_CATLG  EQU X'40'                                     @MRA 35270400
* *****************************************************************@MRA 35270500
XSF_SFI_OROA_ID EQU X'86EA00' Output action                        @MRA 35270600
XSF_OROA_LENGTH EQU X'0009'                                        @MRA 35270700
XSF_OROA_DTYPE  EQU X'03'                                          @MRA 35270800
*                                                                       35270900
XSF_OROA_DATA_ACCEPT EQU X'00'                                     @MRA 35271000
XSF_OROA_DATA_IGNORE EQU X'01'                                     @MRA 35271100
XSF_OROA_DATA_REJECT EQU X'02'                                     @MRA 35271200
* *****************************************************************@MRA 35271300
XSF_SFI_OROI_ID EQU X'86EA08' Output IGNORE condition (BY)         @MRA 35271400
XSF_OROI_LENGTH EQU X'0009'                                        @MRA 35271500
XSF_OROI_DTYPE  EQU X'02'                                          @MRA 35271600
*                                                                       35271700
XSF_OROI_DATA_SPECIFIC     EQU X'80'                               @MRA 35271800
XSF_OROI_DATA_NONSPECIFIC  EQU X'40'                               @MRA 35271900
XSF_OROI_DATA_ANY          EQU X'C0'                               @MRA 35272000
* *****************************************************************@MRA 35272100
XSF_SFI_OROR_ID EQU X'86EA18' Output REJECT condition (BY)         @MRA 35272200
XSF_OROR_LENGTH EQU X'0009'                                        @MRA 35272300
XSF_OROR_DTYPE  EQU X'02'                                          @MRA 35272400
*                                                                       35272500
XSF_OROR_DATA_SYSID  EQU X'80'                                     @MRA 35272600
XSF_OROR_DATA_CATLG  EQU X'40'                                     @MRA 35272700
* *****************************************************************@MRA 35272800
XSF_SFI_ORTP_ID EQU X'86EF08' Type of partition entry              @MRA 35272900
XSF_ORTP_LENGTH EQU X'0009'                                        @MRA 35273000
XSF_ORTP_DTYPE  EQU X'03'                                          @MRA 35273100
*                                                                       35273200
XSF_ORTP_DATA_RMM   EQU X'00'                                      @MRA 35273300
XSF_ORTP_DATA_NORMM EQU X'01'                                      @MRA 35273400
* *****************************************************************@MRA 35273500
XSF_SFI_ORVS_ID EQU X'86EF80' Volume range start                   @MRA 35273600
XSF_ORVS_LENGTH EQU X'000E'                                        @MRA 35273700
XSF_ORVS_DTYPE  EQU X'07'                                          @MRA 35273800
* *****************************************************************@MRA 35273900
XSF_SFI_ORVL_ID EQU X'86EF85' Volume serial number, specific or    @MRA 35274000
XSF_ORVL_LENGTH EQU X'000E' generic                                @MRA 35274100
XSF_ORVL_DTYPE  EQU X'07'                                          @MRA 35274200
* *****************************************************************@MRA 35274300
XSF_SFI_ORVE_ID EQU X'86EF8F' Volume range end                     @MRA 35274400
XSF_ORVE_LENGTH EQU X'000E'                                        @MRA 35274500
XSF_ORVE_DTYPE  EQU X'07'                                          @MRA 35274600
* ********************************************************************  35274700
XSF_SFI_OVL_ID EQU X'86F000' Position of Volume Serial                  35274800
XSF_OVL_LENGTH EQU X'000A'                                              35274900
XSF_OVL_DTYPE  EQU X'04'                                                35275000
* **************************************************************** @SCA 35275100
XSF_SFI_OVOL_ID EQU X'86F500' Old Volume                           @SCA 35275200
XSF_OVOL_LENGTH EQU X'000E'                                        @SCA 35275300
XSF_OVOL_DTYPE  EQU X'01'                                          @SCA 35275400
* ********************************************************************  35275500
XSF_SFI_OWN_ID EQU X'870000' Owner                                      35275600
XSF_OWN_LENGTH EQU X'0010'                                              35275700
XSF_OWN_DTYPE  EQU X'07'                                                35275800
* ********************************************************************  35275900
XSF_SFI_OXDJ_ID EQU X'871000' Original Expiration Date                  35276000
XSF_OXDJ_LENGTH EQU X'000C'                                             35276100
XSF_OXDJ_DTYPE  EQU X'09'                                               35276200
* *************************************************************** @04A  35276300
XSF_SFI_PACS_ID EQU X'871800' Pre-ACS support                     @04A  35276400
XSF_PACS_LENGTH EQU X'0009'                                       @04A  35276500
XSF_PACS_DTYPE  EQU X'03'                                         @04A  35276600
*                                                                 @04A  35276700
XSF_PACS_DATA_NO  EQU X'00'                                       @04A  35276800
XSF_PACS_DATA_YES EQU X'01'                                       @04A  35276900
* *************************************************************** @LGA  35277000
XSF_SFI_PDA_ID     EQU X'871E00' PDA state                        @LGA  35277100
XSF_PDA_LENGTH     EQU X'0009'                                    @LGA  35277200
XSF_PDA_DTYPE      EQU X'03'                                      @LGA  35277300
*                                                                 @LGA  35277400
XSF_PDA_DATA_OFF   EQU X'00'                                      @LGA  35277500
XSF_PDA_DATA_ON    EQU X'01'                                      @LGA  35277600
XSF_PDA_DATA_NONE  EQU X'02'                                      @LGA  35277700
* *************************************************************** @LGA  35277800
XSF_SFI_PDAC_ID    EQU X'871E10' PDA block count                  @LGA  35277900
XSF_PDAC_LENGTH    EQU X'0009'                                    @LGA  35278000
XSF_PDAC_DTYPE     EQU X'03'                                      @LGA  35278100
* *************************************************************** @LGA  35278200
XSF_SFI_PDAL_ID    EQU X'871E30' PDA log state                    @LGA  35278300
XSF_PDAL_LENGTH    EQU X'0009'                                    @LGA  35278400
XSF_PDAL_DTYPE     EQU X'03'                                      @LGA  35278500
*                                                                 @LGA  35278600
XSF_PDAL_DATA_OFF  EQU X'00'                                      @LGA  35278700
XSF_PDAL_DATA_ON   EQU X'01'                                      @LGA  35278800
* *************************************************************** @LGA  35278900
XSF_SFI_PDAS_ID    EQU X'871E90' PDA block size                   @LGA  35279000
XSF_PDAS_LENGTH    EQU X'0009'                                    @LGA  35279100
XSF_PDAS_DTYPE     EQU X'03'                                      @LGA  35279200
* ********************************************************************  35279300
XSF_SFI_PDS_ID EQU X'872000' Pool Description                           35279400
XSF_PDS_LENGTH EQU X'0030'                                              35279500
XSF_PDS_DTYPE  EQU X'07'                                                35279600
* ********************************************************************  35279700
XSF_SFI_PDSC_ID EQU X'873000' Product Description                       35279800
XSF_PDSC_LENGTH EQU X'0028'                                             35279900
XSF_PDSC_DTYPE  EQU X'07'                                               35280000
* ********************************************************************  35280100
XSF_SFI_PEND_ID EQU X'874000' Actions Pending                           35280200
XSF_PEND_LENGTH EQU X'0009'                                             35280300
XSF_PEND_DTYPE  EQU X'02'                                               35280400
*                                                                       35280500
XSF_PEND_FLAG_SCRATCH EQU X'80'                                         35280600
XSF_PEND_FLAG_REPLACE EQU X'40'                                         35280700
XSF_PEND_FLAG_INIT EQU X'20'                                            35280800
XSF_PEND_FLAG_ERASE EQU X'10'                                           35280900
XSF_PEND_FLAG_RETURN EQU X'08'                                          35281000
XSF_PEND_FLAG_NOTIFY EQU X'04'                                          35281100
* ********************************************************************  35281200
XSF_SFI_PID_ID EQU X'875000' Pool Prefix                                35281300
XSF_PID_LENGTH EQU X'000E'                                              35281400
XSF_PID_DTYPE  EQU X'07'                                                35281500
* ********************************************************************  35281600
XSF_SFI_PLN_ID EQU X'876000' Pool Name                                  35281700
XSF_PLN_LENGTH EQU X'0010'                                              35281800
XSF_PLN_DTYPE  EQU X'07'                                                35281900
* ********************************************************************  35282000
XSF_SFI_PNME_ID EQU X'877000' Product Software Name                     35282100
XSF_PNME_LENGTH EQU X'0026'                                             35282200
XSF_PNME_DTYPE  EQU X'07'                                               35282300
* ********************************************************************  35282400
XSF_SFI_PNUM_ID EQU X'878000' Software Product Number                   35282500
XSF_PNUM_LENGTH EQU X'0010'                                             35282600
XSF_PNUM_DTYPE  EQU X'07'                                               35282700
* ********************************************************************  35282800
XSF_SFI_PRD_ID EQU X'879000' Permanent Read Errors                      35282900
XSF_PRD_LENGTH EQU X'000C'                                              35283000
XSF_PRD_DTYPE  EQU X'05'                                                35283100
* ********************************************************************  35283200
XSF_SFI_PRF_ID EQU X'87A000' Pool Def RACF Option                       35283300
XSF_PRF_LENGTH EQU X'0009'                                              35283400
XSF_PRF_DTYPE  EQU X'03'                                                35283500
*                                                                       35283600
XSF_PRF_DATA_NO  EQU X'00'                                              35283700
XSF_PRF_DATA_YES EQU X'01'                                              35283800
* ********************************************************************  35283900
XSF_SFI_PRTY_ID EQU X'87B000' Priority                                  35284000
XSF_PRTY_LENGTH EQU X'000C'                                             35284100
XSF_PRTY_DTYPE  EQU X'05'                                               35284200
* ********************************************************************  35284300
XSF_SFI_PSFX_ID EQU X'87C000' Parmlib Member Suffix                     35284400
XSF_PSFX_LENGTH EQU X'000A'                                             35284500
XSF_PSFX_DTYPE  EQU X'01'                                               35284600
* ********************************************************************  35284700
XSF_SFI_PSF2_ID EQU X'87C010' Parmlib Member Suffix 2             @MOA  35284800
XSF_PSF2_LENGTH EQU X'000A'                                       @MOA  35284900
XSF_PSF2_DTYPE  EQU X'01'                                         @MOA  35285000
* ********************************************************************  35285100
XSF_SFI_PSN_ID EQU X'87D000' Pool Definition System ID                  35285200
XSF_PSN_LENGTH EQU X'0010'                                              35285300
XSF_PSN_DTYPE  EQU X'07'                                                35285400
* ****************************************************************@SOA  35285500
XSF_SFI_PSZ6_ID EQU X'87D300'    Physical space used              @SOA  35285600
XSF_PSZ6_LENGTH EQU X'0016'                                       @SOA  35285700
XSF_PSZ6_DTYPE  EQU X'08'        SFI type Compound                @SOA  35285800
*                                                                 @SOA  35285900
XSF_SFI_PSZ6_COMPType EQU X'01'  Compound Type : Factored         @SOA  35286000
XSF_SFI_PSZ6_COMPLen1 EQU X'03'  Length of first field            @SOA  35286100
XSF_SFI_PSZ6_COMPTyp1 EQU X'03'  DataType first field : Binary(8) @SOA  35286200
XSF_SFI_PSZ6_COMPDat1 EQU X'01'  First data field : Factor = KB   @SOA  35286300
XSF_SFI_PSZ6_COMPLen2 EQU X'0A'  Length of second field           @SOA  35286400
XSF_SFI_PSZ6_COMPTyp2 EQU X'06'  DataType second field: Binary(64)@SOA  35286500
* ****************************************************************@MRA  35286600
XSF_SFI_PTNA_ID EQU X'87DB00' NOSMT action for partition entry    @MRA  35286700
XSF_PTNA_LENGTH EQU X'0009'                                       @MRA  35286800
XSF_PTNA_DTYPE  EQU X'03'                                         @MRA  35286900
*                                                                       35287000
XSF_PTNA_DATA_ACCEPT EQU X'00'                                    @MRA  35287100
XSF_PTNA_DATA_IGNORE EQU X'01'                                    @MRA  35287200
* ****************************************************************@MRA  35287300
XSF_SFI_PTNL_ID EQU X'87DB0C' Location name                       @MRA  35287400
XSF_PTNL_LENGTH EQU X'0010'                                       @MRA  35287500
XSF_PTNL_DTYPE  EQU X'07'                                         @MRA  35287600
* ********************************************************************  35287700
XSF_SFI_PTP_ID EQU X'87E000' Pool Def Pool Type                         35287800
XSF_PTP_LENGTH EQU X'0009'                                              35287900
XSF_PTP_DTYPE  EQU X'03'                                                35288000
*                                                                       35288100
XSF_PTP_DATA_SCRATCH EQU X'00'                                          35288200
XSF_PTP_DATA_RACK    EQU X'01'                                          35288300
* ****************************************************************@MRA  35288400
XSF_SFI_PTSA_ID EQU X'87EB80' SMT action for partition entry      @MRA  35288500
XSF_PTSA_LENGTH EQU X'0009'                                       @MRA  35288600
XSF_PTSA_DTYPE  EQU X'03'                                         @MRA  35288700
*                                                                       35288800
XSF_PTSA_DATA_ACCEPT EQU X'00'                                    @MRA  35288900
XSF_PTSA_DATA_IGNORE EQU X'01'                                    @MRA  35289000
* ****************************************************************@MRA  35289100
XSF_SFI_PTTP_ID EQU X'87EBA8' Type of partition entry             @MRA  35289200
XSF_PTTP_LENGTH EQU X'0009'                                       @MRA  35289300
XSF_PTTP_DTYPE  EQU X'03'                                         @MRA  35289400
*                                                                       35289500
XSF_PTTP_DATA_RMM   EQU X'00'                                     @MRA  35289600
XSF_PTTP_DATA_NORMM EQU X'01'                                     @MRA  35289700
* ****************************************************************@MRA  35289800
XSF_SFI_PTVS_ID EQU X'87EC00' Volume range start                  @MRA  35289900
XSF_PTVS_LENGTH EQU X'000E'                                       @MRA  35290000
XSF_PTVS_DTYPE  EQU X'07'                                         @MRA  35290100
* ****************************************************************@MRA  35290200
XSF_SFI_PTVL_ID EQU X'87EC08' Volume serial number, specific or   @MRA  35290300
XSF_PTVL_LENGTH EQU X'000E'   generic                             @MRA  35290400
XSF_PTVL_DTYPE  EQU X'07'                                         @MRA  35290500
* ****************************************************************@MRA  35290600
XSF_SFI_PTVE_ID EQU X'87EC0F' Volume range end                    @MRA  35290700
XSF_PTVE_LENGTH EQU X'000E'                                       @MRA  35290800
XSF_PTVE_DTYPE  EQU X'07'                                         @MRA  35290900
* ********************************************************************  35291000
XSF_SFI_PVL_ID EQU X'87F000' Previous Volume                            35291100
XSF_PVL_LENGTH EQU X'000E'                                              35291200
XSF_PVL_DTYPE  EQU X'01'                                                35291300
* ********************************************************************  35291400
XSF_SFI_PWT_ID EQU X'880000' Permanent Write Errors                     35291500
XSF_PWT_LENGTH EQU X'000C'                                              35291600
XSF_PWT_DTYPE  EQU X'05'                                                35291700
* ********************************************************************  35291800
XSF_SFI_RBN_ID EQU X'881000' # Bin Numbers in REMOTE                    35291900
XSF_RBN_LENGTH EQU X'000C'                                              35292000
XSF_RBN_DTYPE  EQU X'05'                                                35292100
* *************************************************************** @LGA  35292200
XSF_SFI_RBYS_ID    EQU X'881200' Retain by set                    @LGA  35292300
XSF_RBYS_LENGTH    EQU X'0009'                                    @LGA  35292400
XSF_RBYS_DTYPE     EQU X'03'                                      @LGA  35292500
*                                                                 @LGA  35292600
XSF_RBYS_DATA_NO   EQU X'00'                                      @LGA  35292700
XSF_RBYS_DATA_YES  EQU X'01'                                      @LGA  35292800
* ********************************************************************  35292900
XSF_SFI_RCF_ID EQU X'882000' Installation RACF Support                  35293000
XSF_RCF_LENGTH EQU X'0009'                                              35293100
XSF_RCF_DTYPE  EQU X'03'                                                35293200
*                                                                       35293300
XSF_RCF_DATA_N  EQU X'01'                                               35293400
XSF_RCF_DATA_P  EQU X'02'                                               35293500
XSF_RCF_DATA_A  EQU X'03'                                               35293600
* ********************************************************************  35293700
XSF_SFI_RCFM_ID EQU X'883000' Record Format                             35293800
XSF_RCFM_LENGTH EQU X'000C'                                             35293900
XSF_RCFM_DTYPE  EQU X'07'                                               35294000
* ********************************************************************  35294100
XSF_SFI_RCK_ID EQU X'884000' Rack or Bin Number                         35294200
XSF_RCK_LENGTH EQU X'000E'                                              35294300
XSF_RCK_DTYPE  EQU X'01'                                                35294400
* ********************************************************************  35294500
XSF_SFI_RDTJ_ID EQU X'886000' Last CDS Extract Date                     35294600
XSF_RDTJ_LENGTH EQU X'000C'                                             35294700
XSF_RDTJ_DTYPE  EQU X'09'                                               35294800
* ********************************************************************  35294900
XSF_SFI_RET_ID EQU X'888000' Retention Type                             35295000
XSF_RET_LENGTH EQU X'000B'                                              35295100
XSF_RET_DTYPE  EQU X'03'                                                35295200
*                                                                       35295300
XSF_RET_DATA1_WHILEC   EQU X'01'                                        35295400
XSF_RET_DATA2_UNTILEXP EQU X'01'                                        35295500
XSF_RET_DATA3_CYCLES   EQU X'01'                                        35295600
XSF_RET_DATA3_DAYS     EQU X'02'                                        35295700
XSF_RET_DATA3_REFDAYS  EQU X'03'                                        35295800
XSF_RET_DATA3_VOLUMES  EQU X'04'                                        35295900
XSF_RET_DATA3_EXTDAYS  EQU X'05'                                   @01A 35296000
XSF_RET_DATA3_DAYCYCL  EQU X'06'                                   @01A 35296100
* ********************************************************************  35296200
XSF_SFI_RLPR_ID EQU X'888500' Required location priority           @OBA 35296300
XSF_RLPR_LENGTH EQU X'000C'                                        @OBA 35296400
XSF_RLPR_DTYPE  EQU X'05'                                          @OBA 35296500
* ********************************************************************  35296600
XSF_SFI_RM_ID   EQU X'888800' Retention Method                     @OGA 35296700
XSF_RM_LENGTH   EQU X'0009'                                        @OGA 35296800
XSF_RM_DTYPE    EQU X'03'                                          @OGA 35296900
*                                                                  @OGA 35297000
XSF_RM_DATA_VRSEL EQU X'00'                                        @OGA 35297100
XSF_RM_DATA_EXPDT EQU X'01'                                        @OGA 35297200
* ********************************************************************  35297300
XSF_SFI_RMSB_ID EQU X'888A00' Retention Method Set By              @OGA 35297400
XSF_RMSB_LENGTH EQU X'0009'                                        @OGA 35297500
XSF_RMSB_DTYPE   EQU X'03'                                         @OGA 35297600
*                                                                  @OGA 35297700
XSF_RMSB_DATA_UNDEFINED   EQU X'00'                                @OGA 35297800
XSF_RMSB_DATA_CMD         EQU X'01'                                @OGA 35297900
XSF_RMSB_DATA_CMD_DEF     EQU X'02'                                @OGA 35298000
XSF_RMSB_DATA_OCE_DEF     EQU X'03'                                @OGA 35298100
XSF_RMSB_DATA_OCE_EXIT    EQU X'04'                                @OGA 35298200
XSF_RMSB_DATA_LCS_DEF     EQU X'05'                                @OGA 35298300
XSF_RMSB_DATA_CNVT        EQU X'06'                                @OGA 35298400
XSF_RMSB_DATA_EXPORT_DEF  EQU X'07'                                @OGA 35298500
XSF_RMSB_DATA_INERS_DEF   EQU X'08'                                @OGA 35298600
XSF_RMSB_DATA_MC_ATTR     EQU X'09'                                @M5A 35298702
XSF_RMSB_DATA_DEFTABLE    EQU X'0A'                                @M3A 35298802
* ********************************************************************  35298900
XSF_SFI_RMID_ID EQU X'889000' RMM started procedure name           @NSA 35299000
XSF_RMID_LENGTH EQU X'0019'                                        @NSA 35299100
XSF_RMID_DTYPE  EQU X'07'                                          @NSA 35299200
* ********************************************************************  35299300
XSF_SFI_RST_ID EQU X'88A000' Rack or Bin Status                         35299400
XSF_RST_LENGTH EQU X'0009'                                              35299500
XSF_RST_DTYPE  EQU X'03'                                                35299600
*                                                                       35299700
XSF_RST_DATA_EMPTY EQU X'00'                                            35310000
XSF_RST_DATA_FREE  EQU X'01'                                            35342100
XSF_RST_DATA_INUSE EQU X'02'                                            35374200
* *************************************************************** @LFA  35378200
XSF_SFI_RTBY_ID EQU X'88B900' Retain by                           @LFA  35382200
XSF_RTBY_LENGTH EQU X'0009'                                       @LFA  35386200
XSF_RTBY_DTYPE  EQU X'03'                                         @LFA  35390200
*                                                                 @LFA  35394200
XSF_RTBY_DATA_VOLUME EQU X'00'                                    @LFA  35398200
XSF_RTBY_DATA_SET    EQU X'01'                                    @LFA  35402200
* ********************************************************************  35406300
XSF_SFI_RTDJ_ID EQU X'88C000' Retention Date                            35438400
XSF_RTDJ_LENGTH EQU X'000C'                                             35470500
XSF_RTDJ_DTYPE  EQU X'09'                                               35502600
* ********************************************************************  35534700
XSF_SFI_RTM_ID EQU X'88E000' Last CDS Extract Time                      35566800
XSF_RTM_LENGTH EQU X'000C'                                              35598900
XSF_RTM_DTYPE  EQU X'0A'                                                35631000
* **************************************************************** @SCA 35635000
XSF_SFI_RUB_ID EQU X'88E500' Reuse Bin                             @SCA 35639000
XSF_RUB_LENGTH EQU X'0009'                                         @SCA 35643000
XSF_RUB_DTYPE  EQU X'03'                                           @SCA 35647000
*                                                                  @SCA 35651000
XSF_RUB_DATA_CONFIRMMOVE EQU X'00'                                 @SCA 35655000
XSF_RUB_DATA_STARTMOVE   EQU X'01'                                 @SCA 35659000
* ********************************************************************  35663100
XSF_SFI_SC_ID EQU X'890000' Storage Class                               35695200
XSF_SC_LENGTH EQU X'0010'                                               35727300
XSF_SC_DTYPE  EQU X'07'                                                 35759400
* **************************************************************** @LUA 35765800
XSF_SFI_SCRM_ID EQU X'891000' Scratch mode                         @LUA 35772200
XSF_SCRM_LENGTH EQU X'0009'                                        @LUA 35778600
XSF_SCRM_DTYPE  EQU X'03'                                          @LUA 35785000
* ********************************************************************  35791500
XSF_SFI_SCST_ID EQU X'892000' Security Class Status                     35823600
XSF_SCST_LENGTH EQU X'0009'                                             35855700
XSF_SCST_DTYPE  EQU X'02'                                               35887800
*                                                                       35919900
XSF_SCST_FLAG_SMF    EQU X'80'                                          35952000
XSF_SCST_FLAG_MSGOPT EQU X'40'                                          35984100
XSF_SCST_FLAG_ERASE  EQU X'20'                                          36016200
* ********************************************************************  36048300
XSF_SFI_SC1_ID EQU X'894000' Store Number                               36080400
XSF_SC1_LENGTH EQU X'000C'                                              36112500
XSF_SC1_DTYPE  EQU X'05'                                                36144600
* ********************************************************************  36176700
XSF_SFI_SDTJ_ID EQU X'895000' Movement Tracking Date                    36208800
XSF_SDTJ_LENGTH EQU X'000C'                                             36240900
XSF_SDTJ_DTYPE  EQU X'09'                                               36273000
* ********************************************************************  36305100
XSF_SFI_SEC_ID EQU X'896000' Security Class Number                      36337200
XSF_SEC_LENGTH EQU X'0009'                                              36369300
XSF_SEC_DTYPE  EQU X'03'                                                36401400
* ********************************************************************  36433500
XSF_SFI_SEQ_ID EQU X'898000' Volume Sequence                            36465600
XSF_SEQ_LENGTH EQU X'000C'                                              36497700
XSF_SEQ_DTYPE  EQU X'05'                                                36529800
* ********************************************************************  36561900
XSF_SFI_SG_ID EQU X'89A000' Storage Group Name                          36594000
XSF_SG_LENGTH EQU X'0010'                                               36626100
XSF_SG_DTYPE  EQU X'07'                                                 36658200
* ********************************************************************  36690300
XSF_SFI_SID_ID EQU X'89B000' RMM System ID                              36722400
XSF_SID_LENGTH EQU X'0010'                                              36754500
XSF_SID_DTYPE  EQU X'07'                                                36786600
* ********************************************************************  36818700
XSF_SFI_SLM_ID EQU X'89C000' MAXHOLD Value                              36850800
XSF_SLM_LENGTH EQU X'000A'                                              36882900
XSF_SLM_DTYPE  EQU X'04'                                                36915000
* ********************************************************************  36947100
XSF_SFI_SMI_ID EQU X'89E000' Offset to Message ID                       36979200
XSF_SMI_LENGTH EQU X'000A'                                              37011300
XSF_SMI_DTYPE  EQU X'04'                                                37043400
* ********************************************************************  37045100
XSF_SFI_SMP_ID EQU X'89E210' SMSTAPE purge                         @LXA 37046800
XSF_SMP_LENGTH EQU X'0009'                                         @LXA 37048500
XSF_SMP_DTYPE  EQU X'03'                                           @LXA 37050200
*                                                                  @LXA 37051900
XSF_SMP_DATA_NO   EQU X'00'                                        @LXA 37053600
XSF_SMP_DATA_YES  EQU X'01'                                        @LXA 37055300
XSF_SMP_DATA_ASIS EQU X'02'                                        @LXA 37057000
* ********************************************************************  37058700
XSF_SFI_SMU_ID EQU X'89E220' SMSTAPE update                        @LXA 37060400
XSF_SMU_LENGTH EQU X'0009'                                         @LXA 37062100
XSF_SMU_DTYPE  EQU X'02'                                           @LXA 37063800
*                                                                  @LXA 37065500
XSF_SMU_DATA_EXITS    EQU X'80'                                    @LXA 37067200
XSF_SMU_DATA_SCRATCH  EQU X'40'                                    @LXA 37068900
XSF_SMU_DATA_COMMANDS EQU X'20'                                    @LXA 37070600
* ********************************************************************  37075500
XSF_SFI_SOSJ_ID EQU X'89F000' Last XPROC Start Date                     37107600
XSF_SOSJ_LENGTH EQU X'000C'                                             37139700
XSF_SOSJ_DTYPE  EQU X'09'                                               37171800
* ********************************************************************  37203900
XSF_SFI_SOSP_ID EQU X'8A0000' Scratch Procedure Name                    37236000
XSF_SOSP_LENGTH EQU X'0010'                                             37268100
XSF_SOSP_DTYPE  EQU X'07'                                               37300200
* ********************************************************************  37332300
XSF_SFI_SOST_ID EQU X'8A1000' Last XPROC Start Time                     37364400
XSF_SOST_LENGTH EQU X'000C'                                             37396500
XSF_SOST_DTYPE  EQU X'0A'                                               37428600
* *************************************************************** @LUA  37430400
XSF_SFI_SRHN_ID EQU X'8A1A00' Server host name                    @LUA  37432200
XSF_SRHN_LENGTH EQU X'0047'                                       @LUA  37434000
XSF_SRHN_DTYPE  EQU X'07'                                         @LUA  37435800
* *************************************************************** @LUA  37437600
XSF_SFI_SRIP_ID EQU X'8A1A30' Server IP address                   @LUA  37439400
XSF_SRIP_LENGTH EQU X'0035'                                       @NQC  37441200
XSF_SRIP_DTYPE  EQU X'07'                                         @LUA  37443000
* *************************************************************** @LUA  37444800
XSF_SFI_SRPN_ID EQU X'8A1A50' Server port number                  @LUA  37446600
XSF_SRPN_LENGTH EQU X'000C'                                       @LUA  37448400
XSF_SRPN_DTYPE  EQU X'05'                                         @LUA  37450200
* *************************************************************** @LUA  37452000
XSF_SFI_SRTK_ID EQU X'8A1AF0' Server task                         @LUA  37453800
XSF_SRTK_LENGTH EQU X'000C'                                       @LUA  37455600
XSF_SRTK_DTYPE  EQU X'05'                                         @LUA  37457400
* ********************************************************************  37460700
XSF_SFI_SSM_ID EQU X'8A2000' SMF Security Record Number                 37492800
XSF_SSM_LENGTH EQU X'000A'                                              37524900
XSF_SSM_DTYPE  EQU X'04'                                                37557000
* *************************************************************** @LUA  37560500
XSF_SFI_SSTY_ID EQU X'8A2500' Subsystem type                      @LUA  37564000
XSF_SSTY_LENGTH EQU X'0009'                                       @LUA  37567500
XSF_SSTY_DTYPE  EQU X'03'                                         @LUA  37571000
*                                                                 @LUA  37574500
XSF_SSTY_DATA_STANDARD EQU X'00'                                  @LUA  37578000
XSF_SSTY_DATA_CLIENT   EQU X'01'                                  @LUA  37581500
XSF_SSTY_DATA_SERVER   EQU X'02'                                  @LUA  37585000
* ********************************************************************  37589100
XSF_SFI_STEP_ID EQU X'8A3000' Step Name                                 37621200
XSF_STEP_LENGTH EQU X'0010'                                             37653300
XSF_STEP_DTYPE  EQU X'07'                                               37685400
* ********************************************************************  37685500
XSF_SFI_STDS_ID EQU X'8A2800' Debug setting                        @NIA 37685600
XSF_STDS_LENGTH EQU X'0009'                                        @NIA 37685700
XSF_STDS_DTYPE  EQU X'02'                                          @NIA 37685800
*                                                                       37685900
XSF_STDS_FLAG_OCE  EQU X'80'                                       @NIA 37686000
XSF_STDS_FLAG_SNAP EQU X'40'                                       @NIA 37686100
* ********************************************************************  37686200
XSF_SFI_STRM_ID EQU X'8A3607' DFSMSrmm status                      @NIA 37686300
XSF_STRM_LENGTH EQU X'0009'                                        @NIA 37686400
XSF_STRM_DTYPE  EQU X'03'                                          @NIA 37686500
*                                                                       37686600
XSF_STRM_DATA_ACTIVE   EQU X'00'                                   @NIA 37686700
XSF_STRM_DATA_RESET    EQU X'01'                                   @NIA 37686800
XSF_STRM_DATA_QUIESCED EQU X'02'                                   @NIA 37686900
* ********************************************************************  37687000
XSF_SFI_STSL_ID EQU X'8A3661' Server listener status               @NIA 37687100
XSF_STSL_LENGTH EQU X'0009'                                        @NIA 37687200
XSF_STSL_DTYPE  EQU X'03'                                          @NIA 37687300
*                                                                       37687400
XSF_STSL_DATA_STANDARD EQU X'00'                                   @NIA 37687500
XSF_STSL_DATA_ACTIVE   EQU X'01'                                   @NIA 37687600
XSF_STSL_DATA_INACTIVE EQU X'02'                                   @NIA 37687700
* ********************************************************************  37687800
XSF_SFI_STLO_ID EQU X'8A3314' Local tasks                          @NIA 37687900
XSF_STLO_LENGTH EQU X'000A'                                        @NIA 37688000
XSF_STLO_DTYPE  EQU X'04'                                          @NIA 37688100
* ********************************************************************  37688200
XSF_SFI_STLA_ID EQU X'8A3300' Local active tasks                   @NIA 37688300
XSF_STLA_LENGTH EQU X'000A'                                        @NIA 37688400
XSF_STLA_DTYPE  EQU X'04'                                          @NIA 37688500
* ********************************************************************  37688600
XSF_SFI_STLH_ID EQU X'8A3307' Local held tasks                     @NIA 37688700
XSF_STLH_LENGTH EQU X'000A'                                        @NIA 37688800
XSF_STLH_DTYPE  EQU X'04'                                          @NIA 37688900
* ********************************************************************  37689000
XSF_SFI_STSO_ID EQU X'8A3664' Server tasks                         @NIA 37689100
XSF_STSO_LENGTH EQU X'000A'                                        @NIA 37689200
XSF_STSO_DTYPE  EQU X'04'                                          @NIA 37689300
* ********************************************************************  37689400
XSF_SFI_STSA_ID EQU X'8A3650' Server active tasks                  @NIA 37689500
XSF_STSA_LENGTH EQU X'000A'                                        @NIA 37689600
XSF_STSA_DTYPE  EQU X'04'                                          @NIA 37689700
* ********************************************************************  37689800
XSF_SFI_STSH_ID EQU X'8A3657' Server held tasks                    @NIA 37689900
XSF_STSH_LENGTH EQU X'000A'                                        @NIA 37690000
XSF_STSH_DTYPE  EQU X'04'                                          @NIA 37690100
* ********************************************************************  37690200
XSF_SFI_STQR_ID EQU X'8A3515' Queued requests                      @NIA 37690300
XSF_STQR_LENGTH EQU X'000C'                                        @NIA 37690400
XSF_STQR_DTYPE  EQU X'05'                                          @NIA 37690500
* ********************************************************************  37690600
XSF_SFI_STQN_ID EQU X'8A3511' Queued nowait requests               @NIA 37690700
XSF_STQN_LENGTH EQU X'000C'                                        @NIA 37690800
XSF_STQN_DTYPE  EQU X'05'                                          @NIA 37690900
* ********************************************************************  37691000
XSF_SFI_STQC_ID EQU X'8A3500' Queued catalog requests              @NIA 37691100
XSF_STQC_LENGTH EQU X'000C'                                        @NIA 37691200
XSF_STQC_DTYPE  EQU X'05'                                          @NIA 37691300
* ********************************************************************  37691400
XSF_SFI_STLR_ID EQU X'8A3317' Last reserve time                    @NIA 37691500
XSF_STLR_LENGTH EQU X'000C'                                        @NIA 37691600
XSF_STLR_DTYPE  EQU X'0A'                                          @NIA 37691700
* ********************************************************************  37691800
XSF_SFI_STNH_ID EQU X'8A3400' New requests held                    @NIA 37691900
XSF_STNH_LENGTH EQU X'0009'                                        @NIA 37692000
XSF_STNH_DTYPE  EQU X'03'                                          @NIA 37692100
*                                                                       37692200
XSF_STNH_FLAG_NOTHELD EQU X'00'                                    @NIA 37692300
XSF_STNH_FLAG_HELD    EQU X'01'                                    @NIA 37692400
* ********************************************************************  37692500
XSF_SFI_STRH_ID EQU X'8A3602' CDS reserved                         @NIA 37692600
XSF_STRH_LENGTH EQU X'0009'                                        @NIA 37692700
XSF_STRH_DTYPE  EQU X'03'                                          @NIA 37692800
*                                                                       37692900
XSF_STRH_FLAG_DEQ EQU X'00'                                        @NIA 37693000
XSF_STRH_FLAG_ENQ EQU X'01'                                        @NIA 37693100
* ********************************************************************  37693200
XSF_SFI_STPL_ID EQU X'8A3450' Trace levels                         @NIA 37693300
XSF_STPL_LENGTH EQU X'0009'                                        @NIA 37693400
XSF_STPL_DTYPE  EQU X'02'                                          @NIA 37693500
*                                                                       37693600
XSF_STPL_FLAG_LVL1 EQU X'80'                                       @NIA 37693700
XSF_STPL_FLAG_LVL2 EQU X'40'                                       @NIA 37693800
XSF_STPL_FLAG_LVL3 EQU X'20'                                       @NIA 37693900
XSF_STPL_FLAG_LVL4 EQU X'10'                                       @NIA 37694000
* ********************************************************************  37694100
XSF_SFI_STRF_ID EQU X'8A3600' Task req. function                   @NIA 37694200
XSF_STRF_LENGTH EQU X'000D'                                        @NIA 37694300
XSF_STRF_DTYPE  EQU X'07'                                          @NIA 37694400
* ********************************************************************  37694500
XSF_SFI_STRT_ID EQU X'8A3614' Task req. system                     @NIA 37694600
XSF_STRT_LENGTH EQU X'0010'                                        @NIA 37694700
XSF_STRT_DTYPE  EQU X'07'                                          @NIA 37694800
* ********************************************************************  37694900
XSF_SFI_STTR_ID EQU X'8A3701' Task req. type                       @NIA 37695000
XSF_STTR_LENGTH EQU X'000B'                                        @NIA 37695100
XSF_STTR_DTYPE  EQU X'07'                                          @NIA 37695200
* ********************************************************************  37695300
XSF_SFI_STTQ_ID EQU X'8A3700' Task requestor                       @NIA 37695400
XSF_STTQ_LENGTH EQU X'0010'                                        @NIA 37695500
XSF_STTQ_DTYPE  EQU X'07'                                          @NIA 37695600
* ********************************************************************  37695700
XSF_SFI_STST_ID EQU X'8A3669' Task start time                      @NIA 37695800
XSF_STST_LENGTH EQU X'000C'                                        @NIA 37695900
XSF_STST_DTYPE  EQU X'0A'                                          @NIA 37696000
* ********************************************************************  37696100
XSF_SFI_STTT_ID EQU X'8A3703' Task token                           @NIA 37696200
XSF_STTT_LENGTH EQU X'000C'                                        @NIA 37696300
XSF_STTT_DTYPE  EQU X'05'                                          @NIA 37696400
* ********************************************************************  37696500
XSF_SFI_STTS_ID EQU X'8A3702' Task status                          @NIA 37696600
XSF_STTS_LENGTH EQU X'0009'                                        @NIA 37696700
XSF_STTS_DTYPE  EQU X'03'                                          @NIA 37696800
*                                                                       37696900
XSF_STTS_FLAG_NONE    EQU X'00'                                    @NIA 37697000
XSF_STTS_FLAG_HOLD    EQU X'01'                                    @NIA 37697100
XSF_STTS_FLAG_CANCEL  EQU X'02'                                    @NIA 37697200
XSF_STTS_FLAG_RESERVE EQU X'03'                                    @NIA 37697300
* ********************************************************************  37697400
XSF_SFI_STIV_ID EQU X'8A3203' IP verb                              @NIA 37697500
XSF_STIV_LENGTH EQU X'0009'                                        @NIA 37697600
XSF_STIV_DTYPE  EQU X'03'                                          @NIA 37697700
*                                                                       37697800
XSF_STIV_FLAG_NONE    EQU X'00'                                    @NIA 37697900
XSF_STIV_FLAG_READ    EQU X'01'                                    @NIA 37698000
XSF_STIV_FLAG_WRITE   EQU X'02'                                    @NIA 37698100
XSF_STIV_FLAG_CONNECT EQU X'03'                                    @NIA 37698200
XSF_STIV_FLAG_CLOSE   EQU X'04'                                    @NIA 37698300
* ********************************************************************  37698400
XSF_SFI_STIS_ID EQU X'8A3200' IP verb state                        @NIA 37698500
XSF_STIS_LENGTH EQU X'0009'                                        @NIA 37698600
XSF_STIS_DTYPE  EQU X'03'                                          @NIA 37698700
*                                                                       37698800
XSF_STIS_FLAG_NONE    EQU X'00'                                    @NIA 37698900
XSF_STIS_FLAG_STARTED EQU X'01'                                    @NIA 37699000
XSF_STIS_FLAG_ENDED   EQU X'02'                                    @NIA 37699100
* ********************************************************************  37699200
XSF_SFI_STIT_ID EQU X'8A3201' IP verb time                         @NIA 37699300
XSF_STIT_LENGTH EQU X'000C'                                        @NIA 37699400
XSF_STIT_DTYPE  EQU X'0A'                                          @NIA 37699500
* *************************************************************** @LGA  37699600
XSF_SFI_STVC_ID EQU X'8A3800' Stacked volume count                @LGA  37699700
XSF_STVC_LENGTH EQU X'000C'                                       @LGA  37704600
XSF_STVC_DTYPE  EQU X'05'                                         @LGA  37711000
* ********************************************************************  37717500
XSF_SFI_SUR_ID EQU X'8A4000' Owner''s Surname                           37749600
XSF_SUR_LENGTH EQU X'001C'                                              37781700
XSF_SUR_DTYPE  EQU X'07'                                                37813800
* ********************************************************************  37845900
XSF_SFI_SYS_ID EQU X'8A5000' Creating System ID                    @05C 37878000
XSF_SYS_LENGTH EQU X'0010'                                              37910100
XSF_SYS_DTYPE  EQU X'07'                                                37942200
* ********************************************************************  37974300
XSF_SFI_TAC_ID EQU X'8A6000' Reject Type                                38006400
XSF_TAC_LENGTH EQU X'0009'                                              38038500
XSF_TAC_DTYPE  EQU X'03'                                                38070600
*                                                                       38102700
XSF_TAC_DATA_ANYUSE EQU X'00'                                           38134800
XSF_TAC_DATA_OUTPUT EQU X'01'                                           38166900
* ********************************************************************  38173300
XSF_SFI_TLR_ID EQU X'8A6800' Time Last Referenced                  @MCA 38179700
XSF_TLR_LENGTH EQU X'000C'                                         @MCA 38186100
XSF_TLR_DTYPE  EQU X'0A'                                           @MCA 38192500
* ********************************************************************  38199000
XSF_SFI_TRD_ID EQU X'8A7000' Temporary Read Errors                      38231100
XSF_TRD_LENGTH EQU X'000C'                                              38263200
XSF_TRD_DTYPE  EQU X'05'                                                38295300
* ********************************************************************  38296000
XSF_SFI_TVXD_ID EQU X'8A7800' TVEXT purge expire days              @O9A 38296700
XSF_TVXD_LENGTH EQU X'000C'                                        @O9A 38297400
XSF_TVXD_DTYPE  EQU X'05'                                          @O9A 38298100
* ********************************************************************  38298800
XSF_SFI_TVXP_ID EQU X'8A7900' TVEXT purge                          @03A 38302300
XSF_TVXP_LENGTH EQU X'0009'                                        @03A 38305800
XSF_TVXP_DTYPE  EQU X'03'                                          @03A 38309300
*                                                                  @03A 38312800
XSF_TVXP_DATA_RELEASE  EQU X'00'                                   @03A 38316300
XSF_TVXP_DATA_EXPIRE   EQU X'01'                                   @03A 38319800
XSF_TVXP_DATA_NONE     EQU X'02'                                   @03A 38323300
* ********************************************************************  38327400
XSF_SFI_TWT_ID EQU X'8A8000' Temporary Write Errors                     38359500
XSF_TWT_LENGTH EQU X'000C'                                              38391600
XSF_TWT_DTYPE  EQU X'05'                                                38423700
* ********************************************************************  38455800
XSF_SFI_TYP_ID EQU X'8A9000' VRS Type                                   38487900
XSF_TYP_LENGTH EQU X'0009'                                              38520000
XSF_TYP_DTYPE  EQU X'02'                                                38552100
*                                                                       38584200
XSF_TYP_FLAG_GDG      EQU X'80'                                         38616300
XSF_TYP_FLAG_PSEUDGDG EQU X'40'                                         38648400
XSF_TYP_FLAG_DSNAME   EQU X'20'                                         38680500
XSF_TYP_FLAG_VOLUME   EQU X'10'                                         38712600
XSF_TYP_FLAG_NAME     EQU X'08'                                         38744700
* ********************************************************************  38776800
XSF_SFI_TZ_ID EQU X'8A9E00'  Time Zone                            @MDA  38778000
XSF_TZ_LENGTH EQU X'000C'                                         @MDA  38779200
XSF_TZ_DTYPE  EQU X'05'                                           @MDA  38780400
* ********************************************************************  38781600
XSF_SFI_UDTJ_ID EQU X'8AA000' Last Update Date                    @K2A  38783200
XSF_UDTJ_LENGTH EQU X'000C'                                       @K2A  38789600
XSF_UDTJ_DTYPE  EQU X'09'                                         @K2A  38796000
* ********************************************************************  38802400
XSF_SFI_UID_ID EQU X'8AB001' User ID                                    38808900
XSF_UID_LENGTH EQU X'0010'                                              38841000
XSF_UID_DTYPE  EQU X'07'                                                38873100
* ********************************************************************  38905200
XSF_SFI_UNC_ID EQU X'8AC000' Uncatalog Option                           38937300
XSF_UNC_LENGTH EQU X'0009'                                              38969400
XSF_UNC_DTYPE  EQU X'03'                                                39001500
*                                                                       39033600
XSF_UNC_DATA_N  EQU X'00'                                               39065700
XSF_UNC_DATA_Y  EQU X'01'                                               39097800
XSF_UNC_DATA_S  EQU X'02'                                               39129900
* ********************************************************************  39162000
XSF_SFI_USEC_ID EQU X'8AD000' Volume Use Count                          39194100
XSF_USEC_LENGTH EQU X'000C'                                             39226200
XSF_USEC_DTYPE  EQU X'05'                                               39258300
* ********************************************************************  39290400
XSF_SFI_USEM_ID EQU X'8AE000' Volume Usage (KB)                         39322500
XSF_USEM_LENGTH EQU X'000C'                                             39354600
XSF_USEM_DTYPE  EQU X'05'                                               39386700
* **************************************************************** @SKA 39386800
XSF_SFI_USE6_ID EQU X'8AE030'     Volume usage                     @SKA 39386900
XSF_USE6_LENGTH EQU X'0016'                                        @SKA 39387000
XSF_USE6_DTYPE  EQU X'08'         SFI type Compound                @SKA 39387100
*                                                                  @SKA 39387200
XSF_SFI_USE6_COMPType EQU X'01'   Compound Type : Factored         @SKA 39387300
XSF_SFI_USE6_COMPLen1 EQU X'03'   Length of first field            @SKA 39387400
XSF_SFI_USE6_COMPTyp1 EQU X'03'   DataType first field : Binary(8) @SKA 39387500
XSF_SFI_USE6_COMPDat1 EQU X'01'   First data field : Factor = KB   @SKA 39387600
XSF_SFI_USE6_COMPLen2 EQU X'0A'   Length of second field           @SKA 39387700
XSF_SFI_USE6_COMPTyp2 EQU X'06'   DataType second field: Binary(64)@SKA 39387800
* *************************************************************** @MDA  39387900
XSF_SFI_UTC_ID EQU X'8AE600'  Common time status enabled          @MDA  39388300
XSF_UTC_LENGTH EQU X'0009'                                        @MDA  39389100
XSF_UTC_DTYPE  EQU X'03'                                          @MDA  39389900
*                                                                 @MDA  39390700
XSF_UTC_DATA_DISABLED  EQU X'00'                                  @MDA  39391500
XSF_UTC_DATA_ENABLED   EQU X'01'                                  @MDA  39392300
* ********************************************************************  39393100
XSF_SFI_UTM_ID EQU X'8AE800'  Last Update Time                    @K2A  39399500
XSF_UTM_LENGTH EQU X'000C'                                        @K2A  39405900
XSF_UTM_DTYPE  EQU X'0A'                                          @K2A  39412300
* ********************************************************************  39418800
XSF_SFI_VAC_ID EQU X'8AF001' Volume Access                              39450900
XSF_VAC_LENGTH EQU X'0009'                                              39483000
XSF_VAC_DTYPE  EQU X'03'                                                39515100
*                                                                       39547200
XSF_VAC_DATA_NONE   EQU X'00'                                           39579300
XSF_VAC_DATA_READ   EQU X'01'                                           39611400
XSF_VAC_DATA_UPDATE EQU X'02'                                           39643500
* ********************************************************************  39675600
XSF_SFI_VACT_ID EQU X'8B0000' VRSMIN action                             39707700
XSF_VACT_LENGTH EQU X'0009'                                             39739800
XSF_VACT_DTYPE  EQU X'03'                                               39771900
*                                                                       39804000
XSF_VACT_DATA_FAIL EQU X'00'                                            39836100
XSF_VACT_DATA_INFO EQU X'01'                                            39868200
XSF_VACT_DATA_WARN EQU X'02'                                            39900300
XSF_VACT_DATA_OFF  EQU X'03'                                       @MVA 39900400
* ********************************************************************* 39900500
XSF_SFI_VDRA_ID EQU X'8B2800' VRSDROP action                       @MVA 39900600
XSF_VDRA_LENGTH EQU X'0009'                                        @MVA 39900700
XSF_VDRA_DTYPE  EQU X'03'                                          @MVA 39900800
*                                                                  @MVA 39900900
XSF_VDRA_DATA_FAIL EQU X'00'                                       @MVA 39901000
XSF_VDRA_DATA_INFO EQU X'01'                                       @MVA 39901100
XSF_VDRA_DATA_WARN EQU X'02'                                       @MVA 39901200
XSF_VDRA_DATA_OFF  EQU X'03'                                       @MVA 39901300
* ********************************************************************* 39901400
XSF_SFI_VREA_ID EQU X'8BD500' VRSRETAIN action                     @MVA 39901500
XSF_VREA_LENGTH EQU X'0009'                                        @MVA 39901600
XSF_VREA_DTYPE  EQU X'03'                                          @MVA 39901700
*                                                                  @MVA 39901800
XSF_VREA_DATA_FAIL EQU X'00'                                       @MVA 39901900
XSF_VREA_DATA_INFO EQU X'01'                                       @MVA 39902000
XSF_VREA_DATA_WARN EQU X'02'                                       @MVA 39902100
XSF_VREA_DATA_OFF  EQU X'03'                                       @MVA 39902200
* ********************************************************************* 39902300
XSF_SFI_XDRA_ID EQU X'8C5D00' EXPDTDROP action                     @MVA 39902400
XSF_XDRA_LENGTH EQU X'0009'                                        @MVA 39902500
XSF_XDRA_DTYPE  EQU X'03'                                          @MVA 39902600
*                                                                  @MVA 39902700
XSF_XDRA_DATA_FAIL EQU X'00'                                       @MVA 39902800
XSF_XDRA_DATA_INFO EQU X'01'                                       @MVA 39902900
XSF_XDRA_DATA_WARN EQU X'02'                                       @MVA 39903000
XSF_XDRA_DATA_OFF  EQU X'03'                                       @MVA 39903100
* *****************************************************************@01A 39903800
XSF_SFI_VANX_ID EQU X'8B0800' Next VRS type                        @01A 39907300
XSF_VANX_LENGTH EQU X'0009'                                        @01A 39910800
XSF_VANX_DTYPE  EQU X'03'                                          @01A 39914300
*                                                                  @01A 39917800
XSF_VANX_DATA_NONE   EQU X'00'                                     @01A 39921300
XSF_VANX_DATA_NEXT   EQU X'01'                                     @01A 39924800
XSF_VANX_DATA_AND    EQU X'02'                                     @01A 39928300
* ********************************************************************  39932400
XSF_SFI_VCAP_ID EQU X'8B0B00' Volume Capacity                      @S9A 39938800
XSF_VCAP_LENGTH EQU X'000C'                                        @S9A 39945200
XSF_VCAP_DTYPE  EQU X'05'                                          @S9A 39951600
* ********************************************************************  39958000
XSF_SFI_VCHG_ID EQU X'8B1000' VRSCHANGE Value                           39964500
XSF_VCHG_LENGTH EQU X'0009'                                             39996600
XSF_VCHG_DTYPE  EQU X'03'                                               40028700
*                                                                       40060800
XSF_VCHG_DATA_INFO   EQU X'00'                                          40092900
XSF_VCHG_DATA_VERIFY EQU X'01'                                          40125000
* ********************************************************************  40157100
XSF_SFI_VDD_ID EQU X'8B2000' VRS Delay Days                             40189200
XSF_VDD_LENGTH EQU X'000A'                                              40221300
XSF_VDD_DTYPE  EQU X'04'                                                40253400
* ********************************************************************  40285500
XSF_SFI_VDTJ_ID EQU X'8B3000' Last Inven Mgt Proc Date                  40317600
XSF_VDTJ_LENGTH EQU X'000C'                                             40349700
XSF_VDTJ_DTYPE  EQU X'09'                                               40381800
* ********************************************************************  40413900
XSF_SFI_VER_ID EQU X'8B4000' Software Product Version                   40446000
XSF_VER_LENGTH EQU X'000E'                                              40478100
XSF_VER_DTYPE  EQU X'07'                                                40510200
* ********************************************************************  40514200
XSF_SFI_VEX_ID EQU X'8B4100' VRSEL EXCLUDE                         @OFA 40518200
XSF_VEX_LENGTH EQU X'0009'                                         @OFA 40522200
XSF_VEX_DTYPE  EQU X'03'                                           @OFA 40526200
*                                                                  @OFA 40530200
XSF_VEX_DATA_NO  EQU X'00'                                         @OFA 40534200
XSF_VEX_DATA_YES EQU X'01'                                         @OFA 40538200
* ********************************************************************  40542300
XSF_SFI_VJBN_ID EQU X'8B5000' Primary VRS Job Name                 @01C 40574400
XSF_VJBN_LENGTH EQU X'0010'                                             40606500
XSF_VJBN_DTYPE  EQU X'07'                                               40638600
* ********************************************************************  40670700
XSF_SFI_VLN_ID EQU X'8B6000' Number of Volumes                          40702800
XSF_VLN_LENGTH EQU X'000C'                                              40734900
XSF_VLN_DTYPE  EQU X'05'                                                40767000
* ********************************************************************  40799100
XSF_SFI_VM_ID EQU X'8B7000' VM Use                                      40831200
XSF_VM_LENGTH EQU X'0009'                                               40863300
XSF_VM_DTYPE  EQU X'03'                                                 40895400
*                                                                       40927500
XSF_VM_DATA_NO  EQU X'00'                                               40959600
XSF_VM_DATA_YES EQU X'01'                                               40991700
* ********************************************************************  41023800
XSF_SFI_VMIN_ID EQU X'8B8000' VRSMIN Count Value                        41055900
XSF_VMIN_LENGTH EQU X'000C'                                             41088000
XSF_VMIN_DTYPE  EQU X'05'                                               41120100
* ********************************************************************  41121300
XSF_SFI_VDRC_ID EQU X'8B2802' VRSDROP Count Value                  @MVA 41122500
XSF_VDRC_LENGTH EQU X'000C'                                        @MVA 41123700
XSF_VDRC_DTYPE  EQU X'05'                                          @MVA 41124900
* ********************************************************************  41126100
XSF_SFI_VREC_ID EQU X'8BD502' VRSRETAIN Count Value                @MVA 41127300
XSF_VREC_LENGTH EQU X'000C'                                        @MVA 41128500
XSF_VREC_DTYPE  EQU X'05'                                          @MVA 41129700
* ********************************************************************  41130900
XSF_SFI_XDRC_ID EQU X'8C5D02' EXPDTDROP Count Value                @MVA 41132100
XSF_XDRC_LENGTH EQU X'000C'                                        @MVA 41133300
XSF_XDRC_DTYPE  EQU X'05'                                          @MVA 41134500
* ********************************************************************  41135700
XSF_SFI_VDRP_ID EQU X'8B280F' VRSDROP Percent Value                @MVA 41136900
XSF_VDRP_LENGTH EQU X'000A'                                        @MVA 41138100
XSF_VDRP_DTYPE  EQU X'04'                                          @MVA 41139300
* ********************************************************************  41140500
XSF_SFI_VREP_ID EQU X'8BD50F' VRSRETAIN Percent Value              @MVA 41141700
XSF_VREP_LENGTH EQU X'000A'                                        @MVA 41142900
XSF_VREP_DTYPE  EQU X'04'                                          @MVA 41144100
* ********************************************************************  41145300
XSF_SFI_XDRP_ID EQU X'8C5D0F' EXPDTDROP Percent Value              @MVA 41146500
XSF_XDRP_LENGTH EQU X'000A'                                        @MVA 41147700
XSF_XDRP_DTYPE  EQU X'04'                                          @MVA 41148900
* ********************************************************************  41152200
XSF_SFI_VMV_ID EQU X'8B9000' VRS Management Value                       41184300
XSF_VMV_LENGTH EQU X'0010'                                              41216400
XSF_VMV_DTYPE  EQU X'07'                                                41248500
* **************************************************************** @SGA 41252000
XSF_SFI_VWMC_ID EQU X'8B9100' Volume Write Mount Count             @SGA 41255500
XSF_VWMC_LENGTH EQU X'000C'                                        @SGA 41259000
XSF_VWMC_DTYPE  EQU X'05'                                          @SGA 41262500
* **************************************************************** @SGA 41266000
XSF_SFI_VNDR_ID EQU X'8B9E00' Vendor                               @SGA 41269500
XSF_VNDR_LENGTH EQU X'0010'                                        @SGA 41273000
XSF_VNDR_DTYPE  EQU X'01'                                          @SGA 41276500
* ********************************************************************  41280600
XSF_SFI_VNME_ID EQU X'8BA000' Primary VRS Name                     @01C 41312700
XSF_VNME_LENGTH EQU X'0034'                                             41344800
XSF_VNME_DTYPE  EQU X'07'                                               41376900
* ********************************************************************  41409000
XSF_SFI_VOL_ID EQU X'8BC000' Volume Serial                              41441100
XSF_VOL_LENGTH EQU X'000E'                                              41473200
XSF_VOL_DTYPE  EQU X'01'                                                41505300
* **************************************************************** @S8A 41509300
XSF_SFI_VOLT_ID EQU X'8BC200' Volume Type                          @S8A 41513300
XSF_VOLT_LENGTH EQU X'0009'                                        @S8A 41517300
XSF_VOLT_DTYPE  EQU X'03'                                          @S8A 41521300
*                                                                  @S8A 41525300
XSF_VOLT_PHYSICAL EQU X'00'                                        @S8A 41529300
XSF_VOLT_LOGICAL  EQU X'01'                                        @S8A 41533300
XSF_VOLT_STACKED  EQU X'02'                                        @LSA 41533700
* **************************************************************** @S9A 41534100
XSF_SFI_VPCT_ID EQU X'8BC300' Volume Percent Full                  @S9A 41534900
XSF_VPCT_LENGTH EQU X'0009'                                        @S9A 41535700
XSF_VPCT_DTYPE  EQU X'03'                                          @S9A 41536500
* **************************************************************** @LSA 41536600
XSF_SFI_VOL1_ID EQU X'8BCD00' Vol1 label volser                    @LSA 41536700
XSF_VOL1_LENGTH EQU X'000E'                                        @LSA 41536800
XSF_VOL1_DTYPE  EQU X'01'                                          @LSA 41536900
* ********************************************************************  41537400
XSF_SFI_VRC_ID EQU X'8BD000' Vital Record Count                         41569500
XSF_VRC_LENGTH EQU X'000C'                                              41601600
XSF_VRC_DTYPE  EQU X'05'                                                41633700
* ********************************************************************  41665800
XSF_SFI_VRJ_ID EQU X'8BE000' VRS Job Name                               41697900
XSF_VRJ_LENGTH EQU X'0009'                                              41730000
XSF_VRJ_DTYPE  EQU X'03'                                                41762100
*                                                                       41794200
XSF_VRJ_DATA_1 EQU X'01'                                                41826300
XSF_VRJ_DATA_2 EQU X'02'                                                41858400
* ********************************************************************  41890500
XSF_SFI_VRS_ID EQU X'8BF000' Vital Record Specification                 41922600
XSF_VRS_LENGTH EQU X'0034'                                              41954700
XSF_VRS_DTYPE  EQU X'07'                                                41986800
* **************************************************************** @01A 41988900
XSF_SFI_VRSI_ID EQU X'8BF500' Scratch Immediate                    @01A 41991000
XSF_VRSI_LENGTH EQU X'0009'                                        @01A 41993100
XSF_VRSI_DTYPE  EQU X'03'                                          @01A 41995200
*                                                                  @01A 41997300
XSF_VRSI_DATA_NO  EQU X'00'                                        @01A 41999400
XSF_VRSI_DATA_YES EQU X'01'                                        @01A 42001500
* **************************************************************** @01A 42003600
XSF_SFI_VRSL_ID EQU X'8BFA00' VRSEL value                          @01A 42005700
XSF_VRSL_LENGTH EQU X'0009'                                        @01A 42007800
XSF_VRSL_DTYPE  EQU X'03'                                          @01A 42009900
*                                                                  @01A 42012000
*XSF_VRSL_DATA_OLD EQU X'00'                                       @NKD 42014300
XSF_VRSL_DATA_NEW EQU X'01'                                        @01A 42016600
* ********************************************************************  42018900
XSF_SFI_VRSR_ID EQU X'8C0000' VRS Retained                              42051000
XSF_VRSR_LENGTH EQU X'0009'                                             42083100
XSF_VRSR_DTYPE  EQU X'03'                                               42115200
*                                                                       42147300
XSF_VRSR_DATA_NO  EQU X'00'                                             42179400
XSF_VRSR_DATA_YES EQU X'01'                                             42211500
* *****************************************************************@01A 42213500
XSF_SFI_VRXI_ID EQU X'8C0800' Expiration Date Ignore               @01A 42215500
XSF_VRXI_LENGTH EQU X'0009'                                        @01A 42217500
XSF_VRXI_DTYPE  EQU X'03'                                          @01A 42219500
*                                                                  @01A 42221500
XSF_VRXI_DATA_NO  EQU X'00'                                        @01A 42223500
XSF_VRXI_DATA_YES EQU X'01'                                        @01A 42225500
* *****************************************************************@01A 42227500
XSF_SFI_VSCD_ID EQU X'8C1000' Primary VRS Subchain start date      @01A 42229500
XSF_VSCD_LENGTH EQU X'000C'                                        @01A 42231500
XSF_VSCD_DTYPE  EQU X'09'                                          @01A 42233500
* *****************************************************************@01A 42235500
XSF_SFI_VSCN_ID EQU X'8C1800' Primary VRS Subchain name            @01A 42237500
XSF_VSCN_LENGTH EQU X'0010'                                        @01A 42239500
XSF_VSCN_DTYPE  EQU X'07'                                          @01A 42241500
* ********************************************************************  42243600
XSF_SFI_VST_ID EQU X'8C2000' Volume Status                              42275700
XSF_VST_LENGTH EQU X'0009'                                              42307800
XSF_VST_DTYPE  EQU X'02'                                                42339900
*                                                                       42372000
XSF_VST_FLAG_MASTER  EQU X'80'                                          42404100
XSF_VST_FLAG_SCRATCH EQU X'40'                                          42436200
XSF_VST_FLAG_USER    EQU X'20'                                          42468300
XSF_VST_FLAG_INIT    EQU X'10'                                          42500400
XSF_VST_FLAG_ENTRY   EQU X'08'                                          42532500
* ********************************************************************  42564600
XSF_SFI_VTM_ID EQU X'8C3000' Last Inven Mgt VRS Time                    42596700
XSF_VTM_LENGTH EQU X'000C'                                              42628800
XSF_VTM_DTYPE  EQU X'0A'                                                42660900
* ********************************************************************  42693000
XSF_SFI_VTYP_ID EQU X'8C4000' Primary VRS Type                     @01C 42725100
XSF_VTYP_LENGTH EQU X'0009'                                             42757200
XSF_VTYP_DTYPE  EQU X'03'                                               42789300
*                                                                       42821400
XSF_VTYP_DATA_UNDEFINED EQU X'00'                                       42853500
XSF_VTYP_DATA_DATASET   EQU X'01'                                       42885600
XSF_VTYP_DATA_SMSMC     EQU X'02'                                       42917700
XSF_VTYP_DATA_VRSMV     EQU X'03'                                       42949800
XSF_VTYP_DATA_DSNMV     EQU X'04'                                       42981900
XSF_VTYP_DATA_DSNMC     EQU X'05'                                  @01A 42997900
* ********************************************************************  42998002
XSF_SFI_WCTL_ID            EQU X'8C4150'    DataSet WHILECATALOG   @M2A 42998102
XSF_WCTL_LENGTH            EQU X'0009'                             @M2A 42998202
XSF_WCTL_DTYPE             EQU X'03'                               @K5C 42998302
*                                                                  @M2A 42998402
XSF_WCTL_DATA_OFF          EQU X'00'                               @K5C 42998502
XSF_WCTL_DATA_ON           EQU X'20'                               @K5C 42998602
XSF_WCTL_DATA_UNTILEXPIRED EQU X'10'                               @K5C 42998702
* ***************************************************************  @10A 43003900
XSF_SFI_WORM_ID    EQU X'8C4300' WORM flag                         @10A 43009900
XSF_WORM_LENGTH    EQU X'0009'                                     @10A 43015900
XSF_WORM_DTYPE     EQU X'03'                                       @10A 43021900
*                                                                  @10A 43027900
XSF_WORM_DATA_NO   EQU X'00'                                       @10A 43033900
XSF_WORM_DATA_YES  EQU X'01'                                       @10A 43039900
* **************************************************************** @SGA 43046000
XSF_SFI_WWID_ID EQU X'8C4500' Worldwide ID                         @SGA 43094100
XSF_WWID_LENGTH EQU X'0020'                                        @SGA 43142200
XSF_WWID_DTYPE  EQU X'01'                                          @SGA 43190300
* ********************************************************************  43238700
XSF_SFI_XDC_ID EQU X'8C5000' Expiration Date Check                      43270800
XSF_XDC_LENGTH EQU X'0009'                                              43302900
XSF_XDC_DTYPE  EQU X'03'                                                43335000
*                                                                       43367100
XSF_XDC_DATA_NO       EQU X'00'                                         43399200
XSF_XDC_DATA_YES      EQU X'01'                                         43431300
XSF_XDC_DATA_OPERATOR EQU X'02'                                         43463400
* ********************************************************************  43495500
XSF_SFI_XDTJ_ID EQU X'8C6000' Expiration Date                           43527600
XSF_XDTJ_LENGTH EQU X'000C'                                             43559700
XSF_XDTJ_DTYPE  EQU X'09'                                               43591800
* ********************************************************************  43593400
XSF_SFI_XDSB_ID EQU X'8C6100'  Expiry date set by                  @O8A 43595000
XSF_XDSB_LENGTH EQU X'0009'                                             43596600
XSF_XDSB_DTYPE  EQU X'03'                                               43598200
*                                                                       43599800
XSF_XDSB_DATA_UNKNOWN      EQU 0                                   @O8A 43601400
XSF_XDSB_DATA_CMD          EQU 1                                   @O8A 43603000
XSF_XDSB_DATA_CMD_DEF      EQU 2                                   @O8A 43604600
XSF_XDSB_DATA_CMD_VOLCAT   EQU 3                                   @O8A 43606200
XSF_XDSB_DATA_OCE_JFCB     EQU 4                                   @O8A 43607800
XSF_XDSB_DATA_OCE_EXIT     EQU 5                                   @O8A 43609400
XSF_XDSB_DATA_OCE_DEF      EQU 6                                   @O8A 43611000
XSF_XDSB_DATA_OCE_MAX      EQU 7                                   @O8A 43612600
XSF_XDSB_DATA_OCE_VOLCAT   EQU 8                                   @O8A 43614200
XSF_XDSB_DATA_LCS          EQU 9                                   @O8A 43615800
XSF_XDSB_DATA_LCS_DEF      EQU 10                                  @O8A 43617400
XSF_XDSB_DATA_TVEXTPURGE   EQU 11                                  @O8A 43619000
XSF_XDSB_DATA_CNVT         EQU 12                                  @O8A 43620600
XSF_XDSB_DATA_EXPORT       EQU 13                                  @O8A 43622200
XSF_XDSB_DATA_LASTREF      EQU 14                                  @OQA 43623000
XSF_XDSB_DATA_OCE_MC       EQU 15                                  @OVA 43623400
XSF_XDSB_DATA_CATRETPD     EQU 16                                  @M2A 43623502
XSF_XDSB_DATA_Catlg_Days   EQU 17                                  @M2A 43623602
XSF_XDSB_DATA_DEFTABLE     EQU 18                                  @M3A 43623702
* ********************************************************************  43623900
XSF_SFI_XTM_ID EQU X'8C7000' Last Inven Mgt Expir Time                  43656000
XSF_XTM_LENGTH EQU X'000C'                                              43688100
XSF_XTM_DTYPE  EQU X'0A'                                                43720200
* **************************************************************** @LGA 43720300
XSF_SFI_X100_ID EQU X'8C7800' Installation exit status EDGUX100    @LGA 43720400
XSF_X100_LENGTH EQU X'0009'                                        @LGA 43720500
XSF_X100_DTYPE  EQU X'03'                                          @LGA 43720600
*                                                                  @LGA 43720700
XSF_X100_DATA_NOEXIT    EQU X'00'                                  @LGA 43720800
XSF_X100_DATA_ENABLED   EQU X'01'                                  @LGA 43720900
XSF_X100_DATA_DISABLED  EQU X'02'                                  @LGA 43721000
* **************************************************************** @LGA 43721100
XSF_SFI_X200_ID EQU X'8C7801' Installation exit status EDGUX200    @LGA 43721200
XSF_X200_LENGTH EQU X'0009'                                        @LGA 43721300
XSF_X200_DTYPE  EQU X'03'                                          @LGA 43721400
*                                                                  @LGA 43721500
XSF_X200_DATA_NOEXIT    EQU X'00'                                  @LGA 43721600
XSF_X200_DATA_ENABLED   EQU X'01'                                  @LGA 43721700
XSF_X200_DATA_DISABLED  EQU X'02'                                  @LGA 43721800
* **************************************************************** @07A 43722000
XSF_SFI_X300_ID EQU X'8C7802' Installation exit status EDGUX300    @07A 43722200
XSF_X300_LENGTH EQU X'0009'                                        @07A 43722400
XSF_X300_DTYPE  EQU X'03'                                          @07A 43722600
*                                                                  @07A 43722800
XSF_X300_DATA_NOEXIT    EQU X'00'                                  @07A 43723000
XSF_X300_DATA_ENABLED   EQU X'01'                                  @07A 43723200
XSF_X300_DATA_DISABLED  EQU X'02'                                  @07A 43723400
* **************************************************************** @01A 43723600
XSF_SFI_2JBN_ID EQU X'8C8000' Secondary VRS jobname mask           @01A 43723800
XSF_2JBN_LENGTH EQU X'0010'                                        @01A 43725600
XSF_2JBN_DTYPE  EQU X'07'                                          @01A 43727400
* **************************************************************** @01A 43729200
XSF_SFI_2NME_ID EQU X'8C9000' Secondary VRS mask                   @01A 43731000
XSF_2NME_LENGTH EQU X'0010'                                        @01A 43732800
XSF_2NME_DTYPE  EQU X'07'                                          @01A 43734600
* **************************************************************** @01A 43736400
XSF_SFI_2SCD_ID EQU X'8CA000' Secondary VRS subchain start date    @01A 43738200
XSF_2SCD_LENGTH EQU X'000C'                                        @01A 43740000
XSF_2SCD_DTYPE  EQU X'09'                                          @01A 43741800
* **************************************************************** @01A 43743600
XSF_SFI_2SCN_ID EQU X'8CB000' Secondary VRS subchain name          @01A 43745400
XSF_2SCN_LENGTH EQU X'0010'                                        @01A 43747200
XSF_2SCN_DTYPE  EQU X'07'                                          @01A 43749000
.********************************************************************** 43752300
.********************************************************************** 43784400
.********************************************************************** 43816500
.L0002   ANOP                                                           43848600
         AIF   ('&ZCBPRINT' EQ 'NO').P3                                 43880700
         AIF   ('&LIST' EQ 'YES').P4                                    43912800
.P3      ANOP                                                           43944900
         POP   PRINT                                                    43977000
.P4      ANOP                                                           44009100
         MEND                                                           44041200
**/ EDGXSF_2:;                                                          44073300
* %DCL EDGXSF_INCLUDED CHAR EXT;                                        44079700
* %DEACTIVATE EDGXSF_INCLUDED;                                          44086100
* %IF EDGXSF_INCLUDED = '' %THEN                                        44092500
* %DO;                                                                  44098900
* %EDGXSF_INCLUDED = 'YES';                                             44105400
* %DCL ZCBPRINT CHAR EXT;                                               44137500
* %DEACTIVATE ZCBPRINT;                                                 44169600
* %DCL EDGXSF_LIST CHAR EXT;                                            44201700
* %DEACTIVATE EDGXSF_LIST;                                              44233800
* %IF EDGXSF_LIST ^= 'NO' &                                             44265900
*    ZCBPRINT ^= 'NO' %THEN                                             44298000
*   %GOTO EDGXSF_3;                                                     44330100
*   @LIST PUSH NOECHO;                                                  44362200
*   @LIST NOASSEMBLE NOECHO;                                            44394300
*   @LIST OFF C NOECHO;                                                 44426400
* %EDGXSF_3:; /* P L S M A P P I N G S T A R T */                       44443200
*/********************************************************************/ 44460100
*/*                                                                  */ 44461700
*/* Common Name:          API Structure Field Introducers            */ 44463300
*/* Macro ID:             EDGXSF                                     */ 44464900
*/* DSECT Name:           XSF_SFI                                    */ 44466500
*/* Owning Component:     DFSMSrmm (DF186)                           */ 44468100
*/* Eye-Catcher ID:       None                                       */ 44469700
*/* Storage Attributes:   Subpool:   user specified                  */ 44471300
*/*                       Key:       any key                         */ 44472900
*/*                       Residency: 31 bit                          */ 44474500
*/* Size:                 Variable                                   */ 44476100
*/* Created by:           Caller                                     */ 44477700
*/* Pointed to by:        N/A                                        */ 44479300
*/* Serialization:        None                                       */ 44480900
*/* Function:             The XSF_SFI area is initialized by         */ 44482500
*/*                       DFSMSrmm when an API call is made          */ 44484100
*/*                       via the EDGXCI executable macro            */ 44485700
*/*                                                                  */ 44487300
*/********************************************************************/ 44488900
*                                                                       44522700
* %DCL SFI_BASE CHAR;                                                   44554800
*                                                                       44586900
* %DCL XTYPE CHAR;                                                      44619000
*                                                                       44651100
* %IF XTYPE = '' %THEN              ] Check and set basing argument     44683200
*    %XTYPE = 'BASED BDY(WORD)';    ] Set default of based              44715300
*                                                                       44875800
* DCL 1 XSF_OUTBUF XTYPE,              ] Output buffer                  44907900
*     2 XSF_OUTBUF_BUFLNG  FIXED(31),  ] Output buffer length           44940000
*     2 XSF_OUTBUF_RQDLNG  FIXED(31),  ] Required buffer length         44972100
*     2 XSF_OUTBUF_DATALNG FIXED(31),  ] Length of output data          45004200
*     2 XSF_OUTBUF_FIELDS  CHAR(*);    ] Start of structured fields     45036300
*                                                                       45068400
*/********************************************************************/ 45100500
*/*    Structured Field Introducers for Structured Fields           **/ 45132600
*/********************************************************************/ 45164700
*                                                                       45196800
* DCL 1 XSF_SFI XTYPE,               ] Structured field introducers     45228900
*     2 XSF_SFI_HD,                                                     45261000
*      3  XSF_SFI_LENGTH FIXED(15),  ] Length                           45293100
*      3  XSF_SFI_ID     CHAR(3),    ] Identifier                       45325200
*         4  XSF_SFI_IDVAL  CHAR(2), ] Identifier value                 45357300
*         4  XSF_SFI_IDQUAL CHAR(1), ] Identifier qualifier             45389400
*      3  XSF_SFI_TYPE   FIXED(8),   ] Type                             45421500
*      3  *              CHAR(1),    ] Reserved                         45453600
*      3  XSF_SFI_DTYPE  FIXED(8),   ] Data type                        45485700
*      2  XSF_SFI_DATA   CHAR(*);    ] Start of data                    45517800
*                                                                       45549900
*/********************************************************************/ 45582000
*/*    Compound SFI definition                                       */ 45584700
*/********************************************************************/ 45587400
* DCL 1 XSF_SFI_COMPTYPE1 DEF(XSF_SFI_DATA), ] Compound section    @SKA 45590100
*      2  XSF_SFI_CompData  UNION,       ]                         @SKA 45592800
*       3 XSF_SFI_CompHdr   CHAR(6),     ] Compound header         @SKA 45595500
*                                                                       45598200
*       3 XSF_SFI_CompEnt,               ] Compound entry          @SKA 45600900
*        4 XSF_SFI_CompType FIXED(8),    ] Compound type           @SKA 45603600
*                                                                       45606300
*        4 XSF_SFI_Field1,               ]                         @SKA 45609300
*         5 XSF_SFI_LEN1    FIXED(8),    ] Length of first field   @SKA 45612300
*         5 XSF_SFI_DTYP1   FIXED(8),    ] Type of first field     @SKA 45615300
*         5 XSF_SFI_Factor  FIXED(8),    ] Factor for second field @SKA 45618300
*        4 XSF_SFI_Field2,               ]                         @SKA 45621300
*         5 XSF_SFI_LEN2    FIXED(8),    ] Length of second field  @SKA 45624300
*         5 XSF_SFI_DTYP2   FIXED(8),    ] Type of second field    @SKA 45627300
*                                                                       45630600
*      2  XSF_SFI_CompVal   CHAR(8);     ] The value               @SKA 45633300
*                                                                       45636000
*/********************************************************************/ 45638700
*/*    Data Types (XSF_SFI_DTYPE, XSF_SFI_DTYP1, XSF_SFI_DTYP2)      */ 45642400
*/********************************************************************/ 45646200
*                                                                       45678300
* DCL  XSF_SFI_DTYPE_UNDEF   BIT(8)  CONSTANT('00'X);                   45710400
*                                   ] Undefined data                    45742500
* DCL  XSF_SFI_DTYPE_CHAR_FIX   BIT(8)  CONSTANT('01'X);                45774600
*                                   ] N byte character                  45806700
* DCL  XSF_SFI_DTYPE_BITFLAG BIT(8)  CONSTANT('02'X);                   45838800
*                                   ] Bit flag byte (8 bits)            45870900
* DCL  XSF_SFI_DTYPE_BIN8    BIT(8)  CONSTANT('03'X);                   45903000
*                                   ] 1 byte (hex) value                45935100
* DCL  XSF_SFI_DTYPE_BIN15   BIT(8) CONSTANT('04'X);                    45967200
*                                   ] 2 byte hex value                  45999300
* DCL  XSF_SFI_DTYPE_BIN31   BIT(8) CONSTANT('05'X);                    46031400
*                                   ] 4 byte hex value                  46052800
* DCL  XSF_SFI_DTYPE_BIN64   BIT(8) CONSTANT('06'X);                    46074200
*                                   ] 8 byte hex value             @SKA 46084900
* DCL  XSF_SFI_DTYPE_CHAR_VAR  BIT(8) CONSTANT('07'X);                  46095600
*                                   ] Variable length character         46117000
* DCL  XSF_SFI_DTYPE_COMPOUND  BIT(8) CONSTANT('08'X);                  46138400
*                                   ] Compound SFI                 @SKA 46149100
* DCL  XSF_SFI_DTYPE_JDATE   BIT(8) CONSTANT('09'X);                    46159800
*                                   ] 4 byte packed decimal date        46191900
*                                   ] YYYYDDD                           46224000
* DCL  XSF_SFI_DTYPE_TIME    BIT(8) CONSTANT('0A'X);                    46256100
*                                   ] 4 byte packed decimal time        46277900
*                                   ] HHMMSST                           46299700
*                                                                       46321500
*/********************************************************************/ 46322700
*/*    Compound Types (XSF_SFI_CompType)                             */ 46323900
*/********************************************************************/ 46325100
*                                                                       46326300
* DCL  XSF_SFI_CompType_UNDEF   BIT(8)  CONSTANT('00'X);                46327500
*                                   ] Undefined type               @SKA 46328700
* DCL  XSF_SFI_CompType_Factor  BIT(8)  CONSTANT('01'X);                46329900
*                                   ] Factored type                @SKA 46331100
*                                                                       46332300
*/********************************************************************/ 46333500
*/*    Factors        (XSF_SFI_Factor)                               */ 46334700
*/********************************************************************/ 46335900
*                                                                       46337100
* DCL  XSF_SFI_Factor_Bytes  BIT(8)  CONSTANT('00'X);                   46338300
*                                   ] Value is in bytes            @SKA 46339500
* DCL  XSF_SFI_Factor_KB     BIT(8)  CONSTANT('01'X);                   46340700
*                                   ] Value is in kilobytes        @SKA 46341900
* DCL  XSF_SFI_Factor_MB     BIT(8)  CONSTANT('02'X);                   46343100
*                                   ] Value is in megabytes        @SKA 46344300
* DCL  XSF_SFI_Factor_GB     BIT(8)  CONSTANT('03'X);                   46345500
*                                   ] Value is in gigabytes        @SKA 46346700
* DCL  XSF_SFI_Factor_TB     BIT(8)  CONSTANT('04'X);                   46347900
*                                   ] Value is in terabytes        @SKA 46350100
*                                                                       46352400
*/********************************************************************/ 46384500
*/**   Group SFIs                                                   **/ 46416600
*/********************************************************************/ 46448700
*                                                                       46480800
*/********************************************************************/ 46512900
*/**   Begin and End ACCESS                                         **/ 46545000
*/********************************************************************/ 46577100
*  DCL XSF_SFI_ACCESS      BIT(64) CONSTANT('0008021000000000'X);       46609200
*  DCL XSF_SFI_ID_ACCESS   BIT(24) CONSTANT('021000'X);                 46641300
*  DCL XSF_ACCESS_LENGTH   BIT(16) CONSTANT('0008'X);                   46673400
*                                      /*                            */ 46705500
*  DCL XSF_SFI_EACCESS     BIT(64) CONSTANT('0008021080000000'X);       46737600
*  DCL XSF_SFI_ID_EACCESS  BIT(24) CONSTANT('021080'X);                 46769700
*  DCL XSF_EACCESS_LENGTH  BIT(16) CONSTANT('0008'X);                   46801800
*/********************************************************************/ 46833900
*/**   Begin and End ACTIONS                                        **/ 46866000
*/********************************************************************/ 46898100
*  DCL XSF_SFI_ACTIONS     BIT(64) CONSTANT('0008022000000000'X);       46930200
*  DCL XSF_SFI_ID_ACTIONS  BIT(24) CONSTANT('022000'X);                 46962300
*  DCL XSF_ACTIONS_LENGTH  BIT(16) CONSTANT('0008'X);                   46994400
*                                      /*                            */ 47026500
*  DCL XSF_SFI_EACTIONS    BIT(64) CONSTANT('0008022080000000'X);       47058600
*  DCL XSF_SFI_ID_EACTIONS BIT(24) CONSTANT('022080'X);                 47090700
*  DCL XSF_EACTIONS_LENGTH BIT(16) CONSTANT('0008'X);                   47122800
*/********************************************************************/ 47154900
*/**   Begin and End CNTL                                           **/ 47187000
*/********************************************************************/ 47219100
*  DCL XSF_SFI_CNTL        BIT(64) CONSTANT('0008024000000000'X);       47251200
*  DCL XSF_SFI_ID_CNTL     BIT(24) CONSTANT('024000'X);                 47283300
*  DCL XSF_CNTL_LENGTH     BIT(16) CONSTANT('0008'X);                   47315400
*                                      /*                            */ 47347500
*  DCL XSF_SFI_ECNTL       BIT(64) CONSTANT('0008024080000000'X);       47379600
*  DCL XSF_SFI_ID_ECNTL    BIT(24) CONSTANT('024080'X);                 47411700
*  DCL XSF_ECNTL_LENGTH    BIT(16) CONSTANT('0008'X);                   47443800
*/********************************************************************/ 47475900
*/**   Begin and End CONTROL                                        **/ 47508000
*/********************************************************************/ 47540100
*  DCL XSF_SFI_CONTROL     BIT(64) CONSTANT('0008025000000000'X);       47572200
*  DCL XSF_SFI_ID_CONTROL  BIT(24) CONSTANT('025000'X);                 47604300
*  DCL XSF_CONTROL_LENGTH  BIT(16) CONSTANT('0008'X);                   47636400
*                                      /*                            */ 47668500
*  DCL XSF_SFI_ECONTROL    BIT(64) CONSTANT('0008025080000000'X);       47700600
*  DCL XSF_SFI_ID_ECONTROL BIT(24) CONSTANT('025080'X);                 47732700
*  DCL XSF_ECONTROL_LENGTH BIT(16) CONSTANT('0008'X);                   47764800
*/********************************************************************/ 47796900
*/**   Begin and End DATASET                                        **/ 47829000
*/********************************************************************/ 47861100
*  DCL XSF_SFI_DATASET     BIT(64) CONSTANT('0008026000000000'X);       47893200
*  DCL XSF_SFI_ID_DATASET  BIT(24) CONSTANT('026000'X);                 47925300
*  DCL XSF_DATASET_LENGTH  BIT(16) CONSTANT('0008'X);                   47957400
*                                      /*                            */ 47989500
*  DCL XSF_SFI_EDATASET    BIT(64) CONSTANT('0008026080000000'X);       48021600
*  DCL XSF_SFI_ID_EDATASET BIT(24) CONSTANT('026080'X);                 48053700
*  DCL XSF_EDATASET_LENGTH BIT(16) CONSTANT('0008'X);                   48085800
*/********************************************************************/ 48085902
*/**   Begin and End DEFAULT                                        **/ 48086002
*/********************************************************************/ 48087002
*  DCL XSF_SFI_DEFAULT     BIT(64) CONSTANT('0008026500000000'X);] @M3A 48088002
*                                                                ] @M3A 48089002
*  DCL XSF_SFI_ID_DEFAULT  BIT(24) CONSTANT('026500'X);          ] @M3A 48090002
*  DCL XSF_DEFAULT_LENGTH  BIT(16) CONSTANT('0008'X);            ] @M3A 48100002
*                                                                ] @M3A 48110002
*  DCL XSF_SFI_EDEFAULT    BIT(64) CONSTANT('0008026580000000'X);] @M3A 48120002
*                                                                ] @M3A 48130002
*  DCL XSF_SFI_ID_EDEFAULT BIT(24) CONSTANT('026580'X);          ] @M3A 48140002
*  DCL XSF_EDEFAULT_LENGTH BIT(16) CONSTANT('0008'X);            ] @M3A 48140102
*/********************************************************************/ 48140200
*/**   Begin and End LOCDEF                                         **/ 48150000
*/********************************************************************/ 48182100
*  DCL XSF_SFI_LOCDEF      BIT(64) CONSTANT('0008027000000000'X);       48214200
*  DCL XSF_SFI_ID_LOCDEF   BIT(24) CONSTANT('027000'X);                 48246300
*  DCL XSF_LOCDEF_LENGTH   BIT(16) CONSTANT('0008'X);                   48278400
*                                      /*                            */ 48310500
*  DCL XSF_SFI_ELOCDEF     BIT(64) CONSTANT('0008027080000000'X);       48342600
*  DCL XSF_SFI_ID_ELOCDEF  BIT(24) CONSTANT('027080'X);                 48374700
*  DCL XSF_ELOCDEF_LENGTH  BIT(16) CONSTANT('0008'X);                   48406800
*/********************************************************************/ 48409200
*/**   Begin and End MEDINF                                         **/ 48411600
*/********************************************************************/ 48414000
*  DCL XSF_SFI_MEDINF      BIT(64) CONSTANT('0008027500000000'X);       48416400
*                                                                ] @07A 48418800
*  DCL XSF_SFI_ID_MEDINF   BIT(24) CONSTANT('027500'X);          ] @07A 48421200
*  DCL XSF_MEDINF_LENGTH   BIT(16) CONSTANT('0008'X);            ] @07A 48423600
*                                                                ] @07A 48426000
*  DCL XSF_SFI_EMEDINF     BIT(64) CONSTANT('0008027580000000'X);       48428400
*                                                                ] @07A 48430800
*  DCL XSF_SFI_ID_EMEDINF  BIT(24) CONSTANT('027580'X);          ] @07A 48433200
*  DCL XSF_EMEDINF_LENGTH  BIT(16) CONSTANT('0008'X);            ] @07A 48435600
*/********************************************************************/ 48438900
*/**   Begin and End MESSAGE                                        **/ 48471000
*/********************************************************************/ 48503100
*  DCL XSF_SFI_MESSAGE     BIT(64) CONSTANT('0008028000000000'X);       48535200
*  DCL XSF_SFI_ID_MESSAGE  BIT(24) CONSTANT('028000'X);                 48567300
*  DCL XSF_MESSAGE_LENGTH  BIT(16) CONSTANT('0008'X);                   48599400
*                                      /*                            */ 48631500
*  DCL XSF_SFI_EMESSAGE    BIT(64) CONSTANT('0008028080000000'X);       48663600
*  DCL XSF_SFI_ID_EMESSAGE BIT(24) CONSTANT('028080'X);                 48695700
*  DCL XSF_EMESSAGE_LENGTH BIT(16) CONSTANT('0008'X);                   48727800
*/********************************************************************/ 48759900
*/**   Begin and End MNTMSG                                         **/ 48792000
*/********************************************************************/ 48824100
*  DCL XSF_SFI_MNTMSG      BIT(64) CONSTANT('0008029000000000'X);       48856200
*  DCL XSF_SFI_ID_MNTMSG   BIT(24) CONSTANT('029000'X);                 48888300
*  DCL XSF_MNTMSG_LENGTH   BIT(16) CONSTANT('0008'X);                   48920400
*                                      /*                            */ 48952500
*  DCL XSF_SFI_EMNTMSG     BIT(64) CONSTANT('0008029080000000'X);       48984600
*  DCL XSF_SFI_ID_EMNTMSG  BIT(24) CONSTANT('029080'X);                 49016700
*  DCL XSF_EMNTMSG_LENGTH  BIT(16) CONSTANT('0008'X);                   49048800
*/********************************************************************/ 49080900
*/**   Begin and End MOVES                                          **/ 49113000
*/********************************************************************/ 49145100
*  DCL XSF_SFI_MOVES       BIT(64) CONSTANT('000802A000000000'X);       49177200
*  DCL XSF_SFI_ID_MOVES    BIT(24) CONSTANT('02A000'X);                 49209300
*  DCL XSF_MOVES_LENGTH    BIT(16) CONSTANT('0008'X);                   49241400
*                                      /*                            */ 49273500
*  DCL XSF_SFI_EMOVES      BIT(64) CONSTANT('000802A080000000'X);       49305600
*  DCL XSF_SFI_ID_EMOVES   BIT(24) CONSTANT('02A080'X);                 49337700
*  DCL XSF_EMOVES_LENGTH   BIT(16) CONSTANT('0008'X);                   49369800
*/********************************************************************/ 49401900
*/**   Begin and End OPTION                                         **/ 49434000
*/********************************************************************/ 49466100
*  DCL XSF_SFI_OPTION      BIT(64) CONSTANT('000802B000000000'X);       49498200
*  DCL XSF_SFI_ID_OPTION   BIT(24) CONSTANT('02B000'X);                 49530300
*  DCL XSF_OPTION_LENGTH   BIT(16) CONSTANT('0008'X);                   49562400
*                                      /*                            */ 49594500
*  DCL XSF_SFI_EOPTION     BIT(64) CONSTANT('000802B080000000'X);       49626600
*  DCL XSF_SFI_ID_EOPTION  BIT(24) CONSTANT('02B080'X);                 49658700
*  DCL XSF_EOPTION_LENGTH  BIT(16) CONSTANT('0008'X);                   49690800
*/********************************************************************/ 49722900
*/**   Begin and End OWNER                                          **/ 49755000
*/********************************************************************/ 49787100
*  DCL XSF_SFI_OWNER       BIT(64) CONSTANT('000802C000000000'X);       49819200
*  DCL XSF_SFI_ID_OWNER    BIT(24) CONSTANT('02C000'X);                 49851300
*  DCL XSF_OWNER_LENGTH    BIT(16) CONSTANT('0008'X);                   49883400
*                                      /*                            */ 49915500
*  DCL XSF_SFI_EOWNER      BIT(64) CONSTANT('000802C080000000'X);       49947600
*  DCL XSF_SFI_ID_EOWNER   BIT(24) CONSTANT('02C080'X);                 49979700
*  DCL XSF_EOWNER_LENGTH   BIT(16) CONSTANT('0008'X);                   50011800
*/********************************************************************/ 50043900
*/**   Begin and End PRODUCT                                        **/ 50076000
*/********************************************************************/ 50108100
*  DCL XSF_SFI_PRODUCT     BIT(64) CONSTANT('000802D000000000'X);       50140200
*  DCL XSF_SFI_ID_PRODUCT  BIT(24) CONSTANT('02D000'X);                 50172300
*  DCL XSF_PRODUCT_LENGTH  BIT(16) CONSTANT('0008'X);                   50204400
*                                      /*                            */ 50236500
*  DCL XSF_SFI_EPRODUCT    BIT(64) CONSTANT('000802D080000000'X);       50268600
*  DCL XSF_SFI_ID_EPRODUCT BIT(24) CONSTANT('02D080'X);                 50300700
*  DCL XSF_EPRODUCT_LENGTH BIT(16) CONSTANT('0008'X);                   50332800
*/********************************************************************/ 50364900
*/**   Begin and End RACK or BIN                                    **/ 50397000
*/********************************************************************/ 50429100
*  DCL XSF_SFI_RACK        BIT(64) CONSTANT('000802E000000000'X);       50461200
*  DCL XSF_SFI_ID_RACK     BIT(24) CONSTANT('02E000'X);                 50493300
*  DCL XSF_RACK_LENGTH     BIT(16) CONSTANT('0008'X);                   50525400
*                                      /*                            */ 50557500
*  DCL XSF_SFI_ERACK       BIT(64) CONSTANT('000802E080000000'X);       50589600
*  DCL XSF_SFI_ID_ERACK    BIT(24) CONSTANT('02E080'X);                 50621700
*  DCL XSF_ERACK_LENGTH    BIT(16) CONSTANT('0008'X);                   50653800
*/********************************************************************/ 50685900
*/**   Begin and End REJECT                                         **/ 50718000
*/********************************************************************/ 50750100
*  DCL XSF_SFI_REJECT      BIT(64) CONSTANT('000802F000000000'X);       50782200
*  DCL XSF_SFI_ID_REJECT   BIT(24) CONSTANT('02F000'X);                 50814300
*  DCL XSF_REJECT_LENGTH   BIT(16) CONSTANT('0008'X);                   50846400
*                                      /*                            */ 50878500
*  DCL XSF_SFI_EREJECT     BIT(64) CONSTANT('000802F080000000'X);       50910600
*  DCL XSF_SFI_ID_EREJECT  BIT(24) CONSTANT('02F080'X);                 50942700
*  DCL XSF_EREJECT_LENGTH  BIT(16) CONSTANT('0008'X);                   50974800
*/********************************************************************/ 51006900
*/**   Begin and End SECCLS                                         **/ 51039000
*/********************************************************************/ 51071100
*  DCL XSF_SFI_SECCLS      BIT(64) CONSTANT('0008030000000000'X);       51103200
*  DCL XSF_SFI_ID_SECCLS   BIT(24) CONSTANT('030000'X);                 51135300
*  DCL XSF_SECCLS_LENGTH   BIT(16) CONSTANT('0008'X);                   51167400
*                                      /*                            */ 51199500
*  DCL XSF_SFI_ESECCLS     BIT(64) CONSTANT('0008030080000000'X);       51231600
*  DCL XSF_SFI_ID_ESECCLS  BIT(24) CONSTANT('030080'X);                 51263700
*  DCL XSF_ESECCLS_LENGTH  BIT(16) CONSTANT('0008'X);                   51295800
*/********************************************************************/ 51327900
*/**   Begin and End SECLVL                                         **/ 51360000
*/********************************************************************/ 51392100
*  DCL XSF_SFI_SECLVL      BIT(64) CONSTANT('0008031000000000'X);       51424200
*  DCL XSF_SFI_ID_SECLVL   BIT(24) CONSTANT('031000'X);                 51456300
*  DCL XSF_SECLVL_LENGTH   BIT(16) CONSTANT('0008'X);                   51488400
*                                      /*                            */ 51520500
*  DCL XSF_SFI_ESECLVL     BIT(64) CONSTANT('0008031080000000'X);       51552600
*  DCL XSF_SFI_ID_ESECLVL  BIT(24) CONSTANT('031080'X);                 51584700
*  DCL XSF_ESECLVL_LENGTH  BIT(16) CONSTANT('0008'X);                   51616800
*/********************************************************************/ 51648900
*/**   Begin and End STAT                                           **/ 51681000
*/********************************************************************/ 51713100
*  DCL XSF_SFI_STAT        BIT(64) CONSTANT('0008032000000000'X);       51745200
*  DCL XSF_SFI_ID_STAT     BIT(24) CONSTANT('032000'X);                 51777300
*  DCL XSF_STAT_LENGTH     BIT(16) CONSTANT('0008'X);                   51809400
*                                      /*                            */ 51841500
*  DCL XSF_SFI_ESTAT       BIT(64) CONSTANT('0008032080000000'X);       51873600
*  DCL XSF_SFI_ID_ESTAT    BIT(24) CONSTANT('032080'X);                 51905700
*  DCL XSF_ESTAT_LENGTH    BIT(16) CONSTANT('0008'X);                   51937800
*/********************************************************************/ 51969900
*/**   Begin and End STORE                                          **/ 52002000
*/********************************************************************/ 52034100
*  DCL XSF_SFI_STORE       BIT(64) CONSTANT('0008033000000000'X);       52066200
*  DCL XSF_SFI_ID_STORE    BIT(24) CONSTANT('033000'X);                 52098300
*  DCL XSF_STORE_LENGTH    BIT(16) CONSTANT('0008'X);                   52130400
*                                      /*                            */ 52162500
*  DCL XSF_SFI_ESTORE      BIT(64) CONSTANT('0008033080000000'X);       52194600
*  DCL XSF_ESTORE_LENGTH   BIT(16) CONSTANT('0008'X);                   52226700
*  DCL XSF_SFI_ID_ESTORE   BIT(24) CONSTANT('033080'X);                 52258800
*/********************************************************************/ 52290900
*/**   Begin and End SYSRETC                                        **/ 52323000
*/********************************************************************/ 52355100
*  DCL XSF_SFI_SYSRETC     BIT(64) CONSTANT('0008034000000000'X);       52387200
*  DCL XSF_SFI_ID_SYSRETC  BIT(24) CONSTANT('034000'X);                 52419300
*  DCL XSF_SYSRETC_LENGTH  BIT(16) CONSTANT('0008'X);                   52451400
*                                      /*                            */ 52483500
*  DCL XSF_SFI_ESYSRETC    BIT(64) CONSTANT('0008034080000000'X);       52515600
*  DCL XSF_SFI_ID_ESYSRETC BIT(24) CONSTANT('034080'X);                 52547700
*  DCL XSF_ESYSRETC_LENGTH BIT(16) CONSTANT('0008'X);                   52579800
*/********************************************************************/ 52611900
*/**   Begin and End VLPOOL                                         **/ 52644000
*/********************************************************************/ 52676100
*  DCL XSF_SFI_VLPOOL      BIT(64) CONSTANT('0008035000000000'X);       52708200
*  DCL XSF_SFI_ID_VLPOOL   BIT(24) CONSTANT('035000'X);                 52740300
*  DCL XSF_VLPOOL_LENGTH   BIT(16) CONSTANT('0008'X);                   52772400
*                                      /*                            */ 52804500
*  DCL XSF_SFI_EVLPOOL     BIT(64) CONSTANT('0008035080000000'X);       52836600
*  DCL XSF_SFI_ID_EVLPOOL  BIT(24) CONSTANT('035080'X);                 52868700
*  DCL XSF_EVLPOOL_LENGTH  BIT(16) CONSTANT('0008'X);                   52900800
*/********************************************************************/ 52932900
*/**   Begin and End VOL                                            **/ 52965000
*/********************************************************************/ 52997100
*  DCL XSF_SFI_VOLGRP      BIT(64) CONSTANT('0008036000000000'X);       53029200
*  DCL XSF_SFI_ID_VOL      BIT(24) CONSTANT('036000'X);                 53061300
*  DCL XSF_VOLGRP_LENGTH   BIT(16) CONSTANT('0008'X);                   53093400
*                                      /*                            */ 53125500
*  DCL XSF_SFI_EVOLGRP     BIT(64) CONSTANT('0008036080000000'X);       53157600
*  DCL XSF_SFI_ID_EVOL     BIT(24) CONSTANT('036080'X);                 53189700
*  DCL XSF_EVOLGRP_LENGTH  BIT(16) CONSTANT('0008'X);                   53221800
*/********************************************************************/ 53253900
*/**   Begin and End VOLUME                                         **/ 53286000
*/********************************************************************/ 53318100
*  DCL XSF_SFI_VOLUME      BIT(64) CONSTANT('0008037000000000'X);       53350200
*  DCL XSF_SFI_ID_VOLUME   BIT(24) CONSTANT('037000'X);                 53382300
*  DCL XSF_VOLUME_LENGTH   BIT(16) CONSTANT('0008'X);                   53414400
*                                      /*                            */ 53446500
*  DCL XSF_SFI_EVOLUME     BIT(64) CONSTANT('0008037080000000'X);       53478600
*  DCL XSF_SFI_ID_EVOLUME  BIT(24) CONSTANT('037080'X);                 53510700
*  DCL XSF_EVOLUME_LENGTH  BIT(16) CONSTANT('0008'X);                   53542800
*/********************************************************************/ 53574900
*/**   Begin and End VRS                                            **/ 53607000
*/********************************************************************/ 53639100
*  DCL XSF_SFI_VRSGRP      BIT(64) CONSTANT('0008038000000000'X);       53671200
*  DCL XSF_SFI_ID_VRS      BIT(24) CONSTANT('038000'X);                 53703300
*  DCL XSF_VRSGRP_LENGTH   BIT(16) CONSTANT('0008'X);                   53735400
*                                      /*                            */ 53767500
*  DCL XSF_SFI_EVRSGRP     BIT(64) CONSTANT('0008038080000000'X);       53799600
*  DCL XSF_SFI_ID_EVRS     BIT(24) CONSTANT('038080'X);                 53831700
*  DCL XSF_EVRSGRP_LENGTH  BIT(16) CONSTANT('0008'X);                   53863800
*/********************************************************************/ 53866300
*/**   Begin and End PRODUCT VOLUME                                  */ 53868800
*/********************************************************************/ 53871300
*  DCL XSF_SFI_PVOL        BIT(64) CONSTANT('0008039000000000'X);       53873800
*                                                                ] @K4A 53876300
*  DCL XSF_SFI_ID_PVOL     BIT(24) CONSTANT('039000'X);          ] @K4A 53878800
*  DCL XSF_PVOL_LENGTH     BIT(16) CONSTANT('0008'X);            ] @K4A 53881300
*                                      /*                            */ 53884100
*  DCL XSF_SFI_EPVOL       BIT(64) CONSTANT('0008039080000000'X);       53885800
*                                                                ] @K4A 53887500
*  DCL XSF_SFI_ID_EPVOL    BIT(24) CONSTANT('039080'X);          ] @K4A 53889200
*  DCL XSF_EPVOL_LENGTH    BIT(16) CONSTANT('0008'X);            ] @K4A 53890900
*                                                                       53892900
*/********************************************************************/ 53893000
*/**   Begin and End OPENRULE                                        */ 53893100
*/********************************************************************/ 53893200
*  DCL XSF_SFI_OPENRULE     BIT(64) CONSTANT('000803A000000000'X);      53893300
*                                                                ] @MRA 53893400
*  DCL XSF_SFI_ID_OPENRULE  BIT(24) CONSTANT('03A000'X);         ] @MRA 53893500
*  DCL XSF_OPENRULE_LENGTH  BIT(16) CONSTANT('0008'X);           ] @MRA 53893600
*                                      /*                            */ 53893700
*  DCL XSF_SFI_EOPENRULE    BIT(64) CONSTANT('000803A080000000'X);      53893800
*                                                                ] @MRA 53893900
*  DCL XSF_SFI_ID_EOPENRULE BIT(24) CONSTANT('03A080'X);         ] @MRA 53894000
*  DCL XSF_EOPENRULE_LENGTH BIT(16) CONSTANT('0008'X);           ] @MRA 53894100
*                                                                       53894200
*/********************************************************************/ 53894300
*/**   Begin and End PRTITION                                        */ 53894400
*/********************************************************************/ 53894500
*  DCL XSF_SFI_PRTITION     BIT(64) CONSTANT('000803B000000000'X);      53894600
*                                                                ] @MRA 53894700
*  DCL XSF_SFI_ID_PRTITION  BIT(24) CONSTANT('03B000'X);         ] @MRA 53894800
*  DCL XSF_PRTITION_LENGTH  BIT(16) CONSTANT('0008'X);           ] @MRA 53894900
*                                      /*                            */ 53895000
*  DCL XSF_SFI_EPRTITION    BIT(64) CONSTANT('000803B080000000'X);      53895100
*                                                                ] @MRA 53895200
*  DCL XSF_SFI_ID_EPRTITION BIT(24) CONSTANT('03B080'X);         ] @MRA 53895300
*  DCL XSF_EPRTITION_LENGTH BIT(16) CONSTANT('0008'X);           ] @MRA 53895400
*                                                                       53896300
*/********************************************************************/ 53897600
*/**   Begin and End STATUS                                          */ 53898900
*/********************************************************************/ 53900200
*  DCL XSF_SFI_STATUS     BIT(64) CONSTANT('000803C000000000'X); ] @NIA 53901500
*  DCL XSF_SFI_ID_STATUS  BIT(24) CONSTANT('03C000'X);           ] @NIA 53902800
*  DCL XSF_STATUS_LENGTH  BIT(16) CONSTANT('0008'X);             ] @NIA 53904100
*                                      /*                            */ 53905400
*  DCL XSF_SFI_ESTATUS    BIT(64) CONSTANT('000803C080000000'X); ] @NIA 53906700
*  DCL XSF_SFI_ID_ESTATUS BIT(24) CONSTANT('03C080'X);           ] @NIA 53908000
*  DCL XSF_ESTATUS_LENGTH BIT(16) CONSTANT('0008'X);             ] @NIA 53909300
*                                                                       53910600
*/********************************************************************/ 53911900
*/**   Begin and End TASKS                                           */ 53913200
*/********************************************************************/ 53914500
*  DCL XSF_SFI_TASKS      BIT(64) CONSTANT('000803D000000000'X); ] @NIA 53915800
*  DCL XSF_SFI_ID_TASKS   BIT(24) CONSTANT('03D000'X);           ] @NIA 53917100
*  DCL XSF_TASKS_LENGTH   BIT(16) CONSTANT('0008'X);             ] @NIA 53918400
*                                      /*                            */ 53919700
*  DCL XSF_SFI_ETASKS     BIT(64) CONSTANT('000803D080000000'X); ] @NIA 53921000
*  DCL XSF_SFI_ID_ETASKS  BIT(24) CONSTANT('03D080'X);           ] @NIA 53922300
*  DCL XSF_ETASKS_LENGTH  BIT(16) CONSTANT('0008'X);             ] @NIA 53923600
*                                                                       53924900
*/********************************************************************/ 53928000
*/*    Return and Reason Code SFI's                                 **/ 53960100
*/********************************************************************/ 53992200
*                                                                       54024300
*/********************************************************************/ 54056400
*  DCL XSF_SFI_FRC     BIT(64) CONSTANT('000C400000000005'X);           54088500
*                                   ] Function return code              54120600
*  DCL XSF_SFI_FRC_ID    BIT(24) CONSTANT('400000'X);                   54152700
*  DCL XSF_FRC_LENGTH    BIT(16) CONSTANT('000C'X);                     54184800
*  DCL XSF_FRC_DTYPE     BIT(8)  CONSTANT('05'X);                       54216900
*/********************************************************************/ 54249000
*  DCL XSF_SFI_FRS     BIT(64) CONSTANT('000C401000000005'X);           54281100
*                                   ] Function reason code              54313200
*  DCL XSF_SFI_FRS_ID    BIT(24) CONSTANT('401000'X);                   54345300
*  DCL XSF_FRS_LENGTH    BIT(16) CONSTANT('000C'X);                     54377400
*  DCL XSF_FRS_DTYPE     BIT(8)  CONSTANT('05'X);                       54409500
*/********************************************************************/ 54441600
*  DCL XSF_SFI_RSNC    BIT(64) CONSTANT('000C402000000005'X);           54473700
*                                   ] Reason code                       54505800
*  DCL XSF_SFI_RSNC_ID   BIT(24) CONSTANT('402000'X);                   54537900
*  DCL XSF_RSNC_LENGTH   BIT(16) CONSTANT('000C'X);                     54570000
*  DCL XSF_RSNC_DTYPE    BIT(8)  CONSTANT('05'X);                       54602100
*/********************************************************************/ 54634200
*  DCL XSF_SFI_RTNC    BIT(64) CONSTANT('000C403000000005'X);           54666300
*                                   ] Return code                       54698400
*  DCL XSF_SFI_RTNC_ID   BIT(24) CONSTANT('403000'X);                   54730500
*  DCL XSF_RTNC_LENGTH   BIT(16) CONSTANT('000C'X);                     54762600
*  DCL XSF_RTNC_DTYPE    BIT(8)  CONSTANT('05'X);                       54794700
*/********************************************************************/ 54826800
*  DCL XSF_SFI_SVCN    BIT(64) CONSTANT('0010404000000007'X);           54858900
*                                   ] Service name                      54891000
*  DCL XSF_SFI_SVCN_ID   BIT(24) CONSTANT('404000'X);                   54923100
*  DCL XSF_SVCN_LENGTH   BIT(16) CONSTANT('0010'X);                     54955200
*  DCL XSF_SVCN_DTYPE    BIT(8)  CONSTANT('07'X);                       54987300
*/********************************************************************/ 55019400
*                                                                       55051500
*/********************************************************************/ 55083600
*/**   Messages and Message Variable SFIs                           **/ 55115700
*/********************************************************************/ 55147800
*                                                                       55179900
*/********************************************************************/ 55212000
*  DCL XSF_SFI_MSGL    BIT(64) CONSTANT('0103051000000007'X);           55244100
*                                   ] Message line                      55276200
*  DCL XSF_SFI_MSGL_ID   BIT(24) CONSTANT('051000'X);                   55308300
*  DCL XSF_MSGL_LENGTH   BIT(16) CONSTANT('0103'X);                     55340400
*  DCL XSF_MSGL_DTYPE    BIT(8)  CONSTANT('07'X);                       55372500
*/********************************************************************/ 55404600
*  DCL XSF_SFI_MSGN    BIT(64) CONSTANT('0010052000000001'X);           55436700
*                                   ] Message number                    55468800
*  DCL XSF_SFI_MSGN_ID   BIT(24) CONSTANT('052000'X);                   55500900
*  DCL XSF_MSGN_LENGTH   BIT(16) CONSTANT('0010'X);                     55533000
*  DCL XSF_MSGN_DTYPE    BIT(8)  CONSTANT('01'X);                       55565100
*/********************************************************************/ 55597200
*  DCL XSF_SFI_ENTN    BIT(64) CONSTANT('000C053000000005'X);           55629300
*                                   ] Number of entries                 55661400
*  DCL XSF_SFI_ENTN_ID   BIT(24) CONSTANT('053000'X);                   55693500
*  DCL XSF_ENTN_LENGTH   BIT(16) CONSTANT('000C'X);                     55725600
*  DCL XSF_ENTN_DTYPE    BIT(8)  CONSTANT('05'X);                       55757700
*/********************************************************************/ 55758900
*  DCL XSF_SFI_KEYF    BIT(64) CONSTANT('0041054000000007'X);    ] @LUC 55760100
*                                   ] From key                     @K1A 55761300
*  DCL XSF_SFI_KEYF_ID   BIT(24) CONSTANT('054000'X);            ] @K1A 55762500
*  DCL XSF_KEYF_LENGTH   BIT(16) CONSTANT('0041'X);              ] @LUC 55763700
*  DCL XSF_KEYF_DTYPE    BIT(8)  CONSTANT('07'X);                ] @K1A 55764900
*/********************************************************************/ 55766100
*  DCL XSF_SFI_KEYT    BIT(64) CONSTANT('0041054200000007'X);    ] @LUC 55767300
*                                   ] To key                       @K1A 55768500
*  DCL XSF_SFI_KEYT_ID   BIT(24) CONSTANT('054200'X);            ] @LUC 55769700
*  DCL XSF_KEYT_LENGTH   BIT(16) CONSTANT('0041'X);              ] @LUC 55770900
*  DCL XSF_KEYT_DTYPE    BIT(8)  CONSTANT('07'X);                ] @K1A 55772100
*/********************************************************************/ 55773300
*  DCL XSF_SFI_TYPF    BIT(64) CONSTANT('0010055000000007'X);    ] @K1A 55774500
*                                   ] From type                    @K1A 55775700
*  DCL XSF_SFI_TYPF_ID       BIT(24) CONSTANT('055000'X);        ] @K1A 55776900
*  DCL XSF_TYPF_LENGTH       BIT(16) CONSTANT('0010'X);          ] @K1A 55778100
*  DCL XSF_TYPF_DTYPE        BIT(8)  CONSTANT('07'X);            ] @K1A 55779300
*/********************************************************************/ 55780500
*  DCL XSF_SFI_TYPT    BIT(64) CONSTANT('0010055200000007'X);    ] @K1A 55781700
*                                   ] To type                      @K1A 55782900
*  DCL XSF_SFI_TYPT_ID       BIT(24) CONSTANT('055200'X);        ] @K1A 55784100
*  DCL XSF_TYPT_LENGTH       BIT(16) CONSTANT('0010'X);          ] @K1A 55785300
*  DCL XSF_TYPT_DTYPE        BIT(8)  CONSTANT('07'X);            ] @K1A 55786500
*/********************************************************************/ 55789800
*  DCL XSF_SFI_CONT    BIT(64) CONSTANT('005C057000000007'X);    ] @MPA 55794300
*                                   ] Continue information         @MPA 55798800
*  DCL XSF_SFI_CONT_ID   BIT(24) CONSTANT('057000'X);            ] @MPA 55803300
*  DCL XSF_CONT_LENGTH   BIT(16) CONSTANT('005C'X);              ] @MPA 55807800
*  DCL XSF_CONT_DTYPE    BIT(8)  CONSTANT('07'X);                ] @MPA 55812300
*/********************************************************************/ 55816800
*                                                                       55821900
*/********************************************************************/ 55854000
*/**   Output Data SFIs                                             **/ 55886100
*/********************************************************************/ 55918200
*                                                                       55950300
*/********************************************************************/ 55953500
*  DCL XSF_SFI_ABND    BIT(64) CONSTANT('0009800500000003'X);    ] @01A 55956700
*                                   ] Closed by ABEND              @MXC 55959900
*  DCL XSF_SFI_ABND_ID   BIT(24) CONSTANT('800500'X);            ] @01A 55963100
*  DCL XSF_ABND_LENGTH   BIT(16) CONSTANT('0009'X);              ] @01A 55966300
*  DCL XSF_ABND_DTYPE    BIT(8)  CONSTANT('03'X);                ] @01A 55969500
*                                                                ] @01A 55972700
*  DCL XSF_ABND_DATA_NO  BIN(8)  CONSTANT('00'X);                ] @01A 55975900
*  DCL XSF_ABND_DATA_YES BIN(8)  CONSTANT('01'X);                ] @01A 55979100
*/********************************************************************/ 55982400
*  DCL XSF_SFI_ACCT    BIT(64) CONSTANT('0009800800000003'X);           56014500
*                                   ] Accounting source                 56046600
*  DCL XSF_SFI_ACCT_ID   BIT(24) CONSTANT('800800'X);                   56078700
*  DCL XSF_ACCT_LENGTH   BIT(16) CONSTANT('0009'X);                     56110800
*  DCL XSF_ACCT_DTYPE    BIT(8)  CONSTANT('03'X);                       56142900
*                                                                       56175000
*  DCL XSF_ACCT_DATA_JOB        BIN(8) CONSTANT('00'X);                 56207100
*  DCL XSF_ACCT_DATA_STEP       BIN(8) CONSTANT('01'X);                 56239200
*/********************************************************************/ 56271300
*  DCL XSF_SFI_ACN     BIT(64) CONSTANT('0030801000000007'X);           56303400
*                                   ] Account number                    56335500
*  DCL XSF_SFI_ACN_ID    BIT(24) CONSTANT('801000'X);                   56367600
*  DCL XSF_ACN_LENGTH    BIT(16) CONSTANT('0030'X);                     56399700
*  DCL XSF_ACN_DTYPE     BIT(8)  CONSTANT('07'X);                       56431800
*/********************************************************************/ 56435000
*  DCL XSF_SFI_ACS     BIT(64) CONSTANT('0009801800000003'X);    ] @04A 56438200
*                                   ] SMS ACS support              @04A 56441400
*  DCL XSF_SFI_ACS_ID    BIT(24) CONSTANT('801800'X);            ] @04A 56444600
*  DCL XSF_ACS_LENGTH    BIT(16) CONSTANT('0009'X);              ] @04A 56447800
*  DCL XSF_ACS_DTYPE     BIT(8)  CONSTANT('03'X);                ] @04A 56451000
*                                                                ] @04A 56454200
*  DCL XSF_ACS_DATA_NO          BIN(8) CONSTANT('00'X);          ] @04A 56457400
*  DCL XSF_ACS_DATA_YES         BIN(8) CONSTANT('01'X);          ] @04A 56460600
*/********************************************************************/ 56463900
*  DCL XSF_SFI_ACT     BIT(64) CONSTANT('0009802000000002'X);           56496000
*                                   ] Actions on release                56528100
*  DCL XSF_SFI_ACT_ID    BIT(24) CONSTANT('802000'X);                   56560200
*  DCL XSF_ACT_LENGTH    BIT(16) CONSTANT('0009'X);                     56592300
*  DCL XSF_ACT_DTYPE     BIT(8)  CONSTANT('02'X);                       56624400
*                                                                       56656500
*  DCL XSF_ACT_FLAG_SCRATCH    BIT(8) CONSTANT('80'X);                  56688600
*  DCL XSF_ACT_FLAG_REPLACE    BIT(8) CONSTANT('40'X);                  56720700
*  DCL XSF_ACT_FLAG_INIT       BIT(8) CONSTANT('20'X);                  56752800
*  DCL XSF_ACT_FLAG_ERASE      BIT(8) CONSTANT('10'X);                  56784900
*  DCL XSF_ACT_FLAG_RETURN     BIT(8) CONSTANT('08'X);                  56817000
*  DCL XSF_ACT_FLAG_NOTIFY     BIT(8) CONSTANT('04'X);                  56849100
*/********************************************************************/ 56881200
*  DCL XSF_SFI_ADL     BIT(64) CONSTANT('0030803001000007'X);           56913300
*                                   ] Address line                      56945400
*  DCL XSF_SFI_ADL_ID    BIT(24) CONSTANT('803001'X);                   56977500
*  DCL XSF_ADL_LENGTH    BIT(16) CONSTANT('0030'X);                     57009600
*  DCL XSF_ADL_DTYPE     BIT(8)  CONSTANT('07'X);                       57041700
*/********************************************************************/ 57073800
*  DCL XSF_SFI_ADTJ    BIT(64) CONSTANT('000C804000000009'X);           57105900
*                                   ] Assigned date                     57138000
*  DCL XSF_SFI_ADTJ_ID   BIT(24) CONSTANT('804000'X);                   57170100
*  DCL XSF_ADTJ_LENGTH   BIT(16) CONSTANT('000C'X);                     57202200
*  DCL XSF_ADTJ_DTYPE    BIT(8)  CONSTANT('09'X);                       57234300
*/********************************************************************/ 57266400
*  DCL XSF_SFI_AST     BIT(64) CONSTANT('0009805000000002'X);           57298500
*                                   ] Action status                     57330600
*  DCL XSF_SFI_AST_ID    BIT(24) CONSTANT('805000'X);                   57362700
*  DCL XSF_AST_LENGTH    BIT(16) CONSTANT('0009'X);                     57394800
*  DCL XSF_AST_DTYPE     BIT(8)  CONSTANT('02'X);                       57426900
*                                                                       57459000
*  DCL XSF_AST_FLAG_PENDING    BIT(8) CONSTANT('80'X);                  57491100
*  DCL XSF_AST_FLAG_CONFIRMED  BIT(8) CONSTANT('40'X);                  57523200
*  DCL XSF_AST_FLAG_COMPLETE   BIT(8) CONSTANT('20'X);                  57555300
*  DCL XSF_AST_FLAG_UNKNOWN    BIT(8) CONSTANT('10'X);                  57587400
*/********************************************************************/ 57619500
*  DCL XSF_SFI_ATM     BIT(64) CONSTANT('000C80600000000A'X);           57651600
*                                   ] Assigned time                     57683700
*  DCL XSF_SFI_ATM_ID    BIT(24) CONSTANT('806000'X);                   57715800
*  DCL XSF_ATM_LENGTH    BIT(16) CONSTANT('000C'X);                     57747900
*  DCL XSF_ATM_DTYPE     BIT(8)  CONSTANT('0A'X);                       57780000
*/********************************************************************/ 57812100
*  DCL XSF_SFI_AUD     BIT(64) CONSTANT('000A807000000004'X);           57844200
*                                   ] SMF audit record number           57876300
*  DCL XSF_SFI_AUD_ID    BIT(24) CONSTANT('807000'X);                   57908400
*  DCL XSF_AUD_LENGTH    BIT(16) CONSTANT('000A'X);                     57940500
*  DCL XSF_AUD_DTYPE     BIT(8)  CONSTANT('04'X);                       57972600
*/********************************************************************/ 58004700
*  DCL XSF_SFI_AVL     BIT(64) CONSTANT('0009808000000002'X);           58036800
*                                   ] Volume availability               58068900
*  DCL XSF_SFI_AVL_ID    BIT(24) CONSTANT('808000'X);                   58101000
*  DCL XSF_AVL_LENGTH    BIT(16) CONSTANT('0009'X);                     58133100
*  DCL XSF_AVL_DTYPE     BIT(8)  CONSTANT('02'X);                       58165200
*                                                                       58197300
*  DCL XSF_AVL_FLAG_PENDREL    BIT(8) CONSTANT('40'X);                  58229400
*  DCL XSF_AVL_FLAG_VITALRCD   BIT(8) CONSTANT('20'X);                  58261500
*  DCL XSF_AVL_FLAG_ONLOAN     BIT(8) CONSTANT('08'X);                  58293600
*  DCL XSF_AVL_FLAG_OPEN       BIT(8) CONSTANT('04'X);                  58325700
*/********************************************************************/ 58357800
*  DCL XSF_SFI_BDTJ    BIT(64) CONSTANT('000C809000000009'X);           58389900
*                                   ] Last CDS backup date              58422000
*  DCL XSF_SFI_BDTJ_ID   BIT(24) CONSTANT('809000'X);                   58454100
*  DCL XSF_BDTJ_LENGTH   BIT(16) CONSTANT('000C'X);                     58486200
*  DCL XSF_BDTJ_DTYPE    BIT(8)  CONSTANT('09'X);                       58518300
*/********************************************************************/ 58522800
*  DCL XSF_SFI_BESK      BIT(64) CONSTANT('000C809310000005'X);  ] @SLA 58527300
*                                   ] BES key index                @SLA 58531800
*  DCL XSF_SFI_BESK_ID   BIT(24) CONSTANT('809310'X);            ] @SLA 58536300
*  DCL XSF_BESK_LENGTH   BIT(16) CONSTANT('000C'X);              ] @SLA 58540800
*  DCL XSF_BESK_DTYPE    BIT(8)  CONSTANT('05'X);                ] @SLA 58545300
*/********************************************************************/ 58550400
*  DCL XSF_SFI_BIN     BIT(64) CONSTANT('000E80A000000001'X);           58582500
*                                   ] Bin number                        58614600
*  DCL XSF_SFI_BIN_ID    BIT(24) CONSTANT('80A000'X);                   58646700
*  DCL XSF_BIN_LENGTH    BIT(16) CONSTANT('000E'X);                     58678800
*  DCL XSF_BIN_DTYPE     BIT(8)  CONSTANT('01'X);                       58710900
*/********************************************************************/ 58743000
*  DCL XSF_SFI_BKPP    BIT(64) CONSTANT('001080B000000007'X);           58775100
*                                   ] Backup procedure name             58807200
*  DCL XSF_SFI_BKPP_ID   BIT(24) CONSTANT('80B000'X);                   58839300
*  DCL XSF_BKPP_LENGTH   BIT(16) CONSTANT('0010'X);                     58871400
*  DCL XSF_BKPP_DTYPE    BIT(8)  CONSTANT('07'X);                       58903500
*/********************************************************************/ 58935600
*  DCL XSF_SFI_BLKC    BIT(64) CONSTANT('000C80C000000005'X);           58967700
*                                   ] Block count                       58999800
*  DCL XSF_SFI_BLKC_ID   BIT(24) CONSTANT('80C000'X);                   59031900
*  DCL XSF_BLKC_LENGTH   BIT(16) CONSTANT('000C'X);                     59064000
*  DCL XSF_BLKC_DTYPE    BIT(8)  CONSTANT('05'X);                       59096100
*/********************************************************************/ 59128200
*  DCL XSF_SFI_BLKS    BIT(64) CONSTANT('000C80D000000005'X);           59160300
*                                   ] Block size                        59192400
*  DCL XSF_SFI_BLKS_ID   BIT(24) CONSTANT('80D000'X);                   59224500
*  DCL XSF_BLKS_LENGTH   BIT(16) CONSTANT('000C'X);                     59256600
*  DCL XSF_BLKS_DTYPE    BIT(8)  CONSTANT('05'X);                       59288700
*/********************************************************************/ 59320800
*  DCL XSF_SFI_BLKT    BIT(64) CONSTANT('000C80D030000005'X);    ] @S9A 59325300
*                                   ] Total block count                 59329800
*  DCL XSF_SFI_BLKT_ID   BIT(24) CONSTANT('80D030'X);            ] @S9A 59334300
*  DCL XSF_BLKT_LENGTH   BIT(16) CONSTANT('000C'X);              ] @S9A 59338800
*  DCL XSF_BLKT_DTYPE    BIT(8)  CONSTANT('05'X);                ] @S9A 59343300
*/********************************************************************/ 59347800
*  DCL XSF_SFI_BLK6    BIT(64) CONSTANT('001080D0B0000006'X);    ] @SOA 59348500
*                        ] Total block count (8-byte (hex) value)  @SOA 59349200
*  DCL XSF_SFI_BLK6_ID   BIT(24) CONSTANT('80D0B0'X);            ] @SOA 59349900
*  DCL XSF_BLK6_LENGTH   BIT(16) CONSTANT('0010'X);              ] @SOA 59350600
*  DCL XSF_BLK6_DTYPE    BIT(8)  CONSTANT('06'X);                ] @SOA 59351300
*/********************************************************************/ 59352000
*  DCL XSF_SFI_BLP     BIT(64) CONSTANT('000980E000000003'X);           59352900
*                                   ] BLP option                        59385000
*  DCL XSF_SFI_BLP_ID    BIT(24) CONSTANT('80E000'X);                   59417100
*  DCL XSF_BLP_LENGTH    BIT(16) CONSTANT('0009'X);                     59449200
*  DCL XSF_BLP_DTYPE     BIT(8)  CONSTANT('03'X);                       59481300
*                                                                       59513400
*  DCL XSF_BLP_DATA_RMM         BIN(8) CONSTANT('00'X);                 59545500
*  DCL XSF_BLP_DATA_NORMM       BIN(8) CONSTANT('01'X);                 59577600
*/********************************************************************/ 59609700
*  DCL XSF_SFI_BMN     BIT(64) CONSTANT('001080F000000007'X);           59641800
*                                   ] Bin number media name             59673900
*  DCL XSF_SFI_BMN_ID    BIT(24) CONSTANT('80F000'X);                   59706000
*  DCL XSF_BMN_LENGTH    BIT(16) CONSTANT('0010'X);                     59738100
*  DCL XSF_BMN_DTYPE     BIT(8)  CONSTANT('07'X);                       59770200
*/********************************************************************/ 59802300
*  DCL XSF_SFI_BTM     BIT(64) CONSTANT('000C81000000000A'X);           59834400
*                                   ] Last CDS backup time              59866500
*  DCL XSF_SFI_BTM_ID    BIT(24) CONSTANT('810000'X);                   59898600
*  DCL XSF_BTM_LENGTH    BIT(16) CONSTANT('000C'X);                     59930700
*  DCL XSF_BTM_DTYPE     BIT(8)  CONSTANT('0A'X);                       59962800
*/********************************************************************/ 59994900
*  DCL XSF_SFI_CACT    BIT(64) CONSTANT('0009811000000002'X);           60027000
*                                   ] Control active functions          60059100
*  DCL XSF_SFI_CACT_ID   BIT(24) CONSTANT('811000'X);                   60091200
*  DCL XSF_CACT_LENGTH   BIT(16) CONSTANT('0009'X);                     60123300
*  DCL XSF_CACT_DTYPE    BIT(8)  CONSTANT('02'X);                       60155400
*                                                                       60187500
*  DCL XSF_CACT_FLAG_BACKUP    BIT(8) CONSTANT('80'X);                  60219600
*  DCL XSF_CACT_FLAG_RESTORE   BIT(8) CONSTANT('40'X);                  60251700
*  DCL XSF_CACT_FLAG_VERIFY    BIT(8) CONSTANT('20'X);                  60283800
*  DCL XSF_CACT_FLAG_EXPROC    BIT(8) CONSTANT('10'X);                  60315900
*  DCL XSF_CACT_FLAG_EXTRACT   BIT(8) CONSTANT('08'X);                  60348000
*  DCL XSF_CACT_FLAG_DSTORE    BIT(8) CONSTANT('04'X);                  60380100
*  DCL XSF_CACT_FLAG_VRSEL     BIT(8) CONSTANT('02'X);                  60412200
*/********************************************************************/ 60415100
*  DCL XSF_SFI_CATS    BIT(64) CONSTANT('0009811800000003'X);    ] @K1A 60418000
*                                   ] CATSYSID value               @K1A 60420900
*  DCL XSF_SFI_CATS_ID         BIT(24) CONSTANT('811800'X);      ] @K1A 60423800
*  DCL XSF_CATS_LENGTH         BIT(16) CONSTANT('0009'X);        ] @K1A 60426700
*  DCL XSF_CATA_DTYPE          BIT(8)  CONSTANT('03'X);          ] @K1A 60429600
*                                                                ] @K1A 60432500
*  DCL XSF_CATS_DATA_SET       BIT(8) CONSTANT('00'X);           ] @K1A 60435400
*  DCL XSF_CATS_DATA_NOTSET    BIT(8) CONSTANT('01'X);           ] @K1A 60438300
*  DCL XSF_CATS_DATA_STAR      BIT(8) CONSTANT('02'X);           ] @K1A 60441200
*/********************************************************************/ 60444300
*  DCL XSF_SFI_CDS     BIT(64) CONSTANT('0010812000000007'X);           60476400
*                                   ] Control data set ID               60508500
*  DCL XSF_SFI_CDS_ID    BIT(24) CONSTANT('812000'X);                   60540600
*  DCL XSF_CDS_LENGTH    BIT(16) CONSTANT('0010'X);                     60572700
*  DCL XSF_CDS_DTYPE     BIT(8)  CONSTANT('07'X);                       60604800
*/********************************************************************/ 60604900
*  DCL XSF_SFI_CDSF    BIT(64) CONSTANT('000A812400000004'X);    ] @M7A 60605000
*                                   ] CDSFULL parmlib value        @M7A 60605100
*  DCL XSF_SFI_CDSF_ID    BIT(24) CONSTANT('812400'X);           ] @M7A 60605110
*  DCL XSF_CDSF_LENGTH    BIT(16) CONSTANT('000A'X);             ] @M7A 60605120
*  DCL XSF_CDSF_DTYPE     BIT(8)  CONSTANT('04'X);               ] @M7A 60605130
*/********************************************************************/ 60605200
*  DCL XSF_SFI_CDSQ    BIT(64) CONSTANT('0009812900000003'X);    ] @MKA 60605600
*                                   ] CDS ID enqueue name enabled  @MKA 60606000
*  DCL XSF_SFI_CDSQ_ID   BIT(24) CONSTANT('812900'X);            ] @MKA 60606400
*  DCL XSF_CDSQ_LENGTH   BIT(16) CONSTANT('0009'X);              ] @MKA 60606800
*  DCL XSF_CDSQ_DTYPE    BIT(8)  CONSTANT('03'X);                ] @MKA 60607200
*                                                                ] @MKA 60607600
*  DCL XSF_CDSQ_DATA_DISABLED  BIN(8) CONSTANT('00'X);           ] @MKA 60608000
*  DCL XSF_CDSQ_DATA_ENABLED   BIN(8) CONSTANT('01'X);           ] @MKA 60608400
*/********************************************************************/ 60611100
*  DCL XSF_SFI_CDSU    BIT(64) CONSTANT('000A812A00000004'X);    ] @LRA 60613800
*                                   ] CDS percentage used          @LRA 60618300
*  DCL XSF_SFI_CDSU_ID    BIT(24) CONSTANT('812A00'X);           ] @LRA 60622800
*  DCL XSF_CDSU_LENGTH    BIT(16) CONSTANT('000A'X);             ] @LRA 60627300
*  DCL XSF_CDSU_DTYPE     BIT(8)  CONSTANT('04'X);               ] @LRA 60631800
*/********************************************************************/ 60636900
*  DCL XSF_SFI_CDTJ    BIT(64) CONSTANT('000C813000000009'X);           60669000
*                                   ] Create date                       60701100
*  DCL XSF_SFI_CDTJ_ID   BIT(24) CONSTANT('813000'X);                   60733200
*  DCL XSF_CDTJ_LENGTH   BIT(16) CONSTANT('000C'X);                     60765300
*  DCL XSF_CDTJ_DTYPE    BIT(8)  CONSTANT('09'X);                       60797400
*/********************************************************************/ 60829500
*  DCL XSF_SFI_CJBN    BIT(64) CONSTANT('0010814000000007'X);           60861600
*                                   ] Job name                          60893700
*  DCL XSF_SFI_CJBN_ID   BIT(24) CONSTANT('814000'X);                   60925800
*  DCL XSF_CJBN_LENGTH   BIT(16) CONSTANT('0010'X);                     60957900
*  DCL XSF_CJBN_DTYPE    BIT(8)  CONSTANT('07'X);                       60990000
*/********************************************************************/ 61022100
*  DCL XSF_SFI_CLIB    BIT(64) CONSTANT('0010815000000007'X);           61054200
*                                   ] Current library name              61086300
*  DCL XSF_SFI_CLIB_ID   BIT(24) CONSTANT('815000'X);                   61118400
*  DCL XSF_CLIB_LENGTH   BIT(16) CONSTANT('0010'X);                     61150500
*  DCL XSF_CLIB_DTYPE    BIT(8)  CONSTANT('07'X);                       61182600
*/********************************************************************/ 61214700
*  DCL XSF_SFI_CLS     BIT(64) CONSTANT('0028816000000007'X);           61246800
*                                   ] Security class description        61278900
*  DCL XSF_SFI_CLS_ID    BIT(24) CONSTANT('816000'X);                   61311000
*  DCL XSF_CLS_LENGTH    BIT(16) CONSTANT('0028'X);                     61343100
*  DCL XSF_CLS_DTYPE     BIT(8)  CONSTANT('07'X);                       61375200
*/********************************************************************/ 61376800
*  DCL XSF_SFI_CMDD    BIT(64) CONSTANT('0009816900000003'X);    ] @LQA 61378400
*                                   ] COMMANDAUTH data set name    @LQA 61380000
*  DCL XSF_SFI_CMDD_ID   BIT(24) CONSTANT('816900'X);            ] @LQA 61381600
*  DCL XSF_CMDD_LENGTH   BIT(16) CONSTANT('0009'X);              ] @LQA 61383200
*  DCL XSF_CMDD_DTYPE    BIT(8)  CONSTANT('03'X);                ] @LQA 61384800
*                                                                ] @LQA 61386400
*  DCL XSF_CMDD_DATA_NO         BIN(8) CONSTANT('00'X);          ] @LQA 61388000
*  DCL XSF_CMDD_DATA_YES        BIN(8) CONSTANT('01'X);          ] @LQA 61389600
*/********************************************************************/ 61391200
*  DCL XSF_SFI_CMDO    BIT(64) CONSTANT('00098169A0000003'X);    ] @LQA 61392800
*                                   ] COMMANDAUTH owner            @LQA 61394400
*  DCL XSF_SFI_CMDO_ID   BIT(24) CONSTANT('8169A0'X);            ] @LQA 61396000
*  DCL XSF_CMDO_LENGTH   BIT(16) CONSTANT('0009'X);              ] @LQA 61397600
*  DCL XSF_CMDO_DTYPE    BIT(8)  CONSTANT('03'X);                ] @LQA 61399200
*                                                                ] @LQA 61400800
*  DCL XSF_CMDO_DATA_NO         BIN(8) CONSTANT('00'X);          ] @LQA 61402400
*  DCL XSF_CMDO_DATA_YES        BIN(8) CONSTANT('01'X);          ] @LQA 61404000
*/********************************************************************/ 61407300
*  DCL XSF_SFI_CNT     BIT(64) CONSTANT('000C817000000005'X);           61439400
*                                   ] Bin, rack or volume count         61471500
*  DCL XSF_SFI_CNT_ID    BIT(24) CONSTANT('817000'X);                   61503600
*  DCL XSF_CNT_LENGTH    BIT(16) CONSTANT('000C'X);                     61535700
*  DCL XSF_CNT_DTYPE     BIT(8)  CONSTANT('05'X);                       61567800
*/********************************************************************/ 61572300
*  DCL XSF_SFI_CPGM      BIT(64) CONSTANT('0010817820000001'X);  ] @02A 61576800
*                                   ] Creating program name        @02A 61581300
*  DCL XSF_SFI_CPGM_ID   BIT(24) CONSTANT('817820'X);            ] @02A 61585800
*  DCL XSF_CPGM_LENGTH   BIT(16) CONSTANT('0010'X);              ] @02A 61590300
*  DCL XSF_CPGM_DTYPE    BIT(8)  CONSTANT('01'X);                ] @02A 61594800
*/********************************************************************/ 61595500
*  DCL XSF_SFI_CRAT      BIT(64) CONSTANT('000C817890000005'X);  ] @SOA 61596200
*                                 ] Compression ratio in hundreths @SOA 61596900
*  DCL XSF_SFI_CRAT_ID   BIT(24) CONSTANT('817890'X);            ] @SOA 61597600
*  DCL XSF_CRAT_LENGTH   BIT(16) CONSTANT('000C'X);              ] @SOA 61598300
*  DCL XSF_CRAT_DTYPE    BIT(8)  CONSTANT('05'X);                ] @SOA 61599000
*/********************************************************************/ 61599900
*  DCL XSF_SFI_CRID      BIT(64) CONSTANT('0010817900000007'X);  ] @OBA 61604400
*                                   ] Creating user ID             @OBA 61608900
*  DCL XSF_SFI_CRID_ID   BIT(24) CONSTANT('817900'X);            ] @OBA 61613400
*  DCL XSF_CRID_LENGTH   BIT(16) CONSTANT('0010'X);              ] @OBA 61617900
*  DCL XSF_CRID_DTYPE    BIT(8)  CONSTANT('07'X);                ] @OBA 61622400
*/********************************************************************/ 61626900
*  DCL XSF_SFI_CRP     BIT(64) CONSTANT('000C818000000005'X);           61632000
*                                   ] CATRETPD retention period         61664100
*  DCL XSF_SFI_CRP_ID    BIT(24) CONSTANT('818000'X);                   61696200
*  DCL XSF_CRP_LENGTH    BIT(16) CONSTANT('000C'X);                     61728300
*  DCL XSF_CRP_DTYPE     BIT(8)  CONSTANT('05'X);                       61760400
*/********************************************************************/ 61764900
*  DCL XSF_SFI_CSDT    BIT(64) CONSTANT('000C818800000009'X);    ] @K1A 61769400
*                                   ] Catalog synchronize date     @K1A 61773900
*  DCL XSF_SFI_CSDT_ID   BIT(24) CONSTANT('818800'X);            ] @K1A 61778400
*  DCL XSF_CSDT_LENGTH   BIT(16) CONSTANT('000C'X);              ] @K1A 61782900
*  DCL XSF_CSDT_DTYPE    BIT(8)  CONSTANT('09'X);                ] @K1A 61787400
*/********************************************************************/ 61787700
*  DCL XSF_SFI_CSHN    BIT(64) CONSTANT('0047819200000007'X);    ] @LUA 61788000
*                                   ] Client/Server host name      @LUA 61788300
*  DCL XSF_SFI_CSHN_ID   BIT(24) CONSTANT('819200'X);            ] @LUA 61788600
*  DCL XSF_CSHN_LENGTH   BIT(16) CONSTANT('0047'X);              ] @LUA 61788900
*  DCL XSF_CSHN_DTYPE    BIT(8)  CONSTANT('07'X);                ] @LUA 61789200
*/********************************************************************/ 61789500
*  DCL XSF_SFI_CSIP    BIT(64) CONSTANT('0035819250000007'X);    ] @NQC 61789800
*                                   ] Client/Server IP address     @NQC 61790100
*  DCL XSF_SFI_CSIP_ID   BIT(24) CONSTANT('819250'X);            ] @LUA 61790400
*  DCL XSF_CSIP_LENGTH   BIT(16) CONSTANT('0035'X);              ] @NQC 61790700
*  DCL XSF_CSIP_DTYPE    BIT(8)  CONSTANT('07'X);                ] @LUA 61791000
*/********************************************************************/ 61792500
*  DCL XSF_SFI_CSG     BIT(64) CONSTANT('0010819000000007'X);           61824600
*                                   ] Current storage group             61856700
*  DCL XSF_SFI_CSG_ID    BIT(24) CONSTANT('819000'X);                   61888800
*  DCL XSF_CSG_LENGTH    BIT(16) CONSTANT('0010'X);                     61920900
*  DCL XSF_CSG_DTYPE     BIT(8)  CONSTANT('07'X);                       61953000
*/********************************************************************/ 61953500
*  DCL XSF_SFI_CSTM    BIT(64) CONSTANT('000C81940000000A'X);    ] @K1A 61954000
*                                   ] Catalog synchronize time     @K1A 61954500
*  DCL XSF_SFI_CSTM_ID   BIT(24) CONSTANT('819400'X);            ] @K1A 61955000
*  DCL XSF_CSTM_LENGTH   BIT(16) CONSTANT('000C'X);              ] @K1A 61955500
*  DCL XSF_CSTM_DTYPE    BIT(8)  CONSTANT('0A'X);                ] @K1A 61956000
*/********************************************************************/ 61956300
*  DCL XSF_SFI_CSVE    BIT(64) CONSTANT('0009819600000003'X);    ] @LGA 61956600
*                                   ] Stacked volume               @LGA 61956800
*                                   ] enabled status               @LGA 61957000
*  DCL XSF_SFI_CSVE_ID   BIT(24) CONSTANT('819600'X);            ] @LGA 61957200
*  DCL XSF_CSVE_LENGTH   BIT(16) CONSTANT('0009'X);              ] @LGA 61957500
*  DCL XSF_CSVE_DTYPE    BIT(8)  CONSTANT('03'X);                ] @LGA 61957800
*                                                                ] @LGA 61958100
*  DCL XSF_CSVE_DATA_NONE      BIN(8) CONSTANT('00'X);           ] @LGA 61958400
*  DCL XSF_CSVE_DATA_ENABLED   BIN(8) CONSTANT('01'X);           ] @LGA 61958700
*  DCL XSF_CSVE_DATA_DISABLED  BIN(8) CONSTANT('02'X);           ] @LGA 61959000
*  DCL XSF_CSVE_DATA_MIXED     BIN(8) CONSTANT('03'X);           ] @LGA 61959300
*/********************************************************************/ 61959402
*  DCL XSF_SFI_CTLD       BIT(64) CONSTANT('000C819785000005'X); ] @K5C 61959502
*                                   ] Catalog Days                 @M2A 61959602
*  DCL XSF_SFI_CTLD_ID          BIT(24) CONSTANT('819785'X);     ] @M2A 61959702
*  DCL XSF_CTLD_LENGTH          BIT(16) CONSTANT('000C'X);       ] @M2A 61959802
*  DCL XSF_CTLD_DTYPE           BIT(8)  CONSTANT('05'X);         ] @M2A 61959902
*/**************************************************************/] @01A 61960000
*  DCL XSF_SFI_CTLG      BIT(64) CONSTANT('0009819800000003'X);  ] @01A 61961000
*                                   ] Catalog status               @01A 61963500
*  DCL XSF_SFI_CTLG_ID   BIT(24) CONSTANT('819800'X);            ] @01A 61967000
*  DCL XSF_CTLG_LENGTH   BIT(16) CONSTANT('0009'X);              ] @01A 61970500
*  DCL XSF_CTLG_DTYPE    BIT(8)  CONSTANT('03'X);                ] @01A 61974000
*                                                                ] @01A 61977500
*  DCL XSF_CTLG_DATA_UNKNOWN    BIN(8) CONSTANT('00'X);          ] @01A 61981000
*  DCL XSF_CTLG_DATA_NO         BIN(8) CONSTANT('01'X);          ] @K1A 61982300
*  DCL XSF_CTLG_DATA_YES        BIN(8) CONSTANT('02'X);          ] @K1A 61983600
*/********************************************************************/ 61985100
*  DCL XSF_SFI_CTM     BIT(64) CONSTANT('000C81A00000000A'X);           62017200
*                                   ] Create time                       62049300
*  DCL XSF_SFI_CTM_ID    BIT(24) CONSTANT('81A000'X);                   62081400
*  DCL XSF_CTM_LENGTH    BIT(16) CONSTANT('000C'X);                     62113500
*  DCL XSF_CTM_DTYPE     BIT(8)  CONSTANT('0A'X);                       62145600
*/********************************************************************/ 62150100
*  DCL XSF_SFI_CTNR      BIT(64) CONSTANT('001881A300000007'X);  ] @S8A 62154600
*                                   ] Container                    @S8A 62159100
*  DCL XSF_SFI_CTNR_ID    BIT(24) CONSTANT('81A300'X);           ] @S8A 62163600
*  DCL XSF_CTNR_LENGTH    BIT(16) CONSTANT('0018'X);             ] @S8A 62168100
*  DCL XSF_CTNR_DTYPE     BIT(8)  CONSTANT('07'X);               ] @S8A 62172600
*/********************************************************************/ 62177700
*  DCL XSF_SFI_CTRT      BIT(64) CONSTANT('000981A400000003'X);  ] @M4A 62177802
*                                   ] Catalog Retained             @M4A 62177902
*  DCL XSF_SFI_CTRT_ID   BIT(24) CONSTANT('81A400'X);            ] @M4A 62178002
*  DCL XSF_CTRT_LENGTH   BIT(16) CONSTANT('0009'X);              ] @M4A 62179002
*  DCL XSF_CTRT_DTYPE    BIT(8)  CONSTANT('03'X);                ] @M4A 62180002
*                                                                ] @M4A 62190002
*  DCL XSF_CTRT_DATA_NO         BIN(8) CONSTANT('00'X);          ] @M4A 62200002
*  DCL XSF_CTRT_DATA_KBC        BIN(8) CONSTANT('01'X);          ] @M4A 62210002
*  DCL XSF_CTRT_DATA_UX         BIN(8) CONSTANT('02'X);          ] @M4A 62220002
*  DCL XSF_CTRT_DATA_EXP        BIN(8) CONSTANT('03'X);          ] @12A 62230002
*/********************************************************************/ 62230102
*  DCL XSF_SFI_DBN     BIT(64) CONSTANT('000C81B000000005'X);           62230200
*                                   ] Bin numbers in DISTANT            62241900
*  DCL XSF_SFI_DBN_ID    BIT(24) CONSTANT('81B000'X);                   62274000
*  DCL XSF_DBN_LENGTH    BIT(16) CONSTANT('000C'X);                     62306100
*  DCL XSF_DBN_DTYPE     BIT(8)  CONSTANT('05'X);                       62338200
*/********************************************************************/ 62340600
*  DCL XSF_SFI_DBIN    BIT(64) CONSTANT('000E81A600000001'X);    ] @SCA 62343000
*                                   ] Destination bin number       @SCA 62345400
*  DCL XSF_SFI_DBIN_ID   BIT(24) CONSTANT('81A600'X);            ] @SCA 62347800
*  DCL XSF_DBIN_LENGTH   BIT(16) CONSTANT('000E'X);              ] @SCA 62350200
*  DCL XSF_DBIN_DTYPE    BIT(8)  CONSTANT('01'X);                ] @SCA 62352600
*/********************************************************************/ 62355000
*  DCL XSF_SFI_DBMN    BIT(64) CONSTANT('001081A700000007'X);    ] @K3C 62357400
*                                   ] Destination bin media name   @SCA 62359800
*  DCL XSF_SFI_DBMN_ID   BIT(24) CONSTANT('81A700'X);            ] @SCA 62362200
*  DCL XSF_DBMN_LENGTH   BIT(16) CONSTANT('0010'X);              ] @K3C 62364900
*  DCL XSF_DBMN_DTYPE    BIT(8)  CONSTANT('07'X);                ] @K3C 62367600
*/********************************************************************/ 62370300
*  DCL XSF_SFI_DC      BIT(64) CONSTANT('001081C000000007'X);           62402400
*                                   ] Data class                        62434500
*  DCL XSF_SFI_DC_ID     BIT(24) CONSTANT('81C000'X);                   62466600
*  DCL XSF_DC_LENGTH     BIT(16) CONSTANT('0010'X);                     62498700
*  DCL XSF_DC_DTYPE      BIT(8)  CONSTANT('07'X);                       62530800
*/********************************************************************/ 62562900
*  DCL XSF_SFI_DD      BIT(64) CONSTANT('001081D000000007'X);           62595000
*                                   ] DD name                           62627100
*  DCL XSF_SFI_DD_ID     BIT(24) CONSTANT('81D000'X);                   62659200
*  DCL XSF_DD_LENGTH     BIT(16) CONSTANT('0010'X);                     62691300
*  DCL XSF_DD_DTYPE      BIT(8)  CONSTANT('07'X);                       62723400
*/********************************************************************/ 62755500
*  DCL XSF_SFI_DDTJ    BIT(64) CONSTANT('000C81E000000009'X);           62787600
*                                   ] Delete or store date              62819700
*  DCL XSF_SFI_DDTJ_ID   BIT(24) CONSTANT('81E000'X);                   62851800
*  DCL XSF_DDTJ_LENGTH   BIT(16) CONSTANT('000C'X);                     62883900
*  DCL XSF_DDTJ_DTYPE    BIT(8)  CONSTANT('09'X);                       62916000
*/********************************************************************/ 62916102
*  DCL XSF_SFI_DEFC    BIT(64) CONSTANT('000A81E050000004'X);    ] @M3A 62916200
*                                   ] DEFTABLE/ Entries count      @M3A 62916300
*  DCL XSF_SFI_DEFC_ID   BIT(24) CONSTANT('81E050'X);            ] @M3A 62916400
*  DCL XSF_DEFC_LENGTH   BIT(16) CONSTANT('000A'X);              ] @M3A 62916500
*  DCL XSF_DEFC_DTYPE    BIT(8)  CONSTANT('04'X);                ] @M3A 62916600
*/********************************************************************/ 62916700
*  DCL XSF_SFI_DEFD    BIT(64) CONSTANT('003481E100000007'X);    ] @M3A 62916800
*                                   ] DEFTABLE/Data set name       @M3A 62916900
*  DCL XSF_SFI_DEFD_ID   BIT(24) CONSTANT('81E100'X);            ] @M3A 62917000
*  DCL XSF_DEFD_LENGTH   BIT(16) CONSTANT('0034'X);              ] @M3A 62917100
*  DCL XSF_DEFD_DTYPE    BIT(8)  CONSTANT('07'X);                ] @M3A 62917200
*/********************************************************************/ 62917300
*  DCL XSF_SFI_DEFE    BIT(64) CONSTANT('000C81E200000005'X);    ] @M3A 62917400
*                               ] DEFTABLE/EXTRA RETENTION PERIOD  @M3A 62917500
*  DCL XSF_SFI_DEFE_ID   BIT(24) CONSTANT('81E200'X);            ] @M3A 62917600
*  DCL XSF_DEFE_LENGTH   BIT(16) CONSTANT('000C'X);              ] @M3A 62917700
*  DCL XSF_DEFE_DTYPE    BIT(8)  CONSTANT('05'X);                ] @M3A 62917800
*/********************************************************************/ 62917900
*  DCL XSF_SFI_DEFJ    BIT(64) CONSTANT('001081E300000007'X);    ] @M3A 62918000
*                               ] DEFTABLE/JOBNAME                 @M3A 62918100
*  DCL XSF_SFI_DEFJ_ID   BIT(24) CONSTANT('81E300'X);            ] @M3A 62918200
*  DCL XSF_DEFJ_LENGTH   BIT(16) CONSTANT('0010'X);              ] @M3A 62918300
*  DCL XSF_DEFJ_DTYPE    BIT(8)  CONSTANT('07'X);                ] @M3A 62918400
*/********************************************************************/ 62918500
*  DCL XSF_SFI_DEFK    BIT(64) CONSTANT('001181E400000007'X);    ] @M3A 62918600
*                               ] DEFTABLE/KEYDATE                 @M3A 62918700
*  DCL XSF_SFI_DEFK_ID   BIT(24) CONSTANT('81E400'X);            ] @M3A 62918800
*  DCL XSF_DEFK_LENGTH   BIT(16) CONSTANT('0011'X);              ] @M3A 62918900
*  DCL XSF_DEFK_DTYPE    BIT(8)  CONSTANT('07'X);                ] @M3A 62919000
*/********************************************************************/ 62919100
*  DCL XSF_SFI_DEFL    BIT(64) CONSTANT('000C81E500000005'X);    ] @M3A 62919200
*                               ] DEFTABLE/LASTREF VALUE           @M3A 62919300
*  DCL XSF_SFI_DEFL_ID   BIT(24) CONSTANT('81E500'X);            ] @M3A 62919400
*  DCL XSF_DEFL_LENGTH   BIT(16) CONSTANT('000C'X);              ] @M3A 62919500
*  DCL XSF_DEFL_DTYPE    BIT(8)  CONSTANT('05'X);                ] @M3A 62919600
*/********************************************************************/ 87411000
*  DCL XSF_SFI_DEFM    BIT(64) CONSTANT('000981E550000003'X);    ] @M8A 87411100
*                               ] DEFTABLE/EDM                     @M8A 87411200
*  DCL XSF_SFI_DEFM_ID   BIT(24) CONSTANT('81E550'X);            ] @M8A 87411300
*  DCL XSF_DEFM_LENGTH   BIT(16) CONSTANT('0009'X);              ] @M8A 87411400
*  DCL XSF_DEFM_DTYPE    BIT(8)  CONSTANT('03'X);                ] @M8A 87411500
*  DCL XSF_DEFM_DATA_BLANK    BIN(8) CONSTANT('FF'X);            ] @M8C 87411602
*  DCL XSF_DEFM_DATA_NO       BIN(8) CONSTANT('00'X);            ] @M8A 87411702
*  DCL XSF_DEFM_DATA_YES      BIN(8) CONSTANT('01'X);            ] @M8A 87411802
*/********************************************************************/ 87409300
*  DCL XSF_SFI_DEFN    BIT(64) CONSTANT('001081E570000007'X);    ] @M8A 87409400
*                               ] DEFTABLE/PROGRAM NAME            @M8A 87409500
*  DCL XSF_SFI_DEFN_ID   BIT(24) CONSTANT('81E570'X);            ] @M8A 87409600
*  DCL XSF_DEFN_LENGTH   BIT(16) CONSTANT('0010'X);              ] @M8A 87409700
*  DCL XSF_DEFN_DTYPE    BIT(8)  CONSTANT('07'X);                ] @M8A 87409800
*/********************************************************************/ 62919700
*  DCL XSF_SFI_DEFO    BIT(64) CONSTANT('000981E600000003'X);    ] @M3A 62919800
*                               ] DEFTABLE/RETENTION OVERRIDE      @M3A 62919900
*  DCL XSF_SFI_DEFO_ID   BIT(24) CONSTANT('81E600'X);            ] @M3A 62920000
*  DCL XSF_DEFO_LENGTH   BIT(16) CONSTANT('0009'X);              ] @M3A 62920100
*  DCL XSF_DEFO_DTYPE    BIT(8)  CONSTANT('03'X);                ] @M3A 62920200
*  DCL XSF_DEFO_DATA_BLANK    BIN(8) CONSTANT('FF'X);            ] @M3C 62920302
*  DCL XSF_DEFO_DATA_NO       BIN(8) CONSTANT('00'X);            ] @M3C 62920402
*  DCL XSF_DEFO_DATA_YES      BIN(8) CONSTANT('01'X);            ] @M3A 62920502
*/********************************************************************/ 62920600
*  DCL XSF_SFI_DEFP    BIT(64) CONSTANT('000E81E700000007'X);    ] @M3A 62920700
*                               ] DEFTABLE/POOL ID                 @M3A 62920800
*  DCL XSF_SFI_DEFP_ID   BIT(24) CONSTANT('81E700'X);            ] @M3A 62920900
*  DCL XSF_DEFP_LENGTH   BIT(16) CONSTANT('000E'X);              ] @M3A 62921000
*  DCL XSF_DEFP_DTYPE    BIT(8)  CONSTANT('07'X);                ] @M3A 62921100
*/********************************************************************/ 62921200
*  DCL XSF_SFI_DEFR    BIT(64) CONSTANT('000981E800000003'X);    ] @M3A 62921300
*                               ] DEFTABLE/RETENTION METHOD        @M3A 62921400
*  DCL XSF_SFI_DEFR_ID   BIT(24) CONSTANT('81E800'X);            ] @M3A 62921500
*  DCL XSF_DEFR_LENGTH   BIT(16) CONSTANT('0009'X);              ] @M3A 62921600
*  DCL XSF_DEFR_DTYPE    BIT(8)  CONSTANT('03'X);                ] @M3A 62921700
*                                                                       87408900
*  DCL XSF_DEFR_DATA_BLANK      BIN(8) CONSTANT('FF'X);          ] @M3C 87409002
*  DCL XSF_DEFR_DATA_VRSEL      BIN(8) CONSTANT('00'X);          ] @M3C 87409100
*  DCL XSF_DEFR_DATA_EXPDT      BIN(8) CONSTANT('01'X);          ] @M3C 87409200
*/********************************************************************/ 87409300
*  DCL XSF_SFI_DEFV    BIT(64) CONSTANT('001081E900000007'X);    ] @M3A 87409400
*                               ] DEFTABLE/VRS VALUE               @M3A 87409500
*  DCL XSF_SFI_DEFV_ID   BIT(24) CONSTANT('81E900'X);            ] @M3A 87409600
*  DCL XSF_DEFV_LENGTH   BIT(16) CONSTANT('0010'X);              ] @M3A 87409700
*  DCL XSF_DEFV_DTYPE    BIT(8)  CONSTANT('07'X);                ] @M3A 87409800
*/********************************************************************/ 87409900
*  DCL XSF_SFI_DEFW    BIT(64) CONSTANT('000981EA00000003'X);    ] @M3A 87410000
*                               ] DEFTABLE/WHILECATALOG            @M3A 87410100
*  DCL XSF_SFI_DEFW_ID   BIT(24) CONSTANT('81EA00'X);            ] @M3A 87410200
*  DCL XSF_DEFW_LENGTH   BIT(16) CONSTANT('0009'X);              ] @M3A 87410300
*  DCL XSF_DEFW_DTYPE    BIT(8)  CONSTANT('03'X);                ] @M3A 87410400
*                                                                ] @M3A 87410502
*  DCL XSF_DEFW_DATA_BLANK         BIN(8)  CONSTANT('FF'X);      ] @M3C 87410602
*  DCL XSF_DEFW_DATA_OFF           BIN(8)  CONSTANT('00'X);      ] @M3C 87410702
*  DCL XSF_DEFW_DATA_ON            BIN(8)  CONSTANT('01'X);      ] @M3C 87410802
*  DCL XSF_DEFW_DATA_UNTILEXPIRED  BIN(8)  CONSTANT('02'X);      ] @M3C 87410902
*/********************************************************************/ 87411000
*  DCL XSF_SFI_DEFX    BIT(64) CONSTANT('000981EB00000003'X);    ] @M3A 87411100
*                               ] DEFTABLE/VRSEL EXCLUDED          @M3A 87411200
*  DCL XSF_SFI_DEFX_ID   BIT(24) CONSTANT('81EB00'X);            ] @M3A 87411300
*  DCL XSF_DEFX_LENGTH   BIT(16) CONSTANT('0009'X);              ] @M3A 87411400
*  DCL XSF_DEFX_DTYPE    BIT(8)  CONSTANT('03'X);                ] @M3A 87411500
*  DCL XSF_DEFX_DATA_BLANK    BIN(8) CONSTANT('FF'X);            ] @M3C 87411602
*  DCL XSF_DEFX_DATA_NO       BIN(8) CONSTANT('00'X);            ] @M3A 87411702
*  DCL XSF_DEFX_DATA_YES      BIN(8) CONSTANT('01'X);            ] @M3A 87411802
*/********************************************************************/ 87411900
*  DCL XSF_SFI_DEFY    BIT(64) CONSTANT('000981EC00000003'X);    ] @M3A 87412000
*                               ] DEFTABLE/RETAINBY VALUE          @M3A 87412100
*  DCL XSF_SFI_DEFY_ID   BIT(24) CONSTANT('81EC00'X);            ] @M3A 87412200
*  DCL XSF_DEFY_LENGTH   BIT(16) CONSTANT('0009'X);              ] @M3A 87412300
*  DCL XSF_DEFY_DTYPE    BIT(8)  CONSTANT('03'X);                ] @M3A 87412400
*                                                                ] @M3A 87412500
*  DCL XSF_DEFY_DATA_BLANK    BIN(8) CONSTANT('FF'X);            ] @M3C 87412602
*  DCL XSF_DEFY_DATA_VOLUME   BIN(8) CONSTANT('00'X);            ] @M3C 87412702
*  DCL XSF_DEFY_DATA_FIRST    BIN(8) CONSTANT('01'X);            ] @M3A 87412800
*  DCL XSF_DEFY_DATA_SET      BIN(8) CONSTANT('02'X);            ] @M3A 87412900
*/********************************************************************/ 87413000
*  DCL XSF_SFI_DEFZ    BIT(64) CONSTANT('000981ED00000003'X);    ] @M8A 87411100
*                               ] DEFTABLE/CONT                    @M8A 87411200
*  DCL XSF_SFI_DEFZ_ID   BIT(24) CONSTANT('81ED00'X);            ] @M8A 87411300
*  DCL XSF_DEFZ_LENGTH   BIT(16) CONSTANT('0009'X);              ] @M8A 87411400
*  DCL XSF_DEFZ_DTYPE    BIT(8)  CONSTANT('03'X);                ] @M8A 87411500
*  DCL XSF_DEFZ_DATA_NO       BIN(8) CONSTANT('00'X);            ] @M8A 87411702
*  DCL XSF_DEFZ_DATA_YES      BIN(8) CONSTANT('01'X);            ] @M8A 87411802
*/********************************************************************/ 87413000
*  DCL XSF_SFI_DEN     BIT(64) CONSTANT('000981F000000003'X);           87413100
*                                   ] Media density                     87413200
*  DCL XSF_SFI_DEN_ID    BIT(24) CONSTANT('81F000'X);                   87413300
*  DCL XSF_DEN_LENGTH    BIT(16) CONSTANT('0009'X);                     87413400
*  DCL XSF_DEN_DTYPE     BIT(8)  CONSTANT('03'X);                       87413500
*                                                                       87413600
*  DCL XSF_DEN_DATA_UNDEFINED   BIN(8) CONSTANT('00'X);                 87413700
*  DCL XSF_DEN_DATA_1600        BIN(8) CONSTANT('01'X);                 87413800
*  DCL XSF_DEN_DATA_6250        BIN(8) CONSTANT('02'X);                 87413900
*  DCL XSF_DEN_DATA_3480        BIN(8) CONSTANT('03'X);                 87414000
*  DCL XSF_DEN_DATA_COMPACT     BIN(8) CONSTANT('04'X);                 87414100
*/********************************************************************/ 87414200
*  DCL XSF_SFI_DESC    BIT(64) CONSTANT('0026820000000007'X);           87414300
*                                   ] Volume or VRS description         87414400
*  DCL XSF_SFI_DESC_ID   BIT(24) CONSTANT('820000'X);                   87414500
*  DCL XSF_DESC_LENGTH   BIT(16) CONSTANT('0026'X);                     87414600
*  DCL XSF_DESC_DTYPE    BIT(8)  CONSTANT('07'X);                       87414700
*/********************************************************************/ 87414800
*  DCL XSF_SFI_DEST    BIT(64) CONSTANT('0010821000000007'X);           87414900
*                                   ] Destination name                  87415000
*  DCL XSF_SFI_DEST_ID   BIT(24) CONSTANT('821000'X);                   87415100
*  DCL XSF_DEST_LENGTH   BIT(16) CONSTANT('0010'X);                     87415200
*  DCL XSF_DEST_DTYPE    BIT(8)  CONSTANT('07'X);                       87415300
*/********************************************************************/ 87415400
*  DCL XSF_SFI_DEV     BIT(64) CONSTANT('000C822000000001'X);    ] @S9C 87415500
*                                   ] Device number                     87415600
*  DCL XSF_SFI_DEV_ID    BIT(24) CONSTANT('822000'X);                   87415700
*  DCL XSF_DEV_LENGTH    BIT(16) CONSTANT('000C'X);                     87415800
*  DCL XSF_DEV_DTYPE     BIT(8)  CONSTANT('01'X);                ] @S9C 87415900
*/********************************************************************/ 87416002
*  DCL XSF_SFI_DKBC       BIT(64) CONSTANT('000C822500000005'X); ] @K5C 87416102
*                                   ] Datasets Kept By Catalog     @M2A 87416202
*  DCL XSF_SFI_DKBC_ID          BIT(24) CONSTANT('822500'X);     ] @M2A 87416302
*  DCL XSF_DKBC_LENGTH          BIT(16) CONSTANT('000C'X);       ] @M2A 87416402
*  DCL XSF_DKBC_DTYPE           BIT(8)  CONSTANT('05'X);         ] @M2A 87416502
*/********************************************************************/ 87416600
*  DCL XSF_SFI_DLRJ    BIT(64) CONSTANT('000C823000000009'X);           87416700
*                                   ] Date last read                    87416800
*  DCL XSF_SFI_DLRJ_ID   BIT(24) CONSTANT('823000'X);                   87416900
*  DCL XSF_DLRJ_LENGTH   BIT(16) CONSTANT('000C'X);                     87417000
*  DCL XSF_DLRJ_DTYPE    BIT(8)  CONSTANT('09'X);                       87417100
*/********************************************************************/ 87417200
*  DCL XSF_SFI_DLTD    BIT(64) CONSTANT('0009823700000003'X);    ] @MXA 87417300
*                                   ] Deleted by disposition       @MXA 87417400
*  DCL XSF_SFI_DLTD_ID   BIT(24) CONSTANT('822700'X);            ] @MXA 87417500
*  DCL XSF_DLTD_LENGTH   BIT(16) CONSTANT('0009'X);              ] @MXA 87417600
*  DCL XSF_DLTD_DTYPE    BIT(8)  CONSTANT('03'X);                ] @MXA 87417700
*                                                                ] @MXA 87417800
*  DCL XSF_DLTD_DATA_NO  BIN(8)  CONSTANT('00'X);                ] @MXA 87417900
*  DCL XSF_DLTD_DATA_YES BIN(8)  CONSTANT('01'X);                ] @MXA 87418000
*/********************************************************************/ 87418100
*  DCL XSF_SFI_DLWJ    BIT(64) CONSTANT('000C824000000009'X);           87418200
*                                   ] Date last written                 87418300
*  DCL XSF_SFI_DLWJ_ID   BIT(24) CONSTANT('824000'X);                   87418400
*  DCL XSF_DLWJ_LENGTH   BIT(16) CONSTANT('000C'X);                     87418500
*  DCL XSF_DLWJ_DTYPE    BIT(8)  CONSTANT('09'X);                       87418600
*/********************************************************************/ 87418700
*  DCL XSF_SFI_DNM     BIT(64) CONSTANT('0034825000000007'X);           87418800
*                                   ] Data set name mask                87418900
*  DCL XSF_SFI_DNM_ID    BIT(24) CONSTANT('825000'X);                   87419000
*  DCL XSF_DNM_LENGTH    BIT(16) CONSTANT('0034'X);                     87419100
*  DCL XSF_DNM_DTYPE     BIT(8)  CONSTANT('07'X);                       87419200
*/********************************************************************/ 87419300
*  DCL XSF_SFI_DPCT    BIT(64) CONSTANT('0009825E00000003'X);    ] @S9A 87419400
*                                   ] Percent of volume            @S9A 87419500
*  DCL XSF_SFI_DPCT_ID   BIT(24) CONSTANT('825E00'X);            ] @S9A 87419600
*  DCL XSF_DPCT_LENGTH   BIT(16) CONSTANT('0009'X);              ] @S9A 87419700
*  DCL XSF_DPCT_DTYPE    BIT(8)  CONSTANT('03'X);                ] @S9A 87419800
*/********************************************************************/ 87419900
*  DCL XSF_SFI_DPT     BIT(64) CONSTANT('0030826000000007'X);           87420000
*                                   ] Owner's department                87420100
*  DCL XSF_SFI_DPT_ID    BIT(24) CONSTANT('826000'X);                   87420200
*  DCL XSF_DPT_LENGTH    BIT(16) CONSTANT('0030'X);                     87420300
*  DCL XSF_DPT_DTYPE     BIT(8)  CONSTANT('07'X);                       87420400
*/********************************************************************/ 87420500
*  DCL XSF_SFI_DRP     BIT(64) CONSTANT('000C827000000005'X);           87420600
*                                   ] Default retention period          87420700
*  DCL XSF_SFI_DRP_ID    BIT(24) CONSTANT('827000'X);                   87420800
*  DCL XSF_DRP_LENGTH    BIT(16) CONSTANT('000C'X);                     87420900
*  DCL XSF_DRP_DTYPE     BIT(8)  CONSTANT('05'X);                       87421000
*/********************************************************************/ 87421100
*  DCL XSF_SFI_DSC     BIT(64) CONSTANT('000C828000000005'X);           87421200
*                                   ] Data set count                    87421300
*  DCL XSF_SFI_DSC_ID    BIT(24) CONSTANT('828000'X);                   87421400
*  DCL XSF_DSC_LENGTH    BIT(16) CONSTANT('000C'X);                     87421500
*  DCL XSF_DSC_DTYPE     BIT(8)  CONSTANT('05'X);                       87421600
*/********************************************************************/ 87421700
*  DCL XSF_SFI_DSEQ    BIT(64) CONSTANT('000C829000000005'X);           87421800
*                                   ] Data set sequence                 87421900
*  DCL XSF_SFI_DSEQ_ID   BIT(24) CONSTANT('829000'X);                   87422000
*  DCL XSF_DSEQ_LENGTH   BIT(16) CONSTANT('000C'X);                     87422100
*  DCL XSF_DSEQ_DTYPE    BIT(8)  CONSTANT('05'X);                       87422200
*/********************************************************************/ 87422302
*  DCL XSF_SFI_DSFX      BIT(64) CONSTANT('000A829500000001'X);  ] @M3A 87422402
*                                   ] Active DEFAULTS table suffix      87422502
*  DCL XSF_SFI_DSFX_ID    BIT(24) CONSTANT('829500'X);                  87422602
*  DCL XSF_DSFX_LENGTH    BIT(16) CONSTANT('000A'X);                    87422700
*  DCL XSF_DSFX_DTYPE     BIT(8)  CONSTANT('01'X);               ] @M3A 87422802
*/********************************************************************/ 87422900
*  DCL XSF_SFI_DSN     BIT(64) CONSTANT('003482A000000007'X);           87423000
*                                   ] Data set name                     87423100
*  DCL XSF_SFI_DSN_ID    BIT(24) CONSTANT('82A000'X);                   87423200
*  DCL XSF_DSN_LENGTH    BIT(16) CONSTANT('0034'X);                     87423300
*  DCL XSF_DSN_DTYPE     BIT(8)  CONSTANT('07'X);                       87423400
*/********************************************************************/ 87423500
*  DCL XSF_SFI_DSPD    BIT(64) CONSTANT('001082A500000007'X);    ] @K1A 87423600
*                                   ] Disposition DD name          @K1A 87423700
*  DCL XSF_SFI_DSPD_ID   BIT(24) CONSTANT('82A500'X);            ] @K1A 87423800
*  DCL XSF_DSPD_LENGTH   BIT(16) CONSTANT('0010'X);              ] @K1A 87423900
*  DCL XSF_DSPD_DTYPE    BIT(8)  CONSTANT('07'X);                ] @K1A 87424000
*/********************************************************************/ 87424100
*  DCL XSF_SFI_DSPM    BIT(64) CONSTANT('001082AA00000007'X);    ] @K1A 87424200
*                                   ] Disposition message prefix   @K1A 87424300
*  DCL XSF_SFI_DSPM_ID   BIT(24) CONSTANT('82AA00'X);            ] @K1A 87424400
*  DCL XSF_DSPM_LENGTH   BIT(16) CONSTANT('0010'X);              ] @K1A 87424500
*  DCL XSF_DSPM_DTYPE    BIT(8)  CONSTANT('07'X);                ] @K1A 87424600
*/********************************************************************/ 87424700
*  DCL XSF_SFI_DSR     BIT(64) CONSTANT('000982B000000003'X);           87424800
*                                   ] Data set recording                87424900
*  DCL XSF_SFI_DSR_ID    BIT(24) CONSTANT('82B000'X);                   87425000
*  DCL XSF_DSR_LENGTH    BIT(16) CONSTANT('0009'X);                     87425100
*  DCL XSF_DSR_DTYPE     BIT(8)  CONSTANT('03'X);                       87425200
*                                                                       87425300
*  DCL XSF_DSR_DATA_OFF         BIN(8) CONSTANT('00'X);                 87425400
*  DCL XSF_DSR_DATA_ON          BIN(8) CONSTANT('01'X);                 87425500
*/********************************************************************/ 87425600
*  DCL XSF_SFI_DSS6    BIT(64) CONSTANT('001682B030000008'X);    ] @SKA 87425700
*                                   ] Data set size                @SKA 87425800
*  DCL XSF_SFI_DSS6_ID   BIT(24) CONSTANT('82B030'X);            ] @SKA 87425900
*  DCL XSF_DSS6_LENGTH   BIT(16) CONSTANT('0016'X);              ] @SKA 87426000
*  DCL XSF_DSS6_DTYPE    BIT(8)  CONSTANT('08'X);                ] @SKA 87426100
*                                   ] Compound data                @SKA 87426200
*  DCL XSF_SFI_DSS6_COMP BIT(48) CONSTANT('010303010A06'X);      ] @SKC 87426300
*                                                                ] @SKA 87426400
*  DCL XSF_SFI_DSS6_COMPType  BIT(8)  CONSTANT('01'X);           ] @SKA 87426500
*  DCL XSF_SFI_DSS6_COMPLen1  BIT(8)  CONSTANT('03'X);           ] @SKA 87426600
*  DCL XSF_SFI_DSS6_COMPTyp1  BIT(8)  CONSTANT('03'X);           ] @SKA 87426700
*  DCL XSF_SFI_DSS6_COMPDat1  BIT(8)  CONSTANT('01'X);           ] @SKA 87426800
*  DCL XSF_SFI_DSS6_COMPLen2  BIT(8)  CONSTANT('0A'X);           ] @SKA 87426900
*  DCL XSF_SFI_DSS6_COMPTyp2  BIT(8)  CONSTANT('06'X);           ] @SKA 87427000
*/********************************************************************/ 87427100
*  DCL XSF_SFI_DSTT    BIT(64) CONSTANT('000982B200000003'X);    ] @SCA 87427200
*                                   ] Destination type             @SCA 87427300
*  DCL XSF_SFI_DSTT_ID   BIT(24) CONSTANT('82B200'X);            ] @SCA 87427400
*  DCL XSF_DSTT_LENGTH   BIT(16) CONSTANT('0009'X);              ] @SCA 87427500
*  DCL XSF_DSTT_DTYPE    BIT(8)  CONSTANT('03'X);                ] @SCA 87427600
*                                                                ] @SCA 87427700
*  DCL XSF_DSTT_DATA_SHELF              BIN(8) CONSTANT('00'X);  ] @SCA 87427800
*  DCL XSF_DSTT_DATA_STORE_BUILTIN_BINS BIN(8) CONSTANT('01'X);  ] @SCA 87427900
*  DCL XSF_DSTT_DATA_MANUAL             BIN(8) CONSTANT('02'X);  ] @SCA 87428000
*  DCL XSF_DSTT_DATA_AUTO               BIN(8) CONSTANT('03'X);  ] @SCA 87428100
*  DCL XSF_DSTT_DATA_STORE_BINS         BIN(8) CONSTANT('04'X);  ] @SCA 87428200
*  DCL XSF_DSTT_DATA_STORE_NOBINS       BIN(8) CONSTANT('05'X);  ] @SCA 87428300
*/********************************************************************/ 87428402
*  DCL XSF_SFI_DSXP    BIT(64) CONSTANT('000982B500000003'X);    ] @12A 87428502
*                                   ] DSNEXPIRE(NONE/BLOCK)        @12A 87428602
*  DCL XSF_SFI_DSXP_ID   BIT(24) CONSTANT('82B500'X);            ] @12A 87428702
*  DCL XSF_DSXP_LENGTH   BIT(16) CONSTANT('0009'X);              ] @12A 87428802
*  DCL XSF_DSXP_DTYPE    BIT(8)  CONSTANT('03'X);                ] @12A 87428902
*                                                                ] @12A 87429002
*  DCL XSF_DSXP_DATA_NONE               BIN(8) CONSTANT('00'X);  ] @12A 87430002
*  DCL XSF_DSXP_DATA_BLOCK              BIN(8) CONSTANT('01'X);  ] @12A 87430102
*/********************************************************************/ 87430200
*  DCL XSF_SFI_DSYS    BIT(64) CONSTANT('001082BB00000007'X);    ] @05A 87430300
*                                   ] Creation system ID           @05A 87430400
*                                   ] for first file               @05A 87430500
*  DCL XSF_SFI_DSYS_ID    BIT(24) CONSTANT('82BB00'X);           ] @05A 87430600
*  DCL XSF_DSYS_LENGTH    BIT(16) CONSTANT('0010'X);             ] @05A 87430700
*  DCL XSF_DSYS_DTYPE     BIT(8)  CONSTANT('07'X);               ] @05A 87430800
*/********************************************************************/ 87430900
*  DCL XSF_SFI_DTE     BIT(64) CONSTANT('000982C000000003'X);           87431000
*                                   ] Installation date format          87431100
*  DCL XSF_SFI_DTE_ID    BIT(24) CONSTANT('82C000'X);                   87431200
*  DCL XSF_DTE_LENGTH    BIT(16) CONSTANT('0009'X);                     87431300
*  DCL XSF_DTE_DTYPE     BIT(8)  CONSTANT('03'X);                       87431400
*                                                                       87431500
*  DCL XSF_DTE_DATA_A           BIN(8) CONSTANT('01'X);                 87431600
*  DCL XSF_DTE_DATA_E           BIN(8) CONSTANT('02'X);                 87431700
*  DCL XSF_DTE_DATA_I           BIN(8) CONSTANT('03'X);                 87431800
*  DCL XSF_DTE_DATA_J           BIN(8) CONSTANT('04'X);                 87431900
*/********************************************************************/ 87432000
*  DCL XSF_SFI_DTM     BIT(64) CONSTANT('000C82D00000000A'X);           87432100
*                                   ] Last store update run time        87432200
*  DCL XSF_SFI_DTM_ID    BIT(24) CONSTANT('82D000'X);                   87432300
*  DCL XSF_DTM_LENGTH    BIT(16) CONSTANT('000C'X);                     87432400
*  DCL XSF_DTM_DTYPE     BIT(8)  CONSTANT('0A'X);                       87432500
*/********************************************************************/ 87432600
*  DCL XSF_SFI_EMN     BIT(64) CONSTANT('001082E000000007'X);           87432700
*                                   ] Owner's node                      87432800
*  DCL XSF_SFI_EMN_ID    BIT(24) CONSTANT('82E000'X);                   87432900
*  DCL XSF_EMN_LENGTH    BIT(16) CONSTANT('0010'X);                     87433000
*  DCL XSF_EMN_DTYPE     BIT(8)  CONSTANT('07'X);                       87433100
*/*************************************************************/ ] @SCA 87433200
*  DCL XSF_SFI_EBIN    BIT(64) CONSTANT('000982D500000003'X);    ] @SCA 87433300
*                                   ] Extended bin enabled status  @SCA 87433400
*  DCL XSF_SFI_EBIN_ID   BIT(24) CONSTANT('82D500'X);            ] @SCA 87433500
*  DCL XSF_EBIN_LENGTH   BIT(16) CONSTANT('0009'X);              ] @SCA 87433600
*  DCL XSF_EBIN_DTYPE    BIT(8)  CONSTANT('03'X);                ] @SCA 87433700
*                                                                ] @SCA 87433800
*  DCL XSF_EBIN_DATA_DISABLED  BIN(8) CONSTANT('00'X);           ] @SCA 87433900
*  DCL XSF_EBIN_DATA_ENABLED   BIN(8) CONSTANT('01'X);           ] @SCA 87434000
*/********************************************************************/ 87434100
*  DCL XSF_SFI_EDM     BIT(64) CONSTANT('000982D700000003'X);    ] @M6A 87434202
*                                   ] Volume EDM attribute         @M6A 87434302
*  DCL XSF_SFI_EDM_ID   BIT(24) CONSTANT('82D700'X);             ] @M6A 87434402
*  DCL XSF_EDM_LENGTH   BIT(16) CONSTANT('0009'X);               ] @M6A 87434502
*  DCL XSF_EDM_DTYPE    BIT(8)  CONSTANT('03'X);                 ] @M6A 87434602
*                                                                ] @M6A 87434702
*  DCL XSF_EDM_DATA_NO                  BIN(8) CONSTANT('00'X);  ] @M6A 87434802
*  DCL XSF_EDM_DATA_YES                 BIN(8) CONSTANT('01'X);  ] @M6A 87434902
*/********************************************************************/ 87435000
*  DCL XSF_SFI_EML     BIT(64) CONSTANT('004782DFF0000007'X);    ] @MEA 87435100
*                                   ] Owner's email address        @MEA 87435200
*  DCL XSF_SFI_EML_ID    BIT(24) CONSTANT('82DFF0'X);            ] @MEA 87435300
*  DCL XSF_EML_LENGTH    BIT(16) CONSTANT('0047'X);              ] @MEA 87435400
*  DCL XSF_EML_DTYPE     BIT(8)  CONSTANT('07'X);                ] @MEA 87435500
*/********************************************************************/ 87435600
*  DCL XSF_SFI_EMU     BIT(64) CONSTANT('001082F000000007'X);           87435700
*                                   ] Owner's user ID                   87435800
*  DCL XSF_SFI_EMU_ID    BIT(24) CONSTANT('82F000'X);                   87435900
*  DCL XSF_EMU_LENGTH    BIT(16) CONSTANT('0010'X);                     87436000
*  DCL XSF_EMU_DTYPE     BIT(8)  CONSTANT('07'X);                       87436100
*/********************************************************************/ 87436200
*  DCL XSF_SFI_ETL     BIT(64) CONSTANT('001C830000000007'X);           87436300
*                                   ] Owner's external phone number     87436400
*  DCL XSF_SFI_ETL_ID    BIT(24) CONSTANT('830000'X);                   87436500
*  DCL XSF_ETL_LENGTH    BIT(16) CONSTANT('001C'X);                     87436600
*  DCL XSF_ETL_DTYPE     BIT(8)  CONSTANT('07'X);                       87436700
*/********************************************************************/ 87436800
*  DCL XSF_SFI_EXRB      BIT(64) CONSTANT('0009830800000003'X);  ] @OSA 87436900
*                                   ] EXPDT RetainBy               @OSA 87437000
*  DCL XSF_SFI_EXRB_ID   BIT(24) CONSTANT('830800'X);            ] @OSA 87437100
*  DCL XSF_EXRB_LENGTH   BIT(16) CONSTANT('0009'X);              ] @OSA 87437200
*  DCL XSF_EXRB_DTYPE    BIT(8)  CONSTANT('03'X);                ] @OSA 87437300
*                                                                ] @OSA 87437400
*  DCL XSF_EXRB_VOLUME   BIN(8) CONSTANT('00'X);                 ] @OSA 87437500
*  DCL XSF_EXRB_FIRST    BIN(8) CONSTANT('01'X);                 ] @OSA 87437600
*  DCL XSF_EXRB_SET      BIN(8) CONSTANT('02'X);                 ] @OSA 87437700
*/********************************************************************/ 87437800
*  DCL XSF_SFI_FCD     BIT(64) CONSTANT('000C831000000007'X);           87437900
*                                   ] Product feature code              87438000
*  DCL XSF_SFI_FCD_ID    BIT(24) CONSTANT('831000'X);                   87438100
*  DCL XSF_FCD_LENGTH    BIT(16) CONSTANT('000C'X);                     87438200
*  DCL XSF_FCD_DTYPE     BIT(8)  CONSTANT('07'X);                       87438300
*/********************************************************************/ 87438400
*  DCL XSF_SFI_FCSP    BIT(64) CONSTANT('0009831800000003'X);    ] @K1A 87438500
*                                   ] Catalog synchronize in progress   87438600
*  DCL XSF_SFI_FCSP_ID   BIT(24) CONSTANT('831800'X);            ] @K1A 87438700
*  DCL XSF_FCSP_LENGTH   BIT(16) CONSTANT('0009'X);              ] @K1A 87438800
*  DCL XSF_FCSP_DTYPE    BIT(8)  CONSTANT('03'X);                ] @K1A 87438900
*/********************************************************************/ 87439000
*  DCL XSF_SFI_FDB     BIT(64) CONSTANT('000C832000000005'X);           87439100
*                                   ] Free bins in DISTANT location     87439200
*  DCL XSF_SFI_FDB_ID    BIT(24) CONSTANT('832000'X);                   87439300
*  DCL XSF_FDB_LENGTH    BIT(16) CONSTANT('000C'X);                     87439400
*  DCL XSF_FDB_DTYPE     BIT(8)  CONSTANT('05'X);                       87439500
*/********************************************************************/ 87439600
*  DCL XSF_SFI_FILE    BIT(64) CONSTANT('000C833000000005'X);           87439700
*                                   ] Physical file sequence            87439800
*  DCL XSF_SFI_FILE_ID   BIT(24) CONSTANT('833000'X);                   87439900
*  DCL XSF_FILE_LENGTH   BIT(16) CONSTANT('000C'X);                     87440000
*  DCL XSF_FILE_DTYPE    BIT(8)  CONSTANT('05'X);                       87440100
*/********************************************************************/ 87440200
*  DCL XSF_SFI_FLB     BIT(64) CONSTANT('000C834000000005'X);           87440300
*                                   ] Free bin numbers in LOCAL         87440400
*  DCL XSF_SFI_FLB_ID    BIT(24) CONSTANT('834000'X);                   87440500
*  DCL XSF_FLB_LENGTH    BIT(16) CONSTANT('000C'X);                     87440600
*  DCL XSF_FLB_DTYPE     BIT(8)  CONSTANT('05'X);                       87440700
*/********************************************************************/ 87440800
*  DCL XSF_SFI_FOR     BIT(64) CONSTANT('001C835000000007'X);           87440900
*                                   ] Owner's forename                  87441000
*  DCL XSF_SFI_FOR_ID    BIT(24) CONSTANT('835000'X);                   87441100
*  DCL XSF_FOR_LENGTH    BIT(16) CONSTANT('001C'X);                     87441200
*  DCL XSF_FOR_DTYPE     BIT(8)  CONSTANT('07'X);                       87441300
*/********************************************************************/ 87441400
*  DCL XSF_SFI_FRB     BIT(64) CONSTANT('000C836000000005'X);           87441500
*                                   ] Free bin numbers in REMOTE        87441600
*  DCL XSF_FRB_LENGTH    BIT(16) CONSTANT('000C'X);                     87441700
*  DCL XSF_SFI_FRB_ID    BIT(24) CONSTANT('836000'X);                   87441800
*  DCL XSF_FRB_DTYPE     BIT(8)  CONSTANT('05'X);                       87441900
*/********************************************************************/ 87442000
*  DCL XSF_SFI_FRK     BIT(64) CONSTANT('000C837000000005'X);           87442100
*                                   ] Free rack numbers in library      87442200
*  DCL XSF_SFI_FRK_ID    BIT(24) CONSTANT('837000'X);                   87442300
*  DCL XSF_FRK_LENGTH    BIT(16) CONSTANT('000C'X);                     87442400
*  DCL XSF_FRK_DTYPE     BIT(8)  CONSTANT('05'X);                       87442500
*/********************************************************************/ 87442602
*  DCL XSF_SFI_FRXP   BIT(64) CONSTANT('0009837500000003'X);            87442702
*                                   ] FORCEEXPIRE                  @K6A 87442802
*  DCL XSF_SFI_FXRP_ID    BIT(24) CONSTANT('837500'X);           ] @K6A 87442902
*  DCL XSF_FRXP_LENGTH    BIT(16) CONSTANT('0009'X);             ] @K6A 87443002
*  DCL XSF_FRXP_DTYPE     BIT(8)  CONSTANT('03'X);               ] @K6A 87444002
*                                                                ] @K6A 87445002
*  DCL XSF_FRXP_DATA_NO         BIN(8) CONSTANT('00'X);          ] @K6A 87446002
*  DCL XSF_FRXP_DATA_YES        BIN(8) CONSTANT('01'X);          ] @K6A 87446102
*/********************************************************************/ 87446200
*  DCL XSF_SFI_GDGC       BIT(64) CONSTANT('0009837800000003'X); ] @N3A 87446300
*                                   ] GDG CycleBy                  @N3A 87446400
*  DCL XSF_SFI_GDGC_ID          BIT(24) CONSTANT('837800'X);     ] @N3A 87446500
*  DCL XSF_GDGC_LENGTH          BIT(16) CONSTANT('0009'X);       ] @N3A 87446600
*  DCL XSF_GDGC_DTYPE           BIT(8)  CONSTANT('03'X);         ] @N3A 87446700
*                                                                ] @N3A 87446800
*  DCL XSF_GDGC_DATA_GENERATION BIN(8)  CONSTANT(0);             ] @N3A 87446900
*  DCL XSF_GDGC_DATA_CRDATE     BIN(8)  CONSTANT(1);             ] @N3A 87447000
*/********************************************************************/ 87447102
*  DCL XSF_SFI_GDRP       BIT(64) CONSTANT('000C837900000005'X); ] @K5C 87447202
*                                   ] GDG Retention period         @M2A 87447302
*  DCL XSF_SFI_GDRP_ID          BIT(24) CONSTANT('837900'X);     ] @M2A 87447402
*  DCL XSF_GDRP_LENGTH          BIT(16) CONSTANT('000C'X);       ] @M2A 87447502
*  DCL XSF_GDRP_DTYPE           BIT(8)  CONSTANT('05'X);         ] @M2A 87447602
*/********************************************************************/ 87447702
*  DCL XSF_SFI_GWCT       BIT(64) CONSTANT('0009837940000003'X); ] @M2A 87447802
*                                   ] GDG WHILECATALOG             @M2A 87447902
*  DCL XSF_SFI_GWCT_ID          BIT(24) CONSTANT('837940'X);     ] @M2A 87448002
*  DCL XSF_GWCT_LENGTH          BIT(16) CONSTANT('0009'X);       ] @M2A 87448100
*  DCL XSF_GWCT_DTYPE           BIT(8)  CONSTANT('03'X);         ] @M2A 87448202
*                                                                ] @M2A 87448302
*  DCL XSF_GWCT_DATA_OFF           BIN(8)  CONSTANT('00'X);      ] @M2A 87448402
*  DCL XSF_GWCT_DATA_ON            BIN(8)  CONSTANT('01'X);      ] @M2A 87448502
*  DCL XSF_GWCT_DATA_UNTILEXPIRED  BIN(8)  CONSTANT('02'X);      ] @M2A 87448602
*/********************************************************************/ 87448700
*  DCL XSF_SFI_GDGD       BIT(64) CONSTANT('0009837805000003'X); ] @N3A 87448800
*                                   ] GDG duplicate                @N3A 87448900
*  DCL XSF_SFI_GDGD_ID          BIT(24) CONSTANT('837800'X);     ] @N3A 87449000
*  DCL XSF_GDGD_LENGTH          BIT(16) CONSTANT('0009'X);       ] @N3A 87449100
*  DCL XSF_GDGD_DTYPE           BIT(8)  CONSTANT('03'X);         ] @N3A 87449200
*                                                                ] @N3A 87449300
*  DCL XSF_GDGD_DATA_BUMP       BIN(8)  CONSTANT(0);             ] @N3A 87449400
*  DCL XSF_GDGD_DATA_DROP       BIN(8)  CONSTANT(1);             ] @N3A 87449500
*  DCL XSF_GDGD_DATA_KEEP       BIN(8)  CONSTANT(2);             ] @N3A 87449600
*  DCL XSF_GDGD_DATA_COUNT      BIN(8)  CONSTANT(3);             ] @N3A 87449700
*/********************************************************************/ 87449800
*  DCL XSF_SFI_GRK     BIT(64) CONSTANT('000E838000000001'X);           87449900
*                                   ] Generic rack number               87450000
*  DCL XSF_SFI_GRK_ID    BIT(24) CONSTANT('838000'X);                   87450100
*  DCL XSF_GRK_LENGTH    BIT(16) CONSTANT('000E'X);                     87450200
*  DCL XSF_GRK_DTYPE     BIT(8)  CONSTANT('01'X);                       87450300
*/********************************************************************/         
*  DCL XSF_SFI_HSKP     BIT(64) CONSTANT('0009839600000003'X);   ]@L12A         
*                                   ] Housekeeping flag           @L12A         
*  DCL XSF_SFI_HSKP_ID   BIT(24) CONSTANT('839600'X);            ]@L12A         
*  DCL XSF_HSKP_LENGTH   BIT(16) CONSTANT('0009'X);              ]@L12A         
*  DCL XSF_HSKP_DTYPE    BIT(8)  CONSTANT('03'X);                ]@L12A         
*                                                                ]@L12A         
*  DCL XSF_HSKP_DATA_NO                  BIN(8) CONSTANT('00'X); ]@L12A         
*  DCL XSF_HSKP_DATA_YES                 BIN(8) CONSTANT('01'X); ]@L12A         
*/********************************************************************/ 87450400
*  DCL XSF_SFI_HLD     BIT(64) CONSTANT('0009838F40000003'X);    ] @O0A 87450500
*                                   ] Volume HOLD attribute        @O0A 87450600
*  DCL XSF_SFI_HLD_ID   BIT(24) CONSTANT('838F40'X);             ] @O0A 87450700
*  DCL XSF_HLD_LENGTH   BIT(16) CONSTANT('0009'X);               ] @O0A 87450800
*  DCL XSF_HLD_DTYPE    BIT(8)  CONSTANT('03'X);                 ] @O0A 87450900
*                                                                ] @O0A 87451000
*  DCL XSF_HLD_DATA_NO                  BIN(8) CONSTANT('00'X);  ] @O0A 87451100
*  DCL XSF_HLD_DATA_YES                 BIN(8) CONSTANT('01'X);  ] @O0A 87451200
*/********************************************************************/ 87451300
*  DCL XSF_SFI_HLOC    BIT(64) CONSTANT('0010839000000007'X);           87451400
*                                   ] Home location                     87451500
*  DCL XSF_SFI_HLOC_ID   BIT(24) CONSTANT('839000'X);                   87451600
*  DCL XSF_HLOC_LENGTH   BIT(16) CONSTANT('0010'X);                     87451700
*  DCL XSF_HLOC_DTYPE    BIT(8)  CONSTANT('07'X);                       87451800
*/********************************************************************/ 87451900
*  DCL XSF_SFI_HLOT    BIT(64) CONSTANT('0009839200000003'X);    ] @SCA 87452000
*                                   ] Home location type           @SCA 87452100
*  DCL XSF_SFI_HLOT_ID   BIT(24) CONSTANT('839200'X);            ] @SCA 87452200
*  DCL XSF_HLOT_LENGTH   BIT(16) CONSTANT('0009'X);              ] @SCA 87452300
*  DCL XSF_HLOT_DTYPE    BIT(8)  CONSTANT('03'X);                ] @SCA 87452400
*                                                                ] @SCA 87452500
*  DCL XSF_HLOT_DATA_SHELF              BIN(8) CONSTANT('00'X);  ] @SCA 87452600
*  DCL XSF_HLOT_DATA_MANUAL             BIN(8) CONSTANT('02'X);  ] @SCA 87452700
*  DCL XSF_HLOT_DATA_AUTO               BIN(8) CONSTANT('03'X);  ] @SCA 87452800
*/********************************************************************/ 87452900
*  DCL XSF_SFI_INTR    BIT(64) CONSTANT('000983A000000003'X);           87453000
*                                   ] Volume intransit status           87453100
*  DCL XSF_SFI_INTR_ID   BIT(24) CONSTANT('83A000'X);                   87453200
*  DCL XSF_INTR_LENGTH   BIT(16) CONSTANT('0009'X);                     87453300
*  DCL XSF_INTR_DTYPE    BIT(8)  CONSTANT('03'X);                       87453400
*                                                                       87453500
*  DCL XSF_INTR_DATA_NO         BIN(8) CONSTANT('00'X);                 87453600
*  DCL XSF_INTR_DATA_YES        BIN(8) CONSTANT('01'X);                 87453700
*/********************************************************************/ 87453800
*  DCL XSF_SFI_IPL     BIT(64) CONSTANT('000983B000000003'X);           87453900
*                                   ] Data check required in IPL?       87454000
*  DCL XSF_SFI_IPL_ID    BIT(24) CONSTANT('83B000'X);                   87454100
*  DCL XSF_IPL_LENGTH    BIT(16) CONSTANT('0009'X);                     87454200
*  DCL XSF_IPL_DTYPE     BIT(8)  CONSTANT('03'X);                       87454300
*                                                                       87454400
*  DCL XSF_IPL_DATA_NO          BIN(8) CONSTANT('00'X);                 87454500
*  DCL XSF_IPL_DATA_YES         BIN(8) CONSTANT('01'X);                 87454600
*/********************************************************************/ 87454700
*  DCL XSF_SFI_IRMM    BIT(64) CONSTANT('000983B830000003'X);    ] @10A 87454800
*                                   ] IRMM use                     @10A 87454900
*  DCL XSF_SFI_IRMM_ID   BIT(24) CONSTANT('83B830'X);            ] @10A 87455000
*  DCL XSF_IRMM_LENGTH   BIT(16) CONSTANT('0009'X);              ] @10A 87455100
*  DCL XSF_IRMM_DTYPE    BIT(8)  CONSTANT('03'X);                ] @10A 87455200
*                                                                ] @10A 87455300
*  DCL XSF_IRMM_DATA_NO         BIN(8) CONSTANT('00'X);          ] @10A 87455400
*  DCL XSF_IRMM_DATA_YES        BIN(8) CONSTANT('01'X);          ] @10A 87455500
*/********************************************************************/ 87455600
*  DCL XSF_SFI_ITL     BIT(64) CONSTANT('001083C000000007'X);           87455700
*                                   ] Owner's internal phone number     87455800
*  DCL XSF_SFI_ITL_ID    BIT(24) CONSTANT('83C000'X);                   87455900
*  DCL XSF_ITL_LENGTH    BIT(16) CONSTANT('0010'X);                     87456000
*  DCL XSF_ITL_DTYPE     BIT(8)  CONSTANT('07'X);                       87456100
*/********************************************************************/ 87456200
*  DCL XSF_SFI_JBDT     BIT(64) CONSTANT('000C83CA00000009'X);   ] @LRA 87456300
*                                   ] Last journal backup date     @LRA 87456400
*  DCL XSF_SFI_JBDT_ID  BIT(24) CONSTANT('83CA00'X);             ] @LRA 87456500
*  DCL XSF_JBDT_LENGTH  BIT(16) CONSTANT('000C'X);               ] @LRA 87456600
*  DCL XSF_JBDT_DTYPE   BIT(8)  CONSTANT('09'X);                 ] @LRA 87456700
*/********************************************************************/ 87456800
*  DCL XSF_SFI_JBTM     BIT(64) CONSTANT('000C83CB0000000A'X);   ] @LRA 87456900
*                                   ] Last journal backup time     @LRA 87457000
*  DCL XSF_SFI_JBTM_ID  BIT(24) CONSTANT('83CB00'X);             ] @LRA 87457100
*  DCL XSF_JBTM_LENGTH  BIT(16) CONSTANT('000C'X);               ] @LRA 87457200
*  DCL XSF_JBTM_DTYPE   BIT(8)  CONSTANT('0A'X);                 ] @LRA 87457300
*/********************************************************************/ 87457400
*  DCL XSF_SFI_JDS     BIT(64) CONSTANT('003483D000000007'X);           87457500
*                                   ] Journal name                      87457600
*  DCL XSF_SFI_JDS_ID    BIT(24) CONSTANT('83D000'X);                   87457700
*  DCL XSF_JDS_LENGTH    BIT(16) CONSTANT('0034'X);                     87457800
*  DCL XSF_JDS_DTYPE     BIT(8)  CONSTANT('07'X);                       87457900
*/********************************************************************/ 87458000
*  DCL XSF_SFI_JRNF    BIT(64) CONSTANT('000A83E000000004'X);           87458100
*                                   ] JOURNALFULL parmlib value         87458200
*  DCL XSF_SFI_JRNF_ID   BIT(24) CONSTANT('83E000'X);                   87458300
*  DCL XSF_JRNF_LENGTH   BIT(16) CONSTANT('000A'X);                     87458400
*  DCL XSF_JRNF_DTYPE    BIT(8)  CONSTANT('04'X);                       87458500
*/********************************************************************/ 87458600
*  DCL XSF_SFI_JRNS    BIT(64) CONSTANT('000983EA00000003'X);    ] @LRA 87458700
*                                   ] Journal status               @LRA 87458800
*  DCL XSF_SFI_JRNS_ID   BIT(24) CONSTANT('83EA00'X);            ] @LRA 87458900
*  DCL XSF_JRNS_LENGTH   BIT(16) CONSTANT('0009'X);              ] @LRA 87459000
*  DCL XSF_JRNS_DTYPE    BIT(8)  CONSTANT('03'X);                ] @LRA 87459100
*                                                                ] @LRA 87459200
*  DCL XSF_JRNS_DISABLED BIT(8) CONSTANT('00'X);                 ] @LRA 87459300
*  DCL XSF_JRNS_ENABLED  BIT(8) CONSTANT('01'X);                 ] @LRA 87459400
*  DCL XSF_JRNS_LOCKED   BIT(8) CONSTANT('02'X);                 ] @LRA 87459500
*/********************************************************************/ 87459600
*  DCL XSF_SFI_JRNT    BIT(64) CONSTANT('000983ED00000003'X);    ] @NBA 87459700
*                                   ] Journal transaction          @NBA 87459800
*  DCL XSF_SFI_JRNT_ID   BIT(24) CONSTANT('83ED00'X);            ] @NBA 87459900
*  DCL XSF_JRNT_LENGTH   BIT(16) CONSTANT('0009'X);              ] @NBA 87460000
*  DCL XSF_JRNT_DTYPE    BIT(8)  CONSTANT('03'X);                ] @NBA 87460100
*                                                                ] @NBA 87460200
*  DCL XSF_JRNT_DATA_NO         BIN(8) CONSTANT('00'X);          ] @NBA 87460300
*  DCL XSF_JRNT_DATA_YES        BIN(8) CONSTANT('01'X);          ] @NBA 87460400
*/********************************************************************/ 87460500
*  DCL XSF_SFI_JRNU    BIT(64) CONSTANT('000A83F000000004'X);           87460600
*                                   ] Journal percentage used           87460700
*  DCL XSF_SFI_JRNU_ID   BIT(24) CONSTANT('83F000'X);                   87460800
*  DCL XSF_JRNU_LENGTH   BIT(16) CONSTANT('000A'X);                     87460900
*  DCL XSF_JRNU_DTYPE    BIT(8)  CONSTANT('04'X);                       87461000
*/********************************************************************/ 87461100
*  DCL XSF_SFI_KEL1    BIT(64) CONSTANT('004883F500000007'X);    ] @SJA 87461200
*                                   ] Encryption key label 1       @SJA 87461300
*  DCL XSF_SFI_KEL1_ID   BIT(24) CONSTANT('83F500'X);            ] @SJA 87461400
*  DCL XSF_KEL1_LENGTH   BIT(16) CONSTANT('0048'X);              ] @SJA 87461500
*  DCL XSF_KEL1_DTYPE    BIT(8)  CONSTANT('07'X);                ] @SJA 87461600
*/********************************************************************/ 87461700
*  DCL XSF_SFI_KEL2    BIT(64) CONSTANT('004883F505000007'X);    ] @SJA 87461800
*                                   ] Encryption key label 2       @SJA 87461900
*  DCL XSF_SFI_KEL2_ID   BIT(24) CONSTANT('83F505'X);            ] @SJA 87462000
*  DCL XSF_KEL2_LENGTH   BIT(16) CONSTANT('0048'X);              ] @SJA 87462100
*  DCL XSF_KEL2_DTYPE    BIT(8)  CONSTANT('07'X);                ] @SJA 87462200
*/********************************************************************/ 87462300
*  DCL XSF_SFI_KEM1    BIT(64) CONSTANT('000D83F520000007'X);    ] @SJA 87462400
*                                   ] Encoding mechanism 1         @SJA 87462500
*  DCL XSF_SFI_KEM1_ID   BIT(24) CONSTANT('83F520'X);            ] @SJA 87462600
*  DCL XSF_KEM1_LENGTH   BIT(16) CONSTANT('000D'X);              ] @SJA 87462700
*  DCL XSF_KEM1_DTYPE    BIT(8)  CONSTANT('07'X);                ] @SJA 87462800
*/********************************************************************/ 87462900
*  DCL XSF_SFI_KEM2    BIT(64) CONSTANT('000D83F525000007'X);    ] @SJA 87463000
*                                   ] Encoding mechanism 2         @SJA 87463100
*  DCL XSF_SFI_KEM2_ID   BIT(24) CONSTANT('83F525'X);            ] @SJA 87463200
*  DCL XSF_KEM2_LENGTH   BIT(16) CONSTANT('000D'X);              ] @SJA 87463300
*  DCL XSF_KEM2_DTYPE    BIT(8)  CONSTANT('07'X);                ] @SJA 87463400
*/********************************************************************/ 87463500
*  DCL XSF_SFI_LBL     BIT(64) CONSTANT('0009840000000002'X);           87463600
*                                   ] Volume label                      87463700
*  DCL XSF_SFI_LBL_ID    BIT(24) CONSTANT('840000'X);                   87463800
*  DCL XSF_LBL_LENGTH    BIT(16) CONSTANT('0009'X);                     87463900
*  DCL XSF_LBL_DTYPE     BIT(8)  CONSTANT('02'X);                       87464000
*                                                                       87464100
*  DCL XSF_LBL_FLAG_NL         BIT(8) CONSTANT('20'X);                  87464200
*  DCL XSF_LBL_FLAG_AL         BIT(8) CONSTANT('10'X);                  87464300
*  DCL XSF_LBL_FLAG_SL         BIT(8) CONSTANT('08'X);                  87464400
*  DCL XSF_LBL_FLAG_BLP        BIT(8) CONSTANT('02'X);                  87464500
*  DCL XSF_LBL_FLAG_UL         BIT(8) CONSTANT('01'X);                  87464600
*/********************************************************************/ 87464700
*  DCL XSF_SFI_LBN     BIT(64) CONSTANT('000C841000000005'X);           87464800
*                                   ] Bin numbers in LOCAL              87464900
*  DCL XSF_SFI_LBN_ID    BIT(24) CONSTANT('841000'X);                   87465000
*  DCL XSF_LBN_LENGTH    BIT(16) CONSTANT('000C'X);                     87465100
*  DCL XSF_LBN_DTYPE     BIT(8)  CONSTANT('05'X);                       87465200
*/********************************************************************/ 87465300
*  DCL XSF_SFI_LCDJ    BIT(64) CONSTANT('000C841500000009'X);    ] @OBA 87465400
*                                   ] Last Change Date             @OBA 87465500
*  DCL XSF_SFI_LCDJ_ID    BIT(24) CONSTANT('841500'X);           ] @OBA 87465600
*  DCL XSF_LCDJ_LENGTH    BIT(16) CONSTANT('000C'X);             ] @OBA 87465700
*  DCL XSF_LCDJ_DTYPE     BIT(8)  CONSTANT('09'X);               ] @OBA 87465800
*/********************************************************************/ 87465900
*  DCL XSF_SFI_LCID    BIT(64) CONSTANT('0010842000000007'X);           87466000
*                                   ] Last change user ID               87466100
*  DCL XSF_SFI_LCID_ID   BIT(24) CONSTANT('842000'X);                   87466200
*  DCL XSF_LCID_LENGTH   BIT(16) CONSTANT('0010'X);                     87466300
*  DCL XSF_LCID_DTYPE    BIT(8)  CONSTANT('07'X);                       87466400
*/********************************************************************/ 87466500
*  DCL XSF_SFI_LCSI    BIT(64) CONSTANT('0010842500000007'X);    ] @OBA 87466600
*                                   ] Last change system ID        @OBA 87466700
*  DCL XSF_SFI_LCSI_ID   BIT(24) CONSTANT('842500'X);            ] @OBA 87466800
*  DCL XSF_LCSI_LENGTH   BIT(16) CONSTANT('0010'X);              ] @OBA 87466900
*  DCL XSF_LCSI_DTYPE    BIT(8)  CONSTANT('07'X);                ] @OBA 87467000
*/********************************************************************/ 87467100
*  DCL XSF_SFI_LCT     BIT(64) CONSTANT('000A843000000004'X);           87467200
*                                   ] Default lines per page            87467300
*  DCL XSF_SFI_LCT_ID    BIT(24) CONSTANT('843000'X);                   87467400
*  DCL XSF_LCT_LENGTH    BIT(16) CONSTANT('000A'X);                     87467500
*  DCL XSF_LCT_DTYPE     BIT(8)  CONSTANT('04'X);                       87467600
*/********************************************************************/ 87467700
*  DCL XSF_SFI_LCTK    BIT(64) CONSTANT('000C843100000005'X);    ] @LUA 87467800
*                                   ] Local tasks                  @LUA 87467900
*  DCL XSF_SFI_LCTK_ID   BIT(24) CONSTANT('843100'X);            ] @LUA 87468000
*  DCL XSF_LCTK_LENGTH   BIT(16) CONSTANT('000C'X);              ] @LUA 87468100
*  DCL XSF_LCTK_DTYPE    BIT(8)  CONSTANT('05'X);                ] @LUA 87468200
*/********************************************************************/ 87468300
*  DCL XSF_SFI_LCTM    BIT(64) CONSTANT('000C84350000000A'X);    ] @OBA 87468400
*                                   ] Last change time             @OBA 87468500
*  DCL XSF_SFI_LCTM_ID   BIT(24) CONSTANT('843500'X);            ] @OBA 87468600
*  DCL XSF_LCTM_LENGTH   BIT(16) CONSTANT('000C'X);              ] @OBA 87468700
*  DCL XSF_LCTM_DTYPE    BIT(8)  CONSTANT('0A'X);                ] @OBA 87468800
*/********************************************************************/ 87468900
*  DCL XSF_SFI_LCUD    BIT(64) CONSTANT('000C843600000009'X);    ] @OBA 87469000
*                                   ] Last "user" change date      @OBA 87469100
*  DCL XSF_SFI_LCUD_ID   BIT(24) CONSTANT('843600'X);            ] @OBA 87469200
*  DCL XSF_LCUD_LENGTH   BIT(16) CONSTANT('000C'X);              ] @OBA 87469300
*  DCL XSF_LCUD_DTYPE    BIT(8)  CONSTANT('09'X);                ] @OBA 87469400
*/********************************************************************/ 87469500
*  DCL XSF_SFI_LCUT    BIT(64) CONSTANT('000C84370000000A'X);    ] @OBA 87469600
*                                   ] Last "user" change time      @OBA 87469700
*  DCL XSF_SFI_LCUT_ID   BIT(24) CONSTANT('843700'X);            ] @OBA 87469800
*  DCL XSF_LCUT_LENGTH   BIT(16) CONSTANT('000C'X);              ] @OBA 87469900
*  DCL XSF_LCUT_DTYPE    BIT(8)  CONSTANT('0A'X);                ] @OBA 87470000
*/********************************************************************/ 87470100
*  DCL XSF_SFI_LDD       BIT(64) CONSTANT('0010843B00000001'X);  ] @02A 87470200
*                                   ] Last used DD name            @02A 87470300
*  DCL XSF_SFI_LDD_ID    BIT(24) CONSTANT('843B00'X);            ] @02A 87470400
*  DCL XSF_LDD_LENGTH    BIT(16) CONSTANT('0010'X);              ] @02A 87470500
*  DCL XSF_LDD_DTYPE     BIT(8)  CONSTANT('01'X);                ] @02A 87470600
*/********************************************************************/ 87470700
*  DCL XSF_SFI_LDDF    BIT(64) CONSTANT('0009844000000003'X);           87470800
*                                   ] Location definition exists        87470900
*  DCL XSF_SFI_LDDF_ID   BIT(24) CONSTANT('844000'X);                   87471000
*  DCL XSF_LDDF_LENGTH   BIT(16) CONSTANT('0009'X);                     87471100
*  DCL XSF_LDDF_DTYPE    BIT(8)  CONSTANT('03'X);                       87471200
*                                                                       87471300
*  DCL XSF_LDDF_DATA_NO         BIN(8) CONSTANT('00'X);                 87471400
*  DCL XSF_LDDF_DATA_YES        BIN(8) CONSTANT('01'X);                 87471500
*/********************************************************************/ 87471600
*  DCL XSF_SFI_LDEV    BIT(64) CONSTANT('000C845000000001'X);           87471700
*                                   ] Last drive                        87471800
*  DCL XSF_SFI_LDEV_ID   BIT(24) CONSTANT('845000'X);                   87471900
*  DCL XSF_LDEV_LENGTH   BIT(16) CONSTANT('000C'X);                     87472000
*  DCL XSF_LDEV_DTYPE    BIT(8)  CONSTANT('01'X);                       87472100
*/********************************************************************/ 87472200
*  DCL XSF_SFI_LDLC    BIT(64) CONSTANT('0010846000000007'X);           87472300
*                                   ] Location name                     87472400
*  DCL XSF_SFI_LDLC_ID   BIT(24) CONSTANT('846000'X);                   87472500
*  DCL XSF_LDLC_LENGTH   BIT(16) CONSTANT('0010'X);                     87472600
*  DCL XSF_LDLC_DTYPE    BIT(8)  CONSTANT('07'X);                       87472700
*/********************************************************************/ 87472800
*  DCL XSF_SFI_LDLT    BIT(64) CONSTANT('0009847000000003'X);           87472900
*                                   ] Location type                     87473000
*  DCL XSF_SFI_LDLT_ID   BIT(24) CONSTANT('847000'X);                   87473100
*  DCL XSF_LDLT_LENGTH   BIT(16) CONSTANT('0009'X);                     87473200
*  DCL XSF_LDLT_DTYPE    BIT(8)  CONSTANT('03'X);                       87473300
*                                                                       87473400
*  DCL XSF_LDLT_DATA_SHELF      BIN(8) CONSTANT('00'X);                 87473500
*  DCL XSF_LDLT_DATA_AUTO       BIN(8) CONSTANT('01'X);                 87473600
*  DCL XSF_LDLT_DATA_MANUAL     BIN(8) CONSTANT('02'X);                 87473700
*  DCL XSF_LDLT_DATA_STORE      BIN(8) CONSTANT('03'X);                 87473800
*  DCL XSF_LDLT_DATA_HSTORE     BIN(8) CONSTANT('04'X);          ] @05A 87473900
*/********************************************************************/ 87474000
*  DCL XSF_SFI_LDMN    BIT(64) CONSTANT('0010848000000007'X);           87474100
*                                   ] Location media name               87474200
*  DCL XSF_SFI_LDMN_ID   BIT(24) CONSTANT('848000'X);                   87474300
*  DCL XSF_LDMN_LENGTH   BIT(16) CONSTANT('0010'X);                     87474400
*  DCL XSF_LDMN_DTYPE    BIT(8)  CONSTANT('07'X);                       87474500
*/********************************************************************/ 87474600
*  DCL XSF_SFI_LDMT    BIT(64) CONSTANT('0009849000000003'X);           87474700
*                                   ] Location management type          87474800
*  DCL XSF_SFI_LDMT_ID   BIT(24) CONSTANT('849000'X);                   87474900
*  DCL XSF_LDMT_LENGTH   BIT(16) CONSTANT('0009'X);                     87475000
*  DCL XSF_LDMT_DTYPE    BIT(8)  CONSTANT('03'X);                       87475100
*                                                                       87475200
*  DCL XSF_LDMT_DATA_UNDEFINED  BIN(8) CONSTANT('00'X);                 87475300
*  DCL XSF_LDMT_DATA_BIN        BIN(8) CONSTANT('01'X);                 87475400
*  DCL XSF_LDMT_DATA_NOBINS     BIN(8) CONSTANT('02'X);                 87475500
*/********************************************************************/ 87475600
*  DCL XSF_SFI_LDPR    BIT(64) CONSTANT('000C84A000000005'X);           87475700
*                                   ] Location priority                 87475800
*  DCL XSF_SFI_LDPR_ID   BIT(24) CONSTANT('84A000'X);                   87475900
*  DCL XSF_LDPR_LENGTH   BIT(16) CONSTANT('000C'X);                     87476000
*  DCL XSF_LDPR_DTYPE    BIT(8)  CONSTANT('05'X);                       87476100
*/********************************************************************/ 87476200
*  DCL XSF_SFI_LDAM    BIT(64) CONSTANT('000984A100000003'X);    ] @O7A 87476300
*                                   ] Location Automove            @O7A 87476400
*  DCL XSF_SFI_LDAM_ID   BIT(24) CONSTANT('84A100'X);            ] @O7A 87476500
*  DCL XSF_LDAM_LENGTH   BIT(16) CONSTANT('0009'X);              ] @O7A 87476600
*  DCL XSF_LDAM_DTYPE    BIT(8)  CONSTANT('03'X);                ] @O7A 87476700
*                                                                       87476800
*  DCL XSF_LDAM_DATA_NO         BIN(8) CONSTANT('00'X);          ] @O7A 87476900
*  DCL XSF_LDAM_DATA_YES        BIN(8) CONSTANT('01'X);          ] @O7A 87477000
*/********************************************************************/ 87477100
*  DCL XSF_SFI_LINE    BIT(64) CONSTANT('000884B000000007'X);           87477200
*                                   ] Output data line                  87477300
*  DCL XSF_SFI_LINE_ID   BIT(24) CONSTANT('84B000'X);                   87477400
*  DCL XSF_LINE_LENGTH   BIT(16) CONSTANT('0008'X);                     87477500
*  DCL XSF_LINE_DTYPE    BIT(8)  CONSTANT('07'X);                       87477600
*/********************************************************************/ 87477700
*  DCL XSF_SFI_LJOB      BIT(64) CONSTANT('001084B420000001'X);  ] @02A 87477800
*                                   ] Last used job name           @02A 87477900
*  DCL XSF_SFI_LJOB_ID   BIT(24) CONSTANT('84B420'X);            ] @02A 87478000
*  DCL XSF_LJOB_LENGTH   BIT(16) CONSTANT('0010'X);              ] @02A 87478100
*  DCL XSF_LJOB_DTYPE    BIT(8)  CONSTANT('01'X);                ] @02A 87478200
*/********************************************************************/ 87478300
*  DCL XSF_SFI_LOAN    BIT(64) CONSTANT('001084C000000007'X);           87478400
*                                   ] Loan location                     87478500
*  DCL XSF_SFI_LOAN_ID   BIT(24) CONSTANT('84C000'X);                   87478600
*  DCL XSF_LOAN_LENGTH   BIT(16) CONSTANT('0010'X);                     87478700
*  DCL XSF_LOAN_DTYPE    BIT(8)  CONSTANT('07'X);                       87478800
*/********************************************************************/ 87478900
*  DCL XSF_SFI_LOC     BIT(64) CONSTANT('001084D000000007'X);           87479000
*                                   ] Location                          87479100
*  DCL XSF_SFI_LOC_ID    BIT(24) CONSTANT('84D000'X);                   87479200
*  DCL XSF_LOC_LENGTH    BIT(16) CONSTANT('0010'X);                     87479300
*  DCL XSF_LOC_DTYPE     BIT(8)  CONSTANT('07'X);                       87479400
*/********************************************************************/ 87479500
*  DCL XSF_SFI_LOCT    BIT(64) CONSTANT('000984E000000003'X);           87479600
*                                   ] Location type                     87479700
*  DCL XSF_SFI_LOCT_ID   BIT(24) CONSTANT('84E000'X);                   87479800
*  DCL XSF_LOCT_LENGTH   BIT(16) CONSTANT('0009'X);                     87479900
*  DCL XSF_LOCT_DTYPE    BIT(8)  CONSTANT('03'X);                       87480000
*                                                                       87480100
*  DCL XSF_LOCT_DATA_SHELF              BIN(8) CONSTANT('00'X);         87480200
*  DCL XSF_LOCT_DATA_STORE_BUILTIN_BINS BIN(8) CONSTANT('01'X);         87480300
*  DCL XSF_LOCT_DATA_MANUAL             BIN(8) CONSTANT('02'X);         87480400
*  DCL XSF_LOCT_DATA_AUTO               BIN(8) CONSTANT('03'X);         87480500
*  DCL XSF_LOCT_DATA_STORE_BINS         BIN(8) CONSTANT('04'X);         87480600
*  DCL XSF_LOCT_DATA_STORE_NOBINS       BIN(8) CONSTANT('05'X);         87480700
*  DCL XSF_LOCT_DATA_INCTNR             BIN(8) CONSTANT('06'X);  ] @LGA 87480800
*/********************************************************************/ 87480900
*  DCL XSF_SFI_LPGM      BIT(64) CONSTANT('001084E760000001'X);  ] @02A 87481000
*                                   ] Last used program name       @02A 87481100
*  DCL XSF_SFI_LPGM_ID   BIT(24) CONSTANT('84E760'X);            ] @02A 87481200
*  DCL XSF_LPGM_LENGTH   BIT(16) CONSTANT('0010'X);              ] @02A 87481300
*  DCL XSF_LPGM_DTYPE    BIT(8)  CONSTANT('01'X);                ] @02A 87481400
*/********************************************************************/ 87481500
*  DCL XSF_SFI_LRCL    BIT(64) CONSTANT('000C84F000000005'X);           87481600
*                                   ] Logical record length             87481700
*  DCL XSF_SFI_LRCL_ID   BIT(24) CONSTANT('84F000'X);                   87481800
*  DCL XSF_LRCL_LENGTH   BIT(16) CONSTANT('000C'X);                     87481900
*  DCL XSF_LRCL_DTYPE    BIT(8)  CONSTANT('05'X);                       87482000
*/********************************************************************/ 87482100
*  DCL XSF_SFI_LRED    BIT(64) CONSTANT('000C84F800000005'X);    ] @OQA 87482200
*                                   ] LASTREF extra days           @OQA 87482300
*  DCL XSF_SFI_LRED_ID   BIT(24) CONSTANT('84F800'X);            ] @OQA 87482400
*  DCL XSF_LRED_LENGTH   BIT(16) CONSTANT('000C'X);              ] @OQA 87482500
*  DCL XSF_LRED_DTYPE    BIT(8)  CONSTANT('05'X);                ] @OQA 87482600
*/********************************************************************/ 87482700
*  DCL XSF_SFI_LRK     BIT(64) CONSTANT('000C850000000005'X);           87482800
*                                   ] Number of library rack numbers    87482900
*  DCL XSF_SFI_LRK_ID    BIT(24) CONSTANT('850000'X);                   87483000
*  DCL XSF_LRK_LENGTH    BIT(16) CONSTANT('000C'X);                     87483100
*  DCL XSF_LRK_DTYPE     BIT(8)  CONSTANT('05'X);                       87483200
*/********************************************************************/ 87483300
*  DCL XSF_SFI_LSTP      BIT(64) CONSTANT('0010850370000001'X);  ] @02A 87483400
*                                   ] Last used step name          @02A 87483500
*  DCL XSF_SFI_LSTP_ID   BIT(24) CONSTANT('850370'X);            ] @02A 87483600
*  DCL XSF_LSTP_LENGTH   BIT(16) CONSTANT('0010'X);              ] @02A 87483700
*  DCL XSF_LSTP_DTYPE    BIT(8)  CONSTANT('01'X);                ] @02A 87483800
*/********************************************************************/ 87483900
*  DCL XSF_SFI_LVC     BIT(64) CONSTANT('0009850500000003'X);    ] @K1A 87484000
*                                   ] Current label version        @K1A 87484100
*  DCL XSF_SFI_LVC_ID        BIT(24) CONSTANT('850500'X);        ] @K1A 87484200
*  DCL XSF_LVC_LENGTH        BIT(16) CONSTANT('0009'X);          ] @K1A 87484300
*  DCL XSF_LVC_DTYPE         BIT(8)  CONSTANT('03'X);            ] @K1A 87484400
*                                                                ] @K1A 87484500
*  DCL XSF_LVC_DATA_NO       BIN(8) CONSTANT('00'X);             ] @K1A 87484600
*  DCL XSF_LVC_DATA_VERSION1 BIN(8) CONSTANT('01'X);             ] @K1A 87484700
*  DCL XSF_LVC_DATA_VERSION3 BIN(8) CONSTANT('03'X);             ] @K1A 87484800
*  DCL XSF_LVC_DATA_VERSION4 BIN(8) CONSTANT('04'X);             ] @K1A 87484900
*/********************************************************************/ 87485000
*  DCL XSF_SFI_LVN     BIT(64) CONSTANT('0009850A00000003'X);    ] @K1A 87485100
*                                   ] Required label version       @K1A 87485200
*  DCL XSF_SFI_LVN_ID        BIT(24) CONSTANT('850A00'X);        ] @K1A 87485300
*  DCL XSF_LVN_LENGTH        BIT(16) CONSTANT('0009'X);          ] @K1A 87485400
*  DCL XSF_LVN_DTYPE         BIT(8)  CONSTANT('03'X);            ] @K1A 87485500
*                                                                ] @K1A 87485600
*  DCL XSF_LVN_DATA_NO       BIN(8) CONSTANT('00'X);             ] @K1A 87485700
*  DCL XSF_LVN_DATA_VERSION3 BIN(8) CONSTANT('03'X);             ] @K1A 87485800
*  DCL XSF_LVN_DATA_VERSION4 BIN(8) CONSTANT('04'X);             ] @K1A 87485900
*/********************************************************************/ 87486000
*  DCL XSF_SFI_MC      BIT(64) CONSTANT('0010851000000007'X);           87486100
*                                   ] Management class                  87486200
*  DCL XSF_SFI_MC_ID     BIT(24) CONSTANT('851000'X);                   87486300
*  DCL XSF_MC_LENGTH     BIT(16) CONSTANT('0010'X);                     87486400
*  DCL XSF_MC_DTYPE      BIT(8)  CONSTANT('07'X);                       87486500
*/********************************************************************/ 87486600
*  DCL XSF_SFI_MCAT    BIT(64) CONSTANT('0009851200000003'X);    ] @OVA 87486700
*                                   ] Management class attributes  @OVA 87486800
*  DCL XSF_SFI_MCAT_ID   BIT(24) CONSTANT('851200'X);            ] @OVA 87486900
*  DCL XSF_MCAT_LENGTH   BIT(16) CONSTANT('0009'X);              ] @OVA 87487000
*  DCL XSF_MCAT_DTYPE    BIT(8)  CONSTANT('03'X);                ] @OVA 87487100
*  DCL XSF_MCAT_DATA_NONE     BIN(8) CONSTANT('00'X);            ] @OVA 87487200
*  DCL XSF_MCAT_DATA_ALL      BIN(8) CONSTANT('01'X);            ] @OVA 87487300
*  DCL XSF_MCAT_DATA_VRSELXDI BIN(8) CONSTANT('02'X);            ] @OVA 87487400
*/********************************************************************/ 87487500
*  DCL XSF_SFI_MDNF    BIT(64) CONSTANT('0010851400000001'X);    ] @07A 87487600
*                                   ] Media information name       @07A 87487700
*  DCL XSF_SFI_MDNF_ID   BIT(24) CONSTANT('851400'X);            ] @07A 87487800
*  DCL XSF_MDNF_LENGTH   BIT(16) CONSTANT('0010'X);              ] @07A 87487900
*  DCL XSF_MDNF_DTYPE    BIT(8)  CONSTANT('01'X);                ] @07A 87488000
*/********************************************************************/ 87488100
*  DCL XSF_SFI_MDRA    BIT(64) CONSTANT('000C851980000005'X);    ] @MYA 87488200
*                                   ] Replace policy for age            87488300
*  DCL XSF_SFI_MDRA_ID   BIT(24) CONSTANT('851980'X);            ] @MYA 87488400
*  DCL XSF_MDRA_LENGTH   BIT(16) CONSTANT('000C'X);              ] @MYA 87488500
*  DCL XSF_MDRA_DTYPE    BIT(8)  CONSTANT('05'X);                ] @MYA 87488600
*/********************************************************************/ 87488700
*  DCL XSF_SFI_MDRP    BIT(64) CONSTANT('000C8519C0000005'X);    ] @MYA 87488800
*                                   ] Replace policy for                87488900
*                                   ] permanent errors                  87489000
*  DCL XSF_SFI_MDRP_ID   BIT(24) CONSTANT('8519C0'X);            ] @MYA 87489100
*  DCL XSF_MDRP_LENGTH   BIT(16) CONSTANT('000C'X);              ] @MYA 87489200
*  DCL XSF_MDRP_DTYPE    BIT(8)  CONSTANT('05'X);                ] @MYA 87489300
*/********************************************************************/ 87489400
*  DCL XSF_SFI_MDRT    BIT(64) CONSTANT('000C8519E0000005'X);    ] @MYA 87489500
*                                   ] Replace policy for                87489600
*                                   ] temporary errors                  87489700
*  DCL XSF_SFI_MDRT_ID   BIT(24) CONSTANT('8519E0'X);            ] @MYA 87489800
*  DCL XSF_MDRT_LENGTH   BIT(16) CONSTANT('000C'X);              ] @MYA 87489900
*  DCL XSF_MDRT_DTYPE    BIT(8)  CONSTANT('05'X);                ] @MYA 87490000
*/********************************************************************/ 87490100
*  DCL XSF_SFI_MDRW    BIT(64) CONSTANT('000C8519F0000005'X);    ] @MYA 87490200
*                                   ] Replace policy for                87490300
*                                   ] write mount count                 87490400
*  DCL XSF_SFI_MDRW_ID   BIT(24) CONSTANT('8519F0'X);            ] @MYA 87490500
*  DCL XSF_MDRW_LENGTH   BIT(16) CONSTANT('000C'X);              ] @MYA 87490600
*  DCL XSF_MDRW_DTYPE    BIT(8)  CONSTANT('05'X);                ] @MYA 87490700
*/********************************************************************/ 87490800
*  DCL XSF_SFI_MDRX    BIT(64) CONSTANT('0010851A00000001'X);    ] @07A 87490900
*                                   ] External recording technology     87491000
*  DCL XSF_SFI_MDRX_ID   BIT(24) CONSTANT('851A00'X);            ] @07A 87491100
*  DCL XSF_MDRX_LENGTH   BIT(16) CONSTANT('0010'X);              ] @07A 87491200
*  DCL XSF_MDRX_DTYPE    BIT(8)  CONSTANT('01'X);                ] @07A 87491300
*/********************************************************************/ 87491400
*  DCL XSF_SFI_MDS     BIT(64) CONSTANT('0034852000000007'X);           87491500
*                                   ] CDS data set name                 87491600
*  DCL XSF_SFI_MDS_ID    BIT(24) CONSTANT('852000'X);                   87491700
*  DCL XSF_MDS_LENGTH    BIT(16) CONSTANT('0034'X);                     87491800
*  DCL XSF_MDS_DTYPE     BIT(8)  CONSTANT('07'X);                       87491900
*/********************************************************************/ 87492000
*  DCL XSF_SFI_MDTJ    BIT(64) CONSTANT('000C853000000009'X);           87492100
*                                   ] CDS create date                   87492200
*  DCL XSF_SFI_MDTJ_ID   BIT(24) CONSTANT('853000'X);                   87492300
*  DCL XSF_MDTJ_LENGTH   BIT(16) CONSTANT('000C'X);                     87492400
*  DCL XSF_MDTJ_DTYPE    BIT(8)  CONSTANT('09'X);                       87492500
*/********************************************************************/ 87492600
*  DCL XSF_SFI_MDTX    BIT(64) CONSTANT('0010853400000001'X);    ] @07A 87492700
*                                   ] External media type          @07A 87492800
*  DCL XSF_SFI_MDTX_ID   BIT(24) CONSTANT('853400'X);            ] @07A 87492900
*  DCL XSF_MDTX_LENGTH   BIT(16) CONSTANT('0010'X);              ] @07A 87493000
*  DCL XSF_MDTX_DTYPE    BIT(8)  CONSTANT('01'X);                ] @07A 87493100
*/********************************************************************/ 87493200
*  DCL XSF_SFI_MEDA    BIT(64) CONSTANT('0009854000000003'X);           87493300
*                                   ] Media special attributes          87493400
*  DCL XSF_SFI_MEDA_ID   BIT(24) CONSTANT('854000'X);                   87493500
*  DCL XSF_MEDA_LENGTH   BIT(16) CONSTANT('0009'X);                     87493600
*  DCL XSF_MEDA_DTYPE    BIT(8)  CONSTANT('03'X);                       87493700
*                                                                       87493800
*  DCL XSF_MEDA_DATA_NONE       BIN(8) CONSTANT('00'X);                 87493900
*  DCL XSF_MEDA_DATA_READCOMP   BIN(8) CONSTANT('01'X);                 87494000
*/********************************************************************/ 87494100
*  DCL XSF_SFI_MEDC    BIT(64) CONSTANT('0009855000000003'X);           87494200
*                                   ] Media compaction                  87494300
*  DCL XSF_SFI_MEDC_ID   BIT(24) CONSTANT('855000'X);                   87494400
*  DCL XSF_MEDC_LENGTH   BIT(16) CONSTANT('0009'X);                     87494500
*  DCL XSF_MEDC_DTYPE    BIT(8)  CONSTANT('03'X);                       87494600
*                                                                       87494700
*  DCL XSF_MEDC_DATA_UNDEFINED  BIN(8) CONSTANT('00'X);                 87494800
*  DCL XSF_MEDC_DATA_NO         BIN(8) CONSTANT('01'X);                 87494900
*  DCL XSF_MEDC_DATA_YES        BIN(8) CONSTANT('02'X);                 87495000
*/********************************************************************/ 87495100
*  DCL XSF_SFI_MEDN    BIT(64) CONSTANT('0010856000000007'X);           87495200
*                                   ] Media name                        87495300
*  DCL XSF_SFI_MEDN_ID   BIT(24) CONSTANT('856000'X);                   87495400
*  DCL XSF_MEDN_LENGTH   BIT(16) CONSTANT('0010'X);                     87495500
*  DCL XSF_MEDN_DTYPE    BIT(8)  CONSTANT('07'X);                       87495600
*/********************************************************************/ 87495700
*  DCL XSF_SFI_MEDR    BIT(64) CONSTANT('0009857000000003'X);           87495800
*                                   ] Media recording format            87495900
*  DCL XSF_SFI_MEDR_ID   BIT(24) CONSTANT('857000'X);                   87496000
*  DCL XSF_MEDR_LENGTH   BIT(16) CONSTANT('0009'X);                     87496100
*  DCL XSF_MEDR_DTYPE    BIT(8)  CONSTANT('03'X);                       87496200
*                                                                       87496300
*  DCL XSF_MEDR_DATA_NOTCART    BIN(8) CONSTANT('00'X);          ] @S9C 87496400
*  DCL XSF_MEDR_DATA_18TRK      BIN(8) CONSTANT('01'X);                 87496500
*  DCL XSF_MEDR_DATA_36TRK      BIN(8) CONSTANT('02'X);                 87496600
*  DCL XSF_MEDR_DATA_128TRK     BIN(8) CONSTANT('03'X);                 87496700
*  DCL XSF_MEDR_DATA_256TRK     BIN(8) CONSTANT('04'X);          ] @S9A 87496800
*  DCL XSF_MEDR_DATA_384TRK     BIN(8) CONSTANT('05'X);          ] @SEA 87496900
*  DCL XSF_MEDR_DATA_EFMT1      BIN(8) CONSTANT('06'X);          ] @SFA 87497000
*  DCL XSF_MEDR_DATA_EFMT2      BIN(8) CONSTANT('07'X);          ] @SHA 87497100
*  DCL XSF_MEDR_DATA_EEFMT2     BIN(8) CONSTANT('08'X);          ] @SJA 87497200
*  DCL XSF_MEDR_DATA_EFMT3      BIN(8) CONSTANT('09'X);          ] @SKA 87497300
*  DCL XSF_MEDR_DATA_EEFMT3     BIN(8) CONSTANT('0A'X);          ] @SKA 87497400
*  DCL XSF_MEDR_DATA_EFMT4      BIN(8) CONSTANT('0B'X);          ] @SOA 87497500
*  DCL XSF_MEDR_DATA_EEFMT4     BIN(8) CONSTANT('0C'X);          ] @SOA 87497600
*/********************************************************************/ 87497700
*  DCL XSF_SFI_MEDT    BIT(64) CONSTANT('0009858000000003'X);           87497800
*                                   ] Media type                        87497900
*  DCL XSF_SFI_MEDT_ID   BIT(24) CONSTANT('858000'X);                   87498000
*  DCL XSF_MEDT_LENGTH   BIT(16) CONSTANT('0009'X);                     87498100
*  DCL XSF_MEDT_DTYPE    BIT(8)  CONSTANT('03'X);                       87498200
*                                                                       87498300
*  DCL XSF_MEDT_DATA_UNDEFINED  BIN(8) CONSTANT('00'X);                 87498400
*  DCL XSF_MEDT_DATA_CST        BIN(8) CONSTANT('01'X);                 87498500
*  DCL XSF_MEDT_DATA_ECCST      BIN(8) CONSTANT('02'X);                 87498600
*  DCL XSF_MEDT_DATA_HPCT       BIN(8) CONSTANT('03'X);                 87498700
*  DCL XSF_MEDT_DATA_EHPCT      BIN(8) CONSTANT('04'X);                 87498800
*  DCL XSF_MEDT_DATA_MEDIA5     BIN(8) CONSTANT('05'X);          ] @SFA 87498900
*  DCL XSF_MEDT_DATA_ETC        BIN(8) CONSTANT('05'X);          ] @SGA 87499000
*  DCL XSF_MEDT_DATA_EWTC       BIN(8) CONSTANT('06'X);          ] @SGA 87499100
*  DCL XSF_MEDT_DATA_EETC       BIN(8) CONSTANT('07'X);          ] @SGA 87499200
*  DCL XSF_MEDT_DATA_EEWTC      BIN(8) CONSTANT('08'X);          ] @SGA 87499300
*  DCL XSF_MEDT_DATA_EXTC       BIN(8) CONSTANT('09'X);          ] @SHA 87499400
*  DCL XSF_MEDT_DATA_EXWTC      BIN(8) CONSTANT('0A'X);          ] @SHA 87499500
*  DCL XSF_MEDT_DATA_EATC       BIN(8) CONSTANT('0B'X);          ] @SOA 87499600
*  DCL XSF_MEDT_DATA_EAWTC      BIN(8) CONSTANT('0C'X);          ] @SOA 87499700
*  DCL XSF_MEDT_DATA_EAETC      BIN(8) CONSTANT('0D'X);          ] @SOA 87499800
*/********************************************************************/ 87499900
*  DCL XSF_SFI_MFR     BIT(64) CONSTANT('0010859000000007'X);           87500000
*                                   ] Source location name              87500100
*  DCL XSF_SFI_MFR_ID    BIT(24) CONSTANT('859000'X);                   87500200
*  DCL XSF_MFR_LENGTH    BIT(16) CONSTANT('0010'X);                     87500300
*  DCL XSF_MFR_DTYPE     BIT(8)  CONSTANT('07'X);                       87500400
*/********************************************************************/ 87500500
*  DCL XSF_SFI_MID     BIT(64) CONSTANT('001485A000000007'X);           87500600
*                                   ] Mount message ID                  87500700
*  DCL XSF_SFI_MID_ID    BIT(24) CONSTANT('85A000'X);                   87500800
*  DCL XSF_MID_LENGTH    BIT(16) CONSTANT('0014'X);                     87500900
*  DCL XSF_MID_DTYPE     BIT(8)  CONSTANT('07'X);                       87501000
*/********************************************************************/ 87501100
*  DCL XSF_SFI_MIV     BIT(64) CONSTANT('000E85A500000001'X);    ] @SCA 87501200
*                                   ] Moving-In volume             @SCA 87501300
*  DCL XSF_SFI_MIV_ID    BIT(24) CONSTANT('85A500'X);            ] @SCA 87501400
*  DCL XSF_MIV_LENGTH    BIT(16) CONSTANT('000E'X);              ] @SCA 87501500
*  DCL XSF_MIV_DTYPE     BIT(8)  CONSTANT('01'X);                ] @SCA 87501600
*/********************************************************************/ 87501700
*  DCL XSF_SFI_MOV     BIT(64) CONSTANT('000E85A900000001'X);    ] @SCA 87501800
*                                   ] Moving-Out volume            @SCA 87501900
*  DCL XSF_SFI_MOV_ID    BIT(24) CONSTANT('85A900'X);            ] @SCA 87502000
*  DCL XSF_MOV_LENGTH    BIT(16) CONSTANT('000E'X);              ] @SCA 87502100
*  DCL XSF_MOV_DTYPE     BIT(8)  CONSTANT('01'X);                ] @SCA 87502200
*/********************************************************************/ 87502300
*  DCL XSF_SFI_MOVM    BIT(64) CONSTANT('000985B000000003'X);           87502400
*                                   ] Move mode                         87502500
*  DCL XSF_SFI_MOVM_ID   BIT(24) CONSTANT('85B000'X);                   87502600
*  DCL XSF_MOVM_LENGTH   BIT(16) CONSTANT('0009'X);                     87502700
*  DCL XSF_MOVM_DTYPE    BIT(8)  CONSTANT('03'X);                       87502800
*                                                                       87502900
*  DCL XSF_MOVM_DATA_AUTO       BIN(8) CONSTANT('00'X);                 87503000
*  DCL XSF_MOVM_DATA_MANUAL     BIN(8) CONSTANT('01'X);                 87503100
*/********************************************************************/ 87503200
*  DCL XSF_SFI_MOP     BIT(64) CONSTANT('000985C000000003'X);           87503300
*                                   ] Master overwrite                  87503400
*  DCL XSF_SFI_MOP_ID    BIT(24) CONSTANT('85C000'X);                   87503500
*  DCL XSF_MOP_LENGTH    BIT(16) CONSTANT('0009'X);                     87503600
*  DCL XSF_MOP_DTYPE     BIT(8)  CONSTANT('03'X);                       87503700
*                                                                       87503800
*  DCL XSF_MOP_DATA_ADD         BIN(8) CONSTANT('01'X);                 87503900
*  DCL XSF_MOP_DATA_LAST        BIN(8) CONSTANT('02'X);                 87504000
*  DCL XSF_MOP_DATA_MATCH       BIN(8) CONSTANT('03'X);                 87504100
*  DCL XSF_MOP_DATA_USER        BIN(8) CONSTANT('04'X);                 87504200
*/********************************************************************/ 87504300
*  DCL XSF_SFI_MRP     BIT(64) CONSTANT('000C85D000000005'X);           87504400
*                                   ] Maximum retention period          87504500
*  DCL XSF_SFI_MRP_ID    BIT(24) CONSTANT('85D000'X);                   87504600
*  DCL XSF_MRP_LENGTH    BIT(16) CONSTANT('000C'X);                     87504700
*  DCL XSF_MRP_DTYPE     BIT(8)  CONSTANT('05'X);                       87504800
*/********************************************************************/ 87504900
*  DCL XSF_SFI_MSGF    BIT(64) CONSTANT('000985E000000003'X);           87505000
*                                   ] Case of message text              87505100
*  DCL XSF_SFI_MSGF_ID   BIT(24) CONSTANT('85E000'X);                   87505200
*  DCL XSF_MSGF_LENGTH   BIT(16) CONSTANT('0009'X);                     87505300
*  DCL XSF_MSGF_DTYPE    BIT(8)  CONSTANT('03'X);                       87505400
*                                                                       87505500
*  DCL XSF_MSGF_DATA_MIXED      BIN(8) CONSTANT('00'X);                 87505600
*  DCL XSF_MSGF_DATA_UPPER      BIN(8) CONSTANT('01'X);                 87505700
*/********************************************************************/ 87505800
*  DCL XSF_SFI_MST     BIT(64) CONSTANT('000985F000000003'X);           87505900
*                                   ] Move status                       87506000
*  DCL XSF_SFI_MST_ID    BIT(24) CONSTANT('85F000'X);                   87506100
*  DCL XSF_MST_LENGTH    BIT(16) CONSTANT('0009'X);                     87506200
*  DCL XSF_MST_DTYPE     BIT(8)  CONSTANT('03'X);                       87506300
*                                                                       87506400
*  DCL XSF_MST_DATA_UNKNOWN     BIN(8) CONSTANT('00'X);                 87506500
*  DCL XSF_MST_DATA_PENDING     BIN(8) CONSTANT('01'X);                 87506600
*  DCL XSF_MST_DATA_CONFIRMED   BIN(8) CONSTANT('02'X);                 87506700
*  DCL XSF_MST_DATA_COMPLETE    BIN(8) CONSTANT('03'X);                 87506800
*/********************************************************************/ 87506900
*  DCL XSF_SFI_MTM     BIT(64) CONSTANT('000C86000000000A'X);           87507000
*                                   ] CDS create time                   87507100
*  DCL XSF_SFI_MTM_ID    BIT(24) CONSTANT('860000'X);                   87507200
*  DCL XSF_MTM_LENGTH    BIT(16) CONSTANT('000C'X);                     87507300
*  DCL XSF_MTM_DTYPE     BIT(8)  CONSTANT('0A'X);                       87507400
*/********************************************************************/ 87507500
*  DCL XSF_SFI_MTO     BIT(64) CONSTANT('0010861000000007'X);           87507600
*                                   ] Target location name              87507700
*  DCL XSF_SFI_MTO_ID    BIT(24) CONSTANT('861000'X);                   87507800
*  DCL XSF_MTO_LENGTH    BIT(16) CONSTANT('0010'X);                     87507900
*  DCL XSF_MTO_DTYPE     BIT(8)  CONSTANT('07'X);                       87508000
*/********************************************************************/ 87508100
*  DCL XSF_SFI_MTP     BIT(64) CONSTANT('0009862000000003'X);           87508200
*                                   ] CDS type                          87508300
*  DCL XSF_SFI_MTP_ID    BIT(24) CONSTANT('862000'X);                   87508400
*  DCL XSF_MTP_LENGTH    BIT(16) CONSTANT('0009'X);                     87508500
*  DCL XSF_MTP_DTYPE     BIT(8)  CONSTANT('03'X);                       87508600
*                                                                       87508700
*  DCL XSF_MTP_DATA_MASTER      BIN(8) CONSTANT('00'X);                 87508800
*/********************************************************************/ 87508900
*  DCL XSF_SFI_MTY     BIT(64) CONSTANT('0009862800000003'X);           87509000
*                                   ] Move type                         87509100
*  DCL XSF_SFI_MTY_ID    BIT(24) CONSTANT('862800'X);                   87509200
*  DCL XSF_MTY_LENGTH    BIT(16) CONSTANT('0009'X);                     87509300
*  DCL XSF_MTY_DTYPE     BIT(8)  CONSTANT('03'X);                       87509400
*                                                                       87509500
*  DCL XSF_MTY_DATA_NOTRTS      BIN(8) CONSTANT('00'X);                 87509600
*  DCL XSF_MTY_DATA_RTS         BIN(8) CONSTANT('01'X);                 87509700
*/********************************************************************/ 87509800
*  DCL XSF_SFI_MVBY       BIT(64) CONSTANT('0009862B00000003'X); ] @LFA 87509900
*                                   ] Move by                      @LFA 87510000
*  DCL XSF_SFI_MVBY_ID       BIT(24) CONSTANT('862B00'X);        ] @LFA 87510100
*  DCL XSF_MVBY_LENGTH       BIT(16) CONSTANT('0009'X);          ] @LFA 87510200
*  DCL XSF_MVBY_DTYPE        BIT(8)  CONSTANT('03'X);            ] @LFA 87510300
*                                                                ] @LFA 87510400
*  DCL XSF_MVBY_DATA_VOLUME  BIN(8)  CONSTANT('00'X);            ] @LFA 87510500
*  DCL XSF_MVBY_DATA_SET     BIN(8)  CONSTANT('01'X);            ] @LFA 87510600
*/********************************************************************/ 87510700
*  DCL XSF_SFI_MVS     BIT(64) CONSTANT('0009863000000003'X);           87510800
*                                   ] MVS use                           87510900
*  DCL XSF_SFI_MVS_ID    BIT(24) CONSTANT('863000'X);                   87511000
*  DCL XSF_MVS_LENGTH    BIT(16) CONSTANT('0009'X);                     87511100
*  DCL XSF_MVS_DTYPE     BIT(8)  CONSTANT('03'X);                       87511200
*                                                                       87511300
*  DCL XSF_MVS_DATA_NO          BIN(8) CONSTANT('00'X);                 87511400
*  DCL XSF_MVS_DATA_YES         BIN(8) CONSTANT('01'X);                 87511500
*/********************************************************************/ 87511602
*  DCL XSF_SFI_NDRP       BIT(64) CONSTANT('000C864500000005'X); ] @K5C 87511702
*                                   ] Not-GDG Retention Period     @M2A 87511802
*  DCL XSF_SFI_NDRP_ID          BIT(24) CONSTANT('864500'X);     ] @M2A 87511902
*  DCL XSF_NDRP_LENGTH          BIT(16) CONSTANT('000C'X);       ] @M2A 87512002
*  DCL XSF_NDRP_DTYPE           BIT(8)  CONSTANT('05'X);         ] @M2A 87512102
*/********************************************************************/ 87512200
*  DCL XSF_SFI_NLOC    BIT(64) CONSTANT('0010865000000007'X);           87512300
*                                   ] Required location                 87512400
*  DCL XSF_SFI_NLOC_ID   BIT(24) CONSTANT('865000'X);                   87512500
*  DCL XSF_NLOC_LENGTH   BIT(16) CONSTANT('0010'X);                     87512600
*  DCL XSF_NLOC_DTYPE    BIT(8)  CONSTANT('07'X);                       87512700
*/********************************************************************/ 87512800
*  DCL XSF_SFI_NLOT    BIT(64) CONSTANT('0009865200000003'X);    ] @SCA 87512900
*                                   ] Required location type       @SCA 87513000
*  DCL XSF_SFI_NLOT_ID   BIT(24) CONSTANT('865200'X);            ] @SCA 87513100
*  DCL XSF_NLOT_LENGTH   BIT(16) CONSTANT('0009'X);              ] @SCA 87513200
*  DCL XSF_NLOT_DTYPE    BIT(8)  CONSTANT('03'X);                ] @SCA 87513300
*                                                                ] @SCA 87513400
*  DCL XSF_NLOT_DATA_SHELF              BIN(8) CONSTANT('00'X);  ] @SCA 87513500
*  DCL XSF_NLOT_DATA_STORE_BUILTIN_BINS BIN(8) CONSTANT('01'X);  ] @SCA 87513600
*  DCL XSF_NLOT_DATA_MANUAL             BIN(8) CONSTANT('02'X);  ] @SCA 87513700
*  DCL XSF_NLOT_DATA_AUTO               BIN(8) CONSTANT('03'X);  ] @SCA 87513800
*  DCL XSF_NLOT_DATA_STORE_BINS         BIN(8) CONSTANT('04'X);  ] @SCA 87513900
*  DCL XSF_NLOT_DATA_STORE_NOBINS       BIN(8) CONSTANT('05'X);  ] @SCA 87514000
*/********************************************************************/ 87514100
*  DCL XSF_SFI_NME     BIT(64) CONSTANT('0010866000000007'X);           87514200
*                                   ] Security class name               87514300
*  DCL XSF_SFI_NME_ID    BIT(24) CONSTANT('866000'X);                   87514400
*  DCL XSF_NME_LENGTH    BIT(16) CONSTANT('0010'X);                     87514500
*  DCL XSF_NME_DTYPE     BIT(8)  CONSTANT('07'X);                       87514600
*/********************************************************************/ 87514700
*  DCL XSF_SFI_NOT     BIT(64) CONSTANT('0009866800000003'X);           87514800
*                                   ] Notify                            87514900
*  DCL XSF_SFI_NOT_ID    BIT(24) CONSTANT('866800'X);                   87515000
*  DCL XSF_NOT_LENGTH    BIT(16) CONSTANT('0009'X);                     87515100
*  DCL XSF_NOT_DTYPE     BIT(8)  CONSTANT('03'X);                       87515200
*                                                                       87515300
*  DCL XSF_NOT_DATA_NO          BIN(8) CONSTANT('00'X);                 87515400
*  DCL XSF_NOT_DATA_YES         BIN(8) CONSTANT('01'X);                 87515500
*/********************************************************************/ 87515600
*  DCL XSF_SFI_NVL     BIT(64) CONSTANT('000E867000000001'X);           87515700
*                                   ] Next volume                       87515800
*  DCL XSF_SFI_NVL_ID    BIT(24) CONSTANT('867000'X);                   87515900
*  DCL XSF_NVL_LENGTH    BIT(16) CONSTANT('000E'X);                     87516000
*  DCL XSF_NVL_DTYPE     BIT(8)  CONSTANT('01'X);                       87516100
*/********************************************************************/ 87516200
*  DCL XSF_SFI_NVRS    BIT(64) CONSTANT('0010868000000007'X);           87516300
*                                   ] Next VRS name                     87516400
*  DCL XSF_SFI_NVRS_ID   BIT(24) CONSTANT('868000'X);                   87516500
*  DCL XSF_NVRS_LENGTH   BIT(16) CONSTANT('0010'X);                     87516600
*  DCL XSF_NVRS_DTYPE    BIT(8)  CONSTANT('07'X);                       87516700
*/********************************************************************/ 87516802
*  DCL XSF_SFI_NWCT       BIT(64) CONSTANT('0009868500000003'X); ] @M2A 87516902
*                                   ] Not-GDG WHILECATALOG         @M2A 87517002
*  DCL XSF_SFI_NWCT_ID          BIT(24) CONSTANT('868500'X);     ] @M2A 87517102
*  DCL XSF_NWCT_LENGTH          BIT(16) CONSTANT('0009'X);       ] @M2A 87517202
*  DCL XSF_NWCT_DTYPE           BIT(8)  CONSTANT('03'X);         ] @M2A 87517302
*                                                                ] @M2A 87517402
*  DCL XSF_NWCT_DATA_OFF           BIN(8)  CONSTANT('00'X);      ] @M2A 87517502
*  DCL XSF_NWCT_DATA_ON            BIN(8)  CONSTANT('01'X);      ] @M2A 87517602
*  DCL XSF_NWCT_DATA_UNTILEXPIRED  BIN(8)  CONSTANT('02'X);      ] @M2A 87517700
*/********************************************************************/ 87517800
*  DCL XSF_SFI_OAC     BIT(64) CONSTANT('0009869000000003'X);           87517900
*                                   ] Owner access                      87518000
*  DCL XSF_SFI_OAC_ID    BIT(24) CONSTANT('869000'X);                   87518100
*  DCL XSF_OAC_LENGTH    BIT(16) CONSTANT('0009'X);                     87518200
*  DCL XSF_OAC_DTYPE     BIT(8)  CONSTANT('03'X);                       87518300
*                                                                       87518400
*  DCL XSF_OAC_DATA_READ        BIN(8) CONSTANT('00'X);                 87518500
*  DCL XSF_OAC_DATA_UPDATE      BIN(8) CONSTANT('01'X);                 87518600
*  DCL XSF_OAC_DATA_ALTER       BIN(8) CONSTANT('02'X);                 87518700
*/********************************************************************/ 87518800
*  DCL XSF_SFI_OBMN    BIT(64) CONSTANT('001086A000000007'X);           87518900
*                                   ] Old bin number media name         87519000
*  DCL XSF_SFI_OBMN_ID   BIT(24) CONSTANT('86A000'X);                   87519100
*  DCL XSF_OBMN_LENGTH   BIT(16) CONSTANT('0010'X);                     87519200
*  DCL XSF_OBMN_DTYPE    BIT(8)  CONSTANT('07'X);                       87519300
*/********************************************************************/ 87519400
*  DCL XSF_SFI_OBN     BIT(64) CONSTANT('000E86B000000001'X);           87519500
*                                   ] Old bin number                    87519600
*  DCL XSF_SFI_OBN_ID    BIT(24) CONSTANT('86B000'X);                   87519700
*  DCL XSF_OBN_LENGTH    BIT(16) CONSTANT('000E'X);                     87519800
*  DCL XSF_OBN_DTYPE     BIT(8)  CONSTANT('01'X);                       87519900
*/********************************************************************/ 87520000
*  DCL XSF_SFI_OCE     BIT(64) CONSTANT('000986B800000003'X);           87520100
*                                   ] Volume information                87520200
*                                   ] recorded at O/C/EOV               87520300
*  DCL XSF_SFI_OCE_ID    BIT(24) CONSTANT('86B800'X);                   87520400
*  DCL XSF_OCE_LENGTH    BIT(16) CONSTANT('0009'X);                     87520500
*  DCL XSF_OCE_DTYPE     BIT(8)  CONSTANT('03'X);                       87520600
*                                                                       87520700
*  DCL XSF_OCE_DATA_NO          BIN(8) CONSTANT('00'X);                 87520800
*  DCL XSF_OCE_DATA_YES         BIN(8) CONSTANT('01'X);                 87520900
*/********************************************************************/ 87521000
*  DCL XSF_SFI_OLOC    BIT(64) CONSTANT('001086C000000007'X);           87521100
*                                   ] Old location                      87521200
*  DCL XSF_SFI_OLOC_ID   BIT(24) CONSTANT('86C000'X);                   87521300
*  DCL XSF_OLOC_LENGTH   BIT(16) CONSTANT('0010'X);                     87521400
*  DCL XSF_OLOC_DTYPE    BIT(8)  CONSTANT('07'X);                       87521500
*/********************************************************************/ 87521600
*  DCL XSF_SFI_OLON    BIT(64) CONSTANT('001086C100000007'X);    ] @OBA 87521700
*                                   ] Old loan location            @OBA 87521800
*  DCL XSF_SFI_OLON_ID   BIT(24) CONSTANT('86C100'X);            ] @OBA 87521900
*  DCL XSF_OLON_LENGTH   BIT(16) CONSTANT('0010'X);              ] @OBA 87522000
*  DCL XSF_OLON_DTYPE    BIT(8)  CONSTANT('07'X);                ] @OBA 87522100
*/********************************************************************/ 87522200
*  DCL XSF_SFI_OLOT    BIT(64) CONSTANT('000986C200000003'X);    ] @SCA 87522300
*                                   ] Old location type            @SCA 87522400
*  DCL XSF_SFI_OLOT_ID   BIT(24) CONSTANT('86C200'X);            ] @SCA 87522500
*  DCL XSF_OLOT_LENGTH   BIT(16) CONSTANT('0009'X);              ] @SCA 87522600
*  DCL XSF_OLOT_DTYPE    BIT(8)  CONSTANT('03'X);                ] @SCA 87522700
*                                                                ] @SCA 87522800
*  DCL XSF_OLOT_DATA_SHELF              BIN(8) CONSTANT('00'X);  ] @SCA 87522900
*  DCL XSF_OLOT_DATA_STORE_BUILTIN_BINS BIN(8) CONSTANT('01'X);  ] @SCA 87523000
*  DCL XSF_OLOT_DATA_MANUAL             BIN(8) CONSTANT('02'X);  ] @SCA 87523100
*  DCL XSF_OLOT_DATA_AUTO               BIN(8) CONSTANT('03'X);  ] @SCA 87523200
*  DCL XSF_OLOT_DATA_STORE_BINS         BIN(8) CONSTANT('04'X);  ] @SCA 87523300
*  DCL XSF_OLOT_DATA_STORE_NOBINS       BIN(8) CONSTANT('05'X);  ] @SCA 87523400
*  DCL XSF_OLOT_DATA_STORE_INCTNR       BIN(8) CONSTANT('06'X);  ] @SCA 87523500
*/********************************************************************/ 87523600
*  DCL XSF_SFI_OPL     BIT(64) CONSTANT('000A86D000000004'X);           87523700
*                                   ] Position of rack number           87523800
*                                   ] or pool ID                        87523900
*  DCL XSF_SFI_OPL_ID    BIT(24) CONSTANT('86D000'X);                   87524000
*  DCL XSF_OPL_LENGTH    BIT(16) CONSTANT('000A'X);                     87524100
*  DCL XSF_OPL_DTYPE     BIT(8)  CONSTANT('04'X);                       87524200
*/********************************************************************/ 87524300
*  DCL XSF_SFI_OPM     BIT(64) CONSTANT('000986E000000003'X);           87524400
*                                   ] Operating mode                    87524500
*  DCL XSF_SFI_OPM_ID    BIT(24) CONSTANT('86E000'X);                   87524600
*  DCL XSF_OPM_LENGTH    BIT(16) CONSTANT('0009'X);                     87524700
*  DCL XSF_OPM_DTYPE     BIT(8)  CONSTANT('03'X);                       87524800
*                                                                       87524900
*  DCL XSF_OPM_DATA_M           BIN(8) CONSTANT('01'X);                 87525000
*  DCL XSF_OPM_DATA_R           BIN(8) CONSTANT('02'X);                 87525100
*  DCL XSF_OPM_DATA_W           BIN(8) CONSTANT('03'X);                 87525200
*  DCL XSF_OPM_DATA_P           BIN(8) CONSTANT('04'X);                 87525300
*/********************************************************************/ 87525400
*  DCL XSF_SFI_ORIA    BIT(64) CONSTANT('000986E8A0000003'X);    ] @MRA 87525500
*                                   ] OPENRULE input action             87525600
*  DCL XSF_SFI_ORIA_ID    BIT(24) CONSTANT('86E8A0'X);           ] @MRA 87525700
*  DCL XSF_ORIA_LENGTH    BIT(16) CONSTANT('0009'X);             ] @MRA 87525800
*  DCL XSF_ORIA_DTYPE     BIT(8)  CONSTANT('03'X);               ] @MRA 87525900
*                                                                       87526000
*  DCL XSF_ORIA_DATA_ACCEPT      BIN(8) CONSTANT('00'X);         ] @MRA 87526100
*  DCL XSF_ORIA_DATA_IGNORE      BIN(8) CONSTANT('01'X);         ] @MRA 87526200
*  DCL XSF_ORIA_DATA_REJECT      BIN(8) CONSTANT('02'X);         ] @MRA 87526300
*/********************************************************************/ 87526400
*  DCL XSF_SFI_ORII    BIT(64) CONSTANT('000986E8A8000002'X);    ] @MRA 87526500
*                                   ] OPENRULE input IGNORE condition   87526600
*  DCL XSF_SFI_ORII_ID    BIT(24) CONSTANT('86E8A8'X);           ] @MRA 87526700
*  DCL XSF_ORII_LENGTH    BIT(16) CONSTANT('0009'X);             ] @MRA 87526800
*  DCL XSF_ORII_DTYPE     BIT(8)  CONSTANT('02'X);               ] @MRA 87526900
*                                                                       87527000
*  DCL XSF_ORII_DATA_SPECIFIC    BIT(8) CONSTANT('80'X);         ] @MRA 87527100
*  DCL XSF_ORII_DATA_NONSPECIFIC BIT(8) CONSTANT('40'X);         ] @MRA 87527200
*  DCL XSF_ORII_DATA_ANY         BIT(8) CONSTANT('C0'X);         ] @MRA 87527300
*/********************************************************************/ 87527400
*  DCL XSF_SFI_ORIR    BIT(64) CONSTANT('000986E8B8000002'X);    ] @MRA 87527500
*                                   ] OPENRULE input reject condition   87527600
*  DCL XSF_SFI_ORIR_ID    BIT(24) CONSTANT('86E8B8'X);           ] @MRA 87527700
*  DCL XSF_ORIR_LENGTH    BIT(16) CONSTANT('0009'X);             ] @MRA 87527800
*  DCL XSF_ORIR_DTYPE     BIT(8)  CONSTANT('02'X);               ] @MRA 87527900
*                                                                       87528000
*  DCL XSF_ORIR_DATA_SYSID    BIT(8) CONSTANT('80'X);            ] @MRA 87528100
*  DCL XSF_ORIR_DATA_CATLG    BIT(8) CONSTANT('40'X);            ] @MRA 87528200
*/********************************************************************/ 87528300
*  DCL XSF_SFI_OROA    BIT(64) CONSTANT('000986EA00000003'X);    ] @MRA 87528400
*                                   ] OPENRULE output action            87528500
*  DCL XSF_SFI_OROA_ID    BIT(24) CONSTANT('86EA00'X);           ] @MRA 87528600
*  DCL XSF_OROA_LENGTH    BIT(16) CONSTANT('0009'X);             ] @MRA 87528700
*  DCL XSF_OROA_DTYPE     BIT(8)  CONSTANT('03'X);               ] @MRA 87528800
*                                                                       87528900
*  DCL XSF_OROA_DATA_ACCEPT      BIN(8) CONSTANT('00'X);         ] @MRA 87529000
*  DCL XSF_OROA_DATA_IGNORE      BIN(8) CONSTANT('01'X);         ] @MRA 87529100
*  DCL XSF_OROA_DATA_REJECT      BIN(8) CONSTANT('02'X);         ] @MRA 87529200
*/********************************************************************/ 87529300
*  DCL XSF_SFI_OROI    BIT(64) CONSTANT('000986EA08000002'X);    ] @MRA 87529400
*                                   ] OPENRULE output ignore condition  87529500
*  DCL XSF_SFI_OROI_ID    BIT(24) CONSTANT('86EA08'X);           ] @MRA 87529600
*  DCL XSF_OROI_LENGTH    BIT(16) CONSTANT('0009'X);             ] @MRA 87529700
*  DCL XSF_OROI_DTYPE     BIT(8)  CONSTANT('02'X);               ] @MRA 87529800
*                                                                       87529900
*  DCL XSF_OROI_DATA_SPECIFIC    BIT(8) CONSTANT('80'X);         ] @MRA 87530000
*  DCL XSF_OROI_DATA_NONSPECIFIC BIT(8) CONSTANT('40'X);         ] @MRA 87530100
*  DCL XSF_OROI_DATA_ANY         BIT(8) CONSTANT('C0'X);         ] @MRA 87530200
*/********************************************************************/ 87530300
*  DCL XSF_SFI_OROR    BIT(64) CONSTANT('000986EA18000002'X);    ] @MRA 87530400
*                                   ] OPENRULE output reject condition  87530500
*  DCL XSF_SFI_OROR_ID    BIT(24) CONSTANT('86EA18'X);           ] @MRA 87530600
*  DCL XSF_OROR_LENGTH    BIT(16) CONSTANT('0009'X);             ] @MRA 87530700
*  DCL XSF_OROR_DTYPE     BIT(8)  CONSTANT('02'X);               ] @MRA 87530800
*                                                                       87530900
*  DCL XSF_OROR_DATA_SYSID    BIT(8) CONSTANT('80'X);            ] @MRA 87531000
*  DCL XSF_OROR_DATA_CATLG    BIT(8) CONSTANT('40'X);            ] @MRA 87531100
*/********************************************************************/ 87531200
*  DCL XSF_SFI_ORTP    BIT(64) CONSTANT('000986EF08000003'X);    ] @MRA 87531300
*                                   ] OPENRULE entry type               87531400
*  DCL XSF_SFI_ORTP_ID    BIT(24) CONSTANT('86EF08'X);           ] @MRA 87531500
*  DCL XSF_ORTP_LENGTH    BIT(16) CONSTANT('0009'X);             ] @MRA 87531600
*  DCL XSF_ORTP_DTYPE     BIT(8)  CONSTANT('03'X);               ] @MRA 87531700
*                                                                       87531800
*  DCL XSF_ORTP_DATA_RMM     BIN(8) CONSTANT('00'X);             ] @MRA 87531900
*  DCL XSF_ORTP_DATA_NORMM   BIN(8) CONSTANT('01'X);             ] @MRA 87532000
*/********************************************************************/ 87532100
*  DCL XSF_SFI_ORVS    BIT(64) CONSTANT('000E86EF80000007'X);    ] @MRA 87532200
*                                   ] OPENRULE volume range start       87532300
*  DCL XSF_SFI_ORVS_ID    BIT(24) CONSTANT('86EF80'X);           ] @MRA 87532400
*  DCL XSF_ORVS_LENGTH    BIT(16) CONSTANT('000E'X);             ] @MRA 87532500
*  DCL XSF_ORVS_DTYPE     BIT(8)  CONSTANT('07'X);               ] @MRA 87532600
*/********************************************************************/ 87532700
*  DCL XSF_SFI_ORVL    BIT(64) CONSTANT('000E86EF85000007'X);    ] @MRA 87532800
*                                   ] OPENRULE volume serial number,    87532900
*                                   ] specific or generic               87533000
*  DCL XSF_SFI_ORVL_ID    BIT(24) CONSTANT('86EF85'X);           ] @MRA 87533100
*  DCL XSF_ORVL_LENGTH    BIT(16) CONSTANT('000E'X);             ] @MRA 87533200
*  DCL XSF_ORVL_DTYPE     BIT(8)  CONSTANT('07'X);               ] @MRA 87533300
*/********************************************************************/ 87533400
*  DCL XSF_SFI_ORVE    BIT(64) CONSTANT('000E86EF8F000007'X);    ] @MRA 87533500
*                                   ] OPENRULE volume range end         87533600
*  DCL XSF_SFI_ORVE_ID    BIT(24) CONSTANT('86EF8F'X);           ] @MRA 87533700
*  DCL XSF_ORVE_LENGTH    BIT(16) CONSTANT('000E'X);             ] @MRA 87533800
*  DCL XSF_ORVE_DTYPE     BIT(8)  CONSTANT('07'X);               ] @MRA 87533900
*/********************************************************************/ 87534000
*  DCL XSF_SFI_OVL     BIT(64) CONSTANT('000A86F000000004'X);           87534100
*                                   ] Position of volume serial         87534200
*  DCL XSF_SFI_OVL_ID    BIT(24) CONSTANT('86F000'X);                   87534300
*  DCL XSF_OVL_LENGTH    BIT(16) CONSTANT('000A'X);                     87534400
*  DCL XSF_OVL_DTYPE     BIT(8)  CONSTANT('04'X);                       87534500
*/*************************************************************/ ] @SCA 87534600
*  DCL XSF_SFI_OVOL    BIT(64) CONSTANT('000E86F500000001'X);    ] @SCA 87534700
*                                   ] Old volume                   @SCA 87534800
*  DCL XSF_SFI_OVOL_ID   BIT(24) CONSTANT('86F500'X);            ] @SCA 87534900
*  DCL XSF_OVOL_LENGTH   BIT(16) CONSTANT('000E'X);              ] @SCA 87535000
*  DCL XSF_OVOL_DTYPE    BIT(8)  CONSTANT('01'X);                ] @SCA 87535100
*/********************************************************************/ 87535200
*  DCL XSF_SFI_OWN     BIT(64) CONSTANT('0010870000000007'X);           87535300
*                                   ] Owner                             87535400
*  DCL XSF_SFI_OWN_ID    BIT(24) CONSTANT('870000'X);                   87535500
*  DCL XSF_OWN_LENGTH    BIT(16) CONSTANT('0010'X);                     87535600
*  DCL XSF_OWN_DTYPE     BIT(8)  CONSTANT('07'X);                       87535700
*/********************************************************************/ 87535800
*  DCL XSF_SFI_OXDJ    BIT(64) CONSTANT('000C871000000009'X);           87535900
*                                   ] Original expiration date          87536000
*  DCL XSF_SFI_OXDJ_ID   BIT(24) CONSTANT('871000'X);                   87536100
*  DCL XSF_OXDJ_LENGTH   BIT(16) CONSTANT('000C'X);                     87536200
*  DCL XSF_OXDJ_DTYPE    BIT(8)  CONSTANT('09'X);                       87536300
*/********************************************************************/ 87536400
*  DCL XSF_SFI_PACS    BIT(64) CONSTANT('0009871800000003'X);    ] @04A 87536500
*                                   ] Pre-ACS support              @04A 87536600
*  DCL XSF_SFI_PACS_ID   BIT(24) CONSTANT('871800'X);            ] @04A 87536700
*  DCL XSF_PACS_LENGTH   BIT(16) CONSTANT('0009'X);              ] @04A 87536800
*  DCL XSF_PACS_DTYPE    BIT(8)  CONSTANT('03'X);                ] @04A 87536900
*                                                                ] @04A 87537000
*  DCL XSF_PACS_DATA_NO         BIN(8) CONSTANT('00'X);          ] @04A 87537100
*  DCL XSF_PACS_DATA_YES        BIN(8) CONSTANT('01'X);          ] @04A 87537200
*/********************************************************************/ 87537300
*  DCL XSF_SFI_PDA        BIT(64) CONSTANT('0009871E00000003'X); ] @LGA 87537400
*                                   ] PDA state                    @LGA 87537500
*  DCL XSF_SFI_PDA_ID     BIT(24) CONSTANT('871E00'X);           ] @LGA 87537600
*  DCL XSF_PDA_LENGTH     BIT(16) CONSTANT('0009'X);             ] @LGA 87537700
*  DCL XSF_PDA_DTYPE      BIT(8)  CONSTANT('03'X);               ] @LGA 87537800
*                                                                ] @LGA 87537900
*  DCL XSF_PDA_DATA_OFF   BIN(8)  CONSTANT('00'X);               ] @LGA 87538000
*  DCL XSF_PDA_DATA_ON    BIN(8)  CONSTANT('01'X);               ] @LGA 87538100
*  DCL XSF_PDA_DATA_NONE  BIN(8)  CONSTANT('02'X);               ] @LGA 87538200
*/********************************************************************/ 87538300
*  DCL XSF_SFI_PDAC       BIT(64) CONSTANT('0009871E10000003'X); ] @LGA 87538400
*                                   ] PDA block count              @LGA 87538500
*  DCL XSF_SFI_PDAC_ID    BIT(24) CONSTANT('871E10'X);           ] @LGA 87538600
*  DCL XSF_PDAC_LENGTH    BIT(16) CONSTANT('0009'X);             ] @LGA 87538700
*  DCL XSF_PDAC_DTYPE     BIT(8)  CONSTANT('03'X);               ] @LGA 87538800
*/********************************************************************/ 87538900
*  DCL XSF_SFI_PDAL       BIT(64) CONSTANT('0009871E30000003'X); ] @LGA 87539000
*                                   ] PDA log state                @LGA 87539100
*  DCL XSF_SFI_PDAL_ID    BIT(24) CONSTANT('871E30'X);           ] @LGA 87539200
*  DCL XSF_PDAL_LENGTH    BIT(16) CONSTANT('0009'X);             ] @LGA 87539300
*  DCL XSF_PDAL_DTYPE     BIT(8)  CONSTANT('03'X);               ] @LGA 87539400
*                                                                ] @LGA 87539500
*  DCL XSF_PDAL_DATA_OFF  BIN(8)  CONSTANT('00'X);               ] @LGA 87539600
*  DCL XSF_PDAL_DATA_ON   BIN(8)  CONSTANT('01'X);               ] @LGA 87539700
*/********************************************************************/ 87539800
*  DCL XSF_SFI_PDAS       BIT(64) CONSTANT('0009871E90000003'X); ] @LGA 87539900
*                                   ] PDA block size               @LGA 87540000
*  DCL XSF_SFI_PDAS_ID    BIT(24) CONSTANT('871E90'X);           ] @LGA 87540100
*  DCL XSF_PDAS_LENGTH    BIT(16) CONSTANT('0009'X);             ] @LGA 87540200
*  DCL XSF_PDAS_DTYPE     BIT(8)  CONSTANT('03'X);               ] @LGA 87540300
*/********************************************************************/ 87540400
*  DCL XSF_SFI_PDS     BIT(64) CONSTANT('0030872000000007'X);           87540500
*                                   ] Pool description                  87540600
*  DCL XSF_SFI_PDS_ID    BIT(24) CONSTANT('872000'X);                   87540700
*  DCL XSF_PDS_LENGTH    BIT(16) CONSTANT('0030'X);                     87540800
*  DCL XSF_PDS_DTYPE     BIT(8)  CONSTANT('07'X);                       87540900
*/********************************************************************/ 87541000
*  DCL XSF_SFI_PDSC    BIT(64) CONSTANT('0028873000000007'X);           87541100
*                                   ] Product description               87541200
*  DCL XSF_SFI_PDSC_ID   BIT(24) CONSTANT('873000'X);                   87541300
*  DCL XSF_PDSC_LENGTH   BIT(16) CONSTANT('0028'X);                     87541400
*  DCL XSF_PDSC_DTYPE    BIT(8)  CONSTANT('07'X);                       87541500
*/********************************************************************/ 87541600
*  DCL XSF_SFI_PEND    BIT(64) CONSTANT('0009874000000002'X);           87541700
*                                   ] Actions pending                   87541800
*  DCL XSF_SFI_PEND_ID   BIT(24) CONSTANT('874000'X);                   87541900
*  DCL XSF_PEND_LENGTH   BIT(16) CONSTANT('0009'X);                     87542000
*  DCL XSF_PEND_DTYPE    BIT(8)  CONSTANT('02'X);                       87542100
*                                                                       87542200
*  DCL XSF_PEND_FLAG_SCRATCH   BIT(8) CONSTANT('80'X);                  87542300
*  DCL XSF_PEND_FLAG_REPLACE   BIT(8) CONSTANT('40'X);                  87542400
*  DCL XSF_PEND_FLAG_INIT      BIT(8) CONSTANT('20'X);                  87542500
*  DCL XSF_PEND_FLAG_ERASE     BIT(8) CONSTANT('10'X);                  87542600
*  DCL XSF_PEND_FLAG_RETURN    BIT(8) CONSTANT('08'X);                  87542700
*  DCL XSF_PEND_FLAG_NOTIFY    BIT(8) CONSTANT('04'X);                  87542800
*/********************************************************************/ 87542900
*  DCL XSF_SFI_PID     BIT(64) CONSTANT('000E875000000007'X);           87543000
*                                   ] Pool prefix                       87543100
*  DCL XSF_SFI_PID_ID    BIT(24) CONSTANT('875000'X);                   87543200
*  DCL XSF_PID_LENGTH    BIT(16) CONSTANT('000E'X);                     87543300
*  DCL XSF_PID_DTYPE     BIT(8)  CONSTANT('07'X);                       87543400
*/********************************************************************/ 87543500
*  DCL XSF_SFI_PLN     BIT(64) CONSTANT('0010876000000007'X);           87543600
*                                   ] Pool name                         87543700
*  DCL XSF_SFI_PLN_ID    BIT(24) CONSTANT('876000'X);                   87543800
*  DCL XSF_PLN_LENGTH    BIT(16) CONSTANT('0010'X);                     87543900
*  DCL XSF_PLN_DTYPE     BIT(8)  CONSTANT('07'X);                       87544000
*/********************************************************************/ 87544100
*  DCL XSF_SFI_PNME    BIT(64) CONSTANT('0026877000000007'X);           87544200
*                                   ] Software product name             87544300
*  DCL XSF_SFI_PNME_ID   BIT(24) CONSTANT('877000'X);                   87544400
*  DCL XSF_PNME_LENGTH   BIT(16) CONSTANT('0026'X);                     87544500
*  DCL XSF_PNME_DTYPE    BIT(8)  CONSTANT('07'X);                       87544600
*/********************************************************************/ 87544700
*  DCL XSF_SFI_PNUM    BIT(64) CONSTANT('0010878000000007'X);           87544800
*                                   ] Software product number           87544900
*  DCL XSF_SFI_PNUM_ID   BIT(24) CONSTANT('878000'X);                   87545000
*  DCL XSF_PNUM_LENGTH   BIT(16) CONSTANT('0010'X);                     87545100
*  DCL XSF_PNUM_DTYPE    BIT(8)  CONSTANT('07'X);                       87545200
*/********************************************************************/ 87545300
*  DCL XSF_SFI_PRD     BIT(64) CONSTANT('000C879000000005'X);           87545400
*                                   ] Permanent read errors             87545500
*  DCL XSF_SFI_PRD_ID    BIT(24) CONSTANT('879000'X);                   87545600
*  DCL XSF_PRD_LENGTH    BIT(16) CONSTANT('000C'X);                     87545700
*  DCL XSF_PRD_DTYPE     BIT(8)  CONSTANT('05'X);                       87545800
*/********************************************************************/ 87545900
*  DCL XSF_SFI_PRF     BIT(64) CONSTANT('000987A000000003'X);           87546000
*                                   ] Pool definition RACF option       87546100
*  DCL XSF_SFI_PRF_ID    BIT(24) CONSTANT('87A000'X);                   87546200
*  DCL XSF_PRF_LENGTH    BIT(16) CONSTANT('0009'X);                     87546300
*  DCL XSF_PRF_DTYPE     BIT(8)  CONSTANT('03'X);                       87546400
*                                                                       87546500
*  DCL XSF_PRF_DATA_NO          BIN(8) CONSTANT('00'X);                 87546600
*  DCL XSF_PRF_DATA_YES         BIN(8) CONSTANT('01'X);                 87546700
*/********************************************************************/ 87546800
*  DCL XSF_SFI_PRTY    BIT(64) CONSTANT('000C87B000000005'X);           87546900
*                                   ] Priority                          87547000
*  DCL XSF_SFI_PRTY_ID   BIT(24) CONSTANT('87B000'X);                   87547100
*  DCL XSF_PRTY_LENGTH   BIT(16) CONSTANT('000C'X);                     87547200
*  DCL XSF_PRTY_DTYPE    BIT(8)  CONSTANT('05'X);                       87547300
*/********************************************************************/ 87547400
*  DCL XSF_SFI_PSFX    BIT(64) CONSTANT('000A87C000000001'X);           87547500
*                                   ] Parmlib member suffix             87547600
*  DCL XSF_SFI_PSFX_ID   BIT(24) CONSTANT('87C000'X);                   87547700
*  DCL XSF_PSFX_LENGTH   BIT(16) CONSTANT('000A'X);                     87547800
*  DCL XSF_PSFX_DTYPE    BIT(8)  CONSTANT('01'X);                       87547900
*/********************************************************************/ 87548000
*  DCL XSF_SFI_PSF2    BIT(64) CONSTANT('000A87C010000001'X);    ] @MOA 87548100
*                                   ] Parmlib member suffix 2           87548200
*  DCL XSF_SFI_PSF2_ID   BIT(24) CONSTANT('87C010'X);            ] @MOA 87548300
*  DCL XSF_PSF2_LENGTH   BIT(16) CONSTANT('000A'X);              ] @MOA 87548400
*  DCL XSF_PSF2_DTYPE    BIT(8)  CONSTANT('01'X);                ] @MOA 87548500
*/********************************************************************/ 87548600
*  DCL XSF_SFI_PSN     BIT(64) CONSTANT('001087D000000007'X);           87548700
*                                   ] Pool definition system ID         87548800
*  DCL XSF_SFI_PSN_ID    BIT(24) CONSTANT('87D000'X);                   87548900
*  DCL XSF_PSN_LENGTH    BIT(16) CONSTANT('0010'X);                     87549000
*  DCL XSF_PSN_DTYPE     BIT(8)  CONSTANT('07'X);                       87549100
*/********************************************************************/ 87549200
*  DCL XSF_SFI_PSZ6    BIT(64) CONSTANT('001687D300000008'X);    ] @SOA 87549300
*                                   ] Physical space used          @SOA 87549400
*  DCL XSF_SFI_PSZ6_ID   BIT(24) CONSTANT('87D300'X);            ] @SOA 87549500
*  DCL XSF_PSZ6_LENGTH   BIT(16) CONSTANT('0016'X);              ] @SOA 87549600
*  DCL XSF_PSZ6_DTYPE    BIT(8)  CONSTANT('08'X);                ] @SOA 87549700
*                                   ] Compound data                @SOA 87549800
*  DCL XSF_SFI_PSZ6_COMP BIT(48) CONSTANT('010303010A06'X);      ] @SOA 87549900
*                                                                ] @SOA 87550000
*  DCL XSF_SFI_PSZ6_COMPType  BIT(8)  CONSTANT('01'X);           ] @SOA 87550100
*  DCL XSF_SFI_PSZ6_COMPLen1  BIT(8)  CONSTANT('03'X);           ] @SOA 87550200
*  DCL XSF_SFI_PSZ6_COMPTyp1  BIT(8)  CONSTANT('03'X);           ] @SOA 87550300
*  DCL XSF_SFI_PSZ6_COMPDat1  BIT(8)  CONSTANT('01'X);           ] @SOA 87550400
*  DCL XSF_SFI_PSZ6_COMPLen2  BIT(8)  CONSTANT('0A'X);           ] @SOA 87550500
*  DCL XSF_SFI_PSZ6_COMPTyp2  BIT(8)  CONSTANT('06'X);           ] @SOA 87550600
*/********************************************************************/ 87550700
*  DCL XSF_SFI_PTNA    BIT(64) CONSTANT('000987DB00000003'X);    ] @MRA 87550800
*                                   ] PRTITION action for               87550900
*                                   ] non-system-managed volumes        87551000
*  DCL XSF_SFI_PTNA_ID    BIT(24) CONSTANT('87DB00'X);           ] @MRA 87551100
*  DCL XSF_PTNA_LENGTH    BIT(16) CONSTANT('0009'X);             ] @MRA 87551200
*  DCL XSF_PTNA_DTYPE     BIT(8)  CONSTANT('03'X);               ] @MRA 87551300
*                                                                       87551400
*  DCL XSF_PTNA_DATA_ACCEPT      BIN(8) CONSTANT('00'X);         ] @MRA 87551500
*  DCL XSF_PTNA_DATA_IGNORE      BIN(8) CONSTANT('01'X);         ] @MRA 87551600
*/********************************************************************/ 87551700
*  DCL XSF_SFI_PTNL    BIT(64) CONSTANT('001087DB0C000007'X);    ] @MRA 87551800
*                                   ] PRTITION location name            87551900
*  DCL XSF_SFI_PTNL_ID    BIT(24) CONSTANT('87DB0C'X);           ] @MRA 87552000
*  DCL XSF_PTNL_LENGTH    BIT(16) CONSTANT('0010'X);             ] @MRA 87552100
*  DCL XSF_PTNL_DTYPE     BIT(8)  CONSTANT('07'X);               ] @MRA 87552200
*/********************************************************************/ 87552300
*  DCL XSF_SFI_PTP     BIT(64) CONSTANT('000987E000000003'X);           87552400
*                                   ] Pool definition pool type         87552500
*  DCL XSF_SFI_PTP_ID    BIT(24) CONSTANT('87E000'X);                   87552600
*  DCL XSF_PTP_LENGTH    BIT(16) CONSTANT('0009'X);                     87552700
*  DCL XSF_PTP_DTYPE     BIT(8)  CONSTANT('03'X);                       87552800
*                                                                       87552900
*  DCL XSF_PTP_DATA_SCRATCH     BIN(8) CONSTANT('00'X);                 87553000
*  DCL XSF_PTP_DATA_RACK        BIN(8) CONSTANT('01'X);                 87553100
*/********************************************************************/ 87553200
*  DCL XSF_SFI_PTSA    BIT(64) CONSTANT('000987EB80000003'X);    ] @MRA 87553300
*                                   ] PRTITION action for               87553400
*                                   ] system-managed volumes            87553500
*  DCL XSF_SFI_PTSA_ID    BIT(24) CONSTANT('87EB80'X);           ] @MRA 87553600
*  DCL XSF_PTSA_LENGTH    BIT(16) CONSTANT('0009'X);             ] @MRA 87553700
*  DCL XSF_PTSA_DTYPE     BIT(8)  CONSTANT('03'X);               ] @MRA 87553800
*                                                                       87553900
*  DCL XSF_PTSA_DATA_ACCEPT      BIN(8) CONSTANT('00'X);         ] @MRA 87554000
*  DCL XSF_PTSA_DATA_IGNORE      BIN(8) CONSTANT('01'X);         ] @MRA 87554100
*/********************************************************************/ 87554200
*  DCL XSF_SFI_PTTP    BIT(64) CONSTANT('000987EBA8000003'X);    ] @MRA 87554300
*                                   ] PRTITION entry type               87554400
*  DCL XSF_SFI_PTTP_ID    BIT(24) CONSTANT('87EBA8'X);           ] @MRA 87554500
*  DCL XSF_PTTP_LENGTH    BIT(16) CONSTANT('0009'X);             ] @MRA 87554600
*  DCL XSF_PTTP_DTYPE     BIT(8)  CONSTANT('03'X);               ] @MRA 87554700
*                                                                       87554800
*  DCL XSF_PTTP_DATA_RMM     BIN(8) CONSTANT('00'X);             ] @MRA 87554900
*  DCL XSF_PTTP_DATA_NORMM   BIN(8) CONSTANT('01'X);             ] @MRA 87555000
*/********************************************************************/ 87555100
*  DCL XSF_SFI_PTVS    BIT(64) CONSTANT('000E87EC00000007'X);    ] @MRA 87555200
*                                   ] PRTITION volume range start       87555300
*  DCL XSF_SFI_PTVS_ID    BIT(24) CONSTANT('87EC00'X);           ] @MRA 87555400
*  DCL XSF_PTVS_LENGTH    BIT(16) CONSTANT('000E'X);             ] @MRA 87555500
*  DCL XSF_PTVS_DTYPE     BIT(8)  CONSTANT('07'X);               ] @MRA 87555600
*/********************************************************************/ 87555700
*  DCL XSF_SFI_PTVL    BIT(64) CONSTANT('000E87EC08000007'X);    ] @MRA 87555800
*                                   ] PRTITION volume serial number,    87555900
*                                   ] specific or generic               87556000
*  DCL XSF_SFI_PTVL_ID    BIT(24) CONSTANT('87EC08'X);           ] @MRA 87556100
*  DCL XSF_PTVL_LENGTH    BIT(16) CONSTANT('000E'X);             ] @MRA 87556200
*  DCL XSF_PTVL_DTYPE     BIT(8)  CONSTANT('07'X);               ] @MRA 87556300
*/********************************************************************/ 87556400
*  DCL XSF_SFI_PTVE    BIT(64) CONSTANT('000E87EC0F000007'X);    ] @MRA 87556500
*                                   ] PRTITION volume range end         87556600
*  DCL XSF_SFI_PTVE_ID    BIT(24) CONSTANT('87EC0F'X);           ] @MRA 87556700
*  DCL XSF_PTVE_LENGTH    BIT(16) CONSTANT('000E'X);             ] @MRA 87556800
*  DCL XSF_PTVE_DTYPE     BIT(8)  CONSTANT('07'X);               ] @MRA 87556900
*/********************************************************************/ 87557000
*  DCL XSF_SFI_PVL     BIT(64) CONSTANT('000E87F000000001'X);           87557100
*                                   ] Previous volume                   87557200
*  DCL XSF_SFI_PVL_ID    BIT(24) CONSTANT('87F000'X);                   87557300
*  DCL XSF_PVL_LENGTH    BIT(16) CONSTANT('000E'X);                     87557400
*  DCL XSF_PVL_DTYPE     BIT(8)  CONSTANT('01'X);                       87557500
*/********************************************************************/ 87557600
*  DCL XSF_SFI_PWT     BIT(64) CONSTANT('000C880000000005'X);           87557700
*                                   ] Permanent write errors            87557800
*  DCL XSF_SFI_PWT_ID    BIT(24) CONSTANT('880000'X);                   87557900
*  DCL XSF_PWT_LENGTH    BIT(16) CONSTANT('000C'X);                     87558000
*  DCL XSF_PWT_DTYPE     BIT(8)  CONSTANT('05'X);                       87558100
*/********************************************************************/ 87558200
*  DCL XSF_SFI_RBN     BIT(64) CONSTANT('000C881000000005'X);           87558300
*                                   ] Number of bin numbers in REMOTE   87558400
*  DCL XSF_SFI_RBN_ID    BIT(24) CONSTANT('881000'X);                   87558500
*  DCL XSF_RBN_LENGTH    BIT(16) CONSTANT('000C'X);                     87558600
*  DCL XSF_RBN_DTYPE     BIT(8)  CONSTANT('05'X);                       87558700
*/********************************************************************/ 87558800
*  DCL XSF_SFI_RBYS      BIT(64) CONSTANT('0009881200000003'X);  ] @LGA 87558900
*                                   ] Retain by set                @LGA 87559000
*  DCL XSF_SFI_RBYS_ID   BIT(24) CONSTANT('881200'X);            ] @LGA 87559100
*  DCL XSF_RBYS_LENGTH   BIT(16) CONSTANT('0009'X);              ] @LGA 87559200
*  DCL XSF_RBYS_DTYPE    BIT(8)  CONSTANT('03'X);                ] @LGA 87559300
*                                                                ] @LGA 87559400
*  DCL XSF_RBYS_DATA_NO  BIN(8)  CONSTANT('00'X);                ] @LGA 87559500
*  DCL XSF_RBYS_DATA_YES BIN(8)  CONSTANT('01'X);                ] @LGA 87559600
*/********************************************************************/ 87559700
*  DCL XSF_SFI_RCF     BIT(64) CONSTANT('0009882000000003'X);           87559800
*                                   ] Installation RACF support         87559900
*  DCL XSF_SFI_RCF_ID    BIT(24) CONSTANT('882000'X);                   87560000
*  DCL XSF_RCF_LENGTH    BIT(16) CONSTANT('0009'X);                     87560100
*  DCL XSF_RCF_DTYPE     BIT(8)  CONSTANT('03'X);                       87560200
*                                                                       87560300
*  DCL XSF_RCF_DATA_N           BIN(8) CONSTANT('01'X);                 87560400
*  DCL XSF_RCF_DATA_P           BIN(8) CONSTANT('02'X);                 87560500
*  DCL XSF_RCF_DATA_A           BIN(8) CONSTANT('03'X);                 87560600
*/********************************************************************/ 87560700
*  DCL XSF_SFI_RCFM    BIT(64) CONSTANT('000C883000000007'X);           87560800
*                                   ] Record format                     87560900
*  DCL XSF_SFI_RCFM_ID   BIT(24) CONSTANT('883000'X);                   87561000
*  DCL XSF_RCFM_LENGTH   BIT(16) CONSTANT('000C'X);                     87561100
*  DCL XSF_RCFM_DTYPE    BIT(8)  CONSTANT('07'X);                       87561200
*/********************************************************************/ 87561300
*  DCL XSF_SFI_RCK     BIT(64) CONSTANT('000E884000000001'X);           87561400
*                                   ] Rack or bin number                87561500
*  DCL XSF_SFI_RCK_ID    BIT(24) CONSTANT('884000'X);                   87561600
*  DCL XSF_RCK_LENGTH    BIT(16) CONSTANT('000E'X);                     87561700
*  DCL XSF_RCK_DTYPE     BIT(8)  CONSTANT('01'X);                       87561800
*/********************************************************************/ 87561900
*  DCL XSF_SFI_RDTJ    BIT(64) CONSTANT('000C886000000009'X);           87562000
*                                   ] Last CDS extract date             87562100
*  DCL XSF_SFI_RDTJ_ID   BIT(24) CONSTANT('886000'X);                   87562200
*  DCL XSF_RDTJ_LENGTH   BIT(16) CONSTANT('000C'X);                     87562300
*  DCL XSF_RDTJ_DTYPE    BIT(8)  CONSTANT('09'X);                       87562400
*/********************************************************************/ 87562500
*  DCL XSF_SFI_RET     BIT(64) CONSTANT('000B888000000003'X);           87562600
*                                   ] Retention type                    87562700
*  DCL XSF_SFI_RET_ID    BIT(24) CONSTANT('888000'X);                   87562800
*  DCL XSF_RET_LENGTH    BIT(16) CONSTANT('000B'X);                     87562900
*  DCL XSF_RET_DTYPE     BIT(8)  CONSTANT('03'X);                       87563000
*                                                                       87563100
*  DCL XSF_RET_DATA1_WHILEC     BIN(8) CONSTANT('01'X);                 87563200
*  DCL XSF_RET_DATA2_UNTILEXP   BIN(8) CONSTANT('01'X);                 87563300
*  DCL XSF_RET_DATA3_CYCLES     BIN(8) CONSTANT('01'X);                 87563400
*  DCL XSF_RET_DATA3_DAYS       BIN(8) CONSTANT('02'X);                 87563500
*  DCL XSF_RET_DATA3_REFDAYS    BIN(8) CONSTANT('03'X);                 87563600
*  DCL XSF_RET_DATA3_VOLUMES    BIN(8) CONSTANT('04'X);                 87563700
*  DCL XSF_RET_DATA3_EXTDAYS    BIN(8) CONSTANT('05'X);          ] @01A 87563800
*  DCL XSF_RET_DATA3_DAYCYCL    BIN(8) CONSTANT('06'X);          ] @01A 87563900
*/********************************************************************/ 87564000
*  DCL XSF_SFI_RLPR    BIT(64) CONSTANT('000C888500000005'X);    ] @OBA 87564100
*                                   ] Required location priority   @OBA 87564200
*  DCL XSF_SFI_RLPR_ID   BIT(24) CONSTANT('888500'X);            ] @OBA 87564300
*  DCL XSF_RLPR_LENGTH   BIT(16) CONSTANT('000C'X);              ] @OBA 87564400
*  DCL XSF_RLPR_DTYPE    BIT(8)  CONSTANT('05'X);                ] @OBA 87564500
*/********************************************************************/ 87564600
*  DCL XSF_SFI_RM      BIT(64) CONSTANT('0009888800000003'X);    ] @OGA 87564700
*                                   ] Retention method             @OGA 87564800
*  DCL XSF_SFI_RM_ID     BIT(24) CONSTANT('888800'X);            ] @OGA 87564900
*  DCL XSF_RM_LENGTH     BIT(16) CONSTANT('0009'X);              ] @OGA 87565000
*  DCL XSF_RM_DTYPE      BIT(8)  CONSTANT('03'X);                ] @OGA 87565100
*                                                                       87565200
*  DCL XSF_RM_DATA_VRSEL        BIN(8) CONSTANT('00'X);          ] @OGA 87565300
*  DCL XSF_RM_DATA_EXPDT        BIN(8) CONSTANT('01'X);          ] @OGA 87565400
*/********************************************************************/ 87565500
*  DCL XSF_SFI_RMSB    BIT(64) CONSTANT('0009888A00000003'X);    ] @OGA 87565600
*                                   ] Retention method set by      @OGA 87565700
*  DCL XSF_SFI_RMSB_ID     BIT(24) CONSTANT('888A00'X);          ] @OGA 87565800
*  DCL XSF_RMSB_LENGTH     BIT(16) CONSTANT('0009'X);            ] @OGA 87565900
*  DCL XSF_RMSB_DTYPE      BIT(8)  CONSTANT('03'X);              ] @OGA 87566000
*                                                                       87566100
*  DCL XSF_RMSB_DATA_UNDEFINED  BIN(8) CONSTANT('00'X);          ] @OGA 87566200
*  DCL XSF_RMSB_DATA_CMD        BIN(8) CONSTANT('01'X);          ] @OGA 87566300
*  DCL XSF_RMSB_DATA_CMD_DEF    BIN(8) CONSTANT('02'X);          ] @OGA 87566400
*  DCL XSF_RMSB_DATA_OCE_DEF    BIN(8) CONSTANT('03'X);          ] @OGA 87566500
*  DCL XSF_RMSB_DATA_OCE_EXIT   BIN(8) CONSTANT('04'X);          ] @OGA 87566600
*  DCL XSF_RMSB_DATA_LCS_DEF    BIN(8) CONSTANT('05'X);          ] @OGA 87566700
*  DCL XSF_RMSB_DATA_CNVT       BIN(8) CONSTANT('06'X);          ] @OGA 87566800
*  DCL XSF_RMSB_DATA_EXPORT_DEF BIN(8) CONSTANT('07'X);          ] @OGA 87566900
*  DCL XSF_RMSB_DATA_INERS_DEF  BIN(8) CONSTANT('08'X);          ] @OGA 87567000
*  DCL XSF_RMSB_DATA_MC_ATTR    BIN(8) CONSTANT('09'X);          ] @M5A 87567102
*  DCL XSF_RMSB_DATA_DEFTABLE   BIN(8) CONSTANT('0A'X);          ] @M3A 87567202
*/********************************************************************/ 87567300
*  DCL XSF_SFI_RMID    BIT(64) CONSTANT('0019889000000007'X);    ] @NSA 87567400
*                                   ] RMM started procedure name        87567500
*  DCL XSF_SFI_RMID_ID   BIT(24) CONSTANT('889000'X);            ] @NSA 87567600
*  DCL XSF_RMID_LENGTH   BIT(16) CONSTANT('0019'X);              ] @NSA 87567700
*  DCL XSF_RMID_DTYPE    BIT(8)  CONSTANT('07'X);                ] @NSA 87567800
*/********************************************************************/ 87567900
*  DCL XSF_SFI_RST     BIT(64) CONSTANT('000988A000000003'X);           87568000
*                                   ] Rack or bin status                87568100
*  DCL XSF_SFI_RST_ID    BIT(24) CONSTANT('88A000'X);                   87568200
*  DCL XSF_RST_LENGTH    BIT(16) CONSTANT('0009'X);                     87568300
*  DCL XSF_RST_DTYPE     BIT(8)  CONSTANT('03'X);                       87568800
*                                                                       87600900
*  DCL XSF_RST_DATA_EMPTY       BIN(8) CONSTANT('00'X);                 87633000
*  DCL XSF_RST_DATA_FREE        BIN(8) CONSTANT('01'X);                 87665100
*  DCL XSF_RST_DATA_INUSE       BIN(8) CONSTANT('02'X);                 87697200
*/********************************************************************/ 87700400
*  DCL XSF_SFI_RTBY       BIT(64) CONSTANT('000988B900000003'X); ] @LFA 87703600
*                                   ] Retain by                    @LFA 87706800
*  DCL XSF_SFI_RTBY_ID      BIT(24) CONSTANT('88B900'X);         ] @LFA 87710000
*  DCL XSF_RTBY_LENGTH      BIT(16) CONSTANT('0009'X);           ] @LFA 87713200
*  DCL XSF_RTBY_DTYPE       BIT(8)  CONSTANT('03'X);             ] @LFA 87716400
*                                                                ] @LFA 87719600
*  DCL XSF_RTBY_DATA_VOLUME  BIN(8)  CONSTANT('00'X);            ] @LFA 87722800
*  DCL XSF_RTBY_DATA_SET     BIN(8)  CONSTANT('01'X);            ] @LFA 87726000
*/********************************************************************/ 87729300
*  DCL XSF_SFI_RTDJ    BIT(64) CONSTANT('000C88C000000009'X);           87761400
*                                   ] Retention date                    87793500
*  DCL XSF_SFI_RTDJ_ID   BIT(24) CONSTANT('88C000'X);                   87825600
*  DCL XSF_RTDJ_LENGTH   BIT(16) CONSTANT('000C'X);                     87857700
*  DCL XSF_RTDJ_DTYPE    BIT(8)  CONSTANT('09'X);                       87889800
*/********************************************************************/ 87921900
*  DCL XSF_SFI_RTM     BIT(64) CONSTANT('000C88E00000000A'X);           87954000
*                                   ] Last CDS extract time             87986100
*  DCL XSF_SFI_RTM_ID    BIT(24) CONSTANT('88E000'X);                   88018200
*  DCL XSF_RTM_LENGTH    BIT(16) CONSTANT('000C'X);                     88050300
*  DCL XSF_RTM_DTYPE     BIT(8)  CONSTANT('0A'X);                       88082400
*/********************************************************************/ 88085600
*  DCL XSF_SFI_RUB     BIT(64) CONSTANT('000988E500000003'X);    ] @SCA 88088800
*                                   ] Reuse bin                    @SCA 88092000
*  DCL XSF_SFI_RUB_ID    BIT(24) CONSTANT('88E500'X);            ] @SCA 88095200
*  DCL XSF_RUB_LENGTH    BIT(16) CONSTANT('0009'X);              ] @SCA 88098400
*  DCL XSF_RUB_DTYPE     BIT(8)  CONSTANT('03'X);                ] @SCA 88101600
*                                                                ] @SCA 88104800
*  DCL XSF_RUB_DATA_CONFIRMMOVE BIN(8) CONSTANT('00'X);          ] @SCA 88108000
*  DCL XSF_RUB_DATA_STARTMOVE   BIN(8) CONSTANT('01'X);          ] @SCA 88111200
*/********************************************************************/ 88114500
*  DCL XSF_SFI_SC      BIT(64) CONSTANT('0010890000000007'X);           88146600
*                                   ] Storage class                     88178700
*  DCL XSF_SFI_SC_ID     BIT(24) CONSTANT('890000'X);                   88210800
*  DCL XSF_SC_LENGTH     BIT(16) CONSTANT('0010'X);                     88242900
*  DCL XSF_SC_DTYPE      BIT(8)  CONSTANT('07'X);                       88275000
*/********************************************************************/ 88279500
*  DCL XSF_SFI_SCRM    BIT(64) CONSTANT('0009891000000003'X);    ] @LUA 88284000
*                                   ] Scratch mode                 @LUA 88288500
*  DCL XSF_SFI_SCRM_ID   BIT(24) CONSTANT('891000'X);            ] @LUA 88293000
*  DCL XSF_SCRM_LENGTH   BIT(16) CONSTANT('0009'X);              ] @LUA 88297500
*  DCL XSF_SCRM_DTYPE    BIT(8)  CONSTANT('03'X);                ] @LUA 88302000
*/********************************************************************/ 88307100
*  DCL XSF_SFI_SCST    BIT(64) CONSTANT('0009892000000002'X);           88339200
*                                   ] Security class status             88371300
*  DCL XSF_SFI_SCST_ID   BIT(24) CONSTANT('892000'X);                   88403400
*  DCL XSF_SCST_LENGTH   BIT(16) CONSTANT('0009'X);                     88435500
*  DCL XSF_SCST_DTYPE    BIT(8)  CONSTANT('02'X);                       88467600
*                                                                       88499700
*  DCL XSF_SCST_FLAG_SMF       BIT(8) CONSTANT('80'X);                  88531800
*  DCL XSF_SCST_FLAG_MSGOPT    BIT(8) CONSTANT('40'X);                  88563900
*  DCL XSF_SCST_FLAG_ERASE     BIT(8) CONSTANT('20'X);                  88596000
*/********************************************************************/ 88628100
*  DCL XSF_SFI_SC1     BIT(64) CONSTANT('000C894000000005'X);           88660200
*                                   ] Store number                      88692300
*  DCL XSF_SFI_SC1_ID    BIT(24) CONSTANT('894000'X);                   88724400
*  DCL XSF_SC1_LENGTH    BIT(16) CONSTANT('000C'X);                     88756500
*  DCL XSF_SC1_DTYPE     BIT(8)  CONSTANT('05'X);                       88788600
*/********************************************************************/ 88820700
*  DCL XSF_SFI_SDTJ    BIT(64) CONSTANT('000C895000000009'X);           88852800
*                                   ] Movement tracking date            88884900
*  DCL XSF_SFI_SDTJ_ID   BIT(24) CONSTANT('895000'X);                   88917000
*  DCL XSF_SDTJ_LENGTH   BIT(16) CONSTANT('000C'X);                     88949100
*  DCL XSF_SDTJ_DTYPE    BIT(8)  CONSTANT('09'X);                       88981200
*/********************************************************************/ 89013300
*  DCL XSF_SFI_SEC     BIT(64) CONSTANT('0009896000000003'X);           89045400
*                                   ] Security class number             89077500
*  DCL XSF_SFI_SEC_ID    BIT(24) CONSTANT('896000'X);                   89109600
*  DCL XSF_SEC_LENGTH    BIT(16) CONSTANT('0009'X);                     89141700
*  DCL XSF_SEC_DTYPE     BIT(8)  CONSTANT('03'X);                       89173800
*/********************************************************************/ 89205900
*  DCL XSF_SFI_SEQ     BIT(64) CONSTANT('000C898000000005'X);           89238000
*                                   ] Volume sequence                   89270100
*  DCL XSF_SFI_SEQ_ID    BIT(24) CONSTANT('898000'X);                   89302200
*  DCL XSF_SEQ_LENGTH    BIT(16) CONSTANT('000C'X);                     89334300
*  DCL XSF_SEQ_DTYPE     BIT(8)  CONSTANT('05'X);                       89366400
*/********************************************************************/ 89398500
*  DCL XSF_SFI_SG      BIT(64) CONSTANT('001089A000000007'X);           89430600
*                                   ] Storage group name                89462700
*  DCL XSF_SFI_SG_ID     BIT(24) CONSTANT('89A000'X);                   89494800
*  DCL XSF_SG_LENGTH     BIT(16) CONSTANT('0010'X);                     89526900
*  DCL XSF_SG_DTYPE      BIT(8)  CONSTANT('07'X);                       89559000
*/********************************************************************/ 89591100
*  DCL XSF_SFI_SID     BIT(64) CONSTANT('001089B000000007'X);           89623200
*                                   ] SMF system ID                     89655300
*  DCL XSF_SFI_SID_ID    BIT(24) CONSTANT('89B000'X);                   89687400
*  DCL XSF_SID_LENGTH    BIT(16) CONSTANT('0010'X);                     89719500
*  DCL XSF_SID_DTYPE     BIT(8)  CONSTANT('07'X);                       89751600
*/********************************************************************/ 89783700
*  DCL XSF_SFI_SLM     BIT(64) CONSTANT('000A89C000000004'X);           89815800
*                                   ] MAXHOLD value                     89847900
*  DCL XSF_SFI_SLM_ID    BIT(24) CONSTANT('89C000'X);                   89880000
*  DCL XSF_SLM_LENGTH    BIT(16) CONSTANT('000A'X);                     89912100
*  DCL XSF_SLM_DTYPE     BIT(8)  CONSTANT('04'X);                       89944200
*/********************************************************************/ 89976300
*  DCL XSF_SFI_SMI     BIT(64) CONSTANT('000A89E000000004'X);           90008400
*                                   ] Offset to message ID              90040500
*  DCL XSF_SFI_SMI_ID    BIT(24) CONSTANT('89E000'X);                   90072600
*  DCL XSF_SMI_LENGTH    BIT(16) CONSTANT('000A'X);                     90104700
*  DCL XSF_SMI_DTYPE     BIT(8)  CONSTANT('04'X);                       90136800
*/********************************************************************/ 90168900
*  DCL XSF_SFI_SMP     BIT(64) CONSTANT('000989E210000003'X);    ] @LXA 90171300
*                                   ] SMSTAPE purge                @LXA 90173700
*  DCL XSF_SFI_SMP_ID    BIT(24) CONSTANT('89E210'X);            ] @LXA 90176100
*  DCL XSF_SMP_LENGTH    BIT(16) CONSTANT('0009'X);              ] @LXA 90178500
*  DCL XSF_SMP_DTYPE     BIT(8)  CONSTANT('03'X);                ] @LXA 90180900
*/********************************************************************/ 90183300
*  DCL XSF_SFI_SMU     BIT(64) CONSTANT('000989E220000002'X);    ] @LXA 90185700
*                                   ] SMSTAPE update               @LXA 90188100
*  DCL XSF_SFI_SMU_ID    BIT(24) CONSTANT('89E220'X);            ] @LXA 90190500
*  DCL XSF_SMU_LENGTH    BIT(16) CONSTANT('0009'X);              ] @LXA 90192900
*  DCL XSF_SMU_DTYPE     BIT(8)  CONSTANT('02'X);                ] @LXA 90195300
*/********************************************************************/ 90197700
*  DCL XSF_SFI_SOSJ    BIT(64) CONSTANT('000C89F000000009'X);           90201000
*                                   ] Last expiration processing        90222400
*                                   ] start date                        90243800
*  DCL XSF_SFI_SOSJ_ID   BIT(24) CONSTANT('89F000'X);                   90265200
*  DCL XSF_SOSJ_LENGTH   BIT(16) CONSTANT('000C'X);                     90297300
*  DCL XSF_SOSJ_DTYPE    BIT(8)  CONSTANT('09'X);                       90329400
*/********************************************************************/ 90361500
*  DCL XSF_SFI_SOSP    BIT(64) CONSTANT('00108A0000000007'X);           90393600
*                                   ] Scratch procedure name            90425700
*  DCL XSF_SFI_SOSP_ID   BIT(24) CONSTANT('8A0000'X);                   90457800
*  DCL XSF_SOSP_LENGTH   BIT(16) CONSTANT('0010'X);                     90489900
*  DCL XSF_SOSP_DTYPE    BIT(8)  CONSTANT('07'X);                       90522000
*/********************************************************************/ 90554100
*  DCL XSF_SFI_SOST    BIT(64) CONSTANT('000C8A100000000A'X);           90586200
*                                   ] Last expiration processing        90607600
*                                   ] start time                        90629000
*  DCL XSF_SFI_SOST_ID   BIT(24) CONSTANT('8A1000'X);                   90650400
*  DCL XSF_SOST_LENGTH   BIT(16) CONSTANT('000C'X);                     90682500
*  DCL XSF_SOST_DTYPE    BIT(8)  CONSTANT('0A'X);                       90714600
*/********************************************************************/ 90715800
*  DCL XSF_SFI_SRHN    BIT(64) CONSTANT('00478A1A00000007'X);    ] @LUA 90717000
*                                   ] Server host name             @LUA 90718200
*  DCL XSF_SFI_SRHN_ID   BIT(24) CONSTANT('8A1A00'X);            ] @LUA 90719400
*  DCL XSF_SRHN_LENGTH   BIT(16) CONSTANT('0047'X);              ] @LUA 90720600
*  DCL XSF_SRHN_DTYPE    BIT(8)  CONSTANT('07'X);                ] @LUA 90721800
*/********************************************************************/ 90723000
*  DCL XSF_SFI_SRIP    BIT(64) CONSTANT('00358A1A30000007'X);    ] @NQC 90724200
*                                   ] Server IP address            @LUA 90725400
*  DCL XSF_SFI_SRIP_ID   BIT(24) CONSTANT('8A1A30'X);            ] @LUA 90726600
*  DCL XSF_SRIP_LENGTH   BIT(16) CONSTANT('0035'X);              ] @NQC 90727800
*  DCL XSF_SRIP_DTYPE    BIT(8)  CONSTANT('07'X);                ] @LUA 90729000
*/********************************************************************/ 90730200
*  DCL XSF_SFI_SRPN    BIT(64) CONSTANT('000C8A1A50000005'X);    ] @LUA 90731400
*                                   ] Server port number           @LUA 90732600
*  DCL XSF_SFI_SRPN_ID   BIT(24) CONSTANT('8A1A50'X);            ] @LUA 90733800
*  DCL XSF_SRPN_LENGTH   BIT(16) CONSTANT('000C'X);              ] @LUA 90735000
*  DCL XSF_SRPN_DTYPE    BIT(8)  CONSTANT('05'X);                ] @LUA 90736200
*/********************************************************************/ 90737400
*  DCL XSF_SFI_SRTK    BIT(64) CONSTANT('000C8A1AF0000005'X);    ] @LUA 90738600
*                                   ] Server tasks                 @LUA 90739800
*  DCL XSF_SFI_SRTK_ID   BIT(24) CONSTANT('8A1AF0'X);            ] @LUA 90741000
*  DCL XSF_SRTK_LENGTH   BIT(16) CONSTANT('000C'X);              ] @LUA 90742200
*  DCL XSF_SRTK_DTYPE    BIT(8)  CONSTANT('05'X);                ] @LUA 90743400
*/********************************************************************/ 90746700
*  DCL XSF_SFI_SSM     BIT(64) CONSTANT('000A8A2000000004'X);           90778800
*                                   ] SMF security record number        90810900
*  DCL XSF_SFI_SSM_ID    BIT(24) CONSTANT('8A2000'X);                   90843000
*  DCL XSF_SSM_LENGTH    BIT(16) CONSTANT('000A'X);                     90875100
*  DCL XSF_SSM_DTYPE     BIT(8)  CONSTANT('04'X);                       90907200
*/********************************************************************/ 90910100
*  DCL XSF_SFI_SSTY    BIT(64) CONSTANT('00098A2500000003'X);    ] @LUA 90913000
*                                   ] Subsystem type               @LUA 90915900
*  DCL XSF_SFI_SSTY_ID   BIT(24) CONSTANT('8A2500'X);            ] @LUA 90918800
*  DCL XSF_SSTY_LENGTH   BIT(16) CONSTANT('0009'X);              ] @LUA 90921700
*  DCL XSF_SSTY_DTYPE    BIT(8)  CONSTANT('03'X);                ] @LUA 90924600
*                                                                ] @LUA 90927500
*  DCL XSF_SSTY_DATA_STANDARD   BIN(8) CONSTANT('00'X);          ] @LUA 90930400
*  DCL XSF_SSTY_DATA_CLIENT     BIN(8) CONSTANT('01'X);          ] @LUA 90933300
*  DCL XSF_SSTY_DATA_SERVER     BIN(8) CONSTANT('02'X);          ] @LUA 90936200
*/********************************************************************/ 90939300
*  DCL XSF_SFI_STEP    BIT(64) CONSTANT('00108A3000000007'X);           90971400
*                                   ] Step name                         91003500
*  DCL XSF_SFI_STEP_ID   BIT(24) CONSTANT('8A3000'X);                   91035600
*  DCL XSF_STEP_LENGTH   BIT(16) CONSTANT('0010'X);                     91067700
*  DCL XSF_STEP_DTYPE    BIT(8)  CONSTANT('07'X);                       91099800
*/********************************************************************/ 91099900
*  DCL XSF_SFI_STDS    BIT(64) CONSTANT('00098A2800000002'X);    ] @NIA 91100000
*                                   ] Debug setting                @NIA 91100100
*  DCL XSF_SFI_STDS_ID   BIT(24) CONSTANT('8A2800'X);            ] @NIA 91100200
*  DCL XSF_STDS_LENGTH   BIT(16) CONSTANT('0009'X);              ] @NIA 91100300
*  DCL XSF_STDS_DTYPE    BIT(8)  CONSTANT('02'X);                ] @NIA 91100400
*                                                                       91100500
*  DCL XSF_STDS_FLAG_OCE    BIT(8) CONSTANT('80'X);              ] @NIA 91100600
*  DCL XSF_STDS_FLAG_SNAP   BIT(8) CONSTANT('40'X);              ] @NIA 91100700
*/********************************************************************/ 91100800
*  DCL XSF_SFI_STRM    BIT(64) CONSTANT('00098A3607000003'X);    ] @NIA 91100900
*                                   ] DFSMSrmm status              @NIA 91101000
*  DCL XSF_SFI_STRM_ID   BIT(24) CONSTANT('8A3607'X);            ] @NIA 91101100
*  DCL XSF_STRM_LENGTH   BIT(16) CONSTANT('0009'X);              ] @NIA 91101200
*  DCL XSF_STRM_DTYPE    BIT(8)  CONSTANT('03'X);                ] @NIA 91101300
*                                                                       91101400
*  DCL XSF_STRM_DATA_ACTIVE    BIN(8) CONSTANT('00'X);           ] @NIA 91101500
*  DCL XSF_STRM_DATA_RESET     BIN(8) CONSTANT('01'X);           ] @NIA 91101600
*  DCL XSF_STRM_DATA_QUIESCED  BIN(8) CONSTANT('02'X);           ] @NIA 91101700
*/********************************************************************/ 91101800
*  DCL XSF_SFI_STSL    BIT(64) CONSTANT('00098A3661000003'X);    ] @NIA 91101900
*                                   ] Server listener status       @NIA 91102000
*  DCL XSF_SFI_STSL_ID   BIT(24) CONSTANT('8A3661'X);            ] @NIA 91102100
*  DCL XSF_STSL_LENGTH   BIT(16) CONSTANT('0009'X);              ] @NIA 91102200
*  DCL XSF_STSL_DTYPE    BIT(8)  CONSTANT('03'X);                ] @NIA 91102300
*                                                                       91102400
*  DCL XSF_STSL_DATA_STANDARD  BIN(8) CONSTANT('00'X);           ] @NIA 91102500
*  DCL XSF_STSL_DATA_ACTIVE    BIN(8) CONSTANT('01'X);           ] @NIA 91102600
*  DCL XSF_STSL_DATA_INACTIVE  BIN(8) CONSTANT('02'X);           ] @NIA 91102700
*/********************************************************************/ 91102800
*  DCL XSF_SFI_STLO    BIT(64) CONSTANT('000A8A3314000004'X);    ] @NIA 91102900
*                                   ] Local tasks                  @NIA 91103000
*  DCL XSF_SFI_STLO_ID   BIT(24) CONSTANT('8A3314'X);            ] @NIA 91103100
*  DCL XSF_STLO_LENGTH   BIT(16) CONSTANT('000A'X);              ] @NIA 91103200
*  DCL XSF_STLO_DTYPE    BIT(8)  CONSTANT('04'X);                ] @NIA 91103300
*/********************************************************************/ 91103400
*  DCL XSF_SFI_STLA    BIT(64) CONSTANT('000A8A3300000004'X);    ] @NIA 91103500
*                                   ] Local active tasks           @NIA 91103600
*  DCL XSF_SFI_STLA_ID   BIT(24) CONSTANT('8A3300'X);            ] @NIA 91103700
*  DCL XSF_STLA_LENGTH   BIT(16) CONSTANT('000A'X);              ] @NIA 91103800
*  DCL XSF_STLA_DTYPE    BIT(8)  CONSTANT('04'X);                ] @NIA 91103900
*/********************************************************************/ 91104000
*  DCL XSF_SFI_STLH    BIT(64) CONSTANT('000A8A3307000004'X);    ] @NIA 91104100
*                                   ] Local held tasks             @NIA 91104200
*  DCL XSF_SFI_STLH_ID   BIT(24) CONSTANT('8A3307'X);            ] @NIA 91104300
*  DCL XSF_STLH_LENGTH   BIT(16) CONSTANT('000A'X);              ] @NIA 91104400
*  DCL XSF_STLH_DTYPE    BIT(8)  CONSTANT('04'X);                ] @NIA 91104500
*/********************************************************************/ 91104600
*  DCL XSF_SFI_STSO    BIT(64) CONSTANT('000A8A3664000004'X);    ] @NIA 91104700
*                                   ] Server tasks                 @NIA 91104800
*  DCL XSF_SFI_STSO_ID   BIT(24) CONSTANT('8A3664'X);            ] @NIA 91104900
*  DCL XSF_STSO_LENGTH   BIT(16) CONSTANT('000A'X);              ] @NIA 91105000
*  DCL XSF_STSO_DTYPE    BIT(8)  CONSTANT('04'X);                ] @NIA 91105100
*/********************************************************************/ 91105200
*  DCL XSF_SFI_STSA    BIT(64) CONSTANT('000A8A3650000004'X);    ] @NIA 91105300
*                                   ] Server active tasks          @NIA 91105400
*  DCL XSF_SFI_STSA_ID   BIT(24) CONSTANT('8A3650'X);            ] @NIA 91105500
*  DCL XSF_STSA_LENGTH   BIT(16) CONSTANT('000A'X);              ] @NIA 91105600
*  DCL XSF_STSA_DTYPE    BIT(8)  CONSTANT('04'X);                ] @NIA 91105700
*/********************************************************************/ 91105800
*  DCL XSF_SFI_STSH    BIT(64) CONSTANT('000A8A3657000004'X);    ] @NIA 91105900
*                                   ] Server held tasks            @NIA 91106000
*  DCL XSF_SFI_STSH_ID   BIT(24) CONSTANT('8A3657'X);            ] @NIA 91106100
*  DCL XSF_STSH_LENGTH   BIT(16) CONSTANT('000A'X);              ] @NIA 91106200
*  DCL XSF_STSH_DTYPE    BIT(8)  CONSTANT('04'X);                ] @NIA 91106300
*/********************************************************************/ 91106400
*  DCL XSF_SFI_STQR    BIT(64) CONSTANT('000C8A3515000005'X);    ] @NIA 91106500
*                                   ] Queued requests              @NIA 91106600
*  DCL XSF_SFI_STQR_ID   BIT(24) CONSTANT('8A3515'X);            ] @NIA 91106700
*  DCL XSF_STQR_LENGTH   BIT(16) CONSTANT('000C'X);              ] @NIA 91106800
*  DCL XSF_STQR_DTYPE    BIT(8)  CONSTANT('05'X);                ] @NIA 91106900
*/********************************************************************/ 91107000
*  DCL XSF_SFI_STQN    BIT(64) CONSTANT('000C8A3511000005'X);    ] @NIA 91107100
*                                   ] Queued nowait requests       @NIA 91107200
*  DCL XSF_SFI_STQN_ID   BIT(24) CONSTANT('8A3511'X);            ] @NIA 91107300
*  DCL XSF_STQN_LENGTH   BIT(16) CONSTANT('000C'X);              ] @NIA 91107400
*  DCL XSF_STQN_DTYPE    BIT(8)  CONSTANT('05'X);                ] @NIA 91107500
*/********************************************************************/ 91107600
*  DCL XSF_SFI_STQC    BIT(64) CONSTANT('000C8A3500000005'X);    ] @NIA 91107700
*                                   ] Queued catalog requests      @NIA 91107800
*  DCL XSF_SFI_STQC_ID   BIT(24) CONSTANT('8A3500'X);            ] @NIA 91107900
*  DCL XSF_STQC_LENGTH   BIT(16) CONSTANT('000C'X);              ] @NIA 91108000
*  DCL XSF_STQC_DTYPE    BIT(8)  CONSTANT('05'X);                ] @NIA 91108100
*/********************************************************************/ 91108200
*  DCL XSF_SFI_STLR    BIT(64) CONSTANT('000C8A331700000A'X);    ] @NIA 91108300
*                                   ] Last reserve time            @NIA 91108400
*  DCL XSF_SFI_STLR_ID   BIT(24) CONSTANT('8A3317'X);            ] @NIA 91108500
*  DCL XSF_STLR_LENGTH   BIT(16) CONSTANT('000C'X);              ] @NIA 91108600
*  DCL XSF_STLR_DTYPE    BIT(8)  CONSTANT('0A'X);                ] @NIA 91108700
*/********************************************************************/ 91108800
*  DCL XSF_SFI_STNH    BIT(64) CONSTANT('00098A3400000003'X);    ] @NIA 91108900
*                                   ] New requests held            @NIA 91109000
*  DCL XSF_SFI_STNH_ID   BIT(24) CONSTANT('8A3400'X);            ] @NIA 91109100
*  DCL XSF_STNH_LENGTH   BIT(16) CONSTANT('0009'X);              ] @NIA 91109200
*  DCL XSF_STNH_DTYPE    BIT(8)  CONSTANT('03'X);                ] @NIA 91109300
*                                                                       91109400
*  DCL XSF_STNH_DATA_NOTHELD BIN(8) CONSTANT('00'X);             ] @NIA 91109500
*  DCL XSF_STNH_DATA_HELD    BIN(8) CONSTANT('01'X);             ] @NIA 91109600
*/********************************************************************/ 91109700
*  DCL XSF_SFI_STRH    BIT(64) CONSTANT('00098A3602000003'X);    ] @NIA 91109800
*                                   ] CDS reserved                 @NIA 91109900
*  DCL XSF_SFI_STRH_ID   BIT(24) CONSTANT('8A3602'X);            ] @NIA 91110000
*  DCL XSF_STRH_LENGTH   BIT(16) CONSTANT('0009'X);              ] @NIA 91110100
*  DCL XSF_STRH_DTYPE    BIT(8)  CONSTANT('03'X);                ] @NIA 91110200
*                                                                       91110300
*  DCL XSF_STRH_DATA_DEQ    BIN(8) CONSTANT('00'X);              ] @NIA 91110400
*  DCL XSF_STRH_DATA_ENQ    BIN(8) CONSTANT('01'X);              ] @NIA 91110500
*/********************************************************************/ 91110600
*  DCL XSF_SFI_STPL    BIT(64) CONSTANT('00098A3450000002'X);    ] @NIA 91110700
*                                   ] Trace levels                 @NIA 91110800
*  DCL XSF_SFI_STPL_ID   BIT(24) CONSTANT('8A3450'X);            ] @NIA 91110900
*  DCL XSF_STPL_LENGTH   BIT(16) CONSTANT('0009'X);              ] @NIA 91111000
*  DCL XSF_STPL_DTYPE    BIT(8)  CONSTANT('02'X);                ] @NIA 91111100
*                                                                       91111200
*  DCL XSF_STPL_DATA_LVL1   BIT(8) CONSTANT('80'X);              ] @NIA 91111300
*  DCL XSF_STPL_DATA_LVL2   BIT(8) CONSTANT('40'X);              ] @NIA 91111400
*  DCL XSF_STPL_DATA_LVL3   BIT(8) CONSTANT('20'X);              ] @NIA 91111500
*  DCL XSF_STPL_DATA_LVL4   BIT(8) CONSTANT('10'X);              ] @NIA 91111600
*/********************************************************************/ 91111700
*  DCL XSF_SFI_STRF    BIT(64) CONSTANT('000D8A3600000007'X);    ] @NIA 91111800
*                                   ] Task requesting function     @NIA 91111900
*  DCL XSF_SFI_STRF_ID   BIT(24) CONSTANT('8A3600'X);            ] @NIA 91112000
*  DCL XSF_STRF_LENGTH   BIT(16) CONSTANT('000D'X);              ] @NIA 91112100
*  DCL XSF_STRF_DTYPE    BIT(8)  CONSTANT('07'X);                ] @NIA 91112200
*/********************************************************************/ 91112300
*  DCL XSF_SFI_STRT    BIT(64) CONSTANT('00108A3614000007'X);    ] @NIA 91112400
*                                   ] Task requesting system       @NIA 91112500
*  DCL XSF_SFI_STRT_ID   BIT(24) CONSTANT('8A3614'X);            ] @NIA 91112600
*  DCL XSF_STRT_LENGTH   BIT(16) CONSTANT('0010'X);              ] @NIA 91112700
*  DCL XSF_STRT_DTYPE    BIT(8)  CONSTANT('07'X);                ] @NIA 91112800
*/********************************************************************/ 91112900
*  DCL XSF_SFI_STTR    BIT(64) CONSTANT('000B8A3701000007'X);    ] @NIA 91113000
*                                   ] Task requesting type         @NIA 91113100
*  DCL XSF_SFI_STTR_ID   BIT(24) CONSTANT('8A3701'X);            ] @NIA 91113200
*  DCL XSF_STTR_LENGTH   BIT(16) CONSTANT('000B'X);              ] @NIA 91113300
*  DCL XSF_STTR_DTYPE    BIT(8)  CONSTANT('07'X);                ] @NIA 91113400
*/********************************************************************/ 91113500
*  DCL XSF_SFI_STTQ    BIT(64) CONSTANT('00108A3700000007'X);    ] @NIA 91113600
*                                   ] Task requestor               @NIA 91113700
*  DCL XSF_SFI_STTQ_ID   BIT(24) CONSTANT('8A3700'X);            ] @NIA 91113800
*  DCL XSF_STTQ_LENGTH   BIT(16) CONSTANT('0010'X);              ] @NIA 91113900
*  DCL XSF_STTQ_DTYPE    BIT(8)  CONSTANT('07'X);                ] @NIA 91114000
*/********************************************************************/ 91114100
*  DCL XSF_SFI_STST    BIT(64) CONSTANT('000C8A366900000A'X);    ] @NIA 91114200
*                                   ] Task start time              @NIA 91114300
*  DCL XSF_SFI_STST_ID   BIT(24) CONSTANT('8A3669'X);            ] @NIA 91114400
*  DCL XSF_STST_LENGTH   BIT(16) CONSTANT('000C'X);              ] @NIA 91114500
*  DCL XSF_STST_DTYPE    BIT(8)  CONSTANT('0A'X);                ] @NIA 91114600
*/********************************************************************/ 91114700
*  DCL XSF_SFI_STTT    BIT(64) CONSTANT('000C8A3703000005'X);    ] @NIA 91114800
*                                   ] Task token                   @NIA 91114900
*  DCL XSF_SFI_STTT_ID   BIT(24) CONSTANT('8A3703'X);            ] @NIA 91115000
*  DCL XSF_STTT_LENGTH   BIT(16) CONSTANT('000C'X);              ] @NIA 91115100
*  DCL XSF_STTT_DTYPE    BIT(8)  CONSTANT('05'X);                ] @NIA 91115200
*/********************************************************************/ 91115300
*  DCL XSF_SFI_STTS    BIT(64) CONSTANT('00098A3702000003'X);    ] @NIA 91115400
*                                   ] Task status                  @NIA 91115500
*  DCL XSF_SFI_STTS_ID   BIT(24) CONSTANT('8A3702'X);            ] @NIA 91115600
*  DCL XSF_STTS_LENGTH   BIT(16) CONSTANT('0009'X);              ] @NIA 91115700
*  DCL XSF_STTS_DTYPE    BIT(8)  CONSTANT('03'X);                ] @NIA 91115800
*                                                                       91115900
*  DCL XSF_STTS_DATA_NONE      BIN(8) CONSTANT('00'X);           ] @NIA 91116000
*  DCL XSF_STTS_DATA_HOLD      BIN(8) CONSTANT('01'X);           ] @NIA 91116100
*  DCL XSF_STTS_DATA_CANCEL    BIN(8) CONSTANT('02'X);           ] @NIA 91116200
*  DCL XSF_STTS_DATA_RESERVE   BIN(8) CONSTANT('03'X);           ] @NIA 91116300
*/********************************************************************/ 91116400
*  DCL XSF_SFI_STIV    BIT(64) CONSTANT('00098A3203000003'X);    ] @NIA 91116500
*                                   ] IP verb                      @NIA 91116600
*  DCL XSF_SFI_STIV_ID   BIT(24) CONSTANT('8A3203'X);            ] @NIA 91116700
*  DCL XSF_STIV_LENGTH   BIT(16) CONSTANT('0009'X);              ] @NIA 91116800
*  DCL XSF_STIV_DTYPE    BIT(8)  CONSTANT('03'X);                ] @NIA 91116900
*                                                                       91117000
*  DCL XSF_STIV_DATA_NONE      BIN(8) CONSTANT('00'X);           ] @NIA 91117100
*  DCL XSF_STIV_DATA_READ      BIN(8) CONSTANT('01'X);           ] @NIA 91117200
*  DCL XSF_STIV_DATA_WRITE     BIN(8) CONSTANT('02'X);           ] @NIA 91117300
*  DCL XSF_STIV_DATA_CONNECT   BIN(8) CONSTANT('03'X);           ] @NIA 91117400
*  DCL XSF_STIV_DATA_CLOSE     BIN(8) CONSTANT('04'X);           ] @NIA 91117500
*/********************************************************************/ 91117600
*  DCL XSF_SFI_STIS    BIT(64) CONSTANT('00098A3200000003'X);    ] @NIA 91117700
*                                   ] IP verb state                @NIA 91117800
*  DCL XSF_SFI_STIS_ID   BIT(24) CONSTANT('8A3200'X);            ] @NIA 91117900
*  DCL XSF_STIS_LENGTH   BIT(16) CONSTANT('0009'X);              ] @NIA 91118000
*  DCL XSF_STIS_DTYPE    BIT(8)  CONSTANT('03'X);                ] @NIA 91118100
*                                                                       91118200
*  DCL XSF_STIS_DATA_NONE      BIN(8) CONSTANT('00'X);           ] @NIA 91118300
*  DCL XSF_STIS_DATA_STARTED   BIN(8) CONSTANT('01'X);           ] @NIA 91118400
*  DCL XSF_STIS_DATA_ENDED     BIN(8) CONSTANT('02'X);           ] @NIA 91118500
*/********************************************************************/ 91118600
*  DCL XSF_SFI_STIT    BIT(64) CONSTANT('000C8A320100000A'X);    ] @NIA 91118700
*                                   ] IP verb time                 @NIA 91118800
*  DCL XSF_SFI_STIT_ID   BIT(24) CONSTANT('8A3201'X);            ] @NIA 91118900
*  DCL XSF_STIT_LENGTH   BIT(16) CONSTANT('000C'X);              ] @NIA 91119000
*  DCL XSF_STIT_DTYPE    BIT(8)  CONSTANT('0A'X);                ] @NIA 91119100
*/********************************************************************/ 91119200
*  DCL XSF_SFI_STVC      BIT(64) CONSTANT('000C8A3800000005'X);  ] @LGA 91119300
*                                   ] Stacked volume count         @LGA 91119400
*  DCL XSF_SFI_STVC_ID   BIT(24) CONSTANT('8A3800'X);            ] @LGA 91119500
*  DCL XSF_STVC_LENGTH   BIT(16) CONSTANT('000C'X);              ] @LGA 91122300
*  DCL XSF_STVC_DTYPE    BIT(8)  CONSTANT('05'X);                ] @LGA 91126800
*/********************************************************************/ 91131900
*  DCL XSF_SFI_SUR     BIT(64) CONSTANT('001C8A4000000007'X);           91164000
*                                   ] Owner's surname                   91196100
*  DCL XSF_SFI_SUR_ID    BIT(24) CONSTANT('8A4000'X);                   91228200
*  DCL XSF_SUR_LENGTH    BIT(16) CONSTANT('001C'X);                     91260300
*  DCL XSF_SUR_DTYPE     BIT(8)  CONSTANT('07'X);                       91292400
*/********************************************************************/ 91324500
*  DCL XSF_SFI_SYS     BIT(64) CONSTANT('00108A5000000007'X);           91356600
*                                   ] Creating system ID           @05C 91388700
*  DCL XSF_SFI_SYS_ID    BIT(24) CONSTANT('8A5000'X);                   91420800
*  DCL XSF_SYS_LENGTH    BIT(16) CONSTANT('0010'X);                     91452900
*  DCL XSF_SYS_DTYPE     BIT(8)  CONSTANT('07'X);                       91485000
*/********************************************************************/ 91517100
*  DCL XSF_SFI_TAC     BIT(64) CONSTANT('00098A6000000003'X);           91549200
*                                   ] Reject type                       91581300
*  DCL XSF_SFI_TAC_ID    BIT(24) CONSTANT('8A6000'X);                   91613400
*  DCL XSF_TAC_LENGTH    BIT(16) CONSTANT('0009'X);                     91645500
*  DCL XSF_TAC_DTYPE     BIT(8)  CONSTANT('03'X);                       91677600
*                                                                       91709700
*  DCL XSF_TAC_DATA_ANYUSE      BIN(8) CONSTANT('00'X);                 91741800
*  DCL XSF_TAC_DATA_OUTPUT      BIN(8) CONSTANT('01'X);                 91773900
*/********************************************************************/ 91806000
*  DCL XSF_SFI_TLR     BIT(64) CONSTANT('000C8A680000000A'X);    ] @MCA 91810500
*                                   ] Time last referenced         @MCA 91815000
*  DCL XSF_SFI_TLR_ID    BIT(24) CONSTANT('8A6800'X);            ] @MCA 91819500
*  DCL XSF_TLR_LENGTH    BIT(16) CONSTANT('000C'X);              ] @MCA 91824000
*  DCL XSF_TLR_DTYPE     BIT(8)  CONSTANT('0A'X);                ] @MCA 91828500
*/********************************************************************/ 91833000
*  DCL XSF_SFI_TRD     BIT(64) CONSTANT('000C8A7000000005'X);           91838100
*                                   ] Temporary read errors             91870200
*  DCL XSF_SFI_TRD_ID    BIT(24) CONSTANT('8A7000'X);                   91902300
*  DCL XSF_TRD_LENGTH    BIT(16) CONSTANT('000C'X);                     91934400
*  DCL XSF_TRD_DTYPE     BIT(8)  CONSTANT('05'X);                       91966500
*/********************************************************************/ 91998600
*  DCL XSF_SFI_TVXD    BIT(64) CONSTANT('000C8A7800000005'X);    ] @O9A 91999200
*                                   ] TVEXTPURGE(EXPIRE(days))     @O9A 91999800
*  DCL XSF_SFI_TVXD_ID    BIT(24) CONSTANT('8A7800'X);           ] @O9A 92000400
*  DCL XSF_TVXD_LENGTH    BIT(16) CONSTANT('000C'X);             ] @O9A 92001000
*  DCL XSF_TVXD_DTYPE     BIT(8)  CONSTANT('05'X);               ] @O9A 92001600
*/********************************************************************/ 92002200
*  DCL XSF_SFI_TVXP    BIT(64) CONSTANT('00098A7900000003'X);    ] @03A 92003100
*                                   ] Tape volume exit purge       @03A 92007600
*  DCL XSF_SFI_TVXP_ID    BIT(24) CONSTANT('8A7900'X);           ] @03A 92012100
*  DCL XSF_TVXP_LENGTH    BIT(16) CONSTANT('0009'X);             ] @03A 92016600
*  DCL XSF_TVXP_DTYPE     BIT(8)  CONSTANT('03'X);               ] @03A 92021100
*/********************************************************************/ 92025600
*  DCL XSF_SFI_TWT     BIT(64) CONSTANT('000C8A8000000005'X);           92030700
*                                   ] Temporary write errors            92062800
*  DCL XSF_SFI_TWT_ID    BIT(24) CONSTANT('8A8000'X);                   92094900
*  DCL XSF_TWT_LENGTH    BIT(16) CONSTANT('000C'X);                     92127000
*  DCL XSF_TWT_DTYPE     BIT(8)  CONSTANT('05'X);                       92159100
*/********************************************************************/ 92191200
*  DCL XSF_SFI_TYP     BIT(64) CONSTANT('00098A9000000002'X);           92223300
*                                   ] VRS type                          92255400
*  DCL XSF_SFI_TYP_ID    BIT(24) CONSTANT('8A9000'X);                   92287500
*  DCL XSF_TYP_LENGTH    BIT(16) CONSTANT('0009'X);                     92319600
*  DCL XSF_TYP_DTYPE     BIT(8)  CONSTANT('02'X);                       92351700
*                                                                       92383800
*  DCL XSF_TYP_FLAG_GDG        BIT(8) CONSTANT('80'X);                  92415900
*  DCL XSF_TYP_FLAG_PSEUDGDG   BIT(8) CONSTANT('40'X);                  92448000
*  DCL XSF_TYP_FLAG_DSNAME     BIT(8) CONSTANT('20'X);                  92480100
*  DCL XSF_TYP_FLAG_VOLUME     BIT(8) CONSTANT('10'X);                  92512200
*  DCL XSF_TYP_FLAG_NAME       BIT(8) CONSTANT('08'X);                  92544300
*/********************************************************************/ 92576400
*  DCL XSF_SFI_TZ      BIT(64) CONSTANT('000C8A9E00000005'X);    ] @MDA 92577000
*                                   ] Time zone                    @MDA 92577600
*  DCL XSF_SFI_TZ_ID     BIT(24) CONSTANT('8A9E00'X);            ] @MDA 92578200
*  DCL XSF_TZ_LENGTH     BIT(16) CONSTANT('000C'X);              ] @MDA 92578800
*  DCL XSF_TZ_DTYPE      BIT(8)  CONSTANT('05'X);                ] @MDA 92579400
*/********************************************************************/ 92580000
*  DCL XSF_SFI_UDTJ    BIT(64) CONSTANT('000C8AA000000009'X);    ] @K2A 92580900
*                                   ] Last update date             @K2A 92585400
*  DCL XSF_SFI_UDTJ_ID   BIT(24) CONSTANT('8AA000'X);            ] @K2A 92589900
*  DCL XSF_UDTJ_LENGTH   BIT(16) CONSTANT('000C'X);              ] @K2A 92594400
*  DCL XSF_UDTJ_DTYPE    BIT(8)  CONSTANT('09'X);                ] @K2A 92598900
*/********************************************************************/ 92603400
*  DCL XSF_SFI_UID     BIT(64) CONSTANT('00108AB001000007'X);           92608500
*                                   ] User ID                           92640600
*  DCL XSF_SFI_UID_ID    BIT(24) CONSTANT('8AB001'X);                   92672700
*  DCL XSF_UID_LENGTH    BIT(16) CONSTANT('0010'X);                     92704800
*  DCL XSF_UID_DTYPE     BIT(8)  CONSTANT('07'X);                       92736900
*/********************************************************************/ 92769000
*  DCL XSF_SFI_UNC     BIT(64) CONSTANT('00098AC000000003'X);           92801100
*                                   ] Uncatalog option                  92833200
*  DCL XSF_SFI_UNC_ID    BIT(24) CONSTANT('8AC000'X);                   92865300
*  DCL XSF_UNC_LENGTH    BIT(16) CONSTANT('0009'X);                     92897400
*  DCL XSF_UNC_DTYPE     BIT(8)  CONSTANT('03'X);                       92929500
*                                                                       92961600
*  DCL XSF_UNC_DATA_N           BIN(8) CONSTANT('00'X);                 92993700
*  DCL XSF_UNC_DATA_Y           BIN(8) CONSTANT('01'X);                 93025800
*  DCL XSF_UNC_DATA_S           BIN(8) CONSTANT('02'X);                 93057900
*/********************************************************************/ 93090000
*  DCL XSF_SFI_USEC    BIT(64) CONSTANT('000C8AD000000005'X);           93122100
*                                   ] Volume use count                  93154200
*  DCL XSF_SFI_USEC_ID   BIT(24) CONSTANT('8AD000'X);                   93186300
*  DCL XSF_USEC_LENGTH   BIT(16) CONSTANT('000C'X);                     93218400
*  DCL XSF_USEC_DTYPE    BIT(8)  CONSTANT('05'X);                       93250500
*/********************************************************************/ 93282600
*  DCL XSF_SFI_USEM    BIT(64) CONSTANT('000C8AE000000005'X);           93314700
*                                   ] Volume usage (KB)                 93346800
*  DCL XSF_SFI_USEM_ID   BIT(24) CONSTANT('8AE000'X);                   93378900
*  DCL XSF_USEM_LENGTH   BIT(16) CONSTANT('000C'X);                     93411000
*  DCL XSF_USEM_DTYPE    BIT(8)  CONSTANT('05'X);                       93443100
*/********************************************************************/ 93443200
*  DCL XSF_SFI_USE6    BIT(64) CONSTANT('00168AE030000008'X);    ] @SKA 93443300
*                                   ] Volume usage                 @SKA 93443400
*  DCL XSF_SFI_USE6_ID   BIT(24) CONSTANT('8AE030'X);            ] @SKA 93443500
*  DCL XSF_USE6_LENGTH   BIT(16) CONSTANT('0016'X);              ] @SKA 93443600
*  DCL XSF_USE6_DTYPE    BIT(8)  CONSTANT('08'X);                ] @SKA 93443700
*                                                                       93443800
*  DCL XSF_SFI_USE6_COMP BIT(48) CONSTANT('010303010A06'X);      ] @SKC 93443900
*                                   ] Compound data                @SKA 93444000
*  DCL XSF_SFI_USE6_COMPType   BIT(8)  CONSTANT('01'X);          ] @SKA 93444100
*  DCL XSF_SFI_USE6_COMPLen1   BIT(8)  CONSTANT('03'X);          ] @SKA 93444200
*  DCL XSF_SFI_USE6_COMPTyp1   BIT(8)  CONSTANT('03'X);          ] @SKA 93444300
*  DCL XSF_SFI_USE6_COMPDat1   BIT(8)  CONSTANT('01'X);          ] @SKA 93444400
*  DCL XSF_SFI_USE6_COMPLen2   BIT(8)  CONSTANT('0A'X);          ] @SKA 93444500
*  DCL XSF_SFI_USE6_COMPTyp2   BIT(8)  CONSTANT('06'X);          ] @SKA 93444600
*/********************************************************************/ 93444700
*  DCL XSF_SFI_UTC     BIT(64) CONSTANT('00098AE600000003'X);    ] @MDA 93444800
*                                   ] Common time enabled status   @MDA 93444900
*  DCL XSF_SFI_UTC_ID    BIT(24) CONSTANT('8AE600'X);            ] @MDA 93445000
*  DCL XSF_UTC_LENGTH    BIT(16) CONSTANT('0009'X);              ] @MDA 93445100
*  DCL XSF_UTC_DTYPE     BIT(8)  CONSTANT('03'X);                ] @MDA 93445500
*                                                                ] @MDA 93445900
*  DCL XSF_UTC_DATA_DISABLED   BIN(8) CONSTANT('00'X);           ] @MDA 93446300
*  DCL XSF_UTC_DATA_ENABLED    BIN(8) CONSTANT('01'X);           ] @MDA 93446700
*/********************************************************************/ 93447600
*  DCL XSF_SFI_UTM     BIT(64) CONSTANT('000C8AE80000000A'X);    ] @K2A 93452100
*                                   ] Last update time             @K2A 93456600
*  DCL XSF_SFI_UTM_ID    BIT(24) CONSTANT('8AE800'X);            ] @K2A 93461100
*  DCL XSF_UTM_LENGTH    BIT(16) CONSTANT('000C'X);              ] @K2A 93465600
*  DCL XSF_UTM_DTYPE     BIT(8)  CONSTANT('0A'X);                ] @K2A 93470100
*/********************************************************************/ 93475200
*  DCL XSF_SFI_VAC     BIT(64) CONSTANT('00098AF001000003'X);           93507300
*                                   ] Volume access                     93539400
*  DCL XSF_SFI_VAC_ID    BIT(24) CONSTANT('8AF001'X);                   93571500
*  DCL XSF_VAC_LENGTH    BIT(16) CONSTANT('0009'X);                     93603600
*  DCL XSF_VAC_DTYPE     BIT(8)  CONSTANT('03'X);                       93635700
*                                                                       93667800
*  DCL XSF_VAC_DATA_NONE        BIN(8) CONSTANT('00'X);                 93699900
*  DCL XSF_VAC_DATA_READ        BIN(8) CONSTANT('01'X);                 93732000
*  DCL XSF_VAC_DATA_UPDATE      BIN(8) CONSTANT('02'X);                 93764100
*/********************************************************************/ 93796200
*  DCL XSF_SFI_VACT    BIT(64) CONSTANT('00098B0000000003'X);           93828300
*                                   ] VRSMIN action                     93860400
*  DCL XSF_SFI_VACT_ID   BIT(24) CONSTANT('8B0000'X);                   93892500
*  DCL XSF_VACT_LENGTH   BIT(16) CONSTANT('0009'X);                     93924600
*  DCL XSF_VACT_DTYPE    BIT(8)  CONSTANT('03'X);                       93956700
*                                                                       93988800
*  DCL XSF_VACT_DATA_FAIL       BIN(8) CONSTANT('00'X);                 94020900
*  DCL XSF_VACT_DATA_INFO       BIN(8) CONSTANT('01'X);                 94053000
*  DCL XSF_VACT_DATA_WARN       BIN(8) CONSTANT('02'X);                 94085100
*  DCL XSF_VACT_DATA_OFF        BIN(8) CONSTANT('03'X);          ] @MVA 94085200
*/********************************************************************/ 94085300
*  DCL XSF_SFI_VDRA    BIT(64) CONSTANT('00098B2800000003'X);    ] @MVA 94085400
*                                   ] VRSDROP action                    94085500
*  DCL XSF_SFI_VDRA_ID   BIT(24) CONSTANT('8B2800'X);            ] @MVA 94085600
*  DCL XSF_VDRA_LENGTH   BIT(16) CONSTANT('0009'X);              ] @MVA 94085700
*  DCL XSF_VDRA_DTYPE    BIT(8)  CONSTANT('03'X);                ] @MVA 94085800
*                                                                ] @MVA 94085900
*  DCL XSF_VDRA_DATA_FAIL       BIN(8) CONSTANT('00'X);          ] @MVA 94086000
*  DCL XSF_VDRA_DATA_INFO       BIN(8) CONSTANT('01'X);          ] @MVA 94086100
*  DCL XSF_VDRA_DATA_WARN       BIN(8) CONSTANT('02'X);          ] @MVA 94086200
*  DCL XSF_VDRA_DATA_OFF        BIN(8) CONSTANT('03'X);          ] @MVA 94086300
*/********************************************************************/ 94086400
*  DCL XSF_SFI_VREA    BIT(64) CONSTANT('00098BD500000003'X);    ] @MVA 94086500
*                                   ] VRSRETAIN action                  94086600
*  DCL XSF_SFI_VREA_ID   BIT(24) CONSTANT('8BD500'X);            ] @MVA 94086700
*  DCL XSF_VREA_LENGTH   BIT(16) CONSTANT('0009'X);              ] @MVA 94086800
*  DCL XSF_VREA_DTYPE    BIT(8)  CONSTANT('03'X);                ] @MVA 94086900
*                                                                ] @MVA 94087000
*  DCL XSF_VREA_DATA_FAIL       BIN(8) CONSTANT('00'X);          ] @MVA 94087100
*  DCL XSF_VREA_DATA_INFO       BIN(8) CONSTANT('01'X);          ] @MVA 94087200
*  DCL XSF_VREA_DATA_WARN       BIN(8) CONSTANT('02'X);          ] @MVA 94087300
*  DCL XSF_VREA_DATA_OFF        BIN(8) CONSTANT('03'X);          ] @MVA 94087400
*/********************************************************************/ 94087500
*  DCL XSF_SFI_XDRA    BIT(64) CONSTANT('00098C5D00000003'X);    ] @MVA 94087600
*                                   ] EXPDTDROP action                  94087700
*  DCL XSF_SFI_XDRA_ID   BIT(24) CONSTANT('8C5D00'X);            ] @MVA 94087800
*  DCL XSF_XDRA_LENGTH   BIT(16) CONSTANT('0009'X);              ] @MVA 94087900
*  DCL XSF_XDRA_DTYPE    BIT(8)  CONSTANT('03'X);                ] @MVA 94088000
*                                                                ] @MVA 94088100
*  DCL XSF_XDRA_DATA_FAIL       BIN(8) CONSTANT('00'X);          ] @MVA 94088200
*  DCL XSF_XDRA_DATA_INFO       BIN(8) CONSTANT('01'X);          ] @MVA 94088300
*  DCL XSF_XDRA_DATA_WARN       BIN(8) CONSTANT('02'X);          ] @MVA 94088400
*  DCL XSF_XDRA_DATA_OFF        BIN(8) CONSTANT('03'X);          ] @MVA 94088500
*/********************************************************************/ 94089700
*  DCL XSF_SFI_VANX        BIT(64) CONSTANT('00098B0800000003'X);] @01A 94090900
*                                   ] Next VRS type                     94093800
*  DCL XSF_SFI_VANX_ID     BIT(24) CONSTANT('8B0800'X);          ] @01A 94096700
*  DCL XSF_VANX_LENGTH     BIT(16) CONSTANT('0009'X);            ] @01A 94099600
*  DCL XSF_VANX_DTYPE      BIT(8)  CONSTANT('03'X);              ] @01A 94102500
*                                                                ] @01A 94105400
*  DCL XSF_VANX_DATA_NONE  BIN(8) CONSTANT('00'X);               ] @01A 94108300
*  DCL XSF_VANX_DATA_NEXT  BIN(8) CONSTANT('01'X);               ] @01A 94111200
*  DCL XSF_VANX_DATA_AND   BIN(8) CONSTANT('02'X);               ] @01A 94114100
*/********************************************************************/ 94117200
*  DCL XSF_SFI_VCAP    BIT(64) CONSTANT('000C8B0B00000005'X);    ] @S9A 94121700
*                                   ] Volume capacity                   94126200
*  DCL XSF_SFI_VCAP_ID   BIT(24) CONSTANT('8B0B00'X);            ] @S9A 94130700
*  DCL XSF_VCAP_LENGTH   BIT(16) CONSTANT('000C'X);              ] @S9A 94135200
*  DCL XSF_VCAP_DTYPE    BIT(8)  CONSTANT('05'X);                ] @S9A 94139700
*/********************************************************************/ 94144200
*  DCL XSF_SFI_VCHG    BIT(64) CONSTANT('00098B1000000003'X);           94149300
*                                   ] VRSCHANGE value                   94181400
*  DCL XSF_SFI_VCHG_ID   BIT(24) CONSTANT('8B1000'X);                   94213500
*  DCL XSF_VCHG_LENGTH   BIT(16) CONSTANT('0009'X);                     94245600
*  DCL XSF_VCHG_DTYPE    BIT(8)  CONSTANT('03'X);                       94277700
*                                                                       94309800
*  DCL XSF_VCHG_DATA_INFO       BIN(8) CONSTANT('00'X);                 94341900
*  DCL XSF_VCHG_DATA_VERIFY     BIN(8) CONSTANT('01'X);                 94374000
*/********************************************************************/ 94406100
*  DCL XSF_SFI_VDD     BIT(64) CONSTANT('000A8B2000000004'X);           94438200
*                                   ] VRS delay days                    94470300
*  DCL XSF_SFI_VDD_ID    BIT(24) CONSTANT('8B2000'X);                   94502400
*  DCL XSF_VDD_LENGTH    BIT(16) CONSTANT('000A'X);                     94534500
*  DCL XSF_VDD_DTYPE     BIT(8)  CONSTANT('04'X);                       94566600
*/********************************************************************/ 94598700
*  DCL XSF_SFI_VDTJ    BIT(64) CONSTANT('000C8B3000000009'X);           94630800
*                                   ] Last inventory management         94652200
*                                   ] processing date                   94673600
*  DCL XSF_SFI_VDTJ_ID   BIT(24) CONSTANT('8B3000'X);                   94695000
*  DCL XSF_VDTJ_LENGTH   BIT(16) CONSTANT('000C'X);                     94727100
*  DCL XSF_VDTJ_DTYPE    BIT(8)  CONSTANT('09'X);                       94759200
*/********************************************************************/ 94791300
*  DCL XSF_SFI_VER     BIT(64) CONSTANT('000E8B4000000007'X);           94823400
*                                   ] Software product version          94855500
*  DCL XSF_SFI_VER_ID    BIT(24) CONSTANT('8B4000'X);                   94887600
*  DCL XSF_VER_LENGTH    BIT(16) CONSTANT('000E'X);                     94919700
*  DCL XSF_VER_DTYPE     BIT(8)  CONSTANT('07'X);                       94951800
*/********************************************************************/ 94983900
*  DCL XSF_SFI_VEX     BIT(64) CONSTANT('00098B4100000003'X);           94987100
*                                   ] VRSEL EXCLUDE                @OFA 94990300
*  DCL XSF_SFI_VEX_ID     BIT(24) CONSTANT('8B4100'X);           ] @OFA 94993500
*  DCL XSF_VEX_LENGTH     BIT(16) CONSTANT('0009'X);             ] @OFA 94996700
*  DCL XSF_VEX_DTYPE      BIT(8)  CONSTANT('03'X);               ] @OFA 94999900
*                                                                       95003100
*  DCL XSF_VEX_DATA_NO          BIN(8) CONSTANT('00'X);          ] @OFA 95006300
*  DCL XSF_VEX_DATA_YES         BIN(8) CONSTANT('01'X);          ] @OFA 95009500
*/********************************************************************/ 95012700
*  DCL XSF_SFI_VJBN    BIT(64) CONSTANT('00108B5000000007'X);           95016000
*                                   ] Primary VRS job name         @01C 95048100
*  DCL XSF_SFI_VJBN_ID   BIT(24) CONSTANT('8B5000'X);                   95080200
*  DCL XSF_VJBN_LENGTH   BIT(16) CONSTANT('0010'X);                     95112300
*  DCL XSF_VJBN_DTYPE    BIT(8)  CONSTANT('07'X);                       95144400
*/********************************************************************/ 95176500
*  DCL XSF_SFI_VLN     BIT(64) CONSTANT('000C8B6000000005'X);           95208600
*                                   ] Number of volumes                 95240700
*  DCL XSF_SFI_VLN_ID    BIT(24) CONSTANT('8B6000'X);                   95272800
*  DCL XSF_VLN_LENGTH    BIT(16) CONSTANT('000C'X);                     95304900
*  DCL XSF_VLN_DTYPE     BIT(8)  CONSTANT('05'X);                       95337000
*/********************************************************************/ 95369100
*  DCL XSF_SFI_VM      BIT(64) CONSTANT('00098B7000000003'X);           95401200
*                                   ] VM use                            95433300
*  DCL XSF_SFI_VM_ID     BIT(24) CONSTANT('8B7000'X);                   95465400
*  DCL XSF_VM_LENGTH     BIT(16) CONSTANT('0009'X);                     95497500
*  DCL XSF_VM_DTYPE      BIT(8)  CONSTANT('03'X);                       95529600
*                                                                       95561700
*  DCL XSF_VM_DATA_NO           BIN(8) CONSTANT('00'X);                 95593800
*  DCL XSF_VM_DATA_YES          BIN(8) CONSTANT('01'X);                 95625900
*/********************************************************************/ 95658000
*  DCL XSF_SFI_VMIN    BIT(64) CONSTANT('000C8B8000000005'X);           95690100
*                                   ] VRSMIN count value                95722200
*  DCL XSF_SFI_VMIN_ID   BIT(24) CONSTANT('8B8000'X);                   95754300
*  DCL XSF_VMIN_LENGTH   BIT(16) CONSTANT('000C'X);                     95786400
*  DCL XSF_VMIN_DTYPE    BIT(8)  CONSTANT('05'X);                       95818500
*/********************************************************************/ 95819300
*  DCL XSF_SFI_VDRC    BIT(64) CONSTANT('000C8B2802000005'X);    ] @MVA 95820100
*                                   ] VRSDROP count value               95820900
*  DCL XSF_SFI_VDRC_ID   BIT(24) CONSTANT('8B2802'X);            ] @MVA 95821700
*  DCL XSF_VDRC_LENGTH   BIT(16) CONSTANT('000C'X);              ] @MVA 95822500
*  DCL XSF_VDRC_DTYPE    BIT(8)  CONSTANT('05'X);                ] @MVA 95823300
*/********************************************************************/ 95824100
*  DCL XSF_SFI_VREC    BIT(64) CONSTANT('000C8BD502000005'X);    ] @MVA 95824900
*                                   ] VRSRETAIN count value             95825700
*  DCL XSF_SFI_VREC_ID   BIT(24) CONSTANT('8BD502'X);            ] @MVA 95826500
*  DCL XSF_VREC_LENGTH   BIT(16) CONSTANT('000C'X);              ] @MVA 95827300
*  DCL XSF_VREC_DTYPE    BIT(8)  CONSTANT('05'X);                ] @MVA 95828100
*/********************************************************************/ 95828900
*  DCL XSF_SFI_XDRC    BIT(64) CONSTANT('000C8C5D02000005'X);    ] @MVA 95829700
*                                   ] EXPDTDROP count value             95830500
*  DCL XSF_SFI_XDRC_ID   BIT(24) CONSTANT('8C5D02'X);            ] @MVA 95831300
*  DCL XSF_XDRC_LENGTH   BIT(16) CONSTANT('000C'X);              ] @MVA 95832100
*  DCL XSF_XDRC_DTYPE    BIT(8)  CONSTANT('05'X);                ] @MVA 95832900
*/********************************************************************/ 95833700
*  DCL XSF_SFI_VDRP    BIT(64) CONSTANT('000A8B280F000004'X);    ] @MVA 95834500
*                                   ] VRSDROP percent value             95835300
*  DCL XSF_SFI_VDRP_ID   BIT(24) CONSTANT('8B280F'X);            ] @MVA 95836100
*  DCL XSF_VDRP_LENGTH   BIT(16) CONSTANT('000A'X);              ] @MVA 95836900
*  DCL XSF_VDRP_DTYPE    BIT(8)  CONSTANT('04'X);                ] @MVA 95837700
*/********************************************************************/ 95838500
*  DCL XSF_SFI_VREP    BIT(64) CONSTANT('000A8BD50F000004'X);    ] @MVA 95839300
*                                   ] VRSRETAIN percent value           95840100
*  DCL XSF_SFI_VREP_ID   BIT(24) CONSTANT('8BD50F'X);            ] @MVA 95840900
*  DCL XSF_VREP_LENGTH   BIT(16) CONSTANT('000A'X);              ] @MVA 95841700
*  DCL XSF_VREP_DTYPE    BIT(8)  CONSTANT('04'X);                ] @MVA 95842500
*/********************************************************************/ 95843300
*  DCL XSF_SFI_XDRP    BIT(64) CONSTANT('000A8C5D0F000004'X);    ] @MVA 95844100
*                                   ] EXPDTDROP percent value           95844900
*  DCL XSF_SFI_XDRP_ID   BIT(24) CONSTANT('8C5D0F'X);            ] @MVA 95845700
*  DCL XSF_XDRP_LENGTH   BIT(16) CONSTANT('000A'X);              ] @MVA 95846500
*  DCL XSF_XDRP_DTYPE    BIT(8)  CONSTANT('04'X);                ] @MVA 95847300
*/********************************************************************/ 95850600
*  DCL XSF_SFI_VMV     BIT(64) CONSTANT('00108B9000000007'X);           95882700
*                                   ] VRS management value              95914800
*  DCL XSF_SFI_VMV_ID    BIT(24) CONSTANT('8B9000'X);                   95946900
*  DCL XSF_VMV_LENGTH    BIT(16) CONSTANT('0010'X);                     95979000
*  DCL XSF_VMV_DTYPE     BIT(8)  CONSTANT('07'X);                       96011100
*/********************************************************************/ 96013500
*  DCL XSF_SFI_VWMC    BIT(64) CONSTANT('000C8B9100000005'X);    ] @SGA 96015900
*                                   ] Volume write mount count          96018300
*  DCL XSF_SFI_VWMC_ID   BIT(24) CONSTANT('8B9100'X);            ] @SGA 96020700
*  DCL XSF_VWMC_LENGTH   BIT(16) CONSTANT('000C'X);              ] @SGA 96023100
*  DCL XSF_VWMC_DTYPE    BIT(8)  CONSTANT('05'X);                ] @SGA 96025500
*/********************************************************************/ 96027900
*  DCL XSF_SFI_VNDR    BIT(64) CONSTANT('00108B9E00000001'X);    ] @SGA 96030300
*                                   ] Vendor                            96032700
*  DCL XSF_SFI_VNDR_ID   BIT(24) CONSTANT('8B9E00'X);            ] @SGA 96035100
*  DCL XSF_VNDR_LENGTH   BIT(16) CONSTANT('0010'X);              ] @SGA 96037500
*  DCL XSF_VNDR_DTYPE    BIT(8)  CONSTANT('01'X);                ] @SGA 96039900
*/********************************************************************/ 96043200
*  DCL XSF_SFI_VNME    BIT(64) CONSTANT('00348BA000000007'X);           96075300
*                                   ] Primary VRS name             @01C 96107400
*  DCL XSF_SFI_VNME_ID   BIT(24) CONSTANT('8BA000'X);                   96139500
*  DCL XSF_VNME_LENGTH   BIT(16) CONSTANT('0034'X);                     96171600
*  DCL XSF_VNME_DTYPE    BIT(8)  CONSTANT('07'X);                       96203700
*/********************************************************************/ 96235800
*  DCL XSF_SFI_VOL     BIT(64) CONSTANT('000E8BC000000001'X);           96267900
*                                   ] Volume serial number              96300000
*  DCL XSF_SFI_VOL_ID    BIT(24) CONSTANT('8BC000'X);                   96332100
*  DCL XSF_VOL_LENGTH    BIT(16) CONSTANT('000E'X);                     96364200
*  DCL XSF_VOL_DTYPE     BIT(8)  CONSTANT('01'X);                       96396300
*/********************************************************************/ 96399500
*  DCL XSF_SFI_VOLT    BIT(64) CONSTANT('00098BC200000003'X);    ] @S8A 96402700
*                                   ] Volume type                       96405900
*  DCL XSF_SFI_VOLT_ID   BIT(24) CONSTANT('8BC200'X);            ] @S8A 96409100
*  DCL XSF_VOLT_LENGTH   BIT(16) CONSTANT('0009'X);              ] @S8A 96412300
*  DCL XSF_VOLT_DTYPE    BIT(8)  CONSTANT('03'X);                ] @S8A 96415500
*                                                                ] @S8A 96418700
*  DCL XSF_VOLT_PHYSICAL BIN(8) CONSTANT('00'X);                 ] @S8A 96421900
*  DCL XSF_VOLT_LOGICAL  BIN(8) CONSTANT('01'X);                 ] @S8A 96425100
*  DCL XSF_VOLT_STACKED  BIN(8) CONSTANT('02'X);                 ] @LSA 96425300
*/********************************************************************/ 96425600
*  DCL XSF_SFI_VPCT    BIT(64) CONSTANT('00098BC300000003'X);    ] @S9A 96425900
*                                   ] Volume percent full               96426300
*  DCL XSF_SFI_VPCT_ID   BIT(24) CONSTANT('8BC300'X);            ] @S9A 96426700
*  DCL XSF_VPCT_LENGTH   BIT(16) CONSTANT('0009'X);              ] @S9A 96427100
*  DCL XSF_VPCT_DTYPE    BIT(8)  CONSTANT('03'X);                ] @S9A 96427500
*/********************************************************************/ 96427600
*  DCL XSF_SFI_VOL1    BIT(64) CONSTANT('000E8BCD00000001'X);    ] @LSA 96427700
*                                   ] VOL1 label volume serial number   96427800
*  DCL XSF_SFI_VOL1_ID   BIT(24) CONSTANT('8BCD00'X);            ] @LSA 96427900
*  DCL XSF_VOL1_LENGTH   BIT(16) CONSTANT('000E'X);              ] @LSA 96428000
*  DCL XSF_VOL1_DTYPE    BIT(8)  CONSTANT('01'X);                ] @LSA 96428100
*/********************************************************************/ 96428400
*  DCL XSF_SFI_VRC     BIT(64) CONSTANT('000C8BD000000005'X);           96460500
*                                   ] Vital record count                96492600
*  DCL XSF_SFI_VRC_ID    BIT(24) CONSTANT('8BD000'X);                   96524700
*  DCL XSF_VRC_LENGTH    BIT(16) CONSTANT('000C'X);                     96556800
*  DCL XSF_VRC_DTYPE     BIT(8)  CONSTANT('05'X);                       96588900
*/********************************************************************/ 96621000
*  DCL XSF_SFI_VRJ     BIT(64) CONSTANT('00098BE000000003'X);           96653100
*                                   ] Vital record job name             96685200
*  DCL XSF_SFI_VRJ_ID    BIT(24) CONSTANT('8BE000'X);                   96717300
*  DCL XSF_VRJ_LENGTH    BIT(16) CONSTANT('0009'X);                     96749400
*  DCL XSF_VRJ_DTYPE     BIT(8)  CONSTANT('03'X);                       96781500
*                                                                       96813600
*  DCL XSF_VRJ_DATA_1           BIN(8) CONSTANT('01'X);                 96845700
*  DCL XSF_VRJ_DATA_2           BIN(8) CONSTANT('02'X);                 96877800
*/********************************************************************/ 96909900
*  DCL XSF_SFI_VRS     BIT(64) CONSTANT('00348BF000000007'X);           96942000
*                                   ] Vital record specification        96974100
*  DCL XSF_SFI_VRS_ID    BIT(24) CONSTANT('8BF000'X);                   97006200
*  DCL XSF_VRS_LENGTH    BIT(16) CONSTANT('0034'X);                     97038300
*  DCL XSF_VRS_DTYPE     BIT(8)  CONSTANT('07'X);                       97070400
*/********************************************************************/ 97072000
*  DCL XSF_SFI_VRSI      BIT(64) CONSTANT('00098BF500000003'X);  ] @01A 97073600
*                                   ] Scratch immediate                 97075200
*  DCL XSF_SFI_VRSI_ID   BIT(24) CONSTANT('8BF500'X);            ] @01A 97076800
*  DCL XSF_VRSI_LENGTH   BIT(16) CONSTANT('0009'X);              ] @01A 97078400
*  DCL XSF_VRSI_DTYPE    BIT(8)  CONSTANT('03'X);                ] @01A 97080000
*                                                                ] @01A 97081600
*  DCL XSF_VRSI_DATA_NO  BIN(8)  CONSTANT('00'X);                ] @01A 97083200
*  DCL XSF_VRSI_DATA_YES BIN(8)  CONSTANT('01'X);                ] @01A 97084800
*/********************************************************************/ 97086400
*  DCL XSF_SFI_VRSL      BIT(64) CONSTANT('00098BFA00000003'X);  ] @01A 97088000
*                                   ] VRSEL value                       97089600
*  DCL XSF_SFI_VRSL_ID   BIT(24) CONSTANT('8BFA00'X);            ] @01A 97091200
*  DCL XSF_VRSL_LENGTH   BIT(16) CONSTANT('0009'X);              ] @01A 97092800
*  DCL XSF_VRSL_DTYPE    BIT(8)  CONSTANT('03'X);                ] @01A 97094400
*                                                                ] @01A 97096000
*  DCL XSF_VRSL_DATA_NEW BIN(8)  CONSTANT('01'X);                ] @01A 97100300
*/********************************************************************/ 97102500
*  DCL XSF_SFI_VRSR    BIT(64) CONSTANT('00098C0000000003'X);           97134600
*                                   ] VRS retained                      97166700
*  DCL XSF_SFI_VRSR_ID   BIT(24) CONSTANT('8C0000'X);                   97198800
*  DCL XSF_VRSR_LENGTH   BIT(16) CONSTANT('0009'X);                     97230900
*  DCL XSF_VRSR_DTYPE    BIT(8)  CONSTANT('03'X);                       97263000
*                                                                       97295100
*  DCL XSF_VRSR_DATA_NO         BIN(8) CONSTANT('00'X);                 97327200
*  DCL XSF_VRSR_DATA_YES        BIN(8) CONSTANT('01'X);                 97359300
*/********************************************************************/ 97360700
*  DCL XSF_SFI_VRXI       BIT(64) CONSTANT('00098C0800000003'X); ] @01A 97362100
*                                   ] Expiration date ignore            97363500
*  DCL XSF_SFI_VRXI_ID    BIT(24) CONSTANT('8C0800'X);           ] @01A 97364900
*  DCL XSF_VRXI_LENGTH    BIT(16) CONSTANT('0009'X);             ] @01A 97366300
*  DCL XSF_VRXI_DTYPE     BIT(8)  CONSTANT('03'X);               ] @01A 97367700
*                                                                ] @01A 97369100
*  DCL XSF_VRXI_DATA_NO   BIN(8)  CONSTANT('00'X);               ] @01A 97370500
*  DCL XSF_VRXI_DATA_YES  BIN(8)  CONSTANT('01'X);               ] @01A 97371900
*/********************************************************************/ 97373300
*  DCL XSF_SFI_VSCD       BIT(64) CONSTANT('000C8C1000000009'X); ] @01A 97374700
*                                   ] Primary VRS subchain start date   97376100
*  DCL XSF_SFI_VSCD_ID    BIT(24) CONSTANT('8C1000'X);           ] @01A 97377500
*  DCL XSF_VSCD_LENGTH    BIT(16) CONSTANT('000C'X);             ] @01A 97378900
*  DCL XSF_VSCD_DTYPE     BIT(8)  CONSTANT('09'X);               ] @01A 97380300
*/********************************************************************/ 97381700
*  DCL XSF_SFI_VSCN       BIT(64) CONSTANT('00108C1800000007'X); ] @01A 97383100
*                                   ] Primary VRS subchain name         97384500
*  DCL XSF_SFI_VSCN_ID    BIT(24) CONSTANT('8C1800'X);           ] @01A 97385900
*  DCL XSF_VSCN_LENGTH    BIT(16) CONSTANT('0010'X);             ] @01A 97387300
*  DCL XSF_VSCN_DTYPE     BIT(8)  CONSTANT('07'X);               ] @01A 97388700
*/********************************************************************/ 97391400
*  DCL XSF_SFI_VST     BIT(64) CONSTANT('00098C2000000002'X);           97423500
*                                   ] Volume status                     97455600
*  DCL XSF_SFI_VST_ID    BIT(24) CONSTANT('8C2000'X);                   97487700
*  DCL XSF_VST_LENGTH    BIT(16) CONSTANT('0009'X);                     97519800
*  DCL XSF_VST_DTYPE     BIT(8)  CONSTANT('02'X);                       97551900
*                                                                       97584000
*  DCL XSF_VST_FLAG_MASTER     BIT(8) CONSTANT('80'X);                  97616100
*  DCL XSF_VST_FLAG_SCRATCH    BIT(8) CONSTANT('40'X);                  97648200
*  DCL XSF_VST_FLAG_USER       BIT(8) CONSTANT('20'X);                  97680300
*  DCL XSF_VST_FLAG_INIT       BIT(8) CONSTANT('10'X);                  97712400
*  DCL XSF_VST_FLAG_ENTRY      BIT(8) CONSTANT('08'X);                  97744500
*/********************************************************************/ 97776600
*  DCL XSF_SFI_VTM     BIT(64) CONSTANT('000C8C300000000A'X);           97808700
*                                   ] Last inventory management         97830100
*                                   ] VRS time                          97851500
*  DCL XSF_SFI_VTM_ID    BIT(24) CONSTANT('8C3000'X);                   97872900
*  DCL XSF_VTM_LENGTH    BIT(16) CONSTANT('000C'X);                     97905000
*  DCL XSF_VTM_DTYPE     BIT(8)  CONSTANT('0A'X);                       97937100
*/********************************************************************/ 97969200
*  DCL XSF_SFI_VTYP    BIT(64) CONSTANT('00098C4000000003'X);           98001300
*                                   ] Primary VRS type                  98033400
*  DCL XSF_SFI_VTYP_ID   BIT(24) CONSTANT('8C4000'X);                   98065500
*  DCL XSF_VTYP_LENGTH   BIT(16) CONSTANT('0009'X);                     98097600
*  DCL XSF_VTYP_DTYPE    BIT(8)  CONSTANT('03'X);                       98129700
*                                                                       98161800
*  DCL XSF_VTYP_DATA_UNDEFINED  BIN(8) CONSTANT('00'X);                 98193900
*  DCL XSF_VTYP_DATA_DATASET    BIN(8) CONSTANT('01'X);                 98226000
*  DCL XSF_VTYP_DATA_SMSMC      BIN(8) CONSTANT('02'X);                 98258100
*  DCL XSF_VTYP_DATA_VRSMV      BIN(8) CONSTANT('03'X);                 98290200
*  DCL XSF_VTYP_DATA_DSNMV      BIN(8) CONSTANT('04'X);                 98322300
*  DCL XSF_VTYP_DATA_DSNMC      BIN(8) CONSTANT('05'X);          ] @01A 98338300
*/********************************************************************/ 98338402
*  DCL XSF_SFI_WCTL       BIT(64) CONSTANT('00098C4150000003'X); ] @M2A 98338502
*                                   ] Volume WHILECATALOG          @M2A 98338602
*  DCL XSF_SFI_WCTL_ID          BIT(24) CONSTANT('8C4150'X);     ] @M2A 98338702
*  DCL XSF_WCTL_LENGTH          BIT(16) CONSTANT('0009'X);       ] @M2A 98338802
*  DCL XSF_WCTL_DTYPE           BIT(8)  CONSTANT('03'X);         ] @M2A 98338902
*                                                                ] @M2A 98339002
*  DCL XSF_WCTL_DATA_OFF           BIN(8)  CONSTANT('00'X);      ] @M2A 98339102
*  DCL XSF_WCTL_DATA_ON            BIN(8)  CONSTANT('20'X);      ] @K5C 98339202
*  DCL XSF_WCTL_DATA_UNTILEXPIRED  BIN(8)  CONSTANT('10'X);      ] @K5C 98339300
*/********************************************************************/ 98339400
*  DCL XSF_SFI_WORM      BIT(64) CONSTANT('00098C4300000003'X);  ] @10A 98339500
*                                   ] WORM flag                         98339600
*  DCL XSF_SFI_WORM_ID   BIT(24) CONSTANT('8C4300'X);            ] @10A 98339700
*  DCL XSF_WORM_LENGTH   BIT(16) CONSTANT('0009'X);              ] @10A 98339800
*  DCL XSF_WORM_DTYPE    BIT(8)  CONSTANT('03'X);                ] @10A 98339900
*                                                                ] @10A 98340000
*  DCL XSF_WORM_DATA_NO  BIN(8)  CONSTANT('00'X);                ] @10A 98340100
*  DCL XSF_WORM_DATA_YES BIN(8)  CONSTANT('01'X);                ] @10A 98340200
*/********************************************************************/ 98341500
*  DCL XSF_SFI_WWID    BIT(64) CONSTANT('00208C4500000001'X);    ] @SGA 98342900
*                                   ] World wide ID                     98345200
*  DCL XSF_SFI_WWID_ID   BIT(24) CONSTANT('8C4500'X);            ] @SGA 98347500
*  DCL XSF_WWID_LENGTH   BIT(16) CONSTANT('0020'X);              ] @SGA 98349800
*  DCL XSF_WWID_DTYPE    BIT(8)  CONSTANT('01'X);                ] @SGA 98352100
*/********************************************************************/ 98354400
*  DCL XSF_SFI_XDC     BIT(64) CONSTANT('00098C5000000003'X);           98675400
*                                   ] Expiration date check             98707500
*  DCL XSF_SFI_XDC_ID    BIT(24) CONSTANT('8C5000'X);                   98739600
*  DCL XSF_XDC_LENGTH    BIT(16) CONSTANT('0009'X);                     98771700
*  DCL XSF_XDC_DTYPE     BIT(8)  CONSTANT('03'X);                       98803800
*                                                                       98835900
*  DCL XSF_XDC_DATA_NO          BIN(8) CONSTANT('00'X);                 98868000
*  DCL XSF_XDC_DATA_YES         BIN(8) CONSTANT('01'X);                 98900100
*  DCL XSF_XDC_DATA_OPERATOR    BIN(8) CONSTANT('02'X);                 98932200
*/********************************************************************/ 98964300
*  DCL XSF_SFI_XDTJ    BIT(64) CONSTANT('000C8C6000000009'X);           98996400
*                                   ] Expiration date                   99028500
*  DCL XSF_SFI_XDTJ_ID   BIT(24) CONSTANT('8C6000'X);                   99060600
*  DCL XSF_XDTJ_LENGTH   BIT(16) CONSTANT('000C'X);                     99092700
*  DCL XSF_XDTJ_DTYPE    BIT(8)  CONSTANT('09'X);                       99124800
*/********************************************************************/ 99156900
*  DCL XSF_SFI_XDSB      BIT(64) CONSTANT('00098C6100000003'X);  ] @O8A 99158300
*                                   ] Expiry date set by                99159700
*  DCL XSF_SFI_XDSB_ID   BIT(24) CONSTANT('8C6100'X);            ] @O8A 99161100
*  DCL XSF_XDSB_LENGTH   BIT(16) CONSTANT('0009'X);              ] @O8A 99162500
*  DCL XSF_XDSB_DTYPE    BIT(8)  CONSTANT('03'X);                ] @O8A 99163900
*                                                                       99165300
*  DCL XSF_XDSB_DATA_UNKNOWN      BIN(8) CONSTANT(0);            ] @O8A 99166700
*  DCL XSF_XDSB_DATA_CMD          BIN(8) CONSTANT(1);            ] @O8A 99168100
*  DCL XSF_XDSB_DATA_CMD_DEF      BIN(8) CONSTANT(2);            ] @O8A 99169500
*  DCL XSF_XDSB_DATA_CMD_VOLCAT   BIN(8) CONSTANT(3);            ] @O8A 99170900
*  DCL XSF_XDSB_DATA_OCE_JFCB     BIN(8) CONSTANT(4);            ] @O8A 99172300
*  DCL XSF_XDSB_DATA_OCE_EXIT     BIN(8) CONSTANT(5);            ] @O8A 99173700
*  DCL XSF_XDSB_DATA_OCE_DEF      BIN(8) CONSTANT(6);            ] @O8A 99175100
*  DCL XSF_XDSB_DATA_OCE_MAX      BIN(8) CONSTANT(7);            ] @O8A 99176500
*  DCL XSF_XDSB_DATA_OCE_VOLCAT   BIN(8) CONSTANT(8);            ] @O8A 99177900
*  DCL XSF_XDSB_DATA_LCS          BIN(8) CONSTANT(9);            ] @O8A 99179300
*  DCL XSF_XDSB_DATA_LCS_DEF      BIN(8) CONSTANT(10);           ] @O8A 99180700
*  DCL XSF_XDSB_DATA_TVEXTPURGE   BIN(8) CONSTANT(11);           ] @O8A 99182100
*  DCL XSF_XDSB_DATA_CNVT         BIN(8) CONSTANT(12);           ] @O8A 99183500
*  DCL XSF_XDSB_DATA_EXPORT       BIN(8) CONSTANT(13);           ] @O8A 99184900
*  DCL XSF_XDSB_DATA_LASTREF      BIN(8) CONSTANT(14);           ] @OQA 99185600
*  DCL XSF_XDSB_DATA_OCE_MC       BIN(8) CONSTANT(15);           ] @OVA 99185702
*  DCL XSF_XDSB_DATA_CATRETPD     BIN(8) CONSTANT(16);           ] @M2A 99185802
*  DCL XSF_XDSB_DATA_Catlg_Days   BIN(8) CONSTANT(17);           ] @M2A 99185900
*  DCL XSF_XDSB_DATA_DEFTABLE     BIN(8) CONSTANT(18);           ] @M3A 99186002
*/********************************************************************/ 99186300
*  DCL XSF_SFI_XTM     BIT(64) CONSTANT('000C8C700000000A'X);           99189000
*                                   ] Last inventory management         99210400
*                                   ] expiration time                   99231800
*  DCL XSF_SFI_XTM_ID    BIT(24) CONSTANT('8C7000'X);                   99253200
*  DCL XSF_XTM_LENGTH    BIT(16) CONSTANT('000C'X);                     99285300
*  DCL XSF_XTM_DTYPE     BIT(8)  CONSTANT('0A'X);                       99317400
*/********************************************************************/ 99317500
*  DCL XSF_SFI_X100      BIT(64) CONSTANT('00098C7800000003'X);  ] @LGA 99317600
*                                   ] EDGUX100 exit status              99317700
*  DCL XSF_SFI_X100_ID   BIT(24) CONSTANT('8C7800'X);            ] @LGA 99317800
*  DCL XSF_X100_LENGTH   BIT(16) CONSTANT('0009'X);              ] @LGA 99317900
*  DCL XSF_X100_DTYPE    BIT(8)  CONSTANT('03'X);                ] @LGA 99318000
*/********************************************************************/ 99318100
*  DCL XSF_SFI_X200      BIT(64) CONSTANT('00098C7801000003'X);  ] @LGA 99318200
*                                   ] EDGUX200 exit status              99318300
*  DCL XSF_SFI_X200_ID   BIT(24) CONSTANT('8C7801'X);            ] @LGA 99318400
*  DCL XSF_X200_LENGTH   BIT(16) CONSTANT('0009'X);              ] @LGA 99318500
*  DCL XSF_X200_DTYPE    BIT(8)  CONSTANT('03'X);                ] @LGA 99318600
*/********************************************************************/ 99318700
*  DCL XSF_SFI_X300      BIT(64) CONSTANT('00098C7802000003'X);  ] @07A 99318800
*                                   ] EDGUX300 exit status              99318900
*  DCL XSF_SFI_X300_ID   BIT(24) CONSTANT('8C7802'X);            ] @07A 99319000
*  DCL XSF_X300_LENGTH   BIT(16) CONSTANT('0009'X);              ] @07A 99319100
*  DCL XSF_X300_DTYPE    BIT(8)  CONSTANT('03'X);                ] @07A 99319200
*/********************************************************************/ 99319500
*  DCL XSF_SFI_2JBN      BIT(64) CONSTANT('00108C8000000007'X);  ] @01A 99319800
*                                   ] Second VRS job name mask          99321000
*  DCL XSF_SFI_2JBN_ID   BIT(24) CONSTANT('8C8000'X);            ] @01A 99322200
*  DCL XSF_2JBN_LENGTH   BIT(16) CONSTANT('0010'X);              ] @01A 99323400
*  DCL XSF_2JBN_DTYPE    BIT(8)  CONSTANT('07'X);                ] @01A 99324600
*/********************************************************************/ 99325800
*  DCL XSF_SFI_2NME      BIT(64) CONSTANT('00108C9000000007'X);  ] @01A 99327000
*                                   ] Secondary VRS mask                99328200
*  DCL XSF_SFI_2NME_ID   BIT(24) CONSTANT('8C9000'X);            ] @01A 99329400
*  DCL XSF_2NME_LENGTH   BIT(16) CONSTANT('0010'X);              ] @01A 99330600
*  DCL XSF_2NME_DTYPE    BIT(8)  CONSTANT('07'X);                ] @01A 99331800
*/********************************************************************/ 99333000
*  DCL XSF_SFI_2SCD      BIT(64) CONSTANT('000C8CA000000009'X);  ] @01A 99334200
*                                   ] Secondary VRS subchain start date 99335400
*  DCL XSF_SFI_2SCD_ID   BIT(24) CONSTANT('8CA000'X);            ] @01A 99336600
*  DCL XSF_2SCD_LENGTH   BIT(16) CONSTANT('000C'X);              ] @01A 99337800
*  DCL XSF_2SCD_DTYPE    BIT(8)  CONSTANT('09'X);                ] @01A 99339000
*/********************************************************************/ 99340200
*  DCL XSF_SFI_2SCN      BIT(64) CONSTANT('00108CB000000007'X);  ] @01A 99341400
*                                   ] Secondary VRS subchain name       99342600
*  DCL XSF_SFI_2SCN_ID   BIT(24) CONSTANT('8CB000'X);            ] @01A 99343800
*  DCL XSF_2SCN_LENGTH   BIT(16) CONSTANT('0010'X);              ] @01A 99345000
*  DCL XSF_2SCN_DTYPE    BIT(8)  CONSTANT('07'X);                ] @01A 99346200
*/********************************************************************/ 99349500
*/********************************************************************/ 99381600
* @LOGIC;                                                               99413700
* #PRAGMA TOOL=CBGEN;                                                   99445800
* #EPGRAGMA TOOL=CBGEN;                                                 99477900
* @ENDLOGIC;                                                            99510000
*/* End of PL/X Source                                               */ 99542100
* %IF EDGXSF_LIST ^= 'NO' &                                             99574200
*    ZCBPRINT ^= 'NO' %THEN                                             99606300
*   %GOTO EDGXSF_4;                                                     99638400
*   @LIST POP NOECHO;                                                   99670500
* %EDGXSF_4:;                                                           99702600
* %END;                                                                 99734700
