*/*PROPRIETARY V3 STATEMENT                                          */ 00290800
*/*LICENSED MATERIALS - PROPERTY OF IBM                              */ 00313500
*/*"RESTRICTED MATERIALS OF IBM"                                     */ 00336200
*/*5695-DF1                                                          */ 00358900
*/*COPYRIGHT 1992, 2011 IBM CORP.                                    */ 00387300
*/*END PROPRIETARY V3 STATEMENT                                      */ 00415800
*/*                                                                  */ 00450000
         MACRO                                                          00500000
&NAME    ENDREQ &RPL=                                                   00550000
.********************************************************************** 00555000
.* CHANGE ACTIVITY                                                      00560000
.* $L1=64BIT,JDZ1D10,20101115,SVLJH: 64 bit message                @L1A 00565000
.********************************************************************** 00570000
         GBLC  &SYSAM64    GLOBAL VARIABLE SET BY SYSSTATE MACRO   @L1A 00575000
         GBLC  &SYSASCE    GLOBAL VARIABLE SET BY SYSSTATE MACRO   @L1A 00580000
         SYSSTATE TEST    TEST HOW MACROS ARE TO EXPAND            @L1A 00585000
         AIF   ('&SYSAM64' EQ 'YES').E0    GO IF AMODE64=YES       @L1A 00590000
         AIF   (('&SYSASCE' NE '') AND ('&SYSASCE' NE 'P')).E1     @L1A 00595000
         AIF   ('&RPL' NE '').OKY                                       00600000
         IHBERMAC 24                                                    00650000
         MEXIT                                                          00700000
.OKY     ANOP                                                           00750000
&NAME    DS    0H                                                       00800000
         AIF   ('&RPL'(1,1) EQ '(').RPLR                                00850000
         LA    1,&RPL                   LOAD RPL ADDR                   00900000
         AGO   .AREG                                                    00950000
.RPLR    AIF   ('&RPL' EQ '(1)').AREG   IF RPL=(1),SKIP LR INSTRUCTION  01000000
         LR    1,&RPL(1)                LOAD RPL ADDR IN REG.1          01050000
.AREG    LA    0,X'04'                  INDICATE ENDREQ IN REG          01100000
         L     15,24(1)                 LOAD ACB ADDR FROM RPL          01150000
         L     15,8(15)                 LOAD VSAM INTERFACE RTN ADDR    01186100
         BASR  14,15                    BRANCH TO INTERFACE ROUTINE     01222200
         MEXIT                                                     @L1A 01258300
.E0      IGGERMAC 203,ENDREQ    THE ENDREQ MACRO DOES NOT SUPPORT  @L1A 01266600
         MEXIT                    SYSSTATE AMODE64=YES             @L1A 01274900
.E1      IGGERMAC 204,ENDREQ    THE ENDREQ MACRO DOES NOT SUPPORT  @L1A 01283200
         MEXIT                    SYSSTATE ASCENV=AR OR ANY        @L1A 01291500
         MEND                                                           01300000
