         MACRO                                                          03000000
&NAME    ERASE   &RPL=                                                  06000000
.*PROPRIETARY V3 STATEMENT                                     @WA04075 06400000
.*LICENSED MATERIALS - PROPERTY OF IBM                         @WA04075 06450000
.*"RESTRICTED MATERIALS OF IBM"                                @WA04075 06500000
.*5695-DF1                                                     @WA04075 06550000
.*COPYRIGHT 1992, 2011 IBM CORP.                               @WA04075 06600000
.*END PROPRIETARY V3 STATEMENT                                 @WA04075 06650000
.*                                                                      06750000
.*STATUS = z/OS 1.13 DFSMS                                         @L1C 06800000
.*                                                                      06850000
.*CHANGE ACTIVITY:                                                      06900000
.*  PREVENT COPYRIGHT FROM SHOWING WHEN MACRO IS INVOKED       @WA04075 07000000
.* $L1=64BIT,JDZ1D10,20101116,SVLJH: 64 bit message                @L1A 07025000
.*                                                                      07050000
         GBLC  &SYSAM64    GLOBAL VARIABLE SET BY SYSSTATE MACRO   @L1A 07100000
         GBLC  &SYSASCE    GLOBAL VARIABLE SET BY SYSSTATE MACRO   @L1A 07150000
         SYSSTATE TEST    TEST HOW MACROS ARE TO EXPAND            @L1A 07200000
         AIF   ('&SYSAM64' EQ 'YES').E0    GO IF AMODE64=YES       @L1A 07250000
         AIF   (('&SYSASCE' NE '') AND ('&SYSASCE' NE 'P')).E1     @L1A 07300000
         AIF   ('&RPL' NE '').OKY                                       09000000
         IHBERMAC 24                                                    12000000
         MEXIT                                                          15000000
.OKY     ANOP                                                           18000000
&NAME    DS    0H                                                       21000000
         AIF   ('&RPL'(1,1) EQ '(').RPLR                                24000000
         LA    1,&RPL                   LOAD RPL ADDR                   27000000
         AGO   .AREG                                                    30000000
.RPLR    AIF   ('&RPL' EQ '(1)').AREG   IF RPL=(1),SKIP LR INSTRUCTION  33000000
         LR    1,&RPL(1)                LOAD RPL ADDR IN REG.1          36000000
.AREG    LA    0,X'05'                  INDICATE ERASE IN REG           39000000
         L     15,24(1)                 LOAD ACB ADDR FROM RPL          42000000
         L     15,8(15)                 LOAD VSAM INTERFACE RTN ADDR    42050000
         BASR  14,15                    LINK TO INTERFACE ROUTINE       42100000
         MEXIT                                                     @L1A 48050000
.E0      IGGERMAC 203,ERASE    THE ERASE MACRO DOES NOT SUPPORT    @L1A 48100000
         MEXIT                   SYSSTATE AMODE64=YES              @L1A 48150000
.E1      IGGERMAC 204,ERASE    THE ERASE MACRO DOES NOT SUPPORT    @L1A 48200000
         MEXIT                   SYSSTATE ASCENV=AR OR ANY         @L1A 48250000
         MEND                                                           51000000
