*                                                                               
* %DCL ERB2XDGH_INCLUDED CHAR EXT;                                              
* %DEACTIVATE ERB2XDGH_INCLUDED;                                                
* %IF ERB2XDGH_INCLUDED = '' %THEN                                              
* %DO;                                                                          
*/* Macro made bi-lingual on 21194. CBGEN compile date 21138         */         
*% /*                                                                           
         MACRO                                                                  
         ERB2XDGH &DSECT=YES,&LIST=YES,&TITLE=YES,&ERB2XDGP=YES,       *        
               &ERB2XHDR=COND,&ERB2XSYS=COND,&ERB2GDAT=COND                     
         GBLC  &ERB2XDGH_INCLUDED                                               
         GBLC  &ZCBPRINT                                                        
&ERB2XDGH_INCLUDED SETC 'YES'                                                   
         AIF   ('&LIST' EQ 'NONE').P0                                           
         AIF   ('&TITLE' EQ 'NO').P5                                            
 TITLE   'ERB2XDGH  - Sysplex Data Retrieval Service Header      '              
.P5      ANOP                                                                   
**/ ;                                                                           
*/* START OF SPECIFICATIONS ******************************************/         
*/*                                                                  */         
*/*01* PROPRIETARY STATEMENT:                                        */         
*/*       Licensed Materials - Property of IBM                   @61A*/         
*/*       "Restricted Materials of IBM"                          @61A*/         
*/*       Copyright IBM Corp. 1993, 2021                         @91C*/         
*/*                                                                  */         
*/*       Status: z/OS V2R5 Data Gatherer (HRG77D0)                  */         
*/*                                                                  */         
*/*01* DESCRIPTIVE-NAME:  Sysplex Data Retrieval Service Header      */         
*/*                                                                  */         
*/*01* MACRO-NAME:  ERB2XDGH                                         */         
*/*                                                                  */         
*/*01* DSECT NAME:                                                   */         
*/*02*   ERB2XDGP                                                    */         
*/*02*   ERB2XDGH                                                    */         
*/*02*   ERB2XSYS                                                    */         
*/*02*   ERB2GDAT                                                    */         
*/*                                                                  */         
*/*01* COMPONENT:  zOS Data Gatherer (27401)                         */         
*/*                                                                  */         
*/*01* EYE-CATCHER:  XDGH                                            */         
*/*                                                                  */         
*/*01* STORAGE ATTRIBUTES:                                           */         
*/*02*   SUBPOOL:           Any                                      */         
*/*02*   KEY:               Any                                      */         
*/*02*   RESIDENCY:         Any                                      */         
*/*02*   MAIN STORAGE:      N/A                                      */         
*/*02*   AUXILIARY STORAGE: N/A                                      */         
*/*02*   VIRTUAL STORAGE:   N/A                                      */         
*/*                                                                  */         
*/*01* SIZE:                                                         */         
*/*            ERB2XDGP -- X'0103' bytes                             */         
*/*            ERB2XHDR -- X'0030' bytes                             */         
*/*            ERB2XSYS -- X'000F' bytes                             */         
*/*            ERB2GDAT -- X'0038' bytes                             */         
*/*                                                                  */         
*/*01* POINTED TO BY:                                                */         
*/*      Answer area pointer (first parameter of callable service)   */         
*/*      Answer area ALET   (second parameter of callable service)   */         
*/*                                                                  */         
*/*01* SERIALIZATION:                                                */         
*/*      None                                                        */         
*/*                                                                  */         
*/*01* FUNCTION:                                                     */         
*/*02*   This macro defines the Sysplex Data Retrieval Service  @A03C*/         
*/*      answer area header.                                         */         
*/*                                                                  */         
*/*01* METHOD OF ACCESS:                                             */         
*/*02*   BAL: ERB2XDGH                                          @A03C*/         
*/*                                                                  */         
*/*02*   PL/X:                                                       */         
*/*        %DECLARE ERB2XLST CHAR EXTERNAL                           */         
*/*        %ERB2XLST = 'NO'              (without macro listing)     */         
*/*                                                                  */         
*/*        %INCLUDE SYSLIB(ERB2XDGH)                                 */         
*/*                                                                  */         
*/*01* FREQUENCY:                                                    */         
*/*      Once                                                        */         
*/*                                                                  */         
*/*01* DEPENDENCIES:  None                                           */         
*/*                                                                  */         
*/*01* DISTRIBUTION LIBRARY:                                         */         
*/*      AGRBMAC1                                               @A03C*/         
*/*                                                                  */         
*/*01* CHANGE ACTIVITY:                                              */         
*/*  $C1=RSDS,HRM4440,,DK: RMF Sysplex Data Server                   */         
*/*   SWE: CHANGE SPA DEFINITION: INTERNAL TO EXTERNAL       @WA05017*/         
*/*   DK: Complete LPAR APAR (WA05435)                       @WA08151*/         
*/*  $E1=RSDS,HRM5530,,DK: RMF Sysplex Data Server               @E1A*/         
*/*   GUB: zAAP utilization percentage                       @OA11802*/         
*/*   VTH: System Utility Processor (SUP) support            @OA13499*/         
*/*  $61=R790,HRM7790,,MWe: explicit copyright for ext. macro    @61A*/         
*/*  $62=R790,HRM7790,,JKu: Make macro bilingual                 @62A*/         
*/*  $91=ZCBP,OA54915,,GUB: zCBP support                         @91A*/         
*/*  $92=ZCBP,OA56461,,JKU: zCBP fencing                         @92A*/         
*/*  $A02=ZOSB,HRG77D0,,JBa: Rename prefix ERB to GRB           @A02A*/         
*/*  $A03=ZOSB,HRG77D0,,JDo: Bilingual macros with cbgen        @A03A*/         
*/*                                                                  */         
*/* END OF SPECIFICATIONS ********************************************/         
*% /*                                                                           
.P0      ANOP                                                                   
         AIF   ('&ZCBPRINT' EQ 'NO').P1                                         
         AIF   ('&LIST' EQ 'YES').P2                                            
.P1      ANOP                                                                   
         PUSH  PRINT                                                            
         PRINT OFF                                                              
.P2      ANOP                                                                   
         AIF   ('&ERB2XDGP' EQ 'NO').L0002                                      
         AIF   ('&DSECT' EQ 'YES').L0003                                        
         AIF   ('&ERB2XDGP' NE 'YES').L0002                                     
.L0003   ANOP                                                                   
*                                                                               
* ********************************************************************          
* *                                                                  *          
* * ERB2XDGS - Data Gatherer Parameter                               *          
* *                                                                  *          
* ********************************************************************          
*                                                                               
*                                                                               
         AIF   ('&DSECT' EQ 'YES').L0004                                        
ERB2XDGP DS    0F                  Data Gatherer parameter                      
         AGO   .L0005                                                           
.L0004   ANOP                                                                   
ERB2XDGP DSECT                     Data Gatherer parameter                      
.L0005   ANOP                                                                   
ERB2XRTY DS    H                   SMF record type                              
ERB2XSTY DS    H                   SMF record subtype                           
ERB2XM2P DS    CL255               Data Gatherer subparameter                   
ERB2XDGP_LEN EQU *-ERB2XDGP                                                     
.L0002   ANOP                                                                   
         AIF   ('&ERB2XHDR' EQ 'NO').L0006                                      
         AIF   ('&DSECT' EQ 'YES').L0007                                        
         AIF   ('&ERB2XHDR' NE 'YES').L0006                                     
.L0007   ANOP                                                                   
*                                                                               
* ********************************************************************          
* *                                                                  *          
* * ERB2XDGS - Answer Area Header and System List                    *          
* *                                                                  *          
* ********************************************************************          
*                                                                               
*                                                                               
         AIF   ('&DSECT' EQ 'YES').L0008                                        
ERB2XHDR DS    0F                  Answer area header section                   
         AGO   .L0009                                                           
.L0008   ANOP                                                                   
ERB2XHDR DSECT                     Answer area header section                   
.L0009   ANOP                                                                   
ERB2XNAM DS    CL4                 Answer area acronym                          
ERB2XVER DS    F                   Answer area version                          
ERB2XLEN DS    F                   Total length of data returned on    *        
                                   this call                                    
ERB2XTLN DS    F                   Total length of answer area needed  *        
                                   to contain all the requested        *        
                                   information                                  
ERB2XPLX DS    CL8                 Name of the sysplex the request is  *        
                                   running on                                   
ERB2XSOF DS    F                   Offset from xxxxxHDR to the first   *        
                                   yyyyySYS system entry                        
ERB2XSLN DS    F                   Length of a yyyyySYS system entry            
ERB2XSNO DS    F                   Number of yyyyySYS system entries            
ERB2XDOF DS    F                   Offset from xxxxxHDR to the first   *        
                                   zzzzzDAT data record                         
ERB2XDLN DS    F                   Length of a zzzzzDAT data record             
ERB2XDNO DS    F                   Number of zzzzzDAT data records              
ERB2XHDR_LEN EQU *-ERB2XHDR                                                     
.L0006   ANOP                                                                   
         AIF   ('&ERB2XSYS' EQ 'NO').L000A                                      
         AIF   ('&DSECT' EQ 'YES').L000B                                        
         AIF   ('&ERB2XSYS' NE 'YES').L000A                                     
.L000B   ANOP                                                                   
*                                                                               
*  --------------------------------------------------------------------         
*endif                              // End skipping PLX                         
*/-------------------------------------------------------------------           
*                                                                               
*                                                                               
         AIF   ('&DSECT' EQ 'YES').L000C                                        
ERB2XSYS DS    0X                  Answer Area System List                      
         AGO   .L000D                                                           
.L000C   ANOP                                                                   
ERB2XSYS DSECT                     Answer Area System List                      
.L000D   ANOP                                                                   
ERB2XSNM DS    CL8                 MVS system name                              
ERB2XSID DS    CL4                 SMF system id                                
ERB2XRMF DS    BL4                 z/OS DG status information                   
*  Bit definitions:                                                             
ERB2XSDS EQU   X'80'               Sysplex Data Server active                   
ERB2XSMF EQU   X'40'               SMF Data Buffer active                       
ERB2XIII EQU   X'20'               Monitor III active                           
ERB2XXDS EQU   X'10'               Sysplex Data Req sent                        
ERB2XXDR EQU   X'08'               Sysplex Data received                        
ERB2XMST EQU   X'04'               master status                                
ERB2XMAL EQU   X'02'               master allow                                 
         DS    B                   Reserved                                     
ERB2XREL_REPLACED DS 0X                                                         
         ORG   ERB2XRMF+X'00000002'                                             
ERB2XREL DS    BL2                 z/OS DG release (x'nnnF')           *        
                                   (same format as STGSRREL)                    
         ORG   ERB2XREL_REPLACED+2                                              
ERB2XSYS_LEN EQU *-ERB2XSYS                                                     
.L000A   ANOP                                                                   
         AIF   ('&ERB2GDAT' EQ 'NO').L000E                                      
         AIF   ('&DSECT' EQ 'YES').L000F                                        
         AIF   ('&ERB2GDAT' NE 'YES').L000E                                     
.L000F   ANOP                                                                   
*                                                                               
*  --------------------------------------------------------------------         
*endif                              // End skipping PLX                         
*/-------------------------------------------------------------------           
*                                                                               
*                                                                               
         AIF   ('&DSECT' EQ 'YES').L0010                                        
ERB2GDAT DS    0F                  ERB2XDGS Data Section                        
         AGO   .L0011                                                           
.L0010   ANOP                                                                   
ERB2GDAT DSECT                     ERB2XDGS Data Section                        
.L0011   ANOP                                                                   
ERB2GHDR DS    CL56                ERB2XDGS Data Section                        
         ORG   ERB2GHDR                                                         
ERB2GDEL DS    F                   Length of this data entry                    
ERB2GHDL DS    F                   Length of this data header                   
ERB2GRTN DS    F                   Data Gatherer Return Code                    
ERB2GRSN DS    F                   Data Gatherer Reason Code                    
ERB2GCPU DS    F                   System CPU utilization                       
ERB2GPRT DS    F                   System Paging Rate                           
ERB2GDRC DS    CL12                ERB2XDGS Exit Completion Code                
         ORG   ERB2GDRC                                                         
ERB2GDR1 DS    CL4                 ERB2XDGS Exit System/User Code               
ERB2GDR2 DS    CL8                 ERB2XDGS Exit Reason Code                    
ERB2GSRM DS    F                   MVS/SRM CPU util                             
ERB2GSID DS    CL4                 SMF System Id (Gatherer)                     
ERB2GSRC DS    F                   Reserved for internal use                    
ERB2GZAP DS    F                   System zAAP util                             
ERB2GSUP DS    F                   System zIIP util                             
ERB2GMII DS    0C                  Monitor II data                              
*                                                                               
* ********************************************************************          
* *                                                                  *          
* * ERB2XDGS - Answer Area Constants                                 *          
* *                                                                  *          
* ********************************************************************          
*                                                                               
*                                                                               
ERB2XHDN EQU   C'XDGH'             Answer area acronym                          
ERB2XHDV EQU   3                   AA version                                   
ERB2GDAT_LEN EQU *-ERB2GDAT                                                     
.L000E   ANOP                                                                   
         AIF   ('&ZCBPRINT' EQ 'NO').P3                                         
         AIF   ('&LIST' EQ 'YES').P4                                            
.P3      ANOP                                                                   
         POP   PRINT                                                            
.P4      ANOP                                                                   
.P_EXIT  ANOP                                                                   
         MEND                                                                   
**/ ;                                                                           
* %ERB2XDGH_INCLUDED = 'YES';                                                   
* %DCL ZCBPRINT CHAR EXT;                                                       
* %DEACTIVATE ZCBPRINT;                                                         
* %DCL ERB2XDGH_LIST CHAR EXT;                                                  
* %DEACTIVATE ERB2XDGH_LIST;                                                    
* %IF ERB2XDGH_LIST = 'NO' !                                                    
*    ZCBPRINT = 'NO' %THEN                                                      
* %DO;                                                                          
*   @LIST PUSH NOECHO;                                                          
*   @LIST NOASSEMBLE NOECHO;                                                    
*   @LIST OFF C NOECHO;                                                         
* %END;                                                                         
*/* Start of PL/X Source                                             */         
*                                                                               
*  %DECLARE ERB2XLST CHAR EXTERNAL;                                             
*                                                                               
*  @LIST PUSH NOECHO;                                                           
*                                                                               
*  %IF ERB2XLST='NO' %THEN %DO;                                                 
*     @LIST OFF NOECHO;                                                         
*  %END;                                                                        
*                                                                               
*/********************************************************************/         
*/*                                                                  */         
*/* ERB2XDGS - Data Gatherer Parameter                               */         
*/*                                                                  */         
*/********************************************************************/         
*                                                                               
*DCL 1 ERB2XDGP BASED BOUNDARY(WORD), /* Data Gatherer parameter     */         
*      2 ERB2XRTY FIXED(15),          /* SMF record type             */         
*      2 ERB2XSTY FIXED(15),          /* SMF record subtype          */         
*      2 ERB2XM2P CHAR(255);          /* Data Gatherer subparameter  */         
*                                                                               
*/********************************************************************/         
*/*                                                                  */         
*/* ERB2XDGS - Answer Area Header and System List                    */         
*/*                                                                  */         
*/********************************************************************/         
*                                                                               
*  %DECLARE ERBDSPRF CHAR EXTERNAL; /* Header and System List prefix */         
*                                                                               
*  %ERBDSPRF = 'ERB2X';                                                         
*                                                                               
*  %INCLUDE SYSLIB(ERBDSCHD);       /* ERB2XDGS Answer Area Header   */         
*                                                                               
*  %INCLUDE SYSLIB(ERBDSCSL);       /* ERB2XDGS Answer Area System L */         
*                                                                               
*/********************************************************************/         
*/*                                                                  */         
*/* ERB2XDGS - Answer Area Data Section                              */         
*/*                                                                  */         
*/********************************************************************/         
*                                                                               
*%Declare ERB2GDAT_Attribute Char External;                    /*@E1A*/         
*%If ERB2GDAT_Attribute='' %Then %Do;                          /*@E1A*/         
*%ERB2GDAT_Attribute = 'BASED';                                /*@E1A*/         
*%End;                                                         /*@E1A*/         
*%Scan ERB2GDAT_Attribute;                                     /*@E1A*/         
*                                                                               
*DCL 1 ERB2GDAT                     /* ERB2XDGS Data Section    @A03C*/         
*           ERB2GDAT_Attribute,                                                 
*      2 ERB2GHDR,                  /* ERB2XDGS Data Section    @A03C*/         
*                                                                               
*        3 ERB2GDEL FIXED(31),      /* Length of this data entry     */         
*        3 ERB2GHDL FIXED(31),      /* Length of this data header    */         
*        3 ERB2GRTN FIXED(31),      /* Data Gatherer Return Code     */         
*        3 ERB2GRSN FIXED(31),      /* Data Gatherer Reason Code     */         
*        3 ERB2GCPU FIXED(31),      /* System CPU utilization        */         
*        3 ERB2GPRT FIXED(31),      /* System Paging Rate            */         
*        3 ERB2GDRC CHAR(12),       /* ERB2XDGS Exit Completion Code */         
*          4 ERB2GDR1 CHAR(4),      /* ERB2XDGS Exit System/User Code*/         
*          4 ERB2GDR2 CHAR(8),      /* ERB2XDGS Exit Reason Code     */         
*        3 ERB2GSRM FIXED(31),      /* MVS/SRM CPU util      @WA08151*/         
*        3 ERB2GSID CHAR(4),        /* SMF System Id (Gatherer)  @E1A*/         
*        3 ERB2GSRC FIXED(31),      /* Reserved for internal use @E1A*/         
*        3 ERB2GZAP FIXED(31),      /* System zAAP util          @92C*/         
*        3 ERB2GSUP FIXED(31),      /* System zIIP util      @OA13499*/         
*                                                                               
*      2 ERB2GMII CHAR(*);          /* Monitor II data          @A03C*/         
*                                                                               
*%Noscan ERB2GDAT_Attribute;                                                    
*                                                                               
*/********************************************************************/         
*/*                                                                  */         
*/* ERB2XDGS - Answer Area Constants                                 */         
*/*                                                                  */         
*/********************************************************************/         
*                                                                               
*DCL ERB2XHDN CHAR(4)   CONSTANT('XDGH');     /* Answer area acronym */         
*DCL ERB2XHDV FIXED(31) CONSTANT(3);          /* AA version      @E1C*/         
*                                                                               
*/********************************************************************/         
*@LOGIC;                                                                        
*#PRAGMA TOOL=CBGEN.                                                            
*#ALIGNOP.                                                                      
*#REPLACE.ERB2XREL                                                              
*         ORG   ERB2XRMF+X'00000002'                                            
*ERB2XREL DS    BL2                 z/OS DG release (x'nnnF')         *         
*                                   (same format as STGSRREL)                   
*#EREPLACE.                                                                     
*#EPRAGMA.                                                                      
*#PRAGMA TOOL=PADI.                                                             
*#PADIDELETE.ERB2XREL_REPLACED                                                  
*#PADIDELETE.ERB2XDGP_LEN                                                       
*#PADIDELETE.ERB2XHDR_LEN                                                       
*#PADIDELETE.ERB2XSYS_LEN                                                       
*#PADIDELETE.ERB2GDAT_LEN                                                       
*#EPRAGMA.                                                                      
*@ENDLOGIC;                                                                     
*                                                                               
*/* End of PL/X Source                                               */         
* %IF ERB2XDGH_LIST = 'NO' !                                                    
*    ZCBPRINT = 'NO' %THEN                                                      
* %DO;                                                                          
*   @LIST POP NOECHO;                                                           
* %END;                                                                         
* %END;                                                                         
