//**** START OF SPECIFICATIONS ***************************************/         
//*                                                                  */         
//*01* PROPRIETARY STATEMENT:                                        */         
//*       Licensed Materials - Property of IBM                   @61A*/         
//*       "Restricted Materials of IBM"                          @61A*/         
//*       Copyright IBM Corp. 1999, 2021                             */         
//*                                                                  */         
//*       Status: z/OS V2R5 Data Gatherer (HRG77D0)                  */         
//*                                                                  */         
//*01* DESCRIPTIVE_NAME:  Sysplex Data Retrieval Service Header      */         
//*                                                                  */         
//*02*   ACRONYM:                                                    */         
//*        XDRH                                                      */         
//*                                                                  */         
//*01* MACRO-NAME:  ERB3XDRH                                         */         
//*                                                                  */         
//*01* DSECT NAME:                                                   */         
//*02*   ERB3XDRP                                                    */         
//*02*   ERB3XDRH                                                    */         
//*02*   ERB3XSYS                                                    */         
//*02*   ERB3RDAT                                                    */         
//*                                                                  */         
//*01* COMPONENT:  zOS Data Gatherer (27401)                         */         
//*                                                                  */         
//*01* EYE-CATCHER:  XDRH                                            */         
//*                                                                  */         
//*01* STORAGE ATTRIBUTES:                                           */         
//*02*   SUBPOOL:           Any                                      */         
//*02*   KEY:               Any                                      */         
//*02*   RESIDENCY:         Any                                      */         
//*02*   MAIN STORAGE:      N/A                                      */         
//*02*   AUXILIARY STORAGE: N/A                                      */         
//*02*   VIRTUAL STORAGE:   N/A                                      */         
//*                                                                  */         
//*01* SIZE:                                                         */         
//*      34 bytes (ERB3XDRP)                                         */         
//*      48 bytes (ERB3XDRH)                                         */         
//*      16 bytes (ERB3XSYS)                                         */         
//*     120 bytes (ERB3RDAT) + length of RMF Monitor III data@WA10257*/         
//*                                                                  */         
//*01* CREATED BY:                                                   */         
//*      RMF Sysplex Data Retrieval Service                          */         
//*                                                                  */         
//*01* POINTED TO BY:                                                */         
//*      Answer area pointer (first parameter of callable service)   */         
//*      Answer area ALET   (second parameter of callable service)   */         
//*                                                                  */         
//*01* SERIALIZATION:                                                */         
//*      None                                                        */         
//*                                                                  */         
//*01* FUNCTION:                                                     */         
//*02*   This macro defines the RMF Sysplex Data Retrieval Service   */         
//*      answer area header.                                         */         
//*                                                                  */         
//*01* METHOD OF ACCESS:                                             */         
//*02*   ASM: N/A                                                    */         
//*                                                                  */         
//*02*   PL/X:                                                       */         
//*        %DECLARE ERB3XLST CHAR EXTERNAL                           */         
//*        %ERB3XLST = 'NO'              (without macro listing)     */         
//*                                                                  */         
//*        %INCLUDE SYSLIB(ERB3XDRH)                                 */         
//*                                                                  */         
//*02*   C++:                                                    @E2A*/         
//*        #include "erb3xdrh.mac"                               @E2A*/         
//*                                                                  */         
//*01* STATUS: z/OS V2R5 Data Gatherer (HRG77D0)                     */         
//*                                                                  */         
//*01* DELETED BY:                                                   */         
//*      Application program                                         */         
//*                                                                  */         
//*01* FREQUENCY:                                                    */         
//*      Once                                                        */         
//*                                                                  */         
//*01* DEPENDENCIES:  None                                           */         
//*                                                                  */         
//*01* DISTRIBUTION LIBRARY:                                         */         
//*      AMACLIB                                                     */         
//*                                                                  */         
//*01* CHANGE ACTIVITY:                                              */         
//*    $C1=RSDS,HRM4440,,DK: RMF Sysplex Data Server                 */         
//*    DK: PTM KRO0821 - Unexpected return and reason codes  @WA10257*/         
//*    $E1=RSDS,OW15873,,DK: RMF Sysplex Data Server             @E1A*/         
//*    $E2=BIL,OW17898,,GBO: Mapping made bilingual              @E2A*/         
//*    $E3=IPM,HRM6603,,GBO: Changes for PLX FORMAT OFF          @E3A*/         
//*    $L1=TYPES,HRM7720,,GBO: Types                             @L1A*/         
//*    $61=R790,HRM7790,,MWe: explicit copyright for ext. macro  @61A*/         
//*    $A02=ZOSB,HRG77D0,,JBa: Rename prefix ERB to GRB         @A02A*/         
//*                                                                  */         
//**** END OF SPECIFICATIONS *****************************************/         
//*--------------------------------------------------------------------         
#ifndef ERB3XDRH_MAC                // Check, if already included  @E3A         
#define ERB3XDRH_MAC                // Include only once           @E3A         
#ifdef  __MVS__                     // Include only on MVS         @L1A         
#if (0==1)                          // Skip PLX code               @E3A         
//-------------------------------------------------------------------*/         
                                                                                
 %DECLARE ERB3XLST CHAR EXTERNAL;                                               
                                                                                
 @LIST PUSH NOECHO;                                                             
                                                                                
 %IF ERB3XLST='NO' %THEN %DO;                                                   
     @LIST OFF NOECHO;                                                          
 %END;                                                                          
                                                                                
 ]********************************************************************          
 ]                                                                              
 ]  GRB3XDRS - Data Retrieval Parameter                                         
 ]                                                                              
 ]********************************************************************          
 DECLARE                                                                        
    1  Erb3xdrp BASED BDY(WORD),    ] Data Retrieval parameter                  
       2 Erb3xbeg CHAR(14),         ] Range start date & time                   
       2 Erb3xend CHAR(14),         ] Range end date & time                     
       2 Erb3xsos CHAR(3),          ] Data format combined SOS                  
       2 Erb3xcom CHAR(3);          ] Data format compressed SOS                
                                                                                
 ]********************************************************************          
 ]                                                                              
 ]  GRB3XDRS - Answer Area Header and System List                               
 ]                                                                              
 ]********************************************************************          
                                                                                
                                                                                
 %DECLARE ERBDSPRF CHAR EXTERNAL;   ] Header and System List prefix             
                                                                                
 %ERBDSPRF = 'Erb3x';               ] Set Prefix                                
                                                                                
 %INCLUDE SYSLIB(ERBDSCHD);         ] GRB3XDRS Answer Area Header               
                                                                                
 %INCLUDE SYSLIB(ERBDSCSL);         ] GRB3XDRS Answer Area System List          
                                                                                
 ]********************************************************************          
 ]                                                                              
 ]  GRB3XDRS - Answer Area RMF Data Section                                     
 ]                                                                              
 ]********************************************************************          
 %Declare ERB3RDAT_Attribute Char External; ]                      @E1A         
 %If ERB3RDAT_Attribute='' %Then %Do;       ]                      @E1A         
    %ERB3RDAT_Attribute = 'BASED';          ]                      @E1A         
 %End;                                      ]                      @E1A         
 %Scan ERB3RDAT_Attribute;                  ]                      @E1A         
                                                                                
 DECLARE                                                                        
    1 Erb3rdat                      ] ERB3RDRS RMF Data Section    @E1C         
            ERB3RDAT_Attribute,     ]                              @E1C         
      2  Erb3rhdr,                  ] ERB3RDRS RMF Data Section                 
         3  Erb3rdel FIXED(31),     ] Length of this RMF data entry             
         3  Erb3rhdl FIXED(31),     ] Length of this data header                
         3  Erb3rrtn FIXED(31),     ] Data Retrieval Return Code                
         3  Erb3rrsn FIXED(31),     ] Data retrieval Reason Code                
         3  Erb3rdgv CHAR(3),       ] Data gatherer version (VRM)               
         3  *        CHAR(5),       ] Reserved                                  
         3  Erb3rdgs CHAR(4),       ] SMF System Id of the system               
                                    ]   the data was retrieved from             
         3  Erb3rmnt FIXED(31),     ] Gatherer MINTIME option(seconds)          
         3  Erb3rsam FIXED(31),     ] Number of samples returned data           
         3  Erb3rrng FIXED(31),     ] Actual range length in seconds            
         3  Erb3rsta CHAR(14),      ] Actual range start:YYYYMMDDHHMMSS         
            4  Erb3rsdt CHAR(8),    ] Actual range start date                   
               5 Erb3rsyr CHAR(4),  ] Actual range start year                   
                 6 Erb3rscn CHAR(2),] Actual range start century                
                 6 Erb3rscy CHAR(2),] Actual range start yearofcent             
               5 Erb3rsmo CHAR(2),  ] Actual range start month                  
               5 Erb3rsdy CHAR(2),  ] Actual range start day                    
                                                                                
            4  Erb3rstm CHAR(6),    ] Actual range start time                   
               5 Erb3rshr CHAR(2),  ] Actual range start hour                   
               5 Erb3rsmn CHAR(2),  ] Actual range start minute                 
               5 Erb3rssc CHAR(2),  ] Actual range start second                 
                                                                                
         3  Erb3rend CHAR(14),      ] Actual range end: YYYYMMDDHHMMSS          
            4  Erb3redt CHAR(8),    ] Actual range end date                     
               5 Erb3reyr CHAR(4),  ] Actual range end year                     
                 6 Erb3recn CHAR(2),] Actual range end century                  
                 6 Erb3recy CHAR(2),] Actual range end yearofcent               
               5 Erb3remo CHAR(2),  ] Actual range end month                    
               5 Erb3redy CHAR(2),  ] Actual range end day                      
                                                                                
            4  Erb3retm CHAR(6),    ] Actual range end time                     
               5 Erb3rehr CHAR(2),  ] Actual range end hour                     
               5 Erb3remn CHAR(2),  ] Actual range end minute                   
               5 Erb3resc CHAR(2),  ] Actual range end second                   
                                                                                
         3  Erb3rdrc CHAR(12),      ] GRB3XDRS Exit Completion Code             
            4  Erb3rdr1 CHAR(4),    ] GRB3XDRS Exit System/User Code            
            4  Erb3rdr2 CHAR(8),    ] GRB3XDRS Exit Reason Code                 
                                                                                
         3  Erb3rdst CHAR(40),      ] GRB3XDRS M3 Data Stat    @WA10257         
            4  Erb3rdsg CHAR(8),    ] GRB3XDRS Data Gap ST     @WA10257         
            4  Erb3rdeg CHAR(8),    ] GRB3XDRS Data Gap ET     @WA10257         
            4  Erb3rdit CHAR(8),    ] GRB3XDRS System IPLT     @WA10257         
            4  Erb3rdfa CHAR(8),    ] GRB3XDRS First Avl T     @WA10257         
            4  Erb3rdla CHAR(8),    ] GRB3XDRS Last  Avl T     @WA10257         
                                                                                
      2  Erb3riii CHAR(*);          ] RMF Monitor III data                      
                                                                                
 %Noscan ERB3RDAT_Attribute;        ]                              @E1A         
                                                                                
 ]*********************************************************************         
 ]                                                                              
 ]  GRB3XDRS - Answer Area Constants                                            
 ]                                                                              
 ]*********************************************************************         
 DECLARE                                                                        
    ERB3XHDN CHAR(4)                                                            
       CONSTANT('XDRH'),            ] Answer area acronym                       
    ERB3XHDV FIXED(31)                                                          
       CONSTANT(2);                 ] Answer area version      @WA10257         
                                                                                
 @LIST PUSH;                        ] Push listing                 @E3C         
 @LIST OFF;                         ] Turn PLX listing off         @E3C         
                                                                                
 @LOGIC;                            ] PLX ignores logic            @E3C         
#endif                              // End skipping PLX code       @E3C         
                                    //                                          
#include "erbdschd.mac"             // SDS Answer Area header      @E2A         
#include "erbdscsl.mac"             // SDS System list             @E2A         
                                    //                                          
#pragma pack(1)                     // No alignment                @L1C         
                                    //                                          
typedef struct                      // Data retrieval parameters   @E2A         
{                                   //                                          
   char Erb3xbegÝ14¨;               // Range start date & time     @E3A         
   char Erb3xendÝ14¨;               // Range end date & time       @E3A         
   char Erb3xsosÝ3¨;                // Data format combined SOS    @E2A         
   char Erb3xcomÝ3¨;                // Data format compressed SOS  @E2A         
} Erb3xdrp;                         // Data Retrieval parm struct  @E2A         
                                    //                                          
typedef struct                      //                                          
{                                   //                                          
   gpm_int31_t Erb3rdel;            // Length of this data entry   @E2A         
   gpm_int31_t Erb3rhdl;            // Length of this data header  @E2A         
   gpm_int31_t Erb3rrtn;            // Data Retrieval Return Code  @E2A         
   gpm_int31_t Erb3rrsn;            // Data retrieval Reason Code  @E2A         
   char Erb3rdgvÝ3¨;                // Data gatherer version (VRM) @E2A         
   char Erb3rdm1Ý5¨;                // Reserved                    @E2A         
   char Erb3rdgsÝ4¨;                // SMF Sysid of retrieved data @E2A         
   gpm_int31_t Erb3rmnt;            // Gatherer MINTIME in seconds @E2A         
   gpm_int31_t Erb3rsam;            // Actual number data samples  @E2A         
   gpm_int31_t Erb3rrng;            // Actual range len in seconds @E2A         
   char Erb3rstaÝ14¨;               // Act. range start date/time  @E3C         
   char Erb3rendÝ14¨;               // Actual range end date/time  @E3C         
   char Erb3rdrcÝ12¨;               // GRB3XDRS Exit Compl. Code   @E2A         
   gpm_uint64_t Erb3rdsg;           // GRB3XDRS Data Gap Starttime @E3C         
   gpm_uint64_t Erb3rdeg;           // GRB3XDRS Data Gap EndTime   @E3C         
   gpm_uint64_t Erb3rdit;           // GRB3XDRS System IPL Time    @E3C         
   gpm_uint64_t Erb3rdfa;           // GRB3XDRS First Avail. Time  @E3C         
   gpm_uint64_t Erb3rdla;           // GRB3XDRS Last Avail. Time   @E3C         
} Erb3rdat;                         // Definition of M III header  @E2A         
                                    //                                          
#define ERB3XHDN "XDRH"             // Answer area acronym         @E3C         
#define ERB3XHDV 2                  // Answer area version         @E3C         
                                    //                                          
#pragma pack(reset)                 // No aligment by compiler     @L1C         
                                    //                                          
#endif                              // End __MVS__                 @L1A         
#endif                              // ERB3XDRH_MAC                @E3C         
                                    //                                          
#if (0==1)                          // Skip PLX code               @E3C         
 @ENDLOGIC;                         ] End of C++ Code              @E3C         
 @LIST POP;                         ] Restore Listing              @E3C         
//*--------------------------------------------------------------------         
#endif                              // End skipping PLX            @E3A         
//-------------------------------------------------------------------*/         
