*                                                                               
* %DCL ERBASIG3_INCLUDED CHAR EXT;                                              
* %DEACTIVATE ERBASIG3_INCLUDED;                                                
* %IF ERBASIG3_INCLUDED = '' %THEN                                              
* %DO;                                                                          
*/* Macro made bi-lingual on 21215. CBGEN compile date 21138         */         
*% /*                                                                           
         MACRO                                                                  
         ERBASIG3 &DSECT=YES,&LIST=YES,&TITLE=YES,&ASIARRAY=YES,       *        
               &ASIG3=COND,&SS_TABLE=COND,&SS_ROW=COND                          
                      GBLC  &ERBASIG3_INCLUDED                                  
                      GBLC  &ZCBPRINT                                           
&ERBASIG3_INCLUDED    SETC  'YES'                                               
                      AIF   ('&LIST' EQ 'NONE').P0                              
                      AIF   ('&TITLE' EQ 'NO').P5                               
 TITLE                'ERBASIG3  - Mapping for Mon III Data Gat Address*        
                Space ID Table Entry     '                                      
.P5                   ANOP                                                      
**/ ;                                                                           
*/****  START OF SPECIFICATIONS  *************************************/         
*/**                                                                 */         
*/*01* Proprietary Statement:                                   @A04C*/         
*/*       Licensed Materials - Property of IBM                       */         
*/*       "Restricted Materials of IBM"                              */         
*/*       Copyright IBM Corp. 1983, 2021                             */         
*/*                                                                  */         
*/*       Status: z/OS V2R5 Data Gatherer (HRG77D0)                  */         
*/**                                                                 */         
*/*01  Macro Name: ERBASIG3                                          */         
*/*                                                                  */         
*/*01* Descriptive Name:                                             */         
*/*    Mapping for Mon III Data Gat Address Space ID Table Entry     */         
*/*                                                             @A04C*/         
*/*                                                             @A04D*/         
*/*01* Dsect Name: ASIG3                                             */         
*/*                                                                  */         
*/*01* Component: zOS Data Gatherer (27401)                          */         
*/*                                                                  */         
*/*01* Eye-Catcher:  ASIG3                                           */         
*/*02*  Offset:  0                                                   */         
*/*02*  Length:  5                                                   */         
*/*                                                                  */         
*/*01* Storage Attributes:                                           */         
*/*02*  Subpool: 2                                                   */         
*/*02*  Key:  8                                                      */         
*/*02*  Residency:  Above 16 MB in virtual storage.                  */         
*/*02*  Main Storage:  Not applicable                                */         
*/*02*  Auxiliary Storage:  Not applicable                           */         
*/*02*  Virtual Storage:  Not applicable                             */         
*/*                                                                  */         
*/*01* Size:                                                    @A04C*/         
*/*            ASIARRAY -- X'0500' bytes                             */         
*/*            ASIG3    -- X'04E0' bytes                             */         
*/*            SS_TABLE -- X'0020' bytes                             */         
*/*            SS_ROW   -- X'0004' bytes                             */         
*/*                                                             @A04D*/         
*/*01* Pointed to by: SSHASIP field of the ERBSSHG3 CB               */         
*/*                                                                  */         
*/*01* Serialization: None                                           */         
*/*                                                                  */         
*/*01* Function: This macro maps the Monitor III Data Gatherer       */         
*/*             Address Space ID Table Entry and the Address Space   */         
*/*             ID Table and the Address Space ID Look Up Table @A04C*/         
*/*                                                                  */         
*/*01* Method of Access: See below                                   */         
*/*                                                                  */         
*/*   ASM:   ERBASIG3                                           @A04A*/         
*/*                                                                  */         
*/*   PL/X:  See below                                               */         
*/*          ASIG3 is declared as a based structure, ASIG3PTR should */         
*/*          be declared                                             */         
*/*                                                                  */         
*/*          PERCENT INCLUDE SYSLIB(ERBASIG3) SEMICOLON              */         
*/*                                                                  */         
*/*                                                             @A04D*/         
*/*01* Status: z/OS V2R5 Data Gatherer (HRG77D0)                     */         
*/*                                                                  */         
*/*01* Frequency: 1                                                  */         
*/*                                                                  */         
*/*01* Dependencies: None                                            */         
*/*                                                                  */         
*/*01* Distribution Library: AGRBMAC1                           @A04C*/         
*/*                                                                  */         
*/*01* Change Activity: See below                                    */         
*/*                                                                  */         
*/* $M0=MONIIIG,HRM3202,,PFU: MAPPING MACRO FOR ASID TABLE ENTRY     */         
*/* $P1=ES,HRM3302,,MLN: extended storage support                @P1A*/         
*/* $Q1=PERI,HRM3402,,PFU: Performance improvements              @Q1A*/         
*/* $Q2=NEWREP,HRM3402,,MLN: New and Changed Reports             @Q2A*/         
*/* $T1=VECTOR,HRM3502,,RB: 3090 Vector Facility                 @T1A*/         
*/* $W1=PLAS,HRM4410,,OST: PLAS Conversion                       @W1A*/         
*/* $W2=OPER,JRM4411,,MLN: Operations Support                    @W2A*/         
*/* $W3=SMF,JRM4411,,BHL: SMF Record 72                          @W3A*/         
*/* $W4=STOR,JRM4411,,PFU: Storage enhancements                  @W4A*/         
*/* $Y1=OPII,HRM4420,,FDL: Operations Support                    @Y1A*/         
*/* $Y2=XCF,HRM4420,,BHL: XCF support                            @Y2A*/         
*/* $A1=APPC,JRM4421,,BSTB: APPC support                         @A1A*/         
*/* $A2=WSET,JRM4421,,JUR: Working set management/block paging   @A2A*/         
*/* $B1=RTIME,HRM4430,,BHL: Response time support                @B1A*/         
*/* $B2=M3ENH,HRM4430,,RTL: Monitor III Enhancements             @B2A*/         
*/* $B3=CONV,HRM4430,,PFU: Conversion from prev release data     @B3A*/         
*/* $B4=CSA,HRM4430,,AJU: Usage of CSA/SQA                       @B4A*/         
*/* BHL: ASIIOCNT changed from FIXED(31) TO FIXED(32)        @YA57924*/         
*/* $B5=OMVS,HRM4430,,RPT: OPEN/MVS Toleration Support           @B5A*/         
*/* $C1=WLM3,HRM5510,,HBE: Workload Manager - Monitor III        @C1A*/         
*/* LAN: Corrects SWAP Section Handling                      @WA03326*/         
*/*      Equivalent to OW01699                               @WA03326*/         
*/* $D1=CAP,HRM5520,,JKE: Captured Storage support               @D1A*/         
*/* PFU: Clear new ASIG3 entry                               @WA11704*/         
*/* $E1=ISSC,OW20266,,RTL: New WFEX Exceptions for ISSC          @E1A*/         
*/* $E2=WLM,HRM6603,,HOL: Workload Manager Support               @E2A*/         
*/* $H1=ENC,HRM6607,,HOL: Extended Enclave Support               @H1A*/         
*/* $I1=USS,HRM7703,,HOL: UNIX System Services Support           @I1A*/         
*/* $J1=GMI,HRM7705,,BEN: Goal Mode Inhibitors removal           @J1A*/         
*/* $J2=MISC,HRM7705,,GUB: New swap reason code                  @J2A*/         
*/* $K1=IFA,OA05731,,WLR: IFA support                            @K1A*/         
*/* $L1=EMC,HRM7720,,WLR: eServer Metrics Collector              @L1A*/         
*/* WLR: Honours crossover=no for PROC primary reason        @OA10909*/         
*/* WLR: System Utility Processor (zIIP) support             @OA13499*/         
*/* $11=LPS,HRM7740,,WLR: Large Page support                     @11A*/         
*/* $21=COMM,HRM7750,,WLR: 64-bit Common Memory support          @21A*/         
*/* $22=MISC,HRM7750,,PMU: Add comments for normalized times     @22A*/         
*/* $51=SERI,HRM7780,,JKU: Suspend Lock, Latch & ENQ Reporting   @51A*/         
*/* $52=CASE,HRM7780,,OST: Case to PL/X conversion               @52A*/         
*/* $53=MISC,HRM7780,,JKU: CICS Response Time Management         @53A*/         
*/* $61=QSCAN,HRM7790,,RRe: GRS QScan statistics                 @61A*/         
*/* $62=SPLP2,OA38660,,WLR: SCM and Pageable Large Pages Support @62A*/         
*/* $63=MISC,OA38660,,WLR: Remove expanded storage gathering     @63A*/         
*/* $64=WLMIO,HRM7790,,GUB: I/O priority group                   @64A*/         
*/* $71=GQS,HRM77A0,,HBE: GQSCAN Usage Statistics                @71A*/         
*/* $72=MT2,OA44101,,MWe: MT-2 Support                           @72A*/         
*/* $73=4TB,OA44503,,JBa: 4 TB Support                           @73A*/         
*/* $74=SPLP3,HRM77A0,,JKu: Shared Pageable Large Pages          @74A*/         
*/* $75=FreM,HRM77A0,,JBa: Freemained Frames STORF/STORR/STORS   @75A*/         
*/* JBa: Fixes Shared Pageable Large Pages                   @OA47602*/         
*/* KGE: Indicate if SMF type 72.5 gathering is activated    @OA47602*/         
*/* $81=2GB,OA48913,,JBa: Report on 2GB frame usage              @81A*/         
*/* $82=Sprk1,OA50760,,UM: Report for Spark/Cloud Stage 1        @82A*/         
*/* $91=ZCBP,OA54915,,GUB: zCBP support                          @91A*/         
*/* $92=Misc,HRM77C0,,JBa: CPU time refactoring                  @92A*/         
*/* $93=RUCSA,HRM77C0,,UMu: Restricted Use CSA implementation    @93A*/         
*/* $94=SHR64,OA57325,,UMu: Support 64 bit shared page groups    @94A*/         
*/* $A01=Split,OA58759,,JBa: RMF Product Split                  @A01A*/         
*/* $A02=ZOSB,HRG77D0,,JBa: Rename prefix ERB to GRB            @A02A*/         
*/* $A03=ZOSB,OA60212,,UMu: Mon 3 data conversion for reporter  @A03A*/         
*/* $A04=ZOSB,HRG77D0,,JBa: Make macro bilingual                @A04A*/         
*/* $A05=SRB3,OA61036,,UMu: System Recovery Boost stage 3       @A05A*/         
*/*                                                                  */         
*/****  END OF SPECIFICATIONS  ***************************************/         
*% /*                                                                           
.P0                   ANOP                                                      
                      AIF   ('&ZCBPRINT' EQ 'NO').P1                            
                      AIF   ('&LIST' EQ 'YES').P2                               
.P1                   ANOP                                                      
                      PUSH  PRINT                                               
                      PRINT OFF                                                 
.P2                   ANOP                                                      
ASIVERCB              EQU   X'1E'  Control block version number ASIG3           
SSTVERCB              EQU   X'1E'  Control block version number        *        
                                   SS_TABLE, so far ASIVERCB was used  *        
                                   for SS_Table                                 
                      AIF   ('&ASIARRAY' EQ 'NO').L0002                         
                      AIF   ('&DSECT' EQ 'YES').L0003                           
                      AIF   ('&ASIARRAY' NE 'YES').L0002                        
ASIARRAY              DS    0F     ASID table                                   
                      AGO   .L0004                                              
.L0003                ANOP                                                      
ASIARRAY              DSECT        ASID table                                   
.L0004                ANOP                                                      
ASIHEAD               DS    CL32   ASID table header                            
                      ORG   ASIHEAD                                             
ASIASIG3              DS    CL5    Acronym ASIG3                                
ASIVERG3              DS    CL1    Control block version                        
ASIHDRLE              DS    X      Length of ASIG3 header                       
                      DS    CL1    no longer used                               
ASIENTMX              DS    F      Number of entries (Last entry index *        
                                   = ASIENTMX - 1)                              
ASIENTNR              DS    F      Index of last filled entry                   
ASIENTLN              DS    F      Length of one entry                          
ASISSTVO              DS    F      Offset to service class served      *        
                                   table. This field contains the      *        
                                   offset from the begin of the ASID   *        
                                   table when the data are within the  *        
                                   wrap around buffer                           
ASIFLAG               DS    B      ASIG3 Flags                                  
*  Bit definitions:                                                             
ASI_ConvD             EQU   X'80'  ASIG3 converted to lower service    *        
                                   level                                        
ASI_ConvU             EQU   X'40'  ASIG3 converted to higher release   *        
                                   or service level                             
                      DS    CL7    Reserved                                     
ASIENTRY              DS    CL1248 Array of all ASID table entries              
.L0002                ANOP                                                      
                      AIF   ('&ASIG3' EQ 'NO').L0005                            
                      AIF   ('&DSECT' EQ 'YES').L0006                           
                      AIF   ('&ASIG3' NE 'YES').L0005                           
ASIG3                 DS    0D     Maps one entry in the ASID table             
                      AGO   .L0007                                              
.L0006                ANOP                                                      
ASIG3                 DSECT        Maps one entry in the ASID table             
.L0007                ANOP                                                      
ASIBASE               DS    CL20   Basic ASID entry data                        
                      ORG   ASIBASE                                             
ASIENIDX              DS    H      Entry index                                  
ASIPREVI              DS    H      Previous index                               
ASISORT               DS    CL16   Sort criteria (a new entry is       *        
                                   created whenever this changes for   *        
                                   the same ASID)                               
                      ORG   ASISORT                                             
ASISORT2              DS    CL8    Sort Part 1                                  
                      ORG   ASISORT2                                            
ASIJOBNA              DS    CL8    Jobname                                      
ASISORT3              DS    CL8    Sort part 3                                  
                      ORG   ASISORT3                                            
ASICLX                DS    H      Service class list index                     
ASIDMNN               DS    CL2    Domain                                       
                      ORG   ASIDMNN                                             
                      DS    CL1    Reserved                                     
ASIPER#               DS    X      Service class period                         
ASIASINR              DS    H      ASID number                                  
ASIFLAG1              DS    BL2    Sample flag 1                                
*  Bit definitions:                                                             
ASISTC                EQU   X'80'  ON = started task                            
ASIBATCH              EQU   X'40'  ON = batch job                               
ASITSO                EQU   X'20'  ON = TSO ASID                                
ASIAPPC               EQU   X'10'  ON = ASCH ASID                               
ASIOMVS               EQU   X'08'  ON = OMVS ASID                               
                      DS    BL.011 Reserved                                     
                      ORG   ASIBASE+20                                          
ASIEXTEN              DS    CL100  Extension of base section                    
                      ORG   ASIEXTEN                                            
ASICPUTA              DS    F      Total accumulated CPU time                   
ASIDCTIA              DS    F      Total accumulated channel connect   *        
                                   time                                         
ASIFIXA               DS    F      Number of accumulated fixed frames           
                      ORG   ASIFIXA                                             
ASIFIXA_VE            DS    CL4    Number of accumulated fixed frames  *        
                                   (short format floating point)                
ASITRCA               DS    F      Total accumulated number of         *        
                                   transactions                                 
ASIFMCT               DS    F      Number of accumulated frames of     *        
                                   swapped in user                              
                      ORG   ASIFMCT                                             
ASIFMCT_VE            DS    CL4    Number of accumulated frames of     *        
                                   swapped in user (short format       *        
                                   floating point)                              
ASIFMCTI              DS    F      Number of accumulated frames of     *        
                                   idle users                                   
                      ORG   ASIFMCTI                                            
ASIFMCTI_VE           DS    CL4    Number of accumulated frames of     *        
                                   idle users (short format floating   *        
                                   point)                                       
ASIESF                DS    F      Reserved                                     
                      ORG   ASIESF                                              
ASIESF_VE             DS    CL4    Reserved                                     
ASIESFI               DS    F      Reserved                                     
                      ORG   ASIESFI                                             
ASIESFI_VE            DS    CL4    Reserved                                     
ASIVSMPL              DS    CL2    Valid sample field                           
                      ORG   ASIVSMPL                                            
ASISMPCT              DS    H      Number of valid samples                      
ASISTACT              DS    CL10   Status counters                              
                      ORG   ASISTACT                                            
ASISWAP               DS    H      Reserved                                     
ASIIDLE               DS    H      IDLE count                                   
ASISWAR               DS    H      Swapped out ready count                      
ASIACT                DS    H      Active count (using or delayed)              
ASIUKN                DS    H      Unknown count                                
ASISIUSE              DS    CL6    Single state USE counters                    
                      ORG   ASISIUSE                                            
ASISUSEN              DS    H      Single state using                           
ASISUCPR              DS    H      Single state using PROC                      
ASISUCDV              DS    H      Single state using DEV                       
ASISIWAI              DS    CL14   Single state WAIT counters                   
                      ORG   ASISIWAI                                            
ASISWAIN              DS    H      Single state waiting                         
ASISDCPR              DS    H      Single state delayed by PROC                 
ASISDCDV              DS    H      Single state delayed by DEV                  
ASISDCST              DS    H      Single state delayed by STOR                 
ASISDCJE              DS    H      Single state delayed by JES                  
ASISDCHS              DS    H      Single state delayed by HSM                  
ASISDCEN              DS    H      Single state delayed by ENQ                  
ASIVECTA              DS    F      Total accumulated vector processor  *        
                                   time                                         
ASISOWAI              DS    CL8    Single state WAIT counters                   
                      ORG   ASISOWAI                                            
ASISDCSU              DS    H      Single state delayed by SUBS                 
ASISDCOP              DS    H      Single state delayed by OPER                 
ASISDCMS              DS    H      Single state delayed by OPER        *        
                                   MESSAGE                                      
ASISDCMT              DS    H      Single state delayed by OPER MOUNT           
ASISMF                DS    CL4    Fields used for SMF72 record                 
                      ORG   ASISMF                                              
ASIPAGES              DS    H      Page delay                                   
ASISWAPS              DS    H      Swap delay                                   
ASISTOR               DS    CL18   Fields used for Storage                      
                      ORG   ASISTOR                                             
ASIDIV                DS    F      Number of DIV frames                         
                      ORG   ASIDIV                                              
ASIDIV_VE             DS    CL4    Number of DIV frames (short         *        
                                   floating point)                              
ASIAUXSC              DS    F      Number of auxiliary slots                    
                      ORG   ASIAUXSC                                            
ASIAUXSC_VE           DS    CL4    Number of auxiliary slots (short    *        
                                   format floating point)                       
ASIPINA               DS    F      Page-In count                                
ASIDIVCT              DS    H      Number of DIV invocations                    
ASIACTHF              DS    H      Address space is active and holds   *        
                                   storage counter.                             
ASISWAPI              DS    H      address space is swapped IN                  
ASISUWAI              DS    CL2    Single state WAIT counter                    
                      ORG   ASISUWAI                                            
ASISDCXC              DS    H      Single state delayed by XCF - part  *        
                                   of SUBS                                      
ASIBASE2              DS    CL8    Additional basic ASID entry data             
                      ORG   ASIBASE2                                            
ASIJCLAS              DS    CL8    Jobclass, Source: OUCBCLS                    
ASISTOR2              DS    CL36   More Storage data                            
                      ORG   ASISTOR2                                            
ASIPINES              DS    F      Reserved                                     
ASICSTOR              DS    CL28   Common Storage Allocation                    
                      ORG   ASICSTOR                                            
ASIFLAG2              DS    BL4    Sample flag 2                                
*  Bit definitions:                                                             
ASICSAIN              EQU   X'80'  ON=CSA and RUCSA amounts incomplete          
ASISQAIN              EQU   X'40'  ON=SQA amounts incomplete                    
ASIAINIT              EQU   X'20'  ON=APPC initiator                            
ASIBINIT              EQU   X'10'  ON=BATCH initiator                           
                      DS    BL.028 Reserved                                     
                      ORG   ASIFLAG2+4                                          
ASICSASC              DS    F      CSA sample count.                            
ASISQASC              DS    F      SQA sample count.                            
ASICSAA               DS    F      CSA Allocation                               
ASISQAA               DS    F      SQA Allocation                               
ASIECSAA              DS    F      ECSA Allocation                              
ASIESQAA              DS    F      ESQA Allocation                              
ASIJLCYC              DS    F      Timeoffset when this job was found  *        
                                   the last time in the system         *        
                                   expressed in CYCLE time units (     *        
                                   SSHGOCYC contains the CYCLe time    *        
                                   unit ). The offset is based on      *        
                                   SSHTIBEG. The absolute time of the  *        
                                   last time found is calculated as    *        
                                   Abs_Last_Time = SSHTIBEG +          *        
                                   SSHGOCYC*ASIJLCYC. Note, however,   *        
                                   that either SSHTIBEG or SSHGOCYC             
*                                  have to be converted because        *        
                                   SSHTIBEG is in TOD format and       *        
                                   SSHGOCYC is in units of             *        
                                   milliseconds. ASIJLCYC is zero if   *        
                                   the time difference between the     *        
                                   last cycle time where this job was  *        
                                   found and the MINTIME begin time is *        
                                   smaller than one cycle unit.                 
ASIBASE3              DS    CL16   Additional basic ASID entry data             
                      ORG   ASIBASE3                                            
ASISORT2X             DS    CL8    Job selection time                           
                      ORG   ASISORT2X                                           
ASIJOBST              DS    CL8    Job selection time in GMT                    
ASIJESID              DS    CL8    Job ID                                       
ASIEXTN3              DS    CL68   Additional ASID data                         
                      ORG   ASIEXTN3                                            
ASITET                DS    F      Transaction elapsed time, in 1024   *        
                                   microsecs units                              
ASISRBTA              DS    F      Total accumulated SRB time                   
ASIIOCNT              DS    F      EXCP count                                   
ASILSCT               DS    H      Count of "long" logical swaps                
ASIESCT               DS    H      Reserved                                     
ASIPSCT               DS    H      Reserved                                     
ASILSCF               DS    CL4    Sum of all central frames for       *        
                                   logically swapped user at all       *        
                                   samples. Floating point.                     
ASILSEF               DS    CL4    Reserved                                     
ASILSSA               DS    H      Total logically swapped samples              
ASIPSEF               DS    CL4    Reserved                                     
ASIPSSA               DS    H      Reserved                                     
ASISWRE               DS    CL34   Swap reason counts, see also /      *        
                                   ASISWRE2 and ASISWRE3                        
                      ORG   ASISWRE                                             
ASIORTI               DS    H      STOR/OUTR delay samples for SWAP    *        
                                   REASON 2: TERMINAL INPUT WAIT                
ASIORTO               DS    H      STOR/OUTR delay samples for SWAP    *        
                                   REASON 1: TERMINAL OUTPUT WAIT               
ASIORLW               DS    H      STOR/OUTR delay samples for swap    *        
                                   reason 3: Long wait                          
ASIORXS               DS    H      STOR/OUTR delay samples for swap    *        
                                   reason 4: Aux. storage shortage              
ASIORRS               DS    H      STOR/OUTR delay samples for swap    *        
                                   reason 5: Real storage shortage              
ASIORDW               DS    H      STOR/OUTR delay samples for swap    *        
                                   reason 6: Detected long wait                 
ASIORRQ               DS    H      STOR/OUTR delay samples for swap    *        
                                   reason 7: Requested swap, no longer *        
                                   used. Uses ASIORMP instead                   
ASIORNQ               DS    H      STOR/OUTR delay samples for swap    *        
                                   reason 8: Enqueue exchange swap              
ASIOREX               DS    H      STOR/OUTR delay samples for swap    *        
                                   reason 9: Exchange swap                      
ASIORUS               DS    H      STOR/OUTR delay samples for swap    *        
                                   reason 10: Unilateral swap                   
ASIORTS               DS    H      STOR/OUTR delay samples for swap    *        
                                   reason 11: Transition swap                   
ASIORIC               DS    H      STOR/OUTR delay samples for swap    *        
                                   reason 12: Improve central storage  *        
                                   usage                                        
ASIORIP               DS    H      STOR/OUTR delay samples for swap    *        
                                   reason 13: Improve system paging    *        
                                   rate                                         
ASIORMR               DS    H      STOR/OUTR delay samples for swap    *        
                                   reason 14: Make room for an out too *        
                                   long user                                    
ASIORAW               DS    H      STOR/OUTR delay samples for swap    *        
                                   reason 15: APPC wait                         
ASIORIW               DS    H      STOR/OUTR delay samples for swap    *        
                                   reason 16: OMVS input                        
ASIOROW               DS    H      STOR/OUTR delay samples for swap    *        
                                   reason 17: OMVS output                       
ASIBASE4              DS    CL4    Additional basic ASID entry data             
                      ORG   ASIBASE4                                            
ASIRCLX               DS    H      Report class list index                      
ASISWRE2              DS    CL2    Additional swap rsn count                    
                      ORG   ASISWRE2                                            
ASIORSR               DS    H      STOR/OUTR delay samples for swap    *        
                                   rsn 18: In-real swap                         
ASIEXTN4              DS    CL188  Additional ASID data                         
                      ORG   ASIEXTN4                                            
ASISTACS              DS    CL20   Status counters - single state               
                      ORG   ASISTACS                                            
ASICPUC               DS    H      CPU capping delay                            
ASIACOM               DS    H      Common paging                                
ASIAPRV               DS    H      Private paging                               
ASIAVIO               DS    H      VIO paging                                   
ASIASWA               DS    H      Swapping                                     
ASIUNKN               DS    H      Unknown count for calculating       *        
                                   execution velocity                           
ASICCAP               DS    H      Resource capping delay                       
ASICQUI               DS    H      Quiesce delay                                
ASIAXM                DS    H      Cross memory delay                           
ASIAHSP               DS    H      Hiperspace delay                             
ASISTACM              DS    CL8    Status counters - multi state                
                      ORG   ASISTACM                                            
ASICUSE               DS    F      CPU using                                    
ASITOTD               DS    F      Total delays for calculating        *        
                                   execution velocity                           
ASISRVO               DS    F      Offset from service class served    *        
                                   table header to corresponding row            
ASISHPAG              DS    CL20   Additional ASID data for shared     *        
                                   paging                                       
                      ORG   ASISHPAG                                            
ASITOTSV              DS    CL4    Total number of shared page views   *        
                                   in this address space (short        *        
                                   floating point)                              
ASISVINR              DS    CL4    Total number of shared pages in     *        
                                   central storage that are valid in   *        
                                   this address space (short floating  *        
                                   point)                                       
ASISPVLC              DS    CL4    Increasing number of shared page    *        
                                   validations in this address space   *        
                                   (short floating point)                       
ASIGSPPI              DS    CL4    Total number of shared page-ins     *        
                                   from auxiliary storage for this     *        
                                   address space (short floating       *        
                                   point)                                       
ASIGASPD              DS    H      Single state samples delayed for    *        
                                   shared storage paging                        
                      DS    CL2    Reserved                                     
ASIOREPL              DS    F      Number of outstanding replies                
ASISTC2M              DS    CL8    Status counters 2 - multi state              
                      ORG   ASISTC2M                                            
ASITOTU               DS    F      Total using for velocity                     
ASIIOU                DS    F      I/O using                                    
ASI_ASST              DS    F      Additional SRB Service Time. CPU    *        
                                   time is accumulated here for this   *        
                                   address space's Preemptable SRBs    *        
                                   and for Client Related SRBs for     *        
                                   which this address space is the     *        
                                   client (in ms.)                              
                      ORG   ASI_ASST                                            
ASIASSTA              DS    F      equals ASI_ASST                              
ASI_PHTM              DS    F      Preemptable-class SRB Time. The CPU *        
                                   time for all types of preemptable   *        
                                   SRBs (PSRB, CRSRB, ESRB, ETCB)      *        
                                   executing with this address space   *        
                                   as their home space is accumulated  *        
                                   here (in ms.)                                
                      ORG   ASI_PHTM                                            
ASIPHTMA              DS    F      equals ASI_PHTM                              
ASIMSTS               DS    BL4    Miscellaneous states                         
                      ORG   ASIMSTS                                             
ASIMSTS1              DS    B      State byte 1                                 
*  Bit definitions:                                                             
ASIOASB               EQU   X'80'  Address space is OMVS related                
ASITRXN               EQU   X'40'  Address space matched a             *        
                                   classification rule in the active   *        
                                   policy which prevents managing the  *        
                                   region based on the response time   *        
                                   goals of its served transactions             
ASICPUP               EQU   X'20'  CPU protection was assigned either  *        
                                   to the address space or to          *        
                                   transaction service classes being   *        
                                   served by the space, and SRM is     *        
                                   honoring the protection                      
ASISTOP               EQU   X'10'  Storage protection was assigned     *        
                                   either to the address space or to   *        
                                   transaction service classes being   *        
                                   served by the space, and SRM is     *        
                                   honoring the protection                      
ASISVRR               EQU   X'08'  This address space provides service *        
                                   to transactions classified to a     *        
                                   different class than the address    *        
                                   space itself                                 
ASIMASS               EQU   X'04'  WLM is managing this address space  *        
                                   to meet the goals of work in other  *        
                                   service classes                              
ASITRXB               EQU   X'02'  Address space is a CICS TOR that    *        
                                   matched a classification rule in    *        
                                   the active policy which allows      *        
                                   managing the region based on the    *        
                                   region goals but also ensures that  *        
                                   completed transactions are reported *        
                                   and used for management of the CICS *        
                                   AORs                                         
ASIIOPG               EQU   X'01'  I/O priority group HIGH was         *        
                                   assigned either to the address      *        
                                   space or to transaction service     *        
                                   classes served by the address space          
ASIMSTS2              DS    B      State byte 2                                 
*  Bit definitions:                                                             
ASITRG                EQU   X'80'  Address space is currently          *        
                                   associated with a tenant resource   *        
                                   group                                        
ASIRPBoost            EQU   X'20'  Address space matched a             *        
                                   classification rule in the active   *        
                                   policy which enables for recovery   *        
                                   process boost                                
                      DS    BL2    Reserved                                     
ASI_zCBP              DS    CL20   zCBP ASID data                               
                      ORG   ASI_zCBP                                            
ASI_zAAP              DS    CL20   or zAAP ASID data                            
                      ORG   ASI_zAAP                                            
ASISUCIF              DS    H      Single state zCBP using when        *        
                                   GEIzCBP is on. Else, single state   *        
                                   zAAP using                                   
ASISUCIC              DS    H      Single state zCBP on CP using when  *        
                                   GEIzCBP is on. Else, single state   *        
                                   zAAP on CP using                             
ASISDCIF              DS    H      Single state delayed by zCBP when   *        
                                   GEIzCBP is on. Else, single state   *        
                                   delayed by zAAP                              
ASISDCCP              DS    H      Single state delayed by CP                   
ASI_Time_On_CP        DS    F      Accumulated CP time                          
                      ORG   ASI_Time_On_CP                                      
ASICPTA               DS    F      equals ASI_Time_On_CP                        
ASIIFATA              DS    F      Accumulated zAAP time when GEIzCBP  *        
                                   is off                                       
ASIIFCTA              DS    F      Accumulated zAAP on CP time when    *        
                                   GEIzCBP is off                               
ASIMULTI              DS    CL8    Multi state counts                           
                      ORG   ASIMULTI                                            
ASIMCUSE              DS    F      Multi state proc using count                 
ASIMCDLY              DS    F      Multi state proc delay count                 
ASI_zIIP              DS    CL16   zIIP ASID data                               
                      ORG   ASI_zIIP                                            
ASISUCCP              DS    H      Single state using CP                        
ASISUCSP              DS    H      Single state using zIIP                      
ASISUCSC              DS    H      Single state using zIIP on CP                
ASISDCSP              DS    H      Single state delayed by zIIP                 
ASI_Time_On_zIIP      DS    F      Accumulated zIIP time                        
ASI_zIIP_Time_On_CP   DS    F      Accumulated zIIP on CP time                  
ASI_IFA_PHTM          DS    F      Preemptable-class SRB time for zAAP *        
                                   processors in ms when GEIzCBP is    *        
                                   off. This is "normalized" time               
ASI_zIIP_PHTM         DS    F      Preemptable-class SRB Time for zIIP *        
                                   processors in ms This is            *        
                                   "normalized" time                            
ASI_LPS               DS    CL60   Memory objects support                       
                      ORG   ASI_LPS                                             
ASI_LargeMemoryObjects DS   CL4    Number of fixed 1 MB memory objects *        
                                   allocated                                    
ASI_LargePagesBackedInReal DS CL4  Number of 1 MB pages fixed in       *        
                                   central storage                              
ASI_LVNMOMB           DS    CL4    Number of high virtual private      *        
                                   memory objects allocated                     
ASI_HVCommonNMOMB     DS    CL4    Number of high virtual common       *        
                                   memory objects allocated                     
ASI_LVSHRNMOMB        DS    CL4    Number of high virtual shared       *        
                                   memory objects allocated                     
ASI_LVABytes          DS    CL8    Amount of storage allocated from    *        
                                   high virtual private memory in      *        
                                   memory objects                               
ASI_HVCommonBytes     DS    CL8    Amount of storage allocated from    *        
                                   high virtual common memory in       *        
                                   memory objects                               
ASI_LVSHRBytes        DS    CL8    Amount of storage in shared memory  *        
                                   objects owned by this address space          
ASI_HVCommonHWMBytes  DS    CL8    High water mark for the amount of   *        
                                   high virtual common storage         *        
                                   allocated                                    
ASI_LVMemLim          DS    CL8    Address space memory limit in MB             
ASIBASE5              DS    CL8    Additional basic ASID entry data             
ASIEXTN5              DS    CL432  Lock Instrumentation Data                    
                      ORG   ASIEXTN5                                            
ASIEXTN5A             DS    CL368  Reserved                                     
ASIEXTN5B             DS    CL64                                                
                      ORG   ASIEXTN5B                                           
ASIQScanStats         DS    CL64   Statistics for QScan requests from  *        
                                   this address space                           
                      ORG   ASIQScanStats                                       
ASIQScanReq           DS    FL8    Count of requests                            
ASIQScanSpecReq       DS    FL8    Count of specific requests                   
ASIQScanRes           DS    FL8    Count of resources                           
ASIQScanResSq         DS    CL16   Sum of the squares of the resource  *        
                                   counts                                       
ASIQScanTime          DS    CL8    Amount of request times in          *        
                                   microseconds                                 
ASIQScanTimeSq        DS    CL16   Sum of the squares of the request   *        
                                   times in microseconds                        
ASIEXTN6              DS    CL8    Additional ASID entry data                   
                      ORG   ASIEXTN6                                            
ASI_PLP               DS    CL8    Pageable Large Pages support                 
                      ORG   ASI_PLP                                             
ASI_1MBFixedFrames    DS    CL4    Number of 1 MB page-fixed frames    *        
                                   used for pageable/DREF memory       *        
                                   objects                                      
ASI_1MBPageableFrames DS    CL4    Number of 1 MB pageable/DREF frames          
ASIStorLong           DS    CL56   Storage counts in long floating     *        
                                   point format                                 
                      ORG   ASIStorLong                                         
ASIFIXA_LF            DS    CL8    Number of fixed frames                       
ASIFMCT_LF            DS    CL8    Number of frames of swapped in      *        
                                   users                                        
ASIFMCTI_LF           DS    CL8    Number of frames of idle users               
ASIAUXSC_LF           DS    CL8    Number of auxilliary slots                   
ASILSCF_LF            DS    CL8    Number of frames of logically       *        
                                   swapped users                                
ASITOTSV_LF           DS    CL8    Number of shared page views. Does   *        
                                   not include high virtual shared     *        
                                   pages.                                       
ASISVINR_LF           DS    CL8    Number of shared pages. Does not    *        
                                   include high virtual shared pages.           
ASIMultiThreading     DS    CL48   Reserved                                     
ASIEXTN6B             DS    CL8    Additional ASID entry data                   
                      ORG   ASIEXTN6B                                           
ASI_Asst_Time_On_CP   DS    F      Additional SRB Service Time on a    *        
                                   standard CP. CPU time is            *        
                                   accumulated here for this address   *        
                                   space's Preemptable SRBs and for    *        
                                   Client Related SRBs for which this  *        
                                   address space is the client (in     *        
                                   ms.)                                         
                      DS    CL4    Not used                                     
ASIJobUsage           DS    CL64   Additional Metrics for Job Usage    *        
                                   Report                                       
                      ORG   ASIJobUsage                                         
ASIDP                 DS    H      Dispatching priority                         
                      DS    H      Not used                                     
ASITRT                DS    F      Transaction resident time                    
ASITRCA_S             DS    F      Total accumulated number of         *        
                                   transactions (sum)                           
ASIDCTIA_S            DS    F      Total accumulated channel connect   *        
                                   time (sum)                                   
ASIIOCNT_S            DS    F      Total EXCP count (sum)                       
                      DS    CL4    Not used                                     
ASICPUTA_LF           DS    CL8    Total accumulated CPU time in       *        
                                   milliseconds (long float)                    
ASITCBTA_LF           DS    CL8    Total accumulated TCB time in       *        
                                   milliseconds (long float)                    
ASIFRXH_LF            DS    CL8    Number of fixed frames high (long   *        
                                   floating point)                              
ASIFRXA_LF            DS    CL8    Number of fixed frames above (long  *        
                                   floating point)                              
ASIFRXB_LF            DS    CL8    Number of fixed frames below (long  *        
                                   floating point)                              
ASIEXTN7              DS    CL40   Additional ASID entry data                   
                      ORG   ASIEXTN7                                            
ASI_SPLP              DS    CL12   Shared Pageable Large Pages                  
                      ORG   ASI_SPLP                                            
ASI_HvShrPageValidations DS CL4    Number of page validations for high *        
                                   virtual shared                               
ASI_LvShr1MNMomb      DS    CL8    Number of shared 1MB memory objects *        
                                   allocated                                    
ASI_LvShr4KB          DS    CL8    Number of shared bytes from HV      *        
                                   memory in units of 4KB                       
ASI_LvShr1MGBytes     DS    CL8    High water mark in bytes for the    *        
                                   amount of storage allocated in      *        
                                   shared memory objects                        
ASI_FreemainedFrames  DS    CL8    Freemained frames of AS                      
                      DS    CL4    Not used                                     
ASISTAFL              DS    BL4    Status flags                                 
*  Bit definitions:                                                             
ASISMF725             EQU   X'80'  ON = SMF72.5 deactivated                     
                      DS    BL.031 Not used                                     
                      ORG   ASISTAFL+4                                          
                      DS    CL4    Not used                                     
ASIEXTN8              DS    CL16   Additional ASID entry data                   
                      ORG   ASIEXTN8                                            
ASI_2GBFR             DS    CL16   2 GB Frame Usage                             
                      ORG   ASI_2GBFR                                           
ASI_2GMemoryObjects   DS    CL8    Number of fixed 2 GB memory objects *        
                                   allocated                                    
ASI_2GPagesBackedInReal DS  CL8    Number of 2 GB pages fixed in       *        
                                   central storage                              
ASIEXTN9              DS    CL8    Additional ASID entry data                   
                      ORG   ASIEXTN9                                            
ASISWRE3              DS    CL8    Additional swap rsn count                    
                      ORG   ASISWRE3                                            
ASIORMP               DS    H      STOR/OUTR delay samples for swap    *        
                                   rsn 7: Memory pool shortage                  
                      DS    CL6    Not used                                     
ASIEXTNA              DS    CL36   Additional ASID entry data,         *        
                                   processor times                              
                      ORG   ASIEXTNA                                            
ASIEXTNAA             DS    CL16                                                
                      ORG   ASIEXTNAA                                           
ASISRBTA_CP           DS    F      Accumulated SRB time on CP                   
ASI_SRB_Time_On_CP    DS    F      Non-preemtable SRB time on CP                
                      ORG   ASIEXTNAA+16                                        
ASIEXTNAB             DS    CL20   Reserved                                     
ASIEXTNB              DS    CL60   Additional ASID entry data:         *        
                                   processor times separated as        *        
                                   provided by Supervisor, and         *        
                                   combined values for simple reporter *        
                                   formulas                                     
                      ORG   ASIEXTNB                                            
ASI_EJST              DS    F      TCB processor time (all processor   *        
                                   types)                                       
ASISPACEB1            DS    CL4    Internal use                                 
ASI_SRBT              DS    F      Non-preemptable SRB time (all       *        
                                   processor types)                             
ASISPACEB3            DS    CL4    Internal use                                 
ASISPACEB4            DS    CL4    Internal use                                 
ASISPACEB5            DS    CL4    Internal use                                 
ASICPUTA_CP           DS    F      All non-enclave time on CP. This    *        
                                   includes TCB, non-preemptable SRB,  *        
                                   Client SRB, Other SRB.                       
ASISPACEB7            DS    CL4    Internal use                                 
ASISPACEB8            DS    CL4    Internal use                                 
ASISPACEB9            DS    CL4    Internal use                                 
ASI_CP_PHTM           DS    F      Preemptable-class SRB Time on CP.   *        
                                   Time for all types of preemptable   *        
                                   SRBs (PSRB, CRSRB, ESRB, ETCB).              
                      DS    CL16   Reserved                                     
ASIEXTNC              DS    CL16   Miscellanious ASID data                      
                      ORG   ASIEXTNC                                            
ASIRUCSAA             DS    F      RUCSA allocation                             
ASIERUCSAA            DS    F      ERUCSA allocation                            
                      DS    CL8    Reserved                                     
ASIEND                DS    0C     Force dword boundary                         
.L0005                ANOP                                                      
                      AIF   ('&SS_TABLE' EQ 'NO').L0008                         
                      AIF   ('&DSECT' EQ 'YES').L0009                           
                      AIF   ('&SS_TABLE' NE 'YES').L0008                        
SS_TABLE              DS    0F     Service class served table                   
                      AGO   .L000A                                              
.L0009                ANOP                                                      
SS_TABLE              DSECT        Service class served table                   
.L000A                ANOP                                                      
SS_HEAD               DS    CL32   Service class served table header            
                      ORG   SS_HEAD                                             
SS_ACRO               DS    CL5    Acronym ASISS/ASLSS                          
SS_VER                DS    CL1    Control block version x'1E'                  
SS_HLEN               DS    H      Length of table header                       
SS_TLEN               DS    F      Total length of table including the *        
                                   table header                                 
SS_RLEN               DS    H      Length of one row                            
SS_ELEN               DS    H      Length of one entry                          
SS_SRVM#              DS    H      Maximum # of servers                         
SS_SRVA#              DS    H      Actual # of servers                          
SS_SCL#               DS    H      Actual # of service classes defined          
                      DS    CL10   Reserved                                     
.L0008                ANOP                                                      
                      AIF   ('&SS_ROW' EQ 'NO').L000B                           
                      AIF   ('&DSECT' EQ 'YES').L000C                           
                      AIF   ('&SS_ROW' NE 'YES').L000B                          
SS_ROW                DS    0F     Maps one service class served table *        
                                   row for a server address space. The *        
                                   # of entries is equal to the actual *        
                                   # of defined service classes                 
                      AGO   .L000D                                              
.L000C                ANOP                                                      
SS_ROW                DSECT        Maps one service class served table *        
                                   row for a server address space. The *        
                                   # of entries is equal to the actual *        
                                   # of defined service classes                 
.L000D                ANOP                                                      
SS_ENTRY              DS    F      Number of times the address space   *        
                                   has served this service class                
.L000B                ANOP                                                      
                      AIF   ('&ZCBPRINT' EQ 'NO').P3                            
                      AIF   ('&LIST' EQ 'YES').P4                               
.P3                   ANOP                                                      
                      POP   PRINT                                               
.P4                   ANOP                                                      
.P_EXIT               ANOP                                                      
                      MEND                                                      
**/ ;                                                                           
* %ERBASIG3_INCLUDED = 'YES';                                                   
* %DCL ZCBPRINT CHAR EXT;                                                       
* %DEACTIVATE ZCBPRINT;                                                         
* %DCL ERBASIG3_LIST CHAR EXT;                                                  
* %DEACTIVATE ERBASIG3_LIST;                                                    
* %IF ERBASIG3_LIST = 'NO' !                                                    
*    ZCBPRINT = 'NO' %THEN                                                      
* %DO;                                                                          
*   @LIST PUSH NOECHO;                                                          
*   @LIST NOASSEMBLE NOECHO;                                                    
*   @LIST OFF C NOECHO;                                                         
* %END;                                                                         
*/* Start of PL/X Source                                             */         
*                                                                               
*%IBM_CBGEN_PADI = '';                                        /*@A04A*/         
*%If IBM_CBGEN = 'YES' ! IBM_PADI = 'YES' %Then %Do;          /*@A04A*/         
*   %IBM_CBGEN_PADI = 'YES';                                  /*@A04A*/         
*%End;                                                        /*@A04A*/         
*                                                                               
*%If IBM_CBGEN <> 'YES' %Then %Do;                            /*@A04A*/         
*/********************************************************************/         
*/* Notes:                                                           */         
*/*                                                                  */         
*/*  1. The constant ASIVERCB and the comment of the field ASIVERG3  */         
*/*     have to be updated whenever this control block becomes       */         
*/*     incompatible to the  previous version.                   @B1A*/         
*/*                                                                  */         
*/*  2. This data aggregate is stored in permanent storage.          */         
*/*     Any changes made must be reflected in the reporter           */         
*/*     conversion process. Especially the control block             */         
*/*     ERBVFMG3 needs to be updated.                            @B1A*/         
*/*                                                                  */         
*/**************************************************************@A04M*/         
*%End;                                                        /*@A04A*/         
*                                                                               
*DCL ASIVERCB BIT(8) CONSTANT('1E'X); /* Control block version number           
*                                        ASIG3                  @A03C*/         
*DCL ALRVERCB BIT(8) CONSTANT('1E'X); /* Control block version number           
*                                        ALRG3                  @A03A*/         
*DCL SSTVERCB BIT(8) CONSTANT('1E'X); /* Control block version number           
*                                        SS_TABLE, so far ASIVERCB was          
*                                        used for SS_Table      @A03A*/         
*DCL SORTVERCB BIT(8) CONSTANT('01'X); /* Control block version number          
*                                        ASIG3_SORT_EXT         @A03A*/         
*DCL ASIV41CB BIT(8) CONSTANT('05'X); /* Release 4.1 version number             
*                                      (for migration purpose)   @Y1A*/         
*DCL ASIMT2CB BIT(8) CONSTANT('18'X); /* Multi-threading (SMT, MT2)             
*                                      introduced with control block            
*                                      version '18'X                            
*                                      (for migration purpose)   @92A*/         
*DCL 1 ASIARRAY BDY(WORD) BASED,    /* ASID table                @Q1M*/         
*      3 ASIHEAD,                   /* ASID table header         @W1A*/         
*        5 ASIASIG3 CHAR(5),        /* Acronym ASIG3             @W1C*/         
*        5 ASIVERG3 CHAR(1),        /* Control block version     @L1C*/         
*        5 ASIHDRLE FIXED(8),       /* Length of ASIG3 header    @W1C*/         
*        5 *        CHAR(1),        /* no longer used           @A03C*/         
*        5 ASIENTMX FIXED(31),      /* Number of entries (Last entry            
*                                      index = ASIENTMX - 1)     @W1C*/         
*        5 ASIENTNR FIXED(31),      /* Index of last filled entry@W1C*/         
*        5 ASIENTLN FIXED(31),      /* Length of one entry       @B3A*/         
*        5 ASISSTVO FIXED(31),      /* Offset to service class served           
*                                      table.                                   
*                                      This field contains the offset           
*                                      from the begin of the ASID               
*                                      table when the data are within           
*                                      the wrap around buffer   @A04C*/         
*          7 ASISSTVP PTR(31),      /* Pointer to service class served          
*                                      table                    @A04C*/         
*        5 ASIFLAG  Bit(8),         /* ASIG3 Flags              @A03A*/         
*          7 ASI_ConvD  Bit(1),     /* ASIG3 converted to lower                 
*                                      service level            @A03A*/         
*          7 ASI_ConvU  Bit(1),     /* ASIG3 converted to higher                
*                                      release or service level @A03A*/         
*          7 *          Bit(6),     /* Reserved                 @A03A*/         
*        5 *        CHAR(7),        /* Reserved                 @A03C*/         
*      3 ASIENTRY(0:*) CHAR(LENGTH(ASIG3));                                     
*                                   /* Array of all ASID table                  
*                                      entries                   @Q1M*/         
*DCL 1 ASIG3 BASED(ASIG3PTR) BDY(DWORD),                                        
*                                   /* Maps one entry in the ASID               
*                                      table                     @51C*/         
*      3 ASIBASE BDY(WORD),         /* Basic ASID entry data     @Q1C*/         
*        5 ASIENIDX FIXED(16),      /* Entry index               @Q1A*/         
*        5 ASIPREVI FIXED(16),      /* Previous index            @Q1C*/         
*                                                              /*@Q1D*/         
*        5 ASISORT BDY(WORD),       /* Sort criteria (a new entry is            
*                                      created whenever this changes            
*                                      for the same ASID)        @Q1A*/         
*          7 ASISORT2 BDY(WORD),    /* Sort Part 1               @B4A*/         
*            9 ASIJOBNA CHAR(8),    /* Jobname                       */         
*          7 ASISORT3 BDY(WORD),    /* Sort part 3               @B4A*/         
*            9 ASICLX   FIXED(16),  /* Service class list index @A04C*/         
*              11 ASINPG FIXED(15), /* Control performance grp  @A04C*/         
*            9 ASIDMNN  CHAR(2),    /* Domain                    @B4C*/         
*              11 *       CHAR(1),  /* Reserved                  @B4C*/         
*              11 ASIPER# FIXED(8), /* Service class period     @A04C*/         
*                13 ASIDMN PTR(8),  /* Domain                   @A04C*/         
*            9 ASIASINR FIXED(16),  /* ASID number               @B4C*/         
*            9 ASIFLAG1 BIT(16),    /* Sample flag 1             @B4C*/         
*              11 ASISTC   BIT(1),  /* ON = started task         @B4C*/         
*              11 ASIBATCH BIT(1),  /* ON = batch job            @B4C*/         
*              11 ASITSO   BIT(1),  /* ON = TSO ASID             @B4C*/         
*              11 ASIAPPC  BIT(1),  /* ON = ASCH ASID            @B4C*/         
*              11 ASIOMVS  BIT(1),  /* ON = OMVS ASID            @B5A*/         
*              11 *        BIT(11), /* Reserved                  @B5C*/         
*      3 ASIEXTEN BDY(WORD),        /* Extension of base section     */         
*        5 ASICPUTA FIXED(31),      /* Total accumulated CPU time               
*                                                               @A04C*/         
*        5 ASIDCTIA FIXED(31),      /* Total accumulated channel                
*                                      connect time                  */         
*        5 ASIFIXA  FIXED(31),      /* Number of accumulated fixed              
*                                      frames                        */         
*          7 ASIFIXA_VE CHAR(4) BDY(WORD), /* Number of accumulated             
*                                      fixed frames (short format               
*                                      floating point)           @B2A*/         
*                                                             /*3@Q1D*/         
*        5 ASITRCA  FIXED(32),      /* Total accumulated number of              
*                                      transactions              @Q2A*/         
*        5 ASIFMCT  FIXED(31),      /* Number of accumulated frames of          
*                                      swapped in user               */         
*          7 ASIFMCT_VE CHAR(4) BDY(WORD), /* Number of accumulated             
*                                      frames of swapped in user (short         
*                                      format floating point)    @B2A*/         
*                                                             /*7@Q2D*/         
*        5 ASIFMCTI FIXED(31),      /* Number of accumulated frames of          
*                                      idle users                @Q2A*/         
*          7 ASIFMCTI_VE CHAR(4) BDY(WORD), /* Number of accumulated            
*                                      frames of idle users (short              
*                                      format floating point)    @B2A*/         
*        5 ASIESF   FIXED(31),      /* Reserved                  @63C*/         
*          7 ASIESF_VE CHAR(4) BDY(WORD), /* Reserved            @63C*/         
*        5 ASIESFI  FIXED(31),      /* Reserved                  @63C*/         
*          7 ASIESFI_VE CHAR(4) BDY(WORD), /* Reserved           @63C*/         
*        5 ASIVSMPL,                /* Valid sample field        @Q1M*/         
*                                                             /*3@Q1D*/         
*          7 ASISMPCT FIXED(16),    /* Number of valid samples   @Q1C*/         
*        5 ASISTACT,                /* Status counters               */         
*                                                             /*8@Q2D*/         
*          7 ASISWAP  FIXED(16),    /* Reserved                  @63C*/         
*          7 ASIIDLE  FIXED(16),    /* IDLE count                @Q2C*/         
*          7 ASISWAR  FIXED(16),    /* Swapped out ready count   @Q2C*/         
*          7 ASIACT   FIXED(16),    /* Active count                             
*                                      (using or delayed)        @W2C*/         
*          7 ASIUKN   FIXED(16),    /* Unknown count             @Q2C*/         
*                                                            /*23@Q2D*/         
*        5 ASISIUSE,                /* Single state USE counters @Q2A*/         
*          7 ASISUSEN FIXED(16),    /* Single state using        @Q2C*/         
*          7 ASISUCPR FIXED(16),    /* Single state using PROC   @Q2C*/         
*          7 ASISUCDV FIXED(16),    /* Single state using DEV    @Q2C*/         
*        5 ASISIWAI,                /* Single state WAIT counters               
*                                                                @Q2A*/         
*          7 ASISWAIN FIXED(16),    /* Single state waiting      @Q2C*/         
*          7 ASISDCPR FIXED(16),    /* Single state delayed by                  
*                                      PROC                      @Q2C*/         
*          7 ASISDCDV FIXED(16),    /* Single state delayed by                  
*                                      DEV                       @Q2C*/         
*          7 ASISDCST FIXED(16),    /* Single state delayed by                  
*                                      STOR                      @Q2C*/         
*          7 ASISDCJE FIXED(16),    /* Single state delayed by                  
*                                      JES                       @Q2C*/         
*          7 ASISDCHS FIXED(16),    /* Single state delayed by                  
*                                      HSM                       @Q2C*/         
*          7 ASISDCEN FIXED(16),    /* Single state delayed by                  
*                                      ENQ                       @Q2C*/         
*        5 ASIVECTA FIXED(31),      /* Total accumulated vector                 
*                                      processor time            @T1A*/         
*        5 ASISOWAI,                /* Single state WAIT counters               
*                                                                @W2A*/         
*          7 ASISDCSU FIXED(16),    /* Single state delayed by                  
*                                      SUBS                      @W2A*/         
*          7 ASISDCOP FIXED(16),    /* Single state delayed by                  
*                                      OPER                      @W2A*/         
*          7 ASISDCMS FIXED(16),    /* Single state delayed by                  
*                                      OPER MESSAGE              @W2A*/         
*          7 ASISDCMT FIXED(16),    /* Single state delayed by                  
*                                      OPER MOUNT                @W2A*/         
*        5 ASISMF,                  /* Fields used for SMF72 record             
*                                                                @W3A*/         
*          7 ASIPAGES FIXED(16),    /* Page delay                @W3A*/         
*          7 ASISWAPS FIXED(16),    /* Swap delay                @W3A*/         
*        5 ASISTOR,                 /* Fields used for Storage                  
*                                                                @W3A*/         
*          7 ASIDIV   FIXED(31),    /* Number of DIV frames      @W4A*/         
*            9 ASIDIV_VE CHAR(4) BDY(WORD), /* Number of DIV frames             
*                                      (short floating point)    @B2A*/         
*          7 ASIAUXSC FIXED(31),    /* Number of auxiliary slots @W4A*/         
*            9 ASIAUXSC_VE CHAR(4) BDY(WORD), /* Number of auxiliary            
*                                      slots (short format floating             
*                                      point)                    @B2A*/         
*          7 ASIPINA  FIXED(31),    /* Page-In count             @W4A*/         
*          7 ASIDIVCT FIXED(16),    /* Number of DIV invocations @W4A*/         
*          7 ASIACTHF FIXED(16),    /* Address space is active and              
*                                      holds storage counter.    @W4A*/         
*          7 ASISWAPI FIXED(16),    /* address space is swapped IN              
*                                                                @63C*/         
*        5 ASISUWAI,                /* Single state WAIT counter                
*                                                                @Y2A*/         
*          7 ASISDCXC FIXED(16),    /* Single state delayed by                  
*                                      XCF - part of SUBS        @Y2C*/         
*      3 ASIBASE2 BDY(WORD),        /* Additional basic ASID entry data         
*                                                                @Y1A*/         
*        5 ASIJCLAS CHAR(8),        /* Jobclass, Source: OUCBCLS @Y1A*/         
*      3 ASISTOR2 BDY(WORD),        /* More Storage data         @A2A*/         
*        5 ASIPINES FIXED(31),      /* Reserved                  @63C*/         
*        5 ASICSTOR,                /* Common Storage Allocation @B4A*/         
*          7 ASIFLAG2 BIT(32),      /* Sample flag 2             @B4A*/         
*            9 ASICSAIN BIT(1),     /* ON=CSA and RUCSA amounts                 
*                                         incomplete             @93C*/         
*            9 ASISQAIN BIT(1),     /* ON=SQA amounts incomplete @B4A*/         
*            9 ASIAINIT BIT(1),     /* ON=APPC initiator         @B4A*/         
*            9 ASIBINIT BIT(1),     /* ON=BATCH initiator        @B4A*/         
*            9 *        BIT(28),    /* Reserved                  @B4A*/         
*          7 ASICSASC FIXED(31),    /* CSA sample count.         @B4A*/         
*          7 ASISQASC FIXED(31),    /* SQA sample count.         @B4A*/         
*          7 ASICSAA FIXED(32),     /* CSA Allocation            @B4A*/         
*          7 ASISQAA FIXED(32),     /* SQA Allocation            @B4A*/         
*          7 ASIECSAA FIXED(32),    /* ECSA Allocation           @B4A*/         
*          7 ASIESQAA FIXED(32),    /* ESQA Allocation           @B4A*/         
*        5 ASIJLCYC FIXED(31),      /* Timeoffset when this job was             
*                                      found the last time in the               
*                                      system                                   
*                                      expressed in CYCLE time units            
*                                      ( SSHGOCYC contains the                  
*                                      CYCLe time unit ).                       
*                                      The offset is                            
*                                      based on SSHTIBEG. The                   
*                                      absolute time of the last time           
*                                      found                                    
*                                      is calculated as                         
*                                      Abs_Last_Time = SSHTIBEG                 
*                                      +  SSHGOCYC*ASIJLCYC. Note,              
*                                      however, that either SSHTIBEG or         
*                                      SSHGOCYC have to be converted            
*                                      because SSHTIBEG is in TOD               
*                                      format and SSHGOCYC is in                
*                                      units of milliseconds.                   
*                                      ASIJLCYC is                              
*                                      zero if the time difference              
*                                      between the last cycle time              
*                                      where this job was found and             
*                                      the MINTIME begin time is                
*                                      smaller than one cycle                   
*                                      unit.                     @B4A*/         
*      3 ASIBASE3 BDY(WORD),        /* Additional basic ASID entry              
*                                      data                      @B1A*/         
*        5 ASISORT2X BDY(WORD),     /* Job selection time       @A04C*/         
*          7 ASIJOBST   CHAR(8),    /* Job selection time in GMT @B4A*/         
*        5 ASIJESID   CHAR(8),      /* Job ID                    @B4A*/         
*      3 ASIEXTN3 BDY(WORD),        /* Additional ASID data      @B4A*/         
*        5 ASITET FIXED(32),        /* Transaction elapsed time,                
*                                      in 1024 microsecs units  @A04C*/         
*        5 ASISRBTA FIXED(31),      /* Total accumulated SRB time               
*                                                                @B1A*/         
*        5 ASIIOCNT FIXED(32),      /* EXCP count               @A04C*/         
*        5 ASILSCT FIXED(16),       /* Count of "long" logical                  
*                                      swaps                     @B1A*/         
*        5 ASIESCT FIXED(16),       /* Reserved                  @63C*/         
*        5 ASIPSCT FIXED(16),       /* Reserved                  @63C*/         
*        5 ASILSCF CHAR(4),         /* Sum of all central frames                
*                                      for logically swapped                    
*                                      user at all samples.                     
*                                      Floating point.           @B1A*/         
*        5 ASILSEF CHAR(4),         /* Reserved                  @63C*/         
*        5 ASILSSA FIXED(16),       /* Total logically swapped                  
*                                      samples                   @B1A*/         
*        5 ASIPSEF CHAR(4),         /* Reserved                  @63C*/         
*        5 ASIPSSA FIXED(16),       /* Reserved                  @63C*/         
*        5 ASISWRE,                 /* Swap reason counts, see also   /         
*                                      ASISWRE2 and ASISWRE3     @82C*/         
*          7 ASIORTI FIXED(16),     /* STOR/OUTR delay samples for              
*                                      SWAP REASON 2:                           
*                                      TERMINAL INPUT WAIT   @WA01699*/         
*          7 ASIORTO FIXED(16),     /* STOR/OUTR delay samples for              
*                                      SWAP REASON 1:                           
*                                      TERMINAL OUTPUT WAIT  @WA01699*/         
*          7 ASIORLW FIXED(16),     /* STOR/OUTR delay samples for              
*                                      swap reason 3:                           
*                                      Long wait                 @B1A*/         
*          7 ASIORXS FIXED(16),     /* STOR/OUTR delay samples for              
*                                      swap reason 4:                           
*                                      Aux. storage shortage     @B1A*/         
*          7 ASIORRS FIXED(16),     /* STOR/OUTR delay samples for              
*                                      swap reason 5:                           
*                                      Real storage shortage     @B1A*/         
*          7 ASIORDW FIXED(16),     /* STOR/OUTR delay samples for              
*                                      swap reason 6:                           
*                                      Detected long wait        @B1A*/         
*          7 ASIORRQ FIXED(16),     /* STOR/OUTR delay samples for              
*                                      swap reason 7:                           
*                                      Requested swap, no longer used.          
*                                      Uses ASIORMP instead      @82C*/         
*          7 ASIORNQ FIXED(16),     /* STOR/OUTR delay samples for              
*                                      swap reason 8:                           
*                                      Enqueue exchange swap     @B1A*/         
*          7 ASIOREX FIXED(16),     /* STOR/OUTR delay samples for              
*                                      swap reason 9:                           
*                                      Exchange swap             @B1A*/         
*          7 ASIORUS FIXED(16),     /* STOR/OUTR delay samples for              
*                                      swap reason 10:                          
*                                      Unilateral swap           @B1A*/         
*          7 ASIORTS FIXED(16),     /* STOR/OUTR delay samples for              
*                                      swap reason 11:                          
*                                      Transition swap           @B1A*/         
*          7 ASIORIC FIXED(16),     /* STOR/OUTR delay samples for              
*                                      swap reason 12:                          
*                                      Improve central storage usage            
*                                                                @B1A*/         
*          7 ASIORIP FIXED(16),     /* STOR/OUTR delay samples for              
*                                      swap reason 13:                          
*                                      Improve system paging rate               
*                                                                @B1A*/         
*          7 ASIORMR FIXED(16),     /* STOR/OUTR delay samples for              
*                                      swap reason 14:                          
*                                      Make room for an out too long            
*                                      user                      @B1A*/         
*          7 ASIORAW FIXED(16),     /* STOR/OUTR delay samples for              
*                                      swap reason 15:                          
*                                      APPC wait                 @B1A*/         
*          7 ASIORIW FIXED(16),     /* STOR/OUTR delay samples for              
*                                      swap reason 16:                          
*                                      OMVS input                @B5A*/         
*          7 ASIOROW FIXED(16),     /* STOR/OUTR delay samples for              
*                                      swap reason 17:                          
*                                      OMVS output               @B5A*/         
*      3 ASIBASE4 BDY(WORD),        /* Additional basic ASID entry              
*                                      data                      @C1A*/         
*        5 ASIRCLX  FIXED(16),      /* Report class list index   @C1A*/         
*        5 ASISWRE2,                /* Additional swap rsn count @J2C*/         
*          7 ASIORSR  FIXED(16),    /* STOR/OUTR delay samples for              
*                                      swap rsn 18: In-real swap @J2A*/         
*      3 ASIEXTN4 BDY(WORD),        /* Additional ASID data      @C1A*/         
*        5 ASISTACS,                /* Status counters - single state           
*                                                                @C1A*/         
*          7 ASICPUC  FIXED(16),    /* CPU capping delay         @C1A*/         
*          7 ASIACOM  FIXED(16),    /* Common paging             @C1A*/         
*          7 ASIAPRV  FIXED(16),    /* Private paging            @C1A*/         
*          7 ASIAVIO  FIXED(16),    /* VIO paging                @C1A*/         
*          7 ASIASWA  FIXED(16),    /* Swapping                  @C1A*/         
*          7 ASIUNKN  FIXED(16),    /* Unknown count for calculating            
*                                      execution velocity        @C1A*/         
*          7 ASICCAP  FIXED(16),    /* Resource capping delay    @C1A*/         
*          7 ASICQUI  FIXED(16),    /* Quiesce delay             @C1A*/         
*          7 ASIAXM   FIXED(16),    /* Cross memory delay        @C1A*/         
*          7 ASIAHSP  FIXED(16),    /* Hiperspace delay          @C1A*/         
*        5 ASISTACM,                /* Status counters - multi state            
*                                                                @C1A*/         
*          7 ASICUSE  FIXED(31),    /* CPU using                 @C1A*/         
*          7 ASITOTD  FIXED(31),    /* Total delays for calculating             
*                                      execution velocity        @C1A*/         
*        5 ASISRVO  FIXED(31),      /* Offset from service class                
*                                      served table header to                   
*                                      corresponding row         @C1A*/         
*        5 ASISHPAG BDY(WORD),      /* Additional ASID data                     
*                                      for shared paging         @D1A*/         
*          ?ERBFITEM(7 ASITOTSV) FLOAT(24);, /* Total number of                 
*                                      shared page                              
*                                      views in this address space              
*                                      (short floating point)    @D1A*/         
*          ?ERBFITEM(7 ASISVINR) FLOAT(24);, /* Total number of                 
*                                      shared pages                             
*                                      in central storage that are              
*                                      valid in this address space              
*                                      (short floating point)    @D1A*/         
*          ?ERBFITEM(7 ASISPVLC) FLOAT(24);, /* Increasing                      
*                                      number of shared page                    
*                                      validations in this                      
*                                      address space                            
*                                      (short floating point)    @D1A*/         
*          ?ERBFITEM(7 ASIGSPPI) FLOAT(24);, /* Total number of                 
*                                      shared page-ins                          
*                                      from auxiliary storage for               
*                                      this address space                       
*                                      (short floating point)    @D1A*/         
*          7 ASIGASPD FIXED(16),    /* Single state samples delayed for         
*                                      shared storage paging     @D1A*/         
*          7 *        CHAR(2),      /* Reserved                  @D1A*/         
*        5 ASIOREPL FIXED(31),      /* Number of outstanding                    
*                                      replies                   @E1A*/         
*        5 ASISTC2M,                /* Status counters 2 - multi                
*                                      state                     @E2A*/         
*          7 ASITOTU  FIXED(31),    /* Total using for velocity  @E2A*/         
*          7 ASIIOU   FIXED(31),    /* I/O using                 @E2A*/         
*        5 ASI_ASST FIXED(31),      /* Additional SRB Service Time.             
*                                      CPU time is accumulated here             
*                                      for this address space's                 
*                                      Preemptable SRBs and for                 
*                                      Client Related SRBs for which            
*                                      this address space is the                
*                                      client (in ms.)           @92A*/         
*          7 ASIASSTA FIXED(31),    /* equals ASI_ASST           @92C*/         
*        5 ASI_PHTM Fixed(31),      /* Preemptable-class SRB Time.              
*                                      The CPU time for all types of            
*                                      preemptable SRBs (PSRB, CRSRB,           
*                                      ESRB, ETCB) executing with this          
*                                      address space as their home              
*                                      space is accumulated here                
*                                      (in ms.)                  @92A*/         
*          7 ASIPHTMA FIXED(31),    /* equals ASI_PHTM           @92C*/         
*        5 ASIMSTS  BIT(32),        /* Miscellaneous states      @J1C*/         
*         6 ASIMSTS1 BIT(8),        /* State byte 1             @A04A*/         
*          7 ASIOASB  BIT(1),       /* Address space is OMVS                    
*                                      related                  @A04C*/         
*          7 ASITRXN  BIT(1),       /* Address space matched a                  
*                                      classification rule in the               
*                                      active policy which prevents             
*                                      managing the region based on             
*                                      the response time goals of               
*                                      its served transactions  @A04C*/         
*          7 ASICPUP  BIT(1),       /* CPU protection was assigned              
*                                      either to the address space              
*                                      or to transaction service                
*                                      classes being served by the              
*                                      space, and SRM is honoring               
*                                      the protection           @A04C*/         
*          7 ASISTOP  BIT(1),       /* Storage protection was                   
*                                      assigned either to the address           
*                                      space or to transaction service          
*                                      classes being served by the              
*                                      space, and SRM is honoring               
*                                      the protection           @A04C*/         
*          7 ASISVRR  BIT(1),       /* This address space provides              
*                                      service to transactions                  
*                                      classified to a different                
*                                      class than the address space             
*                                      itself                   @A04C*/         
*          7 ASIMASS  BIT(1),       /* WLM is managing this address             
*                                      space to meet the goals of               
*                                      work in other service classes            
*                                                               @A04C*/         
*          7 ASITRXB  BIT(1),       /* Address space is a CICS TOR              
*                                      that matched a classification            
*                                      rule in the active policy                
*                                      which allows managing the                
*                                      region based on the region               
*                                      goals but also ensures that              
*                                      completed transactions are               
*                                      reported and used for                    
*                                      management of the CICS AORs              
*                                                               @A04C*/         
*          7 ASIIOPG  BIT(1),       /* I/O priority group HIGH was              
*                                      assigned either to the                   
*                                      address space or to                      
*                                      transaction service classes              
*                                      served by the address space              
*                                                               @A04C*/         
*         6 ASIMSTS2 BIT(8),        /* State byte 2             @A04A*/         
*          7 ASITRG   BIT(1),       /* Address space is currently               
*                                      associated with a tenant                 
*                                      resource group           @A04C*/         
*          7 ASICBP   BIT(1),       /* Can run on CBP            @91A*/         
*          7 ASIRPBoost BIT(1),     /* Address space matched a                  
*                                      classification rule in the               
*                                      active policy which enables for          
*                                      recovery process boost   @A05A*/         
*          7 *        BIT(5),       /* Reserved                 @A05C*/         
*         6 *        BIT(16),       /* Reserved                 @A04A*/         
*        5 ASI_zCBP BDY(WORD),      /* zCBP ASID data            @91C*/         
*         6 ASI_zAAP BDY(WORD),     /* or zAAP ASID data         @91A*/         
*          7 ASISUCIF FIXED(16),    /* Single state zCBP using when             
*                                      GEIzCBP is on. Else, single              
*                                      state zAAP using          @91C*/         
*          7 ASISUCIC FIXED(16),    /* Single state zCBP on CP using            
*                                      when GEIzCBP is on. Else, single         
*                                      state zAAP on CP using    @91C*/         
*          7 ASISDCIF FIXED(16),    /* Single state delayed by zCBP             
*                                      when GEIzCBP is on. Else, single         
*                                      state delayed by zAAP     @91C*/         
*          7 ASISDCCP FIXED(16),    /* Single state delayed by CP               
*                                                            @OA10909*/         
*          7 ASI_Time_On_CP Fixed(31),                             /*           
*                                      Accumulated CP time       @92A*/         
*            9 ASICPTA  FIXED(31),  /* equals ASI_Time_On_CP     @92C*/         
*          7 ASIIFATA FIXED(31),                                   /*           
*                                      Accumulated zAAP time when               
*                                      GEIzCBP is off           @A04C*/         
*            9 ASI_Time_On_zCBP Fixed(31),                         /*           
*                                      Accumulated zCBP time when               
*                                      GEIzCBP is on.           @A04C*/         
*              11 ASIzCBPTA FIXED(31),                             /*           
*                                      equals ASI_Time_On_zCBP  @A04C*/         
*          7 ASIIFCTA FIXED(31),    /* Accumulated zAAP on CP time              
*                                      when GEIzCBP is off      @A04C*/         
*            9 ASI_zCBP_Time_On_CP Fixed(31),                                   
*                                   /* Accumulated zCBP on CP time              
*                                      when GEIzCBP is on       @A04C*/         
*              11 ASIzCBPCTA FIXED(31),/* equals ASI_zCBP_Time_On_CP            
*                                                               @A04C*/         
*        5 ASIMULTI BDY(WORD),      /* Multi state counts        @L1A*/         
*          7 ASIMCUSE FIXED(31),    /* Multi state proc using count             
*                                                                @L1A*/         
*          7 ASIMCDLY FIXED(31),    /* Multi state proc delay count             
*                                                                @L1A*/         
*        5 ASI_zIIP BDY(WORD),      /* zIIP ASID data        @OA13499*/         
*          7 ASISUCCP FIXED(16),    /* Single state using CP @OA13499*/         
*          7 ASISUCSP FIXED(16),    /* Single state using zIIP                  
*                                                            @OA13499*/         
*          7 ASISUCSC FIXED(16),    /* Single state using zIIP on CP            
*                                                            @OA13499*/         
*          7 ASISDCSP FIXED(16),    /* Single state delayed by zIIP             
*                                                            @OA13499*/         
*          7 ASI_Time_On_zIIP FIXED(31),                           /*           
*                                      Accumulated zIIP time     @92C*/         
*          7 ASI_zIIP_Time_On_CP FIXED(31),                        /*           
*                                      Accumulated zIIP on CP time              
*                                                                @92C*/         
*        5 ASI_IFA_PHTM FIXED(31),  /* Preemptable-class SRB time for           
*                                      zAAP processors in ms when               
*                                      GEIzCBP is off. This is                  
*                                      "normalized" time        @A04C*/         
*          7 ASI_zCBP_PHTM FIXED(31),                              /*           
*                                      Preemptable-class SRB time for           
*                                      zCBP processors in ms when               
*                                      GEIzCBP is on. This is                   
*                                      "normalized" time        @A04C*/         
*        5 ASI_zIIP_PHTM FIXED(31), /* Preemptable-class SRB Time for           
*                                      zIIP processors in ms                    
*                                      This is "normalized" time @22C*/         
*        5 ASI_LPS BDY(WORD),       /* Memory objects support    @21C*/         
*          ?ERBFITEM(7 ASI_LargeMemoryObjects) FLOAT(24);,         /*           
*                                      Number of fixed 1 MB memory              
*                                      objects allocated         @74C*/         
*          ?ERBFITEM(7 ASI_LargePagesBackedInReal) FLOAT(24);,     /*           
*                                      Number of 1 MB pages fixed               
*                                      in central storage        @74C*/         
*          ?ERBFITEM(7 ASI_LVNMOMB) FLOAT(24);,                    /*           
*                                      Number of high virtual private           
*                                      memory objects allocated  @62C*/         
*          ?ERBFITEM(7 ASI_HVCommonNMOMB) FLOAT(24);,              /*           
*                                      Number of high virtual common            
*                                      memory objects allocated  @62C*/         
*          ?ERBFITEM(7 ASI_LVSHRNMOMB) FLOAT(24);,                 /*           
*                                      Number of high virtual shared            
*                                      memory objects allocated  @62C*/         
*          ?ERBFITEM(7 ASI_LVABytes) FLOAT(56);,                   /*           
*                                      Amount of storage allocated from         
*                                      high virtual private memory in           
*                                      memory objects            @62C*/         
*          ?ERBFITEM(7 ASI_HVCommonBytes) FLOAT(56);,              /*           
*                                      Amount of storage allocated from         
*                                      high virtual common memory in            
*                                      memory objects            @62C*/         
*          ?ERBFITEM(7 ASI_LVSHRBytes) FLOAT(56);,                 /*           
*                                      Amount of storage in shared              
*                                      memory objects owned by this             
*                                      address space             @94C*/         
*          ?ERBFITEM(7 ASI_HVCommonHWMBytes) FLOAT(56);,           /*           
*                                      High water mark for the amount           
*                                      of high virtual common storage           
*                                      allocated                 @62C*/         
*          ?ERBFITEM(7 ASI_LVMemLim) FLOAT(56);,                   /*           
*                                      Address space memory limit               
*                                      in MB                     @21A*/         
*      3 ASIBASE5 BDY(DWORD),       /* Additional basic ASID entry              
*                                      data                      @51A*/         
*        5 ASISTOKEN BIT(64),       /* Address Space STOKEN      @51A*/         
*      3 ASIEXTN5 BDY(DWORD),       /* Lock Instrumentation Data @51A*/         
*%If IBM_CBGEN_PADI = 'YES' %Then   /* Skip Lock Instrumentation                
*                                      Data with CBGEN          @A04A*/         
*%Do;                                                         /*@A04A*/         
*       4 ASIEXTN5A Char(368) BDY(DWORD),                                       
*                                   /* Reserved                 @A04A*/         
*%End; %Else %Do;                                             /*@A04A*/         
*       4 ASIEXTN5A BDY(DWORD),                               /*@A04A*/         
*        5 ASISMFCMS BDY(DWORD),    /* Lock Instrumentation Data                
*                                      for SMFCMS locks          @51A*/         
*          7 ASISSusp Fixed(64),    /* Number of times a work unit was          
*                                      suspended on this lock    @51A*/         
*          7 ASISAlSusp Fixed(64),  /* Number of times a work unit was          
*                                      suspended this lock when there           
*                                      was already at least one other           
*                                      work unit suspended for this             
*                                      lock                      @51A*/         
*          7 ASISTime Char(8),      /* Amount of time in microseconds           
*                                      of all work units that were              
*                                      suspended on this lock    @51A*/         
*        5 ASIENQDEQ BDY(DWORD),    /* Lock Instrumentation Data                
*                                      for ENQDEQ locks          @51A*/         
*          7 ASIESusp Fixed(64),    /* Number of times a work unit was          
*                                      suspended on this lock    @51A*/         
*          7 ASIEAlSusp Fixed(64),  /* Number of times a work unit was          
*                                      suspended this lock when there           
*                                      was already at least one other           
*                                      work unit suspended for this             
*                                      lock                      @51A*/         
*          7 ASIETime Char(8),      /* Amount of time in microseconds           
*                                      of all work units that were              
*                                      suspended on this lock    @51A*/         
*        5 ASILatchCMS BDY(DWORD),  /* Lock Instrumentation Data                
*                                      for Latch CMS locks       @51A*/         
*          7 ASILSusp Fixed(64),    /* Number of times a work unit was          
*                                      suspended on this lock    @51A*/         
*          7 ASILAlSusp Fixed(64),  /* Number of times a work unit was          
*                                      suspended this lock when there           
*                                      was already at least one other           
*                                      work unit suspended for this             
*                                      lock                      @51A*/         
*          7 ASILTime Char(8),      /* Amount of time in microseconds           
*                                      of all work units that were              
*                                      suspended on this lock    @51A*/         
*        5 ASICMS BDY(DWORD),       /* Lock Instrumentation Data                
*                                      for CMS locks             @51A*/         
*          7 ASICSusp Fixed(64),    /* Number of times a work unit was          
*                                      suspended on this lock    @51A*/         
*          7 ASICAlSusp Fixed(64),  /* Number of times a work unit was          
*                                      suspended this lock when there           
*                                      was already at least one other           
*                                      work unit suspended for this             
*                                      lock                      @51A*/         
*          7 ASICTime Char(8),      /* Amount of time in microseconds           
*                                      of all work units that were              
*                                      suspended on this lock    @51A*/         
*        5 ASILocal BDY(DWORD),     /* Lock Instrumentation Data                
*                                      for local locks           @51A*/         
*          7 ASILocSusp Fixed(64),  /* Number of times a work unit was          
*                                      suspended on this lock    @51A*/         
*          7 ASILocAlSusp Fixed(64),                                            
*                                   /* Number of times a work unit was          
*                                      suspended this lock when there           
*                                      was already at least one other           
*                                      work unit suspended for this             
*                                      lock                      @51A*/         
*          7 ASILocTime Char(8),    /* Amount of time in microseconds           
*                                      of all work units that were              
*                                      suspended on this lock    @51A*/         
*        5 ASICMLLock BDY(DWORD),   /* Lock Instrumentation Data                
*                                      for CML locks             @51A*/         
*          7 ASICMLSusp Fixed(64),  /* Number of times a work unit was          
*                                      suspended on this lock    @51A*/         
*          7 ASICMLAlSusp Fixed(64),                                            
*                                   /* Number of times a work unit was          
*                                      suspended this lock when there           
*                                      was already at least one other           
*                                      work unit suspended for this             
*                                      lock                      @51A*/         
*          7 ASICMLTime Char(8),    /* Amount of time in microseconds           
*                                      of all work units that were              
*                                      suspended on this lock    @51A*/         
*        5 ASICMLLockS  BDY(DWORD), /* Lock Instrumentation Data                
*                                      for CML requestor locks   @51A*/         
*          7 ASICMLSuspSrc Fixed(64),                                           
*                                   /* Number of times a work unit was          
*                                      suspended on this lock    @51A*/         
*          7 ASICMLAlSuspSrc Fixed(64),                                         
*                                   /* Number of times a work unit was          
*                                      suspended this lock when there           
*                                      was already at least one other           
*                                      work unit suspended for this             
*                                      lock                      @51A*/         
*          7 ASICMLTimeSrc Char(8), /* Amount of time in microseconds           
*                                      of all work units that were              
*                                      suspended on this lock    @51A*/         
*        5 ASILatchCre BDY(DWORD),  /* Statistics for Latch requests            
*                                      against Latch sets created               
*                                      by this address space     @51A*/         
*          7 ASILCreCont Fixed(64), /* Total number of contention               
*                                      generating requests that                 
*                                      resulted in GRS queuing a                
*                                      waiting element                          
*                                      (contention case)         @51A*/         
*          7 ASILCreTime Char(8),   /* Total amount of contention               
*                                      time in microseconds      @51A*/         
*          7 * Char(8),             /* Not used                  @51A*/         
*          7 ASILCreTimeSq Char(16),                                            
*                                   /* Sum of the squares of the                
*                                      individual contention times              
*                                      in microseconds           @51A*/         
*        5 ASILatchReq BDY(DWORD),  /* Statistics for Latch requests            
*                                      that occurred in this address            
*                                      space                     @51A*/         
*          7 ASILReqCont Fixed(64), /* Total number of contention               
*                                      generating requests that                 
*                                      resulted in GRS queuing a                
*                                      waiting element                          
*                                      (contention case)         @51A*/         
*          7 ASILReqTime Char(8),   /* Total amount of contention               
*                                      time in microseconds      @51A*/         
*          7 * Char(8),             /* Not used                  @51A*/         
*          7 ASILReqTimeSq Char(16),                                            
*                                   /* Sum of the squares of the                
*                                      individual contention times              
*                                      in microseconds           @51A*/         
*        5 ASIEnqStep BDY(DWORD),   /* Statistics for requests that             
*                                      generated STEP scope ENQs @51A*/         
*          7 ASIEStepReq Fixed(64), /* Total number of requests that            
*                                      resulted in GRS queuing an               
*                                      element (contention and non-             
*                                      contention cases)         @51A*/         
*          7 ASIEStepCont Fixed(64),/* Total number of contention               
*                                      generating requests that                 
*                                      resulted in GRS queuing a                
*                                      waiting element                          
*                                      (contention case)         @51A*/         
*          7 ASIEStepTime Char(8),  /* Total amount of contention               
*                                      time in microseconds      @51A*/         
*          7 ASIEStepTimeSq Char(16),                                           
*                                   /* Sum of the squares of the                
*                                      individual contention                    
*                                      times in microseconds     @51A*/         
*        5 ASIEnqSyst BDY(DWORD),   /* Statistics for requests that             
*                                      generated SYSTEM scope ENQs              
*                                                                @51A*/         
*          7 ASIESystReq Fixed(64), /* Total number of requests that            
*                                      resulted in GRS queuing an               
*                                      element (contention and non-             
*                                      contention cases)         @51A*/         
*          7 ASIESystCont Fixed(64),/* Total number of contention               
*                                      generating requests that                 
*                                      resulted in GRS queuing a                
*                                      waiting element                          
*                                      (contention case)         @51A*/         
*          7 ASIESystTime Char(8),  /* Total amount of contention               
*                                      time in microseconds      @51A*/         
*          7 ASIESystTimeSq Char(16),                                           
*                                   /* Sum of the squares of the                
*                                      individual contention                    
*                                      times in microseconds     @51A*/         
*        5 ASIEnqSystems BDY(DWORD),/* Statistics for requests that             
*                                      generated SYSTEMS scope ENQs             
*                                                                @51A*/         
*          7 ASIESystemsReq Fixed(64),                                          
*                                   /* Total number of requests that            
*                                      resulted in GRS queuing an               
*                                      element (contention and non-             
*                                      contention cases)         @51A*/         
*          7 ASIESystemsCont Fixed(64),                                         
*                                   /* Total number of contention               
*                                      generating requests that                 
*                                      resulted in GRS queuing a                
*                                      waiting element                          
*                                      (contention case)         @51A*/         
*          7 ASIESystemsTime Char(8),                                           
*                                   /* Total amount of contention               
*                                      time in microseconds      @51A*/         
*          7 ASIESystemsTimeSq Char(16),                                        
*                                   /* Sum of the squares of the                
*                                      individual contention                    
*                                      times in microseconds     @51A*/         
*%End;                              /* Skip Lock Instrumentation                
*                                      Data with CBGEN          @A04A*/         
*       4 ASIEXTN5B BDY(DWORD),                               /*@A04A*/         
*        5 ASIQScanStats BDY(DWORD),/* Statistics for QScan requests            
*                                      from this address space   @61A*/         
*          7 ASIQScanReq      Fixed(64),                                        
*                                   /* Count of requests         @61A*/         
*          7 ASIQScanSpecReq  Fixed(64),                                        
*                                   /* Count of specific requests               
*                                                                @61A*/         
*          7 ASIQScanRes      Fixed(64),                                        
*                                   /* Count of resources        @61A*/         
*          7 ASIQScanResSq    Char(16),                                         
*                                   /* Sum of the squares of the                
*                                      resource counts           @61A*/         
*          7 ASIQScanTime     Char(8),                                          
*                                   /* Amount of request times                  
*                                      in microseconds           @61A*/         
*          7 ASIQScanTimeSq   Char(16),                                         
*                                   /* Sum of the squares of the                
*                                      request times                            
*                                      in microseconds           @61A*/         
*      3 ASIEXTN6 BDY(WORD),        /* Additional ASID entry data               
*                                                                @62A*/         
*        5 ASI_PLP BDY(WORD),       /* Pageable Large Pages support             
*                                                                @62A*/         
*          ?ERBFITEM(7 ASI_1MBFixedFrames) FLOAT(24);,             /*           
*                                      Number of 1 MB page-fixed frames         
*                                      used for pageable/DREF                   
*                                      memory objects            @62A*/         
*          ?ERBFITEM(7 ASI_1MBPageableFrames) FLOAT(24);,          /*           
*                                      Number of 1 MB pageable/DREF             
*                                      frames                    @62A*/         
*      3 ASIStorLong BDY(DWORD),    /* Storage counts in long floating          
*                                      point format              @73A*/         
*        5 ASIFIXA_LF CHAR(8),      /* Number of fixed frames    @73A*/         
*        5 ASIFMCT_LF CHAR(8),      /* Number of frames of swapped in           
*                                      users                     @73A*/         
*        5 ASIFMCTI_LF CHAR(8),     /* Number of frames of idle users           
*                                                                @73A*/         
*        5 ASIAUXSC_LF CHAR(8),     /* Number of auxilliary slots               
*                                                                @73A*/         
*        5 ASILSCF_LF CHAR(8),      /* Number of frames of logically            
*                                      swapped users             @73A*/         
*        5 ASITOTSV_LF CHAR(8),     /* Number of shared page views.             
*                                      Does not include high virtual            
*                                      shared pages.         @OA47602*/         
*        5 ASISVINR_LF CHAR(8),     /* Number of shared pages.                  
*                                      Does not include high virtual            
*                                      shared pages.         @OA47602*/         
*%If IBM_CBGEN_PADI = 'YES' %Then   /* Skip multi threading fields              
*                                      with CBGEN               @A04A*/         
*%Do;                                                         /*@A04A*/         
*      3 ASIMultiThreading Char(48) BDY(WORD),                                  
*                                   /* Reserved                 @A04A*/         
*%End; %Else %Do;                                             /*@A04A*/         
*      3 ASIMultiThreading BDY(WORD),/* Multi-Threading metrics for             
*                                      ENCL,PROC,PROCU,SYSINFO   @72A*/         
*        ?ERBFITEM(5 ASI_ASST_MT) FLOAT(24);,                                   
*                                   /* ASI_ASST converted to raw @92A*/         
*          ?ERBFITEM(7 ASIASSTA_MT) FLOAT(24);,                                 
*                                   /* ASIASSTA converted to raw @92C*/         
*        ?ERBFITEM(5 ASI_Time_On_CP_MT)  FLOAT(24);,                            
*                                   /* ASI_Time_On_CP converted to raw          
*                                                                @92A*/         
*          ?ERBFITEM(7 ASICPTA_MT)  FLOAT(24);,                                 
*                                   /* ASICPTA  converted to raw @92C*/         
*        ?ERBFITEM(5 ASICPUTA_MT) FLOAT(24);,                                   
*                                   /* ASICPUTA converted to raw @72A*/         
*        ?ERBFITEM(5 ASI_Time_On_zCBP_MT) FLOAT(24);,                           
*                                   /* ASI_Time_On_zCBP (raw)    @92A*/         
*          ?ERBFITEM(7 ASIzCBPTA_MT) FLOAT(24);,                                
*                                   /* ASIzCBPTA converted to raw@92C*/         
*            ?ERBFITEM(9 ASIIFATA_MT) FLOAT(24);,                               
*                                   /* ASIIFATA converted to raw @92C*/         
*        ?ERBFITEM(5 ASI_zCBP_Time_On_CP_MT) FLOAT(24);,                        
*                                   /* ASI_zCBP_Time_On_CP (raw) @92A*/         
*          ?ERBFITEM(7 ASIzCBPCTA_MT) FLOAT(24);,                               
*                                   /* ASIzCBPCTA convertd to raw@92C*/         
*            ?ERBFITEM(9 ASIIFCTA_MT) FLOAT(24);,                               
*                                   /* ASIIFCTA converted to raw @92C*/         
*        ?ERBFITEM(5 ASI_PHTM_MT) Float(24);,                                   
*                                   /* ASI_PHTM converted to raw @92A*/         
*          ?ERBFITEM(7 ASIPHTMA_MT) FLOAT(24);,                                 
*                                   /* ASIPHTMA converted to raw @72A*/         
*        ?ERBFITEM(5 ASISRBTA_MT) FLOAT(24);,                                   
*                                   /* ASISRBTA converted to raw @72A*/         
*        ?ERBFITEM(5 ASI_CP_PHTM_MT) FLOAT(24);,                                
*                                   /* ASI_CP_PHTM (raw)         @92C*/         
*        ?ERBFITEM(5 ASI_zCBP_PHTM_MT) FLOAT(24);,                              
*                                   /* ASI_zCBP_PHTM        (raw)@91A*/         
*          ?ERBFITEM(7 ASI_IFA_PHTM_MT) FLOAT(24);,                             
*                                   /* ASI_IFA_PHTM         (raw)@91C*/         
*        ?ERBFITEM(5 ASI_Time_On_zIIP_MT) FLOAT(24);,                           
*                                   /* ASI_Time_On_zIIP     (raw)@92C*/         
*        ?ERBFITEM(5 ASI_zIIP_PHTM_MT) FLOAT(24);,                              
*                                   /* ASI_zIIP_PHTM        (raw)@72A*/         
*        ?ERBFITEM(5 ASI_zIIP_TIME_ON_CP_MT) FLOAT(24);,                        
*                                   /* ASI_zIIP_TIME_ON_CP  (raw)@72A*/         
*%End;                              /* Skip multi threading fields              
*                                      with CBGEN               @A04A*/         
*      3 ASIEXTN6B BDY(WORD),       /* Additional ASID entry data               
*                                                               @A04A*/         
*        5 ASI_Asst_Time_On_CP Fixed(31),                          /*           
*                                      Additional SRB Service Time on           
*                                      a standard CP.                           
*                                      CPU time is accumulated here             
*                                      for this address space's                 
*                                      Preemptable SRBs and for                 
*                                      Client Related SRBs for which            
*                                      this address space is the                
*                                      client (in ms.)           @92A*/         
*          7 ASISSCTA   FIXED(31),    /* equals ASI_Asst_Time_On_CP             
*                                                                @92C*/         
*            9 ASIASSTA_CP FIXED(31), /* equals ASI_Asst_Time_On_CP             
*                                                                @92C*/         
*        5 *          Char(4),      /* Not used                  @72A*/         
*      3 ASIJobUsage BDY(DWORD),    /* Additional Metrics for Job Usage         
*                                      Report                    @71A*/         
*        5 ASIDP      FIXED(16),    /* Dispatching priority      @71A*/         
*        5 *          FIXED(16),    /* Not used                  @71A*/         
*        5 ASITRT     FIXED(32),    /* Transaction resident time @71A*/         
*        5 ASITRCA_S  FIXED(32),    /* Total accumulated number of              
*                                      transactions (sum)        @71A*/         
*        5 ASIDCTIA_S FIXED(31),    /* Total accumulated channel                
*                                      connect time (sum)        @71A*/         
*        5 ASIIOCNT_S FIXED(32),    /* Total EXCP count           (sum)         
*                                                                @71A*/         
*        5 *          CHAR(4),      /* Not used                  @71A*/         
*        5 ASICPUTA_LF CHAR(8),     /* Total accumulated CPU time in            
*                                      milliseconds (long float) @71A*/         
*        5 ASITCBTA_LF CHAR(8),     /* Total accumulated TCB time in            
*                                      milliseconds (long float) @71A*/         
*        5 ASIFRXH_LF CHAR(8),      /* Number of fixed frames high              
*                                      (long floating point)     @71A*/         
*        5 ASIFRXA_LF CHAR(8),      /* Number of fixed frames above             
*                                      (long floating point)     @71A*/         
*        5 ASIFRXB_LF CHAR(8),      /* Number of fixed frames below             
*                                      (long floating point)     @71A*/         
*      3 ASIEXTN7 BDY(WORD),        /* Additional ASID entry data               
*                                                                @74A*/         
*        5 ASI_SPLP BDY(WORD),      /* Shared Pageable Large Pages              
*                                                                @74A*/         
*          ?ERBFITEM(7 ASI_HvShrPageValidations) FLOAT(24);,       /*           
*                                      Number of page validations for           
*                                      high virtual shared       @74A*/         
*          ?ERBFITEM(7 ASI_LvShr1MNMomb) FLOAT(56);,               /*           
*                                      Number of shared 1MB memory              
*                                      objects allocated         @74A*/         
*        5 ASI_LvShr4KB CHAR(8),    /* Number of shared bytes from HV           
*                                      memory in units of 4KB    @74A*/         
*        5 ASI_LvShr1MGBytes CHAR(8),                                           
*                                   /* High water mark in bytes for             
*                                      the amount of storage allocated          
*                                      in shared memory objects  @94C*/         
*        ?ERBFITEM(5 ASI_FreemainedFrames) FLOAT(56);,             /*           
*                                      Freemained frames of AS   @75A*/         
*        5 * CHAR(4),               /* Not used                  @74A*/         
*      3 ASISTAFL Bit(32) Bdy(Word),/* Status flags          @OA47602*/         
*        5 ASISMF725 Bit(1),        /* ON = SMF72.5 deactivated                 
*                                                            @OA47602*/         
*        5 *         Bit(31),       /* Not used              @OA47602*/         
*      3 * CHAR(4),                 /* Not used              @OA47602*/         
*      3 ASIEXTN8 BDY(WORD),        /* Additional ASID entry data               
*                                                                @81A*/         
*        5 ASI_2GBFR BDY(WORD),     /* 2 GB Frame Usage          @81A*/         
*          ?ERBFITEM(7 ASI_2GMemoryObjects) FLOAT(56);,            /*           
*                                      Number of fixed 2 GB memory              
*                                      objects allocated         @81A*/         
*          ?ERBFITEM(7 ASI_2GPagesBackedInReal) FLOAT(56);,        /*           
*                                      Number of 2 GB pages fixed in            
*                                      central storage           @81A*/         
*      3 ASIEXTN9 BDY(WORD),        /* Additional ASID entry data               
*                                                                @82A*/         
*        5 ASISWRE3  BDY(WORD),     /* Additional swap rsn count @82A*/         
*          7 ASIORMP FIXED(16),     /* STOR/OUTR delay samples for              
*                                      swap rsn 7: Memory pool                  
*                                      shortage                  @82A*/         
*          7 *       CHAR(6),       /* Not used                  @82A*/         
*      3 ASIEXTNA BDY(WORD),        /* Additional ASID entry data,              
*                                      processor times           @91A*/         
*       4 ASIEXTNAA BDY(WORD),                                /*@A04A*/         
*        5 ASISRBTA_CP FIXED(31),   /* Accumulated SRB time on CP               
*                                                                @91A*/         
*        5 ASI_SRB_Time_On_CP Fixed(31),                           /*           
*                                      Non-preemtable SRB time                  
*                                      on CP                     @92A*/         
*          7 ASISRBTA_NON_PREEMPT_CP FIXED(31),                    /*           
*                                      equals ASI_SRB_Time_On_CP @92C*/         
*        5 ASISRBTA_zCBP FIXED(31), /* Accumulated SRB time on zCBP             
*                                                                @91A*/         
*        5 ASI_Asst_Time_On_zCBP Fixed(31),                                     
*                                   /* Preemtable, non-enclave                  
*                                      SRB time on zCBP          @92A*/         
*          7 ASIASSTA_zCBP FIXED(31),                                           
*                                   /* equals ASI_Asst_Time_On_zCBP             
*                                                                @92C*/         
*%If IBM_CBGEN_PADI = 'YES' %Then   /* Skip multi threading fields              
*                                      with CBGEN               @A04A*/         
*%Do;                                                         /*@A04A*/         
*       4 ASIEXTNAB Char(20) BDY(WORD),                                         
*                                   /* Reserved                 @A04A*/         
*%End; %Else %Do;                                             /*@A04A*/         
*       4 ASIEXTNAB BDY(WORD),                                /*@A04A*/         
*        ?ERBFITEM(5 ASISRBTA_CP_MT) FLOAT(24);,                                
*                                   /* ASISRBTA_CP converted to                 
*                                      raw                       @91A*/         
*        ?ERBFITEM(5 ASI_SRB_Time_On_CP_MT) FLOAT(24);,                         
*                                   /* ASI_SRB_Time_On_CP (raw)  @92A*/         
*          ?ERBFITEM(7 ASISRBTA_NON_PREEMPT_CP_MT) FLOAT(24);,                  
*                                   /* ASISRBTA_NON_PREEMPT_CP                  
*                                      converted to raw          @92C*/         
*        ?ERBFITEM(5 ASISRBTA_zCBP_MT) FLOAT(24);,                              
*                                   /* ASISRBTA_zCBP converted to               
*                                      raw                       @91A*/         
*        ?ERBFITEM(5 ASI_Asst_Time_On_CP_MT) Float(24);,                        
*                                   /* ASI_Asst_Time_On_CP (raw) @92A*/         
*          ?ERBFITEM(7 ASIASSTA_CP_MT) FLOAT(24);,                              
*                                   /* ASIASSTA_CP (raw)         @92C*/         
*        ?ERBFITEM(5 ASI_Asst_Time_On_zCBP_MT) Float(24);,                      
*                                   /* ASI_Asst_Time_On_zCBP (raw)              
*                                                                @92A*/         
*          ?ERBFITEM(7 ASIASSTA_zCBP_MT) FLOAT(24);,                            
*                                   /* ASIASSTA_zCBP (raw)       @92C*/         
*%End;                              /* Skip multi threading fields              
*                                      with CBGEN               @A04A*/         
*      3 ASIEXTNB BDY(WORD),        /* Additional ASID entry data:              
*                                      processor times separated                
*                                      as provided by Supervisor,               
*                                      and combined values for                  
*                                      simple reporter formulas  @92A*/         
*        5 ASI_EJST Fixed(31),      /* TCB processor time                       
*                                      (all processor types)     @92A*/         
*        5 ASISPACEB1,              /* Internal use             @A04A*/         
*          ?ERBFITEM(7 ASI_EJST_MT) Float(24);,                                 
*                                   /* ASI_EJST (raw)           @A04C*/         
*        5 ASI_SRBT Fixed(31),      /* Non-preemptable SRB time                 
*                                      (all processor types)     @92A*/         
*        5 ASISPACEB3,              /* Internal use             @A04A*/         
*          ?ERBFITEM(7 ASI_SRBT_MT) Float(24);,                                 
*                                   /* ASI_SRBT (raw)           @A04C*/         
*        5 ASISPACEB4,              /* Internal use             @A04A*/         
*          7 ASI_SRB_Time_On_zCBP Fixed(31),                                    
*                                   /* Non-preemptable SRB time                 
*                                      on zCBP                  @A04C*/         
*        5 ASISPACEB5,              /* Internal use             @A04A*/         
*          ?ERBFITEM(7 ASI_SRB_Time_On_zCBP_MT) Float(24);,                     
*                                   /* ASI_SRB_Time_On_zCBP (raw)               
*                                                               @A04C*/         
*        5 ASICPUTA_CP Fixed(31),   /* All non-enclave time on CP.              
*                                      This includes TCB,                       
*                                      non-preemptable SRB,                     
*                                      Client SRB, Other SRB.    @92A*/         
*        5 ASISPACEB7,              /* Internal use             @A04A*/         
*          ?ERBFITEM(7 ASICPUTA_CP_MT) Float(24);,                              
*                                   /* ASICPUTA_CP (raw)        @A04C*/         
*        5 ASISPACEB8,              /* Internal use             @A04A*/         
*          7 ASICPUTA_zCBP Fixed(31),                                           
*                                   /* All non-enclave time on zCBP.            
*                                      This includes TCB,                       
*                                      non-preemptable SRB,                     
*                                      Client SRB, Other SRB.   @A04C*/         
*        5 ASISPACEB9,              /* Internal use             @A04A*/         
*          ?ERBFITEM(7 ASICPUTA_zCBP_MT) Float(24);,                            
*                                   /* ASICPUTA_zCBP (raw)      @A04C*/         
*        5 ASI_CP_PHTM Fixed(31),   /* Preemptable-class SRB Time               
*                                      on CP.                                   
*                                      Time for all types of                    
*                                      preemptable SRBs (PSRB, CRSRB,           
*                                      ESRB, ETCB).              @92A*/         
*        5 *         CHAR(16),      /* Reserved                  @93C*/         
*      3 ASIEXTNC BDY(WORD),        /* Miscellanious ASID data   @93A*/         
*        5 ASIRUCSAA  FIXED(32),    /* RUCSA allocation          @93A*/         
*        5 ASIERUCSAA FIXED(32),    /* ERUCSA allocation         @93A*/         
*        5 *         CHAR(8),       /* Reserved                  @93A*/         
*      3 ASIEND CHAR(0) BDY(DWORD); /* Force dword boundary      @51C*/         
*DCL 1 SS_TABLE BASED BDY(WORD),    /* Service class served table               
*                                                                @C1A*/         
*      3 SS_HEAD,                   /* Service class served                     
*                                      table header              @C1A*/         
*        5 SS_ACRO   CHAR(5),       /* Acronym ASISS/ASLSS       @C1A*/         
*        5 SS_VER    CHAR(1),       /* Control block version x'1E'              
*                                                               @A03C*/         
*        5 SS_HLEN   FIXED(16),     /* Length of table header    @C1A*/         
*        5 SS_TLEN   FIXED(32),     /* Total length of table including          
*                                      the table header          @C1A*/         
*        5 SS_RLEN   FIXED(16),     /* Length of one row         @C1A*/         
*        5 SS_ELEN   FIXED(16),     /* Length of one entry       @C1A*/         
*        5 SS_SRVM# FIXED(16),      /* Maximum # of servers      @C1A*/         
*        5 SS_SRVA# FIXED(16),      /* Actual # of servers       @C1A*/         
*        5 SS_SCL#   FIXED(16),     /* Actual # of service classes              
*                                      defined                   @C1A*/         
*        5 *         CHAR(10);      /* Reserved                  @C1A*/         
*                                                                               
*DCL 1 SS_ROW BASED BDY(WORD),      /* Maps one service class served            
*                                      table row for a server address           
*                                      space. The # of entries is               
*                                      equal to the actual # of                 
*                                      defined service classes   @C1A*/         
*      3 SS_ENTRY(1:*) FIXED(32);   /* Number of times the address              
*                                      space has served this service            
*                                      class                     @C1A*/         
*DCL 1 ALRARRAY BASED BDY(WORD),    /* ASID look up table used by               
*                                      Monitor III data reporter @Q1A*/         
*      3 ALRHEAD,                   /* ASID look up table header @W1A*/         
*        5 ALRALRG3 CHAR(5),        /* Acronym ALRG3             @Q2A*/         
*        5 ALRVERG3 CHAR(1),        /* Control block version, see               
*                                      ALRVERCB                 @A03C*/         
*        5 *        CHAR(2),        /* Reserved                  @Q1A*/         
*        5 ALRENTMX FIXED(31),      /* Number of entries. Last entry            
*                                      index = ASIENTMX - 1      @Q1A*/         
*      3 ALRENTRY(0:*) CHAR(LENGTH(ALRG3));                                     
*DCL 1 ALRG3 BASED(ALRG3PTR) BDY(WORD),                                         
*      3 ALRENTFP  PTR(31),         /* First entry in the ASIG3                 
*                                      table                     @Q1A*/         
*        5 ALRENTCP PTR(31),        /* Entry in ASID look up table              
*                                      used by reporter (this is the            
*                                      pointer  into the common                 
*                                      ASIG3 table)              @T2A*/         
*      3 ALRENTLP PTR(31);          /* Last  entry in the ASIG3                 
*                                      table (used by GRB3RTBR)  @T2A*/         
*/*Sort of ASIG3 entry. Any change in this key causes a              */         
*/*a new entry to be built                                           */         
*DCL 1 ASIG3_SORT_EXT BASED BDY(WORD), /* Extended Sort field    @B4A*/         
*      3 ASI_S_NEWJOB CHAR(LENGTH(ASIG3.ASIJOBNA) +            /*@52C*/         
*                          LENGTH(ASIG3.ASIJOBST)),            /*@52C*/         
*        5 ASI_S_ASIJOBNA CHAR(LENGTH(ASIG3.ASIJOBNA)),        /*@52C*/         
*        5 ASI_S_ASIJOBST CHAR(LENGTH(ASIG3.ASIJOBST)),        /*@52C*/         
*      3 ASI_S_ASISORT3 CHAR(LENGTH(ASIG3.ASISORT3)) BDY(WORD),/*@52C*/         
*%IF ASI_PREP_SORT_E = '' %THEN %GOTO ASI_PREP_LAB1;                            
*        5 ASI_S_E BDY(WORD) LIKE ASISORT3,                                     
*%ASI_PREP_LAB1:;                                                               
*      3 * CHAR(0);                     /*                       @B4A*/         
*                                                                               
*/************************************************************39@A04A*/         
*@LOGIC;                                                                        
*#PRAGMA TOOL=CBGEN.                                                            
*#ALIGNOP.                                                                      
*#NOTUPPER.                                                                     
*#NOLEN.                                                                        
*/* internal use */                                                             
*#DELETE.ALRVERCB                                                               
*#DELETE.SORTVERCB                                                              
*#DELETE.ASIV41CB                                                               
*#DELETE.ASIMT2CB                                                               
*#DELETE.ALRARRAY                                                               
*#DELETE.ALRG3                                                                  
*#DELETE.ASIG3_SORT_EXT                                                         
*#DELETE.ASISSTVP                                                               
*/* WLM compat mode */                                                          
*#DELETE.ASINPG                                                                 
*#DELETE.ASIDMN                                                                 
*/* SMF 72-5 fenced */                                                          
*#DELETE.ASISTOKEN                                                              
*/* CBP - fenced */                                                             
*#DELETE.ASICBP                                                                 
*#DELETE.ASI_Time_On_zCBP                                                       
*#DELETE.ASIzCBPTA                                                              
*#DELETE.ASI_zCBP_Time_On_CP                                                    
*#DELETE.ASIzCBPCTA                                                             
*#DELETE.ASI_zCBP_PHTM                                                          
*#DELETE.ASISSCTA                                                               
*#DELETE.ASIASSTA_CP                                                            
*/* ASIEXTNAA - CBP */                                                          
*/* DELETE pragma doesn't lead to shifted offsets                               
*   because only the first two fields are kept */                               
*#DELETE.ASISRBTA_NON_PREEMPT_CP                                                
*#DELETE.ASISRBTA_zCBP                                                          
*#DELETE.ASI_Asst_Time_On_zCBP                                                  
*#DELETE.ASIASSTA_zCBP                                                          
*/* ASIEXTNAB - multi-threading: replaced by preprocessor */                    
*/* ASIEXTNB - multi-threading and CBP */                                       
*/* DELETE pragma doesn't lead to shifted offsets                               
*   because of surrounding ASISPACEBx */                                        
*#DELETE.ASI_EJST_MT                                                            
*#DELETE.ASI_SRBT_MT                                                            
*#DELETE.ASI_SRB_Time_On_zCBP                                                   
*#DELETE.ASI_SRB_Time_On_zCBP_MT                                                
*#DELETE.ASICPUTA_CP_MT                                                         
*#DELETE.ASICPUTA_zCBP                                                          
*#DELETE.ASICPUTA_zCBP_MT                                                       
*/**/                                                                           
*#EPRAGMA.                                                                      
*#PRAGMA TOOL=PADI.                                                             
*#EPRAGMA.                                                                      
*@ENDLOGIC;                                                                     
*/* End of PL/X Source                                               */         
* %IF ERBASIG3_LIST = 'NO' !                                                    
*    ZCBPRINT = 'NO' %THEN                                                      
* %DO;                                                                          
*   @LIST POP NOECHO;                                                           
* %END;                                                                         
* %END;                                                                         
