*                                                                               
* %DCL ERBCATG3_INCLUDED CHAR EXT;                                              
* %DEACTIVATE ERBCATG3_INCLUDED;                                                
* %IF ERBCATG3_INCLUDED = '' %THEN                                              
* %DO;                                                                          
*/* Macro made bi-lingual on 21186. CBGEN compile date 21138         */         
*% /*                                                                           
         MACRO                                                                  
         ERBCATG3 &DSECT=YES,&LIST=YES,&TITLE=YES,&CATARRAY=YES,       *        
               &CATG3=COND                                                      
                GBLC  &ERBCATG3_INCLUDED                                        
                GBLC  &ZCBPRINT                                                 
&ERBCATG3_INCLUDED SETC 'YES'                                                   
                AIF   ('&LIST' EQ 'NONE').P0                                    
                AIF   ('&TITLE' EQ 'NO').P5                                     
 TITLE          'ERBCATG3  - CACHE data aggregate                      *        
                '                                                               
.P5             ANOP                                                            
**/ ;                                                                           
*/**** Start of Specifications ***************************************/         
*/*                                                                  */         
*/* 01* Proprietary Statement:                                  @A03C*/         
*/*       Licensed Materials - Property of IBM                       */         
*/*       "Restricted Materials of IBM"                              */         
*/*       Copyright IBM Corp. 1999, 2021                             */         
*/*                                                                  */         
*/*       Status: z/OS V2R5 Data Gatherer (HRG77D0)             @A03M*/         
*/*                                                                  */         
*/* 01* Macro Name: ERBCATG3                                         */         
*/*                                                                  */         
*/* 01* Descriptive Name: CACHE data aggregate                       */         
*/*                                                                  */         
*/*   The CATG3 data aggregate consists the following parts          */         
*/*                                                                  */         
*/*   1. CATG3 Header                                                */         
*/*   2. One array entry for each SMF 74-5 record (SSID)             */         
*/*                                                                  */         
*/*                                                             @A03D*/         
*/* 01* DSECT Name:                                                  */         
*/*   02*  CATARRAY                                                  */         
*/*   02*  CATG3                                                     */         
*/*                                                                  */         
*/* 01* Component: zOS Data Gatherer (27401)                         */         
*/*                                                                  */         
*/* 01* Eye-Catcher: CATG3                                           */         
*/*   02*    Offset: 0                                               */         
*/*   02*    Length: 5                                               */         
*/*                                                                  */         
*/* 01* Storage Attributes:                                          */         
*/*                                                                  */         
*/*   02*   Subpool:            0                                    */         
*/*   02*    Key:               User                                 */         
*/*   02*    Residency:         Any                                  */         
*/*   02*    Main storage :     N/A                                  */         
*/*   02*    Auxiliary storage: N/A                                  */         
*/*   02*    Virtual storage:   N/A                                  */         
*/*                                                                  */         
*/* 01* Size:                                                   @A03C*/         
*/*             CATARRAY -- X'0068' bytes                            */         
*/*             CATG3    -- X'0028' bytes                            */         
*/*                                                                  */         
*/* 01* Pointed to by: See below                                     */         
*/*         SSHCATP  - Monitor III data gatherer                     */         
*/*         SSHCATO  - Monitor III data gatherer/reporter when in    */         
*/*                    in-storage buffer and/or datasets as part or  */         
*/*                    a set-of-samples                              */         
*/*         GSTCAT1  - Monitor III data gatherer (GSTC3)             */         
*/*                    (Set of Cache data, current or previous)      */         
*/*         GSTCAT2  - Monitor III data gatherer (GSTC3)             */         
*/*                    (Set of Cache data, current or previous)      */         
*/*                                                                  */         
*/* 01* Serialization: None                                          */         
*/*                                                                  */         
*/* 01* Function: This table contains the Cache data                 */         
*/*                                                                  */         
*/*                                                                  */         
*/* 01* Method of Access: See below                                  */         
*/*     ASM:  ERBCATG3                                          @A03A*/         
*/*     PL/X: %INCLUDE SYSLIB(ERBCATG3) semicolon                    */         
*/*                                                                  */         
*/* 01* Dependencies: None                                           */         
*/*                                                                  */         
*/*                                                             @A03D*/         
*/* 01* Distribution Library: AGRBMAC1                          @A03C*/         
*/*                                                                  */         
*/* 01* Change Activity: See below                                   */         
*/*                                                                  */         
*/*  $H0=CACHE,HRM6607,,THE: Cache Online Support                    */         
*/*  $L1=MEGA,OA06476,,SHR: Cache data gatherer restructure      @L1A*/         
*/*  $A02=ZOSB,HRG77D0,,JBa: Rename prefix ERB to GRB           @A02A*/         
*/*  $A03=ZOSB,HRG77D0,,JBa: Make macro bilingual               @A03A*/         
*/*                                                                  */         
*/**** End of Specifications *****************************************/         
*% /*                                                                           
.P0             ANOP                                                            
                AIF   ('&ZCBPRINT' EQ 'NO').P1                                  
                AIF   ('&LIST' EQ 'YES').P2                                     
.P1             ANOP                                                            
                PUSH  PRINT                                                     
                PRINT OFF                                                       
.P2             ANOP                                                            
                AIF   ('&CATARRAY' EQ 'NO').L0002                               
                AIF   ('&DSECT' EQ 'YES').L0003                                 
                AIF   ('&CATARRAY' NE 'YES').L0002                              
CATARRAY        DS    0F           CATG3 array                                  
                AGO   .L0004                                                    
.L0003          ANOP                                                            
CATARRAY        DSECT              CATG3 array                                  
.L0004          ANOP                                                            
CATHEAD         DS    CL64         Header of the array                          
                ORG   CATHEAD                                                   
CATG3_Acro      DS    CL5          Name of CATG3                                
CATG3_Ver       DS    X            Version of CATG3                             
CATG3_Rsrvd1    DS    CL2          Internal use                                 
CATG3_Tot_Len   DS    F            Total length. Includes the table    *        
                                   header, the Max_Num array entries   *        
                                   and all SMF 74-5 records.                    
CATG3_Rsrvd2    DS    CL4          Internal use                                 
CATG3_Hdr_Len   DS    H            Header length                                
CATG3_Entry_Len DS    H            Array entry length                           
CATG3_Entry_Num DS    F            Number of used array entries                 
CATG3_Max_Num   DS    F            Max number of array entries                  
CATG3_Rsrvd3    DS    CL20         Internal use                                 
CATG3_LDTO      DS    CL8          Local time/date offset to GMT                
CATG3_Rsrvd4    DS    CL4          Internal use                                 
                DS    CL4          Reserved                                     
CATENTRY        DS    CL40         Array of CATG3's                             
.L0002          ANOP                                                            
                AIF   ('&CATG3' EQ 'NO').L0005                                  
                AIF   ('&DSECT' EQ 'YES').L0006                                 
                AIF   ('&CATG3' NE 'YES').L0005                                 
CATG3           DS    0F           Maps one entry in the array                  
                AGO   .L0007                                                    
.L0006          ANOP                                                            
CATG3           DSECT              Maps one entry in the array                  
.L0007          ANOP                                                            
CATG3_SSID      DS    H            SSID                                         
CATG3_MDL       DS    X            Subsystem model                              
                DS    CL1          Reserved                                     
CATG3_B_TOD     DS    CL8          Cache Mintime begin (GMT)                    
CATG3_E_TOD     DS    CL8          Cache Mintime end (GMT)                      
CATG3_Status    DS    CL12         Status data                                  
                ORG   CATG3_Status                                              
CATG3_Msg_Flg   DS    BL2          Message flags                                
                ORG   CATG3_Msg_Flg                                             
CATG3_Msg_S     DS    B            Severe errors                                
                ORG   CATG3_Msg_S                                               
                DS    B            Reserved                                     
CATG3_Msg_I     DS    B            Informational messages                       
*  Bit definitions:                                                             
CATG3_MSGI1     EQU   X'80'        No Cache data                                
                ORG   CATG3_Msg_Flg+2                                           
CATG3_Stat_Code DS    H            Status code: 0 = successful, 4 =    *        
                                   IOS return code CATG3_RC_IOS ^= 0,  *        
                                   8 = IDCSS01 return code             *        
                                   CATG3_RC_IDCSS, 98 = System or User *        
                                   Abend CATG3_CMPC ^= 0                        
CATG3_RC_IOS    DS    H            IOS return code                              
CATG3_RC_IDCSS  DS    H            IDCSS01 return code                          
                DS    CL1          Reserved                                     
CATG3_CMPC      DS    CL3          SDWACMPC, First 12 bits = System    *        
                                   completion code, Second 12 bits =   *        
                                   User completion code                         
CATG3_Rec_VF    DS    F            Offset to SMF 74-5 record                    
CATG3_Rec_Lng   DS    F            Length of SMF 74-5 record                    
CATG3_Acro_CC_0TO3 EQU C'CATG'     Acronym part 1                               
CATG3_Acro_CC_4    EQU C'3'        Acronym part 2                               
CATG3_Ver_CF    EQU   1            Control block version                        
.L0005          ANOP                                                            
                AIF   ('&ZCBPRINT' EQ 'NO').P3                                  
                AIF   ('&LIST' EQ 'YES').P4                                     
.P3             ANOP                                                            
                POP   PRINT                                                     
.P4             ANOP                                                            
.P_EXIT         ANOP                                                            
                MEND                                                            
**/ ;                                                                           
* %ERBCATG3_INCLUDED = 'YES';                                                   
* %DCL ZCBPRINT CHAR EXT;                                                       
* %DEACTIVATE ZCBPRINT;                                                         
* %DCL ERBCATG3_LIST CHAR EXT;                                                  
* %DEACTIVATE ERBCATG3_LIST;                                                    
* %IF ERBCATG3_LIST = 'NO' !                                                    
*    ZCBPRINT = 'NO' %THEN                                                      
* %DO;                                                                          
*   @LIST PUSH NOECHO;                                                          
*   @LIST NOASSEMBLE NOECHO;                                                    
*   @LIST OFF C NOECHO;                                                         
* %END;                                                                         
*/* Start of PL/X Source                                             */         
*                                                                               
*%IBM_CBGEN_PADI = '';                                        /*@A03A*/         
*%If IBM_CBGEN = 'YES' ! IBM_PADI = 'YES' %Then %Do;          /*@A03A*/         
*   %IBM_CBGEN_PADI = 'YES';                                  /*@A03A*/         
*%End;                                                        /*@A03A*/         
*                                                                               
*%If IBM_CBGEN <> 'YES' %Then %Do;                            /*@A03A*/         
*/********************************************************************/         
*/*                                                                  */         
*/* 01* Created by:    GRB3GCOC                                      */         
*/*                                                                  */         
*/* 01* Deleted by:                                                  */         
*/*         GRB3GISS - Always frees previous set of cache data, if   */         
*/*                    newer data exist.                             */         
*/*         GRB3GTER - Clean-up all cache data at termination        */         
*/*                                                                  */         
*/* 01* Modified by:                                                 */         
*/*         GRB3GCOC - M III Cache data gatherer subtask control:    */         
*/*                    Create header, GETMAIN                        */         
*/*         GRB3GDAC - Monitor III Cache data gatherer:              */         
*/*                    Insert SMF 74.5 records                       */         
*/*                                                                  */         
*/* 01* Used by:                                                     */         
*/*         GRB3GISS - Monitor III Cache data gatherer               */         
*/*         GRB3GCOC - Monitor III Cache dat a reproter ine          */         
*/*         GRB3GDAC - Monitor III Cache dat a reproter ine          */         
*/*         GRB3GTER - Monitor III Cache dat a reproter ine          */         
*/*                                                                  */         
*/**************************************************************@A03M*/         
*%End;                                                        /*@A03A*/         
*                                                                               
*DECLARE                                                                        
*  1 CATARRAY BASED BDY(WORD),      /* CATG3 array                   */         
*    3 CATHEAD     BDY(WORD),       /* Header of the array           */         
*      5 CATG3_Acro      CHAR(5),   /* Name of CATG3                 */         
*      5 CATG3_Ver       FIXED(8),  /* Version of CATG3              */         
*      5 CATG3_Rsrvd1,              /* Internal use             @A03A*/         
*        7 CATG3_Subpool FIXED(16), /* Subpool                  @A03C*/         
*      5 CATG3_Tot_Len   FIXED(31), /* Total length. Includes the    */         
*                                   /* table header,                 */         
*                                   /* the Max_Num array entries     */         
*                                   /* and all SMF 74-5 records.     */         
*      5 CATG3_Rsrvd2,              /* Internal use             @A03A*/         
*        7 CATG3_Token   FIXED(32), /* Incremented for each new      */         
*                                   /* set of Cache data        @A03C*/         
*      5 CATG3_Hdr_Len   FIXED(16), /* Header length                 */         
*      5 CATG3_Entry_Len FIXED(16), /* Array entry length            */         
*      5 CATG3_Entry_Num FIXED(31), /* Number of used array entries  */         
*      5 CATG3_Max_Num   FIXED(31), /* Max number of array entries   */         
*      5 CATG3_Rsrvd3,              /* Internal use             @A03A*/         
*        7 CATG3_Beg_TOD CHAR(8),   /* Time stamp, subtask started   */         
*                                   /*                          @A03C*/         
*        7 CATG3_End_TOD CHAR(8),   /* Time stamp, subtask ended     */         
*                                   /*                          @A03C*/         
*        7 CATG3_Elapsed FIXED(31), /* Elapsed time in seconds       */         
*                                   /* to collect Cache data.        */         
*                                   /* End_TOD - Beg_TOD             */         
*                                   /* Zero = less than .5 seconds   */         
*                                   /*                          @A03C*/         
*      5 CATG3_LDTO      CHAR(8),   /* Local time/date offset to GMT */         
*                                   /*                          @A03C*/         
*      5 CATG3_Rsrvd4,              /* Internal use             @A03A*/         
*        7 CATG3_CRR_Phase FIXED(31), /* Invocation phase for CRR    */         
*                                   /* data collector GRBCRSRS       */         
*                                   /*   0 = Not previously invoked  */         
*                                   /*   4 = Initial invocation      */         
*                                   /*   8 = Interval invocation     */         
*                                   /*                          @A03C*/         
*      5 *               CHAR(4),   /* Reserved                      */         
*    3 CATENTRY(0:*)                                                            
*      CHAR(LENGTH(CATG3));         /* Array of CATG3's              */         
*DCL                                                                            
*  1 CATG3 BASED(CATG3PTR)          /* Maps one entry in the array   */         
*    BDY(WORD),                                                                 
*    3 CATG3_SSID    FIXED(16),     /* SSID                          */         
*      5 CATG3_SSIDC CHAR(2),       /* SSID                          */         
*    3 CATG3_MDL     FIXED(8),      /* Subsystem model               */         
*    3 *             CHAR(1),       /* Reserved                      */         
*    3 CATG3_B_TOD   CHAR(8),       /* Cache Mintime begin (GMT)     */         
*    3 CATG3_E_TOD   CHAR(8),       /* Cache Mintime end   (GMT)     */         
*    3 CATG3_Status,                /* Status data                   */         
*      5 CATG3_Msg_Flg BIT(16),     /* Message flags                 */         
*        7 CATG3_Msg_S   BIT(8),    /* Severe errors                 */         
*          9 *             BIT(8),  /* Reserved                      */         
*        7 CATG3_Msg_I   BIT(8),    /* Informational messages        */         
*          9 CATG3_MSGI1   BIT(1),  /* No Cache data                 */         
*          9 *             BIT(7),  /* Reserved                      */         
*      5 CATG3_Stat_Code FIXED(16), /* Status code:                  */         
*                                   /*  0 = successful,              */         
*                                   /*  4 = IOS return code          */         
*                                   /*      CATG3_RC_IOS ^= 0,       */         
*                                   /*  8 = IDCSS01 return code      */         
*                                   /*      CATG3_RC_IDCSS,          */         
*                                   /* 98 = System or User Abend     */         
*                                   /*      CATG3_CMPC ^= 0     @A03C*/         
*      5 CATG3_RC_IOS    FIXED(16), /* IOS return code               */         
*      5 CATG3_RC_IDCSS  FIXED(16), /* IDCSS01 return code           */         
*      5 *               CHAR(1),   /* Reserved                      */         
*      5 CATG3_CMPC      CHAR(3),   /* SDWACMPC,                     */         
*                                   /* First 12 bits =               */         
*                                   /*   System completion code,     */         
*                                   /* Second 12 bits =              */         
*                                   /*   User completion code   @A03C*/         
*    3 CATG3_Rec_VF    FIXED(31),   /* Offset to SMF 74-5 record     */         
*                                   /*                          @A03C*/         
*      5 CATG3_Rec_VP    PTR(31),   /* Address of SMF 74-5 record.   */         
*                                   /* Before GRB3GISS moves a SSH,  */         
*                                   /* the address is used. After    */         
*                                   /* moving always the offset to   */         
*                                   /* CATARRAY is used.        @A03C*/         
*    3 CATG3_Rec_Lng   FIXED(31);   /* Length of SMF 74-5 record     */         
*                                                                               
*DECLARE                                                                        
*  CATG3_Acro_CC    CHAR(5)         /* Acronym                       */         
*     CONSTANT('CATG3'),                                                        
*  CATG3_Ver_CF     FIXED(8)        /* Control block version         */         
*     CONSTANT(1);                                                              
*DECLARE                                                                        
*  CATG3PTR        PTR(31);         /* Address of array              */         
*                                                                               
*/************************************************************24@A03A*/         
*@LOGIC;                                                                        
*#PRAGMA TOOL=CBGEN.                                                            
*#ALIGNOP.                                                                      
*#NOTUPPER.                                                                     
*#NOLEN.                                                                        
*/* internal use */                                                             
*#DELETE.CATG3_Subpool                                                          
*#DELETE.CATG3_Token                                                            
*#DELETE.CATG3_Beg_TOD                                                          
*#DELETE.CATG3_End_TOD                                                          
*#DELETE.CATG3_Elapsed                                                          
*#DELETE.CATG3_CRR_Phase                                                        
*#DELETE.CATG3_SSIDC                                                            
*#DELETE.CATG3_Rec_VP                                                           
*/**/                                                                           
*#REPLACE.CATG3_Acro_CC                                                         
*CATG3_Acro_CC_0TO3 EQU C'CATG'     Acronym part 1                              
*CATG3_Acro_CC_4    EQU C'3'        Acronym part 2                              
*#EREPLACE.                                                                     
*#EPRAGMA.                                                                      
*#PRAGMA TOOL=PADI.                                                             
*#PADIDELETE.CATG3_Acro_CC                                                      
*#PADIDELETE.CATG3_Acro_CC_0TO3                                                 
*#PADIDELETE.CATG3_Acro_CC_4                                                    
*#EPRAGMA.                                                                      
*@ENDLOGIC;                                                                     
*/* End of PL/X Source                                               */         
* %IF ERBCATG3_LIST = 'NO' !                                                    
*    ZCBPRINT = 'NO' %THEN                                                      
* %DO;                                                                          
*   @LIST POP NOECHO;                                                           
* %END;                                                                         
* %END;                                                                         
