*                                                                               
* %DCL ERBDVTG3_INCLUDED CHAR EXT;                                              
* %DEACTIVATE ERBDVTG3_INCLUDED;                                                
* %IF ERBDVTG3_INCLUDED = '' %THEN                                              
* %DO;                                                                          
*/* Macro made bi-lingual on 21194. CBGEN compile date 21138         */         
*% /*                                                                           
         MACRO                                                                  
         ERBDVTG3 &DSECT=YES,&LIST=YES,&TITLE=YES,&DVTARRAY=YES,       *        
               &DVTG3=COND                                                      
          GBLC  &ERBDVTG3_INCLUDED                                              
          GBLC  &ZCBPRINT                                                       
&ERBDVTG3_INCLUDED SETC 'YES'                                                   
          AIF   ('&LIST' EQ 'NONE').P0                                          
          AIF   ('&TITLE' EQ 'NO').P5                                           
 TITLE    'ERBDVTG3  - Mapping macro for Mon. III Data Gatherer Device *        
               Table Entry   '                                                  
.P5       ANOP                                                                  
**/ ;                                                                           
*/****  START OF SPECIFICATIONS  *************************************/         
*/*                                                                  */         
*/*01* PROPRIETARY STATEMENT:                                   @A04C*/         
*/*       Licensed Materials - Property of IBM                       */         
*/*       "Restricted Materials of IBM"                              */         
*/*       Copyright IBM Corp. 1984, 2021                             */         
*/*                                                                  */         
*/*       Status: z/OS V2R5 Data Gatherer (HRG77D0)             @A04M*/         
*/*                                                                  */         
*/*01* MACRO NAME: ERBDVTG3                                          */         
*/*                                                                  */         
*/*01* DESCRIPTIVE NAME:                                             */         
*/*    Mapping macro for Mon. III Data Gatherer Device Table Entry   */         
*/*                                                             @A04C*/         
*/*                                                                  */         
*/*                                                             @A04D*/         
*/*01* DSECT NAME: DVTG3                                             */         
*/*                DVTARRAY                                          */         
*/*                                                                  */         
*/*01* COMPONENT: zOS Data Gatherer (27401)                          */         
*/*                                                                  */         
*/*01* EYE-CATCHER: DVTG3                                            */         
*/*02*     OFFSET:  5                                                */         
*/*02*     LENGTH:  5                                                */         
*/*                                                                  */         
*/*01* STORAGE ATTRIBUTES:                                           */         
*/*02*  SUBPOOL:   2                                                 */         
*/*02*  KEY:       user                                              */         
*/*02*  RESIDENCY: Above 16 MB in virtual storage                    */         
*/*02*  MAIN STORAGE:      N/A                                       */         
*/*02*  AUXILIARY STORAGE: N/A                                       */         
*/*02*  VIRTUAL STORAGE:   N/A                                       */         
*/*                                                                  */         
*/*01* SIZE:                                                    @A04C*/         
*/*            DVTARRAY -- X'00A8' bytes                             */         
*/*            DVTG3    -- X'0098' bytes                             */         
*/*                                                                  */         
*/*01* POINTED TO BY: DVTG3PTR                                       */         
*/*                                                                  */         
*/*01* SERIALIZATION: NONE                                           */         
*/*                                                                  */         
*/*01* FUNCTION: THIS MACRO MAPS THE RMF MON III DATA GATHERER       */         
*/*              DEVICE TABLE ENTRY AND THE DEVICE TABLE ITSELF      */         
*/*                                                             @A04C*/         
*/*                                                                  */         
*/*                                                                  */         
*/*01* METHOD OF ACCESS:                                             */         
*/*                                                                  */         
*/*     ASM: ERBDVTG3                                           @A04A*/         
*/*                                                                  */         
*/*     PL/X:                                                   @A04C*/         
*/*         DVTG3 is declared as a based structure, DVTG3PTR should  */         
*/*         be declared.                                             */         
*/*         DVTARRAY is declared as a based structure.               */         
*/*         The caller has to provide the basing.                    */         
*/*                                                                  */         
*/*          - PERCENT INCLUDE SYSLIB(ERBDVTG3) SEMICOLON            */         
*/*                                                                  */         
*/*                                                                  */         
*/*01* FREQUENCY: N/A                                                */         
*/*                                                                  */         
*/*01* DEPENDENCIES: NONE                                            */         
*/*                                                                  */         
*/*01* DISTRIBUTION LIBRARY: AGRBMAC1                           @A04C*/         
*/*                                                                  */         
*/*01* CHANGE ACTIVITY: SEE BELOW                                    */         
*/*                                                                  */         
*/* $M0=MONIIIG,HRM3202,,PFU: MAPPING MACRO FOR DEVICE TABLE         */         
*/* $P1=3090,HRM3302,,MLN: 3090 support                          @P1A*/         
*/* $Q1=NEWREP,HRM3402,,MLN: New and Changed Reports             @Q1A*/         
*/* $Q2=PERI,HRM3402,,PFU: Performance improvements              @Q2A*/         
*/* $W1=PLAS,HRM4410,,MLN: PLAS Conversion                       @W1A*/         
*/* $Y1=DMSR,HRM4420,,CLL: Model Type (SHARE SOMVSP87001)        @Y1A*/         
*/* $Z1=OY29112,HRM4420,,PAE: Serial & Switch                    @Z1A*/         
*/* $A1=DYNIO,JRM4421,,AB: Dynamic I/O support                   @A1A*/         
*/* $B1=M3ENH,HRM4430,,HBE: Monitor III Enhancements             @B1A*/         
*/* $B2=M3ENH,HRM4430,,RTL: Monitor III Enhancements             @B2A*/         
*/* $C1=4KUCB,HRM4440,,FF: Four Digit Device Numbers (>4K UCB)   @C1A*/         
*/* $E1=IPM,OW17898,,PFU: IPM Adaptations                        @E1A*/         
*/* $G1=PAV,HRM6606,,SHR: PAV device support                     @G1A*/         
*/* SHR: PAV device support                                  @WA31701*/         
*/* $K1=XMP,HRM7708,,WLR: T-Rex Support                          @K1A*/         
*/* $K2=MISC,HRM7708,,GUB: Swap dataset removal                  @K2A*/         
*/*  PS: Adjustment time change in case of FICON             @OA05197*/         
*/* $01=HPV,OA12865,,PS: HyperPAV Support                        @01A*/         
*/* $02=MISC,HRM7730,,FDL: Adds preprocessor control for         @02A*/         
*/*                        reporter use                          @02A*/         
*/* $61=SSID,OA42068,,PS: NON-PAV Alias devices in               @61A*/         
*/*                       alternate subchannel set               @61A*/         
*/* $81=zHW2,HRM77B0,,JKu: zHyperwrite Stage 2                   @81A*/         
*/* $A01=Split,OA58759,,JBa: RMF Product Split                  @A01A*/         
*/* $A02=ZOSB,HRG77D0,,JBa: Rename prefix ERB to GRB            @A02A*/         
*/* $A03=ZOSB,OA60212,,UMu: Mon 3 data conversion for reporter  @A03A*/         
*/* $A04=ZOSB,HRG77D0,,JBa: Make macro bilingual                @A04A*/         
*/*                                                                  */         
*/****  END OF SPECIFICATIONS  ***************************************/         
*% /*                                                                           
.P0       ANOP                                                                  
          AIF   ('&ZCBPRINT' EQ 'NO').P1                                        
          AIF   ('&LIST' EQ 'YES').P2                                           
.P1       ANOP                                                                  
          PUSH  PRINT                                                           
          PRINT OFF                                                             
.P2       ANOP                                                                  
DVTVERCB  EQU   X'12'              Control block version number                 
MAXDEVCF  EQU   65535              Maximum number of devices per       *        
                                   subchannel set                               
          AIF   ('&DVTARRAY' EQ 'NO').L0002                                     
          AIF   ('&DSECT' EQ 'YES').L0003                                       
          AIF   ('&DVTARRAY' NE 'YES').L0002                                    
DVTARRAY  DS    0F                 Device table                                 
          AGO   .L0004                                                          
.L0003    ANOP                                                                  
DVTARRAY  DSECT                    Device table                                 
.L0004    ANOP                                                                  
DVTHEAD   DS    CL16               Device table header                          
          ORG   DVTHEAD                                                         
DVTDVTG3  DS    CL5                Acronym DVTG3                                
DVTVERG3  DS    CL1                Control block version                        
DVTHDRLE  DS    X                  Length of the DVTG3 header                   
DVTENTLE  DS    X                  Length of one entry                          
DVTENTMX  DS    F                  Number of table entries, Highest    *        
                                   possible index is DVTENTMX-1                 
DVTENTNR  DS    F                  Index of last filled entry                   
DVTENTRY  DS    CL152              Entry in the device table                    
.L0002    ANOP                                                                  
          AIF   ('&DVTG3' EQ 'NO').L0005                                        
          AIF   ('&DSECT' EQ 'YES').L0006                                       
          AIF   ('&DVTG3' NE 'YES').L0005                                       
DVTG3     DS    0F                 Sample header fields used                    
          AGO   .L0007                                                          
.L0006    ANOP                                                                  
DVTG3     DSECT                    Sample header fields used                    
.L0007    ANOP                                                                  
DVTBASE   DS    CL12               Basic data for DVT entry                     
          ORG   DVTBASE                                                         
DVTVOLI   DS    CL6                VOLSER                                       
DVTENIDX  DS    H                  Reserved                                     
DVTDEVNR  DS    H                  Device number in hex format                  
DVTPREVI  DS    H                  Reserved                                     
DVTEXTEN  DS    CL140              Extended data for DVT entry                  
          ORG   DVTEXTEN                                                        
DVTSMPCT  DS    F                  Number of valid samples                      
DVTSMPNR  DS    F                  Sample sequence number                       
DVTFLAG1  DS    B                  Device type indicator                        
*  Bit definitions:                                                             
DVTMEXPO  EQU   X'80'              Reserved                                     
DVTDACC   EQU   X'40'              DASD device                                  
DVTTAPE   EQU   X'20'              tape device                                  
DVTNXC    EQU   X'10'              number of alias exposures changed   *        
                                   for a PAV device                             
DVTRVDEV  EQU   X'08'              virtual DASD                                 
DVTALTCU  EQU   X'04'              Reserved                                     
DVTLCUVA  EQU   X'02'              LCU number is valid                          
DVTMXPAV  EQU   X'01'              Multiple exposure (PAV) device               
DVTFLAG2  DS    B                  Device storage indicators                    
*  Bit definitions:                                                             
DVTCMBFI  EQU   X'80'              CMB data stored as begin time value          
DVTCMBLA  EQU   X'40'              CMB data stored as end time value            
DVTSTSFI  EQU   X'20'              STSCH data stored as begin time     *        
                                   value                                        
DVTSTSLA  EQU   X'10'              STSCH data stored as end time value          
DVTPLPA   EQU   X'08'              This device has PLPA page datasets           
DVTCOMM   EQU   X'04'              This device has COMMON page         *        
                                   datasets                                     
DVTLOCL   EQU   X'02'              This device has LOCAL page datasets          
DVTMEXNR  DS    H                  Number of exposures including the   *        
                                   base exposure                                
DVTTIMFI  DS    CL20               Time values first                            
          ORG   DVTTIMFI                                                        
DVTDISIF  DS    F                  Native Device disconnect time first          
DVTPETIF  DS    F                  Native Device pending time first             
DVTCOTIF  DS    F                  Native Device connect time first             
DVTDVBIF  DS    F                  Device busy delay time first                 
DVTCUBIF  DS    F                  No longer used                               
DVTTIMLA  DS    CL20               Time values last                             
          ORG   DVTTIMLA                                                        
DVTDISIL  DS    F                  Native Device disconnect time last           
DVTPETIL  DS    F                  Native Device pending time last              
DVTCOTIL  DS    F                  Native Device connect time last              
DVTDVBIL  DS    F                  Device busy delay time last                  
DVTCUBIL  DS    F                  No longer used                               
DVTTYP    DS    CL4                Device type (mapped by UCBTYPES     *        
                                   macro)                                       
DVTIDEN   DS    CL8                Device identification (device       *        
                                   model)                                       
DVTCUID   DS    CL8                Control unit model                           
DVTSPBIF  DS    F                  No longer used                               
DVTSPBIL  DS    F                  No longer used                               
DVTIOQLC  DS    F                  I/O queue length count                       
DVTSAMPA  DS    F                  Accumulated I/O instruction count            
          DS    H                  No longer used                               
DVTLCUNR  DS    H                  LCU number                                   
DVTSAMPP  DS    F                  I/O instruction count previous      *        
                                   value                                        
DVTCMRIF  DS    F                  Initial command response time first          
DVTCMRIL  DS    F                  Initial command response time last           
DVTCUQTP  DS    F                  Control unit queuing time previous  *        
                                   value                                        
DVTCUQTN  DS    F                  Accumulated control unit queuing    *        
                                   time for devices not connected to   *        
                                   FICON channel                                
DVTCUQTF  DS    F                  Accumulated control unit queuing    *        
                                   time for devices connected to FICON *        
                                   channel                                      
DVTHPNUM  DS    F                  Accumulated number of HyperPAV      *        
                                   aliases in each cycle                        
DVTPSM    DS    F                  Number of successful PAV samples             
DVTFLAG3  DS    B                  Flag byte                                    
*  Bit definitions:                                                             
DVTHPAV   EQU   X'80'              Device is a HyperPAV base device             
DVTHWRT   EQU   X'40'              Hyperwrite requested on this device          
DVTHPCON  DS    X                  Configured HyperPAV aliases for     *        
                                   that LSS                                     
          DS    CL3                Reserved for future use                      
DVTSSID   DS    X                  Subchannel set                               
DVTDEVN2  DS    H                  Device number same as DVTDEVNR               
DVTENIDX4 DS    F                  Entry index                                  
DVTPREVI4 DS    F                  Previous index                               
DVTEND    DS    0C                 Force word boundary                          
.L0005    ANOP                                                                  
          AIF   ('&ZCBPRINT' EQ 'NO').P3                                        
          AIF   ('&LIST' EQ 'YES').P4                                           
.P3       ANOP                                                                  
          POP   PRINT                                                           
.P4       ANOP                                                                  
.P_EXIT   ANOP                                                                  
          MEND                                                                  
**/ ;                                                                           
* %ERBDVTG3_INCLUDED = 'YES';                                                   
* %DCL ZCBPRINT CHAR EXT;                                                       
* %DEACTIVATE ZCBPRINT;                                                         
* %DCL ERBDVTG3_LIST CHAR EXT;                                                  
* %DEACTIVATE ERBDVTG3_LIST;                                                    
* %IF ERBDVTG3_LIST = 'NO' !                                                    
*    ZCBPRINT = 'NO' %THEN                                                      
* %DO;                                                                          
*   @LIST PUSH NOECHO;                                                          
*   @LIST NOASSEMBLE NOECHO;                                                    
*   @LIST OFF C NOECHO;                                                         
* %END;                                                                         
*/* Start of PL/X Source                                             */         
*                                                                               
*%IBM_CBGEN_PADI = '';                                        /*@A04A*/         
*%If IBM_CBGEN = 'YES' ! IBM_PADI = 'YES' %Then %Do;          /*@A04A*/         
*   %IBM_CBGEN_PADI = 'YES';                                  /*@A04A*/         
*%End;                                                        /*@A04A*/         
*                                                                               
*%If IBM_CBGEN <> 'YES' %Then %Do;                            /*@A04A*/         
*/********************************************************************/         
*/*                                                                  */         
*/*01* CREATED BY:  GRB3GINI                                         */         
*/*                 GRB3GDAS                                         */         
*/*                 GRB3RTBR                                         */         
*/*                                                                  */         
*/*01* DELETED BY:  GRB3GTER                                         */         
*/*                                                                  */         
*/*01* NOTES:                                                        */         
*/*                                                                  */         
*/*  1. The constant DVTVERCB and the comment of the field DVTVERG3  */         
*/*     have to be updated whenever this control block becomes       */         
*/*     incompatible to the  previous version.                   @B1A*/         
*/*                                                                  */         
*/*  2. This data aggregate is stored in permanent storage.          */         
*/*     Any changes made must be reflected in the reporter           */         
*/*     conversion process. Especially the control block             */         
*/*     ERBVFMG3 needs to be updated.                            @B1A*/         
*/*                                                                  */         
*/*01* POINTED TO BY: DVLG3PTR (lookup table)                        */         
*/*                                                                  */         
*/*01* METHOD OF ACCESS:                                             */         
*/*                                                                  */         
*/*         DVLG3 IS DECLARED AS A BASED STRUCTURE, DVLG3PTR SHOULD  */         
*/*         BE DECLARED                                              */         
*/*         DVLARRAY are declared as a based structure.              */         
*/*         The caller has to provide the basing.                    */         
*/*                                                                  */         
*/*            To reduce look up table size when called from         */         
*/*            reporter module:                                      */         
*/*            %DVT_ReporterOnly = 'YES' SEMICOLON               @02A*/         
*/*                                                                  */         
*/**************************************************************@A04M*/         
*%End;                                                        /*@A04A*/         
*                                                                               
*  DCL DVTVERCB BIT(8) CONSTANT('12'X); /* Control block version                
*                                      number                    @81C*/         
*  DCL DVLVERCB BIT(8) CONSTANT('12'X); /* Control block version                
*                                      number DVLG3             @A03A*/         
*  DCL DVTVER_SSID BIT(8) CONSTANT('11'X);  /* Alternate subchannel             
*                                      set support               @81A*/         
*  DCL DVTVER_zHyperwrite BIT(8) CONSTANT('12'X);  /* zHyperwrite -             
*                                      5 digit devnum support    @81A*/         
*  DCL MAXDEVCF FIXED(31) CONSTANT(65535);                                      
*                                   /* Maximum number of devices per            
*                                      subchannel set            @81C*/         
*  DCL 1 DVTARRAY BASED,            /* Device table              @Q1A*/         
*        3 DVTHEAD,                 /* Device table header       @W1A*/         
*          5 DVTDVTG3   CHAR(5),    /* Acronym DVTG3             @Q1A*/         
*          5 DVTVERG3   CHAR(1),    /* Control block version     @W1C*/         
*          5 DVTHDRLE   FIXED(8),   /* Length of the DVTG3 header@W1C*/         
*          5 DVTENTLE   FIXED(8),   /* Length of one entry       @W1C*/         
*          5 DVTENTMX   FIXED(31),  /* Number of table entries,                 
*                                      Highest possible index is                
*                                      DVTENTMX-1                @W1C*/         
*          5 DVTENTNR   FIXED(31),  /* Index of last filled entry@W1C*/         
*        3 DVTENTRY(0:*) CHAR(LENGTH(DVTG3));                                   
*                                   /* Entry in the device table @Q1A*/         
*  DCL 1 DVTG3  BASED(DVTG3PTR) BDY(WORD),                                      
*                                   /* Sample header fields used     */         
*       2 DVTBASE,                  /* Basic data for DVT entry      */         
*        3 DVTVOLI   CHAR(6),       /* VOLSER                        */         
*        3 DVTENIDX  FIXED(16),     /* Reserved                  @81C*/         
*        3 DVTDEVNR  FIXED(16),     /* Device number in hex format   */         
*        3 DVTPREVI  FIXED(16),     /* Reserved                  @81C*/         
*       2 DVTEXTEN,                 /* Extended data for DVT entry   */         
*        3 DVTSMPCT  FIXED(31),     /* Number of valid samples       */         
*        3 DVTSMPNR  FIXED(31),     /* Sample sequence number        */         
*        3 DVTFLAG1  BIT(8),        /* Device type indicator    @A04C*/         
*                                                              /*@P1D*/         
*          5 DVTMEXPO BIT(1),       /* Reserved                  @81C*/         
*          5 DVTDACC  BIT(1),       /* DASD device              @A04C*/         
*          5 DVTTAPE  BIT(1),       /* tape device              @A04C*/         
*          5 DVTNXC BIT(1),         /* number of alias exposures                
*                                      changed for a PAV device @A04C*/         
*          5 DVTRVDEV BIT(1),       /* virtual DASD             @A04C*/         
*          5 DVTALTCU BIT(1),       /* Reserved                  @81C*/         
*          5 DVTLCUVA BIT(1),       /* LCU number is valid      @A04C*/         
*          5 DVTMXPAV BIT(1),       /* Multiple exposure (PAV)                  
*                                      device                   @A04C*/         
*        3 DVTFLAG2  BIT(8),        /* Device storage indicators                
*                                                               @A04C*/         
*          5 DVTCMBFI BIT(1),       /* CMB data stored as                       
*                                      begin time value         @A04C*/         
*          5 DVTCMBLA BIT(1),       /* CMB data stored as                       
*                                      end time value           @A04C*/         
*          5 DVTSTSFI BIT(1),       /* STSCH data stored as                     
*                                      begin time value         @A04C*/         
*          5 DVTSTSLA BIT(1),       /* STSCH data stored as                     
*                                      end time value           @A04C*/         
*          5 DVTPLPA  BIT(1),       /* This device has PLPA                     
*                                      page datasets            @A04C*/         
*          5 DVTCOMM  BIT(1),       /* This device has COMMON                   
*                                      page datasets            @A04C*/         
*          5 DVTLOCL  BIT(1),       /* This device has LOCAL                    
*                                      page datasets            @A04C*/         
*          5 DVTSWAP  BIT(1),       /* Always OFF. Swap data sets no            
*                                      longer supported          @K2C*/         
*        3 DVTMEXNR  FIXED(15),     /* Number of exposures including            
*                                      the base exposure             */         
*        3 DVTTIMFI BDY(WORD),      /* Time values first         @K1C*/         
*                                                              /*@K1C*/         
*          5 DVTDISIF FIXED(32),    /* Native Device disconnect                 
*                                      time first            @OA05197*/         
*          5 DVTPETIF FIXED(32),    /* Native Device pending                    
*                                      time first            @OA05197*/         
*          5 DVTCOTIF FIXED(32),    /* Native Device connect                    
*                                      time first            @OA05197*/         
*                                                              /*@K1D*/         
*          5 DVTDVBIF FIXED(32),    /* Device busy delay time first             
*                                                                @K1C*/         
*          5 DVTCUBIF FIXED(32),    /* No longer used            @K1C*/         
*        3 DVTTIMLA BDY(WORD),      /* Time values last          @K1C*/         
*                                                              /*@K1D*/         
*          5 DVTDISIL FIXED(32),    /* Native Device disconnect                 
*                                      time last             @OA05197*/         
*          5 DVTPETIL FIXED(32),    /* Native Device pending                    
*                                      time last             @OA05197*/         
*          5 DVTCOTIL FIXED(32),    /* Native Device connect                    
*                                      time last             @OA05197*/         
*                                                              /*@K1D*/         
*          5 DVTDVBIL FIXED(32),    /* Device busy delay time last              
*                                                                @K1C*/         
*          5 DVTCUBIL FIXED(32),    /* No longer used            @K1C*/         
*        3 DVTTYP CHAR(4),          /* Device type                              
*                                      (mapped by UCBTYPES macro)    */         
*        3 DVTIDEN CHAR(8),         /* Device identification (device            
*                                      model)                    @Y1A*/         
*        3 DVTCUID CHAR(8),         /* Control unit model        @Y1A*/         
*                                   /*                          5@Q1D*/         
*        3 DVTSPBIF FIXED(32),      /* No longer used            @K1C*/         
*        3 DVTSPBIL FIXED(32),      /* No longer used            @K1C*/         
*        3 DVTIOQLC FIXED(32),      /* I/O queue length count                   
*                                                                @B1A*/         
*        3 DVTSAMPA FIXED(32),      /* Accumulated I/O instruction              
*                                      count                     @B1A*/         
*        3 *        FIXED(16),      /* No longer used            @K1C*/         
*        3 DVTLCUNR FIXED(16),      /* LCU number                @E1C*/         
*        3 DVTSAMPP FIXED(32),      /* I/O instruction count previous           
*                                      value                     @K1C*/         
*        3 DVTCMRIF FIXED(32),      /* Initial command response time            
*                                      first                     @K1A*/         
*        3 DVTCMRIL FIXED(32),      /* Initial command response time            
*                                      last                      @K1A*/         
*        3 DVTCUQTP FIXED(32),      /* Control unit queuing                     
*                                      time previous value   @OA05197*/         
*        3 DVTCUQTN FIXED(32),      /* Accumulated control unit                 
*                                      queuing time for devices                 
*                                      not connected to                         
*                                      FICON channel         @OA05197*/         
*        3 DVTCUQTF FIXED(32),      /* Accumulated control unit                 
*                                      queuing time for devices                 
*                                      connected to FICON                       
*                                      channel               @OA05197*/         
*        3 DVTHPNUM FIXED(31),      /* Accumulated number of                    
*                                      HyperPAV aliases in each                 
*                                      cycle                     @01A*/         
*        3 DVTPSM   FIXED(31),      /* Number of successful PAV                 
*                                      samples                   @01A*/         
*        3 DVTFLAG3 BIT(8),         /* Flag byte                 @01A*/         
*          5 DVTHPAV BIT(1),        /* Device is a HyperPAV base                
*                                      device                    @01A*/         
*          5 DVTHWRT BIT(1),        /* Hyperwrite  requested on                 
*                                      this device               @81A*/         
*          5 *       BIT(6),        /* Reserved for future use   @81C*/         
*        3 DVTHPCON FIXED(8),       /* Configured HyperPAV                      
*                                      aliases for that LSS      @01A*/         
*        3 *        CHAR(3),        /* Reserved for future use   @61C*/         
*        3 DVTSSID FIXED(8),        /* Subchannel set            @61A*/         
*        3 DVTDEVN2 FIXED(16),      /* Device number same as                    
*                                      DVTDEVNR                  @61A*/         
*        3 DVTENIDX4 FIXED(32),     /* Entry index               @81A*/         
*        3 DVTPREVI4 FIXED(32),     /* Previous index            @81A*/         
*        3 DVTEND CHAR(0) BDY(WORD);/* Force word boundary           */         
*                                                                               
*%If IBM_CBGEN_PADI <> 'YES' %Then  /* Skip look up table with CBGEN            
*                                                               @A04A*/         
*%Do;                                                         /*@A04A*/         
*  DCL 1 DVLARRAY BASED BDY(WORD),  /* Device look up table          */         
*        3 DVLHEAD,                 /* Device lookup table header@W1A*/         
*          5 DVLDVLG3   CHAR(5),    /* Acronym DVLG3             @W1C*/         
*          5 DVLVERG3   CHAR(1),    /* Control block version     @W1C*/         
*          5 DVLENTLE   FIXED(15),  /* Length of one entry       @W1C*/         
*          5 DVLENTMX   FIXED(31),  /* Number of table entries                  
*                                      (Highest possible index is               
*                                      DVTENTMX-1)               @W1C*/         
*          5 DVLENTNR(0:3) FIXED(31),  /*                                       
*                                      Index of last filled entry@61C*/         
*                                                                               
*            7 * CHAR(1),           /* Not used                  @61A*/         
*            7 DVLSSID FIXED(8),    /* Subchannel set            @61A*/         
*            7 DVLDEVIC FIXED(16),  /* Device number             @61A*/         
*        3 DVLENTRY(0:*) CHAR(LENGTH(DVLG3));           /*       @C1C           
*                                      Device look up table entries  */         
*  DCL 1 DVLG3 BASED(DVLG3PTR) BDY(WORD),                      /*@Q1A*/         
*        3 DVLDVTCO FIXED(31),      /* Offset to current DVT entry              
*                                      (used by gatherer)        @Q1A*/         
*          5 DVLDVTCP FIXED(31),    /* DVTG3 entry pointer                      
*                                      (used within reporter)    @B2C*/         
*  %If DVT_ReporterOnly ^= 'YES' %Then %Do;               /*     @02A*/         
*        3 DVLTIMCY BDY(WORD),      /* CYCLE begin and end times @B2A*/         
*          5 DVLCMBCB,              /* CMB values at CYCLE begin @B2A*/         
*            7 DVLDISCB FIXED(32),  /* Native Disconnect time at                
*                                      CYCLE begin           @OA05197*/         
*            7 DVLPETCB FIXED(32),  /* Native Pending time (begin)              
*                                                            @OA05197*/         
*            7 DVLCOTCB FIXED(32),  /* Native Connect time (begin)              
*                                                            @OA05197*/         
*          5 DVLCMBCE,              /* CMB values at CYCLE end   @B2A*/         
*            7 DVLDISCE FIXED(32),  /* Native Device disconnect                 
*                                      time at CYCLE end     @OA05197*/         
*            7 DVLPETCE FIXED(32),  /* Native Pending time at                   
*                                      CYCLE end             @OA05197*/         
*            7 DVLCOTCE FIXED(32),  /* Native Connect time at                   
*                                      CYCLE end             @OA05197*/         
*        3 DVLUSCNT FIXED(31),      /* Usage correction counter (for            
*                                      USAGE/DELAY adjustment)   @K1C*/         
*        3 DVLCUQTN FIXED(32),      /* Cycle control unit                       
*                                      queuing time for devices                 
*                                      not connected to                         
*                                      FICON channel         @OA05197*/         
*        3 DVLCUQTF FIXED(32),      /* Cycle control unit                       
*                                      queuing time for devices                 
*                                      connected to FICON                       
*                                      channel               @OA05197*/         
*        3 *        CHAR(8);        /* For future use        @OA05197*/         
*  %End;                                                  /*     @02A*/         
*  %Else %Do;                                             /*     @02A*/         
*        3 *        CHAR(0);        /* End of entry              @02A*/         
*  %End;                                                  /*     @02A*/         
*%End;                              /* Skip look up table with CBGEN            
*                                                               @A04A*/         
*                                                                               
*/************************************************************13@A04A*/         
*@LOGIC;                                                                        
*#PRAGMA TOOL=CBGEN.                                                            
*#ALIGNOP.                                                                      
*#NOTUPPER.                                                                     
*#NOLEN.                                                                        
*/* internal use */                                                             
*#DELETE.DVLVERCB                                                               
*#DELETE.DVTVER_SSID                                                            
*#DELETE.DVTVER_zHyperwrite                                                     
*#DELETE.DVTSWAP                                                                
*/**/                                                                           
*#EPRAGMA.                                                                      
*#PRAGMA TOOL=PADI.                                                             
*#EPRAGMA.                                                                      
*@ENDLOGIC;                                                                     
*/* End of PL/X Source                                               */         
* %IF ERBDVTG3_LIST = 'NO' !                                                    
*    ZCBPRINT = 'NO' %THEN                                                      
* %DO;                                                                          
*   @LIST POP NOECHO;                                                           
* %END;                                                                         
* %END;                                                                         
