*                                                                               
* %DCL ERBDSRAA_INCLUDED CHAR EXT;                                              
* %DEACTIVATE ERBDSRAA_INCLUDED;                                                
* %IF ERBDSRAA_INCLUDED = '' %THEN                                              
* %DO;                                                                          
*/* Macro made bi-lingual on 21194. CBGEN compile date 21138         */         
*% /*                                                                           
         MACRO                                                                  
         ERBDSRAA &DSECT=YES,&LIST=YES,&TITLE=YES,&ERBRAHDR=YES,       *        
               &ERBRASYS=COND,&ERBRRDAT=COND                                    
         GBLC  &ERBDSRAA_INCLUDED                                               
         GBLC  &ZCBPRINT                                                        
&ERBDSRAA_INCLUDED SETC 'YES'                                                   
         AIF   ('&LIST' EQ 'NONE').P0                                           
         AIF   ('&TITLE' EQ 'NO').P5                                            
 TITLE   'ERBDSRAA  - Data Server ERBDSREC Service Answer Area   '              
.P5      ANOP                                                                   
**/ ;                                                                           
*/* START OF SPECIFICATIONS ******************************************/         
*/*                                                                  */         
*/*01* PROPRIETARY STATEMENT:                                        */         
*/*       Licensed Materials - Property of IBM                   @61A*/         
*/*       "Restricted Materials of IBM"                          @61A*/         
*/*       Copyright IBM Corp. 1993, 2021                             */         
*/*                                                                  */         
*/*       Status: z/OS V2R5 Data Gatherer (HRG77D0)                  */         
*/*                                                                  */         
*/*01* DESCRIPTIVE-NAME:  Data Server ERBDSREC Service Answer Area   */         
*/*                                                             @A02C*/         
*/*01* MACRO-NAME:  ERBDSRAA                                         */         
*/*                                                                  */         
*/*01* DSECT NAME:                                                   */         
*/*02*   ERBRAHDR                                                    */         
*/*02*   ERBRASYS                                                    */         
*/*02*   ERBRSDAT                                                    */         
*/*                                                                  */         
*/*01* COMPONENT:  zOS Data Gatherer (27401)                         */         
*/*                                                                  */         
*/*01* EYE-CATCHER:  DSRA                                            */         
*/*                                                                  */         
*/*01* STORAGE ATTRIBUTES:                                           */         
*/*02*   SUBPOOL:           Any                                      */         
*/*02*   KEY:               Any                                      */         
*/*02*   RESIDENCY:         Any                                      */         
*/*02*   MAIN STORAGE:      N/A                                      */         
*/*02*   AUXILIARY STORAGE: N/A                                      */         
*/*02*   VIRTUAL STORAGE:   N/A                                      */         
*/*                                                                  */         
*/*01* SIZE:                                                         */         
*/*            ERBRAHDR -- X'0030' bytes                             */         
*/*            ERBRASYS -- X'000F' bytes                             */         
*/*            ERBRRDAT -- X'0018' bytes                             */         
*/*                                                                  */         
*/*01* POINTED TO BY:                                                */         
*/*      Answer area pointer (first parameter of callable service)   */         
*/*      Answer area ALET   (second parameter of callable service)   */         
*/*                                                                  */         
*/*01* SERIALIZATION:                                                */         
*/*      None                                                        */         
*/*                                                                  */         
*/*01* FUNCTION:                                                     */         
*/*02*   This macro defines the Sysplex Data Service ERBDSREC   @A02C*/         
*/*      mapping declarations for the answer area layout.            */         
*/*                                                                  */         
*/*01* METHOD OF ACCESS:                                             */         
*/*02*   BAL: ERBDSRAA                                          @A02C*/         
*/*                                                                  */         
*/*02*   PL/X:                                                       */         
*/*        %DECLARE ERBDSLST CHAR EXTERNAL                           */         
*/*        %ERBDSLST = 'NO'              (without macro listing)     */         
*/*                                                                  */         
*/*        %INCLUDE SYSLIB(ERBDSRAA)                                 */         
*/*                                                                  */         
*/*01* FREQUENCY:                                                    */         
*/*      Once                                                        */         
*/*                                                                  */         
*/*01* DEPENDENCIES:  None                                           */         
*/*                                                                  */         
*/*01* DISTRIBUTION LIBRARY:                                         */         
*/*      AGRBMAC1                                               @A02C*/         
*/*                                                                  */         
*/*01* CHANGE ACTIVITY:                                              */         
*/*      $C0=RSDS,HRM4440,,DK: RMF Sysplex Data Server               */         
*/*      $E1=RSDS,HRM5530,,DK: RMF Sysplex Data Server           @E1A*/         
*/*      $61=R790,HRM7790,,MWe: explicit copyright for ext. macro@61A*/         
*/*      $62=R790,HRM7790,,JKu: Make macro bilingual             @62A*/         
*/*      $A01=Split,OA58759,,JBa: RMF Product Split             @A01A*/         
*/*      $A02=ZOSB,HRG77D0,,JDo: Bilingual macros with cbgen    @A02A*/         
*/*                                                                  */         
*/* END OF SPECIFICATIONS ********************************************/         
*% /*                                                                           
.P0      ANOP                                                                   
         AIF   ('&ZCBPRINT' EQ 'NO').P1                                         
         AIF   ('&LIST' EQ 'YES').P2                                            
.P1      ANOP                                                                   
         PUSH  PRINT                                                            
         PRINT OFF                                                              
.P2      ANOP                                                                   
         AIF   ('&ERBRAHDR' EQ 'NO').L0002                                      
         AIF   ('&DSECT' EQ 'YES').L0003                                        
         AIF   ('&ERBRAHDR' NE 'YES').L0002                                     
.L0003   ANOP                                                                   
*                                                                               
* ********************************************************************          
* *                                                                  *          
* * ERBDSREC - Answer Area Header and System List                    *          
* *                                                                  *          
* ********************************************************************          
*                                                                               
*                                                                               
         AIF   ('&DSECT' EQ 'YES').L0004                                        
ERBRAHDR DS    0F                  Answer area header section                   
         AGO   .L0005                                                           
.L0004   ANOP                                                                   
ERBRAHDR DSECT                     Answer area header section                   
.L0005   ANOP                                                                   
ERBRANAM DS    CL4                 Answer area acronym                          
ERBRAVER DS    F                   Answer area version                          
ERBRALEN DS    F                   Total length of data returned on    *        
                                   this call                                    
ERBRATLN DS    F                   Total length of answer area needed  *        
                                   to contain all the requested        *        
                                   information                                  
ERBRAPLX DS    CL8                 Name of the sysplex the request is  *        
                                   running on                                   
ERBRASOF DS    F                   Offset from xxxxxHDR to the first   *        
                                   yyyyySYS system entry                        
ERBRASLN DS    F                   Length of a yyyyySYS system entry            
ERBRASNO DS    F                   Number of yyyyySYS system entries            
ERBRADOF DS    F                   Offset from xxxxxHDR to the first   *        
                                   zzzzzDAT data record                         
ERBRADLN DS    F                   Length of a zzzzzDAT data record             
ERBRADNO DS    F                   Number of zzzzzDAT data records              
ERBRAHDR_LEN EQU *-ERBRAHDR                                                     
.L0002   ANOP                                                                   
         AIF   ('&ERBRASYS' EQ 'NO').L0006                                      
         AIF   ('&DSECT' EQ 'YES').L0007                                        
         AIF   ('&ERBRASYS' NE 'YES').L0006                                     
.L0007   ANOP                                                                   
*                                                                               
*  --------------------------------------------------------------------         
*endif                              // End skipping PLX                         
*/-------------------------------------------------------------------           
*                                                                               
*                                                                               
         AIF   ('&DSECT' EQ 'YES').L0008                                        
ERBRASYS DS    0X                  Answer Area System List                      
         AGO   .L0009                                                           
.L0008   ANOP                                                                   
ERBRASYS DSECT                     Answer Area System List                      
.L0009   ANOP                                                                   
ERBRASNM DS    CL8                 MVS system name                              
ERBRASID DS    CL4                 SMF system id                                
ERBRARMF DS    BL4                 z/OS DG status information                   
*  Bit definitions:                                                             
ERBRASDS EQU   X'80'               Sysplex Data Server active                   
ERBRASMF EQU   X'40'               SMF Data Buffer active                       
ERBRAIII EQU   X'20'               Monitor III active                           
ERBRAXDS EQU   X'10'               Sysplex Data Req sent                        
ERBRAXDR EQU   X'08'               Sysplex Data received                        
ERBRAMST EQU   X'04'               master status                                
ERBRAMAL EQU   X'02'               master allow                                 
         DS    B                   Reserved                                     
ERBRAREL_REPLACED DS 0X                                                         
         ORG   ERBRARMF+X'00000002'                                             
ERBRAREL DS    BL2                 z/OS DG release (x'nnnF')           *        
                                   (same format as STGSRREL)                    
         ORG   ERBRAREL_REPLACED+2                                              
ERBRASYS_LEN EQU *-ERBRASYS                                                     
.L0006   ANOP                                                                   
         AIF   ('&ERBRRDAT' EQ 'NO').L000A                                      
         AIF   ('&DSECT' EQ 'YES').L000B                                        
         AIF   ('&ERBRRDAT' NE 'YES').L000A                                     
.L000B   ANOP                                                                   
*                                                                               
*  --------------------------------------------------------------------         
*endif                              // End skipping PLX                         
*/-------------------------------------------------------------------           
*                                                                               
*                                                                               
         AIF   ('&DSECT' EQ 'YES').L000C                                        
ERBRRDAT DS    0F                  ERBDSREC SMF Data Section                    
         AGO   .L000D                                                           
.L000C   ANOP                                                                   
ERBRRDAT DSECT                     ERBDSREC SMF Data Section                    
.L000D   ANOP                                                                   
ERBRRHDR DS    CL24                data header for SMF data                     
         ORG   ERBRRHDR                                                         
ERBRRLEN DS    F                   Length of this data entry                    
ERBRRHDL DS    F                   Length of this data header                   
ERBRRTNC DS    F                   data return code                             
         DS    F                                                                
ERBRRTOK DS    BL8                 record token                                 
ERBRRSMF DS    0C                  SMF record data                              
*                                                                               
* ********************************************************************          
* *                                                                  *          
* * ERBDSREC - Answer Area Constants                                 *          
* *                                                                  *          
* ********************************************************************          
*                                                                               
*                                                                               
ERBRAHDN EQU   C'DSRA'             Answer area acronym                          
ERBRAHDV EQU   1                   Answer area version                          
ERBRRDAT_LEN EQU *-ERBRRDAT                                                     
.L000A   ANOP                                                                   
         AIF   ('&ZCBPRINT' EQ 'NO').P3                                         
         AIF   ('&LIST' EQ 'YES').P4                                            
.P3      ANOP                                                                   
         POP   PRINT                                                            
.P4      ANOP                                                                   
.P_EXIT  ANOP                                                                   
         MEND                                                                   
**/ ;                                                                           
* %ERBDSRAA_INCLUDED = 'YES';                                                   
* %DCL ZCBPRINT CHAR EXT;                                                       
* %DEACTIVATE ZCBPRINT;                                                         
* %DCL ERBDSRAA_LIST CHAR EXT;                                                  
* %DEACTIVATE ERBDSRAA_LIST;                                                    
* %IF ERBDSRAA_LIST = 'NO' !                                                    
*    ZCBPRINT = 'NO' %THEN                                                      
* %DO;                                                                          
*   @LIST PUSH NOECHO;                                                          
*   @LIST NOASSEMBLE NOECHO;                                                    
*   @LIST OFF C NOECHO;                                                         
* %END;                                                                         
*/* Start of PL/X Source                                             */         
*  %DECLARE ERBDSLST CHAR EXTERNAL;                                             
*                                                                               
*  @LIST PUSH NOECHO;                                                           
*                                                                               
*  %IF ERBDSLST='NO' %THEN %DO;                                                 
*     @LIST OFF NOECHO;                                                         
*  %END;                                                                        
*                                                                               
*/********************************************************************/         
*/*                                                                  */         
*/* ERBDSREC - Answer Area Header and System List                    */         
*/*                                                                  */         
*/********************************************************************/         
*                                                                               
*  %DECLARE ERBDSPRF CHAR EXTERNAL; /* Header and System List prefix */         
*                                                                               
*  %ERBDSPRF = 'ERBRA';                                                         
*                                                                               
*  %INCLUDE SYSLIB(ERBDSCHD);       /* ERBDSREC Answer Area Header   */         
*                                                                               
*  %INCLUDE SYSLIB(ERBDSCSL);       /* ERBDSREC Answer Area System L */         
*                                                                               
*/********************************************************************/         
*/*                                                                  */         
*/* ERBDSREC - Answer Area SMF Data Section                          */         
*/*                                                                  */         
*/********************************************************************/         
*                                                                               
*%Declare ERBRRDAT_Attribute Char External;                    /*@E1A*/         
*%If ERBRRDAT_Attribute='' %Then %Do;                          /*@E1A*/         
*%ERBRRDAT_Attribute = 'BASED';                                /*@E1A*/         
*%End;                                                         /*@E1A*/         
*%Scan ERBRRDAT_Attribute;                                     /*@E1A*/         
*                                                              /*@E1A*/         
*DCL 1 ERBRRDAT                     /* ERBDSREC SMF Data Section                
*                                                               @A02C*/         
*           ERBRRDAT_Attribute,                                /*@E1C*/         
*      2 ERBRRHDR,                  /* data header for SMF data @A02C*/         
*                                                                               
*        3 ERBRRLEN FIXED(31),      /* Length of this data entry                
*                                                               @A02C*/         
*                                                                               
*        3 ERBRRHDL FIXED(31),      /* Length of this data header    */         
*                                                                               
*        3 ERBRRTNC FIXED(31),      /* data return code         @A02C*/         
*                                                                               
*        3 *        FIXED(31),      /*                               */         
*                                                                               
*        3 ERBRRTOK BIT(64),        /* record token             @A02C*/         
*                                                                               
*      2 ERBRRSMF CHAR(*);          /* SMF record data               */         
*                                                                               
*%Noscan ERBRRDAT_Attribute;                                   /*@E1A*/         
*                                                              /*@E1A*/         
*/********************************************************************/         
*/*                                                                  */         
*/* ERBDSREC - Answer Area Constants                                 */         
*/*                                                                  */         
*/********************************************************************/         
*                                                                               
*DCL ERBRAHDN CHAR(4)   CONSTANT('DSRA');     /* Answer area acronym */         
*DCL ERBRAHDV FIXED(31) CONSTANT(1);          /* Answer area version */         
*                                                                               
*/********************************************************************/         
*                                                                               
*@LOGIC;                                                                        
*#PRAGMA TOOL=CBGEN.                                                            
*#ALIGNOP.                                                                      
*#REPLACE.ERBRAREL                                                              
*         ORG   ERBRARMF+X'00000002'                                            
*ERBRAREL DS    BL2                 z/OS DG release (x'nnnF')         *         
*                                   (same format as STGSRREL)                   
*#EREPLACE.                                                                     
*#EPRAGMA.                                                                      
*#PRAGMA TOOL=PADI.                                                             
*#PADIDELETE.ERBRAREL_REPLACED                                                  
*#PADIDELETE.ERBRAHDR_LEN                                                       
*#PADIDELETE.ERBRASYS_LEN                                                       
*#PADIDELETE.ERBRRDAT_LEN                                                       
*#EPRAGMA.                                                                      
*@ENDLOGIC;                                                                     
*/* End of PL/X Source                                               */         
* %IF ERBDSRAA_LIST = 'NO' !                                                    
*    ZCBPRINT = 'NO' %THEN                                                      
* %DO;                                                                          
*   @LIST POP NOECHO;                                                           
* %END;                                                                         
* %END;                                                                         
