//**** START OF SPECIFICATIONS ***************************************/         
//*                                                                  */         
//*01* PROPRIETARY STATEMENT:                                        */         
//*       Licensed Materials - Property of IBM                   @61A*/         
//*       "Restricted Materials of IBM"                          @61A*/         
//*       Copyright IBM Corp. 1993, 2021                             */         
//*                                                                  */         
//*       Status: z/OS V2R5 Data Gatherer (HRG77D0)                  */         
//*                                                                  */         
//*01* DESCRIPTIVE-NAME:  Sysplex Data Services Answer Area Header   */         
//*                                                                  */         
//*01* MACRO-NAME:  ERBDSCHD                                         */         
//*                                                                  */         
//*01* DSECT NAME:                                                   */         
//*02*   xxxxxHDR (Prefix determined by prepr. var. in PLX)      @E2C*/         
//*02*   Erb3xhdr (Fixed for usage from C++)                     @E2C*/         
//*                                                                  */         
//*01* COMPONENT:  zOS Data Gatherer (27401)                         */         
//*                                                                  */         
//*01* EYE-CATCHER:  xxxx   (Determined by application)          @E2C*/         
//*                                                                  */         
//*01* STORAGE ATTRIBUTES:                                           */         
//*02*   SUBPOOL:           Any                                      */         
//*02*   KEY:               Any                                      */         
//*02*   RESIDENCY:         Any                                      */         
//*02*   MAIN STORAGE:      N/A                                      */         
//*02*   AUXILIARY STORAGE: N/A                                      */         
//*02*   VIRTUAL STORAGE:   N/A                                      */         
//*                                                                  */         
//*01* SIZE:                                                         */         
//*      48 bytes (xxxxxHDR)                                         */         
//*                                                                  */         
//*01* POINTED TO BY:                                                */         
//*      Answer area pointer (first parameter of callable service)   */         
//*      Answer area ALET   (second parameter of callable service)   */         
//*                                                                  */         
//*01* SERIALIZATION:                                                */         
//*      None                                                        */         
//*                                                                  */         
//*01* FUNCTION:                                                     */         
//*02*   This macro defines the Sysplex Data Services common    @A03C*/         
//*      mapping declarations for the answer area header layout.     */         
//*                                                                  */         
//*02*   The prefix and the eyecatcher are provided by the macros    */         
//*      that include this control block:                            */         
//*                                                                  */         
//*         ERBDSQAA - ERBDSQRY Answer Area                     @A03C*/         
//*         ERBDSRAA - ERBDSREC Answer Area                     @A03C*/         
//*         ERB3XDRH - ERB3XDRS Answer Area                     @A03C*/         
//*                                                                  */         
//*01* METHOD OF ACCESS:                                             */         
//*02*   PL/X:                                                       */         
//*        %DECLARE ERBDSPRF CHAR EXTERNAL                           */         
//*        %ERBDSPRF = 'XXXXX'              (header variable prefix) */         
//*                                                                  */         
//*        %INCLUDE SYSLIB(ERBDSCHD)                                 */         
//*                                                                  */         
//*02*   C++:                                                    @E2A*/         
//*        #include "erbdschd.mac"                               @E2A*/         
//*                                                                  */         
//*01* FREQUENCY:                                                    */         
//*      Once                                                        */         
//*                                                                  */         
//*01* DEPENDENCIES:  None                                           */         
//*                                                                  */         
//*01* DISTRIBUTION LIBRARY:                                         */         
//*      AGRBMAC1                                               @A03C*/         
//*                                                                  */         
//*01* CHANGE ACTIVITY:                                              */         
//*    $C0=RSDS,HRM5510,,DK: RMF Sysplex Data Server                 */         
//*    SWE: CHANGE SPA DEFINITION: INTERNAL TO EXTERNAL      @WA05017*/         
//*    $E1=RSDS,HRM5530,,DK: RMF Sysplex Data Server             @E1A*/         
//*    $E2=BIL,OW17898,,GBO: Mapping bilingual                   @E2A*/         
//*    $E3=IPM,HRM6603,,GBO: Changes for PLX FORMAT OFF          @E3A*/         
//*    $L1=TYPES,HRM7720,,GBO: Types                             @L1A*/         
//*    $61=R790,HRM7790,,MWe: explicit copyright for ext. macro  @61A*/         
//*    $A01=Split,OA58759,,JBa: RMF Product Split               @A01A*/         
//*    $A02=ZOSB,HRG77D0,,JBa: Rename prefix ERB to GRB         @A02A*/         
//*    $A03=ZOSB,HRG77D0,,JDo: Bilingual macros with cbgen      @A03A*/         
//*                                                                  */         
//**** END OF SPECIFICATIONS *****************************************/         
//*--------------------------------------------------------------------         
#ifndef ERBDSCHD_MAC                // Check, if already included  @E3A         
#define ERBDSCHD_MAC                // Include only once           @E3A         
#ifdef  __MVS__                     // MVS only                    @L1A         
#if (0==1)                          // Skip PLX code               @E3A         
//-------------------------------------------------------------------*/         
                                                                                
 %Declare ERBDSHDR_Attribute Char External; ]                      @E1A         
 %If ERBDSHDR_Attribute='' %Then %Do;       ]                      @E1A         
    %ERBDSHDR_Attribute = 'BASED';          ]                      @E1A         
 %End;                                      ]                      @E1A         
 %Scan ERBDSHDR_Attribute;                  ]                      @E1A         
                                                                                
 DECLARE                                                                        
    1 ERBDSPRF%%HDR                 ] Answer area header section   @E1C         
                 ERBDSHDR_Attribute,]                              @E1C         
                                                                                
      2 ERBDSPRF%%nam CHAR(4),      ] Answer area acronym                       
      2 ERBDSPRF%%ver FIXED(31),    ] Answer area version                       
      2 ERBDSPRF%%len FIXED(31),    ] Total length of data returned             
                                    ]    on this call                           
      2 ERBDSPRF%%tln FIXED(31),    ] Total length of answer area               
                                    ]    needed to contain all the              
                                    ]    requested information                  
      2 ERBDSPRF%%plx CHAR(8),      ] Name of the sysplex the                   
                                    ]    request is running on                  
      2 ERBDSPRF%%sof FIXED(31),    ] Offset from xxxxxHDR to the               
                                    ]    first yyyyySYS system entry            
      2 ERBDSPRF%%sln FIXED(31),    ] Length of a yyyyySYS system entry         
      2 ERBDSPRF%%sno FIXED(31),    ] Number of yyyyySYS system entries         
      2 ERBDSPRF%%dof FIXED(31),    ] Offset from xxxxxHDR to the               
                                    ]    first zzzzzDAT data record             
      2 ERBDSPRF%%dln FIXED(31),    ] Length of a zzzzzDAT data record          
      2 ERBDSPRF%%dno FIXED(31);    ] Number of zzzzzDAT data records           
                                                                                
 %Noscan ERBDSHDR_Attribute;        ]                              @E1A         
                                                                                
 @LIST PUSH;                        ] Push listing                 @E3C         
 @LIST OFF;                         ] Turn PLX listing off         @E3C         
                                                                                
 @LOGIC;                            ] PLX ignores logic            @E3C         
#endif                              // End skipping PLX code       @E3C         
#ifndef gpm_int31_t                 // FIXED(31)                   @L1A         
  #define gpm_int31_t int           //                                          
#endif                              //                                          
#ifndef gpm_uint16_t                // FIXED(16)                   @L1A         
 #define gpm_uint16_t unsigned short//                                          
#endif                              //                                          
#ifndef gpm_uint64_t                // FIXED(64) or STCK           @L1A         
  #define gpm_uint64_t unsigned long long //                                    
#endif                              //                                          
                                    //                                          
#include "erbdscsl.mac"             // Other Includes              @L1C         
#include "erb3xdrh.mac"             // Other Includes              @L1C         
#include "erbertr3.mac"             // Other Includes              @L1C         
#include "erbebtr3.mac"             // Other Includes              @L1C         
                                    //                                          
#pragma pack(1)                     // No alignment                @L1C         
                                    //                                          
typedef struct                      // Maps Answer Area header     @E2A         
{                                   //                                          
   char Erb3xnamÝ4¨;                // Answer area acronym         @E2A         
   gpm_int31_t Erb3xver;            // Answer area version         @E2A         
   gpm_int31_t Erb3xlen;            // Length of data returned     @E2A         
   gpm_int31_t Erb3xtln;            // Total length of answer area @E2A         
                                    // needed to contain all the   @E2A         
                                    // requested information       @E2A         
   char Erb3xplxÝ8¨;                // Name of the sysplex         @E2A         
                                    //                                          
                                    // System list follows:        @E2A         
   gpm_int31_t Erb3xsof;            // Offset to yyyyySYS entries  @E2A         
   gpm_int31_t Erb3xsln;            // Length of yyyyySYS entry    @E2A         
   gpm_int31_t Erb3xsno;            // Number of yyyyySYS entries  @E2A         
                                    //                                          
                                    // Data entries from Systems:  @E2A         
   gpm_int31_t Erb3xdof;            // Offset to yyyyyDAT entries  @E2A         
   gpm_int31_t Erb3xdln;            // Length of yyyyyDAT entry    @E2A         
   gpm_int31_t Erb3xdno;            // Number of yyyyyDAT entries  @E2A         
} Erb3xhdr;                         //                                          
                                    //                                          
#pragma pack(reset)                 // No aligment by compiler     @L1C         
                                    //                                          
#endif                              // ifdef __MVS__               @L1A         
#endif                              // ERBDSCHD_MAC                @E3C         
                                    //                                          
#if (0==1)                          // Skip PLX code               @E3C         
 @ENDLOGIC;                         ] End of C++ Code              @E3C         
 @LIST POP;                         ] Restore Listing              @E3C         
//*--------------------------------------------------------------------         
#endif                              // End skipping PLX            @E3A         
//-------------------------------------------------------------------*/         
