*                                                                               
* %DCL ERBDSIG3_INCLUDED CHAR EXT;                                              
* %DEACTIVATE ERBDSIG3_INCLUDED;                                                
* %IF ERBDSIG3_INCLUDED = '' %THEN                                              
* %DO;                                                                          
*/* Macro made bi-lingual on 21186. CBGEN compile date 21138         */         
*% /*                                                                           
         MACRO                                                                  
         ERBDSIG3 &DSECT=YES,&LIST=YES,&TITLE=YES,&DSIG3=YES,          *        
               &DSIGIND=COND                                                    
         GBLC  &ERBDSIG3_INCLUDED                                               
         GBLC  &ZCBPRINT                                                        
&ERBDSIG3_INCLUDED SETC 'YES'                                                   
         AIF   ('&LIST' EQ 'NONE').P0                                           
         AIF   ('&TITLE' EQ 'NO').P5                                            
 TITLE   'ERBDSIG3  - Mapping macro for Mon III Gatherer Data Set Heade*        
               r and Index  '                                                   
.P5      ANOP                                                                   
**/ ;                                                                           
*/****  START OF SPECIFICATIONS  *************************************/         
*/*                                                                  */         
*/*01* PROPRIETARY STATEMENT:                                   @A03C*/         
*/*       Licensed Materials - Property of IBM                       */         
*/*       "Restricted Materials of IBM"                              */         
*/*       Copyright IBM Corp. 1985, 2021                             */         
*/*                                                                  */         
*/*01* STATUS: z/OS V2R5 Data Gatherer (HRG77D0)                @A03M*/         
*/*                                                                  */         
*/*01* MACRO NAME: ERBDSIG3                                          */         
*/*                                                                  */         
*/*01* DESCRIPTIVE NAME:                                             */         
*/*    Mapping macro for Mon III Gatherer Data Set Header and Index  */         
*/*                                                             @A03C*/         
*/*                                                             @A03D*/         
*/*01* DSECT NAME: DSIG3                                             */         
*/*                                                                  */         
*/*01* COMPONENT: zOS Data Gatherer (27401)                          */         
*/*                                                                  */         
*/*01* EYE-CATCHER: DSIG3                                            */         
*/*02*     OFFSET:  0                                                */         
*/*02*     LENGTH:  5                                                */         
*/*                                                                  */         
*/*01* STORAGE ATTRIBUTES:                                           */         
*/*02*  SUBPOOL:   9 if located within data gatherer address space   */         
*/*                otherwise N/A                                     */         
*/*02*  KEY:       user                                              */         
*/*02*  RESIDENCY: Above 16 MB in virtual storage                    */         
*/*02*  MAIN STORAGE:      N/A                                       */         
*/*02*  AUXILIARY STORAGE: N/A                                       */         
*/*02*  VIRTUAL STORAGE:   N/A                                       */         
*/*                                                                  */         
*/*01* SIZE:                                                    @A03C*/         
*/*            DSIG3   -- X'0100' bytes                              */         
*/*            DSIGIND -- X'001C' bytes                              */         
*/*                                                                  */         
*/*01* POINTED TO BY: DSIG3PTR                                       */         
*/*                                                                  */         
*/*01* SERIALIZATION: NONE                                           */         
*/*                                                                  */         
*/*01* FUNCTION: This macro maps the Data Set Header and Index of    */         
*/*              the Monitor III gatherer Data Set Support.          */         
*/*                                                                  */         
*/*01* METHOD OF ACCESS:                                             */         
*/*     ASM:  ERBDSIG3                                          @A03A*/         
*/*     PL/X:                                                        */         
*/*         DSIG3 is addressed via the global gatherer data table,   */         
*/*         table GGDG3, field GGDDSIPT.                             */         
*/*         The base pointer DSIG3PTR must be defined:               */         
*/*         DCL DSIG3PTR PTR(31) semicolon                           */         
*/*         %INCLUDE SYSLIB(ERBDSIG3) semicolon                      */         
*/*                                                                  */         
*/*01* FREQUENCY: 1                                                  */         
*/*                                                                  */         
*/*01* DEPENDENCIES: NONE                                            */         
*/*                                                                  */         
*/*01* DISTRIBUTION LIBRARY: AGRBMAC1                           @A03C*/         
*/*                                                                  */         
*/*01* CHANGE ACTIVITY: SEE BELOW                                    */         
*/*                                                                  */         
*/* $Q0=DSSUP,HRM3402,,KLZ: Mapping macro for the DSIG3 table        */         
*/* $B1=COMP,HRM4430,,PFU: Compress/Decompress M III data        @B1A*/         
*/* $C1=GWLM3,HRM5510,,HOL: Workload Management - Monitor III    @C1A*/         
*/* FDL: Prevents VSAM errors on data sets greater than 2G   @OA10099*/         
*/* $A02=ZOSB,HRG77D0,,JBa: Rename prefix ERB to GRB            @A02A*/         
*/* $A03=ZOSB,HRG77D0,,JBa: Make macro bilingual                @A03A*/         
*/*                                                                  */         
*/****  END OF SPECIFICATIONS  ***************************************/         
*% /*                                                                           
.P0      ANOP                                                                   
         AIF   ('&ZCBPRINT' EQ 'NO').P1                                         
         AIF   ('&LIST' EQ 'YES').P2                                            
.P1      ANOP                                                                   
         PUSH  PRINT                                                            
         PRINT OFF                                                              
.P2      ANOP                                                                   
DSIG3CB  EQU   X'02'               DSIG3 control block version number           
         AIF   ('&DSIG3' EQ 'NO').L0002                                         
         AIF   ('&DSECT' EQ 'YES').L0003                                        
         AIF   ('&DSIG3' NE 'YES').L0002                                        
DSIG3    DS    0F                  Monitor III gatherer data set       *        
                                   Header and Index                             
         AGO   .L0004                                                           
.L0003   ANOP                                                                   
DSIG3    DSECT                     Monitor III gatherer data set       *        
                                   Header and Index                             
.L0004   ANOP                                                                   
DSIGFIX  DS    CL256               Header of DSIG3                              
         ORG   DSIGFIX                                                          
DSIDSIG3 DS    CL5                 Acronym 'DSIG3'                              
DSIGRMFV DS    CL1                 Control block version x'02'                  
DSIGID   DS    CL4                 System ID                                    
         DS    CL2                 Reserved                                     
DSIGTODC DS    CL8                 Time of data set creation                    
DSIGTODF DS    CL8                 Time stamp first set of samples              
DSIGTODL DS    CL8                 Time stamp last set of samples               
DSIGFSPT DS    F                   Offset of the begin of the first    *        
                                   set of samples                               
DSIGLSPT DS    F                   Offset of the begin of the last set *        
                                   of samples                                   
DSIGNEPT DS    F                   Offset of the begin of the next SS  *        
                                   or the next service policy to be    *        
                                   written                                      
DSIGFIPT DS    F                   Offset of the first index                    
DSIGLIPT DS    F                   Offset of the last index                     
DSIGNIPT DS    F                   Offset of the next index to be      *        
                                   written                                      
DSIGILEN DS    F                   Length of an index entry                     
DSIGINUS DS    F                   Number of current index to set of   *        
                                   samples                                      
DSIGTDSF DS    CL8                 Time stamp first policy                      
DSIGTDSL DS    CL8                 Time stamp last policy                       
DSIGFPPT DS    F                   Offset to the begin of the first    *        
                                   policy                                       
DSIGLPPT DS    F                   Offset to the begin of the last     *        
                                   policy                                       
DSIGFPIP DS    F                   Offset to the first policy index             
DSIGLPIP DS    F                   Offset to the last policy index              
DSIGNPIP DS    F                   Offset to the next policy index              
DSIGCIPN DS    F                   Current index number to policy               
DSIGFIPN DS    F                   First index number to policy                 
DSIGSPLX DS    CL8                 Sysplex-ID of this system                    
DSIGSPXD DS    CL32                Reserved for sysplex                         
         DS    CL104               Not used                                     
.L0002   ANOP                                                                   
         AIF   ('&DSIGIND' EQ 'NO').L0005                                       
         AIF   ('&DSECT' EQ 'YES').L0006                                        
         AIF   ('&DSIGIND' NE 'YES').L0005                                      
DSIGIND  DS    0F                  Data set index part                          
         AGO   .L0007                                                           
.L0006   ANOP                                                                   
DSIGIND  DSECT                     Data set index part                          
.L0007   ANOP                                                                   
DSIGTOD1 DS    CL8                 Time stamp begin set of samples or  *        
                                   service policy                               
DSIGTOD2 DS    CL8                 Time stamp end set of samples or    *        
                                   service policy                               
DSIGSBEG DS    F                   Offset from the begin of dataset to *        
                                   begin of set of samples or to begin *        
                                   of service policy                            
DSIGSLEN DS    F                   Length of the possibly compressed   *        
                                   set-of-samples or length of service *        
                                   policy as contained in SVPDLE                
DSIGFLG  DS    B                   Data set flags                               
*  Bit definitions:                                                             
DSIGSVPI EQU   X'80'               On = service policy index                    
         DS    CL3                 Not used                                     
DSIGEND  DS    0C                  Forces boundary                              
.L0005   ANOP                                                                   
         AIF   ('&ZCBPRINT' EQ 'NO').P3                                         
         AIF   ('&LIST' EQ 'YES').P4                                            
.P3      ANOP                                                                   
         POP   PRINT                                                            
.P4      ANOP                                                                   
.P_EXIT  ANOP                                                                   
         MEND                                                                   
**/ ;                                                                           
* %ERBDSIG3_INCLUDED = 'YES';                                                   
* %DCL ZCBPRINT CHAR EXT;                                                       
* %DEACTIVATE ZCBPRINT;                                                         
* %DCL ERBDSIG3_LIST CHAR EXT;                                                  
* %DEACTIVATE ERBDSIG3_LIST;                                                    
* %IF ERBDSIG3_LIST = 'NO' !                                                    
*    ZCBPRINT = 'NO' %THEN                                                      
* %DO;                                                                          
*   @LIST PUSH NOECHO;                                                          
*   @LIST NOASSEMBLE NOECHO;                                                    
*   @LIST OFF C NOECHO;                                                         
* %END;                                                                         
*/* Start of PL/X Source                                             */         
*                                                                               
*%IBM_CBGEN_PADI = '';                                        /*@A03A*/         
*%If IBM_CBGEN = 'YES' ! IBM_PADI = 'YES' %Then %Do;          /*@A03A*/         
*   %IBM_CBGEN_PADI = 'YES';                                  /*@A03A*/         
*%End;                                                        /*@A03A*/         
*                                                                               
*%If IBM_CBGEN <> 'YES' %Then %Do;                            /*@A03A*/         
*/********************************************************************/         
*/*                                                                  */         
*/*01* CREATED BY: GRB3GVSI                                          */         
*/*                                                                  */         
*/*01* DELETED BY: GRB3GTER                                          */         
*/*                                                                  */         
*/*01* NOTES:                                                        */         
*/*                                                                  */         
*/*     With control block version '02'x the dataset index header    */         
*/*     has been extended. There are additional fields that allow    */         
*/*     to control indices for service policys SVPG3. The index      */         
*/*     elements themselves are unchanged.                           */         
*/*     Using the index elements only in order to access one or      */         
*/*     more set-of-samples does still work. The highest used        */         
*/*     index for set-of-samples is DSIGINUS.                    @C1A*/         
*/*                                                                  */         
*/**************************************************************@A03M*/         
*%End;                                                        /*@A03A*/         
*                                                                               
*   DCL                                                                         
*     DSIG3CB  BIT(8)  CONSTANT('02'X), /* DSIG3 control block                  
*                                          version number        @C1C*/         
*     DSIGV1CB BIT(8)  CONSTANT('01'X), /* DSIG3 control block                  
*                                          version '01'x         @C1A*/         
*     DSIGV1FL FIXED(31) CONSTANT(OFFSET(DSIGLPPT)), /* Length of               
*                                     DSIGFIX for version '01'x  @C1A*/         
*     DSIGPICF FIXED(31) CONSTANT(50);  /* Number indices reserved for          
*                                     service policy             @C1A*/         
*                                                                               
*   DCL 1 DSIG3  BASED(DSIG3PTR) BDY(WORD), /* Monitor III gatherer             
*                                     data set Header and Index      */         
*         3 DSIGFIX,               /* Header of DSIG3                */         
*          5 DSIDSIG3  CHAR(5),    /* Acronym 'DSIG3'                */         
*          5 DSIGRMFV  CHAR(1),    /* Control block version x'02'    */         
*          5 DSIGID    CHAR(4),    /* System ID                      */         
*          5 *         CHAR(2),    /* Reserved                       */         
*          5 DSIGTODC  CHAR(8),    /* Time of data set creation      */         
*          5 DSIGTODF  CHAR(8),    /* Time stamp first set of samples*/         
*          5 DSIGTODL  CHAR(8),    /* Time stamp last set of samples */         
*          5 DSIGFSPT  FIXED (32), /* Offset of the begin of the                
*                                     first set of samples   @OA10099*/         
*          5 DSIGLSPT  FIXED (32), /* Offset of the begin of the                
*                                     last set of samples    @OA10099*/         
*          5 DSIGNEPT  FIXED (32), /* Offset of the begin of the                
*                                     next SS or the next service               
*                                     policy to be written   @OA10099*/         
*          5 DSIGFIPT  FIXED (31), /* Offset of the first index      */         
*          5 DSIGLIPT  FIXED (31), /* Offset of the last index       */         
*          5 DSIGNIPT  FIXED (31), /* Offset of the next index                  
*                                     to be written                  */         
*          5 DSIGILEN  FIXED (31), /* Length of an index entry       */         
*          5 DSIGINUS  FIXED (31), /* Number of current index to                
*                                     set of samples             @C1C*/         
*          5 DSIGTDSF  CHAR(8),    /* Time stamp first policy    @C1C*/         
*          5 DSIGTDSL  CHAR(8),    /* Time stamp last policy     @C1C*/         
*          5 DSIGFPPT  FIXED (32), /* Offset to the begin of the                
*                                     first policy           @OA10099*/         
*          5 DSIGLPPT  FIXED (32), /* Offset to the begin of the                
*                                     last policy            @OA10099*/         
*          5 DSIGFPIP  FIXED (31), /* Offset to the first policy                
*                                     index                      @C1A*/         
*          5 DSIGLPIP  FIXED (31), /* Offset to the last policy                 
*                                     index                      @C1A*/         
*          5 DSIGNPIP  FIXED (31), /* Offset to the next policy                 
*                                     index                      @C1A*/         
*          5 DSIGCIPN  FIXED (31), /* Current index number to                   
*                                     policy                     @C1A*/         
*          5 DSIGFIPN  FIXED (31), /* First index number to                     
*                                     policy                     @C1A*/         
*          5 DSIGSPLX  CHAR(8),    /* Sysplex-ID of this system  @C1A*/         
*          5 DSIGSPXD  CHAR(32),   /* Reserved for sysplex       @C1A*/         
*          5 *         CHAR(104),  /* Not used                   @C1A*/         
*                                                                               
*      1 DSIGIND (1:*)  BASED,     /* Data set index part            */         
*        3 DSIGTOD1    CHAR(8),    /* Time stamp begin set of samples           
*                                     or service policy          @C1C*/         
*        3 DSIGTOD2    CHAR(8),    /* Time stamp end set of samples             
*                                     or service policy          @C1C*/         
*        3 DSIGSBEG    FIXED (32), /* Offset from the begin of dataset          
*                                     to begin of set of samples or to          
*                                     begin of service policy                   
*                                                            @OA10099*/         
*        3 DSIGSLEN    FIXED (31), /* Length of the possibly                    
*                                     compressed set-of-samples or              
*                                     length of service policy as               
*                                     contained in SVPDLE        @C1C*/         
*        3 DSIGFLG     BIT(8),     /* Data set flags                 */         
*          5 DSIGSVPI   BIT(1),    /* On = service policy index  @C1C*/         
*          5 *          BIT(7),    /* Not used                       */         
*        3    *        CHAR(3),    /* Not used                       */         
*        3 DSIGEND     CHAR(0)     /* Forces boundary                */         
*                    BDY(WORD);                                                 
*                                                                               
*/************************************************************12@A03A*/         
*@LOGIC;                                                                        
*#PRAGMA TOOL=CBGEN.                                                            
*#ALIGNOP.                                                                      
*#NOTUPPER.                                                                     
*#NOLEN.                                                                        
*/* internal use */                                                             
*#DELETE.DSIGV1CB                                                               
*#DELETE.DSIGV1FL                                                               
*#DELETE.DSIGPICF                                                               
*/**/                                                                           
*#EPRAGMA.                                                                      
*#PRAGMA TOOL=PADI.                                                             
*#EPRAGMA.                                                                      
*@ENDLOGIC;                                                                     
*/* End of PL/X Source                                               */         
* %IF ERBDSIG3_LIST = 'NO' !                                                    
*    ZCBPRINT = 'NO' %THEN                                                      
* %DO;                                                                          
*   @LIST POP NOECHO;                                                           
* %END;                                                                         
* %END;                                                                         
