*                                                                               
* %DCL ERBENTG3_INCLUDED CHAR EXT;                                              
* %DEACTIVATE ERBENTG3_INCLUDED;                                                
* %IF ERBENTG3_INCLUDED = '' %THEN                                              
* %DO;                                                                          
*/* Macro made bi-lingual on 21189. CBGEN compile date 21138         */         
*% /*                                                                           
         MACRO                                                                  
         ERBENTG3 &DSECT=YES,&LIST=YES,&TITLE=YES,&ENTARRAY=YES,       *        
               &ENTG3=COND                                                      
         GBLC  &ERBENTG3_INCLUDED                                               
         GBLC  &ZCBPRINT                                                        
&ERBENTG3_INCLUDED SETC 'YES'                                                   
         AIF   ('&LIST' EQ 'NONE').P0                                           
         AIF   ('&TITLE' EQ 'NO').P5                                            
 TITLE   'ERBENTG3  - Mapping macro for Mon III Data Gatherer ENQ Name *        
               Table Entry   '                                                  
.P5      ANOP                                                                   
**/ ;                                                                           
*/****  START OF SPECIFICATIONS  *************************************/         
*/*                                                                  */         
*/*01* PROPRIETARY STATEMENT:                                   @A03A*/         
*/*       Licensed Materials - Property of IBM                       */         
*/*       "Restricted Materials of IBM"                              */         
*/*       Copyright IBM Corp. 1983, 2021                             */         
*/*                                                                  */         
*/*       Status: z/OS V2R5 Data Gatherer (HRG77D0)             @A03M*/         
*/*                                                                  */         
*/* MACRO NAME: ERBENTG3                                        @A03C*/         
*/*                                                                  */         
*/* DESCRIPTIVE NAME:                                                */         
*/*   Mapping macro for Mon III Data Gatherer ENQ Name Table Entry   */         
*/*                                                             @A03C*/         
*/*                                                                  */         
*/*                                                                  */         
*/* FUNCTION = THIS MACRO MAPS THE MON III DATA GATHERER             */         
*/*            ENQ NAME TABLE ENTRY AND THE ENQ NAME LOOK UP TABLE.  */         
*/*            EACH ENQ USE/WAIT RECORD HAS STORED AN INDEX TO THE   */         
*/*            RELATED ENTRY IN THIS TABLE.                          */         
*/*                                                                  */         
*/*01* SIZE:                                                    @A03A*/         
*/*            ENTARRAY -- X'0040' bytes                             */         
*/*            ENTG3    -- X'0030' bytes                             */         
*/*                                                                  */         
*/*01* MODULE TYPE = MACRO                                      @A03C*/         
*/*                                                                  */         
*/* PROCESSOR   = ASM or PL/X                                   @A03C*/         
*/*                                                                  */         
*/*01* METHOD OF ACCESS:                                        @A03C*/         
*/*                                                                  */         
*/*    ENTG3 IS DECLARED AS A BASED STRUCTURE,                       */         
*/*    ENTG3PTR SHOULD BE DECLARED                                   */         
*/*                                                                  */         
*/*01* METHOD OF INVOCATION:                                    @A03C*/         
*/*                                                                  */         
*/*    ASM  - ERBENTG3                                          @A03A*/         
*/*                                                                  */         
*/*    PL/X - PERCENT INCLUDE SYSLIB(ERBENTG3) SEMICOLON        @A03C*/         
*/*                                                                  */         
*/* CHANGE ACTIVITY = SEE BELOW                                      */         
*/* $M0=MONIIIG,HRM3202,,PFU: MAPPING MACRO FOR ENQUEUE NAME TABLE   */         
*/* $Q1=PERI,HRM3402,,PFU: Performance improvements              @Q1A*/         
*/* $W1=PLAS,HRM4410,,MLN: PLAS Conversion                       @W1A*/         
*/* $E1=GRS,HRM6602,,PFU: GRS Star support                       @E1A*/         
*/* $A02=ZOSB,HRG77D0,,JBa: Rename prefix ERB to GRB            @A02A*/         
*/* $A03=ZOSB,HRG77D0,,JBa: Make macro bilingual                @A03A*/         
*/*                                                                  */         
*/****  END OF SPECIFICATIONS  ***************************************/         
*% /*                                                                           
.P0      ANOP                                                                   
         AIF   ('&ZCBPRINT' EQ 'NO').P1                                         
         AIF   ('&LIST' EQ 'YES').P2                                            
.P1      ANOP                                                                   
         PUSH  PRINT                                                            
         PRINT OFF                                                              
.P2      ANOP                                                                   
ENTVERCB EQU   X'02'               Control block version number.                
         AIF   ('&ENTARRAY' EQ 'NO').L0002                                      
         AIF   ('&DSECT' EQ 'YES').L0003                                        
         AIF   ('&ENTARRAY' NE 'YES').L0002                                     
ENTARRAY DS    0F                  Enq Name Table                               
         AGO   .L0004                                                           
.L0003   ANOP                                                                   
ENTARRAY DSECT                     Enq Name Table                               
.L0004   ANOP                                                                   
ENTHEAD  DS    CL16                ENQ name table header                        
         ORG   ENTHEAD                                                          
ENTENTG3 DS    CL5                 Acronym ENTG3                                
ENTVERG3 DS    CL1                 Control block version X'02'                  
ENTHDRLE DS    X                   Length of ENTG3 header                       
ENTENTLE DS    X                   Length of one entry                          
ENTENTMX DS    F                   Number of table entries                      
ENTENTNR DS    F                   Index of last filled entry (Highest *        
                                   possible index is ENTENTMX)                  
ENTENTRY DS    CL48                Entries in the ENTG3 table.                  
.L0002   ANOP                                                                   
         AIF   ('&ENTG3' EQ 'NO').L0005                                         
         AIF   ('&DSECT' EQ 'YES').L0006                                        
         AIF   ('&ENTG3' NE 'YES').L0005                                        
ENTG3    DS    0F                  ENQ NAME DATA FIELDS USED                    
         AGO   .L0007                                                           
.L0006   ANOP                                                                   
ENTG3    DSECT                     ENQ NAME DATA FIELDS USED                    
.L0007   ANOP                                                                   
ENTBASE  DS    CL2                 ENQ NAME entry index.                        
         ORG   ENTBASE                                                          
ENTENIDX DS    H                   ENQ NAME table entry index                   
ENTRESNM DS    CL45                ENQ NAME NUMBER                              
         ORG   ENTRESNM                                                         
ENTMAJNA DS    CL8                 MAJOR NAME OF THIS RESOURCE                  
ENTMINNA DS    CL36                MINOR NAME OF THIS RESOURCE                  
ENTSCOPE DS    B                   SCOPE OF THIS RESOURCE                       
*  Bit definitions:                                                             
ENTSYS   EQU   X'80'               SYSTEM SCOPE (1 = SYSTEM, 0 =       *        
                                   NONSYSTEM)                                   
ENTSYSS  EQU   X'40'               SYSTEMS SCOPE (1 = SYSTEMS, 0 =     *        
                                   NONSYSTEMS)                                  
ENTGLBL  EQU   X'10'               GLOBAL RESOURCE INDICATOR (1 =      *        
                                   GLOBAL, 0 = LOCAL)                           
ENTBIT1  EQU   X'08'               RESERVED                                     
ENTBIT2  EQU   X'04'               RESERVED                                     
ENTBIT3  EQU   X'02'               RESERVED                                     
ENTBIT4  EQU   X'01'               RESERVED                                     
         ORG   ENTRESNM+45                                                      
ENTFLAGS DS    B                   Additional flags                             
*  Bit definitions:                                                             
ENTRNLS  EQU   X'80'               ON = This resource has suspended    *        
                                   Jobs. This flag is valid only       *        
                                   during data gathering. It is not    *        
                                   meaningful within reporter.                  
         ORG   ENTFLAGS+1                                                       
ENTEND   DS    0C                  Force word boundary                          
.L0005   ANOP                                                                   
         AIF   ('&ZCBPRINT' EQ 'NO').P3                                         
         AIF   ('&LIST' EQ 'YES').P4                                            
.P3      ANOP                                                                   
         POP   PRINT                                                            
.P4      ANOP                                                                   
.P_EXIT  ANOP                                                                   
         MEND                                                                   
**/ ;                                                                           
* %ERBENTG3_INCLUDED = 'YES';                                                   
* %DCL ZCBPRINT CHAR EXT;                                                       
* %DEACTIVATE ZCBPRINT;                                                         
* %DCL ERBENTG3_LIST CHAR EXT;                                                  
* %DEACTIVATE ERBENTG3_LIST;                                                    
* %IF ERBENTG3_LIST = 'NO' !                                                    
*    ZCBPRINT = 'NO' %THEN                                                      
* %DO;                                                                          
*   @LIST PUSH NOECHO;                                                          
*   @LIST NOASSEMBLE NOECHO;                                                    
*   @LIST OFF C NOECHO;                                                         
* %END;                                                                         
*/* Start of PL/X Source                                             */         
*                                                                               
*%IBM_CBGEN_PADI = '';                                        /*@A03A*/         
*%If IBM_CBGEN = 'YES' ! IBM_PADI = 'YES' %Then %Do;          /*@A03A*/         
*   %IBM_CBGEN_PADI = 'YES';                                  /*@A03A*/         
*%End;                                                        /*@A03A*/         
*                                                                               
*%If IBM_CBGEN <> 'YES' %Then %Do;                            /*@A03A*/         
*/********************************************************************/         
*/*                                                                  */         
*/* NOTES:                                                           */         
*/*                                                                  */         
*/*  1. The constant ENTVERCB and the comment of the field ENTVERG3  */         
*/*     have to be updated whenever this control block becomes       */         
*/*     incompatible to the previous version.                        */         
*/*                                                                  */         
*/*  2. This data aggregate is stored in permanent storage.          */         
*/*     Any changes made must be reflected in the reporter           */         
*/*     conversion process. Especially the control block             */         
*/*     ERBVFMG3 needs to be updated.                                */         
*/*                                                                  */         
*/**************************************************************@A03M*/         
*%End;                                                        /*@A03A*/         
*                                                                               
*   DCL ENTVERCB BIT(8) CONSTANT('02'X); /* Control block version               
*                                   number.                      @Q1A*/         
*   DCL                                                                         
*     1 ENTARRAY BASED,             /* Enq Name Table            @Q1C*/         
*       3 ENTHEAD,                  /* ENQ name table header     @W1A*/         
*         5 ENTENTG3 CHAR(5),       /* Acronym ENTG3             @W1C*/         
*         5 ENTVERG3 CHAR(1),       /* Control block version X'02'              
*                                                                @W1C*/         
*         5 ENTHDRLE FIXED(8),      /* Length of ENTG3 header    @W1C*/         
*         5 ENTENTLE FIXED(8),      /* Length of one entry       @W1C*/         
*         5 ENTENTMX FIXED(31),     /* Number of table entries   @W1C*/         
*         5 ENTENTNR FIXED(31),     /* Index of last filled entry               
*                                      (Highest possible index is               
*                                      ENTENTMX)                 @W1C*/         
*       3 ENTENTRY(1:*) CHAR(LENGTH(ENTG3)); /* Entries in the                  
*                                   ENTG3 table.                 @Q1C*/         
*   DCL                                                                         
*     1 ENTG3 BASED(ENTG3PTR) BDY(WORD), /* ENQ NAME DATA FIELDS USED*/         
*      2 ENTBASE,                   /* ENQ NAME entry index.         */         
*       3 ENTENIDX FIXED(16),       /* ENQ NAME table entry index@Q1C*/         
*      2 ENTRESNM,                  /* ENQ NAME NUMBER               */         
*       3 ENTMAJNA CHAR(8),         /* MAJOR NAME OF THIS RESOURCE   */         
*       3 ENTMINNA CHAR(36),        /* MINOR NAME OF THIS RESOURCE   */         
*       3 ENTSCOPE BIT(8),        /* SCOPE OF THIS RESOURCE          */         
*         5 ENTSYS   BIT(1),      /* SYSTEM SCOPE (1 = SYSTEM, 0 =              
*                                    NONSYSTEM)                      */         
*         5 ENTSYSS  BIT(1),      /* SYSTEMS SCOPE (1 = SYSTEMS, 0 =            
*                                    NONSYSTEMS)                     */         
*         5 ENTSTEP  BIT(1),      /* STEP SCOPE (1 = STEP, 0 =                  
*                                    NONSTEP)                        */         
*         5 ENTGLBL  BIT(1),      /* GLOBAL RESOURCE INDICATOR                  
*                                    (1 = GLOBAL, 0 = LOCAL)         */         
*         5 ENTBIT1  BIT(1),      /* RESERVED                        */         
*         5 ENTBIT2  BIT(1),      /* RESERVED                        */         
*         5 ENTBIT3  BIT(1),      /* RESERVED                        */         
*         5 ENTBIT4  BIT(1),      /* RESERVED                        */         
*      2 ENTFLAGS    BIT(8),      /* Additional flags            @E1A*/         
*        3 ENTRNLS   BIT(1),      /* ON = This resource has                     
*                                    suspended Jobs. This flag is               
*                                    valid only during data gathering.          
*                                    It is not meaningful within                
*                                    reporter.                   @E1A*/         
*        3 *         BIT(7),      /* Reserved                    @E1A*/         
*      2 ENTEND    CHAR(0) BDY(WORD); /* Force word boundary     @Q1C*/         
*                                   /*                          4@Q1D*/         
*                                                                               
*/************************************************************10@A03A*/         
*@LOGIC;                                                                        
*#PRAGMA TOOL=CBGEN.                                                            
*#ALIGNOP.                                                                      
*#NOTUPPER.                                                                     
*#NOLEN.                                                                        
*/* internal use */                                                             
*#DELETE.ENTSTEP                                                                
*/**/                                                                           
*#EPRAGMA.                                                                      
*#PRAGMA TOOL=PADI.                                                             
*#EPRAGMA.                                                                      
*@ENDLOGIC;                                                                     
*/* End of PL/X Source                                               */         
* %IF ERBENTG3_LIST = 'NO' !                                                    
*    ZCBPRINT = 'NO' %THEN                                                      
* %DO;                                                                          
*   @LIST POP NOECHO;                                                           
* %END;                                                                         
* %END;                                                                         
