*                                                                               
* %DCL ERBGEIG3_INCLUDED CHAR EXT;                                              
* %DEACTIVATE ERBGEIG3_INCLUDED;                                                
* %IF ERBGEIG3_INCLUDED = '' %THEN                                              
* %DO;                                                                          
*/* Macro made bi-lingual on 21196. CBGEN compile date 21138         */         
*% /*                                                                           
         MACRO                                                                  
         ERBGEIG3 &DSECT=YES,&LIST=YES,&TITLE=YES,&GEIG3=YES                    
                  GBLC  &ERBGEIG3_INCLUDED                                      
                  GBLC  &ZCBPRINT                                               
&ERBGEIG3_INCLUDED SETC 'YES'                                                   
                  AIF   ('&LIST' EQ 'NONE').P0                                  
                  AIF   ('&TITLE' EQ 'NO').P5                                   
 TITLE            'ERBGEIG3  - Mapping macro for Mon III Data Gat Gener*        
               al Information Table  '                                          
.P5               ANOP                                                          
**/ ;                                                                           
*/****  START OF SPECIFICATIONS  *************************************/         
*/*                                                                  */         
*/*01* PROPRIETARY STATEMENT:                                   @A04C*/         
*/*       Licensed Materials - Property of IBM                       */         
*/*       "Restricted Materials of IBM"                              */         
*/*       Copyright IBM Corp. 1985, 2021                             */         
*/*                                                                  */         
*/*       Status: z/OS V2R5 Data Gatherer (HRG77D0)             @A04M*/         
*/*                                                                  */         
*/*01* MACRO-NAME: ERBGEIG3                                          */         
*/*                                                                  */         
*/*01* DESCRIPTIVE-NAME:                                             */         
*/*    Mapping macro for Mon III Data Gat General Information Table  */         
*/*                                                             @A04C*/         
*/*                                                             @A04D*/         
*/*01* DSECT NAME: GEIG3                                             */         
*/*                                                                  */         
*/*01* COMPONENT: zOS Data Gatherer (27401)                          */         
*/*                                                                  */         
*/*01* EYE-CATCHER: GEIG3                                            */         
*/*02*  OFFSET: 0                                                    */         
*/*02*  LENGTH: 5                                                    */         
*/*                                                                  */         
*/*01* STORAGE ATTRIBUTES:                                           */         
*/*02*  SUBPOOL: 2                                                   */         
*/*02*  KEY: User                                                    */         
*/*02*  RESIDENCY: ANY                                               */         
*/*                                                                  */         
*/*01* SIZE:                                                    @A04C*/         
*/*            GEIG3 -- X'033C' bytes                                */         
*/*                                                                  */         
*/*01* POINTED TO BY: SSHGEIP field of the ERBSSHG3 data area        */         
*/*                                                                  */         
*/*01* SERIALIZATION: NONE                                           */         
*/*                                                                  */         
*/*01* FUNCTION: This macro maps the Monitor III Data Gatherer       */         
*/*              General Information Table for those information     */         
*/*              not related to an address space, a device or an     */         
*/*              enqueue resource.                              @A04C*/         
*/*                                                                  */         
*/*01* MODULE TYPE: MACRO                                            */         
*/*                                                                  */         
*/*01* PROCESSOR: PL/X , Assembler H                                 */         
*/*                                                                  */         
*/*01* METHOD OF ACCESS:                                             */         
*/*                                                                  */         
*/*      GEIG3 is declared as a based structure, GEIG3PTR should     */         
*/*      be declared                                                 */         
*/*                                                                  */         
*/*01* METHOD OF INVOCATION:                                         */         
*/*                                                                  */         
*/*   ASM    - ERBGEIG3                                         @A04C*/         
*/*                                                                  */         
*/*   PL/X   - PERCENT INCLUDE SYSLIB(ERBGEIG3) SEMICOLON            */         
*/*                                                                  */         
*/*01* CHANGE ACTIVITY: SEE BELOW                                    */         
*/*                                                                  */         
*/* $Q0=NEWREP,HRM3402,,PFU: Mapping Macro For General Information   */         
*/*                          Table                                   */         
*/* $T1=VECTOR,HRM3502,,BB: 3090 Vector processor support        @T1A*/         
*/* $X0=OY11330,HRM4410,,WRC: Berryman support, (PR/SM)  BFY     @X0A*/         
*/* $W1=STOR,JRM4411,,RTL: Storage Enhancements                  @W1A*/         
*/* $Y1=OPII,HRM4420,,FDL: Operations Support                    @Y1A*/         
*/* PAE: Support for Partition Effective Dispatch Time       @YA36668*/         
*/* $B1=RTIME,HRM4430,,BHL: Response time support                @B1A*/         
*/* $B2=SLIP,HRM4430,,HBE: Slip PER Trap Alerting                @B2A*/         
*/* $B3=M3ENH,HRM4430,,RTL: Monitor III Enhancements             @B3A*/         
*/* $B4=CSA,HRM4430,,AJU: Usage of CSA/SQA Storage               @B4A*/         
*/* $B5=R430,HRM4430,,HBE: Miscellaneous Enhancements            @B5A*/         
*/* HUE: ABEND0C9 due to zeroed GEIG3 after Gatherer abend   @YA56306*/         
*/* HOL: Corrects calculations of pseudo-wait times.         @YA59233*/         
*/*      This APAR supersedes APAR OY53118.                          */         
*/* $B6=OMVS,HRM4430,,RPT: OPEN/MVS Toleration Support           @B6A*/         
*/* $C1=WLM3,HRM4440,,BHL: Workload Manager - Monitor III        @C1A*/         
*/* $C2=GWLM3,HRM5510,,HOL: Workload Manager - Monitor III       @C2A*/         
*/* $C3=GWLM3,HRM5510,,HBE: Workload Manager - Monitor III       @C3A*/         
*/* PFU: Lpar Enhancements                                   @WA05435*/         
*/* $E1=GRS,HRM6602,,PFU: GRS Star support                       @E1A*/         
*/* SHR: Adaptation to GRS changes                           @WA20587*/         
*/* $E2=ISSC,OW20266,,RTL: New WFEX Exceptions for ISSC          @E2A*/         
*/* SHR: Allows to recover from an internal ABEND            @WA22735*/         
*/* $H1=MISC,HRM6607,,FDL: CPU model info from IOSDSHID          @H1A*/         
*/* $I1=STSI,HRM7703,,WLR: Concurrent CP upgrade                 @I1A*/         
*/* $I2=BIT64,HRM7703,,GUB: 64 Bit real support                  @I2A*/         
*/* $J1=OW49807,HRM7705,,VT: CPC capacity report                 @J1A*/         
*/* $K1=XMP,HRM7708,,WLR: T-Rex Support                          @K1A*/         
*/* WLR: % SHR frames for STORR/STORS reports           /fin @OA01976*/         
*/* $K2=IFA,OA05731,,WLR: IFA support                            @K2A*/         
*/* $L1=MSTR,HRM7720,,WLR: Storage values for MASTER ASID        @L1A*/         
*/* $L2=EMC,HRM7720,,WLR: New eServer metrics                    @L2A*/         
*/* $L3=MISC,HRM7720,,WLR: Unallocated Common area left          @L3A*/         
*/* GUB: System Utility Processor (SUP) support              @OA13499*/         
*/* $01=GT128,HRM7730,,GUB: >128G real storage support           @01A*/         
*/* $11=LPS,HRM7740,,WLR: Large Page support                     @11A*/         
*/* $21=COMM,HRM7750,,WLR: 64-bit Common Memory support          @21A*/         
*/* $22=MISC,HRM7750,,WLR: Provides total fixed frames           @22A*/         
*/* $31=MISC,HRM7760,,WLR: Corrects Page-In Rate calculation     @31A*/         
*/* WLR: Corrects delta calculation of pages paged-in        @OA28725*/         
*/* $61=SPLP2,OA38660,,WLR: SCM and Pageable Large Pages Support @61A*/         
*/* $62=MISC,OA38660,,WLR: Handling for RPD3                     @62A*/         
*/* $63=MISC,OA38660,,WLR: Remove expanded storage gathering     @63A*/         
*/*  PS: GEIRPOOL precision not any more sufficient enough       @64A*/         
*/*      FIN APAR OA35811                                        @64A*/         
*/* WLR: Unfence SCM support                                 @OA38660*/         
*/* $65=MISC,OA38660,,WLR: Provide New Measurements              @65A*/         
*/* $66=ZOFF,HRM7790,,HBE: zIIP Offload                          @66A*/         
*/*  PS: Fills GEIRPOOL for migration reasons                @OA45385*/         
*/* $71=4TB,OA44503,,WLR: 4 Tb Support                           @71A*/         
*/* $72=SPLP3,HRM77A0,,JKu: Shared Pageable Large Pages          @72A*/         
*/* $73=FreM,HRM77A0,,JBa: Freemained Frames STORF/STORR/STORS   @73A*/         
*/* $81=2GB,OA48913,,JBa: Report on 2GB frame usage              @81A*/         
*/* $82=HVArea,OA52452,,UMu: RSM Real Storage Areas change       @82A*/         
*/* $91=ZCBP,OA54915,,GUB: zCBP support                          @91A*/         
*/* $92=RUCSA,HRM77C0,,UMu: Restricted Use CSA implementation    @92A*/         
*/* $93=SHR64,OA57325,,UMu: Support 64 bit shared page groups    @93A*/         
*/* $A02=ZOSB,HRG77D0,,JBa: Rename prefix ERB to GRB            @A02A*/         
*/* $A03=ZOSB,OA60212,,UMu: Mon 3 data conversion for reporter  @A03A*/         
*/* $A04=ZOSB,HRG77D0,,JBa: Make macro bilingual                @A04A*/         
*/*                                                                  */         
*/****  END OF SPECIFICATIONS  ***************************************/         
*% /*                                                                           
.P0               ANOP                                                          
                  AIF   ('&ZCBPRINT' EQ 'NO').P1                                
                  AIF   ('&LIST' EQ 'YES').P2                                   
.P1               ANOP                                                          
                  PUSH  PRINT                                                   
                  PRINT OFF                                                     
.P2               ANOP                                                          
                  AIF   ('&GEIG3' EQ 'NO').L0002                                
                  AIF   ('&DSECT' EQ 'YES').L0003                               
                  AIF   ('&GEIG3' NE 'YES').L0002                               
GEIG3             DS    0F         General Information Table                    
                  AGO   .L0004                                                  
.L0003            ANOP                                                          
GEIG3             DSECT            General Information Table                    
.L0004            ANOP                                                          
GEIGEIG3          DS    CL5        Acronym GEIG3                                
GEIVERG3          DS    B          CB Version X'19'                             
GEILEN            DS    H          Length of this control block                 
GEIBASE           DS    CL20       Fields which are not cleared                 
                  ORG   GEIBASE                                                 
GEIRSRVD1         DS    CL16       Reserved for internal use                    
GEIVERSN          DS    CL1        Version number (SYSINFO report)              
GEIFLG3           DS    B          GEIG3 flags                                  
*  Bit definitions:                                                             
GEI_ConvD         EQU   X'80'      GEIG3 converted to lower service    *        
                                   level                                        
GEI_ConvU         EQU   X'40'      GEIG3 converted to higher release   *        
                                   or service level                             
GEIFLAG           DS    B          Flags                                        
*  Bit definitions:                                                             
GEISVPRC          EQU   X'80'      Service processor architecture      *        
                                   supported                                    
GEIBFYIN          EQU   X'40'      PR/SM machine                                
GEIVSTOB          EQU   X'10'      BEG values retrieved from M I VSTOR *        
                                   data areas stored                            
GEIVSTOE          EQU   X'08'      END values retrieved from M I VSTOR *        
                                   data areas stored                            
GEINOCLD          EQU   X'04'      no collector data                            
GEIGTERM          EQU   X'02'      data in GEIGG3 is unpredictable as  *        
                                   GRB3GGSS terminated                          
GEINEGSP          EQU   X'01'      no ENQ contention data due to GRS   *        
                                   system problem                               
GEIFLG1           DS    B          Additional flags                             
*  Bit definitions:                                                             
GEINERGI          EQU   X'80'      no ENQ contention data due to GRS   *        
                                   interface problems                           
GEIESAME          EQU   X'40'      z/Architecture mode                          
GEICMR            EQU   X'20'      CMR data available                           
GEIIFA            EQU   X'10'      zAAPs available, valid if GEIzCBP   *        
                                   is OFF                                       
GEISUP            EQU   X'08'      zIIPs available                              
GEIEDAT           EQU   X'04'      Enhanced DAT Facility 1 available            
GEIPLPAG          EQU   X'02'      Pageable large pages support        *        
                                   available                                    
GEISUPON          EQU   X'01'      zIIPs online                                 
                  ORG   GEIBASE+20                                              
GEICLEAR          DS    CL88       Fields cleared at the begin of a    *        
                                   set of samples                               
                  ORG   GEICLEAR                                                
GEISSH            DS    CL12       Fields accumulated per MINTIME               
                  ORG   GEISSH                                                  
GEIMODEL          DS    CL2        Model number                                 
GEIIPSID          DS    CL2        IPS member suffix                            
GEIOPTN           DS    CL2        OPT member suffix                            
GEIICSN           DS    CL2        ICS member suffix                            
GEISID            DS    CL4        SYSTEM name                                  
GEISAMP           DS    CL56       Fields per sample                            
                  ORG   GEISAMP                                                 
GEIRSRVD2         DS    CL4        internal use                                 
GEIAHUIC_VE       DS    CL4        Current system UIC from             *        
                                   MCTCurSystemUIC (short format       *        
                                   floating point)                              
GEIRSTOR          DS    CL16       Central storage fields                       
                  ORG   GEIRSTOR                                                
GEIRPOOL_VE       DS    CL4        Number of online real storage       *        
                                   frames (short floating point)                
GEIRCOMA_VE       DS    CL4        Number of central storage COMMON    *        
                                   frames (short format floating       *        
                                   point)                                       
GEIRSQAA_VE       DS    CL4        Number of central storage SQA       *        
                                   frames (short format floating       *        
                                   point)                                       
GEIRAFC_VE        DS    CL4        Number of central storage available *        
                                   frames (short format floating       *        
                                   point)                                       
GEINUC            DS    CL4        Nucleus frames                               
                  ORG   GEINUC                                                  
GEINUCA_VE        DS    CL4        Number of accumulated central       *        
                                   storage nucleus frames (short       *        
                                   floating point)                              
GEISHRD           DS    CL8        Shared frames                                
                  ORG   GEISHRD                                                 
GEIRSHR_VE        DS    CL4        Number of central storage shared    *        
                                   frames (short format floating       *        
                                   point)                                       
                  DS    F          Reserved                                     
GEIESTOR          DS    CL16       Extended storage fields (no longer  *        
                                   filled)                                      
GEIRSRVD3         DS    CL4        internal use                                 
GEICOMM           DS    CL20       Misc. common area fields                     
                  ORG   GEICOMM                                                 
GEIESQAF_VE       DS    CL4        Reserved                                     
GEIRLPAF_VE       DS    CL4        Number of central storage LPA       *        
                                   frames (short format floating       *        
                                   point)                                       
GEIELPAF_VE       DS    CL4        Reserved                                     
GEIRCSAF_VE       DS    CL4        Number of central storage CSA       *        
                                   frames (short format floating       *        
                                   point)                                       
GEIECSAF_VE       DS    CL4        Reserved                                     
GEISQAO           DS    CL8        SQA overflow fields                          
                  ORG   GEISQAO                                                 
GEIASMPC          DS    F          Sample count to calculate average   *        
                                   SQA overflow                                 
GEIASQAO_VE       DS    CL4        Number of SQA overflow frames       *        
                                   accumulated per MINTIME (short      *        
                                   format floating point)                       
GEICSARE          DS    F          Amount of unallocated common area   *        
                                   left (CSA + SQA)                             
GEIRSVD           DS    CL4        Reserved                                     
                  ORG   GEIRSVD                                                 
                  DS    CL1        Reserved                                     
                  ORG   GEIRSVD+4                                               
GEISNAPS          DS    CL4        Snapshot at end of MINTIME                   
                  ORG   GEISNAPS                                                
GEICPUON          DS    H          Snapshot number of online           *        
                                   processors at the end of the        *        
                                   MINTIME (last sample)                        
                  DS    H          Reserved                                     
GEICSIPL          DS    CL16       IPL Definitions                              
                  ORG   GEICSIPL                                                
GEICSASZ          DS    F          Size of CSA below                            
GEISQASZ          DS    F          Size of SQA below                            
GEIECSAZ          DS    F          Size of CSA above                            
GEIESQAZ          DS    F          Size of SQA above                            
GEICSTOR          DS    CL152      Common Storage Area                          
                  ORG   GEICSTOR                                                
GEITIVSM          DS    CL16       Times when VSM data gathering       *        
                                   started and ended, all in TOD       *        
                                   format of GMT, left fullword only            
                  ORG   GEITIVSM                                                
GEISTCSA          DS    CL4        Start of CSA/ECSA                            
GEISTSQA          DS    CL4        Start of SQA/ESQA                            
GEIENCSA          DS    CL4        End of CSA/ECSA                              
GEIENSQA          DS    CL4        End of SQA/ESQA                              
GEINSVSM          DS    CL8        Number of samples VSM provided      *        
                                   Common Storage CAUBs                         
                  ORG   GEINSVSM                                                
GEINSCSA          DS    F          Number of samples CSA                        
GEINSSQA          DS    F          Number of samples SQA                        
GEICSMAX          DS    CL16       Maximum common storage allocation   *        
                                   of MINTIME                                   
                  ORG   GEICSMAX                                                
GEICSAMX          DS    F          Max. alloc. CSA below                        
GEISQAMX          DS    F          Max. alloc. SQA below                        
GEIECSAX          DS    F          Max. alloc. CSA above                        
GEIESQAX          DS    F          Max. alloc. SQA above                        
GEICSSNP          DS    CL16       Snapshot values of common storage   *        
                                   allocation at the end of the        *        
                                   MINTIME                                      
                  ORG   GEICSSNP                                                
GEICSASP          DS    F          Current alloc. CSA below                     
GEISQASP          DS    F          Current alloc. SQA below                     
GEIECSAP          DS    F          Current alloc. CSA above                     
GEIESQAP          DS    F          Current alloc. SQA above                     
GEICSAVG          DS    CL16       Accumulated Common Storage in this  *        
                                   MINTIME, all short format floating  *        
                                   point                                        
                  ORG   GEICSAVG                                                
GEICSAAV          DS    CL4        Acc. alloc. CSA below                        
GEISQAAV          DS    CL4        Acc. alloc. SQA below                        
GEIECSAV          DS    CL4        Acc. alloc. CSA above                        
GEIESQAV          DS    CL4        Acc. alloc. SQA above                        
GEICSACA          DS    CL8        Average CSA conversion into SQA,    *        
                                   all short form floating point                
                  ORG   GEICSACA                                                
GEICSACN          DS    CL4        Acc. CSA conversion below                    
GEIECSAN          DS    CL4        Acc. CSA conversion above                    
GEICSACS          DS    CL8        Snapshot CSA conversion into SQA at *        
                                   MINTIME end                                  
                  ORG   GEICSACS                                                
GEICSACE          DS    F          CSA conv. below                              
GEIECSAE          DS    F          CSA conv. above                              
GEICSSYS          DS    CL16       Accumulated Common Storage held by  *        
                                   the system in this MINTIME, all     *        
                                   short format floating point                  
                  ORG   GEICSSYS                                                
GEICSAAS          DS    CL4        Acc. alloc. CSA below                        
GEISQAAS          DS    CL4        Acc. alloc. SQA below                        
GEIECSAS          DS    CL4        Acc. alloc. CSA above                        
GEIESQAS          DS    CL4        Acc. alloc. SQA above                        
GEIBATAS          DS    CL16       Accumulated Common Storage held by  *        
                                   active BATCH initiators in this     *        
                                   MINTIME, all short format floating  *        
                                   point                                        
                  ORG   GEIBATAS                                                
GEIBATCS          DS    CL4        Acc. alloc. CSA below                        
GEIBATEC          DS    CL4        Acc. alloc. CSA above                        
GEIBATSQ          DS    CL4        Acc. alloc. SQA below                        
GEIBATES          DS    CL4        Acc. alloc. SQA above                        
GEIASCAS          DS    CL16       Accumulated Common Storage held by  *        
                                   active ASCH initiators in this      *        
                                   MINTIME, all short format floating  *        
                                   point                                        
                  ORG   GEIASCAS                                                
GEIASCCS          DS    CL4        Acc. alloc. CSA below                        
GEIASCEC          DS    CL4        Acc. alloc. CSA above                        
GEIASCSQ          DS    CL4        Acc. alloc. SQA below                        
GEIASCES          DS    CL4        Acc. alloc. SQA above                        
GEIOMVAS          DS    CL16       Accumulated Common Storage held by  *        
                                   active OMVS initiators in this      *        
                                   MINTIME, all short format floating  *        
                                   point                                        
                  ORG   GEIOMVAS                                                
GEIOMVCS          DS    CL4        Acc. alloc. CSA below                        
GEIOMVEC          DS    CL4        Acc. alloc. CSA above                        
GEIOMVSQ          DS    CL4        Acc. alloc. SQA below                        
GEIOMVES          DS    CL4        Acc. alloc. SQA above                        
GEIEXTEN          DS    CL4        Extension                                    
                  ORG   GEIEXTEN                                                
GEIMTFLG          DS    B          Indicators for the current mintime.          
*  Bit definitions:                                                             
GEIIPSCH          EQU   X'80'      IPS changed during this mintime              
GEICSAIN          EQU   X'40'      CSA and RUCSA amounts incomplete in *        
                                   system CAUB                                  
GEISQAIN          EQU   X'20'      SQA amounts incomplete in system    *        
                                   CAUB                                         
GEIVSMER          EQU   X'10'      unexpected VSM error                         
GEIWLMMD          EQU   X'08'      Current WLM mode is Goal mode                
GEIWTERM          EQU   X'04'      WLM data not available during this  *        
                                   mintime                                      
GEIFLG2           DS    B          Additional flags                             
*  Bit definitions:                                                             
GEIEDAT2          EQU   X'80'      Enhanced DAT Facility 2 available            
GEIzCBP           EQU   X'40'      Reserved                                     
GEI_RUCSA_Defined EQU   X'20'      RUCSA is defined                             
                  DS    BL2        Reserved for future use                      
GEISLID           DS    CL4        ID of slip trap                              
GEIIPLTI          DS    CL8        IPL time in TOD format (local time)          
GEIWLMTK          DS    CL8        WLM token                                    
GEISPLX           DS    CL8        Sysplex name                                 
GEISYSNM          DS    CL8        MVS system name                              
GEIMAXAS          DS    F          Maximum number of address spaces             
GEIESMCT          DS    CL16       Storage frame movement counts (no   *        
                                   longer gathered)                             
                  ORG   GEIESMCT                                                
GEIESPMB          DS    CL4        Reserved                                     
GEIESPME          DS    CL4        Reserved                                     
GEIESMRB          DS    CL4        Reserved                                     
GEIESMRE          DS    CL4        Reserved                                     
GEIMDL            DS    CL16       EBCDIC CPC model identifier                  
GEISEQ            DS    CL16       EBCDIC CPC sequence number                   
GEIMASTR          DS    CL16       Storage values of master address    *        
                                   space, all short floating point              
                  ORG   GEIMASTR                                                
GEILOAL           DS    CL4        User region value allocated below   *        
                                   16M                                          
GEIHIAL           DS    CL4        LSQA/SWA/229/230 value allocated    *        
                                   below 16M                                    
GEIELOAL          DS    CL4        User region value allocated above   *        
                                   16M                                          
GEIEHIAL          DS    CL4        LSQA/SWA/229/230 value allocated    *        
                                   above 16M                                    
GEIEMC            DS    CL8        Storage values for eServer metrics  *        
                                   collector, all short floating point          
                  ORG   GEIEMC                                                  
GEITOTPI          DS    CL4        Total number of pages paged-in      *        
                                   exluding swap-in, VIO, and          *        
                                   hiperspace page-ins - current value          
GEISLTA           DS    CL4        Number of currently available slots          
GEILPS            DS    CL52       Storage values for system-wide      *        
                                   memory objects support                       
                  ORG   GEILPS                                                  
GEIRLMO           DS    CL4        Number of fixed memory objects that *        
                                   are allocated in the system and can *        
                                   be backed in 1 MB frames                     
GEIRLPR           DS    CL4        Number of 1 MB pages fixed in       *        
                                   central storage                              
GEICMO            DS    CL4        Number of high virtual common       *        
                                   memory objects allocated                     
GEICFR            DS    CL4        Number of high virtual common       *        
                                   memory pages backed in central      *        
                                   storage                                      
GEICFFR           DS    CL4        Number of high virtual common       *        
                                   memory pages fixed in central       *        
                                   storage                                      
GEICASL           DS    CL4        Number of high virtual common       *        
                                   memory auxiliary storage slots      *        
                                   (DASD and SCM)                               
GEISMO            DS    CL4        Number of high virtual shared       *        
                                   memory objects allocated                     
GEISFR            DS    CL4        Number of high virtual common       *        
                                   memory pages backed in central      *        
                                   storage                                      
GEICSIZ           DS    CL8        High virtual common area size                
GEISSIZ           DS    CL8        High virtual shared area size                
GEILSIZ           DS    CL4        Maximum number of 1 MB frames that  *        
                                   can be used by fixed 1 MB pages              
GEIRTFIX          DS    CL4        Total number of fixed frames                 
GEIRBFIX          DS    CL4        Number of fixed frames below 16 MB  *        
                                   central storage                              
GEIRSRVD4         DS    CL4        internal use                                 
GEIPLP            DS    CL32       Storage values for pageable large   *        
                                   pages and SCM                                
                  ORG   GEIPLP                                                  
GEICUSE           DS    CL8        Number of high virtual common pages *        
                                   in-use                                       
GEISUSE           DS    CL8        Number of pages in-use by shared    *        
                                   memory objects                               
GEILPAG           DS    CL4        Reserved                                     
GEILFUSE          DS    CL4        Number of 1 MB frames that are      *        
                                   in-use and are no longer avai-      *        
                                   lable for fixed 1 MB pages                   
GEILPUSE          DS    CL4        Number of 1 MB frames used by       *        
                                   pageable/DREF memory objects                 
GEISASL           DS    CL4        Number of high virtual shared       *        
                                   memory auxiliary storage slots      *        
                                   (DASD and SCM)                               
GEICLR2           DS    CL52       Fields to be cleared                         
                  ORG   GEICLR2                                                 
GEIRSTRF          DS    CL8        Number of online real storage       *        
                                   frames                                       
GEILCPR           DS    CL8        Number of 1 MB high virtual common  *        
                                   memory pages backed in central      *        
                                   storage                                      
GEILCMO           DS    CL4        Number of fixed memory objects      *        
                                   allocated in high virtual common    *        
                                   storage that can be backed in 1 MB  *        
                                   frames                                       
GEILF4K           DS    CL4        Reserved                                     
GEILP4K           DS    CL4        Reserved                                     
GEILPFRI          DS    CL4        Number of failed 1 MB pageable      *        
                                   pages that were requested                    
GEILPFCI          DS    CL4        Number of demoted 1 MB pageable     *        
                                   pages that were converted from 1 MB *        
                                   pages to 4K pages                            
GEILCMU           DS    CL4        Number of 1 MB high virtual common  *        
                                   memory objects whose owner is no    *        
                                   longer active                                
GEILCPU           DS    CL8        Number of 1 MB high virtual common  *        
                                   memory pages whose owner is no      *        
                                   longer active                                
GEILFPF           DS    CL4        Reserved                                     
GEIRSRVD5         DS    CL8        internal use                                 
GEICLR3           DS    CL128      Fields to be cleared in long        *        
                                   floating point format                        
                  ORG   GEICLR3                                                 
GEIRSRVD6         DS    CL112      internal use                                 
GEINRSRVD6        DS    CL16                                                    
                  ORG   GEINRSRVD6                                              
GEILSMO           DS    CL8        Number of memory objects allocated  *        
                                   in high virtual shared storage that *        
                                   can be backed in 1 MB frames                 
GEIRFREM          DS    CL8        Number of freemained frames in all  *        
                                   address spaces                               
GEICLR4           DS    CL32       Fields to be cleared, related to    *        
                                   2GB frames                                   
                  ORG   GEICLR4                                                 
GEIRGMO           DS    CL8        Number of fixed memory objects that *        
                                   are allocated in the system and are *        
                                   backed in 2 GB frames                        
GEIRGPR           DS    CL8        Number of 2 GB pages fixed in       *        
                                   central storage                              
GEIGFUSE          DS    CL8        Number of 2 GB frames used by fixed *        
                                   memory objects                               
GEIGSIZ           DS    CL8        Number of 2 GB frames that can be   *        
                                   used by fixed 2 GB memory objects            
GEICLR5           DS    CL24       Field to be cleared, related to RSM *        
                                   real storage area changes                    
                  ORG   GEICLR5                                                 
GEILUSE           DS    CL8        Number of 1 MB frames in central    *        
                                   storage that are in-use by memory   *        
                                   objects                                      
GEILTOT           DS    CL8        Total number of 1 MB frames in      *        
                                   central storage                              
                  ORG   GEICLR5+24                                              
GEIRUCSAIPL       DS    CL8        IPL Definitions of RUCSA and ERUCSA          
                  ORG   GEIRUCSAIPL                                             
GEIRUCSASZ        DS    F          size of RUCSA below                          
GEIERUCSAZ        DS    F          size of RUCSA above                          
GEIRUCSA          DS    CL60       Miscellaneous RUCSA fields                   
                  ORG   GEIRUCSA                                                
GEIRUCSAMAX       DS    CL8        Maximum common storage allocation   *        
                                   in RUCSA of this MINTIME                     
                  ORG   GEIRUCSAMAX                                             
GEIRUCSAMX        DS    F          Max. alloc. RUCSA below                      
GEIERUCSAX        DS    F          Max. alloc. RUCSA above                      
GEIRUCSASNP       DS    CL8        Snapshot values of common storage   *        
                                   allocation in RUCSA at the end of   *        
                                   the MINTIME                                  
                  ORG   GEIRUCSASNP                                             
GEIRUCSASP        DS    F          Current alloc. RUCSA bel                     
GEIERUCSAP        DS    F          Current alloc. RUCSA abv                     
GEIRUCSAVG        DS    CL8        Accumulated Common Storage          *        
                                   allocated in RUCSA in this MINTIME, *        
                                   all short format floating point              
                  ORG   GEIRUCSAVG                                              
GEIRUCSAAV        DS    CL4        Acc. alloc. RUCSA below                      
GEIERUCSAV        DS    CL4        Acc. alloc. RUCSA above                      
GEIRUCSARE        DS    F          Amount of unallocated common area   *        
                                   left in RUCSA <16M                           
GEIRUCSASYS       DS    CL8        Accumulated Common Storage in RUCSA *        
                                   held by the system in this MINTIME, *        
                                   all short format floating point              
                  ORG   GEIRUCSASYS                                             
GEIRUCSAAS        DS    CL4        Acc. alloc. RUCSA below                      
GEIERUCSAS        DS    CL4        Acc. alloc. RUCSA above                      
GEIBATAS2         DS    CL8        Accumulated Common Storage in RUCSA *        
                                   held by active BATCH initiators in  *        
                                   this MINTIME, all short format      *        
                                   floating point                               
                  ORG   GEIBATAS2                                               
GEIBATRUCSA       DS    CL4        Acc. alloc. RUCSA below held by     *        
                                   active BATCH initiators                      
GEIBATERUCSA      DS    CL4        Acc. alloc. RUCSA above held by     *        
                                   active BATCH initiators                      
GEIASCAS2         DS    CL8        Accumulated Common Storage in RUCSA *        
                                   held by active ASCH initiators in   *        
                                   this MINTIME, all short format      *        
                                   floating point                               
                  ORG   GEIASCAS2                                               
GEIASCRUCSA       DS    CL4        Acc. alloc. RUCSA below held by     *        
                                   active ASCH initiators                       
GEIASCERUCSA      DS    CL4        Acc. alloc. RUCSA above held by     *        
                                   active ASCH initiators                       
GEIOMVAS2         DS    CL8        Accumulated Common Storage in RUCSA *        
                                   held by active OMVS initiators in   *        
                                   this MINTIME, all short format      *        
                                   floating point                               
                  ORG   GEIOMVAS2                                               
GEIOMVRUCSA       DS    CL4        Acc. alloc. RUCSA below held by     *        
                                   active OMVS initiators                       
GEIOMVERUCSA      DS    CL4        Acc. alloc. RUCSA above held by     *        
                                   active OMVS initiators                       
GEIEND            DS    0C         Force word boundary                          
*                                                                               
*   the internal CPU data areas are moved to ERBCPUG3                           
*                                                                               
*                                                                               
GEIVERCB          EQU   X'19'      Control block version number                 
.L0002            ANOP                                                          
                  AIF   ('&ZCBPRINT' EQ 'NO').P3                                
                  AIF   ('&LIST' EQ 'YES').P4                                   
.P3               ANOP                                                          
                  POP   PRINT                                                   
.P4               ANOP                                                          
.P_EXIT           ANOP                                                          
                  MEND                                                          
**/ ;                                                                           
* %ERBGEIG3_INCLUDED = 'YES';                                                   
* %DCL ZCBPRINT CHAR EXT;                                                       
* %DEACTIVATE ZCBPRINT;                                                         
* %DCL ERBGEIG3_LIST CHAR EXT;                                                  
* %DEACTIVATE ERBGEIG3_LIST;                                                    
* %IF ERBGEIG3_LIST = 'NO' !                                                    
*    ZCBPRINT = 'NO' %THEN                                                      
* %DO;                                                                          
*   @LIST PUSH NOECHO;                                                          
*   @LIST NOASSEMBLE NOECHO;                                                    
*   @LIST OFF C NOECHO;                                                         
* %END;                                                                         
*/* Start of PL/X Source                                             */         
*                                                                               
*%IBM_CBGEN_PADI = '';                                        /*@A04A*/         
*%If IBM_CBGEN = 'YES' ! IBM_PADI = 'YES' %Then %Do;          /*@A04A*/         
*   %IBM_CBGEN_PADI = 'YES';                                  /*@A04A*/         
*%End;                                                        /*@A04A*/         
*                                                                               
*%If IBM_CBGEN <> 'YES' %Then %Do;                            /*@A04A*/         
*/********************************************************************/         
*/*                                                                  */         
*/*01* CREATED BY: GRB3GINI                                          */         
*/*                                                                  */         
*/*01* NOTES:                                                        */         
*/*                                                                  */         
*/*  1. The constant GEIVERCB and the comment of the field GEIVERG3  */         
*/*     have to be updated whenever this control block becomes       */         
*/*     incompatible to the previous version.                    @B1A*/         
*/*                                                                  */         
*/*  2. This data aggregate is stored in permanent storage.          */         
*/*     Any changes made must be reflected in the reporter           */         
*/*     conversion process. Especially the control block             */         
*/*     ERBVFMG3 needs to be updated.                            @B1A*/         
*/*                                                                  */         
*/**************************************************************@A04M*/         
*%End;                                                        /*@A04A*/         
*                                                                               
*DCL 1 GEIG3    BASED(GEIG3PTR) BDY(WORD),                                      
*                                   /* General Information Table     */         
*                                   /*                           @J1D*/         
*      3 GEIGEIG3 CHAR(5),          /* Acronym GEIG3                 */         
*      3 GEIVERG3 BIT(8),           /* CB Version X'19'          @92C*/         
*      3 GEILEN   FIXED(15),        /* Length of this control block  */         
*      3 GEIBASE,                   /* Fields which are not cleared  */         
*        5 GEIRSRVD1,               /* Reserved for internal use                
*                                                               @A04A*/         
*          7 GEIWTIMB CHAR(8),      /* To calculate the CPU time,               
*                                      the new fields in the                    
*                                      CPUG3 should be used     @A04C*/         
*          7 GEIWTIME CHAR(8),      /* To calculate the CPU time,               
*                                      the new fields in the                    
*                                      CPUG3 should be used     @A04C*/         
*        5 GEIVERSN CHAR(1),        /* Version number (SYSINFO report)          
*                                                               @A03C*/         
*        5 GEIFLG3 BIT(8),          /* GEIG3 flags              @A03C*/         
*          7 GEI_ConvD BIT(1),      /* GEIG3 converted to lower                 
*                                      service level            @A03A*/         
*          7 GEI_ConvU Bit(1),      /* GEIG3 converted to higher                
*                                      release or service level @A03A*/         
*          7 * BIT(6),              /* Reserved                 @A03A*/         
*                                                                               
*        5 GEIFLAG BIT(8),          /* Flags                         */         
*          7 GEISVPRC BIT(1),       /* Service processor                        
*                                      architecture supported   @A04C*/         
*          7 GEIBFYIN BIT(1),       /* PR/SM machine            @A04C*/         
*          7 GEID204F BIT(1),       /* ON, if Diagnose X'204' fails             
*                                                                @X0A*/         
*          7 GEIVSTOB BIT(1),       /* BEG values retrieved from                
*                                      M I VSTOR data areas stored              
*                                                               @A04C*/         
*          7 GEIVSTOE BIT(1),       /* END values retrieved from                
*                                      M I VSTOR data areas stored              
*                                                               @A04C*/         
*          7 GEINOCLD BIT(1),       /* no collector data        @A04C*/         
*          7 GEIGTERM BIT(1),       /* data in GEIGG3                           
*                                      is unpredictable as                      
*                                      GRB3GGSS terminated      @A04C*/         
*          7 GEINEGSP BIT(1),       /* no ENQ contention data due               
*                                      to GRS system problem    @A04C*/         
*        5 GEIFLG1 BIT(8),          /* Additional flags      @WA22735*/         
*          7 GEINERGI BIT(1),       /* no ENQ contention data due               
*                                      to GRS interface problems                
*                                                               @A04C*/         
*          7 GEIESAME BIT(1),       /* z/Architecture mode      @A04C*/         
*          7 GEICMR   BIT(1),       /* CMR data available       @A04C*/         
*          7 GEIIFA   BIT(1),       /* zAAPs available,                         
*                                      valid if GEIzCBP is OFF  @A04C*/         
*            9 GEICBP   BIT(1),     /* zCBPs available,                         
*                                      valid if GEIzCBP is ON   @A04C*/         
*          7 GEISUP   BIT(1),       /* zIIPs available          @A04C*/         
*          7 GEIEDAT  BIT(1),       /* Enhanced DAT Facility 1                  
*                                      available                @A04C*/         
*          7 GEIPLPAG BIT(1),       /* Pageable large pages                     
*                                      support available        @A04C*/         
*          7 GEISUPON BIT(1),       /* zIIPs online             @A04C*/         
*      3 GEICLEAR  BDY(WORD),       /* Fields cleared at the begin              
*                                      of a set of samples           */         
*        5 GEISSH  BDY(WORD),       /* Fields accumulated per MINTIME*/         
*          7 GEIMODEL CHAR(2),      /* Model number                  */         
*          7 GEIIPSID CHAR(2),      /* IPS member suffix             */         
*          7 GEIOPTN  CHAR(2),      /* OPT member suffix             */         
*          7 GEIICSN  CHAR(2),      /* ICS member suffix             */         
*          7 GEISID   CHAR(4),      /* SYSTEM name                   */         
*        5 GEISAMP  BDY(WORD),      /* Fields per sample             */         
*          7 GEIRSRVD2,             /* internal use             @A04A*/         
*            9 GEICPUOL FIXED(31),  /* Number of online processors              
*                                                               @A04C*/         
*          7 GEIAHUIC_VE CHAR(4) BDY(WORD), /* Current system UIC               
*                                      from MCTCurSystemUIC (short              
*                                      format floating point)   @A04C*/         
*            9 GEIAHUIC FIXED(31),  /* Highest system unreferenced              
*                                      interval count (HUIC)    @A04C*/         
*          7 GEIRSTOR,              /* Central storage fields    @61C*/         
*            9 GEIRPOOL_VE CHAR(4) BDY(WORD), /* Number of                      
*                                      online real storage                      
*                                      frames (short floating                   
*                                      point)                   @A04C*/         
*              11 GEIRPOOL FIXED(31), /* Number of online real                  
*                                      storage frames           @A04C*/         
*            9 GEIRCOMA_VE CHAR(4) BDY(WORD), /* Number of central              
*                                      storage COMMON frames (short             
*                                      format floating point)   @A04C*/         
*              11 GEIRCOMA FIXED(31), /* Number of central storage              
*                                      COMMON frames            @A04C*/         
*            9 GEIRSQAA_VE CHAR(4) BDY(WORD), /* Number of central              
*                                      storage SQA frames (short                
*                                      format floating point)   @A04C*/         
*              11 GEIRSQAA FIXED(31), /* Number of central storage SQA          
*                                      frames                   @A04C*/         
*            9 GEIRAFC_VE CHAR(4) BDY(WORD), /* Number of central               
*                                      storage available frames (short          
*                                      format floating point)   @A04C*/         
*              11 GEIRAFC  FIXED(31), /* Number of central storage              
*                                      available frames         @A04C*/         
*          7 GEINUC,                /* Nucleus frames                */         
*            9 GEINUCA_VE CHAR(4) BDY(WORD), /* Number of accumulated           
*                                      central storage nucleus frames           
*                                      (short floating point)   @A04C*/         
*              11 GEINUCA  FIXED(31), /* Number of accumulated central          
*                                      storage nucleus frames   @A04C*/         
*          7 GEISHRD,               /* Shared frames         @OA01976*/         
*            9 GEIRSHR_VE CHAR(4) BDY(WORD),                    /*              
*                                      Number of central storage shared         
*                                      frames (short format floating            
*                                      point)                   @A04C*/         
*              11 GEIRSHR  FIXED(31), /* Number of central storage              
*                                      shared frames            @A04C*/         
*            9 *        FIXED(31),  /* Reserved                      */         
*          7 GEIESTOR CHAR(16) BDY(WORD), /* Extended storage fields            
*                                      (no longer filled)       @A04C*/         
*%If IBM_CBGEN_PADI <> 'YES' %Then  /* Skip extended storage fields             
*                                      with CBGEN               @A04A*/         
*%Do;                                                         /*@A04A*/         
*            9 GEIEESPL FIXED(31),  /* Reserved                  @63C*/         
*              11 GEIEESPL_VE CHAR(4) BDY(WORD), /* Reserved     @63C*/         
*            9 GEIEGAGE FIXED(31),  /* Reserved                  @63C*/         
*              11 GEIEGAGE_VE CHAR(4) BDY(WORD), /* Reserved     @63C*/         
*            9 GEIECOME FIXED(31),  /* Reserved                  @63C*/         
*              11 GEIECOME_VE CHAR(4) BDY(WORD), /* Reserved     @63C*/         
*            9 GEIEAEC  FIXED(31),  /* Reserved                  @63C*/         
*              11 GEIEAEC_VE CHAR(4) BDY(WORD),  /* Reserved     @63C*/         
*%End;                                                        /*@A04A*/         
*          7 GEIRSRVD3,             /* internal use             @A04A*/         
*            9 GEIVECOL FIXED(31),  /* Number of online vector                  
*                                      processors               @A04C*/         
*        5 GEICOMM,                 /* Misc. common area fields  @W1A*/         
*            9 GEIESQAF_VE CHAR(4) BDY(WORD), /* Reserved       @A04C*/         
*              11 GEIESQAF FIXED(31),  /* Reserved              @A04C*/         
*            9 GEIRLPAF_VE CHAR(4) BDY(WORD), /* Number of central              
*                                      storage LPA frames (short                
*                                      format floating point)   @A04C*/         
*              11 GEIRLPAF FIXED(31),  /* Number of central storage             
*                                      LPA frames               @A04C*/         
*            9 GEIELPAF_VE CHAR(4) BDY(WORD), /* Reserved       @A04C*/         
*              11 GEIELPAF FIXED(31),  /* Reserved              @A04C*/         
*            9 GEIRCSAF_VE CHAR(4) BDY(WORD), /* Number of central              
*                                      storage CSA frames (short                
*                                      format floating point)   @A04C*/         
*              11 GEIRCSAF FIXED(31),  /* Number of central storage             
*                                      CSA frames               @A04C*/         
*            9 GEIECSAF_VE CHAR(4) BDY(WORD), /* Reserved       @A04C*/         
*              11 GEIECSAF FIXED(31),  /* Reserved              @A04C*/         
*                                                            /* 5@B4D*/         
*      3  GEISQAO,                  /* SQA overflow fields       @B4C*/         
*        5  GEIASMPC FIXED(31),     /* Sample count to calculate                
*                                      average SQA overflow      @B4C*/         
*        5  GEIASQAO_VE CHAR(4) BDY(WORD),                                      
*                                   /* Number of SQA overflow frames            
*                                      accumulated per MINTIME (short           
*                                      format floating point)   @A04C*/         
*          7  GEIASQAO FIXED(31),   /* Number of SQA overflow frames            
*                                      accumulated per MINTIME  @A04C*/         
*      3 GEICSARE FIXED(31),        /* Amount of unallocated common             
*                                      area left (CSA + SQA)     @L3C*/         
*      3 GEIRSVD,                   /* Reserved                 @A04C*/         
*        5 GEICPM    CHAR(3),       /* Reserved                  @I1C*/         
*        5 *         CHAR(1),       /* Reserved                  @H1A*/         
*      3 GEISNAPS,                  /* Snapshot at end of MINTIME               
*                                                                @Y1A*/         
*        5 GEICPUON FIXED(15),      /* Snapshot number of online                
*                                      processors at the end of the             
*                                      MINTIME (last sample)     @Y1A*/         
*        5 *        FIXED(16),      /* Reserved                  @Y1A*/         
*      3 GEICSIPL,                  /* IPL Definitions           @B4A*/         
*        5 GEICSASZ FIXED(31),      /* Size of CSA below         @B4A*/         
*        5 GEISQASZ FIXED(31),      /* Size of SQA below         @B4A*/         
*        5 GEIECSAZ FIXED(31),      /* Size of CSA above         @B4A*/         
*        5 GEIESQAZ FIXED(31),      /* Size of SQA above         @B4A*/         
*                                   /*                           @J1D*/         
*      3 GEICSTOR,                  /* Common Storage Area       @B4A*/         
*        5 GEITIVSM,                /* Times when VSM data gathering            
*                                      started and ended, all in TOD            
*                                      format of GMT, left fullword             
*                                      only                      @B4A*/         
*          7  GEISTCSA CHAR(4) BDY(WORD), /* Start of CSA/ECSA   @B4A*/         
*          7  GEISTSQA CHAR(4) BDY(WORD), /* Start of SQA/ESQA   @B4A*/         
*          7  GEIENCSA CHAR(4) BDY(WORD), /* End   of CSA/ECSA   @B4A*/         
*          7  GEIENSQA CHAR(4) BDY(WORD), /* End   of SQA/ESQA   @B4A*/         
*        5 GEINSVSM,                /* Number of samples VSM provided           
*                                      Common Storage CAUBs      @B4A*/         
*          7  GEINSCSA FIXED(31),   /* Number of samples CSA     @B4A*/         
*          7  GEINSSQA FIXED(31),   /* Number of samples SQA     @B4A*/         
*        5 GEICSMAX,                /* Maximum common storage                   
*                                      allocation of MINTIME     @B4A*/         
*          7  GEICSAMX FIXED(31),   /* Max. alloc. CSA below     @B4A*/         
*          7  GEISQAMX FIXED(31),   /* Max. alloc. SQA below     @B4A*/         
*          7  GEIECSAX FIXED(31),   /* Max. alloc. CSA above     @B4A*/         
*          7  GEIESQAX FIXED(31),   /* Max. alloc. SQA above     @B4A*/         
*        5 GEICSSNP,                /* Snapshot values of common                
*                                      storage allocation at the                
*                                      end of the MINTIME        @B4A*/         
*          7  GEICSASP FIXED(31),   /* Current alloc. CSA below  @B4A*/         
*          7  GEISQASP FIXED(31),   /* Current alloc. SQA below  @B4A*/         
*          7  GEIECSAP FIXED(31),   /* Current alloc. CSA above  @B4A*/         
*          7  GEIESQAP FIXED(31),   /* Current alloc. SQA above  @B4A*/         
*        5 GEICSAVG,                /* Accumulated Common Storage               
*                                      in this MINTIME, all short               
*                                      format floating point     @B4A*/         
*          7  GEICSAAV CHAR(4),     /* Acc. alloc. CSA below     @B4A*/         
*          7  GEISQAAV CHAR(4),     /* Acc. alloc. SQA below     @B4A*/         
*          7  GEIECSAV CHAR(4),     /* Acc. alloc. CSA above     @B4A*/         
*          7  GEIESQAV CHAR(4),     /* Acc. alloc. SQA above     @B4A*/         
*        5 GEICSACA,                /* Average CSA conversion into              
*                                      SQA, all short form floating             
*                                      point                     @B4A*/         
*          7  GEICSACN CHAR(4),     /* Acc. CSA conversion below @B4A*/         
*          7  GEIECSAN CHAR(4),     /* Acc. CSA conversion above @B4A*/         
*        5 GEICSACS,                /* Snapshot CSA conversion into             
*                                      SQA at MINTIME end        @B4A*/         
*          7  GEICSACE FIXED(31),   /* CSA conv. below           @B4A*/         
*          7  GEIECSAE FIXED(31),   /* CSA conv. above           @B4A*/         
*        5 GEICSSYS,                /* Accumulated Common Storage               
*                                      held by the system in this               
*                                      MINTIME, all short format                
*                                      floating point            @B4A*/         
*          7  GEICSAAS CHAR(4),     /* Acc. alloc. CSA below     @B4A*/         
*          7  GEISQAAS CHAR(4),     /* Acc. alloc. SQA below     @B4A*/         
*          7  GEIECSAS CHAR(4),     /* Acc. alloc. CSA above     @B4A*/         
*          7  GEIESQAS CHAR(4),     /* Acc. alloc. SQA above     @B4A*/         
*        5 GEIBATAS,                /* Accumulated Common Storage               
*                                      held by active BATCH initiators          
*                                      in this MINTIME, all short               
*                                      format floating point     @B4A*/         
*          7  GEIBATCS CHAR(4),     /* Acc. alloc. CSA below     @B4A*/         
*          7  GEIBATEC CHAR(4),     /* Acc. alloc. CSA above     @92C*/         
*          7  GEIBATSQ CHAR(4),     /* Acc. alloc. SQA below     @92C*/         
*          7  GEIBATES CHAR(4),     /* Acc. alloc. SQA above     @B4A*/         
*        5 GEIASCAS,                /* Accumulated Common Storage               
*                                      held by active ASCH initiators           
*                                      in this MINTIME, all short               
*                                      format floating point     @B4A*/         
*          7  GEIASCCS CHAR(4),     /* Acc. alloc. CSA below     @B4A*/         
*          7  GEIASCEC CHAR(4),     /* Acc. alloc. CSA above     @92C*/         
*          7  GEIASCSQ CHAR(4),     /* Acc. alloc. SQA below     @92C*/         
*          7  GEIASCES CHAR(4),     /* Acc. alloc. SQA above     @B4A*/         
*        5 GEIOMVAS,                /* Accumulated Common Storage               
*                                      held by active OMVS initiators           
*                                      in this MINTIME, all short               
*                                      format floating point     @B6A*/         
*          7  GEIOMVCS CHAR(4),     /* Acc. alloc. CSA below     @B6A*/         
*          7  GEIOMVEC CHAR(4),     /* Acc. alloc. CSA above     @92C*/         
*          7  GEIOMVSQ CHAR(4),     /* Acc. alloc. SQA below     @92C*/         
*          7  GEIOMVES CHAR(4),     /* Acc. alloc. SQA above     @B6A*/         
*      3 GEIEXTEN,                  /* Extension                 @B1A*/         
*        5 GEIMTFLG BIT(8),         /* Indicators for the current               
*                                      mintime.                  @B1A*/         
*          7 GEIIPSCH BIT(1),       /* IPS changed during this                  
*                                      mintime                  @A04C*/         
*          7 GEICSAIN BIT(1),       /* CSA and RUCSA amounts                    
*                                      incomplete in                            
*                                      system CAUB              @A04C*/         
*          7 GEISQAIN BIT(1),       /* SQA amounts incomplete                   
*                                      in system CAUB           @A04C*/         
*          7 GEIVSMER BIT(1),       /* unexpected VSM error     @A04C*/         
*          7 GEIWLMMD BIT(1),       /* Current WLM mode is                      
*                                      Goal mode                @A04C*/         
*          7 GEIWTERM BIT(1),       /* WLM data not available                   
*                                      during this mintime      @A04C*/         
*          7 *        BIT(2),       /* Reserved for future use   @C2C*/         
*        5 GEIFLG2  BIT(8),         /* Additional flags          @81A*/         
*          7 GEIEDAT2 BIT(1),       /* Enhanced DAT Facility 2                  
*                                      available                @A04C*/         
*          7 GEIzCBP  BIT(1),       /* Monitor III data fields                  
*                                      with both zCBP and zAAP                  
*                                      (IFA) names contain data                 
*                                      about zCBP processors    @A04C*/         
*          7 GEI_RUCSA_Defined BIT(1), /* RUCSA is defined      @A04C*/         
*          7 *        BIT(5),       /* Reserved for future use   @92C*/         
*        5 *        BIT(16),        /* Reserved for future use   @81C*/         
*      3 GEISLID CHAR(4),           /* ID of slip trap           @B2A*/         
*      3 GEIIPLTI CHAR(8),          /* IPL time in TOD format                   
*                                      (local time)              @B3A*/         
*      3 GEIWLMTK CHAR(8),          /* WLM token                 @C1A*/         
*      3 GEISPLX  CHAR(8),          /* Sysplex name              @C3A*/         
*      3 GEISYSNM CHAR(8),          /* MVS system name           @E1A*/         
*      3 GEIMAXAS FIXED(32),        /* Maximum number of address                
*                                      spaces                    @E2A*/         
*      3 GEIESMCT,                  /* Storage frame movement counts            
*                                      (no longer gathered)      @63C*/         
*        ?ERBFITEM(5 GEIESPMB) FLOAT(24);, /* Reserved           @63C*/         
*        ?ERBFITEM(5 GEIESPME) FLOAT(24);, /* Reserved           @63C*/         
*        ?ERBFITEM(5 GEIESMRB) FLOAT(24);, /* Reserved           @63C*/         
*        ?ERBFITEM(5 GEIESMRE) FLOAT(24);, /* Reserved           @63C*/         
*      3 GEIMDL CHAR(16),           /* EBCDIC CPC model identifier              
*                                                                @I1A*/         
*      3 GEISEQ CHAR(16),           /* EBCDIC CPC sequence number               
*                                                                @J1A*/         
*      3 GEIMASTR,                  /* Storage values of master                 
*                                      address space,                           
*                                      all short floating point  @L1A*/         
*        5 GEILOAL CHAR(4) BDY(WORD),                              /*           
*                                      User region value allocated              
*                                      below 16M                 @L1A*/         
*        5 GEIHIAL CHAR(4) BDY(WORD),                              /*           
*                                      LSQA/SWA/229/230 value allocated         
*                                      below 16M                 @L1A*/         
*        5 GEIELOAL CHAR(4) BDY(WORD),                             /*           
*                                      User region value allocated              
*                                      above 16M                 @L1A*/         
*        5 GEIEHIAL CHAR(4) BDY(WORD),                             /*           
*                                      LSQA/SWA/229/230 value allocated         
*                                      above 16M                 @L1A*/         
*      3 GEIEMC,                    /* Storage values for eServer               
*                                      metrics collector,                       
*                                      all short floating point  @L2A*/         
*        5 GEITOTPI CHAR(4) BDY(WORD),                              /*          
*                                      Total number of pages paged-in           
*                                      exluding swap-in, VIO, and               
*                                      hiperspace page-ins                      
*                                      - current value           @31C*/         
*        5 GEISLTA  CHAR(4) BDY(WORD),                             /*           
*                                      Number of currently available            
*                                      slots                     @L2A*/         
*      3 GEILPS,                    /* Storage values for system-wide           
*                                      memory objects support    @21C*/         
*        ?ERBFITEM(5 GEIRLMO) FLOAT(24);,                          /*           
*                                      Number of fixed memory objects           
*                                      that are allocated in the system         
*                                      and can be backed in 1 MB                
*                                      frames                    @61C*/         
*        ?ERBFITEM(5 GEIRLPR) FLOAT(24);,                          /*           
*                                      Number of 1 MB pages fixed in            
*                                      central storage           @72C*/         
*        ?ERBFITEM(5 GEICMO)  FLOAT(24);,                          /*           
*                                      Number of high virtual common            
*                                      memory objects allocated  @61C*/         
*        ?ERBFITEM(5 GEICFR)  FLOAT(24);,                          /*           
*                                      Number of high virtual common            
*                                      memory pages backed in central           
*                                      storage                   @61C*/         
*        ?ERBFITEM(5 GEICFFR) FLOAT(24);,                          /*           
*                                      Number of high virtual common            
*                                      memory pages fixed in central            
*                                      storage                   @61C*/         
*        ?ERBFITEM(5 GEICASL) FLOAT(24);,                          /*           
*                                      Number of high virtual common            
*                                      memory auxiliary storage slots           
*                                      (DASD and SCM)        @OA38660*/         
*        ?ERBFITEM(5 GEISMO)  FLOAT(24);,                          /*           
*                                      Number of high virtual shared            
*                                      memory objects allocated  @61C*/         
*        ?ERBFITEM(5 GEISFR)  FLOAT(24);,                          /*           
*                                      Number of high virtual common            
*                                      memory pages backed in central           
*                                      storage                   @61C*/         
*        ?ERBFITEM(5 GEICSIZ) FLOAT(56);,                          /*           
*                                      High virtual common area size            
*                                                                @61C*/         
*        ?ERBFITEM(5 GEISSIZ) FLOAT(56);,                          /*           
*                                      High virtual shared area size            
*                                                                @61C*/         
*        ?ERBFITEM(5 GEILSIZ) FLOAT(24);,                          /*           
*                                      Maximum number of 1 MB frames            
*                                      that can be used by fixed                
*                                      1 MB pages                @82C*/         
*      3 GEIRTFIX CHAR(4) BDY(WORD),/* Total number of fixed frames             
*                                                                @22A*/         
*      3 GEIRBFIX CHAR(4) BDY(WORD),/* Number of fixed frames below             
*                                      16 MB central storage     @61C*/         
*      3 GEIRSRVD4,                 /* internal use             @A04A*/         
*        5 GEITOTPO FIXED(32) BDY(WORD),                           /*           
*                                      Total number of pages paged-in           
*                                      exluding swap-in, VIO, and               
*                                      hiperspace page-ins                      
*                                      - previous value         @A04C*/         
*      3 GEIPLP,                    /* Storage values for pageable              
*                                      large pages and SCM   @OA38660*/         
*        ?ERBFITEM(5 GEICUSE) FLOAT(56);,                          /*           
*                                      Number of high virtual common            
*                                      pages in-use              @61A*/         
*        ?ERBFITEM(5 GEISUSE) FLOAT(56);,                          /*           
*                                      Number of pages in-use by                
*                                      shared memory objects     @93C*/         
*        ?ERBFITEM(5 GEILPAG) FLOAT(24);,                          /*           
*                                      Reserved                  @82C*/         
*        ?ERBFITEM(5 GEILFUSE) FLOAT(24);,                         /*           
*                                      Number of 1 MB frames that are           
*                                      in-use and are no longer avai-           
*                                      lable for fixed 1 MB pages               
*                                                                @82C*/         
*        ?ERBFITEM(5 GEILPUSE) FLOAT(24);,                         /*           
*                                      Number of 1 MB frames used by            
*                                      pageable/DREF memory objects             
*                                                                @61A*/         
*        ?ERBFITEM(5 GEISASL) FLOAT(24);,                          /*           
*                                      Number of high virtual shared            
*                                      memory auxiliary storage slots           
*                                      (DASD and SCM)        @OA38660*/         
*      3 GEICLR2,                   /* Fields to be cleared      @64A*/         
*        ?ERBFITEM(5 GEIRSTRF) FLOAT(56);,                         /*           
*                                      Number of online real storage            
*                                      frames                    @64A*/         
*        ?ERBFITEM(5 GEILCPR)  FLOAT(56);,                         /*           
*                                      Number of 1 MB high virtual              
*                                      common memory pages backed in            
*                                      central storage           @65A*/         
*        ?ERBFITEM(5 GEILCMO)  FLOAT(24);,                         /*           
*                                      Number of fixed memory objects           
*                                      allocated in high virtual                
*                                      common storage that can be               
*                                      backed in 1 MB frames     @65A*/         
*        ?ERBFITEM(5 GEILF4K)  FLOAT(24);,                         /*           
*                                      Reserved                  @82C*/         
*        ?ERBFITEM(5 GEILP4K)  FLOAT(24);,                         /*           
*                                      Reserved                  @82C*/         
*        ?ERBFITEM(5 GEILPFRI) FLOAT(24);,                         /*           
*                                      Number of failed 1 MB pageable           
*                                      pages that were requested @65A*/         
*        ?ERBFITEM(5 GEILPFCI) FLOAT(24);,                         /*           
*                                      Number of demoted 1 MB pageable          
*                                      pages that were converted from           
*                                      1 MB pages to 4K pages    @65A*/         
*        ?ERBFITEM(5 GEILCMU)  FLOAT(24);,                         /*           
*                                      Number of 1 MB high virtual              
*                                      common memory objects whose              
*                                      owner is no longer active @65A*/         
*        ?ERBFITEM(5 GEILCPU)  FLOAT(56);,                         /*           
*                                      Number of 1 MB high virtual              
*                                      common memory pages whose                
*                                      owner is no longer active @65A*/         
*        ?ERBFITEM(5 GEILFPF)  FLOAT(24);,                         /*           
*                                      Reserved                  @82C*/         
*      3 GEIRSRVD5,                 /* internal use             @A04A*/         
*        5 GEILPFRO Fixed(32),      /* Number of failed 1 MB pageable           
*                                      pages that were requested                
*                                      - previous value         @A04C*/         
*        5 GEILPFCO Fixed(32),      /* Number of demoted 1 MB pageable          
*                                      pages that were converted from           
*                                      1 MB pages to 4K pages                   
*                                      - previous value         @A04C*/         
*      3 GEICLR3,                   /* Fields to be cleared in long             
*                                      floating point format     @71A*/         
*       4 GEIRSRVD6 CHAR(112),      /* internal use             @A04A*/         
*%If IBM_CBGEN_PADI <> 'YES' %Then  /* Skip internal fields                     
*                                      with CBGEN               @A04A*/         
*%Do;                                                         /*@A04A*/         
*        ?ERBFITEM(5 GEIRCOMA_DFl)  FLOAT(56);,                    /*           
*                                      Number of central storage                
*                                      common frames                            
*                                      (same as GEIRAFC_VE)      @71A*/         
*        ?ERBFITEM(5 GEIRAFC_DFl)  FLOAT(56);,                     /*           
*                                      Number of central storage                
*                                      available frames                         
*                                      (same as GEIRAFC_VE)      @71A*/         
*        ?ERBFITEM(5 GEIRSHR_DFl)  FLOAT(56);,                     /*           
*                                      Number of central storage                
*                                      shared frames                            
*                                      (same as GEIRSHR_VE)      @71A*/         
*        ?ERBFITEM(5 GEISLTA_DFl)  FLOAT(56);,                     /*           
*                                      Number of currently available            
*                                      slots                                    
*                                      (same as GEISLTA_VE)      @71A*/         
*        ?ERBFITEM(5 GEIRLPR_DFl) FLOAT(56);,                      /*           
*                                      Number of 1 MB pages fixed in            
*                                      central storage                          
*                                      (same as GEIRLPR)         @72C*/         
*        ?ERBFITEM(5 GEICFR_DFl)  FLOAT(56);,                      /*           
*                                      Number of high virtual common            
*                                      memory pages backed in central           
*                                      storage                                  
*                                      (same as GEICFR_VE)       @71A*/         
*        ?ERBFITEM(5 GEICFFR_DFl)  FLOAT(56);,                     /*           
*                                      Number of high virtual common            
*                                      memory pages fixed in central            
*                                      storage                                  
*                                      (same as GEICFFR_VE)      @71A*/         
*        ?ERBFITEM(5 GEICASL_DFl)  FLOAT(56);,                     /*           
*                                      Number of high virtual common            
*                                      memory auxiliary storage slots           
*                                      (DASD and SCM)                           
*                                      (same as GEICASL_VE)      @71A*/         
*        ?ERBFITEM(5 GEISFR_DFl)  FLOAT(56);,                      /*           
*                                      Number of high virtual shared            
*                                      memory pages backed in central           
*                                      storage                                  
*                                      (same as GEISFR_VE)       @71A*/         
*        ?ERBFITEM(5 GEILSIZ_DFl) FLOAT(56);,                      /*           
*                                      Maximum number of 1 MB frames            
*                                      that can be used by fixed                
*                                      1 MB pages                               
*                                      (same as GEILSIZ)         @82C*/         
*        ?ERBFITEM(5 GEILPAG_DFl) FLOAT(56);,                      /*           
*                                      Reserved                                 
*                                      (same as GEILPAG)         @82C*/         
*        ?ERBFITEM(5 GEILFUSE_DFl) FLOAT(56);,                     /*           
*                                      Number of 1 MB frames that are           
*                                      in-use and are no longer avai-           
*                                      lable for fixed 1 MB pages               
*                                      (same as GEILFUSE)        @82C*/         
*        ?ERBFITEM(5 GEILPUSE_DFl) FLOAT(56);,                     /*           
*                                      Number of 1 MB frames used by            
*                                      pageable/DREF memory objects             
*                                      (same as GEILPUSE)        @71A*/         
*        ?ERBFITEM(5 GEISASL_DFl)  FLOAT(56);,                     /*           
*                                      Number of high virtual shared            
*                                      memory auxiliary storage slots           
*                                      (DASD and SCM)                           
*                                      (same as GEISASL_VE)      @71A*/         
*%End;                              /* Skip internal fields                     
*                                      with CBGEN               @A04A*/         
*       4 GEINRSRVD6,                                         /*@A04A*/         
*        ?ERBFITEM(5 GEILSMO)      FLOAT(56);,                     /*           
*                                      Number of memory objects                 
*                                      allocated in high virtual shared         
*                                      storage that can be backed in            
*                                      1 MB frames               @72A*/         
*        ?ERBFITEM(5 GEIRFREM)     FLOAT(56);,                     /*           
*                                      Number of freemained frames in           
*                                      all address spaces        @73A*/         
*      3 GEICLR4,                   /* Fields to be cleared, related            
*                                      to 2GB frames             @81A*/         
*        ?ERBFITEM(5 GEIRGMO) FLOAT(56);,                          /*           
*                                      Number of fixed memory objects           
*                                      that are allocated in the system         
*                                      and are backed in 2 GB frames            
*                                                                @81A*/         
*        ?ERBFITEM(5 GEIRGPR) FLOAT(56);,                          /*           
*                                      Number of 2 GB pages fixed in            
*                                      central storage           @81A*/         
*        ?ERBFITEM(5 GEIGFUSE) FLOAT(56);,                         /*           
*                                      Number of 2 GB frames used by            
*                                      fixed memory objects      @81A*/         
*        ?ERBFITEM(5 GEIGSIZ) FLOAT(56);,                         /*            
*                                      Number of 2 GB frames that can           
*                                      be used by fixed 2 GB memory             
*                                      objects                   @81A*/         
*      3 GEICLR5,                   /* Field to be cleared, related to          
*                                      RSM real storage area changes            
*                                                                @82A*/         
*        ?ERBFITEM(5 GEILUSE) FLOAT(56);,                          /*           
*                                      Number of 1 MB frames in central         
*                                      storage that are in-use by               
*                                      memory objects            @82A*/         
*        ?ERBFITEM(5 GEILTOT) FLOAT(56);,                          /*           
*                                      Total number of 1 MB frames in           
*                                      central storage           @82A*/         
*        ?ERBFITEM(5 GEISMO_DFl)  FLOAT(56);,                      /*           
*                                      Number of high virtual shared            
*                                      memory objects allocated                 
*                                      (same as GEISMO)          @82A*/         
*      3 GEIRUCSAIPL,               /* IPL Definitions of RUCSA                 
*                                      and ERUCSA                @92A*/         
*        5 GEIRUCSASZ   FIXED(31),  /* size of RUCSA below       @92A*/         
*        5 GEIERUCSAZ   FIXED(31),  /* size of RUCSA above       @92A*/         
*      3 GEIRUCSA,                  /* Miscellaneous RUCSA fields               
*                                                                @92A*/         
*        5 GEIRUCSAMAX,             /* Maximum common storage                   
*                                      allocation in RUCSA of                   
*                                      this MINTIME              @92A*/         
*          7  GEIRUCSAMX FIXED(31), /* Max. alloc. RUCSA below   @92A*/         
*          7  GEIERUCSAX FIXED(31), /* Max. alloc. RUCSA above   @92A*/         
*        5 GEIRUCSASNP,             /* Snapshot values of common                
*                                      storage allocation in RUCSA              
*                                      at the end of the MINTIME @92A*/         
*          7  GEIRUCSASP FIXED(31), /* Current alloc. RUCSA bel  @92A*/         
*          7  GEIERUCSAP FIXED(31), /* Current alloc. RUCSA abv  @92A*/         
*        5 GEIRUCSAVG,              /* Accumulated Common Storage               
*                                      allocated in RUCSA in this               
*                                      MINTIME, all short format                
*                                      floating point            @92A*/         
*          7  GEIRUCSAAV CHAR(4),   /* Acc. alloc. RUCSA below   @92A*/         
*          7  GEIERUCSAV CHAR(4),   /* Acc. alloc. RUCSA above   @92A*/         
*        5 GEIRUCSARE FIXED(31),    /* Amount of unallocated common             
*                                      area left in RUCSA <16M   @92A*/         
*        5 GEIRUCSASYS,             /* Accumulated Common Storage               
*                                      in RUCSA held by the system              
*                                      in this MINTIME, all short               
*                                      format floating point     @92A*/         
*          7 GEIRUCSAAS   CHAR(4),  /* Acc. alloc. RUCSA below   @92A*/         
*          7 GEIERUCSAS   CHAR(4),  /* Acc. alloc. RUCSA above   @92A*/         
*        5 GEIBATAS2,               /* Accumulated Common Storage               
*                                      in RUCSA held by active BATCH            
*                                      initiators in this MINTIME,              
*                                      all short format floating                
*                                      point                     @92A*/         
*          7 GEIBATRUCSA  CHAR(4),  /* Acc. alloc. RUCSA below held by          
*                                      active BATCH initiators   @92A*/         
*          7 GEIBATERUCSA CHAR(4),  /* Acc. alloc. RUCSA above held by          
*                                      active BATCH initiators   @92A*/         
*        5 GEIASCAS2,               /* Accumulated Common Storage               
*                                      in RUCSA held by active ASCH             
*                                      initiators in this MINTIME,              
*                                      all short format floating                
*                                      point                     @92A*/         
*          7 GEIASCRUCSA  CHAR(4),  /* Acc. alloc. RUCSA below held by          
*                                      active ASCH initiators    @92A*/         
*          7 GEIASCERUCSA CHAR(4),  /* Acc. alloc. RUCSA above held by          
*                                      active ASCH initiators    @92A*/         
*        5 GEIOMVAS2,               /* Accumulated Common Storage               
*                                      in RUCSA held by active OMVS             
*                                      initiators in this MINTIME,              
*                                      all short format floating                
*                                      point                     @92A*/         
*          7 GEIOMVRUCSA  CHAR(4),  /* Acc. alloc. RUCSA below held by          
*                                      active OMVS initiators    @92A*/         
*          7 GEIOMVERUCSA CHAR(4),  /* Acc. alloc. RUCSA above held by          
*                                      active OMVS initiators    @92A*/         
*    2 GEIEND CHAR(0) BDY(WORD);    /* Force word boundary           */         
*                                                                               
*/* the internal CPU data areas are moved to ERBCPUG3        @WA05435*/         
*                                                                               
*DCL GEIVERCB BIT(8) CONSTANT('19'X); /* Control block version number           
*                                                                @92C*/         
*                                                             /*2@63D*/         
*                                                                               
*/************************************************************38@A04A*/         
*@LOGIC;                                                                        
*#PRAGMA TOOL=CBGEN.                                                            
*#ALIGNOP.                                                                      
*#NOTUPPER.                                                                     
*#NOLEN.                                                                        
*/* internal use */                                                             
*#DELETE.GEIWTIMB                                                               
*#DELETE.GEIWTIME                                                               
*#DELETE.GEID204F                                                               
*#DELETE.GEICBP                                                                 
*#DELETE.GEICPUOL                                                               
*#DELETE.GEIAHUIC                                                               
*#DELETE.GEIRPOOL                                                               
*#DELETE.GEIRCOMA                                                               
*#DELETE.GEIRSQAA                                                               
*#DELETE.GEIRAFC                                                                
*#DELETE.GEINUCA                                                                
*#DELETE.GEIRSHR                                                                
*#DELETE.GEIVECOL                                                               
*#DELETE.GEIESQAF                                                               
*#DELETE.GEIRLPAF                                                               
*#DELETE.GEIELPAF                                                               
*#DELETE.GEIRCSAF                                                               
*#DELETE.GEIECSAF                                                               
*#DELETE.GEIASQAO                                                               
*#DELETE.GEICPM                                                                 
*#DELETE.GEITOTPO                                                               
*#DELETE.GEILPFRO                                                               
*#DELETE.GEILPFCO                                                               
*#DELETE.GEISMO_DFl                                                             
*/* keep field name because mentioned in comments */                            
*#REPLACE.GEIzCBP                                                               
*GEIzCBP           EQU   X'40'      Reserved                                    
*#EREPLACE.                                                                     
*/**/                                                                           
*#EPRAGMA.                                                                      
*#PRAGMA TOOL=PADI.                                                             
*#PADIDELETE.GEIzCBP                                                            
*#PADIDELETE.GEIzCBP_REPLACED                                                   
*#EPRAGMA.                                                                      
*@ENDLOGIC;                                                                     
*/* End of PL/X Source                                               */         
* %IF ERBGEIG3_LIST = 'NO' !                                                    
*    ZCBPRINT = 'NO' %THEN                                                      
* %DO;                                                                          
*   @LIST POP NOECHO;                                                           
* %END;                                                                         
* %END;                                                                         
