*/*      Bilingual Mapping Macro OVERVIEW record                                
         MACRO                                                                  
         ERBOVREC ,                                                  */         
*/*** START OF SPECIFICATIONS ****************************************          
*                                                                    *          
*01* Proprietary Statement:                                          *          
*       Licensed Materials - Property of IBM                   @61A  *          
*       "Restricted Materials of IBM"                          @61A  *          
*       Copyright IBM Corp. 1994, 2013                         @61A  *          
*                                                                    *          
*       Status: z/OS V2R1 RMF (HRM7790)                        @61A  *          
*                                                                    *          
*01* Macro Name: ERBOVREC                                            *          
*01*                                                                 *          
*01* Important: The Records have been designed for PC applications ] *          
*               The PC download/receive function will cut off the    *          
*               first 4 Bytes (Length and Segment Information).      *          
*               If this record should be processed by any            *          
*               Host Application, that application must assure the   *          
*               correct offset of the following variables:           *          
*                                                                    *          
*               OVRCOLO, OVRDATO                                     *          
*               by adding 4 bytes to the calculated value.           *          
*                                                                    *          
*               OVRECLGT                                             *          
*               by adding ((OVRDATRN+1)*4) bytes to the calculated   *          
*               value                                                *          
*                                                                    *          
*01* Descriptive Name: OVERVIEW Header and Overview Data Record      *          
*                                                                    *          
*01* DSECT Name: OVRHDR, OVRREP, OVRDATA, OVRACTDATA                 *          
*                                                                    *          
*01* Component: Resource Measurement Facility (27404)                *          
*                                                                    *          
*01* Eye-Catcher: RMFOVREC                                           *          
*                                                                    *          
*01* Storage Attributes:                                             *          
*02*   Subpool:  0                                                   *          
*02*   Key:  8                                                       *          
*02*   Residency:  Above                                             *          
*02*   Main Storage:  N/A                                            *          
*02*   Auxiliary Storage:  N/A                                       *          
*02*   Virtual Storage:  N/A                                         *          
*                                                                    *          
*01* Function = This macro maps the complete OVERVIEW Header and     *          
*               Overview Data record.                                *          
*                                                                    *          
*           The Header Record consists out of 2 parts:               *          
*           1. Overview_header_section                               *          
*           2. Overview_report_column_names_section                  *          
*                                                                    *          
*           The Data Record consists out of 2 parts:                 *          
*           1. Overview_data_section                                 *          
*           2. Overview_report_data_section                          *          
*                                                                    *          
*01* Notes : One Header Record is followed by "n" data records.      *          
*            Every new SYSID will generate a new Header record       *          
*            followed by "n" data records.                           *          
*                                                                    *          
*            if for any reason the Record Mapping must be changed,   *          
*            the OVRLVL (Overview Record level change number) set    *          
*            within ERBMFXCB must be increased by 1 too.             *          
*            (OVRLVLC in Procedure PUTOVWRC)                         *          
*            Don't forget the C++ Module: RMF2SC (Spreadsheet Con-   *          
*            verter)                                                 *          
*01* Size:                                                           *          
*01* Header Record:                                                  *          
*     - Header          :  96 bytes                                  *          
*     - Report column   :  82 bytes (per column)                     *          
*01* Data Record:                                                    *          
*     - Data            :  44 bytes                                  *          
*     - Report data     :  10 bytes (per column)                     *          
*                                                                    *          
*01* Method of Access: See below                                     *          
*                                                                    *          
*       BAL : ERBOVREC                                               *          
*                                                                    *          
*       PL/X: %INCLUDE SYSLIB(ERBOVREC) semicolon                    *          
*                                                                    *          
*01* Pointed to by: OVRPTR                                           *          
*                                                                    *          
*01* Serialization: None                                             *          
*                                                                    *          
*01* Created by:                                                     *          
*                                                                    *          
*02*    ERBMFXCB                                                     *          
*                                                                    *          
*01* Deleted by:                                                     *          
*                                                                    *          
*02*    ERBMFXCB                                                     *          
*                                                                    *          
*01* Module-type: BILINGUAL MAPPING MACRO                            *          
*                                                                    *          
*01* Frequency: 1                                                    *          
*                                                                    *          
*01* Dependencies: None                                              *          
*                                                                    *          
*01* Serialization: None                                             *          
*                                                                    *          
*01* Distribution Library: ARMFMAC1                                  *          
*                                                                    *          
*01* Change Activity = See below                                     *          
* Z-000000-999999                                                @ZAA*          
* $ZA=SPEV4,@WA05515,,FF:  Usability Enhancements - PP           @ZAA*          
* $E1=CVT,HRM5530,,SUW: Report new product type OS/390 and           *          
*         software level. Will be added with APAR OW15873            *          
*         (OS/390 Release 1).                                    @E1A*          
* THE: Year 2000 support (sliding window)                    @WA27552*          
* $G1=OVW,HRM6606,,HOL: Sysplex Overview Data                    @G1A*          
* THE: Ship with SMPE                                        @WA50084*          
* $01=ODP,HRM7730,,SHR: Overview duration processing             @01A*          
* $61=R790,HRM7790,,MWE: Explicit copyright for external macro   @61A*          
*                                                                    *          
****** End of Specifications *****************************************/         
*        %GOTO PLXOVR;                                                          
*/*                                                                             
         SPACE 3                                                                
**********************************************************************/         
**************  OVERVIEW HEADER RECORD  ******************************/         
**********************************************************************/         
**********************  OVERVIEW_Header_section ***********************         
OVRHDR    DSECT                                                                 
AMLEN     DS   XL2      Record length for Access Methode                        
AMSGMT    DS   XL2      Reserved                                                
OVRLEN    DS   XL2      Record length for PC                                    
OVRSGMT   DS   XL2      Reserved                                                
OVRTYPE   DS   CL8      Record type (eye catcher RMFOVREC)                      
OVRLVL    DS   CL1      Overview Record level change number                     
OVRTFLG   DS   CL1      Type flags                                              
OVRTYPX   EQU  X'80'    1 = sysplex record                                      
OVRTYPS   EQU  X'40'    1 = system record                                       
          DS   CL2      Reserved                                                
OVRRMFV   DS   CL3      RMF version number from SMF Record                      
          DS   CL1      Not used                                                
OVRMVS    DS   CL8      MVS or OS/390 Software level from SMF     @E1C          
*                       Record                                    @E1A          
OVRSID    DS   CL4      System ID from installation                             
OVRITIME  DS   CL6      TOD monitor interval start: HHMMSS                      
OVRIDATE  DS   CL7      DATE monitor interval start: 'YYYYDDD'                  
          DS   CL1      Not used                                                
OVRCYC    DS   CL4      Sampling CYCLE length: TTTT                             
OVRINT    DS   CL8      Interval length: HH.MM.SS                               
          DS   CL2      Reserved                                                
OVRECLGT  DS   XL4      Total length of Bytes for one SYSID                     
*                       Length of Header Record +                               
*                       (Length of Data Record *                                
*                       Number of Data Records)                                 
OVRCOLO   DS   XL4      Offset to first report-column-names section             
OVRCOLN   DS   XL4      Number of report-column-names sections                  
OVRCOLL   DS   XL4      Length of one report-column-names section               
OVRHDRN   DS   XL4      Overview Header Record counter                          
*                       first Header Record in Data Set has highest             
*                       number, numbers will be in decreasing order             
OVRDATRN  DS   XL4      Number of Overview Data Records                         
OVRSPLID  DS   CL8      Sysplex ID if OVRTYPX='1'             @WA50084          
***********************************************************************         
         SPACE                                                                  
**********************  Report_column_names_section *******************         
OVRREP   DSECT                                                                  
OVRRNAME  DS   CL8      Report_column name                                      
OVRCOND   DS   CL8      OVERVIEW_condition name                                 
OVRQUAL   DS   CL53     OVERVIEW_condition_qualifier name                       
          DS   CL1      Not used                                                
OVROPER   DS   CL2      Exception Operator (LE or GE)                           
OVRTHV    DS   CL9      Exception Threshold value                               
          DS   CL1      Not used                                                
**********************************************************************          
         SPACE                                                                  
**********************************************************************/         
**************  OVERVIEW DATA RECORD  ********************************/         
**********************************************************************/         
**********************  Overview_data_section  ***********************          
OVRDATA  DSECT                                                                  
AMDLEN    DS   XL2      Record length for Access Methode                        
AMDSGMT   DS   XL2      Reserved                                                
OVRDLEN   DS   XL2      Data Record length for PC                               
OVRDSGMT  DS   XL2      Reserved                                                
OVRDATO   DS   XL4      Offset to first report_data_section                     
OVRDATN   DS   XL4      Number of report_data_section                           
OVRDATL   DS   XL4      Length of one report_data_section                       
OVRRIDAT  DS   CL5      Reporting interval date (MM/DD)                         
          DS   CL1      Not used                                                
OVRRITME  DS   CL8      Reporting interval time (HH.MM.SS)                      
          DS   CL1      Not used                                                
OVRRIINT  DS   CL8      Reporting interval length (HH.MM.SS)       @01C         
          DS   CL1      Not used                                                
*         DS   CL3      Not used                                   @01D         
***********************************************************************         
         SPACE                                                                  
**********************  Report_data_section ***************************         
OVRACTDATA  DSECT                                                               
          DS   CL1      Not used                                                
OVRRVAL   DS   CL9      Report Actual data                                      
**********************************************************************          
         SPACE 3                                                                
         MEND ,                                                                 
*                                                                               
*%PLXOVR:;                          /*                               */         
*@SPACE;                                                                        
*/********************************************************************/         
*/************  OVERVIEW HEADER RECORD  ******************************/         
*/********************************************************************/         
*/* OVERVIEW Header section                                          */         
*/********************************************************************/         
*@SPACE;                                                                        
* DECLARE                                                                       
* 1 OVRHDR BASED(OVRHDRPTR),                                                    
*   3 AMLEN    FIXED(16),           /* Record length + 4 bytes for              
*                                      Access Methode                */         
*   3 AMSGMT   FIXED(16),           /* Reserved                      */         
*                                                                               
*  2 OVRHDRPC,                      /*                               */         
*                                                                               
*   3 OVRLEN   FIXED(16),           /* Record length for PC          */         
*   3 OVRSGMT  FIXED(16),           /*                               */         
*   3 OVRTYPE  CHAR(8),             /* RMFOVREC (eye catcher)        */         
*   3 OVRLVL   CHAR(1),             /* Record level 3            @01C*/         
*   3 OVRTFLG  BIT(8),              /* Type flags                @G1A*/         
*     5 OVRTYPX  BIT(1),            /* 1 = sysplex record        @G1A*/         
*     5 OVRTYPS  BIT(1),            /* 1 = system record         @G1A*/         
*     5 *        BIT(6),            /* Reserved                  @G1A*/         
*   3 *        CHAR(2),             /* Reserved                  @G1C*/         
*   3 *               ,             /*                               */         
*     5 OVRRMFV  CHAR(3),           /* RMF version number from                  
*                                      SMF Record                    */         
*     5 *        CHAR(1),           /* Not used                      */         
*   3 OVRMVS   CHAR(8),             /* MVS or OS/390 software level             
*                                      from SMF record           @E1C*/         
*   3 OVRSID   CHAR(4),             /* System ID from installation or           
*                                      blank if sysplex record   @G1C*/         
*   3 OVRITIME CHAR(6),             /* TOD monitor interval start               
*                                      HHMMSS                        */         
*   3 OVRIDATE,                     /* DATE monitor interval start:             
*                                      YYYYDDD               @WA27552*/         
*     5 OVRICENT CHAR(2),           /* YY high order 2 digit @WA27552*/         
*     5 OVRIDTYD CHAR(5),           /* YYDDD                         */         
*   3 *        CHAR(1),             /* Not used              @WA27552*/         
*   3 OVRCYC   CHAR(4),             /* Sampling CYCLE length: TTTT   */         
*   3 OVRINT   CHAR(8),             /* Interval length: HH.MM.SS     */         
*   3 *        CHAR(2),             /* Reserved for later use        */         
*   3 OVRECLGT FIXED(32),           /* Total length of header and               
*                                      data records for this syplex             
*                                      or system overview data   @G1C*/         
*   3 OVRCOLO  FIXED(31),           /* Offset to first                          
*                                      report-column-names section   */         
*   3 OVRCOLN  FIXED(31),           /* Number of                                
*                                      report-column-names sections  */         
*   3 OVRCOLL  FIXED(31),           /* Length of one                            
*                                      report-column-names section   */         
*   3 OVRHDRN  FIXED(31),           /* Overview Header Record counter           
*                                      first Header Record in data set          
*                                      has highest number, numbers will         
*                                      be in decreasing order.       */         
*   3 OVRDATRN FIXED(31),           /* Number of Data Records    @G1C*/         
*   3 OVRSPLID CHAR(8);             /* Sysplex ID if OVRTYPX='1' @G1A*/         
*@SPACE;                                                                        
*/********************************************************************/         
*/*                                                                  */         
*/* OVERVIEW report_column_names section                             */         
*/*                                                                  */         
*/********************************************************************/         
*@SPACE;                                                                        
* DECLARE                                                                       
* 1 OVRREP(1:*) BASED(ADDR(OVRHDR)+LENGTH(OVRHDR)),                             
*   3 OVRRNAME CHAR(8),             /* Report_column name            */         
*   3 OVRCOND  CHAR(8),             /* OVERVIEW_condition name       */         
*   3 *               ,             /* OVERVIEW_condition_qualifier  */         
*     5 OVRQUAL  CHAR(53),          /* Name                          */         
*     5 *        CHAR(1),           /* Not used                      */         
*   3 OVROPER    CHAR(2),           /* Exception Operator            */         
*   3 *               ,             /*                               */         
*     5 OVRTHV   CHAR(9),           /* Exception Threshold Value     */         
*     5 *        CHAR(1);           /* Not used                      */         
*@SPACE;                                                                        
*/********************************************************************/         
*/************  OVERVIEW DATA RECORD  ********************************/         
*/********************************************************************/         
*/*                     Overview_data_section                        */         
*/********************************************************************/         
*@SPACE;                                                                        
* DECLARE                                                                       
* 1 OVRDATA  BASED(OVRDATPTR),                                                  
*   3 AMDLEN    FIXED(16),          /* Record length + 4 bytes for              
*                                      Access Methode                */         
*   3 AMDSGMT   FIXED(16),          /* Reserved                      */         
*                                                                               
*  2 OVRDATAPC,                     /*                               */         
*                                                                               
*   3 OVRDLEN   FIXED(16),          /* Data Record length for PC     */         
*   3 OVRDSGMT FIXED(16),           /*                               */         
*   3 OVRDATO  FIXED(31),           /* Offset to first                          
*                                      Report_data_section           */         
*   3 OVRDATN  FIXED(31),           /* Number of                                
*                                      Report_data_sections          */         
*   3 OVRDATL  FIXED(31),           /* Length of one                            
*                                      Report_data_section           */         
*   3 *               ,             /* Reporting interval date       */         
*     5 OVRRIDAT CHAR(5),           /* MM/DD                         */         
*     5 *        CHAR(1),           /* Not used                      */         
*   3 *                 ,                                                       
*     5 OVRRITME CHAR(8),           /* Reporting interval time                  
*                                      HH.MM.SS                      */         
*     5 *        CHAR(1),           /* Not used                      */         
*   3 *               ,             /* Reporting interval length     */         
*     5 OVRRIINT CHAR(8),           /* HH.MM.SS                  @01C*/         
*     5 *        CHAR(1),           /* Not used                      */         
*   3 *          CHAR(0);           /* Not used                  @01C*/         
*/********************************************************************/         
*/*            Overview report_data_section                          */         
*/********************************************************************/         
* DECLARE                                                                       
* 1 OVRACTDATA(1:*) BASED(ADDR(OVRDATA) + LENGTH(OVRDATA)),                     
*   3 *            ,                                                            
*     5 *        CHAR(1),           /* Not used                      */         
*     5 OVRRVAL  CHAR(9);           /* Report Actual Data            */         
*%OVREND:;                                                                      
