*                                                                               
* %DCL ERBOPDG3_INCLUDED CHAR EXT;                                              
* %DEACTIVATE ERBOPDG3_INCLUDED;                                                
* %IF ERBOPDG3_INCLUDED = '' %THEN                                              
* %DO;                                                                          
*/* Macro made bi-lingual on 21195. CBGEN compile date 21138         */         
*% /*                                                                           
         MACRO                                                                  
         ERBOPDG3 &DSECT=YES,&LIST=YES,&TITLE=YES,&OPDARRAY=YES,       *        
               &OSDG3=COND,&OPDG3=COND                                          
             GBLC  &ERBOPDG3_INCLUDED                                           
             GBLC  &ZCBPRINT                                                    
&ERBOPDG3_INCLUDED SETC 'YES'                                                   
             AIF   ('&LIST' EQ 'NONE').P0                                       
             AIF   ('&TITLE' EQ 'NO').P5                                        
 TITLE       'ERBOPDG3  - Mapping macro for Mon III Data Gat UNIX Proce*        
               ss Data Table    '                                               
.P5          ANOP                                                               
**/ ;                                                                           
*/****  START OF SPECIFICATIONS  *************************************/         
*/*                                                                  */         
*/*01* PROPRIETARY STATEMENT:                                        */         
*/*       Licensed Materials - Property of IBM                       */         
*/*       "Restricted Materials of IBM"                              */         
*/*       Copyright IBM Corp. 2000, 2021                             */         
*/*                                                                  */         
*/*       Status: z/OS V2R5 Data Gatherer (HRG77D0)             @A03M*/         
*/*                                                                  */         
*/*01* MACRO NAME: ERBOPDG3                                          */         
*/*                                                                  */         
*/*01* DESCRIPTIVE NAME:                                             */         
*/*    Mapping macro for Mon III Data Gat UNIX Process Data Table    */         
*/*                                                             @A03C*/         
*/*                                                             @A03D*/         
*/*01* DSECT NAME: OPDARRAY                                          */         
*/*                OPDG3                                             */         
*/*                                                                  */         
*/*01* COMPONENT: zOS Data Gatherer (27401)                          */         
*/*                                                                  */         
*/*01* EYE-CATCHER:  OPDG3                                           */         
*/*02*  OFFSET:  0                                                   */         
*/*02*  LENGTH:  5                                                   */         
*/*                                                                  */         
*/*01* STORAGE ATTRIBUTES:                                           */         
*/*02*  SUBPOOL: N/A                                                 */         
*/*02*  KEY:     8                                                   */         
*/*02*  RESIDENCY:  Above 16 MB in virtual storage or in dataspace   */         
*/*02*  MAIN STORAGE: Not applicable                                 */         
*/*02*  AUXILIARY STORAGE:  Not applicable                           */         
*/*02*  VIRTUAL STORAGE:  Not applicable                             */         
*/*                                                                  */         
*/*01* SIZE:                                                    @A03C*/         
*/*            OPDARRAY -- X'0130' bytes                             */         
*/*            OSDG3    -- X'0034' bytes                             */         
*/*            OPDG3    -- X'00B0' bytes                             */         
*/*                                                                  */         
*/*01* POINTED TO BY: n/a                                            */         
*/*                                                                  */         
*/*01* SERIALIZATION: None                                           */         
*/*                                                                  */         
*/*01* FUNCTION: This macro maps the Monitor III Data Gatherer       */         
*/*              USS Process Data Table (OPDARRAY) and the           */         
*/*              according entries.                             @A03C*/         
*/*                                                             @A03D*/         
*/*01* METHOD OF ACCESS:                                             */         
*/*02*  ASM:                                                         */         
*/*          ERBOPDG3                                           @A03A*/         
*/*                                                                  */         
*/*02*  PL/X:                                                        */         
*/*          OPDG3 is declared as a based structure                  */         
*/*                                                                  */         
*/*          PERCENT INCLUDE SYSLIB(ERBOPDG3) SEMICOLON              */         
*/*                                                                  */         
*/*01* STATUS: z/OS V2R5 Data Gatherer (HRG77D0)                     */         
*/*                                                                  */         
*/*01* FREQUENCY: 1                                                  */         
*/*                                                                  */         
*/*01* DEPENDENCIES:  N/A                                            */         
*/*                                                                  */         
*/*01* DISTRIBUTION LIBRARY: AGRBMAC1                           @A03C*/         
*/*                                                                  */         
*/*01* CHANGE ACTIVITY: See below                                    */         
*/*                                                                  */         
*/*   $I0=USS,HRM7703,,HOL: Mon III USS Support                      */         
*/*   GUB: z/OS V1R3 OMVS Restart Support                    @WA50187*/         
*/*   $71=MT2,OA44101,,MWe: MT-2 Support                         @71A*/         
*/*   $A02=ZOSB,HRG77D0,,JBa: Rename prefix ERB to GRB          @A02A*/         
*/*   $A03=ZOSB,HRG77D0,,JBa: Make macro bilingual              @A03A*/         
*/*                                                                  */         
*/****  END OF SPECIFICATIONS  ***************************************/         
*% /*                                                                           
.P0          ANOP                                                               
             AIF   ('&ZCBPRINT' EQ 'NO').P1                                     
             AIF   ('&LIST' EQ 'YES').P2                                        
.P1          ANOP                                                               
             PUSH  PRINT                                                        
             PRINT OFF                                                          
.P2          ANOP                                                               
*                                                                               
*                                                                               
*                                                                               
OPDVERCB     EQU   X'01'           Version number                               
OPDACRO_0TO3 EQU   C'OPDG'         Acronym part 1                               
OPDACRO_4    EQU   C'3'            Acronym part 2                               
             AIF   ('&OPDARRAY' EQ 'NO').L0002                                  
             AIF   ('&DSECT' EQ 'YES').L0003                                    
             AIF   ('&OPDARRAY' NE 'YES').L0002                                 
.L0003       ANOP                                                               
*                                                                               
* ********************************************************************          
* *                                                                  *          
* * OPDARRAY: Control information                                    *          
* *                                                                  *          
* ********************************************************************          
*                                                                               
*                                                                               
             AIF   ('&DSECT' EQ 'YES').L0004                                    
OPDARRAY     DS    0F              USS Process data table                       
             AGO   .L0005                                                       
.L0004       ANOP                                                               
OPDARRAY     DSECT                 USS Process data table                       
.L0005       ANOP                                                               
OPDHEAD      DS    CL128           USS Process data table header                
             ORG   OPDHEAD                                                      
OPDOPDG3     DS    CL5             Acronym OPDG3                                
OPDVerG3     DS    CL1             Version                                      
OPDHdrle     DS    H               Length of OPDG3 header                       
OPDTotle     DS    F               Total length of OPDG3 (all          *        
                                   sub-comp)                                    
OPDEntO      DS    F               Offset to OPDG3 array                        
OPDEntL      DS    F               Length of OPDG3 entry                        
OPDEntN      DS    F               Number of OPDG3 entries                      
OPDSumO      DS    F               Offset to Summary data                       
OPDSumL      DS    F               Summary data length                          
OPDStat      DS    BL4             Flags                                        
*  Bit definitions:                                                             
OPDInact     EQU   X'80'           OMVS inactive                                
             DS    BL.031          Reserved                                     
             ORG   OPDStat+4                                                    
             DS    CL92            Reserved                                     
OPDENTRY     DS    CL176           Array of OPDG3 entries                       
.L0002       ANOP                                                               
             AIF   ('&OSDG3' EQ 'NO').L0006                                     
             AIF   ('&DSECT' EQ 'YES').L0007                                    
             AIF   ('&OSDG3' NE 'YES').L0006                                    
.L0007       ANOP                                                               
*                                                                               
* ********************************************************************          
* *                                                                  *          
* * OSDG3: Summary information                                       *          
* *                                                                  *          
* ********************************************************************          
*                                                                               
*                                                                               
             AIF   ('&DSECT' EQ 'YES').L0008                                    
OSDG3        DS    0F              OSDG3-entry                                  
             AGO   .L0009                                                       
.L0008       ANOP                                                               
OSDG3        DSECT                 OSDG3-entry                                  
.L0009       ANOP                                                               
OSDProc      DS    CL8             OMVS procedure name                          
OSDK         DS    F                                                            
             ORG   OSDK                                                         
             DS    H                                                            
OSDKASID     DS    H               Kernel address space ID                      
OSDPList     DS    CL40            OMVS Parm lib member list                    
.L0006       ANOP                                                               
             AIF   ('&OPDG3' EQ 'NO').L000A                                     
             AIF   ('&DSECT' EQ 'YES').L000B                                    
             AIF   ('&OPDG3' NE 'YES').L000A                                    
.L000B       ANOP                                                               
*                                                                               
* ********************************************************************          
* *                                                                  *          
* * OPDG3: Process details                                           *          
* *                                                                  *          
* ********************************************************************          
*                                                                               
*                                                                               
             AIF   ('&DSECT' EQ 'YES').L000C                                    
OPDG3        DS    0F              OPDG3-entry                                  
             AGO   .L000D                                                       
.L000C       ANOP                                                               
OPDG3        DSECT                 OPDG3-entry                                  
.L000D       ANOP                                                               
OPDJobnm     DS    CL8             Job name (as noted in ASCB)                  
OPDUser      DS    CL8             User name (from login)                       
OPDPid       DS    F               Process ID                                   
OPDPPid      DS    F               Parent's process ID                          
OPDAsid      DS    H               Address space ID. Undefined state   *        
                                   if 0                                         
             DS    CL5             Reserved                                     
OPDStrtD     DS    CL7             Start date                                   
             ORG   OPDStrtD                                                     
OPDStyy      DS    CL4             4-digit year                                 
OPDStdd      DS    CL3             3-digit day of year (1-366)                  
OPDStrtT     DS    CL6             Start time (local time)                      
             ORG   OPDStrtT                                                     
OPDSthh      DS    CL2             Process start time hour                      
OPDStmm      DS    CL2             Process start time minute                    
OPDStss      DS    CL2             Process start time second                    
OPDCt        DS    CL8             Process system and user compute     *        
                                   time in STCK format                          
OPDCStat     DS    BL4             Process state flags                          
             ORG   OPDCStat                                                     
OPDStat1     DS    B               MVS status flags                             
*  Bit definitions:                                                             
OPDSwap      EQU   X'80'           Space swapped out                            
OPDWaitP     EQU   X'40'           Ptrace Kernel wait                           
OPDStat2     DS    B               Process status flags                         
*  Bit definitions:                                                             
OPDStpd      EQU   X'80'           Process stopped                              
OPDMThrd     EQU   X'20'           0 = one OMVS task                            
OPDPThrd     EQU   X'10'           0 = no pthread task in process               
OPDStat3     DS    B               State of reported task                       
             DS    B               Reserved                                     
OPDLwpid     DS    F               Latch process ID the process is     *        
                                   waiting for (0 = not waiting)                
OPDGFlgs     DS    BL4             General flags                                
*  Bit definitions:                                                             
OPDSIVld     EQU   X'80'           Server information OPDSInfo valid            
             DS    BL.031          Reserved                                     
             ORG   OPDGFlgs+4                                                   
OPDSInfo     DS    CL44            Server information                           
             ORG   OPDSInfo                                                     
OPDSName     DS    CL32            Server name in mixed case                    
OPDAFile     DS    F               Number of active files                       
OPDMFile     DS    F               Maximum files                                
OPDSType     DS    F               Server type                                  
OPDCmnd      DS    CL40            Truncated command buffer in mixed   *        
                                   case                                         
OPDExtn      DS    CL16            Extension with computed values               
             ORG   OPDExtn                                                      
OPDDCt       DS    CL8             Delta TCB time (TOD)                         
OPDDCtIIP    DS    CL8             Delta TCB time for zIIP (TOD).      *        
                                   Delta TCB time for zAAP is not      *        
                                   provided by z/OS USS because z13    *        
                                   (and later) procs do not support    *        
                                   zAAP                                         
OPDMT        DS    CL4             internal use                                 
OPDCtIIP     DS    CL8             Process system and user compute     *        
                                   time on zIIP                                 
*                                                                               
* ********************************************************************          
* *                                                                  *          
* * Status constants (derived from BPXZODMV)                         *          
* *                                                                  *          
* ********************************************************************          
*                                                                               
*                                                                               
*                                                                               
* ********************************************************************          
* *                                                                  *          
* * OPDStat3 constants                                               *          
* *                                                                  *          
* ********************************************************************          
*                                                                               
*                                                                               
OPD_Zombie   EQU   C'Z'            Process terminated and parent has   *        
                                   not complete wait                            
OPD_Zombie2  EQU   C'L'            Process terminated and still        *        
                                   session or process group leader              
OPD_QuiesceT EQU   C'Q'            Quiese termination wait                      
*                                                                               
* ********************************************************************          
* *                                                                  *          
* * OPDStat3 and OTDStat2 constants                                  *          
* *                                                                  *          
* ********************************************************************          
*                                                                               
*                                                                               
OPD_Msgrcv   EQU   C'A'            IPC msgrcv wait                              
OPD_Msgsnd   EQU   C'B'            IPC msgsnd wait                              
OPD_WaitC    EQU   C'C'            Comm KernelWait                              
OPD_Semop    EQU   C'D'            IPC semop wait                               
OPD_WaitF    EQU   C'F'            File System Kernel Wait                      
OPD_MVSPause EQU   C'G'            MVSPause                                     
OPD_WaitO    EQU   C'K'            Other Kernel Wait                            
OPD_Run      EQU   C'R'            Not kernel wait                              
OPD_Sleep    EQU   C'S'            sleep() issued                               
OPD_Fork     EQU   C'X'            Fork new process                             
OPD_Child    EQU   C'W'            Waiting for child                            
*                                                                               
* ********************************************************************          
* *                                                                  *          
* * Constants for OpdStat3 and OTDStat5                              *          
* *                                                                  *          
* ********************************************************************          
*                                                                               
*                                                                               
OPD_Freeze   EQU   C'E'            Quiesce freeze                               
*                                                                               
* ********************************************************************          
* *                                                                  *          
* * Following constant are not returned by BPXEKDA. See remarks      *          
* * how to get those information                                     *          
* *                                                                  *          
* ********************************************************************          
*                                                                               
*                                                                               
OPD_OneTask  EQU   C'1'            Only one dubbed task: use when      *        
                                   both, OPDPThrd and OPDMThrd are     *        
                                   '0'b                                         
OPD_MultThds EQU   C'M'            Multiple threads which were NOT     *        
                                   pthread_create()'ed: use when       *        
                                   OPDMThrd is '1'b                             
OPD_Pthreads EQU   C'H'            Multiple threads exist. Some        *        
                                   created by pthread_create: Use when *        
                                   OPDPThrd is '1'b                             
OPD_Swapped  EQU   C'I'            Swapped out: Use when OPDSwap =     *        
                                   '1'b                                         
*                                                                               
* ********************************************************************          
* *                                                                  *          
* * Constant for OpdStat4                                            *          
* *                                                                  *          
* ********************************************************************          
*                                                                               
*                                                                               
OPD_StopSt   EQU   C'T'            Stopped: Use when OPDStpd = '1'b             
*                                                                               
* ********************************************************************          
* *                                                                  *          
* * Constant for OpdStat5                                            *          
* *                                                                  *          
* ********************************************************************          
*                                                                               
*                                                                               
OPD_Ptrace   EQU   C'P'            PTrace Kernel Wait: Use when        *        
                                   OPDWaitP is '1'b                             
.L000A       ANOP                                                               
             AIF   ('&ZCBPRINT' EQ 'NO').P3                                     
             AIF   ('&LIST' EQ 'YES').P4                                        
.P3          ANOP                                                               
             POP   PRINT                                                        
.P4          ANOP                                                               
.P_EXIT      ANOP                                                               
             MEND                                                               
**/ ;                                                                           
* %ERBOPDG3_INCLUDED = 'YES';                                                   
* %DCL ZCBPRINT CHAR EXT;                                                       
* %DEACTIVATE ZCBPRINT;                                                         
* %DCL ERBOPDG3_LIST CHAR EXT;                                                  
* %DEACTIVATE ERBOPDG3_LIST;                                                    
* %IF ERBOPDG3_LIST = 'NO' !                                                    
*    ZCBPRINT = 'NO' %THEN                                                      
* %DO;                                                                          
*   @LIST PUSH NOECHO;                                                          
*   @LIST NOASSEMBLE NOECHO;                                                    
*   @LIST OFF C NOECHO;                                                         
* %END;                                                                         
*/* Start of PL/X Source                                             */         
*                                                            /*2@A03D*/         
*%IBM_CBGEN_PADI = '';                                        /*@A03A*/         
*%If IBM_CBGEN = 'YES' ! IBM_PADI = 'YES' %Then %Do;          /*@A03A*/         
*   %IBM_CBGEN_PADI = 'YES';                                  /*@A03A*/         
*%End;                                                        /*@A03A*/         
*                                                                               
*%If IBM_CBGEN <> 'YES' %Then %Do;                            /*@A03A*/         
*/********************************************************************/         
*/*                                                                  */         
*/*01* CREATED BY: GRB3GOPD                                          */         
*/*                                                                  */         
*/*01* DELETED BY:  Not applicable                                   */         
*/*                                                                  */         
*/*                                                                  */         
*/**************************************************************@A03M*/         
*%End;                                                        /*@A03A*/         
*                                                                               
* Declare OPDVERCB          ] Version number                                    
*            Bit(8) Constant('01'x);                                            
*                                                                               
* Declare OPDACRO           ] Acronym of OPDG3                                  
*            Char(5) Constant('OPDG3');                                         
*                                                                               
*/********************************************************************/         
*/*                                                                  */         
*/* OPDARRAY: Control information                                    */         
*/*                                                                  */         
*/********************************************************************/         
*                                                                               
* Declare                                                                       
*   1 OPDARRAY Bdy(Word) Based,     ] USS Process data table                    
*     3 OPDHEAD,                    ] USS Process data table header             
*       4 OPDOPDG3 Char(5),         ] Acronym OPDG3                             
*       4 OPDVerG3 Char(1),         ] Version                                   
*       4 OPDHdrle Fixed(16),       ] Length of OPDG3 header                    
*       4 OPDTotle Fixed(31),       ] Total length of OPDG3                     
*                                   ] (all sub-comp)                            
*       4 OPDEntO  Fixed(31),       ] Offset to OPDG3 array                     
*       4 OPDEntL  Fixed(31),       ] Length of OPDG3 entry                     
*       4 OPDEntN  Fixed(31),       ] Number of OPDG3 entries                   
*       4 OPDSumO  Fixed(31),       ] Offset to Summary data                    
*       4 OPDSumL  Fixed(31),       ] Summary data length                       
*       4 OPDStat  Bit(32),         ] Flags                  @WA50187           
*         5 OPDInact Bit(1),        ] OMVS inactive          @WA50187           
*         5 *        Bit(31),       ] Reserved               @WA50187           
*       4 *        Char(92),        ] Reserved               @WA50187           
*%If IBM_CBGEN_PADI <> 'YES' %Then %Do;                        ] @A03A          
*     3 OPDENTRY(1:*) IsA(OPDG3);   ] Array of OPDG3 entries                    
*%End; %Else %Do;                                              ] @A03A          
*     3 OPDENTRY(1:*) Char(Length(OPDG3));                                      
*                                   ] Array of OPDG3 entries                    
*%End;                                                         ] @A03A          
*                                                                               
*/********************************************************************/         
*/*                                                                  */         
*/* OSDG3: Summary information                                       */         
*/*                                                                  */         
*/********************************************************************/         
*                                                                               
* Declare                                                                       
*   1 OSDG3 Type,                   ] OSDG3-entry                               
*     3 OSDProc  Char(8),           ] OMVS procedure name                       
*     3 OSDK     Fixed(32),         ]                            @A03C          
*       4 *        Fixed(16),       ]                                           
*       4 OSDKASID Fixed(16),       ] Kernel address space ID                   
*     3 OSDPList Char(40);          ] OMVS Parm lib member list                 
*                                                                               
*/********************************************************************/         
*/*                                                                  */         
*/* OPDG3: Process details                                           */         
*/*                                                                  */         
*/********************************************************************/         
*                                                                               
* Declare                                                                       
*   1 OPDG3 Type,                   ] OPDG3-entry                               
*     3 OPDJobnm Char(8),           ] Job name (as noted in ASCB)               
*     3 OPDUser  Char(8),           ] User name (from login)                    
*     3 OPDPid   Fixed(32),         ] Process ID                                
*     3 OPDPPid  Fixed(32),         ] Parent's process ID                       
*     3 OPDAsid  Fixed(16),         ] Address space ID. Undefined               
*                                   ] state if 0                 @A03C          
*     3 *        Char(5),           ] Reserved                                  
*     3 OPDStrtD Char(7),           ] Start date                                
*       4 OPDStyy  Char(4),         ] 4-digit year                              
*       4 OPDStdd  Char(3),         ] 3-digit day of year (1-366)               
*     3 OPDStrtT Char(6),           ] Start time (local time)                   
*       4 OPDSthh  Char(2),         ] Process start time hour                   
*       4 OPDStmm  Char(2),         ] Process start time minute                 
*       4 OPDStss  Char(2),         ] Process start time second                 
*     3 OPDCt    Char(8),           ] Process system and user compute           
*                                   ] time in STCK format                       
*     3 OPDCStat Bit(32),           ] Process state flags                       
*       4 OPDStat1 Bit(8),          ] MVS status flags                          
*         5 OPDSwap  Bit(1),        ] Space swapped out                         
*         5 OPDWaitP Bit(1),        ] Ptrace Kernel wait                        
*         5 *        Bit(6),        ] Reserved                                  
*       4 OPDStat2 Bit(8),          ] Process status flags                      
*         5 OPDStpd  Bit(1),        ] Process stopped                           
*         5 *        Bit(1),        ] Reserved                                  
*         5 OPDMThrd Bit(1),        ] 0 = one OMVS task                         
*         5 OPDPThrd Bit(1),        ] 0 = no pthread task in process            
*         5 *        Bit(4),        ] Reserved                                  
*       4 OPDStat3 Bit(8),          ] State of reported task                    
*       4 *        Bit(8),          ] Reserved                                  
*     3 OPDLwpid Fixed(32),         ] Latch process ID the process is           
*                                   ] waiting for (0 = not waiting)             
*     3 OPDGFlgs Bit(32),           ] General flags                             
*       4 OPDSIVld Bit(1),          ] Server information OPDSInfo               
*                                   ] valid                                     
*       4 *        Bit(31),         ] Reserved                                  
*     3 OPDSInfo,                   ] Server information                        
*       4 OPDSName Char(32),        ] Server name in mixed case                 
*       4 OPDAFile Fixed(32),       ] Number of active files                    
*       4 OPDMFile Fixed(32),       ] Maximum files                             
*       4 OPDSType Fixed(32),       ] Server type                               
*     3 OPDCmnd  Char(40),          ] Truncated command buffer in               
*                                   ] mixed case                                
*     3 OPDExtn,                    ] Extension with computed values            
*       4 OPDDCt    Char(8),        ] Delta TCB time          (TOD)             
*                                   ]                             @71C          
*       4 OPDDCtIIP Char(8),        ] Delta TCB time for zIIP (TOD).            
*                                   ] Delta TCB time for zAAP is not            
*                                   ] provided by z/OS USS because z13          
*                                   ] (and later) procs do not support          
*                                   ] zAAP                        @71A          
*     3 OPDMT,                     /* internal use              @A03C*/         
*       4 OPDDCt_MT Char(4),       /* Delta TCB time converted to               
*                                     raw MT time (short float) @A03C*/         
*     3 OPDCtIIP    Char(8),        ] Process system and user                   
*                                   ] compute time on zIIP        @71A          
*     3 *        Char(0);                                                       
*                                                                               
*                                                                               
*%If IBM_CBGEN_PADI <> 'YES' %Then  ] OTDG3 not used, skip CBGEN @A03A          
*%Do;                               ]                            @A03A          
*/********************************************************************/         
*/*                                                                  */         
*/* OTDG3: Thread details                                            */         
*/*                                                                  */         
*/********************************************************************/         
*                                                                               
* Declare                                                                       
*   1 OTDG3 Type,                   ] OTDG3-entry                               
*     3 OTDID    Char(8),           ] Thread ID                                 
*     3 OTDTCB   Pointer(31),       ] Thread TCB address                        
*     3 OTDJobnm Char(8),           ] Job name of primary space or              
*                                   ] blank                                     
*     3 OTDUsern Char(8),           ] User name                                 
*     3 OTDSysCl Fixed(32),         ] Last syscall code                         
*     3 OTDTime  Char(8),           ] Accumulated TCB time in STCK              
*     3 *        Char(65),          ] Reserved                                  
*     3 OTDStats Char(5),           ] Status information                        
*       4 OTDStat1 Char(1),         ] Pthread created / dubbed                  
*       4 OTDStat2 Char(1),         ] Wait / running status                     
*       4 OTDStat3 Char(1),         ] Creation type                             
*       4 OTDStat4 Char(1),         ] Detached / undetached                     
*       4 OTDStat5 Char(1),         ] Ptrace held                               
*     3 OTDFlags  Bit(8),           ] Thread flags                              
*       4 OTDTgSet  Bit(1),         ] Tag data available                        
*       4 *         Bit(7),         ] Reserved                                  
*     3 *         Char(1),          ] Reserved                                  
*     3 OTDEnd    Char(0);          ] End of thread info                        
*                                                                               
*%End;                              ] OTDG3 not used, skip CBGEN @A03A          
*                                                                               
*/********************************************************************/         
*/*                                                                  */         
*/* Status constants (derived from BPXZODMV)                         */         
*/*                                                                  */         
*/********************************************************************/         
*@Space;                                                                        
*/********************************************************************/         
*/*                                                                  */         
*/* OPDStat3 constants                                               */         
*/*                                                                  */         
*/********************************************************************/         
* Declare                                                                       
*   OPD_Zombie                      ] Process terminated and parent             
*       Char(1) Constant('Z'),      ] has not complete wait                     
*   OPD_Zombie2                     ] Process terminated and still              
*       Char(1) Constant('L'),      ] session or process group leader           
*   OPD_QuiesceT                    ] Quiese termination wait                   
*       Char(1) Constant('Q');                                                  
*                                                                               
*/********************************************************************/         
*/*                                                                  */         
*/* OPDStat3 and OTDStat2 constants                                  */         
*/*                                                                  */         
*/********************************************************************/         
*                                                                               
* Declare                                                                       
*   OPD_Msgrcv                      ] IPC msgrcv wait                           
*       Char(1) Constant('A'),                                                  
*   OPD_Msgsnd                      ] IPC msgsnd wait                           
*       Char(1) Constant('B'),                                                  
*   OPD_WaitC                       ] Comm KernelWait                           
*       Char(1) Constant('C'),                                                  
*   OPD_Semop                       ] IPC semop wait                            
*       Char(1) Constant('D'),                                                  
*   OPD_WaitF                       ] File System Kernel Wait                   
*       Char(1) Constant('F'),                                                  
*   OPD_MVSPause                    ] MVSPause                                  
*       Char(1) Constant('G'),                                                  
*   OPD_WaitO                       ] Other Kernel Wait                         
*       Char(1) Constant('K'),                                                  
*   OPD_Run                         ] Not kernel wait                           
*       Char(1) Constant('R'),                                                  
*   OPD_Sleep                       ] sleep() issued                            
*       Char(1) Constant('S'),                                                  
*   OPD_Fork                        ] Fork new process                          
*       Char(1) Constant('X'),                                                  
*   OPD_Child                       ] Waiting for child                         
*       Char(1) Constant('W');                                                  
*                                                                               
*/********************************************************************/         
*/*                                                                  */         
*/* Constants for OpdStat3 and OTDStat5                              */         
*/*                                                                  */         
*/********************************************************************/         
*                                                                               
* Declare                                                                       
*   OPD_Freeze                      ] Quiesce freeze                            
*       Char(1) Constant('E');                                                  
*                                                                               
*/********************************************************************/         
*/*                                                                  */         
*/* Following constant are not returned by BPXEKDA. See remarks      */         
*/* how to get those information                                     */         
*/*                                                                  */         
*/********************************************************************/         
*                                                                               
* Declare                                                                       
*   OPD_OneTask                                                                 
*       Char(1) Constant('1'),      ] Only one dubbed task: use when            
*                                   ] both, OPDPThrd and OPDMThrd               
*                                   ] are '0'b                                  
*   OPD_MultThds                                                                
*       Char(1) Constant('M'),      ] Multiple threads which were NOT           
*                                   ] pthread_create()'ed: use when             
*                                   ] OPDMThrd is '1'b                          
*   OPD_Pthreads                                                                
*       Char(1) Constant('H'),      ] Multiple threads exist. Some              
*                                   ] created by pthread_create: Use            
*                                   ] when OPDPThrd is '1'b                     
*   OPD_Swapped                                                                 
*       Char(1) Constant('I');      ] Swapped out: Use when                     
*                                   ] OPDSwap = '1'b                            
*                                                                               
*/********************************************************************/         
*/*                                                                  */         
*/* Constant for OpdStat4                                            */         
*/*                                                                  */         
*/********************************************************************/         
*                                                                               
* Declare                                                                       
*   OPD_StopSt                                                                  
*       Char(1) Constant('T');      ] Stopped: Use when OPDStpd = '1'b          
*                                                                               
*/********************************************************************/         
*/*                                                                  */         
*/* Constant for OpdStat5                                            */         
*/*                                                                  */         
*/********************************************************************/         
*                                                                               
* Declare                                                                       
*   OPD_Ptrace                                                                  
*       Char(1) Constant('P');      ] PTrace Kernel Wait: Use when              
*                                   ] OPDWaitP is '1'b                          
*                                                                               
*/********************************************************************/         
*/*                                                                  */         
*/* Server Type Constants                                            */         
*/*                                                                  */         
*/********************************************************************/         
* Declare                                                                       
*   NRegSType(4) Char(4)            ] Text string for OPDSType                  
*      Init('FILE','LOCK','FEXP','SFDS');                                       
*                                                            /*1@A03D*/         
*/************************************************************17@A03A*/         
*@LOGIC;                                                                        
*#PRAGMA TOOL=CBGEN.                                                            
*#ALIGNOP.                                                                      
*#NOTUPPER.                                                                     
*#NOLEN.                                                                        
*/* internal use */                                                             
*#DELETE.OPDDCt_MT                                                              
*/**/                                                                           
*#REPLACE.OPDACRO                                                               
*OPDACRO_0TO3 EQU   C'OPDG'         Acronym part 1                              
*OPDACRO_4    EQU   C'3'            Acronym part 2                              
*#EREPLACE.                                                                     
*#EPRAGMA.                                                                      
*#PRAGMA TOOL=PADI.                                                             
*#PADIDELETE.OPDACRO                                                            
*#PADIDELETE.OPDACRO_0TO3                                                       
*#PADIDELETE.OPDACRO_4                                                          
*#EPRAGMA.                                                                      
*@ENDLOGIC;                                                                     
*/* End of PL/X Source                                               */         
* %IF ERBOPDG3_LIST = 'NO' !                                                    
*    ZCBPRINT = 'NO' %THEN                                                      
* %DO;                                                                          
*   @LIST POP NOECHO;                                                           
* %END;                                                                         
* %END;                                                                         
