*/*      Bilingual Mapping Macro for SMF 74.3 Data Sections                     
         MACRO                                                                  
         ERBR743                                                                
*                                                                    */         
*/*** START OF SPECIFICATIONS ****************************************          
*                                                                    *          
*01* Proprietary Statement:                                          *          
*       Licensed Materials - Property of IBM                   @61A  *          
*       "Restricted Materials of IBM"                          @61A  *          
*       Copyright IBM Corp. 2003, 2021                               *          
*                                                                    *          
*       Status: z/OS V2R5 Data Gatherer (HRG77D0)                    *          
*                                                                    *          
*01* Macro Name: ERBR743                                             *          
*                                                                    *          
*01* Descriptive Name:  SMF Record 74 Subtype 3 Data Section         *          
*                       (Monitor III OMVS Kernel Activity Data)      *          
*                                                                    *          
*                                                                    *          
*01* DSECT Name: R743DATA Data Section                               *          
*                                                                    *          
*                                                                    *          
*01* Component: zOS Data Gatherer (27401)                            *          
*                                                                    *          
*                                                                    *          
*01* Function:  This macro maps the data section                     *          
*               of SMF record 74 subtype 3                           *          
*                                                                    *          
*01* Notes: None                                                     *          
*                                                                    *          
*01* Size:  Data section : 308 bytes (each)                          *          
*                                                                    *          
*01* Method of Access: See below:                                    *          
*                                                                    *          
*    BAL : ERBR743                                                   *          
*    PL/X: %INCLUDE SYSLIB(ERBR743) semicolon                        *          
*                                                                    *          
*                                                                    *          
*01* Module-type: BILINGUAL MAPPING MACRO                            *          
*                                                                    *          
*01* Dependencies: None                                              *          
*                                                                    *          
*01* Distribution Library: AGRBMAC1                             @A02C*          
*                                                                    *          
*01* Change-Activity:  For pre-HRM7708 codes, see ERBSMF74           *          
*                                                                    *          
*     $K0=MISC,HRM7708,,GUB: Split SMF 74 mapping macro              *          
*     $61=R790,HRM7790,,MWe: explicit copyright for ext. macro   @61A*          
*    $A02=ZOSB,HRG77D0,,JBa: Rename zOS Data Gatherer libraries @A02A*          
*    ALe: Update field description for REST services         @OA62081*          
*                                                                    *          
****** END OF SPECIFICATIONS *****************************************/         
*        %GOTO PLS743;                                                          
*/*                                                                             
         SPACE 2                                                                
******  Subtype 3, Data Section ********************************* @B2A          
         SPACE 3                                                                
R743DATA DSECT                                                                  
R743CYCU DS    BL4      Number of cycle units elapsed                           
*                       between first and last measured sample    @B2A          
R743CYCT DS    BL4      Cycle time value obtained from Monitor III              
*                       options                                   @B2A          
R743FLG  DS    BL4      Processing flags                          @B2A          
R743TER  EQU   X'80000000'  OMVS terminated or reinstated this                  
*                           intervall when set                    @B2A          
R743CHPR EQU   X'40000000'  Max. number of processes changed                    
*                           during reporting interval when set    @B2A          
R743CHUS EQU   X'20000000'  Max. number of users changed during                 
*                           reporting interval when set           @B2A          
R743CHPU EQU   X'10000000'  Max. number of processes per userchanged            
*                           during reporting interval when set    @B2A          
R743CHMS EQU   X'08000000'  Max. number of message queue ids changed            
*                           during reporting interval when set@WA10257          
R743CHSE EQU   X'04000000'  Max. number of semaphore ids changed                
*                           during reporting interval when set@WA10257          
R743CHSH EQU   X'02000000'  Max. number of shared memory ids changed            
*                           during reporting interval when set@WA10257          
R743CHSP EQU   X'01000000'  Max. number of shared memory pages changed          
*                           during reporting interval when set@WA10257          
R743CHMA EQU   X'00800000'  Max. number of memory map st pages changed          
*                           during reporting interval when set@WA10257          
R743CHPA EQU   X'00400000'  Max. number of shared stor pages changed            
*                           during reporting interval when set@WA10257          
*                           Reserved                              @B2A          
R743CHLR EQU   X'00200000'  Max. size of shared library region changed          
*                           during reporting interval when set    @I5A          
R743CQSG EQU   X'00100000'  Max. number of queued signals per process           
*                           changed during reporting interval when              
*                           set                                   @I5A          
R743SYSC DS    BL4      Total number of OMVS system calls invoked               
*                       during the interval (short floating point)              
*                                                             @OA62081          
R743SCMN DS    BL4      Min. number of OMVS system calls invoked                
*                       during one cycle                          @B2A          
R743SCMX DS    BL4      Max. number of OMVS system calls invoked                
*                       during one cycle                          @B2A          
R743CPU  DS    BL4      Total CPU time spent processing syscalls                
*                       in OMVS during the interval (short floating             
*                       point)                                @OA62081          
R743CTMN DS    BL4      Min. CPU time spent processing syscalls in              
*                       OMVS during one cycle                     @B2A          
R743CTMX DS    BL4      Max. CPU time spent processing syscalls in              
*                       OMVS during one cycle                     @B2A          
R743OPR  DS    BL4      Count of times Fork/Dub failed because max.             
*                       number of processes was exceeded during                 
*                       one cycle (short floating point)      @OA62081          
R743OPMN DS    BL4      Min. number of times Fork/Dub failed because            
*                       max. number of processes was exceeded during            
*                       one cycle                                 @B2A          
R743OPMX DS    BL4      Max. number of times Fork/Dub failed because            
*                       max. number of processes was exceeded during            
*                       one cycle                                 @B2A          
R743OUS  DS    BL4      Count of times Fork/Dub failed because max.             
*                       number of users was exceeded during one cycle           
*                       (short floating point)                @OA62081          
R743OUMN DS    BL4      Min. number of times Fork/Dub failed because            
*                       max. number of users was exceeded during                
*                       one cycle                                 @B2A          
R743OUMX DS    BL4      Max. number of times Fork/Dub failed because            
*                       max. number of users was exceeded during                
*                       one cycle                                 @B2A          
R743OPRU DS    BL4      Count of times Fork/Dub failed because max.             
*                       number of proc's per user was exceeded during           
*                       one cycle (short floating point)      @OA62081          
R743ORMN DS    BL4      Min. number of times Fork/Dub failed because            
*                       max. number of processes per user was exceeded          
*                       during one cycle                          @B2A          
R743ORMX DS    BL4      Max. number of times Fork/Dub failed because            
*                       max. number of processes per user was exceeded          
*                       during one cycle                          @B2A          
R743MAXP DS    BL2      Max. number of OMVS processes (const) @YA62787          
R743MAXU DS    BL2      Max. number of OMVS users (const)         @B2A          
R743MXPU DS    BL2      Max. number of OMVS processes per user (const)          
*                                                                 @B2A          
         DS    BL2      Unused                                    @B2A          
R743CURP DS    BL4      Accumulated number of OMVS processes                    
*                       during the interval (short floating point)              
*                                                             @OA62081          
R743CPMN DS    BL2      Min. number of OMVS processes                           
*                       during one cycle                          @B2A          
R743CPMX DS    BL2      Max. number of OMVS processes                           
*                       during one cycle                          @B2A          
R743CURU DS    BL4      Accumulated number of OMVS users                        
*                       during the interval (short floating point)              
*                                                             @OA62081          
R743CUMN DS    BL2      Min. number of OMVS users                               
*                       during one cycle                          @B2A          
R743CUMX DS    BL2      Max. number of OMVS users                               
*                       during one cycle                          @B2A          
R743MMSG DS    BL4      Maximum number of message queue IDs (const.)            
*                                                             @WA10257          
R743MSEM DS    BL4      Maximum number of semaphore IDs (const.)                
*                                                             @WA10257          
R743MSHM DS    BL4      Maximum number of shared memory IDs (const.)            
*                                                             @WA10257          
R743MSPG DS    BL4      Maximum number of shared memory pages                   
*                       (const.)                              @WA10257          
R743CMSG DS    BL4      Accumulated number of message queue IDs                 
*                       during one interval (short floating point)              
*                                                             @OA62081          
R743CMMN DS    BL4      Minimum number of message queue IDs per cycle           
*                                                             @WA10257          
R743CMMX DS    BL4      Maximum number of message queue IDs per cycle           
*                                                             @WA10257          
R743CSEM DS    BL4      Accumulated number of semaphore IDs during              
*                       one interval (short floating point)   @OA62081          
R743CSMN DS    BL4      Minimum number of semaphore IDs per cycle               
*                                                             @WA10257          
R743CSMX DS    BL4      Maximum number of semaphore IDs per cycle               
*                                                             @WA10257          
R743CSHM DS    BL4      Accumulated number of shared memory IDs                 
*                       during one interval (short floating point)              
*                                                             @OA62081          
R743CHMN DS    BL4      Minimum number of shared memory IDs per cycle           
*                                                             @WA10257          
R743CHMX DS    BL4      Maximum number of shared memory IDs per cycle           
*                                                             @WA10257          
R743CSPG DS    BL4      Accumulated number of shared memory pages               
*                       during one interval (short floating point)              
*                                                             @OA62081          
R743CGMN DS    BL4      Minimum number of shared memory pages per               
*                       cycle                                 @WA10257          
R743CGMX DS    BL4      Maximum number of shared memory pages per               
*                       cycle                                 @WA10257          
R743OMSG DS    BL4      Accumulated number of attempts to exceed                
*                       maximum number of message queue IDs during              
*                       one interval (short floating point)   @OA62081          
R743OMMN DS    BL4      Minimum number of attempts to exceed maximum            
*                       number of message queue IDs per cycle @WA10257          
R743OMMX DS    BL4      Maximum number of attempts to exceed maximum            
*                       number of message queue IDs per cycle @WA10257          
R743OSEM DS    BL4      Accumulated number of attempts to exceed                
*                       maximum number of semaphore IDs during one              
*                       interval (short floating point)       @OA62081          
R743OSMN DS    BL4      Minimum number of attempts to exceed maximum            
*                       number of semaphore IDs per cycle     @WA10257          
R743OSMX DS    BL4      Maximum number of attempts to exceed maximum            
*                       number of semaphore IDs per cycle     @WA10257          
R743OSHM DS    BL4      Accumulated number of attempts to exceed                
*                       maximum number of shared memory IDs during              
*                       one interval (short floating point)   @OA62081          
R743OHMN DS    BL4      Minimum number of attempts to exceed maximum            
*                       number of shared memory IDs per cycle @WA10257          
R743OHMX DS    BL4      Maximum number of attempts to exceed maximum            
*                       number of shared memory IDs per cycle @WA10257          
R743OSPG DS    BL4      Accumulated number of attempts to exceed                
*                       maximum number of shared memory pages during            
*                       one interval (short floating point)   @OA62081          
R743OGMN DS    BL4      Minimum number of attempts to exceed maximum            
*                       number of shared memory pages per cycle                 
*                                                             @WA10257          
R743OGMX DS    BL4      Maximum number of attempts to exceed maximum            
*                       number of shared memory pages per cycle                 
*                                                             @WA10257          
R743MMAP DS    BL4      Maximum number of memory map storage pages              
*                       (const.)                              @WA10257          
R743CMAP DS    BL4      Accumulated number of memory map storage                
*                       pages during one interval (short floating               
*                       point)                                @OA62081          
R743CAMN DS    BL4      Minimum number of memory map storage pages              
*                       per cycle                             @WA10257          
R743CAMX DS    BL4      Maximum number of memory map storage pages              
*                       per cycle                             @WA10257          
R743OMAP DS    BL4      Accumulated number of attempts to exceed                
*                       maximum number of memory map storage pages              
*                       during one interval (short floating point)              
*                                                             @OA62081          
R743OAMN DS    BL4      Minimum number of attempts to exceed maximum            
*                       number of memory map storage pages per cycle            
*                                                             @WA10257          
R743OAMX DS    BL4      Maximum number of attempts to exceed maximum            
*                       number of memory map storage pages per cycle            
*                                                             @WA10257          
R743MPAG DS    BL4      Maximum number of shared storage pages                  
*                       (const.)                              @WA10257          
R743CPAG DS    BL4      Accumulated number of shared storage                    
*                       pages during one interval (short floating               
*                       point)                                @OA62081          
R743CXMN DS    BL4      Minimum number of shared storage pages                  
*                       per cycle                             @WA10257          
R743CXMX DS    BL4      Maximum number of shared storage pages                  
*                       per cycle                             @WA10257          
R743OPAG DS    BL4      Accumulated number of attempts to exceed                
*                       maximum number of shared storage pages                  
*                       during one interval (short floating point)              
*                                                             @OA62081          
R743OXMN DS    BL4      Minimum number of attempts to exceed maximum            
*                       number of shared storage pages per cycle                
*                                                             @WA10257          
R743OXMX DS    BL4      Maximum number of attempts to exceed maximum            
*                       number of shared storage pages per cycle                
*                                                             @WA10257          
R743MSLR DS    BL4      Maximum amount of storage available for                 
*                       shared library region (const. in MB)      @I5A          
R743CSLR DS    BL4      Accumulated amount of shared library                    
*                       storage allocated in one interval in MB (short          
*                       floating point)                       @OA62081          
R743CLMN DS    BL4      Minimum amount of shared library storage                
*                       allocated per cycle                       @I5A          
R743CLMX DS    BL4      Maximum number of shared library storage                
*                       allocated per cycle                       @I5A          
R743OSLR DS    BL4      Accumulated number of attempts to exceed                
*                       maximum amount of shared library region                 
*                       size during one interval (short floating                
*                       point)                                @OA62081          
R743OLMN DS    BL4      Minimum number of attempts to exceed maximum            
*                       amount of shared library region per cycle @I5A          
R743OLMX DS    BL4      Maximum number of attempts to exceed maximum            
*                       amount of shared library region per cycle @I5A          
R743MQDS DS    BL4      Maximum amount of queued signals allowed                
*                       per process (const.)                      @I5A          
R743OQDS DS    BL4      Accumulated number of attempts to exceed                
*                       maximum amount of queued signals per                    
*                       interval (short floating point)       @OA62081          
R743OQMN DS    BL4      Minimum number of attempts to exceed maximum            
*                       amount of queued signals per cycle        @I5A          
R743OQMX DS    BL4      Maximum number of attempts to exceed maximum            
*                       amount of queued signals per cycle        @I5A          
         MEND  ,                                                                
*                                                                    */         
*%PLS743: ;                                                                     
*    @SPACE;                                                                    
*/****  Subtype 3, data section ** ***************************** @B2A*/         
*    @SPACE;                                                                    
*   DECLARE                                                                     
*     1 R743DATA BASED(ADDR(SMF74HDR)+SMF743PO) BDY(WORD),   /*  @B2A*/         
*       3 R743CYCU FIXED(31),       /* Number of cycle units elapsed            
*                                      between first and last                   
*                                      measured sample           @B2A*/         
*       3 R743CYCT FIXED(31),       /* Cycle time value obtained                
*                                      from Monitor III options  @B2A*/         
*       3 R743FLG    BIT(32),       /* Processing flags          @B2A*/         
*         5 R743TER  BIT(1),        /* OMVS terminated or reinstated            
*                                      this intervall when set   @B2A*/         
*         5 R743CHPR BIT(1),        /* Max. number of processes changed         
*                                      during reporting interval                
*                                      when set                  @B2A*/         
*         5 R743CHUS BIT(1),        /* Max. number of users changed             
*                                      during reporting interval when           
*                                      set                       @B2A*/         
*         5 R743CHPU BIT(1),        /* Max. number of processes per             
*                                      user changed during reporting            
*                                      intervall when set        @B2A*/         
*         5 R743CHMS BIT(1),        /* Max. number of message queue             
*                                      ids changed during reporting             
*                                      interval when set     @WA10257*/         
*         5 R743CHSE BIT(1),        /* Max. number of semaphore ids             
*                                      changed during reporting                 
*                                      interval when set     @WA10257*/         
*         5 R743CHSH BIT(1),        /* Max. number of shared memory             
*                                      ids changed during reporting             
*                                      interval when set     @WA10257*/         
*         5 R743CHSP BIT(1),        /* Max. number of shared memory             
*                                      pages changed during reporting           
*                                      interval when set     @WA10257*/         
*         5 R743CHMA BIT(1),        /* Max. number of memory map st             
*                                      pages changed during reporting           
*                                      interval when set     @WA10257*/         
*         5 R743CHPA BIT(1),        /* Max. number of shared storage            
*                                      pages changed during reporting           
*                                      interval when set     @WA10257*/         
*         5 R743CHLR BIT(1),        /* Max. size of shared library              
*                                      region changed during                    
*                                      reporting interval when set              
*                                                                @I5A*/         
*         5 R743CQSG BIT(1),        /* Max. number of queued                    
*                                      signals per process changed              
*                                      during reporting interval                
*                                      when set                  @I5A*/         
*         5 *        BIT(20),       /* Reserved                  @I5C*/         
*       3 R743SYSC FIXED(32),       /* Total number of OMVS system              
*                                      calls invoked during the                 
*                                      interval (short floating point)          
*                                                            @OA62081*/         
*       3 R743SCMN FIXED(31),       /* Min. number of OMVS system calls         
*                                      invoked during one cycle  @B2A*/         
*       3 R743SCMX FIXED(31),       /* Max. number of OMVS system calls         
*                                      invoked during one cycle  @B2A*/         
*       3 R743CPU  FIXED(32),       /* Total CPU time spent processing          
*                                      syscalls in OMVS during the              
*                                      interval (short floating point)          
*                                                            @OA62081*/         
*       3 R743CTMN FIXED(31),       /* Min. CPU time spent processing           
*                                      syscalls in OMVS during one              
*                                      cycle                     @B2A*/         
*       3 R743CTMX FIXED(31),       /* Max. CPU time spent processing           
*                                      syscalls in OMVS during one              
*                                      cycle                     @B2A*/         
*       3 R743OPR  FIXED(32),       /* Count of times Fork/Dub failed           
*                                      because max. number of processes         
*                                      was exceeded during one                  
*                                      cycle (short floating point)             
*                                                            @OA62081*/         
*       3 R743OPMN FIXED(31),       /* Min. mumber of times Fork/Dub            
*                                      failed because max. number of            
*                                      processes was exceeded during            
*                                      one cycle                 @B2A*/         
*       3 R743OPMX FIXED(31),       /* Max. mumber of times Fork/Dub            
*                                      failed because max. number of            
*                                      processes was exceeded during            
*                                      one cycle                 @B2A*/         
*       3 R743OUS  FIXED(32),       /* Count of times Fork/Dub failed           
*                                      because max. number of users was         
*                                      exceeded during one cycle (short         
*                                      floating point)       @OA62081*/         
*       3 R743OUMN FIXED(31),       /* Min. mumber of times Fork/Dub            
*                                      failed because max. number of            
*                                      users was exceeded during                
*                                      one cycle                 @B2A*/         
*       3 R743OUMX FIXED(31),       /* Max. mumber of times Fork/Dub            
*                                      failed because max. number of            
*                                      users was exceeded during                
*                                      one cycle                 @B2A*/         
*       3 R743OPRU FIXED(32),       /* Count of times Fork/Dub failed           
*                                      because max. number of processes         
*                                      per user was exceeded during             
*                                      one cycle (short floating point)         
*                                                            @OA62081*/         
*       3 R743ORMN FIXED(31),       /* Min. number of times Fork/Dub            
*                                      failed because max. number of            
*                                      processes per user was exceeded          
*                                      during one cycle          @B2A*/         
*       3 R743ORMX FIXED(31),       /* Max. number of times Fork/Dub            
*                                      failed because max. number of            
*                                      processes per user was exceeded          
*                                      during one cycle          @B2A*/         
*       3 R743MAXP FIXED(15),       /* Max. number of OMVS processes            
*                                      (const.)                  @B2A*/         
*       3 R743MAXU FIXED(15),       /* Max. number of OMVS users                
*                                      (const.)                  @B2A*/         
*       3 R743MXPU FIXED(15),       /* Max. number of OMVS processes            
*                                      per user (const.)         @B2A*/         
*       3 *        FIXED(15),       /* Unused                    @B2A*/         
*       3 R743CURP FIXED(32),       /* Accumulated number of OMVS               
*                                      processes during the interval            
*                                      (short floating point)                   
*                                                            @OA62081*/         
*       3 R743CPMN FIXED(15),       /* Min. number of OMVS processes            
*                                      during one cycle          @B2A*/         
*       3 R743CPMX FIXED(15),       /* Max. number of OMVS processes            
*                                      during one cycle          @B2A*/         
*       3 R743CURU FIXED(32),       /* Accumulated number of OMVS               
*                                      users during the interval (short         
*                                      floating point)       @OA62081*/         
*       3 R743CUMN FIXED(15),       /* Min. number of OMVS users                
*                                      during one cycle          @B2A*/         
*       3 R743CUMX FIXED(15),       /* Max. number of OMVS users                
*                                      during one cycle      @WA10257*/         
*       3 R743MMSG FIXED(32),       /* Maximum number of message                
*                                      queue IDs (const.)    @WA10257*/         
*       3 R743MSEM FIXED(32),       /* Maximum number of semaphore              
*                                      IDs (const.)          @WA10257*/         
*       3 R743MSHM FIXED(32),       /* Maximum number of shared                 
*                                      memory IDs (const.)   @WA10257*/         
*       3 R743MSPG FIXED(32),       /* Maximum number of shared                 
*                                      memory pages (const.) @WA10257*/         
*       3 R743CMSG FIXED(32),       /* Accumulated number of message            
*                                      queue IDs during one interval            
*                                      (short floating point)                   
*                                                            @OA62081*/         
*       3 R743CMMN FIXED(32),       /* Minimum number of message                
*                                      queue IDs per cycle   @WA10257*/         
*       3 R743CMMX FIXED(32),       /* Maximum number of message                
*                                      queue IDs per cycle   @WA10257*/         
*       3 R743CSEM FIXED(32),       /* Accumulated number of                    
*                                      semaphore IDs during one                 
*                                      interval (short floating point)          
*                                                            @OA62081*/         
*       3 R743CSMN FIXED(32),       /* Minimum number of semaphore              
*                                      IDs per cycle         @WA10257*/         
*       3 R743CSMX FIXED(32),       /* Maximum number of semaphore              
*                                      IDs per cycle         @WA10257*/         
*       3 R743CSHM FIXED(32),       /* Accumulated number of shared             
*                                      memory IDs during one interval           
*                                      (short floating point)                   
*                                                            @OA62081*/         
*       3 R743CHMN FIXED(32),       /* Minimum number of shared                 
*                                      memory IDs per cycle  @WA10257*/         
*       3 R743CHMX FIXED(32),       /* Maximum number of shared                 
*                                      memory IDs per cycle  @WA10257*/         
*       3 R743CSPG FIXED(32),       /* Accumulated number of shared             
*                                      memory pages during one                  
*                                      interval (short floating point)          
*                                                            @OA62081*/         
*       3 R743CGMN FIXED(32),       /* Minimum number of shared                 
*                                      memory pages per cycle                   
*                                                            @WA10257*/         
*       3 R743CGMX FIXED(32),       /* Maximum number of shared                 
*                                      memory pages per cycle                   
*                                                            @WA10257*/         
*       3 R743OMSG FIXED(32),       /* Accumulated number of attempts           
*                                      to exceed maximum number of              
*                                      message queue IDs during one             
*                                      interval (short floating point)          
*                                                            @OA62081*/         
*       3 R743OMMN FIXED(32),       /* Minimum number of attempts to            
*                                      exceed maximum number of                 
*                                      message queue IDs per cycle              
*                                                            @WA10257*/         
*       3 R743OMMX FIXED(32),       /* Maximum number of attempts to            
*                                      exceed maximum number of                 
*                                      message queue IDs per cycle              
*                                                            @WA10257*/         
*       3 R743OSEM FIXED(32),       /* Accumulated number of attempts           
*                                      to exceed maximum number of              
*                                      semaphore IDs during one                 
*                                      interval (short floating point)          
*                                                            @OA62081*/         
*       3 R743OSMN FIXED(32),       /* Minimum number of attempts to            
*                                      exceed maximum number of                 
*                                      semaphore IDs per cycle                  
*                                                            @WA10257*/         
*       3 R743OSMX FIXED(32),       /* Maximum number of attempts to            
*                                      exceed maximum number of                 
*                                      semaphore IDs per cycle                  
*                                                            @WA10257*/         
*       3 R743OSHM FIXED(32),       /* Accumulated number of attempts           
*                                      to exceed maximum number of              
*                                      shared memory IDs during one             
*                                      interval (short floating point)          
*                                                            @OA62081*/         
*       3 R743OHMN FIXED(32),       /* Minimum number of attempts to            
*                                      exceed maximum number of                 
*                                      shared memory IDs per cycle              
*                                                            @WA10257*/         
*       3 R743OHMX FIXED(32),       /* Maximum number of attempts to            
*                                      exceed maximum number of                 
*                                      shared memory IDs per cycle              
*                                                            @WA10257*/         
*       3 R743OSPG FIXED(32),       /* Accumulated number of attempts           
*                                      to exceed maximum number of              
*                                      shared memory pages during one           
*                                      interval (short floating point)          
*                                                            @OA62081*/         
*       3 R743OGMN FIXED(32),       /* Minimum number of attempts to            
*                                      exceed maximum number of                 
*                                      shared memory pages per cycle            
*                                                            @WA10257*/         
*       3 R743OGMX FIXED(32),       /* Maximum number of attempts to            
*                                      exceed maximum number of                 
*                                      shared memory pages per cycle            
*                                                            @WA10257*/         
*       3 R743MMAP FIXED(32),       /* Maximum number of memory map             
*                                      storage pages (const.)                   
*                                                            @WA10257*/         
*       3 R743CMAP FIXED(32),       /* Accumulated number of memory             
*                                      map storage pages during one             
*                                      interval (short floating point)          
*                                                            @OA62081*/         
*       3 R743CAMN FIXED(32),       /* Minimum number of memory map             
*                                      storage pages per cycle                  
*                                                            @WA10257*/         
*       3 R743CAMX FIXED(32),       /* Maximum number of memory map             
*                                      storage pages per cycle                  
*                                                            @WA10257*/         
*       3 R743OMAP FIXED(32),       /* Accumulated number of attempts           
*                                      to exceed maximum number of              
*                                      memory map storage pages                 
*                                      during one interval (short               
*                                      floating point)       @OA62081*/         
*       3 R743OAMN FIXED(32),       /* Minimum number of attempts to            
*                                      exceed maximum number of                 
*                                      memory map storage pages per             
*                                      cycle                 @WA10257*/         
*       3 R743OAMX FIXED(32),       /* Maximum number of attempts to            
*                                      exceed maximum number of                 
*                                      memory map storage pages per             
*                                      cycle                 @WA10257*/         
*       3 R743MPAG FIXED(32),       /* Maximum number of shared                 
*                                      storage pages (const.)                   
*                                                            @WA10257*/         
*       3 R743CPAG FIXED(32),       /* Accumulated number of shared             
*                                      storage pages during one                 
*                                      interval (short floating point)          
*                                                            @OA62081*/         
*       3 R743CXMN FIXED(32),       /* Minimum number of shared                 
*                                      storage pages per cycle                  
*                                                            @WA10257*/         
*       3 R743CXMX FIXED(32),       /* Maximum number of shared                 
*                                      storage pages per cycle                  
*                                                            @WA10257*/         
*       3 R743OPAG FIXED(32),       /* Accumulated number of attempts           
*                                      to exceed maximum number of              
*                                      shared storage pages                     
*                                      during one interval (short               
*                                      floating point)       @OA62081*/         
*       3 R743OXMN FIXED(32),       /* Minimum number of attempts to            
*                                      exceed maximum number of                 
*                                      shared storage pages per                 
*                                      cycle                 @WA10257*/         
*       3 R743OXMX FIXED(32),       /* Maximum number of attempts to            
*                                      exceed maximum number of                 
*                                      shared storage pages per                 
*                                      cycle                     @I5C*/         
*       3 R743MSLR FIXED(32),       /* Maximum amount of storage                
*                                      available for shared library             
*                                      region (const. in MB)     @I5A*/         
*       3 R743CSLR FIXED(32),       /* Accumulated amount of shared             
*                                      library storage allocated in             
*                                      one interval in MB (short                
*                                      floating point)       @OA62081*/         
*       3 R743CLMN FIXED(32),       /* Minimum amount of shared                 
*                                      library storage allocated per            
*                                      cycle                     @I5A*/         
*       3 R743CLMX FIXED(32),       /* Maximum number of shared                 
*                                      library storage allocated per            
*                                      cycle                     @I5A*/         
*       3 R743OSLR FIXED(32),       /* Accumulated number of attempts           
*                                      to exceed maximum amount of              
*                                      shared library region size               
*                                      during one interval (short               
*                                      floating point)       @OA62081*/         
*       3 R743OLMN FIXED(32),       /* Minimum number of attempts to            
*                                      exceed maximum amount of shared          
*                                      library region per cycle  @I5A*/         
*       3 R743OLMX FIXED(32),       /* Maximum number of attempts to            
*                                      exceed maximum amount of shared          
*                                      library region per cycle  @I5A*/         
*       3 R743MQDS FIXED(32),       /* Maximum amount of queued                 
*                                      signals allowed per process              
*                                      (const.)                  @I5A*/         
*       3 R743OQDS FIXED(32),       /* Accumulated number of attempts           
*                                      to exceed maximum amount of              
*                                      queued signals per interval              
*                                      (short floating point)                   
*                                                            @OA62081*/         
*       3 R743OQMN FIXED(32),       /* Minimum number of attempts to            
*                                      exceed maximum amount of queued          
*                                      signals per cycle         @I5A*/         
*       3 R743OQMX FIXED(32);       /* Maximum number of attempts to            
*                                      exceed maximum amount of queued          
*                                      signals per cycle         @I5A*/         
