*/*      Bilingual Mapping Macro for SMF 74.6 Data Sections                     
         MACRO                                                                  
         ERBR746                                                                
*                                                                    */         
*/*** START OF SPECIFICATIONS ****************************************          
*                                                                    *          
*01* Proprietary Statement:                                          *          
*       Licensed Materials - Property of IBM                   @61A  *          
*       "Restricted Materials of IBM"                          @61A  *          
*       Copyright IBM Corp. 2003, 2021                               *          
*                                                                    *          
*       Status: z/OS V2R5 Data Gatherer (HRG77D0)                    *          
*                                                                    *          
*01* Macro Name: ERBR746                                             *          
*                                                                    *          
*01* Descriptive Name:  SMF Record 74 Subtype 6 Data Sections        *          
*                       (Monitor III HFS Statistics)                 *          
*                                                                    *          
*                                                                    *          
*01* DSECT Name: R746GDAT Global data section                        *          
*                R746GBUF Global buffer section                      *          
*                R746FSYS File system section                        *          
*                                                                    *          
*                                                                    *          
*01* Component: zOS Data Gatherer (27401)                            *          
*                                                                    *          
*                                                                    *          
*01* Function:  This macro maps the data sections                    *          
*               of SMF record 74 subtype 6                           *          
*                                                                    *          
*01* Notes: None                                                     *          
*                                                                    *          
*01* Size: Data section                                          @H1A*          
*          -> global data  :  72 bytes                           @H1A*          
*          -> global buffer:  32 bytes (per buffer, currently 4) @H1A*          
*          -> file system  : 192 bytes (per file system)         @H1A*          
*                                                                    *          
*                                                                    *          
*01* Method of Access: See below:                                    *          
*                                                                    *          
*    BAL : ERBR746                                                   *          
*    PL/X: %INCLUDE SYSLIB(ERBR746) semicolon                        *          
*                                                                    *          
*                                                                    *          
*01* Module-type: BILINGUAL MAPPING MACRO                            *          
*                                                                    *          
*01* Dependencies: None                                              *          
*                                                                    *          
*01* Distribution Library: AGRBMAC1                             @A02C*          
*                                                                    *          
*01* Change-Activity:  For pre-HRM7708 codes, see ERBSMF74           *          
*                                                                    *          
*     $K0=MISC,HRM7708,,GUB: Split SMF 74 mapping macro              *          
*     $61=R790,HRM7790,,MWe: explicit copyright for ext. macro   @61A*          
*    $A02=ZOSB,HRG77D0,,JBa: Rename zOS Data Gatherer libraries @A02A*          
*                                                                    *          
****** END OF SPECIFICATIONS *****************************************/         
*        %GOTO PLS746;                                                          
*/*                                                                             
         SPACE 2                                                                
***********  Subtype 6, HFS Global Data Section ***************** @H1A          
         SPACE 3                                                                
R746GDAT DSECT                                                    @H1A          
R746GMXV DS    BL4      Value of VIRTUAL(MAX) (in MB)             @H1A          
R746GUSV DS    BL4      Total amount (in pages) of virtual        @H1A          
*                       storage assigned to I/O buffers           @H1A          
R746GMNF DS    BL4      Value of FIXED(MIN) (in MB)               @H1A          
R746GUSF DS    BL4      Total amount (in pages) of permanently    @H1A          
*                       fixed storage assigned to I/O buffers     @H1A          
R746GMC  DS    BL8      Number of times the metadata for a file   @H1A          
*                       was found in virtual storage (cache)      @H1A          
*                       during file lookup                        @H1A          
*                       Format: long floating point               @H1A          
R746GMNC DS    BL8      Number of times the metadata for a file   @H1A          
*                       was not found in virtual storage (cache)  @H1A          
*                       during file lookup and an index call was  @H1A          
*                       necessary which may result in an I/O      @H1A          
*                       Format: long floating point               @H1A          
R746G1C  DS    BL8      Number of times the first page of a data  @H1A          
*                       file was requested and found in virtual   @H1A          
*                       storage (cache)                           @H1A          
*                       Format: long floating point               @H1A          
R746G1NC DS    BL8      Number of times the first page of a data  @H1A          
*                       file was requested and not found in       @H1A          
*                       virtual storage (cache) and a I/O was     @H1A          
*                       necessary                                 @H1A          
*                       Format: long floating point               @H1A          
R746GLRC DS    BL4      Return code from OMVS BPX1PCT interface   @H1A          
*                       for DisplayBufferLimits command           @H1A          
R746GLRS DS    BL4      Reason code from OMVS BPX1PCT interface   @H1A          
*                       for DisplayBufferLimits command           @H1A          
R746GSRC DS    BL4      Return code from OMVS BPX1PCT interface   @H1A          
*                       for DisplayGlobalStats command            @H1A          
R746GSRS DS    BL4      Reason code from OMVS BPX1PCT interface   @H1A          
*                       for DisplayGlobalStats command            @H1A          
R746GSFL DS    BL1      Status flgags                             @H1A          
R746GONR EQU   X'80'    1... .... OMVS kernel not ready           @H1A          
R746GNBL EQU   X'40'    .1.. .... No buffer limit data            @H1A          
R746GNGD EQU   X'20'    ..1. .... No global data                  @H1A          
R746GPGD EQU   X'10'    ...1 .... Partial global data             @H1A          
*                       .... 1111 Reserved                        @H1A          
         DS    BL7      Reserved                                  @H1A          
         SPACE 2                                                                
***********  Subtype 6, HFS Global Buffer Section *************** @H1A          
         SPACE 3                                                                
R746GBUF DSECT                                                    @H1A          
R746GSB  DS    BL2      Size of buffers in buffer pool (in pages) @H1A          
R746GNDS DS    BL2      Number of data spaces for buffer pool     @H1A          
R746GSBP DS    BL4      Size of buffer pool (in pages)            @H1A          
R746GSBF DS    BL4      Size of permanently fixed buffers in      @H1A          
*                       buffer pool (in pages)                    @H1A          
         DS    BL4      Reserved                                  @H1A          
R746GBF  DS    BL8      Number of times a buffer was already      @H1A          
*                       fixed prior to an I/O request in buffer   @H1A          
*                       pool                                      @H1A          
*                       Format: long floating point               @H1A          
R746GBNF DS    BL8      Number of times a buffer was not already  @H1A          
*                       fixed prior to an I/O request in buffer   @H1A          
*                       pool                                      @H1A          
*                       Format: long floating point               @H1A          
         SPACE 2                                                                
***********  Subtype 6, HFS File System Section ***************** @H1A          
         SPACE 3                                                                
R746FSYS DSECT                                                    @H1A          
R746FSNM DS    CL44     File system name (cataloged dataset name) @H1A          
R746FSNL DS    BL1      Length of file system name                @H1A          
R746FSFL DS    BL1      Status flags                              @H1A          
R746FNHS EQU   X'80'    1... .... No HFS file system statistics   @H1A          
R746FMTC EQU   X'40'    .1.. .... Mount time changed              @H1A          
R746FFSM EQU   X'20'    ..1. .... File system now mounted         @H1A          
*                       ...1 1111 Reserved                        @H1A          
         DS    BL2      Reserved                                  @H1A          
R746FCTM DS    BL8      Current timestamp (when data obtained)    @H1A          
R746FMTM DS    BL8      Mount timestamp                           @H1A          
R746FSF  DS    BL4      Size of file system (in pages)            @H1A          
R746FPF  DS    BL4      Number of pages internally used by HFS    @H1A          
R746FPD  DS    BL4      Number of pages used for the attribute    @H1A          
*                       directory                                 @H1A          
R746FPC  DS    BL4      Number of data buffer pages cached by     @H1A          
*                       this file system                          @H1A          
R746FSFI DS    BL8      Number of sequential file data I/O        @H1A          
*                       requests issued                           @H1A          
*                       Format: long floating point               @H1A          
R746FRFI DS    BL8      Number of random file data I/O requests   @H1A          
*                       issued                                    @H1A          
*                       Format: long floating point               @H1A          
R746FMC  DS    BL8      Number of times the metadata for a file   @H1A          
*                       was found in virtual storage (cache)      @H1A          
*                       during file lookup                        @H1A          
*                       Format: long floating point               @H1A          
R746FMNC DS    BL8      Number of times the metadata for a file   @H1A          
*                       was not found in virtual storage (cache)  @H1A          
*                       during file lookup and an index call was  @H1A          
*                       necessary which may result in an I/O      @H1A          
*                       Format: long floating point               @H1A          
R746F1C  DS    BL8      Number of times the first page of a data  @H1A          
*                       file was requested and found in virtual   @H1A          
*                       storage (cache)                           @H1A          
*                       Format: long floating point               @H1A          
R746F1NC DS    BL8      Number of times the first page of a data  @H1A          
*                       file was requested and not found in       @H1A          
*                       virtual storage (cache) and a I/O was     @H1A          
*                       necessary                                 @H1A          
*                       Format: long floating point               @H1A          
R746FINT DS    BL8      Number of index new tops                  @H1A          
*                       Format: long floating point               @H1A          
R746FIS  DS    BL8      Number of index splits                    @H1A          
*                       Format: long floating point               @H1A          
R746FIJ  DS    BL8      Number of index joins                     @H1A          
*                       Format: long floating point               @H1A          
R746FIRH DS    BL8      Number of index page read hits            @H1A          
*                       Format: long floating point               @H1A          
R746FIRM DS    BL8      Number of index page read misses          @H1A          
*                       Format: long floating point               @H1A          
R746FIWH DS    BL8      Number of index page write hits           @H1A          
*                       Format: long floating point               @H1A          
R746FIWM DS    BL8      Number of index page write misses         @H1A          
*                       Format: long floating point               @H1A          
R746FSRC DS    BL4      Return code from OMVS BPX1PCT interface   @H1A          
*                       for DisplayFSStats command                @H1A          
R746FSRS DS    BL4      Reason code from OMVS BPX1PCT interface   @H1A          
*                       for DisplayFSStats command                @H1A          
         MEND  ,                                                                
*                                                                    */         
*%PLS746: ;                                                                     
*    @SPACE(2);                                                                 
*/*** Subtype 6, HFS Global Data Section *********************** @H1A*/         
*    @SPACE;                                                                    
*   DECLARE                                                                     
*     1 R746GDAT BASED(ADDR(SMF74HDR)+SMF746DO),             /*  @H1A*/         
*       3 R746GMXV FIXED(32),       /* Value of VIRTUAL(MAX) (in MB)            
*                                                                @H1A*/         
*       3 R746GUSV FIXED(32),       /* Total amount (in pages) of               
*                                      virtual storage in use    @H1A*/         
*       3 R746GMNF FIXED(32),       /* Value of FIXED(MIN) (in MB)              
*                                                                @H1A*/         
*       3 R746GUSF FIXED(32),       /* Total amount (in pages ) of              
*                                      permanently fixed storage in             
*                                      use                       @H1A*/         
*       3 R746GMC CHAR(8),          /* Number of times the metadata             
*                                      for a file was found in virtual          
*                                      storage (cache) during file              
*                                      lookup, (long floating point)            
*                                                                @H1A*/         
*       3 R746GMNC CHAR(8),         /* Number of times the metadata             
*                                      for a file was not found in              
*                                      virtual storage (cache) during           
*                                      file lookup and an index call            
*                                      was necessary which may result           
*                                      in an I/O, (long floating                
*                                      point)                    @H1A*/         
*       3 R746G1C CHAR(8),          /* Number of times the first page           
*                                      of a data file was requested             
*                                      and found in virtual storage             
*                                      (cache), (long floating point)           
*                                                                @H1A*/         
*       3 R746G1NC CHAR(8),         /* Number of times the first page           
*                                      of a data file was requested             
*                                      and not found in virtual                 
*                                      storage (cache) and a I/O was            
*                                      necessary, (long floating                
*                                      point)                    @H1A*/         
*       3 R746GLRC FIXED(32),       /* Return code from OMVS BPX1PCT            
*                                      for DisplayBufferLimits command          
*                                                                @H1A*/         
*       3 R746GLRS FIXED(32),       /* Reason code from OMVS BPX1PCT            
*                                      for DisplayBufferLimits command          
*                                                                @H1A*/         
*       3 R746GSRC FIXED(32),       /* Return code from OMVS BPX1PCT            
*                                      for DisplayGlobalStats command           
*                                                                @H1A*/         
*       3 R746GSRS FIXED(32),       /* Reason code from OMVS BPX1PCT            
*                                      for DisplayGlobalStats command           
*                                                                @H1A*/         
*       3 R746GSFL BIT(8),          /* Status Flags              @H1A*/         
*         5 R746GONR BIT(1),        /* OMVS kernel not ready     @H1A*/         
*         5 R746GNBL BIT(1),        /* No buffer limit data      @H1A*/         
*         5 R746GNGD BIT(1),        /* No global data            @H1A*/         
*         5 R746GPGD BIT(1),        /* Partial global data       @H1A*/         
*         5 * BIT(4),               /* Reserved                  @H1A*/         
*       3 * CHAR(7);                /* Reserved                  @H1A*/         
*    @SPACE(2);                                                                 
*/*** Subtype 6, HFS Global Buffer Section ********************* @H1A*/         
*    @SPACE;                                                                    
*   DECLARE                                                                     
*     1 R746GBUF BASED(ADDR(SMF74HDR)+SMF746BO),             /*  @H1A*/         
*       3 R746GSB  FIXED(16),       /* Size of buffers in buffer pool           
*                                      (in pages)                @H1A*/         
*       3 R746GNDS FIXED(16),       /* Number of data spaces for                
*                                      buffer pool               @H1A*/         
*       3 R746GSBP FIXED(32),       /* Size of buffer pool (in pages)           
*                                                                @H1A*/         
*       3 R746GSBF FIXED(32),       /* Size of permanently fixed                
*                                      buffers in buffer pool (in               
*                                      pages)                    @H1A*/         
*       3 * FIXED(32),              /* Reserved                  @H1A*/         
*       3 R746GBF CHAR(8),          /* Number of times a buffer was             
*                                      already fixed prior to an I/O            
*                                      request in buffer pool, (long            
*                                      floating point)           @H1A*/         
*       3 R746GBNF CHAR(8);         /* Number of times a buffer was             
*                                      not already fixed prior to an            
*                                      I/O request in buffer pool,              
*                                      (long floating point)     @H1A*/         
*    @SPACE(2);                                                                 
*/*** Subtype 6, HFS File System Section *********************** @H1A*/         
*    @SPACE;                                                                    
*   DECLARE                                                                     
*     1 R746FSYS BASED(ADDR(SMF74HDR)+SMF746FO),             /*  @H1A*/         
*       3 R746FSNM CHAR(44),        /* File system name (catologed              
*                                      dataset name)             @H1A*/         
*       3 R746FSNL FIXED(8),        /* Length of file system name               
*                                                                @H1A*/         
*       3 R746FSFL BIT(8),          /* Status flags              @H1A*/         
*         5 R746FNHS BIT(1),        /* No HFS file system statistics            
*                                                                @H1A*/         
*         5 R746FMTC BIT(1),        /* Mount time changed        @H1A*/         
*         5 R746FFSM BIT(1),        /* File system now mounted   @H1A*/         
*         5 * BIT(5),               /* Status flags              @H1A*/         
*       3 * CHAR(2),                /* Reserved                  @H1A*/         
*       3 R746FCTM CHAR(8),         /* Current timestamp (when data             
*                                      obtained)                 @H1A*/         
*       3 R746FMTM CHAR(8),         /* Mount timestamp           @H1A*/         
*       3 R746FSF FIXED(32),        /* Size of file system (in pages)           
*                                                                @H1A*/         
*       3 R746FPF FIXED(32),        /* Number of pages internally used          
*                                      by HFS                    @H1A*/         
*       3 R746FPD FIXED(32),        /* Number of pages used for the             
*                                      attribute directory       @H1A*/         
*       3 R746FPC FIXED(32),        /* Number of data buffer pages              
*                                      cached by this file system               
*                                                                @H1A*/         
*       3 R746FMD,                  /* Measurement data          @H1A*/         
*         5 R746FSFI CHAR(8),       /* Number of sequential file data           
*                                      I/O requests issued, (long               
*                                      floating point)           @H1A*/         
*         5 R746FRFI CHAR(8),       /* Number of random file data I/O           
*                                      requests issued, (long floating          
*                                      point)                    @H1A*/         
*         5 R746FMC CHAR(8),        /* Number of times the metadata             
*                                      for a file was found in virtual          
*                                      storage (cache) during file              
*                                      lookup, (long floating point)            
*                                                                @H1A*/         
*         5 R746FMNC CHAR(8),       /* Number of times the metadata             
*                                      for a file was not found in              
*                                      virtual storage (cache) during           
*                                      file lookup and an index call            
*                                      was necessary which may result           
*                                      in an I/O, (long floating                
*                                      point)                    @H1A*/         
*         5 R746F1C CHAR(8),        /* Number of times the first page           
*                                      of a data file was requested             
*                                      and found in virtual storage             
*                                      (cache), (long floating point)           
*                                                                @H1A*/         
*         5 R746F1NC CHAR(8),       /* Number of times the first page           
*                                      of a data file was requested             
*                                      and not found in virtual                 
*                                      storage (cache) and a I/O was            
*                                      necessary, (long floating                
*                                      point)                    @H1A*/         
*         5 R746FINT CHAR(8),       /* Number of index new tops, (long          
*                                      floating point)           @H1A*/         
*         5 R746FIS CHAR(8),        /* Number of index splits, (long            
*                                      floating point)           @H1A*/         
*         5 R746FIJ CHAR(8),        /* Number of index joins, (long             
*                                      floating point)           @H1A*/         
*         5 R746FIRH CHAR(8),       /* Number of index page read hits,          
*                                      (long floating point)     @H1A*/         
*         5 R746FIRM CHAR(8),       /* Number of index page read                
*                                      misses, (long floating point)            
*                                                                @H1A*/         
*         5 R746FIWH CHAR(8),       /* Number of index page write hits,         
*                                      (long floating point)     @H1A*/         
*         5 R746FIWM CHAR(8),       /* Number of index page write               
*                                      misses, (long floating point)            
*                                                                @H1A*/         
*       3 R746FSRC FIXED(32),       /* Return code from OMVS BPX1PCT            
*                                      for DisplayFSStats command               
*                                                                @H1A*/         
*       3 R746FSRS FIXED(32);       /* Reason code from OMVS BPX1PCT            
*                                      for DisplayFSStats command               
*                                                                @H1A*/         
