*/*      Bilingual Mapping Macro for SMF 74.7 Data Sections                     
         MACRO                                                                  
         ERBR747                                                                
*                                                                    */         
*/*** START OF SPECIFICATIONS ****************************************          
*                                                                    *          
*01* Proprietary Statement:                                          *          
*       Licensed Materials - Property of IBM                   @61A  *          
*       "Restricted Materials of IBM"                          @61A  *          
*       Copyright IBM Corp. 2003, 2021                               *          
*                                                                    *          
*       Status: z/OS V2R5 Data Gatherer (HRG77D0)                    *          
*                                                                    *          
*01* Macro Name: ERBR747                                             *          
*                                                                    *          
*01* Descriptive Name:  SMF Record 74 Subtype 7 Data Sections        *          
*                       (Monitor I FICON Director Statistics)        *          
*                                                                    *          
*                                                                    *          
*01* DSECT Name: R747GDAT Global data section                        *          
*                R747SDAT Switch data section                        *          
*                R747PDAT Port data section                          *          
*                R747CDAT Connector data section                     *          
*                                                                    *          
*                                                                    *          
*01* Component: zOS Data Gatherer (27401)                            *          
*                                                                    *          
*                                                                    *          
*01* Function:  This macro maps the data sections                    *          
*               of SMF record 74 subtype 7                           *          
*                                                                    *          
*01* Notes: None                                                     *          
*                                                                    *          
*01* Size:  Data section                                         @I1A*          
*           -> global data   :  80 bytes                         @I1A*          
*           -> switch data   :  48 bytes                         @I1A*          
*           -> port data     :  72 bytes (per port section)      @I1A*          
*           -> connector data:   8 bytes (per connector section) @I1A*          
*                                                                    *          
*                                                                    *          
*01* Method of Access:                                               *          
*                                                                    *          
*    BAL : ERBR747                                                   *          
*    PL/X: %INCLUDE SYSLIB(ERBR747) semicolon                        *          
*                                                                    *          
*                                                                    *          
*01* Module-type: BILINGUAL MAPPING MACRO                            *          
*                                                                    *          
*01* Dependencies: None                                              *          
*                                                                    *          
*01* Distribution Library: AGRBMAC1                             @A02C*          
*                                                                    *          
*01* Change-Activity:  For pre-HRM7708 codes, see ERBSMF74           *          
*                                                                    *          
*     $K0=MISC,HRM7708,,GUB: Split SMF 74 mapping macro              *          
*     PS: Cascading Switch support                           @WA52396*          
*     PS: Change port flags                                  @WA56998*          
*     SHR: Rebuilds port/connector sections                  @OA03348*          
*     FDL: Adds Ficon-Cascaded-Switch indicator (R747FCCS)   @OA06258*          
*     $41=FCDC,HRM7770,,PS: Serial number for Port = CU          @41A*          
*     $61=R790,HRM7790,,MWe: explicit copyright for ext. macro   @61A*          
*    $A02=ZOSB,HRG77D0,,JBa: Rename zOS Data Gatherer libraries @A02A*          
*                                                                    *          
****** END OF SPECIFICATIONS *****************************************/         
*        %GOTO PLS747;                                                          
*/*                                                                             
         SPACE 2                                                                
************ Subtype 7, FCD Global Data Section ***************** @I1A          
         SPACE 3                                                                
R747GDAT DSECT                                                    @I1A          
R747GCFL DS    BL1      Configuration change flags                @I1A          
R747GDCA EQU   X'80'    1... ....  ON = Config. changed during    @I1A          
*                                       interval                  @I1A          
R747GIAC EQU   X'40'    .1.. ....  ON = Config. changed since IPL @I1A          
R747GIOD EQU   X'20'    ..1. ....  ON = System IPLed via IODF     @I1A          
R747GICV EQU   X'10'    ...1 ....  ON = I/O conf. token is valid  @I1A          
*                       .... 1111  Reserved                       @I1A          
         DS    BL1      Reserved                                  @I1A          
R747GNFD DS    BL2      Number of installed FCD switches          @I1A          
R747GINM DS    CL44     IODF name                                 @I1A          
R747GISF DS    CL2      Suffix of IODF name                       @I1A          
R747GICI DS    0CL18    IODF creation info                        @I1A          
R747GICD DS    CL10     IODF creation date mm/dd/yyyy             @I1A          
R747GICT DS    CL8      IODF creation time hh.mm.ss               @I1A          
         DS    BL12     Reserved                                  @I1A          
         SPACE 2                                                                
************ Subtype 7, FCD Switch Data Section ***************** @I1A          
         SPACE 3                                                                
R747SDAT DSECT                                                    @I1A          
R747SDEV DS    BL2      Switch device number                      @I1A          
R747SLSN DS    BL1      Logical switch number                     @I1A          
R747SPFL DS    BL1      Switch processing flags                   @I1A          
R747SVAR EQU   X'80'    Switch status changed                     @I1A          
R747SNPC EQU   X'40'    Number of ports has changed               @I1A          
R747SOFF EQU   X'20'    ..1. .... Switch is offline           @WA52396          
R747SNOL EQU   X'10'    ...1 .... Switch is now online        @OA03348          
R747SFCS EQU   X'08'    .... 1... Cascaded switch             @OA06258          
*                       .... .111 Reserved                    @OA06258          
R747SND  DS    BL32     ND associated with switch device          @I1A          
R747SNSP DS    BL2      Number of supported ports                 @I1A          
R747SNIP DS    BL2      Number of installed ports                 @I1A          
         DS    BL8      Reserved                                  @I1A          
         SPACE 2                                                                
************ Subtype 7, FCD Port Data Section ******************* @I1A          
         SPACE 3                                                                
R747PDAT DSECT                                                    @I1A          
R747PNUM DS    BL1      Port number                               @I1A          
R747PADR DS    BL1      Port address                              @I1A          
R747PTFL DS    BL1      Port type flag                            @I1A          
R747PSCU EQU   X'80'    1... .... Port type is single CU          @I1A          
R747PMCU EQU   X'40'    .1.. .... Port type is multiple CUs       @I1A          
R747PCHP EQU   X'20'    ..1. .... Port type is CHPID              @I1A          
R747PSW  EQU   X'10'    ...1 .... Port type is switch         @WA52396          
*                       .... 1111 Reserved                    @WA52396          
R747PSFL DS    BL1      Status flags                              @I1A          
R747PTNU EQU   X'80'    1... .... Port type is not unique         @I1A          
R747PINU EQU   X'40'    .1.. .... Id is not unique or not known   @I1A          
R747POSY EQU   X'20'    ..1. .... Channel on caller's system  @WA52396          
R747PINS EQU   X'10'    ...1 .... Port installed              @WA52396          
R747PVAR EQU   X'08'    .... 1... Port status changed             @I1A          
R747PREM EQU   X'04'    .... .1.. Port has been removed           @I1A          
R747PACT EQU   X'02'    .... ..1. Port has been activated         @I1A          
R747PNMD EQU   X'01'    .... ...1 This entry doesn't contain      @I1A          
*                                 measurement data                @I1A          
R747PCU  DS    0BL2     Connector id (CU)                         @I1A          
         DS    BL1      Reserved                                  @I1A          
R747PCP  DS    BL1      Connector id (channel path)               @I1A          
R747PCUN DS    BL1      Number of connecting CUs                  @I1A          
R747PNPC DS    BL1      Number of connector sections              @I1A          
R747PXPC DS    BL2      Index of first connector section          @I1A          
R747PPFL DS    BL1      Port flags                            @WA56998          
R747PPIR EQU   X'80'    1... .... Port information was        @WA56998          
*                                 returned at least once for  @WA56998          
*                                 this port                   @WA56998          
R747PNTI EQU   X'40'    .1.. .... Port information showed     @WA56998          
*                                 this port not installed     @WA56998          
R747PLF  EQU   X'20'    ..1. .....Port information showed     @WA56998          
*                                 link failure condition      @WA56998          
R747POFF EQU   X'10'    ...1 .... Port information showed     @OA03348          
*                                 this port offline           @WA56998          
R747PSCR EQU   X'08'    .... 1... Statistics were returned at @OA03348          
*                                 least once for this port    @WA56998          
*                       .... .111 Reserved for future use     @WA56998          
         DS    BL5      Reserved                              @WA56998          
R747PFPT DS    BL8      Frame pacing time (in units of 2.5        @I1A          
*                       micro-seconds)                        @WA52396          
*                       Format: long floating point               @I1A          
R747PNWR DS    BL8      Number of words received                  @I1A          
*                       Format: long floating point               @I1A          
R747PNWT DS    BL8      Number of words transmitted               @I1A          
*                       Format: long floating point               @I1A          
R747PNFR DS    BL8      Number of frames received                 @I1A          
*                       Format: long floating point               @I1A          
R747PNFT DS    BL8      Number of frames transmitted              @I1A          
*                       Format: long floating point               @I1A          
R747PNER DS    BL8      Number of errors                      @WA46825          
*                       Format: long floating point               @I1A          
         DS    BL8      Reserved                              @WA46825          
R747PAND DS    BL32     Node descriptor of attached unit          @41A          
         SPACE 2                                                                
************ Subtype 7, FCD Connector Data Section ************** @I1A          
         SPACE 3                                                                
R747CDAT DSECT                                                    @I1A          
R747CNUM DS    BL1      Port number                               @I1A          
R747CADR DS    BL1      Port address                              @I1A          
R747CTFL DS    BL1      Port type flag                            @I1A          
R747CSCU EQU   X'80'    1... .... Port type is single CU          @I1A          
R747CMCU EQU   X'40'    .1.. .... Port type is multiple CUs       @I1A          
R747CCHP EQU   X'20'    ..1. .... Port type is CHPID              @I1A          
R747CSW  EQU   X'10'    ...1 .... Port type is switch         @WA52396          
*                       .... 1111 Reserved                    @WA52396          
R747CSFL DS    BL1      Status flags                              @I1A          
R747CTNU EQU   X'80'    1... .... Port type is not unique         @I1A          
R747CINU EQU   X'40'    .1.. .... Id is not unique or not known   @I1A          
R747COSY EQU   X'20'    ..1. .... Channel on caller system    @WA52396          
R747CINS EQU   X'10'    ...1 .... Port installed              @WA52396          
R747CVAR EQU   X'08'    .... 1... Port status changed             @I1A          
R747CREM EQU   X'04'    .... .1.. Port has been removed           @I1A          
R747CACT EQU   X'02'    .... ..1. Port has been activated         @I1A          
R747CNMD EQU   X'01'    .... ...1 This entry doesn't contain      @I1A          
*                                 measurement data                @I1A          
R747CCU  DS    0BL2     Connector id (CU)                         @I1A          
         DS    BL1      Reserved                                  @I1A          
R747CCP  DS    BL1      Connector id (channel path)               @I1A          
R747CCUN DS    BL1      Number of connecting CUs                  @I1A          
         DS    BL1      Reserved                                  @I1A          
         MEND  ,                                                                
*                                                                    */         
*%PLS747: ;                                                                     
*    @SPACE(2);                                                                 
*/*** Subtype 7, FCD Global Data Section *********************** @I1A*/         
*    @SPACE;                                                                    
*   DECLARE                                                                     
*     1 R747GDAT BASED(ADDR(SMF74HDR)+SMF747GO),             /*  @I1A*/         
*       3 R747GCFL BIT(8),          /* Configuration change flags               
*                                                                @I1A*/         
*         5 R747GDCA BIT(1),        /* =1, Configuration changed                
*                                      during interval           @I1A*/         
*         5 R747GIAC BIT(1),        /* =1, Configuration changed since          
*                                      IPL                       @I1A*/         
*         5 R747GIOD BIT(1),        /* =1, System IPLed via IODF @I1A*/         
*         5 R747GICV BIT(1),        /* =1, I/O configuration token is           
*                                      valid                     @I1A*/         
*         5 * BIT(4),               /* Reserved                  @I1A*/         
*       3 * CHAR(1),                /* Reserved                  @I1A*/         
*       3 R747GNFD FIXED(16),       /* Number of installed FCD                  
*                                      switches                  @I1A*/         
*       3 R747GINM CHAR(44),        /* IODF name                 @I1A*/         
*       3 R747GISF CHAR(2),         /* Suffix of IODF name       @I1A*/         
*       3 R747GICI CHAR(18),        /* IODF creation information @I1A*/         
*         5 R747GICD CHAR(10),      /* IODF creation date mm/dd/yyyy            
*                                                                @I1A*/         
*         5 R747GICT CHAR(8),       /* IODF creation time hh.mm.ss              
*                                                                @I1A*/         
*       3 * CHAR(12);               /* Reserved                  @I1A*/         
*    @SPACE(2);                                                                 
*/*** Subtype 7, FCD Switch Data Section *********************** @I1A*/         
*    @SPACE;                                                                    
*   DECLARE                                                                     
*     1 R747SDAT BASED(ADDR(SMF74HDR)+SMF747SO), /* Switch data                 
*                                      section                   @I1A*/         
*       3 R747SDEV FIXED(16),       /* Switch device number      @I1A*/         
*       3 R747SLSN FIXED(8),        /* Logical switch number     @I1A*/         
*       3 R747SPFL BIT(8),          /* Switch processing flags   @I1A*/         
*         5 R747SVAR BIT(1),        /* =1, status of switch has                 
*                                      changed                   @I1A*/         
*         5 R747SNPC BIT(1),        /* =1, number of ports has                  
*                                      changed                   @I1A*/         
*         5 R747SOFF BIT(1),        /* =1, switch is offline @WA52396*/         
*         5 R747SNOL BIT(1),        /* =1, switch is now online                 
*                                                            @OA03348*/         
*         5 R747SFCS BIT(1),        /* =1, cascaded switch   @OA06258*/         
*         5 * BIT(3),               /* Reserved              @OA06258*/         
*       3 R747SND CHAR(32),         /* ND associated with switch                
*                                      device                    @I1A*/         
*       3 R747SNSP FIXED(16),       /* Number of supported ports for            
*                                      this switch               @I1A*/         
*       3 R747SNIP FIXED(16),       /* Number of installed ports for            
*                                      this switch               @I1A*/         
*       3 * CHAR(8);                /* Reserved                  @I1A*/         
*    @SPACE(2);                                                                 
*/*** Subtype 7, FCD Port Data Section ************************* @I1A*/         
*    @SPACE;                                                                    
*   DECLARE                                                                     
*     1 R747PDAT BASED(ADDR(SMF74HDR) + SMF747PO), /* Port data                 
*                                      section                   @I1A*/         
*       3 R747PNUM CHAR(1),         /* Port number               @I1A*/         
*       3 R747PADR CHAR(1),         /* Port address              @I1A*/         
*       3 R747PTFL BIT(8),          /* Port type flags           @I1A*/         
*         5 R747PSCU BIT(1),        /* Port type is single CU    @I1A*/         
*         5 R747PMCU BIT(1),        /* Port type is multiple CU  @I1A*/         
*         5 R747PCHP BIT(1),        /* Port type is CHPID        @I1A*/         
*         5 R747PSW  BIT(1),        /* Port type is switch   @WA52396*/         
*         5 * BIT(4),               /* Reserved              @WA52396*/         
*       3 R747PSFL BIT(8),          /* Status flags              @I1A*/         
*         5 R747PTNU BIT(1),        /* Port type is not unique   @I1A*/         
*         5 R747PINU BIT(1),        /* Id is not unique or not known            
*                                                                @I1A*/         
*         5 R747POSY BIT(1),        /* 1=, channel on caller's                  
*                                      system                @WA52396*/         
*         5 R747PINS BIT(1),        /* 1=, port installed    @WA52396*/         
*         5 R747PVAR BIT(1),        /* Port status changed       @I1A*/         
*         5 R747PREM BIT(1),        /* Port has been removed     @I1A*/         
*         5 R747PACT BIT(1),        /* Port has been activated   @I1A*/         
*         5 R747PNMD BIT(1),        /* This entry doesn't contain               
*                                      measurement data          @I1A*/         
*       3 R747PCU CHAR(2),          /* Connector id (CU)         @I1A*/         
*         5 * CHAR(1),              /* Reserved                  @I1A*/         
*         5 R747PCP CHAR(1),        /* Connector id (channel path)              
*                                                                @I1A*/         
*       3 R747PCUN FIXED(8),        /* Number of connector CUs   @I1A*/         
*       3 R747PNPC FIXED(8),        /* Number of connector sections             
*                                                                @I1A*/         
*       3 R747PXPC FIXED(16),       /* Index of first connector                 
*                                      section                   @I1A*/         
*       3 R747PPFL BIT(8),          /* Port flags            @WA56998*/         
*         5 R747PPIR BIT(1),        /* Port information was                     
*                                      returned at least once                   
*                                      for this port         @WA56998*/         
*         5 R747PNTI BIT(1),        /* Port information showed                  
*                                      this port not installed                  
*                                                            @WA56998*/         
*         5 R747PLF  BIT(1),        /* Port information showed                  
*                                      link failure condition                   
*                                                            @WA56998*/         
*         5 R747POFF BIT(1),        /* Port information showed                  
*                                      this port offline     @WA56998*/         
*         5 R747PSCR BIT(1),        /* Statistics were returned                 
*                                      at least once for this                   
*                                      port                  @WA56998*/         
*         5 *        BIT(3),        /* Reserved for future use                  
*                                                            @WA56998*/         
*       3 * CHAR(5),                /* Reserved              @WA56998*/         
*       3 R747PSTD,                 /* Statistical data      @WA46825*/         
*         ?ERBFITEM(5                                                           
*             R747PFPT) FLOAT(56);, /* Frame pacing time in units of            
*                                      2.5 micro-seconds (long                  
*                                      floating point)       @WA46825*/         
*         ?ERBFITEM(5                                                           
*             R747PNWR) FLOAT(56);, /* Number of words received                 
*                                      (long floating point) @WA46825*/         
*         ?ERBFITEM(5                                                           
*             R747PNWT) FLOAT(56);, /* Number of words transmitted              
*                                      (long floating point) @WA46825*/         
*         ?ERBFITEM(5                                                           
*             R747PNFR) FLOAT(56);, /* Number of frames received                
*                                      (long floating point) @WA46825*/         
*         ?ERBFITEM(5                                                           
*             R747PNFT) FLOAT(56);, /* Number of frames transmitted             
*                                      (long floating point) @WA46825*/         
*         ?ERBFITEM(5                                                           
*             R747PNER) FLOAT(56);, /* Number of errors (long floating          
*                                      point)                @WA46825*/         
*       3 * CHAR(8),                /* Reserved              @WA46825*/         
*       3 R747PAND CHAR(32),        /* Node descriptor of                       
*                                      attached unit             @41A*/         
*       3 * CHAR(0);                /* End of measurements       @I1A*/         
*    @SPACE(2);                                                                 
*/*** Subtype 7, FCD Connector Data Section ******************** @I1A*/         
*    @SPACE;                                                                    
*   DECLARE                                                                     
*     1 R747CDAT BASED(ADDR(SMF74HDR) + SMF747CO), /* Port data                 
*                                      section                   @I1A*/         
*       3 R747CNUM CHAR(1),         /* Port number               @I1A*/         
*       3 R747CADR CHAR(1),         /* Port address              @I1A*/         
*       3 R747CTFL BIT(8),          /* Port type flags           @I1A*/         
*         5 R747CSCU BIT(1),        /* Port type is single CU    @I1A*/         
*         5 R747CMCU BIT(1),        /* Port type is multiple CU  @I1A*/         
*         5 R747CCHP BIT(1),        /* Port type is CHPID        @I1A*/         
*         5 R747CSW  BIT(1),        /* Port type is switch   @WA52396*/         
*         5 * BIT(4),               /* Reserved              @WA52396*/         
*       3 R747CSFL BIT(8),          /* Status flags              @I1A*/         
*         5 R747CTNU BIT(1),        /* Port type is not unique   @I1A*/         
*         5 R747CINU BIT(1),        /* Id is not unique or not known            
*                                                                @I1A*/         
*         5 R747COSY BIT(1),        /* 1=, channel on caller's                  
*                                      system                @WA52396*/         
*         5 R747CINS BIT(1),        /* 1=, port installed    @WA52396*/         
*         5 R747CVAR BIT(1),        /* Port status changed       @I1A*/         
*         5 R747CREM BIT(1),        /* Port has been removed     @I1A*/         
*         5 R747CACT BIT(1),        /* Port has been activated   @I1A*/         
*         5 R747CNMD BIT(1),        /* This entry doesn't contain               
*                                      measurement data          @I1A*/         
*       3 R747CCU CHAR(2),          /* Connector id (CU)         @I1A*/         
*         5 * CHAR(1),              /* Reserved                  @I1A*/         
*         5 R747CCP CHAR(1),        /* Connector id (channel path)              
*                                                                @I1A*/         
*       3 R747CCUN FIXED(8),        /* Number of connector CUs   @I1A*/         
*       3 * CHAR(1);                /* Reserved                  @I1A*/         
