*/*      Bilingual Mapping Macro for SMF 74.2 Data Sections                     
         MACRO                                                                  
         ERBR742                                                                
*                                                                    */         
*/*** START OF SPECIFICATIONS ****************************************          
*                                                                    *          
*01* Proprietary Statement:                                          *          
*       Licensed Materials - Property of IBM                   @61A  *          
*       "Restricted Materials of IBM"                          @61A  *          
*       Copyright IBM Corp. 2003, 2021                               *          
*                                                                    *          
*       Status: z/OS V2R5 Data Gatherer (HRG77D0)                    *          
*                                                                    *          
*01* Macro Name: ERBR742                                             *          
*                                                                    *          
*01* Descriptive Name:  SMF Record 74 Subtype 2 Data Sections        *          
*                       (Monitor III XCF Activity Data)              *          
*                                                                    *          
*                                                                    *          
*01* DSECT Name: R742CNTL Control Section                            *          
*                R742SYS  System Data Section                        *          
*                R742PTH  Path Data Section                          *          
*                R742MBR  Member Data Section                        *          
*                                                                    *          
*                                                                    *          
*01* Component: zOS Data Gatherer (27401)                            *          
*                                                                    *          
*                                                                    *          
*01* Function:  This macro maps the control and data sections        *          
*               of SMF record 74 subtype 2                           *          
*                                                                    *          
*01* Notes: None                                                     *          
*                                                                    *          
*01* Size:  Control section :  28 bytes (each)                       *          
*           Data section                                             *          
*           -> System data  :  56 bytes (each)                       *          
*           -> Path data    : 260 bytes (each)               @OA57325*          
*           -> Member data  :  56 bytes (each)                   @11C*          
*                                                                    *          
*                                                                    *          
*01* Method of Access: See below:                                    *          
*                                                                    *          
*    BAL : ERBR742                                                   *          
*    PL/X: %INCLUDE SYSLIB(ERBR742) semicolon                        *          
*                                                                    *          
*                                                                    *          
*01* Module-type: BILINGUAL MAPPING MACRO                            *          
*                                                                    *          
*01* Dependencies: None                                              *          
*                                                                    *          
*01* Distribution Library: AGRBMAC1                             @A02C*          
*                                                                    *          
*01* Change-Activity:  For pre-HRM7708 codes, see ERBSMF74           *          
*                                                                    *          
*     $K0=MISC,HRM7708,,GUB: Split SMF 74 mapping macro              *          
*     $11=XCFO,HRM7740,,HBE: XCF Activity Data Online            @11A*          
*     PMU: Fixes duplicate R742MACT definition               @OA22304*          
*     $61=R790,HRM7790,,MWe: explicit copyright for ext. macro   @61A*          
*     UMu: XCF transport class simplification - stage 1      @OA57325*          
*    $A02=ZOSB,HRG77D0,,JBa: Rename zOS Data Gatherer libraries @A02A*          
*    JKu: Update field description for REST services         @OA62081*          
*                                                                    *          
****** END OF SPECIFICATIONS *****************************************/         
*        %GOTO PLS742;                                                          
*/*                                                                             
         SPACE 2                                                                
******  Subtype 2, Control Data Section ************************* @Y1A          
         SPACE 3                                                                
R742CNTL DSECT                                                    @Y1A          
R742TSR  DS    BL2      Total number of small records             @Y1A          
         DS    BL2      Unused                                    @Y1A          
R742STOT DS    BL4      Total number of system data sections                    
*                       in large SMF record                       @Y1A          
R742SNXT DS    BL4      Number of system data sections                          
*                       in following small records                @Y1A          
R742PTOT DS    BL4      Total number of path data sections                      
*                       in large SMF record                       @Y1A          
R742PNXT DS    BL4      Number of path data sections                            
*                       in following small records                @Y1A          
R742MTOT DS    BL4      Total number of member data sections                    
*                       in large SMF record                       @Y1A          
R742MNXT DS    BL4      Number of member data sections in following             
*                       small records                             @Y1A          
         SPACE 2                                                                
***********  Subtype 2 System Data Section  ********************* @Y1A          
         SPACE 3                                                                
R742SYS  DSECT                                                    @Y1A          
R742SNME DS    CL8      System name                               @Y1A          
R742SSTF DS    BL1      Status flags                              @Y1A          
R742SACT EQU   X'80'    1... .... System became active during                   
*                                 this interval                   @Y1A          
R742SIAC EQU   X'40'    .1.. .... System became inactive during                 
*                                 this interval                   @Y1A          
R742SRES EQU   X'20'    ..1. .... Counts reset by XCF during                    
*                                 this interval                   @Y1A          
R742SPAR EQU   X'10'    ...1 .... Partially not active during RMF               
*                                 post processor interval.        @Y1A          
*                       .... 1111 Unused                          @Y1A          
R742SDIR DS    BL1      Direction                                 @Y1A          
R742SIN  EQU   X'80'    1... ....   Inbound                       @Y1A          
R742SOUT EQU   X'40'    .1.. ....   Outbound                      @Y1A          
R742SLCL EQU   X'20'    ..1. ....   Local                         @Y1A          
*                       ...1 1111   Reserved                      @Y1A          
         DS    CL2      Unused                                    @Y1A          
R742SPTH DS    BL4      Current number of paths in service.                     
*                       Zero for local entry.                                   
*                       If outbound entry, count is for indicated               
*                       transport class.                          @Y1A          
R742SBSY DS    BL4      Number of no buffer conditions.                         
*                       For local or outbound entry, count is for               
*                       indicated transport class.                @Y1A          
R742SNOP DS    BL4      Number of no path conditions.                           
*                       Zero for local entry.                                   
*                       For outbound entry, count is for                        
*                       indicated transport class.                @Y1A          
R742SMXB DS    BL4      Maximum 1K blocks of message buffer space.              
*                       For local or outbound entry, count is for               
*                       indicated transport class.                @Y1A          
R742SBIG DS    BL4      Number of message too big conditions.                   
*                       Zero for inbound entry.                   @Y1A          
R742SFIT DS    BL4      Number of messages that fits in buffer.                 
*                       Zero for inbound entry.                   @Y1A          
R742SSML DS    BL4      Number of message too small conditions.                 
*                       Zero for inbound entry.                   @Y1A          
R742SOVR DS    BL4      Number of messages for which signalling                 
*                       service was optimized.                                  
*                       Zero for inbound entry.                   @Y1A          
R742STCL DS    BL4      Message length for transport class.                     
*                       Zero for inbound entry.                   @Y1A          
R742STCN DS    CL8      Transport class name.                                   
*                       Blanks for inbound entry.                 @Y1A          
         SPACE 2                                                                
***********  Subtype 2, Path Data Section  ********************** @Y1A          
         SPACE 3                                                                
R742PTH  DSECT                                                    @Y1A          
R742PNME DS    CL8      System name                               @Y1A          
R742PDEV DS    CL4      Device number                             @Y1A          
R742PSTF DS    BL1      Status flags                              @Y1A          
R742PACT EQU   X'80'    1... .... Path became active during                     
*                                 this interval                   @Y1A          
R742PIAC EQU   X'40'    .1.. .... Path became inactive during                   
*                                 this interval                   @Y1A          
R742PRES EQU   X'20'    ..1. .... Counts reset by XCF during                    
*                                 this interval                   @Y1A          
R742PPAR EQU   X'10'    ...1 .... Reserved. Used by RMF post processor          
*                                                             @OA62081          
*                       .... 1111 Unused                          @Y1A          
R742PDIR DS    BL1      Direction path                            @Y1A          
R742PIN  EQU   X'80'    1... ....   Inbound path                  @Y1A          
R742POUT EQU   X'40'    .1.. ....   Outbound path                 @Y1A          
*                       ..11 1111   Reserved                      @Y1A          
R742PTYP DS    BL1      Path type indicator: '01'x for CTC,                     
*                       '03'x for list structure                  @C1A          
         DS    CL1      Unused                                    @Y1A          
R742PONA DS    CL8      Name of system on other end if known,                   
*                       otherwise blanks.                         @Y1A          
R742PODV DS    CL4      Device number on other end if known,                    
*                       otherwise blanks.                         @Y1A          
R742PSTA DS    BL1      Path status                               @Y1A          
R742PST  EQU   X'80'    1... ....   Starting                      @Y1A          
R742PRS  EQU   X'40'    .1.. ....   Restarting                    @Y1A          
R742PWK  EQU   X'20'    ..1. ....   Working                       @Y1A          
R742PSP  EQU   X'10'    ...1 ....   Stopping                      @Y1A          
R742PLK  EQU   X'08'    .... 1...   Waiting for completion of                   
*                                   communication link            @Y1A          
R742PNP  EQU   X'04'    .... .1..   Not operational. Path defined to            
*                                   XCF but not usable until hardware           
*                                   and/or definition problems are              
*                                   resolved                  @OA62081          
R742PSF  EQU   X'02'    .... ..1.   Stop failed               @WA22735          
R742PRB  EQU   X'01'    .... ...1   Rebuilding                @WA22735          
R742PSTM DS    BL1      More path status flags                    @11A          
R742PQG  EQU   X'80'    1... ....   Quiescing                     @11A          
R742PQD  EQU   X'40'    .1.. ....   Quiesced                      @11A          
         DS    CL2      Unused                                    @11C          
R742PRET DS    BL4      Path retry limit                          @Y1A          
R742PRST DS    BL4      Number of restarts                        @Y1A          
R742PMXM DS    BL4      Maximum number of 1K blocks message buffer              
*                       space.                                    @Y1A          
R742PSIG DS    BL4      Number of outbound (inbound) signals sent               
*                       (received) over path                      @Y1A          
R742PQLN DS    BL4      Number of outbound signals pending transfer             
*                       on path                                   @Y1A          
R742PIBR DS    BL4      Number of inbound signals refused due to                
*                       maximum message limit                     @Y1A          
R742PSUS DS    BL4      Number of outbound signals satisfied by                 
*                       suspended path                            @Y1A          
R742PAPP DS    BL4      Number of outbound signal requests satisfied            
*                       by this path while active.                @Y1A          
R742PTCN DS    CL8      Transport class name. For an outbound path,             
*                       the class to which the path is assigned. For            
*                       an inbound path, the class to which the out-            
*                       bound side of the path is assigned, blanks if           
*                       not known.                            @OA62081          
R742PSTR DS    CL16     Name of XES list structure being used as a              
*                       path, blank for CTC's                     @C1A          
R742PIOT DS    BL4      For inbound paths:                                      
*                       Average I/O transfer time for the most                  
*                       recently received signals.                              
*                       Units: micro seconds.                                   
*                       Zero if not available.                                  
*                       X'FFFFFFFF' for overflow                                
*                       (more than 35 minutes).               @WA41317          
R742PRCT DS    BL4      Path retry count                          @11A          
R742PPND DS    BL4      The current number of signals pending transfer          
*                       on the path (outbound only)               @11A          
R742PUSE DS    BL4      The current number of 1K byte blocks of                 
*                       message buffer space in use by this path  @11A          
R742PLIN DS    BL4      List number within structure              @11A          
         DS    CL4      Reserved                              @OA57325          
R742PUSG_Stats DS 4CL32 Path usage statistics array           @OA57325          
         ORG   R742PUSG_Stats                                 @OA57325          
R742PUSG_TimeSum DS FL8 Total time this path was in use at the                  
*                       indicated percent utilization (in ms) @OA57325          
R742PUSG_TimeSsq DS FL8 Squared microseconds this path was in use               
*                       at the indicated percent utilization  @OA57325          
R742PUSG_Time#   DS BL4 Number of times this path was in use at                 
*                       the indicated percent utilization     @OA57325          
R742PUSG_SigCnt  DS BL4 Number of signals sent for this usage                   
*                       entry                                 @OA57325          
R742PUSG_Percent DS BL4 Percent utilization this entry represents               
*                                                             @OA57325          
         DS     CL4     Reserved                              @OA57325          
R742PNIB_TimeSum DS FL8 Total time this path had a no-inbound-buffer            
*                       impact condition (in microsenconds)   @OA57325          
R742PNIB_TimeSsq DS FL8 Squared microseconds for each no-inbound-               
*                       buffer impact condition               @OA57325          
R742PNIB_Time#   DS BL4 Number of times this path was impacted by               
*                       a no-inbound-buffer condition         @OA57325          
         SPACE 2                                                                
***********  Subtype 2, Member Data Section  ******************** @Y1A          
         SPACE 3                                                                
R742MBR  DSECT                                                    @Y1A          
R742MSYS DS    CL8      System name                               @Y1A          
R742MGRP DS    CL8      Group name                                @Y1A          
R742MMEM DS    CL16     Member name                               @Y1A          
R742MSTF DS    BL1      Status flags                              @Y1A          
R742MACT EQU   X'80'    1... .... Member became active during                   
*                                 this interval                   @Y1A          
R742MIAC EQU   X'40'    .1.. .... Member became inactive during                 
*                                 this interval                   @Y1A          
R742MRES EQU   X'20'    ..1. .... Counts reset by XCF during                    
*                                 this interval                   @Y1A          
R742MPAR EQU   X'10'    ...1 .... Partially not active during RMF               
*                                 post processor interval.        @Y1A          
R742MNOQ EQU   X'08'    .... 1... No information returned from                  
*                                 IXCQUERY                        @11A          
*                       .... .111 Unused                          @11C          
R742MST1 DS    X        Extended member state (1)                 @11A          
R742MCRE EQU   2        Member State = CREATED                    @11A          
R742MACV EQU   3        Member State = ACTIVE                 @OA22304          
R742MQUI EQU   4        Member State = QUIESCED                   @11A          
R742MFLD EQU   5        Member State = FAILED                     @11A          
R742MST2 DS    X        Extended member state (2)                 @11A          
R742MSSM EQU   128      System status update missing              @11A          
R742MTRM EQU    64      System termination started                @11A          
R742MMSM EQU    16      Status update missing (confirmed)         @11A          
R742MMSD EQU     8      Status update missing (not confirmed)     @11A          
R742MREM EQU     2      Monitoring has been removed               @11A          
         DS    CL1      Unused                                    @11C          
R742MSNT DS    BL4      Number of signals sent by member          @Y1A          
R742MRCV DS    BL4      Number of signals received by member      @Y1A          
R742MINT DS      F      Status checking interval                  @11A          
R742MJOB DS    CL8      Job name that joined the member           @11A          
         MEND  ,                                                                
*                                                                    */         
*%PLS742: ;                                                                     
*                                                                               
*%IF R742CBAS = ''                                                              
*%THEN %R742CBAS = 'BASED(ADDR(SMF74HDR)+SMF742CO)'; /*          @11A*/         
*                                                                               
*%IF R742SBAS = ''                                                              
*%THEN %R742SBAS = 'BASED(ADDR(SMF74HDR)+SMF742SO)'; /*          @11A*/         
*                                                                               
*%IF R742PBAS = ''                                                              
*%THEN %R742PBAS = 'BASED(ADDR(SMF74HDR)+SMF742PO)'; /*          @11A*/         
*                                                                               
*%IF R742MBAS = ''                                                              
*%THEN %R742MBAS = 'BASED(ADDR(SMF74HDR)+SMF742MO)'; /*          @11A*/         
*                                                                               
*    @SPACE;                                                                    
*/****  Subtype 2, control data section ************************ @Y1A*/         
*    @SPACE;                                                                    
*   DECLARE                                                                     
*     1 R742CNTL R742CBAS BDY(WORD), /*                          @11C*/         
*       3 R742TSR  FIXED(16),       /* Total number of small records            
*                                                                @Y1A*/         
*       3 *        CHAR(2),         /* Reserved for future use   @Y1A*/         
*       3 R742STOT FIXED(32),       /* Total number of system                   
*                                      data sections in large                   
*                                      SMF record.               @Y1A*/         
*       3 R742SNXT FIXED(32),       /* Number of system                         
*                                      data sections in                         
*                                      following small records   @Y1A*/         
*       3 R742PTOT FIXED(32),       /* Total number of path                     
*                                      data sections in large                   
*                                      SMF record.               @Y1A*/         
*       3 R742PNXT FIXED(32),       /* Number of path                           
*                                      data sections in                         
*                                      following small records   @Y1A*/         
*       3 R742MTOT FIXED(32),       /* Total number of member                   
*                                      data sections in large                   
*                                      SMF record.               @Y1A*/         
*       3 R742MNXT FIXED(32);       /* Number of member data sections           
*                                      in following records      @Y1A*/         
*    @SPACE;                                                                    
*/*********  Subtype 2, System Data Section  ******************* @Y1A*/         
*    @SPACE;                                                                    
*   DECLARE                                                                     
*     1 R742SYS R742SBAS,           /*                           @11C*/         
*       3 R742SNME CHAR(8),         /* System name               @Y1A*/         
*       3 R742SSTF BIT(8),          /* Status flags              @Y1A*/         
*         5 R742SACT BIT(1),        /* System became active during              
*                                      this interval             @Y1A*/         
*         5 R742SIAC BIT(1),        /* System became inactive during            
*                                      this interval             @Y1A*/         
*         5 R742SRES BIT(1),        /* Counts reset by XCF during               
*                                      this interval             @Y1A*/         
*         5 R742SPAR BIT(1),        /* Partially not active during RMF          
*                                      post processor interval.  @Y1A*/         
*         5 *        BIT(4),        /* Unused                    @Y1A*/         
*       3 R742SDIR  BIT(8),         /* Direction                 @Y1A*/         
*         5 R742SIN  BIT(1),        /* Inbound                   @Y1A*/         
*         5 R742SOUT BIT(1),        /* Outbound                  @Y1A*/         
*         5 R742SLCL BIT(1),        /* Local                     @Y1A*/         
*         5 *        BIT(5),        /* Reserved                  @Y1A*/         
*       3 *        CHAR(2),         /* Unused                    @Y1A*/         
*       3 R742SPTH FIXED(32),       /* Current number of paths in               
*                                      service.                                 
*                                      Zero for local entry. If                 
*                                      outbound entry, count is for             
*                                      indicated transport class @Y1A*/         
*       3 R742SBSY FIXED(32),       /* Number of no buffer conditions.          
*                                      For local or outbound entry,             
*                                      count is for indicated                   
*                                      transport class.          @Y1A*/         
*       3 R742SNOP FIXED(32),       /* Number of no path conditions             
*                                      Zero for local entry. For                
*                                      outbound entry, count is for             
*                                      indicated transport class @Y1A*/         
*       3 R742SMXB FIXED(32),       /* Maximum 1K blocks of message             
*                                      buffer space. For local or               
*                                      outbound entry, count is for             
*                                      indicated transport class @Y1A*/         
*       3 R742SBIG FIXED(32),       /* Number of message too big                
*                                      conditions. Zero for inbound             
*                                      entry.                    @Y1A*/         
*       3 R742SFIT FIXED(32),       /* Number of messages that fits             
*                                      in buffer. Zero for inbound              
*                                      entry.                    @Y1A*/         
*       3 R742SSML FIXED(32),       /* Number of messages too small             
*                                      conditions. Zero for inbound             
*                                      entry.                    @Y1A*/         
*       3 R742SOVR FIXED(32),       /* Number of messages for which             
*                                      signalling service was                   
*                                      optimized. Zero for inbound              
*                                      entry.                    @Y1A*/         
*       3 R742STCL FIXED(32),       /* Message length for transport             
*                                      class. Zero for inbound                  
*                                      entry.                    @Y1A*/         
*       3 R742STCN CHAR(8);         /* Transport class name. Blanks             
*                                      for inbound entry.        @Y1A*/         
*    @SPACE;                                                                    
*/*********  Subtype 2, Path Data Section  ********************* @Y1A*/         
*    @SPACE;                                                                    
*   DECLARE                                                                     
*     1 R742PTH R742PBAS,           /*                           @11C*/         
*       3 R742PNME CHAR(8),         /* System name               @Y1A*/         
*       3 R742PDEV CHAR(4),         /* Device number             @Y1A*/         
*       3 R742PSTF BIT(8),          /* Status flags              @Y1A*/         
*         5 R742PACT BIT(1),        /* Path became active during                
*                                      this interval             @Y1A*/         
*         5 R742PIAC BIT(1),        /* Path became inactive during              
*                                      this interval             @Y1A*/         
*         5 R742PRES BIT(1),        /* Counts reset by XCF during               
*                                      this interval             @Y1A*/         
*         5 R742PPAR BIT(1),        /* Reserved. Used by RMF post               
*                                      processor             @OA62081*/         
*         5 *        BIT(4),        /* Unused                    @Y1A*/         
*       3 R742PDIR BIT(8),          /* Direction path            @Y1A*/         
*         5 R742PIN  BIT(1),        /* Inbound path              @Y1A*/         
*         5 R742POUT BIT(1),        /* Outbound path             @Y1A*/         
*         5 *        BIT(6),        /* Reserved                  @Y1A*/         
*       3 R742PTYP FIXED(8),        /* Path type indicator: '01'x for           
*                                      CTC, '03'x for list structure            
*                                                                @C1A*/         
*       3 *        CHAR(1),         /* Unused                    @Y1A*/         
*       3 R742PONA CHAR(8),         /* Name of system on other end if           
*                                      known, otherwise blanks.  @Y1A*/         
*       3 R742PODV CHAR(4),         /* Device number on other end if            
*                                      known, otherwise blanks.  @Y1A*/         
*       3 R742PSTA BIT(8),          /* Path status               @Y1A*/         
*         5 R742PST  BIT(1),        /* Starting                  @Y1A*/         
*         5 R742PRS  BIT(1),        /* Restarting                @Y1A*/         
*         5 R742PWK  BIT(1),        /* Working                   @Y1A*/         
*         5 R742PSP  BIT(1),        /* Stopping                  @Y1A*/         
*         5 R742PLK  BIT(1),        /* Waiting for completion of                
*                                      communication link.       @Y1A*/         
*         5 R742PNP  BIT(1),        /* Not operational. Path defined to         
*                                      XCF but not usable until                 
*                                      hardware and/or definition               
*                                      problems are resolved @OA62081*/         
*         5 R742PSF  BIT(1),        /* Stop failed           @WA22735*/         
*         5 R742PRB  BIT(1),        /* Rebuilding            @WA22735*/         
*       3 R742PSTM BIT(8),          /* More path status flags    @11A*/         
*         5 R742PQG  BIT(1),        /* Quiescing                 @11A*/         
*         5 R742PQD  BIT(1),        /* Quiesced                  @11A*/         
*         5 *        BIT(6),        /* Unused                    @11A*/         
*       3 *        CHAR(2),         /* Unused                    @11C*/         
*       3 R742PRET FIXED(32),       /* Path retry limit          @Y1A*/         
*       3 R742PRST FIXED(32),       /* Number of restarts        @Y1A*/         
*       3 R742PMXM FIXED(32),       /* Maximum number of 1K blocks              
*                                      message buffer space.     @Y1A*/         
*       3 R742PSIG FIXED(32),       /* Number of outbound (inbound)             
*                                      signals sent (received) over             
*                                      path.                     @Y1A*/         
*       3 R742PQLN FIXED(32),       /* Number of outbound signals               
*                                      pending transfer on path  @Y1A*/         
*       3 R742PIBR FIXED(32),       /* Number of inbound signals                
*                                      refused due to maximum                   
*                                      message limit.            @Y1A*/         
*       3 R742PSUS FIXED(32),       /* Number of outbound signals               
*                                      satisfied by suspended path.             
*                                                                @Y1A*/         
*       3 R742PAPP FIXED(32),       /* Number of outbound signal                
*                                      requests satisfied by this               
*                                      path while active.        @Y1A*/         
*       3 R742PTCN CHAR(8),         /* Transport class name. For an             
*                                      outbound path, the class to              
*                                      which the path is assigned.              
*                                      For an inbound path, the class           
*                                      to which the outbound side of            
*                                      the path is assigned, blanks if          
*                                      not known.            @OA62081*/         
*       3 R742PSTR CHAR(16),        /* Name of XES list structure               
*                                      being used as a path,                    
*                                      blank for CTC's       @WA41317*/         
*       3 R742PIOT FIXED(32),       /* For inbound paths:                       
*                                      Average I/O transfer time for            
*                                      the most recently received               
*                                      signals.                                 
*                                      Units: Micro Seconds.                    
*                                      Zero if not available.                   
*                                      X'FFFFFFFF' if overflow (more            
*                                      than 35 minutes)      @WA41317*/         
*       3 R742PRCT FIXED(32),       /* Path retry count          @11A*/         
*       3 R742PPND FIXED(32),       /* The current number of signals            
*                                      pending transfer on the path             
*                                      (outbound only)           @11A*/         
*       3 R742PUSE FIXED(32),       /* The current number of 1K byte            
*                                      blocks of message buffer space           
*                                      in use by this path       @11A*/         
*       3 R742PLIN FIXED(32),       /* List number within structure             
*                                                            @OA57325*/         
*       3 *        CHAR(4),         /* Reserved              @OA57325*/         
*       3 R742PUSG_Stats(4),        /* Path usage statistics array              
*                                                            @OA57325*/         
*         5 R742PUSG_TimeSum FIXED(64), /* Total time this path was in          
*                                      use at the indicated percent             
*                                      utilization (in ms)   @OA57325*/         
*         5 R742PUSG_TimeSsq FIXED(64), /* Squared microseconds this            
*                                      path was in use at the indicated         
*                                      percent utilization   @OA57325*/         
*         5 R742PUSG_Time# FIXED(32), /* Number of times this path was          
*                                      in use at the indicated percent          
*                                      utilization           @OA57325*/         
*         5 R742PUSG_SigCnt FIXED(32), /* Number of signals sent for            
*                                      this usage entry      @OA57325*/         
*         5 R742PUSG_Percent FIXED(32), /* Percent utilization this             
*                                      entry represents      @OA57325*/         
*         5 *        CHAR(4),       /* Reserved              @OA57325*/         
*       3 R742PNIB_TimeSum FIXED(64), /* Total time this path had a             
*                                      no-inbound-buffer impact                 
*                                      condition (in ms)     @OA57325*/         
*       3 R742PNIB_TimeSsq FIXED(64), /* Squared microseconds for each          
*                                      no-inbound-buffer impact                 
*                                      condition             @OA57325*/         
*       3 R742PNIB_Time# FIXED(32); /* Number of times this path was            
*                                      impacted by a no-inbound-buffer          
*                                      condition             @OA57325*/         
*    @SPACE;                                                                    
*/*********  Subtype 2, Member Data Section  ******************* @Y1A*/         
*    @SPACE;                                                                    
*   DECLARE                                                                     
*     1 R742MBR R742MBAS,           /*                           @11C*/         
*       3 R742MSYS CHAR(8),         /* System name               @Y1A*/         
*       3 R742MGRP CHAR(8),         /* Group name                @Y1A*/         
*       3 R742MMEM CHAR(16),        /* Member name               @Y1A*/         
*       3 R742MSTF BIT(8),          /* Status flags              @Y1A*/         
*         5 R742MACT BIT(1),        /* Member became active during              
*                                      this interval             @Y1A*/         
*         5 R742MIAC BIT(1),        /* Member became inactive during            
*                                      this interval             @Y1A*/         
*         5 R742MRES BIT(1),        /* Counts reset by XCF during               
*                                      this interval             @Y1A*/         
*         5 R742MPAR BIT(1),        /* Partially not active during RMF          
*                                      post processor interval   @Y1A*/         
*         5 R742MNOQ BIT(1),        /* No information returned from             
*                                      IXCQUERY                  @11A*/         
*         5 *        BIT(3),        /* Unused                    @11C*/         
*       3 R742MST1 BIT(8),          /* Extended member state (1)                
*                                      2=CREATED, 3=ACTIVE,                     
*                                      4=QUIESCED, 5=FAILED      @11A*/         
*       3 R742MST2 BIT(8),          /* Extended member state (2) @11A*/         
*         5 R742MSSM BIT(1),        /* System status update missing             
*                                                                @11A*/         
*         5 R742MTRM BIT(1),        /* System termination started               
*                                                                @11A*/         
*         5 *        BIT(1),        /* Reserved                  @11A*/         
*         5 R742MMSM BIT(1),        /* Status update missing                    
*                                      (confirmed)               @11A*/         
*         5 R742MMSD BIT(1),        /* Status update missing                    
*                                      (not confirmed)           @11A*/         
*         5 *        BIT(1),        /* Reserved                  @11A*/         
*         5 R742MREM BIT(1),        /* Monitoring has been removed              
*                                                                @11A*/         
*       3 *        CHAR(1),         /* Unused                    @11C*/         
*       3 R742MSNT FIXED(32),       /* Number of signals sent by                
*                                      member.                   @Y1A*/         
*       3 R742MRCV FIXED(32),       /* Number of signals received by            
*                                      member.                   @Y1A*/         
*       3 R742MINT FIXED(32),       /* Status checking interval  @11A*/         
*       3 R742MJOB CHAR(8);         /* Job name that joined the member          
*                                                                @11A*/         
