*/*      Bilingual Mapping Macro for SMF 74.10 Data Sections                    
         MACRO                                                                  
         ERBR7410                                                               
*                                                                    */         
*/*** START OF SPECIFICATIONS ****************************************          
*                                                                    *          
*01* Proprietary Statement:                                          *          
*       Licensed Materials - Property of IBM                         *          
*       "Restricted Materials of IBM"                                *          
*       Copyright IBM Corp. 2015, 2021                               *          
*                                                                    *          
*       Status: z/OS V2R5 Data Gatherer (HRG77D0)                    *          
*                                                                    *          
*01* Macro Name: ERBR7410                                            *          
*                                                                    *          
*01* Descriptive Name:  SMF Record 74 Subtype 10 Data Sections       *          
*                       (Monitor III Storage Class Memory Data)      *          
*                                                                    *          
*01* DSECT Name: R7410CM SCM configuration measurements              *          
*                R7410DI SCM EADM device (subchannel) information    *          
*                                                                    *          
*01* Component: zOS Data Gatherer (27401)                            *          
*                                                                    *          
*01* Function:  This macro maps the data sections of                 *          
*               SMF record 74 subtype 10                             *          
*                                                                    *          
*01* Notes: None                                                     *          
*                                                                    *          
*01* Size:  Data sections                                            *          
*           -> SCM config measurements:      56 bytes (each)     @81C*          
*           -> SCM EADM device information:  72 bytes            @91C*          
*                                                                    *          
*01* Method of Access: See below:                                    *          
*                                                                    *          
*    BAL : ERBR7410                                                  *          
*    PL/X: %INCLUDE SYSLIB(ERBR7410) semicolon                       *          
*                                                                    *          
*                                                                    *          
*01* Module-type: BILINGUAL MAPPING MACRO                            *          
*                                                                    *          
*01* Dependencies: None                                              *          
*                                                                    *          
*01* Distribution Library: AGRBMAC1                             @A02C*          
*                                                                    *          
*01* Change-Activity = see below                                     *          
*                                                                    *          
*     $70=SCMEM,HRM77A0,,HBE: Storage class memory support           *          
*     GUB: Adds R7410CRPI in assembler DSECT                 @OA47602*          
*     $81=ZSCM,OA50761,,JKu: Virtual Flash Memory support        @81A*          
*     $91=Cmpr,OA56684,,JBa: EADM Compression support            @91A*          
*    $A02=ZOSB,HRG77D0,,JBa: Rename zOS Data Gatherer libraries @A02A*          
*                                                                    *          
****** END OF SPECIFICATIONS *****************************************/         
*        %GOTO PLS7410;                                                         
*/*                                                                             
         SPACE 2                                                                
***********  Subtype 10, SCM configuration measurements **************          
         SPACE 3                                                                
R7410CM  DSECT                                                                  
R7410CRPI DS   0F       SCM resource+part identifier         @OA47602           
R7410CRID DS   H        SCM resource identifier                                 
R7410CPID DS   H        Part identifier                                         
R7410CDUS DS   F        Data unit size in bytes                                 
R7410CRQC DS   F        Internal requests processed at CPC level                
R7410CRQ  DS   F        Internal requests processed at LPAR level               
R7410CDWC DS   F        Data units written at CPC level                         
R7410CDW  DS   F        Data units written at LPAR level                        
R7410CDRC DS   F        Data units read at CPC level                            
R7410CDR  DS   F        Data units read at LPAR level                           
R7410CRTC DS   F        Aggregate time spent on execution of requests           
*                       involving resource part in units of 128                 
*                       microseconds at CPC level                               
R7410CRT  DS   F        Aggregate time spent on execution of requests           
*                       involving resource part in units of 128                 
*                       microseconds at LPAR level                              
R7410CIQC DS   F        Accumulated IOP queue time in units of                  
*                       128 microseconds at CPC level                           
R7410CWUC DS   F        Utilization at CPC level. This value designates         
*                       the sum of the average CPC utilization per              
*                       second in percent multiplied by the number of           
*                       seconds of this interval                   @81C         
R7410CWU  DS   F        Utilization at LPAR level. This value                   
*                       designates the sum of the average LPAR                  
*                       utilization per second in percent multiplied            
*                       by the number of seconds of this interval  @81C         
R7410FLG  DS   BL1      Flag byte                                  @81A         
R7410VFM  EQU  X'80'    1... .... SCM resource type is VFM         @81A         
*                       .111 1111 1111 1111 Unused                 @81A         
          DS   CL3      Reserved                                   @81A         
         SPACE 2                                                                
***********  Subtype 10, SCM EADM device information *****************          
         SPACE 3                                                                
R7410DI  DSECT                                                                  
R7410DSCT DS   F        SSCH count across all devices                           
R7410DNUM DS   F        Number of updates to the time accumulation              
*                       fields                                                  
R7410DFPT DS   FD       Sum of function pending times across all                
*                       devices in units of 128 microseconds. The               
*                       time lapse between the SSCH being issued                
*                       and the acceptance of the first command of              
*                       the channel program at the device.                      
R7410DIQT DS   FD       Sum of IOP queue times across all devices               
*                       in units of 128 microseconds. The amount of             
*                       time the request is not accepted at the SCM             
*                       resource because it would exceed its maximum            
*                       capacity.                                               
R7410DCRT DS   FD       Sum of initial command response times across            
*                       all devices in units of 128 microseconds.               
*                       The time from when the first command does               
*                       not immediately proceed to execute until the            
*                       successful start of execution at the SCM                
*                       resource part.                                          
R7410DFLG DS   BL1      Device information flags                   @91A         
R7410ECPR EQU  X'80'    1... .... EADM-compression-measurements                 
*                                 facility available               @91A         
*                       .111 1111 Reserved                         @91A         
          DS   CL7      Reserved                                   @91A         
R7410DOCC DS   F        Number of compression operations           @91A         
R7410DOCD DS   F        Number of decompression operations         @91A         
R7410DISC DS   FD       Number of 1M input blocks consumed                      
*                       for compression                            @91A         
R7410DOSC DS   FD       Number of 1M output blocks consumed                     
*                       for compression                            @91A         
R7410DISD DS   FD       Number of 1M input blocks consumed                      
*                       for decompression                          @91A         
R7410DOSD DS   FD       Number of 1M output blocks consumed                     
*                       for decompression                          @91A         
         SPACE 2                                                                
         MEND  ,                                                                
*                                                                    */         
*%PLS7410: ;                                                                    
*/*********  Subtype 10, SCM configuration measurements **************/         
*    @SPACE;                                                                    
*   Declare                                                                     
*     R7410CM IsA(R7410CM_Type) Based Bdy(DWord);                               
*    @SPACE;                                                                    
*   Declare                                                                     
*     1  R7410CM_Type Type,                                                     
*      3  R7410CRPI    Fixed(32), /* SCM resource+part identifier    */         
*       5  R7410CRID   Fixed(16), /* SCM resource identifier         */         
*       5  R7410CPID   Fixed(16), /* Part identifier                 */         
*      3  R7410CDUS    Fixed(32), /* Data unit size in bytes         */         
*      3  R7410CRQC    Fixed(32), /* Internal requests processed at             
*                                    CPC level                       */         
*      3  R7410CRQ     Fixed(32), /* Internal requests processed at             
*                                    LPAR level                      */         
*      3  R7410CDWC    Fixed(32), /* Data units written at                      
*                                    CPC level                       */         
*      3  R7410CDW     Fixed(32), /* Data units written at                      
*                                    LPAR level                      */         
*      3  R7410CDRC    Fixed(32), /* Data units read at CPC level    */         
*      3  R7410CDR     Fixed(32), /* Data units read at LPAR level   */         
*      3  R7410CRTC    Fixed(32), /* Aggregate time spent on execution          
*                                    of requests involving resource             
*                                    part in units of 128 microseconds          
*                                    at CPC level                    */         
*      3  R7410CRT     Fixed(32), /* Aggregate time spent on execution          
*                                    of requests involving resource             
*                                    part in units of 128 microseconds          
*                                    at LPAR level                   */         
*      3  R7410CIQC    Fixed(32), /* Accumulated IOP queue time in              
*                                    units of 128 microseconds at               
*                                    CPC level                       */         
*      3  R7410CWUC    Fixed(32), /* Utilization at CPC level. This             
*                                    value designates the sum of the            
*                                    average CPC utilization per second         
*                                    in percent multiplied by the               
*                                    number of seconds of this interval         
*                                                                @81C*/         
*      3  R7410CWU     Fixed(32), /* Utilization at LPAR level. This            
*                                    value designates the sum of the            
*                                    average LPAR utilization per               
*                                    second in percent multiplied by            
*                                    the number of seconds of this              
*                                    interval                    @81C*/         
*      3  R7410FLG     Bit(8),    /* Flag byte                   @81A*/         
*         5 R7410VFM   Bit(1),    /* SCM resource type is VFM    @81A*/         
*         5 *          Bit(7),    /* Unused                      @81A*/         
*      3  *        CHAR(3);       /* Reserved                    @81A*/         
*    @SPACE;                                                                    
*/*********  Subtype 10, SCM EADM device information *****************/         
*    @SPACE;                                                                    
*   Declare                                                                     
*     R7410DI IsA(R7410DI_Type) Based Bdy(DWord);                               
*    @SPACE;                                                                    
*   Declare                                                                     
*     1  R7410DI_Type Type,                                                     
*      3  R7410DSCT    Fixed(32), /* SSCH count across all devices   */         
*      3  R7410DNUM    Fixed(32), /* Number of updates to the time              
*                                    accumulation fields             */         
*      3  R7410DFPT    Char(8),   /* Sum of function pending times              
*                                    across all devices in units of             
*                                    128 microseconds (doubleword               
*                                    format). The time lapse between            
*                                    the SSCH being issued and the              
*                                    acceptance of the first command            
*                                    of the channel program at the              
*                                    device.                         */         
*      3  R7410DIQT    Char(8),   /* Sum of IOP queue times across              
*                                    all devices in units of 128                
*                                    microseconds (doubleword format).          
*                                    The amount of time the request is          
*                                    not accepted at the SCM resource           
*                                    because it would exceed its                
*                                    maximum capacity.               */         
*      3  R7410DCRT    Char(8),   /* Sum of initial command response            
*                                    times across all devices in                
*                                    units of 128 microseconds                  
*                                    (doubleword format). The time              
*                                    from when the first command does           
*                                    not immediately proceed to execute         
*                                    until the successful start of              
*                                    execution at the SCM resource              
*                                    part.                       @91C*/         
*      3  R7410DFLG    Bit(8),    /* Device information flags    @91A*/         
*        5  R7410ECPR  Bit(1),    /* EADM-compression-measurements              
*                                    facility available          @91A*/         
*        5  *          Bit(7),    /* Reserved                    @91A*/         
*      3  *            Char(7),   /* Reserved                    @91A*/         
*      3  R7410DOCC    Fixed(32), /* Number of compression                      
*                                    operations                  @91A*/         
*      3  R7410DOCD    Fixed(32), /* Number of decompression                    
*                                    operations                  @91A*/         
*      3  R7410DISC    Fixed(64), /* Number of 1M input blocks                  
*                                    consumed for compression    @91A*/         
*      3  R7410DOSC    Fixed(64), /* Number of 1M output blocks                 
*                                    consumed for compression    @91A*/         
*      3  R7410DISD    Fixed(64), /* Number of 1M input blocks                  
*                                    consumed for decompression  @91A*/         
*      3  R7410DOSD    Fixed(64); /* Number of 1M output blocks                 
*                                    consumed for decompression  @91A*/         
