*%GOTO SSHLA1;                      /* BILINGUAL MAPPING MACRO                  
         MACRO                                                                  
         ERBSSHG3                                                               
.*                                                                              
.*   This macro maps fields of the set of samples header control block          
.*   used by external                                                           
.*   interfaces of the RMF monitor III data gatherer                            
.*                              */                                              
*%SSHLA1: ;                                                                     
*/****  START OF SPECIFICATIONS  *************************************/         
*/**                                                                 */         
*/**                                                                 */         
*/**01* MACRO NAME:  ERBSSHG3                                        */         
*/**                                                                 */         
*/**01* DESCRIPTIVE NAME: MAPPING MACRO FOR MONITOR III DATA GATHERER*/         
*/**                      SET OF SAMPLES HEADER CONTROL BLOCK        */         
*/**                                                                 */         
*/**01* PROPRIETARY STATEMENT:                                       */         
*/**       Licensed Materials - Property of IBM                  @61A*/         
*/**       "Restricted Materials of IBM"                         @61A*/         
*/**       Copyright IBM Corp. 1983, 2021                            */         
*/**       Status: z/OS V2R5 Data Gatherer (HRG77D0)                 */         
*/**                                                                 */         
*/**02* ACRONYM:  SSHG3                                              */         
*/**                                                                 */         
*/**02* DSECT NAME:  SSHG3                                           */         
*/**                                                                 */         
*/**01* COMPONENT NAME: zOS Data Gatherer (27401)                    */         
*/**                                                                 */         
*/**01* EYE-CATCHER: SSHG3                                           */         
*/**02*     OFFSET:  0                                               */         
*/**02*     LENGTH:  5                                               */         
*/**                                                                 */         
*/**01* STORAGE ATTRIBUTES:                                          */         
*/**02*   SUBPOOL:   2                                               */         
*/**02*   KEY:       8                                               */         
*/**02*   RESIDENCY: Above                                           */         
*/**02*   MAIN STORAGE:       N/A                                    */         
*/**02*   AUXILIARY STORAGE:  N/A                                    */         
*/**02*   VIRTUAL STORAGE:    N/A                                    */         
*/**                                                                 */         
*/**01* SIZE:  See assembler listing                                 */         
*/**                                                                 */         
*/**01* CREATED BY:   GRB3GINI                                       */         
*/**                                                                 */         
*/**01* POINTED TO BY: SSHG3PTR                                      */         
*/**                                                                 */         
*/**01* SERIALIZATION: NONE                                          */         
*/**                                                                 */         
*/**01* FUNCTION: THIS MACRO MAPS THE RMF MON III DATA GATHERER      */         
*/**              SET OF SAMPLES HEADER CONTROL BLOCK                */         
*/**                                                                 */         
*/**01* NOTES:                                                       */         
*/**                                                                 */         
*/**   1. The constant SSHG3CB and the comment of the field SSHRMFV  */         
*/**      have to be updated whenever this control block becomes     */         
*/**      incompatible to the previous version.                  @B4C*/         
*/**                                                                 */         
*/**   2. This data aggregate is stored in permanent storage.        */         
*/**      Any changes made must be reflected in the reporter         */         
*/**      conversion process. Especially the control block           */         
*/**      ERBVFMG3 needs to be updated.                          @B4A*/         
*/**                                                                 */         
*/**01* METHOD OF ACCESS:                                            */         
*/**      PL/X:                                                      */         
*/**         SSHG3 IS DECLARED AS A BASED STRUCTURE, SSHG3PTR SHOULD */         
*/**         BE DECLARED                                             */         
*/**                                                                 */         
*/**         %INCLUDE SYSLIB(ERBSSHG3) SEMICOLON                     */         
*/**                                                                 */         
*/**01* DELETED BY:  GRB3GTER                                        */         
*/**                                                                 */         
*/**01* DISTRIBUTION LIBRARY:  AGRBMAC1                         @A02C*/         
*/**                                                                 */         
*/**01* CHANGE ACTIVITY:   SEE BELOW                                 */         
*/** $M0=MONIIIG,HRM3202,,PFU: MAPPING MACRO FOR SAMPLE HEADER       */         
*/** $P1=3090,HRM3302,,MLN: 3090 support                         @P1A*/         
*/** $P2=ES,HRM3302,,MLN: extended storage support               @P2A*/         
*/** $P3=MISC,HRM3302,,PFU: Performance measurement              @P3A*/         
*/** $Q1=PERI,HRM3402,,PFU: Performance improvements             @Q1A*/         
*/** $Q2=NEWREP,HRM3402,,PFU: New and changed reports.           @Q2A*/         
*/** $Q3=DSSUP,HRM3402,,PFU: Data set support                    @Q3A*/         
*/** $W1=OPER,JRM4411,,FDL: Operations Support                   @W1A*/         
*/** $Z1=OY29112,HRM4420,,WRC: Serial & Switch Support           @Z1A*/         
*/** $B1=RTIME,HRM4430,,BHL: Response time support               @B1A*/         
*/** $B2=COMP,HRM4430,,PFU: Compress/Decompress M III data       @B2A*/         
*/** $B3=CSA,HRM4430,,AJU: Usage of CSA/SQA Storage              @B3A*/         
*/** $B4=CONV,HRM4430,,PFU: Conversion                           @B4A*/         
*/** $C1=RSDS,HRM4440,,DK: RMF Sysplex Data Server               @C1A*/         
*/** $C2=GWLM3,HRM4440,,HOL: Workload Manager - Monitor III      @C2A*/         
*/** $C3=ADAPT,HRM5510,,AJU: Report Adaptation                   @C3A*/         
*/** PFU: Lpar enhancements                                  @WA05435*/         
*/** $D1=ENC,HRM5520,,DK: Dispatcher Enclaves                    @D1A*/         
*/** $E1=IPM,OW17898,,PFU: IPM Adaptations                       @E1A*/         
*/** GUB: Remove superfluous comma                           @WA22065*/         
*/** $F1=DSN,HRM6604,,SHR: Data Set Name support                 @F1A*/         
*/** $G1=CF,HRM6606,,AJU: Mon III Coupling Facility Online       @G1A*/         
*/** $H1=CACHE,HRM6607,,GBO: Cache Online Support                @H1A*/         
*/** $I1=VSR,HRM7703,,WLR: Mon III VSAM RLS Support              @I1A*/         
*/** $I2=USS,HRM7703,,HOL: UNIX System Services Support          @I2A*/         
*/** $L1=zFS,HRM7720,,SHR: zFS support                           @L1A*/         
*/** $L2=SPG,HRM7720,,VTH: Disk Space monitoring                 @L2A*/         
*/** $01=CGAT,HRM7730,,SHR: New Monitor III channel gatherer     @01A*/         
*/** $11=IQD3,HRM7740,,SHR: New Monitor III I/O queuing gatherer @11A*/         
*/** $12=XCFO,HRM7740,,HBE: XCF Activity Data Online             @12A*/         
*/** $21=LOK3,HRM7750,,HBE: Lock reporting                       @21A*/         
*/** $61=R790,HRM7790,,MWe: explicit copyright for ext. macro    @61A*/         
*/** $71=PFMB,OA44524,,JKu: Monitor III PCIE data gathering      @71A*/         
*/** $72=SCMEM,HRM77A0,,HBE: Storage class memory support        @72A*/         
*/** $73=ZFSX,HRM77A0,,KGE: zFS Sysplex Monitoring Enhancements  @73A*/         
*/** $91=CRYM3,HRM77C0,,KGE: MIII Crypto hardware support        @91A*/         
*/** $A01=Split,OA58759,,JBa: RMF Product Split                 @A01A*/         
*/** $A02=ZOSB,HRG77D0,,JBa: Rename zOS Data Gatherer libraries @A02A*/         
*/** $A03=ZOSB,HRG77D0,,JBa: Rename prefix ERB to GRB           @A03A*/         
*/** $A04=ZOSB,HRG77D0,,JBa: Make macro bilingual               @A04A*/         
*/**                                                                 */         
*/****  END OF SPECIFICATIONS  ***************************************/         
*%GOTO SSHLA2;     /*                                                           
SSHG3    DSECT               Sample header                                      
         DS    0D            ALIGN ON DWORD BOUNDARY             @Q3C           
SSHSSHG3 DS    XL5           Acronym SSHG3                                      
SSHRMFV  DS    XL1           SSHG3 CB version                    @G1C           
SSHLEN   DS    H             Length of SSHG3                     @Q1C           
SSHRMFVN DS    XL3           RMF Version number                                 
SSHFLAG1 DS    XL1           Flag byte                           @B2C           
SSHGCOMP EQU   X'80'         ON = data are compressed            @B2A           
SSHPREVP DS    A             POINTER TO PREVIOUS SSH                            
SSHNEXTP DS    A             POINTER TO NEXT SSH                                
         DS    4F            RESERVED                                           
SSHSHDFP DS    A             POINTER FIRST SAMPLE HEADER                        
SSHSHDLP DS    A             POINTER TO LAST SAMPLE HEADER                      
         MEND                                                                   
                             */                                                 
*%SSHLA2:;                                                                      
    DCL                                                                         
     1 SSHG3 BASED(SSHG3PTR) BDY(DWORD),/* SET OF SAMPLES HEADER @Q1C*/         
       2 SSHBASE,                   /* BASIC DATA OF SSH             */         
        3 SSHSSHG3 CHAR(5),         /* ACRONYM SSHG3                 */         
        3 SSHRMFV CHAR(1),          /* SSHG3 control block                      
                                       version number            @G1C*/         
        3 SSHLEN   FIXED(15),       /* Length of SSHG3           @Q1C*/         
        3 SSHRMFVN CHAR(3),         /* RMF version number            */         
        3 SSHFLAG1 BIT(8),          /* Flag byte                 @B2C*/         
          7 SSHGCOMP BIT(1),        /* ON = Data are compressed  @B2A*/         
          7 SSHWLMMD BIT(1),        /* ON = Goal mode data       @C2A*/         
          7 *        BIT(6),        /* Reserved                  @C2C*/         
        3 SSHPREVP PTR(31),         /* POINTER TO PREVIOUS SSH. Not             
                                    valid within the wrap around buffer         
                                    and the dataset.             @Q1C*/         
          5 SSHPREVO FIXED(31),     /* Offset  TO PREVIOUS SSH. Not             
                                    valid within the wrap around buffer         
                                    and the dataset.             @C1A*/         
        3 SSHNEXTP PTR(31),         /* Pointer to next SSH. Not                 
                                    valid within the wrap around buffer         
                                    and the dataset.             @Q1C*/         
          5 SSHNEXTO FIXED(31),     /* Offset  to next SSH. Not                 
                                    valid within the wrap around buffer         
                                    and the dataset.             @C1A*/         
        3 SSHFRSTA PTR(31),         /* PTR TO FIRST BYTE AVAILABLE   */         
        3 SSHLSTA PTR(31),          /* PTR LAST BYTE AVAILABLE                  
                                       GETMAIN ADDR+LEN-1            */         
        3 SSHCURR PTR(31),          /* PTR CURR BYTE AVAILABLE                  
                                       MAINTAINED BY GRB3GGET ROUTINE           
                                       VIA the macro GRB3MGET        */         
        3 SSHLAST PTR(31),          /* PTR TO LAST BYTE USEABLE                 
                                       BEFORE CALLING GRB3GGET                  
                                       MAINTAINED BY GRB3GGET ROUTINE*/         
       2 SSHCLEAR,                  /*  FIELDS WHICH HAVE TO BE CLEAR*/         
        3 SSHSHDFO FIXED(31),       /* OFFSET TO FIRST SAMPLE HEADER.           
                                    This fields contains the offset             
                                    within the M3 data gatherer areas           
                                    and the dataset.                            
                                    The M3 reporter module GRB3RTBR             
                                    changes the offset into a pointer           
                                    after the samples have been                 
                                    moved to the reporters address              
                                    space.                       @Q1C*/         
          5 SSHSHDFP PTR(31),       /* POINTER FIRST SAMPLE HEADER   */         
        3 SSHSHDLO FIXED(31),       /* OFFSET TO LAST SAMPLE HEADER.            
                                    This fields contains the offset             
                                    within the M3 data gatherer areas           
                                    and the dataset.                            
                                    The M3 reporter module GRB3RTBR             
                                    changes the offset into a pointer           
                                    after the samples have been                 
                                    moved to the reporters address              
                                    space.                       @Q1C*/         
          5 SSHSHDLP PTR(31),       /* POINTER LAST SAMPLE HEADER    */         
        3 SSHTOTLE FIXED(31),       /* TOTAL LENGTH THIS SET OF                 
                                       SAMPLES INCLUDING SSHG3.      */         
        3 SSHFSSNR FIXED(31),       /* FIRST SAMPLE SEQUENCE NUMBER  */         
        3 SSHLSSNR FIXED(31),       /* LAST SAMPLE SEQUENCE NUMBER   */         
        3 SSHSMPNR FIXED(31),       /* NUMBER OF VALID SAMPLES   @Q1C*/         
                                    /*                          3@Q1D*/         
        3 SSHTIBEG CHAR(8),         /* BEGIN TIME THIS SSH           */         
        3 SSHTIEND CHAR(8),         /* END TIME THIS SSH             */         
        3 SSHJOBLP PTR(31),         /* POINTER TO JOBNAME INDEX                 
                                       LOOK UP TABLE                 */         
        3 SSHCPGLP PTR(31),         /* POINTER TO CONTROL PERFORMANCE           
                                       GROUP LOOK UP TABLE           */         
        3 SSHDMNLP PTR(31),         /* POINTER TO DOMAIN                        
                                             LOOK UP TABLE           */         
        3 SSHEQXLP PTR(31),         /* POINTER TO ENQ NAME INDEX                
                                       TABLE                         */         
       2 SSHEXTEN,                  /* EXTENDED DATA OF SSH          */         
        3 SSHASIO FIXED(31),        /* OFFSET TO ASID TABLE.                    
                                    This field contains the offset              
                                    when the data are within the                
                                    wrap around buffer.              */         
          5 SSHASIP PTR(31),        /* POINTER TO ASID TABLE         */         
                                    /*                           @Q1D*/         
        3 SSHASILP PTR(31),         /* POINTER TO ASID LOOK UP TABLE */         
        3 SSHASIMX FIXED(31),       /* HIGHEST possible index in                
                                      the ASID table             @Q1C*/         
        3 SSHASLMX FIXED(31),       /* HIGHEST possible index in                
                                      the ASID look up table         */         
                                    /* TOTAL LENGTH OF ASID TABLE@Q1D*/         
                                    /*                           @Q1D*/         
        3 SSHDVTO FIXED(31),        /* OFFSET TO DVT TABLE                      
                                    This field contains the offset              
                                    when the data are within the                
                                    wrap around buffer.              */         
          5 SSHDVTP PTR(31),        /* POINTER TO DVT TABLE          */         
        3 SSHDVTLP PTR(31),         /* POINTER TO DVT LOOK UP TABLE  */         
        3 SSHDVTMX FIXED(31),       /* HIGHEST INDEX OF   DVT TABLE  */         
                                    /*                           @Q1D*/         
                                    /* TOTAL LENGTH DVT TABLE    @Q1D*/         
                                    /* TOTAL LENGTH DVT LOOK     @Q1D*/         
        3 SSHENTO FIXED(31),        /* OFFSET TO ENT TABLE                      
                                    This field contains the offset              
                                    when the data are within the                
                                    wrap around buffer.              */         
          5 SSHENTP PTR(31),        /* POINTER TO ENT TABLE          */         
        3 SSHENTLP PTR(31),         /* POINTER TO ENT LOOK UP TABLE  */         
        3 SSHENLMX FIXED(31),       /* HIGHEST INDEX OF THE ENT                 
                                       LOOKUP TABLE                  */         
        3 SSHENTMX FIXED(31),       /* HIGHEST INDEX OF THE ENT TABLE*/         
                                    /*                           @Q1D*/         
                                    /* TOTAL LENGTH OF ENT TABLE @Q1D*/         
                                    /*                          3@Q1D*/         
        3 SSHPMTO  FIXED(31),       /* Offset to PMTG3           @P3C*/         
        3 SSHTOFAG FIXED(31),       /* Total number of failures                 
                                    within this set of samples time             
                                    range.                           */         
        3 SSHDPGLP PTR(31),         /* POINTER TO DOMAIN-PERFORMANCE            
                                       GROUP LOOK UP TABLE           */         
        3 SSHGEIO  FIXED(31),       /* Offset to GEIG3 control                  
                                       block.                                   
                                    This field contains the offset              
                                    when the data are within the                
                                    wrap around buffer.          @Q2A*/         
          5 SSHGEIP PTR(31),        /* Pointer to GEIG3 control                 
                                    block.                       @Q2A*/         
        3 SSHIOML BIT(8),           /* hardware type             @P1A*/         
        3 SSHEFLAG BIT(8),          /* extended storage          @P2A*/         
          5 SSHESS BIT(1),          /* 'ON' = ESS installed      @P2A*/         
          5 *      BIT(7),          /* Reserved                  @P2A*/         
        3 SSHPRFGS BIT(8),          /* Processor flags           @Z1A*/         
          5 SSHSERE BIT(1),         /* 'ON' = Serial enabled mac @Z1A*/         
          5 SSHSWCH BIT(1),         /* 'ON' = Switch in config   @Z1A*/         
          5 *      BIT(6),          /* Reserved                  @Z1C*/         
        3 *        BIT(8),          /* Reserved                  @Z1C*/         
   %PGOP = 'SSH';                   /* Sets the preprocessor                    
                                    variable.                    @Q1A*/         
   %INCLUDE SYSLIB(ERBGOPC3);       /* Copies the options        @Q1A*/         
                                    /*                         23@Q1D*/         
        3 SSHSTDIF CHAR(8),         /* Time difference between                  
                                    local time and the GREENWICH                
                                    time.                                       
                                    DIF = LOCAL time - GMT time. @Q1A*/         
        3 SSHHSMJN CHAR(8),         /* Jobname of HSM subsystem, set            
                                       by module GRB3GHSM        @W1A*/         
        3 SSHHSMAS BIT(16),         /* ASID number of HSM subsystem,            
                                       set by module GRB3GHSM    @W1A*/         
        3 SSHJESJN CHAR(8),         /* Jobname of JES subsystem, set            
                                       by modules GRB3GJS2/JS3   @W1A*/         
        3 SSHJESAS BIT(16),         /* ASID number of JES subsystem,            
                                       set by modules GRB3GJS2/3 @W1A*/         
        3 SSHPGPO  FIXED(31),       /* Offset to PGPER control                  
                                       block.                                   
                                       This field contains the offset           
                                       when the data are within the             
                                       wrap around buffer.       @B1C*/         
          5 SSHPGPP PTR(31),        /* Pointer to PGPER control                 
                                       block.                    @B1A*/         
        3 SSHVFMO  FIXED(31),       /* Offset of VFMG3           @B4A*/         
          5 SSHVFMP  PTR(31),       /* Address of VFMG3          @B4A*/         
        3 SSHCSRO  FIXED(31),       /* Offset to CSR table.                     
                                       This field contains the offset           
                                       when the data are within the             
                                       wrap around buffer.       @B3A*/         
          5 SSHCSRP PTR(31),        /* Pointer to CSR table      @B3A*/         
        3 SSHJLCYC FIXED(31),       /* Timeoffset when the last                 
                                       cycle was gathered                       
                                       expressed in CYCLE time units            
                                       ( this value is found in                 
                                       SSHGOCYC). The offset is                 
                                       based on SSHTIBEG. The                   
                                       absolute time of the last cycle          
                                       gathered                                 
                                       is calculated as                         
                                       Abs_Cycle_Time = SSHTIBEG                
                                       +  SSHGOCYC*SSHJLCYC. Note,              
                                       however, that either SSHTIBEG or         
                                       SSHGOCYC have to be converted            
                                       because SSHTIBEG is in TOD               
                                       format and SSHGOCYC is in                
                                       units of milliseconds.                   
                                       SSHJLCYC is                              
                                       zero if the time difference              
                                       between cycle time and MINTIME           
                                       begin time is smaller than               
                                       one cycle unit.           @B2A*/         
        3 SSHSHDTL FIXED(31),       /* Total length of all SHDG3 @C1C*/         
        3 SSHRCDO  FIXED(31),       /* Offset to RCDG3-data. This               
                                       field contains the offset to             
                                       the data within the wrap                 
                                       around buffer             @C2A*/         
          5 SSHRCDP  POINTER(31),   /* Pointer to RCDG3-data     @C2A*/         
        3 SSHCPUO  FIXED(31),       /* Offset to CPUG3. Valid within            
                                       the in-storage buffer and                
                                       within the datasets.  @WA05435*/         
          5 SSHCPUP PTR(31),        /* Address of CPUG3      @WA05435*/         
        3 SSHIPLTI CHAR(8),         /* IPL time in TOD format                   
                                       (local time)              @C3A*/         
        3 SSHWLMTK CHAR(8),         /* WLM token                 @C3A*/         
        3 SSHENCO  FIXED(31),       /* Offset to ENCG3 data.     @D1A*/         
          5 SSHENCP  POINTER(31),   /* Pointer to ENCG3 data     @D1A*/         
        3 SSHSM2O  FIXED(31),       /* Offset to SM2G3           @E1A*/         
          5 SSHSM2P  POINTER(31),   /* Pointer to SM2G3 data     @E1A*/         
        3 SSHDDNO  FIXED(31),       /* Offset to DDNG3 data      @F1A*/         
          5 SSHDDNP  POINTER(31),   /* Pointer to DDNG3 data     @F1A*/         
        3 SSHCFIO  FIXED(31),       /* Offset to CFIG3 data      @G1A*/         
          5 SSHCFIP  POINTER(31),   /* Pointer to CFIG3 data     @G1A*/         
        3 SSHCATO  FIXED(31),       /* Offset to CATG3 data      @H1A*/         
          5 SSHCATP  POINTER(31),   /* Pointer to CATG3 data     @H1A*/         
        3 SSHVRIO  FIXED(31),       /* Offset to VRIG3 data      @I1C*/         
          5 SSHVRIP  POINTER(31),   /* Pointer to VRIG3 data     @I1A*/         
        3 SSHOPDO  FIXED(31),       /* Offset to OPDG3 data      @I2A*/         
          5 SSHOPDP  POINTER(31),   /* Pointer to OPDG3 data     @I2A*/         
        3 SSHZFSO  FIXED(31),       /* Offset to ZFSG3 data      @L1C*/         
          5 SSHZFSP  POINTER(31),   /* Pointer to ZFSG3 data     @L1A*/         
        3 SSHSPGO  FIXED(31),       /* Offset to SPGG3 data      @L2A*/         
          5 SSHSPGP  POINTER(31),   /* Pointer to SPGG3 data     @L2A*/         
        3 SSHCPDO Fixed(31),        /* Offset to CPDG3 data      @01C*/         
          5 SSHCPDP Ptr(31),        /* Ptr to CPDG3 data         @01A*/         
        3 SSHIQDO Fixed(31),        /* Offset to IQDG3 data      @11C*/         
          5 SSHIQDP Ptr(31),        /* Ptr to IQDG3 data         @11A*/         
       2 SSHEXTDC,                  /* Extended data continued   @11A*/         
        3 SSHXCFO Fixed(31),        /* Offset to XCFG3 data      @12A*/         
          5 SSHXCFP Ptr(31),        /* Ptr to to XCFG3 data      @12A*/         
        3 SSHLOKO Fixed(31),        /* Offset lock data          @21A*/         
          5 SSHLOKP Ptr(31),        /* Ptr to lock data          @21A*/         
        3 SSHPCIO Fixed(31),        /* Offset to PCIG3 data      @71A*/         
          5 SSHPCIP Ptr(31),        /* Ptr to to PCIG3 data      @71A*/         
        3 SSHSCMO Fixed(31),        /* Offset to SCMG3 data      @72A*/         
          5 SSHSCMP Ptr(31),        /* Ptr to to SCMG3 data      @72A*/         
        3 SSHZFXO Fixed(31),        /* Offset to ZFXG3 data      @73A*/         
          5 SSHZFXP Ptr(31),        /* Ptr to to ZFXG3 data      @73A*/         
        3 SSHCRYO Fixed(31),        /* Offset to CRYG3 data      @91A*/         
          5 SSHCRYP Ptr(31),        /* Ptr to to CRYG3 data      @91A*/         
        3 *     Char(12),           /*                           @91A*/         
      2 SSHEND  CHAR(0) BDY(DWORD); /* FORCE DWORD boundary      @Q3C*/         
                                    /*                           @D1A*/         
    DCL 1 SSHT3 BASED BDY(DWORD),   /* Trailor of the set of                    
                                    samples.                     @Q3A*/         
          3 SSHSSHT3 CHAR(5),       /* Acronym 'SSHT3' of the                   
                                    trailor.                     @Q3A*/         
          3 *        CHAR(7),       /* Reserved                  @Q3A*/         
          3 SSHTRTOT FIXED(31),     /* total length of the SSH.                 
                                    The total length includes the               
                                    trailor.                     @B2C*/         
          3 SSHTREND CHAR(8),       /* END time of the SSH.      @Q3A*/         
          3 SSHT3END CHAR(0) BDY(DWORD); /* Force dword boundary @Q3A*/         
                                    /*                           @D1A*/         
 /********************************************************************/         
 /*         constant declarations                                @W1M*/         
 /********************************************************************/         
   DCL SSHG3CB BIT(8)  CONSTANT('0E'X);  /* SSHG3 control block                 
                                       version number            @91C*/         
   DCL SSHNAME CHAR(5) CONSTANT('SSHG3'); /* SSHG3 control block                
                                       name                      @B1A*/         
   DCL SSHTACR CHAR(5) CONSTANT('SSHT3'); /* SSHT3 control block                
                                       name                      @B2A*/         
                                                                                
 /************************************************************14@A04A*/         
 @LOGIC;                                                                        
 #PRAGMA TOOL=CBGEN.                                                            
 #ALIGNOP.                                                                      
 #NOTUPPER.                                                                     
 #REPLACE.SSHNAME                                                               
 SSHNAME_0TO3 EQU C'SSHG'           Acronym of SSHG3 part 1                     
 SSHNAME_4    EQU C'3'              Acronym of SSHG3 part 2                     
 #EREPLACE.                                                                     
 #REPLACE.SSHTACR                                                               
 SSHTACR_0TO3 EQU C'SSHT'           Acronym of SSHT3 part 1                     
 SSHTACR_4    EQU C'3'              Acronym of SSHT3 part 2                     
 #EREPLACE.                                                                     
 #EPRAGMA.                                                                      
 @ENDLOGIC;                                                                     
