*/*      Bilingual Mapping Macro for SMF Record 74                              
         MACRO                                                                  
         ERBSMF74 &STYPE                                             */         
*/*** START OF SPECIFICATIONS ****************************************          
*                                                                    *          
*01* Proprietary Statement:                                          *          
*       Licensed Materials - Property of IBM                     @61A*          
*       "Restricted Materials of IBM"                            @61A*          
*       Copyright IBM Corp. 1983, 2022                          @A05C*          
*                                                                    *          
*       Status: z/OS V2R5 Data Gatherer (HRG77D0)                    *          
*                                                                    *          
*01* Macro Name: ERBSMF74                                            *          
*                                                                    *          
*01* Descriptive Name:  SMF RECORD 74 (Device, XCF, OMVS, XES,       *          
*                       CACHE, HFS, FICON Director Statistics,   @L1C*          
*                       Enterprise Disk System Statistics, PCIE, @62C*          
*                       Storage Class Memory Statistics)         @71A*          
*                                                                    *          
*02* Acronym: SMF74                                                  *          
*                                                                    *          
*01* DSECT Name:                                                     *          
*02*  Subtype  1: SMF74HDR SMF74PRO SMF74A SMF74B                    *          
*02*  Subtype  2: SMF74HDR SMF74PRO R742CNTL R742SYS R742PTH R742MBR *          
*02*  Subtype  3: SMF74HDR SMF74PRO R743DATA                         *          
*02*  Subtype  4: SMF74HDR SMF74PRO R744FLCF R744XCON R744GSRG       *          
*                 R744QSDS R744SREQ R744PROC R744CACH R744CFRF   @J1C*          
*                 R744CHPA R744MSCM R744ADUP                 @OA49148*          
*02*  Subtype  5: SMF74HDR SMF74PRO R745CNTL R745DEV R745XDEV    @E1A*          
*                 R7451DEV R745STAT                          @WA37816*          
*02*  Subtype  6: SMF74HDR SMF74PRO R746GDAT R746GBUF R746FSYS   @H1A*          
*02*  Subtype  7: SMF74HDR SMF74PRO R747GDAT R747SDAT R747PDAT   @I1A*          
*02*              R747CDAT                                       @I1A*          
*02*  Subtype  8: SMF74HDR SMF74PRO R748CNTL R748LSS R748EXTP    @L2C*          
*02*              R748RANK R748SIOL                          @OA53411*          
*02*  Subtype  9: SMF74HDR SMF74PRO R749PF  R749DMA R749HWA      @64C*          
*02*              R749HWA1 R749SYNC R749SRTD                 @OA50755*          
*02*  Subtype 10: SMF74HDR SMF74PRO R7410CM R7410DI              @71A*          
*                                                                    *          
*01* Component: zOS Data Gatherer (27401)                            *          
*                                                                    *          
*01* Eye-Catcher: None                                               *          
*02*  Offset: N/A                                                    *          
*02*  Length: N/A                                                    *          
*                                                                    *          
*01* Storage Attributes:                                             *          
*02*   Subpool: see below                                            *          
*03*      Subtype  1: 0                                              *          
*03*      Subtype  2: 10                                             *          
*03*      Subtype  3: 10                                             *          
*03*      Subtype  4: 10                                             *          
*03*      Subtype  5: 0                                          @E1A*          
*03*      Subtype  6: 10                                         @H1A*          
*03*      Subtype  7: 0                                          @I1A*          
*03*      Subtype  8: 0                                          @L1A*          
*03*      Subtype  9: 0                                          @62A*          
*03*      Subtype 10: 0                                          @71A*          
*02*   Key:     8                                                    *          
*02*   Residency: Any                                                *          
*02*   Main Storage: N/A                                             *          
*02*   Auxiliary Storage: N/A                                        *          
*02*   Virtual Storage: N/A                                          *          
*                                                                    *          
*01* FUNCTION = This macro maps the complete SMF record type 74.     *          
*              It has multiple subtypes:                         @62C*          
*              - Subtype 1 is created by Monitor I device activity   *          
*                measurement.                                        *          
*              - Subtype 2 is created by Monitor III XCF measurement.*          
*                (Cross-System Coupling Facility)                @Y1A*          
*              - Subtype 3 is created by Monitor III OMVS support.   *          
*                                                                @B1A*          
*              - Subtype 4 is created by Monitor III XES support.    *          
*                                                                @C1A*          
*              - Subtype 5 is created by Monitor I CACHE support     *          
*                                                                @E1A*          
*              - Subtype 6 is created by Monitor III HFS support.    *          
*                                                                @H1A*          
*              - Subtype 7 is created by Monitor I FICON         @I1A*          
*                Director support.                               @I1A*          
*              - Subtype 8 is created by Monitor I ESS support   @L1A*          
*              - Subtype 9 is created by Monitor III PCIE support    *          
*                                                                @62A*          
*              - Subtype 10 is created by the Monitor III storage    *          
*                class memory support                            @71A*          
*                                                                    *          
*              The record consists of the following parts.           *          
*              1. The fixed portion of the SMF header.               *          
*                 This mapping is included by calling ERBHDR macro.  *          
*              2. The individual header extension which contains     *          
*                 offset/length/number triplets to address the       *          
*                 record parts following the RMF product section.    *          
*              3. The RMF product section.                           *          
*                 This mapping is included by calling ERB74PRO macro *          
*              4. The control data section (not in subtype 4)        *          
*              5. The data sections.                                 *          
*                 - Subtype 1 has one type of data sections.     @Y1C*          
*                 - Subtype 2 has three types of data sections.  @Y1A*          
*                 - Subtype 3 has one data section               @B2A*          
*                 - Subtype 4 has 11 types of data sections  @OA49148*          
*                 - Subtype 5 has five types of data sections    @G2C*          
*                 - Subtype 6 has three types of data sections   @H1A*          
*                 - Subtype 7 has four types of data sections    @I1A*          
*                 - Subtype 8 has five types of data sections@OA53411*          
*                 - Subtype 9 has six types of data sections @OA50755*          
*                 - Subtype 10 has two types of data sections    @71A*          
*                                                                    *          
*01* NOTES: None                                                     *          
*                                                                    *          
*01* Size:                                                           *          
*                                                                    *          
*     Subtype 1:                                                     *          
*                                                                    *          
*        - Common header   :  36 bytes                               *          
*        - Header extension:  16 bytes                               *          
*        - Product section : see ERBPRO  macro                       *          
*        - Control section : see ERBR741 macro                   @K1C*          
*        - Data section    : see ERBR741 macro                   @K1C*          
*                                                                    *          
*     Subtype 2:                                                     *          
*                                                                    *          
*        - Common header   :  36 bytes                               *          
*        - Header extension:  24 bytes                               *          
*        - Product section : see ERBPRO  macro                       *          
*        - Control section : see ERBR742 macro                   @K1C*          
*        - Data sections   : see ERBR742 macro                   @K1C*          
*                                                                    *          
*     Subtype 3:                                                     *          
*                                                                    *          
*        - Common header   :  36 bytes                               *          
*        - Header extension:   8 bytes                               *          
*        - Product section : see ERBPRO  macro                       *          
*        - Data section    : see ERBR743 macro                   @K1C*          
*                                                                    *          
*     Subtype 4:                                                     *          
*                                                                    *          
*        - Common header   :  36 bytes                               *          
*        - Header extension:  88 bytes                       @OA49148*          
*        - Product section : see ERBPRO  macro                       *          
*        - Data sections   : see ERBR744 macro                   @K1C*          
*                                                                    *          
*     Subtype 5:                                                 @E1A*          
*                                                                @E1A*          
*        - Common header   :  36 bytes                           @E1A*          
*        - Header extension:  40 bytes                           @G2C*          
*        - Product section : see ERBPRO  macro                   @E1A*          
*        - Data sections   : see ERBR745 macro                   @K1C*          
*                                                                    *          
*     Subtype 6:                                                 @H1A*          
*                                                                @H1A*          
*        - Common header   :  36 bytes                           @H1A*          
*        - Header extension:  24 bytes                           @H1A*          
*        - Product section : see ERBPRO  macro                   @H1A*          
*        - Data sections   : see ERBR746 macro                   @K1C*          
*                                                                    *          
*     Subtype 7:                                                 @I1A*          
*                                                                @I1A*          
*        - Common header   :  36 bytes                           @I1A*          
*        - Header extension:  32 bytes                           @I1A*          
*        - Product section : see ERBPRO  macro                   @I1A*          
*        - Data sections   : see ERBR747 macro                   @K1C*          
*                                                                    *          
*     Subtype 8:                                                 @L1A*          
*                                                                @L1A*          
*        - Common header   :  36 bytes                           @L1A*          
*        - Header extension:  16 bytes                           @L1A*          
*        - Product section : see ERBPRO  macro                   @L1A*          
*        - Data sections   : see ERBR748 macro                   @L1A*          
*                                                                    *          
*     Subtype 9:                                                 @62A*          
*                                                                @62A*          
*        - Common header   :  36 bytes                           @62A*          
*        - Header extension:  32 bytes                           @64C*          
*        - Product section : see ERBPRO  macro                   @62A*          
*        - Data sections   : see ERBR749 macro                   @62A*          
*                                                                    *          
*     Subtype 10:                                                @71A*          
*                                                                @71A*          
*        - Common header   :  36 bytes                           @71A*          
*        - Header extension:  16 bytes                           @71A*          
*        - Product section : see ERBPRO macro                    @71A*          
*        - Data sections   : see ERBR7410 macro                  @71A*          
*                                                                    *          
*                                                                    *          
*     SMF records cannot exceed a length of 32,756 bytes.            *          
*     A Logical record which is longer than 32k is broken            *          
*     into physical 32k records.                                     *          
*                                                                    *          
*                                                                    *          
*01* Method of Access: See below:                                    *          
*                                                                    *          
*    BAL : ERBSMF74 type                                             *          
*          If 'type' is omitted, generates the mapping for   @WA05544*          
*          all subtypes                                      @WA05544*          
*                                                                    *          
*    PL/X: %IFAR74n='YES' semicolon n = subtype selected             *          
*          %INCLUDE SYSLIB(ERBSMF74) semicolon                       *          
*                                                                    *          
*          If the preprocessor variable %IFAR74n is not set          *          
*          in the including module, subtype 1 is included.           *          
*                                                                    *          
*01* Pointed to by: SMF74PTR                                         *          
*                                                                    *          
*01* Serialization: None                                             *          
*                                                                    *          
*01* Created by:                                                     *          
*                                                                    *          
*02*     Subtype  1: GRBMFDDP                                        *          
*02*     Subtype  2: GRB3GXCF                                        *          
*02*     Subtype  3: GRB3GIXC                                        *          
*02*     Subtype  4: GRB3GCFI                                        *          
*02*     Subtype  5: ERBMFXCR                                        *          
*02*     Subtype  6: GRB3GHFS                                    @H1A*          
*02*     Subtype  7: GRBMFDFD                                    @I1A*          
*02*     Subtype  8: ERBMFXCR                                    @L1A*          
*02*     Subtype  9: GRB3GPCI                                    @62A*          
*02*     Subtype 10: GRB3GMEM                                    @71A*          
*                                                                    *          
*01* Deleted by:                                                     *          
*                                                                    *          
*02*     Subtype  1: GRBMFDDP                                        *          
*02*     Subtype  2: GRB3GXCF                                        *          
*02*     Subtype  3: GRB3GIXC                                        *          
*02*     Subtype  4: GRB3GCFI                                        *          
*02*     Subtype  5: ERBMFXCR                                        *          
*02*     Subtype  6: GRB3GHFS                                    @H1A*          
*02*     Subtype  7: GRBMFDFD                                    @I1A*          
*02*     Subtype  8: ERBMFXCR                                    @L1A*          
*02*     Subtype  9: GRB3GPCI                                    @62A*          
*02*     Subtype 10: GRB3GMEM                                    @71A*          
*                                                                    *          
*01* Module-type: BILINGUAL MAPPING MACRO                            *          
*                                                                    *          
*01* Frequency: 1                                                    *          
*                                                                    *          
*01* Dependencies: None                                              *          
*                                                                    *          
*01* Distribution Library: AGRBMAC1                             @A02C*          
*                                                                    *          
*01* CHANGE-ACTIVITY = SEE BELOW                                     *          
*                                                                    *          
*     $N0=MON1,HRM3102,,SHR: REWRITTEN FOR RMF 3.1               @N0A*          
*     IMPROVEMENT FOR LONG RUNNING CHANNEL PROGRAMS          @ZA63802*          
*     $P1=3090,HRM3302,,MLN: 3090 support                        @P1A*          
*     $Q1=MISC,HRM3402,,SHR: Corrects ERBCOPY1 parameter syntax  @Q1A*          
*     $U1=SGSUP,JRM3512,,KLZ: Storage group support              @U1A*          
*     $U2=UCBDMC,JRM3512,,TJI: UCBDMC constraint relief          @U2A*          
*     $Y1=XCF,HRM4420,,THE: XCF support                          @Y1A*          
*     $Y2=DMSR,HRM4420,,THE: Model Type (SHARE SOMVSP87001)      @Y2A*          
*     $Z1=OY29112,HRM4420,,WRC: Serial & switch Support          @Z1A*          
*     $A1=DYNIO,JRM4421,,RV: Dynamic I/O Support                 @A1A*          
*     $B1=TAPE,HRM4430,,HBE: Tape Allocation                     @B1A*          
*     $B2=OMVS,HRM4430,,HUO: OPEN/MVS Kernel Activity Report     @B2A*          
*     JS : Corrects Mismatch between PLX and Assembler Part  @YA62787*          
*     LAN: Comment changes only (IODF creation date & time)  @YA64585*          
*     $C1=XES,HRM4440,,AJU: XES/CF Support                       @C1A*          
*     LAN: Corrects ORG statement of subtype 3               @YA66439*          
*     $C2=PPSDV,HRM5510,,FF: Shared device report data gathering @C2A*          
*      JS: Support for CTCs with special protocol            @WA03326*          
*          ( never ending channel programs )                 @WA03326*          
*          equivalent to OW00541                             @WA03326*          
*     AJU: Coupling facility redesign (5.1.0 upgrade APAR)   @WA04653*          
*     GBO: Cleanup of PADI-inconsistencies                   @WA05544*          
*     PFU: Provide shared/assigned indication for shared     @WA07295*          
*          device report                                     @WA07295*          
*     DK: RMF SPE for MVS 5.2.2 OMVS Release 3               @WA10257*          
*     AJU: Corrects comment for SMF74NUM and SMF74LCU        @WA16885*          
*     SUW: Add flag SMF74DDT - Device disconnect time is     @WA15094*          
*          invalid.                                          @WA15094*          
*     JS: RMF Support for CF Cache Statistic                 @WA20293*          
*     $E1=Cache,WA18886,,THE: Cache Controller Support           @E1A*          
*     THE:  Year 2000 support. IODF creation date.           @WA19913*          
*     AJU:  Update comments in subtype 5 STAT section        @WA22065*          
*     AJU:  Completes description of R742PSTA, R745SS0       @WA22735*          
*           R745SS1, R745SNS0 and R745SNS1                   @WA22735*          
*     $F1=CF,HRM6604,,AJU: Add coupling fac. model description   @F1A*          
*     $G1=CF,HRM6606,,AJU: Change comment of R744QSIZ            @G1A*          
*     $G2=CACHE,HRM6606,,THE: Real Hardware CUID and             @G2A*          
*           2105 support.                                    @WA37816*          
*           Corrects Mismatch between PLX and Assembler Part     @G2A*          
*     $G3=PAV,HRM6606,,PS: PAV Devices Support                   @G3A*          
*     $H1=HFS,HRM6607,,SHR: HFS support                          @H1A*          
*     THE:  2105 support and subtype 6 correction            @WA37816*          
*     $I1=FCD,HRM7703,,SHR: FICON director support               @I1A*          
*     $I2=TBIT,HRM7703,,SHR: Honors T-bit in SCHIB               @I2A*          
*     $I3=MISC,HRM7703,,WLR: Correct calculation when CHPIDs set     *          
*                            offline                             @I3A*          
*     SHR: PAV device support                                @WA31701*          
*     $I5=USS,HRM7703,,HOL: UNIX System Services Support         @I5A*          
*     THE:  XCF path data section: Average I/O transfer time @WA41317*          
*                                  R742PIOT added.           @WA41317*          
*     $I6=CACHE,HRM7703,,BEN: RAID Rank Support                  @I6A*          
*     $J1=CFDUP,HRM7705,,WLR: Coupling Facility Duplex Support   @J1A*          
*     FDL: Corrects comments on subtype 3 (OMVS) record      @WA46170*          
*     SHR: FICON director support enhancements               @WA46825*          
*     $K1=MISC,HRM7708,,GUB: Split SMF 74 mapping macro          @K1A*          
*     FDL: Prepares for up to 65535 devices                  @WA55906*          
*     $L1=SAND,OA04877,,GUB: ESS link statistics support         @L1A*          
*     $L2=MEGA,OA06476,,PS:  TotalStorage DS family support      @L2A*          
*     $61=R790,HRM7790,,MWe: explicit copyright for ext. macro   @61A*          
*     $62=PCIE,HRM7790,,JKu: PCIe Support                        @62A*          
*     $63=IFB,OA37826,,RRe: CF Link Enhancements                 @63A*          
*     $64=FPGA,HRM7790,,JKu: HW Accelerator Compression Support  @64A*          
*     RRe: SCM Enhancements for CF structures                @OA40515*          
*     $71=SCMEM,HRM77A0,,HBE: Storage class memory support       @71A*          
*     $72=PFMB,OA44524,,JKu: PFMB enhancements                   @72A*          
*     HBE: Fixes 74.10 header extension in ASM section       @OA47602*          
*     MWe: Asynchronous CF Duplexing                         @OA49148*          
*     MWe: Synchronous I/O RTD Support                       @OA50755*          
*     MWe: Synchronous I/O Link Support (Stage 2)            @OA53411*          
*    $A02=ZOSB,HRG77D0,,JBa: Rename zOS Data Gatherer libraries @A02A*          
*    $A03=ZOSB,HRG77D0,,JBa: Rename prefix ERB to GRB           @A03A*          
*    $A04=ZOSB,OA60212,,UMu: Mon 3 data conversion for reporter @A04A*          
*    $A05=CFL25,OA61041,,UMu: CF Level 25 support               @A05A*          
*                                                                    *          
****** END OF SPECIFICATIONS *****************************************/         
*        %GOTO PLS74;                                                           
*/*                                                                             
         SPACE 2                                                                
********************** SMF 74 RECORD LEVEL ********************** @A04A         
* Definition of current SMF record level for each subtype         @A04A         
*                                                                 @A04A         
* Record level SMF74n_SRL must be incremented, whenever           @A04A         
* length or layout is changed by APAR and release development     @A04A         
*                                                                 @A04A         
* '8E'X  - RMF product split                                      @A04A         
* '8F'X  - SMF74.4, CF Level 25 support (OA61041)                 @A05A         
*                                                                 @A04A         
********************** SMF 74 RECORD LEVEL ********************** @A04A         
         SPACE 2                                                                
SMF741_SRL  EQU X'8E'   Current SMF 74 subtype  1 record level    @A04A         
SMF742_SRL  EQU X'8E'   Current SMF 74 subtype  2 record level    @A04A         
SMF743_SRL  EQU X'8E'   Current SMF 74 subtype  3 record level    @A04A         
SMF744_SRL  EQU X'8F'   Current SMF 74 subtype  4 record level    @A05C         
SMF745_SRL  EQU X'8E'   Current SMF 74 subtype  5 record level    @A04A         
SMF746_SRL  EQU X'8E'   Current SMF 74 subtype  6 record level    @A04A         
SMF747_SRL  EQU X'8E'   Current SMF 74 subtype  7 record level    @A04A         
SMF748_SRL  EQU X'8E'   Current SMF 74 subtype  8 record level    @A04A         
SMF749_SRL  EQU X'8E'   Current SMF 74 subtype  9 record level    @A04A         
SMF7410_SRL EQU X'8E'   Current SMF 74 subtype 10 record level    @A04A         
         SPACE 4                                                                
**********************  COMMON SMF HEADER  ****************************         
         ERBHDR 74                                                              
         SPACE 3                                                                
**********************  INDIVIDUAL HEADER EXTENSION  ******************         
         SPACE 3                                                                
         LCLC  &X                                                 @Y1A          
&X       SETC  T'&STYPE                                           @Y1A          
         AIF   ('&X' EQ 'O').HDREXT1                              @Y1A          
         AIF   (&STYPE EQ 1).HDREXT1                              @Y1A          
         AIF   (&STYPE EQ 2).HDREXT2                              @Y1A          
         AIF   (&STYPE EQ 3).HDREXT3                              @B2A          
         AIF   (&STYPE EQ 4).HDREXT4                              @C1A          
         AIF   (&STYPE EQ 5).HDREXT5                              @E1A          
         AIF   (&STYPE EQ 6).HDREXT6                              @H1A          
         AIF   (&STYPE EQ 7).HDREXT7                              @I1A          
         AIF   (&STYPE EQ 8).HDREXT8                              @L1A          
         AIF   (&STYPE EQ 9).HDREXT9                              @62A          
         AIF   (&STYPE EQ 10).HDREX10                             @71A          
         SPACE 3                                                  @Y1A          
.ERROR   MNOTE 8,'&STYPE INVALID RECORD SUBTYPE SPECIFIED'        @Y1A          
.CONTB   ANOP                                                     @Y1A          
         MEXIT                                                    @Y1A          
.HDREXT1 ANOP                                                     @Y1A          
         SPACE 3                                                                
**********************  Subtype 1    **************************** @Y1A          
         SPACE 3                                                                
SMF74HDX DS    0CL16    TOTAL HEADER EXTENSION                @WA05544          
SMF74DCS DS    BL4      OFFSET TO DEVICE CONTROL DATA SECTION                   
SMF74DCL DS    BL2      LENGTH OF DEVICE CONTROL DATA SECTION                   
SMF74DCN DS    BL2      NUMBER OF DEVICE CONTROL DATA SECTIONS                  
SMF74DDS DS    BL4      OFFSET TO DEVICE DATA SECTION                           
SMF74DDL DS    BL2      LENGTH OF DEVICE DATA SECTION                           
SMF74DDN DS    BL2      NUMBER OF DEVICE DATA SECTIONS                          
         AIF   (&STYPE EQ 1).PROSEC                               @Y1A          
         SPACE 3                                                                
         ORG   SMF74DCS                                           @Y1A          
.HDREXT2 ANOP                                                     @Y1A          
**********************  Subtype 2    **************************** @Y1A          
         SPACE 3                                                                
SMF742HX DS    0CL32    Total Header extension                @WA05544          
SMF742CO DS    BL4      Offset to control data section            @Y1A          
SMF742CL DS    BL2      Length of control data section            @Y1A          
SMF742CN DS    BL2      Number of control data sections           @Y1A          
SMF742SO DS    BL4      Offset to system data section             @Y1A          
SMF742SL DS    BL2      Length of system data section             @Y1A          
SMF742SN DS    BL2      Number of system data sections            @Y1A          
SMF742PO DS    BL4      Offset to path data section               @Y1A          
SMF742PL DS    BL2      Length of path data section               @Y1A          
SMF742PN DS    BL2      Number of path data sections              @Y1A          
SMF742MO DS    BL4      Offset to member data section             @Y1A          
SMF742ML DS    BL2      Length of member data section             @Y1A          
SMF742MN DS    BL2      Number of member data sections            @Y1A          
         SPACE 2                                                                
         AIF   (&STYPE EQ 2).PROSEC                           @YA62787          
         ORG   SMF742CO                                           @B2C          
.HDREXT3 ANOP                                                     @B2A          
**********************  Subtype 3    ************************ @YA62787          
         SPACE 3                                                                
SMF743HX DS    0CL8     Total Header extension                @WA05544          
SMF743PO DS    BL4      Offset to data section                    @B2A          
SMF743PL DS    BL2      Length of data section                @YA62787          
SMF743PN DS    BL2      Number of data sections               @YA62787          
         SPACE 2                                                                
         AIF   (&STYPE EQ 3).PROSEC                               @B2A          
         ORG SMF743PO                                             @C1C          
.HDREXT4 ANOP                                                     @C1A          
**********************  Subtype 4    **************************** @C1A          
         SPACE 3                                                                
SMF744HX DS    0CL88    Total Header extension                @OA49148          
SMF744FO DS    BL4      Offset to local CF data section           @C1A          
SMF744FL DS    BL2      Length of local CF data section           @C1A          
SMF744FN DS    BL2      Number of local CF data sections          @C1A          
SMF744XO DS    BL4      Offset to connectivity CF data section    @C1A          
SMF744XL DS    BL2      Length of connectivity CF data section    @C1A          
SMF744XN DS    BL2      Number of connectivity CF data section    @C1A          
SMF744GO DS    BL4      Offset to storage CF data section         @C1A          
SMF744GL DS    BL2      Length of storage CF data section         @C1A          
SMF744GN DS    BL2      Number of storage CF data section         @C1A          
SMF744QO DS    BL4      Offset to structure CF data section       @C1A          
SMF744QL DS    BL2      Length of structure CF data section       @C1A          
SMF744QN DS    BL2      Number of structure CF data section       @C1A          
SMF744SO DS    BL4      Offset to request CF data section         @C1A          
SMF744SL DS    BL2      Length of request CF data section         @C1A          
SMF744SN DS    BL2      Number of request CF data section         @C1A          
SMF744PO DS    BL4      Offset to processor CF data section       @C1A          
SMF744PL DS    BL2      Length of processor CF data section       @C1A          
SMF744PN DS    BL2      Number of processor CF data sections      @C1A          
SMF744CO DS    BL4      Offset to CF Cache Data Section       @WA20293          
SMF744CL DS    BL2      Length of CF Cache Data Section       @WA20293          
SMF744CN DS    BL2      Number of CF Cache Data Sections      @WA20293          
SMF744RO DS    BL4      Offset to CF Remote Faciliy Data Section  @J1A          
SMF744RL DS    BL2      Length of CF Remote Faciliy Data Section  @J1A          
SMF744RN DS    BL2      Number of CF Remote Faciliy Data Sections @J1A          
SMF744HO DS    BL4      Offset to Channel Path Data Section       @63A          
SMF744HL DS    BL2      Length of Channel Path Data Section       @63A          
SMF744HN DS    BL2      Number of Channel Path Data Sections      @63A          
SMF744MO DS    BL4      Offset to SCM Data Section            @OA40515          
SMF744ML DS    BL2      Length of SCM Data Section            @OA40515          
SMF744MN DS    BL2      Number of SCM Data Sections           @OA40515          
SMF744AO DS    BL4      Offset to Asynchronous CF Duplexing Data                
*                       Section                               @OA49148          
SMF744AL DS    BL2      Length of Asynchronous CF Duplexing Data                
*                       Section                               @OA49148          
SMF744AN DS    BL2      Number of Asynchronous CF Duplexing Data                
*                       Sections                              @OA49148          
         SPACE 2                                                  @C1A          
         AIF   (&STYPE EQ 4).PROSEC                               @E1C          
         ORG SMF744FO                                             @C1A          
.HDREXT5 ANOP                                                     @C1A          
**********************  Subtype 5    **************************** @E1A          
         SPACE 3                                                                
SMF745HX DS    0CL40    Total Header extension                    @E1C          
SMF745CO DS    BL4      Offset to control data section            @E1A          
SMF745CL DS    BL2      Length of control data section            @E1A          
SMF745CN DS    BL2      Number of control data sections           @E1A          
SMF745DO DS    BL4      Offset to CACHE device data section       @E1A          
SMF745DL DS    BL2      Length of CACHE device data section       @E1A          
SMF745DN DS    BL2      Number of CACHE device data sections      @E1A          
SMF745XO DS    BL4      Offset to CACHE device data extension     @E1A          
SMF745XL DS    BL2      Length of CACHE device data extension     @E1A          
SMF745XN DS    BL2      Number of CACHE device data extensions    @E1A          
SMF745SO DS    BL4      Offset to CACHE status data section       @E1A          
SMF745SL DS    BL2      Length of CACHE status data section       @E1A          
SMF745SN DS    BL2      Number of CACHE status data sections      @E1A          
SMF7451O DS    BL4      Offset to RAID rank data section      @WA37816          
SMF7451L DS    BL2      Length of RAID rank data section      @WA37816          
SMF7451N DS    BL2      Number of RAID rank data sections     @WA37816          
         SPACE 2                                                  @C1A          
         AIF   (&STYPE EQ 5).PROSEC                               @C1A          
         ORG SMF745CO                                             @E1C          
.HDREXT6 ANOP                                                     @H1A          
**********************  Subtype 6    **************************** @H1A          
         SPACE 3                                                                
SMF746HX DS    0CL24    Total Header extension                    @H1A          
SMF746DO DS    BL4      Offset to global data section         @WA37816          
SMF746DL DS    BL2      Length of global data section         @WA37816          
SMF746DN DS    BL2      Number of global data sections        @WA37816          
SMF746BO DS    BL4      Offset to global buffer section           @H1A          
SMF746BL DS    BL2      Length of global buffer section           @H1A          
SMF746BN DS    BL2      Number of global buffer sections          @H1A          
SMF746FO DS    BL4      Offset to file system data section        @H1A          
SMF746FL DS    BL2      Length of file system data section        @H1A          
SMF746FN DS    BL2      Number of file system data sections       @H1A          
         AIF   (&STYPE EQ 6).PROSEC                               @I1A          
         SPACE 3                                                                
         ORG   SMF746DO                                           @I1A          
.HDREXT7 ANOP                                                     @I1A          
**********************  Subtype 7  ****************************** @I1A          
         SPACE 3                                                                
SMF747HX DS    0CL32    Total Header extension                    @I1A          
SMF747GO DS    BL4      Offset to global data section             @I1A          
SMF747GL DS    BL2      Length of global data section             @I1A          
SMF747GN DS    BL2      Number of global data section             @I1A          
SMF747SO DS    BL4      Offset to switch data section             @I1A          
SMF747SL DS    BL2      Length of switch data section             @I1A          
SMF747SN DS    BL2      Number of switch data sections            @I1A          
SMF747PO DS    BL4      Offset to port data section               @I1A          
SMF747PL DS    BL2      Length of port data section               @I1A          
SMF747PN DS    BL2      Number of port data sections              @I1A          
SMF747CO DS    BL4      Offset to port data section               @I1A          
SMF747CL DS    BL2      Length of port data section               @I1A          
SMF747CN DS    BL2      Number of port data sections              @I1A          
         SPACE 2                                                                
         AIF   (&STYPE NE 0).PROSEC                               @H1A          
         ORG   SMF747GO                                           @I1C          
.HDREXT8 ANOP                                                     @L1A          
**********************  Subtype 8  ****************************** @L1A          
         SPACE 3                                                                
SMF748HX DS    0CL48    Total Header extension                @OA53411          
SMF748CO DS    BL4      Offset to link statistics control section @L1A          
SMF748CL DS    BL2      Length of link statistics control section @L1A          
SMF748CN DS    BL2      Number of link statistics control section @L1A          
SMF748LO DS    BL4      Offset to link statistics data section    @L1A          
SMF748LL DS    BL2      Length of link statistics data section    @L1A          
SMF748LN DS    BL2      Number of link statistics data section    @L1A          
SMF748XO DS    BL4      Offset to Extent pool data section        @L2A          
SMF748XL DS    BL2      Length of Extent pool data section        @L2A          
SMF748XN DS    BL2      Number of Extent pool data section        @L2A          
SMF748RO DS    BL4      Offset to Rank statistics data section    @L2A          
SMF748RL DS    BL2      Length of Rank statistics data section    @L2A          
SMF748RN DS    BL2      Number of Rank statistics data section    @L2A          
SMF748AO DS    BL4      Offset to Rank Array data section         @L2A          
SMF748AL DS    BL2      Length of Rank Array data section         @L2A          
SMF748AN DS    BL2      Number of Rank Array data section         @L2A          
SMF748SO DS    BL4      Offset to Synchronous I/O Link Statistics               
*                       data section                          @OA53411          
SMF748SL DS    BL2      Length of Synchronous I/O Link Statistics               
*                       data section                          @OA53411          
SMF748SN DS    BL2      Number of Synchronous I/O Link Statistics               
*                       data sections                         @OA53411          
         SPACE 2                                                                
         AIF   (&STYPE NE 0).PROSEC                               @H1A          
         ORG   SMF748CO                                           @I1C          
.HDREXT9 ANOP                                                     @62A          
**********************  Subtype 9  ****************************** @62A          
         SPACE 3                                                                
SMF749HX DS    0CL48    Total Header extension                @OA50755          
SMF749PO DS    BL4      Offset to PCIE function data sections     @62A          
SMF749PL DS    BL2      Length of PCIE function data section      @62A          
SMF749PN DS    BL2      Number of PCIE function data sections     @62A          
SMF749DO DS    BL4      Offset to PCIE function type data section @72C          
SMF749DL DS    BL2      Length of PCIE function type data section @72C          
SMF749DN DS    BL2      Number of PCIE function type data section @72C          
SMF749FO DS    BL4      Offset to HW Accelerator data sections    @64A          
SMF749FL DS    BL2      Length of HW Accelerator data section     @64A          
SMF749FN DS    BL2      Number of HW Accelerator data sections    @64A          
SMF7491O DS    BL4      Offset to HWA compression data sections   @64A          
SMF7491L DS    BL2      Length of HWA compression data section    @64A          
SMF7491N DS    BL2      Number of HWA compression data sections   @64A          
SMF749SO DS    BL4      Offset to Synch I/O Link data section @OA50755          
SMF749SL DS    BL2      Length of Synch I/O Link data section @OA50755          
SMF749SN DS    BL2      Number of Synch I/O Link data sections@OA50755          
SMF749RO DS    BL4      Offset to Synch I/O RTD data section  @OA50755          
SMF749RL DS    BL2      Length of Synch I/O RTD data section  @OA50755          
SMF749RN DS    BL2      Number of Synch I/O RTD data sections @OA50755          
         SPACE 2                                                                
         AIF   (&STYPE NE 0).PROSEC                               @62A          
         ORG   SMF749PO                                           @62A          
.HDREX10 ANOP                                                     @71A          
**********************  Subtype 10 ****************************** @71A          
         SPACE 3                                                                
SMF7410HX DS   0CL16    Total Header extension                    @71C          
SMF7410DO DS   BL4      Offset to SCM device information sections @71A          
SMF7410DL DS   BL2      Length of SCM device information section  @71A          
SMF7410DN DS   BL2      Number of SCM device information sections @71A          
SMF7410CO DS   BL4      Offset to SCM configuration data sections @71A          
SMF7410CL DS   BL2      Length of SCM configuration data section  @71A          
SMF7410CN DS   BL2      Number of SCM configuration data sections @71A          
         SPACE 2                                                                
         AIF   (&STYPE NE 0).PROSEC                               @71A          
         ORG   SMF7410CO                                          @71A          
.PROSEC  ANOP                                                     @Y1A          
         SPACE 2                                                                
**********************  COMMON RMF PRODUCT SECTION  *******************         
         ERBPRO 74                                                              
         SPACE 2                                                                
         AIF   (&STYPE EQ 2).SUBTYP2                              @Y1A          
         AIF   (&STYPE EQ 3).SUBTYP3                              @B2A          
         AIF   (&STYPE EQ 4).SUBTYP4                              @C1A          
         AIF   (&STYPE EQ 5).SUBTYP5                              @E1A          
         AIF   (&STYPE EQ 6).SUBTYP6                              @H1A          
         AIF   (&STYPE EQ 7).SUBTYP7                              @I1A          
         AIF   (&STYPE EQ 8).SUBTYP8                              @L1A          
         AIF   (&STYPE EQ 9).SUBTYP9                              @62A          
         AIF   (&STYPE EQ 10).SUBTY10                             @71A          
***********************************************************************         
*                                                                     *         
* Relocate blocks for subtype 1 - Monitor I Device Activity Data  @K1C*         
*                                                                     *         
***********************************************************************         
         ERBR741                                                  @K1A          
         SPACE 2                                                                
         AIF   ('&X' EQ 'O').SUBTYP2                              @Y1A          
         MEXIT                                                    @Y1C          
.SUBTYP2 ANOP                                                     @Y1A          
         SPACE 2                                                                
***********************************************************************         
*                                                                     *         
* Relocate blocks for subtype 2 - Monitor III XCF Activity Data   @K1C*         
*                                                                     *         
***********************************************************************         
         ERBR742                                                  @K1A          
         SPACE 2                                                                
         AIF   ('&X' EQ 'O').SUBTYP3                              @B2A          
         MEXIT                                                    @B2A          
.SUBTYP3 ANOP                                                     @B2A          
         SPACE 2                                                  @B2A          
***********************************************************************         
*                                                                     *         
* Relocate blocks for subtype 3 - Monitor III OMVS Kernel             *         
*                                 Activity Data                   @K1C*         
*                                                                     *         
***********************************************************************         
         ERBR743                                                  @K1A          
         SPACE 2                                                                
         AIF   ('&X' EQ 'O').SUBTYP4                              @C1A          
         MEXIT                                                    @C1A          
.SUBTYP4 ANOP                                                     @C1A          
         SPACE 2                                                                
***********************************************************************         
*                                                                     *         
* Relocate blocks for subtype 4 - Monitor III Coupling Facility       *         
*                                 Activity Data                   @K1C*         
*                                                                     *         
***********************************************************************         
         ERBR744                                                  @K1A          
         SPACE 2                                                                
         AIF   ('&X' EQ 'O').SUBTYP5                              @E1A          
         MEXIT                                                    @E1A          
.SUBTYP5 ANOP                                                     @E1A          
         SPACE 2                                                                
***********************************************************************         
*                                                                     *         
* Relocate blocks for subtype 5 - Monitor I Cache Subsystem           *         
*                                 Activity Data                   @K1C*         
*                                                                     *         
***********************************************************************         
         ERBR745                                                  @K1A          
         SPACE 2                                                                
         AIF   ('&X' EQ 'O').SUBTYP6                              @H1A          
         MEXIT                                                    @H1A          
.SUBTYP6 ANOP                                                     @H1A          
         SPACE 2                                                                
***********************************************************************         
*                                                                     *         
* Relocate blocks for subtype 6 - Monitor III HFS Statistics      @K1C*         
*                                                                     *         
***********************************************************************         
         ERBR746                                                  @K1A          
         SPACE 2                                                                
         AIF   ('&X' EQ 'O').SUBTYP7                              @I1A          
         MEXIT                                                    @I1A          
.SUBTYP7 ANOP                                                     @I1A          
         SPACE 2                                                                
***********************************************************************         
*                                                                     *         
* Relocate blocks for subtype 7 - Monitor I FICON Director            *         
*                                 Statistics                      @K1C*         
*                                                                     *         
***********************************************************************         
         ERBR747                                                  @K1A          
         SPACE 2                                                                
         AIF   ('&X' EQ 'O').SUBTYP8                              @L1A          
         MEXIT                                                    @L1A          
.SUBTYP8 ANOP                                                     @L1A          
         SPACE 2                                                                
***********************************************************************         
*                                                                     *         
* Relocate blocks for subtype 8 - Monitor I ESS Statistics            *         
*                                                                 @L1A*         
*                                                                     *         
***********************************************************************         
         ERBR748                                                  @L1A          
         SPACE 2                                                                
         AIF   ('&X' EQ 'O').SUBTYP9                              @62A          
         MEXIT                                                    @62A          
.SUBTYP9 ANOP                                                     @62A          
         SPACE 2                                                                
***********************************************************************         
*                                                                     *         
* Relocate blocks for subtype 9 - Monitor III PCIe Statistics         *         
*                                                                 @62A*         
*                                                                     *         
***********************************************************************         
         ERBR749                                                  @62A          
         SPACE 2                                                                
         AIF   ('&X' EQ 'O').SUBTY10                              @71A          
         MEXIT                                                    @71A          
.SUBTY10 ANOP                                                     @71A          
         SPACE 2                                                                
***********************************************************************         
*                                                                     *         
* Relocate blocks for subtype 10 - Monitor III SCM Statistics         *         
*                                                                 @71A*         
*                                                                     *         
***********************************************************************         
         ERBR7410                                                 @71A          
         MEND  ,                                                                
*                                                                    */         
*%PLS74: ;                                                                      
*/********************************************************************/         
*/*                                                             @A04A*/         
*/* Definition of current SMF record level for each subtype     @A04A*/         
*/*                                                             @A04A*/         
*/* Record level SMF74n_SRL must be incremented, whenever       @A04A*/         
*/* length or layout is changed by APAR and release development @A04A*/         
*/*                                                             @A04A*/         
*/* '8E'X  - RMF product split                                  @A04A*/         
*/* '8F'X  - SMF74.4, CF Level 25 support (OA61041)             @A05A*/         
*/*                                                             @A04A*/         
*/********************************************************************/         
*   DCL SMF741_SRL FIXED(8) CONSTANT('8E'X); /* SMF74.1 rec.lvl @A04A*/         
*   DCL SMF742_SRL FIXED(8) CONSTANT('8E'X); /* SMF74.2 rec.lvl @A04A*/         
*   DCL SMF743_SRL FIXED(8) CONSTANT('8E'X); /* SMF74.3 rec.lvl @A04A*/         
*   DCL SMF744_SRL FIXED(8) CONSTANT('8F'X); /* SMF74.4 rec.lvl @A05A*/         
*   DCL SMF745_SRL FIXED(8) CONSTANT('8E'X); /* SMF74.5 rec.lvl @A04A*/         
*   DCL SMF746_SRL FIXED(8) CONSTANT('8E'X); /* SMF74.6 rec.lvl @A04A*/         
*   DCL SMF747_SRL FIXED(8) CONSTANT('8E'X); /* SMF74.7 rec.lvl @A04A*/         
*   DCL SMF748_SRL FIXED(8) CONSTANT('8E'X); /* SMF74.8 rec.lvl @A04A*/         
*   DCL SMF749_SRL FIXED(8) CONSTANT('8E'X); /* SMF74.9 rec.lvl @A04A*/         
*   DCL SMF7410_SRL FIXED(8) CONSTANT('8E'X); /* SMF74.10 rec.lvl               
*                                                               @A04A*/         
*/********************************************************************/         
*/*                                                                  */         
*/* Common SMF Header                                                */         
*/*                                                                  */         
*/********************************************************************/         
*?ERBHDR TYPE(74) ATTRIBUT(BASED(SMF74PTR));                                    
*%IF IFAR741 = 'YES' %THEN %GO TO LHDX741; /* Subtype 1          @Y1A*/         
*%IF IFAR742 = 'YES' %THEN %GO TO LHDX742; /* Subtype 2          @Y1A*/         
*%IF IFAR743 = 'YES' %THEN %GO TO LHDX743; /* Subtype 3          @B2A*/         
*%IF IFAR744 = 'YES' %THEN %GO TO LHDX744; /* Subtype 4          @C1A*/         
*%IF IFAR745 = 'YES' %THEN %GO TO LHDX745; /* Subtype 5          @E1A*/         
*%IF IFAR746 = 'YES' %THEN %GO TO LHDX746; /* Subtype 6          @H1A*/         
*%IF IFAR747 = 'YES' %THEN %GO TO LHDX747; /* Subtype 7          @I1A*/         
*%IF IFAR748 = 'YES' %THEN %GO TO LHDX748; /* Subtype 8          @L1A*/         
*%IF IFAR749 = 'YES' %THEN %GO TO LHDX749; /* Subtype 9          @62A*/         
*%IF IFAR7410= 'YES' %THEN %GO TO LHDX7410;/* Subtype 10         @71A*/         
*%IFAR741 = 'YES';                /* No valid subtype, use default              
*                                    subtype 1                   @Y1A*/         
*%LHDX741:;                       /* Subtype 1                   @Y1A*/         
*/********************************************************************/         
*/*                                                                  */         
*/* Individual header extension for subtype 1                        */         
*/*                                                                  */         
*/********************************************************************/         
*      2 SMF74HDX,                /* HEADER EXTENSION                */         
*       3 SMF74DCS FIXED(31),     /* OFFSET TO DEVICE CNTL SECTION   */         
*       3 SMF74DCL FIXED(15),     /* LENGTH OF DEVICE CNTL SECTION   */         
*       3 SMF74DCN FIXED(15),     /* NUMBER OF DEVICE CNTL SECTIONS  */         
*       3 SMF74DDS FIXED(31),     /* OFFSET TO DEVICE DATA SECTION   */         
*       3 SMF74DDL FIXED(15),     /* LENGTH OF DEVICE DATA SECTION   */         
*       3 SMF74DDN FIXED(16);     /* NUMBER OF DEVICE DATA SECTIONS             
*                                                            @WA55906*/         
*%IF IFAR742 ^= 'YES' %THEN %GO TO LHDX743; /* Not subtype 2     @B2C*/         
*%LHDX742:;                       /* Subtype 2                   @Y1A*/         
*/********************************************************************/         
*/*                                                                  */         
*/* Individual header extension for subtype 2                        */         
*/*                                                                  */         
*/********************************************************************/         
*%IF IFAR741 ^= 'YES' %THEN %GO TO LHDX7421; /* Not subtype 1    @Y1A*/         
*   DECLARE                                                                     
*      1 SMF742XH DEFINED(SMF74HDX), /* Header extension for                    
*                                      subtype 2                 @Y1A*/         
*%LHDX7421:;                        /* Subtype 2                 @Y1A*/         
*      2 SMF742HX,                  /* Header extension for subtype 2           
*                                                                @Y1A*/         
*       3 SMF742CO FIXED(31),       /* Offset to control data section           
*                                                                @Y1A*/         
*       3 SMF742CL FIXED(15),       /* Length of control data section           
*                                                                @Y1A*/         
*       3 SMF742CN FIXED(15),       /* Number of control data sections          
*                                                                @Y1A*/         
*       3 SMF742SO FIXED(31),       /* Offset to system data                    
*                                      section                   @Y1A*/         
*       3 SMF742SL FIXED(15),       /* Length of system data                    
*                                      section                   @Y1A*/         
*       3 SMF742SN FIXED(15),       /* Number of system data                    
*                                      section                   @Y1A*/         
*       3 SMF742PO FIXED(31),       /* Offset to path data section              
*                                                                @Y1A*/         
*       3 SMF742PL FIXED(15),       /* Length of path data section              
*                                                                @Y1A*/         
*       3 SMF742PN FIXED(15),       /* Number of path data sections             
*                                                                @Y1A*/         
*       3 SMF742MO FIXED(31),       /* Offset to Member data section            
*                                                                @Y1A*/         
*       3 SMF742ML FIXED(15),       /* Length of member data section            
*                                                                @Y1A*/         
*       3 SMF742MN FIXED(15);       /* Number of member data sections           
*                                                                @Y1A*/         
*%LHDX743:;                        /* Subtype 3                  @C1M*/         
*%IF IFAR743 ^= 'YES' %THEN %GO TO LHDX744; /* Not subtype 3     @C1C*/         
*/********************************************************************/         
*/*                                                                  */         
*/* Individual header extension for subtype 3                        */         
*/*                                                                  */         
*/********************************************************************/         
*%IF (IFAR741 ^= 'YES') & (IFAR742 ^= 'YES') %THEN %GO TO LHDX7431;             
*                                   /* Not subtype 1 + 2         @C1C*/         
*   DECLARE                                                                     
*      1 SMF743XH DEFINED(SMF74HDX),/* Header extension for                     
*                                      subtype 3                 @B2A*/         
*%LHDX7431:;                        /* Subtype 3                 @B2A*/         
*      2 SMF743HX,                  /* Header extension for subtype 3           
*                                                                @B2A*/         
*       3 SMF743PO FIXED(31),       /* Offset to data section    @B2A*/         
*       3 SMF743PL FIXED(15),       /* Length of data section    @B2A*/         
*       3 SMF743PN FIXED(15);       /* Number of data sections   @B2A*/         
*                                                                               
*%LHDX744:;                        /* Subtype 4                  @C1A*/         
*%IF IFAR744 ^= 'YES' %THEN %GO TO LHDX745;  /* Not subtype 4    @E1C*/         
*/********************************************************************/         
*/*                                                                  */         
*/* Individual header extension for subtype 4                        */         
*/*                                                                  */         
*/********************************************************************/         
*%IF (IFAR741 ^= 'YES') & (IFAR742 ^= 'YES') & (IFAR743 ^= 'YES')               
*%THEN %GO TO LHDX7441;             /* Not subtype 1 + 2 + 3     @C1A*/         
*   DECLARE                                                                     
*      1 SMF744XH DEFINED(SMF74HDX),/* Header extension for                     
*                                      subtype 4                 @C1A*/         
*%LHDX7441:;                        /* Subtype 4                 @C1A*/         
*      2 SMF744HX,                  /* Header extension for subtype 4           
*                                                                @C1A*/         
*       3 SMF744FO FIXED(31),       /* Offset to local CF data                  
*                                      section                   @C1A*/         
*       3 SMF744FL FIXED(15),       /* Length of local CF data                  
*                                      section                   @C1A*/         
*       3 SMF744FN FIXED(15),       /* Number of local CF data                  
*                                      sections                  @C1A*/         
*       3 SMF744XO FIXED(31),       /* Offset to connectivity data              
*                                      section                   @C1A*/         
*       3 SMF744XL FIXED(15),       /* Length of connectivity data              
*                                      section                   @C1A*/         
*       3 SMF744XN FIXED(15),       /* Number of connectivity data              
*                                      sections                  @C1A*/         
*       3 SMF744GO FIXED(31),       /* Offset to storage data                   
*                                      section                   @C1A*/         
*       3 SMF744GL FIXED(15),       /* Length of storage data                   
*                                      section                   @C1A*/         
*       3 SMF744GN FIXED(15),       /* Number of storage data                   
*                                      sections                  @C1A*/         
*       3 SMF744QO FIXED(31),       /* Offset to structure data                 
*                                      section                   @C1A*/         
*       3 SMF744QL FIXED(15),       /* Length of structure data                 
*                                      section                   @C1A*/         
*       3 SMF744QN FIXED(15),       /* Number of structure data                 
*                                      sections                  @C1A*/         
*       3 SMF744SO FIXED(31),       /* Offset to request data                   
*                                      section                   @C1A*/         
*       3 SMF744SL FIXED(15),       /* Length of request data                   
*                                      section                   @C1A*/         
*       3 SMF744SN FIXED(15),       /* Number of request data                   
*                                      sections                  @C1A*/         
*       3 SMF744PO FIXED(31),       /* Offset to processor data                 
*                                      section                   @C1A*/         
*       3 SMF744PL FIXED(15),       /* Length of processor data                 
*                                      section                   @C1A*/         
*       3 SMF744PN FIXED(15),       /* Number of processor data                 
*                                      sections                  @C1A*/         
*       3 SMF744CO FIXED(31),       /* Offset to Cache Data Section             
*                                                            @WA20293*/         
*       3 SMF744CL FIXED(15),       /* Length of Cache Data Section             
*                                                            @WA20293*/         
*       3 SMF744CN FIXED(15),       /* Number of Cache Data Section             
*                                                                @J1C*/         
*       3 SMF744RO FIXED(31),       /* Offset to CF Remote Faciliy              
*                                      Data Section              @J1A*/         
*       3 SMF744RL FIXED(15),       /* Length of CF Remote Faciliy              
*                                      Data Section              @J1A*/         
*       3 SMF744RN FIXED(15),       /* Number of CF Remote Faciliy              
*                                      Data Sections             @63C*/         
*       3 SMF744HO FIXED(31),       /* Offset to Channel Path                   
*                                      Data Section              @63A*/         
*       3 SMF744HL FIXED(15),       /* Length of Channel Path                   
*                                      Data Section              @63A*/         
*       3 SMF744HN FIXED(15),       /* Number of Channel Path                   
*                                      Data Sections             @63A*/         
*       3 SMF744MO FIXED(31),       /* Offset to SCM                            
*                                      Data Section          @OA40515*/         
*       3 SMF744ML FIXED(15),       /* Length of SCM                            
*                                      Data Section          @OA40515*/         
*       3 SMF744MN FIXED(15),       /* Number of SCM                            
*                                      Data Sections         @OA49148*/         
*       3 SMF744AO FIXED(31),       /* Offset to Asynchronous CF                
*                                      Duplexing Data Section@OA49148*/         
*       3 SMF744AL FIXED(15),       /* Length of Asynchronous CF                
*                                      Duplexing Data Section@OA49148*/         
*       3 SMF744AN FIXED(15);       /* Number of Asynchronous CF                
*                                      Duplexing Data Section@OA49148*/         
*                                                                               
*%LHDX745:;                        /* Subtype 5                  @E1A*/         
*%IF IFAR745 ^= 'YES' %THEN %GO TO LHDX746;  /* Not subtype 5    @H1A*/         
*/********************************************************************/         
*/*                                                                  */         
*/* Individual header extension for subtype 5                        */         
*/*                                                                  */         
*/********************************************************************/         
*%IF (IFAR741 ^= 'YES') & (IFAR742 ^= 'YES') & (IFAR743 ^= 'YES') &             
*    (IFAR744 ^= 'YES')                                                         
*%THEN %GO TO LHDX7451;             /* Not subtype 1 + 2 + 3 + 4 @E1A*/         
*   DECLARE                                                                     
*      1 SMF745XH DEFINED(SMF74HDX),/* Header extension for                     
*                                      subtype 5                 @E1A*/         
*%LHDX7451:;                        /* Subtype 5                 @E1A*/         
*      2 SMF745HX,                  /* Header extension for                     
*                                      subtype 5                 @E1A*/         
*       3 SMF745CO FIXED(31),       /* Offset to control section @E1A*/         
*       3 SMF745CL FIXED(15),       /* Length of control section @E1A*/         
*       3 SMF745CN FIXED(15),       /* Number of control sections               
*                                                                @E1A*/         
*       3 SMF745DO FIXED(31),       /* Offset to CACHE device data              
*                                      section                   @E1A*/         
*       3 SMF745DL FIXED(15),       /* Length of CACHE device data              
*                                      section                   @E1A*/         
*       3 SMF745DN FIXED(15),       /* Number of CACHE device data              
*                                      sections                  @E1A*/         
*       3 SMF745XO FIXED(31),       /* Offset to CACHE device data              
*                                      section extension         @E1A*/         
*       3 SMF745XL FIXED(15),       /* Length of CACHE device data              
*                                      section extension         @E1A*/         
*       3 SMF745XN FIXED(15),       /* Number of CACHE device data              
*                                      section extensions        @E1A*/         
*       3 SMF745SO FIXED(31),       /* Offset to CACHE status data              
*                                      section                   @E1A*/         
*       3 SMF745SL FIXED(15),       /* Length of CACHE status data              
*                                      section                   @E1A*/         
*       3 SMF745SN FIXED(15),       /* Number of CACHE status data              
*                                      sections                  @G2C*/         
*       3 SMF7451O FIXED(31),       /* Offset to RAID rank data                 
*                                      section               @WA37816*/         
*       3 SMF7451L FIXED(15),       /* Length of RAID rank data                 
*                                      section               @WA37816*/         
*       3 SMF7451N FIXED(15);       /* Number of RAID rank data                 
*                                      sections                  @I4C*/         
*%LHDX746:;                         /* Subtype 6                 @H1A*/         
*%IF IFAR746 ^= 'YES' %THEN %GO TO LHDX747; /* Not subtype 6     @I1C*/         
*/********************************************************************/         
*/*                                                                  */         
*/* Individual header extension for subtype 6                        */         
*/*                                                                  */         
*/********************************************************************/         
*%IF (IFAR741 ^= 'YES') & (IFAR742 ^= 'YES') & (IFAR743 ^= 'YES') &             
*    (IFAR744 ^= 'YES') & (IFAR745 ^= 'YES')                                    
*%THEN %GO TO LHDX7461;             /* Not subtype 1 + 2 + 3 + 4 + 5            
*                                                                @H1A*/         
*   DECLARE                                                                     
*      1 SMF746XH DEFINED(SMF74HDX),/* Header extension for                     
*                                      subtype 6                 @H1A*/         
*%LHDX7461:;                        /* Subtype 6                 @H1A*/         
*      2 SMF746HX,                  /* Header extension for                     
*                                      subtype 6                 @H1A*/         
*       3 SMF746DO FIXED(31),       /* Offset to global data                    
*                                      section                   @H1A*/         
*       3 SMF746DL FIXED(15),       /* Length of global data                    
*                                      section                   @H1A*/         
*       3 SMF746DN FIXED(15),       /* Number of global data                    
*                                      sections                  @H1A*/         
*       3 SMF746BO FIXED(31),       /* Offset to global buffer                  
*                                      section                   @H1A*/         
*       3 SMF746BL FIXED(15),       /* Length of global buffer                  
*                                      section                   @H1A*/         
*       3 SMF746BN FIXED(15),       /* Number of global buffer                  
*                                      sections                  @H1A*/         
*       3 SMF746FO FIXED(31),       /* Offset to file system                    
*                                      section                   @H1A*/         
*       3 SMF746FL FIXED(15),       /* Length of file system                    
*                                      section                   @H1A*/         
*       3 SMF746FN FIXED(15);       /* Number of file system                    
*                                      sections                  @H1A*/         
*%LHDX747:;                         /* Subtype 7                 @I1A*/         
*%IF IFAR747 ^= 'YES' %THEN %GO TO LHDX748;  /* Not subtype 7    @L1C*/         
*/********************************************************************/         
*/*                                                                  */         
*/* Individual header extension for subtype 7                        */         
*/*                                                                  */         
*/********************************************************************/         
*%IF (IFAR741 ^= 'YES') & (IFAR742 ^= 'YES') & (IFAR743 ^= 'YES') &             
*    (IFAR744 ^= 'YES') & (IFAR745 ^= 'YES') & (IFAR746 ^= 'YES')               
*%THEN %GO TO LHDX7471;             /* Not subtype 1 + 2 + 3 + 4 + 5            
*                                      + 6                       @I1A*/         
*   DECLARE                                                                     
*      1 SMF747XH DEFINED(SMF74HDX),/* Header extension for                     
*                                      subtype 7                 @I1A*/         
*%LHDX7471:;                        /* Subtype 7                 @I1A*/         
*      2 SMF747HX,                  /* Header extension for                     
*                                      subtype 7                 @I1A*/         
*       3 SMF747GO FIXED(31),       /* Offset to global data                    
*                                      section                   @I1A*/         
*       3 SMF747GL FIXED(15),       /* Length of global data                    
*                                      section                   @I1A*/         
*       3 SMF747GN FIXED(15),       /* Number of global data                    
*                                      sections                  @I1A*/         
*       3 SMF747SO FIXED(31),       /* Offset to switch data                    
*                                      section                   @I1A*/         
*       3 SMF747SL FIXED(15),       /* Length of switch data                    
*                                      section                   @I1A*/         
*       3 SMF747SN FIXED(15),       /* Number of switch data                    
*                                      sections                  @I1A*/         
*       3 SMF747PO FIXED(31),       /* Offset to port data                      
*                                      section                   @I1A*/         
*       3 SMF747PL FIXED(15),       /* Length of port data                      
*                                      section                   @I1A*/         
*       3 SMF747PN FIXED(15),       /* Number of port data                      
*                                      sections                  @I1A*/         
*       3 SMF747CO FIXED(31),       /* Offset to connector                      
*                                      section                   @I1A*/         
*       3 SMF747CL FIXED(15),       /* Length of connector                      
*                                      section                   @I1A*/         
*       3 SMF747CN FIXED(15);       /* Number of connector                      
*                                      sections                  @I1A*/         
*%LHDX748:;                         /* Subtype 8                 @L1A*/         
*%IF IFAR748 ^= 'YES' %THEN %GO TO LEHDX74;  /* Not subtype 8    @L1A*/         
*/********************************************************************/         
*/*                                                                  */         
*/* Individual header extension for subtype 8                        */         
*/*                                                                  */         
*/********************************************************************/         
*%IF (IFAR741 ^= 'YES') & (IFAR742 ^= 'YES') & (IFAR743 ^= 'YES') &             
*    (IFAR744 ^= 'YES') & (IFAR745 ^= 'YES') & (IFAR746 ^= 'YES') &             
*    (IFAR747 ^= 'YES')                                                         
*%THEN %GO TO LHDX7481;             /* Not subtype 1 + 2 + 3 + 4 + 5            
*                                      + 6 + 7                   @L1A*/         
*%IF IFAR745 = 'YES'                                                            
*%THEN %GO TO LHDX7482;             /* Subtype 5 and 8           @L1A*/         
*   DECLARE                                                                     
*      1 SMF748XH DEFINED(SMF74HDX),/* Header extension for                     
*                                      subtype 8                 @L1A*/         
*%GO TO LHDX7481;                                                               
*%LHDX7482:;                                                                    
*   DECLARE                                                                     
*      1 SMF748XH DEFINED(SMF745HX),/* Header extension for                     
*                                      subtype 8, if there is                   
*                                      subtype 5 as well         @L1A*/         
*%LHDX7481:;                        /* Subtype 8                 @L1A*/         
*      2 SMF748HX,                  /* Header extension for                     
*                                      subtype 8                 @L1A*/         
*       3 SMF748CO FIXED(31),       /* Offset to link control                   
*                                      section                   @L1A*/         
*       3 SMF748CL FIXED(15),       /* Length of link control                   
*                                      section                   @L1A*/         
*       3 SMF748CN FIXED(15),       /* Number of link control                   
*                                      sections                  @L1A*/         
*       3 SMF748LO FIXED(31),       /* Offset to link data                      
*                                      section                   @L1A*/         
*       3 SMF748LL FIXED(15),       /* Length of link data                      
*                                      section                   @L1A*/         
*       3 SMF748LN FIXED(15),       /* Number of link data                      
*                                      sections                  @L2C*/         
*       3 SMF748XO FIXED(31),       /* Offset to Extent pool data               
*                                      section                   @L2A*/         
*       3 SMF748XL FIXED(15),       /* Length of Extent pool data               
*                                      section                   @L2A*/         
*       3 SMF748XN FIXED(15),       /* Number of Extent pool data               
*                                      section                   @L2A*/         
*       3 SMF748RO FIXED(31),       /* Offset to Rank statistics                
*                                      data section              @L2A*/         
*       3 SMF748RL FIXED(15),       /* Length of Rank statistics                
*                                      data section              @L2A*/         
*       3 SMF748RN FIXED(15),       /* Number of Rank statistics                
*                                      data section              @L2A*/         
*       3 SMF748AO FIXED(31),       /* Offset to Rank Array                     
*                                      data section              @L2A*/         
*       3 SMF748AL FIXED(15),       /* Length of Rank Array                     
*                                      data section              @L2A*/         
*       3 SMF748AN FIXED(15),       /* Number of Rank Array                     
*                                      data section          @OA53411*/         
*       3 SMF748SO FIXED(31),       /* Offset to Synchronous I/O Link           
*                                      Statistics data sect. @OA53411*/         
*       3 SMF748SL FIXED(15),       /* Length of Synchronous I/O Link           
*                                      Statistics data sect. @OA53411*/         
*       3 SMF748SN FIXED(15);       /* Number of Synchronous I/O Link           
*                                      Statistics data sect. @OA53411*/         
*%LHDX749:;                         /* Subtype 9                 @62A*/         
*%IF IFAR749 ^= 'YES' %THEN %GO TO LEHDX74;  /* Not subtype 9    @62A*/         
*/********************************************************************/         
*/*                                                                  */         
*/* Individual header extension for subtype 9                        */         
*/*                                                                  */         
*/********************************************************************/         
*%IF (IFAR741 ^= 'YES') & (IFAR742 ^= 'YES') & (IFAR743 ^= 'YES') &             
*    (IFAR744 ^= 'YES') & (IFAR745 ^= 'YES') & (IFAR746 ^= 'YES') &             
*    (IFAR747 ^= 'YES') & (IFAR748 ^= 'YES')                                    
*%THEN %GO TO LHDX7491;             /* Not subtype 1 + 2 + 3 + 4 + 5            
*                                      + 6 + 7 + 8               @62A*/         
*   DECLARE                                                                     
*      1 SMF749XH DEFINED(SMF74HDX),/* Header extension for                     
*                                      subtype 9                 @62A*/         
*%LHDX7491:;                        /* Subtype 9                 @62A*/         
*      2 SMF749HX,                  /* Header extension for                     
*                                      subtype 9                 @62A*/         
*       3 SMF749PO FIXED(31),       /* Offset to PCIE function data             
*                                      sections                  @62A*/         
*       3 SMF749PL FIXED(15),       /* Length of PCIE function data             
*                                      section                   @62A*/         
*       3 SMF749PN FIXED(15),       /* Number of PCIE function data             
*                                      sections                  @62A*/         
*       3 SMF749DO FIXED(31),       /* Offset to PCIE function type             
*                                      data sections             @72C*/         
*       3 SMF749DL FIXED(15),       /* Length of PCIE function type             
*                                      data section              @72C*/         
*       3 SMF749DN FIXED(15),       /* Number of PCIE function type             
*                                      data sections             @72C*/         
*       3 SMF749FO FIXED(31),       /* Offset to HW Accelerator data            
*                                      sections                  @64A*/         
*       3 SMF749FL FIXED(15),       /* Length of HW Accelerator data            
*                                      section                   @64A*/         
*       3 SMF749FN FIXED(15),       /* Number of HW Accelerator data            
*                                      sections                  @64A*/         
*       3 SMF7491O FIXED(31),       /* Offset to HW Accelerator                 
*                                      compression data sections @64A*/         
*       3 SMF7491L FIXED(15),       /* Length of HW Accelerator                 
*                                      compression data sections @64A*/         
*       3 SMF7491N FIXED(15),       /* Number of HW Accelerator                 
*                                      compression data sections                
*                                                            @OA50755*/         
*       3 SMF749SO FIXED(31),       /* Offset to Synchronous I/O Link           
*                                      data section          @OA50755*/         
*       3 SMF749SL FIXED(15),       /* Length of Synchronous I/O Link           
*                                      data section          @OA50755*/         
*       3 SMF749SN FIXED(15),       /* Number of Synchronous I/O Link           
*                                      data section          @OA50755*/         
*       3 SMF749RO FIXED(31),       /* Offset to Synchronous I/O RTD            
*                                      data section          @OA50755*/         
*       3 SMF749RL FIXED(15),       /* Length of Synchronous I/O RTD            
*                                      data section          @OA50755*/         
*       3 SMF749RN FIXED(15);       /* Number of Synchronous I/O RTD            
*                                      data sections         @OA50755*/         
*%LHDX7410:;                        /* Subtype 10                @71A*/         
*%IF IFAR7410 ^= 'YES' %THEN %GO TO LEHDX74; /* Not subtype 10   @71A*/         
*/********************************************************************/         
*/*                                                                  */         
*/* Individual header extension for subtype 10                       */         
*/*                                                                  */         
*/********************************************************************/         
*%IF (IFAR741 ^= 'YES') & (IFAR742 ^= 'YES') & (IFAR743 ^= 'YES') &             
*    (IFAR744 ^= 'YES') & (IFAR745 ^= 'YES') & (IFAR746 ^= 'YES') &             
*    (IFAR747 ^= 'YES') & (IFAR748 ^= 'YES') & (IFAR749 ^= 'YES')               
*%THEN %GO TO LHDY7410;             /* Not subtype 1 + 2 + 3 + 4 + 5            
*                                      + 6 + 7 + 8 + 9           @71A*/         
*   DECLARE                                                                     
*      1 SMF7410XH DEFINED(SMF74HDX),/* Header extension for                    
*                                      subtype 10                @71A*/         
*%LHDY7410:;                        /* Subtype 10                @71A*/         
*      2 SMF7410HX,                 /* Header extension for                     
*                                      subtype 10                @71A*/         
*       3 SMF7410DO FIXED(31),      /* Offset to SCM EADM device                
*                                      information section       @71A*/         
*       3 SMF7410DL FIXED(15),      /* Length of SCM EADM device                
*                                      information section       @71A*/         
*       3 SMF7410DN FIXED(15),      /* Number of SCM EADM device                
*                                      information sections      @71A*/         
*       3 SMF7410CO FIXED(31),      /* Offset to SCM configuration              
*                                      measurement sections      @71A*/         
*       3 SMF7410CL FIXED(15),      /* Length of SCM configuration              
*                                      measurement section       @71A*/         
*       3 SMF7410CN FIXED(15);      /* Number of SCM configuration              
*                                      measurement sections      @71A*/         
*%LEHDX74:;                         /* End of header extension   @Y1A*/         
*                                                               @SPACE;         
*/********************************************************************/         
*/*                                                                  */         
*/* Common RMF Product Section                                       */         
*/*                                                                  */         
*/********************************************************************/         
*?ERBPRO TYPE(74) ATTRIBUT(BASED(ADDR(SMF74HDR)+SMF74PRS));                     
*%IF IFAR741 = 'YES' %THEN %GO TO LDAT741; /* Subtype 1          @Y1A*/         
*%IF IFAR742 = 'YES' %THEN %GO TO LDAT742; /* Subtype 2          @Y1A*/         
*%IF IFAR743 = 'YES' %THEN %GO TO LDAT743; /* Subtype 3          @B2A*/         
*%IF IFAR744 = 'YES' %THEN %GO TO LDAT744; /* Subtype 4          @C1A*/         
*%IF IFAR745 = 'YES' %THEN %GO TO LDAT745; /* Subtype 5          @E1A*/         
*%IF IFAR746 = 'YES' %THEN %GO TO LDAT746; /* Subtype 6          @H1A*/         
*%IF IFAR747 = 'YES' %THEN %GO TO LDAT747; /* Subtype 7          @I1A*/         
*%IF IFAR748 = 'YES' %THEN %GO TO LDAT748; /* Subtype 8          @L1A*/         
*%IF IFAR749 = 'YES' %THEN %GO TO LDAT749; /* Subtype 9          @62A*/         
*%IF IFAR7410 = 'YES' %THEN %GO TO LDAT7410; /* Subtype 10       @71A*/         
*%LDAT741:;                                /* Subtype 1          @Y1A*/         
*                                                               @SPACE;         
*/********************************************************************/         
*/*                                                                  */         
*/* Relocate blocks for subtype 1 - Monitor I Device Activity Data   */         
*/*                                                                  */         
*/********************************************************************/         
*%INCLUDE SYSLIB(ERBR741);                 /*                    @K1A*/         
*                                                               @SPACE;         
*%IF IFAR742 = 'YES' %THEN %GO TO LDAT742; /* Subtype 2          @Y1A*/         
*%IF IFAR743 = 'YES' %THEN %GO TO LDAT743; /* Subtype 3          @B2A*/         
*%IF IFAR744 = 'YES' %THEN %GO TO LDAT744; /* Subtype 4          @C1A*/         
*%IF IFAR745 = 'YES' %THEN %GO TO LDAT745; /* Subtype 5          @E1A*/         
*%IF IFAR746 = 'YES' %THEN %GO TO LDAT746; /* Subtype 6          @H1A*/         
*%IF IFAR747 = 'YES' %THEN %GO TO LDAT747; /* Subtype 7          @I1A*/         
*%IF IFAR748 = 'YES' %THEN %GO TO LDAT748; /* Subtype 8          @L1A*/         
*%IF IFAR749 = 'YES' %THEN %GO TO LDAT749; /* Subtype 9          @62A*/         
*%IF IFAR7410 = 'YES' %THEN %GO TO LDAT7410; /* Subtype 10       @71A*/         
*%GO TO LEND74;                            /* End of SMF record  @Y1A*/         
*%LDAT742:;                                /* Subtype 2          @Y1A*/         
*                                                               @SPACE;         
*/********************************************************************/         
*/*                                                                  */         
*/* Relocate blocks for subtype 2 - Monitor III XCF Activity Data    */         
*/*                                                                  */         
*/********************************************************************/         
*%INCLUDE SYSLIB(ERBR742);                 /*                    @K1A*/         
*                                                               @SPACE;         
*%IF IFAR743 = 'YES' %THEN %GO TO LDAT743; /* Subtype 3          @B2A*/         
*%IF IFAR744 = 'YES' %THEN %GO TO LDAT744; /* Subtype 4          @C1A*/         
*%IF IFAR745 = 'YES' %THEN %GO TO LDAT745; /* Subtype 5          @E1A*/         
*%IF IFAR746 = 'YES' %THEN %GO TO LDAT746; /* Subtype 6          @H1A*/         
*%IF IFAR747 = 'YES' %THEN %GO TO LDAT747; /* Subtype 7          @I1A*/         
*%IF IFAR748 = 'YES' %THEN %GO TO LDAT748; /* Subtype 8          @L1A*/         
*%IF IFAR749 = 'YES' %THEN %GO TO LDAT749; /* Subtype 9          @62A*/         
*%IF IFAR7410 = 'YES' %THEN %GO TO LDAT7410; /* Subtype 10       @71A*/         
*%GO TO LEND74;                            /* End of SMF record  @B2A*/         
*%LDAT743:;                                /* Subtype 3          @B2A*/         
*                                                               @SPACE;         
*/********************************************************************/         
*/*                                                                  */         
*/* Relocate blocks for subtype 3 - Monitor III OMVS Kernel          */         
*/*                                 Activity Data                    */         
*/*                                                              @B2A*/         
*/********************************************************************/         
*%INCLUDE SYSLIB(ERBR743);                 /*                    @K1A*/         
*                                                               @SPACE;         
*%IF IFAR744 = 'YES' %THEN %GO TO LDAT744; /* Subtype 4          @C1A*/         
*%IF IFAR745 = 'YES' %THEN %GO TO LDAT745; /* Subtype 5          @E1A*/         
*%IF IFAR746 = 'YES' %THEN %GO TO LDAT746; /* Subtype 6          @H1A*/         
*%IF IFAR747 = 'YES' %THEN %GO TO LDAT747; /* Subtype 7          @I1A*/         
*%IF IFAR748 = 'YES' %THEN %GO TO LDAT748; /* Subtype 8          @L1A*/         
*%IF IFAR749 = 'YES' %THEN %GO TO LDAT749; /* Subtype 9          @62A*/         
*%IF IFAR7410 = 'YES' %THEN %GO TO LDAT7410; /* Subtype 10       @71A*/         
*%GO TO LEND74;                            /* End of SMF record  @C1A*/         
*%LDAT744:;                                /* Subtype 4          @C1A*/         
*                                                               @SPACE;         
*/********************************************************************/         
*/*                                                                  */         
*/* Relocate blocks for subtype 4 - Monitor III Coupling Facility    */         
*/*                                 Activity Data                    */         
*/*                                                                  */         
*/********************************************************************/         
*%INCLUDE SYSLIB(ERBR744);                 /*                    @K1A*/         
*                                                               @SPACE;         
*%IF IFAR745 = 'YES' %THEN %GO TO LDAT745; /* Subtype 5          @E1A*/         
*%IF IFAR746 = 'YES' %THEN %GO TO LDAT746; /* Subtype 6          @H1A*/         
*%IF IFAR747 = 'YES' %THEN %GO TO LDAT747; /* Subtype 7          @I1A*/         
*%IF IFAR748 = 'YES' %THEN %GO TO LDAT748; /* Subtype 8          @L1A*/         
*%IF IFAR749 = 'YES' %THEN %GO TO LDAT749; /* Subtype 9          @62A*/         
*%IF IFAR7410 = 'YES' %THEN %GO TO LDAT7410; /* Subtype 10       @71A*/         
*%GO TO LEND74;                            /* End of SMF record  @E1A*/         
*%LDAT745:;                                /* Subtype 5          @E1A*/         
*                                                               @SPACE;         
*/********************************************************************/         
*/*                                                                  */         
*/* Relocate blocks for subtype 5 - Monitor I Cache Subsystem        */         
*/*                                 Activity Data                    */         
*/*                                                                  */         
*/********************************************************************/         
*%INCLUDE SYSLIB(ERBR745);                 /*                    @K1A*/         
*                                                               @SPACE;         
*%IF IFAR746 = 'YES' %THEN %GO TO LDAT746; /* Subtype 6          @H1A*/         
*%IF IFAR747 = 'YES' %THEN %GO TO LDAT747; /* Subtype 7          @I1A*/         
*%IF IFAR748 = 'YES' %THEN %GO TO LDAT748; /* Subtype 8          @L1A*/         
*%IF IFAR749 = 'YES' %THEN %GO TO LDAT749; /* Subtype 9          @62A*/         
*%IF IFAR7410 = 'YES' %THEN %GO TO LDAT7410; /* Subtype 10       @71A*/         
*%GO TO LEND74;                            /* End of SMF record  @H1A*/         
*%LDAT746:;                                /* Subtype 6          @H1A*/         
*                                                               @SPACE;         
*/********************************************************************/         
*/*                                                                  */         
*/* Relocate blocks for subtype 6 - Monitor III HFS Statistics       */         
*/*                                                                  */         
*/********************************************************************/         
*%INCLUDE SYSLIB(ERBR746);                 /*                    @K1A*/         
*                                                               @SPACE;         
*%IF IFAR747 = 'YES' %THEN %GO TO LDAT747; /* Subtype 7          @I1A*/         
*%IF IFAR748 = 'YES' %THEN %GO TO LDAT748; /* Subtype 8          @L1A*/         
*%IF IFAR749 = 'YES' %THEN %GO TO LDAT749; /* Subtype 9          @62A*/         
*%IF IFAR7410 = 'YES' %THEN %GO TO LDAT7410; /* Subtype 10       @71A*/         
*%GO TO LEND74;                            /* End of SMF record  @I1A*/         
*%LDAT747:;                                /* Subtype 7          @I1A*/         
*                                                               @SPACE;         
*/********************************************************************/         
*/*                                                                  */         
*/* Relocate blocks for subtype 7 - Monitor I FICON Director         */         
*/*                                 Statistics                       */         
*/*                                                                  */         
*/********************************************************************/         
*%INCLUDE SYSLIB(ERBR747);                 /*                    @K1A*/         
*                                                               @SPACE;         
*%IF IFAR748 = 'YES' %THEN %GO TO LDAT748; /* Subtype 8          @L1A*/         
*%IF IFAR749 = 'YES' %THEN %GO TO LDAT749; /* Subtype 9          @62A*/         
*%IF IFAR7410 = 'YES' %THEN %GO TO LDAT7410; /* Subtype 10       @71A*/         
*%GO TO LEND74;                            /* End of SMF record  @L1A*/         
*%LDAT748:;                                /* Subtype 8          @L1A*/         
*                                                               @SPACE;         
*/********************************************************************/         
*/*                                                                  */         
*/* Relocate blocks for subtype 8 - Monitor I ESS Statistics     @L2C*/         
*/*                                                                  */         
*/*                                                                  */         
*/********************************************************************/         
*%INCLUDE SYSLIB(ERBR748);                 /*                    @L1A*/         
*%IF IFAR749 = 'YES' %THEN %GO TO LDAT749; /* Subtype 9          @62A*/         
*%IF IFAR7410 = 'YES' %THEN %GO TO LDAT7410; /* Subtype 10       @71A*/         
*%GO TO LEND74;                            /* End of SMF record  @62A*/         
*%LDAT749:;                                /* Subtype 9          @62A*/         
*                                                               @SPACE;         
*/********************************************************************/         
*/*                                                                  */         
*/* Relocate blocks for subtype 9 - Monitor III PCIe Statistics  @62A*/         
*/*                                                                  */         
*/*                                                                  */         
*/********************************************************************/         
*%INCLUDE SYSLIB(ERBR749);                 /*                    @62A*/         
*                                                               @SPACE;         
*%IF IFAR7410 = 'YES' %THEN %GO TO LDAT7410; /* Subtype 10       @71A*/         
*%GO TO LEND74;                            /* End of SMF record  @71A*/         
*%LDAT7410:;                               /* Subtype 10         @71A*/         
*                                                               @SPACE;         
*/********************************************************************/         
*/*                                                                  */         
*/* Relocate blocks for subtype 10 -  Monitor III SCM Statistics     */         
*/*                                                                  */         
*/********************************************************************/         
*%INCLUDE SYSLIB(ERBR7410);                /*                    @71A*/         
*                                                               @SPACE;         
*%LEND74:;                                                                      
