*%ERBSTGST:                         /* GLOBAL SUPERVISOR TABLE       */         
*  MACRO                                                                        
*        KEYS(                                                                  
*              ATTRIBUT             /* ATTRIBUTES OF THE STRUCTURE              
*                                      PRODUCED BY THIS MACRO. (THE             
*                                      BOUNDARY ATTRIBUTE IS APPENDED           
*                                      TO IT.)                       */         
*            );                                                                 
* /* BILINGUAL (MAPPING) MACRO                                                  
         MACRO                                                                  
&STGSLBL ERBSTGST                                                               
*                                                                               
**/  BLOCKANSWER SKIP COLUMN(2);                                                
*'/* START OF SPECIFICATIONS ****************************************/'         
*'/*01* PROPRIETARY STATEMENT=                                      */'         
*'/*                                                            @61C*/'         
*'/*    LICENSED MATERIALS - PROPERTY OF IBM                    @61C*/'         
*'/*    "RESTRICTED MATERIALS OF IBM"                           @61C*/'         
*'/*    COPYRIGHT IBM CORP. 1977, 2022                      @OA63190*/'         
*'/*                                                            @61A*/'         
*'/*    STATUS: z/OS V2R5 Data Gatherer (HRG77D0)                   */'         
*'/*                                                                */'         
*'/*01* DESCRIPTIVE_NAME:  RMF Global Supervisor table              */'         
*'/*02*  ACRONYM:  STGST                                            */'         
*'/*                                                                */'         
*'/*01* MACRO-NAME:  ERBSTGST                                       */'         
*'/*                                                                */'         
*'/*01* DSECT NAME:  "STGST", if used from PL/X.                    */'         
*'/*                 Contents of name field, if used from           */'         
*'/*                 ASSEMBLER.                                     */'         
*'/*                                                                */'         
*'/*01* COMPONENT:  zOS Data Gatherer (27401)                       */'         
*'/*                                                                */'         
*'/*01* EYE-CATCHER:  STGS                                          */'         
*'/*02*  OFFSET:  0                                                 */'         
*'/*02*  LENGTH:  4                                                 */'         
*'/*                                                                */'         
*'/*01* STORAGE ATTRIBUTES:                                         */'         
*'/*02*  SUBPOOL:  245 (ESQA)                                       */'         
*'/*02*  KEY:      0                                                */'         
*'/*02*  RESIDENCY:  ANY (above 16 MB boundary)                     */'         
*'/*02*  MAIN STORAGE:  fixed                                       */'         
*'/*02*  AUXILIARY STORAGE: N/A                                     */'         
*'/*02*  VIRTUAL STORAGE:  N/A                                      */'         
*'/*                                                                */'         
*'/*01* SIZE: see Assembler listing                             @D1C*/'         
*'/*                                                                */'         
*'/*01* CREATED BY:                                                 */'         
*'/*     GRBMFMFC                                                   */'         
*'/*                                                                */'         
*'/*01* POINTED TO BY:                                              */'         
*'/*     CVTMFCTL field of data area CVT                            */'         
*'/*                                                                */'         
*'/*01* SERIALIZATION:                                              */'         
*'/*     Not provided                                               */'         
*'/*                                                                */'         
*'/*01* FUNCTION:                                                   */'         
*'/*02*  Mapping macro for the STGST. It contains RMF data          */'         
*'/*     which must be fixed or be accessible from any address      */'         
*'/*     space.                                                     */'         
*'/*                                                                */'         
*'/*01* METHOD OF ACCESS:                                           */'         
*'/*02*  ASM:                                                       */'         
*'/*      label ERBSTGST                                            */'         
*'/*        where the optional label provides a DSECT by the same   */'         
*'/*        name.                                                   */'         
*'/*                                                                */'         
*'/*02*  PL/X:                                                      */'         
*'/*      .question mark.ERBSTGST ATTRIBUT(attributes)              */'         
*'/*        where attributes are any acceptable PL/X attributes     */'         
*'/*        for structure declarations.                             */'         
*'/*                                                                */'         
*'/*01* MODULE-TYPE: Bilingual mapping macro                        */'         
*'/*                                                                */'         
*'/*01* STATUS: see above                                       @93C*/'         
*'/*                                                                */'         
*'/*01* DELETED BY: N/A                                             */'         
*'/*                                                                */'         
*'/*01* FREQUENCY: 1                                                */'         
*'/*                                                                */'         
*'/*01* DEPENDENCIES: None                                          */'         
*'/*                                                                */'         
*'/*01* DISTRIBUTION LIBRARY: AGRBMAC1                      @OA63190*/'         
*'/*                                                                */'         
*'/*01* CHANGE ACTIVITY:                                            */'         
*'/*                                                                */'         
*'/* $LC=ENQGRS,HRM2405,,TSG: Support for GRS (RMF 2.4.0)       @LCA*/'         
*'/* $N1=MON1,HRM3102,,FLS: RMF 3.1 Monitor I enhancements      @N1A*/'         
*'/* $N4=MON1,HRM3102,,FLS: RMF 2.4.1 PTM PQQ0014 in RMF 3.1@PQQ0014*/'         
*'/* $N2=MON1,HRM3102,,SHR: I/O queuing activity support        @N2A*/'         
*'/* $N3=MON1,HRM3102,,OST: ERBCNFGC/R IOQ activity support     @N3A*/'         
*'/* $M1=MONIIIC,HRM3202,,SAG: MONITOR III support              @M1A*/'         
*'/* $V1=VSTOR,HRM3202,,RB: Virtual storage report              @V1A*/'         
*'/* USE A RESERVED BYTE FOR A COUNT OF THE SKIPPED SAMPLES @ZA75097*/'         
*'/* $O1=4381SP,JRM3212,,SHR: 4381 - support                    @O1A*/'         
*'/* $P1=IOMLSP,HRM3302,,SHR: Remove I/O measurement level const@P1A*/'         
*'/* $P2=ES,HRM3302,,CIH: SP2.2 Extended storage                @P2A*/'         
*'/* $P3=OPTEX,HRM3302,,WEY: Expansion of the IOQ option        @P3A*/'         
*'/* $P4=DAE,HRM3302,,THE: DAE service                          @P4A*/'         
*'/* $P5=MISC,HRM3302,,SHR: Avoid duplicate use of CMB slots    @P5A*/'         
*'/* $U1=SGSUP,jrm3512,,FDL: Storage Group Support              @U1A*/'         
*'/* $W1=OY91297,HRM4410,,FRY: Synchronize termination          @W1A*/'         
*'/* $W2=PLAS,HRM4410,,FRY: PLAS conversion                     @W2A*/'         
*'/* $W3=RCLS,HRM4410,,SHR: Implementation of collector service @W3A*/'         
*'/* $W4=MISC,HRM4410,,THE: Corrects APAR ZA79094.              @W4A*/'         
*'/* $X0=OY11330,HRM4410,,WRC: PR/SM support                    @X0A*/'         
*'/* $W5=SMF,JRM4411,,BHL: SMF record 72                        @W5A*/'         
*'/* $Y2=DYNRES,HRM4420,,BB: Dynamic resource manager           @Y2A*/'         
*'/* $Z1=OY29112,HRM4420,,WRC: ESCA basis                       @Z1A*/'         
*'/* $Z2=OY29112,HRM4420,,WRC: Serial & Switch Support          @Z2A*/'         
*'/* $A1=DYNIO,JRM4421,,RV: Dynamic I/O Support                 @A1A*/'         
*'/*  WB: ABEND 0C4, corrects number of DDBs                @YA57961*/'         
*'/* $B1=RTIME,HRM4430,,BHL: Response time support              @B1A*/'         
*'/* $B2=R430,HRM4430,,RV: Dynamic I/O Consolidation            @B2A*/'         
*'/* $B3=SYNC,HRM4430,,GBO: Synchronize Measurements            @B3A*/'         
*'/* WB: ABEND 0C1 in ERBMFEAX when issuing the ACTIVATE            */'         
*'/*        command                                         @YA58324*/'         
*'/* HWG: Improves serialization between ERBMFTMA and       @YA56222*/'         
*'/*      ERBMFPVS (SRB-routine)                            @YA56222*/'         
*'/* HWG: Matches Assembler and PL/X part.                  @YA64112*/'         
*'/* WBA: ABEND 0C4 in ERBMFDCQ after activate of dynamic           */'         
*'/*      reconfiguration change.                           @YA63501*/'         
*'/* $C1=RSDS,HRM4440,,DK: RMF Sysplex Data Server              @C1A*/'         
*'/* $C2=WLM,HRM4440,,GBO: MVS Workload Manager support         @C2A*/'         
*'/* $C3=ESYNC,HRM4440,,GBO: Synchronized Measurements Stage 2  @C3A*/'         
*'/* $C4=WLM,HRM4440,,BHL: MVS Workload Manager support         @C4A*/'         
*'/* $C5=R510,HRM5510,,PFU: KRO0012 Reuse LX value              @C5A*/'         
*'/* LAN: Save CHSC command code at initialization phase    @YA60574*/'         
*'/* $D1=OEM,HRM5520,,GBO: Seperate Gatherer/Reporter           @D1A*/'         
*'/* SHR: Allows for SMF records 78, subtype 3, when        @WA04821*/'         
*'/*      running under VM/ESA                              @WA04821*/'         
*'/* HUE: introduce FRR recovery logic for cycle gatherers  @WA13001*/'         
*'/* SHR: Provides LCU numbers for dedicated devices when   @WA12872*/'         
*'/*      running under VM                                  @WA12872*/'         
*'/* $E1=GRS,HRM6602,,PFU: GRS Star support                     @E1A*/'         
*'/* $E2=PED,HRM6602,,SUW: OS/390 Product Enable/Disable        @E2A*/'         
*'/* HBE: Prevents M2 from gathering inconsistent M1 data   @WA18557*/'         
*'/* SHR: Adaptation to GRS changes                         @WA20587*/'         
*'/* $E3=MISC,HRM6603,,HOL: Monitor II Library List Support     @E3A*/'         
*'/* $F1=MISC,HRM6604,,AJU: Correct DS option proc. of RTY,STY  @F1A*/'         
*'/* FDL: Synchronizes Mon. I and Mon. III when accessing   @WA29318*/'         
*'/*      repository queues within ENQ dataspace ERBENQDS   @WA29318*/'         
*'/* $G1=CF,HRM6606,,FDL: RMF data server master status         @G1A*/'         
*'/* $G2=CACHE,HRM6606,,THE:  Real Hardware CUID                @G2A*/'         
*'/* $G3=MISC,HRM6606,,FDL: Serialize Dynamic I/O Update        @G3A*/'         
*'/*                        (FIN apar OW30536)                  @G3A*/'         
*'/* $G4=MISC,HRM6606,,GUB: Year 2000 sliding window support    @G4A*/'         
*'/*                        for IODF creation date                  */'         
*'/* $I1=FCD,HRM7703,,SHR: FICON director support               @I1A*/'         
*'/* $I2=XSVC,HRM7703,,SHR: Replaces extended SVC routines      @I2A*/'         
*'/* $I3=DCM,HRM7703,,SHR: Dynamic CHPID Management support     @I3A*/'         
*'/* FDL: Improves cache data gathering performance         @WA42945*/'         
*'/* SHR: Quasi-ENF-33 listen exit and PAV enhancements     @WA46171*/'         
*'/* $J1=CRYPTO,HRM7705,,DAG: Crypto hardware support           @J1A*/'         
*'/* $J2=IOP,HRM7705,,SHR: IOP utilization support              @J2A*/'         
*'/* $K1=XMP,HRM7708,,PS: T-Rex Support                         @K1A*/'         
*'/* $K2=XMP,HRM7708,,PS: T-Rex Support exploitation            @K2A*/'         
*'/* FDL: Adds STGSEVWP pointer to ERBMFEVT work area       @OA04812*/'         
*'/*      Adds STGSLKLV link stack level for ERBMFEVT       @OA05197*/'         
*'/* FDL: Adds ficon-cascaded-switch facility indicator     @OA06258*/'         
*'/* $L1=MSTR,HRM7720,,WLR: Storage values for MASTER ASID      @L1A*/'         
*'/* GUB: PTero support                                     @OA07950*/'         
*'/* $01=OMI,HRM7730,,HBE: Automatic DDS startup                @01A*/'         
*'/* $11=IQD3,HRM7740,,SHR: New Monitor III I/O queuing         @11A*/'         
*'/*                        gatherer                            @11A*/'         
*'/* $12=DET,HRM7740,,HBE: Backlevel RMF release detection      @12A*/'         
*'/*  PS: Leap seconds >=0 & <=50s                          @OA23138*/'         
*'/* $31=G64CPU,HRM7760,,GUB: Greater than 64 CPU support       @31A*/'         
*'/* $41=WLMCEC,HRM7770,,GUB: CEC adjustment factor             @41A*/'         
*'/*  PS: Synchronization ABNDEXIT in MFMFC and ERBMFCEQ    @OA29496*/'         
*'/* $42=MISC,HRM7770,,PS: Serialization MFROUTER (ERBMFEVT)    @42A*/'         
*'/*                       and ERBMFTMA FIN APAR OA29969        @42A*/'         
*'/*  PS: Fixes probable SPIN loop for cycle gatherer       @OA32719*/'         
*'/* $61=R790,HRM7790,,PS: EXPLICIT COPYRIGHT FOR EXT. MACRO    @61A*/'         
*'/*  JK: Interrupt Delay Time Support                      @OA39993*/'         
*'/* $62=MISC,HRM7790,,PS: Fixes wrong rejection of devices     @62A*/'         
*'/*                       in ERBMFDDP PMR 91541,000,672        @62A*/'         
*'/* $63=SSID,HRM7790,,PS: NON-PAV Alias devices in             @63A*/'         
*'/*                       alternate subchannel set             @63A*/'         
*'/*  PS: Using private fixed storage for LINKAGE(BRANCH)   @OA42068*/'         
*'/* $71=MT2,OA44101,,RRe: MT-2 support                         @71A*/'         
*'/* $72=XDF,HRM77A0,,PS: zHPF Extended Distance Support        @72A*/'         
*'/* $81=zHW2,HRM77B0,,JKu: zHyperwrite Stage 2                 @81A*/'         
*'/*  PS: Adds Utility-string facility bit                  @OA51808*/'         
*'/* $91=TNT,OA52694,,JKU: Metering and Capping Stage 3         @91A*/'         
*'/* $92=64Bit,HRM77C0,,MWe: 64-bit support                     @92A*/'         
*'/* $93=CRY,OA54952,,MAI: Crypto Domain Support                @93A*/'         
*'/* $94=Cmpr,OA56684,,JBa: EADM Compression support            @94A*/'         
*'/* $95=BOOT,OA56683,,JDO: Fast boot support                   @95A*/'         
*'/* $A01=Split,OA58759,,UMu: RMF Product Split                @A01A*/'         
*'/*  PS: Adds SCM facility bit                             @OA58725*/'         
*'/* $A02=CFOPT,HRG77D0,,PMu: Enhance RMF Master concept for   @A02A*/'         
*'/*                          CF data gathering                @A02A*/'         
*'/* $A03=ZOSB,HRG77D0,,JBa: Rename prefix ERB to GRB          @A03A*/'         
*'/* $A04=ZOSB,HRG77D0,,JDo: New licensing model               @A04A*/'         
*'/* UMu: zDG support for Wazi                              @OA63190*/'         
*'/*                                                                */'         
*'/* END OF SPECIFICATIONS ******************************************/'         
*    ENDANSWER;                     /*                                          
&STGSLBL DSECT ,                    START OF GLOBAL SUPERVISOR TABLE            
         DS    0D                   Doubleword boundary            @W1C         
STGSNAME DS    CL4'STGS'            TABLE NAME FOR DUMP IDENTIFICATION          
STGSSCT  DS    A                    ADDRESS OF SCT                              
STGSTCB  DS    A                    ADDRESS OF RMF MAINLINE TCB                 
STGSASID DS    AL2                  RMF ASID                                    
STGSBITS DS    CL1                  RMF global bits                @W4C         
STGSUBIT EQU   X'80'                User exit on                   @W4A         
STGSSBIT EQU   X'40'                SET command issued             @W4A         
STGSGCYC EQU   X'20'                ZZ session, cycle gatherer active           
*                                                                  @W4A         
STGSGINO EQU   X'10'                ZZ session, interval/event gatherer         
*                                   only                           @W4A         
STGSGINA EQU   X'08'                ZZ session, interval gatherer               
*                                   active flag (set by GRBMFDTA)  @I2C         
*                                   X'04' - X'01' not used     @WA18557         
STGSLOCK DS    CL1                  TARGET OF TEST-AND-SET TO SERIALIZE         
*                                   TIMER-DRIVEN SAMPLERS AND INTERVAL          
*                                   INTERVAL MEASUREMENT GATHERERS.             
*                                   (GRBMFEVT AND GRBMFDTS)        @I2C         
STGSMMV  DS    A                    ADDRESS OF MFROUTER VECTOR TABLE            
STGSCYC  DS    2F                   SAMPLING CYCLE INTERVAL, BIT 51             
*                                         IS ONE MICROSECOND                    
STGSUSER DS    A                   USER WORD NUMBER ONE    @G527NJW             
STGSUSE2 DS    A                   USER WORD TWO           @G527NJW             
STGSNSKP DS    CL1                 NUM OF SKIPPED SAMPLES DUE TO                
*                                  UNAVAILABLE LOCK            @ZA75097         
****************************************************************** @C1C         
STGSVER  DS    CL1                 STGST Version                   @C1A         
STGCVER  EQU   X'03'               STGST Version for HRM77C0       @92C         
STGSLEN  DS    CL2                 STGST Length                    @C1A         
****************************************************************** @C1A         
STGCSFLG DS    XL4                 Compare and Swap word containing             
*                                  flags to serialize GRBMFPVS or               
*                                  or GRBMFCLS with GRBMFTMA.      @31C         
         ORG   STGCSFLG            describe in more detail     @YA64112         
         DS    XL1                 not used (part of CS word)  @YA64112         
STGCSSRB EQU   X'80'               SRB routine running         @YA64112         
STGCSTER EQU   X'40'               Termination activated       @YA64112         
STGCSNSR EQU   X'20'               no SRB routine expected     @YA64112         
STGCSSNC EQU   X'10'               1 = SRB has been scheduled and has           
*                                  not yet completed execution @YA64112         
STGCSCLS EQU   X'08'               GRBMFCLS running                @31A         
STGCSCEQ EQU   X'04'               GRBMFCEQ running            @OA29496         
         DS    XL3                 not used (part of Compare and Swap           
*                                            word)             @YA64112         
STGSEUC  DS    A                   POINTER TO USER SAMPLER @G527NJW             
STGSDCBA DS    A                   ADDR OF MESSAGE DATA SET DCB    @N1A         
STGSIOCH DS    A                   POINTER TO IOCHT                @N1A         
*                                  Not used anymore, see STGSIOCH64@92C         
STGSIODN DS    A                   POINTER TO IODNT                @N3A         
*                                  Not used anymore, see STGSIODN64@92C         
STGSIOCT DS    A                   POINTER TO LCUT                 @N1A         
*                                  Not used anymore, see STGSIOCT64@92C         
STGETRML DS    CL4                 LOCAL TERMINATION BYTE          @LCA         
STGETRMG DS    CL4                 GLOBAL TERMINATION BYTE         @LCA         
*                                                                  @LBA         
STGSCPU  DS    A                       CPU DATA ADDRESS - NOT USED              
*                                      ANYMORE, SEE STGSCPU64      @92C         
STGSCHAN DS    A                       CHANNEL DATA ADDRESS - NOT USED          
*                                      ANYMORE, SEE STGSCHA64      @92C         
STGSDEV  DS    A                       DEVICE DATA ADDRESS - NOT USED           
*                                      ANYMORE, SEE STGSDEV64      @92C         
STGSPAG  DS    A                       PAGING DATA ADDRESS - NOT USED           
*                                      ANYMORE, SEE STGSPAG64      @92C         
STGSPGSP DS    A                       PAGE SPACE DATA ADDR - NOT USED          
*                                      ANYMORE, SEE STGSPGS64      @92C         
                                                                                
STGSENQ  DS    A                       ENQ data address is no      @E1C         
*                                      longer used, the ENQ data   @E1C         
*                                      structure is now located    @E1C         
*                                      in private storage          @E1C         
STGSWKLD DS    A                       WKLD DATA ADDRESS           @LBA         
STGSTRC  DS    A                       TRACE DATA ADDRESS -NOT USED             
*                                      ANYMORE, SEE STGSTRC64      @92C         
STGSIOQ  DS    A                       I/O QUEUING DATA ADDRESS    @N2A         
STGSVSTG DS    A                       VIRTUAL STORAGE DATA ADDR   @V1A         
*                                                                  @LBA         
STGSCPUF DS    XL1                     CPU OPTIONS                 @LBA         
STGSCHNF DS    XL1                     CHANNEL OPTIONS             @LBA         
STGSDEVF DS    XL1                     DEVICE OPTION FLAGS         @LBA         
STGSTAPE EQU   X'80'                   MAGNETIC TAPE DEVICE        @LBA         
STGSTP   EQU   X'40'                   COMMUNICATION DEVICE        @LBA         
STGSDA   EQU   X'20'                   DIRECT ACCESS DEVICE        @LBA         
STGSGRAP EQU   X'10'                   GRAPHICS DEVICE             @LBA         
STGSUNIT EQU   X'08'                   UNIT RECORD DEVICE          @LBA         
STGSCRDR EQU   X'04'                   CHARACTER READER DEVICE     @LBA         
STGSDVSO EQU   X'02'                   DEVICE SELECTIVITY OPTION   @N1A         
STGSSGSO EQU   X'01'                   SG SELECTIVITY OPTION       @U1A         
STGSPAGF DS    XL1                     PAGING OPTIONS              @LBA         
STGSPGSF DS    XL1                     PAGE SPACE OPTIONS          @LBA         
STGSENQF DS    XL1                     ENQ OPTIONS                 @LBA         
STGSWKLF DS    XL1                     WKLD OPTIONS                @LBA         
STGSTRCF DS    XL1                     TRACE OPTIONS               @LBA         
STGSIOQF DS    XL1                     IOQ OPTIONS                 @N2A         
STGSITAP EQU   X'80'                   MAGNETIC TAPE DEVICE        @P3A         
STGSITP  EQU   X'40'                   COMMUNICATION DEVICE        @P3A         
STGSIDA  EQU   X'20'                   DIRECT ACCESS DEVICE        @P3A         
STGSIGRA EQU   X'10'                   GRAPHICS DEVICE             @P3A         
STGSIUNI EQU   X'08'                   UNIT RECORD DEVICE          @P3A         
STGSICRD EQU   X'04'                   CHARACTER READER DEVICE     @P3A         
STGSLCSO EQU   X'02'                   LCU SELECTIVITY OPTION      @P3A         
STGSVSTF DS    XL1                     VIRTUAL STORAGE OPTIONS     @V1A         
STGSHSSD DS    XL1                 Highest available subchannel    @63A         
*                                  set in the system               @63A         
STGSGEF2 DS    CL1                 Global I/O environment      @OA58725         
*                                  flag 2                      @OA58725         
STGSSCMF EQU   X'80'               Storage-class-memory-       @OA58725         
*                                  measurement facility        @OA58725         
STGSSAMP DS    F                       INTERVAL SAMPLE COUNT       @LBA         
STGSMINT DS    F                   Projected interval length in    @B3C         
*                                  Seconds/100 units               @B3C         
STGSITIM DS    F                   Interval start time after       @B3C         
*                                  midnight in Sec/100 units       @B3C         
*                   MONITOR III SECTION                            @M1A         
STGGSTPT DS    A                   PTR TO MONITOR III GLOBAL       @M1A         
*                                  STORAGE TABLE EXTENSION         @M1A         
*        4 ENQ related definitions no longer used                  @E1D         
         DS    CL24                Reserved for future use         @E1C         
*                   MISCELLANEOUS DEFINITIONS                      @O1A         
STGSLWM  DS    F                   LOW WATER MARK FOR VSTOR        @V1A         
STGSELWM DS    F                   LOW WATER MARK ABOVE 16M        @V1A         
STGSIOML DS    CL1                     I/O MEASUREMENT LEVEL       @O1A         
STGSBFLS DS    CL1                 PR/SM flags                     @Z1C         
STGSBYMN EQU   X'80'               Indicates PR/SM machine         @Z1C         
STGSAIDA EQU   X'40'               Indicates ESCA processor        @Z1A         
STGSSERE EQU   X'20'               Indicates Serial enabled mach   @Z2A         
STGSSWCH EQU   X'10'               Indicates switch in confign.    @Z2A         
STGSNOCH EQU   X'08'               CHSC RC 4 and AIDA ON       @YA58324         
STGSVM   EQU   X'04'               Running as guest under z/VM @OA63190         
STGSDCMH EQU   X'02'               DCM supported by hardware       @I3A         
STGSDCMD EQU   X'01'               Configuration contains DCM      @I3A         
*                                  managed channels                @I3A         
STGSPRTN DS    CL1                 PR/SM Partition number          @Y1C         
STGSGENF DS    CL1                 Global I/O environment flags    @K1C         
STGSGCMR EQU   X'80'               1 = Initial-command-response-   @K1A         
*                                  measurement facility supported  @K1A         
STGSGESQ EQU   X'40'               1 = Extended I/O-measurement-   @K2A         
*                                  block facility supported        @K2A         
STGSFCCS EQU   X'20'               1 = Ficon-cascaded-switch   @OA06258         
*                                  facility supported          @OA06258         
STGSGIDT EQU   X'10'               1 = Interrupt-delay-time-   @OA39993         
*                                  facility supported          @OA39993         
STGSGMSS EQU   X'08'               1 = Multiple-subchannel-set     @63A         
*                                  facility supported              @63A         
STGSGES2 EQU   X'04'               1 = Extended I/O-measurement-   @72A         
*                                  block 2 supported               @72A         
STGSUTST EQU   X'02'               1 = Utility-string facility                  
*                                  supported                   @OA51808         
STGSECPR EQU   X'01'               1 = EADM-compression-measurements            
*                                  facility supported              @94A         
STGESSL  DS    F                   NUMBER OF EXTENDED STORAGE      @P2A         
*                                  SLOTS INSTALLED                 @P2A         
STGSDAE  DS    A                   ADDRESS OF MODULE AND           @P4A         
*                                  CSECT NAME FOR DAE SERVICE      @P4A         
         DS    A                   Reserved                        @C4D         
STGSCLD  DS    A                   Address of collector data       @W3A         
STGSTESY DS    D                   Doubleword for termina-         @W1A         
*                                    tion/synchronization M I      @W1A         
STGSINTL DS    F                   Length of Monitor I interval                 
*                                  or zero, if Monitor I is not                 
*                                  active                          @W5A         
STGSSYNV DS    F                   SYNC minute value               @W5A         
STGSSYNF DS    0F                  SYNC information                @B3C         
STGSSYRM DS    C                   SYNC(RMF) flag                  @B3A         
STGSSYNC EQU   X'80'               1... .... =ON SYNC(RMF,nn)      @B3A         
STGSSOPT DS    AL1                 Sync option from M I            @B3A         
*                                  options (option constants                    
*                                  declared below)                              
         DS    CL2                 Reserved                        @B3A         
STGSSNOP EQU   0                   0 = No M I Sync option active   @B3A         
STGSSSMF EQU   1                   1 = SYNC(SMF)                   @B3A         
STGSSRNO EQU   2                   2 = NOSYNC                      @B3A         
STGSSRMF EQU   3                   3 = SYNC(RMF)                   @B3A         
*                                                                               
STGSSRMC DS    F                   SRM command count               @W5A         
STGSTOKN DS    F                   Resource manager token          @Y2A         
*                   Dynamic I/O Extension                                       
         DS    0F                  Doubleword Boundary                          
STGSTES3 DS    F                   Termination Synchronization     @A1A         
*                                  for M III Listen Exits                       
STGSSLET DS    A                   Pointer to Listen Exit Table    @A1A         
STGSFIOC DS    A                   Address of GRBMFIOC             @A1A         
STGSFBSR DS    A                   Address of GRBMFBSR            @A01C         
STGSFLXP DS    A                   Address of GRBMFLXP             @A1A         
STGSFSCS DS    A                   Address of GRBMFSCS             @A1A         
STGSNFGR DS    A                   Address of GRBCNFGR             @A1A         
*                                  Initialization Processing Flags @A1A         
STGSDCFL DS    CL1                 Dynamic I/O Update Flags        @A1A         
*                                  .1.. ....    (STGSDYN del.) @WA42945         
STGSIAC  EQU   X'20'               ..1. .... =ON Configuration     @A1A         
*                                       changed since last IPL     @A1A         
STGSDYNA EQU   X'10'               ...1 .... =ON Dyn. I/O enabled  @A1A         
STGSIOD  EQU   X'08'               .... 1... =ON IPL via IODF      @A1A         
STGSICIV EQU   X'04'               .... .1.. =ON IODF Info valid   @A1A         
STGSDCA  EQU   X'02'               .... ..1. =ON Conf. changed     @A1A         
STGSINHB EQU   X'01'               .... ...1 =ON M I Dev/I/O Q_ing @A1A         
*                                                Option inhibited  @A1A         
STGSCNFL DS    CL1                 Configuration Table Build Flags @A1A         
STGSCNIN EQU   X'80'               1... .... =ON Table Build       @A1A         
*                                                in progress       @A1A         
STGSCNRI EQU   X'40'               .1.. .... =ON Reinitialization  @A1A         
*                                                required          @A1A         
STGSCNUP EQU   X'20'               ..1. .... =ON Table Update      @A1A         
*                                                in progress       @A1A         
STGSCNTR EQU   X'10'               ...1 .... =ON Table Delete      @A1A         
*                                                in progress       @A1A         
*                                  ..11 1111 reserved              @A1A         
STGSDVFL DS    CL1                 Device Table Build Flags        @A1A         
STGSDVIN EQU   X'80'               1... .... =ON Device Initial.   @A1A         
*                                                in progress       @A1A         
STGSDVRI EQU   X'40'               .1.. .... =ON Reinitialization  @A1A         
*                                                required          @A1A         
*                                  ..1. .... =ON SMF record 74 @YA57961         
*  NOT LONGER USED                               length changed    @A1A         
*                                  ..11 1111 Reserved          @YA57961         
STGSIOFL DS    CL1                 I/O Queueing Table Build Flags  @A1A         
STGSIOIN EQU   X'80'               1... .... =ON I/O Q_ing Init.   @A1A         
*                                                in progress       @A1A         
STGSIORI EQU   X'40'               .1.. .... =ON Reinitialization  @A1A         
*                                                required          @A1A         
*                                  ..1. .... =ON SMF Record 78 @YA63501         
*  NOT LONGER USED                               length changed    @A1A         
*                                  ..11 1111 reserved          @YA63501         
STGS3DFL DS    CL1                 Monitor 3 Device Table Build    @A1A         
STGS3DIN EQU   X'80'               1... .... =ON Device Initial.   @A1A         
*                                                in progress       @A1A         
STGS3DRI EQU   X'40'               .1.. .... =ON Reinitialization  @A1A         
*                                                required          @A1A         
*                                  ..11 1111 reserved              @A1A         
STGS3QFL DS    CL1                 M3 I/O queuing structure build  @11A         
STGS3QIN EQU   X'80'               1... .... =ON I/O queuing init. @11A         
*                                                in progress       @11A         
STGS3QRI EQU   X'40'               .1.. .... =ON Reinitialization  @11A         
*                                                required          @11A         
STGS3QRD EQU   X'20'               ..1. .... =ON I/O queuing       @11A         
*                                                restart due to    @11A         
*                                                dynamic I/O       @11A         
*                                  ...1 1111 Reserved              @11A         
         DS    CL2                 reserved bytes                  @11C         
STGSUPCT DS    CL2                 Reserved                        @62C         
*                                  I/O Configuration Inform. Area  @A1A         
STGSTNM  DS    CL44                IODF Name                       @A1A         
STGSTSF  DS    CL2                 Suffix of IODF Name             @A1A         
STGSTSX  DS    CL2                 Suffix set by GRBMFEAX          @A1A         
STGSTDT  DS    CL8                 IODF creation date              @A1A         
STGSTTM  DS    CL8                 IODF creation time              @A1A         
STGSTY1  DS    CL2                 First two bytes of IODF creation             
*                                  date YYyy/mm/dd                 @G4C         
STGSENF  DS    F                   ENF Synchronization Lock        @B2M         
STGSDCS  EQU   X'80'               1... .... =ON GRBLXDCS active   @B2M         
STGSDIO  EQU   X'40'               .1.. .... =ON Dynamic I/O       @B2M         
*                                       update in progress (LXDIO) @B2M         
*                                                                  @B2C         
         DS    CL1                 Reserved for later use          @B1A         
STGSIZZA EQU   X'80'               Monitor I initialization GRBMFIZZ            
*                                  is active for the first time. @B1A           
STGSCHFL DS    XL1                 CHSC support flags          @WA04821         
STGSCSCL EQU   X'80'               1 = Store Channel Path Link Address          
*                                  not supported               @WA04821         
STGSCSSL EQU   X'40'               1 = Store Subchannel Link Address            
*                                  not supported               @WA04821         
STGSCSSC EQU   X'20'               1 = Store Subchannel Control Unit            
*                                  Data not supported          @WA04821         
STGSCSPQ EQU   X'10'               1 = Store Primary Queue Data not             
*                                  supported                   @WA04821         
STGSCSSQ EQU   X'08'               1 = Store Secondary Queue Data not           
*                                  supported                   @WA04821         
STGSCSIU EQU   X'04'               1 = Store IOP utilization data not           
*                                  supported                       @J2A         
         DS    CL2                 Reserved                    @WA04821         
*        ECB addresses, related to SRM SET command processing                   
         DS    A                   Reserved                        @C4D         
         DS    A                   Reserved                        @C4D         
         DS    A                   Reserved                        @C4D         
*        Start and end address of IRARMWAR for page free                        
         DS    A                   Reserved                        @C4D         
*        Cache configuration change control (M1/M3)            @WA42945         
STGSCCC  DS    0F                  Cache configuration control @WA42945         
STGSCCCF DS    XL1                 Cache configuration change  @WA42945         
STGSCDY1 EQU   X'80'               1... .... =ON DYN I/O update    @G2A         
*                                                (M1)  (moved) @WA42945         
STGSCDY3 EQU   X'40'               .1.. .... =ON DYN I/O update    @G2A         
*                                                (M3)          @WA42945         
STGSCDV1 EQU   X'20'               ..1. .... =ON Device became online           
*                                                (for M1)      @WA42945         
STGSCDV3 EQU   X'10'               ...1 .... =ON Device became online           
*                                                (for M3)      @WA42945         
         DS    CL3                 Reserved for cache control  @WA42945         
*                                                                               
*        Extension for Synchronize Measurements                    @B3A         
STGSSYME DS    0F                                                               
STGSSCCE DS    F                   ECB to communicate SMF          @B3A         
*                                  interval end from SMF listen                 
*                                  exit to interval control                     
STGSMFIE DS    CL8                 GMT SMF interval expiration     @B3A         
*                                  token - STCK format                          
*                                                                               
STGSDCNE DS    F                   ECB to communicate Monitor 1    @B3A         
*                                  (in)active to interval control               
*                                                                               
STGSCDIE DS    F                   ECB for communicating interval  @B3A         
*                                  end from Interval control to                 
*                                  Monitor I                                    
*                                                                               
         DS    CL36                Reserved                        @C3C         
*                                  16 Lines deleted              16@C3D         
*                                                                               
         DS    CL36                Reserved                        @C3C         
*                                  16 Lines deleted              16@C3D         
*                                                                               
STGS1I   DS    0F                  Information about last          @B3A         
*                                  Monitor I Interval                           
STGS1IET DS    CL8                 Interval expiration time token  @B3A         
STGS1FLA DS    C                   M I interval flag bits          @B3A         
STGS1ISC EQU   X'80'               M I interval was completely     @B3A         
*                                  under SMF control                            
         DS    CL3                 Reserved                        @B3A         
*                                                                               
*                                                                               
STGSLSMF DS    C                   SMF Listen exit flags           @B3A         
STGSLXSI EQU   X'80'               1... .... Listen exit inactive  @B3A         
STGSLSMI EQU   X'40'               .1.. .... SMF signal: inactive  @B3A         
*                                                                               
*        RMF Address space information                                          
STGSGRMF DS    0C                  Info about RMF address space    @C2A         
STGSGFLG DS    CL1                 RMF global flags                @C3A         
STGSGTER EQU   X'80'               RMF is terminating (P RMF)      @C3A         
STGSATER EQU   X'40'               RMF is abnormally terminating   @E1A         
STGSNEGP EQU   X'20'               No ENQ contention data due to GRS            
*                                  system problems             @WA20587         
STGSDDS  EQU   X'10'               DDS option specified            @01A         
STGSBLVL EQU   X'08'               Backlevel RMF release           @12A         
STGSCFOPT EQU  X'04'               CFOPT option specified         @A02A         
*                                                                               
STGSRREL DS    CL2                 Release of RMF                  @C3A         
*                                                                               
         DS    F                   Reserved (was STGSEOIC)         @C3C         
*                                                                               
*                                                                               
STGSASCP DS    A                   Pointer to RMF's own                         
*                                  ASCB control block                           
*                                  (0, if RMF inactive)            @B3A         
STGSSTTI DS    CL8                 Starttime of RMF control                     
*                                  address space, taken from                    
*                                  ASCBINTS field                               
*                                  (0, if RMF inactive)            @B3A         
*                                                                               
*                                                                               
STGRMFST DS    CL8                 RMF Address Space Space Token   @C2A         
*                                                                               
*        Sysplex Data Server                                                    
*                                                                               
STGSDSGD DS    A                   Pointer to RMF Sysplex Data Server           
*                                  Global Data Block               @C1A         
*                                                                               
*        Extended Synchronization info block                                    
*                                                                               
STGSESYN DS    0F                  Extended Sync info block        @C3A         
*                                                                               
*                                                                               
*                                                                               
STGSELI  DS    0F                  Last interval information       @C3A         
STGSLIST DS    CL8                 GMT Start time (STCK format)    @C3M         
*                                  of last interval                @C3M         
STGSLTZ  DS    CL8                 Time zone offset (TOD format):  @C3M         
*                                  local time-GMT time             @C3M         
*                                  of last interval                @C3M         
STGSLILN DS    CL8                 Actual intvl-len (TOD-format)   @C3M         
*                                  of last interval                @C3M         
STGSLIET DS    CL8                 Interval expiration token       @C3M         
*                                  of last interval                @C3M         
STGSLFLA DS    C                   Flag bits                       @C3M         
*                                  of last interval                @C3M         
STGSLIES EQU   X'80'               'Ended under SMF control' bit   @C3M         
*                                  of last interval                @C3M         
         DS    CL3                 Reserved                        @C3M         
STGSLPET DS    CL8                 Projected end time(STCK format) @C3A         
*                                  of last interval                @C3A         
STGSLOIL DS    F                   Interval length parameter (sec) @C3A         
*                                  of last interval                @C3A         
STGSLSYN DS    F                   Sync value parameter (sec)      @C3A         
*                                  of last interval                @C3A         
STGSLICT DS    F                   Interval counter                @C3A         
*                                  of last interval                @C3A         
STGSLTRA DS    A                   Address of Trace Table          @C3A         
         DS    CL12                Reserved area for last interval @C3A         
*                                                                               
*                                                                               
*                                                                               
STGSECI  DS    0F                  Current interval information    @C3A         
STGSCIST DS    CL8                 GMT Start time (STCK format)    @C3M         
*                                  of current interval             @C3M         
STGSCTZ  DS    CL8                 Time zone offset (TOD format):  @C3M         
*                                  local time-GMT time             @C3M         
*                                  of current interval             @C3M         
STGSCILN DS    CL8                 Actual intvl-len (TOD-format)   @C3M         
*                                  of current interval             @C3M         
STGSCIET DS    CL8                 Interval expiration token       @C3M         
*                                  of current interval             @C3M         
STGSCFLA DS    C                   Flag bits                       @C3M         
*                                  of current interval             @C3M         
STGSCIES EQU   X'80'               'Ended under SMF control' bit   @C3M         
*                                  of current interval             @C3M         
         DS    CL3                 Reserved                        @C3M         
STGSCPET DS    CL8                 Projected end time(STCK format) @C3A         
*                                  of current interval             @C3A         
STGSCOIL DS    F                   Interval length parameter (sec) @C3A         
*                                  of current interval             @C3A         
STGSCSYN DS    F                   Sync value parameter (sec)      @C3A         
*                                  of current interval             @C3A         
STGSCICT DS    F                   Interval counter                @C3A         
*                                  of current interval             @C3A         
STGSCTRA DS    A                   Address of Trace Table          @C3A         
         DS    CL12                Reserved for current interval   @C3A         
*                                                                               
*                                                                               
STGSE1I  DS    0F                  Last M1 interval information    @C3A         
STGS1PET DS    CL8                 Projected end time(STCK format) @C3A         
*                                  of last M I interval            @C3A         
STGS1OIL DS    F                   Interval length parameter(sec)  @C3A         
*                                  of last M I interval            @C3A         
STGS1SYN DS    F                   Sync value parameter (sec)      @C3A         
*                                  of last M I interval            @C3A         
STGS1TZ  DS    CL8                 Time zone offset (TOD format):  @C3M         
*                                  local time-GMT time             @C3M         
*                                  of last M I interval            @C3M         
*                                                                               
*        WLM/SRM Support                                                        
*                                                                               
STGWLMEX DS    0F                  WLM/SRM Extension               @C2A         
*                                                                               
STGWPCTA DS    F                   Token for program call entry    @C2A         
*                                  tables for RMF common services  @C2A         
STGWLPSL DS    F                   PC number "SaveListenExitRCAA"  @C2A         
STGM2PCI DS    F                   PC number "Monitor 2 PC-call    @E3C         
         DS    F                   PC number reserved              @C2A         
STGWCSAR DS    A                   Pointer to CS info area         @C2A         
STGWLXCE DS    F                   ECB to communicate SRM/WLM      @C2A         
*                                  "change complete" to GRBMFCLS   @C2A         
STGWLXFL DS    C                   WLM/SRM Listen Exit flags       @C2A         
STGWLXIP EQU   X'80'               Listen exit curr. in progress   @C2A         
STGWLXWI EQU   X'40'               WLM Listen exit inoperational   @C2A         
STGWLXSI EQU   X'20'               SRM Listen exit inoperational   @C2A         
         DS    CL3                 Reserved for WLM                @C2A         
STGS_BoostInfo DS CL1              WLM Boost info Mon I SMF        @95A         
STGS_BoostInfo_MIII DS CL1         WLM Boost info Mon III SMF      @95A         
STGS_BoostInfo_MINT DS CL1         WLM Boost info Mon III Mintime  @95A         
         DS    CL5                 Reserved for WLM                @95C         
STGSLXAR DS    0F                  Linkage Index (LX) area         @C5A         
STGSLXFL DS    XL1                 LX flag byte                    @C5A         
STGSLXIN EQU   X'80'               LX values installed             @C5A         
         DS    XL3                 Reserved                        @C5A         
STGSLXV1 DS    F                   LX value 1 used for Data Server @C5A         
STGSLXV2 DS    F                   LX value 2 used for WLM support @C5A         
*                                                                               
STGSFRRP DS    A                   pointer to FRR extension used by             
*                                  cycle gath. and GRBMFEVT    @WA13001         
STGSPDGA DS    A                   Pointer to DG info area         @D1A         
STGSFRSA DS    CL32                Floating Pt Reg Save Area       @D1A         
STGSCNFX DS    F                   Address of GRBCNFGR/V       @WA12872         
*        GRS Support                                               @E1A         
STGSEQHP DS    A                   Address of EEQHD                @E1A         
STGGLXDW DS    0D                  Guarantee DWord alignment       @E1A         
STGGLXAC DS    F                   GRS listen exit active count    @E1A         
STGGLXUC DS    F                   GRS listen exit update count    @E1A         
STGSLSTT DS    CL8                 Latch set token for RMF AS      @E1A         
STGCERST DS    CL8                 STOKEN of ENQ DS                @E1A         
STGCERPT DS    A                   Address of repository header    @E1A         
STGSEQDS DS    CL20                ENQ DS dump parm area           @E1A         
*        OS/390 Product Enable/Disable Support                     @E2A         
STGSEDIF DS    0CL10               RMF Enable/Disable info        @A04C         
STGSEDSF DS    CL1                 Enable/Disable status flags     @E2A         
STGSEDEN EQU   X'80'               1... .... RMF is enabled        @E2A         
STGSEDDR EQU   X'40'               .1.. .... Deregister required   @E2A         
         DS    CL1                 Reserved                        @E2A         
STGSEDTK DS    CL8                 Enable/Disable token            @E2A         
*        Dataserver status flags                                   @G1A         
STGSDSFL DS    CL1                 Dataserver status              @A02C         
STGSDSMS EQU   X'80'               1... .... RMF master           @A02C         
STGSDSHS EQU   X'40'               .1.. .... RMF helper           @A02A         
STGSHELP EQU   X'20'               ..1. .... At least one helper                
*                                            system has collected               
*                                            CF HW data.          @A02A         
STGSENV  DS    CL1                 RMF environment flags          @A01C         
STGSNREP EQU   X'80'               1... .... RMF reporter is not                
*                                            installed or license               
*                                            is missing           @A04C         
STGSBSRM EQU   X'40'               .1.. .... Base mode SMF writer               
*                                            message issued       @A04A         
STGSAltVM EQU  X'20'               ..1. .... Running under an alternate         
*                                            virtual machine                    
*                                            environment       @OA63190         
STG1RTYP DS    A                   Pointer to 1. DS RTY/STY list   @F1A         
STG2RTYP DS    A                   Pointer to 2. DS RTY/STY list   @F1A         
STGSFCD  DS    A                   Ptr to FCD data area - not set               
*                                  anymore, see STGSFCD64          @92C         
STGSFCDS DS    A                   Ptr to FCD NMBR/EXNMBR          @I1A         
*                                  selection table                 @I1A         
STGSE33P DS    A                   Ptr to ERBMFE33 listen exit @WA46171         
STGSIZSS DS    CL8                 Save field for GRBMFIZS         @I1A         
STGSCRYD DS    A                   Ptr to crypto global data area - not         
*                                  set anymore, see STGSCRY64      @92C         
STGSCRYA DS    A                   Ptr to crypto enable/disable    @J1A         
*                                  module                          @J1A         
STGSCRYF DS    CL1                 Crypto hardware support flags   @J1A         
STGSCYD  EQU   X'80'               1... .... Crypto CHSC SCM -     @93C         
STGSCYDD EQU   X'40'               .1.. .... Crypto CHSC SCDM -    @93A         
*                                                      - supported @93A         
         DS    CL1                 Reserved                    @OA04812         
STGSLKLV DS    BL2                 Linkage Stack difference    @OA04812         
*                                  for GRBMFEVT recovery       @OA04812         
STGSEVWP DS    A                   GRBMFEVT work area address  @OA04812         
         DS    CL4                 Reserved                        @41C         
STGSMSTR DS    A                   Ptr to MASTER address space     @L1A         
STGSLEAP DS    CL8                 Leap Seconds in TOD format  @OA23138         
STGSCPUD DS    A                   CPU DIAG Data Area              @31A         
STGSUPC2 DS    F                   I/O update count, used by       @62C         
*                                  device and I/O Queuing data     @62C         
*                                  gatherer                        @62C         
STGSCYCP DS    CL8                 Max 1 percent of cycle time                  
*                                  in TOD format               @OA32719         
STGSMTP1 DS    A                   Ptr to Monitor I MTDA           @71A         
STGSMTP2 DS    A                   Ptr to Monitor II MTDA          @71A         
STGSDMTP DS    D                   Ptr to DMT                      @81A         
STGSTNTP DS    D                   Ptr to LE QTNT area             @91A         
STGSFTNT DS    A                   Address of GRBMFTNT             @91A         
          DS   CL4                 Reserved                        @92A         
STGSCYCF  DS   CL12                Formatted RMF cycletime and date@92A         
          ORG  STGSCYCF                                            @92A         
STGSCYCTM DS   F                   RMF cycle time in binary format in           
*                                  0.01 sec                        @92A         
STGSCYCDT DS   CL8                 Date from RMF Cycle TOD as MMDDYYYY          
*                                                                  @92A         
          DS   CL4                 Reserved                        @92A         
STGSCHA64 DS   D                   64-bit ptr to channel path data              
*                                                                  @92A         
STGSCPU64 DS   D                   64-bit ptr to CPU event control data         
*                                  area                            @92A         
STGSCRY64 DS   D                   64-bit ptr to crypto global data             
*                                  area                            @92A         
STGSDEV64 DS   D                   64-bit ptr to Device Event data              
*                                  area                            @92A         
STGSIOCH64 DS  D                   64-bit ptr to IOCH              @92A         
*                                                                  @92A         
STGSIOCT64 DS  D                   64-bit ptr to IOCT              @92A         
*                                                                  @92A         
STGSIODN64 DS  D                   64-bit ptr to IODNT             @92A         
*                                                                  @92A         
STGSPAG64 DS   D                   64-bit ptr to paging data                    
*                                                                  @92A         
STGSPGS64 DS   D                   64-bit ptr to Page Data Set Event            
*                                  data area                       @92A         
STGSTRC64 DS   D                   64-bit ptr to Trace data area   @92A         
*                                                                  @92A         
STGSFCD64 DS   D                   64-bit ptr to FCD data area     @92A         
*                                                                  @92A         
STGSADVF DS    0CL10               ADV DG Enable/Disable info     @A04A         
STGSADSF DS    CL1                 Enable/Disable status flags    @A04A         
STGSADEN EQU   X'80'               1... .... ADV DG is enabled    @A04A         
STGSADDR EQU   X'40'               .1.. .... Deregister required  @A04A         
         DS    CL1                 Reserved                       @A04A         
STGSADTK DS    CL8                 Enable/Disable token           @A04A         
*        Reserved space                                                         
STGSRESV  DS   CL46                Reserved                       @A02C         
         MEXIT                                                                  
         MEND                                                                   
**/                                                                             
*    DCL KEY CHAR;                  /* KEY WORD PRINTED IN COMMENT   */         
*                                                                               
*    /* ANSWER BACK A COPY OF INVOKING STATEMENT                     */         
*    IF ATTRIBUT = '' THEN          /* IF NO STRUCTURE ATTRIBUTES WERE          
*                                      INPUT, DO NOT PRINT KEY WORD  */         
*      KEY = '';                    /* KEY WORD IS BLANKS            */         
*    ELSE                                                                       
*      KEY = 'ATTRIBUT';            /* PRINT KEYWORD NAME            */         
*    ANS('/* ?'!!MACLABEL!!MACNAME!!' '!!MACLIST!!KEY!!ATTRIBUT!!' */'          
*       ) SKIP;                                                                 
*                                                                               
*    /* ANSWER DECLARE, STRUCTURE NAME, INPUT ATTRIBUTES OF STRUCTURE*/         
*    /* AND BOUNDARY ATTRIBUTE.                                      */         
*    ANS(                                                                       
*              'DECLARE                                               '         
*       )SKIP;                                                                  
*    ANS(                                                                       
*          '  1 STGST               /* GLOBAL SUPERVISOR TABLE      */'         
*       )SKIP;                                                                  
*    ANS(                                                                       
*              '        '!!ATTRIBUT(1)!!'                             '         
*       )SKIP;                                                                  
*    ANS(                                                                       
*              '        BDY(DWORD),                           /*@W1C*/'         
*       )SKIP;                                                                  
*                                                                               
*    /* ANSWER BACK THE STRUCTURE DEFINITION                         */         
*ANS(                                                                           
*          '    2 STGSNAME          /* TABLE NAME (STGS)             */         
*                     CHAR(4),                                                  
*               2 STGSPAR1,         /* EVERYTHING MUST BE CLEARED AT            
*                                      MFIMAINL INIT EXCEPT NAME, CNFG          
*                                      PTRS AND ENQ BITS.        @N4C*/         
*               3 STGSSCT           /* ADDRESS OF SUPERVISOR CONTROL            
*                                      TABLE (STSCT)             @N4C*/         
*                     PTR(31),                                                  
*               3 STGSTCB           /* TCB address of RMF address               
*                                      space (GRBMFMFC)          @I2C*/         
*                     PTR(31),                                        '         
*   )SKIP;                                                                      
*ANS(                                                                           
*          '    3 STGSASID          /* ASID of RMF address space                
*                                      (GRBMFMFC)                @I2C*/         
*                     FIXED(15),                                      '         
*   )SKIP;                                                                      
*                                                                               
*ANS(                                                                           
*          '    3 STGSBITS BIT(8),  /*RMF GLOBAL BITS          @N4A*/           
*                 4 STGSUBIT BIT(1), /*USER EXITS ON IF ONE@G527NJW*/           
*                 4 STGSSBIT BIT(1), /* Set command issued @GM2EQJK*/           
*                 4 STGSGCYC BIT(1), /* ZZ session, cycle gatherer              
*                                       active                 @W4A*/           
*                 4 STGSGINO BIT(1), /* ZZ session, interval/event              
*                                       gatherer only          @W4A*/           
*                 4 STGSGINA BIT(1), /* ZZ session, interval gatherer           
*                                       active flag (set by                     
*                                       GRBMFDTA)              @I2C*/           
*                 4 * BIT(3),        /* Not used           @WA18557*/'          
*   )SKIP;                                                                      
*                                                                               
*ANS(                                                                           
*          '    3 STGSLOCK          /* TARGET OF TEST-AND-SET TO                
*                                      SERIALIZE TIMER-DRIVEN SAMPLERS          
*                                      AND INTERVAL MEASURMENT                  
*                                      GATHERERS. (GRBMFEVT AND                 
*                                      GRBMFDTS).                @I2C*/         
*                     CHAR(1),                                                  
*               3 STGSMMV           /* ADDRESS OF MFROUTER MG VECTOR            
*                                      TABLE (MFMMV)           @N4A  */         
*                     PTR(31),                                                  
*               3 STGSCYC           /* RMF SAMPLING CYCLE PERIOD, IN            
*                                      TIME OF DAY (TOD) CLOCK FORMAT           
*                                                                @N4A*/         
*                     CHAR(8),                                        '         
*   )SKIP;                                                                      
*                                                                               
*ANS(                                                                           
*          '    3 STGSUSER          /* USER EXITS FIRST WORD     @N4A*/         
*                     FIXED(31),                                                
*               3 STGSUSE2          /* USER EXIT SECOND WORD     @N4A*/         
*                 FIXED(31),                                                    
*               3 STGSNSKP          /* NUM OF SKIPPED SAMPLES DUE TO */         
*                 CHAR(1),          /* UNAVAIL. LOCK         @ZA75097*/         
*               3 STGSVER BIT(8),   /* STGST Version             @C1C*/         
*               3 STGSLEN FIXED(15),/* STGST Length              @C1A*/         
*               3 STGCSFLG                                                      
*                     FIXED(32),    /* Compare-and-swap word                    
*                                      containing flags to serialize            
*                                      GRBMFPVS or GRBMFCLS with                
*                                    * GRBMFTMA                  @31C*/         
*                 5 STGCSSRB BIT(1),/* SRB running flag      @YA56222*/         
*                 5 STGCSTER BIT(1),/* termination flag      @YA56222*/         
*                 5 STGCSNSR BIT(1),/* no running SRB routine expected          
*                                                            @YA56222*/         
*                 5 STGCSSNC BIT(1),/* 1 = SRB has been scheduled and           
*                                      has not yet completed execution          
*                                                            @YA56222*/         
*                 5 STGCSCLS BIT(1),/* GRBMFCLS running flag     @31A*/         
*                 5 STGCSCEQ BIT(1),/* GRBMFCEQ running flag @OA29496*/         
*                 5 * BIT(26),      /* reserved              @OA29496*/         
*               3 STGSEUC           /* POINTER TO USER SAMPLER                  
*                                      EXIT WHICH GETS CONTROL FROM             
*                                      GRBMFEVT                  @N4A*/         
*                     PTR(31),                                        '         
*   )SKIP;                                                                      
*ANS(                                                                           
*          '    3 STGSDCBA          /* ADDR OF MESSAGE DATA SET DCB  */         
*                     PTR(31),      /*                           @N1A*/         
*               2 STGSIOCH          /* PTR TO IOCHT, not used anymore*/         
*                     PTR(31),      /* see STSGIOCH64            @92C*/         
*               2 STGSIODN          /* PTR TO IODNT, not used anymore*/         
*                     PTR(31),      /* see STSGIODN64            @92C*/         
*               2 STGSIOCT          /* PTR TO IOCT, not used anymore */         
*                     PTR(31),      /* see STSGIOCT64           @92C*/'         
*   )SKIP;                                                                      
*                                                                               
*ANS(                                                                           
*                                                                               
*          '    2 STGETRML BIT(32), /* TERMINATION WORD FOR LOCAL ENQ           
*                                      REQUEST                   @LCA*/         
*                 3 * BIT(8),       /*                           @LCA*/         
*                 4 STGTRQL BIT(1), /* TERMINATION REQUEST BIT FOR              
*                                      LOCAL ENQ REQUEST         @LCA*/         
*                 4 STGEINPL BIT(1), /* LOCAL ENQ REQUEST IN                    
*                                       PROGRESS                 @LCA*/         
*                 4 * BIT(6),        /* RESERVED                 @LCA*/         
*                 3 * BIT(24),       /*                         @LCA*/'         
*   )SKIP;                                                                      
*                                                                               
*ANS(                                                                           
*          '    2 STGETRMG BIT(32), /* TERMINATION BIT FOR GLOBAL ENQ           
*                                      REQUEST                   @LCA*/         
*                 3 * BIT(8),       /*                           @LCA*/         
*                 4 STGTRQG BIT(1), /* TERMINATION REQUEST BIT FOR              
*                                      GLOBAL ENQ REQUEST        @LCA*/         
*                 4 STGEINPG BIT(1), /* GLOBAL ENQ REQUEST IN                   
*                                       PROGRESS                 @LCA*/         
*                 4 * BIT(6),        /* RESERVED                 @LCA*/         
*                 3 * BIT(24),       /*                         @LCA*/'         
*   )SKIP;                                                                      
*                                                                               
*ANS(                                                                           
*          '    /* THE FOLLOWING FIELDS ARE USED BY MONITOR I                   
*                  (MSCH COMPLETION AND LISTEN EXIT ROUTINES)                   
*                  AND/OR MONITOR II @N2C*/                                     
*               2 STGSPAR2,         /* FOR CLEARING BLOCK        @N4A*/         
*                 3 STGSCPU         /* PTR TO CPU DATA - NOT USED    */         
*                     PTR(31),      /* ANYMORE, SEE STGSCPU64    @92C*/         
*                 3 STGSCHAN        /* PTR TO CHANNEL DATA - NOT USED*/         
*                     PTR(31),      /* ANYMORE, SEE STGSCHA64    @92C*/         
*                 3 STGSDEV         /* PTR TO DEVICE DATA - NOT USED */         
*                     PTR(31),      /* ANYMORE, SEE STGSDEV64    @92A*/         
*                 3 STGSPAG         /* PTR TO PAGING DATA - NOT USED */         
*                     PTR(31),      /* ANYMORE, SEE STGSPAG64   @92A*/'         
*   )SKIP;                                                                      
*                                                                               
*ANS(                                                                           
*          '      3 STGSPGSP        /* PTR TO PAGESPACE DATA - NOT   */         
*                     PTR(31),      /* USED ANYMORE, SEE STGSPGS64   */         
*                                   /*                           @92C*/         
*                 3 STGSENQ         /* ENQ data address is no longer            
*                                      used, the ENQ data structure is          
*                                      now located in private storage           
*                                                                @E1C*/         
*                     PTR(31),                                                  
*                 3 STGSWKLD        /* PTR TO WLKD DATA          @LBA*/         
*                     PTR(31),                                                  
*                 3 STGSTRC         /* PTR TO TRACE DATA - NOT USED  */         
*                     PTR(31),      /* ANYMORE, SEE STGSTRC64    @92C*/         
*                 3 STGSIOQ         /* PTR TO I/O QUEUING DATA   @N2A*/         
*                     PTR(31),                                                  
*                 3 STGSVSTG  /* PTR TO VIRTUAL STORAGE DATA     @V1A*/         
*                     PTR(31),                                        '         
*   )SKIP;                                                                      
*                                                                               
*ANS(                                                                           
*          '      3 STGSCPUF        /* CPU OPTIONS               @LBA*/         
*                     BIT(8),                                                   
*                 3 STGSCHNF        /* CHANNEL OPTIONS           @LBA*/         
*                     BIT(8),                                         '         
*   )SKIP;                                                                      
*                                                                               
*ANS(                                                                           
*          '      3 STGSDEVF BIT(8),/* DEVICE OPTION FLAGS       @LBA*/         
*                   4 STGSTAPE      /* MAGNETIC TAPE DEVICE      @LBA*/         
*                       BIT(1),     /* 0-OPTION NOT SELECTED 1 OPTION           
*                                       SELECTED                 @LBA*/         
*                   4 STGSTP        /* COMMUNICATION DEVICES     @LBA*/         
*                       BIT(1),     /* 0-OPTION NOT SELECTED 1 OPTION           
*                                       SELECTED                 @LBA*/         
*                   4 STGSDA        /* DIRECT ACCESS DEVICES     @LBA*/         
*                       BIT(1),     /* 0-OPTION NOT SELECTED 1 OPTION           
*                                       SELECTED                @LBA*/'         
*     )SKIP;                                                                    
*                                                                               
*ANS(                                                                           
*          '      4 STGSGRAP        /* GRAPHICS DEVICES          @LBA*/         
*                       BIT(1),     /* 0-OPTION NOT SELECTED 1 OPTION           
*                                       SELECTED                 @LBA*/         
*                   4 STGSUNIT      /* UNIT RECORD DEVICES       @LBA*/         
*                       BIT(1),     /* 0-OPTION NOT SELECTED 1 OPTION           
*                                       SELECTED                 @LBA*/         
*                   4 STGSCRDR      /* CHARACTER READER DEVICES  @LBA*/         
*                       BIT(1),     /* 0-OPTION NOT SELECTED 1 OPTION           
*                                       SELECTED                @LBA*/'         
*     )SKIP;                                                                    
*                                                                               
*ANS(                                                                           
*          '        4 STGSDVSO      /* DEVICE SELECTIVITY OPTION @N1A*/         
*                       BIT(1),     /* 0-OPTION NOT SELECTED 1 OPTION           
*                                       SELECTED                 @LBA*/         
*                   4 STGSSGSO      /* SG Selectivity Option         */         
*                       BIT(1),     /* 0-OPTION NOT SELECTED 1 OPTION           
*                                       SELECTED                 @U1C*/         
*                                                                               
*                 3 STGSPAGF        /* PAGING OPTIONS            @LBA*/         
*                     BIT(8),                                                   
*                 3 STGSPGSF        /* PAGESPACE OPTIONS         @LBA*/         
*                     BIT(8),                                                   
*                 3 STGSENQF        /* ENQ OPTIONS               @LBA*/         
*                     BIT(8),                                         '         
*   )SKIP;                                                                      
*                                                                               
*ANS(                                                                           
*          '      3 STGSWKLF        /* WLKD OPTIONS              @LBA*/         
*                     BIT(8),                                                   
*                 3 STGSTRCF        /* TRACE OPTIONS             @LBA*/         
*                     BIT(8),'                                                  
*     )SKIP;                                                                    
*ANS(                                                                           
*          '      3 STGSIOQF        /* I/O QUEUING OPTIONS       @N2A*/         
*                     BIT(8),                                                   
*                   4 STGSITAP      /* MAGNETIC TAPE DEVICE      @P3A*/         
*                       BIT(1),     /* 0-OPTION NOT SELECTED 1 OPTION           
*                                       SELECTED                 @P3A*/         
*                   4 STGSITP       /* COMMUNICATION DEVICES     @P3A*/         
*                       BIT(1),     /* 0-OPTION NOT SELECTED 1 OPTION           
*                                       SELECTED                 @P3A*/         
*                   4 STGSIDA       /* DIRECT ACCESS DEVICES     @P3A*/         
*                       BIT(1),     /* 0-OPTION NOT SELECTED 1 OPTION           
*                                       SELECTED                @P3A*/'         
*     )SKIP;                                                                    
*                                                                               
*ANS(                                                                           
*          '      4 STGSIGRA        /* GRAPHICS DEVICES          @P3A*/         
*                       BIT(1),     /* 0-OPTION NOT SELECTED 1 OPTION           
*                                       SELECTED                 @P3A*/         
*                   4 STGSIUNI      /* UNIT RECORD DEVICES       @P3A*/         
*                       BIT(1),     /* 0-OPTION NOT SELECTED 1 OPTION           
*                                       SELECTED                 @P3A*/         
*                   4 STGSICRD      /* CHARACTER READER DEVICES  @P3A*/         
*                       BIT(1),     /* 0-OPTION NOT SELECTED 1 OPTION           
*                                       SELECTED                @LBA*/'         
*     )SKIP;                                                                    
*                                                                               
*ANS(                                                                           
*          '        4 STGSLCSO      /* LCU SELECTIVITY OPTION    @P3A*/         
*                       BIT(1),     /* 0-OPTION NOT SELECTED 1 OPTION           
*                                       SELECTED                 @P3A*/         
*                   4 * BIT(1),     /* RESERVED                  @P3A*/         
*                                                                               
*                 3 STGSVSTF        /* VIRTUAL STORAGE OPTIONS   @V1A*/         
*                     BIT(8),                                                   
*                 3 STGSHSSD FIXED(8), /* Highest available                     
*                                      subchannel set in the                    
*                                      system                    @63A*/         
*                 3 STGSGEF2 BIT(8),/* Global I/O environment                   
*                                      flag 2                @OA58725*/         
*                  5 STGSSCMF BIT(1), /*                                        
*                                      Storage-class-memory-                    
*                                      measurement facility  @OA58725*/         
*                  5 *      BIT(7), /* Reserved for future                      
*                                      use                   @OA58725*/'        
*   )SKIP;                                                                      
*                                                                               
*ANS(                                                                           
*          '   3 STGSSAMP FIXED(31),/* NUMBER OF SAMPLES TAKEN FOR              
*                                      THE CURRENT INTERVAL      @N4A*/         
*              3 STGSMINT FIXED(32),/* Projected interval length in             
*                                      Seconds/100 units                        
*                                      for the current interval  @B3C*/         
*              3 STGSITIM FIXED(32),/* Interval start time after                
*                                      midnight in Sec/100 units                
*                                      for the current interval  @B3C*/'        
*   )SKIP;                                                                      
*ANS(                                                                           
*          '    /*           MONITOR III SECTION                 @M1A*/         
*               2 STGGSTPT          /* PTR TO MONITOR III GLOBAL @M1A*/         
*                     PTR(31),      /* STORAGE TABLE EXTENSION   @M1A*/         
*               /* 10 ENQ related definitions no longer used @E1D*/             
*               2 * CHAR(24),       /* Reserved for future use   @E1C*/         
*               /* Miscellaneous definitions @O1A*/                   '         
*   )SKIP;                                                                      
* ANS(    '   2 STGSLWM FIXED(31),  /* LOW WATER MARK FOR VSTOR  @V1A*/         
*             2 STGSELWM FIXED(31), /* LOW WATER MARK ABOVE 16M  @V1A*/         
*               2 STGSIOML          /* I/O measurement level     @O1A*/         
*                   CHAR(1),                                                    
*               2 STGSBFLS BIT(8),  /* PR/SM flags               @Z1C*/         
*                 3 STGSBYMN BIT(1), /* PR/SM machine indicator  @Z1C*/         
*                 3 STGSAIDA BIT(1), /* ESCA processor           @Z1A*/         
*                 3 STGSSERE BIT(1), /* Serial enabled machine   @Z2A*/         
*                 3 STGSSWCH BIT(1), /* Switch in configuration  @Z2A*/         
*                 3 STGSNOCH BIT(1), /* CHSC RC 4 a. AIDA ON @YA58324*/         
*                 3 STGSVM   BIT(1), /* Running under z/VM   @OA63190*/         
*                 3 STGSDCMH BIT(1), /* DCM supported by hardware               
*                                                                @I3A*/         
*                 3 STGSDCMD BIT(1), /* Configuration contains DCM              
*                                      managed channels          @I3A*/         
*               2 STGSPRTN CHAR(1), /* PR/SM partition number    @Y1C*/         
*                                                                     '         
*   )SKIP;                                                                      
* ANS(    '     2 STGSGENF BIT(8),  /* Global I/O environment                   
*                                      flags                     @K1C*/         
*                 3 STGSGCMR BIT(1), /* 1 = Initial-command-                    
*                                      response-measurement                     
*                                      facility supported        @K1A*/         
*                 3 STGSGESQ BIT(1), /* 1 = Extended I/O-                       
*                                      measurement-block                        
*                                      facility supported        @K2A*/         
*                 3 STGSFCCS BIT(1), /* 1 = Ficon-cascaded-switch               
*                                      facility supported    @OA06258*/         
*                 3 STGSGIDT BIT(1), /* 1 = Interrupt-delay-time                
*                                      facility supported    @OA39993*/         
*                 3 STGSGMSS BIT(1), /* 1 = Multiple-subchannel-                
*                                      set facility supported    @63A*/         
*                 3 STGSGES2 BIT(1), /* 1 = Extended I/O-                       
*                                      measurement-block 2                      
*                                      supported                 @72A*/         
*                 3 STGSUTST BIT(1),/* 1 = Utility-string                       
*                                      facility supported    @OA51808*/         
*                 3 STGSECPR BIT(1),/* 1 = EADM-compression-                    
*                                       measurements facility                   
*                                       supported                @94C*/         
*               2 STGESSL           /* NUMBER OF EXTENDED        @P2A*/         
*                   FIXED(31),      /* STORAGE SLOTS INSTALLED   @P2A*/         
*               2 STGSDAE           /* ADDRESS OF MODULE AND     @P4A*/         
*                   PTR(31),        /* CSECT NAME FOR DAE        @P4A*/         
*                                                                     '         
*   )SKIP;                                                                      
* ANS(    '     2 STGSPGPP PTR(31), /* Address of PGPER          @C4D*/         
*               2 STGSCLD PTR(31),  /* Ptr to collector data     @W3C*/         
*               2 STGSTESY CHAR(8)  /* Doubleword for termina-   @W1A*/         
*                     BDY(DWORD),   /* tion/synchronization M I  @W1A*/         
*                 3 STGSTERM        /* Termination information   @W1A*/         
*                     BIT(32),      /*                           @W1A*/         
*                   4 STGSTIP       /* Monitor I termination in  @W1A*/         
*                       BIT(1),     /*   process.                @W1A*/         
*                   4 * BIT(29),    /* Do not use this bits      @42C*/         
*                   4 STGSTLCK      /* STGSLOCK could not get    @42A*/         
*                       BIT(1),     /*   obtained                @42A*/         
*                   4 STGSATRM      /* Monitor I ABTERM 0FE      @G3A*/         
*                       BIT(1),     /*   issued by listen exit   @G3A*/         
*                 3 STGSNOEA        /* Number Of Event Arrivals  @G3C*/         
*                     FIXED(31)     /* (set in GRBMFEAR)         @W1A*/         
*                        BDY(WORD), /*    ....                   @B2C*/         
*                                                                     '         
*   )SKIP;                                                                      
* ANS(    '     2 STGSINTL FIXED(31),    /* Length of Monitor I                 
*                                      interval or zero, if Monitor I           
*                                      is not active             @W5A*/         
*               2 STGSSYNV FIXED(31),    /* SYNC minute value    @W5A*/         
*               2 STGSSYNF BIT(32), /* SYNC minute flag          @W5A*/         
*                 3 STGSSYRM BIT(8),   /* SYNC(RMF) flags        @B3A*/         
*                   4 STGSSYNC BIT(1), /* SYNC(RMF) bit          @B3A*/         
*                   4 *        BIT(7), /* Reserved               @B3A*/         
*                 3 STGSSOPT FIXED(8), /* Sync option from M I                  
*                                      options (option constants                
*                                      declared below)           @B3C*/         
*                 3 *     BIT(16),  /* Reserved                  @B3C*/         
*               2 STGSSRMC BIT(32), /* SRM command count         @W5A*/         
*               2 STGSTOKN FIXED(32), /* Resource manager token  @Y2A*/         
*                                                                     '         
*   )SKIP;                                                                      
* ANS(    '  /* Dynamic I/O Extension                            @A1A*/         
*            2 STGSTES3 FIXED(31)   /* Termination Synchron. for @A1A*/         
*                        BDY(WORD), /*    ....                   @B2C*/         
*              3 STGSN3EA FIXED(31), /* M III Listen Exits       @A1A*/         
*            2 STGSSLET PTR(31),    /* Pointer to Listen Exit                   
*                                      Event Table               @A1A*/         
*            2 STGSFIOC PTR(31),    /* Address of GRBMFIOC       @A1A*/         
*                                                                     '         
*   )SKIP;                                                                      
* ANS(    '                                                                     
*            2 STGSFBSR PTR(31),    /* Address of GRBMFBSR      @A01C*/         
*            2 STGSFLXP PTR(31),    /* Address of GRBMFLXP       @A1A*/         
*            2 STGSFSCS PTR(31),    /* Address of GRBMFSCS       @A1A*/         
*            2 STGSNFGR PTR(31),    /* Address of GRBCNFGR       @A1A*/         
*                                                                     '         
*   )SKIP;                                                                      
* ANS(    '  2 STGSINFL CHAR(8),    /* Initialization Processing                
*                                      Flags                     @A1A*/         
*              4 STGSDCFL BIT(8),   /* Dynamic I/O update Flags  @A1A*/         
*                6 *       BIT(2),  /* reserved              @WA42945*/         
*                                                                     '         
*   )SKIP;                                                                      
* ANS(    '                                                                     
*                6 STGSIAC  BIT(1), /* Configuration has been                   
*                                      changed since last IPL    @A1A*/         
*                6 STGSDYNA BIT(1), /* Dynamic I/O enabled       @A1A*/         
*                6 STGSIOD  BIT(1), /* System IPLed via IODF     @A1A*/         
*                6 STGSICIV BIT(1), /* I/O Conf. Info. valid     @A1A*/         
*                6 STGSDCA BIT(1),  /* Configuration update                     
*                                      actually performed        @A1A*/         
*                6 STGSINHB BIT(1), /* Start of M I Device and                  
*                                      I/O Q_ing Option inhibit. @A1A*/         
*                                                                     '         
*   )SKIP;                                                                      
* ANS(    '    4 STGSCNFL BIT(8),   /* Configuration table build                
*                                      flags                     @A1A*/         
*                6 STGSCNIN BIT(1), /* Init. in progress (updated               
*                                      by CNFGF/CNFSR modules)   @A1A*/         
*                6 STGSCNRI BIT(1), /* Reinit. required (updated                
*                                      by GRBLXDIO)              @A1A*/         
*                6 STGSCNUP BIT(1), /* Update of Conf. Tables in                
*                                      Progress.                 @A1A*/         
*                6 STGSCNTR BIT(1), /* I/O Tables will be del.   @A1A*/         
*                6 *        BIT(4), /* reserved                  @A1A*/         
*                                                                     '         
*   )SKIP;                                                                      
* ANS(    '    4 STGSDVFL BIT(8),   /* Device Data Structure                    
*                                      build flags               @A1A*/         
*                6 STGSDVIN BIT(1), /* Init. in progress (updated               
*                                      by GRBMFIDV)              @A1A*/         
*                6 STGSDVRI BIT(1), /* Reinit. required (updated                
*                                      by GRBLXDIO)              @A1A*/         
*                6 *        BIT(1), /* Not longer used       @YA57961*/         
*                6 *        BIT(5), /* reserved                  @A1A*/         
*                                                                     '         
*   )SKIP;                                                                      
* ANS(    '    4 STGSIOFL BIT(8),   /* I/O Queuing Structure                    
*                                      build flags               @A1A*/         
*                6 STGSIOIN BIT(1), /* Init. in progress (updated               
*                                      by GRBMFIOQ)              @A1A*/         
*                6 STGSIORI BIT(1), /* Reinit. required (updated                
*                                      by GRBLXDIO)              @A1A*/         
*                6 *        BIT(1), /* Not longer used       @YA63501*/         
*                6 *        BIT(5), /* reserved                  @A1A*/         
*                                                                     '         
*   )SKIP;                                                                      
* ANS(    '    4 STGS3DFL BIT(8),   /* Monitor 3 device address                 
*                                      table build flags         @A1A*/         
*                6 STGS3DIN BIT(1), /* Init. in progress (updated               
*                                      by GRB3GINI)              @A1A*/         
*                6 STGS3DRI BIT(1), /* Reinit. required (updated                
*                                      by GRBLXDIO)              @A1A*/         
*                6 *       BIT(6),  /* reserved                  @A1A*/         
*              4 STGS3QFL Bit(8),   /* Monitor 3 I/O queuing data               
*                                      structure build flags     @11A*/         
*                6 STGS3QIN Bit(1), /* Init. in progress (updated               
*                                      by GRB3GIQD)              @11A*/         
*                6 STGS3QRI Bit(1), /* Reinit. required (updated                
*                                      by GRBLXDIO)              @11A*/         
*                6 STGS3QRD Bit(1), /* Restart required (updated                
*                                      by GRBLXDIO)              @11A*/         
*                6 * Bit(5),        /* Reserved                  @11A*/         
*              4 * Char(2),         /* Reserved                  @11C*/         
*            2 STGSUPCT FIXED(16),  /* Reserved                  @62C*/         
*                                                                     '         
*   )SKIP;                                                                      
* ANS(    '  2 STGSICI,             /* I/O Configuration Infor-                 
*                                      mation Area               @A1A*/         
*              4 STGSTNM CHAR(44),  /* IODF Name of current I/O                 
*                                      configuration             @A1A*/         
*              4 STGSTSF CHAR(2),   /* Suffix of IODF Name       @A1A*/         
*              4 STGSTSX CHAR(2),   /* Suffix set by EAX         @A1A*/         
*                                                                     '         
*   )SKIP;                                                                      
* ANS(    '                                                                     
*              4 STGSTOK CHAR(16),  /* Partially Token Info.     @A1A*/         
*                6 STGSTDT CHAR(8), /* IODF creation date        @A1A*/         
*                6 STGSTTM CHAR(8), /* IODF creation time        @A1A*/         
*            2 STGSTY1 CHAR(2),     /* First two bytes of IODF creation         
*                                      date YYyy/mm/dd           @G4C*/         
*            2 STGSENF   BIT(32)    /* ENF Signal Lock Word      @B2C*/         
*                        BDY(WORD), /*    ....                   @B2C*/         
*              4 STGSDCS BIT(1),    /* Dynamic I/O change flag                  
*                                      (Signal 31/GRBLXDCS)      @B2M*/         
*              4 STGSDIO BIT(1),    /* Dynamic I/O change complete              
*                                      flag (Signal 32/GRBLXDIO) @B2M*/         
*              4 *       BIT(30),   /* reserved                  @B2C*/         
*            2 *       CHAR(1),     /* Reserved              @WA04821*/         
*              4 STGSIZZA BIT(1),   /* Monitor I initialization                 
*                                      GRBMFIZZ is active for the               
*                                      first time.               @B1A*/         
*              4 *       BIT(7),    /* Reserved              @WA04821*/         
*                                                                     '         
*   )SKIP;                                                                      
* ANS(    '                                                                     
*            2 STGSCHFL BIT(8),     /* CHSC support flags    @WA04821*/         
*              4 STGSCSCL BIT(1),   /* 1 = Store Channel Path Link              
*                                      Address not supported @WA04821*/         
*              4 STGSCSSL BIT(1),   /* 1 = Store Subchannel Link                
*                                      Address not supported @WA04821*/         
*              4 STGSCSSC BIT(1),   /* 1 = Store Subchannel Control             
*                                      Unit Data not supported                  
*                                                            @WA04821*/         
*              4 STGSCSPQ BIT(1),   /* 1 = Store Primary Queue Data             
*                                      not supported         @WA04821*/         
*              4 STGSCSSQ BIT(1),   /* 1 = Store Secondary Queue Data           
*                                      not supported         @WA04821*/         
*              4 STGSCSIU BIT(1),   /* 1 = Store IOP utilization data           
*                                      not supported             @J2A*/         
*              4 * BIT(2),          /* Reserved                  @J2C*/         
*            2 *        CHAR(2),    /* CHSC command code     @WA04821*/         
*                                                                     '         
*   )SKIP;                                                                      
* ANS(    '                                                                     
*            2 * ,                  /* Reserved                  @B1A*/         
*              4 *        PTR(31),  /* Reserved (was STGSEADT)   @C4C*/         
*              4 *        PTR(31),  /* Reserved (was STGSEACL)   @C4C*/         
*              4 *        PTR(31),  /* Reserved (was STGSEAIZ)   @C4C*/         
*              4 *        PTR(31),  /* Reserved (was STGSIRAS)   @C4C*/         
*            2 STGSCCC    BIT(32),  /* Cache configuration control              
*                                                            @WA42945*/         
*              4 STGSCCCF BIT(8),   /* Cache configuration change flags         
*                                      set by listen exits via CS               
*                                                            @WA42945*/         
*                6 STGSCDY1 BIT(1), /* DYN I/O update, CACHE for M1             
*                                      (renamed and moved STGSDYN)              
*                                                            @WA42945*/         
*                6 STGSCDY3 BIT(1), /* Dyn I/O update, Cache for M3             
*                                                            @WA42945*/         
*                6 STGSCDV1 BIT(1), /* Device now online, M1 @WA42945*/         
*                6 STGSCDV3 BIT(1), /* Device now online, M3 @WA42945*/         
*                6 *        BIT(4), /* Reserved              @WA42945*/         
*              4 *        BIT(24),  /* Reserved for cache    @WA42945*/         
*                                                                     '         
*   )SKIP;                                                                      
* ANS(    '  /* Extension for Synchronize Measurements           @B3A*/         
*            2 STGSSYME,            /* Synchronize Measurements  @B3A*/         
*              4 STGSSCCE FIXED(32),/* ECB to communicate SMF                   
*                                      interval end from SMF listen             
*                                      exit to interval control  @B3A*/         
*              4 STGSMFIE CHAR(8),  /* GMT SMF interval expiration              
*                                      token - STCK format       @B3A*/         
*                                                                               
*                                                                               
*              4 STGSDCNE FIXED(32),/* ECB to communicate Monitor I             
*                                      (in)active to interval control           
*                                      module                    @B3A*/         
*              4 STGSCDIE FIXED(32),/* ECB for communicating                    
*                                      interval end from Interval               
*                                      control module to M I     @B3A*/         
*              4 * CHAR(36),        /* Reserved-was STGSLI       @C3A*/         
*              4 * CHAR(36),        /* Reserved-was STGSCI       @C3A*/         
*                                   /* 32 Lines deleted        32@C3D*/         
*                                                                     '         
*   )SKIP;                                                                      
* ANS(    '                                                                     
*              4 STGS1I BDY(WORD),  /* Information about last                   
*                                      Monitor I interval        @B3A*/         
*                6 STGS1IET CHAR(8),/* M I interval expiration time             
*                                      token                     @B3A*/         
*                6 STGS1FLA BIT(32),/* M I interval flag bits    @B3A*/         
*                 7 STGS1ISC BIT(1),/* M I interval was completely              
*                                      under SMF control         @B3A*/         
*                 7 *       BIT(31),/* Reserved                  @B3A*/         
*                                                                     '         
*   )SKIP;                                                                      
* ANS(    '                                                                     
*              4 STGSLSMF BIT(8),   /* SMF Listen exit flags     @C3C*/         
*                6 STGSLXSI BIT(1), /* Listen exit set inactive                 
*                                      (in case of error)        @B3A*/         
*                6 STGSLSMI BIT(1), /* SMF has signalled                        
*                                      inactive                  @B3A*/         
*                6 *        BIT(6), /* Reserved                  @B3A*/         
*                                                                     '         
*   )SKIP;                                                                      
* ANS(    '  /* Information about RMF address space              @C2A*/         
*              4 STGSGRMF                                                       
*                  BOUNDARY(WORD,2),/* Info RMF address space    @C2A*/         
*                6 STGSGFLG BIT(8), /* RMF global Bits           @C3A*/         
*                 7 STGSGTER BIT(1),/* RMF is terminating(P RMF) @E1M*/         
*                 7 STGSATER BIT(1),/* RMF abnorm. terminating   @E1A*/         
*                 7 STGSNEGP BIT(1),/* No ENQ contention data due to            
*                                      GRS system problems   @WA20587*/         
*                 7 STGSDDS  BIT(1),/* DDS option specified      @01A*/         
*                 7 STGSBLVL BIT(1),/* Backlevel RMF release     @12A*/         
*                 7 STGSCFOPT BIT(1),                                           
*                                   /* CFOPT option specified   @A02A*/         
*                 7 * BIT(2),       /* Reserved                 @A02C*/         
*                6 STGSRREL BIT(16),/* Release of RMF            @C3A*/         
*                6 *      FIXED(32),/* Reserved (was STGSEOIC)   @C3A*/         
*                6 STGSASCP POINTER,/* Pointer to RMFs  own                     
*                                      ASCB control block                       
*                                      (0, if RMF inactive)      @B3A*/         
*                6 STGSSTTI CHAR(8),/* Starttime of RMF control                 
*                                      address space, taken from                
*                                      ASCBINTS field                           
*                                      (0, if RMF inactive)      @B3A*/         
*                6 STGRMFST CHAR(8),/* RMF Address Space Space Token            
*                                                                @C2A*/         
*            /* RMF Sysplex Data Server                          @C1A*/         
*              4 STGSDSGD PTR(31),  /* RMF Sysplex Data Server                  
*                                      Global Data Block (DSGDB) @C1A*/         
*                                                                     '         
*   )SKIP;                                                                      
* ANS(    '  /* Extended Synchronization information             @C3A*/         
*              4 STGSESYN,          /* Extended Sync info block  @C3A*/         
*               5 STGSELI,          /* Last interval information @C3A*/         
*                6 STGSLIST CHAR(8),/* GMT Start time (STCK format)             
*                                      of last interval          @C3M*/         
*                6 STGSLTZ  CHAR(8),/* Time zone offset (TOD format):           
*                                      local time-GMT time                      
*                                      of last interval          @C3M*/         
*                6 STGSLILN CHAR(8),/* Actual intvl-len (TOD-format)            
*                                      of last interval          @C3M*/         
*                6 STGSLIET CHAR(8),/* Interval expiration token                
*                                      of last interval          @C3M*/         
*                6 STGSLFLA BIT(32),/* Flag bits                                
*                                      of last interval          @C3M*/         
*                 7 STGSLIES BIT(1),/* "Ended under SMF control" bit            
*                                      of last interval          @C3M*/         
*                 7 *       BIT(31),/* Reserved                  @C3M*/         
*                6 STGSLPET CHAR(8),/* Projected end time(STCK format)          
*                                      of last interval          @C3A*/         
*                6 STGSLOIL FIXED(31),/* Interval length parameter(sec)         
*                                      of last interval          @C3A*/         
*                6 STGSLSYN FIXED(31),/* Sync value parameter (sec)             
*                                      of last interval          @C3A*/         
*                6 STGSLICT FIXED(31),/* Interval counter                       
*                                      of last interval          @C3A*/         
*                6 STGSLTRA POINTER,/* Trace table pointer       @C3A*/         
*                6 * CHAR(12),      /* Reserved area                            
*                                      of last interval          @C3A*/         
*                                                                     '         
*   )SKIP;                                                                      
* ANS(    '     5 STGSECI,          /* CURR interval information @C3A*/         
*                6 STGSCIST CHAR(8),/* GMT Start time (STCK format)             
*                                      of current interval       @C3M*/         
*                6 STGSCTZ  CHAR(8),/* Time zone offset (TOD format):           
*                                      local time-GMT time                      
*                                      of current interval       @C3M*/         
*                6 STGSCILN CHAR(8),/* Actual intvl-len (TOD-format)            
*                                      of current interval       @C3M*/         
*                6 STGSCIET CHAR(8),/* Interval expiration token                
*                                      of current interval       @C3M*/         
*                6 STGSCFLA BIT(32),/* Flag bits                                
*                                      of current interval       @C3M*/         
*                 7 STGSCIES BIT(1),/* "Ended under SMF control" bit            
*                                      of current interval       @C3M*/         
*                 7 *       BIT(31),/* Reserved                  @C3M*/         
*                6 STGSCPET CHAR(8),/* Projected end time(STCK format)          
*                                      of current interval       @C3A*/         
*                6 STGSCOIL FIXED(31),/* Interval length parameter(sec)         
*                                      of current interval       @C3A*/         
*                6 STGSCSYN FIXED(31),/* Sync value parameter (sec)             
*                                      of current interval       @C3A*/         
*                6 STGSCICT FIXED(31),/* Interval counter                       
*                                      of current interval       @C3A*/         
*                6 STGSCTRA POINTER,/* Trace table pointer       @C3A*/         
*                6 * CHAR(12),      /* Reserved area                            
*                                      of current interval       @C3A*/         
*                                                                     '         
*   )SKIP;                                                                      
* ANS(    '    4 STGSE1I,           /* Extended SYNC information                
*                                      for Monitor I             @C3A*/         
*               5 STGS1PET CHAR(8), /* Projected end time(STCK format)          
*                                      of last M I interval      @C3A*/         
*               5 STGS1OIL FIXED(31),/* Interval length parameter(sec)          
*                                      of last M I interval      @C3A*/         
*               5 STGS1SYN FIXED(31),/* Sync value parameter (sec)              
*                                      of last M I interval      @C3A*/         
*               5 STGS1TZ  CHAR(8),  /* Time zone offset (TOD format):          
*                                      local time-GMT time                      
*                                      of last M I interval      @C3M*/         
*                                                                     '         
*   )SKIP;                                                                      
* ANS(    '  /* WLM/SRM Support                                  @C2A*/         
*              4 STGWLMEX,          /* WLM/SRM Extension         @C2A*/         
*                6 STGWPCTA FIXED(31),/* Token for program call entry           
*                                      tables of RMF CommServ    @C2A*/         
*                6 STGWLPSL FIXED(31),/* PC number "SaveListenExitRCAA"         
*                                                                @C2A*/         
*                6 STGM2PCI FIXED(31),/* Monitor II PC-call      @E3C*/         
*                6 * FIXED(31),     /* PC number reserved        @C2A*/         
*                6 STGWCSAR POINTER,/* Pointer to CS info area   @C2A*/         
*                6 STGWLXCE FIXED(31),/* ECB to communicate SRM/WLM             
*                                     "change complete" to MFCLS @C2A*/         
*                6 STGWLXFL BIT(32),/* WLM/SRM Listen Exit flags @C2A*/         
*                 7 STGWLXIP BIT(1),/* Listen exit in progress   @C2A*/         
*                 7 STGWLXWI BIT(1),/* WLM Listen exit inoper.   @C2A*/         
*                 7 STGWLXSI BIT(1),/* SRM Listen exit inoper.   @C2A*/         
*                 7 * BIT(29),      /* Reserved                  @C2A*/         
*                6 STGS_BoostInfo BIT(8), /* Boost info Mon1 SMF @95C*/         
*                 7 STGS_zIIPBoost  BIT(1),                                     
*                 7 STGS_SpeedBoost BIT(1),                                     
*                 7 *               BIT(3),                                     
*                 7 STGS_BoostClass BIT(3),                                     
*                6 STGS_BoostInfo_MIII BIT(8),                                  
*                                   /* Boost info Mon3 SMF       @95C*/         
*                 7 STGS_zIIPBoost_MIII  BIT(1),                                
*                 7 STGS_SpeedBoost_MIII BIT(1),                                
*                 7 *                    BIT(3),                                
*                 7 STGS_BoostClass_MIII BIT(3),                                
*                6 STGS_BoostInfo_MINT BIT(8),                                  
*                                   /* Boost info Mon3 Mintime   @95C*/         
*                 7 STGS_zIIPBoost_MINT  BIT(1),                                
*                 7 STGS_SpeedBoost_MINT BIT(1),                                
*                 7 *                    BIT(3),                                
*                 7 STGS_BoostClass_MINT BIT(3),                                
*                6 * CHAR(5),       /* Reserved for WLM/SRM      @95C*/         
*                                                                     '         
*   )SKIP;                                                                      
* ANS(    '                                                                     
*             4  STGSLXAR BDY(WORD),/* Linkage index (LX) area.                 
                                       This area is not cleared                 
                                       when RMF is restarted     @C5A*/         
*              6 STGSLXFL  BIT(32), /* LX area flags             @C5A*/         
*                8 STGSLXIN BIT(1),  /* ON = LX values are valid @C5A*/         
*                8 *        BIT(31), /* reserved.                @C5A*/         
*              6 STGSLXV1  FIXED(32),/* LX value1. Valid if                     
                                        STGSLXIN = ON. Used for                 
                                        Data Server.             @C5A*/         
*              6 STGSLXV2  FIXED(32),/* LX value 2. Valid if                    
*                                        STGSLXIN = ON. Used for                
                                         WLM support             @C5A*/         
*            2 STGSFRRP PTR(31),    /* pointer to FRR extension used            
                                       by cycle gatherers and GRBMFEVT          
                                                             @WA13001*/         
*                                   /* 1 line deleted        @WA04821*/         
*            2 STGSPDGA POINTER,    /* Pointer to DG info area   @D1A*/         
*            2 STGSFRSA CHAR(32),   /* Floating Pt Reg Save Area @D1A*/         
*            2 STGSCNFX PTR(31),    /* Address of GRBCNFGR/V @WA12872*/         
*            2 STGSEQHP PTR(31),    /* Address of EEQHD          @E1A*/         
*            2 STGGLXDW BDY(DWORD), /* GRS listen exit control,                 
*                                      updated via CDS           @E1A*/         
*              4 STGGLXAC FIXED(32),/* Concurrent active count   @E1A*/         
*              4 STGGLXUC FIXED(32),/* Update count              @E1A*/         
*            2 STGSLSTT CHAR(8),    /* Latch set token for RMF   @E1A*/         
*            2 STGCERST CHAR(8),    /* STOKEN of ENQ DS          @E1A*/         
*            2 STGCERPT PTR(31),    /* Address of repository hdr @E1A*/         
*            2 STGSEQDS CHAR(20) BDY(WORD), /* Data space DSPLIST               
*                                      area                      @E1A*/         
*            2 STGSEDIF CHAR(10),   /* RMF Enable/Disable inf   @A04C*/         
*              5 STGSEDSF BIT(8),   /* Enable/Disable status     @E2A*/         
*                7 STGSEDEN BIT(1), /* =1, RMF is enabled        @E2A*/         
*                7 STGSEDDR BIT(1), /* =1, Deregister is required@E2A*/         
*                7 * BIT(6),        /* Reserved                  @E2A*/         
*              5 * CHAR(1),         /* Reserved                  @E2A*/         
*              5 STGSEDTK CHAR(8),  /* Enable/Disable token      @E2A*/         
*            2 STGSDSFL BIT(8),     /* Dataserver status         @G1A*/         
*              5 STGSDSMS BIT(1),   /* = 1, RMF master           @G1A*/         
*              5 STGSDSHS BIT(1),   /* = 1, RMF helper          @A02A*/         
*              5 STGSHELP BIT(1),   /* = 1, At least one helper                 
*                                           system has collected                
*                                           CF HW data.         @A02A*/         
*              5 *        BIT(5),   /* Reserved                 @A02C*/         
*            2 STGSENV CHAR(1),     /* RMF environment flags    @A01C*/         
*              5 STGSNREP BIT(1),   /* RMF reporter is not                      
*                                      installed or license is                  
*                                      missing                  @A04C*/         
*              5 STGSBSRM BIT(1),   /* Base mode SMF writer message             
*                                      issued                   @A04A*/         
*              5 STGSAltVM BIT(1),  /* Running under an alternate               
*                                      virtual machine environment              
*                                                            @OA63190*/         
*              5 *        BIT(5),   /* Reserved              @OA63190*/         
*            2 STG1RTYP POINTER,    /* Ptr to 1. DS RTY/STY list @F1A*/         
*            2 STG2RTYP POINTER,    /* Ptr to 2. DS RTY/STY list @F1A*/         
*            2 STGSFCD PTR(31),     /* Ptr to FCD data area - not set*/         
*                                   /* anymore, see STGSFCD64    @92C*/         
*            2 STGSFCDS PTR(31),    /* Ptr to FCD NMBR/EXNMBR                   
*                                      selection table           @I1A*/         
*            2 STGSE33P PTR(31),    /* Ptr to ERBMFE33 listen exit              
*                                                            @WA46171*/         
*            2 STGSIZSS CHAR(8)                                                 
*                  BDY(DWORD),      /* Save field for GRBMFIZS   @I1A*/         
*            2 STGSCRYD PTR(31),    /* Ptr to crypto global data -   */         
*                                   /* not set anymore, see STGSCRY64*/         
*                                   /*                           @92C*/         
*            2 STGSCRYA PTR(31),    /* Ptr to crypto enable/disable             
*                                      module                    @J1A*/         
*            2 STGSCRYF BIT(8),     /* Crypto hardware support flags            
*                                                                @J1A*/         
*              3 STGSCYD BIT(1),    /* On = CHSC SCM supported   @93C*/         
*              3 STGSCYDD BIT(1),   /* On = CHSC SCDM supportd   @93A*/         
*            2 *        CHAR(1),    /* Reserved              @OA04812*/         
*            2 STGSLKLV FIXED(16),  /* Linkage level difference                 
*                                      for GRBMFEVT recovery @OA04812*/         
*            2 STGSEVWP PTR(31),    /* Points to GRBMFEVT work area             
*                                                            @OA04812*/         
*            2 *        CHAR(4),    /*                           @41C*/         
*            2 STGSMSTR FIXED(31),  /* Pointer to MASTER address                
*                                      space entry in ASCB       @L1A*/         
*            2 STGSLEAP CHAR(8)                                                 
*                  BDY(DWORD),      /* Leap seconds in TOD                      
*                                      format                @OA23138*/         
*              3 STGSLEAH FIXED(32),/* Leap seconds - word 1 @OA23138*/         
*              3 STGSLEAL FIXED(32),/* Leap seconds - word 2 @OA23138*/         
*            2 STGSCPUD POINTER(31),/* CPU DIAG Data Area addr   @31A*/         
*            2 STGSUPC2 FIXED(32),  /* I/O update count, used by                
*                                      device and I/O Queuing                   
*                                      data gatherer             @62C*/         
*            2 STGSCYCP CHAR(8)                                                 
*                  BDY(DWORD),      /* Max 1 percent of cycle time              
*                                      in TOD format         @OA32719*/         
*            2 STGSMTP1 PTR(31),    /* Ptr to Monitor I MTDA     @71A*/         
*            2 STGSMTP2 PTR(31),    /* Ptr to Monitor II MTDA    @71A*/         
*            2 STGSDMTP PTR(64),    /* Ptr to DMT                @81A*/         
*            2 STGSTNTP PTR(64),    /* Ptr to LE QTNT area       @91A*/         
*            2 STGSFTNT PTR(31),    /* Address of GRBMFTNT       @92C*/         
*            2 *        CHAR(4),    /* Reserved                  @92A*/         
*            2 STGSCYCF CHAR(12)    /* Formatted RMF cycle time and  */         
*                     BDY(WORD),    /* date                      @92A*/         
*              3 STGSCYCTM FIXED(32),/* RMF cycletime in 0.01 sec@92A*/         
*              3 STGSCYCDT CHAR(8), /* Date from RMF cycle TOD in    */         
*                                   /* format MMDDYYYY           @92A*/         
*            2 *        CHAR(4),    /* Reserved                  @92A*/         
*            2 STGSCHA64 PTR(64),   /* 64-bit ptr channel path       */         
*                                   /* data                      @92A*/         
*            2 STGSCPU64 PTR(64),   /* 64-bit ptr CPU event control  */         
*                                   /* data area                 @92A*/         
*            2 STGSCRY64 PTR(64),   /* 64-bit ptr to global crypto   */         
*                                   /* data area                 @92A*/         
*            2 STGSDEV64 PTR(64),   /* 64-bit ptr to Device Event    */         
*                                   /* data area                 @92A*/         
*            2 STGSIOCH64 PTR(64),  /* 64-bit ptr to IOCH        @92A*/         
*                                   /*                           @92A*/         
*            2 STGSIOCT64 PTR(64),  /* 64-bit ptr to IOCT        @92A*/         
*                                   /*                           @92A*/         
*            2 STGSIODN64 PTR(64),  /* 64-bit ptr to IODNT       @92A*/         
*                                   /*                           @92A*/         
*            2 STGSPAG64 PTR(64),   /* 64-bit ptr paging activity    */         
*                                   /* data                      @92A*/         
*            2 STGSPGS64 PTR(64),   /* 64-bit ptr to page data set   */         
*                                   /* event data area           @92A*/         
*            2 STGSTRC64 PTR(64),   /* 64-bit ptr to Trace Data      */         
*                                   /*                           @92A*/         
*            2 STGSFCD64 PTR(64),   /* 64-bit ptr to FCD data        */         
*                                   /* area                      @92A*/         
*            2 STGSADVF CHAR(10),   /* ADV DG Enable/Disable inf                
*                                                               @A04A*/         
*              5 STGSADSF BIT(8),   /* Enable/Disable status    @A04A*/         
*                7 STGSADEN BIT(1), /* =1, ADV DG is enabled    @A04A*/         
*                7 STGSADDR BIT(1), /* =1, Deregister is required               
*                                                               @A04A*/         
*                7 * BIT(6),        /* Reserved                 @A04A*/         
*              5 * CHAR(1),         /* Reserved                 @A04A*/         
*              5 STGSADTK CHAR(8),  /* Enable/Disable token     @A04A*/         
*            2 STGSRESV CHAR(46);   /* Reserved                 @A02C*/         
*                                                                     '         
*   )SKIP;                                                                      
* ANS(    '                                                                     
*             DECLARE (             /* Constants for STGSSOPT    @B3A*/         
*              STGSSNOP CONSTANT(0),/* No M I options active     @B3A*/         
*              STGSSSMF CONSTANT(1),/* SYNC(SMF) or M I down     @B3A*/         
*              STGSSRNO CONSTANT(2),/* NOSYNC                    @B3A*/         
*              STGSSRMF CONSTANT(3) /* SYNC(RMF,nn)              @B3A*/         
*              ) FIXED(8);          /*                           @B3A*/         
*                                                                     '         
*   )SKIP;                                                                      
* ANS(    '                                                                     
*             DECLARE               /* STGST Version for HRM77C0 @92C*/         
*              STGCVER  CONSTANT(''03''X) BIT(8);                               
*             DECLARE               /* STGCSFLG constants    @YA56222*/         
*              SET_STGCSSRB CONSTANT(''80000000''X) BIT(32),                    
*                                   /* SRB routine running   @YA56222*/         
*              SET_STGCSTER CONSTANT(''40000000''X) BIT(32),                    
*                                   /* Termination activated @YA56222*/         
*              SET_STGCSNSR CONSTANT(''20000000''X) BIT(32),                    
*                                   /* no running SRB routine expected          
*                                                            @YA56222*/         
*              SET_STGCSSNC CONSTANT(''10000000''X) BIT(32),                    
*                                   /* SRB has been scheduled and has           
*                                      not yet completed execution              
*                                                            @YA56222*/         
*              SET_STGCSCLS CONSTANT(''08000000''X) BIT(32),                    
*                                   /* GRBMFCLS running          @31A*/         
*              SET_STGCSCEQ CONSTANT(''04000000''X) BIT(32),                    
*                                   /* GRBMFCEQ running      @OA29496*/         
*              RESET_STGCSSRB CONSTANT(''7FFFFFFF''X) BIT(32),                  
*                                   /*no SRB routine running @YA56222*/         
*              RESET_STGCSSNC CONSTANT(''EFFFFFFF''X) BIT(32),                  
*                                   /* no SRB routine scheduled                 
*                                                            @YA56222*/         
*              RESET_STGCSCLS CONSTANT(''F7FFFFFF''X) BIT(32),                  
*                                   /* GRBMFCLS not running  @OA29496*/         
*              RESET_STGCSCEQ CONSTANT(''FBFFFFFF''X) BIT(32);                  
*                                   /* GRBMFCEQ not running  @OA29496*/         
*                                                                     '         
*   )SKIP;                                                                      
* ANS(    '                                                                     
*             DECLARE                                                           
*              STGSFXSP FIXED(8) CONSTANT(253); /* Private LSQA/ELSQA           
*                                      subpool FIXED         @OA42068*/         
*                                                                     '         
*   )SKIP;                                                                      
* ANS(    '                                                                     
*             DECLARE               /* Constants to serialize RMF               
*                                      control and Mon. III  @WA29318*/         
*              ENQ_SER_QNAME_CC CHAR(8)                                         
*                   CONSTANT(''SYSZERB ''), /* Queue name for ENQ/DEQ           
*                                      serialization of access to               
*                                      ERBENQDS queues       @WA29318*/         
*              ENQ_SER_RNAME_CC CHAR(17)                                        
*                   CONSTANT(''ENQ.SERIAL.RMF&M3''), /*                         
*                                      Resource name for ENQ/DEQ                
*                                      serialization of access to               
*                                      ERBENQDS queues       @WA29318*/         
*                                                                               
*              DIO_SER_RNAME_CC CHAR(19)                                        
*                   CONSTANT(''DIO.SERIAL.RMFDYNIO''); /*                       
*                                      Resource name to serialize RMF           
*                                      control table update caused by           
*                                      Dynamic I/O Configuration change         
*                                                                @G3A*/         
*                                                                     '         
*   )SKIP;                                                                      
*  %END;                                                                        
