*/*      Bilingual Mapping Macro for SMF Record 78                              
         MACRO                                                                  
         ERBSMF78 &STYPE                                             */         
*/*** START OF SPECIFICATIONS ****************************************          
*                                                                    *          
*01* Proprietary Statement:                                          *          
*                                                                @61A*          
*       LICENSED MATERIALS - PROPERTY OF IBM                     @61A*          
*       "RESTRICTED MATERIALS OF IBM"                            @61A*          
*       COPYRIGHT IBM CORP. 1983, 2021                               *          
*                                                                @61C*          
*       STATUS: z/OS V2R5 Data Gatherer (HRG77D0)                    *          
*                                                                @61C*          
*01* Macro Name: ERBSMF78                                            *          
*                                                                    *          
*01* Descriptive Name:  SMF RECORD 78 (I/O queuing, VSTOR)           *          
*                                      activity)                     *          
*02* Acronym: SMF78                                                  *          
*                                                                    *          
*01* DSECT Name:                                                     *          
*02*  Subtype 1: SMF78HDR SMF78PRO R781CC   R781CPD  R781DS          *          
*02*  Subtype 2: SMF78HDR SMF78PRO R782COMN R782PVT  R782PVSP        *          
*02*  Subtype 3: SMF78HDR SMF78PRO R783GD   R783IQD  R783CS          *          
*                R783CPD  R783DS R783HPAV                            *          
*                                                                    *          
*01* Component: zOS Data Gatherer (27401)                            *          
*                                                                    *          
*01* Eye-Catcher: None                                               *          
*02*  Offset: N/A                                                    *          
*02*  Length: N/A                                                    *          
*                                                                    *          
*01* Storage Attributes:                                             *          
*02*   Subpool: see below                                            *          
*03*      Subtype 1:                                                 *          
*03*      Subtype 2:                                                 *          
*03*      Subtype 3:                                                 *          
*02*   Key:     8                                                    *          
*02*   Residency: Any                                                *          
*02*   Main Storage: N/A                                             *          
*02*   Auxiliary Storage: N/A                                        *          
*02*   Virtual Storage: N/A                                          *          
*                                                                    *          
*01* FUNCTION: This macro maps the complete SMF record type 78.      *          
*              It has three subtypes:                                *          
*              - Subtype 1 is created by the I/O queuing activty     *          
*                measurements for 308X and 4381 processors.          *          
*              - Subtype 2 is created by the virtual storage         *          
*                activity measurements.                              *          
*              - Subtype 3 is created by the I/O queuing activty     *          
*                measurements for 3090, 9021, 9121, and 9221         *          
*                processors.                                         *          
*              The record consists of following parts:               *          
*              - The fixed portion of the SMF header.                *          
*                This mapping is included by calling ERB78HDR        *          
*                macro.                                              *          
*              - The individual header extension which contains      *          
*                offset/length/number of triplets to address the     *          
*                record parts following the RMF product section.     *          
*                This mapping is included by calling ERB78HDR        *          
*                macro.                                              *          
*              - The RMF product section.                            *          
*                This mapping is included by calling ERB78PRO        *          
*                macro.                                              *          
*              - The IOQ global section                              *          
*                consists of a IOQ global control section and        *          
*                IOP initiative queue data sections.                 *          
*              - The configuration section                           *          
*                consists of a configuration control section and     *          
*                configuration data sections.                        *          
*              - The I/O queuing data sections.                      *          
*                                                                    *          
*01* Notes: None                                                     *          
*                                                                    *          
*01* Size:  See Assembler listing                                    *          
*                                                                    *          
*     Subtype 1:                                                     *          
*                                                                    *          
*        - Common header   :   36 bytes                          @01A*          
*        - Header extension:   24 bytes                          @01A*          
*        - Product section : see ERBPRO  macro                   @01A*          
*        - Data section                                          @01A*          
*          -> I/O control  :   60 bytes                          @01A*          
*          -> I/O data     :   32 bytes                          @01A*          
*                                                                @01A*          
*     Subtype 2:                                                     *          
*                                                                    *          
*        - Common header   :   36 bytes                          @01A*          
*        - Header extension:   24 bytes                          @01A*          
*        - Product section : see ERBPRO  macro                   @01A*          
*        - Data section                                          @01A*          
*          -> common       : 1740 bytes                          @91C*          
*          -> private      :  944 bytes                          @82C*          
*          -> subpool      :   24 bytes                          @01A*          
*                                                                    *          
*     Subtype 3:                                                     *          
*                                                                    *          
*        - Common header            :   36 bytes                 @01A*          
*        - Header extension         :   32 bytes                 @01A*          
*        - Product section          : see ERBPRO  macro          @01A*          
*        - Data section                                          @01A*          
*          -> IOQ global            :  108 bytes                 @01A*          
*          -> IOP data              :  104 bytes                 @92C*          
*          -> IOQ control           :  532 bytes                 @81C*          
*          -> IOQ data              :   76 bytes                 @71C*          
*          -> HyperPAV/SuperPAV data:   88 bytes                 @81C*          
*                                                                    *          
*01* Method of Access:                                               *          
*                                                                    *          
*    BAL : ERBSMF78 type                                             *          
*          If 'type' is omitted, generates the mapping for           *          
*          all subtypes                                              *          
*                                                                    *          
*    PL/X: %IFAR78n='YES' semicolon n = subtype selected             *          
*          %SMFARRAY='YES' (IF ARRAY DECLARE WANTED)                 *          
*          %INCLUDE SYSLIB(ERBSMF78) semicolon                       *          
*                                                                    *          
*          If no preprocessor variable %IFAR74n is set               *          
*          in the including module, subtype 1 is included.           *          
*                                                                    *          
*01* Pointed to by: SMF78PTR                                         *          
*                                                                    *          
*01* Serialization: None                                             *          
*                                                                    *          
*01* Created by:                                                     *          
*02*     Subtype 1: GRBMFDGQ                                         *          
*02*     Subtype 2: GRBMFDVP                                         *          
*02*     Subtype 3: GRBMFDGQ                                         *          
*                                                                    *          
*01* Deleted by:                                                     *          
*02*     Subtype 1: GRBMFDGQ                                         *          
*02*     Subtype 2: GRBMFDVP                                         *          
*02*     Subtype 3: GRBMFDGQ                                         *          
*                                                                    *          
*01* Module-type: BILINGUAL MAPPING MACRO                            *          
*                                                                    *          
*01* STATUS: z/OS V2R5 Data Gatherer (HRG77D0)                       *          
*                                                                    *          
*01* Frequency: 1                                                    *          
*                                                                    *          
*01* Dependencies: None                                              *          
*                                                                    *          
*01* Distribution Library: sys1.maclib                               *          
*                                                                    *          
*01* Change-Acttivity: see below                                     *          
*    $N0=MON1,HRM3102,,SHR: NEW FOR RMF 3.1                      @N0A*          
*    $V1=VSTOR,HRM3202,,RB: VIRTUAL STORAGE REPORT               @V1A*          
*    $O1=4381SP,JRM3212,,SHR: 4381 - SUPPORT                     @O1A*          
*    $P1=3090,HRM3302,,HEN: 3090 - Support                       @P1A*          
*    $Q1=MISC,HRM3402,,SHR: Provide concurrent subtype mapping   @Q1A*          
*    OZ87634 Provide concurrent subtype mapping              @ZA87634*          
*    $Z1=OY29112,HRM4420,,WRC: ESCA Basis                        @Z1A*          
*    $Z2=OY29112,HRM4420,,WRC: Serial & Switch Support           @Z2A*          
*    $A1=DYNIO,JRM4421,,RV: Dynamic I/O Support                  @A1A*          
*    $B1=R430,HRM4430,,HWG: added new DISTLIB statement          @B1A*          
*    LAN: Comment changes only (IODF creation date & time)   @YA64585*          
*    GBO: Cleanup of PADI-inconsistencies                    @WA05544*          
*    $D1=R520,HRM5520,,GBO: SHOWHDR compliance                   @D1A*          
*    SHR: Allows for SMF records 78, subtype 3, when         @WA04821*          
*         running under VM/ESA                               @WA04821*          
*    THE:  Year 2000 support. IODF creation date.            @WA19913*          
*    $I1=DCM,HRM7703,,SHR: Dynamic CHPID Management support      @I1A*          
*    $J1=IOP,HRM7705,,SHR: IOP utilization support               @J1A*          
*    $J2=IQDIO,HRM7705,,PS: iQDIO support                        @J2A*          
*     PS: Fields R783GSAM and R783PB no longer used          @WA50187*          
*    GUB: IOP utilization support                            @WA49806*          
*    $K1=BIT64,OW54010,,VTH: Shared 64bit memory support         @K1A*          
*    $K2=XMP,HRM7708,,PS: T-Rex Support exploitation             @K2A*          
*    FDL: Corrects typo at label VSDGLEN (VSDGAT/VSDGDAT)    @OA06712*          
*    $L1=PPS,OA09921,,WLR: Preferred Paths Support               @L1A*          
*    $01=HPV,OA12865,,PS: HyperPAV Support                       @01A*          
*    $11=FCE,HRM7740,,SHR: FICON enhancements                    @11A*          
*    $21=COMM,HRM7750,,VTH: 64-bit Common Memory support         @21A*          
*    $61=R790,HRM7790,,PS: EXPLICIT COPYRIGHT FOR EXT. MACRO     @61A*          
*    $62=SPLP2,OA38660,,WLR: SCM and Pageable Large Pages Support@62A*          
*    $71=XDF,HRM77A0,,PS: zHPF Extended Distance Support         @71A*          
*    $72=SPLP3,HRM77A0,,JBa: Shared Pageable Large Pages         @72A*          
*     PS: zHPF Extended Distance Support                     @OA44525*          
*    $81=XPAV,HRM77B0,,PS: SuperPAV Alias Tuning support         @81A*          
*    $82=2GB,OA48913,,JBa: Report on 2GB frame usage             @82A*          
*    $91=RUCSA,HRM77C0,,UMu: Restricted Use CSA implementation   @91A*          
*    $92=Cmpr,OA56684,,JBa: EADM Compression support             @92A*          
*    $93=SHR64,OA57325,,UMu: Support 64 bit shared page groups   @93A*          
*     PS: Adds SCM facility bit                              @OA58725*          
*    $A02=ZOSB,HRG77D0,,JBa: Rename prefix ERB to GRB           @A02A*          
*    JKu: Update field description for REST services         @OA62081*          
*                                                                    *          
***** END OF SPECIFICATIONS ******************************************/         
*        %GOTO PLS78;                                                           
*/*                                                                             
         SPACE 2                                                                
**********************  COMMON SMF HEADER  ****************************         
         ERBHDR 78                                                              
         SPACE ,                                                                
**********************  INDIVIDUAL HEADER EXTENSION  ******************         
         SPACE ,                                                                
SMF78HDX DS    0CL12                                          @WA05544          
SMF78DCS DS    BL4      OFFSET TO DATA CONTROL SECTION                          
*                       R781CS   - Subtype 1 IOQ                  @P1C          
*                       R782COMN - Subtype 2 VSTOR                @P1C          
*                       R783CS   - Subtype 3 IOQ - 3090, 9021,                  
*                                  9121, or 9221 support          @Z1C          
SMF78DCL DS    BL2      LENGTH OF DATA CONTROL SECTION                          
SMF78DCN DS    BL2      NUMBER OF DATA CONTROL SECTIONS                         
SMF78ASS DS    BL4      OFFSET TO DATA DATA SECTION                             
*                       R781DS   - Subtype 1 IOQ                  @P1C          
*                       R782PVT  - Subtype 2 VSTOR                @P1C          
*                       R783DS   - Subtype 3 IOQ - 3090, 9021,                  
*                                  9121, or 9221 support          @Z1C          
SMF78ASL DS    BL2      LENGTH OF DATA SECTION                                  
SMF78ASN DS    BL2      NUMBER OF DATA SECTIONS                                 
*                                                                 @P1A          
         LCLC  &X                                                 @P1A          
&X       SETC  T'&STYPE                                           @P1A          
         AIF   ('&X' EQ 'O').HDREXT                               @Q1C          
         AIF   (&STYPE EQ 1).PROSEC                               @P1A          
         AIF   (&STYPE EQ 2).HDREXT                               @P1A          
         AIF   (&STYPE EQ 3).HDREXT                               @P1A          
         SPACE 3                                                                
.ERROR   MNOTE 8,'&STYPE INVALID RECORD SUBTYPE SPECIFIED'        @P1A          
.CONTB   ANOP                                                     @P1A          
         MEXIT                                                                  
         SPACE                                                                  
.HDREXT  ANOP                                                     @P1A          
SMF78SPS DS    BL4      OFFSET TO DATA SECTION                                  
*                       R782PVSP - Subtype 2 VSTOR                @P1C          
SMF78QDS EQU   SMF78SPS OFFSET TO IOQ GLOBAL SECTION                            
*                       (3090, 9021, 9121, and 9221 only)         @Z1C          
SMF78SPL DS    BL2      LENGTH OF DATA SECTION                    @P1C          
SMF78QDL EQU   SMF78SPL LENGTH OF IOQ GLOBAL SECTION              @P1A          
SMF78SPN DS    BL2      NUMBER OF DATA SECTIONS                   @P1C          
SMF78QDN EQU   SMF78SPN NUMBER OF IOQ GLOBAL SECTION              @P1A          
         SPACE 2                                                                
         AIF   (&STYPE EQ 2).PROSEC                               @01A          
SMF78HPS DS    BL4      Offset to HyperPAV/SuperPAV Data Sections @81C          
SMF78HPL DS    BL2      Length of HyperPAV/SuperPAV Data Section  @81C          
SMF78HPN DS    BL2      Number of HyperPAV/SuperPAV Data Sections @81C          
         SPACE                                                                  
.PROSEC  ANOP                                                                   
         SPACE 2                                                                
**********************  COMMON RMF PRODUCT SECTION  *******************         
         ERBPRO 78                                                              
         EJECT                                                                  
         AIF   ('&X' EQ 'O').SUBTYP1                               @P1C         
         AIF   (&STYPE EQ 1).SUBTYP1                               @P1C         
         AIF   (&STYPE EQ 2).SUBTYP2                               @P1C         
         AIF   (&STYPE EQ 3).SUBTYP3                               @P1C         
.SUBTYP1 ANOP                                                                   
***********************************************************************         
*                                                                     *         
*              RELOCATE BLOCK FOR SUB TYPE 1 - MONITOR I              *         
*              I/O QUEUING DATA                                       *         
*                                                                     *         
*              FOR EACH LCU THERE EXISTS AN I/O QUEUING               *         
*              CONFIGURATION SECTION (60 BYTES) AND A                 *         
*              DATA SECTION (28) BYTES. THE MAXIMUM NUMBER            *         
*              OF CHANNEL PATHS WHICH CAN BELONG TO A LCU IS          *         
*              CURRENTLY 4. THEREFORE THE NUMBER OF CONFIGURATION     *         
*              DATA SECTIONS CONTAINED IN A CONFIGURATION             *         
*              SECTION IS ALSO 4.                                     *         
*                                                                     *         
***********************************************************************         
         SPACE 2                                                                
**********************  I/O QUEUING CONFIGURATION CONTROL SECTION  ****         
R781CS   DSECT                                                                  
R781CC   DS    0CL12                                           @WA05544         
R781ID1  DS    BL2      LOGICAL CONTROL UNIT IDENTIFIER            @P1A         
R781NTR  DS    BL2      NUMBER OF DESCRIPTOR TRIPLETS                           
R781CPDS DS    BL4      OFFSET TO CONFIGURATION DATA SECTION                    
R781CPDL DS    BL2      LENGTH OF CONFIGURATION DATA SECTION                    
R781CPDN DS    BL2      NUMBER OF CONFIGURATION DATA SECTIONS                   
R781CD   DS    0C       Configuration data                     @WA05544         
R781CHPN EQU   4                                               @WA05544         
         SPACE 2                                                                
**********************  I/O QUEUING CONFIGURATION DATA SECTION  *******         
R781CPD  DSECT                                                                  
R781CPID DS    BL1      CHANNEL PATH IDENTIFIER                                 
         SPACE ,                                                                
R781CPST DS    BL1      CHANNEL PATH STATUS                                     
R781CPI  EQU   X'80'    CHANNEL PATH INSTALLED                                  
R781CPO  EQU   X'40'    CHANNEL PATH ONLINE                                     
R781CPV  EQU   X'20'    CHANNEL PATH VARIED                                     
R781VPOF EQU   X'10'    PATH OFFLINE (online to the system)        @P1A         
R781VP   EQU   X'08'    PATH VARIED (online to the system)         @P1A         
         SPACE ,                                                                
R781CUN  DS    BL2      NUMBER OF CONTROL UNITS ATTACHED                        
R781CU   DS    0BL8     CONTROL UNITS ATTACHED TO THIS CHANNEL PATH             
R781CU1  DS    BL2      1ST CONTROL UNIT IDENTIFIER                             
R781CU2  DS    BL2      2ND CONTROL UNIT IDENTIFIER                             
R781CU3  DS    BL2      3RD CONTROL UNIT IDENTIFIER                             
R781CU4  DS    BL2      4TH CONTROL UNIT IDENTIFIER                             
         SPACE 2                                                                
**********************  I/O QUEUING DATA SECTION  *********************         
R781DS   DSECT                                                                  
         DS    BL1      reserved                                   @P1A         
R781DST  DS    BL1      DATA STATUS                                             
R781CPS  EQU   X'80'    1... .... ON= NO STCPS DATA AVAILABLE                   
R781NUCB EQU   X'40'    .1.. .... ON= INVALID DATA, NO UCB FOUND                
R781NHMA EQU   X'20'    ..1. .... ON= NO HARDWARE MEASUREMENTS     @O1A         
R781ICT  DS    BL2      COUNT OF SUCCESSIVE UNSUCCESSFUL SAMPLES                
*                       IF THIS COUNT DIFFERS FROM ZERO, THE                    
*                       FOLLOWING FIELDS, BESIDES R781ABY, ARE                  
*                       NOT SET UP                                              
R781ABY  DS    BL4      NUMBER OF SAMPLES WHEN ALL CHANNEL PATHS                
*                       IN THE LCU WERE BUSY, VALID ONLY IF                     
*                       STCPS DATA AVAILABLE                                    
R781TIS  DS    BL4      TOTAL NUMBER OF INITIAL SELECTION ATTEMPTS              
R781SIS  DS    BL4      TOTAL NUMBER OF SUCCESSFUL SELECTION                    
*                       ATTEMPTS                                                
R781CUB  DS    BL4      TOTAL NUMBER OF UNSUCCESSFUL SELECTION                  
*                       ATTEMPTS DUE TO CONTROL UNIT BUSY                       
R781DVB  DS    BL4      TOTAL NUMBER OF UNSUCCESSFUL SELECTION                  
*                       ATTEMPTS DUE TO DEVICE BUSY                             
R781QUE  DS    BL4      TOTAL NUMBER OF REQUESTS QUEUED FOR THE LCU             
*                       (ACCUMULATED AT INITIAL SELECTION TIME)                 
*                       THE FIELD R781QUE IS NOT SET UP FOR I/O    @O1A         
*                       MEASUREMENT LEVEL X'02' 4381 PROCESSORS    @O1A         
R781ID2  DS    BL2      LOGICAL CONTROL UNIT IDENTIFIER            @P1A         
         DS    BL2      RESERVED                                   @P1A         
         AIF   ('&X' EQ 'O').SUBTYP2                               @Q1A         
         MEXIT                                                                  
.SUBTYP2 ANOP                                                                   
***********************************************************************         
*                                                                     *         
*      MAPPING OF MIN/MAX/AVG FIELDS AS USED IN FIELD R782SQAU,       *         
*                        FOR EXAMPLE.                                 *         
*             (SAME MAPPING AS PLX MACRO: ERBVSDAT)                   *         
*                                                                     *         
***********************************************************************         
VSDAT    DSECT          VIRTUAL STORAGE MIN/MAX/AVG DATA                        
VSDSINGL EQU   *                                                                
VSDBMIN  DS    BL4              MINIMUM VALUE FOR BELOW 16M                     
VSDBNTME DS    BL4              TIME STAMP FOR MINIMUM VALUE                    
VSDBMAX  DS    BL4              MAXIMUM VALUE FOR BELOW 16M                     
VSDBXTME DS    BL4              TIME STAMP FOR MAXIMUM VALUE                    
VSDBTOTL DS    E                RUNNING TOTAL FOR ALL SAMPLES                   
*                               BELOW 16M, IN FLOATING POINT   @OA62081         
VSDSLEN  EQU   *-VSDSINGL                                                       
VSDAMIN  DS    BL4              MINIMUM VALUE FOR ABOVE 16M                     
VSDANTME DS    BL4              TIME STAMP FOR MINIMUM VALUE                    
VSDAMAX  DS    BL4              MAXIMUM VALUE FOR ABOVE 16M                     
VSDAXTME DS    BL4              TIME STAMP FOR MAXIMUM VALUE                    
VSDATOTL DS    E                RUNNING TOTAL FOR ALL SAMPLES                   
*                               ABOVE 16M, IN FLOATING POINT   @OA62081         
VSDATLEN EQU   *-VSDAT                                                          
*                                                                               
VSDGDAT   DSECT               VIRTUAL STORAGE MIN/MAX/AVG DATA ABOVE 2G         
VSDGSING  EQU   *                                                  @K1A         
VSDGMIN   DS    CL8             MINIMUM VALUE FOR ABOVE 2G         @K1A         
*                               (LONG FLOATING POINT)              @K1A         
VSDGNTME  DS    BL4             TIME STAMP FOR MINIMUM VALUE       @K1A         
          DS    BL4             RESERVED                           @21A         
VSDGMAX   DS    CL8             MAXIMUM VALUE FOR ABOVE 2G         @K1A         
*                               (LONG FLOATING POINT)              @K1A         
VSDGXTME  DS    BL4             TIME STAMP FOR MAXIMUM VALUE       @K1A         
          DS    BL4             RESERVED                           @21A         
VSDGTOTL  DS    CL8             RUNNING TOTAL FOR ALL SAMPLES      @K1A         
*                               (LONG FLOATING POINT)              @K1A         
VSDGHWM   DS    CL8             HIGH WATERMARK FOR ABOVE 2G        @K1A         
*                               (LONG FLOATING POINT)              @K1A         
VSDGLEN EQU   *-VSDGDAT                                        @OA06712         
*                                                                               
VSDCDAT   DSECT               MIN/MAX/AVG DATA FOR HIGH VIRTUAL COMMON          
*                               MEMORY OBJECTS AND FRAMES          @62C         
VSDCSING  EQU   *                                                  @21A         
VSDCMIN   DS    CL8             MINIMUM VALUE                      @21A         
*                               (LONG FLOATING POINT)              @21A         
VSDCNTME  DS    BL4             TIME STAMP FOR MINIMUM VALUE       @21A         
          DS    BL4             RESERVED                           @21A         
VSDCMAX   DS    CL8             MAXIMUM VALUE                      @21A         
*                               (LONG FLOATING POINT)              @21A         
VSDCXTME  DS    BL4             TIME STAMP FOR MAXIMUM VALUE       @21A         
          DS    BL4             RESERVED                           @21A         
VSDCTOTL  DS    CL8             RUNNING TOTAL FOR ALL SAMPLES      @21A         
*                               (LONG FLOATING POINT)              @21A         
*                                                                  @21A         
VSDCLEN EQU   *-VSDCDAT                                            @21A         
***********************************************************************         
*                                                                     *         
*      RELOCATE BLOCK FOR SUBTYPE 2 - VIRTUAL STORAGE DATA.           *         
*                                                                     *         
*      THERE ARE 3 DATA AREAS: 1) COMMON DATA, 2) PRIVATE DATA,       *         
*      ONE SECTION PER JOB REQUESTED, 3) PRIVATE SUBPOOL DATA,        *         
*      ONE SECTION CONTAINING DATA FOR ALL JOBS.                      *         
*                                                                     *         
***********************************************************************         
R782COMN DSECT                  STATIC STORAGE SECTION             @V1A         
R782PA   DS    BL4              PRIVATE AREA ADDRESS               @V1A         
R782PS   DS    BL4              PRIVATE AREA SIZE                  @V1A         
R782EPA  DS    BL4              EXTENDED PRIVATE AREA ADDRESS      @V1A         
R782EPS  DS    BL4              EXTENDED PRIVATE AREA SIZE         @V1A         
R782CA   DS    BL4              CSA ADDRESS                        @V1A         
R782CS   DS    BL4              CSA SIZE                           @V1A         
R782ECA  DS    BL4              EXTENDED CSA ADDRESS               @V1A         
R782ECS  DS    BL4              EXTENDED CSA SIZE                  @V1A         
R782FLG  DS    BL1              FLAGS                              @91A         
R782RUCD EQU   X'80'            1... .... ON= Restricted Use CSA                
*                                            (RUCSA) is defined    @91A         
         DS    BL3              RESERVED                           @91C         
         DS    BL4              RESERVED                           @V1A         
R782MLA  DS    BL4              MLPA ADDRESS                       @V1A         
R782MLS  DS    BL4              MLPA SIZE                          @V1A         
R782EMLA DS    BL4              EXTENDED MLPA ADDRESS              @V1A         
R782EMLS DS    BL4              EXTENDED MLPA SIZE                 @V1A         
R782FLA  DS    BL4              FLPA ADDRESS                       @V1A         
R782FLS  DS    BL4              FLPA SIZE                          @V1A         
R782EFLA DS    BL4              EFLPA ADDRESS                      @V1A         
R782EFLS DS    BL4              EFLPA SIZE                         @V1A         
R782PLA  DS    BL4              PLPA ADDRESS                       @V1A         
R782PLS  DS    BL4              PLPA SIZE                          @V1A         
R782ELPA DS    BL4              EXTENDED PLPA ADDRESS              @V1A         
R782ELPS DS    BL4              EXTENDED PLPA ASIZE                @V1A         
R782SA   DS    BL4              SQA ADDRESS                        @V1A         
R782SS   DS    BL4              SQA SIZE                           @V1A         
R782ESA  DS    BL4              EXTENDED SQA ADDRESS               @V1A         
R782ESS  DS    BL4              EXTENDED SQA SIZE                  @V1A         
R782NA   DS    BL4              NUCLEUS ADDRESS                    @V1A         
R782NS   DS    BL4              NUCLEUS SIZE                       @V1A         
R782ENA  DS    BL4              EXTENDED NUCLEUS ADDRESS           @V1A         
R782ENS  DS    BL4              EXTENDED NUCLEUS SIZE              @V1A         
R782NL   DS    BL4              NON-ACCESSIBLE PLPA SIZE           @V1A         
R782ENL  DS    BL4              NON-ACCESSIBLE EPLPA SIZE          @V1A         
R782LPAI DS    BL4              INTERMODULE SPACE IN LPA           @V1A         
R782ELPI DS    BL4              INTERMODULE SPACE IN ELPA          @V1A         
R782MR   DS    BL4              MAXIMUM USER REGION BELOW 16M      @V1A         
R782EMR  DS    BL4              MAXIMUM USER REGION ABOVE 16M      @V1A         
************** CSA/SQA USAGE SUMMARY SECTION **************************         
R782SQAU DS    CL(VSDATLEN)     SQA USAGE                          @V1A         
R782CSAU DS    CL(VSDATLEN)     CSA USAGE, INCLUDES RUCSA          @91C         
R782CSAK DS    9CL(VSDATLEN)    CSA USED BY KEY                    @V1A         
************** FREE SPACE ANALYSIS SUMMARY SECTION ********************         
R782CSAF DS    CL(VSDATLEN)     CSA FREE, INCLUDES RUCSA           @91C         
R782CSLF DS    CL(VSDATLEN)     CSA LARGEST FREE BLOCK, CAN EITHER              
*                               BE IN CSA OR RUCSA                 @91C         
R782CSAL DS    CL(VSDATLEN)     CSA ALLOC AREA SIZE, INCLUDES RUCSA             
*                                                                  @91C         
R782SQAF DS    CL(VSDATLEN)     SQA FREE                           @V1A         
R782SQLF DS    CL(VSDATLEN)     SQA LARGEST FREE BLOCK             @V1A         
R782SQAL DS    CL(VSDATLEN)     SQA ALLOC AREA SIZE                @V1A         
R782SQEX DS    CL(VSDATLEN)     SQA EXPANSION TO CSA               @V1A         
************** COMMON STORAGE DETAIL SECTION **************************         
R782227K DS    10CL(VSDSLEN)    CSA SUBPOOL 227 BY KEY,                         
*      IN ORDER KEY 0, 1, 2, 3, 4, 5, 6, 7, 8-F, ALL               @V1A         
R782228K DS    10CL(VSDSLEN)    CSA SUBPOOL 228 BY KEY             @V1A         
R782231K DS    10CL(VSDSLEN)    CSA SUBPOOL 231 BY KEY             @V1A         
R782241K DS    10CL(VSDSLEN)    CSA SUBPOOL 241 BY KEY             @V1A         
R782226  DS    0CL(VSDSLEN)     CSA SUBPOOL 226 BY KEY         @WA05544         
R782226K DS    CL(VSDSLEN)      CSA SUBPOOL 226 BY KEY             @V1A         
R782239  DS    0CL(VSDSLEN)     CSA SUBPOOL 239 BY KEY         @WA05544         
R782239K DS    CL(VSDSLEN)      CSA SUBPOOL 239 BY KEY             @V1A         
R782245  DS    0CL(VSDSLEN)     CSA SUBPOOL 245 BY KEY         @WA05544         
R782245K DS    CL(VSDSLEN)      CSA SUBPOOL 245 BY KEY             @V1A         
************** COMMON STORAGE RESTRICTED USE CSA ******************@91A         
R782RUCA DS    BL4              RUCSA ADDRESS                      @91A         
R782RUCS DS    BL4              RUCSA SIZE                         @91A         
R782ERUCA DS   BL4              EXTENDED RUCSA ADDRESS             @91A         
R782ERUCS DS   BL4              EXTENDED RUCSA SIZE                @91A         
************** PRIVATE AREA SUMMARY DATA SECTION **********************         
R782PVT    DSECT                                                                
R782JOBN DS    CL8              NAME OF JOB BEING MONITORED        @V1A         
R782RDTM DS    BL4              READER START TIME                  @V1A         
R782RDDT DS    BL4              READER START DATE                  @V1A         
R782SUBI DS    BL2              INDEX OF FIRST SUBPOOL ENTRY                    
*                               (R782PVSP) FOR THIS JOB            @V1A         
R782SUBN DS    BL2              INDEX OF LAST SUBPOOL ENTRY                     
*                               FOR THIS JOB                       @V1A         
R782STEP DS    CL8              NAME OF STEP ACTIVE WHEN                        
*                               MONITORING BEGAN                   @V1A         
R782PGMN DS    CL8              PROGRAM NAME OF JOB BEING                       
*                               MONITORED                          @V1A         
R782FLGS DS    BL2                                                              
R782ACTV EQU   X'8000'          JOB ACTIVE AT START OF INTERVAL    @V1A         
R782TERM EQU   X'4000'          JOB TERMINATED DURING INTERVAL     @V1A         
R782GLCH EQU   X'2000'          GETMAIN LIMIT CHANGED DURING INTERVAL           
*                                                                  @V1A         
R782INVL EQU   X'1000'          DATA INVALID DUE TO RMF ABEND WHILE             
*                               SAMPLING                           @V1A         
R782SHRA EQU   X'0800'          SHARED VALUES ABOVE 2G AVAILABLE                
*                               (zOS V1R5 or above)            @OA62081         
R782RSV  DS    BL2              RESERVED                           @V1A         
R782SAMP DS    BL4              NUMBER OF SAMPLES                  @V1A         
R782REGR DS    BL4              REGION REQUESTED BY JCL (BYTES)    @V1A         
R782RGAB DS    BL4              BELOW 16M REGION ASSIGNED                       
*                               BY EXITS (BYTES)                   @V1A         
R782RGAA DS    BL4              ABOVE 16M REGION ASSIGNED                       
*                               BY EXITS (BYTES)                   @V1A         
R782GMLB DS    BL4              GETMAIN LIMIT BELOW 16M (BYTES)    @V1A         
R782GMLA DS    BL4              GETMAIN LIMIT ABOVE 16M (BYTES)    @V1A         
R782URAB DS    BL4              USER REGION ADDRESS (BELOW 16M)    @V1A         
R782URAA DS    BL4              USER REGION ADDRESS (ABOVE 16M)    @V1A         
R782LSFP DS    CL(VSDATLEN)     LSQA/SWA/229/230 FREE PAGES        @V1A         
R782LSFB DS    CL(VSDATLEN)     LSQA/SWA/229/230 LARGST FREE BLOCK @V1A         
R782LSAL DS    CL(VSDATLEN)     LSQA/SWA/229/230 ALLOC AREA SIZE   @V1A         
R782LSPA DS    CL(VSDATLEN)     LSQA/SWA/229/230 PAGES ALLOCATED   @V1A         
R782USFP DS    CL(VSDATLEN)     USER REGION FREE PAGES                          
R782USFB DS    CL(VSDATLEN)     USER REGION LARGEST FREE BLOCK     @V1A         
R782USAL DS    CL(VSDATLEN)     USER REGION ALLOC AREA SIZE        @V1A         
R782USPA DS    CL(VSDATLEN)     USER REGION PAGES ALLOCATED        @V1A         
R782TOBY DS    CL(VSDGLEN)      Total bytes allocated above 2 GB   @K1A         
R782SHBY DS    CL(VSDGLEN)      Number of bytes allocated in shared             
*                               memory objects                     @93C         
R782COBY DS    CL(VSDGLEN)      Number of high virtual common bytes             
*                               allocated in high virtual storage  @62C         
R782TOMO DS    CL(VSDCLEN)      Total number of memory objects                  
*                               allocated in high virtual storage  @62C         
R782SHMO DS    CL(VSDCLEN)      Number of memory objects allocated              
*                               in high virtual shared storage     @62C         
R782COMO DS    CL(VSDCLEN)      Number of memory objects allocated              
*                               in high virtual common storage     @62C         
R782LGMO DS    CL(VSDCLEN)      Number of fixed memory objects that             
*                               can be backed in 1 MB frames       @72C         
R782TOFR DS    CL(VSDCLEN)      Number of 1 MB pages that are fixed             
*                               in central storage                 @72C         
R782MEML DS    BL8              Address space memory limit (in MB) @62C         
R782FIFR DS    CL(VSDCLEN)      Number of 1 MB frames that can be used          
*                               by fixed memory objects            @62A         
R782PAFR DS    CL(VSDCLEN)      Number of 1 MB frames that are used by          
*                               pageable/DREF memory objects       @62A         
R782LSMO DS    CL(VSDCLEN)      Number of shared memory objects that            
*                               can be backed in 1 MB frames       @72A         
R782GFMO DS    CL(VSDCLEN)      Number of fixed memory objects that             
*                               are backed in 2 GB frames          @82A         
R782GFFR DS    CL(VSDCLEN)      Number of 2 GB pages that are fixed             
*                               in central storage                 @82A         
************** PRIVATE AREA SUBPOOL DATA SECTION **********************         
R782PVSP DSECT                                                                  
R782SPN  DS    BL2              SUBPOOL NUMBER                     @V1A         
         DS    BL2              RESERVED                           @V1A         
R782SPD  DS    CL(VSDSLEN)      SUBPOOL DATA                       @V1A         
         AIF   ('&X' EQ 'O').SUBTYP3                               @Q1A         
         MEXIT                                                                  
.SUBTYP3 ANOP                                                                   
***********************************************************************         
*                                                                  @P1A         
*              Relocate block for sub type 3 - Monitor I           @P1A         
*              I/O queuing data in the 3090, 9021, 9121, or 9221   @Z1C         
*              series environment.                                 @Z1C         
*                                                                  @P1A         
*              There exists one IOQ global section which contains  @P1A         
*              global information for one interval and one         @P1A         
*              triplet for the IOP initiative queue data section.  @P1A         
*                                                                  @Z1A         
*              For Serial there are always 4 IOP initiative        @Z1C         
*              queue data sections.                                @Z1C         
*                                                                  @P1A         
*              For each LCU there exists an  I/O queuing           @P1A         
*              configuration section (256 bytes) and a data        @Z1C         
*              section (12 bytes). The maximum number of channel   @P1A         
*              paths which can belong to a LCU is currently 8.     @Z1C         
*              Therefore the number of configuration data sections @P1A         
*              contained in a configuration section is also 8.     @Z1C         
*                                                                  @P1A         
***********************************************************************         
         SPACE 2                                                                
**********************  IOQ global section                                      
**********************  described by SMF78QDS                                   
R783GD   DSECT                                                     @P1A         
         SPACE ,                                                                
R783GFLG DS    BL1      global IOQ status                          @P1A         
R783GCMF EQU   X'80'    1... .... On= Data is invalid due to failure            
*                                     of the channel measurement                
*                                     facility                     @P1A         
R783GDIF EQU   X'40'    .1.. .... On= DIAGNOSE interface failure   @P1A         
R783GSPQ EQU   X'20'    ..1. .... On= Store Primary Queue Data @WA04821         
*                                     not supported            @WA04821         
R783GCMH EQU   X'10'    ...1 .... On= DCM supported by hardware    @I1A         
R783GCMD EQU   X'08'    .... 1... On= Configuration contains DCM   @I1A         
*                                 managed channels                 @I1A         
R783GIUD EQU   X'04'    .... .1.. On=IOP utilization supported @WA49806         
R783GCMR EQU   X'02'    .... ..1. On= initial-command-response-    @K2A         
*                                 time measurements supported      @K2A         
R783GTRD EQU   X'01'    .... ...1 First-transfer-ready-        @OA44525         
*                                 disabled write data          @OA44525         
*                                 available                    @OA44525         
R783GFLX DS    BL1      IOQ global flags extended                  @81C         
R783GAMG EQU   X'80'    1... .... On= Alias Management Groups      @81A         
*                                     available                    @81A         
R783GECP EQU   X'40'    .1.. .... On= EADM-compression facility    @92A         
*                                     available                    @92A         
R783GSCM EQU   X'20'    ..1. .... On= SCM facility available   @OA58725         
*                       ...1 1111 Reserved for future use      @OA58725         
         SPACE ,                                                                
R783GNTR DS    BL2      Number of descriptor triplets              @P1A         
R783GIDS DS    BL4      Offset IOP initiative queue data section   @P1A         
R783GIDL DS    BL2      Length IOP initiative queue data section   @P1A         
R783GIDN DS    BL2      Number IOP initiative queue data section   @P1A         
         SPACE ,                                                                
         DS    BL4      No longer used                        @WA50187          
         SPACE ,                                                                
**********************  Record Control Fields                      @Z1A         
         SPACE ,                                                   @Z1A         
R783TSR DS     BL2      Total number of small records              @Z1A         
        DS     BL2      Unused                                     @Z1A         
R783TOT DS     BL4      Total number of data sections in large     @Z1A         
*                       SMF record                                 @Z1A         
R783NXT DS     BL4      Number of data sections in following       @Z1A         
*                       records                                    @Z1A         
         SPACE ,                                                                
**********************  Dynamic I/O Enhancements                   @A1A         
R783CFL DS     BL1      Configuration Change Flags                 @A1A         
R783DCA EQU    X'80'    1... ....  ON= Config. Changed last intv.  @A1A         
R783IAC EQU    X'40'    .1.. ....  ON= Config. Changed since IPL   @A1A         
R783IOD EQU    X'20'    ..1. ....  ON= IPL via IODF                @A1A         
R783ICV EQU    X'10'    ...1 ....  ON= I/O Token is valid          @A1A         
R783MCS EQU    X'08'    .... 1...  ON= Hardware allows multiple                 
*                                  channel subsystems              @L1A         
*                       .... .111  Reserved                        @L1C         
R783CSS DS     BL1      Channel SubSystem Id, only valid if                     
*                       R783MCS = ON                               @L1A         
        DS     BL2      Reserved                                   @L1C         
R783TNM DS     CL44     IODF Name                                 @A1A          
R783TSF DS     CL2      Suffix of IODF Name                       @A1A          
        DS     CL2      Reserved for Alignement                   @A1A          
R783TOK DS     0CL16    Partial Token information             @WA05544          
R783TDT DS     CL8      IODF creation date mm/dd/yy           @YA64585          
R783TTM DS     CL8      IODF creation time hh.mm.ss           @YA64585          
R783TDY DS     CL10     IODF creation date mm/dd/yyyy         @WA19913          
        DS     CL2      Reserved for Alignement               @WA19913          
         SPACE ,                                                                
**********************  IOP Initiative queue and utilization data  @J1C         
**********************  section                                    @J1C         
**********************  (one per IOP, described by R783GIDS)       @J1C         
R783IQD  DSECT                                                     @P1A         
R783IQID DS    BL2      IOP initiative queue identifier            @P1A         
         SPACE ,                                                                
R783IFLG DS    BL1      IOP flags                                  @P1A         
R783IQI  EQU   X'80'    1... .... On= IOP is installed             @P1A         
         DS    BL1      Reserved                                   @P1A         
R783IQSM DS    BL4      Sum of number of entries placed on the IOP              
*                       initiative queue                           @P1A         
R783IQCT DS    BL4      Count of number of entries placed on the                
*                       IOP initiative queue                       @P1A         
         DS    CL4      Reserved                                   @J1A         
R783IIPB DS    BL8      Number of times the I/O processor was  @WA49806         
*                       busy                                   @WA49806         
*                       Format: long floating point            @WA49806         
R783IIPI DS    BL8      Number of times the I/O processor was  @WA49806         
*                       idle                                   @WA49806         
*                       Format: long floating point            @WA49806         
R783IIFS DS    BL8      Number of I/O functions initially      @WA49806         
*                       started                                @WA49806         
*                       Format: long floating point            @WA49806         
R783IPII DS    BL8      Number of processed I/O interrupts     @WA49806         
*                       Format: long floating point            @WA49806         
R783ICPB DS    BL8      Number of times an I/O was retried due @WA49806         
*                       to channel path busy                   @WA49806         
*                       Format: long floating point            @WA49806         
R783IDPB DS    BL8      Number of times an I/O was retried due @WA49806         
*                       to director port busy                  @WA49806         
*                       Format: long floating point            @WA49806         
R783ICUB DS    BL8      Number of times an I/O was retried due @WA49806         
*                       to control unit busy                   @WA49806         
*                       Format: long floating point            @WA49806         
R783IDVB DS    BL8      Number of times an I/O was retried due @WA49806         
*                       to device busy                         @WA49806         
*                       Format: long floating point            @WA49806         
R783ISCB DS    BL8      Number of times the I/O processor was      @92A         
*                       busy with storage class memory operation   @92A         
*                       Format: long floating point                @92A         
R783IECB DS    BL8      Number of times the I/O processor was      @92A         
*                       busy with compression or decompression     @92A         
*                       Format: long floating point                @92A         
         DS    BL8      Reserved for future use                    @92A         
**********************  I/O Queuing configuration control section               
**********************  (one per LCU, described by SMF78DCS)                    
R783CS   DSECT                                                     @P1A         
R783CC   DS    0CL20                                               @81C         
R783ID1  DS    BL2      Logical control unit identifier            @P1A         
R783NTR  DS    BL2      Number of descriptor triplets              @P1A         
R783CPDS DS    BL4      Offset to configuration data section       @P1A         
R783CPDL DS    BL2      Length of configuration data section       @P1A         
R783CPDN DS    BL2      Number of configuration data sections      @P1A         
         DS    CL3      Reserved for future use                    @81A         
R783AMGC DS    BL1      The Alias Management Group number defined  @81A         
*                       on the physical controller for this LCU.   @81A         
*                       This number is valid, if the LCU is        @81A         
*                       assigned to a DASD subsystem that supports @81A         
*                       Alias Management Groups and bit 7 of       @81A         
*                       R783DST is set                             @81A         
R783AMGS DS    BL4      The Alias Management Group number assigned @81A         
*                       by z/OS for this LCU on this system. This  @81A         
*                       number is valid, if the LCU is assigned to @81A         
*                       a DASD subsystem that supports Alias       @81A         
*                       Management Groups and bit 7 of R783DST is  @81A         
*                       set                                        @81A         
R783CD   DS    0C       Configuration data                     @WA05544         
R783CHPN EQU   8                                               @WA05544         
         SPACE 2                                                                
**********************  I/O Queuing configuration data section                  
**********************  (one per channel path within LCU,                       
**********************   described by R783CPDS)                                 
R783CPD  DSECT                                                     @P1A         
R783CPSD DS    0CL12    Channel path static data               @WA05544         
R783CPID DS    BL1      Channel path identifier                    @P1A         
         SPACE ,                                                                
R783CPST DS    BL1      Channel path status                        @P1A         
R783CPI  EQU   X'80'    Channel path installed                     @P1A         
R783CPO  EQU   X'40'    Channel path online                        @P1A         
R783CPV  EQU   X'20'    Channel path varied                        @P1A         
R783VPOF EQU   X'10'    This channel path is offline to all devices             
*                       to the LCU                                 @P1A         
R783VP   EQU   X'08'    The connectivity of this channel path to                
*                       devices of this LCU has manipulated via VARY            
*                       PATH during this measurement interval      @P1A         
R783NMCD EQU   X'04'    Measured channel path data invalid         @P1A         
R783CPM  EQU   X'02'    Channel path is DCM managed                @I1A         
R783CPMR EQU   X'01'    CHPID manipulated, requiring data reset    @I1A         
         SPACE ,                                                                
R783CUN  DS    BL2      Number of control units attached           @P1A         
R783CU   DS    0BL8     Ctrl units attached to this channel path   @P1A         
R783CU1  DS    BL2      1st control unit identifier                @P1A         
R783CU2  DS    BL2      2nd control unit identifier                @P1A         
R783CU3  DS    BL2      3rd control unit identifier                @P1A         
R783CU4  DS    BL2      4th control unit identifier                @P1A         
R783CPCM DS    0CL16    Channel path measurements              @WA05544         
R783CUB  DS    BL4      Count of control unit busy                 @P1A         
R783PT   DS    BL4      Count of channel path taken                @P1A         
         DS    BL4      No longer used                         @WA50187         
R783DPB  DS    BL4      ES Connection Director Port Busy count     @Z2C         
R783CBT  DS    BL4      Control unit Busy delay Time in units of   @K2C         
*                       128 microseconds valid if R783CPXM=1       @K2A         
R783CMR  DS    BL4      Initial Command Response Time in units of  @K2A         
*                       128 microseconds                           @K2A         
*                       valid if R783CPXM=1 and R783GCMR=1         @K2A         
R783SBS  DS    BL4      Switch Busy count Summation contains the   @K2A         
*                       switch busy counts received for all        @K2A         
*                       partitions valid if R783CPXM=1             @K2A         
         DS    BL4      Reserved for future use                    @K2A         
R783CPXF DS    BL1      Channel path extended flags                @K2A         
R783CPXM EQU   X'80'    1... .... 1= extended I/O-measurement-     @71C         
*                       block format-1 data available              @71C         
R783CPX2 EQU   X'40'    .1.. .... 1= extended I/O-measurement-     @71A         
*                       block format-2 data available              @71A         
R783CPTD EQU   X'20'    ..1. .... 1= First-transfer-ready-disabled @71A         
*                       supported                                  @71A         
R783CPAT DS    BL1      Path attribute:                            @L1A         
*                       0 = No attributes specified                             
*                       1 = Preferred path                                      
*                       2 = Non-preferred path                                  
         DS    BL2      Reserved for future use                    @L1C         
R783CTMW DS    BL4      Transport mode write count                 @71A         
*                       valid if R783CPTD=1                        @71A         
R783CTRD DS    BL4      First-transfer-ready-disabled write count  @71A         
*                       valid if R783CPTD=1                        @71A         
         DS    CL8      Reserved for future use                    @71A         
         SPACE 2                                                                
**********************  I/O Queuing data section                                
**********************  (one per LCU, described by SMF78ASS )                   
R783DS   DSECT                                                                  
R783ID2  DS    BL2      Logical control unit identifier            @P1A         
R783DST  DS    BL1      Data status                                @P1A         
R783NHMA EQU   X'80'    1... .... ON= No hardware measurements     @P1A         
R783LCC  EQU   X'40'    .1.. .... ON= LCU dynamiccally changed     @A1A         
R783LDC  EQU   X'20'    ..1. .... ON= LCU dynamically added        @A1A         
R783LCA  EQU   X'10'    ...1 .... ON= LCU config. change attempted @A1A         
R783LDCM EQU   X'08'    .... 1... ON= LCU contains DCM managed     @I1A         
*                       channels                                   @I1A         
R783LPAT EQU   X'04'    .... .1.. ON= Path attributes are valid    @L1A         
R783HIND EQU   X'02'    .... ..1. ON= LCU has HyperPAV devices     @01A         
R783XIND EQU   X'01'    .... ...1 ON= LCU has SuperPAV devices     @81A         
R783DSTX DS    BL1      Data status extension                      @11C         
R783L1FC EQU   X'80'    1... .... ON= LCU contains at least one    @11A         
*                       FICON channel                              @11A         
R783LCTV EQU   X'40'    .1.. .... ON= Connect time of at least one @11A         
*                       device invalid                             @11A         
R783LDTV EQU   X'20'    ..1. .... ON= Disconnect time of at least  @11A         
*                       one device invalid                         @11A         
R783QSM  DS    BL4      Queued SUM on the CU-HDR queue             @P1A         
R783QCT  DS    BL4      Count of entries placed on the CU-HDR queue             
*                                                                  @P1A         
R783MCMN DS    BL2      Min number of DCM managed channels used    @I1A         
R783MCMX DS    BL2      Max number of DCM managed channels used    @I1A         
R783MCDF DS    BL2      Defined number of DCM managed channels     @I1A         
         DS    BL2      Reserved                                   @I1A         
R783PTM  DS    BL4      Accumulated path taken count for DCM       @I1A         
*                       managed channels                           @I1A         
R783DPBM DS    BL4      Accumulated director port busy count for   @I1A         
*                       DCM managed channels                       @I1A         
R783CUBM DS    BL4      Accumulated control unit busy count for    @I1A         
*                       DCM managed channels                       @I1A         
R783CBTM DS    BL4      Accumulated Control unit Busy Time for     @K2A         
*                       DCM Managed channels valid if R783CPXM=1   @K2A         
R783CMRM DS    BL4      Accumulated initial Command Response time  @K2A         
*                       for DCM Managed channels                   @K2A         
*                       valid if R783CPXM=1 and R783GCMR=1         @K2A         
R783SBSM DS    BL4      Accumulated switch busy count summation    @K2A         
*                       for DCM Managed channels                   @K2A         
*                       valid if R783CPXM=1                        @K2A         
R783DCTM DS    BL4      Accumulated device connect time in units   @11C         
*                       of 128 microseconds                        @11A         
R783DDTM DS    BL4      Accumulated device disconnect time in      @11A         
*                       units of 128 microseconds                  @11A         
R783CSST DS    BL4      Channel SubSystem wait Time in units of    @K2A         
*                       128 microseconds                           @K2A         
R783HCNT DS    BL2      Number of HyperPAV sections for that LCU   @01A         
R783HIX  DS    BL2      Index to first HyperPAV section of that    @01A         
*                       LCU                                        @01A         
R783TMWM DS    BL4      Accumulated transport mode write count     @71A         
*                       for DCM managed channels valid if          @71A         
*                       R783CPTD = 1                               @71A         
R783TRDM DS    BL4      Accumulated first-transfer-ready-disabled  @71A         
*                       write count for DCM managed channels valid @71A         
*                       if R783CPTD = 1                            @71A         
         DS    CL8      Reserved for future use                    @71A         
         SPACE 2                                                                
**********************  HyperPAV/SuperPAV data section             @81C         
**********************  (one per CU, described by SMF78HPS)        @01A         
R783HPAV DSECT                                                     @01A         
R783HLCU DS    CL2      HyperPAV logical control unit identifier   @01A         
R783HCU  DS    BL2      HyperPAV control unit identifier           @01A         
         DS    CL4      Reserved for future use                    @01A         
         SPACE ,                                                                
R783HDAT DS   0CL80     HyperPAV/SuperPAV data                     @81C         
R783HNAI DS    CL4      The number of times an I/O could not start @01A         
*                       for an LSS because no HyperPAV-aliases     @01A         
*                       were available and the device was not      @01A         
*                       waiting for a reserve to be released from  @01A         
*                       another system or long busy to subside     @01A         
*                       (short floating point)                     @01A         
R783HTIO DS    CL4      The total number of HyperPAV I/O requests  @01A         
*                       for the LSS (short floating point)         @01A         
R783HAIU DS    BL4      The high water mark of the number of       @81C         
*                       in-use HyperPAV-alias devices for the LSS  @81C         
*                       (does not include borrowed alias devices)  @81C         
R783HCAD DS    BL4      The high water mark of the number of       @81C         
*                       aliases concurrently in-use by one of the  @81C         
*                       HyperPAV-base devices of the LSS           @01A         
*                       (does include loaned alias devices)        @81A         
R783HIOQ DS    BL4      The high water mark of I/Os queued         @01A         
         DS    CL(12)   Reserved for future use                    @81A         
R783XANC DS    BL4      The number of times an alias was needed to @81A         
*                       start an I/O  (short floating point)       @81A         
R783XAUC DS    BL4      The number of times an alias was needed to @81A         
*                       start an I/O and one was used              @81A         
*                       (short floating point)                     @81A         
R783XNHC DS    BL4      The number of times an alias was needed to @81A         
*                       start an I/O, but none was available in    @81A         
*                       the home LCU (short floating point)        @81A         
R783XABC DS    BL4      The number of times an alias was borrowed  @81A         
*                       from a peer LCU (short floating point)     @81A         
R783XCBC DS    BL4      The number of aliases concurrently         @81A         
*                       borrowed from peer LCUs                    @81A         
R783XHBC DS    BL4      The high water mark of concurrently        @81A         
*                       borrowed aliases from peer LCUs            @81A         
R783XALC DS    BL4      The number of times an alias was loaned to @81A         
*                       a peer LCU (short floating point)          @81A         
R783XCLC DS    BL4      The number of aliases concurrently loaned  @81A         
*                       to peer LCUs                               @81A         
R783XHLC DS    BL4      The high water mark of concurrently loaned @81A         
*                       aliases to peer LCUs                       @81A         
R783XNAG DS    BL4      The number of attempts that were made to   @81A         
*                       borrow an alias from peer LCUs but none    @81A         
*                       were available (short floating point)      @81A         
R783XCQD DS    BL4      The cumulative number of I/Os queued at    @81A         
*                       the subsystem level when aliases were      @81A         
*                       needed (short floating point)              @81A         
R783XCIU DS    BL4      The cumulative number of aliases defined   @81A         
*                       to this subsystem that were in use when    @81A         
*                       aliases were needed (short floating point) @81A         
         MEND  ,                                                                
*        End of Assembler part                                       */         
 %PLS78: ;                                                                      
 /********************************************************************/         
 /* COMMON SMF HEADER                                                */         
 /********************************************************************/         
 ?ERBHDR TYPE(78) ATTRIBUT(BASED(SMF78PTR));                                    
      @SPACE;                                                                   
      /* INDIVIDUAL HEADER EXTENSION */                                         
      @SPACE;                                                                   
       2 SMF78HDX,                  /* HEADER EXTENSION              */         
        3 SMF78DCS FIXED(31),       /* Offset to configuration section          
                                       R781CS (subtype 1), data section         
                                       R782COMN (subtype 2) or                  
                                       configuration section R783CS             
                                       (subtype 3)               @P1C*/         
        3 SMF78DCL FIXED(15),       /* LENGTH OF                                
                                       SECTION                   @V1C*/         
        3 SMF78DCN FIXED(15),       /* NUMBER OF                                
                                       SECTIONS                  @V1C*/         
        3 SMF78ASS FIXED(31),       /* Offset to data section                   
                                       R781DS (subtype 1)                       
                                       R782PVT (subtype 2)                      
                                       R783DS (subtype 3)        @P1C*/         
        3 SMF78ASL FIXED(15),       /* LENGTH OF DATA SECTION        */         
        3 SMF78ASN FIXED(15),       /* NUMBER OF DATA SECTIONS       */         
        3 SMF78SPS FIXED(31),       /* OFFSET TO DATA SECTION R782PVSP          
                          (NOT USED FOR SUBTYPE 1 (IOQ)          @V1A*/         
          5 SMF78QDS FIXED(31),     /* Offset to IOQ global section             
                                                                 @P1A*/         
        3 SMF78SPL FIXED(15),       /* LENGTH OF DATA SECTION    @V1A*/         
          5 SMF78QDL FIXED(15),     /* Length of IOQ global section             
                                                                 @P1A*/         
        3 SMF78SPN FIXED(15),       /* NUMBER OF DATA SECTIONS   @V1A*/         
 %IF (IFAR781 = 'YES') !            /*                           @01A*/         
     (IFAR782 = 'YES')              /*                           @01A*/         
 %THEN %GO TO LHDR78;               /*                           @01A*/         
          5 SMF78QDN FIXED(15),     /* Number of IOQ global section             
                                                                 @01A*/         
        3 SMF78HPS FIXED(31),       /* Offset to HyperPAV/                      
                                       SuperPAV Data Sections    @81C*/         
        3 SMF78HPL FIXED(15),       /* Length of HyperPAV/                      
                                       SuperPAV Data Section     @81C*/         
        3 SMF78HPN FIXED(15);       /* Number of HyperPAV/                      
                                       SuperPAV Data Sections    @81C*/         
 %GO TO LPRO78;                     /* Next is product section   @01A*/         
 %LHDR78:;                          /*                           @01A*/         
 %IF (IFAR783 = 'YES')              /*                           @01A*/         
 %THEN %GO TO LHDX78;               /*                           @01A*/         
          5 SMF78QDN FIXED(15);     /* Number of IOQ global section             
                                                                 @01A*/         
 %GO TO LPRO78;                     /* Next is product section   @01A*/         
 %LHDX78:;                          /* Endof Header extension    @01A*/         
          5 SMF78QDN FIXED(15);     /* Number of IOQ global section             
                                                                 @P1A*/         
      DECLARE                                                                   
       1 SMF783XH BASED(ADDR(SMF78HDX)),/* HEADER EXTENSION      @01A*/         
        3 SMF783HX CHAR(LENGTH(SMF78HDX)), /* Header extension for              
                                       subtype 1 and subtype 2   @01A*/         
        3 SMF78HPS FIXED(31),       /* Offset to HyperPAV/                      
                                       SuperPAV Data Sections    @81C*/         
        3 SMF78HPL FIXED(15),       /* Length of HyperPAV/                      
                                       SuperPAV Data Section     @81C*/         
        3 SMF78HPN FIXED(15);       /* Number of HyperPAV/                      
                                       SuperPAV Data Sections    @81C*/         
 %LPRO78:;                                                                      
    @SPACE;                                                                     
    /* COMMON RMF PRODUCT SECTION */                                            
    @SPACE;                                                                     
 ?ERBPRO TYPE(78) ATTRIBUT(BASED(ADDR(SMF78HDR)+SMF78PRS));                     
    @SPACE;                                                                     
 %IF IFAR781 = '' %THEN %GOTO LR782;/*                           @V1A*/         
    @SPACE;                                                                     
 /********************************************************************/         
 /*                                                                  */         
 /*            RELOCATE BLOCK FOR SUB TYPE 1 - MONITOR I             */         
 /*            I/O QUEUING DATA                                      */         
 /*                                                                  */         
 /*            FOR EACH LCU THERE EXISTS AN I/O QUEUING              */         
 /*            CONFIGURATION SECTION (60 BYTES) AND A                */         
 /*            DATA SECTION (28) BYTES. THE MAXIMUM NUMBER           */         
 /*            OF CHANNEL PATHS WHICH CAN BELONG TO A LCU IS         */         
 /*            CURRENTLY 4. THEREFORE THE NUMBER OF CONFIGURATION    */         
 /*            DATA SECTIONS CONTAINED IN A CONFIGURATION            */         
 /*            SECTION IS ALSO 4.                                    */         
 /*                                                                  */         
 /********************************************************************/         
    @SPACE;                                                                     
    /* I/O QUEUING CONFIGURATION CONTROL SECTION */                             
    @SPACE;                                                                     
    DECLARE                                                                     
      @SPACE;                                                                   
      1 R781CS                                                                  
      %IF SMFARRAY ^= 'YES' %THEN                                               
      %GOTO SKCSARY;                                                            
                (*)                                                             
      %SKCSARY:;                                                                
                    BASED(ADDR(SMF78HDR)+SMF78DCS) BDY(WORD),                   
        3 R781CC,                   /* CONFIGURATION CONTROL         */         
          5 R781ID1 CHAR(2),        /* LOGICAL CONTROL UNIT IDENTIFIER          
                                                                 @P1C*/         
          5 R781NTR FIXED(15),      /* NUMBER OF DESCRIPTOR TRIPLETS */         
          5 R781CPDS FIXED(31),     /* OFFSET TO CONFIGURATION DATA             
                                       SECTION                       */         
          5 R781CPDL FIXED(15),     /* LENGTH OF CONFIGURATION DATA             
                                       SECTION                       */         
          5 R781CPDN FIXED(15),     /* NUMBER OF CONFIGURATION DATA             
                                       SECTIONS                      */         
        3 R781CD CHAR(              /* CONFIGURATION DATA            */         
              R781CHPN*LENGTH(R781CPD));                                        
    @SPACE;                                                                     
    DECLARE                                                                     
      @SPACE;                                                                   
      R781CHPN BINARY FIXED(15)     /* NUMBER OF CONFIGURATION DATA             
                                       SECTIONS GENERATED            */         
          CONSTANT(4);                                                          
    @SPACE;                                                                     
    /* I/O QUEUING CONFIGURATION DATA SECTION */                                
    @SPACE;                                                                     
    DECLARE                                                                     
      @SPACE;                                                                   
      1 R781CPD                                                                 
      %IF SMFARRAY ^= 'YES' %THEN                                               
      %GOTO SKCPARY;                                                            
                (*)                                                             
      %SKCPARY:;                                                                
                    CHAR(12) BASED(ADDR(R781CS)+R781CPDS) BDY(WORD),            
        3 R781CPID CHAR(1),         /* CHANNEL PATH IDENTIFIER       */         
        3 R781CPST BIT(8),          /* CHANNEL PATH STATUS           */         
          5 R781CPI BIT(1),         /* =1 IF CHANNEL PATH INSTALLED  */         
          5 R781CPO BIT(1),         /* =1 IF CHANNEL PATH ONLINE     */         
          5 R781CPV BIT(1),         /* =1 IF CHANNEL PATH VARIED     */         
          5 R781VPOF BIT(1),        /* =1 This channel path is offline          
                                          to all devices of the LCU             
                                                                 @P1A*/         
          5 R781VP  BIT(1),         /* =1 The connectivity of this              
                                          channel path to devices of            
                                          this LCU has manipulated via          
                                          VARY PATH during this                 
                                          measurement interval   @P1A*/         
          5 * BIT(3),               /* unused                    @P1C*/         
        3 R781CUN FIXED(15),        /* NUMBER OF CONTROL UNITS                  
                                       ATTACHED                      */         
        3 R781CU CHAR(8),           /* CONTROL UNITS ATTACHED TO                
                                       THIS CHANNEL PATH             */         
          5 R781CU1 CHAR(2),        /* 1ST CONTROL UNIT IDENTIFIER   */         
          5 R781CU2 CHAR(2),        /* 2ND CONTROL UNIT IDENTIFIER   */         
          5 R781CU3 CHAR(2),        /* 3RD CONTROL UNIT IDENTIFIER   */         
          5 R781CU4 CHAR(2);        /* 4TH CONTROL UNIT IDENTIFIER   */         
    @SPACE;                                                                     
    /* I/O QUEUING DATA SECTION */                                              
    @SPACE;                                                                     
    DECLARE                                                                     
      @SPACE;                                                                   
      1 R781DS                                                                  
      %IF SMFARRAY ^= 'YES' %THEN                                               
      %GOTO SKDSARY;                                                            
               (*)                                                              
      %SKDSARY:;                                                                
                   BASED(ADDR(SMF78HDR)+SMF78ASS) BDY(WORD),                    
        3 *       CHAR(1),          /* Reserved                  @P1C*/         
        3 R781DST BIT(8),           /* DATA STATUS                   */         
          5 R781CPS BIT(1),         /* =1 IF NO STCPS DATA AVAILABLE */         
          5 R781NUCB BIT(1),        /* =1 IF NO UCB COULD BE FOUND   */         
          5 R781NHMA BIT(1),        /* =1 If no hardware measurements           
                                       available                 @O1A*/         
          5 * BIT(5),               /* RESERVED                  @O1C*/         
        3 R781ICT FIXED(16),        /* COUNT OF SUCCESSIVE UNSUCCESSFUL         
                                       SAMPLES, IF THIS COUNT DIFFERS           
                                       FROM ZERO, THE FOLLOWING FIELDS,         
                                       BESIDES R781ABY, ARE NOT                 
                                       SET UP                        */         
        3 R781ABY FIXED(32),        /* NUMBER OF SAMPLES WHEN ALL               
                                       CHANNEL PATHS IN THE LCU                 
                                       WERE BUSY, VALID ONLY IF                 
                                       STCPS DATA AVAILABLE          */         
        3 R781TIS FIXED(32),        /* TOTAL NUMBER OF INITIAL                  
                                       SELECTION ATTEMPTS            */         
        3 R781SIS FIXED(32),        /* TOTAL NUMBER OF SUCCESSFUL               
                                       SELECTION ATTEMPTS            */         
        3 R781CUB FIXED(32),        /* TOTAL NUMBER OF UNSUCCESSFUL             
                                       SELECTION ATTEMPTS DUE TO                
                                       CONTROL UNIT BUSY             */         
        3 R781DVB FIXED(32),        /* TOTAL NUMBER OF UNSUCCESSFUL             
                                       SELECTION ATTEMPTS DUE TO                
                                       DEVICE BUSY                   */         
        3 R781QUE FIXED(32),        /* TOTAL NUMBER OF REQUESTS QUEUED          
                                       FOR THE LCU (ACCUMULATED AT              
                                       INITIAL SELECTION TIME),                 
                                       THIS FIELD IS NOT SET UP FOR             
                                       I/O MEASUREMENT LEVEL X'02'              
                                       4381 PROCESSORS           @O1C*/         
        3 R781ID2 CHAR(2),          /* LOGICAL CONTROL UNIT ID   @P1A*/         
        3 *       CHAR(2);          /* reserved                  @P1A*/         
    @SPACE;                                                                     
  %LR782:;                                                                      
  %IF IFAR782 = '' %THEN %GOTO LR783; /*                         @V1A*/         
      /* RELOCATE BLOCK FOR SUBTYPE 2 - VIRTUAL STORAGE DATA.  THERE            
         ARE 3 DATA AREAS: 1) COMMON DATA, 2) PRIVATE DATA, ONE                 
         SECTION PER JOB REQUESTED, 3) PRIVATE SUBPOOL DATA,                    
         ONE SECTION CONTAINING DATA FOR ALL JOBS. */                           
 DCL 1 R782COMN BASED (ADDR(SMF78HDR)+SMF78DCS) BDY(WORD),                      
     /* STATIC STORAGE SECTION @V1A*/                                           
   3 R782PA PTR,                     /* PRIVATE AREA ADDRESS     @V1A*/         
   3 R782PS FIXED(31),               /* PRIVATE AREA SIZE        @V1A*/         
   3 R782EPA PTR,               /* EXTENDED PRIVATE AREA ADDRESS @V1A*/         
   3 R782EPS FIXED(31),           /* EXTENDED PRIVATE AREA SIZE  @V1A*/         
   3 R782CA PTR,                     /* CSA ADDRESS              @V1A*/         
   3 R782CS FIXED(31),               /* CSA SIZE                 @V1A*/         
   3 R782ECA PTR,                    /* EXTENDED CSA ADDRESS     @V1A*/         
   3 R782ECS FIXED(31),              /* EXTENDED CSA SIZE        @V1A*/         
   3 R782FLG    BIT(8),              /* FLAGS                    @91A*/         
     5 R782RUCD BIT(1),              /* =1 Restricted Use CSA        */         
                                     /*    (RUCSA) is defined    @91A*/         
     5 * BIT(7),                     /* RESERVED                 @91A*/         
   3 * FIXED(24),                    /* RESERVED                 @91C*/         
   3 * FIXED(31),                    /* RESERVED                 @V1A*/         
   3 R782MLA PTR,                    /* MLPA ADDRESS             @V1A*/         
   3 R782MLS FIXED(31),              /* MLPA SIZE                @V1A*/         
   3 R782EMLA PTR,                   /* EXTENDED MLPA ADDRESS    @V1A*/         
   3 R782EMLS FIXED(31),             /* EXTENDED MLPA SIZE       @V1A*/         
   3 R782FLA PTR,                    /* FLPA ADDRESS             @V1A*/         
   3 R782FLS FIXED(31),              /* FLPA SIZE                @V1A*/         
   3 R782EFLA PTR,                   /* EFLPA ADDRESS            @V1A*/         
   3 R782EFLS FIXED(31),             /* EFLPA SIZE               @V1A*/         
   3 R782PLA PTR,                    /* PLPA ADDRESS             @V1A*/         
   3 R782PLS FIXED(31),              /* PLPA SIZE                @V1A*/         
   3 R782ELPA PTR,                   /* EXTENDED PLPA ADDRESS    @V1A*/         
   3 R782ELPS PTR,                   /* EXTENDED PLPA ASIZE      @V1A*/         
   3 R782SA PTR,                     /* SQA ADDRESS              @V1A*/         
   3 R782SS FIXED(31),               /* SQA SIZE                 @V1A*/         
   3 R782ESA PTR,                    /* EXTENDED SQA ADDRESS     @V1A*/         
   3 R782ESS FIXED(31),              /* EXTENDED SQA SIZE        @V1A*/         
   3 R782NA PTR,                     /* NUCLEUS ADDRESS          @V1A*/         
   3 R782NS FIXED(31),               /* NUCLEUS SIZE             @V1A*/         
   3 R782ENA PTR,                    /* EXTENDED NUCLEUS ADDRESS @V1A*/         
   3 R782ENS FIXED(31),              /* EXTENDED NUCLEUS SIZE    @V1A*/         
   3 R782NL FIXED(31),               /* NON-ACCESSIBLE PLPA SIZE @V1A*/         
   3 R782ENL FIXED(31),             /* NON-ACCESSIBLE EPLPA SIZE @V1A*/         
   3 R782LPAI FIXED(31),             /* INTERMODULE SPACE IN LPA @V1A*/         
   3 R782ELPI FIXED(31),            /* INTERMODULE SPACE IN ELPA @V1A*/         
   3 R782MR FIXED(31),         /* MAXIMUM USER REGION BELOW 16M  @V1A*/         
   3 R782EMR FIXED(31),        /* MAXIMUM USER REGION ABOVE 16M  @V1A*/         
      /* CSA/SQA USAGE SUMMARY SECTION */                                       
   3 R782SQAU CHAR(LENGTH(VSDAT)),   /* SQA USAGE                @V1A*/         
   3 R782CSAU CHAR(LENGTH(VSDAT)),   /* CSA USAGE, INCLUDES RUCSA               
                                                                 @91C*/         
   3 R782CSAK(9) CHAR(LENGTH(VSDAT)),/* CSA USED BY KEY          @V1A*/         
      /* FREE SPACE ANALYSIS SUMMARY SECTION */                                 
   3 R782CSAF CHAR(LENGTH(VSDAT)),   /* CSA FREE, INCLUDES RUCSA @91C*/         
   3 R782CSLF CHAR(LENGTH(VSDAT)),   /* CSA LARGEST FREE BLOCK, CAN             
                                        EITHER BE IN CSA OR RUCSA               
                                                                 @91C*/         
   3 R782CSAL CHAR(LENGTH(VSDAT)),   /* CSA ALLOC AREA SIZE, INCLUDES           
                                        RUCSA                    @91C*/         
   3 R782SQAF CHAR(LENGTH(VSDAT)),   /* SQA FREE                 @V1A*/         
   3 R782SQLF CHAR(LENGTH(VSDAT)),   /* SQA LARGEST FREE BLOCK   @V1A*/         
   3 R782SQAL CHAR(LENGTH(VSDAT)),   /* SQA ALLOC AREA SIZE      @V1A*/         
   3 R782SQEX CHAR(LENGTH(VSDAT)),   /* SQA EXPANSION TO CSA     @V1A*/         
      /* COMMON STORAGE DETAIL SECTION */                                       
   3 R782227K(10) CHAR(LENGTH(VSDSINGL)), /* CSA SUBPOOL 227 BY KEY, IN         
              ORDER KEY 0, 1, 2, 3, 4, 5, 6, 7, 8-F, ALL         @V1A*/         
   3 R782228K(10) CHAR(LENGTH(VSDSINGL)), /* CSA SUBPOOL 228 BY KEY             
                                                                 @V1A*/         
   3 R782231K(10) CHAR(LENGTH(VSDSINGL)), /* CSA SUBPOOL 231 BY KEY             
                                                                 @V1A*/         
   3 R782241K(10) CHAR(LENGTH(VSDSINGL)), /* CSA SUBPOOL 241 BY KEY             
                                                                 @V1A*/         
   3 R782226     CHAR(LENGTH(VSDSINGL)), /* SQA SUBPOOL 226      @V1A*/         
     5 R782226K  CHAR(LENGTH(VSDSINGL)), /* SQA SUBPOOL 226  @WA05544*/         
   3 R782239     CHAR(LENGTH(VSDSINGL)), /* SQA SUBPOOL 239      @V1A*/         
     5 R782239K  CHAR(LENGTH(VSDSINGL)), /* SQA SUBPOOL 239  @WA05544*/         
   3 R782245     CHAR(LENGTH(VSDSINGL)), /* SQA SUBPOOL 245      @V1A*/         
     5 R782245K  CHAR(LENGTH(VSDSINGL)), /* SQA SUBPOOL 245      @91C*/         
      /* COMMON STORAGE RESTRICTED USE CSA SECTION               @91A*/         
   3 R782RUCA  PTR,                  /* RUCSA ADDRESS            @91A*/         
   3 R782RUCS  FIXED(31),            /* RUCSA SIZE               @91A*/         
   3 R782ERUCA PTR,                  /* EXTENDED RUCSA ADDRESS   @91A*/         
   3 R782ERUCS FIXED(31);            /* EXTENDED RUCSA SIZE      @91A*/         
      /* PRIVATE AREA SUMMARY DATA SECTION */                                   
 DCL 1 R782PVT                                                                  
  %IF SMFARRAY^='YES' %THEN %GOTO SKIPPVT;                                      
  (*)                                                                           
  %SKIPPVT:;                                                                    
  BASED(ADDR(SMF78HDR)+SMF78ASS) BDY(WORD),/* VIRTUAL STORAGE PRIVATE           
                                              DATA               @V1A*/         
   3 R782JOBN CHAR(8),                /* NAME OF JOB BEING                      
                                         MONITORED               @V1A*/         
   3 R782RDTM CHAR(4),                /* READER START TIME       @V1A*/         
   3 R782RDDT CHAR(4),                /* READER START DATE       @V1A*/         
   3 R782SUBI FIXED(15),              /* INDEX OF FIRST SUBPOOL ENTRY           
                                         (R782PVSP) FOR THIS JOB @V1A*/         
   3 R782SUBN FIXED(15),              /* INDEX OF LAST SUBPOOL ENTRY            
                                         FOR THIS JOB            @V1A*/         
   3 R782STEP CHAR(8),                /* NAME OF STEP ACTIVE WHEN               
                                         MONITORING BEGAN        @V1A*/         
   3 R782PGMN CHAR(8),                /* PROGRAM NAME OF JOB BEING              
                                         MONITORED               @V1A*/         
   3 R782FLGS BIT(16),                                                          
     5 R782ACTV BIT(1),               /* 1: JOB ACTIVE AT START OF              
                                            INTERVAL             @V1A*/         
     5 R782TERM BIT(1),               /* 1: JOB TERMINATED DURING               
                                            INTERVAL             @V1A*/         
     5 R782GLCH BIT(1),               /* 1: GETMAIN LIMIT CHANGED               
                                            DURING INTERVAL      @V1A*/         
     5 R782INVL BIT(1),               /* 1: DATA INVALID DUE TO RMF             
                                            ABEND WHILE SAMPLING @V1A*/         
     5 R782SHRA BIT(1),               /* 1: SHARED VALUES ABOVE 2G              
                                            AVAILABLE (z/OS V1R5                
                                            or above)        @OA62081*/         
   3 R782RSV BIT(16),                 /* RESERVED                @V1A*/         
   3 R782SAMP FIXED(31),              /* NUMBER OF SAMPLES       @V1A*/         
   3 R782REGR FIXED(31),              /* REGION REQUESTED BY JCL                
                                         (BYTES)                 @V1A*/         
   3 R782RGAB FIXED(31),              /* BELOW 16M REGION ASSIGNED              
                                         BY EXITS (BYTES)        @V1A*/         
   3 R782RGAA FIXED(31),              /* ABOVE 16M REGION ASSIGNED              
                                         BY EXITS (BYTES)        @V1A*/         
   3 R782GMLB FIXED(31),              /* GETMAIN LIMIT BELOW 16M                
                                         (BYTES)                 @V1A*/         
   3 R782GMLA FIXED(32),              /* GETMAIN LIMIT ABOVE 16M                
                                         (BYTES)                 @V1A*/         
   3 R782URAB FIXED(31),              /* USER REGION ADDRESS                    
                                         (below 16M)             @V1A*/         
   3 R782URAA FIXED(31),              /* USER REGION ADDRESS                    
                                         (above 16M)             @V1A*/         
   3 R782LSFP CHAR(LENGTH(VSDAT)),    /* LSQA/SWA/229/230 FREE                  
                                         PAGES                   @V1A*/         
   3 R782LSFB CHAR(LENGTH(VSDAT)),    /* LSQA/SWA/229/230 LARGEST               
                                         FREE BLOCK              @V1A*/         
   3 R782LSAL CHAR(LENGTH(VSDAT)),    /* LSQA/SWA/229/230                       
                                         ALLOC AREA SIZE         @V1A*/         
   3 R782LSPA CHAR(LENGTH(VSDAT)),    /* LSQA/SWA/229/230                       
                                         PAGES ALLOCATED         @V1A*/         
   3 R782USFP CHAR(LENGTH(VSDAT)),    /* USER REGION FREE PAGES  @V1A*/         
   3 R782USFB CHAR(LENGTH(VSDAT)),    /* USER REGION LARGEST FREE               
                                         BLOCK                   @V1A*/         
   3 R782USAL CHAR(LENGTH(VSDAT)),    /* USER REGION ALLOC AREA                 
                                         SIZE                    @V1A*/         
   3 R782USPA CHAR(LENGTH(VSDAT)),    /* USER REGION PAGES ALLOCATED            
                                                                 @V1A*/         
   3 R782TOBY CHAR(LENGTH(VSDGDAT)),  /* Total bytes allocated                  
                                         above 2 GB              @K1A*/         
   3 R782SHBY CHAR(LENGTH(VSDGDAT)),  /* Number of bytes allocated in           
                                         shared memory objects   @93C*/         
   3 R782COBY CHAR(LENGTH(VSDGDAT)),  /* Number of high virtual common          
                                         bytes allocated in high                
                                         virtual storage         @62C*/         
   3 R782TOMO CHAR(LENGTH(VSDCDAT)),  /* Total number of memory                 
                                         objects allocated       @62C*/         
   3 R782SHMO CHAR(LENGTH(VSDCDAT)),  /* Number of memory objcts                
                                         allocated in high virtual              
                                         shared storage          @62C*/         
   3 R782COMO CHAR(LENGTH(VSDCDAT)),  /* Number of memory objcts                
                                         allocated in high virtual              
                                         common storage          @62C*/         
   3 R782LGMO CHAR(LENGTH(VSDCDAT)),  /* Number of fixed memory objects         
                                         that can be backed in 1 MB             
                                         frames                  @72C*/         
   3 R782TOFR CHAR(LENGTH(VSDCDAT)),  /* Number of 1 MB frames                  
                                         that are fixed in central              
                                         storage                 @72C*/         
   3 R782MEML CHAR(8),                /* Address space memory limit             
                                         (in MB)                 @62C*/         
   3 R782FIFR CHAR(LENGTH(VSDCDAT)),  /* Number of 1 MB frames that can         
                                         be used by fixed memory                
                                         objects                 @62A*/         
   3 R782PAFR CHAR(LENGTH(VSDCDAT)),  /* Number of 1 MB frames that are         
                                         used by pageable/DREF memory           
                                         objects                 @72C*/         
   3 R782LSMO CHAR(LENGTH(VSDCDAT)),  /* Number of shared memory                
                                         objects that can be backed in          
                                         1 MB frames             @82C*/         
   3 R782GFMO CHAR(LENGTH(VSDCDAT)),  /* Number of fixed memory objects         
                                         that are backed in 2 GB                
                                         frames                  @82A*/         
   3 R782GFFR CHAR(LENGTH(VSDCDAT));  /* Number of 2 GB pages                   
                                         that are fixed in central              
                                         storage                 @82A*/         
      /* PRIVATE AREA SUBPOOL DATA SECTION */                                   
  DCL 1 R782PVSP(*) BASED (ADDR(SMF78HDR)+SMF78SPS) BDY(WORD),                  
   3 R782SPN FIXED(15),               /* SUBPOOL NUMBER          @V1A*/         
   3 *       FIXED(15),               /* RESERVED                @V1A*/         
   3 R782SPD CHAR(LENGTH(VSDSINGL));  /* SUBPOOL DATA            @V1A*/         
  %LR783:;                            /*                         @V1A*/         
  %IF IFAR783 = '' %THEN %GOTO LR784; /*                         @P1A*/         
 /********************************************************************/         
 /*                                                                  */         
 /*          Relocate block for sub type 3 - Monitor I               */         
 /*          I/O queuing data in the 3090, 9021, 9121, and 9221      */         
 /*          series environment.                                 @Z1C*/         
 /*                                                                  */         
 /*          There exists one IOQ global section which contains      */         
 /*          global information for one interval and one             */         
 /*          triplet for the IOP initiative queue data section.      */         
 /*                                                                  */         
 /*          For Rel. 4.1.2 there are always 4 IOP               @Z1C*/         
 /*          initiative queue data sections.                         */         
 /*                                                                  */         
 /*          For each LCU there exists an  I/O queuing               */         
 /*          configuration section (256 bytes) and a data        @Z1C*/         
 /*          section (12 bytes). The maximum number of channel       */         
 /*          paths which can belong to a LCU is currently 8.     @Z1C*/         
 /*          Therefore the number of configuration data sections     */         
 /*          contained in a configuration section is also 8.     @Z1C*/         
 /*                                                                  */         
 /********************************************************************/         
         @SPACE;                                                                
 /********************************************************************/         
 /* IOQ Global section.                                              */         
 /* (one per interval, described by SMF78QDS).                       */         
 /********************************************************************/         
         @SPACE;                                                                
   DECLARE                                                                      
   1 R783GD      BASED(ADDR(SMF78HDR)+SMF78QDS) BDY(WORD),                      
     3 R783GFLG BIT(8),             /* IOQ global flag           @P1A*/         
       5 R783GCMF BIT(1),           /* X'80' Data is invalid due to             
                                             failure of the channel             
                                             measurement facility               
                                                                 @P1A*/         
       5 R783GDIF BIT(1),           /* X'40' DIAGNOSE interface failed          
                                                                 @P1A*/         
       5 R783GSPQ BIT(1),           /* X'20' Store Primary Queue Data           
                                       not supported         @WA04821*/         
       5 R783GCMH BIT(1),           /* X'10' DCM supported by hardware          
                                                                 @I1A*/         
       5 R783GCMD BIT(1),           /* X'08' Configuration contains             
                                       DCM managed channels      @I1A*/         
       5 R783GIUD BIT(1),           /* X'04' IOP utilization data               
                                       supported             @WA49806*/         
       5 R783GCMR BIT(1),           /* Initial-command-response-                
                                       time measurements                        
                                       supported                 @K2A*/         
       5 R783GTRD BIT(1),           /* First-transfer-ready-                    
                                       disabled write data                      
                                       available             @OA44525*/         
     3 R783GFLX BIT(8),             /* IOQ global flags extended @81C*/         
       5 R783GAMG BIT(1),           /* X'80' Alias Management                   
                                       Groups available          @81A*/         
       5 R783GECP BIT(1),           /* X'40' EADM-compression                   
                                       facility available        @92A*/         
       5 R783GSCM BIT(1),           /* X'20' SCM facility                       
                                       available             @OA58725*/         
       5 * BIT(5),                  /* Reserved for future                      
                                       use                   @OA58725*/         
     3 R783GNTR FIXED(15),          /* Number of triplets        @P1A*/         
     3 R783GIDS PTR(31),            /* Offset to IOP initiative queue           
                                       data section              @P1A*/         
     3 R783GIDL FIXED(15),          /* Length of IOP initiative queue           
                                       data section              @P1A*/         
     3 R783GIDN FIXED(15),          /* Number of IOP initiative queue           
                                       data sections             @P1A*/         
         @SPACE;                                                                
     3 *        CHAR(4),            /* No longer used        @WA50187*/         
         @SPACE;                                                                
  /* Record Control fields                                      @Z1A*/          
         @SPACE;                                                                
     3  R783TSR FIXED(16),     /* Total number of small records @Z1A*/          
     3  *       CHAR(2),       /* Reserved for future use       @Z1A*/          
     3  R783TOT FIXED(32),     /* Total number of data sections                 
                                  in large SMF record           @Z1A*/          
     3  R783NXT FIXED(32),     /* Number of data sections                       
                                  in following records          @Z1A*/          
         @SPACE;                                              /*@Z1A*/          
  /* Dynamic I/O Enhancements                                   @A1A*/          
     3  R783CFL BIT(8),        /* Configuration Change Flags    @A1A*/          
       5 R783DCA BIT(1),       /* Configuration changed last                    
                                  interval                      @A1A*/          
       5 R783IAC BIT(1),       /* Configuration Changed since                   
                                  last IPL                      @A1A*/          
       5 R783IOD BIT(1),       /* System IPLed via IODF         @A1A*/          
       5 R783ICV BIT(1),       /* I/O Configuration Token is                    
                                  valid                         @A1A*/          
       5 R783MCS BIT(1),       /* Hardware allows multiple channel              
                                  subsystems                    @L1A*/          
       5 *       BIT(3),       /* Reserved                      @L1C*/          
     3 R783CSS FIXED(8),       /* Channel SubSystem Id, only valid if           
                                  R783MCS = ON                  @L1A*/          
     3 *        BIT(16),       /* reserved                      @L1C*/          
     3 R783TNM  CHAR(44),      /* IODF name                     @A1A*/          
     3 R783TSF  CHAR(2),       /* Suffix of IODF Name           @A1A*/          
     3 *        CHAR(2),       /* Reserved                      @A1A*/          
     3 R783TOK  CHAR(16),      /* Partially Token Information   @A1A*/          
       5 R783TDT CHAR(8),      /* IODF Creation Date mm/dd/yy                   
                                                            @YA64585*/          
       5 R783TTM CHAR(8),      /* IODF Creation Time hh.mm.ss                   
                                                            @YA64585*/          
     3 R783TDY  CHAR(10),      /* IODF creation date mm/dd/yyyy                 
                                                            @WA19913*/          
     3 *        CHAR(2);       /* Reserved                  @WA19913*/          
         @SPACE;                                                                
 /********************************************************************/         
 /* IOP Initiative queue and utilization data section.           @J1C*/         
 /* (one per IOP, described by R783GIDS).                        @J1C*/         
 /********************************************************************/         
         @SPACE;                                                                
   DECLARE                                                                      
   1 R783IQD                                                                    
   %IF SMFARRAY ^= 'YES' %THEN                                                  
   %GOTO SKCIQARY;                                                              
              (*)                                                               
   %SKCIQARY:;                                                                  
                 BASED(ADDR(R783GD)+R783GIDS) BDY(WORD), /* IOP                 
                                       initiative queue data section            
                                                                 @P1A*/         
     3 R783IQID CHAR(2),            /* IOP initiative queue identifier          
                                                                 @P1A*/         
     3 R783IFLG BIT(8),             /* IOP flags                 @P1A*/         
       5 R783IQI  BIT(1),           /* = 1, if IOP is installed  @P1A*/         
       5 *        BIT(7),           /* Reserved                  @P1A*/         
     3 *        CHAR(1),            /* Reserved                  @P1A*/         
     3 R783IQSM FIXED(31),          /* Sum of number of entries placed          
                                       on the IOP initiative queue              
                                                                 @P1A*/         
     3 R783IQCT FIXED(31),          /* Count of number of entries               
                                       placed on the IOP initiative             
                                       queue                     @J1C*/         
     3 * CHAR(4),                   /* Reserved                  @J1A*/         
     3 R783IIPB CHAR(8),            /* Number of times the I/O                  
                                       processor was busy, (long                
                                       floating point)       @WA49806*/         
     3 R783IIPI CHAR(8),            /* Number of times the I/O                  
                                       processor was idle, (long                
                                       floating point)       @WA49806*/         
     3 R783IIFS CHAR(8),            /* Number of I/O functions                  
                                       initially started, (long                 
                                       floating point)       @WA49806*/         
     3 R783IPII CHAR(8),            /* Number of processed I/O                  
                                       interrupts, (long floating               
                                       point)                @WA49806*/         
     3 R783ICPB CHAR(8),            /* Number of times an I/O was               
                                       retried due to channel path              
                                       busy, (long floating point)              
                                                             @WA49806*/         
     3 R783IDPB CHAR(8),            /* Number of times an I/O was               
                                       retried due to director port             
                                       busy, (long floating point)              
                                                             @WA49806*/         
     3 R783ICUB CHAR(8),            /* Number of times an I/O was               
                                       retried due to control unit              
                                       busy, (long floating point)              
                                                             @WA49806*/         
     3 R783IDVB CHAR(8),            /* Number of times an I/O was               
                                       retried due to device busy,              
                                       (long floating point)     @92C*/         
     3 R783ISCB CHAR(8),            /* Number of times the I/O                  
                                       processor was busy with                  
                                       SCM operations                           
                                       (long floating point)     @92A*/         
     3 R783IECB CHAR(8),            /* Number of times the I/O                  
                                       processor was busy with                  
                                       compression or decompression             
                                       (long floating point)     @92A*/         
     3 *        CHAR(8);            /* Reserved                  @92A*/         
         @SPACE;                                                                
 /********************************************************************/         
 /* I/O Queuing configuration control section.                       */         
 /* (one per LCU, described by SMF78DCS (data control section))      */         
 /********************************************************************/         
         @SPACE;                                                                
   DECLARE                                                                      
   1 R783CS                                                                     
   %IF SMFARRAY ^= 'YES' %THEN                                                  
   %GOTO SKCGSARY;                                                              
              (*)                                                               
   %SKCGSARY:;                                                                  
                 BASED(ADDR(SMF78HDR)+SMF78DCS) BDY(WORD),                      
       3 R783CC,                    /* Configuration control     @P1A*/         
         5 R783ID1  CHAR(2),        /* logical control unit identifier          
                                                                 @P1A*/         
         5 R783NTR  FIXED(15),      /* Number of despriptor triplets            
                                                                 @P1A*/         
         5 R783CPDS FIXED(31),      /* Offset to configuration data             
                                       section                   @P1A*/         
         5 R783CPDL FIXED(15),      /* Length of configuration data             
                                       section                   @P1A*/         
         5 R783CPDN FIXED(15),      /* Number of configuration data             
                                       sections                  @P1A*/         
         5 *        CHAR(3),        /* Reserved for future use   @81A*/         
         5 R783AMGC FIXED(08),      /* The Alias Management Group               
                                       number defined on the                    
                                       physical controller for                  
                                       this LCU. This number is                 
                                       valid, if the LCU is                     
                                       assigned to a DASD                       
                                       subsystem that supports                  
                                       Alias Management Groups                  
                                       and bit 7 of R783DST is                  
                                       set                       @81A*/         
         5 R783AMGS FIXED(32),      /* The Alias Management Group               
                                       number assigned by z/OS                  
                                       for this LCU on this                     
                                       system. This number is                   
                                       valid, if the LCU is                     
                                       assigned to a DASD                       
                                       subsystem that supports                  
                                       Alias Management Groups and              
                                       bit 7 of R783DST is set   @81A*/         
    /* Channel path data                                         @Z1A*/         
       3 R783CD   CHAR(R783CHPN*LENGTH(R783CPD)); /* Configuration data         
                                                                 @P1A*/         
    @SPACE;                                                                     
    DECLARE                                                                     
      @SPACE;                                                                   
      R783CHPN BINARY FIXED(15)     /* Number of configuration data             
                                       sections generated        @P1A*/         
          CONSTANT(8);                                         /*@Z1C*/         
         @SPACE;                                                                
 /********************************************************************/         
 /* I/O Queuing configuration data section.                          */         
 /* (one per channel path within LCU, described by R783CPDS).        */         
 /********************************************************************/         
         @SPACE;                                                                
   DECLARE                                                                      
   1 R783CPD                                                                    
   %IF SMFARRAY ^= 'YES' %THEN                                                  
   %GOTO SKCGCPARY;                                                             
              (*)                                                               
   %SKCGCPARY:;                                                                 
                 BASED(ADDR(R783CC)+R783CPDS) BDY(WORD),                        
     3 R783CPSD,                    /* Channel path static data  @P1A*/         
       5 R783CPID CHAR(1),          /* Channel path identifier   @P1A*/         
       5 R783CPST BIT(8),           /* Channel path status       @P1A*/         
         7 R783CPI  BIT(1),         /* X'80' Channel path installed             
                                                                 @P1A*/         
         7 R783CPO  BIT(1),         /* X'40' Channel path online @P1A*/         
         7 R783CPV  BIT(1),         /* X'20' Channel path varied @P1A*/         
         7 R783VPOF BIT(1),         /* X'10' This channel path is               
                                       offline to all devices to the            
                                       LCU                       @P1A*/         
         7 R783VP   BIT(1),         /* X'08' The connectivity of this           
                                       channel path to devices of this          
                                       LCU has manipulated via VARY             
                                       PATH during this measurement             
                                       interval                  @P1A*/         
         7 R783NMCD BIT(1),         /* X'04' Measured channel path              
                                       data invalid              @P1A*/         
         7 R783CPM  BIT(1),         /* X'02' Channel path is DCM                
                                       managed                   @I1A*/         
         7 R783CPMR BIT(1),         /* X'01' CHPID manipulated,                 
                                       requiring data reset      @I1C*/         
       5 R783CUN  FIXED(15),        /* Number of control units                  
                                       attached                  @P1A*/         
       5 R783CU   CHAR(8),          /* Control units attached to this           
                                       channel path              @P1A*/         
         7 R783CU1  CHAR(2),        /* 1st ctrl unit identifier  @P1A*/         
         7 R783CU2  CHAR(2),        /* 2nd ctrl unit identifier  @P1A*/         
         7 R783CU3  CHAR(2),        /* 3rd ctrl unit identifier  @P1A*/         
         7 R783CU4  CHAR(2),        /* 4th ctrl unit identifier  @P1A*/         
     3 R783CPCM,                    /* Channel path measured data               
                                                                 @P1A*/         
       5 R783CUB  FIXED(31),        /* Count of control unit busy               
                                                                 @P1A*/         
       5 R783PT   FIXED(31),        /* Count of channel path taken              
                                                                 @P1A*/         
       5 *        CHAR(4),          /* No longer used        @WA50187*/         
       5 R783DPB  FIXED(31),        /* ESCON Director port busy                 
                                       count                     @Z2C*/         
       5 R783CBT  FIXED(32),        /* Control Unit busy delay                  
                                       time in units of 128                     
                                       microseconds                             
                                       valid if R783CPXM=1       @K2A*/         
       5 R783CMR  FIXED(32),        /* Initial Command Response                 
                                       time in units of 128                     
                                       microseconds valid if                    
                                       R783CPXM=1 and R783GCMR=1 @K2A*/         
       5 R783SBS  FIXED(32),        /* Switch Busy count                        
                                       Summation contains the                   
                                       switch busy counts received              
                                       for all partitions                       
                                       valid if R783CPXM=1       @K2A*/         
       5 *        CHAR(4),          /* Reserved for future use   @K2A*/         
     3 R783CPXF   BIT(8),           /* Channel Path extended                    
                                       flags                     @K2A*/         
       5 R783CPXM BIT(1),           /* 1= extended I/O-                         
                                       measurement-block format-1               
                                       data available            @71C*/         
       5 R783CPX2 BIT(1),           /* 1= extended I/O-                         
                                       measurement-block format-2               
                                       data available            @71A*/         
       5 R783CPTD BIT(1),           /* 1= First-transfer-ready-                 
                                       disabled supported        @71A*/         
       5 *        BIT(5),           /* Reserved                  @71C*/         
     3 R783CPAT   FIXED(8),         /* Path attributes:                         
                                       0 = No attributes specified,             
                                       1 = Preferred path,                      
                                       2 = Non-preferred path    @L1A*/         
     3 *          CHAR(2),          /* Reserved for future use   @71C*/         
     3 R783CEXT,                    /* Channel path extension    @71A*/         
       5 R783CTMW FIXED(32),        /* Transport mode write                     
                                       count                                    
                                       valid if R783CPTD=1       @71A*/         
       5 R783CTRD FIXED(32),        /* First-transfer-ready-                    
                                       disabled write count                     
                                       valid if R783CPTD=1       @71A*/         
       5 *        CHAR(8);          /* Reserved for future use   @71A*/         
         @SPACE;                                                                
 /********************************************************************/         
 /* I/O Queuing data section.                                        */         
 /* (one per LCU, described by SMF78ASS (data section)).             */         
 /********************************************************************/         
         @SPACE;                                                                
   DECLARE                                                                      
   1 R783DS                                                                     
   %IF SMFARRAY ^= 'YES' %THEN                                                  
   %GOTO SKGDSARY;                                                              
              (*)                                                               
   %SKGDSARY:;                                                                  
                 BASED(ADDR(SMF78HDR)+SMF78ASS) BDY(WORD),                      
     3 R783ID2  CHAR(2),            /* Logical control unit identifier          
                                                                 @P1A*/         
     3 R783DST  BIT(8),             /* Data status               @P1A*/         
       5 R783NHMA BIT(1),           /* X'80' No hardware measurements           
                                                                 @P1A*/         
       5 R783LCC  BIT(1),           /* X'40' Dynamically changed @A1A*/         
       5 R783LDC  BIT(1),           /* X'20' Dynamically added   @A1A*/         
       5 R783LCA  BIT(1),           /* X'10' Conf. Chg. Attempt  @A1A*/         
       5 R783LDCM BIT(1),           /* X'08' LCU contains DCM managed           
                                       channels                  @I1A*/         
       5 R783LPAT BIT(1),           /* X'04' Path attributes are                
                                       valid                     @L1A*/         
       5 R783HIND BIT(1),           /* X'02' LCU has HyperPAV                   
                                       devices                   @01A*/         
       5 R783XIND BIT(1),           /* X'01' LCU has SuperPAV                   
                                       devices                   @81C*/         
     3 R783DSTX BIT(8),             /* Data status extension     @11C*/         
       5 R783L1FC BIT(1),           /* X'80' LCU contains at least one          
                                       FICON channel             @11A*/         
       5 R783LCTV BIT(1),           /* X'40' connect time of at least           
                                       one device invalid        @11A*/         
       5 R783LDTV BIT(1),           /* X'20' disconnect time of at              
                                       least one device invalid  @11A*/         
       5 *        BIT(5),           /* Reserved                  @11A*/         
     3 R783QSM  FIXED(31),          /* Q'd SUM on CU-HDR queue   @P1A*/         
     3 R783QCT  FIXED(31),          /* Q'd COUNT on CU-HDR queue @I1C*/         
     3 R783MCMN FIXED(16),          /* Minimum number of DCM managed            
                                       channels used             @I1A*/         
     3 R783MCMX FIXED(16),          /* Maximum number of DCM managed            
                                       channels used             @I1A*/         
     3 R783MCDF FIXED(16),          /* Defined number of DCM managed            
                                       channels                  @I1A*/         
     3 * FIXED(16),                 /* Reserved                  @I1A*/         
     3 R783DCMA,                    /* DCM managed channel accumulated          
                                       measurements              @I1A*/         
       5 R783PTM FIXED(32),         /* Accumulated path taken count             
                                       for DCM managed channels  @I1A*/         
       5 R783DPBM FIXED(32),        /* Accumulated director port busy           
                                       count for DCM managed channels           
                                                                 @I1A*/         
       5 R783CUBM FIXED(32),        /* Accumulated control unit busy            
                                       count for DCM managed channels           
                                                                 @K2C*/         
       5 R783CBTM FIXED(32),        /* Accumulated Control unit                 
                                       Busy delay Time for DCM                  
                                       Managed channels                         
                                       valid if R783CPXM=1       @K2A*/         
       5 R783CMRM FIXED(32),        /* Accumulated initial Command              
                                       Response time for DCM                    
                                       Managed channels valid if                
                                       R783CPXM=1 and R783GCMR=1 @K2A*/         
       5 R783SBSM FIXED(32),        /* Accumulated Switch Busy                  
                                       count summation for                      
                                       DCM Managed channels                     
                                       valid if R783CPXM=1       @K2A*/         
     3 R783DSUM,                    /* Device connect/disconnect time           
                                       accumulated for this LCU  @11C*/         
       5 R783DCTM FIXED(32),        /* Accumulated device connect time          
                                       for this LCU in units of                 
                                       128 microseconds          @11A*/         
       5 R783DDTM FIXED(32),        /* Accumulated device disconnect            
                                       time for this LCU in units of            
                                       128 microseconds          @11A*/         
     3 R783CSST   FIXED(32),        /* Channel Subsystem Wait Time in           
                                       units of 128 microseconds                
                                       valid if R783CPXM=1       @01C*/         
     3 R783HCNT FIXED(16),          /* Number of HyperPAV sections              
                                       for that LCU              @01A*/         
     3 R783HIX  FIXED(16),          /* Index to first HyperPAV                  
                                       section of that LCU       @71C*/         
     3 R783DCM2,                    /* DCM managed channel accumulated          
                                       measurements extension    @71A*/         
       5 R783TMWM FIXED(32),        /* Accumulated transport mode               
                                       write count for DCM                      
                                       managed channels valid if                
                                       R783CPTD=1                @71A*/         
       5 R783TRDM FIXED(32),        /* Accumulated first-transfer-              
                                       ready-disabled write                     
                                       count for DCM managed                    
                                       channels valid if                        
                                       R783CPTD=1                @71A*/         
       5 *        CHAR(8);          /* Reserved for future use   @71A*/         
 /********************************************************************/         
 /* HyperPAV/SuperPAV data section.                              @81C*/         
 /* (one per CU, described by SMF78HPS).                         @01A*/         
 /********************************************************************/         
         @SPACE;                                                                
   DECLARE                                                                      
   1 R783HPAV    BASED(ADDR(SMF78HDR)+SMF78HPS) BDY(WORD), /*                   
                                       HyperPAV/SuperPAV                        
                                       data section              @81C*/         
     3 R783HLCU CHAR(2),            /* HyperPAV Logical control                 
                                       unit identifier           @01A*/         
     3 R783HCU  FIXED(16),          /* HyperPAV control unit                    
                                       identifier                @01A*/         
     3 *        CHAR(4),            /* Reserved for future use   @01A*/         
     3 R783HDAT CHAR(80) BDY(WORD), /* HyperPAV/SuperPAV data    @81C*/         
       5 R783HVAL,                  /* HyperPAV values           @81A*/         
        7 R783HNAI CHAR(4),         /* The number of times an I/O               
                                       could not start for an LSS               
                                       because no HyperPAV-aliases              
                                       were available and the                   
                                       device was not waiting for               
                                       a reserve to be released                 
                                       from another system or                   
                                       long busy to subside                     
                                       (short floating point)    @81C*/         
        7 R783HTIO CHAR(4),         /* The total number of                      
                                       HyperPAV I/O requests for                
                                       the LSS (short floating                  
                                       point)                    @81C*/         
        7 R783HAIU FIXED(32),       /* The high water mark of                   
                                       the number of in-use                     
                                       HyperPAV-alias devices                   
                                       for the LSS                              
                                       (does not include borrowed               
                                       alias devices)            @81C*/         
        7 R783HCAD FIXED(32),       /* The high water mark of                   
                                       the number of aliases                    
                                       concurrently in-use by one               
                                       of the HyperPAV-base                     
                                       devices of the LSS                       
                                       (does include loaned                     
                                       alias devices)            @81C*/         
        7 R783HIOQ FIXED(32),       /* The high water mark of                   
                                       I/Os queued               @81C*/         
        7 * CHAR(12),               /* Reserved for future use   @81A*/         
       5 R783XVAL CHAR(48) BDY(WORD),/* SuperPAV values          @81A*/         
        7 R783XANC CHAR(4),         /* The number of times an                   
                                       alias was needed to start                
                                       an I/O                                   
                                       (short floating point)    @81A*/         
        7 R783XAUC CHAR(4),         /* The number of times an                   
                                       alias was needed to start                
                                       an I/O and one was used                  
                                       (short floating point)    @81A*/         
        7 R783XNHC CHAR(4),         /* The number of times an                   
                                       alias was needed to start                
                                       an I/O, but none was                     
                                       available in the home LCU                
                                       (short floating point)    @81A*/         
        7 R783XABC CHAR(4),         /* The number of times an                   
                                       alias was borrowed from a                
                                       peer LCU                                 
                                       (short floating point)    @81A*/         
        7 R783XCBC FIXED(32),       /* The number of aliases                    
                                       concurrently borrowed                    
                                       from peer LCUs            @81A*/         
        7 R783XHBC FIXED(32),       /* The high water mark of                   
                                       concurrently borrowed                    
                                       aliases from peer LCUs    @81A*/         
        7 R783XALC CHAR(4),         /* The number of times an                   
                                       alias was loaned to a                    
                                       peer LCU                                 
                                       (short floating point)    @81A*/         
        7 R783XCLC FIXED(32),       /* The number of aliases                    
                                       concurrently loaned to                   
                                       peer LCUs                 @81A*/         
        7 R783XHLC FIXED(32),       /* The high water mark of                   
                                       concurrently loaned                      
                                       aliases to peer LCUs      @81A*/         
        7 R783XNAG CHAR(4),         /* The number of attempts                   
                                       that were made to borrow                 
                                       an alias from peer LCUs but              
                                       none were available                      
                                       (short floating point)    @81A*/         
        7 R783XCQD CHAR(4),         /* The cumulative number of                 
                                       I/Os queued at the                       
                                       subsystem level when                     
                                       aliases were needed                      
                                       (short floating point)    @81A*/         
        7 R783XCIU CHAR(4);         /* The cumulative number of                 
                                       aliases defined to this                  
                                       subsystem that were in                   
                                       use when aliases were                    
                                       needed                                   
                                       (short floating point)    @81A*/         
  %LR784:;                                                                      
                                                                                
