*/* Bilingual Mapping Macro for SMF Record type 79                              
         MACRO                                                                  
         ERBSMF79                                                               
**/                                                                             
*/*** START OF SPECIFICATIONS ****************************************          
*01* Proprietary Statement:                                          *          
*                                                                @61A*          
*       LICENSED MATERIALS - PROPERTY OF IBM                     @61A*          
*       "RESTRICTED MATERIALS OF IBM"                            @61A*          
*       COPYRIGHT IBM CORP. 1983, 2021                               *          
*                                                                @61C*          
*       STATUS: z/OS V2R5 Data Gatherer (HRG77D0)                    *          
*                                                                @61C*          
*                                                                    *          
*   Macro Name: ERBSMF79                                             *          
*                                                                    *          
*   Descriptive Name: Mapping Macro for SMF record type 79           *          
*                     (Monitor II) with following subtypes:          *          
*                                                                    *          
*                       1 - Address Space State Data                 *          
*                       2 - Address Space Resource Data              *          
*                       3 - Storage/Processor (SRCS) Data            *          
*                       4 - Paging Activity                          *          
*                       5 - Address Space SRM Data                   *          
*                       6 - Reserve (SENQR) Data                     *          
*                       7 - Enqueue Contention (SENQ) Data           *          
*                       9 - Device Activity                          *          
*                      11 - Page Data Set Activity                   *          
*                      12 - Channel Path Activity                    *          
*                      14 - I/O Queuing Activity                     *          
*                      15 - IRLM Long Lock Detection                 *          
*                                                                    *          
*                                                                    *          
*   DSECT names: SMF79HDR, SMF79PRO, R79CHL,                         *          
*                R791ELEM,                                           *          
*                R792ELEM,                                           *          
*                R793,                                               *          
*                R794,                                               *          
*                R795ELEM,                                           *          
*                R796ELEM,                                           *          
*                R797ELEM,                                           *          
*                R798ELEM,                                           *          
*                R799ELEM,                                           *          
*                R79AELEM,                                           *          
*                R79BCNTL, R79BELEM,                                 *          
*                R79CCNTL, R79CCHNL                                  *          
*                R79DCS, R79DCPD, R79DDS,                            *          
*                R79EGD, R79ECS, R79ECPD, R79EDS                     *          
*                R79FIRLM                                        @F1A*          
*                                                                    *          
*                                                                    *          
*   Function: This macro maps the complete SMF record type 79        *          
*             The record consists of 5 parts:                        *          
*             1. The fixed portion of the SMF header.                *          
*                This mapping is invoked by calling macro ERBHDR.    *          
*             2. The individual header extension which               *          
*                contains offset/length/number triplets              *          
*                to address the record parts following the           *          
*                RMF product section.                                *          
*             3. The RMF product section.                            *          
*                This mapping is invoked by calling macro ERBPRO.    *          
*             4. The RMF data control section.                       *          
*             5. The RMF data sections.                              *          
*                                                                    *          
*   Notes: None                                                      *          
*                                                                    *          
*   Method of access: See below                                      *          
*                                                                    *          
*   BAL: ERBSMF79                                                    *          
*                                                                    *          
*   Created by: ERBPCTBL                                             *          
*                                                                    *          
*   Pointed to by: local pointer                                     *          
*                                                                    *          
*   Subpool and Key: Subpool MFSBSUBP                                *          
*                                                                    *          
*   Serialization: None                                              *          
*                                                                    *          
*   Size:  SMF79HDR   68                                             *          
*          SMF79PRO   52                                             *          
*          R79CHL    104                                             *          
*          R791ELEM  236                                         @31A*          
*          R792ELEM  224                                         @31C*          
*          R793      102                                     @WA56739*          
*          R794      108                                         @Y4C*          
*          R795ELEM   79                                         @C1C*          
*          R796ELEM   88                                         @82C*          
*          R797ELEM   92                                             *          
*          R798ELEM   52                                             *          
*          R799ELEM  120                                         @85C*          
*          R79AELEM   64                                         @Y4C*          
*          R79BCNTL    4                                             *          
*          R79BELEM   98                                         @C2C*          
*          R79CCNTL   20                                             *          
*          R79CCHNL  108                                         @22C*          
*          R79DCS     12                                             *          
*          R79DCPD    12                                             *          
*          R79DDS     32                                             *          
*          R79EGD     12                                         @84C*          
*          R79ECS     12                                             *          
*          R79ECPD    64                                         @71C*          
*          R79EDS     68                                         @71C*          
*          R79FIRLM  103                                         @F1A*          
*                                                                    *          
*   Deleted by:                                                      *          
*                                                                    *          
*   Distribution Library: SYS1.MACLIB                                *          
*                                                                    *          
*   Change Activity: See below                                       *          
*                                                                    *          
*   $N0=MON1,HRM3102,,WBS: NEW FOR RMF 3.1                       @N0A*          
*   CHANGE DECLARE FOR R79ACIDX SO THE VALUE IS UNSIGNED     @ZA69833*          
*   REDEFINE R79IST                                          @ZA70287*          
*   $O1=4381,JRM3212,,SHR: 4381 - SUPPORT                        @O1A*          
*   $P1=SRM,HRM3302,,THE: SRM - SUPPORT  (SAD-STCPS)             @P1A*          
*   $P2=ES,HRM3302,,KLZ: CHANGED LAYOUT / EXTENDED STORAGE       @P2A*          
*   $P3=MON2,HRM3302,,FRY: CHANGED LAYOUT / DOMAIN REPORT        @P3A*          
*   $P4=3090,HRM3302,,WEY: 3090 support                          @P4A*          
*   $P5=3090,HRM3302,,MLN: 3090 support                          @P5A*          
*   $E1=3351P,HRM3302,,FLJ: Support for 3351P                    @E1A*          
*   $P6=ES,HRM3302,,KLZ: PTM   PA70089  / EXTENDED STORAGE       @P6A*          
*   $Q1=MISC,HRM3402,,MLN: Converted to global ENQ               @Q1A*          
*   $S1=TRQ,JRM3412,,WRC: Support for SP2.1.7 True Ready Queue   @S1A*          
*   $Q2=MIG,HRM3402,,HEN: R794MAGE is moved and changed to           *          
*                         fixed 31.                      OZ95298 @Q2A*          
*   NO CHANGE - RESHIPPED TO SUPERCEDE OZ95298               @ZA98025*          
*   $R0=220SUP,JRM3422,,WRC: SUPPORT FOR MVS SP2.2.0             @R0A*          
*   $U1=SGSUP,JRM3512,,KLZ: Storage Group support                @U1A*          
*   $U2=UCBDMC,JRM3512,,TJI: UCBDMC constraint relief            @U2A*          
*   $W1=SP310,HRM4410,,SOT: MVS SP 3.1.0 support                 @W1A*          
*   $W2=SP310,HRM4410,,PAE: IARXC return code handling           @W2A*          
*   $W3=LSCR,HRM4410,,BHL: Large systems constraint relief       @W3A*          
*   $W4=APAR,HRM4410,,SOT: Integration of APAR OY05739           @W4A*          
*   $W5=MISC,HRM4410,,PAE: ASCB frame count constraint relief    @W5A*          
*   $W6=MISC,JRM4411,,SHR: Clean up to reduce compiler messages  @W6A*          
*   $W7=SP310E,JRM4411,,PAE: MVS SP 3.1.0E Support               @W7A*          
*   $W8=SP310E,JRM4411,,PAE: Stor isolation for ESO hiperspaces  @W8A*          
*   $Y1=DMSR,HRM4420,,CLL: Model Type (SHARE SOMVSP87001)        @Y1A*          
*   $Y2=LJM,HRM4420,,LAH: Large Job Management Support           @Y2A*          
*   Expanded storage frame count constraint relief           @YA28328*          
*   Support for MVS/ESA Large Job Management SPE             @YA20560*          
*   $Z1=OY29112,HRM4420,,WRC: ESCA Basis                         @Z1A*          
*   $Z2=OY29112,HRM4420,,WRC: Serial & Switch Supprt             @Z2A*          
*   SHR: Include FLPA/EFLPA frames and real frame zero       @YA34458*          
*   $A1=APPC,JRM4421,,BAJU: APPC tolerating support              @A1A*          
*   $A2=WSET,JRM4421,,BB: Working Set Management / Block Paging  @A2A*          
*   $A3=WSET,JRM4421,,RTN: Working Set Management / Block Paging @A3A*          
*   $A9=MISC,JRM4422,,DPN: Recompile                             @A9A*          
*   RN:  Increases max number of channel paths per LCU to 8  @YA41310*          
*   GBO: Fix 0C9 calculating AVERAGE TRANSACTION TIME        @YA41781*          
*   PFU: Insert 4 Byte Field for EXCP count                  @YA42170*          
*   $B1=R430,HRM4430,,HOL: Modifies DISTLIB statement            @B1A*          
*   $B2=OMVS,HRM4430,,RPT: OPEN/MVS Toleration Support           @B2A*          
*   $BA=MIF,JRM4422,,BHL: ESCON Multiple Image Facility SPE      @BAA*          
*   LGO: INCLUDE CTC TYPES                                   @YA55031*          
*   $C1=WLM2,HRM4440,,HKH: WLM support, subtypes 1, 2, 5, 8      @C1A*          
*   $C2=4KUCB,HRM4440,,FF: Four Digit Device Numbers (>4K UCB)   @C2A*          
*   LAN: Increase max number of channel paths for 308X/4381  @YA61897*          
*   $C3=NEWCH,HRM5510,,FF: New channel support (OSA,ISC,Pacer)   @C3A*          
*   HUE: ABEND0C9 in ERBRDEV due to invalid data because     @YA66876*          
*        Mon I interval ended while ERBGDEV accessed EDDBB   @YA66876*          
*   HUE: correct incompatible change from @YA55031           @YA67090*          
*        may cause PP convertion errors (430 to 510), FF     @YA67090*          
*   FF:  KRO0397: 0C4 with Reason Code 10 in ERBGENQR        @WA02579*          
*   HUE: ABEND0C9 when dividing TCB time (from ASCBEJST)     @WA03326*          
*        by 1000 as result does not fit in 31 bit field      @WA03326*          
*        Equivalent to OW02302                               @WA03326*          
*   BHL: LPAR enhancements                                   @WA05435*          
* $D1=CAP,HRM5520,,JKE: Captured Storage support                 @D1A*          
* $D2=R79,HRM5520,,DK: SMF Record 79(1) Enhancement for SDSF     @D2A*          
* $D3=NEWISD,HRM5520,,FF: Integrated System Device           @WA10257*          
*   SUW: Add new Flag R799DTF - Device connect or pending or @WA15094*          
*                               disconnect time is invalid   @WA15094*          
* $E1=IPM,OW17898,,HBE: Enabling of M II reports                 @E1A*          
*   AJU: Corrects comment for R793DQ and R792EXCT+R791EXCT   @WA19913*          
* $E2=MISC,HRM6603,,HOL: Preemptable SRB support                 @E2A*          
* $F1=IRLM,HRM6604,,HOL: IMS Long Lock Report                    @F1A*          
* GUB: Additional field in 79.15 record                      @WA27252*          
* FDL: Add ORG for header adjustment (PMR16340)              @WA28830*          
* $G1=ACR,HRM6606,,PS: Channel Type Support                      @G1A*          
* $G2=PAV,HRM6606,,PS: PAV device support                        @G2A*          
* $H1=FICON,HRM6607,,PS:  Fibre Channel Support                  @H1A*          
* $I1=MISC,HRM7703,,FDL: Correct comments on R79xCL              @I1A*          
* $I2=TBIT,HRM7703,,SHR: Honors T-bit in SCHIB                   @I2A*          
*  PS: R79CCPTS to small for values bigger than 16MB         @WA39393*          
* SHR: PAV device support                                    @WA31701*          
* $I3=DCM,HRM7703,,SHR: Dynamic CHPID Management support         @I3A*          
* $I4=WLM,HRM7703,,HOL: SDSF Support                             @I4A*          
* $I5=BIT64,HRM7703,,VTH: 64 Bit real support                    @I5A*          
* $J1=GMI,HRM7705,,BEN: WLM Goal Mode Inhibitor removal          @J1A*          
* $J2=SDSF,HRM7705,,GUB: SDSF Support                            @J2A*          
* $J3=MISC,HRM7705,,GUB: New swap reason code                    @J3A*          
* GUB: Temporal affinity                                     @WA46622*          
* $J4=IQDIO,HRM7705,,PS:  iQDIO Support                          @J4A*          
* $J5=HYDRA,HRM7705,,PS:  Hydra 1.75 support                     @J5A*          
*  PS: IQDIO support Monitor II/III in I/O part              @WA50187*          
* $K1=XMP,HRM7708,,PS: T-Rex toleration                          @K1A*          
* $K2=MISC,HRM7708,,GUB: Swap data set removal                   @K2A*          
* $K3=XMP,HRM7708,,PS: T-Rex exploitation                        @K3A*          
* $K4=XMP,HRM7708,,PS: T-Rex Support 2-Gigabit change            @K4A*          
* FDL: Prepares for up to 65535 devices                      @WA55906*          
* FDL: Replaces R793 SMF record fields by 4-byte fields      @WA56739*          
* FDL: Subtype 255 reserved for ILOCK processing             @WA57131*          
*  PS: Changed comments for SMF73SMP and SMF73CSS            @OA04260*          
* $K5=IFA,OA05731,,WLR: IFA support                              @K5A*          
* $K6=PTERO,OA07950,,WLR: PTero support and IFA completion       @K6A*          
* $L1=PPS,OA09921,,WLR: Preferred Paths Support                  @L1A*          
* VTH: System Utility Processor (SUP) support                @OA13499*          
* $02=GT128,HRM7730,,GUB: >128G real storage support             @02A*          
*  PS: R79BRLEN now includes R79BELEM totally                @OA16748*          
* $01=HPV,OA12865,,PS: HyperPAV Support                          @01A*          
* RPE: New EXCP Count Field ( DoubleWord )                   @OA15850*          
* PMU: Change comment for R791TCPC                           @OA21046*          
* $21=WLMJ7Z,HRM7750,,VTH: WLM enqueue mgmt stage 3 support      @21A*          
* $22=FCX,OA21140,,GUB: zHPF support                             @22A*          
* $31=FITS,HRM7760,,GUB: Additional fields for zIIP and zAAP     @31A*          
* PMU: Adds new region type introduced with IMS APAR PK74078 @OA28931*          
* $51=SCM,HRM7780,,WLR: SCM Support                              @51A*          
* $52=MISC,HRM7780,,JKU: CICS Response Time Management           @52A*          
* $61=R790,HRM7790,,PS: EXPLICIT COPYRIGHT FOR EXT. MACRO        @61A*          
* $64=WLMIO,HRM7790,,GUB: I/O priority group                     @64A*          
* WLR: Unfence SCM support                                   @OA38660*          
* JKU: Interrupt Delay Time Support                          @OA39993*          
* $62=CUQT,HRM7790,,PS: Control Unit Queuing time in SMF         @62A*          
* $63=SSID,HRM7790,,PS: NON-PAV Alias devices in                 @63A*          
*                       alternate subchannel set                 @63A*          
* $71=XDF,HRM77A0,,PS: zHPF Extended Distance Support            @71A*          
*  PS: zHPF Extended Distance Support                        @OA44525*          
* $81=zHW2,HRM77B0,,UM: zHyperwrite Stage 2                      @81A*          
* JKu: zHyperwrite Stage 2 Coexistence                       @OA48870*          
* $82=zHW2,HRM77B0,,JK: zHyperwrite Stage 2                      @82A*          
* $83=Sprk1,HRM77B0,,UM: Report for Spark/Cloud Stage 1          @83A*          
* $84=Misc,HRM77B0,,UM: Increase size of zHPF counters to        @84A*          
*                       32 bit                                   @84A*          
* $85=Misc,HRM77B0,,PS: New source IOS Queue Time                @85A*          
* $91=TNT,OA52694,,JKU: Metering and Capping Stage 3             @91A*          
* $92=ZCBP,OA54915,,GUB: zCBP support                            @92A*          
* $93=ZCBP,OA56461,,JKU: zCBP fencing                            @93A*          
* $94=RUCSA,HRM77C0,,UMu: Restricted Use CSA implementation      @94A*          
* $A01=Split,OA58759,,JBa: RMF Product Split                    @A01A*          
* $A02=MISC,HRG77D0,,PS: Remove model dependent data/CMB        @A02A*          
*                        processing                             @A02A*          
* $A03=SRB3,OA61036,,UMu: System Recovery Boost stage 3         @A03A*          
* JKu: Update field description for REST services            @OA62081*          
*                                                                    *          
****** END OF SPECIFICATIONS *****************************************          
*                                                                    */         
*        %GOTO PLSMACRO;                                                        
*                                                                               
*/*                                                                             
         SPACE 3                                                                
**********************  COMMON SMF HEADER  ****************************         
         ERBHDR 79                                                              
         SPACE 3                                                                
**********************  INDIVIDUAL HEADER EXTENSION  ******************         
SMF79MCS DS    F -                OFFSET TO MONITOR II CONTROL SECTION          
SMF79MCL DS    H -                LENGTH OF MONITOR II CONTROL SECTION          
SMF79MCN DS    H -                NUMBER OF MONITOR II CONTROL SECTION          
SMF79ASS DS    F -                OFFSET TO DATA SECTION                        
SMF79ASL DS    H -                LENGTH OF DATA SECTION                        
SMF79ASN DS    H -                NUMBER OF DATA SECTION                        
SMF79DCS DS    F -                OFFSET TO DATA CONTROL SECTION                
SMF79DCL DS    H -                LENGTH OF DATA CONTROL SECTION                
SMF79DCN DS    H -                NUMBER OF DATA CONTROL SECTION                
SMF79QSS DS    F -                OFFSET TO I/O QUEUING GLBL.SECT. @P4A         
SMF79QSL DS    H -                LENGTH OF I/O QUEUING GLBL.SECT. @P4A         
SMF79QSN DS    H -                NUMBER OF I/O QUEUING GLBL.SECT. @P4A         
SMF79ENX EQU   *                  End of ind. header extension @WA28830         
         SPACE 3                                                                
**********************  Special 79.F Header Extension *****************         
         ORG   SMF79MCS                                            @F1A         
SMF79FHX DS    0XL8                                            @WA28830         
SMF79FPO DS    F                  Offset to IMS Long Lock Data Sct @F1A         
SMF79FPL DS    H                  Length of IMS Long Lock Data Sct @F1A         
SMF79FPN DS    H                  Number of IMS Long Lock Data Sct @F1A         
SMF79FNX EQU   *                  End of 79.F header extension @WA28830         
         ORG   SMF79ENX                                        @WA28830         
         SPACE 3                                                                
**********************  COMMON SMF PRODUCT SECTION  *******************         
         ERBPRO 79                                                              
         SPACE 3                                                                
**********************  MONITOR II CONTROL SECTION  *******************         
R79CHL   DSECT                    COMMON RECORD 79 HEADER                       
R79GTOD  DS    XL4 -              DATA GATHERER CALL TOD                        
R79LF2   DS    XL1 -              FLAG BYTE                                     
R79PAR   EQU   X'80' -            NOT ENOUGH RELOCATE SECTION TO                
R79SG    EQU   X'40' -            Report to be sorted by SG        @U1A         
R79RSM   EQU   X'20' -            Invalid RSM data obtained        @W2A         
R79GOAL  EQU   X'10' -            System is in GOAL mode           @C1A         
R79TRXI  EQU   X'08' -            Invalid transaction data         @C1A         
R79SRMC  EQU   X'04' -            SRM mode changed                 @C1A         
R79INV   EQU   X'02' -            invalid data from Mon I      @YA66876         
*                                 (DEV PGSP IOQ)               @YA66876         
R79MAXD  EQU   X'01' -            Incomplete device data due to too             
*                                 many active devices          @OA48870         
R79RV1   DS    XL1 -              RESERVED                                      
R79SES   DS    CL2 -              SESSION NAME                                  
R79RSV   DS    XL2 -              RESERVED                                      
R79USER  DS    XL2 -              USER FIELD                                    
R79RID   DS    CL8 -              MEASUREMENT NAME                              
R79CTXTL DS    XL2 -              LEN OF COMMAND TEXT                           
R79CTEXT DS    CL32 -             COMMAND TEXT                                  
R79DTXTL DS    XL2 -              LEN OF DEFAULT DR TEXT                        
R79DTEXT DS    CL32 -             DEFAULT DR TEXT                               
R79IST   DS    CL4 -              MONITOR I INTERVAL START TIME                 
*                                 IN 0HHMMSSF FORMAT   @ZA70287                 
R79TSR   DS    XL2                Total number of small records    @W3A         
         DS    XL2                Reserved for future use          @W3A         
R79TOT   DS    XL4                Total number of data sections in              
*                                 large record                     @W3A         
R79NXT   DS    XL4                Number of data sections in following          
*                                 small records                    @W3A         
R79IWMTK DS    CL8                Token returned from IWMRCOLL                  
*                                 service                          @C1A         
*                                                                               
.STYP1   ANOP                                                                   
*                                                                               
*        RELOCATE BLOCK FOR SUBTYPE 1                                           
*                                                                               
R791ELEM DSECT                    MAPPING OF ELEMENT                            
R791ASID DS    XL2                ADDRESS SPACE IDENTIFIER                      
R791JBN  DS    CL8                NAME OF JOB                                   
R791DMN  DS    XL2                DOMAIN NUMBER                                 
*                                 not applicable in GOAL mode      @C1C         
R791NPG  DS    XL2                PERFORMANCE GROUP                             
*                                 not applicable in GOAL mode      @C1C         
R791PGP  DS    XL2                PERFORMANCE GROUP PERIOD                      
*                                 not applicable in GOAL mode      @C1C         
R791TTOD DS    XL4                REAL TIME INTO TRANSACTION       @J2C         
*                                 (MILLISECONDS)                                
*                                                                               
R791CL   DS    CL2                CURRENT LOCATION                              
*                                                                               
*                              CONTENTS   MEANING                               
*                              --------   -------                               
*                                   IN  - IN STORAGE                            
*                                   OT  - SWAPPED OUT AND READY                 
*                                   LO  - LOGICALLY SWAPPED    @G537NLS         
*                                   NS  - NON-SWAPPABLE                         
*                                   WM  - WAIT QUEUE/MSO                        
*                                   WL  - WAIT QUEUE/LONG WAIT                  
*                                   WT  - WAIT QUEUE/TERM WAIT                  
*                                   WO  - WAIT QUEUE/other reasons @I1A         
*                                   DL  - TSO user delayed by SRM               
*                                         to meet response time                 
*                                         objective                @I1A         
*                                   PR  - PRIVILEGED                            
*                                   >>  - TRANSITIONING OUT                     
*                                   <<  - TRANSITIONING IN                      
R791TAS  DS    XL2                TYPE OF USER                                  
*                                                                               
*                              CONTENTS   MEANING                               
*                              --------   -------                               
*                                   0 - BATCH                                   
*                                   1 - STARTED TASK                            
*                                   2 - MOUNT TASK                              
*                                   3 - TSO                                     
*                                   4 - ASCH                       @A1A         
*                                   5   OMVS                       @B2A         
R791SRC  DS    CL2                REASON LAST SWAP OUT                          
*                                                                               
*                              CONTENTS   MEANING                               
*                              --------   -------                               
*                                   TO - TERMINAL OUTPUT                        
*                                   TI - TERMINAL INPUT            @83M         
*                                   LW - LONG WAIT                              
*                                   XS - AUX STORAGE SHORT                      
*                                   RS - REAL STORAGE SHORT                     
*                                   DW - DETECTED WAIT                          
*                                   MP - MEMORY POOL SHORTAGE      @83C         
*                                   NQ - CAP ENQ                                
*                                   EX - CAP EXCHANGE                           
*                                   US - CAP UNI-SWAP                           
*                                   TS - TRANSITION SWAP       @ZA27329         
*                                   IC - Improve central storage usage          
*                                                                  @A3A         
*                                   IP - Improve system paging rate             
*                                                                  @A3A         
*                                   MR - Make room to swap in an                
*                                        out-too-long user         @A3A         
*                                   AW - APPC wait                 @A1A         
*                                   IW - OMVS input wait           @B2A         
*                                   OW - OMVS output wait          @B2A         
*                                   SR - In-real swap              @J3A         
*                                   00 - UNKNOWN                                
*                                                                               
R791DP   DS    XL2 -              DISPATCHER PRIORITY                           
R791SEQN DS    XL2                RESERVED                         @S1C         
R791RSV1 DS    XL2                Reserved since 4.1.0             @W5C         
R791RSV2 DS    XL2                Reserved since 4.1.0             @W5C         
R791SWC  DS    XL2                TRANSACTION SWAP COUNT                        
R791SWMR DS    XL2                SRM WORKLOAD RECOM VALUE                      
         DS    XL2                Reserved                         @A3C         
         DS    XL2                Reserved                         @A3C         
R791WMS  DS    XL4                SRM SSERVICE FOR THE CURRENT                  
*                                 TRANSACTION SINCE THE LAST SWAP IN            
R791TCPU DS    XL4                Total CPU time consumed on behalf             
*                                 of this address space in milliseconds         
*                                 (ascbejst+ascbsrbt+assbasst).    @E2C         
*                                 Wraps after 4 Giga millisec  @WA02302         
         DS    XL2                Reserved                         @A3C         
         DS    XL2                Reserved                     @YA28328         
R791ESCT DS    XL4                Number of expanded storage frames             
*                                 used by job                  @YA28328         
R791RSV3 DS    XL2                Reserved since 4.1.0             @W5C         
R791PIN  DS    XL4                Page in count                    @W1A         
R791TRTM DS    XL4                Transaction residency time       @W1A         
R791FLG  DS    XL1                Flags                            @W1A         
R791XM   EQU   X'80'              -- Cross memory address space    @W1A         
R791PMON EQU   X'40'              On = data in R791CTAR is valid.               
*                                  Off = not valid.                @A3A         
R791VALV EQU   X'20'              On = data in R791VAL is valid.                
*                                  Off = not valid.                @A3A         
R791GOAL EQU   X'10'              On = system is in GOAL mode      @C1A         
R791SRV  EQU   X'08'              On = this address space is a                  
*                                 server address space             @C1A         
*                                  Off = GOAL specified for this                
*                                  address space is being honored               
*                                  by WLM                          @C1A         
R791QSC  EQU   X'04'              On = address space has been                   
*                                 quiesced by a RESET command      @C1A         
R791TXME EQU   X'02'              Address space matched a                       
*                                 classification rule in the active             
*                                 policy which prevents managing the            
*                                 region based on the response time             
*                                 goals of its served transactions              
*                                                              @OA62081         
R791TAFF EQU   X'01'              On = address space has temporal               
*                                 affinities, same as RASDTAF  @WA46622         
R791FLG2 DS    XL1                Additional flags                 @I4C         
R791CPRC EQU   X'80'              Service class assigned by                     
*                                 classification or RESET SRVCLASS was          
*                                 designated CPU-critical in the active         
*                                 policy                       @OA62081         
R791CPRE EQU   X'40'              Address space matched a                       
*                                 classification rule in the active             
*                                 policy which was designated                   
*                                 storage-critical             @OA62081         
R791CPRI EQU   X'20'              Address space is serving transactions         
*                                 which belong to a service class that          
*                                 was designated storage-critical in            
*                                 the active policy's classification            
*                                 rules, or is running in SYSTEM/SYSSTC         
*                                                              @OA62081         
R791CPUP EQU   X'10'              CPU protection was assigned either to         
*                                 the address space or to transaction           
*                                 service classes being served by the           
*                                 space                        @OA62081         
R791STOP EQU   X'08'              Storage protection was assigned               
*                                 either to the address space or to             
*                                 transaction service classes being             
*                                 served by the space          @OA62081         
R791CRMP EQU   X'04'              The dispatch priority of the                  
*                                 address space is currently                    
*                                 promoted due to a chronic                     
*                                 resource contention              @21A         
R791TXMB EQU   X'02'              Address space is a CICS TOR that              
*                                 matched a classification rule in the          
*                                 active policy which allows managing           
*                                 the region based on the region goals          
*                                 but also ensures that completed               
*                                 transactions are reported and used            
*                                 for management of the CICS AORs               
*                                                              @OA62081         
R791NOHP EQU   X'01'              Honor priority ineligibility was              
*                                 assigned either to the address space          
*                                 or to transaction service classes             
*                                 being served by the space    @OA62081         
R791FMCT DS    XL4                NUMBER OF REAL STORAGE FRAMES    @W5A         
R791WSS  DS    XL4                WORKING SET AT LAST SWAP IN      @W5A         
R791TWSS DS    XL4                SRM TARGET WORKING SET SIZE      @W5A         
R791ESHP DS    XL4                Number of hiperspace expanded storage         
*                                 pages used by job                @W7A         
R791ESVI DS    XL4                Number of VIO expanded storage                
*                                 pages used by job                @W7A         
R791HIN  DS    XL4                Number of hiperspace page ins    @W8A         
R791HRMS DS    XL4                Number of ESO hiperspace read                 
*                                 misses by job                    @W8A         
R791BPIN DS    XL4                Number of blocked pages brought               
*                                  in from DASD                    @A3A         
R791PINE DS    XL4                Number of pages brought in from               
*                                  expanded storage                @A3A         
R791BPNE DS    XL4                Number of blocked pages brought               
*                                  in from expanded storage        @A3A         
R791CTAR DS    XL4                Central storage target number of              
*                                  frames                          @A3A         
R791VAL  DS    XL4                Recommendation value for WSM                  
*                                  managed address spaces          @A3A         
R791SCL  DS    CL8                Service class name               @C1A         
R791SCP  DS    BL2                Service class period             @C1A         
R791WKLD DS    CL8                Workload name                    @C1A         
R791RGRP DS    CL8                Resource group name              @C1A         
R791SPI  DS    XL4                Number of page-ins from                       
*                                 auxiliary storage                             
*                                 for shared page groups           @D1A         
R791CMNI DS    XL4                Number of common pages for current            
*                                 transaction (= R792CMNI)         @D2A         
R791PNV  DS    XL4                Number of non-vio pages for current           
*                                 transaction (= R792PNV)          @D2A         
R791PVIO DS    XL4                Number of vio pages for current               
*                                 transaction (= R792PVIO)         @D2A         
R791EXCT DS    XL4                EXCP count for                                
*                                 this step (= R792EXCT)           @D2A         
R791TCPC DS    XL4                Total CPU time consumed in this               
*                                 address space in milliseconds                 
*                                 (ascbejst+ascbsrbt           @OA21046         
*                                 +(assbphtm-assbphtm_base))   @OA21046         
R791ASST DS    XL4                CPU time consumed by preemptible-             
*                                 class SRBs running on behalf of               
*                                 this address space in milliseconds            
*                                 (assbasst)                       @E2A         
R791PHTM DS    XL4                CPU time consumed by preemptible-             
*                                 class SRBs running in this address            
*                                 space in milliseconds (assbphtm) @E2A         
R791RCL  DS    CL8                Report class name                @I4A         
R791MLIM DS    CL8                Address space memory limit                    
*                                 in units of MB                   @J2A         
R791TCBP DS   0XL4                Reserved for future use          @93C         
R791TIFA DS    XL4                CPU time consumed on zAAPs (IFAs)             
*                                 (ASSB_TIME_ON_IFA)               @93C         
R791TCP  DS    XL4                CPU time consumed on standard CPs             
*                                 (ASSB_TIME_ON_CP). Only valid if              
*                                 zAAPs or zIIPs in configuration               
*                                                              @OA13499         
R791TCBPonCP DS 0XL4              Reserved for future use          @93C         
R791TIFC DS    XL4                CPU time consumed on standard CPs             
*                                 by zAAP (IFA) eligible work                   
*                                 (ASSB_TIME_IFA_ON_CP)            @93C         
R791NFFCBP DS 0XL4                Reserved for future use          @93C         
R791NFFI DS    XL4                Normalization factor for zAAP time.           
*                                 Used to convert between real zAAP             
*                                 times and "normalized" zAAP times,            
*                                 i.e. the equivalent time on a                 
*                                 standard CP. Multiply R791TIFA by             
*                                 this value and divide by 256 to               
*                                 calculate the normalized zAAP time            
*                                                                  @93C         
R791TSUP DS    XL4                CPU time consumed on zIIPs                    
*                                 (ASSB_TIME_ON_zIIP)          @OA13499         
R791TSUC DS    XL4                CPU time consumed on standard CPs             
*                                 by zIIP eligible work                         
*                                 (ASSB_TIME_zIIP_ON_CP)       @OA13499         
R791NFFS DS    XL4                Normalization factor for zIIP time.           
*                                 Used to convert between real zIIP             
*                                 times and "normalized" zIIP times,            
*                                 i.e. the equivalent time on a                 
*                                 standard CP. Multiply R791TSUP by             
*                                 this value and divide by 256 to               
*                                 calculate the normalized zIIP time.           
*                                                              @OA13499         
R791EXCW DS    CL8                EXCP Count ( DoubleWord )    @OA15850         
R791CBPPHTM DS 0XL4               Reserved for future use          @93C         
R791PHTA DS    XL4                zAAP-only equivalent of R791PHTM              
*                                 (ASSB_IFA_PHTM). This is normalized           
*                                 time                             @93C         
R791PHTI DS    XL4                zIIP-only equivalent of R791PHTM              
*                                 (ASSB_zIIP_PHTM).                             
*                                 This is normalized time          @31A         
R791FLG3 DS    XL1                Additional flags                 @64A         
R791CIPG EQU   X'80'              Service class was assigned by                 
*                                 classification, or RESET SRVCLASS             
*                                 belongs to I/O priority group HIGH in         
*                                 the active policy            @OA62081         
R791IOPG EQU   X'40'              I/O priority group HIGH was assigned          
*                                 either to the address space or to             
*                                 transaction service classes served by         
*                                 the address space            @OA62081         
R791ITRG EQU   X'20'              R791RGRP is the name of a tenant              
*                                 resource group and R791RCL is the             
*                                 name of a tenant report class    @91A         
R791IISP EQU   X'10'              General purpose and specialty                 
*                                 processor consumption is considered           
*                                 by WLM capping algorithms for this            
*                                 address space                    @91A         
R791ICBP EQU   X'08'              Reserved for future use          @93C         
R791IRPB EQU   X'04'              On = data in R791RPBoost is valid.            
*                                  Off = not valid.               @A03A         
R791RPBoost EQU X'02'             Address space matched a classifi-             
*                                 cation rule in the active policy              
*                                 which enables for recovery process            
*                                 boost. Only valid if R791IRPB = ON.           
*                                                                 @A03A         
         DS    XL3                Reserved                         @64A         
R791RLEN EQU   *-R791ELEM         LENGTH OF ONE RELOCATE BLOCK                  
R791FLEN EQU   0                  LENGTH OF ONE FIXED BLOCK                     
*                                 WE ONLY HAVE RELOCATE BLOCKS                  
.STYP2   ANOP                                                                   
*                                                                               
*        RELOCATE BLOCK FOR SUBTYPE 2                                           
*                                                                               
*                                                                               
R792ELEM DSECT                    MAPPING OF ELEMENT                            
R792ASID DS    XL2                ASID ADDRESS SPACE IDENTIFIER                 
R792JBN  DS    CL8                NAME OF JOB                                   
R792DMN  DS    XL2                DOMAIN NUMBER                                 
*                                 not applicable in GOAL mode      @C1C         
R792NPG  DS    XL2                PERFORMANCE GROUP                             
*                                 not applicable in GOAL mode      @C1C         
R792CL   DS    CL2                CURRENT LOCATION                              
*                                   IN  - IN STORAGE                            
*                                   OT  - SWAPPED OUT AND READY                 
*                                   LO  - LOGICALLY SWAPPED                     
*                                   NS  - NON-SWAPPABLE                         
*                                   WM  - WAIT QUEUE/MSO                        
*                                   WL  - WAIT QUEUE/LONG WAIT                  
*                                   WT  - WAIT QUEUE/TERM WAIT                  
*                                   WO  - WAIT QUEUE/other reasons @I1A         
*                                   DL  - TSO user delayed by SRM               
*                                         to meet response time                 
*                                         objective                @I1A         
*                                   PR  - PRIVILEGED                            
*                                   >>  - TRANSITIONING OUT                     
*                                   <<  - TRANSITIONING IN                      
*                                                                               
*                                                                               
R792TAS  DS    XL2                TYPE OF USER                                  
*                                                                               
*                              CONTENTS   MEANING                               
*                              --------   -------                               
*                                   0 - BATCH                                   
*                                   1 - STARTED TASK                            
*                                   2 - MOUNT TASK                              
*                                   3 - TSO                                     
*                                                                               
*                                   4 - ASCH                       @A1A         
*                                   5 - OMVS                       @B2A         
*                                                                               
R792TRC  DS    XL2                TRANSACTION COUNT                             
R792TTOD DS    XL4                TRANSACTION ELAPSED TIME,                     
*                                 IN MILLISECONDS                               
R792PRFX DS    XL4                NUMBER OF PRIVATE FIXED FRAMES                
R792RSV1 DS    XL2                Reserved since 4.1.0             @W5C         
R792SVAR DS    XL4                SRM SERVICE ABSORPTION RATE FOR STEP          
R792TCPU DS    XL4                TOTAL TCB TIME FOR STEP          @R0C         
*                                 IN MILLISECONDS.                 @R0A         
*                                 Wraps after 4 Giga millisec  @WA02302         
R792PSS  DS    0CL8               STEP PRODUCT OF FRAME IN MILLISECONDS         
R792PSS1 DS    XL4                HIGH ORDER WORD                               
R792PSS2 DS    XL4                LOW ORDER WORD                                
R792EJST DS    XL4                Total CPU time consumed on behalf             
*                                 of this address space in millisecs.           
*                                 (ascbejst+ascbsrbt+assbasst).    @E2C         
*                                 Wraps after 4 Giga millisec  @WA02302         
R792TSRM DS    XL4                TOTAL SRM SERVICE FOR STEP                    
R792RTM  DS    XL4                RESIDENT TIME FOR STEP IN SECONDS             
R792EXCP DS    XL2                EXCP COUNT FOR STEP                           
R792CMNI DS    XL4                NUMBER OF COMMON PAGES FOR CURRENT            
*                                 TRANSACTION                                   
R792PNV  DS    XL4                NUMBER OF NON-VIO PAGES FOR CURRENT           
*                                 TRANSACTION                                   
R792PVIO DS    XL4                NUMBER OF VIO PAGES FOR CURRENT               
*                                 TRANSACTION                                   
R792FXBL DS    XL4                NUMBER OF FIXED FRAMES WHICH ARE              
*                                 LOCATED BELOW 16M REAL                        
R792PSWP DS    XL4                NUMBER OF PAGES SWAPPED IN FOR                
*                                 CURRENT TRANSACTION                           
R792LPAI DS    XL4                NUMBER OF LPA PAGES SWAPPED IN FOR            
*                                 CURRENT TRANSACTION                           
R792CSAI DS    XL4                NUMBER OF CSA PAGES SWAPPED IN FOR            
*                                 CURRENT TRANSACTION                           
R792LSQA DS    XL4                NUMBER OF LSQA FIXED FRAMES                   
R792NLQF DS    XL4                NUMBER OF NON-LSQA FIXED FRAMES               
R792TDEV DS    XL4                TOTAL DEVICE CONNECT TIME IN                  
*                                 MILLISECONDS                                  
R792RSV2 DS    XL2                Reserved since 4.1.0             @W5C         
R792PIN  DS    XL4                PAGE-IN COUNT                                 
R792TRTM DS    XL4                TRANSACTION RESIDENCY TIME                    
R792FLG  DS    XL1                FLAGS:                                        
R792XM   EQU   X'80'              -- CROSS MEMORY ADDRESS SPACE                 
R792RSM  EQU   X'40'              Invalid RSM data for address                  
*                                      space obtained              @W2A         
R792RSV3 EQU   X'20'              Reserved                         @C1A         
R792GOAL EQU   X'10'              On = system is in GOAL mode      @C1A         
R792SRV  EQU   X'08'              On = this address space is a                  
*                                 server address space             @C1A         
*                                  Off = GOAL specified for this                
*                                  address space is being honored               
*                                  by WLM                          @C1A         
R792QSC  EQU   X'04'              On = address space has been                   
*                                 quiesced by a RESET command      @C1A         
R792TXME EQU   X'02'              Address space matched a                       
*                                 classification rule in the active             
*                                 policy which prevents managing the            
*                                 region based on the response time             
*                                 goals of its served transactions              
*                                                              @OA62081         
R792TAFF EQU   X'01'              On = address space has temporal               
*                                 affinities, same as RASDTAF  @WA46622         
R792FLG2 DS    XL1                Additional flags                 @J1C         
R792CPRC EQU   X'80'              Service class assigned by                     
*                                 classification or RESET SRVCLASS was          
*                                 designated CPU-critical in the active         
*                                 policy                       @OA62081         
R792CPRE EQU   X'40'              Address space matched a                       
*                                 classification rule in the active             
*                                 policy which was designated                   
*                                 storage-critical             @OA62081         
R792CPRI EQU   X'20'              Address space is serving transactions         
*                                 which belong to a service class that          
*                                 was designated storage-critical in            
*                                 the active policy's classification            
*                                 rules, or is running in SYSTEM/SYSSTC         
*                                                              @OA62081         
R792CPUP EQU   X'10'              CPU protection was assigned either to         
*                                 the address space or to transaction           
*                                 service classes being served by the           
*                                 space                        @OA62081         
R792STOP EQU   X'08'              Storage protection was assigned               
*                                 either to the address space or to             
*                                 transaction service classes being             
*                                 served by the space          @OA62081         
R792CRMP EQU   X'04'              The dispatch priority of the                  
*                                 address space is currently                    
*                                 promoted due to a chronic                     
*                                 resource contention              @21A         
R792TXMB EQU   X'02'              Address space is a CICS TOR that              
*                                 matched a classification rule in the          
*                                 active policy which allows managing           
*                                 the region based on the region goals          
*                                 but also ensures that completed               
*                                 transactions are reported and used            
*                                 for management of the CICS AORs               
*                                                              @OA62081         
R792NOHP EQU   X'01'              Honor priority ineligibility was              
*                                 assigned either to the address space          
*                                 or to transaction service classes             
*                                 being served by the space    @OA62081         
R792LSQR DS    XL4                LSQA pages in real storage                    
*                                      CNTFTN + CNTFRLSD           @W1A         
R792LSQE DS    XL4                LSQA pages in ext. storage                    
*                                      CNTFTLSD - CNTFRLSD         @W1A         
R792ARS  DS    XL4                AVG NUM OF REAL FRAMES FOR STEP  @W5A         
R792TWSS DS    XL4                SRM TARGET WORKING SET SIZE                   
*                                 FOR THIS JOB                     @W5A         
R792PHSP DS    XL4                Number of hiperspace pages                    
*                                 for current transaction          @W7A         
R792EXCT DS    XL4                New 4-byte EXCP count field  @YA42170         
R792SCL  DS    CL8                Service class name               @C1A         
R792SCP  DS    BL2                Service class period             @C1A         
R792WKLD DS    CL8                Workload name                    @C1A         
R792RGRP DS    CL8                Resource group name              @C1A         
         DS    XL2                RESERVED                                      
R792TCPC DS    XL4                Total CPU time consumed in this               
*                                 address space in milliseconds.                
*                                 (ascbejst+ascbsrbt+assbphtm)     @E2A         
R792ASST DS    XL4                CPU time consumed by preemptible-             
*                                 class SRBs running on behalf of               
*                                 this address space in milliseconds.           
*                                 (assbasst)                       @E2A         
R792PHTM DS    XL4                CPU time consumed by preemptible-             
*                                 class SRBs running in this address            
*                                 space in milliseconds (assbphtm) @E2A         
*                                                                               
R792FXAB DS    XL4                Number of fixed frames between                
*                                 16M and 2G (ESAME only)          @I5A         
*                                                                               
R792TCBP DS   0XL4                Reserved for future use          @93C         
R792TIFA DS    XL4                CPU time consumed on zAAPs (IFAs)             
*                                 (ASSB_TIME_ON_IFA)               @93C         
R792TCP  DS    XL4                CPU time consumed on standard CPs             
*                                 (ASSB_TIME_ON_CP). Only valid if              
*                                 zAAPs or zIIPs in configuration               
*                                                              @OA13499         
R792TCBPonCP DS 0XL4              Reserved for future use          @93C         
R792TIFC DS    XL4                CPU time consumed on standard CPs             
*                                 by zAAP (IFA) eligible work                   
*                                 (ASSB_TIME_IFA_ON_CP).           @93C         
R792NFFCBP DS 0XL4                Reserved for future use          @93C         
R792NFFI DS    XL4                Normalization factor for zAAP time.           
*                                 Used to convert between real zAAP             
*                                 times and "normalized" zAAP times,            
*                                 i.e. the equivalent time on a                 
*                                 standard CP. Multiply R792TIFA by             
*                                 this value and divide by 256 to               
*                                 calculate the normalized zAAP time.           
*                                                                  @93C         
R792TSUP DS    XL4                CPU time consumed on zIIPs                    
*                                 (ASSB_TIME_ON_zIIP)          @OA13499         
R792TSUC DS    XL4                CPU time consumed on standard CPs             
*                                 by zIIP eligible work                         
*                                 (ASSB_TIME_zIIP_ON_CP)       @OA13499         
R792NFFS DS    XL4                Normalization factor for zIIP time.           
*                                 Used to convert between real zIIP             
*                                 times and "normalized" zIIP times,            
*                                 i.e. the equivalent time on a                 
*                                 standard CP. Multiply R792TSUP by             
*                                 this value and divide by 256 to               
*                                 calculate the normalized zIIP time.           
*                                                              @OA13499         
R792EXCW DS    CL8                EXCP Count ( DoubleWord )    @OA15850         
R792CBPPHTM DS 0XL4               Reserved for future use          @93C         
R792PHTA DS    XL4                zAAP-only equivalent of R792PHTM              
*                                 (ASSB_IFA_PHTM). This is normalized           
*                                 time                             @93C         
R792PHTI DS    XL4                zIIP-only equivalent of R792PHTM              
*                                 (ASSB_zIIP_PHTM).                             
*                                 This is normalized time          @31A         
R792FLG3 DS    XL1                Additional flags                 @64A         
R792CIPG EQU   X'80'              Service class was assigned by                 
*                                 classification, or RESET SRVCLASS             
*                                 belongs to I/O priority group HIGH in         
*                                 the active policy            @OA62081         
R792IOPG EQU   X'40'              I/O priority group HIGH was assigned          
*                                 either to the address space or to             
*                                 transaction service classes served by         
*                                 the address space            @OA62081         
R792ITRG EQU   X'20'              R792RGRP is the name of a tenant              
*                                 resource group                   @91A         
R792IISP EQU   X'10'              General purpose and specialty                 
*                                 processor consumption is considered           
*                                 by WLM capping algorithms for this            
*                                 address space                    @91A         
R792ICBP EQU   X'08'              Reserved for future use          @93C         
R792IRPB EQU   X'04'              On = data in R792RPBoost is valid.            
*                                  Off = not valid.               @A03A         
R792RPBoost EQU X'02'             Address space matched a classifi-             
*                                 cation rule in the active policy              
*                                 which enables for recovery process            
*                                 boost. Only valid if R792IRPB = ON.           
*                                                                 @A03A         
         DS    XL3                Reserved                         @64A         
R792RLEN EQU   *-R792ELEM         LENGTH OF ONE RELOCATE BLOCK                  
R792FLEN EQU   0                  LENGTH OF ONE FIXED BLOCK                     
*                                 WE ONLY HAVE RELOCATE BLOCKS                  
.STYP3   ANOP                                                                   
*                                                                               
*        RELOCATE BLOCK FOR SUBTYPE 3                                           
*                                                                               
*                                                                               
R793     DSECT                    SCALAR RELOCATE SECTION                       
R793RSV1 DS    XL2                Reserved since 4.1.0             @W5C         
R793CRI  DS    XL2                Current System UIC                            
*                                 (MCTCurSystemUIC)                @02C         
*                                                              @WA56739         
*        With apar OW56739 4-byte fields are appended to replace                
*        the 2-byte storage frame count fields. The old 2-byte                  
*        fields still will be filled. They will contain value -1                
*        (x'FFFF') if a frame count is greater than 32767.                      
*                                                              @WA56739         
R793SQA  DS    XL2                NUMBER OF FIXED SQA FRAMES                    
*                                 (replaced by R793SQA4)       @WA56739         
R793CMNF DS    XL2                NUMBER OF COMMON (LPA+CSA)                    
*                                 PAGEABLE AND FIXED FRAMES                     
*                                 (replaced by R793CMN4)       @WA56739         
R793CMFF DS    XL2                NUMBER OF COMMON (LPA+CSA)                    
*                                 FIXED FRAMES                                  
*                                 (replaced by R793CMF4)       @WA56739         
R793PRFX DS    XL2                NUMBER OF PRIVATE FIXED FRAMES                
*                                 (LSQA+NON-LSQA)                               
*                                 (replaced by R793PFX4)       @WA56739         
R793CPUU DS    XL2                PROCESSOR UTILIZATION (0-101)                 
R793DQ   DS    XL2                LENGTH OF OUT WAIT QUEUE     @WA19913         
R793INC  DS    XL2                NUMBER OF ADDRESS SPACES IN STORAGE           
*                                 (SRM IN QUEUE)                                
R793OUTU DS    XL2                NUMBER OF ADDRESS SPACES OUT OF               
*                                 STORAGE (SRM OUT QUEUE)                       
R793LCU  DS    XL2                RESERVED                                      
R793RSV4 DS    XL2                RESERVED LJM-SPE                 @Y2C         
R793LPAF DS    XL2                Number of total LPA frames   @YA34458         
*                                 (replaced by R793LPF4)       @WA56739         
R793CSAF DS    XL2                Number of total CSA frames   @YA34458         
*                                 (replaced by R793CSF4)       @WA56739         
R793LPFX DS    XL2                NUMBER OF LPA FIXED FRAMES                    
*                                 (replaced by R793LFX4)       @WA56739         
R793CSFX DS    XL2                NUMBER OF CSA FIXED FRAMES                    
*                                 (replaced by R793CFX4)       @WA56739         
R793LSQA DS    XL2                NUMBER OF FIXED LSQA FRAMES                   
*                                 (replaced by R793LSQ4)       @WA56739         
R793NLQF DS    XL2                NUMBER OF PRIVATE NON LSQA FIX FRAMES         
*                                 (replaced by R793NLF4)       @WA56739         
R793LOUT DS    XL2                NUMBER OF ADDRESS SPACES LOGICALLY            
*                                 SWAPPED OUT                                   
R793SQR  DS    XL4                SQA pages in real storage                     
*                                      CTSQAF + CTRSQAF            @W1A         
R793SQE  DS    XL4                SQA pages in ext. storage                     
*                                      CTTSQAF - CTRSQAF           @W1A         
R793LSQR DS    XL4                LSQA pages in real storage                    
*                                      CTLSQAF + CTRLSQAF          @W1A         
R793LSQE DS    XL4                LSQA pages in ext. storage                    
*                                      CTTLSQAF - CTRLSQAF         @W1A         
R793AFC  DS    XL4                NUMBER OF AVAILABLE FRAMES       @W5A         
R793CUT  DS    XL4                MVS view of CPU utilization                   
*                                 (interval - wait time) if Monitor I           
*                                 CPU gathering is active, otherwise            
*                                 CCVUTILP value at end of interval.            
*                                 (The interval length of the MVS               
*                                 view value is either 5 seconds or             
*                                 the Monitor I cycle time, if it is            
*                                 larger than 5 seconds.)      @WA05435         
*                                                              @WA56739         
R793SQA4 DS    XL4                NUMBER OF FIXED SQA FRAMES   @WA56739         
*                                 (replaces R793SQA)           @WA56739         
R793CMN4 DS    XL4                NUMBER OF COMMON (LPA+CSA)   @WA56739         
*                                 PAGEABLE AND FIXED FRAMES    @WA56739         
*                                 (replaces R793CMN)           @WA56739         
R793CMF4 DS    XL4                NUMBER OF COMMON (LPA+CSA)   @WA56739         
*                                 FIXED FRAMES                 @WA56739         
*                                 (replaces R793CMFF)          @WA56739         
R793PFX4 DS    XL4                NUMBER OF PRIVATE FIXED      @WA56739         
*                                 FRAMES (LSQA+NON-LSQA)       @WA56739         
*                                 (replaces R793PRFX)          @WA56739         
R793LPF4 DS    XL4                Number of total LPA frames   @WA56739         
*                                 (replaces R793LPAF)          @WA56739         
R793CSF4 DS    XL4                Number of total CSA frames including          
*                                 user key common storage allocated in          
*                                 Restricted Use CSA (RUCSA)       @94C         
*                                 (replaces R793CSAF)          @WA56739         
R793LFX4 DS    XL4                NUMBER OF LPA FIXED FRAMES   @WA56739         
*                                 (replaces R793LPFX)          @WA56739         
R793CFX4 DS    XL4                Number of CSA fixed frames including          
*                                 user key common storage allocated in          
*                                 RUCSA                            @94C         
*                                 (replaces by R793CSFX)       @WA56739         
R793LSQ4 DS    XL4                NUMBER OF FIXED LSQA FRAMES  @WA56739         
*                                 (replaces R793LSQA)          @WA56739         
R793NLF4 DS    XL4                NUMBER OF PRIVATE NON LSQA   @WA56739         
*                                 FIXED FRAMES                 @WA56739         
*                                 (replaces R793NLQF)          @WA56739         
R793RLEN EQU   *-R793             LENGTH OF ONE RELOCATE BLOCK                  
R793FLEN EQU   0                  LENGTH OF ONE FIXED BLOCK                     
*                                 WE ONLY HAVE RELOCATE BLOCKS                  
.STYP4   ANOP                                                                   
*                                                                               
*        RELOCATE BLOCK FOR SUBTYPE 4                                           
*                                                                               
*                                                                               
R794     DSECT                    SCALAR RELOCATE SECTION                       
R794CMNI DS    XL4                SYSTEM COMMON (LPA+CSA) PAGES IN              
R794CMNO DS    XL4                SYSTEM COMMON (CSA) PAGES OUT                 
R794CMNR DS    XL4                SYSTEM COMMON (LPA+CSA) PAGES                 
*                                 RECLAIMED, not used since rel 330             
R794SWPO DS    XL4                NUMBER OF SWAPS (OUT)            @P1C         
R794PSPI DS    XL4                NUMBER OF PAGES SWAPPED IN                    
R794PSPO DS    XL4                NUMBER OF PAGES SWAPPED OUT                   
R794PRVI DS    XL4                NUMBER OF PRIVATE PAGES                       
*                                 (VIO+NON-VIO) SWAPPED IN                      
R794PRVO DS    XL4                NUMBER OF PRIVATE PAGES                       
*                                 (VIO+NON-VIO) SWAPPED OUT                     
R794PRVR DS    XL4                NUMBER OF PRIVATE PAGES                       
*                                 (VIO+NON-VIO) RECLAIMED                       
*                                 not used since rel 330                        
R794VIO  DS    XL4                NUMBER OF VIO PAGES (IN+OUT)                  
R794RSV1 DS    XL2                Reserved since 4.1.0             @W5C         
R794CRI  DS    XL2                Current System UIC                            
*                                 (MCTCurSystemUIC)                @02C         
R794ACRI DS    XL2                AVERAGE OF HIGH UIC COUNT                     
*                                 not used since rel 330                        
R794RV1  DS    XL2                RESERVED                                      
R794LPAI DS    XL4                SYSTEM LPA PAGES IN          @G537NLS         
R794CSAI DS    XL4                SYSTEM CSA PAGES OUT         @G537NLS         
R794LPAR DS    XL4                SYSTEM LPA PAGES RECLAIMED   @G537NLS         
*                                 not used since rel 330                        
R794CSAR DS    XL4                SYSTEM CSA PAGES RECLAIMED   @G537NLS         
*                                 not used since rel 330                        
R794RSV2 DS    XL2                Reserved since 4.1.0             @W5C         
         DS    XL2                UNUSED (Was Migation age)        @Q2C         
R794ERTE DS    XL4                NO. PAGES TO EXT. STORAGE        @P2A         
R794EVAL DS    XL4                NO. OF EXTENDED STORAGE SLOTS                 
*                                 AVAIL. AND NOT IN USE            @P2A         
R794ESSL DS    XL4                AVAILABLE FOR FUTURE USE         @P2A         
R794MRTE DS    XL4                NO. OF PAGES MIGRATED FROM                    
*                                 EXT. STOR. TO AUX. STOR.         @P6A         
R794MAGE DS    XL4                Migration age                    @Q2M         
*                                                                  @P6D         
R794AFC  DS    XL4                NUMBER AVAILABLE FRAMES          @W5A         
R794TWSS DS    XL4                TARGET WORKING SETSIZE FOR THE COMMON         
*                                 AREA                             @W5A         
R794HSP  DS    XL4                Number of hiperspace pages                    
*                                 (In + Out)                       @W7A         
R794PPIA DS    XL4                Number of blocked pages paged in              
*                                 from AUX (private)               @A3A         
R794LPIA DS    XL4                Number of blocks paged in from                
*                                 AUX (private)                    @A3A         
R794RLEN EQU   *-R794             LENGTH OF ONE RELOCATE BLOCK                  
R794FLEN EQU   0                  LENGTH OF ONE FIXED BLOCK                     
*                                 WE ONLY HAVE RELOCATE BLOCKS                  
.STYP5   ANOP                                                                   
*                                                                               
*        RELOCATE BLOCK FOR SUBTYPE 5                                           
*                                                                               
R795ELEM DSECT                    MAPPING OF ELEMENT                            
R795ASID DS    XL2                ADDRESS SPACE IDENTIFIER                      
R795JBN  DS    CL8                NAME OF JOB                                   
R795DMN  DS    XL2                DOMAIN NAME                                   
*                                 not applicable in GOAL mode      @C1C         
R795NPG  DS    XL2                PERFORMANCE GROUP                             
*                                 not applicable in GOAL mode      @C1C         
R795PGP  DS    XL2                PERFORMANCE GROUP PERIOD                      
*                                 not applicable in GOAL mode      @C1C         
R795TTOD DS    XL4                REAL TIME INTO TRANSACTION                    
R795CL   DS    CL2                CURRENT LOCATION                              
*                                                                               
*                              CONTENTS   MEANING                               
*                              --------   -------                               
*                                   IN - SWAPPED IN                             
*                                   OT - SWAPPED OUT AND READY                  
*                                   LO - LOGICALLY SWAPPED OUT @G537NLS         
*                                   NS - NON-SWAPPABLE                          
*                                   WM - WAIT QUEUE/MSO                         
*                                   WL - WAIT QUEUE/LONG WAIT                   
*                                   WT - WAIT QUEUE/TERM WAIT                   
*                                   WO - WAIT QUEUE/other reasons  @I1A         
*                                   DL - TSO user delayed by SRM                
*                                        to meet response time                  
*                                        objective                 @I1A         
*                                   PR - PRIVLEDGED                             
*                                   >> - TRANSITIONING OUT                      
*                                   << - TRANSITIONING IN                       
         SPACE                                                                  
R795TAS  DS    XL2                TYPE OF USER                                  
*                                                                               
*                              CONTENTS   MEANING                               
*                              --------   -------                               
*                                   0 - BATCH                                   
*                                   1 - STARTED TASK                            
*                                   2 - MOUNT TASK                              
*                                   3 - TSO                                     
*                                   4 - ASCH                       @A1A         
*                                   5 - OMVS                       @B2A         
         SPACE                                                                  
R795TROD DS    CL4                TRANSACTION RESIDENT TIME                     
R795TCNT DS    XL2                TRANSACTION COUNT                             
R795SWC  DS    XL2                TRANSACTION SWAP COUNT                        
R795CPUS DS    XL4                TOTAL PROCESSOR  SERVICE FOR                  
*                                 TRANSACTION (ZERO WHEN ASID IS OUT            
*                                 OF STORAGE)                                   
R795MSOS DS    XL4                TOTAL MSO SERVICE FOR                         
*                                 TRANSACTION (ZERO WHEN ASID IS OUT            
*                                 OF STORAGE)                                   
R795IOCS DS    XL4                TOTAL IOC SERVICE FOR                         
*                                 TRANSACTION (ZERO WHEN ASID IS OUT            
*                                 OF STORAGE)                                   
R795WMS  DS    XL4                TOTAL SERVICE FOR                             
*                                 TRANSACTION (ZERO WHEN ASID IS OUT            
*                                 OF STORAGE)                                   
R795TOTL DS    XL4                TOTAL SERVIC FOR SESSION                      
*                                 (ZERO WHEN ASID IS OUT OF STORAGE)            
R795TOT  DS    XL4                TOTAL SERVICE FOR TRANSACTION                 
*                                 SINCE LAST SWAP - IN                          
R795SRBS DS    XL4                TOTAL SRB SERVICE FOR                         
*                                 TRANSACTION (ZERO WHEN ASID IS OUT            
*                                 OF STORAGE)                                   
R795FLG  DS    XL1                Flags                            @C1A         
R795RSV1 EQU   X'E0'              Reserved                         @C1A         
R795GOAL EQU   X'10'              On = system is in GOAL mode      @C1A         
R795SRV  EQU   X'08'              On = this address space is a                  
*                                 server address space             @C1A         
*                                  Off = GOAL specified for this                
*                                  address space is being honored               
*                                  by WLM                          @C1A         
R795QSC  EQU   X'04'              On = address space has been                   
*                                 quiesced by a RESET command      @C1A         
R795TRG  EQU   X'02'              On = R795RGRP is the name of a tenant         
*                                 resource group                   @91A         
R795SCL  DS    CL8                Service class name               @C1A         
R795SCP  DS    BL2                Service class period             @C1A         
R795WKLD DS    CL8                Workload name                    @C1A         
R795RGRP DS    CL8                Resource group name              @C1A         
R795RLEN EQU   *-R795ELEM         LENGTH OF ONE RELOCATE BLOCK                  
R795FLEN EQU   0                  LENGTH OF ONE FIXED BLOCK                     
*                                 WE ONLY HAVE RELOCATE BLOCKS                  
.STYP6   ANOP                                                                   
*                                                                               
*          RELOCATE BLOCK FOR SUBTYPE 6 - MONITOR 2                @L8A         
*          ENQUEUE RESERVE                                         @L8A         
*                                                                               
R796ELEM DSECT                    MAPPING OF ELEMENT               @L8A         
R796ASID DS    XL2                ADDRESS SPACE ID OF THE JOB WHICH@L8A         
*                                 ISSUED THE RESERVE                            
R796MAJ  DS    CL8                MAJOR NAME OF THE RESOURCE       @L8A         
R796MIN  DS    CL44               MINOR NAME OF THE RESOURCE       @L8A         
R796JBN  DS    CL8                NAME OF THE JOB IN WHICH THE     @L8A         
*                                 RESERVE WAS ISSUED                            
R796VOLS DS    CL6                VOLUME SERIAL OF THE VOLUME      @L8A         
*                                 AGAINST WHICH THE RESERVE WAS ISSUED          
R796UCB  DS    CL3                THE 3 DIGIT DEV NUMBER AGAINST   @C2C         
*                                 THE RESERVE WAS ISSUED, OR "UCB" @C2C         
*                                 IF UCBNAME = "UCB"               @C2A         
R796REQ  DS    CL2                TYPE AND STATUS OF REQUEST FOR   @L8A         
*                                 THE RESOURCEISSUED                            
R796MINL DS    XL2                MINOR NAME LENGTH FOR REPORTING  @L8A         
R796FLG  DS    XL1                DATA TYPE FLAGS                  @L8A         
R796RESV EQU   X'80'              1... .... ON=DEVICE RESERVED BY               
*                                           THIS CPU               @L8A         
R796TRUN EQU   X'40'              .1.. .... ON=MINOR NAME TRUNCATED             
*                                                                  @L8A         
R796GLBL EQU   X'20'              ..1. .... ON=GLOBAL RESOURCE     @LCA         
R796RESC EQU   X'10'              ...1 .... ON=RES REQU CONV TO                 
*                                           GLOBAL ENQ             @Q1A         
*                                 .... XXXX RESERVED BITS          @L8A         
R796SID  DS    CL8                SYSTEM ID OF THE JOB BY WHICH                 
*                                 THE RESERVE WAS ISSUED                        
R796DVN  DS    XL2                DEV NUMBER (BIN)                 @82C         
*                                 R796DVN moved into REL BLOCK @WA02579         
R796SCS  DS    XL1                SUBCHANNEL SET ID                @82A         
R796RSV  DS    XL1                RESERVED                         @82A         
R796RLEN EQU   *-R796ELEM         LENGTH OF ONE RELOCATE BLOCK                  
R796FLEN EQU   0                  LENGTH OF ONE FIXED BLOCK                     
*                                 WE ONLY HAVE RELOCATE BLOCKS                  
.STYP7   ANOP                                                                   
*                                                                               
*          RELOCATE BLOCK FOR SUBTYPE 7 - MONITOR 2                @L8A         
*          ENQUEUE REQUESTS                                        @L8A         
*                                                                  @L8A         
R797ELEM DSECT                    MAPPING OF ELEMENT               @L8A         
R797MAJ  DS    CL8                MAJOR NAME OF THE RESOURCE       @L8A         
R797MIN  DS    CL44               MINOR NAME OF THE RESOURCE       @L8A         
R797FLG  DS    XL1                DATA TYPE FLAGS                  @L8A         
         SPACE                                                                  
R797GDET EQU   X'80'              1... .... ON=DETAIL DATA, OFF=SUMMARY         
*                                           DATA                   @L8A         
R797GMAJ EQU   X'40'              .1.. .... ON= MAJOR NAME IS                   
*                                           SPECIFIED              @L8A         
R797GMIN EQU   X'20'              ..1. .... ON= MINOR NAME IS                   
*                                           SPECIFIED              @L8A         
R797TRNC EQU   X'10'              ...1 .... ON=MINOR NAME                       
*                                           TRUNCATED              @L8A         
R797GLBL EQU   X'08'              .... 1... ON=GLOBAL RESOURCE     @LCA         
*                                                                  @L8A         
R797ALLS EQU   X'04'              .... .1.. ON=RESOURCES IS HELD BY SYS         
*                                                                  @L8A         
R797ALLE EQU   X'02'              .... ..1. ON=ALL EXL OWNED HELD               
*                                           BY SYS                 @L8A         
         SPACE                                                                  
*                                 .... ...X RESERVED BITS          @LLA         
R797MINL DS    XL4                MINOR NAME LENGTH FOR REPORTING               
*                                                                  @L8A         
R797OWN  DS    XL2                COUNT OF REQUESTS OWNING RESOURCE             
*                                                                  @L8A         
R797EXCW DS    XL2                COUNT EXCL REQS WAITING FOR RESOURCE          
*                                                                  @L8A         
R797SHRW DS    XL2                COUNT SHR REQS WAITING FOR RESOURCE           
*                                                                  @L8A         
R797REQ  DS    CL2                TYPE AND STATUS OF REQUEST       @L8A         
*                                 FOR A RESOURCE                                
R797JBN  DS    CL8                NAME OF JOB WHICH ISSUED THE ENQ @L8A         
R797ASID DS    CL2                ADDRESS SPACE ID OF THE JOB WHICH             
*                                 ISSUED THE ENQ                                
R797SCOP DS    CL4                SCOPE OF THE RESOURCE                         
R797RES  DS    CL2                RESERVED                         @L8A         
R797SID  DS    CL8                SYSTEM ID OF JOB THAT ISSUED ENQ              
         DS    XL3                RESERVED FOR ALIGNMENT                        
R797RLEN EQU   *-R797ELEM         LENGTH OF ONE RELOCATE BLOCK                  
R797FLEN EQU   0                  LENGTH OF ONE FIXED BLOCK                     
*                                 WE ONLY HAVE RELOCATE BLOCKS                  
.STYP8   ANOP                                                  @GM2EPDV         
*                                                                               
*           RELOCATE BLOCK FOR SUBTYPE 8 - MONITOR 2           @GM2EPDV         
*           TRANSACTION ANALYSIS                               @GM2EPDV         
*                                                                               
R798ELEM DSECT                    MAPPING OF ELEMENT           @GM2EPDV         
R798ICSI DS    CL2                ICS MEMBER NAME ID           @GM2EPDV         
R798IPSI DS    CL2                IPS MEMBER NAME ID           @GM2EPDV         
R798PGN  DS    XL2                PERFORMANCE GROUP NUMBER     @GM2EPDV         
R798PGP  DS    XL2                PERFORMANCE GROUP PERIOD     @GM2EPDV         
R798SYS  DS    CL4                SUBSYSTEM NAME               @GM2EPDV         
R798TTX  DS    XL4                NUMBER OF ENDED TRANSACTIONS @GM2EPDV         
R798TTM  DS    XL4                ELAPSED TIME OF ENDED TRANS FOR PGP,          
*                                 IN 1024 MICROSECONDS         @GM2EPDV         
R798CLS  DS    CL10               TRANSACTION CLASS NAME       @GM2EPDV         
R798USR  DS    CL10               USERID                       @GM2EPDV         
R798NAM  DS    CL10               TRANSACTION NAME             @GM2EPDV         
R798FL1  DS    XL1                DATA TYPE FLAGS              @GM2EPDV         
         SPACE                                                                  
R798RPT  EQU   X'80'              1... .... ON=RPT PGN,        @GM2EPDV         
*                                           OFF=CONTROL PGN    @GM2EPDV         
R798ACN  EQU   X'40'              .1.. .... ON=ACCTINFO USED       @R0A         
*                                 ..XX XXXX RESERVED BITS          @R0C         
         DS    XL5                RESERVED                         @C1C         
R798TET  DS    0D                 ELAPSED TIME OF ENDED TRANS FOR PGP,          
*                                 IN 1024 MICROSECONDS             @C1A         
R798TET1 DS    F                  R798TET - WORD 1                 @C1A         
R798TET2 DS    F                  R798TET - WORD 2                 @C1A         
         SPACE                                                                  
R798RLEN EQU   *-R798ELEM         LENGTH OF ONE RELOCATE BLOCK                  
R798FLEN EQU   0                  LENGTH OF ONE FIXED BLOCK                     
*                                 WE ONLY HAVE RELOCATE BLOCKS                  
         SPACE 3                                                                
.STYP9   ANOP                                                  @GM2EPDV         
*                                                                               
*           RELOCATE BLOCK FOR SUBTYPE 9 - MONITOR 2                            
*                                                                               
*           DEVICE DATA SECTION (ONE PER DEVICE)                                
*                                                                               
R799ELEM DSECT          MAPPING OF ELEMENT                                      
R799NUM  DS    PL2      DEVICE NUMBER IN THE RANGE X'0000' TO X'0FFF'           
R799LCU  DS    BL2      LOGICAL CONTROL UNIT GROUP NUMBER 0 TO 255              
R799RV0  DS    BL1      RESERVED                                                
R799CNF  DS    BL1      DEVICE FLAGS:                                           
R799QUL  EQU   X'80'    1... ....   ON= IOS Q-LENGTH INVALID                    
R799LCD  EQU   X'40'    .1.. ....   ON= NO LCU INFORMATION                      
R799CMB  EQU   X'20'    ..1. ....   ON= CMB DATA INVALID                        
R799DTF  EQU   X'10'    ...1 ....   ON= DEVICE CONNECT OR PENDING OR            
*                                       DISCONNECT TIME IS INVALID              
*                                                              @WA15094         
*        EQU   X'08'    .... 1...   RESERVED                                    
R799MXB  EQU   X'04'    .... .1..   RESERVED                       @81C         
R799VAC  EQU   X'02'    .... ..1.   ON= DATA RECORDED IS INVALID                
*                                       BECAUSE DEVICE WAS VARIED               
*                                       DURING INTERVAL                         
R799STA  EQU   X'01'    .... ...1   ON= DEVICE IS CURRENTLY ONLINE              
R799SER  DS    CL6      VOLUME SERIAL NUMBER OF MOUNTED VOLUME                  
R799TYP  DS    BL4      UNIT TYPE                                               
R799NUX  DS    BL4      Number of exposures (if multiple).                      
*                       In case of a HyperPAV base device,                      
*                       R799HPV = 1, number of accumulated                      
*                       HyperPAV aliases                           @01C         
R799SSC  DS    BL4      START SUBCHANNEL (SSCH) COUNT                           
R799MEC  DS    BL4      MEASUREMENT EVENT COUNT (NUMBER OF SSCH                 
*                       FOR WHICH CONNECT, PENDING, AND ACTIVE                  
*                       TIMES WERE STORED)                                      
R799CNN  DS    BL4      DEVICE CONNECT TIME                                     
R799PEN  DS    BL4      FUNCTION PENDING TIME                                   
R799ATV  DS    BL4      FUNCTION ACTIVE TIME                                    
R799DIS  DS    BL4      DEVICE DISCONNECT TIME                                  
R799QUE  DS    BL4      NUMBER OF REQUESTS QUEUED IN IOS FOR                    
*                       THIS DEVICE                                             
R799UTL  DS    BL4      NUMBER OF SAMPLES WHEN THE DEVICE WAS                   
*                       RESERVED, BUT AN SSCH HAD NOT BEEN ISSUED               
R799RSV  DS    BL4      NUMBER OF SAMPLES DURING THE MEASUREMENT                
*                       INTERVAL THAT INDICATED THAT THE DEVICE                 
*                       WAS RESERVED                                            
R799DSO  DS    BL4      reserved - do not use - variable name is                
*                       needed for conversion                      @U1C         
R799ALC  DS    BL4      NUMBER OF SAMPLES DURING THE MEASUREMENT                
*                       INTERVAL THAT INDICATED THAT THE DEVICE                 
*                       WAS ALLOCATED                                           
R799DVB  DS    BL4      device busy delay time                     @Z1C         
*                       (3090,9021,9121,9221 support)                           
R799CUB  DS    BL4      No longer used                             @K1C         
R799ICT  DS    BL2      No longer used                            @A02C         
R799CNX  DS    BL1      Device flag extensions                     @G2A         
R799PAV  EQU X'80'      1... .... =1 If base exposure of a Parallel             
*                                    Access Volume                 @G2A         
R799NXC  EQU X'40'      .1.. .... =1 If number of alias exposures               
*                                    changed                       @G2A         
R799NTF  EQU X'20'      ..1. .... =1 Timing facility not active    @I2A         
R799ECM  EQU X'10'      ...1 .... =1 ECMB mode                     @K3A         
R799STS  EQU X'08'      .... 1... =1 model dependent data not      @K1A         
*                                    available by STSCH            @K1A         
R799FCM  EQU X'04'      .... .1.. =1 Initial command response      @K1A         
*                                    time available                @K1A         
R799HPV  EQU X'02'      .... ..1. =1 HyperPAV base device          @01A         
R799FID  EQU X'01'      .... ...1 =1 Interrupt delay time      @OA39993         
*                                    available                 @OA39993         
R799RES  DS    BL1      reserved                                   @G2C         
R799SGN  DS    CL8      Storage Group Name                         @U1A         
R799NDA  DS    BL4      Total number of allocations in effect for the           
*                       device                                     @U2A         
R799DPB  DS    BL4      No longer used                             @K1C         
R799CMR  DS    BL4      Command response time in units of          @K1C         
*                       128 microseconds                           @K1C         
R799PCT  DS    BL4      Number of unsuccessful PAV samples     @WA31701         
R799PSM  DS    BL4      Number of successful PAV samples           @01A         
R799IDT  DS    BL4      Interrupt delay time in units of       @OA39993         
*                       128 microseconds. This field is zero if                 
*                       not supported by the hardware.                          
R799CUQ  DS    BL4      Control Unit Queuing Time                  @62A         
R799CN2  DS    BL1      Device flag extension                      @62A         
R799CFC  EQU x'80'      1... .... =1 Device connected to FICON     @62A         
R799SCS  DS    BL1      Subchannel set the device is situated      @63A         
R799MN2  DS    BL2      Device number same as R799NUM              @63A         
R799IOS  DS    BL4      IOS Queue time in microseconds             @85A         
R799RLEN EQU   *-R799ELEM         LENGTH OF ONE RELOCATE BLOCK                  
R799FLEN EQU   0                  LENGTH OF ONE FIXED BLOCK                     
*                                 WE ONLY HAVE RELOCATE BLOCKS                  
.STYPA   ANOP                                                      @LBA         
*                                                                               
*           RELOCATE BLOCK FOR SUBTYPE A - MONITOR 2               @LBA         
*           DISPLAY DOMAIN DATA                                    @LBA         
*                                                                               
R79AELEM DSECT                    MAPPING OF ELEMENT               @LBA         
R79ATWSR DS    XL4                TIME WEIGHTED SERVICE RATE       @LBA         
         DS    XL2                Reserved                         @A3C         
R79ARUA  DS    XL2                AVERAGE NUMBER OF READY USERS    @LBA         
R79RSV5  DS    XL2                RESERVED LJM-SPE                 @Y2C         
R79ACMPL DS    XL2                CURRENT MPL VALUE                @LBA         
R79AOUTU DS    XL2                AVERAGE NUMBER OF USERS SWAPPED OUT           
R79AINCU DS    XL2                AVERAGE NUMBER OF SWAPPED IN-USER             
         DS    XL2                Reserved                         @A3C         
R79ACIDX DS    XL2                CONTENTION INDEX                 @LBA         
R79ANSW  DS    XL2                NUMBER OF NON SWAPPABLE USERS                 
R79ADMNO DS    XL1                DOMAIN NUMBER                    @LBA         
R79RESV1 DS    XL1                RESERVED. FORMER R79ADMLO        @P3C         
R79RESV2 DS    XL1                RESERVED. FORMER R79ADMHI        @P3C         
         DS    CL1                Reserved                         @A3C         
R79AIPS  DS    CL2                CURRENT IPS                      @LBA         
R79ACPU  DS    CL4                CPU SERVICE COEF.                @LBA         
R79AIOS  DS    CL4                I/O SERVICE COEF.                @LBA         
R79ARSV4 DS    CL4                RESERVED SINCE RMF 4.2.0         @Y2C         
R79ASRB  DS    CL4                SRB SERVICE COEF.                @LBA         
R79ATWET DS    CL4                AVERAGE FIRST PERIOD TSO TRANSACTION          
*                                 RESPONSE TIME                                 
R79ADMLO DS    XL2                MIN MPL LEVEL                    @P3C         
R79ADMHI DS    XL2                MAX MPL LEVEL                    @P3A         
R79AMSO  DS    CL8                MAIN STORAGE SERVICE COEFICIENT  @Y2A         
R79AIMPL DS    XL2                IN MPL Target                    @A3A         
R79AOMPL DS    XL2                OUT MPL Target                   @A3A         
R79ARLEN EQU   *-R79AELEM         LENGTH OF ONE RELOCATE BLOCK                  
R79AFLEN EQU   0                  LENGTH OF ONE FIXED BLOCK                     
*                                 WE ONLY HAVE RELOCATE BLOCKS                  
.STYPB   ANOP                                                      @LBA         
*                                                                               
*           RELOCATE BLOCK FOR SUBTYPE B - MONITOR 2               @LBA         
*           PAGE DATA SET ACTIVITY                                 @K2C         
*                                                                               
R79BCNTL DSECT                    MAPPING OF COMMON DATA ELEMENT   @LBA         
R79BETYP DS    CL1                TYPE OF DATA THAT FOLLOWS:       @K2C         
*                                 P - PAGE                         @K2C         
         DS    CL3                RESERVED                                      
R79BFLEN EQU   *-R79BCNTL         LENGTH OF FIXED SECTION                       
         SPACE 3                                                                
R79BELEM DSECT                    MAPPING OF ELEMENT               @LBA         
R79BSALC DS    XL4                SLOTS IN THIS DATA SET           @LBA         
R79BSAVL DS    XL4                SLOTS AVAILABLE                  @LBA         
R79BSLBD DS    XL4                NUMBER OF BAD SLOTS              @LBA         
R79BSUSE DS    XL4                ASM IN USE COUNT                 @LBA         
R79BSIOS DS    XL4                I/O REQUESTS                     @LBA         
R79BREQS DS    XL4                PAGES TRANSFERRED                @LBA         
R79BFLG  DS    CL1                FLAGS                            @LBA         
         SPACE                                                                  
R79BSBAD EQU   X'80'              1... .... BAD DATA SET INDICATOR              
R79BPLPA EQU   X'40'              .1.. .... PLPA DATA SET                       
R79BCOMM EQU   X'20'              ..1. .... COMMON DATA SET                     
R79BDPLX EQU   X'10'              ...1 .... Reserved               @K2C         
R79BLOCL EQU   X'08'              .... 1... LOCAL DATA SET                      
R79BPAGE EQU   X'04'              .... .1.. PAGE DATA                           
R79BSWAP EQU   X'02'              .... ..1. Reserved               @K2C         
R79BVIO  EQU   X'01'              .... ...1 DATASET ACCEPTS VIO PAGES           
         SPACE                                                                  
R79BDEV  DS    CL1                DEVICE TYPE CODE                 @LBA         
R79BDADR DS    CL3                3 DIGIT DEV NUMBER OR "UCB",     @C2C         
*                                 IF UCBNAME="UCB"                 @C2A         
R79BVSER DS    CL6                VOLUME SERIAL                    @LBA         
R79BDSN  DS    CL44               DATA SET NAME                    @LBA         
R79BFL2  DS    CL1                FLAGS                        @ZA57889         
R79BMEXP EQU   X'80'              RESERVED                         @81C         
R79BALCU EQU   X'40'              RESERVED                         @81C         
R79BDNM  EQU   X'20'              INDICATES IF FIELD R79BDEVN CONTAINS          
*                                 A VALID DEVICE NAME              @Y1A         
R79BSCM  EQU   X'10'              ...1 .... Page Space Type SCM                 
*                                                              @OA38660         
R79BDEVN DS    CL8                DEVICE NAME                      @Y1A         
R79BCU   DS    CL8                CONTROL UNIT NAME                @Y1A         
R79BDVN  DS    XL2                DEV NUMBER (BIN) FROM UCBCHAN    @C2A         
R79BSCS  DS    BL1                Subchannel Set ID                @81A         
R79BRSV1 DS    CL1                Reserved                         @81A         
R79BRLEN EQU   *-R79BELEM         LENGTH OF RELOCATE SECTION   @OA16748         
.STYPC   ANOP                                                      @LBA         
         SPACE 2                                                                
************** CHANNEL PATH CONTROL SECTION ***************************         
         SPACE                                                                  
R79CCNTL DSECT                                                                  
R79CSMP  DS    BL4                NUMBER OF SAMPLES, WEIGHTED BY SRM,           
*                                 only valid if R79CMCS = OFF @OA04260          
R79CFLAG DS    BL1                Flags                           @BAA          
R79CCPMF EQU   X'80'              CPMF available                  @BAA          
R79CCFGC EQU   X'40'              Configuration change            @E1A          
R79CCMH  EQU   X'20'              DCM supported by the hardware   @I3A          
R79CCMD  EQU   X'10'              Configuration contains DCM      @I3A          
*                                 managed channels                @H1A          
R79CRNA  EQU   X'08'              RMF address space not active    @I3A          
R79CMCS  EQU   X'04'              Hardware allows multiple        @K3A          
*                                 channel subsystems              @K3A          
R79CECM  EQU   X'02'              Enhanced channel measurement    @22A          
*                                 facility available              @22A          
R79CCMI  DS    BL1                CPMF mode info                  @H1A          
*                                 0 - CPMF not active             @H1A          
*                                 1 - Compatibility mode          @H1A          
*                                 2 - Extended mode               @H1A          
         DS    CL2                Reserved for future use         @H1C          
R79CCFRC DS    BL4                CPMF restart count              @BAA          
R79CCFSC DS    BL4                CPMF sample count               @BAA          
R79CCSS  DS    BL1                Channel SubSystem Id,           @K3A          
*                                 only valid if R79CMCS = ON  @OA04260          
         DS    CL3                Reserved for future use         @K3A          
*                                                                 @P1C          
R79CFLEN EQU   *-R79CCNTL         LENGTH OF FIXED SECTION                       
         SPACE 2                                                                
*                                                                               
*              RELOCATE BLOCK FOR SUBTYPE C                                     
*                                                                               
************** CHANNEL PATH DATA SECTION ******************************         
R79CCHNL DSECT                                                                  
R79CCPID DS    BL1                CHANNEL PATH IDENTIFICATIONS                  
*                                 THE RANGE OF VALUES IS 0 TO 111               
R79CFG2  DS    CL1                CHANNEL FLAGS                                 
         SPACE                                                                  
R79CRV1  EQU   X'C0'              RESERVED                                      
R79CBL   EQU   X'20'              BLOCK MULTIPLEXER                             
R79CBY   EQU   X'10'              BYTE MULTIPLEXER                              
R79CCVC  EQU   X'08'              ES Conversion Channel           @Z1A          
R79CCNC  EQU   X'04'              ES Connection Channel           @Z2A          
R79CDOC  EQU   X'02'              ESCON Director on Chanel        @Z2A          
R79CCC   EQU   X'01'              Channel to Channel          @YA67090          
R79CFG3  DS    BL1                Channel flags continued         @BAA          
R79CSHR  EQU   X'80'              Channel path is shared between                
*                                 logical partitions.             @BAA          
R79CNVL  EQU   X'40'              CPMF indication, this entry is                
*                                 invalid                         @BAA          
*                                 1 line deleted              @YA67090          
R79CFXT  EQU   X'10'              Channel converter 3090          @C3A          
R79CCPM  EQU   X'08'              Channel path is DCM managed     @I3A          
R79CCDC  EQU   X'04'              Channel characteristics changed @K4A          
R79CXCM  EQU   X'02'              Extended channel measurements                 
*                                 supported                       @22A          
R79CCPD  DS    BL1                Channel path description.       @C3A          
*                                 For an explanation, you can     @G1C          
*                                 issue the command D M=CHP.      @G1C          
*                                                                9@G1D          
*                                                                 @C3A          
R79CBSY  DS    BL4                Number of samples in which the                
*                                 channel path was busy,                        
*                                 weighted by SRM.                @BAC          
R79CPBY  DS    BL4                Partitions channel-path-busy                  
*                                 time since last interval in                   
*                                 units of 128 microsecs          @BAA          
R79CCPTX DS    0BL4               Extended last time stamp    @WA39393          
         DS    BL1                Overflow area               @WA39393          
R79CCPTS DS    BL3                Last CPMB entry time stamp in                 
*                                 units of 128 microsecs                        
*                                 (be aware that this value wraps               
*                                 about every 35.79 minutes)      @BAA          
R79CACR  DS    CL5                Channel path acronym            @G1A          
R79CCMG  DS    BL1                CPMF Channel Measurement Group  @H1A          
R79CFG4  DS    BL1                Channel Path Flags              @H1C          
R79CWD1  EQU   X'80'              CPMF Channel characteristics                  
*                                 word 1 valid                    @J1C          
R79CWD2  EQU   X'40'              CPMF Channel characteristics                  
*                                 word 2 valid                    @J1C          
R79CWD3  EQU   X'20'              CPMF Channel characteristics                  
*                                 word 3 valid                    @J1C          
R79CWD4  EQU   X'10'              CPMF Channel characteristics                  
*                                 word 4 valid                    @J1C          
R79CWD5  EQU   X'08'              CPMF Channel characteristics                  
*                                 word 5 valid                    @J1C          
R79CCPP  DS    BL1                Channel path parameter          @I3C          
R79CCCM  DS    CL48               CPMF Channel Measurement        @H1A          
*                                 (extended mode)                 @H1A          
************** CHANNEL Measurement Group 1 ****************************         
         ORG   R79CCCM                                            @H1A          
R79CCM1  DS    0CL8               Channel data Measurement Group1 @H1A          
R79CTUT  DS    BL4                CPMF Total channel path busy    @H1A          
*                                 Time in units of                @H1A          
*                                 128 microseconds                @H1A          
R79CPUT  DS    BL4                CPMF LPAR channel path busy     @H1A          
*                                 Time in units of                @H1A          
*                                 128 microseconds                @H1A          
         DS    CL40               Reserved                        @H1A          
************** CHANNEL Measurement Group 2 ****************************         
         ORG   R79CCCM                                            @H1A          
R79CCCC  DS    0CL20              CPMF Channel Characteristics    @H1A          
*                                 data                            @H1A          
R79CMBC  DS    BL4                CPMF Maximum Bus Cycles per     @H1A          
*                                 second (word 1)                 @J1C          
R79CMCU  DS    BL4                CPMF Maximum Channel work Units @H1A          
*                                 per second (word 2)             @J1C          
R79CMWU  DS    BL4                CPMF Maximum Write data Units   @H1A          
*                                 per second (word 3)             @J1C          
R79CMRU  DS    BL4                CPMF Maximum Read data Units    @H1A          
*                                 per second (word 4)             @J1C          
R79CUS   DS    BL4                CPMF data Unit Size in bytes    @H1A          
*                                 (word 5)                        @J1C          
R79CCCD  DS    0CL28              Channel Measurement Group 2     @H1A          
*                                 Data                            @H1A          
R79CTBC  DS    BL4                CPMF Total Bus Cycles Count     @H1A          
R79CTUC  DS    BL4                CPMF Total channel work Unit    @H1A          
*                                 Count                           @H1A          
R79CPUC  DS    BL4                CPMF LPAR channel work Unit     @H1A          
*                                 Count                           @H1A          
R79CTWU  DS    BL4                CPMF Total Write data Units     @H1A          
R79CPWU  DS    BL4                CPMF LPAR Write data Units      @H1A          
R79CTRU  DS    BL4                CPMF Total Read data Units      @H1A          
R79CPRU  DS    BL4                CPMF LPAR Read data Units       @H1A          
************** CHANNEL Measurement Group 3 ****************************         
         ORG   R79CCCM                                            @J4A          
R79CCC3  DS    0CL20              CPMF Channel Characteristics    @J4A          
*                                 data                            @J4A          
R79CPDU  DS    BL4                CPMF LPAR Data Unit size in     @J4A          
*                                 bytes (word 1)                  @J4A          
R79CTDU  DS    BL4                CPMF Total Data Unit size in    @J4A          
*                                 bytes (word 2)                  @J4A          
R79CPUM  DS    BL4                CPMF LPAR Message sent unit     @J4A          
*                                 size (word 3)                   @J4A          
R79CTUM  DS    BL4                CPMF Total Message sent unit    @J4A          
*                                 size (word 4)                   @J4A          
         DS    CL4                Reserved                        @J4A          
R79CCD3  DS    0CL28              Channel Measurement Group 3     @J4A          
*                                 Data                            @J4A          
R79CPMS  DS    BL4                CPMF LPAR Message sent units    @J4A          
*                                 count                           @J4A          
R79CTMS  DS    BL4                CPMF Total Message sent units   @J4A          
*                                 count                           @J4A          
R79CPUS  DS    BL4                CPMF LPAR count of Unsuccessful @J4A          
*                                 attempts to send messages       @J4A          
R79CPUB  DS    BL4                CPMF LPAR count of Unsuccessful @J4A          
*                                 attempts to receive messages    @J4A          
*                                 due to unavailable Buffers      @J4A          
R79CTUB  DS    BL4                CPMF Total count of             @J4A          
*                                 Unsuccessful attempts to        @J4A          
*                                 receive messages due to         @J4A          
*                                 unavailable Buffers             @J4A          
R79CPDS  DS    BL4                CPMF LPAR Data units Sent count @J4A          
R79CTDS  DS    BL4                CPMF Total Data units Sent      @J4A          
*                                 count                           @J4A          
R79CGEN  DS    BL1                Channel type generation         @J5A          
         DS    CL3                Reserved                                      
R79CCCMX DS    CL32               CPMF Extended channel           @22A          
*                                 measurement data. Only valid    @22A          
*                                 for measurement group 2.        @22A          
************** Extended channel measurement group 2 data ******** @22A          
         ORG   R79CCCMX                                           @22A          
R79CXCM2 DS    0CL32              Extended group 2 data           @22A          
R79CXOC  DS    BL4                Total number of FICON command-  @22A          
*                                 mode operations (CPC) that have @22A          
*                                 been attempted by the channel.  @22A          
R79CXOD  DS    BL4                Total number of FICON command-  @22A          
*                                 mode operations (CPC) that      @22A          
*                                 could not be initiated by the   @22A          
*                                 channel due to a lack of        @22A          
*                                 available resources.            @22A          
R79CXOS  DS    BL8                Summation count of FICON        @22A          
*                                 command-mode operations (CPC).  @22A          
*                                 Each time the number of FICON   @22A          
*                                 command-mode operations is      @22A          
*                                 incremented, the number of      @22A          
*                                 FICON command-mode operations   @22A          
*                                 active at the channel,          @22A          
*                                 including the one being         @22A          
*                                 initiated, is added to this     @22A          
*                                 field.                          @22A          
R79CXTC  DS    BL4                Total number of FICON transport @22A          
*                                 mode operations (CPC) that have @22A          
*                                 been attempted by the channel.  @22A          
*                                 Zero when no zHPF.              @22A          
R79CXTD  DS    BL4                Total number of FICON transport @22A          
*                                 mode operations (CPC) that      @22A          
*                                 could not be initiated by the   @22A          
*                                 channel due to a lack of        @22A          
*                                 available resources.            @22A          
*                                 Zero when no zHPF.              @22A          
R79CXTS  DS    BL8                Summation count of FICON        @22A          
*                                 transport-mode operations       @22A          
*                                 (CPC). Each time the number of  @22A          
*                                 FICON transport-mode operations @22A          
*                                 is incremented, the number of   @22A          
*                                 transport-mode operations       @22A          
*                                 active at the channel,          @22A          
*                                 including the one being         @22A          
*                                 initiated, is added to this     @22A          
*                                 field. Zero when no zHPF.       @22A          
         SPACE                                                                  
R79CRLEN EQU   *-R79CCHNL         LENGTH OF RELOCATE SECTION                    
.STYPD   ANOP                                                                   
*                                                                               
*           RELOCATE BLOCK FOR SUBTYPE D - MONITOR 2                            
*           I/O QUEUING SECTION (308X/LEAR)                        @P4C         
*                                                                               
***********************************************************************         
         SPACE 2                                                                
**********************  I/O QUEUING CONFIGURATION CONTROL SECTION  ****         
R79DCS   DSECT                                                                  
R79DID1  DS    BL2      LOGICAL CONTROL UNIT IDENTIFIER            @P4C         
*                                                                  @P4D         
R79DNTR  DS    BL2      NUMBER OF DESCRIPTOR TRIPLETS                           
R79DCPDS DS    BL4      OFFSET TO CONFIGURATION DATA SECTION                    
R79DCPDL DS    BL2      LENGTH OF CONFIGURATION DATA SECTION                    
R79DCPDN DS    BL2      NUMBER OF CONFIGURATION DATA SECTIONS                   
R79DCPDX EQU   8        NUMBER OF CONFIGURATION DATA SECTIONS  @YA61897         
R79DCSL  EQU   (*-R79DCS)+R79DCPDX*R79DCPDY LENGTH OF CONFIGURATION             
*                       CONTROL SECTION PLUS CONFIG DATA SECTIONS               
R79DRLEN EQU   R79DCSL+R79DDSL  LENGTH OF A RELOCATE BLOCK                      
R79DFLEN EQU   0        LENGTH OF A FIXED BLOCK                                 
*                       (WE ONLY HAVE RELOCATE BLOCKS)                          
R79DRMAX EQU   256      MAXIMUM NUMBER OF RELOCATE BLOCKS (MAXRB)               
         SPACE 2                                                                
**********************  I/O QUEUING CONFIGURATION DATA SECTION  *******         
R79DCPD  DSECT                                                                  
R79DCPID DS    BL1      CHANNEL PATH IDENTIFIER                                 
         SPACE ,                                                                
R79DCPST DS    BL1      CHANNEL PATH STATUS                                     
R79DCPI  EQU   X'80'    CHANNEL PATH INSTALLED                                  
R79DCPO  EQU   X'40'    CHANNEL PATH ONLINE                                     
R79DCPV  EQU   X'20'    CHANNEL PATH VARIED                                     
R79DVPOF EQU   X'10'    PATH OFFLINE TO ALL DEVICES TO THE LCU     @P4A         
R79DVP   EQU   X'08'    PATH CONNECTIVITY TO DEVICES OF THE LCU    @P4A         
*                       HAS MANIPULATED VIA VARY PATH              @P4A         
         SPACE ,                                                                
R79DCUN  DS    BL2      NUMBER OF CONTROL UNITS ATTACHED                        
R79DCU   DS    0BL8     CONTROL UNITS ATTACHED TO THIS CHANNEL PATH             
R79DCU1  DS    BL2      1ST CONTROL UNIT IDENTIFIER                             
R79DCU2  DS    BL2      2ND CONTROL UNIT IDENTIFIER                             
R79DCU3  DS    BL2      3RD CONTROL UNIT IDENTIFIER                             
R79DCU4  DS    BL2      4TH CONTROL UNIT IDENTIFIER                             
R79DCPDY EQU   *-R79DCPD LENGTH OF CONFIGURATION DATA SECTION                   
         SPACE 2                                                                
**********************  I/O QUEUING DATA SECTION  ********************          
R79DDS   DSECT                                                                  
         DS    BL1      RESERVED                                   @P4C         
         SPACE ,                                                                
R79DDST  DS    BL1      DATA STATUS                                             
R79DCPS  EQU   X'80'    1... .... ON= NO STCPS DATA AVAILABLE                   
R79DNHMA EQU   X'20'    ..1. .... ON= NO HARDWARE MEASUREMENTS     @O1A         
R79DICT  DS    BL2      No longer used                            @A02C         
R79DABY  DS    BL4      NUMBER OF SAMPLES WHEN ALL CHANNEL PATHS                
*                       IN THE LCU WERE BUSY, VALID ONLY IF                     
*                       STCPS DATA AVAILABLE                                    
R79DTIS  DS    BL4      TOTAL NUMBER OF  INITIAL SELECTION ATTEMPTS             
R79DSIS  DS    BL4      TOTAL NUMBER OF SUCCESSFUL SELECTION                    
*                       ATTEMPTS                                                
R79DCUB  DS    BL4      TOTAL NUMBER OF UNSUCCESSFUL SELECTION                  
*                       ATTEMPTS DUE TO CONTROL UNIT BUSY                       
R79DDVB  DS    BL4      TOTAL NUMBER OF UNSUCCESSFUL SELECTION                  
*                       ATTEMPTS DUE TO DEVICE BUSY                             
R79DQUE  DS    BL4      TOTAL NUMBER OF REQUESTS QUEUED FOR THE LCU             
*                       (ACCUMULATED AT INITIAL SELECTION TIME)                 
*                       THE FIELD R79DQUE IS NOT SET UP FOR I/O    @O1A         
*                       MEASUREMENT LEVEL X'02' LEAR PROCESSORS    @O1A         
R79DID2  DS    BL2      LOGICAL CONTROL UNIT IDENTIFIER            @P4A         
         DS    BL2      RESERVED                                   @P4A         
R79DDSL  EQU   *-R79DDS LENGTH OF DATA SECTION                                  
.STYPE   ANOP                                                      @P4A         
*                                                                  @P4A         
*           FIXED BLOCK FOR SUBTYPE E - MONITOR 2                  @P4A         
*           I/O QUEUING SECTION (3090,9021,9121,9221)              @P4A         
*                                                                  @P4A         
*******************************************************************@P4A         
         SPACE 2                                                   @P4A         
**********************  GLOBAL I/O QUEUING SECTION                 @P4A         
R79EGD   DSECT                                                     @P4A         
         SPACE ,                                                                
R79EGFLG DS    BL1      GLOBAL IOQ STATUS                          @P4A         
R79EGCMF EQU   X'80'    1... .... ON= DATA IS INVALID DUE TO FAILURE            
*                                     OF THE CHANNEL MEASUREMENT                
*                                     FACILITY                     @P4A         
R79EGDIF EQU   X'40'    .1.. .... ON= DIAGNOSE INTERFACE FAILURE   @P4A         
R79EGDIR EQU   X'20'    ..1. .... ON= ESCON Director in Config.    @Z2A         
R79EGSSQ EQU   X'10'    ...1 .... ON= CHSC store secondary queue                
*                                     data not supported           @E1A         
R79EGCMH EQU   X'08'    .... 1... ON= DCM is supported by hardware @I3A         
R79EGCMD EQU   X'04'    .... .1.. ON= Configuration contains DCM   @I3A         
*                                 managed channels                 @I3A         
R79EGCMR EQU   X'02'    .... ..1. ON= initial-command-response-    @K3A         
*                                 time supported                   @K3A         
R79EGTRD EQU   X'01'    .... ...1 First-transfer-ready-        @OA44525         
*                                 disabled write data          @OA44525         
*                                 available                    @OA44525         
         DS    BL3      FOR ALIGNMENT ONLY                         @P4A         
         DS    BL4      No longer used                         @WA50187         
R79EGSMP DS    BL4      Number of samples for store secondary                   
*                       queue measurement data                     @84A         
         SPACE ,                                                                
R79EFLEN EQU   *-R79EGD LENGTH OF A FIXED BLOCK                    @P4A         
         SPACE 2                                                   @P4A         
*                                                                  @P4A         
*           RELOCATE BLOCK FOR SUBTYPE E - MONITOR 2               @P4A         
*           I/O QUEUING SECTION (3090,9021,9121,9221)              @P4A         
*                                                                  @P4A         
*******************************************************************@P4A         
         SPACE 2                                                   @P4A         
**********************  I/O QUEUING CONFIGURATION CONTROL SECTION  @P4A         
R79ECS   DSECT                                                     @P4A         
R79EID1  DS    BL2      LOGICAL CONTROL UNIT IDENTIFIER            @P4A         
R79ENTR  DS    BL2      NUMBER OF DESCRIPTOR TRIPLETS              @P4A         
R79ECPDS DS    BL4      OFFSET TO CONFIGURATION DATA SECTION       @P4A         
R79ECPDL DS    BL2      LENGTH OF CONFIGURATION DATA SECTION       @P4A         
R79ECPDN DS    BL2      NUMBER OF CONFIGURATION DATA SECTIONS      @P4A         
R79ECPDX EQU   8        NUMBER OF CONFIGURATION DATA SECTIONS  @YA41310         
R79ECSL  EQU   (*-R79ECS)+R79ECPDX*R79ECPDY LENGTH OF CONFIG.      @P4A         
*                       CONTROL SECTION PLUS CONFIG DATA SECTIONS  @P4A         
R79ERLEN EQU   R79ECSL+R79EDSL  LENGTH OF A RELOCATE BLOCK         @P4A         
R79ERMAX EQU   256      MAXIMUM NUMBER OF RELOCATE BLOCKS (MAXRB)  @P4A         
         SPACE 2                                                   @P4A         
**********************  I/O QUEUING CONFIGURATION DATA SECTION  ***@P4A         
R79ECPD  DSECT                                                     @P4A         
R79ECPID DS    BL1      CHANNEL PATH IDENTIFIER                    @P4A         
         SPACE ,                                                   @P4A         
R79ECPST DS    BL1      CHANNEL PATH STATUS                        @P4A         
R79ECPI  EQU   X'80'    CHANNEL PATH INSTALLED                     @P4A         
R79ECPO  EQU   X'40'    CHANNEL PATH ONLINE                        @P4A         
R79ECPV  EQU   X'20'    CHANNEL PATH VARIED                        @P4A         
R79EVPOF EQU   X'10'    PATH OFFLINE TO ALL DEVICES OF THE LCU     @P4A         
R79EVP   EQU   X'08'    PATH CONNECTIVITY TO DEVICES OF THE LCU    @P4A         
*                       HAS MANIPULATED VIA VARY PATH              @P4A         
R79ECPM  EQU   X'02'    Channel path is DCM managed                @I3A         
R79ECPMR EQU   X'01'    CHPID manipulated, requiring data reset    @I3A         
         SPACE ,                                                   @P4A         
R79ECUN  DS    BL2      NUMBER OF CONTROL UNITS ATTACHED           @P4A         
R79ECU   DS    0BL8     CONTROL UNITS ATTACHED TO THIS CHANNEL P.  @P4A         
R79ECU1  DS    BL2      1ST CONTROL UNIT IDENTIFIER                @P4A         
R79ECU2  DS    BL2      2ND CONTROL UNIT IDENTIFIER                @P4A         
R79ECU3  DS    BL2      3RD CONTROL UNIT IDENTIFIER                @P4A         
R79ECU4  DS    BL2      4TH CONTROL UNIT IDENTIFIER                @P4A         
R79ECUB  DS    BL4      COUNT OF CU BUSY                           @P4A         
R79EPT   DS    BL4      COUNT OF OPERATIONS ACCEPTED               @P4A         
         DS    BL4      No longer used                         @WA50187         
R79EDPBC DS    BL4      Count of ESCON Director port busy          @Z2C         
R79ECBT  DS    BL4      Control unit Busy delay Time in units of   @K3C         
*                       128 microseconds                           @K3A         
R79ECMR  DS    BL4      Initial CoMmand Response time in units of  @K3A         
*                       128 microseconds                           @K3A         
R79ESBS  DS    BL4      Switch busy count summation                @K3A         
         DS    CL4      Reserved for future use                    @K3A         
R79ECPXF DS    BL1      Channel path extended flags                @K3A         
R79ECPXM EQU   X'80'    1... .... 1= extended I/O-measurement-     @K3A         
*                       block format-1 data available              @71C         
R79ECPX2 EQU   X'40'    .1.. .... 1= extended I/O-measurement-     @71A         
*                       block format-2 data available              @71A         
R79ECPTD EQU   X'20'    ..1. .... 1= First-transfer-ready-disabled @71A         
*                       supported                                  @71A         
R79ECPAT DS    BL1      Path attributes:                           @L1A         
*                       0 = No attributes specified                             
*                       1 = Preferred path                                      
*                       2 = Non-preferred path                                  
         DS    CL2      Reserved for future use                    @L1C         
R79ECTMW DS    BL4      Transport mode write count                 @71A         
*                       valid if R79ECPTD=1                        @71A         
R79ECTRD DS    BL4      First-transfer-ready-disabled write count  @71A         
*                       valid if R79ECPTD=1                        @71A         
         DS    CL8      Reserved for future use                    @71A         
R79ECPDY EQU   *-R79ECPD LENGTH OF CONFIGURATION DATA SECTION      @P4A         
         SPACE 2                                                   @P4A         
**********************  I/O QUEUING DATA SECTION  *****************@P4A         
R79EDS   DSECT                                                     @P4A         
R79EID2  DS    BL2      LOGICAL CONTROL UNIT IDENTIFIER            @P4A         
R79EDST  DS    BL1      DATA STATUS                                @P4A         
*        EQU   X'80'    RESERVED                                   @P4A         
R79ENHMA EQU   X'40'    .1.. .... ON= NO HARDWARE MEASUREMENTS     @Z1C         
R79ELDCM EQU   X'08'    .... 1... ON= LCU contains DCM managed     @I3A         
*                       channels                                   @I3A         
R79ELPAT EQU   X'04'    .... .1.. ON= Path attributes are valid    @L1A         
         DS    BL1      RESERVED                                   @P4A         
R79EQSM  DS    BL4      QUEUED SUM ON THE CU-HDR QUEUE             @P4A         
R79EQCT  DS    BL4      COUNT OF ENTRIES PLACED ON THE CU-HDR Q.   @P4A         
R79EMCMN DS    BL2      Min number of DCM managed channels used    @I3A         
R79EMCMX DS    BL2      Max number of DCM managed channels used    @I3A         
R79EMCDF DS    BL2      Defined number of DCM managed channels     @I3A         
         DS    BL2      Reserved                                   @I3A         
R79EPTM  DS    BL4      Accumulated path taken count for DCM       @I3A         
*                       managed channels                           @I3A         
R79EDPBM DS    BL4      Accumulated director port busy count for   @I3A         
*                       DCM managed channels                       @I3A         
R79ECUBM DS    BL4      Accumulated control unit busy count for    @I3A         
*                       DCM managed channels                       @I3A         
R79ECBTM DS    BL4      Accumulated control unit busy time for     @K3A         
*                       DCM managed channels                       @K3A         
R79ECMRM DS    BL4      Accumulated initial command response time  @K3A         
*                       for DCM managed channels                   @K3A         
R79ESBSM DS    BL4      Accumulated switch busy count summation    @K3A         
*                       for DCM managed channels                   @K3A         
R79ETMWM DS    BL4      Accumulated transport mode write count     @71C         
*                       for DCM managed channels valid if          @71C         
*                       R79ECPTD=1                                 @71C         
R79ETRDM DS    BL4      Accumulated first-transfer-ready-          @71C         
*                       disabled write count for DCM managed       @71C         
*                       channels valid if R79ECPTD=1               @71C         
R79ECSST DS    BL4      Channel subsystem wait time in             @K3A         
*                       units of 128 microsends                    @K3A         
R79EDSL  EQU   *-R79EDS LENGTH OF DATA SECTION                     @P4A         
         SPACE 2                                                   @F1A         
**********************  IMS Long Lock Data Section *************** @F1A         
R79FIRLM DSECT                                                     @F1A         
R79FISTN DS    CL16     IRLM Lock Structure Name                   @F1A         
R79FDLKC DS    BL4      Dead Lock Cycle Number                     @F1A         
R79FETYP DS    CL1      'B' = Blocker / 'W' = Waiter               @F1A         
R79FAVL  DS    CL3      Reserved                                   @F1A         
R79FWAIT DS    0C       Start of variable Section: Waiter data     @F1A         
         ORG   R79FWAIT                                            @F1A         
R79FBLKR DS    0C                                                  @F1A         
R79FIMSI DS    CL8      IMS Subsystem ID                           @F1A         
R79FPSTN DS    CL2      PST Number                                 @F1A         
R79FPSBN DS    CL8      PSB Name                                   @F1A         
R79FRGTY DS    CL1      Region Type                                @F1A         
R79FRCVT DS    CL16     Recovery Token                             @F1A         
R79FCTID DS    CL8      CICS Task ID (If CICS)                     @F1A         
R79FLHTI DS    CL8      Lock Held Time-Duration                    @F1A         
R79FLHCN DS    CL4      Max Lock Held-PSTLKHLD                     @F1A         
R79FLKNA DS    CL16     Lock Name                                  @F1A         
R79FTRNM DS    CL8      Transaction Name / Job Name            @WA27252         
R79FRSNA DS    CL8      Resource (DB/Area) Name                    @F1A         
R79FIRLL EQU   *-R79FIRLM   Length of data section                 @F1A         
         SPACE 2                                                   @F1A         
R79FRBAT EQU   X'80'    Region type = BATCH                        @F1A         
R79FRBMP EQU   X'40'    Region type = BMP                          @F1A         
R79FRIFP EQU   X'20'    Region type = IFP                          @F1A         
R79FRCIC EQU   X'10'    Region type = CICS                         @F1A         
R79FRMPP EQU   X'08'    Region type = MPP                          @F1A         
R79FRDBC EQU   X'04'    Region type = DBCTL                        @F1A         
R79FRSYS EQU   X'02'    Region type = SYPST                    @OA28931         
******************* End IMS Long Lock Data Section *************** @F1A         
         SPACE 2                                                   @F1A         
         MEXIT                                                                  
.ERR     ANOP                                                                   
         MEND                                                                   
**/                                                                             
 %PLSMACRO:;                                                                    
*    /* COMMON SMF HEADER */                                                    
*?ERBHDR TYPE(79) ATTRIBUT(BASED(SMF79PTR));                                    
*   @SPACE;                                                                     
*    /* INDIVIDUAL HEADER EXTENSION */                                          
*   @SPACE;                                                                     
*%IF IFAR79F='YES' %THEN %GOTO HX79F;                       /*   @F1A*/         
*/********************************************************************/         
*/*                                                              @F1A*/         
*/* It is only possible to include subtype 15 without any other  @F1A*/         
*/* subtype into a module. Subtype 15 will only be processed by  @F1A*/         
*/* Monitor II display session report IRLM.                      @F1A*/         
*/*                                                              @F1A*/         
*/* Subtype 255 is reserved for 'ILOCK' processing (subtype 15).     */         
*/* Therefore it may not be asigned to any other resource.   @WA57131*/         
*/********************************************************************/         
*      2 SMF79HDX,                /* HEADER EXTENTION                */         
*        3 SMF79MCS FIXED(31),    /* OFFSET TO MONITOR II CONTROL               
*                                    SECTION                         */         
*        3 SMF79MCL FIXED(15),    /* LENGTH OF MONITOR II CONTROL               
*                                    SECTION                         */         
*        3 SMF79MCN FIXED(15),    /* NUMBER OF MONITOR II CONTROL               
*                                    SECTION                         */         
*        3 SMF79ASS FIXED(31),    /* OFFSET TO DATA SECTION          */         
*        3 SMF79ASL FIXED(15),    /* LENGTH OF DATA SECTION          */         
*        3 SMF79ASN FIXED(16),    /* NUMBER OF DATA SECTION  @WA55906*/         
*        3 SMF79DCS FIXED(31),    /* OFFSET TO DATA CONTROL SECTION  */         
*        3 SMF79DCL FIXED(15),    /* LENGTH OF DATA CONTROL SECTION  */         
*        3 SMF79DCN FIXED(15),    /* NUMBER OF DATA CONTROL SECTION  */         
*        3 SMF79QSS FIXED(31),    /* OFFSET IOQ GLOBAL SECTION   @P4A*/         
*        3 SMF79QSL FIXED(15),    /* LENGTH IOQ GLOBAL SECTION   @P4A*/         
*        3 SMF79QSN FIXED(15);    /* NUMBER IOQ GLOBAL SECTION   @P4A*/         
*@SPACE;                                                                        
*%GOTO L79PRO;                                              /*   @F1A*/         
*%HX79F:;                                                   /*   @F1A*/         
*      2 SMF79FHX,                /* 79 Subtype 15 Header Ext.   @F1A*/         
*        3 SMF79FPO FIXED(31),    /* Offset to IMS Long Lock Data               
*                                    Section                     @F1A*/         
*        3 SMF79FPL FIXED(15),    /* Length of IMS Long Lock Data               
*                                    Section                     @F1A*/         
*        3 SMF79FPN FIXED(15);    /* Number of IMS Long Lock Data               
*                                    Sections                    @F1A*/         
*   @SPACE;                                                 /*   @F1A*/         
*%L79PRO:;                                                  /*   @F1A*/         
*    /*    COMMON RMF PRODUCT SECTION    */                                     
*   @SPACE;                                                                     
*?ERBPRO TYPE(79) ATTRIBUT(BASED(ADDR(SMF79HDR)+SMF79PRS));                     
*   @SPACE;                                                                     
*%IF IFAR79F='YES' %THEN %GOTO LR79F;                       /*   @F1A*/         
*    /*    MONITOR II  CONTROL SECTION   */                                     
*@SPACE;                                                                        
* DCL 1 R79CHL BASED(ADDR(SMF79HDR)+SMF79MCS) BDY(WORD),                        
*                                   /* Common record 79 header   @W6C*/         
*  3 R79GTOD CHAR(4),               /* Data gatherer call TOD    @W6C*/         
*  3 R79LF2 BIT(8),                 /* Flag byte                 @W6C*/         
*    5 R79PAR BIT(1),               /* Not enough relocate section to           
*                                      complete data gathering       */         
*    5 R79SG BIT(1),                /* Report sorted by SG       @U1A*/         
*    5 R79RSM BIT(1),               /* Invalid RSM data obtained @W2A*/         
*    5 R79GOAL BIT(1),              /* System is in GOAL mode    @C1A*/         
*    5 R79TRXI BIT(1),              /* Invalid transaction data  @C1A*/         
*    5 R79SRMC BIT(1),              /* SRM mode changed          @C1A*/         
*    5 R79INV BIT(1),               /* inval. data fr. Mon I @YA66876*/         
*                                   /* (DEV PGSP IOQ)        @YA66876*/         
*    5 R79MAXD BIT(1),              /* Incomplete device data due to */         
*                                   /* too many devices      @OA48870*/         
*  3 R79RV1 FIXED(8),               /* Reserved                      */         
*  3 R79SES CHAR(2),                /* Session name                  */         
*  3 R79RSV FIXED(15),              /* Reserved                  @W6C*/         
*  3 R79USER FIXED(15),             /* User field                @W6C*/         
*  3 R79RID CHAR(8),                /* Measurement name              */         
*  3 R79CTXTL FIXED(15),            /* Length of command text    @W6C*/         
*  3 R79CTEXT CHAR(32),             /* Command text                  */         
*  3 R79DTXTL FIXED(15),            /* Length default DR text    @W6C*/         
*  3 R79DTEXT CHAR(32),             /* Default DR text               */         
*  3 R79IST CHAR(4),                /* Monitor I interval start time            
*                                      in 0HHMMSSF format    @ZA70287*/         
*  3 R79TSR FIXED(16),              /* Total number of small records            
*                                                                @W3A*/         
*  3 * CHAR(2),                     /* Reserved for future use   @W3A*/         
*  3 R79TOT FIXED(32),              /* Total number of data sections            
*                                      in large record           @W3A*/         
*  3 R79NXT FIXED(32),              /* Number of data sections in               
*                                      following small records   @W3A*/         
*  3 R79IWMTK CHAR(8);              /* Token returned from IWMRCOLL             
*                                      service                   @C1A*/         
*@SPACE;                                                                        
*% IF IFAR791='' %THEN %GOTO LR792;                                             
* /*  */                                                                        
* DECLARE                                                                       
*    /*        Data section for subtype 1                                       
*              ASD and ASDJ data section  */                                    
*   @SPACE;                                                                     
* 1 R791ELEM BASED(ADDR(SMF79HDR)+SMF79ASS) BDY(WORD), /* Mapping of            
*                                      element                   @W6C*/         
*  3 R791ASID FIXED(15),            /* ASID number               @W6C*/         
*  3 R791JBN CHAR(8),               /* Name of job               @W6C*/         
*  3 R791DMN FIXED(15),             /* Domain number                            
*                                      not applicable in GOAL mode              
*                                                                @C1C*/         
*  3 R791NPG FIXED(15),             /* Performance group                        
*                                      not applicable in GOAL mode              
*                                                                @C1C*/         
*  3 R791PGP FIXED(15),             /* Performance group period                 
*                                      not applicable in GOAL mode              
*                                                                @C1C*/         
*  3 R791TTOD FIXED(31),            /* Real time into transaction               
*                                      (milliseconds)            @J2C*/         
*   @SPACE;                                                                     
*  3 R791CL CHAR(2),                /* Current location                         
*                                       IN - In storage,                        
*                                       OT - Swapped out and ready,             
*                                       LO - Logically swapped out,             
*                                       NS - Non swappable,                     
*                                       WM - Wait queue/MSO,                    
*                                       WL - Wait queue/long wait,              
*                                       WT - Wait queue/term wait,              
*                                       WO - Wait queue/others,                 
*                                       DL - TSO user delayed by SRM            
*                                            to meet response time              
*                                            objective,                         
*                                       PR - Privileged,                        
*                                       >> - Transitioning out,                 
*                                       << - Transitioning in                   
*                                                            @OA62081*/         
*  3 R791TAS FIXED(15),             /* Type of user                             
*                                       0  - Batch,                             
*                                       1  - Started task,                      
*                                       2  - Mount task,                        
*                                       3  - TSO,                               
*                                       4  - ASCH,                              
*                                       5  - OMVS            @OA62081*/         
*  3 R791SRC CHAR(2),               /* Reason last swap out                     
*                                       TO - Terminal output,                   
*                                       TI - Terminal input,                    
*                                       LW - LONG WAIT,                         
*                                       XS - AUX storage short,                 
*                                       RS - Real storage short,                
*                                       DW - Detected wait,                     
*                                       MP - MEMORY POOL SHORTAGE,              
*                                       NQ - CAP enqueue,                       
*                                       EX - CAP exchange,                      
*                                       US - CAP uni-swap,                      
*                                       TS - Transition,                        
*                                       IC - Improve central storage            
*                                             usage,                            
*                                       IP - Improve system paging              
*                                             rate,                             
*                                       MR - Make room to swap in an            
*                                             out-too-long user,                
*                                       AW - APPC wait,                         
*                                       IW - OMVS input wait,                   
*                                       OW - OMVS output wait,                  
*                                       SR - In-real swap,                      
*                                       00 - Unknown         @OA62081*/         
*  3 R791DP FIXED(15),              /* Dispatcher priority       @W6C*/         
*  3 R791SEQN FIXED(15),            /* Reserved                  @W6C*/         
*  3 R791RSV1 FIXED(16),            /* Reserved since 4.1.0      @W6C*/         
*  3 R791RSV2 FIXED(16),            /* Reserved since 4.1.0      @W6C*/         
*  3 R791SWC FIXED(15),             /* Transaction swap count    @W6C*/         
*  3 R791SWMR FIXED(15),            /* SRM workload recom value  @W6C*/         
*  3 *        FIXED(15),            /* Reserved                  @A3C*/         
*  3 *        FIXED(15),            /* Reserved                  @A3C*/         
*  3 R791WMS FIXED(31) BDY(HWORD),  /* SRM service for the current              
*                                      transaction since the last               
*                                      swap in                   @W6C*/         
*  3 R791TCPU FIXED(32) BDY(HWORD), /* Total CPU time consumed on               
*                                      behalf of this address space             
*                                      in milliseconds                          
*                                      (ascbejst+ascbsrbt+assbasst).            
*                                      Wraps after 4 Giga millisec              
*                                                                @K5C*/         
*  3 *        FIXED(15),            /* Reserved                  @A3C*/         
*  3 *      FIXED(16),              /* Reserved                                 
*                                                            @YA28328*/         
*  3 R791ESCT FIXED(31) BDY(HWORD), /* Number of expanded storage               
*                                      frames used by job    @YA28328*/         
*  3 R791RSV3 FIXED(16),            /* Reserved since 4.1.0      @W6C*/         
*  3 R791PIN FIXED(31),             /* Page in count             @W1A*/         
*  3 R791TRTM FIXED(31),            /* Transaction residency time               
*                                                                @W1A*/         
*  3 R791FLG BIT(8),                /* Flags                     @W1A*/         
*    4 R791XM BIT(1),               /* Cross memory address space               
*                                                                @W1A*/         
*    4 R791PMON BIT(1),             /* On = data in R791CTAR is valid.          
*                                      Off =  not valid.         @A3A*/         
*    4 R791VALV BIT(1),             /* On = data in R791VAL is valid.           
*                                      Off =  not valid          @A3A*/         
*    4 R791GOAL BIT(1),             /* On = system is in GOAL mode              
*                                                            @OA62081*/         
*    4 R791SRV  BIT(1),             /* On = this address space is a             
*                                      server address space                     
*                                      Off =  GOAL specified for this           
*                                      address space is being honored           
*                                      by wlm                    @C1A*/         
*    4 R791QSC  BIT(1),             /* On = address space has been              
*                                      quiesced by a RESET command              
*                                                                @C1A*/         
*    4 R791TXME BIT(1),             /* Address space matched a                  
*                                      classification rule in the               
*                                      active policy which prevents             
*                                      managing the region based on the         
*                                      response time goals of its               
*                                      served transactions   @OA62081*/         
*    4 R791TAFF BIT(1),             /* On = address space has temporal          
*                                      affinities, same as RASDTAF              
*                                                            @WA46622*/         
*  3 R791FLG2 BIT(8),               /* Additional flags          @I4C*/         
*    4 R791CPRC BIT(1),             /* Service class assigned by                
*                                      classification or RESET SRVCLASS         
*                                      was designated CPU-critical in           
*                                      the active policy     @OA62081*/         
*    4 R791CPRE BIT(1),             /* Address space matched a                  
*                                      classification rule in the               
*                                      active policy which was                  
*                                      designated storage-critical              
*                                                            @OA62081*/         
*    4 R791CPRI BIT(1),             /* Address space is serving                 
*                                      transactions which belong to a           
*                                      service class that was                   
*                                      designated storage-critical in           
*                                      the active policy's                      
*                                      classification rule, or is               
*                                      running in SYSTEM/SYSSTC                 
*                                                            @OA62081*/         
*    4 R791CPUP BIT(1),             /* CPU protection was assigned              
*                                      either to the address space or           
*                                      to transaction service classes           
*                                      being served by the space                
*                                                            @OA62081*/         
*    4 R791STOP BIT(1),             /* Storage protection was assigned          
*                                      either to the address space or           
*                                      to transaction service classes           
*                                      being served by the space                
*                                                            @OA62081*/         
*    4 R791CRMP BIT(1),             /* The dispatch priority of the             
*                                      address space is currently               
*                                      promoted due to a chronic                
*                                      resource contention       @21A*/         
*    4 R791TXMB BIT(1),             /* Address space is a CICS TOR that         
*                                      matched a classification rule in         
*                                      the active policy which allows           
*                                      managing the region based on the         
*                                      region goals but also ensures            
*                                      that completed transactions are          
*                                      reported and used for management         
*                                      of the CICS AORs      @OA62081*/         
*    4 R791NOHP BIT(1),             /* Honor priority ineligibility was         
*                                      assigned either to the address           
*                                      space or to transaction service          
*                                      classes being served by the              
*                                      space                 @OA62081*/         
*  3 R791FMCT FIXED(31) BDY(HWORD), /* Number of real storage frames            
*                                                                @W6C*/         
*  3 R791WSS  FIXED(31) BDY(HWORD), /* Working set at last swap in              
*                                                                @W6C*/         
*  3 R791TWSS FIXED(31) BDY(HWORD), /* SRM target working set                   
*                                      set site                  @W7C*/         
*  3 R791ESHP FIXED(31) BDY(HWORD), /* Number of hiperspace ES                  
*                                       pages used by job        @W7A*/         
*  3 R791ESVI FIXED(31) BDY(HWORD), /* Number of VIO ES pages used              
*                                       by job                   @W8C*/         
*  3 R791HIN  FIXED(31) BDY(HWORD), /* Number of hiperspace page ins            
*                                       by job                   @W8A*/         
*  3 R791HRMS FIXED(31) BDY(HWORD), /* Number of hiperspace read                
*                                       misses by job            @W8A*/         
*  3 R791BPIN FIXED(31) BDY(HWORD), /* Number of blocked pages brought          
*                                       in from DASD             @A2A*/         
*  3 R791PINE FIXED(31) BDY(HWORD), /* Number of single pages brought           
*                                       in from expanded storage @A2A*/         
*  3 R791BPNE FIXED(31) BDY(HWORD), /* Number of blocked pages brought          
*                                       in from expanded storage @A2A*/         
*  3 R791CTAR FIXED(31) BDY(HWORD), /* Central storage target number of         
*                                       frames                   @A2A*/         
*  3 R791VAL  FIXED(31) BDY(HWORD), /* Recommendation value for WSM             
*                                       managed address spaces.  @A3A*/         
*  3 R791SCL  CHAR(8),              /* Service class name        @C1A*/         
*  3 R791SCP  FIXED(15),            /* Service class period      @C1A*/         
*  3 R791WKLD CHAR(8),              /* Workload name             @C1A*/         
*  3 R791RGRP CHAR(8),              /* Resource group name       @C1A*/         
*  3 R791SPI  FIXED(32),            /* Number of page-ins from                  
*                                      auxiliary storage for shared             
*                                      page groups               @D1A*/         
*  3 R791CMNI FIXED(31),            /* Number of common pages for               
*                                      current transaction       @D2A*/         
*  3 R791PNV FIXED(31),             /* Number of non-VIO pages for              
*                                      current transaction       @D2A*/         
*  3 R791PVIO FIXED(31),            /* Number of VIO pages for                  
*                                      current transaction       @D2A*/         
*  3 R791EXCT FIXED(32),            /* EXCP count for                           
*                                      this step                 @E2C*/         
*  3 R791TCPC FIXED(32),            /* Total CPU time consumed in this          
*                                      address space in milliseconds.           
*                                      (ascbejst+ascbsrbt+assbphtm)             
*                                      +(assbphtm-assbphtm_base))               
*                                                            @OA21046*/         
*  3 R791ASST FIXED(32),            /* CPU time consumed by preemptible         
*                                      class SRBs running on behalf of          
*                                      this AS in milliseconds.                 
*                                      (assbasst)                @E2A*/         
*  3 R791PHTM FIXED(32),            /* CPU time consumed by preemptible         
*                                      class SRBs running in this AS            
*                                      in millisecs. (assbphtm)  @I4C*/         
*  3 R791RCL  CHAR(8),              /* Report class name         @I4A*/         
*  3 R791MLIM FIXED(64) BDY(BYTE),  /* Address space memory limit               
*                                      in units of MB            @J2A*/         
*    4 R791MLMC CHAR(8),            /* Same as R791MLIM          @K5C*/         
*  3 R791TCBP FIXED(32),            /* Reserved for future use   @93C*/         
*    4 R791TIFA FIXED(32),          /* CPU time consumed on zAAPs               
*                                      (IFAs) (ASSB_TIME_ON_IFA) @93C*/         
*  3 R791TCP  FIXED(32),            /* CPU time consumed on standard            
*                                      CPs (ASSB_TIME_ON_CP). Only              
*                                      valid if zAAPs or zIIPs in               
*                                      configuration         @OA13499*/         
*  3 R791TCBPonCP FIXED(32),        /* Reserved for future use   @93C*/         
*    4 R791TIFC FIXED(32),          /* CPU time consumed on standard            
*                                      CPs by zAAP (IFA) eligible work          
*                                      (ASSB_TIME_IFA_ON_CP)     @93C*/         
*  3 R791NFFCBP FIXED(31),          /* Reserved for future use   @93C*/         
*    4 R791NFFI FIXED(31),          /* Normalization factor for IFA             
*                                      service time. Used to convert            
*                                      between real IFA times and               
*                                      "normalized" IFA times, i.e.             
*                                      the equivalent time on a                 
*                                      standard CP. Multiply R791TIFA           
*                                      by this value and divide by              
*                                      256 to calculate the normalized          
*                                      IFA time                  @93C*/         
*  3 R791TSUP FIXED(31),            /* CPU time consumed on zIIPs               
*                                      (ASSB_TIME_ON_zIIP)   @OA13499*/         
*  3 R791TSUC FIXED(31),            /* CPU time consumed on standard            
*                                      CPs by zIIP eligible work                
*                                      (ASSB_TIME_zIIP_ON_CP)                   
*                                                            @OA13499*/         
*  3 R791NFFS FIXED(31),            /* Normalization factor for zIIP            
*                                      service time. Used to convert            
*                                      between real zIIP times and              
*                                      "normalized" zIIP times, i.e.            
*                                      the equivalent time on a                 
*                                      standard CP. Multiply R791TSUP           
*                                      by this value and divide by              
*                                      256 to calculate the normalized          
*                                      zIIP time.            @OA13499*/         
*  3 R791EXCW CHAR(8),              /* EXCP Count ( DWord )  @OA15850*/         
*  3 R791CBPPHTM FIXED(31),         /* Reserved for future use   @93C*/         
*    4 R791PHTA FIXED(31),          /* zAAP-only equivalent of                  
*                                      R791PHTM (ASSB_IFA_PHTM). This           
*                                      is normalized time        @93C*/         
*  3 R791PHTI FIXED(31),            /* zIIP-only equivalent of                  
*                                      R791PHTM (ASSB_zIIP_PHTM).               
*                                      This is normalized time   @31A*/         
*  3 R791FLG3 BIT(8),               /* Additional flags          @64A*/         
*    4 R791CIPG BIT(1),             /* Service class was assigned by            
*                                      classification, or RESET                 
*                                      SRVCLASS belongs to I/O priority         
*                                      group HIGH in the active policy          
*                                                            @OA62081*/         
*    4 R791IOPG BIT(1),             /* I/O priority group HIGH was              
*                                      assigned either to the address           
*                                      space or to transaction service          
*                                      classes served by the address            
*                                      space                 @OA62081*/         
*    4 R791ITRG BIT(1),             /* R791RGRP is the name of a                
*                                      tenant resource group and                
*                                      R791RCL is the name of a                 
*                                      tenant report class       @91A*/         
*    4 R791IISP BIT(1),             /* General purpose and specialty            
*                                      processor consumption is                 
*                                      considered by WLM capping                
*                                      algorithms for this address              
*                                      space                     @91A*/         
*    4 R791ICBP BIT(1),             /* Reserved for future use   @93C*/         
*    4 R791IRPB BIT(1),             /* On = data in R791RPBoost is              
*                                      valid.                                   
*                                      Off = not valid          @A03A*/         
*    4 R791RPBoost BIT(1),          /* Address space matched a                  
*                                      classification rule in the               
*                                      active policy which enables for          
*                                      recovery process boost. Only             
*                                      valid if R791IRPB = On.  @A03A*/         
*    4 *        BIT(1),             /* Reserved                 @A03C*/         
*  3 *        CHAR(3);              /* Reserved                  @64A*/         
*%LR792: IF IFAR792='' %THEN %GOTO LR793;                                       
* /* */                                                                         
* DECLARE                                                                       
*    /* Data section for subtype 2                                              
*       ARD and ARDJ data section */                                            
*   @SPACE;                                                                     
* 1 R792ELEM BASED(ADDR(SMF79HDR)+SMF79ASS) BDY(WORD), /* Mapping of            
*                                      element                   @W6C*/         
*  3 R792ASID FIXED(15),            /* ASID number               @W6C*/         
*  3 R792JBN CHAR(8),               /* Name of job               @W6C*/         
*  3 R792DMN FIXED(15),             /* Domain number                            
*                                      not applicable in GOAL mode              
*                                                                @C1C*/         
*  3 R792NPG FIXED(15),             /* Performance group                        
*                                      not applicable in GOAL mode              
*                                                                @C1C*/         
*  3 R792CL CHAR(2),                /* Current location                         
*                                       IN - In storage,                        
*                                       OT - Swapped out and ready,             
*                                       LO - Logically swapped out,             
*                                       NS - Non swappable,                     
*                                       WM - Wait queue/MSO,                    
*                                       WL - Wait queue/long wait,              
*                                       WT - Wait queue/term wait,              
*                                       WO - Wait queue/others,                 
*                                       DL - TSO user delayed by SRM            
*                                            to meet response time              
*                                            objective,                         
*                                       PR - Privileged,                        
*                                       >> - Transitioning out,                 
*                                       << - Transitioning in                   
*                                                            @OA62081*/         
*  3 R792TAS FIXED(15),             /* Type of user                             
*                                       0  - Batch,                             
*                                       1  - Started task,                      
*                                       2  - Mount task,                        
*                                       3  - TSO,                               
*                                       4  - ASCH,                              
*                                       5  - OMVS            @OA62081*/         
*  3 R792TRC FIXED(15),             /* Transaction count         @W6C*/         
*  3 R792TTOD FIXED(31),            /* Transaction elapsed time, in             
*                                      milliseconds              @W6C*/         
*  3 R792PRFX FIXED(31),            /* Number of private fixed frames           
*                                                                @W6C*/         
*  3 R792RSV1 FIXED(16),            /* Reserved since 4.1.0      @W6C*/         
*  3 R792SVAR FIXED(31) BDY(HWORD), /* SRM service absorption rate              
*                                      for step                  @W6C*/         
*  3 R792TCPU FIXED(32) BDY(HWORD), /* Total TCB time for step in               
*                                      milliseconds. Wraps after                
*                                      4 Giga millisec       @WA02302*/         
*  3 R792PSS CHAR(8) BDY(HWORD),    /* Step product of frame in                 
*                                      milliseconds              @W6C*/         
*   4 R792PSS1 FIXED(32) BDY(HWORD),/* High order word           @W6C*/         
*   4 R792PSS2 FIXED(32) BDY(HWORD),/* Low order word            @W6C*/         
*   @SPACE;                                                                     
*  3 R792EJST FIXED(32) BDY(HWORD), /* Total CPU time consumed on               
*                                      behalf of this address space             
*                                      in milliseconds                          
*                                      (ascbejst+ascbsrbt+assbasst).            
*                                      Wraps after 4 Giga millisec              
*                                                                @E2C*/         
*  3 R792TSRM FIXED(31) BDY(HWORD), /* Total SRM service for step               
*                                                                @W6C*/         
*  3 R792RTM  FIXED(31) BDY(HWORD), /* Resident time for step, in               
*                                      seconds                   @W6C*/         
*  3 R792EXCP FIXED(15),            /* EXCP count for step       @W6C*/         
*  3 R792CMNI FIXED(31),            /* Number of common pages for               
*                                      current transaction       @W6C*/         
*  3 R792PNV FIXED(31),             /* Number of non-VIO pages for              
*                                      current transaction       @W6C*/         
*  3 R792PVIO FIXED(31),            /* Number of VIO pages for                  
*                                      current transaction       @W6C*/         
*  3 R792FXBL FIXED(31),            /* Number of fixed frames which             
*                                      are located below 16M real               
*                                                                @W6C*/         
*  3 R792PSWP FIXED(31),            /* Number of pages swapped in               
*                                      for current transaction   @W6C*/         
*  3 R792LPAI FIXED(31),            /* Number of LPA pages swapped in           
*                                      for current transaction   @W6C*/         
*  3 R792CSAI FIXED(31),            /* Number of CSA pages swapped in           
*                                      for current transaction   @W6C*/         
*  3 R792LSQA FIXED(31),            /* Number of LSQA fixed frames              
*                                                                @W6C*/         
*  3 R792NLQF FIXED(31),            /* Number of non-LSQA fixed frames          
*                                      for this job              @W4C*/         
*  3 R792TDEV FIXED(31),            /* Total device connect time                
*                                      in milliseconds           @W6C*/         
*  3 R792RSV2 FIXED(16),            /* Reserved since 4.1.0      @W6C*/         
*  3 R792PIN FIXED(31) BDY(HWORD),  /* Page-in count             @W6C*/         
*  3 R792TRTM FIXED(31) BDY(HWORD), /* Transaction residency time               
*                                                                @W6C*/         
*  3 R792FLG BIT(8),                /* Flags                     @W6C*/         
*    4 R792XM BIT(1),               /* Cross memory address space    */         
*    4 R792RSM BIT(1),              /* Invalid RSM data for address             
*                                      space obtained            @W2A*/         
*    4 *        BIT(1),             /* Reserved                  @C1A*/         
*    4 R792GOAL BIT(1),             /* On = system is in GOAL mode              
*                                                            @OA62081*/         
*    4 R792SRV  BIT(1),             /* On = this address space is a             
*                                      server address space                     
*                                      Off =  GOAL specified for this           
*                                      address space is being honored           
*                                      by wlm                    @C1A*/         
*    4 R792QSC  BIT(1),             /* On = address space has been              
*                                      quiesced by a RESET command              
*                                                                @C1A*/         
*    4 R792TXME BIT(1),             /* Address space matched a                  
*                                      classification rule in the               
*                                      active policy which prevents             
*                                      managing the region based on the         
*                                      response time goals of its               
*                                      served transactions   @OA62081*/         
*    4 R792TAFF BIT(1),             /* On = address space has temporal          
*                                      affinities, same as RASDTAF              
*                                                            @WA46622*/         
*  3 R792FLG2 BIT(8),               /* Additional flags          @J1C*/         
*    4 R792CPRC BIT(1),             /* Service class assigned by                
*                                      classification or RESET SRVCLASS         
*                                      was designated CPU-critical in           
*                                      the active policy     @OA62081*/         
*    4 R792CPRE BIT(1),             /* Address space matched a                  
*                                      classification rule in the               
*                                      active policy which was                  
*                                      designated storage-critical              
*                                                            @OA62081*/         
*    4 R792CPRI BIT(1),             /* Address space is serving                 
*                                      transactions which belong to a           
*                                      service class that was                   
*                                      designated storage-critical in           
*                                      the active policy's                      
*                                      classification rule, or is               
*                                      running in SYSTEM/SYSSTC                 
*                                                            @OA62081*/         
*    4 R792CPUP BIT(1),             /* CPU protection was assigned              
*                                      either to the address space or           
*                                      to transaction service classes           
*                                      being served by the space                
*                                                            @OA62081*/         
*    4 R792STOP BIT(1),             /* Storage protection was assigned          
*                                      either to the address space or           
*                                      to transaction service classes           
*                                      being served by the space                
*                                                            @OA62081*/         
*    4 R792CRMP BIT(1),             /* The dispatch priority of the             
*                                      address space is currently               
*                                      promoted due to a chronic                
*                                      resource contention       @21A*/         
*    4 R792TXMB BIT(1),             /* Address space is a CICS TOR that         
*                                      matched a classification rule in         
*                                      the active policy which allows           
*                                      managing the region based on the         
*                                      region goals but also ensures            
*                                      that completed transactions are          
*                                      reported and used for management         
*                                      of the CICS AORs      @OA62081*/         
*    4 R792NOHP BIT(1),             /* Honor priority ineligibility was         
*                                      assigned either to the address           
*                                      space or to transaction service          
*                                      classes being served by the              
*                                      space                 @OA62081*/         
*  3 R792LSQR FIXED(31),            /* LSQA pages in real storage               
*                                                                @W1A*/         
*  3 R792LSQE FIXED(31),            /* LSQA pages in ext. storage               
*                                      CNTFTLSD - CNTFRLSD       @W6C*/         
*  3 R792ARS  FIXED(31),            /* Avg number of real frames                
*                                      for step                  @W6C*/         
*  3 R792TWSS FIXED(31),            /* SRM target working set size              
*                                      for this job              @W7C*/         
*  3 R792PHSP FIXED(31),            /* Total hiperspace pages for               
*                                      current transaction   @YA42170*/         
*  3 R792EXCT FIXED(32),            /* New EXCP count        @WA19913*/         
*  3 R792SCL  CHAR(8),              /* Service class name        @C1A*/         
*  3 R792SCP  FIXED(15),            /* Service class period      @C1A*/         
*  3 R792WKLD CHAR(8),              /* Workload name             @C1A*/         
*  3 R792RGRP CHAR(8),              /* Resource group name       @E2C*/         
*  3 * CHAR(2),                     /* Reserved                  @W1C*/         
*  3 R792TCPC FIXED(32),            /* Total CPU time consumed in this          
*                                      address space in milliseconds.           
*                                      (ascbejst+ascbsrbt+ascbphtm)             
*                                                                @E2A*/         
*  3 R792ASST FIXED(32),            /* CPU time consumed by preemptible         
*                                      class SRBs running on behalf of          
*                                      this AS in milliseconds.                 
*                                      (assbasst)                @E2A*/         
*  3 R792PHTM FIXED(32),            /* CPU time consumed by preemptible         
*                                      class SRBs running in this AS            
*                                      in millisecs. (assbphtm)  @E2A*/         
*  3 R792FXAB FIXED(32),            /* Number of fixed frames between           
*                                      16M and 2G (ESAME mode only)             
*                                                                @K5C*/         
*  3 R792TCBP FIXED(32),            /* Reserved for future use   @93C*/         
*    4 R792TIFA FIXED(32),          /* CPU time consumed on zAAPs               
*                                      (IFAs) (ASSB_TIME_ON_IFA) @93C*/         
*  3 R792TCP  FIXED(32),            /* CPU time consumed on standard            
*                                      CPs (ASSB_TIME_ON_CP). Only              
*                                      valid if zAAPs or zIIPs in               
*                                      configuration             @K6C*/         
*  3 R792TCBPonCP FIXED(32),        /* Reserved for future use   @93C*/         
*    4 R792TIFC FIXED(32),          /* CPU time consumed on standard            
*                                      CPs by zAAP (IFA) eligible work          
*                                      (ASSB_TIME_IFA_ON_CP)     @93C*/         
*  3 R792NFFCBP FIXED(31),          /* Reserved for future use   @93C*/         
*    4 R792NFFI FIXED(31),          /* Normalization factor for IFA             
*                                      service time. Used to convert            
*                                      between real IFA times and               
*                                      "normalized" IFA times, i.e.             
*                                      the equivalent time on a                 
*                                      standard CP. Multiply R792TIFA           
*                                      by this value and divide by              
*                                      256 to calculate the normalized          
*                                      IFA time                  @93C*/         
*  3 R792TSUP FIXED(31),            /* CPU time consumed on zIIPs               
*                                      (ASSB_TIME_ON_zIIP)   @OA13499*/         
*  3 R792TSUC FIXED(31),            /* CPU time consumed on standard            
*                                      CPs by zIIP eligible work                
*                                      (ASSB_TIME_zIIP_ON_CP)                   
*                                                            @OA13499*/         
*  3 R792NFFS FIXED(31),            /* Normalization factor for zIIP            
*                                      service time. Used to convert            
*                                      between real zIIP times and              
*                                      "normalized" zIIP times, i.e.            
*                                      the equivalent time on a                 
*                                      standard CP. Multiply R792TSUP           
*                                      by this value and divide by              
*                                      256 to calculate the normalized          
*                                      zIIP time.            @OA13499*/         
*  3 R792EXCW CHAR(8),              /* EXCP Count ( DWord )  @OA15850*/         
*  3 R792CBPPHTM FIXED(31),         /* Reserved for future use   @93C*/         
*    4 R792PHTA FIXED(31),          /* zAAP-only equivalent of                  
*                                      R792PHTM (ASSB_IFA_PHTM). This           
*                                      is normalized time        @93C*/         
*  3 R792PHTI FIXED(31),            /* zIIP-only equivalent of                  
*                                      R792PHTM (ASSB_zIIP_PHTM).               
*                                      This is normalized time   @31A*/         
*  3 R792FLG3 BIT(8),               /* Additional flags          @64A*/         
*    4 R792CIPG BIT(1),             /* Service class was assigned by            
*                                      classification, or RESET                 
*                                      SRVCLASS belongs to I/O priority         
*                                      group HIGH in the active policy          
*                                                            @OA62081*/         
*    4 R792IOPG BIT(1),             /* I/O priority group HIGH was              
*                                      assigned either to the address           
*                                      space or to transaction service          
*                                      classes served by the address            
*                                      space                 @OA62081*/         
*    4 R792ITRG BIT(1),             /* R792RGRP is the name of a                
*                                      tenant resource group     @91A*/         
*    4 R792IISP BIT(1),             /* General purpose and specialty            
*                                      processor consumption is                 
*                                      considered by WLM capping                
*                                      algorithms for this address              
*                                      space                     @91A*/         
*    4 R792ICBP BIT(1),             /* Reserved for future use   @93C*/         
*    4 R792IRPB BIT(1),             /* On = data in R792RPBoost is              
*                                      valid.                                   
*                                      Off = not valid          @A03A*/         
*    4 R792RPBoost BIT(1),          /* Address space matched a                  
*                                      classification rule in the               
*                                      active policy which enables for          
*                                      recovery process boost. Only             
*                                      valid if R792IRPB = On.  @A03A*/         
*    4 *        BIT(1),             /* Reserved                 @A03C*/         
*  3 *        CHAR(3);              /* Reserved                  @64A*/         
*%LR793: IF IFAR793='' %THEN %GOTO LR794;                                       
* /* */                                                                         
* DECLARE                                                                       
*    /* DATA SECTION FOR SUBTYPE 3                                              
*       SRCS DATA SECTION  */                                                   
*   @SPACE;                                                                     
* 1 R793 BASED(ADDR(SMF79HDR)+SMF79ASS), /*SCALAR RELOCATE SE*/                 
*   @SPACE;                                                                     
*  3 R793RSV1 FIXED(16) BDY(BYTE),  /* Reserved since 4.1.0      @W5C*/         
*  3 R793CRI  FIXED(16) BDY(BYTE),  /* Current System UIC                       
*                                      (MCTCurSystemUIC)         @02C*/         
*                                                               @SPACE;         
*        /*                                                                     
*        With apar OW56739 4-byte fields are appended to replace                
*        the 2-byte storage frame count fields. The old 2-byte                  
*        fields still will be filled. They will contain value -1                
*        (x'FFFF') if a frame count is greater than 32767.   @WA56739*/         
*                                                               @SPACE;         
*  3 R793SQA  FIXED(15) BDY(BYTE),  /* NUMBER OF FIXED SQA FRAMES               
*                                     (replaced by R793SQA4) @WA56739*/         
*  3 R793CMNF FIXED(15) BDY(BYTE),  /* NUMBER OF COMMON (LPA+CSA)               
*                                      PAGEABLE AND FIXED FRAMES                
*                                     (replaced by R793CMN4) @WA56739*/         
*  3 R793CMFF FIXED(15) BDY(BYTE),  /* NUMBER OF COMMON (LPA+CSA)               
*                                      FIXED FRAMES                             
*                                     (replaced by R793CMF4) @WA56739*/         
*  3 R793PRFX FIXED(15) BDY(BYTE),  /* NUMBER OF PRIVATE FIXED FRAMES           
*                                      (LSQA+NON-LSQA)                          
*                                     (replaced by R793PFX4) @WA56739*/         
*  3 R793CPUU FIXED(15) BDY(BYTE),  /* PROCESSOR UTILIZATION (0-101) */         
*  3 R793DQ   FIXED(15) BDY(BYTE),  /* LENGTH OF OUT WAIT QUEUE                 
*                                                            @WA19913*/         
*  3 R793INC  FIXED(15) BDY(BYTE),  /* NUMBER OF ADDRESS SPACES IN              
*                                      IN STORAGE (SRM IN QUEUE)     */         
*  3 R793OUTU FIXED(15) BDY(BYTE),  /* NUMBER OF ADDRESS SPACES OUT             
*                                      OF STORAGE (SRM OUT QUEUE)    */         
*  3 R793LCU  FIXED(15) BDY(BYTE),  /* RESERVED                      */         
*  3 R793RSV4 FIXED(15) BDY(BYTE),  /* RESERVED LJM-SPE          @Y2C*/         
*  3 R793LPAF FIXED(15) BDY(BYTE),  /* Number of total LPA frames               
*                                     (replaced by R793LPF4) @WA56739*/         
*  3 R793CSAF FIXED(15) BDY(BYTE),  /* Number of total CSA frames               
*                                     (replaced by R793CSF4) @WA56739*/         
*  3 R793LPFX FIXED(15) BDY(BYTE),  /* NUMBER OF LPA FIXED FRAMES               
*                                     (replaced by R793LFX4) @WA56739*/         
*  3 R793CSFX FIXED(15) BDY(BYTE),  /* NUMBER OF CSA FIXED FRAMES               
*                                     (replaced by R793CFX4) @WA56739*/         
*  3 R793LSQA FIXED(15) BDY(BYTE),  /* NUMBER OF FIXED LSQA FRAMES              
*                                     (replaced by R793LSQ4) @WA56739*/         
*  3 R793NLQF FIXED(15) BDY(BYTE),  /* NUMBER OF PRIVATE NON-LSQA               
*                                      FIXED FRAMES                             
*                                     (replaced by R793NLF4) @WA56739*/         
*  3 R793LOUT FIXED(15) BDY(BYTE),  /* NUMBER OF ADDRESS SPACES                 
*                                      LOGICALLY SWAPPED OUT     @W1C*/         
*  3 R793SQR  FIXED(31) BDY(BYTE),  /* SQA pages in real storage                
*                                      CTSQAF + CTRSQAF          @W1A*/         
*  3 R793SQE  FIXED(31) BDY(BYTE),  /* SQA pages in ext. storage                
*                                      CTTSQAF - CTRSQAF         @W1A*/         
*  3 R793LSQR FIXED(31) BDY(BYTE),  /* LSQA pages in real storage               
*                                      CTLSQAF + CTRLSQAF        @W1A*/         
*  3 R793LSQE FIXED(31) BDY(BYTE),  /* LSQA pages in ext. storage               
*                                      CTTLSQAF - CTRLSQAF       @W5C*/         
*  3 R793AFC  FIXED(31) BDY(BYTE),  /* NUMBER OF AVAILABLE FRAMES               
*                                                            @WA05435*/         
*  3 R793CUT  FIXED(31) BDY(BYTE),  /* MVS view of CPU utilization              
*                                      (interval - wait time) if                
*                                      Monitor I CPU gathering is               
*                                      active, otherwise CCVUTILP               
*                                      value at end of interval.                
*                                      (The interval length of the              
*                                      MVS view value is either                 
*                                      5 seconds or the Monitor I               
*                                      cycle time, if it is larger              
*                                      than 5 seconds.)      @WA05435*/         
*                                                               @SPACE;         
*  3 R793SQA4 FIXED(32) BDY(BYTE),  /* NUMBER OF FIXED SQA FRAMES               
*                                      (replaces R793SQA)    @WA56739*/         
*  3 R793CMN4 FIXED(32) BDY(BYTE),  /* NUMBER OF COMMON (LPA+CSA)               
*                                      PAGEABLE AND FIXED FRAMES                
*                                      (replaces R793CMNF)   @WA56739*/         
*  3 R793CMF4 FIXED(32) BDY(BYTE),  /* NUMBER OF COMMON (LPA+CSA)               
*                                      FIXED FRAMES                             
*                                      (replaces R793CMFF)   @WA56739*/         
*  3 R793PFX4 FIXED(32) BDY(BYTE),  /* NUMBER OF PRIVATE FIXED FRAMES           
*                                      (LSQA+NON-LSQA)                          
*                                      (replaces R793PRFX)   @WA56739*/         
*  3 R793LPF4 FIXED(32) BDY(BYTE),  /* Number of total LPA frames               
*                                      (replaces R793LPAF)   @WA56739*/         
*  3 R793CSF4 FIXED(32) BDY(BYTE),  /* Number of total CSA frames               
*                                      including user key common                
*                                      storage allocated in Restricted          
*                                      Use CSA (RUCSA)                          
*                                      (replaces R793CSAF)       @94C*/         
*  3 R793LFX4 FIXED(32) BDY(BYTE),  /* NUMBER OF LPA FIXED FRAMES               
*                                      (replaces R793LPFX)   @WA56739*/         
*  3 R793CFX4 FIXED(32) BDY(BYTE),  /* Number of CSA fixed frames               
*                                      including user key common                
*                                      storage allocated in RUCSA               
*                                      (replaces R793CSFX)       @94C*/         
*  3 R793LSQ4 FIXED(32) BDY(BYTE),  /* NUMBER OF FIXED LSQA FRAMES              
*                                      (replaces R793LSQA)   @WA56739*/         
*  3 R793NLF4 FIXED(32) BDY(BYTE);  /* NUMBER OF PRIVATE NON-LSQA               
*                                      FIXED FRAMES                             
*                                      (replaces R793NLQF)   @WA56739*/         
*%LR794: IF IFAR794='' %THEN %GOTO LR795;                                       
* /* */                                                                         
* DECLARE                                                                       
*    /* DATA SECTION FOR SUBTYPE 4                                              
*       SPAG DATA SECTION  */                                                   
*   @SPACE;                                                                     
* 1 R794 BASED(ADDR(SMF79HDR)+SMF79ASS), /* SCALAR RELOCATE SEC */              
*   @SPACE;                                                                     
*  3 R794CMNI FIXED(31),            /* SYSTEM COMMON (LPA+CSA)                  
*                                      PAGES IN */                              
*  3 R794CMNO FIXED(31),            /* SYSTEM COMMON (CSA) PAGES OUT */         
*  3 R794CMNR FIXED(31),            /* SYSTEM COMMON (LPA+CSA)                  
*                                      PAGES RECLAIMED, not used since          
*                                      rel 330                       */         
*  3 R794SWPO FIXED(31),            /* NUMBER OF SWAP-OUT        @P1C*/         
*  3 R794PSPI FIXED(31),            /* NUMBER OF PAGES SWAPPED IN    */         
*  3 R794PSPO FIXED(31),            /* NUMBER OF PAGES SWAPPED OUT   */         
*  3 R794PRVI FIXED(31),            /* NUMBER OF PRIVATE PAGES                  
*                                      (VIO+NON-VIO) SWAPPED IN      */         
*  3 R794PRVO FIXED(31),            /* NUMBER OF PRIVATE PAGES                  
*                                      (VIO+NON-VIO) SWAPPED OUT     */         
*  3 R794PRVR FIXED(31),            /* NUMBER OF PRIVATE PAGES                  
*                                      (VIO+NON-VIO) RECLAIMED       */         
*/*                                    not used since rel 330        */         
*  3 R794VIO  FIXED(31),            /* NUMBER OF VIO PAGES (IN+OUT)  */         
*  3 R794RSV1 FIXED(16),            /* Reserved since 4.1.0      @W5C*/         
*  3 R794CRI  FIXED(16),            /* Current System UIC                       
*                                      (MCTCurSystemUIC)         @02C*/         
*  3 R794ACRI FIXED(15),            /* AVERAGE OF HIGH UIC COUNT - not          
*                                      used since rel 330    @OA62081*/         
*  3 R794RV1  FIXED(15),            /* RESERVED                      */         
*  3 R794LPAI FIXED(31),            /* SYSTEM LPA PAGES IN           */         
*  3 R794CSAI FIXED(31),            /* SYSTEM CSA PAGES OUT          */         
*  3 R794LPAR FIXED(31),            /* SYSTEM LPA PAGES RECLAIMED - not         
*                                      used since rel 330    @OA62081*/         
*  3 R794CSAR FIXED(31),            /* SYSTEM CSA PAGES RECLAIMED - not         
*                                      used since rel 330    @OA62081*/         
*  3 R794RSV2 FIXED(15),            /* Reserved since 4.1.0      @W5C*/         
*  3 *        FIXED(15),            /* Unused.(was Migratn. age) @Q2C*/         
*  3 R794ERTE FIXED(31),            /* NO. PAGES TO EXT. STOR.   @P2A*/         
*  3 R794EVAL FIXED(31),            /* NO. OF EXTENDED STORAGE SLOTS            
*                                      AVAIL. AND NOT IN USE     @P2A*/         
*  3 R794ESSL FIXED(31),            /* AVAILABLE FOR FUTURE USE  @P2A*/         
*  3 R794MRTE FIXED(31),            /* NO. OF PAGES MIGRATED FROM               
*                                      EXT. STOR. TO AUX. STOR.  @Q2C*/         
*  3 R794MAGE FIXED(31),            /* Migration age             @W5C*/         
*  3 R794AFC  FIXED(31),            /* NUMBER OF AVAIL FRAMES    @W5A*/         
*  3 R794TWSS FIXED(31),            /* TARGET WORKING SETSIZE FOR THE           
*                                      COMMON AREA               @W7A*/         
*  3 R794HSP  FIXED(31),            /* Number of hiperspace pages               
*                                      (IN + OUT)                @W7A*/         
*  3 R794PPIA FIXED(31),            /* Number of blocked pages paged in         
*                                      from AUX (private)        @A2A*/         
*  3 R794LPIA FIXED(31);            /* Number of blocks paged in                
*                                      from AUX (private)        @A2A*/         
*%LR795: IF IFAR795='' %THEN %GOTO LR796;                                       
* /*    */                                                                      
*DECLARE                                                                        
*    /* DATA SECTION FOR SUBTYPE 5                                              
*       ASRM AND ASRMJ DATA SECTION */                                          
*   @SPACE;                                                                     
* 1 R795ELEM BASED(ADDR(SMF79HDR)+SMF79ASS) BDY(BYTE),                          
*   @SPACE;                                                                     
*  3 R795ASID FIXED(15) BDY(BYTE),  /* ASID ADDRESS SPACE IDENTIFIER */         
*  3 R795JBN CHAR(8)   BDY(BYTE),   /* NAME OF JOB */                           
*  3 R795DMN FIXED(15) BDY(BYTE),   /* DOMAIN NUMBER                            
*                                      not applicable in GOAL mode              
*                                                                @C1C*/         
*  3 R795NPG FIXED(15) BDY(BYTE),   /* PERFORMANCE GROUP                        
*                                      not applicable in GOAL mode              
*                                                                @C1C*/         
*  3 R795PGP FIXED(15) BDY(BYTE),   /* PERFORMANCE GROUP PERIOD                 
*                                      not applicable in GOAL mode              
*                                                                @C1C*/         
*  3 R795TTOD FIXED(31) BDY(BYTE),  /* REAL TIME INTO TRANSACTION */            
*   @SPACE;                                                                     
*  3 R795CL CHAR(2),                /* CURRENT LOCATION                         
*                                       IN - In storage,                        
*                                       OT - Swapped out and ready,             
*                                       LO - Logically swapped out,             
*                                       NS - Non swappable,                     
*                                       WM - Wait queue/MSO,                    
*                                       WL - Wait queue/long wait,              
*                                       WT - Wait queue/term wait,              
*                                       WO - Wait queue/others,                 
*                                       DL - TSO user delayed by SRM            
*                                            to meet response time              
*                                            objective,                         
*                                       PR - Privileged,                        
*                                       >> - Transitioning out,                 
*                                       << - Transitioning in                   
*                                                            @OA62081*/         
*  3 R795TAS FIXED(15) BDY(BYTE),    /* TYPE OF USER                            
*                                       0  - BATCH,                             
*                                       1  - STARTED TASK,                      
*                                       2  - MOUNT TASK,                        
*                                       3  - TSO,                               
*                                       4  - ASCH,                              
*                                       5  - OMVS            @OA62081*/         
*   @SPACE;                                                                     
*  3 R795TROD FIXED(31) BDY(BYTE),      /*TRANSACTION RESIDENT TIME  */         
*  3 R795TCNT FIXED(15) BDY(BYTE),   /* TRANSACTION COUNT            */         
*  3 R795SWC  FIXED(15) BDY(BYTE),   /* TRANSACTION SWAP COUNT       */         
*  3 R795CPUS FIXED(31) BDY(BYTE),   /* TOTAL PROCESSOR SERVICE FOR             
*                                       TRANSACTION (ZERO WHEN ASID             
*                                       IS OUT OF STORAGE)           */         
*  3 R795MSOS FIXED(31) BDY(BYTE),   /* TOTAL MSO SERVICE FOR                   
*                                       TRANSACTION (ZERO WHEN ASID             
*                                       IS OUT OF STORAGE)           */         
*  3 R795IOCS FIXED(31) BDY(BYTE),   /* TOTAL IOC SERVICE FOR                   
*                                       TRANSACTION (ZERO WHEN ASID             
*                                       IS OUT OF STORAGE)           */         
*  3 R795WMS  FIXED(31) BDY(BYTE),   /* TOTAL SERVICE FOR                       
*                                       TRANSACTION (ZERO WHEN ASID             
*                                       IS OUT OF STORAGE)           */         
*  3 R795TOTL FIXED(31) BDY(BYTE),   /* TOTAL SERVICE FOR SESSION               
*                                       (ZERO WHEN ASID                         
*                                       IS OUT OF STORAGE)           */         
*  3 R795TOT  FIXED(31) BDY(BYTE),   /* TOTAL SERVICE FOR TRANSACTION           
*                                       SINCE LAST SWAP - IN         */         
*  3 R795SRBS FIXED(31) BDY(BYTE),   /* TOTAL SRB SERVICE FOR                   
*                                       TRANSACTION (ZERO WHEN ASID             
*                                       IS OUT OF STORAGE)           */         
*  3 R795FLG BIT(8),                /* Flags                     @W6C*/         
*    4 *      BIT(3),               /* Reserved                  @C1A*/         
*    4 R795GOAL BIT(1),             /* On = system is in GOAL moed              
*                                                                @C1A*/         
*    4 R795SRV  BIT(1),             /* On = this address space is a             
*                                      server address space                     
*                                      Off =  GOAL specified for this           
*                                      address space is being honored           
*                                      by wlm                    @C1A*/         
*    4 R795QSC  BIT(1),             /* On = address space has been              
*                                      quiesced by a RESET command              
*                                                                @C1A*/         
*    4 R795TRG  BIT(1),             /* R795RGRP is the name of a                
*                                      tenant resource group     @91A*/         
*  3 R795SCL  CHAR(8) BDY(BYTE),    /* Service class name        @C1A*/         
*  3 R795SCP  FIXED(15) BDY(BYTE),  /* Service class period      @C1A*/         
*  3 R795WKLD CHAR(8) BDY(BYTE),    /* Workload name             @C1A*/         
*  3 R795RGRP CHAR(8) BDY(BYTE);    /* Resource group name       @C1A*/         
*%LR796: IF IFAR796='' %THEN %GOTO LR797;                                       
*DECLARE                                                                        
*    /* DATA SECTION FOR SUBTYPE 6                                              
*       ENQUEUE RESERVE DATA SECTION */                                         
*   @SPACE;                                                                     
* 1 R796ELEM BASED(ADDR(SMF79HDR)+SMF79ASS), /* MAPPING OF ELEMENT   */         
*   @SPACE;                                                                     
*      3 R796ASID FIXED(15) BDY(BYTE), /* ADDRESS SPACE ID OF THE               
*                                     JOB WHICH ISSUED THE RESERVE   */         
*      3 R796MAJ CHAR(8),          /* MAJOR NAME OF THE RESOURCE     */         
*      3 R796MIN CHAR(44),         /* MINOR NAME OF THE RESOURCE     */         
*      3 R796JBN CHAR(8),          /* NAME OF JOB IN WHICH THE                  
*                                     RESERVE WAS ISSUED             */         
*      3 R796VOLS CHAR(6),         /* VOLUME SERIAL OF THE VOLUME               
*                                      AGAINST WHICH THE RESERVE WAS            
*                                      ISSUED                        */         
*      3 R796UCB CHAR(3) BDY(BYTE), /* THE 3 DIGIT DEV NUMBER                   
*                                      AGAINST THE RESERVE WAS                  
*                                      ISSUED, OR "UCB"                         
*                                      IF 4 DIGIT DEV NUMBER     @C2C*/         
*      3 R796REQ CHAR(2) BDY(BYTE),/* TYPE AND STATUS OF REQUEST FOR            
*                                     THE RESOURCE                   */         
*      3 R796MINL FIXED(16) BDY(BYTE),/* MINOR NAME LENGTH FOR                  
*                                     REPORTING                      */         
*   @SPACE;                                                                     
*      3 R796FLG BIT(8),           /* RESERVE FLAG BYTE  */                     
*   @SPACE;                                                                     
*/*                                   BIT   MEANING WHEN SET      */            
*/*                                   ---   ----------------      */            
*        5 R796RESV BIT(1),        /*  0    ON=DEVICE RESERVED BY               
*                                              THIS CPU           */            
*        5 R796TRUN BIT(1),        /*  1    MINOR NAME TRUNCATED  */            
*        5 R796GLBL BIT(1),        /*  2    GLOBAL RESOURCE       */            
*        5 R796RESC BIT(1),        /*  3    Reserve request conv.               
*                                           to global ENQ     @Q1A*/            
*        5 R796RES  BIT(4),        /* 4-7   RESERVED          @Q1C*/            
*   @SPACE;                                                                     
*      3 R796SID  CHAR(8),         /*  SYSTEM ID OF THE JOB BY WHICH            
*                                      THE RESERVE WAS ISSUED @C2C*/            
*      3 R796DVN FIXED(16) BDY(BYTE),/*DEV NUMBER (BIN)       @82C*/            
*      3 R796SCS  CHAR(1),         /* SUBCHANNEL SET ID       @82A*/            
*      3 R796RSV  CHAR(1);         /* RESERVED                @82A*/            
*   @SPACE;                                                                     
*%LR797: IF IFAR797='' %THEN %GOTO LR798;                                       
*DECLARE                                                                        
*    /* DATA SECTION FOR SUBTYPE 7                                              
*       ENQUEUE REQUESTS DATA SECTION */                                        
*   @SPACE;                                                                     
* 1 R797ELEM BASED(ADDR(SMF79HDR)+SMF79ASS),                                    
*   @SPACE;                                                                     
*      3 R797MAJ CHAR(8),          /* MAJOR NAME OF THE RESOURCE */             
*      3 R797MIN CHAR(44),         /* MINOR NAME OF THE RESOURCE */             
*      3 R797FLG BIT(8),           /* DATA TYPE FLAGS            @L8A*/         
*   @SPACE;                                                                     
*/*                            BIT          MEANING WHEN SET      */            
*/*                            ---          ----------------      */            
*   @SPACE;                                                                     
*        5 R797GDET BIT(1), /* ON=DETAIL DATA, OFF=SUMMARY DATA  @L8A*/         
*        5 R797GMAJ BIT(1), /* ON=MAJOR NAME IS SPECIFIED       @L8A*/          
*        5 R797GMIN BIT(1), /* ON=MINOR NAME IS SPECIFIED       @L8A*/          
*        5 R797TRNC BIT(1), /* ON=MINOR NAME TRUNCATION         @L8A*/          
*        5 R797GLBL BIT(1), /* ON=GLOBAL RESOURCE               @LCA*/          
*        5 R797ALLS BIT(1), /* ON=RESOURCES IS HELD BY SYS   */                 
*        5 R797ALLE BIT(1), /* ON=ALL EXL OWNED HELD BY SYS  */                 
*        5 R797RSV1 BIT(1),        /* RESERVED BITS            @LLA*/           
*   @SPACE;                                                                     
*      3 R797MINL FIXED(31) BDY(BYTE), /* MINOR NAME LENGHT FOR                 
*                                         REPORTING */                          
*      3 R797OWN FIXED(15) BDY(BYTE),  /* COUNT OF REQUESTS OWNING              
*                                         RESOURCE               @L8A*/         
*      3 R797EXCW FIXED(15) BDY(BYTE), /* COUNT OF EXCL REQS WAITING            
*                                         FOR RESOURCE  */                      
*      3 R797SHRW FIXED(15) BDY(BYTE), /* COUNT OF SHR REQS WAITING FOR         
*                                         RESOURCE        */                    
*      3 R797REQ CHAR(2),              /* TYPE AND STATUS OF REQUEST            
*                                         FOR A RESOURCE */                     
*      3 R797JBN CHAR(8),              /* NAME OF JOB WHICH ISSUED              
*                                         THE ENQ */                            
*      3 R797ASID FIXED(15) BDY(BYTE), /* ADDRESS SPACE ID OF THE JOB           
*                                         WHICH ISSUED THE ENQ */               
*      3 R797SCOP CHAR(4),             /* SCOPE OF THE RESOURCE  */             
*      3 R797RES CHAR(2),              /* RESERVED               @L8A*/         
*      3 R797SID CHAR(8),              /* SYSTEM ID OF JOB THAT                 
*                                         ISSUED ENQ             @LCA*/         
*      3 * CHAR(3);                    /* RESERVED                   */         
*%LR798: IF IFAR798='' %THEN %GOTO LR799;           /*       @GM2EPDV*/         
* /*   */                                                                       
*DECLARE                                                                        
*      /* RELOCATE SECTION FOR SUBTYPE 8 - MONITOR II                           
*         TRANSACTION ACTIVITY                @GM2EPDV*/                        
*   @SPACE;                                                                     
*1 R798ELEM BASED(ADDR(SMF79HDR)+SMF79ASS), /* MAPPING OF ELEMENT*/             
*   @SPACE;                                                                     
*      3 R798ICSI CHAR(2),         /* ICS MEMBER NAME ID             */         
*      3 R798IPSI CHAR(2),         /* IPS MEMBER NAME ID             */         
*      3 R798PGN FIXED(15) BDY(BYTE), /* PERFORMANCE GROUP                      
*                                        NUMBER                      */         
*      3 R798PGP FIXED(15) BDY(BYTE), /* PERFORMANCE GROUP                      
*                                        PERIOD                      */         
*      3 R798SYS CHAR(4),          /* SUBSYSTEM NAME                 */         
*      3 R798TTX FIXED(31) BDY(BYTE),  /* NUMBER OF ENDED                       
*                                         TRANSACTIONS               */         
*      3 R798TTM FIXED(32) BDY(BYTE),  /* ELAPSED TIME OF ENDED                 
*                                         TRANSACTIONS FOR PGP, IN              
*                                         1024 MICROSECS.                       
*                                         (UNSIGNED VALUE)   @YA41781*/         
*      3 R798CLS CHAR(10),         /* TRANS. CLASS NAME              */         
*      3 R798USR CHAR(10),         /* USERID                         */         
*      3 R798NAM CHAR(10),         /* TRANS. NAME                    */         
*   @SPACE;                                                                     
*      3 R798FL1 BIT(8),           /* DATA TYPE FLAGS                */         
*          5 R798RPT BIT(1),       /* ON=RPT PGN,OFF=CONTROL PGN*/              
*          5 R798ACN BIT(1),       /* ON=ACCTINFO OPTION USED    @R0A*/         
*          5 * BIT(6),             /* RESERVED BITS              @R0C*/         
*      3 * CHAR(5),                /*                            @C1C*/         
*      3 R798TET BDY(BYTE),            /* ELAPSED TIME OF ENDED                 
*                                         TRANSACTIONS FOR PGP, IN              
*                                         1024 MICROSECS.                       
*                                         (UNSIGNED VALUE)       @C1A*/         
*          5 R798TET1 FIXED(32) BDY(BYTE), /* R798TET - word 1   @C1A*/         
*          5 R798TET2 FIXED(32) BDY(BYTE); /* R798TET - word 2   @C1A*/         
*   @SPACE;                                                                     
*%LR799: IF IFAR799='' %THEN %GOTO LR79A;                                       
*/* RELOCATE BLOCK FOR SUBTYPE 9                                     */         
*/* MONITOR 2 DEVICE DATA SECTION                                    */         
*DCL  1 R799ELEM BASED(ADDR(SMF79HDR)+SMF79ASS),  /* MAPPING OF                 
*                                    DEVICE DATA SECTION             */         
*       3 R799NUM CHAR(2),        /* DEVICE NUMBER                   */         
*       3 R799LCU CHAR(2),        /* LOGICAL CONTROL UNIT NUMBER     */         
*       3 R799RV0 CHAR(1),        /* RESERVED                        */         
*       3 R799CNF BIT(8),         /* DEVICE FLAGS                    */         
*         5 R799QUL BIT(1),       /* =1 IF IOS Q-LENGTH INVALID      */         
*         5 R799LCD BIT(1),       /* =1 IF NO LCUD INFORMATION       */         
*         5 R799CMB BIT(1),       /* =1 IF CMB DATA INVALID          */         
*         5 R799DTF BIT(1),       /* =1 IF DEVICE CONNECT OR PENDING            
*                                    OR DISCONNECT TIME IS INVALID              
*                                                            @WA15094*/         
*         5 * BIT(1),             /* RESERVED                        */         
*         5 R799MXB BIT(1),       /* RESERVED                    @81C*/         
*         5 R799VAC BIT(1),       /* DATA INVALID, VARIED ON OR OFF,            
*                                    OR DYNAMIC RECONFIGURATION      */         
*         5 R799STA BIT(1),       /* =1 FOR ONLINE AT END OF INTERVAL*/         
*       3 R799SER CHAR(6),        /* VOLUME SERIAL NUMBER OF                    
*                                    MOUNTED VOLUME                  */         
*       3 R799TYP FIXED(32),      /* UNIT TYPE FROM UCBTYP FIELD     */         
*       3 R799NUX FIXED(32),      /* Number of exposures (if multiple).         
*                                    In case of a HyperPAV base                 
*                                    device, R799HPV = 1, number                
*                                    of accumulated HyperPAV                    
*                                    aliases                     @01C*/         
*       3 R799SSC FIXED(32),      /* START SUBCHANNEL (SSCH) COUNT   */         
*       3 R799MEC FIXED(32),      /* MEASUREMENT EVENT COUNT (NUMBER            
*                                    OF SSCH FOR WHICH CONNECT,                 
*                                    PENDING, AND ACTIVE TIME WERE              
*                                    STORED                          */         
*       3 R799CNN FIXED(32),      /* DEVICE CONNECT TIME             */         
*       3 R799PEN FIXED(32),      /* FUNCTION PENDING TIME           */         
*       3 R799ATV FIXED(32),      /* FUNCTION ACTIV TIME             */         
*       3 R799DIS FIXED(32),      /* DEVICE DISCONNECT TIME          */         
*       3 R799QUE FIXED(32),      /* NUMBER OF REQUESTS QUEUED IN               
*                                    IOS FOR THIS DEVICE             */         
*       3 R799UTL FIXED(32),      /* NUMBER OF SAMPLES WHEN THE                 
*                                    DEVICE WAS RESERVED, BUT AN SSCH           
*                                    HAD NOT BEEN ISSUED             */         
*       3 R799RSV FIXED(32),      /* NUMBER OF SAMPLES DURING THE               
*                                    INTERVAL THAT INDICATED THAT THE           
*                                    DEVICE WAS RESERVED             */         
*       3 R799DSO FIXED(32),      /* reserved - do not use - variable           
*                                    is needed for conversion    @U2C*/         
*       3 R799ALC FIXED(32),      /* NUMBER OF SAMPLES DURING THE               
*                                    INTERVAL THAT INDICATED THAT THE           
*                                    DEVICE WAS ALLOCATED            */         
*       3 R799DVB FIXED(32),      /* device busy delay time                     
*                                    (3090,9021,9121,9221 support)              
*                                                                @Z1C*/         
*       3 R799CUB CHAR(4),        /* No longer used              @K1C*/         
*       3 R799ICT FIXED(16),      /* No longer used             @A02C*/         
*       3 R799CNX FIXED(8),       /* Device flag extension       @G2A*/         
*         5 R799PAV BIT(1),       /* =1 If base exposure of a                   
*                                       Parallel Access Volume   @G2A*/         
*         5 R799NXC BIT(1),       /* =1 If number of alias                      
*                                       exposures changed        @G2A*/         
*         5 R799NTF BIT(1),       /* Timing facility not active  @I2A*/         
*         5 R799ECM BIT(1),       /* =1 ECMB mode                @K3A*/         
*         5 R799STS BIT(1),       /* =1 model dependent data                    
*                                       not available by STSCH   @K1A*/         
*         5 R799FCM BIT(1),       /* =1 Initial command                         
*                                       response time available  @K1A*/         
*         5 R799HPV BIT(1),       /* =1 HyperPAV base device     @01A*/         
*         5 R799FID BIT(1),       /* =1 Interrupt delay time                    
*                                       available            @OA39993*/         
*       3 R799RES FIXED(8),       /* reserved                    @G2C*/         
*       3 R799SGN CHAR(8),        /* Storage Group Name          @U1C*/         
*       3 R799NDA FIXED(32),      /* Total number of allocations in             
*                                    effect for the device       @Z1C*/         
*       3 R799DPB CHAR(4),        /* No longer used              @K1C*/         
*       3 R799CMR FIXED(32),      /* Command response time in                   
*                                    units of 128 microseconds   @K1C*/         
*       3 R799PCT FIXED(32),      /* Number of unsuccessful PAV                 
*                                    samples                     @01C*/         
*       3 R799PSM FIXED(32),      /* Number of successful PAV                   
*                                    samples                 @OA39993*/         
*       3 R799IDT FIXED(32),      /* Interrupt delay time in units              
*                                    of 128 microseconds. This field            
*                                    is zero if not supported by the            
*                                    hardware.                   @62C*/         
*       3 R799CUQ FIXED(32),      /* Control Unit Queuing Time   @62A*/         
*       3 R799CN2 FIXED(8),       /* Device flag extension 2     @62A*/         
*         5 R799CFC Bit(1),       /* Device connected to FICON   @62A*/         
*         5 *       Bit(7),       /* Reserved for future use     @62A*/         
*       3 R799SCS FIXED(8),       /* Subchannel set the device                  
*                                    is situated                 @63A*/         
*       3 R799NM2 FIXED(16),      /* Device number same as                      
*                                    R799NUM                     @63A*/         
*       3 R799IOS FIXED(32);      /* IOS Queue time in                          
*                                    microseconds                @85A*/         
*%LR79A: IF IFAR79A='' %THEN %GOTO LR79B;                                       
*  /*  */                                                                       
*DECLARE                                                                        
*     /*  DATA SECTION FOR SUBTYPE A                                            
*         MONITOR 2 DISPLAY DOMAIN @LBA */                                      
*   @SPACE;                                                                     
* 1 R79AELEM BASED(ADDR(SMF79HDR)+SMF79ASS) BDY(WORD),                          
*   @SPACE;                                                                     
*      3 R79ATWSR FIXED(31),       /* TIME WEIGHTED SERVICE RATE @LBA*/         
*      3 *        FIXED(15),       /* Reserved                   @A3C*/         
*      3 R79ARUA FIXED(15),        /* AVERAGE NUMBER OF READY USERS */          
*      3 *        FIXED(15),       /* Reserved                   @A3C*/         
*      3 R79ACMPL FIXED(15),       /* CURRENT MPL VALUE */                      
*      3 R79AOUTU FIXED(15),       /* AVERAGE NUMBER OF USERS SWAPPED           
*                                     OUT */                                    
*      3 R79AINCU FIXED(15),       /* AVERAGE NUMBER OF SWAPPED IN-             
*                                     USERS */                                  
*      3 *        FIXED(15),       /* Reserved                   @A3C*/         
*      3 R79ACIDX FIXED(16),       /* CONTENTION INDEX @ZA69833*/               
*      3 R79ANSW FIXED(15),        /* NUMBER OF NON SWAPPABLE USERS */          
*      3 R79ADMNO FIXED(8),        /* DOMAIN NUMBER @LBA*/                      
*      3 R79RESV1 FIXED(8),        /* RESERVED. FORMER R79ADMLO @P3C*/          
*      3 R79RESV2 FIXED(8),        /* RESERVED. FORMER R79ADMHI @P3C*/          
*      3 *        CHAR(1),         /* Reserved                   @A3C*/         
*      3 R79AIPS CHAR(2),          /* CURRENT IPS @LBA*/                        
*      3 R79ACPU CHAR(4),          /* CPU SERVICE COEF. @LBA*/                  
*      3 R79AIOS CHAR(4),          /* I/O SERVICE COEF. @LBA*/                  
*      3 *       CHAR(4),          /* RESERVED SINCE RMF 4.2.0   @Y2C*/         
*      3 R79ASRB CHAR(4),          /* SRB SERVICE COEF. @LBA*/                  
*      3 R79ATWET CHAR(4),         /* AVERAGE FIRST PERIOD TSO                  
*                                     TRANSACTION RESPONSE TIME */              
*      3 R79ADMLO FIXED(15),       /* MIN MPL LEVEL @P3C*/                      
*      3 R79ADMHI FIXED(15),       /* MAX MPL LEVEL @P3A*/                      
*      3 R79AMSO CHAR(8),          /* MAIN STORAGE SERVICE COEF. @A3C*/         
*      3 R79AIMPL FIXED(15),       /* IN MPL Target              @A3A*/         
*      3 R79AOMPL FIXED(15);       /* OUT MPL Target             @A3A*/         
*%LR79B: IF IFAR79B='' %THEN %GOTO LR79C;                                       
*DECLARE                                                                        
*   /* CONTROL SECTION FOR SUBTYPE B                                            
*      MONITOR 2 PAGE DATA SET ACTIVITY   @K2C*/                                
*   @SPACE;                                                                     
* 1 R79BCNTL BASED(ADDR(SMF79HDR)+SMF79DCS) BDY(WORD), /* COMMON                
*                                     DATA ELEMENT               @K2C*/         
*   @SPACE;                                                                     
*      3 R79BETYP CHAR(1),         /* Type of data that follows:                
*                                     P - Page                   @K2C*/         
*      3 * CHAR(3);                /* Reserved                       */         
*   @SPACE;                                                                     
*DECLARE                                                                        
*   /* DATA SECTION FOR SUBTYPE B                                               
*      MONITOR 2 Page Data Set Activity @K2C*/                                  
*   @SPACE;                                                                     
* 1 R79BELEM BASED(ADDR(SMF79HDR)+SMF79ASS) BDY(WORD),                          
*   @SPACE;                                                                     
*      3 R79BSALC FIXED(32),       /* SLOTS IN THIS DATA SET     @LBA*/         
*      3 R79BSAVL FIXED(32),       /* SLOTS AVAILABLE            @LBA*/         
*      3 R79BSLBD FIXED(32),       /* NUMBER OF BAD SLOTS        @LBA*/         
*      3 R79BSUSE FIXED(32),       /* ASM IN USE COUNT           @LBA*/         
*      3 R79BSIOS FIXED(32),       /* I/O REQUESTS               @LBA*/         
*      3 R79BREQS FIXED(32),       /* PAGES TRANSFERRED          @LBA*/         
*   @SPACE;                                                                     
*      3 R79BFLG  BIT(8),          /* FLAGS                      @LBA*/         
*        5 R79BSBAD BIT(1),        /* BAD DATA SET INDICATOR     @LBA*/         
*        5 R79BPLPA BIT(1),        /* PLPA DATA SET              @LBA*/         
*        5 R79BCOMM BIT(1),        /* COMMON DATA SET            @LBA*/         
*        5 R79BDPLX BIT(1),        /* Reserved                   @K2C*/         
*        5 R79BLOCL BIT(1),        /* LOCAL DATA SET             @LBA*/         
*        5 R79BPAGE BIT(1),        /* PAGE DATA                  @LBA*/         
*        5 R79BSWAP BIT(1),        /* Reserved                   @K2C*/         
*        5 R79BVIO  BIT(1),        /* DATASET ACCEPTS VIO PAGES  @LKA*/         
*   @SPACE;                                                                     
*      3 R79BDEV  BIT(8),          /* DEVICE TYPE CODE           @LBA*/         
*      3 R79BDADR CHAR(3),         /* 3 DIGIT DEV NUMBER, OR "UCB",             
*                                     IF 4 DIGIT DEV NUMBER      @C1C*/         
*      3 R79BVSER CHAR(6),         /* VOLUME SERIAL              @LBA*/         
*      3 R79BDSN  CHAR(44),        /* DATA SET NAME              @LBA*/         
*      3 R79BFL2 BIT(8),           /* FLAGS                  @OA62081*/         
*      4 R79BMEXP BIT(1),          /* RESERVED                   @81C*/         
*      4 R79BALCU BIT(1),          /* RESERVED                   @81C*/         
*      4 R79BDNM BIT(1),           /* INDICATES IF FIELD R79BDEVN               
*                                     CONTAINS VALID DEVICE NAME @Y1A*/         
*      4 R79BSCM Bit(1),           /* =1 Page Space Type SCM @OA38660*/         
*                                                             /* @Y1D*/         
*      3 R79BDEVN CHAR(8),         /* DEVICE NAME                @Y1A*/         
*      3 R79BCU   CHAR(8),         /* CONTROL UNIT NAME          @C2C*/         
*      3 R79BDVN FIXED(16),        /* DEV NUMBER (BIN) FROM UCBCHAN             
*                                                                @81C*/         
*      3 R79BSCS FIXED(8),         /* Subchannel Set ID          @81A*/         
*      3 R79BRSV1 FIXED(8);        /* Reserved                   @81A*/         
*   @SPACE;                                                                     
*%LR79C: IF IFAR79C='' %THEN %GOTO LR79D;                                       
*   @EJECT;                                                                     
*    /* CHANNEL PATH CONTROL SECTION */                                         
*   @SPACE;                                                                     
*DCL 1 R79CCNTL BASED(ADDR(SMF79HDR)+SMF79DCS) BDY(WORD),                       
*      3 R79CSMP FIXED(31),         /* Number of samples weighted by            
*                                      SRM, only valid if R79CMCS               
*                                      = OFF                 @OA04260*/         
*      3 R79CFLAG CHAR(4),          /* Flags                     @BAA*/         
*        5 R79CFLG1 BIT(8),         /* Flags 1                   @BAA*/         
*          7 R79CCPMF BIT(1),       /* CPMF available            @BAA*/         
*          7 R79CCFGC BIT(1),       /* Configuration change      @E1A*/         
*          7 R79CCMH BIT(1),        /* DCM supported by hardware @I3A*/         
*          7 R79CCMD BIT(1),        /* Configuration contains DCM               
*                                      managed channels          @I3A*/         
*          7 R79CRNA BIT(1),        /* RMF address space not active             
*                                                                @I3A*/         
*          7 R79CMCS BIT(1),        /* HW allows multiple                       
*                                      channel subsystems        @K3A*/         
*          7 R79CECM BIT(1),        /* Enhanced channel measurement             
*                                      facility available        @22A*/         
*          7 * BIT(1),              /* Reserved                  @22C*/         
*        5 R79CCMI  FIXED(8),       /* CPMF mode info                           
*                                      0 - CPMF not active                      
*                                      1 - Compatibility mode                   
*                                      2 - Extended mode         @H1A*/         
*        5 *         CHAR(2),       /* Reserved for future use   @H1C*/         
*      3 R79CCFRC FIXED(32),        /* CPMF restart count        @BAA*/         
*      3 R79CCFSC FIXED(32),        /* CPMF sample count         @K3C*/         
*      3 R79CCSS  FIXED(8),         /* Channel Subsystem Id,                    
*                                      only valid if R79CMCS = ON               
*                                                            @OA04260*/         
*      3 *        CHAR(3);          /* Reserved for future use   @K3A*/         
*   @SPACE;                                                                     
*   /* RELOCATE BLOCK FOR SUBTYPE C - MONITOR II                                
*      CHANNEL PATH DATA SECTION */                                             
*   @SPACE;                                                                     
*DCL 1 R79CCHNL BASED(ADDR(SMF79HDR)+SMF79ASS) BDY(WORD),                       
*      3 R79CCPID   CHAR(1),       /* CHANNEL PATH IDENTIFICATIONS.             
*                                     THE RANGE OF VALUES IS                    
*                                     X'00' TO X'FF'                 */         
*      3 R79CFG2    FIXED(8),      /* CHANNEL FLAGS                  */         
*        5 R79CRV1  BIT(2),        /* RESERVED                       */         
*        5 R79CBL   BIT(1),        /* BLOCK MULTIPLEXOR              */         
*        5 R79CBY   BIT(1),        /* BYTE MULTIPLEXOR               */         
*        5 R79CCVC  BIT(1),        /* ES Conversion Channel      @Z1A*/         
*        5 R79CCNC  BIT(1),        /* ES Connection Channel      @Z2A*/         
*        5 R79CDOC  BIT(1),        /* ESCON Director on Channel  @Z2A*/         
*        5 R79CCC   BIT(1),        /* Channel to Channel     @YA67090*/         
*      3 R79CFG3    FIXED(8),       /* Channel flags continued   @BAA*/         
*        5 R79CSHR  BIT(1),         /* Channel path is shared between           
*                                      logical partitions        @BAA*/         
*        5 R79CNVL  BIT(1),         /* CPMF indication, this entry              
*                                      is invalid                @BAA*/         
*        5 *        BIT(1),         /* Res. for future use   @YA67090*/         
*        5 R79CFXT  BIT(1),         /* Channel converter 3090    @C3A*/         
*        5 R79CCPM  BIT(1),         /* Channel path is DCM managed              
*                                                                @I3A*/         
*        5 R79CCDC  BIT(1),         /* Channel characteristics                  
*                                      changed                   @K4A*/         
*        5 R79CXCM  BIT(1),         /* Extended channel measurements  /         
*                                      supported                 @22A*/         
*        5 *        BIT(1),         /* Reserved for future use   @22C*/         
*      3 R79CCPD  FIXED(8),         /* Channel path description.                
*                                      For an explanation, you                  
*                                      can issue the command                    
*                                      D M=CHP.                  @G1C*/         
*                                   /*                          9@G1D*/         
*                                                                               
*      3 R79CBSY    FIXED(32),      /* Number of samples the channel            
*                                      path was busy, weighted by               
*                                      SRM.                      @BAC*/         
*      3 R79CPBY    FIXED(32),      /* Partitions channel-path-busy             
*                                      time in units of 128                     
*                                      micro seconds             @BAA*/         
*      3 R79CCPTX   FIXED(32),      /* Extended last time stamp                 
*                                                            @WA39393*/         
*        5 *        BIT(8),         /* Overflow area         @WA39393*/         
*        5 R79CCPTS FIXED(24),      /* Last CPMB entry time stamp               
*                                      in units of 128 microseconds             
*                                      (be aware that this time value           
*                                      wraps about every 35.79 minutes)         
*                                                            @WA39393*/         
*      3 R79CACR    CHAR(5),        /* Channel Path acronym      @G1A*/         
*      3 R79CCMG    FIXED(8),       /* CPMF Channel Measurement                 
*                                      Group                     @H1A*/         
*      3 R79CFG4    BIT(8),         /* Channel Path Flags        @H1C*/         
*        5 R79CWD1  BIT(1),         /* CPMF Channel characteristics             
*                                      word 1 valid              @J1C*/         
*        5 R79CWD2  BIT(1),         /* CPMF Channel characteristics             
*                                      word 2 valid              @J1C*/         
*        5 R79CWD3  BIT(1),         /* CPMF Channel characteristics             
*                                      word 3 valid              @J1C*/         
*        5 R79CWD4  BIT(1),         /* CPMF Channel characteristics             
*                                      word 4 valid              @J1C*/         
*        5 R79CWD5  BIT(1),         /* CPMF Channel characteristics             
*                                      word 5 valid              @J1C*/         
*        5 *        BIT(3),         /* Reserved for future use   @H1C*/         
*      3 R79CCPP FIXED(8),          /* Channel path parameter    @I3C*/         
*      3 R79CCCM    CHAR(48),       /* CPMF Channnel Measurements               
*                                      (extended mode)           @J5C*/         
*      3 R79CGEN    FIXED(8),       /* Channel type generation   @J5A*/         
*      3 *          CHAR(3),        /* Reserved                  @22C*/         
*      3 R79CCCMX   CHAR(32);       /* CPMF extended channel                    
*                                      measurement data. This                   
*                                      field is only available                  
*                                      for measurement group 2.  @22A*/         
*   @SPACE;                                                                     
*   DECLARE                                                                     
*    1 R79CCM1  CHAR(48) BDY(WORD) BASED(ADDR(R79CCCM)), /*                     
*                                      Channel data                             
*                                      Measurement group 1       @H1A*/         
*      3 R79CTUT    FIXED(32),      /* CPMF Total channel path                  
*                                      busy Time in units of                    
*                                      128 microseconds          @H1A*/         
*      3 R79CPUT    FIXED(32),      /* CPMF LPAR channel path                   
*                                      busy Time in units of                    
*                                      128 microseconds          @H1A*/         
*      3 *          CHAR(40);       /* Reserved                  @H1A*/         
*   @SPACE;                                                                     
*   DECLARE                                                                     
*    1 R79CCM2  CHAR(48) BDY(WORD) BASED(ADDR(R79CCCM)), /*                     
*                                      Channel                                  
*                                      Measurement group 2       @H1A*/         
*      3 R79CCCC,                   /* CPMF Channel Characteristics             
*                                      data                      @H1A*/         
*        5 R79CMBC  FIXED(32),      /* CPMF Maximum Bus Cycles                  
*                                      per second (word 1)       @J1C*/         
*        5 R79CMCU  FIXED(32),      /* CPMF Maximum Channel work                
*                                      Units per second (word 2) @J1C*/         
*        5 R79CMWU  FIXED(32),      /* CPMF Maximum Write data                  
*                                      Units per second (word 3) @J1C*/         
*        5 R79CMRU  FIXED(32),      /* CPMF Maximum Read data                   
*                                      Units per second (word 4) @J1C*/         
*        5 R79CUS   FIXED(32),      /* CPMF data Unit Size in                   
*                                      bytes (word 5)            @J1A*/         
*      3 R79CCCD,                   /* CPMF Channel measurement                 
*                                      group 2 Data              @H1A*/         
*        5 R79CTBC    FIXED(32),    /* CPMF Total Bus Cycles                    
*                                      Count                     @H1A*/         
*        5 R79CTUC    FIXED(32),    /* CPMF Total channel work                  
*                                      Unit Count                @H1A*/         
*        5 R79CPUC    FIXED(32),    /* CPMF LPAR channel work                   
*                                      Unit Count                @H1A*/         
*        5 R79CTWU    FIXED(32),    /* CPMF Total Write data                    
*                                      Units                     @H1A*/         
*        5 R79CPWU    FIXED(32),    /* CPMF LPAR Write data                     
*                                      Units                     @H1A*/         
*        5 R79CTRU    FIXED(32),    /* CPMF Total Read data                     
*                                      Units                     @H1A*/         
*        5 R79CPRU    FIXED(32);    /* CPMF LPAR Read data Units @H1A*/         
*   @SPACE;                                                                     
*   DECLARE                                                                     
*    1 R79CXCM2 CHAR(32) BDY(WORD) BASED(ADDR(R79CCCMX)), /*                    
*                                      CPMF Extended channel                    
*                                      measurement group 2 data  @22A*/         
*      3 R79CXOC      FIXED(32),    /* Total number of FICON command-           
*                                      mode operations (CPC) that have          
*                                      been attempted by the channel            
*                                                                @22A*/         
*      3 R79CXOD      FIXED(32),    /* Total number of FICON command-           
*                                      mode operations (CPC) that could         
*                                      not be initiated by the channel          
*                                      due to a lack of available               
*                                      resources                 @22A*/         
*      3 R79CXOS      CHAR(8),      /* Summation count of FICON                 
*                                      command-mode operations (CPC).           
*                                      Each time the number of FICON            
*                                      command-mode operations is               
*                                      incremented, the number of FICON         
*                                      command-mode operations active           
*                                      at the channel, including the            
*                                      one being initiated, is added            
*                                      to this field.                           
*                                      (doubleword format)       @22A*/         
*      3 R79CXTC      FIXED(32),    /* Total number of FICON transport-         
*                                      mode operations (CPC) that have          
*                                      been attempted by the channel.           
*                                      Zero when no zHPF.        @22A*/         
*      3 R79CXTD      FIXED(32),    /* Total number of FICON transport-         
*                                      mode operations (CPC) that could         
*                                      not be initiated by the channel          
*                                      due to a lack of available               
*                                      resources. Zero when no zHPF.            
*                                                                @22A*/         
*      3 R79CXTS      CHAR(8);      /* Summation count of FICON                 
*                                      transport-mode operations (CPC).         
*                                      Each time the number of FICON            
*                                      transport-mode operations is             
*                                      incremented, the number of               
*                                      transport-mode operations active         
*                                      at the channel, including the            
*                                      one being initiated, is added to         
*                                      this field. Zero when no zHPF.           
*                                      (doubleword format)       @22A*/         
*   @SPACE;                                                                     
*   DECLARE                                                                     
*    1 R79CCM3  CHAR(48) BDY(WORD) BASED(ADDR(R79CCCM)), /*                     
*                                      Channel                                  
*                                      Measurement group 3       @J4A*/         
*      3 R79CCC3,                   /* CPMF Channel Characteristics             
*                                      data                      @J4A*/         
*        5 R79CPDU  FIXED(32),      /* CPMF LPAR Data Unit size                 
*                                      in bytes (word 1)         @J4A*/         
*        5 R79CTDU  FIXED(32),      /* CPMF Total Data Unit size                
*                                      in bytes (word 2)         @J4A*/         
*        5 R79CPUM  FIXED(32),      /* CPMF LPAR Message sent                   
*                                      Unit size (word 3)        @J4A*/         
*        5 R79CTUM  FIXED(32),      /* CPMF Total Message sent                  
*                                      Unit size (word 4)        @J4A*/         
*        5 *        CHAR(4),        /* Reserved                  @J4A*/         
*      3 R79CCD3,                   /* CPMF Channel measurement                 
*                                      group 3 Data              @J4A*/         
*        5 R79CPMS    FIXED(32),    /* CPMF LPAR Message Sent                   
*                                      units count               @J4A*/         
*        5 R79CTMS    FIXED(32),    /* CPMF Total Message Sent                  
*                                      units count               @J4A*/         
*        5 R79CPUS    FIXED(32),    /* CPMF LPAR count of                       
*                                      Unsuccessful attempts to                 
*                                      Send messages             @J4A*/         
*        5 R79CPUB    FIXED(32),    /* CPMF LPAR count of                       
*                                      Unsuccessful attempts to                 
*                                      receive messages due to                  
*                                      unavailable Buffers       @J4A*/         
*        5 R79CTUB    FIXED(32),    /* CPMF Total count of                      
*                                      Unsuccessful attempts to                 
*                                      receive messages due to                  
*                                      unavailable Buffers       @J4A*/         
*        5 R79CPDS    FIXED(32),    /* CPMF LPAR Data units Sent                
*                                      count                     @J4A*/         
*        5 R79CTDS    FIXED(32);    /* CPMF Total Data units                    
*                                      Sent count                @J4A*/         
*   @SPACE;                                                                     
*   DECLARE                                                                     
*   @SPACE;                                                                     
*     R79C_FIX_LEN FIXED(31) CONSTANT(                                          
*       LENGTH(SMF79HDR) + LENGTH(SMF79PRO) + LENGTH(R79CHL) +                  
*       LENGTH(R79CCNTL)),          /*                           @E1A*/         
*     R79C_VAR_LEN FIXED(31) CONSTANT(                                          
*       LENGTH(R79CCHNL)),          /*                           @E1A*/         
*     R79C_ACR_LEN FIXED(31) CONSTANT(OFFSET(R79CACR)); /*                      
*                                      OFFSET of R79CACR         @G1A*/         
*   @SPACE;                                                                     
*%LR79D: IF IFAR79D='' %THEN %GOTO LR79E;                                       
*   /* RELOCATE BLOCK FOR SUBTYPE D - MONITOR 2 IOQ DATA */                     
*   @SPACE;                                                                     
*   /* I/O QUEUING CONFIGURATION CONTROL SECTION */                             
*   @SPACE;                                                                     
*   DECLARE                                                                     
*     @SPACE;                                                                   
*     1 R79DCS                      /* CONFIGURATION CONTROL SECTION */         
*         BASED(ADDR(SMF79HDR)+SMF79DCS) BDY(WORD),                             
*       3 R79DID1 CHAR(2),          /* LOGICAL CONTROL UNIT                     
*                                      IDENTIFIER                @P4C*/         
*                                                              /*@P4D*/         
*       3 R79DNTR FIXED(15),        /* NUMBER OF DESCRIPTOR TRIPLETS */         
*       3 R79DCPDS FIXED(31),       /* OFFSET TO CONFIGURATION DATA             
*                                      SECTION                       */         
*       3 R79DCPDL FIXED(15),       /* LENGTH OF CONFIGURATION DATA             
*                                      SECTION                       */         
*       3 R79DCPDN FIXED(15);       /* NUMBER OF CONFIGURATION DATA             
*                                      SECTIONS                      */         
*   @SPACE;                                                                     
*   /* CONFIGURATION DATA SECTION */                                            
*   @SPACE;                                                                     
*   DECLARE                                                                     
*     @SPACE;                                                                   
*     1 R79DCPD                     /* CONFIGURATION DATA SECTION    */         
*         BASED(ADDR(R79DCS)+R79DCPDS) BDY(WORD),                               
*       3 R79DCPID CHAR(1),         /* CHANNEL PATH IDENTIFIER       */         
*       3 R79DCPST BIT(8),          /* CHANNEL PATH STATUS           */         
*         5 R79DCPI BIT(1),         /* =1 IF CHANNEL PATH INSTALLED  */         
*         5 R79DCPO BIT(1),         /* =1 IF CHANNEL PATH ONLINE     */         
*         5 R79DCPV BIT(1),         /* =1 IF CHANNEL PATH VARIED     */         
*         5 R79DVPOF BIT(1),        /* =1 IF PATH OFFLINE TO ALL                
*                                         DEVICES TO THE LCU     @P4A*/         
*         5 R79DVP  BIT(1),         /* =1 PATH CONNECTIVITY TO DEVICES          
*                                         OF THE LCU HAS MANIPULATED            
*                                         VIA VARY PATH          @P4A*/         
*         5 * BIT(3),               /* RESERVED                  @P4C*/         
*       3 R79DCUN FIXED(15),        /* NUMBER OF CONTROL UNITS                  
*                                      ATTACHED                      */         
*       3 R79DCU CHAR(8),           /* CONTROL UNITS ATTACHED TO                
*                                      THIS CHANNEL PATH             */         
*         5 R79DCU1 CHAR(2),        /* 1ST CONTROL UNIT IDENTIFIER   */         
*         5 R79DCU2 CHAR(2),        /* 2ND CONTROL UNIT IDENTIFIER   */         
*         5 R79DCU3 CHAR(2),        /* 3RD CONTROL UNIT IDENTIFIER   */         
*         5 R79DCU4 CHAR(2);        /* 4TH CONTROL UNIT IDENTIFIER   */         
*   @SPACE;                                                                     
*   /* I/O QUEUING DATA SECTION */                                              
*   @SPACE;                                                                     
*   DECLARE                                                                     
*   @SPACE;                                                                     
*     1 R79DDS                      /* I/O QUEUING DATA SECTION      */         
*         BASED(ADDR(SMF79HDR)+SMF79ASS) BDY(WORD),                             
*       3 * CHAR(1),                /* RESERVED                                 
*                                                                @P4C*/         
*       3 R79DDST BIT(8),           /* DATA STATUS                   */         
*         5 R79DCPS BIT(1),         /* =1 IF NO STCPS DATA AVAILABLE */         
*         5 * BIT(1),               /* Reserved                  @O1C*/         
*         5 R79DNHMA BIT(1),        /* =1 If no hardware measurements           
*                                      available                 @O1A*/         
*         5 * BIT(5),               /* RESERVED                  @O1C*/         
*       3 R79DICT FIXED(16),        /* No longer used           @A02C*/         
*       3 R79DABY FIXED(32),        /* NUMBER OF SAMPLES WHEN ALL               
*                                      CHANNEL PATHS IN THE LCU                 
*                                      WERE BUSY, VALID ONLY IF                 
*                                      STCPS DATA AVAILABLE          */         
*       3 R79DTIS FIXED(32),        /* TOTAL NUMBER OF INITIAL                  
*                                      SELECTION ATTEMPTS            */         
*       3 R79DSIS FIXED(32),        /* TOTAL NUMBER OF SUCCESSFUL               
*                                      SELECTION ATTEMPTS            */         
*       3 R79DCUB FIXED(32),        /* TOTAL NUMBER OF UNSUCCESSFUL             
*                                      SELECTION ATTEMPTS DUE TO                
*                                      CONTROL UNIT BUSY             */         
*       3 R79DDVB FIXED(32),        /* TOTAL NUMBER OF UNSUCCESSFUL             
*                                      SELECTION ATTEMPTS DUE TO                
*                                      DEVICE BUSY                   */         
*       3 R79DQUE FIXED(32),        /* TOTAL NUMBER OF REQUESTS QUEUED          
*                                      FOR THE LCUG (ACCUMULATED AT             
*                                      INITIAL SELECTION TIME),                 
*                                      THIS FIELD IS NOT SET UP FOR             
*                                      I/O MEASUREMENT LEVEL X'02'              
*                                      LEAR PROCESSORS           @P4C*/         
*       3 R79DID2 CHAR(2),          /* LOGICAL CONTROL UNIT                     
*                                      IDENTIFIER                @P4A*/         
*       3 * CHAR(2);                /* FOR ALIGNMENT ONLY        @P4A*/         
*   @SPACE;                                                                     
*                                                              /*@P4D*/         
*                                                              /*@P4D*/         
*                                                              /*@P4D*/         
*                                                              /*@P4D*/         
*                                                              /*@P4D*/         
*                                                              /*@P4D*/         
*%LR79E: IF IFAR79E='' %THEN %GOTO LR79F;                                       
*   @SPACE;                                                                     
*   DECLARE                                                                     
*     @SPACE;                                                                   
*   /* FIXED BLOCK FOR SUBTYPE E - MONITOR 2 IOQ DATA            @P4A*/         
*   /*                                3090,9021,9121,9221 proc.  @Z1C*/         
*     1 R79EGD                      /* GLBL. I/O QUEUING SECTION @P4A*/         
*         BASED(ADDR(SMF79HDR)+SMF79QSS) BDY(WORD),                             
*       3 R79EGFLG BIT(8),          /* GLOBAL IOQ STATUS         @P4A*/         
*         5 R79EGCMF BIT(1),        /* =1 DATA IS INVALID DUE TO                
*                                         FAILURE OF THE CHANNEL                
*                                         MESUREMENT FACILITY    @P4A*/         
*         5 R79EGDIF BIT(1),        /* =1 DIAGNOSE INTERFACE FAILURE            
*                                                                @P4A*/         
*         5 R79EGDIR BIT(1),        /* =1 ESCON Director in                     
*                                      configuration             @Z1A*/         
*         5 R79EGSSQ BIT(1),        /* =1 CHSC store secondary queue            
*                                      data not supported        @E1A*/         
*         5 R79EGCMH BIT(1),        /* =1 DCM is supported by hardware          
*                                                                @I3A*/         
*         5 R79EGCMD BIT(1),        /* =1 Configuration contains DCM            
*                                      managed channels          @I3A*/         
*         5 R79EGCMR BIT(1),        /* =1 initial-command-response-             
*                                      time supported            @K3A*/         
*         5 R79EGTRD BIT(1),        /* First-transfer-ready-                    
*                                      disabled write data                      
*                                      available             @OA44525*/         
*       3 * CHAR(3),                /* FOR ALIGNMENT ONLY        @P4A*/         
*       3 * CHAR(4),                /* No longer used            @84C*/         
*       3 R79EGSMP FIXED(32);       /* Number of samples for store              
*                                      secondary queue measurement              
*                                      data                      @84A*/         
*   @SPACE;                                                                     
*   /* RELOCATE BLOCKS FOR SUBTYPE E - MONITOR 2 IOQ DATA        @P4A*/         
*   /*                                3090,9021,9121,9221 proc.  @Z1C*/         
*   @SPACE;                                                                     
*   /* I/O QUEUING CONFIGURATION CONTROL SECTION @P4A*/                         
*   @SPACE;                                                                     
*   DECLARE                                                                     
*     @SPACE;                                                                   
*     1 R79ECS                      /* CONFIGURATION CONTROL SECTION            
*                                                                @P4A*/         
*         BASED(ADDR(SMF79HDR)+SMF79DCS) BDY(WORD),                             
*       3 R79EID1 CHAR(2),          /* LOGICAL CONTROL UNIT                     
*                                      IDENTIFIER                @P4A*/         
*       3 R79ENTR FIXED(15),        /* NUMBER OF DESCRIPTOR TRIPLETS            
*                                                                @P4A*/         
*       3 R79ECPDS FIXED(31),       /* OFFSET TO CONFIGURATION DATA             
*                                      SECTION                   @P4A*/         
*       3 R79ECPDL FIXED(15),       /* LENGTH OF CONFIGURATION DATA             
*                                      SECTION                   @P4A*/         
*       3 R79ECPDN FIXED(15);       /* NUMBER OF CONFIGURATION DATA             
*                                      SECTIONS                  @P4A*/         
*   @SPACE;                                                                     
*   /* CONFIGURATION DATA SECTION @P4A*/                                        
*   @SPACE;                                                                     
*   DECLARE                                                                     
*     @SPACE;                                                                   
*     1 R79ECPD                     /* CONFIGURATION DATA SECT.  @P4A*/         
*         BASED(ADDR(R79ECS)+R79ECPDS) BDY(WORD),                               
*      2 R79ECPSD,                  /* CHANNEL PATH CONFIGURATION               
*                                      STATIC DATA               @P4A*/         
*       3 R79ECPID CHAR(1),         /* CHANNEL PATH IDENTIFIER   @P4A*/         
*       3 R79ECPST BIT(8),          /* CHANNEL PATH STATUS       @P4A*/         
*         5 R79ECPI BIT(1),         /* =1 IF CHANNEL PATH INST.  @P4A*/         
*         5 R79ECPO BIT(1),         /* =1 IF CHANNEL PATH ONLINE @P4A*/         
*         5 R79ECPV BIT(1),         /* =1 IF CHANNEL PATH VARIED @P4A*/         
*         5 R79EVPOF BIT(1),        /* =1 IF PATH OFFLINE TO ALL                
*                                         DEVICES TO THE LCU     @P4A*/         
*         5 R79EVP  BIT(1),         /* =1 IF PATH CONNECTIVITY TO               
*                                         DEVICES OF THE LCU HAS                
*                                         MANIPULATED VIA VARY PATH             
*                                                                @P4A*/         
*         5 * BIT(1),               /* Reserved                  @I3A*/         
*         5 R79ECPM  BIT(1),        /* =1 Channel path is DCM managed           
*                                                                @I3A*/         
*         5 R79ECPMR BIT(1),        /* =1 CHPID manipulated, requiring          
*                                      data reset                @I3A*/         
*       3 R79ECUN FIXED(15),        /* NUMBER OF CONTROL UNITS                  
*                                      ATTACHED                  @P4A*/         
*       3 R79ECU CHAR(8),           /* CONTROL UNITS ATTACHED TO                
*                                      THIS CHANNEL PATH         @P4A*/         
*         5 R79ECU1 CHAR(2),        /* 1ST CONTROL UNIT ID.      @P4A*/         
*         5 R79ECU2 CHAR(2),        /* 2ND CONTROL UNIT ID.      @P4A*/         
*         5 R79ECU3 CHAR(2),        /* 3RD CONTROL UNIT ID.      @P4A*/         
*         5 R79ECU4 CHAR(2),        /* 4TH CONTROL UNIT ID.      @P4A*/         
*      2 R79ECPCM,                  /* CHANNEL PATH CONFIGURATION               
*                                      MEASUREMENT DATA          @P4A*/         
*       3 R79ECUB FIXED(31),        /* COUNT OF CU BUSY          @P4A*/         
*       3 R79EPT  FIXED(31),        /* COUNT OF OPERATION ACCEPTED              
*                                      ON THIS CHANNEL PATH      @P4A*/         
*       3 *       FIXED(31),        /* No longer used        @WA50187*/         
*       3 R79EDPBC FIXED(31),       /* Number of initial selection              
*                                      attempts that were unsuccessful          
*                                      because ESCON Director port              
*                                      busy                      @Z2C*/         
*       3 R79ECBT FIXED(32),        /* Control unit busy delay                  
*                                      time                      @K3C*/         
*       3 R79ECMR FIXED(32),        /* Initial CoMmand Response                 
*                                      time                      @K3A*/         
*       3 R79ESBS FIXED(32),        /* Switch busy count                        
*                                      summation                 @K3A*/         
*       3 *       CHAR(4),          /* Reserved for future use   @K3A*/         
*      2 R79ECPXF BIT(8),           /* Channel Path extended                    
*                                      flags                     @K3A*/         
*       3 R79ECPXM BIT(1),          /* 1 = extended I/O-                        
*                                      measurement-block format-1               
*                                      data available            @71C*/         
*       3 R79ECPX2 BIT(1),          /* 1 = extended I/O-                        
*                                      measurement-block format-2               
*                                      data available            @71A*/         
*       3 R79ECPTD BIT(1),          /* 1 = First-transfer-ready-                
*                                      disabled supported        @71A*/         
*       3 *        BIT(5),          /* Reserved                  @71C*/         
*      2 R79ECPAT FIXED(8),         /* Path attribute:                          
*                                      0 = No attributes specified,             
*                                      1 = Preferred path,                      
*                                      2 = Non-preferred path    @L1A*/         
*      2 *        CHAR(2),          /* Reserved for future use   @71C*/         
*      2 R79ECPCX,                  /* Channel path measurement                 
*                                      data extended             @71A*/         
*       3 R79ECTMW FIXED(32),       /* Transport mode write count               
*                                      valid if R79ECPTD=1       @71A*/         
*       3 R79ECTRD FIXED(32),       /* First-transfer-ready-                    
*                                      disabled write count                     
*                                      valid if R79ECPTD=1       @71A*/         
*       3 *        CHAR(8);         /* Reserved for future use   @71A*/         
*   @SPACE;                                                                     
*   /* I/O QUEUING DATA SECTION */                                              
*   @SPACE;                                                                     
*   DECLARE                                                                     
*   @SPACE;                                                                     
*     1 R79EDS                      /* I/O QUEUING DATA SECTION  @P4A*/         
*         BASED(ADDR(SMF79HDR)+SMF79ASS) BDY(WORD),                             
*       3 R79EID2 CHAR(2),          /* LOGICAL CONTROL UNIT                     
*                                      IDENTIFIER                @P4A*/         
*       3 R79EDST BIT(8),           /* DATA STATUS               @P4A*/         
*         5 * BIT(1),               /* RESERVED                  @P4A*/         
*         5 R79ENHMA BIT(1),        /* =1 IF NO HARDWARE MEASUREMENTS           
*                                      AVAILABLE                 @P4A*/         
*         5 * BIT(2),               /* Reserved                  @I3A*/         
*         5 R79ELDCM BIT(1),        /* =1 LCU contains DCM managed              
*                                      channels                  @I3A*/         
*         5 R79ELPAT BIT(1),        /* X'04' Path attributes are                
*                                      valid                     @L1A*/         
*         5 *        BIT(2),        /* Reserved                  @L1C*/         
*       3 * CHAR(1),                /* FOR ALIGNMENT ONLY        @P4A*/         
*       3 R79EQSM FIXED(31),        /* ACCUMULATION OF CU-HDR Q LENGTH          
*                                                                @P4A*/         
*       3 R79EQCT FIXED(31),        /* Count of entries placed on               
*                                      the CU-HDR queue          @I3C*/         
*       3 R79EMCMN FIXED(16),       /* Minimum number of DCM managed            
*                                      channels used             @I3A*/         
*       3 R79EMCMX FIXED(16),       /* Maximum number of DCM managed            
*                                      channels used             @I3A*/         
*       3 R79EMCDF FIXED(16),       /* Defined number of DCM managed            
*                                      channels                  @I3A*/         
*       3 * FIXED(16),              /* Reserved                  @I3A*/         
*       3 R79EDCMA,                 /* DCM managed channel accumulated          
*                                      measurements              @I3A*/         
*         5 R79EPTM FIXED(32),      /* Accumulated path taken count             
*                                      for DCM managed channels  @I3A*/         
*         5 R79EDPBM FIXED(32),     /* Accumulated director port busy           
*                                      count for DCM managed channels           
*                                                                @I3A*/         
*         5 R79ECUBM FIXED(32),     /* Accumulated control unit busy            
*                                      count for DCM managed channels           
*                                                                @K3C*/         
*         5 R79ECBTM FIXED(32),     /* Accumulated control unit busy            
*                                      delay time for DCM                       
*                                      managed channels          @K3A*/         
*         5 R79ECMRM FIXED(32),     /* Accumulated initial                      
*                                      CoMmand Response time for                
*                                      DCM managed channels      @K3A*/         
*         5 R79ESBSM FIXED(32),     /* Accumulated switch busy                  
*                                      count summation for                      
*                                      DCM managed channels      @K3A*/         
*         5 R79ETMWM FIXED(32),     /* Accumulated transport mode               
*                                      write count for DCM                      
*                                      managed channels valid if                
*                                      R79ECPTD=1                @71C*/         
*         5 R79ETRDM FIXED(32),     /* Accumulated first-transfer-              
*                                      ready-disabled write count               
*                                      for DCM managed channels                 
*                                      valid if R79ECPTD=1       @71C*/         
*       3 R79ECSST   FIXED(32);     /* Channel subsystem wait time in           
*                                      units of 128 microseconds @K3A*/         
*                                                                               
*   @SPACE;                                                                     
*   DECLARE                                                                     
*   @SPACE;                                                                     
*     R79E_FIX_LEN FIXED(31) CONSTANT(                                          
*       LENGTH(SMF79HDR) + LENGTH(SMF79PRO) + LENGTH(R79CHL) +                  
*       LENGTH(R79EGD)),            /*                           @E1A*/         
*     R79E_VAR_LEN FIXED(31) CONSTANT(                                          
*       LENGTH(R79ECS) + (8*LENGTH(R79ECPD)) +                                  
*       LENGTH(R79EDS));            /*                           @E1A*/         
*%LR79F: IF IFAR79F='' %THEN %GOTO LR79END;                 /*   @F1A*/         
*/********************************************************************/         
*/*                                                              @F1A*/         
*/* SMF Type 79 Subtype 15 Data Section Mapping R79FIRLM         @F1A*/         
*/*                                                              @F1A*/         
*/********************************************************************/         
*   @SPACE;                                                 /*   @F1A*/         
*   Declare                                                                     
*     1 R79FIRLM Based(Addr(SMF79HDR)+SMF79FPO) BDY(BYTE),  /*   @F1A*/         
*       3 R79FISTN Char(16),        /* IRLM Lock Structure Name  @F1A*/         
*       3 R79FDLKC Fixed(32)                                                    
*                  Boundary(BYTE),  /* Dead Lock Cycle Number    @F1A*/         
*       3 R79FETYP Char(1),         /* 'B'=Blocker / 'W'=Waiter  @F1A*/         
*       3 *        Char(3),         /* Reserved                  @F1A*/         
*       3 R79FWAIT,                 /* Start of variable section:               
*                                      Waiter data               @F1A*/         
*         5 R79FBLKR,               /* Blocker data              @F1A*/         
*           7 R79FIMSI Char(8),     /* IMS Subsystem ID          @F1A*/         
*           7 R79FPSTN Char(2),     /* PST Number                @F1A*/         
*           7 R79FPSBN Char(8),     /* PSB Name                  @F1A*/         
*           7 R79FRGTY Char(1),     /* Region Type               @F1A*/         
*           7 R79FRCVT Char(16),    /* Recovery Token            @F1A*/         
*           7 R79FCTID Char(8),     /* CICS Task ID (If CICS)    @F1A*/         
*           7 R79FLHTI Char(8),     /* Scheduled elapsed time    @F1A*/         
*           7 R79FLHCN Char(4),     /* Max Lock Held-PSTLKHLD    @F1A*/         
*           7 R79FLKNA Char(16),    /* Lock Name                 @F1A*/         
*           7 R79FTRNM Char(8),     /* Trans name / Job name @WA27252*/         
*         5 R79FRSNA Char(8);       /* Resource (DB/Area) Name   @F1A*/         
*   @SPACE;                                                 /*   @F1A*/         
*   Declare                                                                     
*     R79FIRLL Fixed(31) Constant(Length(R79FIRLM));        /*   @F1A*/         
*   @SPACE;                                                 /*   @F1A*/         
*   Declare                                                                     
*     R79FRBAT Char(1) Constant('80'X),  /* Region type = BATCH  @F1A*/         
*     R79FRBMP Char(1) Constant('40'X),  /* Region type = BMP    @F1A*/         
*     R79FRIFP Char(1) Constant('20'X),  /* Region type = IFP    @F1A*/         
*     R79FRCIC Char(1) Constant('10'X),  /* Region type = CICS   @F1A*/         
*     R79FRMPP Char(1) Constant('08'X),  /* Region type = MPP    @F1A*/         
*     R79FRDBC Char(1) Constant('04'X),  /* Region type = DBCTL  @F1A*/         
*     R79FRSYS Char(1) Constant('02'X);  /* Region type = SYPST                 
*                                                            @OA28931*/         
*%LR79END: ;                                                /*   @F1C*/         
