*/*      Bilingual Mapping Macro for SMF Record 72                              
         MACRO                                                                  
         ERBSMF72 &STYPE                                             */         
*/*** START OF SPECIFICATIONS ****************************************          
*                                                                    *          
*01* Proprietary Statement:                                          *          
*       Licensed Materials - Property of IBM                     @61A*          
*       "Restricted Materials of IBM"                            @61A*          
*       Copyright IBM Corp. 1983, 2021                               *          
*                                                                    *          
*       Status: z/OS V2R5 Data Gatherer (HRG77D0)                    *          
*                                                                    *          
*01* Macro Name: ERBSMF72                                            *          
*                                                                    *          
*01* Descriptive Name: SMF RECORD 72                                 *          
*02* Acronym: SMF72                                                  *          
*                                                                    *          
*01* DSECT Name:                                                     *          
*02*  Subtype 1: SMF72HDR, SMF72PRO, SMF72CTL, SMF72PGP              *          
*02*  Subtype 2: SMF72HDR, SMF72PRO, R722WKL, R722DATA, R722SWRE @C1C*          
*02*  Subtype 3: SMF72HDR, SMF72PRO, R723WMS, R723SSS, R723RGS,  @C1A*          
*02*             R723SCS, R723RTS, R723WRS, R723DNS              @21C*          
*02*  Subtype 4: SMF72HDR, SMF72PRO, R724DATA, R724SWRE          @C2A*          
*02*  Subtype 5: SMF72HDR, SMF72PRO, R725SCTL,                   @51A*          
*02*             R725CMSS, R725CEDS, R725CLAS, R725CSMS,         @62C*          
*02*             R725LOTD, R725CLOD, R725CLRD, R725LASC,         @62C*          
*02*             R725LARE, R725ENSE, R725ENSY, R725ENSS          @62C*          
*02*             R725QSAD                                        @63A*          
*                                                                    *          
*                                                                    *          
*01* Component: zOS Data Gatherer (27401)                            *          
*                                                                    *          
*01* Eye-Catcher:   None                                             *          
*02*  Offset: N/A                                                    *          
*02*  Length: N/A                                                    *          
*                                                                    *          
*01* Storage Attributes:                                             *          
*02*   Subpool:  see below                                           *          
*03*      Subtype 1: 0                                               *          
*03*      Subtype 2: 10                                              *          
*03*      Subtype 3: 0                                           @C1A*          
*03*      Subtype 4: 10                                          @C2A*          
*03*      Subtype 5: 10                                          @51A*          
*02*   Key:  8                                                       *          
*02*   Residency:  Above                                             *          
*02*   Main Storage:  N/A                                            *          
*02*   Auxiliary Storage:  N/A                                       *          
*02*   Virtual Storage:  N/A                                         *          
*                                                                    *          
*01* Function = This macro maps the complete SMF Record type 72.     *          
*           It has five subtypes                                 @51C*          
*           - Subtype 1 is created by RMF if workload activity       *          
*             measurements are activated.                            *          
*           - Subtype 2 is created by RMF MON III if SMF is          *          
*             recording record type 72 subtype 2.                    *          
*           - Subtype 3 is created by RMF MON I if workload      @C1A*          
*             activity measurements are activated and the        @C1A*          
*             system runs in GOAL mode                           @C1A*          
*           - Subtype 4 is created by RMF MON III if SMF is      @C2A*          
*             recording record type 72 subtype 4 and the         @C2A*          
*             system runs in GOAL mode                           @C2A*          
*           - Subtype 5 is created by RMF MON III if SMF is      @51A*          
*             recording record type 72 subtype 5                 @51A*          
*             for system suspend locks and GRS data              @51A*          
*                                                                    *          
*           The record consists of 5 parts:                          *          
*           1. The fixed portion of the SMF header.                  *          
*              This mapping is invoked by calling ERBHDR macro.      *          
*           2. The individual header extension which contains        *          
*              offset/length/number triplets to address the          *          
*              record parts following the RMF product section.       *          
*           3. The RMF product section.                              *          
*              This mapping is invoked by calling ERBPRO macro.      *          
*           4. The RMF control sections.                             *          
*           5. The RMF data sections.                                *          
*                                                                    *          
*01* Notes : None                                                    *          
*                                                                    *          
*01* Size:                                                           *          
*       Subtype 1: SMF72PGS + (SMF72PGL * SMF72PGN)                  *          
*       Subtype 2: SMF72SWS + (SMF72SWL*SMF72SWN)                    *          
*       Subtype 3: depends on existence of R723WRS, number of    @C1A*          
*                  entries in R723RTS, and number of entries         *          
*                  in R723DNS                                    @21C*          
*       Subtype 4: SMF72SPS + (SMF72SPL*SMF72SPN)                @C2A*          
*       Subtype 5: (SMF72SEL * SMF72SEN) +                           *          
*                  (SMF72CML * SMF72CMN) +                           *          
*                  (SMF72EDL * SMF72EDN) +                           *          
*                  (SMF72LAL * SMF72LAN) +                           *          
*                  (SMF72SML * SMF72SMN) +                           *          
*                  (SMF72LOL * SMF72LON) +                           *          
*                  (SMF72COL * SMF72CON) +                           *          
*                  (SMF72CRL * SMF72CRN) +                           *          
*                  (SMF72LCL * SMF72LCN) +                           *          
*                  (SMF72LRL * SMF72LRN) +                           *          
*                  (SMF72TDL * SMF72TDN) +                           *          
*                  (SMF72YDL * SMF72YDN) +                           *          
*                  (SMF72SDL * SMF72SDN) +                       @51A*          
*                  (SMF72QSL * SMF72QSN)                         @63A*          
*                                                                    *          
*   Subtype 1:                                                       *          
*                                                                    *          
*     - SMF header      :  36 bytes                              @C1A*          
*     - Header extension:  16 bytes                                  *          
*     - Product section : 104 bytes                              @C1A*          
*       + depending on Type/Subtype (split records only)         @C1A*          
*                          16 bytes Split/Reassembly static      @C1A*          
*         + variable entry  4 bytes * SMFHDR extension triple    @C1A*          
*     - Control section : 116 bytes (each)                       @C3A*          
*     - Data section    : 232 bytes (each)                       @F1C*          
*                                                                    *          
*   Subtype 2:                                                       *          
*                                                                    *          
*     - SMF header      : see above                                  *          
*     - Header extension:  24 bytes                                  *          
*     - Product section : see above                                  *          
*     - Control section :  20 bytes (each)                           *          
*     - Data section 1  : 220 bytes (each)                       @D1C*          
*     - Data section 2  :  72 bytes (each)                       @J3C*          
*       (swap reasons)                                               *          
*                                                                    *          
*   Subtype 3:                                                   @C1A*          
*                                                                    *          
*     - SMF header      : see above                              @C1A*          
*     - Header extension:  56 bytes                              @21A*          
*     - Product section : see above                              @C1A*          
*     - Control section : 280 bytes                              @93C*          
*     - Period section  : 816 bytes (each, max 8 entries)    @OA62502*          
*     - Served          :  12 bytes (each)                       @C1A*          
*     - Response Time   :  56 bytes (each)                       @C1A*          
*     - Resource Group  : 160 bytes (each)                       @91C*          
*     - Work Manager    : 172 bytes (each)                       @01C*          
*     - Delay Names     :  24 bytes (each)                       @81C*          
*                                                                    *          
*   Subtype 4:                                                   @C2A*          
*                                                                    *          
*     - SMF header      : see above                              @C2A*          
*     - Header extension:  16 bytes                              @C2A*          
*     - Product section : see above                              @C2A*          
*     - Data section 1  : 280 bytes (each)                       @81C*          
*     - Data section 2  :  76 bytes (each)                       @83C*          
*       (swap reasons)                                               *          
*                                                                    *          
*   Subtype 5:                                                   @51A*          
*                                                                    *          
*     - SMF header      : see above                              @51A*          
*     - Header extension: 112 bytes                              @63C*          
*     - Product section : see above                              @51A*          
*     - Control section : 384 bytes                              @51A*          
*     - CMS Lock Type   :  64 bytes (each)                       @51A*          
*     - Local Lock Type :  88 bytes (each)                       @51A*          
*     - CML Lock Owner  :  88 bytes (each)                       @51A*          
*     - CML Lock Reques.:  64 bytes (each)                       @51A*          
*     - GRS Latch Type  :  72 bytes (each)                       @51A*          
*     - GRS Enqueue     :  80 bytes (each)                       @51A*          
*     - GRS QScan Stat. : 104 bytes (each)                       @63A*          
*                                                                    *          
*01* Method of Access: See below                                     *          
*                                                                    *          
*       BAL : ERBSMF72 type                                          *          
*             If the type is not specified, all subtypes are         *          
*             included.                                      @WA05544*          
*                                                                    *          
*       PL/X: %IFAR72n='YES' semicolon  n = subtype selected         *          
*             %INCLUDE SYSLIB(ERBSMF72) semicolon                    *          
*                                                                    *          
*             If the preprocessor variable %IFAR72n is not set       *          
*             in the including module, subtype 1 is included.        *          
*                                                                    *          
*01* Pointed to by: SMF72PTR                                         *          
*                                                                    *          
*01* Serialization: None                                             *          
*                                                                    *          
*01* Created by:                                                     *          
*                                                                    *          
*02*    Subtype 1: ERBMFDWS, ERBDUWKL                            @C1C*          
*02*    Subtype 2: GRB3GSIS                                          *          
*02*    Subtype 3: GRBMFDWM, ERBDUWKL                            @C1A*          
*02*    Subtype 4: GRB3GSIS                                      @C2A*          
*02*    Subtype 5: GRB3GSIL                                      @51A*          
*                                                                    *          
*01* Deleted by:                                                     *          
*                                                                    *          
*02*    Subtype 1: GRBMFDTA after return from Report generator       *          
*02*    Subtype 2: Not applicable                                    *          
*02*    Subtype 3: Not applicable                                @C1A*          
*02*    Subtype 4: Not applicable                                @C2A*          
*02*    Subtype 5: Not applicable                                @51A*          
*                                                                    *          
*01* Module-type: BILINGUAL MAPPING MACRO                            *          
*                                                                    *          
*01* Frequency: 1                                                    *          
*                                                                    *          
*01* Dependencies: None                                              *          
*                                                                    *          
*01* Serialization: None                                             *          
*                                                                    *          
*01* Distribution Library: sys1.maclib                           @01C*          
*                                                                    *          
*01* Change Activity = See below                                     *          
*                                                                    *          
* $N0=SMFFORMT,HRM3102,,FRS: NEW FOR RMF 3.1                     @N0A*          
* $P1=SMF72ADJ,HRM3302,,FRY: NEW FOR RMF 3.3 WORKLOAD ACTIVITY   @P1A*          
* $R0=220SUP,JRM3422,,WRC: RMF SUPPORT FOR MVS SP2.2.0           @R0A*          
* REMOVE COMMENT FROM COLUMN 72 SO THE MACRO WILL ASSEMBLE   @YA04880*          
* $W1=SMF,JRM4411,,BHL: SMF Record 72                            @W1A*          
* $W2=SP310E,JRM4411,,PAE: Stor isolation for ESO hiperspaces    @W2A*          
* Remove paranthesis after SETC so the macro will assemble   @YA18672*          
* Make sure both the SMF72 subtypes 1 and 2 are assembled    @YA18672*          
*   when requested.                                          @YA18672*          
* $Y1=LJM,HRM4420,,LAH: Large Job Management Support             @Y1A*          
* $A1=APPC,JRM4421,,BGBO: APPC tolerating support                @A1A*          
* $A2=WSET,JRM4421,,BGBO: Working Set Management / Block Paging  @A2A*          
* $B1=RTIME,HRM4430,,BHL: Response Time Support                  @B1A*          
* $B2=OMVS,HRM4430,,RPT: OPEN/MVS Toleration Support             @B2A*          
* $C1=WLM,HRM4440,,HKH: WLM support, new subtype 3               @C1A*          
* $C2=WLM,HRM4440,,RTL: WLM support, new subtype 4               @C2A*          
* $C3=WLM,HRM4440,,BHL: Workload Manager I                       @C3A*          
* $C4=GWLM3,HRM5510,,HOL: Workload Manager - Monitor III         @C4A*          
* LAN: Corrects SWAP Section Handling                        @WA03326*          
*      Equivalent to OW01699                                 @WA03326*          
* HOL: Corrects SWAP Section Handling                        @WA03509*          
*      Equivalent to OW01699                                 @WA03509*          
* GBO: Cleanup of PADI-inconsistencies                       @WA05544*          
* $D1=CAP,HRM5520,,JKE: Captured Storage support                 @D1A*          
* $E1=WLM,HRM6603,,HOL: OS/390 WLM Support                       @E1A*          
* $E2=WLM,HRM6603,,HOL: I/O delay indicator for velocity         @E2A*          
* $F1=WLM,HRM6604,,HOL: WLM Batch Support                        @F1A*          
* $F2=WLM,HRM6604,,HOL: WLM Batch Support                        @F2A*          
* $I1=WLM,HRM7703,,HOL: Multisystem Enclave Support              @I1A*          
* $I2=WLM,HRM7703,,HOL: WLM Goal Mode Inhibitors                 @I2A*          
* $J1=WLMCRY,HRM7705,,GUB: Crypto using and delay support        @J1A*          
* $J2=WLMRCE,HRM7705,,GUB: Report class enhancements             @J2A*          
* $J3=MISC,HRM7705,,GUB: New swap reason code                    @J3A*          
* GUB: PB state sampling                                     @WA52227*          
* GUB: Improve identification of heterogeneous periods       @WA56739*          
* $K1=WLMEM2,HRM7708,,GUB: WLM enqueue mgmt stage 2 support      @K1A*          
* $K2=IFA,OA05731,,GUB: IFA support                              @K2A*          
* $01=WLMDBM,HRM7730,,GUB: Buffer pool management                @01A*          
* $02=DOC,HRM7730,,GUB: Updates description of R723MMSO          @02A*          
* $03=WLMPEG,HRM7730,,GUB: Changes to resource groups            @03A*          
* GUB: zIIP support                                          @OA13499*          
* $11=WLMBLW,HRM7740,,GUB: Blocked workload support              @11A*          
* $12=WLMHPZ,HRM7740,,GUB: zIIP honor priority                   @12A*          
* $21=WLMJ40,HRM7750,,VTH: Resource delay names                  @21A*          
* $22=WLMJ7Z,HRM7750,,VTH: WLM enqueue mgmt stage 3 support      @22A*          
* $31=WLMIFA,HRM7760,,GUB: IFA service time removal              @31A*          
* $32=WLMLCK,HRM7760,,GUB: Lock promotion time                   @32A*          
* $41=DOC,HRM7770,,GUB: Updates description of R723LPDP          @41A*          
* $42=WLMCEC,HRM7770,,GUB: CEC adjustment factor                 @42A*          
* JKU: Power-Save and Cycle-Steering Modes                   @OA29530*          
* $51=SERI,HRM7780,,BRRE: Suspend Lock, Latch & ENQ Reporting,       *          
*                         new subtype 5                          @51A*          
* $52=WLMSUP,HRM7780,,JKU: Supervisor promotion time             @52A*          
* $53=MISC,HRM7780,,PS: Fixes ASM offset mismatch                @53A*          
* $54=WLMRTD,HRM7780,,JKU: RT distribution for velocity goals    @54A*          
* $61=R790,HRM7790,,MWe: Explicit copyright for ext. macro       @61A*          
* $62=MISC,HRM7790,,GUB: Fixes subtype 5 descriptions            @62A*          
* $63=QSCAN,HRM7790,,RRe: GRS QScan statistics                   @63A*          
* $64=WLMIO,HRM7790,,GUB: I/O priority group                     @64A*          
* $71=MT2,OA44101,,JKu: MT-2 support                             @71A*          
* MAI: Mobile Support                                        @OA48466*          
* $81=WLMSRT,HRM77B0,,GUB: WLM shorter response time goal        @81A*          
* $82=MISC,HRM77B0,,UM: Remove CAM crypto using/delay support    @82A*          
* $83=Sprk1,OA50760,,UM: Report for Spark/Cloud Stage 1          @83A*          
* $91=TNT,OA52694,,JKU: Metering and Capping Stage 3             @91A*          
* $92=ZCBP,OA54915,,GUB: zCBP support                            @92A*          
* $93=ZCBP,OA54915,,JKU: zCBP fencing                            @93A*          
* $A02=ZOSB,HRG77D0,,JBa: Rename prefix ERB to GRB              @A02A*          
* $A03=zOSB,HRG77D0,,UMu: Move Data Gatherer into z/OS base     @A03A*          
* $A04=COEF,HRG77D0,,JKu: Removal of WLM service coefficients   @A04A*          
* UMu: IWMRCOLL enclave transaction data                     @OA62502*          
* JKu: Update field description for REST services            @OA62081*          
*                                                                    *          
****** End of Specifications *****************************************/         
*        %GOTO PLAS72;                                                          
*/*                                                                             
         SPACE 3                                                                
********************** SMF 72 RECORD LEVEL ******************* @OA62502         
* Definition of current SMF record level for each subtype      @OA62502         
*                                                              @OA62502         
* Record level SMF72n_SRL must be incremented, whenever        @OA62502         
* length or layout is changed by APAR and release development  @OA62502         
*                                                              @OA62502         
* '8E'X  - RMF product split                                   @OA62502         
* '8F'X  - IWMRCOLL enclave transaction data (OA62502)         @OA62502         
*                                                              @OA62502         
********************** SMF 72 RECORD LEVEL ******************* @OA62502         
         SPACE 2                                                                
SMF723_SRL  EQU X'8F'   Current SMF 72 subtype  3 record level @OA62502         
SMF724_SRL  EQU X'8E'   Current SMF 72 subtype  4 record level @OA62502         
SMF725_SRL  EQU X'8E'   Current SMF 72 subtype  5 record level @OA62502         
         SPACE 4                                                                
**********************  COMMON SMF HEADER  ****************************         
         ERBHDR 72                                                              
         SPACE 3                                                                
**********************  INDIVIDUAL HEADER EXTENSION  ******************         
SMF72HDX  DS   0F       Begin of individual header extension      @C4A          
         SPACE 3                                                                
         LCLC &X                                                  @C1A          
&X       SETC   T'&STYPE                                          @C1A          
         AIF    (&STYPE EQ 3).HDREXT3                             @C1A          
         AIF    (&STYPE EQ 4).HDREXT4                             @C2A          
         AIF    (&STYPE EQ 5).HDREXT5                             @51A          
SMF72WLS  DS   BL4      Offset to workload control section (Subtype 1)          
*                       Offset to performance group/domain control              
*                       section (Subtype 2)                                     
SMF72WLL  DS   BL2      Length of workload control section (Subtype 1)          
*                       Length of performance group/domain control              
*                       section (Subtype 2)                                     
SMF72WLN  DS   BL2      Number of workload control sections                     
*                       Number of performance group/domain control              
*                       sections (Subtype 2)                                    
SMF72PGS  DS   BL4      Offset to performance group period                      
*                       data section (Subtype 1)                                
*                       Offset to performance group/domain                      
*                       data section (Subtype 2)                                
SMF72PGL  DS   BL2      Length of performance group period                      
*                       data section (Subtype 1)                                
*                       Length of performance group/domain                      
*                       data section (Subtype 2)                                
SMF72PGN  DS   BL2      Number of performance group period                      
*                       data section (Subtype 1)                                
*                       Number to performance group/domain                      
*                       data section (Subtype 2)                                
         SPACE 3                                                                
         AIF    ('&X' EQ 'O').HDREXT2                             @B1A          
         AIF    (&STYPE EQ 1).PROSEC                              @B1A          
         AIF    (&STYPE EQ 2).HDREXT2                             @B1A          
         AIF    (&STYPE EQ 3).HDREXT3                             @C1A          
.HDREXT2 ANOP                                                     @B1A          
*                                                                               
SMF72SWS  DS   BL4      Offset to swap reason data section                      
*                       (Subtype 2 only)                          @B1A          
SMF72SWL  DS   BL2      Length of swap reason data section                      
*                       (Subtype 2 only)                          @B1A          
SMF72SWN  DS   BL2      Number of swap reason data sections                     
*                       (Subtype 2 only)                          @B1A          
         SPACE 3                                                                
         AIF    ('&X' EQ 'O').HDREXT3                             @C1A          
         AIF    (&STYPE EQ 1).PROSEC                              @C1A          
         AIF    (&STYPE EQ 2).PROSEC                              @C1A          
.HDREXT3 ANOP                                                     @C1A          
          ORG  SMF72HDX Subtype 3 header extension                @C4A          
SMF723HX  DS   0CL48    Header extension                      @WA05544          
SMF72WMS  DS   BL4      Offset to workload manager control        @C1A          
*                       section (Subtype 3)                       @C1A          
SMF72WML  DS   BL2      Length of workload manager control        @C1A          
*                       section (Subtype 3)                       @C1A          
SMF72WMN  DS   BL2      Number of workload manager control        @C1A          
*                       section (Subtype 3)                       @C1A          
SMF72SSS  DS   BL4      Offset to service class served data       @C1A          
*                       section (Subtype 3)                       @C1A          
SMF72SSL  DS   BL2      Length to service class served data       @C1A          
*                       section (Subtype 3)                       @C1A          
SMF72SSN  DS   BL2      Number of service class served data       @C1A          
*                       sections (Subtype 3)                      @C1A          
SMF72RGS  DS   BL4      Offset to resource group data section     @C1A          
*                       (Subtype 3)                               @C1A          
SMF72RGL  DS   BL2      Length of resource group data section     @C1A          
*                       (Subtype 3)                               @C1A          
SMF72RGN  DS   BL2      Number of resource group data sections    @C1A          
*                       (Subtype 3)                               @C1A          
SMF72SCS  DS   BL4      Offset to period data section (Subtype 3) @J2C          
SMF72SCL  DS   BL2      Length of period data section (Subtype 3) @J2C          
SMF72SCN  DS   BL2      Number of period data sections            @J2C          
*                       (Subtype 3)                               @J2C          
SMF72RTS  DS   BL4      Offset to response time distribution      @C1A          
*                       bucket data section (Subtype 3)           @C1A          
SMF72RTL  DS   BL2      Length of response time distribution      @C1A          
*                       bucket data section (Subtype 3)           @C1A          
SMF72RTN  DS   BL2      Number of response time distribution      @C1A          
*                       bucket data sections (Subtype 3)          @C1A          
SMF72WRS  DS   BL4      Offset to work/resource manager state     @C1A          
*                       (Subtype 3)                               @C1A          
SMF72WRL  DS   BL2      Length of work/resource manager state     @C1A          
*                       (Subtype 3)                               @C1A          
SMF72WRN  DS   BL2      Number of work/resource manager state     @C1A          
*                       (Subtype 3)                               @C1A          
SMF72DNS  DS   BL4      Offset to resource delay names section    @21A          
*                       (Subtype 3)                               @21A          
SMF72DNL  DS   BL2      Length of resource delay names section    @21A          
*                       (Subtype 3)                               @21A          
SMF72DNN  DS   BL2      Number of resource delay names sections   @21A          
*                       (Subtype 3)                               @21A          
         SPACE 3                                                                
         AIF    ('&X' EQ 'O').HDREXT4                             @C2A          
         AIF    (&STYPE EQ 3).PROSEC                              @C2A          
.HDREXT4 ANOP                                                     @C2A          
          ORG  SMF72HDX Subtype 4 header extension                @C4A          
SMF724HX  DS   0CL16    Header extension                      @WA05544          
SMF72CPS  DS   BL4      Offset to service class period data       @C2A          
*                       sections (Subtype 4)                      @C2A          
SMF72CPL  DS   BL2      Length of service class period data       @C2A          
*                       sections (Subtype 4)                      @C2A          
SMF72CPN  DS   BL2      Number of service class period data       @C2A          
*                       sections (Subtype 4)                      @C2A          
SMF72SPS  DS   BL4      Offset to swap reason data                @C2A          
*                       sections (Subtype 4)                      @C2A          
SMF72SPL  DS   BL2      Length of swap reason data                @C2A          
*                       sections (Subtype 4)                      @C2A          
SMF72SPN  DS   BL2      Number of swap reason data                @C2A          
*                       sections (Subtype 4)                      @C2A          
         SPACE 3                                                                
         AIF    ('&X' EQ 'O').HDREXT5                             @51A          
         AIF    (&STYPE EQ 4).PROSEC                              @51A          
.HDREXT5 ANOP                                                     @51A          
          ORG  SMF72HDX Subtype 5 header extension                @51A          
SMF725HX  DS   0CL112   Header extension                          @63C          
SMF72SES  DS   BL4      Offset to serialization control           @51A          
*                       section  (Subtype 5)                      @51A          
SMF72SEL  DS   BL2      Length of serialization control           @51A          
*                       sections (Subtype 5)                      @51A          
SMF72SEN  DS   BL2      Number of serialization control           @51A          
*                       sections (Subtype 5)                      @51A          
SMF72CMS  DS   BL4      Offset to CMS lock data                   @51A          
*                       section  (Subtype 5)                      @51A          
SMF72CML  DS   BL2      Length of CMS lock data                   @51A          
*                       sections (Subtype 5)                      @51A          
SMF72CMN  DS   BL2      Number of CMS lock data                   @51A          
*                       sections (Subtype 5)                      @51A          
SMF72EDS  DS   BL4      Offset to CMS EnqueueDequeue lock data    @51A          
*                       section  (Subtype 5)                      @51A          
SMF72EDL  DS   BL2      Length of CMS EnqueueDequeue lock data    @51A          
*                       sections (Subtype 5)                      @51A          
SMF72EDN  DS   BL2      Number of CMS EnqueueDequeue lock data    @51A          
*                       sections (Subtype 5)                      @51A          
SMF72LAS  DS   BL4      Offset to CMS Latch lock data             @51A          
*                       section  (Subtype 5)                      @51A          
SMF72LAL  DS   BL2      Length of CMS Latch lock data             @51A          
*                       sections (Subtype 5)                      @51A          
SMF72LAN  DS   BL2      Number of CMS Latch lock data             @51A          
*                       sections (Subtype 5)                      @51A          
SMF72SMS  DS   BL4      Offset to CMS SMF lock data               @51A          
*                       section  (Subtype 5)                      @51A          
SMF72SML  DS   BL2      Length of CMS SMF lock data               @51A          
*                       sections (Subtype 5)                      @51A          
SMF72SMN  DS   BL2      Number of CMS SMF lock data               @51A          
*                       sections (Subtype 5)                      @51A          
SMF72LOS  DS   BL4      Offset to Local lock data                 @51A          
*                       section  (Subtype 5)                      @51A          
SMF72LOL  DS   BL2      Length of Local lock data                 @51A          
*                       sections (Subtype 5)                      @51A          
SMF72LON  DS   BL2      Number of Local lock data                 @51A          
*                       sections (Subtype 5)                      @51A          
SMF72COS  DS   BL4      Offset to CML lock Owner data             @51A          
*                       section  (Subtype 5)                      @51A          
SMF72COL  DS   BL2      Length of CML lock Owner data             @51A          
*                       sections (Subtype 5)                      @51A          
SMF72CON  DS   BL2      Number of CML lock Owner data             @51A          
*                       sections (Subtype 5)                      @51A          
SMF72CRS  DS   BL4      Offset to CML lock Requestor data         @51A          
*                       section  (Subtype 5)                      @51A          
SMF72CRL  DS   BL2      Length of CML lock Requestor data         @51A          
*                       sections (Subtype 5)                      @51A          
SMF72CRN  DS   BL2      Number of CML lock Requestor data         @51A          
*                       sections (Subtype 5)                      @51A          
SMF72LCS  DS   BL4      Offset to GRS Latch Set Creator data      @51A          
*                       section  (Subtype 5)                      @51A          
SMF72LCL  DS   BL2      Length of GRS Latch Set Creator data      @51A          
*                       sections (Subtype 5)                      @51A          
SMF72LCN  DS   BL2      Number of GRS Latch Set Creator data      @51A          
*                       sections (Subtype 5)                      @51A          
SMF72LRS  DS   BL4      Offset to GRS Latch Requestor data        @51A          
*                       section  (Subtype 5)                      @51A          
SMF72LRL  DS   BL2      Length of GRS Latch Requestor data        @51A          
*                       sections (Subtype 5)                      @51A          
SMF72LRN  DS   BL2      Number of GRS Latch Requestor data        @51A          
*                       sections (Subtype 5)                      @51A          
SMF72TDS  DS   BL4      Offset to GRS ENQ SCOPE=STEP data         @51A          
*                       section  (Subtype 5)                      @51A          
SMF72TDL  DS   BL2      Length of GRS ENQ SCOPE=STEP data         @51A          
*                       sections (Subtype 5)                      @51A          
SMF72TDN  DS   BL2      Number of GRS ENQ SCOPE=STEP data         @51A          
*                       sections (Subtype 5)                      @51A          
SMF72YDS  DS   BL4      Offset to GRS ENQ SCOPE=SYSTEM data       @51A          
*                       section  (Subtype 5)                      @51A          
SMF72YDL  DS   BL2      Length of GRS ENQ SCOPE=SYSTEM data       @51A          
*                       sections (Subtype 5)                      @51A          
SMF72YDN  DS   BL2      Number of GRS ENQ SCOPE=SYSTEM data       @51A          
*                       sections (Subtype 5)                      @51A          
SMF72SDS  DS   BL4      Offset to GRS ENQ SCOPE=SYSTEMS data      @51A          
*                       section  (Subtype 5)                      @51A          
SMF72SDL  DS   BL2      Length of GRS ENQ SCOPE=SYSTEMS data      @51A          
*                       sections (Subtype 5)                      @51A          
SMF72SDN  DS   BL2      Number of GRS ENQ SCOPE=SYSTEMS data      @51A          
*                       sections (Subtype 5)                      @51A          
SMF72QSS  DS   BL4      Offset to GRS QScan data                  @63A          
*                       section   (Subtype 5)                     @63A          
SMF72QSL  DS   BL2      Length of GRS QScan data                  @63A          
*                       section  (Subtype 5)                      @63A          
SMF72QSN  DS   BL2      Number of GRS QScan data                  @63A          
*                       sections (Subtype 5)                      @63A          
         SPACE 3                                                                
.PROSEC  ANOP                                                     @B1A          
         SPACE 3                                                                
**********************  COMMON RMF PRODUCT SECTION  *******************         
         ERBPRO 72                                                              
         SPACE 3                                                                
*                                                                               
*                                                                 @B1D          
         AIF    ('&X' EQ 'O').SUBTYP1                             @W1A          
         AIF    (&STYPE EQ 1).SUBTYP1                             @W1A          
         AIF    (&STYPE EQ 2).SUBTYP2                             @W1A          
         AIF    (&STYPE EQ 3).SUBTYP3                             @C1A          
         AIF    (&STYPE EQ 4).SUBTYP4                             @C2A          
         AIF    (&STYPE EQ 5).SUBTYP5                             @51A          
.SUBTYP1 ANOP                                                     @W1A          
**********************  Control Section for Subtype I  ****************         
**********************  WORKLOAD CONTROL SECTION  *********************         
SMF72CTL DSECT                                                                  
SMF72FG1  DS   BL1      FLAGS                                                   
*                       Reserved                                 @F1C           
SMF72OVE  EQU  X'10'    WLM I/O Priority Management = YES        @F1A           
SMF72CAA  EQU  X'08'    RCAA data not available -                @C1A           
*                       RC 08 RSN 0831 from IWMRCOLL             @C1A           
SMF72ACN  EQU  X'04'    ACCOUNT INFORMATION                      @R0A           
SMF72RPT  EQU  X'02'    REPORT CLASS                                            
SMF72CHF  EQU  X'01'    CHANGE TO PERFORMANCE SENSITIVE                         
*                       VARIABLE WAS MADE                                       
SMF72RV3  DS   BL1      RESERVED                                                
SMF72SUB  DS   BL2      SUB-CATEGORY CODE,PERF.GROUP #                          
SMF72HPG  DS   BL2      HIGHEST PERF GROUP(PG) # DEFINED IN IPS                 
SMF72IPS  DS   CL8      NAME OF INSTALLATION PERF SPEC                          
          DS   CL3      Reserved                                 @A2C           
          DS   CL3      Reserved                                 @A2C           
SMF72ERF  DS   CL6      ERV RESOURCE MANAGER COEFFICIENT                        
SMF72ISD  DS   CL4      IOC SERVICE DEFINITION COEFFICIENT                      
SMF72CSD  DS   CL4      CPU SERVICE DEFINITION COEFFICIENT                      
SMF72RV4  DS   CL4      RESERVED SINCE RMF 4.2.0                                
SMF72SSD  DS   CL4      SRB SERVICE DEFINITION COEFFICIENT                      
SMF72OPT  DS   CL8      NAME OF OPT                                             
SMF72ICS  DS   CL8      NAME OF ICS                                             
SMF72SYS  DS   CL4      SUBSYSTEM FOR THIS PGN                                  
SMF72CLS  DS   CL10     CLASS                                                   
SMF72USR  DS   CL10     USER ID                                                 
SMF72NAM  DS   CL10     TRANSACTION NAME FOR THIS PGN                           
SMF72ADJ  DS   F        VALUE RMCTADJC - ADJ. FACTOR FOR CPU RATE @P1A          
SMF72MSD  DS   CL8      MSO SERVICE DEFINITION COEFFICIENT        @Y1A          
SMF72SRV  DS   CL10     Service class (SRVCLASS) as specified in  @C3A          
*                       ICSMSRVC                                  @C3A          
SMF72RV5  DS   BL2      Reserved                                  @C3A          
          SPACE 3                                                               
*************  PERF.GROUP PERIOD DATA SECTION  ************************         
SMF72WKL  DSECT                                                                 
SMF72PGP  DS   0C       Period data                           @WA05544          
SMF72TTX  DS   BL4      # OF TERMINATED TRANSACTIONS                            
SMF72ACT  DS   BL4      ALL TRANSACTIONS ACTIVE TIME-1K MIC SEC                 
SMF72SER  DS   BL4      ALL TRANSACTIONS SERVICE UNITS                          
SMF72TTM  DS   BL4      TERM TRANS ELAPSED TIME-1K MIC SEC                      
          DS   BL4      Now reserved (was WLL up to 4.2.0)        @A2A          
SMF72MTS  DS   BL4      MSO TOTAL SERVICE                                       
SMF72ITS  DS   BL4      I/O TOTAL SERVICE                                       
SMF72CTS  DS   BL4      CPU TOTAL SERVICE                                       
SMF72TAT  DS   BL4      TRANSACTION ACTIVE TIME IN STORAGE                      
SMF72SPP  DS   BL4      NO. SWAPS IN PERIOD                                     
SMF72CDN  DS   BL2      CURRENT DOMAIN NUMBER                                   
          DS   BL1      Reserved                                  @A2C          
SMF72TSG  DS   BL1      TIME SLICE GROUP NUMBER                                 
SMF72STS  DS   BL4      SRB TOTAL SERVICE                                       
SMF72ETS  DS   0BL8     SUM OF SQUARES OF ENDED TRANS(8 BYTE-INT)               
SMF72ET1  DS   BL4      WORD1-SUM OF SQUARES OF ENDED TRANS                     
SMF72ET2  DS   BL4      WORD2-SUM OF SQUARES OF ENDED TRANS                     
SMF72PIN  DS   BL4      NUMBER OF PAGE-INS                    @YA04880          
SMF72FRS  DS   0BL8     ACTIVE FRAME TIME (8 BYTE-INT)        @WA05544          
SMF72FT1  DS   BL4      WORD1-ACTIVE FRAME-TIME               @YA04880          
SMF72FT2  DS   BL4      WORD2-ACTIVE FRAME-TIME               @YA04880          
SMF72HIN  DS   BL4      Number of hiperspace page-ins             @W2A          
SMF72HRM  DS   BL4      Number of hiperspace read misses          @W2A          
SMF72BPI  DS   BL4      Number of blocked pages paged in          @A2A          
SMF72PIE  DS   BL4      Single pages in from exp. incl. 1st page  @A2A          
SMF72BPE  DS   BL4      Blocked pages in from exp. excl. 1st page @A2A          
SMF72BKA  DS   BL4      Number of blocks paged in from AUX        @A2A          
SMF72BKE  DS   BL4      Number of blocks paged in from expanded   @A2A          
SMF72ERS  DS   0B       Expanded storage frame residency time     @A2A          
*                       Units: 1024 microseconds                                
SMF72ER1  DS   BL4         High order word                        @A2A          
SMF72ER2  DS   BL4         Low  order word                        @A2A          
SMF72RCT  DS   BL4      Region Control Task time                  @A2A          
*                       Units: Microseconds                                     
SMF72IIT  DS   BL4      I/O interrupt processing time             @A2A          
*                       Units: Microseconds                                     
SMF72HST  DS   BL4      Hiperspace service time                   @A2A          
*                       Units: Microseconds                                     
SMF72TST  DS   BL4      Total system transaction time             @A1A          
*                       Units: 1024 microseconds                                
SMF72VEL  DS   0D       Execution velocity data                   @C1A          
SMF72CUS  DS   BL4      CPU using samples. These are included in                
*                       SMF72TOU.                                 @E1C          
SMF72TOT  DS   BL4      Total delay samples used in SRM's                       
*                       execution velocity calculation. With WLM's              
*                       I/O support, this also includes I/O delay               
*                       samples, if SMF72OVE = true               @F1C          
SMF72SRS  DS   CL8      Total shared page residency time                        
*                       (1024 microseconds)                                     
*                       Format: long floating point               @D1A          
SMF72SPA  DS   CL8      Total shared page-ins from auxiliary storage            
*                       Format: long floating point               @D1A          
SMF72SPE  DS   CL8      Total shared page-ins from expanded storage             
*                       Format: long floating point               @D1A          
SMF72ICT  DS   CL8      Total DASD I/O connect time in 128 microsecond          
*                       units. (long floating point)              @E1A          
SMF72IWT  DS   CL8      Total DASD I/O wait time (queue time + pending          
*                       time in 128 microsecond units.) This field              
*                       does not include IOS queue time.                        
*                       (long floating point)                     @E1A          
SMF72IDT  DS   CL8      Total DASD I/O disconnect time in                       
*                       in 128 microsecond units.                               
*                       (long floating point)                     @E1A          
SMF72IRC  DS   F        Total DASD I/O count. This can be used with             
*                       the above fields (SMF72ICT, SMF72IWT, and               
*                       SMF72IDT) to determine the average DASD                 
*                       response time for the period              @E1A          
SMF72TOU  DS   F        Total usings. Velocity should be calculated             
*                       as SMF72TOU/(SMF72TOU+SMF72TOT).          @E1A          
SMF72IOU  DS   F        Total I/O usings. These are included in                 
*                       SMF72TOU. Only non paging DASD I/O can                  
*                       contribute to I/O using                   @E1A          
SMF72NDI  DS   F        Non DASD I/O using or delay               @E1A          
SMF72IOD  DS   F        Total I/O delays.                         @F1A          
SMF72TSA  DS   CL8      Total execution samples. It is the sum of               
*                       RCAETOTU, RCAETOTD, RCAEUNKN, and RCAEIDLE.             
*                       Also always includes I/O using/delay samples            
*                       whether or not I/O samples are included in              
*                       RCAETOTU or RCAETOTD, respectively.                     
*                       (long floating point)                     @F1A          
SMF72IOT  DS   CL8      Total DASD IOS queue time in 128 microsecond            
*                       units (long floating point)               @F1A          
SMF72QDT  DS   BL4      Total queue delay time. For batch jobs this             
*                       is the time jobs spent on the job queue while           
*                       eligible to run on some system. It represents           
*                       the time the jobs spent waiting for an                  
*                       initiator. For TSO users, this time can be a            
*                       portion of the LOGON process. For APPC this             
*                       is the time an APPC request spends on an APPC           
*                       queue. (1024 microsecond units)           @F1A          
SMF72ADT  DS   BL4      Total time batch jobs were ineligible to run            
*                       because a resource the job had affinity to              
*                       was unavailable. Only applies to batch work.            
*                       Zero for other work types. (1024 microsecond            
*                       units)                                    @F1A          
SMF72CVT  DS   BL4      Total time batch jobs spent in JCL conversion.          
*                       Only applies to batch work. Zero for other              
*                       work types. (1024 microsecond units)      @F1A          
SMF72IQT  DS   BL4      Total time batch jobs spend on job queue                
*                       (after JCL conversion) while ineligible to              
*                       run on any system for reasons other than                
*                       resource affinities. Only applies to batch              
*                       work. Zero for other work types.                        
*                       (1024 microsecond units)                  @F1A          
SMF72IEA  DS   BL4      Independent enclave total transaction active            
*                       time (in 1024 microsecond units) for enclaves           
*                       that originated on this system.           @I1A          
SMF72XEA  DS   BL4      Exported enclave total transaction active               
*                       time (in 1024 microsecond units).         @I1A          
SMF72FEA  DS   BL4      Foreign enclave total transaction active time           
*                       (in 1024 microsecond units).              @I1A          
          SPACE 3                                                               
          AIF  ('&X' EQ 'O').SUBTYP2                          @YA18672          
          MEXIT                                                   @W1A          
.SUBTYP2  ANOP                                                    @W1A          
**********************  Control Section for Subtype II  ***************         
**********************  Workload Control Section  *********************         
R722WKL  DSECT                                                    @W1A          
R722TSR   DS   BL2      Total number of small records in interval @W1A          
          DS   BL2      Reserved for future use                   @W1A          
R722TOT   DS   BL4      Total number of data sections in interval @W1A          
R722NXT   DS   BL4      Number of data sections in following      @W1A          
*                       records                                                 
R722IPS   DS   CL8      Name of IPS                               @W1A          
          SPACE 3                                                               
**********************  Data Section  *********************************         
R722DATA DSECT                                                    @W1A          
R722PG    DS   BL2      Performance group number                  @W1A          
R722DMN   DS   BL2      Domain number                             @W1A          
R722CLR   DS   0C       Overdefinition                        @WA05544          
R722USER  DS   BL4      Sum of all users found                    @W1A          
R722ACTV  DS   BL4      Sum of all active users found             @W1A          
R722PAGE  DS   BL4      Sum of all users delayed for paging                     
*                       at all samples.                           @B1C          
R722SWAP  DS   BL4      Sum of all users delayed for swapping                   
*                       at all samples.                           @B1C          
R722OUTR  DS   BL4      Sum of all out and ready users                          
*                       at all samples.                           @B1C          
R722ACTF  DS   BL4      Sum of all active frames.                 @B1C          
*                       This field contains X'7FFFFFFF' if the                  
*                       value will not fit in the field.                        
*                       The field R722ACFF contains the value in                
*                       floating point.                                         
R722ACTS  DS   BL4      Sum of all active samples (except OUTR)   @W1A          
R722IDLE  DS   BL4      Sum of all idle frames.                   @B1C          
*                       This field contains X'7FFFFFFF' if the                  
*                       value will not fit in the field.                        
*                       The field R722IDLF contains the value in                
*                       floating point.                                         
R722IDLS  DS   BL4      Sum of all idle samples                   @W1A          
R722PGIN  DS   BL4      Sum of all page-ins                       @W1A          
R722SLOT  DS   BL4      Sum of all slots used                     @B1C          
*                       This field contains X'7FFFFFFF' if the                  
*                       value will not fit in the field.                        
*                       The field R722SLTF contains the value in                
*                       floating point.                                         
R722DIV   DS   BL4      Sum of all DIV frames                     @B1C          
*                       This field contains X'7FFFFFFF' if the                  
*                       value will not fit in the field.                        
*                       The field R722DIVF contains the value in                
*                       floating point.                                         
R722DIVS  DS   BL4      Sum of all DIV samples                    @W1A          
R722FIX   DS   BL4      Sum of all fixed frames                   @B1C          
*                       This field contains X'7FFFFFFF' if the                  
*                       value will not fit in the field.                        
*                       The field R722FIXF contains the value in                
*                       floating point.                                         
R722ET    DS   BL8      Total elapsed time for all transactions                 
*                       that ended in the group. Does not include               
*                       queued time.                              @B1A          
R722QT    DS   BL8      Total time spent on JES or APPC queues by               
*                       all transactions that ended in the group. @B1A          
R722END   DS   BL4      The number of transactions that ended in                
*                       the group.                                @B1A          
R722UPRO  DS   BL4      Total processor using samples for the group             
*                                                                 @B1A          
R722UDEV  DS   BL4      Total device using samples for the group  @B1A          
R722DPRO  DS   BL4      Total processor delay samples for the group             
*                                                                 @B1A          
R722DDEV  DS   BL4      Total device delay samples for the group  @B1A          
R722DSTO  DS   BL4      Total storage delay samples for the group @B1A          
R722DJES  DS   BL4      Total JES delay samples for the group     @B1A          
R722DHSM  DS   BL4      Total HSM delay samples for the group     @B1A          
R722DXCF  DS   BL4      Total XCF delay samples for the group     @B1A          
R722DENQ  DS   BL4      Total ENQ delay samples for the group     @B1A          
R722DMNT  DS   BL4      Total mount delay samples for the group   @B1A          
R722DMSG  DS   BL4      Total message delay samples for the group @B1A          
R722UNKN  DS   BL4      Total unknown state samples for the group @B1A          
R722VALD  DS   BL4      Total valid samples for the group                       
*                       (single state sum of all using, delay,                  
*                       idle and unknown)                         @B1A          
R722LSCT  DS   BL4      Count of "long" logical swaps for the group             
*                                                                 @B1A          
R722ESCT  DS   BL4      Count of "long" swaps to expanded storage               
*                       for the group                             @B1A          
R722PSCT  DS   BL4      Count of "long" physical swaps for the group            
R722LSCF  DS   BL4      Sum of all central frames for all logically             
*                       swapped users at all samples.                           
*                       Floating point.                           @B1A          
R722LSEF  DS   BL4      Sum of all expanded frames for all logically            
*                       swapped users at all samples.                           
*                       Floating point.                           @B1A          
R722LSSA  DS   BL4      Total logically swapped samples for the group           
*                                                                 @B1A          
R722PSEF  DS   BL4      Sum of all expanded frames for all swapped              
*                       users (except logical) at all samples.                  
*                       Floating point.                           @B1A          
R722PSSA  DS   BL4      Total swapped samples for the group                     
*                       (except logical)                          @B1A          
R722VECT  DS   BL4      Total vector utilization time for the group             
*                                                                 @B1A          
R722ACFF  DS   BL4      Sum of all active frames.                               
*                       Floating point.                           @B1A          
R722IDLF  DS   BL4      Sum of all idle frames.                                 
*                       Floating point.                           @B1A          
R722SLTF  DS   BL4      Sum of all slots used                                   
*                       Floating point.                           @B1A          
R722DIVF  DS   BL4      Sum of all DIV frames.                                  
*                       Floating point.                           @B1A          
R722FIXF  DS   BL4      Sum of all fixed frames.                                
*                       Floating point.                           @B1A          
R722TSV   DS   CL8      Sum of shared page views                                
*                       Format: long floating point               @D1A          
R722VIN   DS   CL8      Sum of shared pages in central storage, that            
*                       are valid                                               
*                       Format: long floating point               @D1A          
R722VLC   DS   CL8      Sum of shared page validations                          
*                       Format: long floating point               @D1A          
R722GPI   DS   CL8      Sum of shared page-ins from auxiliary storage           
*                       Format: long floating point               @D1A          
          SPACE 3                                                               
**********************  Swap reason data section  *********************         
R722SWRE DSECT                                                    @B1A          
R722OR1   DS   BL4      STOR/OUTR delay samples for swap reason 1:              
*                       Terminal output wait                  @WA01699          
R722OR2   DS   BL4      STOR/OUTR delay samples for swap reason 2:              
*                       Terminal input wait                   @WA01699          
R722OR3   DS   BL4      STOR/OUTR delay samples for swap reason 3:              
*                       Long wait                                 @B1A          
R722OR4   DS   BL4      STOR/OUTR delay samples for swap reason 4:              
*                       Auxiliary storage shortage                @B1A          
R722OR5   DS   BL4      STOR/OUTR delay samples for swap reason 5:              
*                       Real storage shortage                     @B1A          
R722OR6   DS   BL4      STOR/OUTR delay samples for swap reason 6:              
*                       Detected long wait                        @B1A          
R722OR7   DS   BL4      STOR/OUTR delay samples for swap reason 7:              
*                       Requested swap                            @B1A          
R722OR8   DS   BL4      STOR/OUTR delay samples for swap reason 8:              
*                       Enqueue exchange swap                     @B1A          
R722OR9   DS   BL4      STOR/OUTR delay samples for swap reason 9:              
*                       Exchange swap                             @B1A          
R722OR10  DS   BL4      STOR/OUTR delay samples for swap reason 10:             
*                       Unilateral swap                           @B1A          
R722OR11  DS   BL4      STOR/OUTR delay samples for swap reason 11:             
*                       Transition swap                           @B1A          
R722OR12  DS   BL4      STOR/OUTR delay samples for swap reason 12:             
*                       Improve central storage usage             @B1A          
R722OR13  DS   BL4      STOR/OUTR delay samples for swap reason 13:             
*                       Improve system paging rate                @B1A          
R722OR14  DS   BL4      STOR/OUTR delay samples for swap reason 14:             
*                       Make room for an out too long user        @B1A          
R722OR15  DS   BL4      STOR/OUTR delay samples for swap reason 15:             
*                       APPC wait                                 @B1A          
R722OR16  DS   BL4      STOR/OUTR delay samples for swap reason 16:             
*                       OMVS input wait                           @B2A          
R722OR17  DS   BL4      STOR/OUTR delay samples for swap reason 17:             
*                       OMVS output wait                          @B2A          
R722OR18  DS   BL4      STOR/OUTR delay samples for swap reason 18:             
*                       In-real swap                              @J3A          
          SPACE 3                                                               
          AIF  ('&X' EQ 'O').SUBTYP3                              @C1A          
          MEXIT                                                   @C1A          
          SPACE 3                                                               
.SUBTYP3  ANOP                                                    @C1A          
**********************  Subtype III Data Sections  ********************         
**********************  Workload Manager Control Section  *************         
          SPACE 3                                                               
R723WMS  DSECT                                                    @C1A          
R723MSCF  DS   BL1      Service class flags                       @C1A          
R723MRCL  EQU  X'80'    This is a report class (RCAARCL)          @C1A          
R723MCAA  EQU  X'40'    RCAA data not available                   @C1A          
*                       RC 08/RSN 0831 from IWMRCOLL              @C1A          
R723MPOL  EQU  X'20'    SVPOL data not available                  @C1A          
R723MOVE  EQU  X'10'    System is calculating velocity using      @E2A          
*                       I/O delays.                               @E2A          
R723MCPP  EQU  X'08'    Indicator for CPU protection              @I2A          
R723MSTP  EQU  X'04'    Indicator for Storage protection          @I2A          
R723MDAT  EQU  X'02'    Indicator for dynamic alias management    @I2A          
R723MIPG  EQU  X'01'    Indicator for I/O priority group HIGH     @64A          
R723MFLG  DS   BL1      Flags                                     @K2A          
R723MICO  EQU  X'80'    Indicator for zAAP (IFA) crossover        @K2A          
R723MHPO  EQU  X'40'    Indicator for zAAP (IFA) honor priority   @K2A          
R723MHPZ  EQU  X'20'    Indicator for zIIP honor priority         @12A          
R723HISF  EQU  X'10'    Failure returned by HISMT service.        @71A          
*                       Multithreading maximum capacity           @71A          
*                       numerator values are invalid.             @71A          
R723MNHP  EQU  X'08'    Indicates ineligibility for honor priority.             
*                       When ON, specialty engine eligible work                 
*                       in this service class is not offloaded                  
*                       to CPs for help processing                @83A          
R723MTRC  EQU  X'04'    Indicator for a tenant report class       @91A          
R723MDIS  EQU  X'02'    Service class and tenant report class                   
*                       periods that are associated with a resource             
*                       group and have assigned a discretionary goal            
*                       are excluded from workload management     @91A          
R723MFL2  DS   BL1      Additional flags                          @92A          
R723MAPO  EQU  X'80'    At least one zAAP online in sysplex (or local           
*                       system when not joined to a sysplex)      @92A          
R723MCBO  EQU  X'40'    Reserved for future use                   @93C          
R723MRS2  DS   BL1      Reserved                                  @92C          
R723MNSP  DS   CL8      Service policy name                       @C1A          
R723MDSP  DS   CL32     Service policy description                @C1A          
R723MTPA  DS   CL8      Local time/date (STCK format) of policy   @C1A          
*                       activation                                @C1A          
R723MCPU  DS   BL4      System pre-set CPU service coefficient   @A04C          
*                       (CPU = 1 * 10000)                        @A04A          
*                       The number by which accumulated CPU       @C1A          
*                       service units will be multiplied          @C1A          
*                       (weighted)                            @OA62081          
R723MIOC  DS   BL4      System pre-set I/O service coefficient   @A04C          
*                       (IOC=0)                                  @A04A          
R723MMSO  DS   BL4      System pre-set storage service           @A04C          
*                       coefficient (MSO=0)                      @A04A          
R723MSRB  DS   BL4      System pre-set SRB service coefficient   @A04C          
*                       (SRB = 1 * 10000)                        @A04A          
*                       The number by which accumulated SRB       @C1A          
*                       service units will be multiplied          @C1A          
*                       (weighted)                            @OA62081          
R723MTVL  DS   BL4      Current sample interval (in milliseconds) @C1A          
*                       This is the frequency with which WLM      @C1A          
*                       samples delays reported in the RCAA       @C1A          
R723MTV#  DS   BL4      Total number of times WLM sampling code   @C1A          
*                       ran.  RMF issuing successive calls to     @C1A          
*                       IWMRCOLL should not assume that WLM       @C1A          
*                       sampling code ran at the interval         @C1A          
*                       specified by R723MTVL between its calls.  @C1A          
*                       This field can be used to translate       @C1A          
*                       sampled state data into actual percentage @C1A          
*                       of time                                   @C1A          
R723MOPT  DS   CL2      OPT member suffix (from RCAAOPT)          @C1A          
R723MRS3  DS   CL2      Reserved                                  @C1A          
R723MWNM  DS   CL8      Workload group name                       @C1A          
R723MWDE  DS   CL32     Workload group description                @C1A          
R723MCNM  DS   CL8      Service/Report class name                 @C1A          
R723MCDE  DS   CL32     Service/Report class description          @C1A          
R723MCPG  DS   BL2      Number of periods belonging to this       @J2C          
*                       service or report class                   @J2C          
R723MSUB  DS   BL1      Number of entries belonging to a          @C1A          
*                       subsystem. (See R723MSEC for current      @C1A          
*                       release value).                           @C1A          
R723MRS4  DS   BL3      Reserved                                  @C1A          
R723MERF  DS   CL6      ERV resource factor coefficient           @C1A          
*                       (from RMPTOPE)                            @C1A          
R723MADJ  DS   F        Value of RMCTADJC - adjustment factor     @C1A          
*                       for CPU rate                              @C1A          
R723MIDN  DS   CL8      Service definition name                   @C1A          
R723MIDD  DS   CL32     Service definition description            @C1A          
R723MTDI  DS   CL8      Local time/date (STCK format) the service @C1A          
*                       definition was installed                  @C1A          
R723MIDU  DS   CL8      Userid that installed the service         @C1A          
*                       definition                                @C1A          
R723CLSC  DS   CL8      Service class that last contributed to    @J2A          
*                       this report class. Blank if this is a     @J2A          
*                       service class.                            @J2A          
R723NFFCBP DS 0F        Reserved for future use                   @93C          
R723NFFI  DS   F        Normalization factor for zAAP (IFA). Multiply           
*                       zAAP service times or service units with this           
*                       value and divide by 256 to calculate the CP             
*                       equivalent value                          @93C          
R723NFFS  DS   F        Normalization factor for zIIP. Multiply zIIP            
*                       service units with this value and divide by             
*                       256 to calculate the CP equivalent value.               
*                                                             @OA13499          
R723NADJ  DS   F        Nominal adjustment factor for CPU rate                  
*                                                             @OA29530          
R723CECA  DS   F        CEC adjustment factor                     @42A          
R723MCF   DS   F        Multithreading maximum capacity numerator               
*                       for general purpose processors. Divide this             
*                       value by 1024 to get the multithreading                 
*                       maximum capacity factor for all general                 
*                       purpose processors that were configured                 
*                       ONLINE for the complete interval.         @71A          
R723MCFS  DS   F        Multithreading maximum capacity numerator               
*                       for zIIP. Divide this value by 1024 to get              
*                       the multithreading maximum capacity factor              
*                       for all zIIPs that were configured ONLINE               
*                       for the complete interval.                              
*                       A zero value is reported if no                          
*                       zIIP is currently installed.              @71A          
R723MCFI  DS   F        Multithreading maximum capacity numerator               
*                       for zAAP. Divide this value by 1024 to get              
*                       the multithreading maximum capacity factor              
*                       for all zAAPs that were configured ONLINE               
*                       for the complete interval.                              
*                       A zero value is reported if no                          
*                       zAAP is currently installed.              @71A          
R723CPA_actual DS    F                                                          
*                       Physical CPU adjustment factor based on                 
*                       Model Capacity Rating.                    @91A          
R723CPA_scaling_factor DS    F                                                  
*                       Scaling factor for R723CPA_actual and                   
*                       R723CPA_actual_zCBP                       @92C          
R723CPA_actual_zCBP DS    F  Reserved for future use              @93C          
R723MSEC  EQU  2        Number (constant) of entries belonging to @C1A          
*                       a subsystem. In RMF510 this number is 2.  @C1A          
*                       This number is kept in R723MSUB.          @C1A          
          SPACE 3                                                               
**********************  Service Classes being served  *****************         
          SPACE 3                                                               
R723SSS  DSECT          Service classes being served by one or    @C1A          
*                       more AS in service class R723MCNM         @C1A          
R723SCSN  DS   CL8      Name of service class being served        @C1A          
R723SCS#  DS   BL4      Number of times an AS running with this   @C1A          
*                       service class (R723MCNM) served service   @C1A          
*                       class (R723SCSN)                          @C1A          
          SPACE 3                                                               
**********************  Resource Group Data Section  ******************         
          SPACE 3                                                               
R723RGS  DSECT                                                    @C1A          
R723GGNM  DS   CL8      Resource group name                       @C1A          
R723GGDE  DS   CL32     Resource group description                @C1A          
R723GGLT  DS   BL1      Resource group flag bits                  @C1A          
R723GMXS  EQU  X'80'    Maximum capacity was specified            @C1A          
R723GMNS  EQU  X'40'    Minimum capacity was specified            @C1A          
R723GGPV  EQU  X'20'    Specification of R723GGMN and R723GGMX is               
*                       in percentage of the LPAR share rather                  
*                       than in service units. In addition, the                 
*                       scope of the resource group is system-wide              
*                       rather than sysplex-wide.                 @03A          
R723GGPC  EQU  X'10'    Specification of R723GGMN and R723GGMX is               
*                       in percentage of a single processor capacity            
*                       rather than in service units. In addition,              
*                       the scope of the resource group is                      
*                       system-wide rather than sysplex-wide      @03A          
R723GMLS  EQU  X'08'    Memory limit was specified                @83A          
R723GGMS  EQU  X'04'    Specification of R723GGMN and R723GGMX is               
*                       in MSU/h rather than in service units     @91A          
R723GISP  EQU  X'02'    Specialty processor consumption is included             
*                       into the WLM capping algorithms, i.e.                   
*                       R723GGMN and R723GGMX limit the combined                
*                       general purpose and specialty processor                 
*                       consumption                               @91A          
R723GRS1  EQU  X'01'    Reserved                                  @91C          
R723GGTF  DS   BL1      Tenant resource group flags               @91A          
R723GTRG  EQU  X'80'    Indicator for a tenant resource group     @91A          
R723GCBP  EQU  X'40'    Reserved for future use                   @93C          
R723GRS2  DS   BL2      Reserved                                  @91C          
R723GGMN  DS   F        If R723GMNS is ON, minimum capacity of the              
*                       resource group. If R723GGPV, R723GGPC and               
*                       R723GGMS are OFF, this value is in unweighted           
*                       CPU service units per second. In addition, the          
*                       scope of the resource group is sysplex-wide.            
*                       If R723GGPV, R723GGPC or R723GGMS is ON, see            
*                       description of R723GGLT               @OA62081          
R723GGMX  DS   F        If R723GMXS is ON, maximum capacity of the              
*                       resource group. If R723GGPV, R723GGPC and               
*                       R723GGMS are OFF, this value is in unweighted           
*                       CPU service units per second. In addition, the          
*                       scope of the resource group is sysplex-wide.            
*                       If R723GGPV, R723GGPC or R723GGMS is ON, see            
*                       description of R723GGLT               @OA62081          
R723GGML  DS   F        If R723GMLS is ON, memory limit of the                  
*                       resource group                        @OA50760          
R723GGTI  DS   CL8      Tenant identifier. Only valid if R723GTRG               
*                       is ON                                     @91A          
R723GGTN  DS   CL32     Tenant name. Only valid if R723GTRG is ON @91A          
R723GGKY  DS   CL64     Solution identifier. Only valid if R723GTRG             
*                       is ON                                     @91A          
          SPACE 3                                                               
**********************  Service or Report Class Period ***************          
          SPACE 3                                                               
R723SCS  DSECT                                                    @C1A          
R723CRTX  DS   BL2      Index into the response time distribution @C1A          
*                       bucket. Entry 0 represents the            @C1A          
*                       distribution map                          @C1A          
R723CWMX  DS   BL2      Index into the work/resource manager      @C1A          
*                       states area                               @C1A          
R723CWMN  DS   BL2      Number of entries in the work/resource    @C1A          
*                       manager states area associated with this  @C1A          
*                       service class period (R723CWMX points to  @C1A          
*                       the first entry)                          @C1A          
R723CRS1  DS   BL1      Report class period flags                 @J2C          
R723CRPH  EQU  X'80'    This report class period is heterogeneous @J2A          
R723CRS6  EQU  X'7F'    Reserved                                  @J2A          
R723CADF  DS   BL1      Actuals data section flag                 @C1A          
R723CRCA  EQU  X'80'    Resource consumption data actuals         @C1A          
*                       (R723CRCD) are available                  @C1A          
R723CRTA  EQU  X'40'    Response time data actuals (R723CRTD) are @C1A          
*                       available                                 @C1A          
R723CEDA  EQU  X'20'    General execution delay data actuals      @C1A          
*                       (R723CGDE) are available                  @C1A          
R723CRS5  EQU  X'1F'    Reserved                                  @C1A          
          SPACE 3                                                               
**********************  GOALS ****************************************          
          SPACE 3                                                               
R723COAL  DS   0C       Period goals.                             @J2C          
*                       For a report class period, these are the  @J2A          
*                       goals of the service class period that    @J2A          
*                       last contributed to this report class     @J2A          
*                       period. For homogeneous report class      @J2A          
*                       period, this goal must be used to format  @J2A          
*                       the response time distribution.           @J2A          
R723CPER  DS   BL1      Period number                             @J2C          
R723CRTF  DS   BL1      Response time flags                       @C1A          
R723CMIL  EQU  X'80'    Response time specified in milliseconds   @C1A          
R723CSEC  EQU  X'40'    Response time specified in seconds        @C1A          
R723CMIN  EQU  X'20'    Response time specified in minutes        @C1A          
R723CHOU  EQU  X'10'    Response time specified in hours          @C1A          
R723CRS2  EQU  X'0F'    Reserved                                  @C1A          
R723CRGF  DS   BL1      Response time goal flags                  @C1A          
R723CPRC  EQU  X'80'    Percentile response time goal             @C1A          
R723CAVG  EQU  X'40'    Average response time goal                @C1A          
R723CVEL  EQU  X'20'    Execution velocity goal                   @C1A          
R723CDSC  EQU  X'10'    Discretionary goal                        @C1A          
R723CSTM  EQU  X'08'    System specified goal                     @C1A          
R723CRS3  EQU  X'07'    Reserved                                  @C1A          
R723CRS4  DS   BL1      Reserved                                  @C1A          
R723CVAL  DS   BL4      Response time goal - or                   @C1A          
*                       Execution velocity goal - or zero if      @C1A          
*                       discretionary, system, or no goal         @C1A          
R723CPCT  DS   BL2      Goal percentile value                     @C1A          
R723CIMP  DS   BL2      Relative importance of the goal to be     @C1A          
*                       achieved for this service class period    @C1A          
*                       (1=highest - 5=lowest)                    @C1A          
R723CDUR  DS   BL4      Service class period duration in service  @C1A          
*                       units, or zero for last period            @C1A          
          SPACE 3                                                               
**********************  Resource Data - ACTUALS **********************          
          SPACE 3                                                               
R723CRCD  DS   0D       Srv/Rep class period resource data. All   @J2C          
*                       service units are weighted by the         @C1A          
*                       coefficients in the active policy         @C1A          
          DS   0D                                                 @C1A          
R723CSRV  DS   CL8      Total service units                       @C1A          
*                       (floating point 64-bit long format)       @C1A          
R723CCPU  DS   CL8      Total CPU service units                   @C1A          
*                       (floating point 64-bit long format)       @C1A          
R723CIOC  DS   CL8      Total I/O service units                   @C1A          
*                       (floating point 64-bit long format)       @C1A          
R723CMSO  DS   CL8      Total storage service units               @C1A          
*                       (floating point 64-bit long format)       @C1A          
R723CSRB  DS   CL8      Total SRB service units                   @C1A          
*                       (floating point 64-bit long format)       @C1A          
R723CPIR  DS   CL8      Total page-in count                       @C1A          
*                       (floating point 64-bit long format)       @C1A          
R723CHPI  DS   CL8      Total hiperspace page-in count            @C1A          
*                       (floating point 64-bit long format)       @C1A          
R723CBPI  DS   CL8      Total block page-in from aux count        @C1A          
*                       (floating point 64-bit long format)       @C1A          
R723CPIE  DS   CL8      Total page-in from expanded count         @C1A          
*                       (floating point 64-bit long format)       @C1A          
R723CBPE  DS   CL8      Total block page-in from expanded count   @C1A          
*                       (floating point 64-bit long format)       @C1A          
R723CBKA  DS   CL8      Total aux blocks paged in                 @C1A          
*                       (floating point 64-bit long format)       @C1A          
R723CBKE  DS   CL8      Total expanded blocks paged in            @C1A          
*                       (floating point 64-bit long format)       @C1A          
R723CPRS  DS   CL8      Total Page residency time                 @C1A          
*                             (1024 microseconds)                 @C1A          
*                       (floating point 64-bit long format)       @C1A          
R723CERS  DS   CL8      Total Expanded page residency time        @C1A          
*                             (1024 microseconds)                 @C1A          
*                       (floating point 64-bit long format)       @C1A          
R723CTRR  DS   CL8      Total in storage residency time           @C1A          
*                       (floating point 64-bit long format)       @C1A          
R723CTAT  DS   CL8      Total transaction active time             @C1A          
*                             (1024 microseconds)                 @C1A          
*                       (floating point 64-bit long format)       @C1A          
R723CRCT  DS   CL8      Total RCT time (microseconds)             @C1A          
*                       (floating point 64-bit long format)       @C1A          
R723CIIT  DS   CL8      Total I/O interrupt time (microseconds)   @C1A          
*                       (floating point 64-bit long format)       @C1A          
R723CHST  DS   CL8      Total hiperspace service time             @C1A          
*                       (microseconds)                            @C1A          
*                       (floating point 64-bit long format)       @C1A          
R723CSWC  DS   F        Total swap count                          @C1A          
R723CCRM  DS   F        Total hiperspace eso read miss count      @C1A          
          SPACE 3                                                               
**********************  Response Time Data - ACTUALS  ****************          
          SPACE 3                                                               
          DS   0D                                                 @C1A          
R723CRTD  DS   0D       Srv/Rep class period response time data   @J2C          
R723CRCP  DS   F        Count of transaction completions          @C1A          
R723CARC  DS   F        Count of transaction completed            @C1A          
*                       abnormally                                @C1A          
R723CNCP  DS   F        Count of transactions that completed      @C1A          
*                       their execution phase                     @C1A          
R723CANC  DS   F        Count of transactions that completed      @C1A          
*                       their execution phase abnormally          @C1A          
R723CTET  DS   CL8      Total transaction elapsed time            @C1A          
*                             (1024 microseconds)                 @C1A          
*                       (floating point 64-bit long format)       @C1A          
R723CXET  DS   CL8      Total transaction execution time          @C1A          
*                             (1024 microseconds)                 @C1A          
*                       (floating point 64-bit long format)       @C1A          
R723CETS  DS   CL8      Sum of transaction elapsed times squared  @C1A          
*                             (1024 microseconds)                 @C1A          
*                       (floating point 64-bit long format)       @C1A          
          SPACE 3                                                               
**********************  General Execution Delays - ACTUALS  **********          
          SPACE 3                                                               
R723CGDE  DS   0D       General execution delays                  @C1A          
R723CEVD  DS   0D       Execution velocity data                   @C1A          
R723CCUS  DS   F        CPU using samples. These are included in                
*                       R723CTOU                                  @E1C          
R723CTOT  DS   F        Total delay samples used in SRM's execution             
*                       velocity calculation. With WLM's I/O support,           
*                       this includes also I/O delay samples.     @E1C          
R723CEDL  DS   0D       General execution delays                  @C1A          
R723CCDE  DS   F        CPU delay                                 @C1A          
R723CCCA  DS   F        CPU capping delay. A TCB or SRB is marked @C1A          
*                       non-dispatchable because a resource group @C1A          
*                       maximum is being enforced. Note that the  @C1A          
*                       R723CCCA is NOT a subset of R723CCDE      @C1A          
R723CSWI  DS   F        Swap-in delay                             @C1A          
R723CMPL  DS   F        MPL delay                                 @C1A          
R723CAPR  DS   F        Aux page from private                     @C1A          
R723CACO  DS   F        Aux page from common                      @C1A          
R723CAXM  DS   F        Aux page from cross memory                @C1A          
R723CVIO  DS   F        Aux page from VIO                         @C1A          
R723CHSP  DS   F        Aux page from standard hiperspaces        @C1A          
R723CCHS  DS   F        Aux page from eso hiperspaces             @C1A          
R723CUNK  DS   F        Unknown                                   @C1A          
R723CIDL  DS   F        Idle                                      @C1A          
R723CPDE  DS   F        Resource group capping count              @C1A          
R723CPQU  DS   F        Quiesce count                             @C1A          
R723CSAC  DS   F        Sampled address space count. Number of    @C1A          
*                       address spaces that contributed delay     @C1A          
*                       and using samples to this service class.  @C1A          
*                       These samples are not included in         @C1A          
*                       R723CTOT.                                 @C1A          
R723CSRS  DS   CL8      Total shared page residency time                        
*                       (1024 microseconds)                                     
*                       Format: long floating point               @D1A          
R723CSPA  DS   CL8      Total shared page-ins from auxiliary storage            
*                       Format: long floating point               @D1A          
R723CSPE  DS   CL8      Total shared page-ins from expanded storage             
*                       Format: long floating point               @D1A          
*                                                                               
**********************  Addition Resource Consumption   ***************         
*                                                                               
R723CICT  DS   CL8      Total DASD I/O connect time in 128 micro-               
*                       seconds. Format: long floating point      @E1A          
R723CIWT  DS   CL8      Total DASD I/O wait time (queue time + pending          
*                       time in 128 microsecond units.)                         
*                       Format: long floating point               @E1A          
R723CIDT  DS   CL8      Total DASD I/O disconnect time in 128 micro-            
*                       seconds. Note: Does not include IOS queue               
*                       time. Format: long floating point         @E1A          
R723CIRC  DS   F        Total DASD I/O count. This can be used with             
*                       the above fields (R723CICT, R723CIWT, and               
*                       R723CIDT) to determine the average DASD                 
*                       response time for a period.                             
*                       Format: long floating point               @E1A          
*                                                                               
**********************  Addition General Execution Delay  *************         
*                                                                               
R723CTOU  DS F        Total usings. Velocity should be calculated as            
*                     R723CTOU/(R723CTOU+R723CTOT)                @E1A          
R723CIOU  DS F        Total I/O usings. These are included in R723CTOU.         
*                     Only non-paging DASD I/Os can contribute to               
*                     I/O usings.                                 @E1A          
*                                                                               
* The following delay counters are included in R723CTOT                         
*                                                                               
R723CIOD  DS F        DASD I/O delay samples                      @E1A          
R723CQ    DS F        Queue delay samples. Work is waiting for a                
*                     server                                      @E1A          
R723CSPV  DS F        Server private area paging delay samples    @E1A          
R723CSVI  DS F        Server space VIO paging delay samples       @E1A          
R723CSHS  DS F        Server hiperspace paging delay samples      @E1A          
R723CSMP  DS F        Server MPL delay samples                    @E1A          
R723CSSW  DS F        Server swap-in delay samples                @E1A          
*                                                                               
R723CNDI  DS F        Non DASD I/O using or delay samples         @E1A          
R723CTDQ  DS F        Total delay samples always including batch                
*                     queue delay. For service classes that contain             
*                     batch jobs that were not run in WLM managed               
*                     initiators the batch queue delay samples are              
*                     derived from the measured batch queue delay               
*                     time. For service classes that contain jobs               
*                     that ran in WLM managed initiators this value             
*                     is the same as R723CTOT. R723CTDQ can be                  
*                     used as a migration aid to determine what a               
*                     batch service class period's velocity will be             
*                     if its jobs are run in WLM managed initators              
*                                                                 @F2A          
R723CTSA  DS CL8      Total execution samples. It is the sum of                 
*                     RCAETOTU, RCAETOTD, RCAEUNKN, and RCAEIDLE.               
*                     Also always includes I/O using/delay samples              
*                     whether or not I/O samples are included in                
*                     RCAETOTU or RCAETOTD, respectively.                       
*                     (long floating point)                       @F1A          
*                                                                               
**********************  WLM Batch support *****************************         
*                                                                               
R723CIOT  DS CL8      Total DASD IOS queue time in 128 microsecond              
*                     units (long floating point)                 @F1A          
R723CQDT  DS CL8      Total queue delay time. For batch jobs this               
*                     is the time jobs spent on the job queue while             
*                     eligible to run on some system. It represents             
*                     the time the jobs spent waiting for an                    
*                     initiator. For TSO users, this time can be a              
*                     portion of the LOGON process. For APPC this               
*                     is the time an APPC request spends on an APPC             
*                     queue. (long floating point in 1024 micro-                
*                     second units)                               @F1A          
R723CADT  DS CL8      Total time batch jobs were ineligible to run              
*                     because a resource the job had affinity to                
*                     was unavailable. Only applies to batch work.              
*                     Zero for other work types. (long floating                 
*                     point in 1024 microsecond units)            @F1A          
R723CCVT  DS CL8      Total time batch jobs spent in JCL conversion.            
*                     Only applies to batch work. Zero for other                
*                     work types. (long floating point in 1024                  
*                     microsecond units)                          @F1A          
R723CIQT  DS CL8      Total time batch jobs spend on job queue                  
*                     (after JCL conversion) while ineligible to                
*                     run on any system for reasons other than                  
*                     resource affinities. Only applies to batch                
*                     work. Zero for other work types. (long                    
*                     floating point in 1024 microsecond units)   @F1A          
R723CIEA  DS CL8      Independent enclave total transaction active              
*                     time (in 1024 microsecond units) for enclaves             
*                     that originated on this system.             @I1A          
R723CXEA  DS CL8      Exported enclave total transaction active                 
*                     time (in 1024 microsecond units).           @I1A          
R723CFEA  DS CL8      Foreign enclave total transaction active time             
*                     (in 1024 microsecond units).                @I1A          
*                                                                               
********************** Crypto Using and Delay states *****************          
*                                                                               
R723CAMU  DS F        No longer used                              @82C          
R723CAMD  DS F        No longer used                              @82C          
R723APU   DS F        AP crypto using samples. A TCB was found                  
*                     executing on a Cryptographic Assist Proc    @J1A          
R723APD   DS F        AP crypto delay samples. A TCB was found                  
*                     waiting for a Cryptographic Assist Proc     @J1A          
R723FQD   DS F        Feature queue delay samples. A TCB was found              
*                     waiting on a processor feature queue associated           
*                     with a CPU. Subset of R723CCDE. Note, R723CCUS            
*                     includes feature queue using samples.       @J1A          
*                                                                               
********************** Report Class Period Data **********************          
*                                                                               
R723PLSC  DS CL8      Service class that last contributed to  @WA56739          
*                     this report class period during this    @WA56739          
*                     interval. Blank if this is a service    @WA56739          
*                     class period.                           @WA56739          
*                                                                               
********************** Addition General Execution Delay **************          
*                                                                               
R723RCOD  DS F        Contention delay sample count of work                     
*                     waiting for resources as reported to WLM                  
*                     by a resource manager                       @K1A          
R723RCOU  DS F        Contention using sample count of work                     
*                     holding resources as reported to WLM by                   
*                     a resource manager                          @K1A          
R723ECTC  DS CL8      CPU time consumed while dispatching priority              
*                     was temporarily raised by enqueue management              
*                     because the work held a resource that other               
*                     work needed (in 1024 microsecond units)     @K1A          
R723CBPU DS 0F        Reserved for future use                     @93C          
R723IFAU  DS F        zAAP (IFA) using samples                    @93C          
R723CBPCU DS 0F       Reserved for future use                     @93C          
R723IFCU  DS F        zAAP (IFA) on CP using samples.                           
*                     These are also included in R723CCUS         @93C          
R723CBPD DS 0F        Reserved for future use                     @93C          
R723IFAD  DS F        zAAP (IFA) delay samples                    @93C          
R723IFAT  DS CL8      Reserved. Use R723CIFA to calculate zAAP                  
*                     (IFA) service times.                        @31C          
R723IFCT  DS CL8      Reserved. Use R723CIFC to calculate zAAP                  
*                     (IFA) on CP service times.                  @31C          
R723SUPU  DS F        zIIP using samples                      @OA13499          
R723SUCU  DS F        zIIP on CP using samples.                                 
*                     These are also included in R723CCUS.        @12C          
R723SUPD  DS F        zIIP delay samples                      @OA13499          
*                                                                               
**************** Special purpose processor service units *************          
*                                                                               
R723CSUP  DS CL8      Total service units on zIIPs                              
*                     (long floating point format).                             
*                     Multiply with R723NFFS and divide by 256 to               
*                     calculate the CP equivalent value.      @OA13499          
R723CSUC  DS CL8      Total service units on CPs by zIIP eligible               
*                     work (long floating point format)       @OA13499          
R723CCBP DS 0CL8      Reserved for future use                     @93C          
R723CIFA  DS CL8      Total service units on zAAPs                              
*                     (long floating point format).                             
*                     Multiply with R723NFFI and divide by 256 to               
*                     calculate the CP equivalent value.          @93C          
R723CCBPC DS 0CL8     Reserved for future use                     @93C          
R723CIFC  DS CL8      Total service units on CPs by zAAP eligible               
*                     work (long floating point format)           @93C          
*                                                                               
***************** Additional resource data ***************************          
*                                                                               
R723TPDP  DS CL8      CPU time consumed while dispatching priority              
*                     of work with low importance was temporarily               
*                     raised to help blocked workloads                          
*                     (in 1024 microsecond units)                 @11A          
R723CPDP  DS CL8      CPU time consumed while dispatching priority              
*                     was temporarily raised by chronic resource                
*                     contention management because the work held               
*                     a resource that other work needed                         
*                     (in 1024 microsecond units)                 @22A          
R723LPDP  DS CL8      CPU time consumed while dispatching priority              
*                     was temporarily raised to shorten the lock                
*                     hold time of a local suspend lock                         
*                     (in 1024 microsecond units).            @OA62081          
R723SPDP  DS CL8      CPU time consumed while dispatching priority              
*                     was temporarily raised by z/OS Supervisor to              
*                     a higher dispatching priority than the WLM                
*                     assigned dispatching priority                             
*                     (in 1024 microsecond units).                @52A          
***************** Additional response time data **********************          
R723RTDM  DS F        Midpoint of all response times that were                  
*                     collected in the response time distribution               
*                     buckets in milliseconds. For response time                
*                     goals, the midpoint is always the response                
*                     time goal. For execution velocity goals, it               
*                     is the average of all response times that                 
*                     were collected in the response time                       
*                     distribution buckets. The field equals zero               
*                     for discretionary goals.                    @54A          
R723RTDC  DS F        Number of midpoint changes that occurred                  
*                     during interval.                            @54A          
R723RTDT  DS CL8      Timestamp in STCK format, showing the last                
*                     point in time when a midpoint change occurred.            
*                     The midpoint is kept in R723RTDM.           @54A          
***************** Additional resource consumption data ***************          
R723TSUCP  DS CL8     Total service units consumed by transactions,             
*                     executed on general purpose processors. @OA48466          
R723TSUSP  DS CL8     Total service units consumed by transactions,             
*                     executed on specialty processors.       @OA48466          
R723TSUOCP DS CL8     Total service units consumed by transactions,             
*                     eligible to run on specialty processors, but              
*                     executed on general purpose processors. @OA48466          
R723MSUCP  DS CL8     Service units consumed by transactions,                   
*                     classified with reporting attribute MOBILE,               
*                     executed on general purpose processors. @OA48466          
R723MSUSP  DS CL8     Service units consumed by transactions,                   
*                     classified with reporting attribute MOBILE,               
*                     executed on specialty processors.       @OA48466          
R723MSUOCP DS CL8     Service units consumed by transactions,                   
*                     classified with reporting attribute MOBILE,               
*                     eligible to run on specialty processors, but              
*                     executed on general purpose processors. @OA48466          
R723ASUCP  DS CL8     Service units consumed by transactions,                   
*                     classified with reporting attribute CATEGORYA,            
*                     executed on general purpose processors. @OA48466          
R723ASUSP  DS CL8     Service units consumed by transactions,                   
*                     classified with reporting attribute CATEGORYA,            
*                     executed on specialty processors.       @OA48466          
R723ASUOCP DS CL8     Service units consumed by transactions,                   
*                     classified with reporting attribute CATEGORYA,            
*                     eligible to run on specialty processors, but              
*                     executed on general purpose processors. @OA48466          
R723BSUCP  DS CL8     Service units consumed by transactions,                   
*                     classified with reporting attribute CATEGORYB,            
*                     executed on general purpose processors. @OA48466          
R723BSUSP  DS CL8     Service units consumed by transactions,                   
*                     classified with reporting attribute CATEGORYB,            
*                     executed on specialty processors.       @OA48466          
R723BSUOCP DS CL8     Service units consumed by transactions,                   
*                     classified with reporting attribute CATEGORYB,            
*                     eligible to run on specialty processors, but              
*                     executed on general purpose processors. @OA48466          
******** Additional response time and delay data (in microseconds) ***          
R723CTETX  DS CL8     Total transaction elapsed time.                           
*                     Same as R723CTET, but in microseconds.      @81A          
R723CXETX  DS CL8     Total transaction execution time.                         
*                     Same as R723CXET, but in microseconds.      @81A          
R723CETSX  DS CL8     Sum of transaction elapsed times squared.                 
*                     Same as R723CETS, but in microseconds.      @81A          
R723CQDTX  DS CL8     Total queue delay time.                                   
*                     Same as R723CQDT, but in microseconds.      @81A          
R723CADTX  DS CL8     Total time batch jobs were ineligible to run              
*                     because a resource the job had affinity to                
*                     was unavailable.                                          
*                     Same as R723CADT, but in microseconds.      @81A          
R723CCVTX  DS CL8     Total time batch jobs spent in JCL conversion.            
*                     Same as R723CCVT, but in microseconds.      @81A          
R723CIQTX  DS CL8     Total time batch jobs spend on job queue                  
*                     (after JCL conversion) while ineligible to                
*                     run on any system for reasons other than                  
*                     resource affinities.                                      
*                     Same as R723CIQT, but in microseconds.      @81A          
***************** Additional resource consumption data ***********@92A          
R723TSUCBP DS CL8     Reserved for future use                     @93C          
R723TSUCBPCP DS CL8   Reserved for future use                     @93C          
*** Transaction data reported by subsystem work managers **** @OA62502          
*** when deleting an enclave (from RCAERTD section)      **** @OA62502          
R723ENCTRXNUM   DS F  Number of single subsystem transactions                   
*                     processed within enclaves.              @OA62502          
R723ENCTRXCALLS DS F  Number of times transaction data has been                 
*                     reported by subsystem work managers when                  
*                     deleting an enclave.                    @OA62502          
R723ENCTRXET  DS CL8  Total execution time in microseconds for number           
*                     of subsystem transactions in R723ENCTRXNUM.               
*                                                             @OA62502          
R723ENCTRXETS DS CL8  Sum of squared execution times in microseconds            
*                     for number of subsystem transactions in                   
*                     R723ENCTRXNUM                           @OA62502          
          SPACE 3                                                               
**********************  Response Time Distribution Map  ***************         
          SPACE 3                                                               
***********************************************************************         
*                                                                     *         
*  Response Time Distribution Map and Counts Table (Subtype 3)        *         
*                                                                     *         
*  This table defines up to 9 entries (in RMF 4.4.0 each entry        *         
*  represents 14 response time distribution buckets) where            *         
*                                                                     *         
*           entry 0 is always the MAP and is addressed by the offset  *         
*                 in the header extension SMF72RTS                    *         
*           entry 1 - 8 (max number of periods) are the counts        *         
*                 for an associated service/report class period       *         
*                 and addressed by an index from the service/report   *         
*                 class period data section R723CRTX              @J2C*         
*                                                                     *         
*  The MAP is the first entry (0) in this table and defines           *         
*  a maximum percentage of a goal (i.e. 50, 70, 200, etc.).           *         
*  When used in conjunction with a following entry (1-8) it           *         
*  shows the number of transactions that completed in a               *         
*  percentage of a a goal. The last entry in the array                *         
*  contains x'FFFFFFFF'. This indicates that this bucket              *         
*  includes all transactions that completed with longer               *         
*  response times than the previous bucket.                           *         
*                                                                     *         
*  Entries 1-8 contains the number of transactions that               *         
*  completed in the time period represented by that entry.            *         
*  When used with entry 0 it shows a distribution of                  *         
*  completions verses goals specified.                            @C1A*         
*                                                                     *         
***********************************************************************         
R723RTS  DSECT                                                    @C1A          
R723TRDB  DS   F        Response time distribution map and counts @C1A          
R723TENT  EQU  14       Number of entries in an array. For RMF510 @C1A          
*                       this number is 14                         @C1A          
          SPACE 3                                                               
**********************  Work Manager/Resource Manager States  *********         
          SPACE 3                                                               
R723WRS  DSECT          Work/Resource manager states section      @C1A          
R723RENT  DS   0D       Entry in the subsystem work manager delay               
*                       array. In RMF510 there are always two     @C1A          
*                       entries for a subsystem, one for the      @C1A          
*                       Begin_to_End phase and one for the        @C1A          
*                       Execution phase, where the BtE entry is   @C1A          
*                       always be the first                       @C1A          
R723RTYP  DS   CL4      Subsystem name                            @C1A          
R723RFLG  DS   BL1      Work/Resource manager flags               @C1A          
R723RDBE  EQU  X'80'    Represents states sampled in the                        
*                       begin-to-end phase                        @C1A          
R723REXE  EQU  X'40'    Represents states sampled in the          @C1A          
*                       execution phase                           @C1A          
R723RRS1  EQU  X'3F'    Reserved                                  @C1A          
R723RRS2  DS   BL3      Reserved                                  @C1A          
R723RESS  DS   F        Total number of transaction states                      
*                       sampled                                   @C1A          
R723RACT  DS   F        Total number of active state samples      @C1A          
R723RRDY  DS   F        Total number of ready state samples       @C1A          
R723RIDL  DS   F        Total number of idle state samples. Idle  @C1A          
*                       indicates that no work request is         @C1A          
*                       available to the work manager that is     @C1A          
*                       allowed to run.                           @C1A          
R723RWLO  DS   F        Total number of waiting for lock state                  
*                       samples                                   @C1A          
R723RWIO  DS   F        Total number of waiting for I/O state                   
*                       samples                                   @C1A          
R723RWCO  DS   F        Total number of waiting for conversation                
*                       state samples                             @C1A          
R723RWDS  DS   F        Total number of waiting for distributed                 
*                       request state samples                     @C1A          
R723RWSL  DS   F        Waiting for a session to be established                 
*                       locally                                   @C1A          
R723RWSN  DS   F        Waiting for a session to be established                 
*                       somewhere in the network                  @C1A          
R723RWSS  DS   F        Waiting for a session to be established                 
*                       somewhere in the sysplex                  @C1A          
R723RWTM  DS   F        Waiting for a timer                       @C1A          
R723RWO   DS   F        Waiting for another product               @C1A          
R723RWMS  DS   F        Waiting for unidentified resource         @C1A          
R723RSSL  DS   F        State representing transactions for                     
*                       which there are logical continuations                   
*                       on this MVS image                         @C1A          
R723RSSS  DS   F        State representing transactions for                     
*                       which there are logical continuations                   
*                       on another MVS image in the sysplex       @C1A          
R723RSSN  DS   F        State representing transactions for                     
*                       which there are logical continuations                   
*                       somewhere within the network              @C1A          
R723RWST  DS   F        Total number of waiting for SSL thread                  
*                       samples                               @WA52227          
R723RWRT  DS   F        Total number of waiting for regular                     
*                       thread samples                        @WA52227          
R723RWWR  DS   F        Total number of waiting for work table                  
*                       registration samples                  @WA52227          
R723RAPP  DS   F        Total number of active application                      
*                       state samples                         @WA52227          
R723RWNL  DS   F        Total number of state samples reflecting                
*                       waiting for new latch                     @E1A          
R723RW01  DS   F        Total number of waiting for resource                    
*                       type 1 samples (for future use)       @WA52227          
R723RW02  DS   F        Total number of waiting for resource                    
*                       type 2 samples (for future use)       @WA52227          
R723RW03  DS   F        Total number of waiting for resource                    
*                       type 3 samples (for future use)       @WA52227          
R723RW04  DS   F        Total number of waiting for resource                    
*                       type 4 samples (for future use)       @WA52227          
R723RW05  DS   F        Total number of waiting for resource                    
*                       type 5 samples (for future use)       @WA52227          
R723RW06  DS   F        Total number of waiting for resource                    
*                       type 6 samples (for future use)           @01A          
R723RW07  DS   F        Total number of waiting for resource                    
*                       type 7 samples (for future use)           @01A          
R723RW08  DS   F        Total number of waiting for resource                    
*                       type 8 samples (for future use)           @01A          
R723RW09  DS   F        Total number of waiting for resource                    
*                       type 9 samples (for future use)           @01A          
R723RW10  DS   F        Total number of waiting for resource                    
*                       type 10 samples (for future use)          @01A          
R723RW11  DS   F        Total number of waiting for resource                    
*                       type 11 samples (for future use)          @01A          
R723RW12  DS   F        Total number of waiting for resource                    
*                       type 12 samples (for future use)          @01A          
R723RW13  DS   F        Total number of waiting for resource                    
*                       type 13 samples (for future use)          @01A          
R723RW14  DS   F        Total number of waiting for resource                    
*                       type 14 samples (for future use)          @01A          
R723RW15  DS   F        Total number of waiting for resource                    
*                       type 15 samples (for future use)          @01A          
R723RBPM  DS   F        Number of state samples representing      @01A          
*                       buffer pool misses that resulted in I/O   @01A          
R723RDNX  DS   BL2      Index into resource delay names table     @21A          
R723RDNN  DS   BL2      Number of entries in the resource delay   @21A          
*                       names table                               @21A          
R723RRS3  DS   BL8      Reserved                                  @21C          
          SPACE 3                                                               
***************** Resource Delay Names Section ***********************          
*                                                                               
R723DNS   DSECT         Resource delay names section              @53A          
R723DNST  DS CL4        Subsystem type as used in the classification            
*                       rules specified in the WLM administrative               
*                       application                               @21A          
R723DNNU  DS BL2        Number of the resource delay type. Values               
*                       1-15 are related to R723RW01-R723RW15     @21A          
R723DNDE  DS CL16       Resource delay description                @21A          
R723RRS4  DS BL2        Reserved                                  @21A          
          SPACE 3                                                               
**********************************************************************          
          AIF  ('&X' EQ 'O').SUBTYP4                              @C2A          
          MEXIT                                                   @C2A          
          SPACE 3                                                               
.SUBTYP4  ANOP                                                    @C2A          
**********************  Control Section for Subtype IV  ***************         
**********************  Data Section  *********************************         
R724DATA DSECT                                                    @C2A          
R724PNAM  DS   CL8      Name of active service policy             @C2A          
R724PTM   DS   BL8      Time policy was activated                               
*                       Format: STORE CLOCK, Unit: local time     @C2A          
R724LCNM  DS   CL8      Service class name                        @C2A          
R724PER#  DS   BL1      Service class period number               @C2A          
          DS   BL3      Free for future use                       @C2A          
R724USER  DS   BL4      Sum of all users found                    @C2A          
R724ACTV  DS   BL4      Sum of all active users found             @C2A          
R724ACTS  DS   BL4      Sum of all active samples (except OUTR)   @C2A          
R724IDLS  DS   BL4      Sum of all idle samples                   @C2A          
R724PAGE  DS   BL4      Sum of all users delayed for paging                     
*                       at all samples                            @C2A          
R724SWAP  DS   BL4      Sum of all users delayed for swapping                   
*                       at all samples                            @C2A          
R724OUTR  DS   BL4      Sum of all out and ready users                          
*                       at all samples                            @C2A          
R724PGIN  DS   BL4      Sum of all page-ins                       @C2A          
R724DIVS  DS   BL4      Sum of all DIV samples                    @C2A          
R724LSSA  DS   BL4      Total logically swapped samples for the group           
*                                                                 @C2A          
R724PSSA  DS   BL4      Total swapped samples for the group                     
*                       (except logical)                          @C2A          
R724UPRO  DS   BL4      Total processor using samples for the group             
*                                                                 @C2A          
R724UDEV  DS   BL4      Total device using samples for the group  @C2A          
R724DPRO  DS   BL4      Total processor delay samples for the group             
*                                                                 @C2A          
R724DDEV  DS   BL4      Total device delay samples for the group  @C2A          
R724DSTO  DS   BL4      Total storage delay samples for the group @C2A          
R724DJES  DS   BL4      Total JES delay samples for the group     @C2A          
R724DHSM  DS   BL4      Total HSM delay samples for the group     @C2A          
R724DXCF  DS   BL4      Total XCF delay samples for the group     @C2A          
R724DENQ  DS   BL4      Total ENQ delay samples for the group     @C2A          
R724DMNT  DS   BL4      Total mount delay samples for the group   @C2A          
R724DMSG  DS   BL4      Total message delay samples for the group @C2A          
R724UNKN  DS   BL4      Total unknown state samples for the group @C2A          
R724VALD  DS   BL4      Total valid samples for the group                       
*                       (single state sum of all using, delay,                  
*                       idle and unknown)                         @C2A          
R724LSCT  DS   BL4      Count of "long" logical swaps for the group             
*                                                                 @C2A          
R724ESCT  DS   BL4      Count of "long" swaps to expanded storage               
*                       for the group                             @C2A          
R724PSCT  DS   BL4      Count of "long" physical swaps for the group            
*                                                                 @C2A          
R724ACTF  DS   D        Sum of all active frames                                
*                       Format: long floating point               @C2A          
R724IDLE  DS   D        Sum of all idle frames                                  
*                       Format: long floating point               @C2A          
R724SLOT  DS   D        Sum of all slots used                                   
*                       Format: long floating point               @C2A          
R724DIV   DS   D        Sum of all DIV frames                                   
*                       Format: long floating point               @C2A          
R724FIX   DS   D        Sum of all fixed frames                                 
*                       Format: long floating point               @C2A          
R724LSCF  DS   D        Sum of all central frames for all logically             
*                       swapped users at all samples                            
*                       Format: long floating point               @C2A          
R724LSEF  DS   D        Sum of all expanded frames for all logically            
*                       swapped users at all samples.                           
*                       Format: long floating point               @C2A          
R724PSEF  DS   D        Sum of all expanded frames for all swapped              
*                       users (except logical) at all samples.                  
*                       Format: long floating point               @C2A          
R724VECT  DS   D        Total vector utilization time for the group             
*                       Format: long floating point                             
*                       Unit: microseconds                        @C2A          
R724ET    DS   D        Total execution time for all transactions               
*                       that ended in the group. Does not include               
*                       queued time.                                            
*                       Format: long floating point                             
*                       Unit: 1024-microseconds                   @81C          
R724QT    DS   D        Total time spent on JES or APPC queues by               
*                       all transactions that ended in the group                
*                       Format: long floating point                             
*                       Unit: 1024-microseconds                   @81C          
R724END   DS   D        The number of transactions that ended in                
*                       the group                                               
*                       Format: long floating point                             
*                       Unit: microseconds                        @C2A          
R724TSV   DS   CL8      Sum of shared page views                                
*                       Format: long floating point               @D1A          
R724VIN   DS   CL8      Sum of shared pages in central storage, that            
*                       are valid                                               
*                       Format: long floating point               @D1A          
R724VLC   DS   CL8      Sum of shared page validations                          
*                       Format: long floating point               @D1A          
R724GPI   DS   CL8      Sum of shared page-ins from auxiliary storage           
*                       Format: long floating point               @D1A          
R724ETX   DS   D        Total execution time for all transactions               
*                       that ended in the group. Same as R724ET,                
*                       but in microseconds.                      @81A          
R724QTX   DS   D        Total time spent on JES or APPC queues by               
*                       all transactions that ended in the group.               
*                       Same as R724QT, but in microseconds.      @81A          
          SPACE 3                                                               
**********************  Swap reason data section  *********************         
R724SWRE DSECT                                                    @C2A          
R724OR1   DS   BL4      STOR/OUTR delay samples for swap reason 1:              
*                       Terminal output wait                  @WA03905          
R724OR2   DS   BL4      STOR/OUTR delay samples for swap reason 2:              
*                       Terminal input wait                   @WA03905          
R724OR3   DS   BL4      STOR/OUTR delay samples for swap reason 3:              
*                       Long wait                                 @C2A          
R724OR4   DS   BL4      STOR/OUTR delay samples for swap reason 4:              
*                       Auxiliary storage shortage                @C2A          
R724OR5   DS   BL4      STOR/OUTR delay samples for swap reason 5:              
*                       Real storage shortage                     @C2A          
R724OR6   DS   BL4      STOR/OUTR delay samples for swap reason 6:              
*                       Detected long wait                        @C2A          
R724OR7   DS   BL4      STOR/OUTR delay samples for swap reason 7:              
*                       Requested swap                                          
*                       No longer used, refer to R724OR7A         @83C          
R724OR8   DS   BL4      STOR/OUTR delay samples for swap reason 8:              
*                       Enqueue exchange swap                     @C2A          
R724OR9   DS   BL4      STOR/OUTR delay samples for swap reason 9:              
*                       Exchange swap                             @C2A          
R724OR10  DS   BL4      STOR/OUTR delay samples for swap reason 10:             
*                       Unilateral swap                           @C2A          
R724OR11  DS   BL4      STOR/OUTR delay samples for swap reason 11:             
*                       Transition swap                           @C2A          
R724OR12  DS   BL4      STOR/OUTR delay samples for swap reason 12:             
*                       Improve central storage usage             @C2A          
R724OR13  DS   BL4      STOR/OUTR delay samples for swap reason 13:             
*                       Improve system paging rate                @C2A          
R724OR14  DS   BL4      STOR/OUTR delay samples for swap reason 14:             
*                       Make room for an out too long user        @C2A          
R724OR15  DS   BL4      STOR/OUTR delay samples for swap reason 15:             
*                       APPC wait                                 @C2A          
R724OR16  DS   BL4      STOR/OUTR delay samples for swap reason 16:             
*                       OMVS input wait                           @C2A          
R724OR17  DS   BL4      STOR/OUTR delay samples for swap reason 17:             
*                       OMVS output wait                          @C2A          
R724OR18  DS   BL4      STOR/OUTR delay samples for swap reason 18:             
*                       In-real swap                              @J3A          
R724OR7A  DS   BL4      STOR/OUTR delay samples for swap reason 7:              
*                       Memory pool shortage                      @83A          
          SPACE 3                                                               
**********************************************************************          
          AIF  ('&X' EQ 'O').SUBTYP5                              @51A          
          MEXIT                                                   @51A          
          SPACE 3                                                               
.SUBTYP5  ANOP                                                    @51A          
**********************  Subtype 5 Data Sections  *********************          
**********************  Serialization Control Section ****************          
R725SCTL DSECT                                                                  
R725SGMO  DS   BL1      GRS Mode                                  @51A          
*                       X'00' = NONE                                            
*                       X'01' = RING                                            
*                       X'02' = STAR                                            
          DS   CL15     Reserved                                  @51A          
R725SCMS  DS   CL8      Total number of times that a unit of work               
*                       was suspended on a CMS lock               @51A          
R725SCMA  DS   CL8      Total number of times that a unit of work               
*                       was suspended on a CMS lock                             
*                       when there was already at least one other               
*                       unit of work suspended for the lock       @51A          
R725SCMT  DS   CL8      Total amount of time in milliseconds that               
*                       a unit of work was suspended on a CMS lock@51A          
          DS   CL8      Reserved                                  @51A          
*                                                                               
R725SEDS  DS   CL8      Total number of times that a unit of work               
*                       was suspended on a CMS EnqueueDequeue lock@51A          
R725SEDA  DS   CL8      Total number of times that a unit of work               
*                       was suspended on a CMS EnqueueDequeue lock              
*                       when there was already at least one other               
*                       unit of work suspended for the lock       @51A          
R725SEDT  DS   CL8      Total amount of time in milliseconds that               
*                       a unit of work was suspended on a CMS                   
*                       EnqueueDequeue lock                       @51A          
          DS   CL8      Reserved                                  @51A          
*                                                                               
R725SLAS  DS   CL8      Total number of times that a unit of work               
*                       was suspended on a CMS Latch lock         @51A          
R725SLAA  DS   CL8      Total number of times that a unit of work               
*                       was suspended on a CMS Latch lock                       
*                       when there was already at least one other               
*                       unit of work suspended for the lock       @51A          
R725SLAT  DS   CL8      Total amount of time in milliseconds that               
*                       a unit of work was suspended on a CMS                   
*                       Latch lock                                @51A          
          DS   CL8      Reserved                                  @51A          
*                                                                               
R725SSMS  DS   CL8      Total number of times that a unit of work               
*                       was suspended on a CMS SMF lock           @51A          
R725SSMA  DS   CL8      Total number of times that a unit of work               
*                       was suspended on a CMS SMF lock                         
*                       when there was already at least one other               
*                       unit of work suspended for the lock       @51A          
R725SSMT  DS   CL8      Total amount of time in milliseconds that               
*                       a unit of work was suspended on a CMS                   
*                       SMF lock                                  @51A          
          DS   CL8      Reserved                                  @51A          
*                                                                               
R725SLOS  DS   CL8      Total number of times that a unit of work               
*                       was suspended on a Local lock             @51A          
R725SLOA  DS   CL8      Total number of times that a unit of work               
*                       was suspended on a Local lock                           
*                       when there was already at least one other               
*                       unit of work suspended for the lock       @51A          
R725SLOT  DS   CL8      Total amount of time in milliseconds that               
*                       a unit of work was suspended on a Local                 
*                       lock                                      @51A          
          DS   CL8      Reserved                                  @51A          
*                                                                               
R725SCLS  DS   CL8      Total number of times that a unit of work               
*                       from another address space was suspended                
*                       when requesting the Local Lock of an                    
*                       address space                             @51A          
R725SCLA  DS   CL8      Total number of times that a unit of work               
*                       from another address space was suspended                
*                       when requesting the Local Lock of an                    
*                       address space when there was already                    
*                       at least one other unit of work                         
*                       suspended for the lock                    @51A          
R725SCLT  DS   CL8      Total amount of time in milliseconds that               
*                       a unit of work from another address space               
*                       was suspended when requesting the                       
*                       Local lock of an address space            @51A          
          DS   CL8      Reserved                                  @51A          
*                                                                               
R725SLRC  DS   CL8      Total number of suspended Latch Obtain                  
*                       requests                                  @51A          
R725SLRT  DS   CL8      Total amount of time in milliseconds that               
*                       Latch Obtain requests were suspended      @51A          
R725SLRQ  DS   CL16     Total sum of squares of time in milliseconds            
*                       that Latch Obtain requests were suspended @51A          
*                                                                               
R725SSTR  DS   CL8      Total number of ENQ SCOPE=STEP requests   @51A          
R725SSTS  DS   CL8      Total number of ENQ SCOPE=STEP requests                 
*                       that were suspended                       @51A          
R725SSTT  DS   CL8      Total amount of suspend time in milliseconds            
*                       caused by ENQ SCOPE=STEP requests         @51A          
          DS   CL8      Reserved                                  @51A          
R725SSTQ  DS   CL16     Total sum of squares of suspend time in                 
*                       milliseconds caused by ENQ SCOPE=STEP                   
*                       requests                                  @51A          
*                                                                               
R725SSYR  DS   CL8      Total number of ENQ SCOPE=SYSTEM requests @51A          
R725SSYS  DS   CL8      Total number of ENQ SCOPE=SYSTEM requests               
*                       that were suspended                       @51A          
R725SSYT  DS   CL8      Total amount of suspend time in milliseconds            
*                       caused by ENQ SCOPE=SYSTEM requests       @51A          
          DS   CL8      Reserved                                  @51A          
R725SSYQ  DS   CL16     Total sum of squares of suspend time in                 
*                       milliseconds caused by ENQ SCOPE=SYSTEM                 
*                       requests                                  @51A          
*                                                                               
R725SSSR  DS   CL8      Total number of ENQ SCOPE=SYSTEMS requests@51A          
R725SSSS  DS   CL8      Total number of ENQ SCOPE=SYSTEMS requests              
*                       that were suspended                       @51A          
R725SSST  DS   CL8      Total amount of suspend time in milliseconds            
*                       caused by ENQ SCOPE=SYSTEMS requests      @51A          
          DS   CL8      Reserved                                  @51A          
R725SSSQ  DS   CL16     Total sum of squares of suspend time in                 
*                       milliseconds caused by ENQ SCOPE=SYSTEMS                
*                       requests                                  @51A          
*                                                                               
                                                                                
**********************  End Serialization Control Section *************         
**********************  CMS lock data section  ************************         
* The following DSECT R725CMSD is valid for the CMS locks                       
* described in R725CMTY                                           @51A          
R725CMSD DSECT                                                    @51A          
                                                                                
R725CMKY  DS   0CL16    Address space key                         @51A          
R725CMJN  DS   CL8      Name of job                               @51A          
          DS   CL3      Reserved                                  @51A          
R725CMSP  DS   BL1      Service class period                      @51A          
R725CMAS  DS   H        Address space ID                          @51A          
          DS   H        Reserved                                  @51A          
R725CMST  DS   CL8      Address space SToken                      @51A          
R725CMSN  DS   CL8      Service class name                        @51A          
R725CMTY  DS   BL1      Lock Type                                 @51A          
*                       X'01' = CMS Lock                                        
*                       X'02' = CMS EnqueueDequeue Lock                         
*                       X'03' = CMS Latch Lock                                  
*                       X'04' = CMS SMF Lock                                    
          DS   CL7      Reserved                                  @51A          
*                                                                               
R725CMSU  DS   CL8      Number of times that a unit of work of this             
*                       address space was suspended on the CMS lock             
*                       type as specified in R725CMTY             @51A          
R725CMAL  DS   CL8      Number of times that a unit of work of this             
*                       address space was suspended on the CMS lock             
*                       type as specified in R725CMTY                           
*                       when there was already at least one                     
*                       other unit of work suspended for this lock@51A          
R725CMTI  DS   CL8      Total amount of time in milliseconds that               
*                       a unit of work of this address space was                
*                       suspended on the CMS lock type as         @51A          
*                       specified in R725CMTY                                   
          SPACE 3                                                               
**********************  Local lock data section  **********************         
R725LOTD DSECT                                                    @51A          
R725LOKY  DS   0CL16    Address space key                         @51A          
R725LOJN  DS   CL8      Name of job                               @51A          
          DS   CL3      Reserved                                  @51A          
R725LOSP  DS   BL1      Service class period                      @51A          
R725LOAS  DS   H        Address space ID                          @51A          
          DS   H        Reserved                                  @51A          
R725LOST  DS   CL8      Address space SToken                      @51A          
R725LOSN  DS   CL8      Service class name                        @51A          
          DS   CL8      Reserved                                  @51A          
*                                                                               
R725LOSU  DS   CL8      Number of times that a unit of work of this             
*                       address space was suspended on a Local lock             
*                                                                 @51A          
R725LOAL  DS   CL8      Number of times that a unit of work of this             
*                       address space was suspended on a Local lock             
*                       when there was already at least one                     
*                       other unit of work suspended              @51A          
R725LOTI  DS   CL8      Total amount of time in milliseconds that a             
*                       unit of work of this address space was                  
*                       suspended on a Loacl lock                 @51A          
*                                                                               
R725LCSU  DS   CL8      Number of times that a unit of work from                
*                       another address space was suspended when                
*                       requesting the Local lock of this                       
*                       address space                             @51A          
R725LCAL  DS   CL8      Number of times that a unit of work from                
*                       another address space was suspended when                
*                       requesting the Local lock of this                       
*                       address space and there was already                     
*                       at least one other unit of work                         
*                       waiting for that lock                     @51A          
R725LCTI  DS   CL8      Total amount of time in milliseconds that               
*                       a unit of work was suspended when requesting            
*                       the Local lock of this address space      @51A          
          SPACE 3                                                               
**********************  CML lock owner data section *******************         
R725CLOD DSECT                                                    @51A          
R725COKY  DS   0CL16    Address space key                         @51A          
R725COJN  DS   CL8      Name of job                               @51A          
          DS   CL3      Reserved                                  @51A          
R725COSP  DS   BL1      Service class period                      @51A          
R725COAS  DS   H        Address space ID                          @51A          
          DS   H        Reserved                                  @51A          
R725COST  DS   CL8      Address space SToken                      @51A          
R725COSN  DS   CL8      Service class name                        @51A          
          DS   CL8      Reserved                                  @51A          
*                                                                               
R725COSU  DS   CL8      Number of times that a unit of work from                
*                       another address space was suspended                     
*                       when requesting the Local lock of                       
*                       this address space                        @51A          
R725COAL  DS   CL8      Number of times that a unit of work from                
*                       another address space was                               
*                       suspended  when requesting the Local                    
*                       lock of this address space                @51A          
R725COTI  DS   CL8      Total amount of time in milliseconds that               
*                       a unit of work was                                      
*                       suspended when requesting the Local                     
*                       lock of this address space                @51A          
*                                                                               
R725CLSU  DS   CL8      Number of times that a unit of work                     
*                       of this address space was suspended                     
*                       on a Local lock                           @51A          
R725CLAL  DS   CL8      Number of times that a unit of work                     
*                       of this address space was suspended                     
*                       on a Local lock                                         
*                       when there was already at least on other                
*                       unit of work suspended                    @51A          
R725CLTI  DS   CL8      Total amount of time in milliseconds that               
*                       a unit of work of this address space                    
*                       was suspended on a Local lock             @51A          
          SPACE 3                                                               
**********************  CML Lock Requestor data section  **************         
R725CLRD DSECT                                                    @51A          
R725CRKY  DS   0CL16    Address space key                         @51A          
R725CRJN  DS   CL8      Name of job                               @51A          
          DS   CL3      Reserved                                  @51A          
R725CRSP  DS   BL1      Service class period                      @51A          
R725CRAS  DS   H        Address space ID                          @51A          
          DS   H        Reserved                                  @51A          
R725CRST  DS   CL8      Address space SToken                      @51A          
R725CRSN  DS   CL8      Service class name                        @51A          
          DS   CL8      Reserved                                  @51A          
*                                                                               
R725CRSU  DS   CL8      Number of times that a unit of work from                
*                       this address space was suspended when                   
*                       requesting the Local lock of another                    
*                       address space                             @51A          
R725CRAL  DS   CL8      Number of times that a unit of work from                
*                       this address space was suspended when                   
*                       requesting the Local lock of another                    
*                       address space and there was already                     
*                       at least one other unit of work                         
*                       waiting for that lock                     @51A          
R725CRTI  DS   CL8      Total amount of time in milliseconds that               
*                       a unit of work was suspended when requesting            
*                       the Local lock of another address space   @51A          
          SPACE 3                                                               
**********************  GRS Latch lock data section   *****************         
* The following DSECT R725LATD is valid for the GRS Latch locks                 
* described in R725LATY                                           @51A          
R725LATD DSECT                                                    @51A          
R725LAKY  DS   0CL16    Address space key                         @51A          
R725LAJN  DS   CL8      Name of job                               @51A          
          DS   CL3      Reserved                                  @51A          
R725LASP  DS   BL1      Service class period                      @51A          
R725LAAS  DS   H        Address space ID                          @51A          
          DS   H        Reserved                                  @51A          
R725LAST  DS   CL8      Address space SToken                      @51A          
R725LASN  DS   CL8      Service class name                        @51A          
R725LATY  DS   BL1      Lock Type                                 @51A          
*                       X'01' = Latch Set Creator                               
*                       X'02' = Latch Requestor                                 
          DS   CL7      Reserved                                  @51A          
*                                                                               
R725LASU  DS   CL8      Number of times a Latch request for this                
*                       address space was suspended for the type of             
*                       Latch request as specified in R725LATY    @51A          
R725LATI  DS   CL8      Total amount of suspend time in milliseconds            
*                       that was caused by Latch requests for this              
*                       address space for the type of Latch request             
*                       as specified in R725LATY                  @51A          
R725LASQ  DS   CL16     Sum of squares of the individual suspend times          
*                       in milliseconds that was caused by Latch  @51A          
*                       requests for this address space for the type            
*                       of Latch request as specified in R725LATY @51A          
          SPACE 3                                                               
**********************  GRS Enqueue lock data section  ****************         
* The following DSECT R725ENTD is valid for the GRS Enqueue locks               
* described in R725ENSC                                           @51A          
R725ENTD DSECT                                                    @51A          
R725ENKY  DS   0CL16    Address space key                         @51A          
R725ENJN  DS   CL8      Name of job                               @51A          
          DS   CL3      Reserved                                  @51A          
R725ENSP  DS   BL1      Service class period                      @51A          
R725ENAS  DS   H        Address space ID                          @51A          
          DS   H        Reserved                                  @51A          
R725ENST  DS   CL8      Address space SToken                      @51A          
R725ENSN  DS   CL8      Service class name                        @51A          
R725ENSC  DS   BL1      Enqueue Scope Type                        @51A          
*                       X'01' = Scope=Step                                      
*                       X'02' = Scope=System                                    
*                       X'03' = Scope=Systems                                   
          DS   CL7      Reserved                                  @51A          
R725ENRC  DS   CL8      Number of GRS ENQ requests with the scope               
*                       as specified in R725ENSC for this                       
*                       address space                             @51A          
R725ENSU  DS   CL8      Number of GRS ENQ requests with the scope               
*                       as specified in R725ENSC that were suspended            
*                       for this address space                    @51A          
R725ENTI  DS   CL8      Total amount of suspend time in milliseconds            
*                       that was caused by GRS ENQ requests with the            
*                       scope as specified in R725ENSC for this                 
*                       address space                             @51A          
R725ENSQ  DS   CL16     Sum of squares of the individual suspend times          
*                       in milliseconds                           @51A          
          SPACE 3                                                               
**********************************************************************          
*******************  GRS QScan statistics data section  **************          
* The following DSECT R725QSAD is valid for GRS QScan statistics                
R725QSAD DSECT                                                    @63A          
R725QSKY  DS   0CL16    Address space key                         @63A          
R725QSJN  DS   CL8      Name of job                               @63A          
          DS   CL3      Reserved                                  @63A          
R725QSSP  DS   BL1      Service class period                      @63A          
R725QSAS  DS   H        Address space ID                          @63A          
          DS   H        Reserved                                  @63A          
R725QSST  DS   CL8      Address space SToken                      @63A          
R725QSSN  DS   CL8      Service class name                        @63A          
          DS   CL8      Reserved                                  @63A          
R725QSRC  DS   CL8      Number of requests including START and RESUME,          
*                       but not QUIT requests.                    @63A          
R725QSSC  DS   CL8      Number of specific requests with GQSCAN                 
*                       requests specified by QNAME and RNAME or                
*                       ISGQUERY requests specifying a search by                
*                       ENQTOKEN                                  @63A          
R725QSRR  DS   CL8      Total number of resources returned for                  
*                       these requests                            @63A          
R725QSRQ  DS   CL16     Sum of squares of number of resources                   
*                       returned for these requests               @63A          
R725QSTI  DS   CL8      Total amount of execution times within                  
*                       GRS for these requests in microseconds    @63A          
R725QSTQ  DS   CL16     Sum of squares of individual request                    
*                       excecution times in microseconds          @63A          
          SPACE 3                                                               
**********************************************************************          
         MEND  ,                                                                
*                       */                                                      
 %PLAS72:;                                                     /*@W1C*/         
*/********************************************************************/         
*/*                                                          @OA62502*/         
*/* Definition of current SMF record level for each subtype  @OA62502*/         
*/*                                                          @OA62502*/         
*/* Record level SMF72n_SRL must be incremented, whenever    @OA62502*/         
*/* length or layout is changed by APAR and release          @OA62502*/         
*/* development                                              @OA62502*/         
*/*                                                          @OA62502*/         
*/* '8E'X  - RMF product split                               @OA62502*/         
*/* '8F'X  - IWMRCOLL enclave transaction data (SMF72.3)     @OA62502*/         
*/********************************************************************/         
*   DCL SMF723_SRL FIXED(8) CONSTANT('8F'X); /* SMF72.3 rec.lvl                 
*                                                            @OA62502*/         
*   DCL SMF724_SRL FIXED(8) CONSTANT('8E'X); /* SMF72.4 rec.lvl                 
*                                                            @OA62502*/         
*   DCL SMF725_SRL FIXED(8) CONSTANT('8E'X); /* SMF72.5 rec.lvl                 
*                                                            @OA62502*/         
*                                                                               
*    /* COMMON SMF HEADER */                                                    
*?ERBHDR TYPE(72) ATTRIBUT(BASED(SMF72PTR));                                    
*   @SPACE;                       /*                         @WA05544*/         
*      2 SMF72HDX,                /* HEADER EXTENTION        @WA05544*/         
*    /* INDIVIDUAL HEADER EXTENTION */                                          
*%IF IFAR721 = 'YES' %THEN %GOTO LHDX1; /* Subtype 1             @C4A*/         
*%IF IFAR722 = 'YES' %THEN %GOTO LHDX1; /* Subtype 2 (same as 1) @C4A*/         
*%IF IFAR723 = 'YES' %THEN %GOTO LHDX3; /* Subtype 3             @C1A*/         
*%IF IFAR724 = 'YES' %THEN %GOTO LHDX4; /* Subtype 4             @C2A*/         
*%IF IFAR725 = 'YES' %THEN %GOTO LHDX5; /* Subtype 5             @51A*/         
*%LHDX1:;                                                    /*  @C4A*/         
*        3 SMF72WLS FIXED(31),    /* Offset to workload control                 
*                                    section (subytpe 1) or offset              
*                                    to performance group/domain                
*                                    control section (subtype 2)     */         
*        3 SMF72WLL FIXED(15),    /* Length of workload control                 
*                                    section (subytpe 1) or length              
*                                    of performance group/domain                
*                                    control section (subtype 2)     */         
*        3 SMF72WLN FIXED(15),    /* Number of workload control                 
*                                    sections (subytpe 1) or length             
*                                    of performance group/domain                
*                                    control sections (subtype 2)    */         
*        3 SMF72PGS FIXED(31),    /* Offset to performance group                
*                                    period data section (subtype 1)            
*                                    or offset to performance group/            
*                                    domain control section                     
*                                    (subtype 2)                     */         
*        3 SMF72PGL FIXED(15),    /* Length of performance group                
*                                    period data section (subtype 1)            
*                                    or length of performance group/            
*                                    domain control section                     
*                                    (subtype 2)                     */         
*        3 SMF72PGN FIXED(15)     /* Number of performance group                
*                                    period data sections (subtype 1)           
*                                    or number of performance group/            
*                                    domain control sections                    
*                                    (subtype 2)                 @B1C*/         
*                                                                               
*%IF IFAR722 ^= 'YES' %THEN %GOTO LHDX30; /* Not subtype 2       @C4C*/         
*/* Individual header extension for subtype 2                    @C4A*/         
*@SPACE;                                                                        
*                            ,    /* Continuation of SMF72HDX    @C4C*/         
*        3 SMF72SWS FIXED(31),    /* Offset to swap reason data                 
*                                    section (subtype 2 only)    @B1A*/         
*        3 SMF72SWL FIXED(15),    /* Length of swap reason data                 
*                                    section (subtype 2 only)    @B1A*/         
*        3 SMF72SWN FIXED(15)     /* Number of swap reason data                 
*                                    sections (subtype 2 only)   @B1A*/         
*                                                            /* 2@C4D*/         
*%LHDX30:;                                                   /*  @C4A*/         
                             ;    /* End of SMF72HDX             @C4A*/         
*%LHDX3:;                                                    /*  @C4A*/         
*%IF IFAR723 ^= 'YES' %THEN %GOTO LHDX4; /* Not subtype 3        @C4A*/         
*/* Individual header extension for subtype 3                    @C4A*/         
*@SPACE;                                                                        
*%IF IFAR721 = 'YES' ! IFAR722 = 'YES' %THEN %DO;        /*  @WA05544*/         
*/*  Subtypes 1 or 2 are also included                           @C4A*/         
*                                                                               
*   DECLARE                                                                     
*    1 SMF723HX DEFINED(SMF72HDX),/* Subtype 3 header extension  @C4A*/         
*%END;                                                   /*  @WA05544*/         
*%ELSE %DO;                                              /*  @WA05544*/         
*                                                                               
*      3 SMF723HX,                /* Subtype 3 header extension  @C4A*/         
*%END;                                                   /*  @WA05544*/         
*                                                            /*  @C4D*/         
*        5 SMF72WMS FIXED(31),    /* Offset to workload manager                 
*                                    control section (subtype3)  @C1A*/         
*        5 SMF72WML FIXED(15),    /* Length of workload manager                 
*                                    control section                            
*                                    (subtype 3)                 @C1A*/         
*        5 SMF72WMN FIXED(15),    /* Number of workload manager                 
*                                    control sections                           
*                                    (subtype 3)                 @C1C*/         
*        5 SMF72SSS FIXED(31),    /* Offset to service class                    
*                                    served data (subtype 3)     @C1A*/         
*        5 SMF72SSL FIXED(15),    /* Length of service class                    
*                                    served data (subtype 3)     @C1A*/         
*        5 SMF72SSN FIXED(15),    /* Number of service class                    
*                                    served data (subtype 3)     @C1A*/         
*        5 SMF72RGS FIXED(31),    /* Offset to resource group data              
*                                    section (subtype 3)         @C1A*/         
*        5 SMF72RGL FIXED(15),    /* Length of resource group data              
*                                    section (subtype 3)         @C1A*/         
*        5 SMF72RGN FIXED(15),    /* Number of resource group data              
*                                    sections (subtype 3)        @C1A*/         
*        5 SMF72SCS FIXED(31),    /* Offset to period data section              
*                                    (subtype 3)                 @J2C*/         
*        5 SMF72SCL FIXED(15),    /* Length of period data section              
*                                    (subtype 3)                 @J2C*/         
*        5 SMF72SCN FIXED(15),    /* Number of period data sections             
*                                    (subtype 3)                 @J2C*/         
*        5 SMF72RTS FIXED(31),    /* Offset to response time                    
*                                    distribution bucket data section           
*                                    (subtype 3)                 @C1A*/         
*        5 SMF72RTL FIXED(15),    /* Length of response time                    
*                                    distribution bucket data section           
*                                    (subtype 3)                 @C1A*/         
*        5 SMF72RTN FIXED(15),    /* Number of response time                    
*                                    distribution bucket data sections          
*                                    (subtype 3)                 @C1A*/         
*        5 SMF72WRS FIXED(31),    /* Offset to work/resource manager            
*                                    state (subtype 3)           @C1A*/         
*        5 SMF72WRL FIXED(15),    /* Length of work/resource manager            
*                                    state (subtype 3)           @C1A*/         
*        5 SMF72WRN FIXED(15),    /* Number of work/resource manager            
*                                    state (subtype 3)           @C4C*/         
*        5 SMF72DNS FIXED(31),    /* Offset to resource delay                   
*                                    names section (subtype 3)   @21A*/         
*        5 SMF72DNL FIXED(15),    /* Length of resource delay                   
*                                    names section (subtype 3)   @21A*/         
*        5 SMF72DNN FIXED(15);    /* Number of resource delay                   
*                                    names sections (subtype 3)  @21A*/         
*                                                            /* 3@C4D*/         
*%LHDX4:;                                                    /*  @C4A*/         
*%IF IFAR724 ^= 'YES' %THEN %GOTO LHDX5; /* Not subtype 4        @51C*/         
*/* Individual header extension for subtype 4                    @C4A*/         
*%IF IFAR721 = 'YES' ! IFAR722 = 'YES' %THEN %DO;     /*     @WA05544*/         
*/*  Subtypes 1 or 2 are also included                       @WA05544*/         
*                                                                               
*   DECLARE                                                                     
*    1 SMF724HX DEFINED(SMF72HDX),/* Subtype 4 header ext    @WA05544*/         
*%END;                                                /*     @WA05544*/         
*%ELSE %DO;                                           /*     @WA05544*/         
*                                                                               
*      3 SMF724HX,                /* Subtype 4 header ext    @WA05544*/         
*%END;                                                /*     @WA05544*/         
*        5 SMF72CPS FIXED(31),    /* Offset to service class period             
*                                    data sections (subtype4)    @C2A*/         
*        5 SMF72CPL FIXED(15),    /* Length of service class period             
*                                    data sections (subtype4)    @C2A*/         
*        5 SMF72CPN FIXED(15),    /* Number of service class period             
*                                    data sections (subtype4)    @C2A*/         
*        5 SMF72SPS FIXED(31),    /* Offset to swap reason data                 
*                                    sections (subtype 4)        @C2A*/         
*        5 SMF72SPL FIXED(15),    /* Length of swap reason data                 
*                                    sections (subtype 4)        @C2A*/         
*        5 SMF72SPN FIXED(15);    /* Number of swap reason data                 
*                                    sections (subtype 4)        @C4C*/         
*@SPACE;                                                                        
*                                                                               
*%LHDX5:;                                                      /*@51A*/         
*%IF IFAR725 ^= 'YES' %THEN %GOTO LPRO; /* Not subtype 5         @51A*/         
*/* Individual header extension for subtype 5                    @51A*/         
*%IF IFAR721 = 'YES' ! IFAR722 = 'YES'! IFAR724 = 'YES' %THEN %DO;              
*                                                              /*@51A*/         
*/*  Subtypes 1 or 2 or 4 are also included                      @51A*/         
*                                                                               
*   DECLARE                                                                     
*    1 SMF725HX DEFINED(SMF72HDX),/* Subtype 5 header ext        @51A*/         
*%END;                                                         /*@51A*/         
*%ELSE %DO;                                                    /*@51A*/         
*                                                                               
*      3 SMF725HX,                /* Subtype 5 header ext        @51A*/         
*%END;                                                         /*@51A*/         
*        /* System suspend locks                                 @51A*/         
*        5 SMF72SES FIXED(31),    /* Offset to serialization control            
*                                    section (subtype5)          @51A*/         
*        5 SMF72SEL FIXED(15),    /* Length of serialization control            
*                                    section (subtype5)          @51A*/         
*        5 SMF72SEN FIXED(15),    /* Number of serialization control            
*                                    section (subtype5)          @51A*/         
*        5 SMF72CMS FIXED(31),    /* Offset to CMS lock data                    
*                                    section (subtype 5)         @51A*/         
*        5 SMF72CML FIXED(15),    /* Length of CMS lock data                    
*                                    section (subtype 5)         @51A*/         
*        5 SMF72CMN FIXED(15),    /* Number of CMS lock data                    
*                                    sections (subtype 5)        @51A*/         
*        5 SMF72EDS FIXED(31),    /* Offset to CMS EnqueueDequeue               
*                                    lock data section (subtype 5)              
*                                                                @51A*/         
*        5 SMF72EDL FIXED(15),    /* Length of CMS EnqueueDequeue               
*                                    lock data section (subtype 5)              
*                                                                @51A*/         
*        5 SMF72EDN FIXED(15),    /* Number of CMS EnqueueDequeue               
*                                    lock data sections (subtype 5)             
*                                                                @51A*/         
*        5 SMF72LAS FIXED(31),    /* Offset to CMS Latch lock data              
*                                    section (subtype 5)         @51A*/         
*        5 SMF72LAL FIXED(15),    /* Length of CMS Latch lock data              
*                                    section (subtype 5)         @51A*/         
*        5 SMF72LAN FIXED(15),    /* Number of CMS Latch lock data              
*                                    sections (subtype 5)        @51A*/         
*        5 SMF72SMS FIXED(31),    /* Offset to CMS SMF lock data                
*                                    section (subtype 5)         @51A*/         
*        5 SMF72SML FIXED(15),    /* Length of CMS SMF lock data                
*                                    section (subtype 5)         @51A*/         
*        5 SMF72SMN FIXED(15),    /* Number of CMS SMF lock data                
*                                    sections (subtype 5)        @51A*/         
*        5 SMF72LOS FIXED(31),    /* Offset to Local lock data                  
*                                    section (subtype 5)         @51A*/         
*        5 SMF72LOL FIXED(15),    /* Length of Local lock data                  
*                                    section (subtype 5)         @51A*/         
*        5 SMF72LON FIXED(15),    /* Number of Local lock data                  
*                                    sections (subtype 5)        @51A*/         
*        5 SMF72COS FIXED(31),    /* Offset to CML Lock Owner data              
*                                    section (subtype 5)         @51A*/         
*        5 SMF72COL FIXED(15),    /* Length of CML Lock Owner data              
*                                    section (subtype 5)         @51A*/         
*        5 SMF72CON FIXED(15),    /* Number of CML Lock Owner data              
*                                    sections (subtype 5)        @51A*/         
*        5 SMF72CRS FIXED(31),    /* Offset to CML Lock Requestor data          
*                                    section (subtype 5)         @51A*/         
*        5 SMF72CRL FIXED(15),    /* Length of CML Lock Requestor data          
*                                    section (subtype 5)         @51A*/         
*        5 SMF72CRN FIXED(15),    /* Number of CML Lock Requestor data          
*                                    sections (subtype 5)        @51A*/         
*        /* GRS data sections                                    @51A*/         
*        5 SMF72LCS FIXED(31),    /* Offset to Latch Creator data               
*                                    section (subtype 5)         @51A*/         
*        5 SMF72LCL FIXED(15),    /* Length of Latch Creator data               
*                                    section (subtype 5)         @51A*/         
*        5 SMF72LCN FIXED(15),    /* Number of Latch Creator data               
*                                    sections (subtype 5)        @51A*/         
*        5 SMF72LRS FIXED(31),    /* Offset to Latch Requestor data             
*                                    section (subtype 5)         @51A*/         
*        5 SMF72LRL FIXED(15),    /* Length of Latch Requestor data             
*                                    section (subtype 5)         @51A*/         
*        5 SMF72LRN FIXED(15),    /* Number of Latch Requestor data             
*                                    sections (subtype 5)        @51A*/         
*        5 SMF72TDS FIXED(31),    /* Offset to ENQ SCOPE=STEP data              
*                                    section (subtype 5)         @51A*/         
*        5 SMF72TDL FIXED(15),    /* Length of ENQ SCOPE=STEP data              
*                                    section (subtype 5)         @51A*/         
*        5 SMF72TDN FIXED(15),    /* Number of ENQ SCOPE=STEP data              
*                                    sections (subtype 5)        @51A*/         
*        5 SMF72YDS FIXED(31),    /* Offset to ENQ SCOPE=SYSTEM data            
*                                    section (subtype 5)         @51A*/         
*        5 SMF72YDL FIXED(15),    /* Length of ENQ SCOPE=SYSTEM data            
*                                    section (subtype 5)         @51A*/         
*        5 SMF72YDN FIXED(15),    /* Number of ENQ SCOPE=SYSTEM data            
*                                    sections (subtype 5)        @51A*/         
*        5 SMF72SDS FIXED(31),    /* Offset to ENQ SCOPE=SYSTEMS data           
*                                    section (subtype 5)         @51A*/         
*        5 SMF72SDL FIXED(15),    /* Length of ENQ SCOPE=SYSTEMS data           
*                                    section (subtype 5)         @51A*/         
*        5 SMF72SDN FIXED(15),    /* Number of ENQ SCOPE=SYSTEMS data           
*                                    sections (subtype 5)        @51A*/         
*        5 SMF72QSS FIXED(31),    /* Offset to GRS QScan data                   
*                                    section  (subtype 5)        @63A*/         
*        5 SMF72QSL FIXED(15),    /* Length of GRS QScan data                   
*                                    section  (subtype 5)        @63A*/         
*        5 SMF72QSN FIXED(15);    /* Number of GRS QScan data                   
*                                    sections (subtype 5)        @63A*/         
*@SPACE;                                                                        
*   /* Constant for the number of lock types that are handled in     */         
*   /* SMF record 72.5.                                              */         
*   /* Must be increased whenever a new lock type is added ]     @51A*/         
*   DECLARE                                                                     
*     SMF72NLT  FIXED(8) CONSTANT(13);/* Number of data types    @63C*/         
*@SPACE;                                                                        
*%LPRO:;                                                      /* @C1C*/         
*                                                             /* @C4D*/         
*    /* COMMON RMF PRODUCT SECTION */                                           
*?ERBPRO TYPE(72) ATTRIBUT(BASED(ADDR(SMF72HDR)+SMF72PRS));                     
 @SPACE;                                                                        
 %IF IFAR721 = 'YES' %THEN %GOTO LR721;                      /* @C1A*/          
 %IF IFAR722 = 'YES' %THEN %GOTO LR722;                       /*@W1A*/          
 %IF IFAR723 = 'YES' %THEN %GOTO LR723;                      /* @C1A*/          
 %IF IFAR724 = 'YES' %THEN %GOTO LR724;                      /* @C2A*/          
 %IF IFAR725 = 'YES' %THEN %GOTO LR725;                      /* @51A*/          
 %LR721:;                                                     /*@W1A*/          
 @SPACE;                                                                        
     /* Control Section for Subtype I                               */          
*    /* WORKLOAD CONTROL SECTION */                                             
*   DCL 1 SMF72CTL BASED(ADDR(SMF72HDR)+SMF72WLS),                              
*        3 SMF72FG1 BIT(8),       /* FLAGS                           */         
*         4 *        BIT(3),      /* Reserved                    @F1C*/         
*         4 SMF72OVE BIT(1),      /* x'10' WLM I/O Priority Mgmt @F1A*/         
*         4 SMF72CAA BIT(1),      /* x'08' RCAA data not available,             
*                                          RC 08/RSN 0831 from IWMRCOLL         
*                                                                @C1A*/         
*         4 SMF72ACN BIT(1),      /* x'04' Account information                  
*                                          used                  @R0C*/         
*         4 SMF72RPT BIT(1),      /* x'02' Report Class              */         
*         4 SMF72CHF BIT(1),      /* x'01' Change to performance                
*                                    sensitive variable was made     */         
*        3 SMF72RV3 BIT(8),       /* RESERVED                        */         
*        3 SMF72SUB CHAR(2),      /* SUB-CATEGORY CODE, PERF.GROUP # */         
*        3 SMF72HPG FIXED(15),    /* HIGHEST PERF GP # DEFINED IN IPS*/         
*        3 SMF72IPS CHAR(8),      /* NAME OF IPS(INSTAL PERF SPEC)   */         
*        3 *        CHAR(3),      /* Reserved                                   
*                                                                @A2C*/         
*        3 *        CHAR(3),      /* Reserved                                   
*                                                                @A2C*/         
*        3 SMF72ERF CHAR(6),      /* ERV RESOURCE MANAGER                       
*                                    COEFFICIENT                     */         
*        3 SMF72ISD CHAR(4),      /* IOC SERVICE DEFINITION                     
*                                    COEFFICIENT                     */         
*        3 SMF72CSD CHAR(4),      /* CPU SERVICE DEFINITION                     
*                                    COEFFICIENT                     */         
*        3 SMF72RV4 CHAR(4),      /* RESERVED SINCE RMF 4.2.0    @Y1C*/         
*                                                             /* @Y1D*/         
*        3 SMF72SSD CHAR(4),      /* SRB SERVICE DEFINITION                     
*                                    COEFFICIENT                     */         
*        3 SMF72OPT CHAR(8),      /* OPT MEMBER NAME                 */         
*        3 SMF72ICS CHAR(8),      /* ICS MEMBER NAME                 */         
*        3 SMF72SYS CHAR(4),      /* SUBSYSTEM FOR THIS PGN          */         
*        3 SMF72CLS CHAR(10),     /* CLASS FOR THIS PGN              */         
*        3 SMF72USR CHAR(10),     /* USERID FOR THIS PGN             */         
*        3 SMF72NAM CHAR(10),     /* TRANSACTION NAME FOR THIS PGN   */         
*        3 SMF72ADJ FIXED(31),    /* VALUE OF RMCTADJC           @P1A*/         
*        3 SMF72MSD CHAR(8),      /* MSO SERVICE COEFFICIENT     @C3C*/         
*        3 SMF72SRV CHAR(10),     /* Service class (SRVCLASS) as                
*                                    specified in ICSMSRVC       @C3A*/         
*        3 SMF72RV5 CHAR(2);      /* Reserved                    @C3A*/         
*    /* PERFORMANCE GROUP PERIOD DATA */                                        
*   %IF SMFARRAY = 'YES' %THEN %GOTO ARR72;                                     
*   DCL 1 SMF72PGP BASED(ADDR(SMF72HDR)+SMF72PGS),                              
*       %GOTO CONT72;                                                           
*%ARR72:;                                                                       
*   DCL 1 SMF72PGP(*) BASED(ADDR(SMF72HDR)+SMF72PGS),                           
*%CONT72:;                                                                      
*       2 SMF72WKL,               /*                         @WA05544*/         
*        3 SMF72TTX FIXED(32),    /* # OF TERMINATED TRANSACTIONS    */         
*        3 SMF72ACT FIXED(32),    /*ALL TRANS ACTIVE TIME-1K MIC SEC */         
*        3 SMF72SER FIXED(32),    /* ALL TRANS SERVICE UNITS         */         
*        3 SMF72TTM FIXED(32),    /*TERM TRANS ELAPSED TIME-1K MICSEC*/         
*        3 *        FIXED(31),    /* Now reserved (WLL up to 4.2.0)  */         
*        3 SMF72MTS FIXED(32),    /* MSO TOTAL SERVICE               */         
*        3 SMF72ITS FIXED(32),    /* I/O TOTAL SERVICE               */         
*        3 SMF72CTS FIXED(32),    /* CPU TOTAL SERVICE               */         
*        3 SMF72TAT FIXED(32),    /* TRANSACTION                                
*                                    ACTIVE TIME IN                             
*                                    STORAGE                         */         
*        3 SMF72SPP FIXED(32),    /* NO. SWAPS IN PERIOD             */         
*        3 SMF72CDN FIXED(16),    /* CURRENT DOMAIN NO.              */         
*        3 *        BIT(8),       /* Reserved                    @A2C*/         
*        3 SMF72TSG BIT(8),       /* TIME SLICE GRP NUMBER           */         
*        3 SMF72STS FIXED(32),    /* SRB TOTAL SERVICE               */         
*        3 SMF72ETS,              /* SUM-SQUARES ENDED TRANS         */         
*          4 SMF72ET1 FIXED(32),  /* WORD 1                          */         
*          4 SMF72ET2 FIXED(32),  /* WORD 2                          */         
*        3 SMF72PIN FIXED(32),    /* NUMBER OF PAGE-INS          @R0A*/         
*        3 SMF72FRS,              /* ACTIVE FRAME-TIME           @R0A*/         
*          4 SMF72FT1 FIXED(32),  /* WORD 1                      @R0A*/         
*          4 SMF72FT2 FIXED(32),  /* WORD 2                      @W2C*/         
*        3 SMF72HIN FIXED(32),    /* Num of hiperspace page-ins  @W2A*/         
*        3 SMF72HRM FIXED(32),    /* Num of hiperspace read miss @W2A*/         
*        3 SMF72BPI FIXED(32),    /* Number of blocked pages paged in.          
*                                                                @A2A*/         
*        3 SMF72PIE FIXED(32),    /* Single pages in from expanded,             
*                                    incl 1st page of each block @A2A*/         
*        3 SMF72BPE FIXED(32),    /* Blocked pages in from expanded,            
*                                    not including 1st page      @A2A*/         
*        3 SMF72BKA FIXED(32),    /* Number of blocks paged in from             
*                                    AUX                         @A2A*/         
*        3 SMF72BKE FIXED(32),    /* Number of blocks paged in from             
*                                    expanded                    @A2A*/         
*        3 SMF72ERS,              /* Expanded storage frame residency           
*                                    time                                       
*                                    Units: 1024 Microseconds    @A2A*/         
*          4 SMF72ER1 FIXED(32),  /* Word 1 of residency time    @A2A*/         
*          4 SMF72ER2 FIXED(32),  /* Word 2 of residency time    @A2A*/         
*        3 SMF72RCT FIXED(32),    /* Region Control Task time                   
*                                    Units: Microseconds         @A2A*/         
*        3 SMF72IIT FIXED(32),    /* I/O interrupt process. time                
*                                    Units: Microseconds         @A2A*/         
*        3 SMF72HST FIXED(32),    /* Hiperspace service time                    
*                                    Units: Microseconds         @A2A*/         
*        3 SMF72TST FIXED(32),    /* Total system transaction time              
*                                    of ended transactions                      
*                                    Units: 1024 Microseconds    @C1C*/         
*        3 SMF72VEL,              /* Execution velocity data     @C1A*/         
*          5 SMF72CUS FIXED(32),  /* CPU using samples. These are               
*                                    included in SMF72TOU.       @E1C*/         
*          5 SMF72TOT FIXED(32),  /* Total delay samples used in                
*                                    SRM's execution velocity                   
*                                    calculation. With WLM's I/O                
*                                    support, this also includes                
*                                    I/O delay samples, if SMF72OVE             
*                                    is true.                    @F1C*/         
*        ?ERBFITEM(3 SMF72SRS) FLOAT(56);, /* Total                             
*                                    shared page residency                      
*                                    time (1024 microseconds)                   
*                                    (long floating point)       @D1A*/         
*        ?ERBFITEM(3 SMF72SPA) FLOAT(56);, /* Total shared page-ins             
*                                    from auxiliary storage                     
*                                    (long floating point)       @D1A*/         
*        ?ERBFITEM(3 SMF72SPE) FLOAT(56);, /* Total shared page-ins             
*                                    expanded storage                           
*                                    (long floating point)       @E1C*/         
*        ?ERBFITEM(3 SMF72ICT) FLOAT(56);, /* Total DASD I/O connect            
*                                    time in 128 microsecond units.             
*                                    (long floating point)       @E1A*/         
*        ?ERBFITEM(3 SMF72IWT) FLOAT(56);, /* Total DASD I/O wait               
*                                    time (queue time + pending time in         
*                                    128 microsecond units. This field          
*                                    does not include IOS queue                 
*                                    time. (long floating point) @E1A*/         
*        ?ERBFITEM(3 SMF72IDT) FLOAT(56);, /* Total DASD I/O disconnect         
*                                    time in 128 microsecond units.             
*                                    (long floating point)       @E1A*/         
*        3 SMF72IRC FIXED(32),    /* Total DASD I/O count. This can be          
*                                    used with the above fields                 
*                                    (SMF72ICT, SMF72IWT, and SMF72IDT)         
*                                    to determine the average DASD              
*                                    response time for the period.              
*                                                                @E1A*/         
*        3 SMF72TOU FIXED(32),    /* Total usings. Velocity should              
*                                    be calculated as SMF72TOU /                
*                                    (SMF72TOU+SMF72TOT).        @E1A*/         
*        3 SMF72IOU FIXED(32),    /* Total I/O usings. These are                
*                                    included in SMF72TOU. Only non             
*                                    paging DASD I/O can contribute             
*                                    to I/O using                @E1A*/         
*        3 SMF72NDI FIXED(32),    /* Non DASD I/O using or delay @F1C*/         
*        3 SMF72IOD FIXED(32),    /* Total I/O delays.           @F1A*/         
*        ?ERBFITEM(3 SMF72TSA) FLOAT(56);, /*                                   
*                                    Total execution samples. It is             
*                                    the sum of RCAETOTU, RCAETOTD,             
*                                    RCAEUNKN, and RCAEIDLE.  Also              
*                                    always includes I/O                        
*                                    using/delay samples whether or             
*                                    not I/O samples are included               
*                                    in RCAETOTU or RCAETOTD,                   
*                                    respectively. (long floating               
*                                    point)                      @F1A*/         
*        ?ERBFITEM(3 SMF72IOT) FLOAT(56);, /*                                   
*                                    Total DASD IOS queue time in 128           
*                                    microsecond units (long floating           
*                                    point)                      @F1A*/         
*        3 SMF72QDT FIXED(32),    /* Total queue delay time. For                
*                                    batch jobs this is the time jobs           
*                                    spent on the job queue while               
*                                    eligible to run on some system.            
*                                    It represents the time the jobs            
*                                    spent waiting for an initiator.            
*                                    For TSO users, this time can be            
*                                    a portion of the LOGON process.            
*                                    For APPC this is the time an               
*                                    APPC request spends on an APPC             
*                                    queue. (long floating point in             
*                                    1024 micro- second units)   @F1A*/         
*        3 SMF72ADT FIXED(32),    /* Total time batch jobs were                 
*                                    ineligible to run because a                
*                                    resource the job had affinity to           
*                                    was unavailable. Only applies to           
*                                    batch work.  zero for other work           
*                                    types. (long floating point in             
*                                    1024 microsecond units)     @F1A*/         
*        3 SMF72CVT FIXED(32),    /* Total time batch jobs spent in             
*                                    JCL conversion.  Only applies to           
*                                    batch work. Zero for other work            
*                                    types. (long floating point in             
*                                    1024 microsecond units)     @F1A*/         
*        3 SMF72IQT FIXED(32),   /*  Total time batch jobs spend on             
*                                    job queue (after JCL conversion)           
*                                    while ineligible to run on any             
*                                    system for reasons other than              
*                                    resource affinities. Only                  
*                                    applies to batch work. Zero for            
*                                    other work types. (long floating           
*                                    point in 1024 microsecond units)           
*                                                                @I1C*/         
*        3 SMF72IEA FIXED(32),   /*  Independent enclave total                  
*                                    transaction active time (in                
*                                    1024 microsecond units) for                
*                                    enclaves that originated on                
*                                    this system.                @I1A*/         
*        3 SMF72XEA FIXED(32),   /*  Exported enclave total                     
*                                    transaction active time (in                
*                                    1024 microsecond units).    @I1A*/         
*        3 SMF72FEA FIXED(32);   /*  Foreign enclave total                      
*                                    transaction active time (in                
*                                    1024 microsecond units).    @I1A*/         
*%IF IFAR722 = 'YES' %THEN %GOTO LR722; /* Subtype 2 data        @C4A*/         
*%IF IFAR723 = 'YES' %THEN %GOTO LR723; /* Subtype 3 data        @C4A*/         
*%IF IFAR724 = 'YES' %THEN %GOTO LR724; /* Subtype 4 data        @C4A*/         
*%IF IFAR725 = 'YES' %THEN %GOTO LR725; /* Subtype 5 data        @51A*/         
*%GOTO LR72END;                   /* Goto end of file            @C4A*/         
*@SPACE;                                                                        
*%LR722:;                                                      /*@W1A*/         
*                                                             /* @C4D*/         
*@SPACE;                                                                        
*   /* Control Section for Subtype 2                                 */         
*DECLARE                                                                        
* 1 R722WKL BASED(ADDR(SMF72HDR)+SMF72WLS),                    /*@W1A*/         
*   3 R722TSR FIXED(16),            /* Total number of small records            
*                                      in interval               @W1A*/         
*   3 *       CHAR(2),              /* Reserved for future use   @W1A*/         
*   3 R722TOT FIXED(32),            /* Total number of data sections            
*                                      in interval               @W1A*/         
*   3 R722NXT FIXED(32),            /* Number of data sections in               
*                                      following records         @W1A*/         
*   3 R722IPS CHAR(8);              /* Name of IPS               @W1A*/         
*@SPACE;                                                                        
*   /* Data Section                                                  */         
*DECLARE                                                                        
* 1 R722DATA BASED(ADDR(SMF72HDR)+SMF72PGS),                   /*@W1A*/         
*   3 R722PG   FIXED(15),           /* Performance group number  @W1A*/         
*   3 R722DMN  FIXED(15),           /* Domain number             @W1A*/         
*   3 R722CLR,                      /* This minor structure is                  
*                                      cleared after a record is                
*                                      written.                  @W1A*/         
*     5 R722USER FIXED(31),         /* Sum of all users found    @W1A*/         
*     5 R722ACTV FIXED(31),         /* Sum of all active users found            
*                                                                @W1A*/         
*     5 R722PAGE FIXED(31),         /* Sum of all users delayed                 
*                                      for paging at all samples.               
*                                                                @B1C*/         
*     5 R722SWAP FIXED(31),         /* Sum of all users delayed                 
*                                      for swapping at all samples.             
*                                                                @B1C*/         
*     5 R722OUTR FIXED(31),         /* Sum of all out and ready                 
*                                      users at all samples.     @B1C*/         
*     5 R722ACTF FIXED(31),         /* Sum of all active frames.                
*                                      This field contains X'7FFFFFFF'          
*                                      if the value will not fit in             
*                                      the field.                               
*                                      The field R722ACFF contains              
*                                      the value in floating point.             
*                                                                @B1C*/         
*     5 R722ACTS FIXED(31),         /* Sum of all active samples                
*                                      (except OUTR)             @W1A*/         
*     5 R722IDLE FIXED(31),         /* Sum of all idle frames                   
*                                      This field contains X'7FFFFFFF'          
*                                      if the value will not fit in             
*                                      the field.                               
*                                      The field R722IDLF contains              
*                                      the value in floating point.             
*                                                                @B1C*/         
*     5 R722IDLS FIXED(31),         /* Sum of all idle samples   @W1A*/         
*     5 R722PGIN FIXED(31),         /* Sum of all page-ins       @W1A*/         
*     5 R722SLOT FIXED(31),         /* Sum of all slots used                    
*                                      This field contains X'7FFFFFFF'          
*                                      if the value will not fit in             
*                                      the field.                               
*                                      The field R722SLTF contains              
*                                      the value in floating point.             
*                                                                @B1C*/         
*     5 R722DIV FIXED(31),          /* Sum of all DIV frames.                   
*                                      This field contains X'7FFFFFFF'          
*                                      if the value will not fit in             
*                                      the field.                               
*                                      The field R722DIVF contains              
*                                      the value in floating point.             
*                                                                @B1C*/         
*     5 R722DIVS FIXED(31),         /* Sum of all DIV samples    @W1A*/         
*     5 R722FIX FIXED(31),          /* Sum of all fixed frames                  
*                                      This field contains X'7FFFFFFF'          
*                                      if the value will not fit in             
*                                      the field.                               
*                                      The field R722FIXF contains              
*                                      the value in floating point.             
*                                                                @B1C*/         
*     5 R722ET BIT(64),             /* Total elapsed time for all               
*                                      transactions that ended in               
*                                      the group. Does not include              
*                                      queued time.              @B1A*/         
*     5 R722QT BIT(64),             /* Total time spent on JES or               
*                                      APPC queues by all transactions          
*                                      that ended in the group.  @B1A*/         
*     5 R722END  FIXED(31),         /* The number of transactions               
*                                      that ended in the group.  @B1A*/         
*     5 R722UPRO FIXED(31),         /* Total processor using samples            
*                                      for the group             @B1A*/         
*     5 R722UDEV FIXED(31),         /* Total device using samples               
*                                      for the group             @B1A*/         
*     5 R722DPRO FIXED(31),         /* Total processor delay samples            
*                                      for the group             @B1A*/         
*     5 R722DDEV FIXED(31),         /* Total device delay samples               
*                                      for the group             @B1A*/         
*     5 R722DSTO FIXED(31),         /* Total storage delay samples              
*                                      for the group             @B1A*/         
*     5 R722DJES FIXED(31),         /* Total JES delay samples                  
*                                      for the group             @B1A*/         
*     5 R722DHSM FIXED(31),         /* Total HSM delay samples                  
*                                      for the group             @B1A*/         
*     5 R722DXCF FIXED(31),         /* Total XCF delay samples                  
*                                      for the group             @B1A*/         
*     5 R722DENQ FIXED(31),         /* Total ENQ delay samples                  
*                                      for the group             @B1A*/         
*     5 R722DMNT FIXED(31),         /* Total mount delay samples                
*                                      for the group             @B1A*/         
*     5 R722DMSG FIXED(31),         /* Total message delay samples              
*                                      for the group             @B1A*/         
*     5 R722UNKN FIXED(31),         /* Total unknown state samples              
*                                      for the group             @B1A*/         
*     5 R722VALD FIXED(31),         /* Total valid samples for                  
*                                      the group (single state sum              
*                                      of all using, delay, idle,               
*                                      and unknown)              @B1A*/         
*     5 R722LSCT FIXED(31),         /* Count of "long" logical                  
*                                      swaps for the group       @B1A*/         
*     5 R722ESCT FIXED(31),         /* Count of "long" swaps to                 
*                                      expanded storage for the group           
*                                                                @B1A*/         
*     5 R722PSCT FIXED(31),         /* Count of "long" physical                 
*                                      swaps for the group       @B1A*/         
*     5 R722LSCF CHAR(4),           /* Sum of all central frames                
*                                      for all logically swapped                
*                                      users at all samples.                    
*                                      Floating point.           @B1A*/         
*     5 R722LSEF CHAR(4),           /* Sum of all expanded frames               
*                                      for all logically swapped                
*                                      users at all samples.                    
*                                      Floating point.           @B1A*/         
*     5 R722LSSA FIXED(31),         /* Total logically swapped                  
*                                      samples for the group     @B1A*/         
*     5 R722PSEF CHAR(4),           /* Sum of all expanded frames               
*                                      for all swapped users (except            
*                                      logical) at all samples.                 
*                                      Floating point.           @B1A*/         
*     5 R722PSSA FIXED(31),         /* Total swapped samples for the            
*                                      group (except logical).   @B1A*/         
*     5 R722VECT FIXED(31),         /* Total vector utilization                 
*                                      time for the group.       @B1A*/         
*     5 R722ACFF CHAR(4),           /* Sum of all active frames.                
*                                      Floating point.           @B1A*/         
*     5 R722IDLF CHAR(4),           /* Sum of all idle frames.                  
*                                      Floating point.           @B1A*/         
*     5 R722SLTF CHAR(4),           /* Sum of all slots used                    
*                                      Floating point.           @B1A*/         
*     5 R722DIVF CHAR(4),           /* Sum of all DIV frames                    
*                                      Floating point.           @B1A*/         
*     5 R722FIXF CHAR(4),           /* Sum of all fixed frames.                 
*                                      Floating point.           @B1A*/         
*     ?ERBFITEM(5 R722TSV) FLOAT(56);, /* Sum of                                
*                                      shared page views                        
*                                      (long floating point)     @D1A*/         
*     ?ERBFITEM(5 R722VIN) FLOAT(56);, /* Sum of shared pages                   
*                                      in central storage                       
*                                      that are valid                           
*                                      (long floating point)     @D1A*/         
*     ?ERBFITEM(5 R722VLC) FLOAT(56);, /* Sum of shared page                    
*                                      validations                              
*                                      (long floating point)     @D1A*/         
*     ?ERBFITEM(5 R722GPI) FLOAT(56);; /* Sum of shared page-ins                
*                                      from auxiliary storage                   
*                                      (long floating point)     @D1A*/         
*@SPACE;                                                                        
*   /* Swap reason data section                                      */         
*DECLARE                                                                        
* 1 R722SWRE BASED(ADDR(SMF72HDR)+SMF72SWS),                  /* @B1A*/         
*   3 R722OR1  FIXED(31),           /* STOR/OUTR delay samples for              
*                                      swap reason 1:                           
*                                      Terminal output wait  @WA01699*/         
*   3 R722OR2  FIXED(31),           /* STOR/OUTR delay samples for              
*                                      swap reason 2:                           
*                                      Terminal input wait   @WA01699*/         
*   3 R722OR3  FIXED(31),           /* STOR/OUTR delay samples for              
*                                      swap reason 3:                           
*                                      Long wait                 @B1A*/         
*   3 R722OR4  FIXED(31),           /* STOR/OUTR delay samples for              
*                                      swap reason 4:                           
*                                      Auxiliary storage shortage               
*                                                                @B1A*/         
*   3 R722OR5  FIXED(31),           /* STOR/OUTR delay samples for              
*                                      swap reason 5:                           
*                                      Real storage shortage     @B1A*/         
*   3 R722OR6  FIXED(31),           /* STOR/OUTR delay samples for              
*                                      swap reason 6:                           
*                                      Detected long wait        @B1A*/         
*   3 R722OR7  FIXED(31),           /* STOR/OUTR delay samples for              
*                                      swap reason 7:                           
*                                      Requested swap            @B1A*/         
*   3 R722OR8  FIXED(31),           /* STOR/OUTR delay samples for              
*                                      swap reason 8:                           
*                                      Enqueue exchange swap     @B1A*/         
*   3 R722OR9  FIXED(31),           /* STOR/OUTR delay samples for              
*                                      swap reason 9:                           
*                                      Exchange swap             @B1A*/         
*   3 R722OR10 FIXED(31),           /* STOR/OUTR delay samples for              
*                                      swap reason 10:                          
*                                      Unilateral swap           @B1A*/         
*   3 R722OR11 FIXED(31),           /* STOR/OUTR delay samples for              
*                                      swap reason 11:                          
*                                      Transition swap           @B1A*/         
*   3 R722OR12 FIXED(31),           /* STOR/OUTR delay samples for              
*                                      swap reason 12:                          
*                                      Improve central storage usage            
*                                                                @B1A*/         
*   3 R722OR13 FIXED(31),           /* STOR/OUTR delay samples for              
*                                      swap reason 13:                          
*                                      Improve system paging rate               
*                                                                @B1A*/         
*   3 R722OR14 FIXED(31),           /* STOR/OUTR delay samples for              
*                                      swap reason 14:                          
*                                      Make room for an out too long            
*                                      user                      @B1A*/         
*   3 R722OR15 FIXED(31),           /* STOR/OUTR delay samples for              
*                                      swap reason 15:                          
*                                      APPC wait                 @B2C*/         
*   3 R722OR16 FIXED(31),           /* STOR/OUTR delay samples for              
*                                      swap reason 16:                          
*                                      OMVS input wait           @B2A*/         
*   3 R722OR17 FIXED(31),           /* STOR/OUTR delay samples for              
*                                      swap reason 17:                          
*                                      OMVS output wait          @B2A*/         
*   3 R722OR18 FIXED(31);           /* STOR/OUTR delay samples for              
*                                      swap reason 18:                          
*                                      In-real swap              @J3A*/         
*%IF IFAR723 = 'YES' %THEN %GOTO LR723; /* Subtype 3 data        @C4A*/         
*%IF IFAR724 = 'YES' %THEN %GOTO LR724; /* Subtype 4 data        @C4A*/         
*%IF IFAR725 = 'YES' %THEN %GOTO LR725; /* Subtype 5 data        @51A*/         
*%GOTO LR72END;                     /* Goto end of file          @C4A*/         
*@SPACE;                                                                        
*%LR723:;                                                      /*@C1A*/         
*                                                             /* @C4D*/         
*@SPACE;                                                                        
*   /* Subtype III Data Sections                                     */         
*   /* Workload Manager Control Section                              */         
*DECLARE                                                                        
* 1 R723WMS  BASED(ADDR(SMF72HDR)+SMF72WMS),                  /* @C1A*/         
*   3 R723MSCF BIT(8),              /* Service class flags       @C1A*/         
*     5 R723MRCL BIT(1),            /* x'80' This is a report class             
*                                      (RCAARCL)                 @C1A*/         
*     5 R723MCAA BIT(1),            /* x'40' RCAA data not available            
*                                      RC 08/RSN 0831 from IWMRCOLL             
*                                                                @C1A*/         
*     5 R723MPOL BIT(1),            /* x'20' SVPOL data not available           
*                                                                @C1A*/         
*     5 R723MOVE BIT(1),            /* x'10' System is calculating              
*                                      velocity using I/O delays @E2A*/         
*     5 R723MCPP BIT(1),            /* x'08' Indicator for CPU                  
*                                      protection                @I2A*/         
*     5 R723MSTP BIT(1),            /* x'04' Indicator for storage              
*                                      protection                @I2A*/         
*     5 R723MDAT BIT(1),            /* x'02' Indicator for dynamic              
*                                      alias management          @I2A*/         
*     5 R723MIPG BIT(1),            /* x'01' Indicator for I/O                  
*                                      priority group HIGH       @64A*/         
*   3 R723MFLG BIT(8),              /* Flags                     @K2A*/         
*     5 R723MICO BIT(1),            /* Indicates zAAP (IFA)                     
*                                      crossover                 @K2A*/         
*     5 R723MHPO BIT(1),            /* Indicates zAAP (IFA)                     
*                                      honor priority            @K2A*/         
*     5 R723MHPZ BIT(1),            /* Indicates zIIP honor                     
*                                      priority                  @12A*/         
*     5 R723HISF BIT(1),            /* Failure returned by HISMT                
*                                      service. Multithreading                  
*                                      maximum capacity numerator               
*                                      values are invalid.       @71A*/         
*     5 R723MNHP BIT(1),            /* Indicates ineligibility for              
*                                      honor priority. When ON,                 
*                                      specialty engine eligible work           
*                                      in this service class is not             
*                                      offloaded to CPs for help                
*                                      processing                @83A*/         
*     5 R723MTRC BIT(1),            /* Indicator for a tenant report            
*                                      class                     @91A*/         
*     5 R723MDIS BIT(1),            /* Service class and tenant report          
*                                      class periods that are assoc-            
*                                      iated with a resource group and          
*                                      have assigned a discretionary            
*                                      goal are excluded from workload          
*                                      management                @91A*/         
*     5 *        BIT(1),            /* Reserved                  @91A*/         
*   3 R723MFL2 BIT(8),              /* Additional flags          @92A*/         
*     5 R723MAPO BIT(1),            /* At least one zAAP online in              
*                                      sysplex (or local system when            
*                                      not joined to a sysplex)  @92A*/         
*     5 R723MCBO BIT(1),            /* Reserved for future use   @93C*/         
*     5 *        BIT(6),            /* Reserved                  @92A*/         
*   3 R723MRS2 CHAR(1),             /* Reserved                  @92C*/         
*   3 R723MNSP CHAR(8),             /* Policy name               @C1A*/         
*   3 R723MDSP CHAR(32),            /* Policy description        @C1A*/         
*   3 R723MTPA CHAR(8),             /* Local time/date (STCK format of          
*                                      policy activation         @C1A*/         
*   3 R723MCPU FIXED(32),           /* System pre-set CPU service               
*                                      coefficient (CPU = 1 * 10000).           
*                                      The number by which accumulated          
*                                      CPU service units will be                
*                                      multiplied (weighted) @OA62081*/         
*   3 R723MIOC FIXED(32),           /* System pre-set I/O service               
*                                      coefficient (IOC=0)      @A04C*/         
*   3 R723MMSO FIXED(32),           /* System pre-set storage service           
*                                      coefficient (MSO=0)      @A04C*/         
*   3 R723MSRB FIXED(32),           /* System pre-set SRB service               
*                                      coefficient (SRB = 1 * 10000).           
*                                      The number by which accumulated          
*                                      SRB service units will be                
*                                      multiplied (weighted) @OA62081*/         
*   3 R723MTVL FIXED(32),           /* Current sample interval (in              
*                                      milliseconds).  This is the              
*                                      frequency with which WLM                 
*                                      samples delays reported in the           
*                                      RCAA                      @C1A*/         
*   3 R723MTV# FIXED(32),           /* Total number of times WLM                
*                                      sampling code ran.  A RMF                
*                                      issuing successive calls to              
*                                      IWMRCOLL should not assume that          
*                                      WLM sampling code ran at the             
*                                      interval specified by R723MTVL           
*                                      between its calls.  This field           
*                                      can be used to translate                 
*                                      sampled state data into actual           
*                                      percentages of time.      @C1A*/         
*   3 R723MOPT CHAR(2),             /* OPT member suffix                        
*                                      (RCAAOPT)                 @C1A*/         
*   3 R723MRS3 CHAR(2),             /* reserved                  @C1A*/         
*   3 R723MWNM CHAR(8),             /* Workload group name       @C1A*/         
*   3 R723MWDE CHAR(32),            /* Workload group                           
*                                      description               @C1A*/         
*   3 R723MCNM CHAR(8),             /* Service/Report class name @C1A*/         
*   3 R723MCDE CHAR(32),            /* Service/Report class                     
*                                      description               @C1A*/         
*   3 R723MCPG FIXED(15),           /* Number of periods belonging to           
*                                      this service or report class             
*                                                                @J2C*/         
*   3 R723MSUB FIXED(8),            /* Number of entries belonging              
*                                      to a subsystem. (See R723MSEC            
*                                      for current release value).              
*                                                                @C1A*/         
*   3 R723MRS4 CHAR(3),             /* Reserved                  @C1A*/         
*   3 R723MERF CHAR(6),             /* ERV resource factor coefficient          
*                                      (from RMPTOPE)            @C1A*/         
*   3 R723MADJ FIXED(31),           /* Value of RMCTADJC - adjustment           
*                                      factor for CPU rate       @C1A*/         
*   3 R723MIDN CHAR(8),             /* Service definition name   @C1A*/         
*   3 R723MIDD CHAR(32),            /* Service definition description           
*                                                                @C1A*/         
*   3 R723MTDI CHAR(8),             /* Local time/date (STCK format)            
*                                      the service definition was               
*                                      installed                 @C1A*/         
*   3 R723MIDU CHAR(8),             /* Userid that installed the                
*                                      service definition        @J2C*/         
*   3 R723CLSC Char(8),             /* Service class that last                  
*                                      contributed to this report               
*                                      class. Blank if this is a                
*                                      service class.            @J2A*/         
*   3 R723NFFCBP Fixed(31),         /* Reserved for future use   @93C*/         
*     5 R723NFFI Fixed(31),         /* Normalization factor for zAAP            
*                                      (IFA). Multiply zAAP service             
*                                      times or service units with              
*                                      this value and divide by 256             
*                                      to calculate the CP equivalent           
*                                      value                     @93C*/         
*   3 R723NFFS Fixed(31),           /* Normalization factor for zIIP.           
*                                      Multiply zIIP service units with         
*                                      this value and divide by 256 to          
*                                      calculate the CP equivalent              
*                                      value.                @OA13499*/         
*   3 R723NADJ Fixed(31),           /* Nominal adjustment factor                
*                                      for CPU rate          @OA29530*/         
*   3 R723CECA Fixed(32),           /* CEC adjustment factor     @71C*/         
*   3 R723MCF  Fixed(32),           /* Multithreading maximum                   
*                                      capacity numerator for general           
*                                      purpose processors. Divide this          
*                                      value by 1024 to get the multi-          
*                                      threading maximum capacity               
*                                      factor for all general purpose           
*                                      processors that were configured          
*                                      ONLINE for the complete                  
*                                      interval.                 @71A*/         
*   3 R723MCFS Fixed(32),           /* Multithreading maximum                   
*                                      capacity numerator for zIIP.             
*                                      Divide this value by 1024 to             
*                                      get the multithreading                   
*                                      maximum capacity factor for all          
*                                      zIIPs that were configured               
*                                      ONLINE for the complete                  
*                                      interval.                                
*                                      A zero value is reported if no           
*                                      zIIP is currently installed.             
*                                                                @71A*/         
*   3 R723MCFI Fixed(32),           /* Multithreading maximum                   
*                                      capacity numerator for zAAP.             
*                                      Divide this value by 1024 to             
*                                      get the multithreading                   
*                                      maximum capacity factor for all          
*                                      zAAPs that were configured               
*                                      ONLINE for the complete                  
*                                      interval.                                
*                                      A zero value is reported if no           
*                                      zAAP is currently installed.             
*                                                                @91C*/         
*   3 R723CPA_actual FIXED(31),     /* Physical CPU adjustment factor           
*                                      based on Model Capacity Rating           
*                                                                @91A*/         
*   3 R723CPA_scaling_factor FIXED(31),                                         
*                                   /* Scaling factor for                       
*                                      R723CPA_actual and                       
*                                      R723CPA_actual_zCBP       @92C*/         
*   3 R723CPA_actual_zCBP Fixed(31); /* Reserved for future use  @93C*/         
*@SPACE;                                                                        
*DECLARE                                                                        
*   R723MSEC FIXED(8) CONSTANT(2);  /* Number (constant) of entries             
*                                      belonging to a subsystem. In             
*                                      RMF510 this number is 2. This            
*                                      number is kept in R723MSUB.              
*                                                                @C1A*/         
*@SPACE;                                                                        
*   /* Service Classes being served                                  */         
*DECLARE                                                                        
* 1 R723SSS  BASED(ADDR(SMF72HDR)+SMF72SSS), /* Service classes being           
*                                      served by one or more AS in              
*                                      service class R723MCNM    @C1A*/         
*   3 R723SCSN CHAR(8),             /* Name of service class being              
*                                      served                    @C1A*/         
*   3 R723SCS# FIXED(32);           /* Number of times an AS running            
*                                      with service class R723MCNM              
*                                      served service class                     
*                                      R723SCSN                  @C1A*/         
*@SPACE;                                                                        
*   /* Resource Group Data Section                                   */         
*DECLARE                                                                        
* 1 R723RGS  BASED(ADDR(SMF72HDR)+SMF72RGS), /* Resource group                  
*                                      data                      @C1A*/         
*   3 R723GGNM CHAR(8),             /* Resource group name       @C1A*/         
*   3 R723GGDE CHAR(32),            /* Resource group                           
*                                      description               @C1A*/         
*   3 R723GGLT BIT(8),              /* Resource group flags      @C1A*/         
*     5 R723GMXS BIT(1),            /* x'80' Maximum capacity was               
*                                      specified                 @C1A*/         
*     5 R723GMNS BIT(1),            /* x'40' Minimum capacity was               
*                                      specified                 @C1A*/         
*     5 R723GGPV BIT(1),            /* Specification of R723GGMN and            
*                                      R723GGMX is in percentage of the         
*                                      LPAR share rather than in                
*                                      service units. In addition, the          
*                                      scope of the resource group is           
*                                      system-wide rather than                  
*                                      sysplex-wide              @03A*/         
*     5 R723GGPC BIT(1),            /* Specification of R723GGMN and            
*                                      R723GGMX is in percentage of a           
*                                      single processor capacity rather         
*                                      than in service units.                   
*                                      In addition, the scope of the            
*                                      resource group is system-wide            
*                                      rather than sysplex-wide  @03A*/         
*     5 R723GMLS BIT(1),            /* Memory limit was specified               
*                                                                @83A*/         
*     5 R723GGMS BIT(1),            /* Specification of R723GGMN and            
*                                      R723GGMX is in MSU/h rather              
*                                      than in service units     @91A*/         
*     5 R723GISP BIT(1),            /* Specialty processor consumption          
*                                      is included into the WLM capping         
*                                      algorithms, i.e. R723GGMN and            
*                                      R723GGMX limit the combined              
*                                      general purpose and specialty            
*                                      processor consumption     @91A*/         
*     5 R723GRS1 BIT(1),            /* Reserved                  @91C*/         
*   3 R723GGTF BIT(8),              /* Tenant resource group flags              
*                                                                @91A*/         
*     5 R723GTRG BIT(1),            /* Indicator for a tenant resource          
*                                      group                     @91A*/         
*     5 R723GCBP BIT(1),            /* Reserved for future use   @93C*/         
*     5 *        BIT(6),            /* Reserved                  @92C*/         
*   3 R723GRS2 CHAR(2),             /* Reserved                  @91C*/         
*   3 R723GGMN FIXED(32),           /* If R723GMNS is ON, minimum               
*                                      capacity of the resource group.          
*                                      If R723GGPV, R723GGPC and                
*                                      R723GGMS are OFF, this value             
*                                      is in unweighted CPU service             
*                                      units per second. In addition,           
*                                      the scope of the resource group          
*                                      is sysplex-wide.                         
*                                      If R723GGPV, R723GGPC or                 
*                                      R723GGMS is ON, see description          
*                                      of R723GGLT           @OA62081*/         
*   3 R723GGMX FIXED(32),           /* If R723GMXS is ON, maximum               
*                                      capacity of the resource group.          
*                                      If R723GGPV, R723GGPC and                
*                                      R723GGMS are OFF, this value             
*                                      is in unweighted CPU service             
*                                      units per second. In addition,           
*                                      the scope of the resource group          
*                                      is sysplex-wide.                         
*                                      If R723GGPV, R723GGPC or                 
*                                      R723GGMS is ON, see description          
*                                      of R723GGLT           @OA62081*/         
*   3 R723GGML FIXED(32),           /* If R723GMLS is ON, memory limit          
*                                      of the resource group     @91C*/         
*   3 R723GGTI CHAR(8),             /* Tenant identifier. Only valid            
*                                      if R723GTRG is ON.        @91A*/         
*   3 R723GGTN CHAR(32),            /* Tenant name. Only valid if               
*                                      R723GTRG is ON.           @91A*/         
*   3 R723GGKY CHAR(64);            /* Solution identifier. Only valid          
*                                      if R723GTRG is ON.        @91A*/         
*@SPACE;                                                                        
*   /* Service or Report Class Period Data - GOALS               @J2C*/         
*DECLARE                                                                        
* 1 R723SCS  BASED(ADDR(SMF72HDR)+SMF72SCS),                  /* @C1A*/         
*   3 R723CRTX FIXED(15),           /* Index into the response time             
*                                      distribution buckets. Entry 0            
*                                      represents the distribution              
*                                      map                       @C1A*/         
*   3 R723CWMX FIXED(15),           /* Index into the work/resource             
*                                      manager states area       @C1A*/         
*   3 R723CWMN FIXED(15),           /* Number of entries in the                 
*                                      work/resource manager states             
*                                      area associated with this                
*                                      service class period (R723CWMX           
*                                      points to the first entry)               
*                                                                @C1A*/         
*   3 R723CRS1 BIT(8),              /* Report class period flags @J2C*/         
*     5 R723CRPH  BIT(1),           /* This report class period is              
*                                      heterogeneous.            @J2A*/         
*     5 R723CRS6  BIT(7),           /* Reserved                  @J2A*/         
*   3 R723CADF BIT(8),              /* Actuals data section flag                
*                                                                @C1A*/         
*     5 R723CRCA  BIT(1),           /* Resource consumption data                
*                                      actuals (R723CRCD) are                   
*                                      available                 @C1A*/         
*     5 R723CRTA  BIT(1),           /* Response time data actuals               
*                                      (R723CRTD) are available                 
*                                                                @C1A*/         
*     5 R723CEDA  BIT(1),           /* General execution delay data             
*                                      actuals (R723CGDE) are                   
*                                      available                 @C1A*/         
*     5 R723CRS5  BIT(5),           /* Reserved                  @C1A*/         
*@SPACE;                                                                        
*   /* Period - GOALS. For a report class period, these          @J2A*/         
*   /* are the goals of the service class period that            @J2A*/         
*   /* last contributed to this report class period. For         @J2A*/         
*   /* a homogeneous report class period, this goal must         @J2A*/         
*   /* be used to format the response time distribution.         @J2A*/         
*@SPACE;                                                                        
*   3 R723COAL,                     /* Period GOALS              @J2C*/         
*     5 R723CPER FIXED(8),          /* Period number             @J2C*/         
*     5 R723CRTF BIT(8),            /* Response time flags       @C1A*/         
*       7 R723CMIL BIT(1),          /* x'80' Response time specified in         
*                                      milliseconds              @C1A*/         
*       7 R723CSEC BIT(1),          /* x'40' Response time specified in         
*                                      seconds                   @C1A*/         
*       7 R723CMIN BIT(1),          /* x'20' Response time specified in         
*                                      minutes                   @C1A*/         
*       7 R723CHOU BIT(1),          /* x'10' Response time specified in         
*                                      hours                     @C1A*/         
*       7 R723CRS2 BIT(4),          /* Reserved                  @C1A*/         
*     5 R723CRGF BIT(8),            /* Response time goal flags  @C1A*/         
*       7 R723CPRC BIT(1),          /* x'80' Percentile response time           
*                                      goal                      @C1A*/         
*       7 R723CAVG BIT(1),          /* x'40' Average response time              
*                                      goal                      @C1A*/         
*       7 R723CVEL BIT(1),          /* x'20' Execution velocity goal            
*                                      goal                      @C1A*/         
*       7 R723CDSC BIT(1),          /* x'10' Discretionary goal  @C1A*/         
*       7 R723CSTM BIT(1),          /* x'08' System specified goal              
*                                                                @C1A*/         
*       7 R723CRS3 BIT(3),          /* Reserved                  @C1A*/         
*     5 R723CRS4 CHAR(1),           /* Reserved                  @C1A*/         
*     5 R723CVAL FIXED(32),         /* Response time goal - or                  
*                                      Execution velocity goal - or             
*                                      zero if discretionary, system            
*                                      or no goal                @C1A*/         
*     5 R723CPCT FIXED(16),         /* Goal percentile value     @C1A*/         
*     5 R723CIMP FIXED(16),         /* Relative importance of the goal          
*                                      to be achieved for this service          
*                                      class period (1=highest,                 
*                                      5=lowest)                 @C1A*/         
*     5 R723CDUR FIXED(32),         /* Service class period duration in         
*                                      service units, or zero for last          
*                                      period                    @C1A*/         
*@SPACE;                                                                        
*   /* Resource Data - ACUTALS                                   @J2C*/         
*@SPACE;                                                                        
*   3 R723CRCD BDY(DWORD),          /* Srv/Rep class period resource            
*                                      data. ALL service units are              
*                                      weighted by the coefficients             
*                                      in the active policy      @J2C*/         
*     5 R723CSRV CHAR(8),           /* Total service units                      
*                                      (floating point 64-bit long              
*                                      format)                   @C1A*/         
*     5 R723CCPU CHAR(8),           /* Total CPU service units                  
*                                      (floating point 64-bit long              
*                                      format)                   @C1A*/         
*     5 R723CIOC CHAR(8),           /* Total IOC service units                  
*                                      (floating point 64-bit long              
*                                      format)                   @C1A*/         
*     5 R723CMSO CHAR(8),           /* Total storage service units              
*                                      (floating point 64-bit long              
*                                      format)                   @C1A*/         
*     5 R723CSRB CHAR(8),           /* Total SRB service units                  
*                                      (floating point 64-bit long              
*                                      format)                   @C1A*/         
*     5 R723CPIR CHAR(8),           /* Total page-in count                      
*                                      (floating point 64-bit long              
*                                      format)                   @C1A*/         
*     5 R723CHPI CHAR(8),           /* Total hiperspace page-in count           
*                                      (floating point 64-bit long              
*                                      format)                   @C1A*/         
*     5 R723CBPI CHAR(8),           /* Total block page-in from aux             
*                                      count (floating point 64-bit             
*                                      long format)              @C1A*/         
*     5 R723CPIE CHAR(8),           /* Total page-in from expanded              
*                                      count (floating point 64-bit             
*                                      long format)              @C1A*/         
*     5 R723CBPE CHAR(8),           /* Total block page-in from                 
*                                      expanded count (floating point           
*                                      64-bit long format)       @C1A*/         
*     5 R723CBKA CHAR(8),           /* Total aux blocks paged in                
*                                      (floating point 64-bit long              
*                                      format)                   @C1A*/         
*     5 R723CBKE CHAR(8),           /* Total expanded blocks paged in           
*                                      (floating point 64-bit long              
*                                      format)                   @C1A*/         
*     5 R723CPRS CHAR(8),           /* Total page residency time                
*                                      (1024 microsecond) (floating             
*                                       point 64-bit long format)               
*                                                                @C1A*/         
*     5 R723CERS CHAR(8),           /* Total expanded page residency            
*                                      time (1024 microseconds)                 
*                                      (floating point 64-bit long              
*                                      format)                   @C1A*/         
*     5 R723CTRR CHAR(8),           /* Total in storage residency time          
*                                      (1024 microsecond) (floating             
*                                       point 64-bit long format)               
*                                                                @C1A*/         
*     5 R723CTAT CHAR(8),           /* Total transaction active time            
*                                      (1024 microsecond) (floating             
*                                       point 64-bit long format)               
*                                                                @C1A*/         
*     5 R723CRCT CHAR(8),           /* Total RCT time (microseconds)            
*                                      (floating point 64-bit long              
*                                      format)                   @C1A*/         
*     5 R723CIIT CHAR(8),           /* Total I/O interrupt time                 
*                                      (microsecond) (floating                  
*                                       point 64-bit long format)               
*                                                                @C1A*/         
*     5 R723CHST CHAR(8),           /* Total hiperspace service time            
*                                      (microseconds) (floating point           
*                                      64-bit long format)       @C1A*/         
*     5 R723CSWC FIXED(32),         /* Total swap count          @C1A*/         
*     5 R723CCRM FIXED(32),         /* Total hiperspace eso read miss           
*                                      count                     @C1A*/         
*@SPACE;                                                                        
*   /* Reponse Time Data - ACTUALS                               @J2C*/         
*@SPACE;                                                                        
*   3 R723CRTD BDY(DWORD),          /* Srv/Rep class period response            
*                                      time data                 @J2C*/         
*     5 R723CRCP FIXED(32),         /* Count of transaction completions         
*                                      for this period. This field              
*                                      includes transaction completions         
*                                      reported by subsystem work               
*                                      managers via the IWMRPT                  
*                                      service                   @C1A*/         
*     5 R723CARC FIXED(32),         /* Count of transaction that                
*                                      completed abnormally as reported         
*                                      by subsystem work manager. This          
*                                      value is not part of R723CRCP            
*                                      and should not be used for               
*                                      response time                            
*                                      calculations              @C1A*/         
*     5 R723CNCP FIXED(32),         /* Count of transaction that                
*                                      completed their execution phase          
*                                      as reported by subsystem work            
*                                      managers via the IWMNTFY                 
*                                      service                   @C1A*/         
*     5 R723CANC FIXED(32),         /* Count of transaction that                
*                                      completed their execution phase          
*                                      abnormally as reported by                
*                                      subsystem work Manager. This             
*                                      value is not part of R723CNCP            
*                                      and should not be used for               
*                                      execution response time                  
*                                      calculations              @C1A*/         
*     5 R723CTET CHAR(8),           /* Total transaction elapsed time           
*                                      (1024 microsecond) (floating             
*                                       point 64-bit long format)               
*                                                                @C1A*/         
*     5 R723CXET CHAR(8),           /* Total transaction execution              
*                                      time (1024 microseconds)                 
*                                      (floating point 64-bit long              
*                                      format)                   @C1A*/         
*     5 R723CETS CHAR(8),           /* Sum of transaction elapsed times         
*                                      squared (1024 microseconds)              
*                                      (floating point 64-bit long              
*                                       format)                  @C1A*/         
*@SPACE;                                                                        
*   /* General Execution Delays - ACTUALS                        @J2C*/         
*@SPACE;                                                                        
*   3 R723CGDE,                     /* General execution delay                  
*                                      data                      @C1A*/         
*     5 R723CEVD,                   /* Execution velocity data   @C1A*/         
*       7 R723CCUS FIXED(32),       /* CPU using samples         @C1A*/         
*       7 R723CTOT FIXED(32),       /* Total delay samples used in              
*                                      SRM's execution velocity                 
*                                      calculation               @C1A*/         
*     5 R723CEDL,                   /* General execution delays                 
*                                      included in R723CTOT. Each               
*                                      dispatchable unit of work                
*                                      sampled can increase one of              
*                                      the CPU or paging delay                  
*                                      samples                   @C1A*/         
*       7 R723CCDE FIXED(32),       /* CPU delay. A TCB or SRB is               
*                                      waiting to be dispatched (other          
*                                      than the first in-line behind            
*                                      sampler) or a TCB is waiting for         
*                                      local lock                @C1A*/         
*       7 R723CCCA FIXED(32),       /* CPU capping delay. A TCB or SRB          
*                                      is marked non-dispatchable               
*                                      because a resource group maximum         
*                                      is being enforced. Note that             
*                                      R723CCCA is NOT a subset of              
*                                      R723CCDE                  @C1A*/         
*       7 R723CSWI FIXED(32),       /* Swap-in delay. Swap-in has               
*                                      started, but not completed               
*                                      completed                 @C1A*/         
*       7 R723CMPL FIXED(32),       /* MPL delay. Ready but swap-in has         
*                                      not started               @C1A*/         
*       7 R723CAPR FIXED(32),       /* AUX page from private     @C1A*/         
*       7 R723CACO FIXED(32),       /* AUX page from common      @C1A*/         
*       7 R723CAXM FIXED(32),       /* AUX page from cross memory               
*                                      memory                    @C1A*/         
*       7 R723CVIO FIXED(32),       /* AUX page from VIO         @C1A*/         
*       7 R723CHSP FIXED(32),       /* AUX page from standard                   
*                                      hiperspaces               @C1A*/         
*       7 R723CCHS FIXED(32),       /* AUX page from eso                        
*                                      hiperspaces               @C1A*/         
*     5 R723CUNK FIXED(32),         /* Unknown. Dispatchable unit or            
*                                      AS is waiting, but none of the           
*                                      above reasons apply. These               
*                                      samples are not included in              
*                                      R723CTOT                  @C1A*/         
*     5 R723CIDL FIXED(32),         /* Idle. Work is in STIMER wait,            
*                                      TSO terminal wait, APPC wait, or         
*                                      is an initiator waiting for              
*                                      work. These samples are not              
*                                      included in R723CTOT      @C1A*/         
*     5 R723CPDE FIXED(32),         /* Resource group capping count.            
*                                      Group maximum is being enforced          
*                                      for work in this service class.          
*                                      These samples are not included           
*                                      in R723CTOT               @C1A*/         
*     5 R723CPQU FIXED(32),         /* Quiesce count. Some work in this         
*                                      service class has been reset via         
*                                      the RESET xxx, QUIESCE command.          
*                                      These samples are not included           
*                                      in R723CTOT               @C1A*/         
*     5 R723CSAC FIXED(32),         /* Sampled address space count.             
*                                      Number of address spaces that            
*                                      contributed delay and using              
*                                      samples to this service class.           
*                                      These samples are not included           
*                                      in R723CTOT               @C1A*/         
*     ?ERBFITEM(5 R723CSRS) FLOAT(56);, /* Total                                
*                                      shared page residency                    
*                                      time (1024 microseconds)                 
*                                      (long floating point)     @D1A*/         
*     ?ERBFITEM(5 R723CSPA) FLOAT(56);, /* Total shared page-ins                
*                                      from auxiliary storage                   
*                                      (long floating point)     @D1A*/         
*     ?ERBFITEM(5 R723CSPE) FLOAT(56);, /* Total shared page-ins                
*                                      from expanded storage                    
*                                      (long floating point)     @E1C*/         
*@SPACE;                                                                        
*   /* Additional Resource Consumption Data                      @J2C*/         
*@SPACE;                                                                        
*   3 R723CARE,                     /* Resource consumption data                
*                                                                @E1A*/         
*     ?ERBFITEM(5 R723CICT) FLOAT(56);, /* Total DASD I/O connect time          
*                                      in 128 microsecond units  @E1A*/         
*     ?ERBFITEM(5 R723CIWT) FLOAT(56);, /* Total DASD I/O wait time             
*                                      (queue time + pending time in            
*                                      128 microsecond units)    @E1A*/         
*     ?ERBFITEM(5 R723CIDT) FLOAT(56);, /* Total DASD I/O disconnect            
*                                      time in 128 microsecond units.           
*                                      Does not include IOS queue               
*                                      time.                     @E1A*/         
*     5 R723CIRC FIXED(32),         /* Total DASD I/O count. This               
*                                      can be used with the above               
*                                      fields (R723CICT, R723CIWT,              
*                                      and R723CIDT) to determine the           
*                                      average DASD resp. time for the          
*                                      period.                                  
*                                      (long floating point)     @E1A*/         
*@SPACE;                                                                        
*   /* Additional General Execution Delay Data - Actuals         @J2C*/         
*@SPACE;                                                                        
*   3 R723CAGE,                     /* General execution delay data             
*                                      - actuals                 @E1A*/         
*     5 R723CTOU FIXED(32),         /* Total usings. Velocity should            
*                                      be calculated as R723CTOU/               
*                                      (R723CTOU+R723CTOT).      @E1A*/         
*     5 R723CIOU FIXED(32),         /* Total I/O usings. These are              
*                                      included in R723CTOU. Only non-          
*                                      paging DASD I/Os can contribute          
*                                      to I/O usings.            @E1A*/         
*     /* The following delay counters are included in R723CTOT       */         
*     5 R723CIOD FIXED(32),         /* DASD I/O delay samples    @E1A*/         
*     5 R723CQ   FIXED(32),         /* Queue delay samples. Work is             
*                                      waiting for a server      @E1A*/         
*     5 R723CSPV FIXED(32),         /* Server private area paging               
*                                      delay samples             @E1A*/         
*     5 R723CSVI FIXED(32),         /* Server space VIO paging delay            
*                                      samples                   @E1A*/         
*     5 R723CSHS FIXED(32),         /* Server hiperspace paging delay           
*                                      samples                   @E1A*/         
*     5 R723CSMP FIXED(32),         /* Server MPL delay samples  @E1A*/         
*     5 R723CSSW FIXED(32),         /* Server swap-in delay samples             
*                                                                @E1A*/         
*     /* Non DASD I/O using or delay samples                         */         
*     5 R723CNDI FIXED(32),         /* Non DASD I/O using or delay              
*                                      samples                   @F1C*/         
*     5 R723CTDQ FIXED(32),         /* Total delay samples always               
*                                      including batch queue delay.             
*                                      For service classes that                 
*                                      contain batch jobs that were             
*                                      not run in WLM managed                   
*                                      initiators the batch queue               
*                                      delay samples are derived from           
*                                      the measured batch queue delay           
*                                      time.  For service classes               
*                                      that contain jobs that ran in            
*                                      WLM managed initiators this              
*                                      value is the same as RCEATOTD.           
*                                      RCAETOTDQ can be used as a               
*                                      migration aid to determine               
*                                      what a batch service class               
*                                      period's velocity will be if             
*                                      its jobs are run in WLM                  
*                                      managed initators         @F2A*/         
*     ?ERBFITEM(5 R723CTSA) Float(56);, /* Total execution samples. It          
*                                      is the sum of RCAETOTU,                  
*                                      RCAETOTD, RCAEUNKN and RCAEIDLE.         
*                                      Also always includes I/O                 
*                                      using/delay samples whether or           
*                                      not I/O samples are included             
*                                      in RCAETOTU or RCAETOTD,                 
*                                      respectively.                            
*                                      (Long floating point)     @F1A*/         
*     ?ERBFITEM(5 R723CIOT) Float(56);, /* Total DASD IOS queue time in         
*                                      128 microsecond units (long              
*                                      floating point)           @F1A*/         
*     ?ERBFITEM(5 R723CQDT) Float(56);, /* Total queue delay time. For          
*                                      batch jobs this is the time              
*                                      jobs spent on the job queue              
*                                      while eligible to run on some            
*                                      system. It represents the time           
*                                      the jobs spent waiting for an            
*                                      initiator. For TSO users, this           
*                                      time can be a portion of the             
*                                      LOGON process. For APPC this             
*                                      is the time an APPC request              
*                                      spends on an APPC queue. (long           
*                                      floating point in 1024 micro-            
*                                      second units)             @F1A*/         
*     ?ERBFITEM(5 R723CADT) Float(56);, /* Total time batch jobs were           
*                                      ineligible to run because a              
*                                      resource the job had affinity            
*                                      to was unavailable. Only                 
*                                      applies to batch work.  Zero             
*                                      for other work types. (long              
*                                      floating point in 1024                   
*                                      microsecond units)        @F1A*/         
*     ?ERBFITEM(5 R723CCVT) Float(56);, /* Total time batch jobs spent          
*                                      in JCL conversion. Only applies          
*                                      to batch work. Zero for other            
*                                      work types. (long floating               
*                                      point in 1024 microsecond                
*                                      units)                    @F1A*/         
*     ?ERBFITEM(5 R723CIQT) Float(56);, /* Total time batch jobs spend          
*                                      on job queue (after JCL                  
*                                      conversion) while ineligible             
*                                      to run on any system for                 
*                                      reasons other than resource              
*                                      affinities. Only applies to              
*                                      batch work. Zero for other               
*                                      work types. (long floating               
*                                      point in 1024 microsecond                
*                                      units)                    @I1C*/         
*     ?ERBFITEM(5 R723CIEA) Float(56);, /* Independent enclave total            
*                                      transaction active time (in              
*                                      1024 microsecond units) for              
*                                      enclaves that originated on              
*                                      this system.              @I1A*/         
*     ?ERBFITEM(5 R723CXEA) Float(56);, /* Exported enclave total               
*                                      transaction active time (in              
*                                      1024 microsecond units).  @I1A*/         
*     ?ERBFITEM(5 R723CFEA) Float(56);, /* Foreign enclave total                
*                                      transaction active time (in              
*                                      1024 microsecond units).  @J1C*/         
*     /* Crypto using and delay samples                              */         
*     5 R723CAMU FIXED(32),         /* No longer used            @82C*/         
*     5 R723CAMD FIXED(32),         /* No longer used            @82C*/         
*     5 R723APU  FIXED(32),         /* AP crypto using samples.                 
*                                      A TCB was found executing                
*                                      on a Cryptographic Assist                
*                                      Processor                 @J1A*/         
*     5 R723APD  FIXED(32),         /* AP crypto delay samples.                 
*                                      A TCB was found waiting                  
*                                      for a Cryptographic Assist               
*                                      Processor                 @J1A*/         
*     5 R723FQD  FIXED(32),         /* Feature queue delay samples.             
*                                      A TCB was found waiting on               
*                                      a processor feature queue                
*                                      associated with a CPU. Subset            
*                                      of R723CCDE. Note, R723CCUS              
*                                      includes feature queue using             
*                                      samples.                  @J1A*/         
*@SPACE;                                                                        
*   /* Report Class Period Data                              @WA56739*/         
*@SPACE;                                                                        
*   3 R723PLSC Char(8),             /* Service class that last                  
*                                      contributed to this report               
*                                      class period during this                 
*                                      interval. Blank if this is a             
*                                      service class period  @WA56739*/         
*@SPACE;                                                                        
*   /* Additional General Execution Delay Data                   @K1A*/         
*@SPACE;                                                                        
*   3 R723CADD,                     /* General execution delay data             
*                                                                @K1A*/         
*     5 R723RCOD FIXED(32),         /* Contention delay samples                 
*                                      count or work waiting for                
*                                      resources as reported to WLM             
*                                      by a resource manager     @K1A*/         
*     5 R723RCOU FIXED(32),         /* Contention using samples                 
*                                      count of work holding                    
*                                      resources as reported to WLM             
*                                      by a resource manager     @K1A*/         
*     ?ERBFITEM(5 R723ECTC) Float(56);, /* CPU time consumed while              
*                                      dispatching priority was                 
*                                      temporarily raised by enqueue            
*                                      management because the work              
*                                      held a resource that other work          
*                                      needed (in 1024 microsecond              
*                                      units)                    @K2C*/         
*     5 *        UNION,             /*                           @92A*/         
*      6 R723CBPSAM,                /* Reserved for future use   @93C*/         
*       7 R723CBPU  FIXED(32),      /* Reserved for future use   @93C*/         
*       7 R723CBPCU FIXED(32),      /* Reserved for future use   @93C*/         
*       7 R723CBPD  FIXED(32),      /* Reserved for future use   @93C*/         
*      6 R723IFASAM,                /* zAAP (IFA) samples        @93C*/         
*       7 R723IFAU   FIXED(32),     /* zAAP (IFA) using samples  @92C*/         
*       7 R723IFCU   FIXED(32),     /* zAAP (IFA) on CP using samples.          
*                                      These are included in R723CCUS           
*                                                                @92C*/         
*       7 R723IFAD   FIXED(32),     /* zAAP (IFA) delay samples  @92C*/         
*     5 R723IFAT CHAR(8),           /* Reserved                  @31C*/         
*     5 R723IFCT CHAR(8),           /* Reserved                  @31C*/         
*     5 R723SUPU FIXED(32),         /* zIIP using samples    @OA13499*/         
*     5 R723SUCU FIXED(32),         /* zIIP on CP using samples.                
*                                      These are included in R723CCUS           
*                                                                @12C*/         
*     5 R723SUPD FIXED(32),         /* zIIP delay samples    @OA13499*/         
*@SPACE;                                                                        
*   /* Special purpose processor service units               @OA13499*/         
*@SPACE;                                                                        
*     ?ERBFITEM(5 R723CSUP) Float(56);, /* Total service units on               
*                                      zIIPs.                                   
*                                      Multiply with R723NFFS and               
*                                      divide by 256 to calculate the           
*                                      CP equivalent value.  @OA13499*/         
*     ?ERBFITEM(5 R723CSUC) Float(56);, /* Total service units on CPs           
*                                      spent by zIIP eligible work              
*                                                            @OA13499*/         
*     ?ERBFITEM(5 R723CCBP) Float(56);, /* Reserved for future use              
*                                                                @93C*/         
*     ?ERBFITEM(7 R723CIFA) Float(56);, /* Total service units on               
*                                      zAAPs.                                   
*                                      Multiply with R723NFFI and               
*                                      divide by 256 to calculate               
*                                      the CP equivalent value.  @93C*/         
*     ?ERBFITEM(5 R723CCBPC) Float(56);, /* Reserved for future use             
*                                                                @93C*/         
*     ?ERBFITEM(7 R723CIFC) Float(56);, /* Total service units on CPs           
*                                      spent by zAAP eligible work              
*                                                                @93C*/         
*@SPACE;                                                                        
*   /* Additional resource data                                  @11A*/         
*@SPACE;                                                                        
*     ?ERBFITEM(5 R723TPDP) Float(56);, /* CPU time consumed while              
*                                      dispatching priority of work             
*                                      with low importance was                  
*                                      temporarily raised to help               
*                                      blocked workloads                        
*                                      (in 1024 microsecond units)              
*                                                                @11A*/         
*     ?ERBFITEM(5 R723CPDP) Float(56);, /* CPU time consumed while              
*                                      dispatching priority was                 
*                                      temporarily raised by chronic            
*                                      resource contention management           
*                                      because the work held a                  
*                                      resource that other work needed          
*                                      (in 1024 microsecond units)              
*                                                                @22A*/         
*     ?ERBFITEM(5 R723LPDP) Float(56);, /* CPU time consumed while              
*                                      dispatching priority was                 
*                                      temporarily raised to shorten            
*                                      the lock hold time of a local            
*                                      suspend lock (in 1024                    
*                                      microsecond units).   @OA62081*/         
*     ?ERBFITEM(5 R723SPDP) Float(56);, /* CPU time consumed while              
*                                      dispatching priority was                 
*                                      temporarily raised by z/OS               
*                                      Supervisor to a higher DP than           
*                                      the WLM assigned DP                      
*                                      (in 1024 microsecond units)              
*                                                                @52A*/         
*@SPACE;                                                                        
*   /* Additional response time data                             @54A*/         
*@SPACE;                                                                        
*     5 R723RTDM FIXED(32),         /* Midpoint of all response times           
*                                      that were collected in the               
*                                      response time distribution               
*                                      buckets in milliseconds. For             
*                                      response time goals, the mid-            
*                                      point is always the response             
*                                      time goal. For execution                 
*                                      velocity goals, it is the                
*                                      average of all response                  
*                                      times that were collected in             
*                                      the response time distribution           
*                                      buckets. The field equals zero           
*                                      for discretionary goals.  @54A*/         
*     5 R723RTDC FIXED(32),         /* Number of midpoint changes that          
*                                      occurred during interval  @54A*/         
*     5 R723RTDT CHAR(8),           /* Timestamp in STCK format,                
*                                      showing the last time when a             
*                                      midpoint change occurred. The            
*                                      midpoint is kept in R723RTDM.            
*                                                                @54A*/         
*@SPACE;                                                                        
*   /* Additional resource consumption data                  @OA48466*/         
*@SPACE;                                                                        
*     5 R723TSUCP CHAR(8),           /* Total service units consumed            
*                                       by transactions, executed on            
*                                       on general purpose processors.          
*                                                            @OA48466*/         
*     5 R723TSUSP CHAR(8),           /* Total service units consumed            
*                                       by transactions, executed on            
*                                       on specialty processors.                
*                                                            @OA48466*/         
*     5 R723TSUOCP CHAR(8),          /* Total service units consumed            
*                                       by transactions, eligible to            
*                                       run on specialty processors,            
*                                       but executed on general                 
*                                       purpose processors.                     
*                                                            @OA48466*/         
*     5 R723MSUCP CHAR(8),           /* Service units consumed by               
*                                       transactions, classified                
*                                       with reporting attribute                
*                                       MOBILE, executed on general             
*                                       purpose processors.                     
*                                                            @OA48466*/         
*     5 R723MSUSP CHAR(8),           /* Service units consumed by               
*                                       transactions, classified                
*                                       with reporting attribute                
*                                       MOBILE, executed on                     
*                                       specialty processors.                   
*                                                            @OA48466*/         
*     5 R723MSUOCP CHAR(8),          /* Service units consumed by               
*                                       transactions, classified                
*                                       with reporting attribute                
*                                       MOBILE, eligible to run on              
*                                       specialty processors, but               
*                                       executed on general purpose             
*                                       processors.                             
*                                                            @OA48466*/         
*     5 R723ASUCP CHAR(8),           /* Service units consumed by               
*                                       transactions, classified                
*                                       with reporting attribute                
*                                       CATEGORYA, executed on                  
*                                       general purpose processors.             
*                                                            @OA48466*/         
*     5 R723ASUSP CHAR(8),           /* Service units consumed by               
*                                       transactions, classified                
*                                       with reporting attribute                
*                                       CATEGORYA, executed on                  
*                                       specialty processors.                   
*                                                            @OA48466*/         
*     5 R723ASUOCP CHAR(8),          /* Service units consumed by               
*                                       transactions, classified                
*                                       with reporting attribute                
*                                       CATEGORYA, eligible to run              
*                                       on specialty processors, but            
*                                       executed on general purpose             
*                                       processors.                             
*                                                            @OA48466*/         
*     5 R723BSUCP CHAR(8),           /* Service units consumed by               
*                                       transactions, classified                
*                                       with reporting attribute                
*                                       CATEGORYB, executed on                  
*                                       general purpose processors.             
*                                                            @OA48466*/         
*     5 R723BSUSP CHAR(8),           /* Service units consumed by               
*                                       transactions, classified                
*                                       with reporting attribute                
*                                       CATEGORYB, executed on                  
*                                       specialty processors.                   
*                                                            @OA48466*/         
*     5 R723BSUOCP CHAR(8),          /* Service units consumed by               
*                                       transactions, classified                
*                                       with reporting attribute                
*                                       CATEGORYB, eligible to run              
*                                       on specialty processors, but            
*                                       executed on general purpose             
*                                       processors.                             
*                                                            @OA48466*/         
*                                                                               
*   /* Additional response time and delay data (in microseconds) @81A*/         
*                                                                               
*     5 R723CTETX CHAR(8),           /* Total transaction elapsed               
*                                       time. Same as R723CTET, but             
*                                       in microseconds.         @81A*/         
*     5 R723CXETX CHAR(8),           /* Total transaction execution             
*                                       time. Same as R723CXET, but             
*                                       in microseconds.         @81A*/         
*     5 R723CETSX CHAR(8),           /* Sum of transaction elapsed              
*                                       times squared. Same as                  
*                                       R723CETS, but in microseconds.          
*                                                                @81A*/         
*     5 R723CQDTX CHAR(8),           /* Total queue delay time.                 
*                                       Same as R723CQDT, but in                
*                                       microseconds.            @81A*/         
*     5 R723CADTX CHAR(8),           /* Total time batch jobs were              
*                                       ineligible to run because a             
*                                       resource the job had affinity           
*                                       to was unavailable. Same as             
*                                       R723CADT, but in microseconds.          
*                                                                @81A*/         
*     5 R723CCVTX CHAR(8),           /* Total time batch jobs spent             
*                                       in JCL conversion. Same as              
*                                       R723CCVT, but in microseconds.          
*                                                                @81A*/         
*     5 R723CIQTX CHAR(8),           /* Total time batch jobs spend             
*                                       on job queue (after JCL                 
*                                       conversion) while ineligible            
*                                       to run on any system for                
*                                       reasons other than resource             
*                                       affinities. Same as R723CIQT,           
*                                       but in microseconds.     @92C*/         
*@SPACE;                                                                        
*   /* Additional resource consumption data                      @92A*/         
*@SPACE;                                                                        
*     5 R723TSUCBP CHAR(8),          /* Reserved for future use  @93C*/         
*     5 R723TSUCBPCP CHAR(8),        /* Reserved for future use                 
*                                                            @OA62502*/         
*   /* Transaction data reported by subsystem work managers                     
*      when deleting an enclave (from RCAERTD section)       @OA62502*/         
*     5 R723ENCTRXNUM FIXED(32),     /* Number of single subsystem              
*                                       transactions processed within           
*                                       enclaves.            @OA62502*/         
*     5 R723ENCTRXCALLS FIXED(32),   /* Number of times transaction             
*                                       data has been reported by               
*                                       subsystem work managers when            
*                                       deleting an enclave. @OA62502*/         
*     5 R723ENCTRXET FIXED(64),      /* Total execution time in                 
*                                       microseconds for number of              
*                                       subsystem transactions in               
*                                       R723ENCTRXNUM.                          
*                                       (format: float)      @OA62502*/         
*     5 R723ENCTRXETS FIXED(64);     /* Sum of squared execution times          
*                                       in microseconds for number of           
*                                       subsystem transactions in               
*                                       R723ENCTRXNUM.                          
*                                       (format: float)      @OA62502*/         
*@SPACE;                                                                        
*   /*****************************************************************/         
*   /*                                                               */         
*   /* Response Time Distribution Map and Counts Table               */         
*   /*                                                               */         
*   /* This table defines up to 9 entries (in RMF 4.4.0 each entry   */         
*   /* represents 14 response time distribution buckets) where       */         
*   /*                                                               */         
*   /*      entry 0 is always the MAP and is addressed by the offset */         
*   /*            in the header extension SMF72RTS                   */         
*   /*      entry 1 - 8 (max number of periods) are the counts       */         
*   /*            for an associated service/report class period      */         
*   /*            and addressed by an index from the service/report  */         
*   /*            class period data section R723CRTX             @J2C*/         
*   /*                                                               */         
*   /* The MAP is the first entry (0) in this table and defines      */         
*   /* a maximum percentage of a goal (i.e. 50, 70, 200, etc.).      */         
*   /* When used in conjunction with a following entry (1-8) it      */         
*   /* shows the number of transactions that completed in a          */         
*   /* percentage of a a goal. The last entry in the array           */         
*   /* contains x'FFFFFFFF'. This indicates that this bucket         */         
*   /* includes all transactions that completed with longer          */         
*   /* response times than the previous bucket.                      */         
*   /*                                                               */         
*   /* Entries 1-8 contains the number of transactions that          */         
*   /* completed in the time period represented by that entry.       */         
*   /* When used with entry 0 it shows a distribution of             */         
*   /* completions verses goals specified.                       @C1A*/         
*   /*                                                               */         
*   /*****************************************************************/         
*@SPACE;                                                                        
*DECLARE                                                                        
* 1 R723RTS  BASED(ADDR(SMF72HDR)+SMF72RTS), /* Response Time                   
*                                      distribution              @C1A*/         
*   3 R723TRDB (R723TENT) FIXED(32), /* Response Time distribution              
*                                       map or counts        @OA62081*/         
*@SPACE;                                                                        
*R723TENT CONSTANT(14);             /* Number of entries in an array.           
*                                      For RMF 510 the number is 14.            
*                                                                @C1A*/         
*@SPACE;                                                                        
*   /* Work Manager / Resource Manager States                    @C1A*/         
*DECLARE                                                                        
* 1 R723WRS  BASED(ADDR(SMF72HDR)+SMF72WRS),                 /*  @C1A*/         
*   3 R723RENT,                     /* Entry in the subsystem work              
*                                      manager delay array. In RMF510           
*                                      there are always two entries             
*                                      for a subsystem, one for the             
*                                      Begin_to_End phase and one for           
*                                      the Execution phase, where the           
*                                      BtE entry is always the first            
*                                                                @C1A*/         
*     5 R723RTYP CHAR(4),           /* Subsystem type, as used in the           
*                                      classification rules specified           
*                                      in the WLM administrative                
*                                      application. The subsystem's             
*                                      documentation should explain the         
*                                      meaning that the product                 
*                                      attributes to the various                
*                                      states                    @C1A*/         
*     5 R723RFLG BIT(8),            /* Work/Resource manager flags              
*                                                            @OA62081*/         
*       7 R723RDBE BIT(1),          /* x'80' Represents states sampled          
*                                      in the begin-to-end phase of a           
*                                      transaction               @C1A*/         
*       7 R723REXE BIT(1),          /* x'40' Represents states sampled          
*                                      in the execution phase of a              
*                                      transaction               @C1A*/         
*       7 R723RRS1 BIT(6),          /* Reserved                  @C1A*/         
*     5 R723RRS2 CHAR(3),           /* Reserved                  @C1A*/         
*     5 R723RESS FIXED(32),         /* Total number of transaction              
*                                      states sampled in the work phase         
*                                      specified by R723RFLG     @C1A*/         
*     5 R723RACT FIXED(32),         /* Total number of active state             
*                                      samples. Active indicates that           
*                                      there is a program executing             
*                                      on behalf of the work request,           
*                                      from the perspective of the              
*                                      work manager. This does not mean         
*                                      that the program is active from          
*                                      the base control program's               
*                                      perspective               @C1A*/         
*     5 R723RRDY FIXED(32),         /* Total number of ready state              
*                                      samples. Ready indicates that            
*                                      there is a program ready to              
*                                      execute on behalf of the work            
*                                      request described by the                 
*                                      monitoring environment, but the          
*                                      work manager has given priority          
*                                      to another work request   @C1A*/         
*     5 R723RIDL FIXED(32),         /* Total number of idle state               
*                                      samples. Idle indicates that             
*                                      no work reques is available              
*                                      to the work manager that is              
*                                      allowed to run.           @C1A*/         
*     5 R723RWLO FIXED(32),         /* Total number of waiting for              
*                                      lock state samples        @C1A*/         
*     5 R723RWIO FIXED(32),         /* Total number of waiting for              
*                                      I/O state samples. Waiting for           
*                                      I/O indicates that the work              
*                                      manager is waiting for an                
*                                      activity related to an I/O               
*                                      request. This may be an actual           
*                                      I/O operation or some other              
*                                      function associated with the             
*                                      I/O request               @C1A*/         
*     5 R723RWCO FIXED(32),         /* Total number of waiting for              
*                                      conversation state samples.              
*                                      Waiting for conversation may             
*                                      have been used in conjunction            
*                                      with the WLM service IWMMSWCH            
*                                      to identify where the recipient          
*                                      of the conversation is                   
*                                      located.  In this case, only             
*                                      the switched state will be               
*                                      recorded.                 @C1A*/         
*     5 R723RWDS FIXED(32),         /* Total number of waiting for              
*                                      distributed request state                
*                                      samples.  Waiting for                    
*                                      distributed request indicates a          
*                                      high level that some function            
*                                      or data must be routed prior to          
*                                      resumption of the work request.          
*                                      This is to be contrasted with            
*                                      waiting for conversation, which          
*                                      is a low level view of the               
*                                      precise resource that is                 
*                                      needed.  A distributed request           
*                                      could involve waiting on a               
*                                      conversation as part of its              
*                                      processing                @C1A*/         
*     5 R723RWSL FIXED(32),         /* Waiting for a session to be              
*                                      established locally, i.e. on             
*                                      the current MVS image     @C1A*/         
*     5 R723RWSN FIXED(32),         /* Waiting for a session to be              
*                                      established somewhere in the             
*                                      network                   @C1A*/         
*     5 R723RWSS FIXED(32),         /* Waiting for a session to be              
*                                      established somewhere in the             
*                                      sysplex                   @C1A*/         
*     5 R723RWTM FIXED(32),         /* Waiting for a timer       @C1A*/         
*     5 R723RWO  FIXED(32),         /* Waiting for another                      
*                                      product                   @C1A*/         
*     5 R723RWMS FIXED(32),         /* Waiting for unidentified                 
*                                      resource, possibly among                 
*                                      another more specific category,          
*                                      but which may not be readily             
*                                      determined                @C1A*/         
*     5 R723RSSL FIXED(32),         /* State representing transactions          
*                                      for which there are logical              
*                                      continuations on this MVS                
*                                      image.  Subsystem work managers          
*                                      might set this state when they           
*                                      function ship a transaction to           
*                                      another component within the             
*                                      same MVS image            @C1A*/         
*     5 R723RSSS FIXED(32),         /* State representing transactions          
*                                      for which there are logical              
*                                      continuations on another MVS             
*                                      image in the sysplex.                    
*                                      Subsystem work managers might            
*                                      set this state when they                 
*                                      function ship a transaction to           
*                                      another component on another             
*                                      MVS image within the                     
*                                      sysplex                   @C1A*/         
*     5 R723RSSN FIXED(32),         /* State representing transactions          
*                                      for which there are logical              
*                                      continuations somewhere within           
*                                      the network.  Subsystem work             
*                                      managers might set this state            
*                                      when they function ship a                
*                                      transaction to another                   
*                                      component within the                     
*                                      network                   @E1C*/         
*     5 R723RWST FIXED(32),         /* Total number of waiting for              
*                                      SSL thread samples    @WA52227*/         
*     5 R723RWRT FIXED(32),         /* Total number of waiting for              
*                                      regular thread samples                   
*                                                            @WA52227*/         
*     5 R723RWWR FIXED(32),         /* Total number of waiting for              
*                                      work table registration                  
*                                      samples               @WA52227*/         
*     5 R723RAPP FIXED(32),         /* Total number of active                   
*                                      application state samples                
*                                                            @WA52227*/         
*     5 R723RWNL FIXED(32),         /* Total number of state samples            
*                                      reflecting waiting for new               
*                                      latch                     @E1A*/         
*     5 R723RW01 FIXED(32),         /* Total number of waiting for              
*                                      resource type 1 samples                  
*                                      (for future use)      @WA52227*/         
*     5 R723RW02 FIXED(32),         /* Total number of waiting for              
*                                      resource type 2 samples                  
*                                      (for future use)      @WA52227*/         
*     5 R723RW03 FIXED(32),         /* Total number of waiting for              
*                                      resource type 3 samples                  
*                                      (for future use)      @WA52227*/         
*     5 R723RW04 FIXED(32),         /* Total number of waiting for              
*                                      resource type 4 samples                  
*                                      (for future use)      @WA52227*/         
*     5 R723RW05 FIXED(32),         /* Total number of waiting for              
*                                      resource type 5 samples                  
*                                      (for future use)      @WA52227*/         
*     5 R723RW06 FIXED(32),         /* Total number of waiting for              
*                                      resource type 6 samples                  
*                                      (for future use)          @01A*/         
*     5 R723RW07 FIXED(32),         /* Total number of waiting for              
*                                      resource type 7 samples                  
*                                      (for future use)          @01A*/         
*     5 R723RW08 FIXED(32),         /* Total number of waiting for              
*                                      resource type 8 samples                  
*                                      (for future use)          @01A*/         
*     5 R723RW09 FIXED(32),         /* Total number of waiting for              
*                                      resource type 9 samples                  
*                                      (for future use)          @01A*/         
*     5 R723RW10 FIXED(32),         /* Total number of waiting for              
*                                      resource type 10 samples                 
*                                      (for future use)          @01A*/         
*     5 R723RW11 FIXED(32),         /* Total number of waiting for              
*                                      resource type 11 samples                 
*                                      (for future use)          @01A*/         
*     5 R723RW12 FIXED(32),         /* Total number of waiting for              
*                                      resource type 12 samples                 
*                                      (for future use)          @01A*/         
*     5 R723RW13 FIXED(32),         /* Total number of waiting for              
*                                      resource type 13 samples                 
*                                      (for future use)          @01A*/         
*     5 R723RW14 FIXED(32),         /* Total number of waiting for              
*                                      resource type 14 samples                 
*                                      (for future use)          @01A*/         
*     5 R723RW15 FIXED(32),         /* Total number of waiting for              
*                                      resource type 15 samples                 
*                                      (for future use)          @01A*/         
*     5 R723RBPM FIXED(32),         /* Number of state samples                  
*                                      representing buffer pool                 
*                                      misses that resulted in                  
*                                      I/O                       @01A*/         
*     5 R723RDNX FIXED(15),         /* Index into the resource delay            
*                                      names table               @21A*/         
*     5 R723RDNN FIXED(15),         /* Number of entries in the                 
*                                      resource delay names                     
*                                      table                     @21A*/         
*     5 R723RRS3 CHAR(8);           /* Reserved                  @21C*/         
*@SPACE;                                                                        
*   /*****************************************************************/         
*   /*                                                               */         
*   /* Resource Delay Names Section                              @21A*/         
*   /*                                                               */         
*   /*****************************************************************/         
*DECLARE                                                                        
* 1 R723DNS  BASED(ADDR(SMF72HDR)+SMF72DNS), /* Resource delay                  
*                                      names section             @21A*/         
*   3 R723DNST CHAR(4),             /* Subsystem type as used in the            
*                                      classification rules specified           
*                                      in the WLM administrative                
*                                      application               @21A*/         
*   3 R723DNNU FIXED(16),           /* Number of the resource delay             
*                                      type. Values 1-15 are related            
*                                      to R723RW01-R723RW15      @21A*/         
*   3 R723DNDE CHAR(16),            /* Resource delay description               
*                                                                @21A*/         
*   3 R723RRS4 CHAR(2);             /* Reserved                  @21A*/         
*@SPACE;                                                                        
*                                                                               
*%IF IFAR724 = 'YES' %THEN %GOTO LR724; /* Subtype 4 data        @C4A*/         
*%IF IFAR725 = 'YES' %THEN %GOTO LR725; /* Subtype 5 data        @51A*/         
*%GOTO LR72END;                     /* Goto end of file          @C4A*/         
*%LR724:;                                                     /* @C2A*/         
*                                                             /* @C4D*/         
*@SPACE;                                                                        
*   /* Service Class Period Data Section (Subtype 4)             @C2A*/         
*DECLARE                                                                        
* 1 R724DATA BASED(ADDR(SMF72HDR)+SMF72CPS),                  /* @C2A*/         
*   3 R724PNAM CHAR(8),             /* Name of active service                   
*                                      policy                    @C2A*/         
*   3 R724PTM  CHAR(8),             /* Time policy was activated                
*                                      (Format: STORE CLOCK                     
*                                       Unit: local time)        @C2A*/         
*   3 R724LCNM CHAR(8),             /* Service class name        @C2A*/         
*   3 R724PER# FIXED(8),            /* Service class period                     
*                                      number                    @C2A*/         
*   3 *        CHAR(3),             /* Free for future use       @C2A*/         
*   3 R724USER FIXED(32),           /* Sum of all users found    @C2A*/         
*   3 R724ACTV FIXED(32),           /* Sum of all active users found            
*                                                                @C2A*/         
*   3 R724ACTS FIXED(32),           /* Sum of all active samples                
*                                      (except OUTR)             @C2A*/         
*   3 R724IDLS FIXED(32),           /* Sum of all idle samples   @C2A*/         
*   3 R724PAGE FIXED(32),           /* Sum of all users delayed for             
*                                      paging at all samples     @C2A*/         
*   3 R724SWAP FIXED(32),           /* Sum of all users delayed for             
*                                      swapping at all samples   @C2A*/         
*   3 R724OUTR FIXED(32),           /* Sum of all out and ready                 
*                                      users at all samples      @C2A*/         
*   3 R724PGIN FIXED(32),           /* Sum of all page-ins       @C2A*/         
*   3 R724DIVS FIXED(32),           /* Sum of all DIV samples    @C2A*/         
*   3 R724LSSA FIXED(32),           /* Total logically swapped                  
*                                      samples for the group     @C2A*/         
*   3 R724PSSA FIXED(32),           /* Total swapped samples for the            
*                                      group (except logical)    @C2A*/         
*   3 R724UPRO FIXED(32),           /* Total processor using samples            
*                                      for the group             @C2A*/         
*   3 R724UDEV FIXED(32),           /* Total device using samples               
*                                      for the group             @C2A*/         
*   3 R724DPRO FIXED(32),           /* Total processor delay samples            
*                                      for the group             @C2A*/         
*   3 R724DDEV FIXED(32),           /* Total device delay samples               
*                                      for the group             @C2A*/         
*   3 R724DSTO FIXED(32),           /* Total storage delay samples              
*                                      for the group             @C2A*/         
*   3 R724DJES FIXED(32),           /* Total JES delay samples                  
*                                      for the group             @C2A*/         
*   3 R724DHSM FIXED(32),           /* Total HSM delay samples                  
*                                      for the group             @C2A*/         
*   3 R724DXCF FIXED(32),           /* Total XCF delay samples                  
*                                      for the group             @C2A*/         
*   3 R724DENQ FIXED(32),           /* Total ENQ delay samples                  
*                                      for the group             @C2A*/         
*   3 R724DMNT FIXED(32),           /* Total mount delay samples                
*                                      for the group             @C2A*/         
*   3 R724DMSG FIXED(32),           /* Total message delay samples              
*                                      for the group             @C2A*/         
*   3 R724UNKN FIXED(32),           /* Total unknown state samples              
*                                      for the group             @C2A*/         
*   3 R724VALD FIXED(32),           /* Total valid samples for                  
*                                      the group (single state sum              
*                                      of all using, delay, idle,               
*                                      and unknown)              @C2A*/         
*   3 R724LSCT FIXED(32),           /* Count of "long" logical                  
*                                      swaps for the group       @C2A*/         
*   3 R724ESCT FIXED(32),           /* Count of "long" swaps to                 
*                                      expanded storage for the group           
*                                                                @C2A*/         
*   3 R724PSCT FIXED(32),           /* Count of "long" physical                 
*                                      swaps for the group       @C2A*/         
*   3 R724ACTF CHAR(8) BDY(DWORD),  /* Sum of all active frames                 
*                                      (long floating point)     @C2A*/         
*   3 R724IDLE CHAR(8),             /* Sum of all idle frames                   
*                                      (long floating point)     @C2A*/         
*   3 R724SLOT CHAR(8),             /* Sum of all slots used                    
*                                      (long floating point)     @C2A*/         
*   3 R724DIV  CHAR(8),             /* Sum of all DIV frames                    
*                                      (long floating point)     @C2A*/         
*   3 R724FIX  CHAR(8),             /* Sum of all fixed frames                  
*                                      (long floating point)     @C2A*/         
*   3 R724LSCF CHAR(8),             /* Sum of all central frames                
*                                      for all logically swapped                
*                                      users at all samples                     
*                                      (long floating point)     @C2A*/         
*   3 R724LSEF CHAR(8),             /* Sum of all expanded frames               
*                                      for all logically swapped                
*                                      users at all samples                     
*                                      (long floating point)     @C2A*/         
*   3 R724PSEF CHAR(8),             /* Sum of all expanded frames               
*                                      for all swapped users (except            
*                                      logical) at all samples                  
*                                      (long floating point)     @C2A*/         
*   3 R724VECT CHAR(8),             /* Total vector utilization                 
*                                      time for the group                       
*                                      (Format: long floating point             
*                                       Unit: microseconds)      @C2A*/         
*   3 R724ET   CHAR(8),             /* Total execution time for all             
*                                      transactions that ended in               
*                                      the group. Does not include              
*                                      queued time.                             
*                                      (Format: long floating point             
*                                       Unit: 1024-microseconds) @81C*/         
*   3 R724QT   CHAR(8),             /* Total time spent on JES or               
*                                      APPC queues by all transactions          
*                                      that ended in the group                  
*                                      (Format: long floating point             
*                                       Unit: 1024-microseconds) @81C*/         
*   3 R724END  CHAR(8),             /* The number of transactions               
*                                      that ended in the group                  
*                                      (Format: long floating point             
*                                       Unit: microseconds)      @C2A*/         
*   ?ERBFITEM(3 R724TSV) FLOAT(56);, /* Sum of                                  
*                                      shared page views                        
*                                      (long floating point)     @D1A*/         
*   ?ERBFITEM(3 R724VIN) FLOAT(56);, /* Sum of shared pages in central          
*                                      storage, that are valid                  
*                                      (long floating point)     @D1A*/         
*   ?ERBFITEM(3 R724VLC) FLOAT(56);, /* Sum of shared page validations          
*                                      (long floating point)     @D1A*/         
*   ?ERBFITEM(3 R724GPI) FLOAT(56);, /* Sum of shared page-ins                  
*                                      from auxiliary storage                   
*                                      (long floating point)     @D1A*/         
*   3 R724ETX  CHAR(8),             /* Total execution time for all             
*                                      transactions that ended in               
*                                      the group. Same as R724ET,               
*                                      but in microseconds.      @81A*/         
*   3 R724QTX  CHAR(8);             /* Total time spent on JES or               
*                                      APPC queues by all transactions          
*                                      that ended in the group.                 
*                                      Same as R724QT, but in                   
*                                      microseconds.             @81A*/         
*@SPACE;                                                                        
*   /* Swap Reason Data Section (Subtype 4)                      @C2A*/         
*DECLARE                                                                        
* 1 R724SWRE BASED(ADDR(SMF72HDR)+SMF72SPS),                  /* @C2A*/         
*   3 R724OR1  FIXED(32),           /* STOR/OUTR delay samples for              
*                                      swap reason 1:                           
*                                      Terminal output wait  @WA03905*/         
*   3 R724OR2  FIXED(32),           /* STOR/OUTR delay samples for              
*                                      swap reason 2:                           
*                                      Terminal input wait   @WA03905*/         
*   3 R724OR3  FIXED(32),           /* STOR/OUTR delay samples for              
*                                      swap reason 3:                           
*                                      Long wait                 @C2A*/         
*   3 R724OR4  FIXED(32),           /* STOR/OUTR delay samples for              
*                                      swap reason 4:                           
*                                      Auxiliary storage shortage               
*                                                                @C2A*/         
*   3 R724OR5  FIXED(32),           /* STOR/OUTR delay samples for              
*                                      swap reason 5:                           
*                                      Real storage shortage     @C2A*/         
*   3 R724OR6  FIXED(32),           /* STOR/OUTR delay samples for              
*                                      swap reason 6:                           
*                                      Detected long wait        @C2A*/         
*   3 R724OR7  FIXED(32),           /* STOR/OUTR delay samples for              
*                                      swap reason 7:                           
*                                      Requested swap                           
*                                      No longer used, refer to                 
*                                      R724OR7A                  @83C*/         
*   3 R724OR8  FIXED(32),           /* STOR/OUTR delay samples for              
*                                      swap reason 8:                           
*                                      Enqueue exchange swap     @C2A*/         
*   3 R724OR9  FIXED(32),           /* STOR/OUTR delay samples for              
*                                      swap reason 9:                           
*                                      Exchange swap             @C2A*/         
*   3 R724OR10 FIXED(32),           /* STOR/OUTR delay samples for              
*                                      swap reason 10:                          
*                                      Unilateral swap           @C2A*/         
*   3 R724OR11 FIXED(32),           /* STOR/OUTR delay samples for              
*                                      swap reason 11:                          
*                                      Transition swap           @C2A*/         
*   3 R724OR12 FIXED(32),           /* STOR/OUTR delay samples for              
*                                      swap reason 12:                          
*                                      Improve central storage usage            
*                                                                @C2A*/         
*   3 R724OR13 FIXED(32),           /* STOR/OUTR delay samples for              
*                                      swap reason 13:                          
*                                      Improve system paging rate               
*                                                                @C2A*/         
*   3 R724OR14 FIXED(32),           /* STOR/OUTR delay samples for              
*                                      swap reason 14:                          
*                                      Make room for an out too long            
*                                      user                      @C2A*/         
*   3 R724OR15 FIXED(32),           /* STOR/OUTR delay samples for              
*                                      swap reason 15:                          
*                                      APPC wait                 @C2A*/         
*   3 R724OR16 FIXED(32),           /* STOR/OUTR delay samples for              
*                                      swap reason 16:                          
*                                      OMVS input wait           @C2A*/         
*   3 R724OR17 FIXED(32),           /* STOR/OUTR delay samples for              
*                                      swap reason 17:                          
*                                      OMVS output wait          @C2A*/         
*   3 R724OR18 FIXED(32),           /* STOR/OUTR delay samples for              
*                                      swap reason 18:                          
*                                      In-real swap              @83C*/         
*   3 R724OR7A FIXED(32);           /* STOR/OUTR delay samples for              
*                                      swap reason 7:                           
*                                      Memory pool shortage      @83A*/         
*@SPACE;                                                                        
*                                                                               
*%IF IFAR725 = 'YES' %THEN %GOTO LR725; /* Subtype 5 data        @51A*/         
*%GOTO LR72END;                     /* Goto end of file          @51A*/         
*%LR725:;                                                     /* @51A*/         
*@SPACE;                                                                        
                                                                                
*   /* Serialization Control Section (Subtype 5)                 @51A*/         
*                                                                               
*DECLARE                                                                        
* 1 R725SCTL BASED(ADDR(SMF72HDR)+SMF72SES),                  /* @51A*/         
*   3 R725SGMO FIXED(8),            /* GRS Mode:                                
*                                      X'00' = NONE                             
*                                      X'01' = RING                             
*                                      X'02' = STAR              @51A*/         
*   3 *        CHAR(15),            /* Reserved                  @51A*/         
*   /* CMS Lock Summary                                          @51A*/         
*   3 R725SCMS CHAR(8),             /* Total number of times that a             
*                                      unit of work was suspended on            
*                                      a CMS lock                @51A*/         
*   3 R725SCMA CHAR(8),             /* Total number of times that a             
*                                      unit of work was suspended on a          
*                                      CMS lock when there was already          
*                                      at least one other unit of work          
*                                      suspended for the lock    @51A*/         
*   3 R725SCMT CHAR(8),             /* Total amount of time in                  
*                                      milliseconds that a unit of work         
*                                      was suspended on a CMS lock              
*                                                                @51A*/         
*   3 *        CHAR(8),             /* Reserved                  @51A*/         
*   /* CMS EnqueueDequeue Lock Summary                           @51A*/         
*   3 R725SEDS CHAR(8),             /* Total number of times that a             
*                                      unit of work was suspended on            
*                                      a CMS EnqueueDequeue lock @51A*/         
*   3 R725SEDA CHAR(8),             /* Total number of times that a             
*                                      unit of work was suspended on            
*                                      CMS EnqueueDequeue lock when             
*                                      there was already                        
*                                      at least one other unit of work          
*                                      suspended for the lock    @51A*/         
*   3 R725SEDT CHAR(8),             /* Total amount of time in                  
*                                      milliseconds that a unit of work         
*                                      was suspended on a CMS                   
*                                      EnqueueDequeue lock       @51A*/         
*   3 *        CHAR(8),             /* Reserved                  @51A*/         
*   /* CMS Latch Lock Summary                                    @51A*/         
*   3 R725SLAS CHAR(8),             /* Total number of times that a             
*                                      unit of work was suspended on            
*                                      a CMS Latch lock          @51A*/         
*   3 R725SLAA CHAR(8),             /* Total number of times that a             
*                                      unit of work was suspended on            
*                                      CMS Latch lock when                      
*                                      there was already                        
*                                      at least one other unit of work          
*                                      suspended for the lock    @51A*/         
*   3 R725SLAT CHAR(8),             /* Total amount of time in                  
*                                      milliseconds that a unit of work         
*                                      was suspended on a CMS                   
*                                      Latch lock                @51A*/         
*   3 *        CHAR(8),             /* Reserved                  @51A*/         
*   /* CMS SMF Lock Summary                                      @51A*/         
*   3 R725SSMS CHAR(8),             /* Total number of times that a             
*                                      unit of work was suspended on            
*                                      a CMS SMF lock            @51A*/         
*   3 R725SSMA CHAR(8),             /* Total number of times that a             
*                                      unit of work was suspended on            
*                                      CMS SMF lock when                        
*                                      there was already                        
*                                      at least one other unit of work          
*                                      suspended for the lock    @51A*/         
*   3 R725SSMT CHAR(8),             /* Total amount of time in                  
*                                      milliseconds that a unit of work         
*                                      was suspended on a CMS                   
*                                      SMF lock                  @51A*/         
*   3 *        CHAR(8),             /* Reserved                  @51A*/         
*   /* Local Lock Summary                                        @51A*/         
*   3 R725SLOS CHAR(8),             /* Total number of times that a             
*                                      unit of work was suspended on            
*                                      a Local lock              @51A*/         
*   3 R725SLOA CHAR(8),             /* Total number of times that a             
*                                      unit of work was suspended on            
*                                      Local lock when                          
*                                      there was already                        
*                                      at least one other unit of work          
*                                      suspended for the lock    @51A*/         
*   3 R725SLOT CHAR(8),             /* Total amount of time in                  
*                                      milliseconds that a unit of work         
*                                      was suspended on a Local                 
*                                      lock                      @51A*/         
*   3 *        CHAR(8),             /* Reserved                  @51A*/         
*   /* CML Lock Owner Summary                                    @51A*/         
*   3 R725SCLS CHAR(8),             /* Total number of times that a             
*                                      unit of work from another                
*                                      address space was suspended when         
*                                      requesting the Local lock of             
*                                      an address space      @OA62081*/         
*   3 R725SCLA CHAR(8),             /* Total number of times that a             
*                                      unit of work from another                
*                                      address space was suspended when         
*                                      requesting the Local lock of             
*                                      an address space when there was          
*                                      already at least one other               
*                                      unit of work suspended for the           
*                                      lock                  @OA62081*/         
*   3 R725SCLT CHAR(8),             /* Total amount of time in                  
*                                      milliseconds that a unit of work         
*                                      from another address space               
*                                      was suspended when requesting            
*                                      the Local lock of an                     
*                                      address space             @51A*/         
*   3 *        CHAR(8),             /* Reserved                  @51A*/         
*   /* GRS Latch Set Summary                                     @51A*/         
*   3 R725SLRS CHAR(8),             /* Total number of suspended                
*                                      Latch Obtain requests     @51A*/         
*   3 R725SLRT CHAR(8),             /* Total amount of time in                  
*                                      milliseconds that Latch Obtain           
*                                      requests were suspended   @51A*/         
*   3 R725SLRQ CHAR(16),            /* Total sum of squares of time in          
*                                      milliseconds that Latch Obtain           
*                                      requests were suspended   @51A*/         
*   /* GRS ENQ SCOPE=STEP Summary                                @51A*/         
*   3 R725SSTR CHAR(8),             /* Total number of ENQ SCOPE=STEP           
*                                      requests                  @51A*/         
*   3 R725SSTS CHAR(8),             /* Total number of ENQ SCOPE=STEP           
*                                      requests that were suspended             
*                                                                @51A*/         
*   3 R725SSTT CHAR(8),             /* Total amount of contention time          
*                                      in milliseconds caused by                
*                                      ENQ SCOPE=STEP requests   @51A*/         
*   3 *        CHAR(8),             /* Reserved                  @51A*/         
*   3 R725SSTQ CHAR(16),            /* Total sum of squares of                  
*                                      contention time                          
*                                      in milliseconds caused by                
*                                      ENQ SCOPE=STEP requests   @51A*/         
*   /* GRS ENQ SCOPE=SYSTEM Summary                              @51A*/         
*   3 R725SSYR CHAR(8),             /* Total number of ENQ SCOPE=SYSTEM         
*                                      requests                  @51A*/         
*   3 R725SSYS CHAR(8),             /* Total number of ENQ SCOPE=SYSTEM         
*                                      requests that were suspended             
*                                                                @51A*/         
*   3 R725SSYT CHAR(8),             /* Total amount of contention time          
*                                      in milliseconds caused by                
*                                      ENQ SCOPE=SYSTEM requests @51A*/         
*   3 *        CHAR(8),             /* Reserved                  @51A*/         
*   3 R725SSYQ CHAR(16),            /* Total sum of squares of suspend          
*                                      contention time                          
*                                      in milliseconds caused by                
*                                      ENQ SCOPE=SYSTEM requests @51A*/         
*   /* GRS ENQ SCOPE=SYSTEMS Summary                             @51A*/         
*   3 R725SSSR CHAR(8),             /* Total number of ENQ                      
*                                      SCOPE=SYSTEMS requests    @51A*/         
*   3 R725SSSS CHAR(8),             /* Total number of ENQ                      
*                                      SCOPE=SYSTEMS requests                   
*                                      that were suspended       @51A*/         
*   3 R725SSST CHAR(8),             /* Total amount of contention time          
*                                      in milliseconds caused by                
*                                      ENQ SCOPE=SYSTEMS requests@51A*/         
*   3 *        CHAR(8),             /* Reserved                  @51A*/         
*   3 R725SSSQ CHAR(16);            /* Total sum of squares of                  
*                                      contention time                          
*                                      in milliseconds caused by                
*                                      ENQ SCOPE=SYSTEMS requests@51A*/         
*DECLARE                                                                        
*   R725SGMN CONSTANT(0),           /* GRS Mode = None           @51A*/         
*   R725SGMR CONSTANT(1),           /* GRS Mode = Ring           @51A*/         
*   R725SGMS CONSTANT(2);           /* GRS Mode = Star           @51A*/         
*@SPACE;                                                                        
                                                                                
                                                                                
*@SPACE;                                                                        
*                                                                               
                                                                                
                                                                                
                                                                                
*@SPACE;                                                                        
*   /* CMS Lock Type Data Section (Subtype 5)                    @51A*/         
*                                                                               
*                                                                               
*DECLARE                                                                        
* 1 R725CMSD BASED,                                           /* @51A*/         
*   3 R725CMKY CHAR(16) BDY(DWORD), /* Address space key         @51A*/         
*     5 R725CMJN CHAR(8),           /* Name of job               @51A*/         
*     5 *        CHAR(3),           /* Reserved                  @51A*/         
*     5 R725CMSP FIXED(8),          /* Service class period      @51A*/         
*     5 R725CMAS FIXED(16),         /* Address space ID          @51A*/         
*     5 *        FIXED(16),         /* Reserved                  @51A*/         
*   3 R725CMST CHAR(8),             /* Address space SToken      @51A*/         
*   3 R725CMSN CHAR(8),             /* Service class name        @51A*/         
*   3 R725CMTY FIXED(8),            /* Lock Type                                
*                                      X'01' = CMS Lock                         
*                                      X'02' = CMS EnqueueDequeue Lock          
*                                      X'03' = CMS Latch Lock                   
*                                      X'04' = CMS SMF Lock      @51A*/         
*   3 *        CHAR(7),             /* Reserved                  @51A*/         
*   3 R725CMSU CHAR(8),             /* Number of times that a unit of           
*                                      work of this address space               
*                                      was suspended on the CMS lock            
*                                      type as specified in R725CMTY            
*                                                                @51A*/         
*   3 R725CMAL CHAR(8),             /* Number of times that a unit of           
*                                      work of this address space               
*                                      was suspended on the CMS lock            
*                                      type as specified in R725CMTY            
*                                      when there was already at least          
*                                      one other unit of work                   
*                                      suspended for this lock   @51A*/         
*   3 R725CMTI CHAR(8);             /* Total amount of time in                  
*                                      milliseconds that a unit of work         
*                                      of this address space was                
*                                      suspended on the CMS lock                
*                                      type as specified in R725CMTY            
*                                                                @51A*/         
*@SPACE;                                                                        
*DECLARE                                                                        
*   R725CMCM CONSTANT(1),           /* CMS Lock                  @51A*/         
*   R725CMED CONSTANT(2),           /* CMS EnqueueDequeue Lock   @51A*/         
*   R725CMLA CONSTANT(3),           /* CMS Latch Lock            @51A*/         
*   R725CMSM CONSTANT(4);           /* CMS SMF Lock              @51A*/         
*@SPACE;                                                                        
*DECLARE                                                                        
* 1 R725CMSS  like R725CMSD         based(addr(SMF72HDR)+SMF72CMS),             
* 1 R725CEDS  like R725CMSD         based(addr(SMF72HDR)+SMF72EDS),             
* 1 R725CLAS  like R725CMSD         based(addr(SMF72HDR)+SMF72LAS),             
* 1 R725CSMS  like R725CMSD         based(addr(SMF72HDR)+SMF72SMS);             
*@SPACE;                                                                        
*                                                                               
*   /* Local Lock Type Data Section (Subtype 5)                  @51A*/         
*                                                                               
*DECLARE                                                                        
* 1 R725LOTD BASED(ADDR(SMF72HDR)+SMF72LOS),                  /* @51A*/         
*   3 R725LOKY CHAR(16) BDY(DWORD), /* Address space key         @51A*/         
*     5 R725LOJN CHAR(8),           /* Name of job               @51A*/         
*     5 *        CHAR(3),           /* Reserved                  @51A*/         
*     5 R725LOSP FIXED(8),          /* Service class period      @51A*/         
*     5 R725LOAS FIXED(16),         /* Address space ID          @51A*/         
*     5 *        FIXED(16),         /* Reserved                  @51A*/         
*   3 R725LOST CHAR(8),             /* Address space SToken      @51A*/         
*   3 R725LOSN CHAR(8),             /* Service class name        @51A*/         
*   3 *        CHAR(8),             /* Reserved                  @51A*/         
*                                   /* Local lock data           @51A*/         
*   3 R725LOSU CHAR(8),             /* Number of times that a unit of           
*                                      work of this address space               
*                                      was suspended on a Local lock            
*                                                                @51A*/         
*   3 R725LOAL CHAR(8),             /* Number of times that a unit of           
*                                      work of this address space               
*                                      was suspended on a Local lock            
*                                      when there was already at least          
*                                      one other unit of work                   
*                                      suspended                 @51A*/         
*   3 R725LOTI CHAR(8),             /* Total amount of time in                  
*                                      milliseconds that a unit of work         
*                                      of this address space was                
*                                      suspended on a Local lock @51A*/         
*                                   /* CML lock owner data       @51A*/         
*   3 R725LCSU CHAR(8),             /* Number of times that a unit of           
*                                      work from another address space          
*                                      was suspended when requesting            
*                                      the Local lock of this                   
*                                      address space             @51A*/         
*   3 R725LCAL CHAR(8),             /* Number of times that a unit of           
*                                      work from another address space          
*                                      was suspended when requesting            
*                                      the Local lock of this                   
*                                      address space and                        
*                                      there was already at least               
*                                      one other unit of work waiting           
*                                      for that lock             @51A*/         
*   3 R725LCTI CHAR(8);             /* Total amount of time in                  
*                                      milliseconds that a unit of work         
*                                      was suspended when requesting            
*                                      the Local lock of this address           
*                                      space                     @51A*/         
*                                                                               
*@SPACE;                                                                        
*                                                                               
*                                                                               
*   /* CML Lock Owner Data Section (Subtype 5)                   @51A*/         
*                                                                               
*DECLARE                                                                        
* 1 R725CLOD BASED(ADDR(SMF72HDR)+SMF72COS),                  /* @51A*/         
*   3 R725COKY CHAR(16) BDY(DWORD), /* Address space key         @51A*/         
*     5 R725COJN CHAR(8),           /* Name of job               @51A*/         
*     5 *        CHAR(3),           /* Reserved                  @51A*/         
*     5 R725COSP FIXED(8),          /* Service class period      @51A*/         
*     5 R725COAS FIXED(16),         /* Address space ID          @51A*/         
*     5 *        FIXED(16),         /* Reserved                  @51A*/         
*   3 R725COST CHAR(8),             /* Address space SToken      @51A*/         
*   3 R725COSN CHAR(8),             /* Service class name        @51A*/         
*   3 *        CHAR(8),             /* Reserved                  @51A*/         
*                                   /* CML lock owner data       @51A*/         
*   3 R725COSU CHAR(8),             /* Number of times that a unit of           
*                                      work from another address space          
*                                      was suspended when requesting            
*                                      the Local lock of this address           
*                                                                @51A*/         
*   3 R725COAL CHAR(8),             /* Number of times that a unit of           
*                                      work from another address space          
*                                      was suspended when requesting            
*                                      the Local lock of this address           
*                                      and there was already at least           
*                                      one other unit of work                   
*                                      waiting for that lock.    @51A*/         
*   3 R725COTI CHAR(8),             /* Total amount of time in                  
*                                      milliseconds that a unit of              
*                                      work was suspended when                  
*                                      requesting the Local lock                
*                                      of this address space     @51A*/         
*                                   /* Local lock data           @51A*/         
*   3 R725CLSU CHAR(8),             /* Number of times that a unit of           
*                                      work of this address space               
*                                      was suspended on a Local lock            
*                                                                @51A*/         
*   3 R725CLAL CHAR(8),             /* Number of times that a unit of           
*                                      work of this address space               
*                                      was suspended on a Local lock            
*                                      when there was already at least          
*                                      one other unit of work                   
*                                      suspended                 @51A*/         
*   3 R725CLTI CHAR(8);             /* Total amount of time in                  
*                                      milliseconds that a unit of work         
*                                      of this address space was                
*                                      suspended on a Local lock @51A*/         
*                                                                               
*                                                                               
*@SPACE;                                                                        
*   /* CML Lock Requestor Data Section (Subtype 5)               @51A*/         
*                                                                               
*DECLARE                                                                        
* 1 R725CLRD BASED(ADDR(SMF72HDR)+SMF72CRS),                  /* @51A*/         
*   3 R725CRKY CHAR(16) BDY(DWORD), /* Address space key         @51A*/         
*     5 R725CRJN CHAR(8),           /* Name of job               @51A*/         
*     5 *        CHAR(3),           /* Reserved                  @51A*/         
*     5 R725CRSP FIXED(8),          /* Service class period      @51A*/         
*     5 R725CRAS FIXED(16),         /* Address space ID          @51A*/         
*     5 *        FIXED(16),         /* Reserved                  @51A*/         
*   3 R725CRST CHAR(8),             /* Address space SToken      @51A*/         
*   3 R725CRSN CHAR(8),             /* Service class name        @51A*/         
*   3 *        CHAR(8),             /* Reserved                  @51A*/         
*   3 R725CRSU CHAR(8),             /* Number of times that a unit of           
*                                      work from this address space             
*                                      was suspended when requesting            
*                                      the Local lock of another                
*                                      address space             @51A*/         
*   3 R725CRAL CHAR(8),             /* Number of times that a unit of           
*                                      work from this address space             
*                                      was suspended when requesting            
*                                      the Local lock of another                
*                                      address space and there was              
*                                      already at least                         
*                                      one other unit of work                   
*                                      waiting for that lock     @51A*/         
*   3 R725CRTI CHAR(8);             /* Total amount of time in                  
*                                      milliseconds that a unit of              
*                                      work was suspended when                  
*                                      requesting the Local lock                
*                                      of another address space  @51A*/         
*                                                                               
*@SPACE;                                                                        
                                                                                
                                                                                
*@SPACE;                                                                        
*                                                                               
*   /* GRS Latch Type Data Section (Subtype 5)                   @51A*/         
*                                                                               
*DECLARE                                                                        
* 1 R725LATD BASED(ADDR(SMF72HDR)+SMF72LCS),                  /* @51A*/         
*   3 R725LAKY CHAR(16) BDY(DWORD), /* Address space key         @51A*/         
*     5 R725LAJN CHAR(8),           /* Name of job               @51A*/         
*     5 *        CHAR(3),           /* Reserved                  @51A*/         
*     5 R725LASP FIXED(8),          /* Service class period      @51A*/         
*     5 R725LAAS FIXED(16),         /* Address space ID          @51A*/         
*     5 *        FIXED(16),         /* Reserved                  @51A*/         
*   3 R725LAST CHAR(8),             /* Address space SToken      @51A*/         
*   3 R725LASN CHAR(8),             /* Service class name        @51A*/         
*   3 R725LATY FIXED(8),            /* Request Type              @51A*/         
*                                   /* X'01' = Latch Set Creator                
*                                      X'02' = Latch Requestor   @51A*/         
*   3 *        CHAR(7),             /* Reserved                  @51A*/         
*   3 R725LASU CHAR(8),             /* Number of times a Latch Obtain           
*                                      request was suspended                    
*                                      for the Request Type                     
*                                      as specified in R725LATY  @51A*/         
*   3 R725LATI CHAR(8),             /* Total amount of contention time          
*                                      in milliseconds that was caused          
*                                      by Latch Obtain requests                 
*                                      for the Request Type                     
*                                      as specified in R725LATY  @51A*/         
*   3 R725LASQ CHAR(16);            /* Sum of squares of the individual         
*                                      contention times in milliseconds         
*                                      that was caused by Latch Obtain          
*                                      requests for the Request Type            
*                                      as specified in R725LATY  @51A*/         
*@SPACE;                                                                        
*DECLARE                                                                        
*   R725LALC CONSTANT(1),           /* Latch Set Creator         @51A*/         
*   R725LALR CONSTANT(2);           /* Latch Requestor           @51A*/         
*DECLARE                                                                        
* 1 R725LASC  like R725LATD         based(addr(SMF72HDR)+SMF72LCS),             
* 1 R725LARE  like R725LATD         based(addr(SMF72HDR)+SMF72LRS);             
*                                                                               
*@SPACE;                                                                        
*                                                                               
*   /* GRS Enqueue Type Data Section (Subtype 5)                 @51A*/         
*                                                                               
*DECLARE                                                                        
* 1 R725ENTD BASED,                                           /* @51A*/         
*   3 R725ENKY CHAR(16) BDY(DWORD), /* Address space key         @51A*/         
*     5 R725ENJN CHAR(8),           /* Name of job               @51A*/         
*     5 *        CHAR(3),           /* Reserved                  @51A*/         
*     5 R725ENSP FIXED(8),          /* Service class period      @51A*/         
*     5 R725ENAS FIXED(16),         /* Address space ID          @51A*/         
*     5 *        FIXED(16),         /* Reserved                  @51A*/         
*   3 R725ENST CHAR(8),             /* Address space SToken      @51A*/         
*   3 R725ENSN CHAR(8),             /* Service class name        @51A*/         
*   3 R725ENSC FIXED(8),            /* Enqueue Scope Type        @51A*/         
*                                   /* X'01' = Scope=Step                       
*                                      X'02' = Scope=System                     
*                                      X'03' = Scope=Systems     @51A*/         
*   3 *        CHAR(7),             /* Reserved                  @51A*/         
*   3 R725ENRC CHAR(8),             /* Number of GRS ENQ requests               
*                                      with the scope as specified in           
*                                      R725ENSC for this address space          
*                                                                @51A*/         
*   3 R725ENSU CHAR(8),             /* Number of GRS ENQ requests               
*                                      with the scope as specified in           
*                                      R725ENSC that were suspended             
*                                      for this address space    @51A*/         
*   3 R725ENTI CHAR(8),             /* Total amount of contention time          
*                                      in milliseconds that was caused          
*                                      by GRS ENQ requests                      
*                                      with the scope as specified in           
*                                      R725ENSC for this address space          
*                                                                @51A*/         
*   3 R725ENSQ CHAR(16);            /* Sum of squares of the individual         
*                                      contention times in milliseconds         
*                                                                @51A*/         
*@SPACE;                                                                        
*DECLARE                                                                        
*   R725ENEP CONSTANT(1),           /* Scope=Step                @51A*/         
*   R725ENEM CONSTANT(2),           /* Scope=System              @51A*/         
*   R725ENMS CONSTANT(3);           /* Scope=Systems             @51A*/         
*DECLARE                                                                        
* 1 R725ENSE  like R725ENTD         based(addr(SMF72HDR)+SMF72TDS),             
* 1 R725ENSY  like R725ENTD         based(addr(SMF72HDR)+SMF72YDS),             
* 1 R725ENSS  like R725ENTD         based(addr(SMF72HDR)+SMF72SDS);             
*                                                             /* @51A*/         
*@SPACE;                                                                        
*                                                                               
*   /* GRS QScan Statistics Data Section (Subtype 5)             @63A*/         
*                                                                               
*DECLARE                                                                        
* 1 R725QSAD BASED(ADDR(SMF72HDR)+SMF72QSS),                  /* @63A*/         
*   3 R725QSKY CHAR(16) BDY(DWORD), /* Address space key         @63A*/         
*     5 R725QSJN CHAR(8),           /* Name of job               @63A*/         
*     5 *        CHAR(3),           /* Reserved                  @63A*/         
*     5 R725QSSP FIXED(8),          /* Service class period      @63A*/         
*     5 R725QSAS FIXED(16),         /* Address space ID          @63A*/         
*     5 *        FIXED(16),         /* Reserved                  @63A*/         
*   3 R725QSST CHAR(8),             /* Address space SToken      @63A*/         
*   3 R725QSSN CHAR(8),             /* Service class name        @63A*/         
*   3 *        CHAR(8),             /* Reserved                  @63A*/         
*   3 R725QSRC CHAR(8),             /* Number of requests including             
*                                      START and RESUME, but not QUIT           
*                                      requests                  @63A*/         
*   3 R725QSSC CHAR(8),             /* Number of specific requests with         
*                                      GQSCAN requests specified by             
*                                      QNAME and RNAME or ISGQUERY              
*                                      requests specifying a search             
*                                      by ENQTOKEN               @63A*/         
*   3 R725QSRR CHAR(8),             /* Total number of resources                
*                                      returned for these requests.             
*                                                                @63A*/         
*   3 R725QSRQ CHAR(16),            /* Sum of squares of number of              
*                                      resources returned for these             
*                                      requests                  @63A*/         
*   3 R725QSTI CHAR(8),             /* Total amount of execution times          
*                                      within GRS for these requests            
*                                      in microseconds           @63A*/         
*   3 R725QSTQ CHAR(16);            /* Sum of squares of individual             
*                                      request execution times                  
*                                      in microseconds           @63A*/         
*@SPACE;                                                                        
*   DECLARE                         /* Lock type constants DCLs      */         
*    CMS        FIXED(8) CONSTANT(1),  /* CMS                   @A03M*/         
*    ENQDEQ     FIXED(8) CONSTANT(2),  /* CMS EQDQ              @A03M*/         
*    LatchCMS   FIXED(8) CONSTANT(3),  /* CMS Latch             @A03M*/         
*    SMFCMS     FIXED(8) CONSTANT(4),  /* CMS SMF               @A03M*/         
*    LocLock    FIXED(8) CONSTANT(5),  /* Local Lock            @A03M*/         
*    CMLLock    FIXED(8) CONSTANT(6),  /* CML Owner             @A03M*/         
*    CMLLockSrc FIXED(8) CONSTANT(7),  /* CML Requestor         @A03M*/         
*    LatchCre   FIXED(8) CONSTANT(8),  /* Latch Creator         @A03M*/         
*    LatchReq   FIXED(8) CONSTANT(9),  /* Latch Requestor       @A03M*/         
*    EnqStep    FIXED(8) CONSTANT(10), /* ENQ STEP              @A03M*/         
*    EnqSyst    FIXED(8) CONSTANT(11), /* ENQ SYSTEM            @A03M*/         
*    EnqSystems FIXED(8) CONSTANT(12), /* ENQ SYSTEMS           @A03M*/         
*    QScanStats FIXED(8) CONSTANT(13); /* QScan Statistics      @A03M*/         
*@SPACE;                                                                        
*%LR72END:;                         /*                           @C1C*/         
