*/*      Bilingual Mapping Macro for SMF Record 76               @A04A          
         MACRO                                                                  
&NAME    ERBSMF76                                                               
***** START OF SPECIFICATIONS *****************************************         
*   MACCOMP                                                           *         
*   MACSTAT                                                           *         
*   MACMEAN MAPPING MACRO FOR SMF RECORD TYPE 76 (TRACE ACTIVITY)     *         
*                                                                     *         
*   MODULE-NAME = ERBSMF76                                            *         
*                                                                     *         
*   DESCRIPTIVE-NAME = SEE MACMEAN                                    *         
*                                                                     *         
*   PROPRIETARY STATEMENT:                                            *         
*       LICENSED MATERIALS - PROPERTY OF IBM                      @61A*         
*       "RESTRICTED MATERIALS OF IBM"                             @61A*         
*       COPYRIGHT IBM CORP. 1990, 2021                                *         
*                                                                     *         
*       STATUS: z/OS V2R5 Data Gatherer (HRG77D0)                @A04C*         
*                                                                     *         
*   FUNCTION : THIS MACRO MAPS THE COMPLETE SMF RECORD TYPE 76.       *         
*              THE RECORD IS CREATED BY RMF IF CPU ACTIVITY           *         
*              MEASUREMENTS ARE ACTIVATED.                            *         
*              THE RECORD CONSISTS OF 5 PARTS:                        *         
*              1. THE FIXED PORTION OF THE SMF HEADER.                *         
*                 THIS MAPPING IS INVOKED BY CALLING ERB76HDR MACRO.  *         
*              2. THE INDIVIDUAL HEADER EXTENSION WHICH CONTAINS      *         
*                 OFFSET/LENGTH/NUMBER TRIPLETS TO ADDRESS THE        *         
*                 RECORD PARTS FOLLOWING THE RMF PRODUCT SECTION.     *         
*              3. THE RMF PRODUCT SECTION.                            *         
*                 THIS MAPPING IS INVOKED BY CALLING ERB76PRO MACRO.  *         
*              4. THE RMF CONTROL SECTIONS                            *         
*              5. THE RMF DATA SECTIONS                               *         
*              6. THE VARIABLE FORMAT SET                             *         
*                                                                     *         
*   NOTES : NONE                                                      *         
*                                                                     *         
*   MODULE-TYPE = BILINGUAL MAPPING MACRO                             *         
*                                                                     *         
*   DISTRIBUTION LIBRARY: AGRBMAC1                               @A04C*         
*                                                                     *         
*   METHOD OF INVOCATION = SEE BELOW                                  *         
*                                                                     *         
*      BAL - ERBSMF76                                                 *         
*                                                                     *         
*      PLX - %INCLUDE SYSLIB(ERBSMF76)                           @A04C*         
*                                                                     *         
*   CHANGE-ACTIVITY =                                                 *         
*                                                                     *         
*      $N0=MON1,HRM3102,,WBS: NEW FOR RMF 3.1                     @N0A*         
*      $Y1=OPSSI,HRM4420,,CLL: OPERATOR SINGLE SYSTEM IMAGE       @Y1A*         
*      $B1=R430,HRM4430,,THE: DISTRIBUTION LIB IN PROLOG          @B1A*         
*      $D1=R520,HRM5520,,GBO: CLEANUP OF PADI-INCONSISTENCIES     @D1A*         
*      $61=R790,HRM7790,,MWE: EXPLICIT COPYRIGHT FOR EXT. MACRO   @61A*         
*      $A02=ZOSB,HRG77D0,,JBa: Move history comments to bottom   @A02A*         
*      $A03=ZOSB,HRG77D0,,JBa: Rename prefix ERB to GRB          @A03A*         
*      $A04=ZOSB,HRG77D0,,JBa: Common specifications section     @A04A*         
*      ALe: Update field description for REST services        @OA62081*         
*                                                                     *         
****** END OF SPECIFICATIONS *****************************************/         
*        %GOTO PLX76;   /* BILINGUAL MAPPING                     @A04C          
*                                                                               
*  ASM/RSM/SRM TRACE RECORD                                                     
*  VARIABLE LENGTH                                                              
*  LENGTH FORMULA = SMF76VFS + ( SMF76VFL * SMF76VFN )                          
*                                                                               
         SPACE 4                                                                
**********************  COMMON SMF HEADER  ****************************         
         ERBHDR 76                                                              
         SPACE 3                                                                
**********************  INDIVIDUAL HEADER EXTENSION  ******************         
SMF76HDX DS    0CL24    TOTAL HEADER EXTENSION                     @D1C         
SMF76TCS DS    BL4      OFFSET TO TRACE CONTROL SECTION                         
SMF76TCL DS    BL2      LENGTH OF TRACE CONTROL SECTION                         
SMF76TCN DS    BL2      NUMBER OF TRACE CONTROL SECTIONS                        
SMF76TDS DS    BL4      OFFSET TO TRACE DATA ENTRY SECTION                      
SMF76TDL DS    BL2      LENGTH OF TRACE DATA ENTRY SECTION                      
SMF76TDN DS    BL2      NUMBER OF TRACE DATA ENTRY SECTIONS                     
SMF76VFS DS    BL4      OFFSET TO VARIABLE FORMAT SET                           
SMF76VFL DS    BL2      LENGTH OF VARIABLE FORMAT SET                           
SMF76VFN DS    BL2      NUMBER OF VARIABLE FORMAT SET                           
         SPACE 3                                                                
**********************  COMMON RMF PRODUCT SECTION  *******************         
         ERBPRO 76                                                              
         SPACE 3                                                                
**********************  TRACE CONTROL SECTION  ************************         
*                       TRACE CONTROL AREA                     @Z40FPTH         
SMF76A   DSECT                                                                  
SMF76NUM DS    BL2      NUMBER OF SET ENTRIES THAT FOLLOW      @Z40FPPE         
*                       THE TOTAL VALUES                       @Z40FPPE         
SMF76RV4 DS    CL2      RESERVED                               @Z40FPTH         
*                       TRACE DATA ENTRY                       @Z40FPTH         
SMF76B   DSECT                                                                  
SMF76NAM DS    CL8      FIELD NAME                             @Z40FPTH         
SMF76OPT DS    BL1      FLAGS(OPTIONS SPECIFIED ON TRACE INPUT @Z40FPTH         
*                       IN RMF  PARMLIB MEMBER FOR THE FIELD   @Z40FPTH         
*                       NAME                                   @Z40FPTH         
*                       BIT  MEANING WHEN SET                  @Z40FPPE         
SMF76MNB EQU   X'80'     0   MINIMUM REQUESTED                 @Z40FPPE         
SMF76MXB EQU   X'40'     1   MAXIMUM REQUESTED                 @Z40FPPE         
SMF76AVB EQU   X'20'     2   AVERAGE REQUESTED                 @Z40FPPE         
SMF76STB EQU   X'10'     3   STANDARD DEVIATION REQUESTED      @Z40FPPE         
SMF76ENB EQU   X'08'     4   END VALUE REQUESTED               @Z40FPPE         
SMF76ALB EQU   X'04'     5   ALL OPTIONS REQUESTED             @Z40FPPE         
SMF76IPS EQU   X'02'     6   IPS CHANGE OCCURRED (AFTER        @Z40FPPE         
*                            INITIALIZATION)                   @Z40FPPE         
SMF76DMB EQU   X'01'     7   NAME IS A DOMAIN TABLE FIELD      @Z40FPPE         
SMF76OP1 DS    BL1      FLAGS                                                   
*                       BIT  MEANING WHEN SET                                   
SMF76LPB EQU   X'80'     0   LPB - ID TRACE REQUESTED                           
SMF76LPF EQU   X'40'     1   LPB - ID TRACE REQUEST ENDED                       
SMF76VLD EQU   X'20'     1   RECORD CONTAINS VALID DATA            @Y1A         
*                                                                               
SMF76SLN DS    BL1      LENGTH OF A SET                        @Z40FPPE         
SMF76DLN DS    BL1      LENGTH OF FIELD SAMPLED                @Z40FPPE         
SMF76SSS DS    BL2      STANDARD SAMPLES PER SET USED          @Z40FPPE         
SMF76SSL DS    BL2      SAMPLES PER SET FOR LAST SET IN INTRVAL@Z40FPPE         
SMF76MIN DS    BL4      MIN. VALUE OF CONTENTS OF FIELD DURING @Z40FPTH         
*                       INTERVAL (VALID IF BIT 0 OR BIT 5 OF   @OA62081         
*                       SMF76OPT IS SET)                       @OA62081         
SMF76MAX DS    BL4      MAX. VALUE OF CONTENTS OF FIELD DURING @Z40FPTH         
*                       INTERVAL (VALID IF BIT 1 OR BIT 5 OF   @OA62081         
*                       SMF76OPT IS SET)                       @OA62081         
SMF76AVG DS    CL8      ACCUMULATED VALUE USED TO COMPUTE THE  @Z40FPPE         
*                       AVERAGE AND STANDARD DEVIATION (VALID  @OA62081         
*                       IF BIT 2 OR BIT 5 OF SMF76OPT IS SET)  @OA62081         
SMF76STD DS    CL12     SUM OF SQUARES USED TO COMPUTE         @Z40FPPE         
*                       STANDARD DEVIATION (VALID IF BIT 3 OR  @OA62081         
*                       BIT 5 OF SMF76OPT IS SET)              @OA62081         
SMF76ENV DS    BL4      END VALUE OF CONTENTS OF FIELD (VALID  @OA62081         
*                       IF BIT 4 OR BIT 5 OF SMF76OPT IS SET)  @OA62081         
SMF76C   DSECT                                                                  
         DS    CL4      FOR VARIABLE FORMAT SETS OF LENGTH 4   @Z40FPPE         
         ORG   SMF76C                                                           
SMF76D   DS    CL2      FOR VARIABLE FORMAT SETS OF LENGTH 2   @Z40FPPE         
         MEND  ,                                                  @A04C         
*                       */                                                      
*%PLX76: ;                                                    /*@A04C*/         
*/* LENGTH FORMULA = SMF76VFS + ( SMF76VFL * SMF76VFN )              */         
 /* RECORD TYPE 76 - ASM/RSM/SRM TRACE RECORD                @Z40FPTH*/         
*   /* COMMON SMF HEADER */                                                     
*?ERBHDR TYPE(76) ATTRIBUT(BASED(SMF76PTR));                                    
*   /* INDIVIDUAL HEADER EXTENTION */                                           
*      2 SMF76HDX,                                                              
*        3 SMF76TCS FIXED(31),  /* OFFSET TO TRACE CONTROL SECTION   */         
*        3 SMF76TCL FIXED(15),  /* LENGTH OF TRACE CONTROL SECTION   */         
*        3 SMF76TCN FIXED(15),  /* NUMBER OF TRACE CONTROL SECTIONS  */         
*        3 SMF76TDS FIXED(31),  /* OFFSET TO TRACE DATA ENTRY SECTION*/         
*        3 SMF76TDL FIXED(15),  /* LENGTH OF TRACE DATA ENTRY SECTION*/         
*        3 SMF76TDN FIXED(15),  /* NUMBER OF TRACE DATA ENTRY SECT.  */         
*        3 SMF76VFS FIXED(31),  /* OFFSET TO VARIABLE FORMAT SET     */         
*        3 SMF76VFL FIXED(15),  /* LENGTH OF VARIABLE FORMAT SET     */         
*        3 SMF76VFN FIXED(15);  /* NUMBER OF VARIABLE FORMAT SET     */         
*@SPACE;                                                                        
*    /* COMMON RMF PRODUCT SECTION */                                           
*?ERBPRO TYPE(76) ATTRIBUT(BASED(ADDR(SMF76HDR)+SMF76PRS));                     
*    /* TRACE CONTROL SECTION */                                                
   DCL 1 SMF76A BASED(ADDR(SMF76HDR)+SMF76TCS) BDY(WORD),  /*@Z40FPTH*/         
         3 SMF76NUM FIXED(15),           /* NUMBER OF SET ENTRIES               
                                            THAT FOLLOW THE TOTAL               
                                            VALUES                  */          
         3 SMF76RV4 CHAR(2);             /* RESERVED                */          
         @SPACE;                                                                
     /* TRACE DATA ENTRY SECTION   */                                           
   DCL 1 SMF76B BASED(ADDR(SMF76HDR)+SMF76TDS) BDY(WORD),  /*@Z40FPTH*/         
         3 SMF76NAM CHAR(8),             /* FIELD NAME             */           
         3 SMF76OPT BIT(8),              /* FLAGS(OPTIONS SPECIFIED             
                                           ON TRACE INPUT IN RMF                
                                           PARMLIB MEMBER FOR THE               
                                           FIELD NAME)             */           
           5 SMF76MNB BIT(1),            /* MINIMUM REQUESTED       */          
           5 SMF76MXB BIT(1),            /* MAXIMUM REQUESTED       */          
           5 SMF76AVB BIT(1),            /* AVERAGE REQUESTED       */          
           5 SMF76STB BIT(1),            /* STD. DEV. REQUESTED     */          
           5 SMF76ENB BIT(1),            /* END VALUE REQUESTED     */          
           5 SMF76ALB BIT(1),            /* ALL OPTIONS REQUESTED   */          
           5 SMF76IPS BIT(1),            /* IPS CHANGE OCCURRED                 
                                            (AFTER INITIALIZATION)  */          
           5 SMF76DMB BIT(1),            /* NAME IS A DOMAIN TABLE              
                                            FIELD                   */          
         3 SMF76OP1 BIT(8),              /* FLAGS                   */          
           5 SMF76LPB BIT(1),            /* LPB - ID TRACE REQUESTED*/          
           5 SMF76LPF BIT(1),            /* LPB TRACE REQUEST ENDED */          
           5 SMF76VLD BIT(1),            /* ON = VALID DATA     @Y1A*/          
           5 *        BIT(5),            /* RESERVED            @D1C*/          
         3 SMF76SLN FIXED(8),            /* LENGTH OF A SET         */          
         3 SMF76DLN FIXED(8),            /* LENGTH OF FIELD SAMPLED */          
         3 SMF76SSS FIXED(15),           /* SAMPLES PER SET         */          
         3 SMF76SSL FIXED(15),           /* SAMPLES PER SET FOR LAST            
                                            SET IN INTERVAL         */          
         3 SMF76MIN FIXED(32),           /* MIN. VALUE OF CONTENTS              
                                            OF FIELD DURING INTERVAL            
                                            (VALID IF BIT 0 OR BIT 5            
                                            OF SMF76OPT IS SET)                 
                                                            @OA62081*/          
         3 SMF76MAX FIXED(32),           /* MAX. VALUE OF CONTENTS              
                                            OF FIELD DURING INTERVAL            
                                            (VALID IF BIT 1 OR BIT 5            
                                            OF SMF76OPT IS SET)                 
                                                            @OA62081*/          
         3 SMF76AVG CHAR(8),             /* ACCUMULATED VALUE USED              
                                            TO COMPUTE THE AVERAGE              
                                            STANDARD DEVIATION (VALID           
                                            IF BIT 2 OR BIT 5 OF                
                                            SMF76OPT IS SET)                    
                                                            @OA62081*/          
         3 SMF76STD CHAR(12),            /* SUM OF SQUARES USED TO              
                                            COMPUTE STANDARD                    
                                            DEVIATION (VALID IF BIT 3           
                                            OR BIT 5 OF SMF76OPT IS             
                                            SET)            @OA62081*/          
         3 SMF76ENV FIXED(32);           /* END VALUE OF CONTENTS               
                                            OF FIELD (VALID IF BIT 4            
                                            OR BIT 5 OF SMF76OPT IS             
                                            SET)            @OA62081*/          
 /* SMF76C,D ARE ARRAYS REPRESENTING THE SAME STORAGE:       @Z40FPPE*/         
 /*   SMF76C IS FOR VARIABLE FORMAT SETS OF LENGTH 4         @Z40FPPE*/         
 /*   SMF76D IS FOR VARIABLE FORMAT SETS OF LENGTH 2         @Z40FPPE*/         
   DCL SMF76C (*) CHAR(4) BASED(ADDR(SMF76HDR)+SMF76VFS);                       
                                                           /*@Z40FPPE*/         
   DCL SMF76D (*) CHAR(2) BASED(ADDR(SMF76HDR)+SMF76VFS);                       
                                                           /*@Z40FPPE*/         
