*/* Bilingual Mapping Macro for SMF Record type 71                              
         MACRO                                                                  
         ERBSMF71                                                               
***** START OF SPECIFICATIONS *****************************************         
*                                                                     *         
*01* Proprietary Statement:                                           *         
*       Licensed Materials - Property of IBM                      @61A*         
*       "Restricted Materials of IBM"                             @61A*         
*       Copyright IBM Corp. 1983, 2021                                *         
*                                                                     *         
*       Status: z/OS V2R5 Data Gatherer (HRG77D0)                     *         
*                                                                     *         
*01* Macro Name: ERBSMF71                                             *         
*                                                                     *         
*01* Descriptive Name: SMF Record 71 (Paging Activity Measurement)    *         
*02* Acronym: SMF71                                                   *         
*                                                                     *         
*01* DSECT names: SMF71HDR, SMF71PRO, SMF71PAG                        *         
*                                                                     *         
*01* Component: Resource Measurement Faciliy (27401)                  *         
*                                                                     *         
*01* Eye Catcher. None                                                *         
*01   Offset: N/A                                                     *         
*01   Length: N/A                                                     *         
*                                                                     *         
*01* Storage Attributes:                                              *         
*02*  Subpool: 7                                                      *         
*02*  Key: 8                                                          *         
*02*  Residency:                                                      *         
*02*  Main Storage: N/A                                               *         
*02*  Auxiliary Storage: N/A                                          *         
*02*  Virtual Storage: N/A                                            *         
*                                                                     *         
*01* Function = This macro maps the complete SMF record type 71.      *         
*             The record is created by RMF if Paging Activity         *         
*             measurements are activated.                             *         
*             The record consists of 4 parts:                         *         
*             1. The fixed portion of the SMF header.                 *         
*                This mapping is invoked by calling macro ERBHDR.     *         
*             2. The individual header extension which contains       *         
*                offset/length/number triplets to address the         *         
*                record parts following the RMF product section.      *         
*             3. The RMF product section.                             *         
*                This mapping is invoked by calling macro ERBPRO.     *         
*             4. The RMF paging data section                      @51C*         
*                                                                     *         
*01* Notes: See below                                             @51C*         
*                                                                     *         
*01* Size:                                                            *         
*                                                                     *         
*     - Common header:    36 bytes                                    *         
*     - Header extension: 16 bytes                                    *         
*     - Product section:  104 bytes                               @72C*         
*     - Paging data section: 2440 bytes                           @92C*         
*     - Swap Placement section: no longer filled                  @51C*         
*                                                                     *         
*01* Method of access: See below                                      *         
*                                                                     *         
*       BAL: ERBSMF71                                                 *         
*                                                                     *         
*       PL/X: %INCLUDE SYSLIB(ERBSMF71) semicolon                     *         
*                                                                     *         
*01* Pointed to by: SMF71PTR                                          *         
*                                                                     *         
*01* Serialization. None                                              *         
*                                                                     *         
*01* Created by: GRBMFDPP                                             *         
*                                                                     *         
*01* Deleted by: ERBMFRGM                                             *         
*                                                                     *         
*01* Module-type: BILINGUAL MAPPING MACRO                             *         
*                                                                     *         
*01* Status: z/OS V2R5 Data Gatherer (HRG77D0)                        *         
*                                                                     *         
*01* Frequency: 1                                                     *         
*                                                                     *         
*01* Dependencies: None                                               *         
*                                                                     *         
*01* Distribution Library: SYS1.MACLIB                            @01C*         
*                                                                     *         
*01* Change Activity: See below                                       *         
*                                                                     *         
* $N0=SMFFORMT,HRM3102,,FRS: NEW FOR RMF 3.1                      @N0A*         
* $P1=ES,HRM3302,,CIH: SP2.2 EXTENDED STORE                       @P1A*         
* $Q1=MISC,HRM3402,,WEY: CSA FIXED FRAMES COUNT INTERFACE         @Q1A*         
* REMOVE ASTERISKS SO THAT ERBPRO AND ERBHDR ARE CALLED       @YA01276*         
*   $W1=SP310,HRM4410,,SOT: MVS SP 3.1.0 SUPPORT                  @W1A*         
*   $W2=RCLS,HRM4410,,SOT: RMF collector service                  @W2A*         
* $W3=VIOSPE,HRM4410,,PAE: SUPPORT FOR VIO TO EXT STORAGE     @YA09186*         
* $W4=SP310E,JRM4411,,PAE: MVS SP 3.1.0E Support                  @W4A*         
* SHR: Include FLPA/EFLPA frames and central frame zero       @YA34458*         
* $W4=SP310E,JRM4411,,PAE: MVS SP 3.1.0E Support                  @W4A*         
* $A1=APPC,JRM4421,,BAJU: APPC tolerating support                 @A1A*         
* $A2=WSET,JRM4421,,JUR: Working set management/block paging      @A2A*         
* $A9=PGRC,JRM4422,,DPN: Page Reclaim data fields deleted         @A9A*         
* $B1=R430,HRM4430,,THE: Distribution lib in prolog               @B1A*         
* $B2=R430,HRM4430,,WMH: Page Movement Time - CPU timer units     @B2A*         
* $B3=OMVS,HRM4430,,RPT: OPEN/MVS Toleration Support              @B3A*         
* $C1=MISC,HRM4440,,PFU: RSM Block Paging support enhancement     @C1A*         
*  JS:Add SMF71PRC Field again to be available for PP Summary @YA62328*         
*     Reports of Pre-421 SMF Records                                  *         
* $C2=MISC,HRM5510,,VOH: Skip ASM part in PL/X (PTM KRN0041)      @C2A*         
* $D1=CAP,HRM5520,,JKE: Captured Storage support                  @D1A*         
* $D2=R520,HRM5520,,GBO: Cleanup of PADI-inconsistencies          @D2A*         
* $F1=STOR,HRM6604,,AJU: New storage fields                       @F1A*         
* $I1=BIT64,HRM7703,,VTH: 64 Bit real support                     @I1A*         
* $J1=MISC,HRM7705,,GUB: New swap reason code                     @J1A*         
* FDL: Considers PFT space in Total Frames counter            @WA52990*         
* $K1=SHRM,HRM7708,,VTH: Shared 64 bit memory support             @K1A*         
* $01=GT128,HRM7730,,GUB: >128G real storage support              @01A*         
* $11=LPS,HRM7740,,WLR: Large Page support                        @11A*         
* $21=COMM,HRM7750,,WLR: 64-bit Common Memory support             @21A*         
* $31=STATS,HRM7760,,WLR: Additional SMF statistics               @31A*         
* $51=SPLP,HRM7780,,WLR: SCM and Pageable Large Pages Support     @51A*         
* WLR: Adds Logial Swaps Total                                @OA36188*         
* $61=R790,HRM7790,,WLR: Explicit copyright for ext. macro        @61A*         
* $62=SPLP2,OA38660,,WLR: SCM and Pageable Large Pages Support    @62A*         
* $63=MISC,OA38660,,WLR: Handling for RPD3                        @63A*         
* $64=MISC,OA38660,,WLR: Fields for future use                    @64A*         
* WLR: Unfence SCM support                                    @OA38660*         
* PMU: Considers fixed 1MB frames included in RCEAFC          @OA42510*         
*      (RMF support for RSM APAR OA41968)                     @OA42510*         
* $71=4TB,OA44503,,WLR: 4TB support                               @71A*         
* $72=MT2,OA44101,,RRe: MT-2 support                              @72A*         
* $73=MISC,HRM77A0,,PMU: Remove OA42510 AFC adjustments           @73A*         
* $74=SPLP3,HRM77A0,,JBa: Shared Pageable Large Pages             @74A*         
* $75=Misc,HRM77A0,,JBa: RFEs 48206,48231,63681 addnl HV info     @75A*         
* $76=FreM,OA46608,,JBa: Freemained Frames OA46291 RSM            @76A*         
* $81=2GB,OA48913,,JBa: Report on 2GB frame usage                 @81A*         
* $82=HVArea,OA52452,,UMu: RSM Real Storage Areas change          @82A*         
* $91=RUCSA,HRM77C0,,UMu: Restricted Use CSA implementation       @91A*         
* $92=SHR64,OA57325,,JBO: Support 64 bit shared page groups       @92A*         
* $A02=ZOSB,HRG77D0,,JBa: Rename prefix ERB to GRB               @A02A*         
* JKu: Update field description for REST services             @OA62081*         
*                                                                     *         
****** END OF SPECIFICATIONS *****************************************/         
*        %GOTO PLS71;                                          /*@C2A*/         
         SPACE 3                                                                
**********************  COMMON SMF HEADER  ****************************         
         ERBHDR 71                                                              
         SPACE 3                                                                
**********************  INDIVIDUAL HEADER EXTENSION  ******************         
         SPACE                                                                  
SMF71HDX DS    0CL16    HEADER EXTENSION                          @D2A          
SMF71PDS DS    BL4      OFFSET TO PAGING DATA SECTION                           
SMF71PDL DS    BL2      LENGTH OF PAGING DATA SECTION                           
SMF71PDN DS    BL2      NUMBER OF PAGING DATA SECTION                           
SMF71SWS DS    BL4      OFFSET TO SWAP PLACEMENT DATA SECTION     @P1A          
SMF71SWL DS    BL2      LENGTH OF SWAP PLACEMENT DATA SECTION     @P1A          
SMF71SWN DS    BL2      NUMBER OF SWAP PLACEMENT DATA SECTION     @P1A          
         SPACE 3                                                                
**********************  COMMON RMF PRODUCT SECTION  *******************         
         ERBPRO 71                                                              
         SPACE 3                                                                
**********************  PAGING DATA SECTION  **************************         
SMF71PAG DSECT                                                                  
SMF71PIN DS    BL4      PAGE-INS EXCLUDING VIO AND SWAP                         
SMF71POT DS    BL4      PAGE-OUTS EXCLUDING VIO AND SWAP                        
SMF71PRC DS    BL4      RESERVED (PAGE RECLAIMS EXCLUDING VIO                   
*                         ZERO VALUE FOR 421 AND HIGHER)      @OA62081          
SMF71SSQ DS    BL4      # OF MEMORY SWAP SEQUENCES                              
SMF71SIN DS    BL4      SWAP-IN PAGES                                           
SMF71SOT DS    BL4      SWAP-OUT PAGES                                          
SMF71VIN DS    BL4      VIO PAGE-INS                                            
SMF71VOT DS    BL4      VIO PAGE-OUTS                                           
         DS    BL4      RESERVED                                  @A9C          
SMF71SNI DS    BL4      SYSTEM PAGABLE AREAS NON-VIO PAGE-INS                   
SMF71SNO DS    BL4      SPA NON-VIO PAGE-OUTS                                   
         DS    BL4      RESERVED                                  @A9C          
SMF71LNI DS    BL4      LPA PAGE-INS,NON-VIO AND NON-SWAP                       
         DS    BL4      RESERVED                                  @A9C          
SMF71AFC DS    BL4      MAIN STORAGE AVAILABLE FRAME COUNT                      
SMF71TFC DS    BL4      MAIN STORAGE TOTAL FRAME COUNT                          
SMF71TSC DS    BL4      AUX TOTAL SLOT COUNT                                    
SMF71DSC DS    BL4      AUX DATA SET SLOT COUNT                                 
SMF71VSC DS    BL4      AUX VIRTUAL MEMORY SLOT COUNT                           
SMF71NSC DS    BL4      AUX UNALLOCATED SLOT COUNT                              
SMF71FIN DS    BL4      NUMBER FRAMES IN NUCLEUS                                
SMF71MNF DS    BL4      MIN AVAILABLE PAGE FRAMES                               
SMF71MXF DS    BL4      MAX AVAILABLE PAGE FRAMES                               
SMF71AVF DS    BL4      AVG AVAILABLE PAGE FRAMES                               
SMF71MNP DS    BL4      MIN CSA PAGEABLE FRAMES,                                
*                       includes Restriced Use CSA (RUCSA)        @91C          
SMF71MXP DS    BL4      MAX CSA PAGEABLE FRAMES, includes RUCSA   @91C          
SMF71AVP DS    BL4      AVG CSA PAGEABLE FRAMES, includes RUCSA   @91C          
SMF71MNS DS    BL4      MIN ADDR SPACE PAGEABLE FRAMES                          
SMF71MXS DS    BL4      MAX ADDR SPACE PAGEABLE FRAMES                          
SMF71AVS DS    BL4      AVG ADDR SPACE PAGEABLE FRAMES                          
SMF71MNT DS    BL4      MIN TOTAL PAGEABLE FRAMES                               
SMF71MXT DS    BL4      MAX TOTAL PAGEABLE FRAMES                               
SMF71AVT DS    BL4      AVG TOTAL PAGEABLE FRAMES                               
SMF71MNQ DS    BL4      MIN SQA FIXED FRAMES                                    
SMF71MXQ DS    BL4      MAX SQA FIXED FRAMES                                    
SMF71AVQ DS    BL4      AVG SQA FIXED FRAMES                                    
SMF71MNC DS    BL4      MIN CSA FIXED FRAMES, includes RUCSA      @91C          
SMF71MXC DS    BL4      MAX CSA FIXED FRAMES, includes RUCSA      @91C          
SMF71AVC DS    BL4      AVG CSA FIXED FRAMES, includes RUCSA      @91C          
SMF71MNR DS    BL4      MIN ADDRESS SPACE FIXED FRAMES (W/O LSQA)               
SMF71MXR DS    BL4      MAX ADDRESS SPACE FIXED FRAMES (W/O LSQA)               
SMF71AVR DS    BL4      AVG ADDRESS SPACE FIXED FRAMES (W/O LSQA)               
SMF71MNX DS    BL4      MIN TOTAL FIXED FRAMES                                  
SMF71MXX DS    BL4      MAX TOTAL FIXED FRAMES                                  
SMF71AVX DS    BL4      AVG TOTAL FIXED FRAMES                                  
SMF71MNU DS    BL4      MIN AVAILABLE USER AUXILIARY SLOTS                      
SMF71MXU DS    BL4      MAX AVAILABLE USER AUXILIARY SLOTS                      
SMF71AVU DS    BL4      AVG AVAILABLE USER AUXILIARY SLOTS                      
SMF71MNV DS    BL4      MIN USER VIO AUXILIARY SLOTS                            
SMF71MXV DS    BL4      MAX USER VIO AUXILIARY SLOTS                            
SMF71AVV DS    BL4      AVG USER VIO AUXILIARY SLOTS                            
SMF71MNM DS    BL4      MIN USER MEMORY AUXILIARY SLOTS                         
SMF71MXM DS    BL4      MAX USER MEMORY AUXILIARY SLOTS                         
SMF71AVM DS    BL4      AVG USER MEMORY AUXILIARY SLOTS                         
SMF71MNB DS    BL4      MINIMUM UNAVAILABLE(BAD) USER SLOTS                     
SMF71MXB DS    BL4      MAXIMUM UNAVAILABLE(BAD) USER SLOTS                     
SMF71AVB DS    BL4      AVERAGE UNAVAILABLE(BAD) USER SLOTS                     
SMF71MNA DS    BL4      MIN TOTAL USER AUXILIARY SLOTS                          
SMF71MXA DS    BL4      MAX TOTAL USER AUXILIARY SLOTS                          
SMF71IS1 DS    BL2      INVALID SAMPLE TO BE SKIPPED BECAUSE THERE WERE         
*                       ERRORS AT THE RSM FIXED FRAMES COUNTING                 
*                       INTERFACE (IARXCNTF)                      @Q1C          
SMF71IS2 DS    BL2      INVALID SAMPLE TO BE SKIPPED BECAUSE THERE WERE         
*                       NEGATIVE VALUES AT THE CALULATION OF THE                
*                       FIXED CSA FRAMES COUNT                    @Q1C          
SMF71VME DS    BL4      Reserved                                  @51C          
SMF71VMG DS    BL4      Reserved                                  @51C          
SMF71VRE DS    BL4      Reserved                                  @51C          
SMF71MVE DS    BL4      Reserved                                  @51C          
SMF71XVE DS    BL4      Reserved                                  @51C          
SMF71AVE DS    BL4      Reserved                                  @51C          
SMF71RSS DS    BL4      Reserved                                  @51C          
SMF71EXS DS    BL4      Reserved                                  @51C          
SMF71EES DS    BL4      Reserved                                  @51C          
SMF71TOS DS    BL4      Reserved                                  @51C          
SMF71TXS DS    BL4      Reserved                                  @51C          
SMF71LGS DS    BL4      Reserved                                  @51C          
SMF71LFS DS    BL4      Reserved                                  @51C          
SMF71LSS DS    BL4      Reserved                                  @51C          
SMF71LSE DS    BL4      Reserved                                  @51C          
SMF71NLP DS    BL4      Min total LPA frames                   @YA34458         
SMF71XLP DS    BL4      Max total LPA frames                   @YA34458         
SMF71ALP DS    BL4      Avg total LPA frames                   @YA34458         
SMF71NLF DS    BL4      MIN LPA FIXED FRAMES                                    
SMF71XLF DS    BL4      MAX LPA FIXED FRAMES                                    
SMF71ALF DS    BL4      AVG LPA FIXED FRAMES                                    
SMF71NLS DS    BL4      MIN LSQA FIXED FRAMES                                   
SMF71XLS DS    BL4      MAX LSQA FIXED FRAMES                                   
SMF71ALS DS    BL4      AVG LSQA FIXED FRAMES                                   
SMF71MNL DS    BL4      MIN.NUMBER OF FIXED FRAMES BELOW 16 MEG                 
SMF71MXL DS    BL4      MAX.NUMBER OF FIXED FRAMES BELOW 16 MEG                 
SMF71AVL DS    BL4      AVG.NUMBER OF FIXED FRAMES BELOW 16 MEG                 
SMF71PMV DS    BL4      TOTAL PAGE MOVES                                        
SMF71OPT DS    CL8      SRM OPT MEMBER NAME                       @P1A          
SMF71PES DS    BL4      Reserved                                  @51C          
SMF71PEA DS    BL4      Reserved                                  @51C          
SMF71AMN DS    BL4      Reserved                                  @51C          
SMF71AMX DS    BL4      Reserved                                  @51C          
SMF71ASA DS    BL4      Reserved                                  @51C          
SMF71LIC DS    BL4      MIN VALUE HIGH UIC                        @P1A          
SMF71HIC DS    BL4      MAX VALUE HIGH UIC                        @P1A          
SMF71ACA DS    BL4      AVG VALUE HIGH UIC                        @P1A          
*                       SCALE FACTOR IS -1                        @P1A          
SMF71LMA DS    BL4      Reserved                                  @51C          
SMF71HMA DS    BL4      Reserved                                  @51C          
SMF71AMA DS    BL4      Reserved                                  @51C          
SMF71CF  DS    BL4      Reserved                                  @51C          
SMF71OLE DS    BL4      Reserved                                  @51C          
SMF71RES DS    BL4      Reserved                                  @51C          
SMF71MSR DS    BL4      min SQA pages in central storage                        
*                           CTSQAF + CTRSQAF                      @W1A          
SMF71XSR DS    BL4      max SQA pages in central storage          @W1A          
SMF71ASR DS    BL4      avg SQA pages in central storage          @W1A          
SMF71MSE DS    BL4      Reserved                                  @51C          
SMF71XSE DS    BL4      Reserved                                  @51C          
SMF71ASE DS    BL4      Reserved                                  @51C          
SMF71LME DS    BL4      Reserved                                  @51C          
SMF71LXE DS    BL4      Reserved                                  @51C          
SMF71LAE DS    BL4      Reserved                                  @51C          
SMF71CME DS    BL4      Reserved                                  @51C          
SMF71CXE DS    BL4      Reserved                                  @51C          
SMF71CAE DS    BL4      Reserved                                  @51C          
SMF71MLR DS    BL4      min LSQA pages in central storage                       
*                           CTLSQAF + CTRLSQAF                    @W1A          
SMF71XLR DS    BL4      max LSQA pages in central storage         @W1A          
SMF71ALR DS    BL4      avg LSQA pages in central storage         @W1A          
SMF71MLE DS    BL4      Reserved                                  @51C          
SMF71XLE DS    BL4      Reserved                                  @51C          
SMF71ALE DS    BL4      Reserved                                  @51C          
SMF71RME DS    BL4      Reserved                                  @51C          
SMF71RXE DS    BL4      Reserved                                  @51C          
SMF71RAE DS    BL4      Reserved                                  @51C          
SMF71ISC DS    BL4      no of invalid samples ret. from CLS       @W2A          
SMF71HME DS    BL4      Reserved                                  @51C          
SMF71HRE DS    BL4      Reserved                                  @51C          
SMF71HMG DS    BL4      Reserved                                  @51C          
SMF71HOT DS    BL4      Number of hiperspace page-outs            @W4A          
SMF71HIN DS    BL4      Number of hiperspace page-ins             @W4A          
SMF71MHE DS    BL4      Reserved                                  @51C          
SMF71XHE DS    BL4      Reserved                                  @51C          
SMF71AHE DS    BL4      Reserved                                  @51C          
SMF71BLP DS    BL4      blocked pages paged in                    @A2A          
SMF71BLK DS    BL4      number of blocks paged in                 @A2A          
SMF71PWS DS    BL4      Reserved                                  @51C          
SMF71FNM DS    BL4      Reserved                                  @51C          
SMF71PMT DS    CL8      Steal timer - elapsed time spent in preferred           
*                        steal - in CPU Timer units.              @B2A          
SMF71SBI DS    BL4      System Pageable Areas Block Page-Ins      @C1A          
SMF71LBI DS    BL4      LPA Block Page Page-Ins                   @C1A          
SMF71ASI DS    CL8      Number of page-ins from auxiliary storage               
*                       for shared pages                                        
*                       Format: long floating point               @92C          
SMF71ASO DS    CL8      Number of page-outs to auxiliary storage                
*                       for shared pages                                        
*                       Format: long floating point               @92C          
SMF71ESI DS    CL8      Reserved                                  @51C          
SMF71ESO DS    CL8      Reserved                                  @51C          
SMF71MGT DS    CL8      Minimum number of shared pages in                       
*                       the system                                              
*                       Format: long floating point               @92C          
SMF71XGT DS    CL8      Maximum number of shared pages in                       
*                       the system                                              
*                       Format: long floating point               @92C          
SMF71AGT DS    CL8      Average number of shared pages in                       
*                       the system                                              
*                       Format: long floating point               @92C          
SMF71MGC DS    CL8      Minimum number of shared pages in                       
*                       central storage                                         
*                       Format: long floating point               @92C          
SMF71XGC DS    CL8      Maximum number of shared pages in                       
*                       central storage                                         
*                       Format: long floating point               @92C          
SMF71AGC DS    CL8      Average number of shared pages in                       
*                       central storage                                         
*                       Format: long floating point               @92C          
SMF71MGE DS    CL8      Reserved                                  @51C          
SMF71XGE DS    CL8      Reserved                                  @51C          
SMF71AGE DS    CL8      Reserved                                  @51C          
SMF71MGA DS    CL8      Minimum number of auxiliary slots in use                
*                       for shared page groups                                  
*                       Format: long floating point               @D1A          
SMF71XGA DS    CL8      Maximum number of auxiliary slots in use                
*                       for shared page groups                                  
*                       Format: long floating point               @D1A          
SMF71AGA DS    CL8      Average number of auxiliary slots in use                
*                       for shared page groups                                  
*                       Format: long floating point               @D1A          
SMF71MGF DS    CL8      Minimum number of shared pages                          
*                       fixed in the system                                     
*                       Format: long floating point               @92C          
SMF71XGF DS    CL8      Maximum number of shared pages                          
*                       fixed in the system                                     
*                       Format: long floating point               @92C          
SMF71AGF DS    CL8      Average number of shared pages                          
*                       fixed in the system                                     
*                       Format: long floating point               @92C          
SMF71MGB DS    CL8      Minimum number of shared pages                          
*                       fixed below 16MB in the system                          
*                       Format: long floating point               @92C          
SMF71XGB DS    CL8      Maximum number of shared pages                          
*                       fixed below 16MB in the system                          
*                       Format: long floating point               @92C          
SMF71AGB DS    CL8      Average number of shared pages                          
*                       fixed below 16MB in the system                          
*                       Format: long floating point               @92C          
SMF71CAM DS    CL8      Minimum number of available central                     
*                       storage frames                                          
*                       Format: long floating point               @F1A          
SMF71CAX DS    CL8      Maximum number of available central                     
*                       storage frames                                          
*                       Format: long floating point               @F1A          
SMF71CAA DS    CL8      Average number of available central                     
*                       storage frames                                          
*                       (rceafc+rce_freemainedframes-                           
*                        max(rceafcok,mccafcok*mccdefam))                       
*                       Format: long floating point               @76C          
SMF71CLM DS    CL8      Minimum number of low impact central                    
*                       storage frames                                          
*                       Format: long floating point               @F1A          
SMF71CLX DS    CL8      Maximum number of low impact central                    
*                       storage frames                                          
*                       Format: long floating point               @F1A          
SMF71CLA DS    CL8      Average number of low impact central                    
*                       storage frames                                          
*                       Format: long floating point               @F1A          
SMF71CMM DS    CL8      Minimum number of medium impact central                 
*                       storage frames                                          
*                       Format: long floating point               @F1A          
SMF71CMX DS    CL8      Maximum number of medium impact central                 
*                       storage frames                                          
*                       Format: long floating point               @F1A          
SMF71CMA DS    CL8      Average number of medium impact central                 
*                       storage frames                                          
*                       Format: long floating point               @F1A          
SMF71CHM DS    CL8      Minimum number of high impact central                   
*                       storage frames                                          
*                       Format: long floating point               @F1A          
SMF71CHX DS    CL8      Maximum number of high impact central                   
*                       storage frames                                          
*                       Format: long floating point               @F1A          
SMF71CHA DS    CL8      Average number of high impact central                   
*                       storage frames                                          
*                       Format: long floating point               @F1A          
SMF71EAM DS    CL8      Reserved                                  @51C          
SMF71EAX DS    CL8      Reserved                                  @51C          
SMF71EAA DS    CL8      Reserved                                  @51C          
SMF71ELM DS    CL8      Reserved                                  @51C          
SMF71ELX DS    CL8      Reserved                                  @51C          
SMF71ELA DS    CL8      Reserved                                  @51C          
SMF71EMM DS    CL8      Reserved                                  @51C          
SMF71EMX DS    CL8      Reserved                                  @51C          
SMF71EMA DS    CL8      Reserved                                  @51C          
SMF71EHM DS    CL8      Reserved                                  @51C          
SMF71EHX DS    CL8      Reserved                                  @51C          
SMF71EHA DS    CL8      Reserved                                  @51C          
SMF71MVI DS    CL8      Minimum number of VIO pages in central                  
*                       storage                                                 
*                       Format: long floating point               @51C          
SMF71XVI DS    CL8      Maximum number of VIO pages in central                  
*                       storage                                                 
*                       Format: long floating point               @51C          
SMF71AVI DS    CL8      Average number of VIO pages in central                  
*                       storage                                                 
*                       Format: long floating point               @51C          
SMF71MHI DS    CL8      Minimum number of hiperspace pages in central           
*                       storage                                                 
*                       Format: long floating point               @51C          
SMF71XHI DS    CL8      Maximum number of hiperspace pages in central           
*                       storage                                                 
*                       Format: long floating point               @51C          
SMF71AHI DS    CL8      Average number of hiperspace pages in central           
*                       storage                                                 
*                       Format: long floating point               @51C          
SMF71VWS DS    CL8      Number of VIO pages written to central                  
*                       storage                                                 
*                       Format: long floating point               @51C          
SMF71VRS DS    CL8      Number of VIO pages read from central                   
*                       storage                                                 
*                       Format: long floating point               @51C          
SMF71HWS DS    CL8      Number of hiperpace pages written to central            
*                       storage                                                 
*                       Format: long floating point               @51C          
SMF71HRS DS    CL8      Number of hiperpace pages read from central             
*                       storage                                                 
*                       Format: long floating point               @51C          
SMF71MFB DS    CL8      Min number of pages fixed between 16M and 2G            
*                       Format: long floating point               @51C          
SMF71XFB DS    CL8      Max number of pages fixed between 16M and 2G            
*                       Format: long floating point               @51C          
SMF71AFB DS    CL8      Avg number of pages fixed between 16M and 2G            
*                       Format: long floating point               @I1A          
SMF71PTH DS    CL8      Average number of pages in system used by               
*                       shared memory objects                                   
*                       Format: long floating point               @92C          
SMF71PCH DS    CL8      Average number of shared pages in central               
*                       storage (with virtual storage addr above the            
*                       bar including high virtual DAT)                         
*                       Format: long floating point               @92C          
SMF71PAH DS    CL8      Average number of shared pages in aux. storage          
*                       (virtual storage addr above the bar)                    
*                       Format: long floating point               @K1A          
SMF71BLG DS    CL8      high water mark for number of shared bytes              
*                       from large virtual memory in memory object              
*                       for entire system                                       
*                       Format: long floating point               @K1A          
SMF71PIH DS    CL8      Number of page-ins from auxiliary storage               
*                       for shared pages                                        
*                       (with virtual storage addr above the bar)               
*                       Format: long floating point               @K1A          
SMF71POH DS    CL8      Number of page-outs to auxiliary storage                
*                       for shared pages                                        
*                       (with virtual storage addr above the bar)               
*                       Format: long floating point               @K1A          
SMF71ULM DS    BL4      Lowest minimum system UIC during the                    
*                       interval (from MCTMinSystemUIC)           @01A          
SMF71ULC DS    BL4      Lowest current system UIC during the                    
*                       interval (from MCTCurSystemUIC)           @01A          
SMF71UHC DS    BL4      Highest current system UIC during the                   
*                       interval (from MCTCurSystemUIC)           @01A          
SMF71UHX DS    BL4      Highest maximum system UIC during the                   
*                       interval (from MCTMaxSystemUIC)           @01A          
SMF71UAM DS    BL4      Average minimum system UIC during the                   
*                       interval (from MCTMinSystemUIC)           @01A          
SMF71UAC DS    BL4      Average current system UIC during the                   
*                       interval (from MCTCurSystemUIC)           @01A          
SMF71UAX DS    BL4      Average maximum system UIC during the                   
*                       interval (from MCTMaxSystemUIC)           @01A          
SMF71LOM DS    CL8      Minimum number of fixed memory objects that             
*                       are allocated in the system and can be backed           
*                       in 1 MB frames                                          
*                       Format: long floating point               @62C          
SMF71LOX DS    CL8      Maximum number of fixed memory objects that             
*                       are allocated in the system and can be backed           
*                       in 1 MB frames                                          
*                       Format: long floating point               @62C          
SMF71LOA DS    CL8      Average number of fixed memory objects that             
*                       are allocated in the system and can be backed           
*                       in 1 MB frames                                          
*                       Format: long floating point               @62C          
SMF71LRM DS    CL8      Minimum number of 1 MB pages fixed in                   
*                       central storage                                         
*                       Format: long floating point               @74C          
SMF71LRX DS    CL8      Maximum number of 1 MB pages fixed in                   
*                       central storage                                         
*                       Format: long floating point               @74C          
SMF71LRA DS    CL8      Average number of 1 MB pages fixed in                   
*                       central storage                                         
*                       Format: long floating point               @74C          
SMF71COM DS    CL8      Minimum number of memory objects allocated              
*                       in the high virtual common storage of the               
*                       system                                                  
*                       Format: long floating point               @51C          
SMF71COX DS    CL8      Maximum number of memory objects allocated              
*                       in the high virtual common storage of the               
*                       system                                                  
*                       Format: long floating point               @51C          
SMF71COA DS    CL8      Average number of memory objects allocated              
*                       in the high virtual common storage of the               
*                       system                                                  
*                       Format: long floating point               @51C          
SMF71CRM DS    CL8      Minimum number of pages from high virtual               
*                       common storage that are backed in central               
*                       storage                                                 
*                       Format: long floating point               @62C          
SMF71CRX DS    CL8      Maximum number of pages from high virtual               
*                       common storage that are backed in central               
*                       storage                                                 
*                       Format: long floating point               @62C          
SMF71CRA DS    CL8      Average number of pages from high virtual               
*                       common storage that are backed in central               
*                       storage                                                 
*                       Format: long floating point               @62C          
SMF71CFM DS    CL8      Minimum number of fixed pages from high                 
*                       virtual common storage that are backed in               
*                       central storage                                         
*                       Format: long floating point               @62C          
SMF71CFX DS    CL8      Maximum number of fixed pages from high                 
*                       virtual common storage that are backed in               
*                       central storage                                         
*                       Format: long floating point               @62C          
SMF71CFA DS    CL8      Average number of fixed pages from high                 
*                       virtual common storage that are backed in               
*                       central storage                                         
*                       Format: long floating point               @62C          
SMF71CSM DS    CL8      Minimum number of auxiliary storage slots               
*                       used for high virtual common memory pages               
*                       backed on DASD                                          
*                       Format: long floating point               @51C          
SMF71CSX DS    CL8      Maximum number of auxiliary storage slots               
*                       used for high virtual common memory pages on            
*                       backed on DASD                                          
*                       Format: long floating point               @51C          
SMF71CSA DS    CL8      Average number of auxiliary storage slots               
*                       used for high virtual common memory pages on            
*                       backed on DASD                                          
*                       Format: long floating point               @51C          
SMF71SOM DS    CL8      Minimum number of memory objects allocated              
*                       in the high virtual shared storage of the               
*                       system                                                  
*                       Format: long floating point               @51C          
SMF71SOX DS    CL8      Maximum number of memory objects allocated              
*                       in the high virtual shared storage of the               
*                       system                                                  
*                       Format: long floating point               @51C          
SMF71SOA DS    CL8      Average number of memory objects allocated              
*                       in the high virtual shared storage of the               
*                       system                                                  
*                       Format: long floating point               @51C          
SMF71SRM DS    CL8      Minimum number of pages from high virtual               
*                       shared storage that are backed in central               
*                       storage                                                 
*                       Format: long floating point               @62C          
SMF71SRX DS    CL8      Maximum number of pages from high virtual               
*                       shared storage that are backed in central               
*                       storage                                                 
*                       Format: long floating point               @62C          
SMF71SRA DS    CL8      Average number of pages from high virtual               
*                       shared storage that are backed in central               
*                       storage                                                 
*                       Format: long floating point               @62C          
SMF71GRN DS    BL4      Number of getmain requests that have been               
*                       issued                                    @31A          
SMF71FBN DS    BL4      Number of pages backed during getmain                   
*                       requests that have been issued            @62C          
SMF71FRN DS    BL4      Number of fix requests that have been issued            
*                       for storage (address space only) below two              
*                       gigabytes                                 @31A          
SMF71FFN DS    BL4      Number of pages that were requested to be               
*                       fixed for storage (address space only) below            
*                       two gigabytes                             @62C          
SMF711RN DS    BL4      Number of first reference faults taken    @31A          
SMF71NRN DS    BL4      Number of non-first reference faults                    
*                       taken                                     @31A          
SMF71RFL DS    BL1      Flags                                     @51A          
SMF71SCM EQU   X'80'    1... .... ON= SCM support enabled     @OA38660          
SMF71PLP EQU   X'40'    .1.. .... ON= Pageable Large Pages support              
*                                     enabled                     @62C          
*                       ..11 1111 Not used                        @51A          
         DS    CL3      Not used                                  @51A          
SMF71LFA DS    CL8      The maximum number of fixed 1 MB pages that             
*                       can be allocated as specified in the LFAREA             
*                       parameter                                               
*                       Format: long floating point               @82C          
SMF71L1M DS    CL8      Lowest maximum number of 1 MB frames that can           
*                       be used by fixed 1 MB pages                             
*                       Format: long floating point               @82C          
SMF71L1X DS    CL8      Highest maximum number of 1 MB frames that can          
*                       be used by fixed 1 MB pages                             
*                       Format: long floating point               @82C          
SMF71L1A DS    CL8      Average maximum number of 1 MB frames that can          
*                       be used by fixed 1 MB pages                             
*                       Format: long floating point               @82C          
SMF71L2M DS    CL8      Reserved. Value is now in SMF71L7M                      
*                       Format: long floating point               @82C          
SMF71L2X DS    CL8      Reserved. Value is now in SMF71L7X                      
*                       Format: long floating point               @82C          
SMF71L2A DS    CL8      Reserved. Value is now in SMF71L7A                      
*                       Format: long floating point               @82C          
SMF71L3M DS    CL8      Minimum number of 1 MB frames that are in-use           
*                       and are no longer available for fixed 1 MB              
*                       pages                                                   
*                       Format: long floating point               @82C          
SMF71L3X DS    CL8      Maximum number of 1 MB frames that are in-use           
*                       and are no longer available for fixed 1 MB              
*                       pages                                                   
*                       Format: long floating point               @82C          
SMF71L3A DS    CL8      Average number of 1 MB frames that are in-use           
*                       and are no longer available for fixed 1 MB              
*                       pages                                                   
*                       Format: long floating point               @82C          
SMF71L4M DS    CL8      Reserved.                                               
*                       Format: long floating point               @82C          
SMF71L4X DS    CL8      Reserved.                                               
*                       Format: long floating point               @82C          
SMF71L4A DS    CL8      Reserved.                                               
*                       Format: long floating point               @82C          
SMF71L5M DS    CL8      Reserved.                                               
*                       Format: long floating point               @82C          
SMF71L5X DS    CL8      Reserved.                                               
*                       Format: long floating point               @82C          
SMF71L5A DS    CL8      Reserved.                                               
*                       Format: long floating point               @82C          
SMF71L6M DS    CL8      Reserved.                                               
*                       Format: long floating point               @82C          
SMF71L6X DS    CL8      Reserved.                                               
*                       Format: long floating point               @82C          
SMF71L6A DS    CL8      Reserved.                                               
*                       Format: long floating point               @82C          
SMF71L7M DS    CL8      Minimum number of available 1 MB frames that            
*                       can be used by fixed 1 MB pages                         
*                       (same as SMF71L2M)                                      
*                       Format: long floating point               @82C          
SMF71L7X DS    CL8      Maximum number of available 1 MB frames that            
*                       can be used by fixed 1 MB pages                         
*                       (same as SMF71L2X)                                      
*                       Format: long floating point               @82C          
SMF71L7A DS    CL8      Average number of available 1 MB frames that            
*                       can be used by fixed 1 MB pages                         
*                       (same as SMF71L2A)                                      
*                       Format: long floating point               @82C          
SMF71S1M DS    CL8      Minimum total number of high virtual shared             
*                       memory pages                                            
*                       Format: long floating point               @62C          
SMF71S1X DS    CL8      Maximum total number of high virtual shared             
*                       memory pages                                            
*                       Format: long floating point               @62C          
SMF71S1A DS    CL8      Average total number of high virtual shared             
*                       memory pages                                            
*                       Format: long floating point               @62C          
SMF71S2M DS    CL8      Minimum number of shared memory objects that            
*                       are allocated in the system and can be backed           
*                       in 1 MB frames                                          
*                       Format: long floating point               @74A          
SMF71S2X DS    CL8      Maximum number of shared memory objects that            
*                       are allocated in the system and can be backed           
*                       in 1 MB frames                                          
*                       Format: long floating point               @74A          
SMF71S2A DS    CL8      Average number of shared memory objects that            
*                       are allocated in the system and can be backed           
*                       in 1 MB frames                                          
*                       Format: long floating point               @74A          
SMF71S3M DS    CL8      Minimum number of frames in use for shared              
*                       high virtual 4K pages                                   
*                       Format: long floating point               @74C          
SMF71S3X DS    CL8      Maximum number of frames in use for shared              
*                       high virtual 4K pages                                   
*                       Format: long floating point               @74C          
SMF71S3A DS    CL8      Average number of frames in use for shared              
*                       high virtual 4K pages                                   
*                       Format: long floating point               @74C          
SMF71S4M DS    CL8      Minimum number of 1MB pages used for shared             
*                       memory objects backed in central storage                
*                       Format: long floating point               @92C          
SMF71S4X DS    CL8      Maximum number of 1MB pages used for shared             
*                       memory objects backed in central storage                
*                       Format: long floating point               @92C          
SMF71S4A DS    CL8      Average number of 1MB pages used for shared             
*                       memory objects backed in central storage                
*                       Format: long floating point               @92C          
SMF71S5M DS    CL8      Minimum number of auxiliary storage slots used          
*                       for high virtual memory pages backed on DASD            
*                       Format: long floating point               @62C          
SMF71S5X DS    CL8      Maximum number of auxiliary storage slots used          
*                       for high virtual memory pages backed on DASD            
*                       Format: long floating point               @62C          
SMF71S5A DS    CL8      Average number of auxiliary storage slots used          
*                       for high virtual memory pages backed on DASD            
*                       Format: long floating point               @62C          
SMF71S6M DS    CL8      Minimum number of high virtual shared memory            
*                       pages backed on SCM storage                             
*                       Format: long floating point           @OA38660          
SMF71S6X DS    CL8      Maximum number of high virtual shared memory            
*                       pages backed on SCM storage                             
*                       Format: long floating point           @OA38660          
SMF71S6A DS    CL8      Average number of high virtual shared memory            
*                       pages backed on SCM storage                             
*                       Format: long floating point           @OA38660          
SMF71C1M DS    CL8      Minimum total number of high virtual common             
*                       memory pages                                            
*                       Format: long floating point               @62C          
SMF71C1X DS    CL8      Maximum total number of high virtual common             
*                       memory pages                                            
*                       Format: long floating point               @62C          
SMF71C1A DS    CL8      Average total number of high virtual common             
*                       memory pages                                            
*                       Format: long floating point               @62C          
SMF71C2M DS    CL8      Minimum number of high virtual common memory            
*                       1 MB fixed pages                          @74C          
SMF71C2X DS    CL8      Maximum number of high virtual common memory            
*                       1 MB fixed pages                          @74C          
SMF71C2A DS    CL8      Average number of high virtual common memory            
*                       1 MB fixed pages                          @74C          
SMF71C3M DS    CL8      Minimum number of high virtual common memory            
*                       1 MB pages backed in central storage      @74C          
SMF71C3X DS    CL8      Maximum number of high virtual common memory            
*                       1 MB pages backed in central storage      @74C          
SMF71C3A DS    CL8      Average number of high virtual common memory            
*                       1 MB pages backed in central storage      @74C          
SMF71C4M DS    CL8      Minimum number of high virtual common memory            
*                       pages backed on SCM storage                             
*                       Format: long floating point           @OA38660          
SMF71C4X DS    CL8      Maximum number of high virtual common memory            
*                       pages backed on SCM storage                             
*                       Format: long floating point           @OA38660          
SMF71C4A DS    CL8      Average number of high virtual common memory            
*                       pages backed on SCM storage                             
*                       Format: long floating point           @OA38660          
SMF71TSM DS    CL8      Minimum total number of 4K SCM blocks                   
*                       available to ASM                      @OA38660          
SMF71TSX DS    CL8      Maximum total number of 4K SCM blocks                   
*                       available to ASM                      @OA38660          
SMF71TSA DS    CL8      Average total number of 4K SCM blocks                   
*                       available to ASM                      @OA38660          
SMF71ASM DS    CL8      Minimum number of available (not in-use) SCM            
*                       blocks                                @OA38660          
SMF71ASX DS    CL8      Maximum number of available (not in-use) SCM            
*                       blocks                                @OA38660          
SMF71ASV DS    CL8      Average number of available (not in-use) SCM            
*                       blocks                                @OA38660          
SMF71BSM DS    CL8      Minimum number of bad SCM block       @OA38660          
SMF71BSX DS    CL8      Maximum number of bad SCM block       @OA38660          
SMF71BSA DS    CL8      Average number of bad SCM block       @OA38660          
SMF71USM DS    CL8      Minimum number of SCM blocks in-use   @OA38660          
SMF71USX DS    CL8      Maximum number of SCM blocks in-use   @OA38660          
SMF71USA DS    CL8      Average number of SCM blocks in-use   @OA38660          
SMF71TLS DS    BL4      Total number of logical swaps                           
*                       (from RMCASRC)                        @OA36188          
         DS    BL4      Not used                              @OA36188          
SMF71S7M DS    CL8      Minimum number of shared page groups backed             
*                       on SCM storage                                          
*                       Format: long floating point               @92C          
SMF71S7X DS    CL8      Maximum number of shared page groups backed             
*                       on SCM storage                                          
*                       Format: long floating point               @92C          
SMF71S7A DS    CL8      Average number of shared page groups backed             
*                       on SCM storage                                          
*                       Format: long floating point               @92C          
SMF71LVF DS    CL8      Average number of unused central storage page           
*                       frames (same as SMF71AVF)                               
*                       Format: long floating point               @71A          
SMF71LVS DS    CL8      Average number of pageable address space                
*                       central storage frames in the private address           
*                       space (same as SMF71AVS)                                
*                       Format: long floating point               @71A          
SMF71LVT DS    CL8      Average total number of central storage frames          
*                       used (same as SMF71AVT)                                 
*                       Format: long floating point               @71A          
SMF71LVR DS    CL8      Average number of non-LSQA fixed central                
*                       storage frames in the private address space             
*                       (same as SMF71AVR)                                      
*                       Format: long floating point               @71A          
SMF71LVX DS    CL8      Average total number of fixed central storage           
*                       frames used (same as SMF71AVX)                          
*                       Format: long floating point               @71A          
SMF71LVU DS    CL8      Average number of usable local page data set            
*                       slots that have not been allocated                      
*                       (same as SMF71AVU)                                      
*                       Format: long floating point               @71A          
SMF71LVV DS    CL8      Average number of local page data set slots             
*                       allocated to VIO private area pages                     
*                       (same as SMF71AVV)                                      
*                       Format: long floating point               @71A          
SMF71LVM DS    CL8      Average number of local page data set slots             
*                       allocated to non-VIO private area pages                 
*                       (same as SMF71AVM)                                      
*                       Format: long floating point               @71A          
SMF71LVB DS    CL8      Average number of unusable local page data              
*                       set slots (same as SMF71AVB)                            
*                       Format: long floating point               @71A          
SMF71MCF DS    BL4      Multithreading maximum capacity numerator               
*                       for general purpose processors.                         
*                       Divide this value by 1024 to get the                    
*                       multithreading maximum capacity factor for              
*                       all general purpose processors that were                
*                       configured ONLINE for the complete interval.            
*                                                                 @72A          
         DS    BL4      Reserved                                  @75A          
SMF71CPM DS    CL8      Minimum number of high virtual common pages             
*                       in-use                                                  
*                       Format: long floating point               @75A          
SMF71CPX DS    CL8      Maximum number of high virtual common pages             
*                       in-use                                                  
*                       Format: long floating point               @75A          
SMF71CPA DS    CL8      Average number of high virtual common pages             
*                       in-use                                                  
*                       Format: long floating point               @75A          
SMF714KM DS    CL8      Reserved                                  @82C          
SMF714KX DS    CL8      Reserved                                  @82C          
SMF714KA DS    CL8      Reserved                                  @82C          
SMF71PLM DS    CL8      Minimum number of 1 MB frames that are in-use           
*                       by pageable 1 MB pages                    @82C          
SMF71PLX DS    CL8      Maximum number of 1 MB frames that are in-use           
*                       by pageable 1 MB pages                    @82C          
SMF71PLA DS    CL8      Average number of 1 MB frames that are in-use           
*                       by pageable 1 MB pages                    @82C          
SMF71GOM DS    CL8      Minimum number of fixed 2 GB memory objects             
*                       allocated in the system.                                
*                       Format: long floating point               @81A          
SMF71GOX DS    CL8      Maximum number of fixed 2 GB memory objects             
*                       allocated in the system.                                
*                       Format: long floating point               @81A          
SMF71GOA DS    CL8      Average number of fixed 2 GB memory objects             
*                       allocated in the system.                                
*                       Format: long floating point               @81A          
SMF71GRM DS    CL8      Minimum number of 2 GB pages fixed in                   
*                       central storage (same as SMF71GUM).                     
*                       Format: long floating point               @81A          
SMF71GRX DS    CL8      Maximum number of 2 GB pages fixed in                   
*                       central storage (same as SMF71GUX).                     
*                       Format: long floating point               @81A          
SMF71GRA DS    CL8      Average number of 2 GB pages fixed in                   
*                       central storage (same as SMF71GUA).                     
*                       Format: long floating point               @81A          
SMF71GUM DS    CL8      Minimum number of 2 GB frames in the Large              
*                       Frame Area that are in-use by fixed memory              
*                       objects (same as SMF71GRM).                             
*                       Format: long floating point               @81A          
SMF71GUX DS    CL8      Maximum number of 2 GB frames in the Large              
*                       Frame Area that are in-use by fixed memory              
*                       objects (same as SMF71GRX).                             
*                       Format: long floating point               @81A          
SMF71GUA DS    CL8      Average number of 2 GB frames in the Large              
*                       Frame Area that are in-use by fixed memory              
*                       objects (same as SMF71GRA).                             
*                       Format: long floating point               @81A          
SMF71GUH DS    CL8      High water mark for the number of 2 GB frames           
*                       that are used by the system.                            
*                       Format: long floating point               @81A          
SMF71GAM DS    CL8      Minimum number of 2 GB frames in the Large              
*                       Frame Area that are not in-use.                         
*                       Format: long floating point               @81A          
SMF71GAX DS    CL8      Maximum number of 2 GB frames in the Large              
*                       Frame Area that are not in-use.                         
*                       Format: long floating point               @81A          
SMF71GAA DS    CL8      Average number of 2 GB frames in the Large              
*                       Frame area that are not in-use.                         
*                       Format: long floating point               @81A          
SMF71GFM DS    CL8      Lowest maximum number of 2 GB frames that               
*                       can be used by fixed 2 GB pages.                        
*                       Format: long floating point               @82C          
SMF71GFX DS    CL8      Highest maximum number of 2 GB frames that              
*                       can be used by fixed 2 GB pages.                        
*                       Format: long floating point               @82C          
SMF71GFA DS    CL8      Average maximum number of 2 GB frames that              
*                       can be used by fixed 2 GB pages.                        
*                       Format: long floating point               @82C          
SMF71NNF DS    CL8      Average number of non-nucleus frames                    
*                       comprising permanent storage                            
*                       Format: long floating point               @82A          
SMF71LSI DS    CL8      Average number of system-initiated demotions            
*                       from pageable large frame groups to 4K page             
*                       frames                                                  
*                       Format: long floating point               @82A          
SMF71LRI DS    CL8      Average number of request-initiated demotions           
*                       from pageable large frame groups to 4K page             
*                       frames                                                  
*                       Format: long floating point               @82A          
SMF71MHW DS    CL8      High water mark of the number of 1 MB frames            
*                       that were used to satisfy fixed 1 MB page               
*                       requests                                                
*                       Format: long floating point               @82A          
SMF71PIS DS    CL8      Average total number of page-ins of 4 KB                
*                       pages from SCM                                          
*                       Format: long floating point               @82A          
SMF71POS DS    CL8      Average total number of page-outs of 4 KB               
*                       pages to SCM                                            
*                       Format: long floating point               @82A          
SMF71PI1 DS    CL8      Average total number of page-ins of 1 MB                
*                       pages from SCM                                          
*                       Format: long floating point               @82A          
SMF71PO1 DS    CL8      Average total number of page-outs of 1 MB               
*                       pages to SCM                                            
*                       Format: long floating point               @82A          
SMF71L8M DS    CL8      Minimum total number of 1 MB frames in                  
*                       central storage                                         
*                       Format: long floating point               @82A          
SMF71L8X DS    CL8      Maximum total number of 1 MB frames in                  
*                       central storage                                         
*                       Format: long floating point               @82A          
SMF71L8A DS    CL8      Average total number of 1 MB frames in                  
*                       central storage                                         
*                       Format: long floating point               @82A          
SMF71L9M DS    CL8      Minimum number of available 1 MB frames                 
*                       in central storage                                      
*                       Format: long floating point               @82A          
SMF71L9X DS    CL8      Maximum number of available 1 MB frames                 
*                       in central storage                                      
*                       Format: long floating point               @82A          
SMF71L9A DS    CL8      Average number of available 1 MB frames                 
*                       in central storage                                      
*                       Format: long floating point               @82A          
SMF71L10M DS   CL8      Minimum number of 1 MB frames that are                  
*                       in-use by memory objects                                
*                       Format: long floating point               @82A          
SMF71L10X DS   CL8      Maximum number of 1 MB frames that are                  
*                       in-use by memory objects                                
*                       Format: long floating point               @82A          
SMF71L10A DS   CL8      Average number of 1 MB frames that are                  
*                       in-use by memory objects                                
*                       Format: long floating point               @82A          
SMF71M6C  DS   CL8      Minimum number of frames backing 64-bit                 
*                       shared page groups                                      
*                       Format: long floating point               @92A          
SMF71X6C  DS   CL8      Maximum number of frames backing 64-bit                 
*                       shared page groups                                      
*                       Format: long floating point               @92A          
SMF71A6C  DS   CL8      Average number of frames backing 64-bit                 
*                       shared page groups                                      
*                       Format: long floating point               @92A          
SMF71M6F  DS   CL8      Minimum number of fixed frames backing                  
*                       64-bit shared page groups                               
*                       Format: long floating point               @92A          
SMF71X6F  DS   CL8      Maximum number of fixed frames backing                  
*                       64-bit shared page groups                               
*                       Format: long floating point               @92A          
SMF71A6F  DS   CL8      Average number of fixed frames backing                  
*                       64-bit shared page groups                               
*                       Format: long floating point               @92A          
SMF71M6B  DS   CL8      Minimum number of 24-bit frames backing                 
*                       64-bit shared page groups                               
*                       Format: long floating point               @92A          
SMF71X6B  DS   CL8      Maximum number of 24-bit frames backing                 
*                       64-bit shared page groups                               
*                       Format: long floating point               @92A          
SMF71A6B  DS   CL8      Average number of 24-bit frames backing                 
*                       64-bit shared page groups                               
*                       Format: long floating point               @92A          
SMF71M6A  DS   CL8      Minimum number of auxiliary DASD slots                  
*                       used to back 64-bit shared page groups                  
*                       Format: long floating point               @92A          
SMF71X6A  DS   CL8      Maximum number of auxiliary DASD slots                  
*                       used to back 64-bit shared page groups                  
*                       Format: long floating point               @92A          
SMF71A6A  DS   CL8      Average number of auxiliary DASD slots                  
*                       used to back 64-bit shared page groups                  
*                       Format: long floating point               @92A          
SMF71M6S  DS   CL8      Minimum number of SCM blocks                            
*                       used to back 64-bit shared page groups                  
*                       Format: long floating point               @92A          
SMF71X6S  DS   CL8      Maximum number of SCM blocks                            
*                       used to back 64-bit shared page groups                  
*                       Format: long floating point               @92A          
SMF71A6S  DS   CL8      Average number of SCM blocks                            
*                       used to back 64-bit shared page groups                  
*                       Format: long floating point               @92A          
SMF71M6T  DS   CL8      Minimum number of 64-bit                                
*                       shared page groups in the system                        
*                       Format: long floating point               @92A          
SMF71X6T  DS   CL8      Maximum number of 64-bit                                
*                       shared page groups in the system                        
*                       Format: long floating point               @92A          
SMF71A6T  DS   CL8      Average  number of 64-bit                               
*                       shared page groups in the system                        
*                       Format: long floating point               @92A          
*                                                                    *          
******************** SWAP PLACEMENT DATA SECTION  *********************         
* With MVS Release 13 this section is no longer filled.           @51C*         
***********************************************************************         
SMF71NSR EQU   18       Reserved                                  @51C          
SMF71SWP DSECT                                                    @P1A          
SMF71TOT DS    BL4      Reserved                                  @51C          
SMF71AXD DS    BL4      Reserved                                  @51C          
SMF71LES DS    BL4      Reserved                                  @51C          
SMF71LAX DS    BL4      Reserved                                  @51C          
SMF71ESD DS    BL4      Reserved                                  @51C          
SMF71MIG DS    BL4      Reserved                                  @51C          
         MEND  ,                                                                
*                       */                                                      
*%PLS71: ;                                                                      
*                                                             /*1@C2D*/         
*    /* COMMON SMF HEADER */                                                    
*?ERBHDR TYPE(71) ATTRIBUT(BASED(SMF71PTR));                                    
*    /* INDIVIDUAL HEADER EXTENSION */                                          
*      2 SMF71HDX,                /* HEADER EXTENTION                */         
*        3 SMF71PDS FIXED(31),    /* OFFSET TO PAGING DATA SECTION   */         
*        3 SMF71PDL FIXED(15),    /* LENGTH OF PAGING DATA SECTION   */         
*        3 SMF71PDN FIXED(15),    /* NUMBER OF PAGING DATA SECTIONS  */         
*        3 SMF71SWS FIXED(31),    /* OFFSET TO SWAP PLACEMENT DATA              
*                                    SECTION                     @P1A*/         
*        3 SMF71SWL FIXED(15),    /* LENGTH OF SWAP PLACEMENT DATA              
*                                    SECTION                     @P1A*/         
*        3 SMF71SWN FIXED(15);    /* NUMBER OF SWAP PLACEMENT DATA              
*                                    SECTION                     @P1A*/         
*@SPACE;                                                                        
*    /* COMMON RMF PRODUCT SECTION */                                           
*?ERBPRO TYPE(71) ATTRIBUT(BASED(ADDR(SMF71HDR)+SMF71PRS));                     
*    /* PAGING DATA SECTION */                                                  
*   DCL 1 SMF71PAG BASED(ADDR(SMF71HDR)+SMF71PDS),                              
*        3 SMF71PIN FIXED(32),    /* PAGE-INS EXCLUDING VIO AND SWAP            
*             (LPA,CSA, AND ADDRESS SPACE PAGE INS - NON VIO,                   
*             NON-SWAP, NON-BLOCK) - FROM RCETOTPI               @A2C*/         
*        3 SMF71POT FIXED(32),    /* PAGE-OUTS EXCLUDING VIO AND SWAP           
*             (LPA, CSA, AND ADDRESS SPACE PAGE OUTS - NON VIO,                 
*                                          NON SWAP) - FROM RCETOTPO */         
*        3 SMF71PRC FIXED(32),    /* Reserved                @OA62081*/         
*                                 /* PAGE RECLAIMS EXCLUDING VIO                
*                               ZERO VALUE FOR 421 AND LATER @YA62328*/         
*        3 SMF71SSQ FIXED(32),    /* # OF MEMORY SWAP SEQUENCES      */         
*        3 SMF71SIN FIXED(32),    /* SWAP-IN PAGES (ADDRESS SPACE               
*             PAGE INS - NON VIO, SWAP) - FROM RCESWPPI              */         
*        3 SMF71SOT FIXED(32),    /* SWAP-OUT PAGES (ADDRESS SPACE              
*             PAGE OUTS - NON VIO, SWAP) - FROM RCESWPPO             */         
*        3 SMF71VIN FIXED(32),    /* VIO PAGE-INS (ADDRESS SPACE PAGE           
*             INS - VIO, NON SWAP) - FROM RCEVIOPI                   */         
*        3 SMF71VOT FIXED(32),    /* VIO PAGE-OUTS (ADDRESS SPACE               
*             PAGE OUTS - VIO, NON SWAP) - FROM RCEVIOPO             */         
*        3 *        FIXED(32),    /* RESERVED                    @A9C*/         
*        3 SMF71SNI FIXED(32),    /* SYS PGABLE AREAS NON-VIO PAGE-IN           
*             (LPA/CSA PAGE INS - NON VIO, NON SWAP) - FROM RCECOMPI */         
*        3 SMF71SNO FIXED(32),    /* SPA NON-VIO PAGE-OUTS                      
*             (LPA/CSA PAGE OUTS - NON VIO, NON SWAP) - FROM RCECOMPO*/         
*        3 *        FIXED(32),    /* RESERVED                    @A9C*/         
*        3 SMF71LNI FIXED(32),    /* (LPA PAGE INS - NON VIO, NON SWAP)         
*                                    FROM RCELPAPI                   */         
*        3 *        FIXED(32),    /* RESERVED                    @A9C*/         
*        3 SMF71AFC FIXED(32),    /* MAIN STOR AVAILABLE FRAME COUNT            
*                                    (SNAPSHOT OF UNUSED)                       
*                                    FROM RCEAFC                 @73C*/         
*        3 SMF71TFC FIXED(32),    /* MAIN STOR TOTAL FRAME COUNT                
*             EXCLUDING NUCLEUS, BAD OR OFFLINE FRAMES-FROM RCEPOOL             
*             incl. PFT frames (RCEPRMCT)                                       
*             incl. FLPA/EFLPA frames and real frame zero    @WA52990*/         
*        3 SMF71TSC FIXED(32),    /* AUX TOTAL SLOT COUNT (SNAPSHOT             
*             OF LOCAL PAGE DS SLOTS) - FROM ASMSLOTS                */         
*        3 SMF71DSC FIXED(32),    /* AUX DATA SET SLOT COUNT (SNAPSHOT          
*             OF LOCAL PAGE DS SLOTS FOR VIO PAGES) FROM ASMVSC      */         
*        3 SMF71VSC FIXED(32),    /* AUX VIRT MEMORY SLOT COUNT                 
*             (SNAPSHOT OF LOCAL PAGE DS SLOTS FOR NON VIO PAGES)               
*                                                       FROM ASMNVSC */         
*        3 SMF71NSC FIXED(32),    /* AUX UNALLOCATED SLOT COUNT                 
*             (SNAPSHOT OF LOCAL PAGE DS SLOTS UNALLOCATED) - FROM              
*                              ASMSLOTS MINUS ASMVSC+ASMNVSC+ASMERRS */         
*        3 SMF71FIN FIXED(32),    /* NO. FRAMES IN NUCLEUS CALCULATED           
*             FROM ((CVTDOFFE-CVTDOFFS)+(CVTRWNE-CVTRWNS)+                      
*                  (CVTERWNE-CVTERWNS)+(CVTRONE-CVTRONS)) / 4096     */         
*        3 SMF71MNF FIXED(32),    /* MIN AVAIL. PAGE FRAMES -                   
*                                    FROM RCEAFC                 @73C*/         
*        3 SMF71MXF FIXED(32),    /* MAX AVAIL. PAGE FRAMES          */         
*        3 SMF71AVF FIXED(32),    /* AVG AVAIL. PAGE FRAMES          */         
*        3 SMF71MNP FIXED(32),    /* MIN CSA FRAMES - FROM                      
*                                    (RCECOMAL-RCELPAAL-RCESQAAL),              
*                                    includes Restricted Use CSA @91C*/         
*        3 SMF71MXP FIXED(32),    /* MAX CSA FRAMES,                            
*                                    includes RUCSA              @91C*/         
*        3 SMF71AVP FIXED(32),    /* AVG CSA FRAMES,                            
*                                    includes RUCSA              @91C*/         
*        3 SMF71MNS FIXED(32),    /* MIN ADDR SPACE FRAMES                      
*             - FROM (RCEPOOL+RCEPRMCT-(RCAFC+RCE_FreemainedFrames)-            
*                     RCEAFC-RCECOMAL-RCELSAAL)                  @76C*/         
*        3 SMF71MXS FIXED(32),    /* MAX ADDR SPACE FRAMES           */         
*        3 SMF71AVS FIXED(32),    /* AVG ADDR SPACE FRAMES           */         
*        3 SMF71MNT FIXED(32),    /* Min total frames - from                    
*                                    (RCEPOOL + RCEPRMCT) +                     
*                                    FLPA/EFLPA frames +                        
*                                    real frame zero         @WA52990*/         
*        3 SMF71MXT FIXED(32),    /* MAX TOTAL FRAMES                */         
*        3 SMF71AVT FIXED(32),    /* AVG TOTAL FRAMES                */         
*        3 SMF71MNQ FIXED(32),    /* MIN SQA FIXED FRAMES - FROM                
*                                    RCESQAAL                        */         
*        3 SMF71MXQ FIXED(32),    /* MAX SQA FIXED FRAMES            */         
*        3 SMF71AVQ FIXED(32),    /* AVG SQA FIXED FRAMES            */         
*        3 SMF71MNC FIXED(32),    /* MIN CSA FIXED FRAMES - FROM                
*                                    RCECOMFX-RCESQAAL),                        
*                                    includes RUCSA              @91C*/         
*        3 SMF71MXC FIXED(32),    /* MAX CSA FIXED FRAMES                       
*                                    includes RUCSA              @91C*/         
*        3 SMF71AVC FIXED(32),    /* AVG CSA FIXED FRAMES                       
*                                    includes RUCSA              @91C*/         
*        3 SMF71MNR FIXED(32),    /* MIN ADDRESS SPACE FIXED FRAMES             
*             (WITHOUT LSQA) - FROM (RCETOTFX-(RCECOMFX+                        
*             RCELSAAL))                                             */         
*        3 SMF71MXR FIXED(32),    /* MAX ADDRESS SPACE FIXED FRAMES             
*                                    (W/O LSQA)                      */         
*        3 SMF71AVR FIXED(32),    /* AVG ADDRESS SPACE FIXED FRAMES             
*                                    (W/O LSQA)                      */         
*        3 SMF71MNX FIXED(32),    /* Min total fixed frames - from              
*                                    (RCETOTFX) + FLPA/EFLPA frames             
*                                                            @YA34458*/         
*        3 SMF71MXX FIXED(32),    /* MAX TOTAL FIXED FRAMES          */         
*        3 SMF71AVX FIXED(32),    /* AVG TOTAL FIXED FRAMES          */         
*        3 SMF71MNU FIXED(32),    /* MIN AVAILABLE LOCAL PAGE DATASET           
*             SLOTS FROM (ASMSLOTS-(ASMVSC+ASMNVSC+ASMERRS))         */         
*        3 SMF71MXU FIXED(32),    /* MAX AVAILABLE LOCAL PAGE DATASET           
*                                    SLOTS                           */         
*        3 SMF71AVU FIXED(32),    /* AVG AVAILABLE LOCAL PAGE DATASET           
*                                    SLOTS                           */         
*        3 SMF71MNV FIXED(32),    /* MIN LOCAL PAGE DATASET SLOTS               
*             ALLOCATED TO VIO PRIVATE AREA PAGES - FROM ASMVSC      */         
*        3 SMF71MXV FIXED(32),    /* MAX LOCAL PAGE DATASET SLOTS               
*                     ALLOCATED TO VIO PRIVATE AREA PAGES            */         
*        3 SMF71AVV FIXED(32),    /* AVG LOCAL PAGE DATASET SLOTS               
*                       ALLOCATED TO VIO PRIVATE AREA PAGES          */         
*        3 SMF71MNM FIXED(32),    /* MIN LOCAL PAGE DATA SET SLOTS              
*                     ALLOCATED TO NON VIO PRIVATE AREA PAGES-                  
*                                              FROM ASMNVSC          */         
*        3 SMF71MXM FIXED(32),    /* MAX LOCAL PAGE DATASET SLOTS               
*             ALLOCATED TO NON VIO PRIVATE AREA PAGES                */         
*        3 SMF71AVM FIXED(32),    /* AVG LOCAL PAGE DATASET SLOTS               
*             ALLOCATED TO NON VIO PRIVATE AREA PAGES                */         
*        3 SMF71MNB FIXED(32),    /* MIN UNAVAILABLE(BAD) LOCAL PAGE            
*                                    DATASET FROM ASMERRS            */         
*        3 SMF71MXB FIXED(32),    /* MAX UNAVAILABLE(BAD) LOCAL PAGE            
*                                    DATA SET                        */         
*        3 SMF71AVB FIXED(32),    /* AVG UNAVAILABLE(BAD) LOCAL PAGE            
*                                    DATA SET                        */         
*        3 SMF71MNA FIXED(32),    /* MIN TOTAL LOCAL PAGE DATASET               
*                                    SLOTS FROM ASMSLOTS             */         
*        3 SMF71MXA FIXED(32),    /* MAX TOTAL LOCAL PAGE DATASET               
*                                    SLOTS                           */         
*        3 SMF71IS1 FIXED(16),    /* INVALID SAMPLES TO BE SKIPPED              
*                                    BECAUSE THERE WERE ERRORS AT THE           
*                                    RSM FIXED FRAMES COUNTING                  
*                                    INTERFACE (IARXCNTF)        @Q1C*/         
*        3 SMF71IS2 FIXED(16),    /* INVALID SAMPLES TO BE SKIPPED              
*                                    BECAUSE THERE WHERE NEGATIVE               
*                                    VALUES AT THE CALCULATION OF THE           
*                                    FIXED CSA FRAMES COUNT      @Q1C*/         
*        3 SMF71VME FIXED(32),    /* Reserved                    @51C*/         
*        3 SMF71VMG FIXED(32),    /* Reserved                    @51C*/         
*        3 SMF71VRE FIXED(32),    /* Reserved                    @51C*/         
*        3 SMF71MVE FIXED(32),    /* Reserved                    @51C*/         
*        3 SMF71XVE FIXED(32),    /* Reserved                    @51C*/         
*        3 SMF71AVE FIXED(32),    /* Reserved                    @51C*/         
*        3 SMF71RSS FIXED(32),    /* Reserved                    @51C*/         
*        3 SMF71EXS FIXED(32),    /* Reserved                    @51C*/         
*        3 SMF71EES FIXED(32),    /* Reserved                    @51C*/         
*        3 SMF71TOS FIXED(32),    /* Reserved                    @51C*/         
*        3 SMF71TXS FIXED(32),    /* Reserved                    @51C*/         
*        3 SMF71LGS FIXED(32),    /* Reserved                    @51C*/         
*        3 SMF71LFS FIXED(32),    /* Reserved                    @51C*/         
*        3 SMF71LSS FIXED(32),    /* Reserved                    @51C*/         
*        3 SMF71LSE FIXED(32),    /* Reserved                    @51C*/         
*        3 SMF71NLP FIXED(32),    /* Min LPA frames - from (CTLPAF)             
*                                    + FLPA/EFLPA frames     @YA34458*/         
*        3 SMF71XLP FIXED(32),    /* MAX LPA FRAMES                  */         
*        3 SMF71ALP FIXED(32),    /* AVG LPA FRAMES                  */         
*        3 SMF71NLF FIXED(32),    /* Min LPA fixed frames - from                
*                                    (CTFLPAF) + FLPA/EFLPA frames              
*                                                            @YA34458*/         
*        3 SMF71XLF FIXED(32),    /* MAX LPA FIXED FRAMES            */         
*        3 SMF71ALF FIXED(32),    /* AVG LPA FIXED FRAMES            */         
*        3 SMF71NLS FIXED(32),    /* MIN LSQA FIXED FRAMES FROM                 
*                                    RCELSAAL                        */         
*        3 SMF71XLS FIXED(32),    /* MAX LSQA FIXED FRAMES           */         
*        3 SMF71ALS FIXED(32),    /* AVG LSQA FIXED FRAMES           */         
*        3 SMF71MNL FIXED(32),    /* Minimum number of fixed frames             
*                                    below 16 MEG. - from (RCEBELFX)            
*                                    + FLPA frames           @YA34458*/         
*        3 SMF71MXL FIXED(32),    /* MAXIMUM NUMBER OF FIXED FRAMES             
*                                    BELOW 16 MEG.                   */         
*        3 SMF71AVL FIXED(32),    /* AVERAGE NUMBER OF FIXED FRAMES             
*                                    BELOW 16 MEG.                   */         
*        3 SMF71PMV FIXED(32),    /* TOTAL PAGE MOVES                           
*                                    - FROM (RCEPAGMV)               */         
*        3 SMF71OPT CHAR(8),      /* SRM OPT MEMBER NAME                        
*                                    - FROM RMPTOPTN             @P1A*/         
*        3 SMF71PES FIXED(32),    /* Reserved                    @51C*/         
*        3 SMF71PEA FIXED(32),    /* Reserved                    @51C*/         
*        3 SMF71AMN FIXED(32),    /* Reserved                    @51C*/         
*        3 SMF71AMX FIXED(32),    /* Reserved                    @51C*/         
*        3 SMF71ASA FIXED(32),    /* Reserved                    @51C*/         
*        3 SMF71LIC FIXED(32),    /* MIN HIGH UIC                               
*                                    - FROM MCVSTCRI             @P1A*/         
*        3 SMF71HIC FIXED(32),    /* MAX HIGH UIC                               
*                                    - FROM MCVSTCRI             @P1A*/         
*        3 SMF71ACA FIXED(32),    /* AVG HIGH UIC                               
*                                    - FROM MCVSTCRI -                          
*                                    SCALE FACTOR IS -1          @P1A*/         
*        3 SMF71LMA FIXED(32),    /* Reserved                    @51C*/         
*        3 SMF71HMA FIXED(32),    /* Reserved                    @51C*/         
*        3 SMF71AMA FIXED(32),    /* Reserved                    @51C*/         
*        3 SMF71CF  FIXED(32),    /* Reserved                    @51C*/         
*        3 SMF71OLE FIXED(32),    /* Reserved                    @51C*/         
*        3 SMF71RES FIXED(32),    /* Reserved                    @51C*/         
*        3 SMF71MSR FIXED(32),    /* min SQA pages in central storage           
*                                    CTSQAF + CTRSQAF            @W1A*/         
*        3 SMF71XSR FIXED(32),    /* max SQA pages in                           
*                                    central storage             @W1A*/         
*        3 SMF71ASR FIXED(32),    /* avg SQA pages in                           
*                                    central storage             @W1A*/         
*        3 SMF71MSE FIXED(32),    /* Reserved                    @51C*/         
*        3 SMF71XSE FIXED(32),    /* Reserved                    @51C*/         
*        3 SMF71ASE FIXED(32),    /* Reserved                    @51C*/         
*        3 SMF71LME FIXED(32),    /* Reserved                    @51C*/         
*        3 SMF71LXE FIXED(32),    /* Reserved                    @51C*/         
*        3 SMF71LAE FIXED(32),    /* Reserved                    @51C*/         
*        3 SMF71CME FIXED(32),    /* Reserved                    @51C*/         
*        3 SMF71CXE FIXED(32),    /* Reserved                    @51C*/         
*        3 SMF71CAE FIXED(32),    /* Reserved                    @51C*/         
*        3 SMF71MLR FIXED(32),    /* min LSQA pages in central storage          
*                                    CTLSQAF + CTRLSQAF          @W1A*/         
*        3 SMF71XLR FIXED(32),    /* max LSQA pages in                          
*                                    central storage             @W1A*/         
*        3 SMF71ALR FIXED(32),    /* avg LSQA pages in                          
*                                    central storage             @W1A*/         
*        3 SMF71MLE FIXED(32),    /* Reserved                    @51C*/         
*        3 SMF71XLE FIXED(32),    /* Reserved                    @51C*/         
*        3 SMF71ALE FIXED(32),    /* Reserved                    @51C*/         
*        3 SMF71RME FIXED(32),    /* Reserved                    @51C*/         
*        3 SMF71RXE FIXED(32),    /* Reserved                    @51C*/         
*        3 SMF71RAE FIXED(32),    /* Reserved                    @51C*/         
*        3 SMF71ISC FIXED(32),    /* no of invalid samples returned             
*                                    from RMF collector service  @PAC*/         
*        3 SMF71HME FIXED(32),    /* Reserved                    @51C*/         
*        3 SMF71HRE FIXED(32),    /* Reserved                    @51C*/         
*        3 SMF71HMG FIXED(32),    /* Reserved                    @51C*/         
*        3 SMF71HOT FIXED(32),    /* Number of hiperspace page-outs             
*                                                                @W4A*/         
*        3 SMF71HIN FIXED(32),    /* Number of hiperspace page-ins              
*                                                                @W4A*/         
*        3 SMF71MHE FIXED(32),    /* Reserved                    @51C*/         
*        3 SMF71XHE FIXED(32),    /* Reserved                    @51C*/         
*        3 SMF71AHE FIXED(32),    /* Reserved                    @51C*/         
*        3 SMF71BLP FIXED(32),    /* Number of blocked pages paged in,          
*                                     does not include VIO                      
*                                     or hiperspace              @A2A*/         
*        3 SMF71BLK FIXED(32),    /* Number of blocks paged in   @A2A*/         
*        3 SMF71PWS FIXED(32),    /* Reserved                    @51C*/         
*        3 SMF71FNM FIXED(32),    /* Reserved                    @51C*/         
*        3 SMF71PMT CHAR(8),      /* Steal Timer - elapsed time                 
*                                     spent in a preferred steal                
*                                     in CPU Timer units         @C1C*/         
*        3 SMF71SBI FIXED(32),    /* System Pageable Areas Block                
*                                     Page-Ins                   @C1A*/         
*        3 SMF71LBI FIXED(32),          /* LPA Block Page-Ins    @C1A*/         
*        ?ERBFITEM(3 SMF71ASI) FLOAT(56);, /* Number of page-ins                
*                                    from auxiliary storage for                 
*                                    shared pages                               
*                                    (long floating point)       @92C*/         
*        ?ERBFITEM(3 SMF71ASO) FLOAT(56);, /* Number of                         
*                                    page-outs to auxiliary storage             
*                                    for shared pages                           
*                                    (long floating point)       @92C*/         
*        ?ERBFITEM(3 SMF71ESI) FLOAT(56);, /* Reserved           @51C*/         
*        ?ERBFITEM(3 SMF71ESO) FLOAT(56);, /* Reserved           @51C*/         
*        ?ERBFITEM(3 SMF71MGT) FLOAT(56);, /* Minimum number of                 
*                                    shared pages in the system                 
*                                    (long floating point)       @92C*/         
*        ?ERBFITEM(3 SMF71XGT) FLOAT(56);, /* Maximum number of                 
*                                    shared pages in the system                 
*                                    (long floating point)       @92C*/         
*        ?ERBFITEM(3 SMF71AGT) FLOAT(56);, /* Average number of                 
*                                    shared pages in the system                 
*                                    (long floating point)       @92C*/         
*        ?ERBFITEM(3 SMF71MGC) FLOAT(56);, /* Minimum number of                 
*                                    shared pages in central storage            
*                                    (long floating point)       @92C*/         
*        ?ERBFITEM(3 SMF71XGC) FLOAT(56);, /* Maximum number of                 
*                                    shared pages in central storage            
*                                    (long floating point)       @92C*/         
*        ?ERBFITEM(3 SMF71AGC) FLOAT(56);, /* Average number of                 
*                                    shared pages in central storage            
*                                    (long floating point)       @92C*/         
*        ?ERBFITEM(3 SMF71MGE) FLOAT(56);, /* Reserved           @51C*/         
*        ?ERBFITEM(3 SMF71XGE) FLOAT(56);, /* Reserved           @51C*/         
*        ?ERBFITEM(3 SMF71AGE) FLOAT(56);, /* Reserved           @51C*/         
*        ?ERBFITEM(3 SMF71MGA) FLOAT(56);, /* Minimum number of                 
*                                    auxiliary slots in use for                 
*                                    shared page groups                         
*                                    (long floating point)       @D1A*/         
*        ?ERBFITEM(3 SMF71XGA) FLOAT(56);, /* Maximum number of                 
*                                    auxiliary slots in use for                 
*                                    shared page groups                         
*                                    (long floating point)       @D1A*/         
*        ?ERBFITEM(3 SMF71AGA) FLOAT(56);, /* Average number of                 
*                                    auxiliary slots in use for                 
*                                    shared page groups                         
*                                    (long floating point)       @D1A*/         
*        ?ERBFITEM(3 SMF71MGF) FLOAT(56);, /* Minimum number of                 
*                                    shared pages                               
*                                    fixed in the system                        
*                                    (long floating point)       @92C*/         
*        ?ERBFITEM(3 SMF71XGF) FLOAT(56);, /* Maximum number of                 
*                                    shared pages                               
*                                    fixed in the system                        
*                                    (long floating point)       @92C*/         
*        ?ERBFITEM(3 SMF71AGF) FLOAT(56);, /* Average number of                 
*                                    shared pages                               
*                                    fixed in the system                        
*                                    (long floating point)       @92C*/         
*        ?ERBFITEM(3 SMF71MGB) FLOAT(56);, /* Minimum number of                 
*                                    shared pages                               
*                                    fixed below 16MB in the system             
*                                    (long floating point)       @92C*/         
*        ?ERBFITEM(3 SMF71XGB) FLOAT(56);, /* Maximum number of                 
*                                    shared pages                               
*                                    fixed below 16MB in the system             
*                                    (long floating point)       @92C*/         
*        ?ERBFITEM(3 SMF71AGB) FLOAT(56);, /* Average number of                 
*                                    shared pages                               
*                                    fixed below 16MB in the system             
*                                    (long floating point)       @92C*/         
*        ?ERBFITEM(3 SMF71CAM) FLOAT(56);, /* Minimum number of                 
*                                    available central storage frames           
*                                    (long floating point)       @F1A*/         
*        ?ERBFITEM(3 SMF71CAX) FLOAT(56);, /* Maximum number of                 
*                                    available central storage frames           
*                                    (long floating point)       @F1A*/         
*        ?ERBFITEM(3 SMF71CAA) FLOAT(56);, /* Average number of                 
*                                    available central storage frames           
*                                    (rceafc+rce_freemainedframes-              
*                                     max(rceafcok,mccafcok*mccdefam))          
*                                    (long floating point)       @76C*/         
*        ?ERBFITEM(3 SMF71CLM) FLOAT(56);, /* Minimum number of                 
*                                    low impact central storage frames          
*                                    (long floating point)       @F1A*/         
*        ?ERBFITEM(3 SMF71CLX) FLOAT(56);, /* Maximum number of                 
*                                    low impact central storage frames          
*                                    (long floating point)       @F1A*/         
*        ?ERBFITEM(3 SMF71CLA) FLOAT(56);, /* Average number of                 
*                                    low impact central storage frames          
*                                    (long floating point)       @F1A*/         
*        ?ERBFITEM(3 SMF71CMM) FLOAT(56);, /* Minimum number of                 
*                                    medium impact central storage              
*                                   frames (long floating point) @F1A*/         
*        ?ERBFITEM(3 SMF71CMX) FLOAT(56);, /* Maximum number of                 
*                                    medium impact central storage              
*                                   frames (long floating point) @F1A*/         
*        ?ERBFITEM(3 SMF71CMA) FLOAT(56);, /* Average number of                 
*                                    medium impact central storage              
*                                   frames (long floating point) @F1A*/         
*        ?ERBFITEM(3 SMF71CHM) FLOAT(56);, /* Minimum number of                 
*                                    high impact central storage frames         
*                                    (long floating point)       @F1A*/         
*        ?ERBFITEM(3 SMF71CHX) FLOAT(56);, /* Maximum number of                 
*                                    high impact central storage frames         
*                                    (long floating point)       @F1A*/         
*        ?ERBFITEM(3 SMF71CHA) FLOAT(56);, /* Average number of                 
*                                    high impact central storage frames         
*                                    (long floating point)       @F1A*/         
*        ?ERBFITEM(3 SMF71EAM) FLOAT(56);, /* Reserved           @51C*/         
*        ?ERBFITEM(3 SMF71EAX) FLOAT(56);, /* Reserved           @51C*/         
*        ?ERBFITEM(3 SMF71EAA) FLOAT(56);, /* Reserved           @51C*/         
*        ?ERBFITEM(3 SMF71ELM) FLOAT(56);, /* Reserved           @51C*/         
*        ?ERBFITEM(3 SMF71ELX) FLOAT(56);, /* Reserved           @51C*/         
*        ?ERBFITEM(3 SMF71ELA) FLOAT(56);, /* Reserved           @51C*/         
*        ?ERBFITEM(3 SMF71EMM) FLOAT(56);, /* Reserved           @51C*/         
*        ?ERBFITEM(3 SMF71EMX) FLOAT(56);, /* Reserved           @51C*/         
*        ?ERBFITEM(3 SMF71EMA) FLOAT(56);, /* Reserved           @51C*/         
*        ?ERBFITEM(3 SMF71EHM) FLOAT(56);, /* Reserved           @51C*/         
*        ?ERBFITEM(3 SMF71EHX) FLOAT(56);, /* Reserved           @51C*/         
*        ?ERBFITEM(3 SMF71EHA) FLOAT(56);, /* Reserved           @51C*/         
*        ?ERBFITEM(3 SMF71MVI) FLOAT(56);, /* Min. number of VIO                
*                                    pages in central storage                   
*                                    (long floating point)       @51C*/         
*        ?ERBFITEM(3 SMF71XVI) FLOAT(56);, /* Max. number of VIO                
*                                    pages in central storage                   
*                                    (long floating point)       @51C*/         
*        ?ERBFITEM(3 SMF71AVI) FLOAT(56);, /* Avg. number of VIO                
*                                    pages in central storage                   
*                                    (long floating point)       @51C*/         
*        ?ERBFITEM(3 SMF71MHI) FLOAT(56);, /* Min. number of hiperspace         
*                                    pages in central storage                   
*                                    (long floating point)       @51C*/         
*        ?ERBFITEM(3 SMF71XHI) FLOAT(56);, /* Max. number of hiperspace         
*                                    pages in central storage                   
*                                    (long floating point)       @51C*/         
*        ?ERBFITEM(3 SMF71AHI) FLOAT(56);, /* Avg. number of hiperspace         
*                                    pages in central storage                   
*                                    (long floating point)       @51C*/         
*        ?ERBFITEM(3 SMF71VWS) FLOAT(56);, /* Number of VIO pages               
*                                    written to central storage                 
*                                    (long floating point)       @51C*/         
*        ?ERBFITEM(3 SMF71VRS) FLOAT(56);, /* Number of VIO pages               
*                                    read from central storage                  
*                                    (long floating point)       @51C*/         
*        ?ERBFITEM(3 SMF71HWS) FLOAT(56);, /* Number of hipersp. pages          
*                                    written to central storage                 
*                                    (long floating point)       @51C*/         
*        ?ERBFITEM(3 SMF71HRS) FLOAT(56);, /* Number of hipersp. pages          
*                                    read from central storage                  
*                                    (long floating point)       @51C*/         
*        ?ERBFITEM(3 SMF71MFB) FLOAT(56);, /* Min number of pages fixed         
*                                    between 16M and 2G                         
*                                    (long floating point)       @I1A*/         
*        ?ERBFITEM(3 SMF71XFB) FLOAT(56);, /* Max number of pages fixed         
*                                    between 16M and 2G                         
*                                    (long floating point)       @I1A*/         
*        ?ERBFITEM(3 SMF71AFB) FLOAT(56);, /* Avg number of pages fixed         
*                                    between 16M and 2G                         
*                                    (long floating point)       @I1A*/         
*        ?ERBFITEM(3 SMF71PTH) FLOAT(56);, /* Average number of                 
*                                    pages in the system used by                
*                                    shared memory objects                      
*                                    (long floating point)       @92C*/         
*        ?ERBFITEM(3 SMF71PCH) FLOAT(56);, /* Average number of                 
*                                    shared pages in central storage            
*                                    -virt. storage addr above the bar          
*                                    including high virtual DAT                 
*                                    (long floating point)       @92C*/         
*        ?ERBFITEM(3 SMF71PAH) FLOAT(56);, /* Average number of                 
*                                    shared pages in auxiliary storage          
*                                    -virt. storage addr above the bar          
*                                    (long floating point)       @K1A*/         
*        ?ERBFITEM(3 SMF71BLG) FLOAT(56);, /* High water mark for               
*                                    number of shared bytes from large          
*                                    virtual memory in memory object            
*                                    (long floating point)       @K1A*/         
*        ?ERBFITEM(3 SMF71PIH) FLOAT(56);,  /*                                  
*                                    Number of page-ins from                    
*                                    auxiliary storage for shared               
*                                    pages with virtual storage                 
*                                    address above the bar                      
*                                    (long floating point)       @K1A*/         
*        ?ERBFITEM(3 SMF71POH) FLOAT(56);, /* Number of page-outs               
*                                    to auxiliary storage for shared            
*                                    pages with virtual storage                 
*                                    address above the bar                      
*                                    (long floating point)       @01C*/         
*        3 SMF71ULM FIXED(32),    /* Lowest minimum system UIC                  
*                                    during the interval (from                  
*                                    MCTMinSystemUIC)            @01A*/         
*        3 SMF71ULC FIXED(32),    /* Lowest current system UIC                  
*                                    during the interval (from                  
*                                    MCTCurSystemUIC)            @01A*/         
*        3 SMF71UHC FIXED(32),    /* Highest current system UIC                 
*                                    during the interval (from                  
*                                    MCTCurSystemUIC)            @01A*/         
*        3 SMF71UHX FIXED(32),    /* Highest maximum system UIC                 
*                                    during the interval (from                  
*                                    MCTMaxSystemUIC)            @01A*/         
*        3 SMF71UAM FIXED(32),    /* Average minimum system UIC                 
*                                    during the interval (from                  
*                                    MCTMinSystemUIC)            @01A*/         
*        3 SMF71UAC FIXED(32),    /* Average current system UIC                 
*                                    during the interval (from                  
*                                    MCTCurSystemUIC)            @01A*/         
*        3 SMF71UAX FIXED(32),    /* Average maximum system UIC                 
*                                    during the interval (from                  
*                                    MCTMaxSystemUIC)            @11C*/         
*        ?ERBFITEM(3 SMF71LOM) FLOAT(56);,                         /*           
*                                      Minimum number of fixed memory           
*                                      objects that are allocated               
*                                      in the system and can be                 
*                                      backed in 1 MB frames                    
*                                      (long floating point)     @62C*/         
*        ?ERBFITEM(3 SMF71LOX) FLOAT(56);,                         /*           
*                                      Maximum number of fixed memory           
*                                      objects that are allocated               
*                                      in the system and can be                 
*                                      backed in 1 MB frames                    
*                                      (long floating point)     @62C*/         
*        ?ERBFITEM(3 SMF71LOA) FLOAT(56);,                         /*           
*                                      Average number of fixed memory           
*                                      objects that are allocated               
*                                      in the system and can be                 
*                                      backed in 1 MB frames                    
*                                      (long floating point)     @62C*/         
*        ?ERBFITEM(3 SMF71LRM) FLOAT(56);,                         /*           
*                                      Minimum number of 1 MB pages             
*                                      fixed in central storage                 
*                                      (long floating point)     @74C*/         
*        ?ERBFITEM(3 SMF71LRX) FLOAT(56);,                         /*           
*                                      Maximum number of 1 MB pages             
*                                      fixed in central storage                 
*                                      (long floating point)     @74C*/         
*        ?ERBFITEM(3 SMF71LRA) FLOAT(56);,                         /*           
*                                      Average number of 1 MB pages             
*                                      fixed in central storage                 
*                                      (long floating point)     @74C*/         
*        ?ERBFITEM(3 SMF71COM) FLOAT(56);,                         /*           
*                                      Minimum number of memory objects         
*                                      allocated in the high virtual            
*                                      common storage of the system             
*                                      (long floating point)     @51C*/         
*        ?ERBFITEM(3 SMF71COX) FLOAT(56);,                         /*           
*                                      Maximum number of memory objects         
*                                      allocated in the high virtual            
*                                      common storage of the system             
*                                      (long floating point)     @51C*/         
*        ?ERBFITEM(3 SMF71COA) FLOAT(56);,                         /*           
*                                      Average number of memory objects         
*                                      allocated in the high virtual            
*                                      common storage of the system             
*                                      (long floating point)     @51C*/         
*        ?ERBFITEM(3 SMF71CRM) FLOAT(56);,                         /*           
*                                      Minimum number of pages from             
*                                      high virtual common storage that         
*                                      are backed in central storage            
*                                      (long floating point)     @62C*/         
*        ?ERBFITEM(3 SMF71CRX) FLOAT(56);,                         /*           
*                                      Maximum number of pages from             
*                                      high virtual common storage that         
*                                      are backed in central storage            
*                                      (long floating point)     @62C*/         
*        ?ERBFITEM(3 SMF71CRA) FLOAT(56);,                         /*           
*                                      Average number of pages from             
*                                      high virtual common storage that         
*                                      are backed in central storage            
*                                      (long floating point)     @62C*/         
*        ?ERBFITEM(3 SMF71CFM) FLOAT(56);,                         /*           
*                                      Minimum number of fixed pages            
*                                      from high virtual common storage         
*                                      that are backed in central               
*                                      storage                                  
*                                      (long floating point)     @62C*/         
*        ?ERBFITEM(3 SMF71CFX) FLOAT(56);,                         /*           
*                                      Maximum number of fixed pages            
*                                      from high virtual common storage         
*                                      that are backed in central               
*                                      storage                                  
*                                      (long floating point)     @62C*/         
*        ?ERBFITEM(3 SMF71CFA) FLOAT(56);,                         /*           
*                                      Average number of fixed pages            
*                                      from high virtual common storage         
*                                      that are backed in central               
*                                      storage                                  
*                                      (long floating point)     @62C*/         
*        ?ERBFITEM(3 SMF71CSM) FLOAT(56);,                         /*           
*                                      Minimum number of auxiliary              
*                                      storage slots used for high              
*                                      virtual common memory pages on           
*                                      backed on DASD                           
*                                      (long floating point)     @51C*/         
*        ?ERBFITEM(3 SMF71CSX) FLOAT(56);,                         /*           
*                                      Maximum number of auxiliary              
*                                      storage slots used for high              
*                                      virtual common memory pages              
*                                      backed on DASD                           
*                                      (long floating point)     @51C*/         
*        ?ERBFITEM(3 SMF71CSA) FLOAT(56);,                         /*           
*                                      Average number of auxiliary              
*                                      storage slots used for high              
*                                      virtual common memory pages on           
*                                      backed on DASD                           
*                                      (long floating point)     @51C*/         
*        ?ERBFITEM(3 SMF71SOM) FLOAT(56);,                         /*           
*                                      Minimum number of memory objects         
*                                      allocated in the high virtual            
*                                      shared storage of the system             
*                                      (long floating point)     @51C*/         
*        ?ERBFITEM(3 SMF71SOX) FLOAT(56);,                         /*           
*                                      Maximum number of memory objects         
*                                      allocated in the high virtual            
*                                      shared storage of the system             
*                                      (long floating point)     @51C*/         
*        ?ERBFITEM(3 SMF71SOA) FLOAT(56);,                         /*           
*                                      Average number of memory objects         
*                                      allocated in the high virtual            
*                                      shared storage of the system             
*                                      (long floating point)     @51C*/         
*        ?ERBFITEM(3 SMF71SRM) FLOAT(56);,                         /*           
*                                      Minimum number of pages from             
*                                      high virtual shared storage that         
*                                      are backed in central storage            
*                                      (long floating point)     @62C*/         
*        ?ERBFITEM(3 SMF71SRX) FLOAT(56);,                         /*           
*                                      Maximum number of pages from             
*                                      high virtual shared storage that         
*                                      are backed in central storage            
*                                      (long floating point)     @62C*/         
*        ?ERBFITEM(3 SMF71SRA) FLOAT(56);,                         /*           
*                                      Average number of pages from             
*                                      high virtual shared storage that         
*                                      are backed in central storage            
*                                      (long floating point)     @62C*/         
*        3 SMF71GRN FIXED(32),      /* Number of getmain requests that          
*                                      have been issued          @31A*/         
*        3 SMF71FBN FIXED(32),      /* Number of pages backed during            
*                                      getmain requests that have been          
*                                      issued                    @62C*/         
*        3 SMF71FRN FIXED(32),      /* Number of fix requests that have         
*                                      been issued for storage                  
*                                      (address space only) below two           
*                                      gigabytes                 @31A*/         
*        3 SMF71FFN FIXED(32),      /* Number of pages that were                
*                                      requested to be fixed for                
*                                      storage (address space only)             
*                                      below two gigabytes       @62C*/         
*        3 SMF711RN FIXED(32),      /* Number of first reference                
*                                      faults taken              @31A*/         
*        3 SMF71NRN FIXED(32),      /* Number of non-first reference            
*                                      faults taken              @51C*/         
*        3 SMF71RFL BIT(8),         /* Flags                     @51A*/         
*          5 SMF71SCM BIT(1),       /* SCM support enabled   @OA38660*/         
*          5 SMF71PLP BIT(1),       /* Pageable Large Pages support             
*                                      enabled                   @62C*/         
*          5 *        BIT(6),       /* Not used                  @51A*/         
*        3 *        CHAR(3),        /* Not used                  @51A*/         
*        ?ERBFITEM(3 SMF71LFA) FLOAT(56);,                         /*           
*                                      The maximum number of fixed              
*                                      1 MB pages that can be allocated         
*                                      as specified in the LFAREA               
*                                      parameter                                
*                                      (long floating point)     @82C*/         
*        ?ERBFITEM(3 SMF71L1M) FLOAT(56);,                         /*           
*                                      Lowest maximum number of 1 MB            
*                                      frames that can be used by               
*                                      fixed 1 MB pages                         
*                                      (long floating point)     @82C*/         
*        ?ERBFITEM(3 SMF71L1X) FLOAT(56);,                         /*           
*                                      Highest maximum number of 1 MB           
*                                      frames that can be used by               
*                                      fixed 1 MB pages                         
*                                      (long floating point)     @82C*/         
*        ?ERBFITEM(3 SMF71L1A) FLOAT(56);,                         /*           
*                                      Average maximum number of 1 MB           
*                                      frames that can be used by               
*                                      fixed 1 MB pages                         
*                                      (long floating point)     @62C*/         
*        ?ERBFITEM(3 SMF71L2M) FLOAT(56);,                         /*           
*                                      Reserved. Value is now in                
*                                      SMF71L7M                                 
*                                      (long floating point)     @82C*/         
*        ?ERBFITEM(3 SMF71L2X) FLOAT(56);,                         /*           
*                                      Reserved. Value is now in                
*                                      SMF71L7X                                 
*                                      (long floating point)     @82C*/         
*        ?ERBFITEM(3 SMF71L2A) FLOAT(56);,                         /*           
*                                      Reserved. Value is now in                
*                                      SMF71L7A                                 
*                                      (long floating point)     @82C*/         
*        ?ERBFITEM(3 SMF71L3M) FLOAT(56);,                         /*           
*                                      Minimum number of 1 MB frames            
*                                      that are in-use and are no               
*                                      longer available for fixed 1 MB          
*                                      pages                                    
*                                      (long floating point)     @82C*/         
*        ?ERBFITEM(3 SMF71L3X) FLOAT(56);,                         /*           
*                                      Maximum number of 1 MB frames            
*                                      that are in-use and are no               
*                                      longer available for fixed 1 MB          
*                                      pages                                    
*                                      (long floating point)     @82C*/         
*        ?ERBFITEM(3 SMF71L3A) FLOAT(56);,                         /*           
*                                      Average number of 1 MB frames            
*                                      that are in-use and are no               
*                                      longer available for fixed 1 MB          
*                                      pages                                    
*                                      (long floating point)     @82C*/         
*        ?ERBFITEM(3 SMF71L4M) FLOAT(56);,                         /*           
*                                      Reserved                  @82C*/         
*        ?ERBFITEM(3 SMF71L4X) FLOAT(56);,                         /*           
*                                      Reserved                  @82C*/         
*        ?ERBFITEM(3 SMF71L4A) FLOAT(56);,                         /*           
*                                      Reserved                  @82C*/         
*        ?ERBFITEM(3 SMF71L5M) FLOAT(56);,                         /*           
*                                      Reserved                  @82C*/         
*        ?ERBFITEM(3 SMF71L5X) FLOAT(56);,                         /*           
*                                      Reserved                  @82C*/         
*        ?ERBFITEM(3 SMF71L5A) FLOAT(56);,                         /*           
*                                      Reserved                  @82C*/         
*        ?ERBFITEM(3 SMF71L6M) FLOAT(56);,                         /*           
*                                      Reserved                  @82C*/         
*        ?ERBFITEM(3 SMF71L6X) FLOAT(56);,                         /*           
*                                      Reserved                  @82C*/         
*        ?ERBFITEM(3 SMF71L6A) FLOAT(56);,                         /*           
*                                      Reserved                  @82C*/         
*        ?ERBFITEM(3 SMF71L7M) FLOAT(56);,                         /*           
*                                      Minimum number of available 1 MB         
*                                      frames that can be used by fixed         
*                                      1 MB pages (same as SMF71L2M)            
*                                      (long floating point)     @82C*/         
*        ?ERBFITEM(3 SMF71L7X) FLOAT(56);,                         /*           
*                                      Maximum number of available 1 MB         
*                                      frames that can be used by fixed         
*                                      1 MB pages (same as SMF71L2X)            
*                                      (long floating point)     @82C*/         
*        ?ERBFITEM(3 SMF71L7A) FLOAT(56);,                         /*           
*                                      Average number of available 1 MB         
*                                      frames that can be used by fixed         
*                                      1 MB pages (same as SMF71L2A)            
*                                      (long floating point)     @82C*/         
*        ?ERBFITEM(3 SMF71S1M) FLOAT(56);,                         /*           
*                                      Minimum total number of high             
*                                      virtual shared memory pages              
*                                      (long floating point)     @62C*/         
*        ?ERBFITEM(3 SMF71S1X) FLOAT(56);,                         /*           
*                                      Maximum total number of high             
*                                      virtual shared memory pages              
*                                      (long floating point)     @62C*/         
*        ?ERBFITEM(3 SMF71S1A) FLOAT(56);,                         /*           
*                                      Average total number of high             
*                                      virtual shared memory pages              
*                                      (long floating point)     @62C*/         
*        ?ERBFITEM(3 SMF71S2M) FLOAT(56);,                         /*           
*                                      Minimum number of shared memory          
*                                      objects that are allocated in            
*                                      the system and can be backed             
*                                      in 1 MB frames                           
*                                      (long floating point)     @74A*/         
*        ?ERBFITEM(3 SMF71S2X) FLOAT(56);,                         /*           
*                                      Maximum number of shared memory          
*                                      objects that are allocated in            
*                                      the system and can be backed             
*                                      in 1 MB frames                           
*                                      (long floating point)     @74A*/         
*        ?ERBFITEM(3 SMF71S2A) FLOAT(56);,                         /*           
*                                      Average number of shared memory          
*                                      objects that are allocated in            
*                                      the system and can be backed             
*                                      in 1 MB frames                           
*                                      (long floating point)     @74A*/         
*        ?ERBFITEM(3 SMF71S3M) FLOAT(56);,                         /*           
*                                      Minimum number of frames in use          
*                                      for shared high virtual 4K pages         
*                                      (long floating point)     @74C*/         
*        ?ERBFITEM(3 SMF71S3X) FLOAT(56);,                         /*           
*                                      Maximum number of frames in use          
*                                      for shared high virtual 4K pages         
*                                      (long floating point)     @74C*/         
*        ?ERBFITEM(3 SMF71S3A) FLOAT(56);,                         /*           
*                                      Average number of frames in use          
*                                      for shared high virtual 4K pages         
*                                      (long floating point)     @74C*/         
*        ?ERBFITEM(3 SMF71S4M) FLOAT(56);,                         /*           
*                                      Minimum number of 1 MB pages             
*                                      used for shared memory objects           
*                                      backed in central storage                
*                                      (long floating point)     @92C*/         
*        ?ERBFITEM(3 SMF71S4X) FLOAT(56);,                         /*           
*                                      Maximum number of 1 MB pages             
*                                      used for shared memory objects           
*                                      backed in central storage                
*                                      (long floating point)     @92C*/         
*        ?ERBFITEM(3 SMF71S4A) FLOAT(56);,                         /*           
*                                      Average number of 1 MB pages             
*                                      used for shared memory objects           
*                                      backed in central storage                
*                                      (long floating point)     @92C*/         
*        ?ERBFITEM(3 SMF71S5M) FLOAT(56);,                         /*           
*                                      Minimum number of auxiliary              
*                                      storage slots used for high              
*                                      virtual shared memory DASD pages         
*                                      (long floating point)     @62C*/         
*        ?ERBFITEM(3 SMF71S5X) FLOAT(56);,                         /*           
*                                      Maximum number of auxiliary              
*                                      storage slots used for high              
*                                      virtual shared memory DASD pages         
*                                      (long floating point)     @62C*/         
*        ?ERBFITEM(3 SMF71S5A) FLOAT(56);,                         /*           
*                                      Average number of auxiliary              
*                                      storage slots used for high              
*                                      virtual shared memory DASD pages         
*                                      (long floating point)     @62C*/         
*        ?ERBFITEM(3 SMF71S6M) FLOAT(56);,                         /*           
*                                      Minimum number of high virtual           
*                                      shared memory pages backed on            
*                                      SCM storage                              
*                                      (long floating point) @OA38660*/         
*        ?ERBFITEM(3 SMF71S6X) FLOAT(56);,                         /*           
*                                      Maximum number of high virtual           
*                                      shared memory pages backed on            
*                                      SCM storage                              
*                                      (long floating point) @OA38660*/         
*        ?ERBFITEM(3 SMF71S6A) FLOAT(56);,                         /*           
*                                      Average number of high virtual           
*                                      shared memory pages backed on            
*                                      SCM storage                              
*                                      (long floating point) @OA38660*/         
*        ?ERBFITEM(3 SMF71C1M) FLOAT(56);,                         /*           
*                                      Minimum total number of high             
*                                      virtual common memory pages              
*                                      (long floating point)     @62C*/         
*        ?ERBFITEM(3 SMF71C1X) FLOAT(56);,                         /*           
*                                      Maximum total number of high             
*                                      virtual common memory pages              
*                                      (long floating point)     @62C*/         
*        ?ERBFITEM(3 SMF71C1A) FLOAT(56);,                         /*           
*                                      Average total number of high             
*                                      virtual common memory pages              
*                                      (long floating point)     @62C*/         
*        ?ERBFITEM(3 SMF71C2M) FLOAT(56);,                         /*           
*                                      Minimum number of high virtual           
*                                      common memory 1 MB fixed pages           
*                                                                @74C*/         
*        ?ERBFITEM(3 SMF71C2X) FLOAT(56);,                         /*           
*                                      Maximum number of high virtual           
*                                      common memory 1 MB fixed pages           
*                                                                @74C*/         
*        ?ERBFITEM(3 SMF71C2A) FLOAT(56);,                         /*           
*                                      Average number of high virtual           
*                                      common memory 1 MB fixed pages           
*                                                                @74C*/         
*        ?ERBFITEM(3 SMF71C3M) FLOAT(56);,                         /*           
*                                      Minimum number of high virtual           
*                                      common memory 1 MB pages backed          
*                                      in central storage        @74C*/         
*        ?ERBFITEM(3 SMF71C3X) FLOAT(56);,                         /*           
*                                      Maximum number of high virtual           
*                                      common memory 1 MB pages backed          
*                                      in central storage        @74C*/         
*        ?ERBFITEM(3 SMF71C3A) FLOAT(56);,                         /*           
*                                      Average number of high virtual           
*                                      common memory 1 MB pages backed          
*                                      in central storage        @74C*/         
*        ?ERBFITEM(3 SMF71C4M) FLOAT(56);,                         /*           
*                                      Minimum number of high virtual           
*                                      common memory pages backed on            
*                                      SCM storage                              
*                                      (long floating point) @OA38660*/         
*        ?ERBFITEM(3 SMF71C4X) FLOAT(56);,                         /*           
*                                      Maximum number of high virtual           
*                                      common memory pages backed on            
*                                      SCM storage                              
*                                      (long floating point) @OA38660*/         
*        ?ERBFITEM(3 SMF71C4A) FLOAT(56);,                         /*           
*                                      Average number of high virtual           
*                                      common memory pages backed on            
*                                      SCM storage                              
*                                      (long floating point) @OA38660*/         
*        ?ERBFITEM(3 SMF71TSM) FLOAT(56);,                         /*           
*                                      Minimum total number of 4K SCM           
*                                      blocks available to ASM                  
*                                      (long floating point) @OA38660*/         
*        ?ERBFITEM(3 SMF71TSX) FLOAT(56);,                         /*           
*                                      Maximum total number of 4K SCM           
*                                      blocks available to ASM                  
*                                      (long floating point) @OA38660*/         
*        ?ERBFITEM(3 SMF71TSA) FLOAT(56);,                         /*           
*                                      Average total number of 4K SCM           
*                                      blocks available to ASM                  
*                                      (long floating point) @OA38660*/         
*        ?ERBFITEM(3 SMF71ASM) FLOAT(56);,                        /*            
*                                      Minimum number of available              
*                                      (not in-use) SCM blocks                  
*                                      (long floating point) @OA38660*/         
*        ?ERBFITEM(3 SMF71ASX) FLOAT(56);,                        /*            
*                                      Maximum number of available              
*                                      (not in-use) SCM blocks                  
*                                      (long floating point) @OA38660*/         
*        ?ERBFITEM(3 SMF71ASV) FLOAT(56);,                        /*            
*                                      Average number of available              
*                                      (not in-use) SCM blocks                  
*                                      (long floating point) @OA38660*/         
*        ?ERBFITEM(3 SMF71BSM) FLOAT(56);,                         /*           
*                                      Minimum number of bad SCM blocks         
*                                      (long floating point) @OA38660*/         
*        ?ERBFITEM(3 SMF71BSX) FLOAT(56);,                         /*           
*                                      Maximum number of bad SCM blocks         
*                                      (long floating point) @OA38660*/         
*        ?ERBFITEM(3 SMF71BSA) FLOAT(56);,                         /*           
*                                      Average number of bad SCM blocks         
*                                      (long floating point) @OA38660*/         
*        ?ERBFITEM(3 SMF71USM) FLOAT(56);,                         /*           
*                                      Minimum number of SCM blocks             
*                                      in-use                                   
*                                      (long floating point) @OA38660*/         
*        ?ERBFITEM(3 SMF71USX) FLOAT(56);,                         /*           
*                                      Maximum number of SCM blocks             
*                                      in-use                                   
*                                      (long floating point) @OA38660*/         
*        ?ERBFITEM(3 SMF71USA) FLOAT(56);,                         /*           
*                                      Average number of SCM blocks             
*                                      in-use                                   
*                                      (long floating point) @OA38660*/         
*        3 SMF71TLS FIXED(32),      /* Total number of logical swaps            
*                                      (from RMCASRC)        @OA36188*/         
*        3 *        FIXED(32),      /* Not used                  @62C*/         
*        ?ERBFITEM(3 SMF71S7M) FLOAT(56);,                         /*           
*                                      Minimum number of shared page            
*                                      groups backed on SCM storage             
*                                      (long floating point)     @92C*/         
*        ?ERBFITEM(3 SMF71S7X) FLOAT(56);,                         /*           
*                                      Maximum number of shared page            
*                                      groups backed on SCM storage             
*                                      (long floating point)     @92C*/         
*        ?ERBFITEM(3 SMF71S7A) FLOAT(56);,                         /*           
*                                      Average number of shared page            
*                                      groups backed on SCM storage             
*                                      (long floating point)     @92C*/         
*        ?ERBFITEM(3 SMF71LVF) FLOAT(56);,                         /*           
*                                      Average number of unused central         
*                                      storage page frames                      
*                                      (same as SMF71AVF)                       
*                                      (long floating point)     @71A*/         
*        ?ERBFITEM(3 SMF71LVS) FLOAT(56);,                         /*           
*                                      Average number of pageable               
*                                      address space central storage            
*                                      frames in the private address            
*                                      space (same as SMF71AVS)                 
*                                      (long floating point)     @71A*/         
*        ?ERBFITEM(3 SMF71LVT) FLOAT(56);,                         /*           
*                                      Average total number of central          
*                                      storage frames used                      
*                                      (same as SMF71AVT)                       
*                                      (long floating point)     @71A*/         
*        ?ERBFITEM(3 SMF71LVR) FLOAT(56);,                         /*           
*                                      Average number of non-LSQA fixed         
*                                      central storage frames in the            
*                                      private address space                    
*                                      (same as SMF71AVR)                       
*                                      (long floating point)     @71A*/         
*        ?ERBFITEM(3 SMF71LVX) FLOAT(56);,                         /*           
*                                      Average total number of fixed            
*                                      central storage frames used              
*                                      (same as SMF71AVX)                       
*                                      (long floating point)     @71A*/         
*        ?ERBFITEM(3 SMF71LVU) FLOAT(56);,                         /*           
*                                      Average number of usable local           
*                                      page data set slots that have            
*                                      not been allocated                       
*                                      (same as SMF71AVU)                       
*                                      (long floating point)     @71A*/         
*        ?ERBFITEM(3 SMF71LVV) FLOAT(56);,                         /*           
*                                      Average number of local page             
*                                      data set slots allocated to VIO          
*                                      private area pages                       
*                                      (same as SMF71AVV)                       
*                                      (long floating point)     @71A*/         
*        ?ERBFITEM(3 SMF71LVM) FLOAT(56);,                         /*           
*                                      Average number of local page             
*                                      data set slots allocated to              
*                                      non-VIO private area pages               
*                                      (same as SMF71AVM)                       
*                                      (long floating point)     @71A*/         
*        ?ERBFITEM(3 SMF71LVB) FLOAT(56);,                         /*           
*                                      Average number of unusable local         
*                                      page data set slots                      
*                                      (same as SMF71AVB)                       
*                                      (long floating point)     @71A*/         
*        3 SMF71MCF FIXED(31),      /* Multithreading maximum                   
*                                      capacity numerator for general           
*                                      purpose processors.                      
*                                      Divide this value by 1024 to get         
*                                      the multithreading maximum               
*                                      capacity factor for all general          
*                                      purpose processors that were             
*                                      configured ONLINE for the                
*                                      complete interval.        @72A*/         
*        3 *        FIXED(32),      /* Reserved                  @75A*/         
*        ?ERBFITEM(3 SMF71CPM) FLOAT(56);,                         /*           
*                                      Minimum number of high virtual           
*                                      common pages is-use                      
*                                      (long floating point)     @75A*/         
*        ?ERBFITEM(3 SMF71CPX) FLOAT(56);,                         /*           
*                                      Maximum number of high virtual           
*                                      common pages is-use                      
*                                      (long floating point)     @75A*/         
*        ?ERBFITEM(3 SMF71CPA) FLOAT(56);,                         /*           
*                                      Average number of high virtual           
*                                      common pages is-use                      
*                                      (long floating point)     @75A*/         
*        ?ERBFITEM(3 SMF714KM) FLOAT(56);,                         /*           
*                                      Reserved                  @82C*/         
*        ?ERBFITEM(3 SMF714KX) FLOAT(56);,                         /*           
*                                      Reserved                  @82C*/         
*        ?ERBFITEM(3 SMF714KA) FLOAT(56);,                         /*           
*                                      Reserved                  @82C*/         
*        ?ERBFITEM(3 SMF71PLM) FLOAT(56);,                         /*           
*                                      Minimum number of 1 MB frames            
*                                      that are in-use by pageable 1 MB         
*                                      pages                                    
*                                      (long floating point)     @82C*/         
*        ?ERBFITEM(3 SMF71PLX) FLOAT(56);,                         /*           
*                                      Maximum number of 1 MB frames            
*                                      that are in-use by pageable 1 MB         
*                                      pages                                    
*                                      (long floating point)     @82C*/         
*        ?ERBFITEM(3 SMF71PLA) FLOAT(56);,                         /*           
*                                      Average number of 1 MB frames            
*                                      that are in-use by pageable 1 MB         
*                                      pages                                    
*                                      (long floating point)     @82C*/         
*        ?ERBFITEM(3 SMF71GOM) FLOAT(56);,                         /*           
*                                      Minimum number of fixed 2 GB             
*                                      memory objects allocated in the          
*                                      system                                   
*                                      (long floating point)     @81A*/         
*        ?ERBFITEM(3 SMF71GOX) FLOAT(56);,                         /*           
*                                      Maximum number of fixed 2 GB             
*                                      memory objects allocated in the          
*                                      system                                   
*                                      (long floating point)     @81A*/         
*        ?ERBFITEM(3 SMF71GOA) FLOAT(56);,                         /*           
*                                      Average number of fixed 2 GB             
*                                      memory objects allocated in the          
*                                      system                                   
*                                      (long floating point)     @81A*/         
*        ?ERBFITEM(3 SMF71GRM) FLOAT(56);,                         /*           
*                                      Minimum number of 2 GB pages             
*                                      fixed in central storage                 
*                                      (same as SMF71GUM)                       
*                                      (long floating point)     @81A*/         
*        ?ERBFITEM(3 SMF71GRX) FLOAT(56);,                         /*           
*                                      Maximum number of 2 GB pages             
*                                      fixed in central storage                 
*                                      (same as SMF71GUX)                       
*                                      (long floating point)     @81A*/         
*        ?ERBFITEM(3 SMF71GRA) FLOAT(56);,                         /*           
*                                      Average number of 2 GB pages             
*                                      fixed in central storage                 
*                                      (same as SMF71GUA)                       
*                                      (long floating point)     @81A*/         
*        ?ERBFITEM(3 SMF71GUM) FLOAT(56);,                         /*           
*                                      Minimum number of 2 GB frames in         
*                                      the Large Frame Area that are            
*                                      in-use by fixed memory objects           
*                                      (same as SMF71GRM)                       
*                                      (long floating point)     @81A*/         
*        ?ERBFITEM(3 SMF71GUX) FLOAT(56);,                         /*           
*                                      Maximum number of 2 GB frames in         
*                                      the Large Frame Area that are            
*                                      in-use by fixed memory objects           
*                                      (same as SMF71GRX)                       
*                                      (long floating point)     @81A*/         
*        ?ERBFITEM(3 SMF71GUA) FLOAT(56);,                         /*           
*                                      Average number of 2 GB frames in         
*                                      the Large Frame Area hat are             
*                                      in-use by fixed memory objects           
*                                      (same as SMF71GRA)                       
*                                      (long floating point)     @81A*/         
*        ?ERBFITEM(3 SMF71GUH) FLOAT(56);,                         /*           
*                                      High water mark for the number           
*                                      of 2 GB frames that are used by          
*                                      the system                               
*                                      (long floating point)     @81A*/         
*        ?ERBFITEM(3 SMF71GAM) FLOAT(56);,                         /*           
*                                      Minimum number of 2 GB frames in         
*                                      the Large Frame Area hat are             
*                                      not in-use                               
*                                      (long floating point)     @81A*/         
*        ?ERBFITEM(3 SMF71GAX) FLOAT(56);,                         /*           
*                                      Maximum number of 2 GB frames in         
*                                      the Large Frame Area hat are             
*                                      not in-use                               
*                                      (long floating point)     @81A*/         
*        ?ERBFITEM(3 SMF71GAA) FLOAT(56);,                         /*           
*                                      Average number of 2 GB frames in         
*                                      the Large Frame Area hat are             
*                                      not in-use                               
*                                      (long floating point)     @81A*/         
*        ?ERBFITEM(3 SMF71GFM) FLOAT(56);,                         /*           
*                                      Lowest maximum number of 2 GB            
*                                      frames that can be used by               
*                                      fixed 2 GB pages                         
*                                      (long floating point)     @82C*/         
*        ?ERBFITEM(3 SMF71GFX) FLOAT(56);,                         /*           
*                                      Highest maximum number of 2 GB           
*                                      frames that can be used by               
*                                      fixed 2 GB pages                         
*                                      (long floating point)     @82C*/         
*        ?ERBFITEM(3 SMF71GFA) FLOAT(56);,                         /*           
*                                      Average maximum number of 2 GB           
*                                      frames that can be used by               
*                                      fixed 2 GB pages                         
*                                      (long floating point)     @82C*/         
*        ?ERBFITEM(3 SMF71NNF) FLOAT(56);,                         /*           
*                                      Average number of non-nucleus            
*                                      frames comprising permanent              
*                                      storage                                  
*                                      (long floating point)     @82A*/         
*        ?ERBFITEM(3 SMF71LSI) FLOAT(56);,                         /*           
*                                      Average number of system-ini-            
*                                      tiated demotions from pageable           
*                                      large frame groups to 4K page            
*                                      frames                                   
*                                      (long floating point)     @82A*/         
*        ?ERBFITEM(3 SMF71LRI) FLOAT(56);,                         /*           
*                                      Average number of request-ini-           
*                                      tiated demotions from pageable           
*                                      large frame groups to 4K page            
*                                      frames                                   
*                                      (long floating point)     @82A*/         
*        ?ERBFITEM(3 SMF71MHW) FLOAT(56);,                         /*           
*                                      High water mark of the number            
*                                      of 1 MB frames that were used            
*                                      to satisfy fixed 1 MB page               
*                                      requests                                 
*                                      (long floating point)     @82A*/         
*        ?ERBFITEM(3 SMF71PIS) FLOAT(56);,                         /*           
*                                      Average total number of page-ins         
*                                      of 4 KB pages from SCM                   
*                                      (long floating point)     @82A*/         
*        ?ERBFITEM(3 SMF71POS) FLOAT(56);,                         /*           
*                                      Average total number of page-            
*                                      outs of 4 KB pages to SCM                
*                                      (long floating point)     @82A*/         
*        ?ERBFITEM(3 SMF71PI1) FLOAT(56);,                         /*           
*                                      Average total number of page-ins         
*                                      of 1 MB pages from SCM                   
*                                      (long floating point)     @82A*/         
*        ?ERBFITEM(3 SMF71PO1) FLOAT(56);,                         /*           
*                                      Average total number of page-            
*                                      outs of 1 MB pages to SCM                
*                                      (long floating point)     @82A*/         
*        ?ERBFITEM(3 SMF71L8M) FLOAT(56);,                         /*           
*                                      Minimum total number of 1 MB             
*                                      frames in central storage                
*                                      (long floating point)     @82A*/         
*        ?ERBFITEM(3 SMF71L8X) FLOAT(56);,                         /*           
*                                      Maximum total number of 1 MB             
*                                      frames in central storage                
*                                      (long floating point)     @82A*/         
*        ?ERBFITEM(3 SMF71L8A) FLOAT(56);,                         /*           
*                                      Average total number of 1 MB             
*                                      frames in central storage                
*                                      (long floating point)     @82A*/         
*        ?ERBFITEM(3 SMF71L9M) FLOAT(56);,                         /*           
*                                      Minimum number of available              
*                                      1 MB frames in central storage           
*                                      (long floating point)     @82A*/         
*        ?ERBFITEM(3 SMF71L9X) FLOAT(56);,                         /*           
*                                      Maximum number of available              
*                                      1 MB frames in central storage           
*                                      (long floating point)     @82A*/         
*        ?ERBFITEM(3 SMF71L9A) FLOAT(56);,                         /*           
*                                      Average number of available              
*                                      1 MB frames in central storage           
*                                      (long floating point)     @82A*/         
*        ?ERBFITEM(3 SMF71L10M) FLOAT(56);,                        /*           
*                                      Minimum number of 1 MB frames            
*                                      that are in-use by memory                
*                                      objects                                  
*                                      (long floating point)     @82A*/         
*        ?ERBFITEM(3 SMF71L10X) FLOAT(56);,                        /*           
*                                      Maximum number of 1 MB frames            
*                                      that are in-use by memory                
*                                      objects                                  
*                                      (long floating point)     @82A*/         
*        ?ERBFITEM(3 SMF71L10A) FLOAT(56);,                        /*           
*                                      Average number of 1 MB frames            
*                                      that are in-use by memory                
*                                      objects                                  
*                                      (long floating point)     @82A*/         
*        ?ERBFITEM(3 SMF71M6C) FLOAT(56);,                        /*            
*                                      Minimum number of frames backing         
*                                      64-bit shared page groups                
*                                      (long floating point)     @92A*/         
*        ?ERBFITEM(3 SMF71X6C) FLOAT(56);,                        /*            
*                                      Maximum number of frames backing         
*                                      64-bit shared page groups                
*                                      (long floating point)     @92A*/         
*        ?ERBFITEM(3 SMF71A6C) FLOAT(56);,                        /*            
*                                      Average number of frames backing         
*                                      64-bit shared page groups                
*                                      (long floating point)     @92A*/         
*        ?ERBFITEM(3 SMF71M6F) FLOAT(56);,                        /*            
*                                      Minimum number of fixed frames           
*                                      backing 64-bit shared page               
*                                      groups                                   
*                                      (long floating point)     @92A*/         
*        ?ERBFITEM(3 SMF71X6F) FLOAT(56);,                        /*            
*                                      Maximum number of fixed frames           
*                                      backing 64-bit shared page               
*                                      groups                                   
*                                      (long floating point)     @92A*/         
*        ?ERBFITEM(3 SMF71A6F) FLOAT(56);,                        /*            
*                                      Average number of fixed frames           
*                                      backing 64-bit shared page               
*                                      groups                                   
*                                      (long floating point)     @92A*/         
*        ?ERBFITEM(3 SMF71M6B) FLOAT(56);,                        /*            
*                                      Minimum number of 24-bit frames          
*                                      backing 64-bit shared page               
*                                      groups                                   
*                                      (long floating point)     @92A*/         
*        ?ERBFITEM(3 SMF71X6B) FLOAT(56);,                        /*            
*                                      Maximum number of 24-bit frames          
*                                      backing 64-bit shared page               
*                                      groups                                   
*                                      (long floating point)     @92A*/         
*        ?ERBFITEM(3 SMF71A6B) FLOAT(56);,                        /*            
*                                      Average number of 24-bit frames          
*                                      backing 64-bit shared page               
*                                      groups                                   
*                                      (long floating point)     @92A*/         
*        ?ERBFITEM(3 SMF71M6A) FLOAT(56);,                        /*            
*                                      Minimum number of auxiliary DASD         
*                                      slots used to back 64-bit shared         
*                                      page groups                              
*                                      (long floating point)     @92A*/         
*        ?ERBFITEM(3 SMF71X6A) FLOAT(56);,                        /*            
*                                      Maximum number of auxiliary DASD         
*                                      slots used to back 64-bit shared         
*                                      page groups                              
*                                      (long floating point)     @92A*/         
*        ?ERBFITEM(3 SMF71A6A) FLOAT(56);,                        /*            
*                                      Average number of auxiliary DASD         
*                                      slots used to back 64-bit shared         
*                                      page groups                              
*                                      (long floating point)     @92A*/         
*        ?ERBFITEM(3 SMF71M6S) FLOAT(56);,                        /*            
*                                      Minimum number of SCM blocks             
*                                      used to back 64-bit shared               
*                                      page groups                              
*                                      (long floating point)     @92A*/         
*        ?ERBFITEM(3 SMF71X6S) FLOAT(56);,                        /*            
*                                      Maximum number of SCM blocks             
*                                      used to back 64-bit shared               
*                                      page groups                              
*                                      (long floating point)     @92A*/         
*        ?ERBFITEM(3 SMF71A6S) FLOAT(56);,                        /*            
*                                      Average number of SCM blocks             
*                                      used to back 64-bit shared               
*                                      page groups                              
*                                      (long floating point)     @92A*/         
*        ?ERBFITEM(3 SMF71M6T) FLOAT(56);,                        /*            
*                                      Minimum number of 64-bit                 
*                                      shared page groups in the                
*                                      system                                   
*                                      (long floating point)     @92A*/         
*        ?ERBFITEM(3 SMF71X6T) FLOAT(56);,                        /*            
*                                      Maximum number of 64-bit                 
*                                      shared page groups in the                
*                                      system                                   
*                                      (long floating point)     @92A*/         
*        ?ERBFITEM(3 SMF71A6T) FLOAT(56);;                        /*            
*                                      Average number of 64-bit                 
*                                      shared page groups in the                
*                                      system                                   
*                                      (long floating point)     @92A*/         
*                                                                               
*/********************************************************************/         
*/*              SWAP PLACEMENT DATA SECTION                         */         
*/* With MVS Release 13 this section is no longer filled.        @51C*/         
*/********************************************************************/         
*                                                                               
*   DCL SMF71NSR CONSTANT(18);      /* Reserved                  @51C*/         
*   %IF SMFARRAY = 'YES' %THEN %GOTO ARR71;                    /*@P1A*/         
*                                                                               
*   DCL 1 SMF71SWP BASED(ADDR(SMF71HDR)+SMF71SWS),             /*@P1A*/         
*       %GOTO CONT71;                                          /*@P1A*/         
*%ARR71:;                                                      /*@P1A*/         
*   DCL 1 SMF71SWP(1:SMF71NSR) BASED(ADDR(SMF71HDR)+SMF71SWS), /*@A2C*/         
*%CONT71:;                                                     /*@P1A*/         
*        3 SMF71TOT FIXED(32),      /* Reserved                  @51C*/         
*        3 SMF71AXD FIXED(32),      /* Reserved                  @51C*/         
*        3 SMF71LES FIXED(32),      /* Reserved                  @51C*/         
*        3 SMF71LAX FIXED(32),      /* Reserved                  @51C*/         
*        3 SMF71ESD FIXED(32),      /* Reserved                  @51C*/         
*        3 SMF71MIG FIXED(32);      /* Reserved                  @51C*/         
