*%GOTO SHDLA1;                      /* BILINGUAL MAPPING MACRO                  
         MACRO                                                                  
         ERBSHDG3                                                               
.*                                                                              
.*   This macro maps fields of the sample header control block                  
.*   used by external                                                           
.*   interfaces of the RMF monitor III data gatherer                            
.*                              */                                              
*%SHDLA1: ;                                                                     
*/****  START OF SPECIFICATIONS  *************************************/         
*/**                                                                 */         
*/*                                                                  */         
*/** MACRO NAME: ERBSHDG3                                       @A02C*/         
*/**                                                                 */         
*/** DESCRIPTIVE NAME: MAPPING MACRO FOR MONITOR III DATA GATHERER   */         
*/**                   SAMPLE HEADER DATA CONTROL BLOCK         @A02C*/         
*/**                                                                 */         
*/**01* PROPRIETARY STATEMENT:                                   @61A*/         
*/**       LICENSED MATERIALS - PROPERTY OF IBM                  @61A*/         
*/**       "RESTRICTED MATERIALS OF IBM"                         @61A*/         
*/**       COPYRIGHT IBM CORP. 1983, 2021                            */         
*/**                                                                 */         
*/**       STATUS: z/OS V2R5 Data Gatherer (HRG77D0)                 */         
*/**                                                                 */         
*/** FUNCTION = THIS MACRO MAPS THE RMF MON III DATA GATHERER        */         
*/**            SAMPLE HEADER CONTROL BLOCK                          */         
*/**                                                                 */         
*/** NOTES:                                                      @B1C*/         
*/**                                                                 */         
*/**  1. THE CONSTANT SHDG3CB AND THE COMMENT OF THE FIELD SHDRMFV   */         
*/**     HAVE TO BE UPDATED WHENEVER THIS CONTROL BLOCK BECOMES      */         
*/**     INCOMPATIBLE TO THE PREVIOUS VERSION.                   @B3A*/         
*/**                                                                 */         
*/**                                                                 */         
*/**  2. THIS DATA AGGREGATE IS STORED IN PERMANENT STORAGE.         */         
*/**     ANY CHANGES MADE MUST BE REFLECTED IN THE REPORTER          */         
*/**     CONVERSION PROCESS. ESPECIALLY THE CONTROL BLOCK            */         
*/**     ERBVFMG3 NEEDS TO BE UPDATED.                               */         
*/**                                                             @B4A*/         
*/**                                                                 */         
*/** MODULE TYPE = MACRO                                             */         
*/**                                                                 */         
*/** PROCESSOR   = PLAS                                              */         
*/**                                                                 */         
*/** METHOD OF ACCESS                                                */         
*/**                                                                 */         
*/**         SHDG3 IS DECLARED AS A BASED STRUCTURE, SHDG3PTR SHOULD */         
*/**         BE DECLARED                                             */         
*/**                                                                 */         
*/** METHOD OF INVOCATION                                            */         
*/**                                                                 */         
*/**   PLAS - PERCENT INCLUDE SYSLIB(ERBSHDG3) SEMICOLON             */         
*/**                                                                 */         
*/** DISTRIBUTION LIBRARY: ARMFMAC1                              @B1A*/         
*/**                                                                 */         
*/** CHANGE ACTIVITY = SEE BELOW                                     */         
*/**                 The constant   SHDG3CB and the comment of the   */         
*/**                 fields SHDRMFV have to be changed whenever this */         
*/**                 control block becomes incompatible to its       */         
*/**                 previous version.                               */         
*/** $M0=MONIIIG,HRM3202,,PFU: MAPPING MACRO FOR SAMPLE HEADER       */         
*/** $Q1=PERI,HRM3402,,PFU: Performance improvements             @Q1A*/         
*/** $B1=R430,HRM4430,,THE: Distribution lib in prolog           @B1A*/         
*/* WLR: System Utility Processor (zIIP) support completion  @OA16458*/         
*/** $61=R790,HRM7790,,MWe: explicit copyright for ext. macro    @61A*/         
*/** $81=zHW2,HRM77B0,,JKu: zHyperwrite Stage 2                  @81A*/         
*/** $A02=ZOSB,HRG77D0,,JBa: Make macro bilingual               @A02A*/         
*/**                                                                 */         
*/****  END OF SPECIFICATIONS  ***************************************/         
*%GOTO SHDLA2;     /*                                                           
SHDG3    DSECT               Sample header                                      
         DS    0F            Align on word boundary                             
SHDSHDG3 DS    XL5           ACRONYM 'SHDG3'                                    
SHDRMFV  DS    XL1           SHDG3 control block version X'03'   @81C           
SHDLEN   DS    XL1           Length of SHDG3                     @Q1C           
SHDFLAG1 DS    XL1           SAMPLE FLAG 1                                      
SHDINVAL EQU   X'80'         ..SAMPLE IS INVALID                                
SHDPREVP DS    A             POINTER TO PREVIOUS SAMPLE                         
SHDNEXTP DS    A             POINTER TO NEXT SAMPLE                             
SHDREDOF DS    A             OFFSET TO FIRST RED RECORD                         
         MEND                                                                   
                             */                                                 
*%SHDLA2:;                                                                      
    DCL                                                                         
      SHDG3CB  BIT(8)  CONSTANT('03'X);  /* SSHG3 control block                 
                                    version number               @81C*/         
    DCL                                                                         
      SHDG3ZH  BIT(8)  CONSTANT('03'X);  /* 5-digit device numbers              
                                    supported (zHyperwrite)      @81A*/         
    DCL                                                                         
      SHDLENCF FIXED(16) CONSTANT(LENGTH(SHDG3));  /* LENGTH OF SHD  */         
    DCL                                                                         
      1 SHDG3 BASED(SHDG3PTR) BDY(WORD), /* SAMPLE HEADER            */         
        3 SHDSHDG3 CHAR(5),         /* ACRONYM 'SHDG3'               */         
        3 SHDRMFV CHAR(1),          /* SHDG3 control block version              
                                       number '03'X              @81C*/         
        3 SHDLEN   FIXED(8),        /* Length of SHDG3           @Q1C*/         
        3 SHDFLAG1 BIT(8),          /* SAMPLE FLAG 1                 */         
          5 SHDINVAL BIT(1),        /* ON = SAMPLE IS INVALID        */         
          5 * BIT(7),               /* NOT USED                      */         
        3 SHDPREVP PTR(31),         /* POINTER TO PREVIOUS SAMPLE    */         
          5 SHDPREVO FIXED(31),     /* Offset to previous sample.               
                                       This field contains the offset           
                                       within the M3 data gatherer              
                                       areas. The M3 reporter module            
                                       changes the offset to a pointer          
                                       after the data have been moved           
                                       to the reporters address space*/         
        3 SHDNEXTP PTR(31),         /* POINTER TO NEXT SAMPLE        */         
          5 SHDNEXTO FIXED(31),     /* OFFSET TO NEXT SAMPLE.                   
                                       This field contains the offset           
                                       within the M3 data gatherer              
                                       areas. The M3 reporter module            
                                       changes the offset to a pointer          
                                       after the data have been moved           
                                       to the reporters address space*/         
        3 SHDREDOF FIXED(31),       /* OFFSET TO FIRST RED RECORD    */         
        3 SHDREDNR FIXED(15),       /* NUMBER OF RED RECORDS         */         
        3 SHDREDLE FIXED(15),       /* Length of one REDG3 entry @Q1A*/         
        3 SHDSMPNR FIXED(31),       /* SAMPLE SEQUENCE NUMBER    @Q1M*/         
        3 SHDBADNR FIXED(15),       /* NUMBER OF BAD GATHERING                  
                                       MODULES THIS SAMPLE           */         
        3 SHDUWDNR FIXED(16),       /* Number of USE/Wait records               
                                                             @OA16458*/         
                                    /*                          1@Q1D*/         
        3 SHDTIBEG CHAR(8),         /* BEGIN TIME THIS SAMPLE        */         
        3 SHDTIEND CHAR(8);         /* END TIME THIS SAMPLE          */         
                                                                                
 /*************************************************************6@A02A*/         
 @LOGIC;                                                                        
 #PRAGMA TOOL=CBGEN.                                                            
 #ALIGNOP.                                                                      
 #NOTUPPER.                                                                     
 #EPRAGMA.                                                                      
 @ENDLOGIC;                                                                     
