*%dcl fotsmf77_inc Fixed external;                                              
*%if fotsmf77_inc=0 %then %do;                                                  
*%fotsmf77_inc=1;                                                               
*%GOTO FOT771; /*                                                               
         MACRO                                                                  
         FOTSMF77 &SSH=YES,       YES = GEN SSH SMF DSECTS             X        
               &HEADER=YES        YES = SMF HEADER DSECTS FOR ALL RECS          
         AGO   .M010000      */                                                 
*%FOT771: ;                                                                     
*/********************* START OF SPECIFICATIONS **********************/         
*/*                                                                  */         
*/* MACRO NAME:       FOTSMF77                                       */         
*/*                                                                  */         
*/* DESCRIPTIVE NAME: SMF Record Type 119 Mapping for OpenSSH        */         
*/*                                                                  */         
*/* COMPONENT NAME:   OpenSSH for z/OS                               */         
*/*                                                                  */         
*/* LICENSED MATERIALS - PROPERTY OF IBM                             */         
*/*                                                                  */         
*/* 5655-M23                                                         */         
*/*                                                                  */         
*/*  COPYRIGHT IBM CORP. 2010, 2018                                  */         
*/*                                                                  */         
*/* US GOVERNMENT USERS RESTRICTED RIGHTS - USE,                     */         
*/* DUPLICATION OR DISCLOSURE RESTRICTED BY GSA ADP                  */         
*/* SCHEDULE CONTRACT WITH IBM CORP.                                 */         
*/*                                                                  */         
*/* Status:    HOS2240                                               */         
*/*                                                                  */         
*/* Function:           This macro is used to map SMF type 119       */         
*/*                     records for OpenSSH.                         */         
*/*                                                                  */         
*/* Part Type:          MACRO                                        */         
*/*                                                                  */         
*/* Method of Access:   ASSEMBLER                                    */         
*/*                                                                  */         
*/* Notes for Use:      None.                                        */         
*/*                                                                  */         
*/* Serialization:      N/A                                          */         
*/*                                                                  */         
*/* Change Activity:                                                 */         
*/*                                                                  */         
*/* Flag Reason   Release  Date   Origin    Description              */         
*/* ---- -------- -------- ------ --------  ------------------------ */         
*/* $A0= B615.00  HOS1120  080908 z/OS    : Create mapping           */         
*/* $A1= C356.00  HOS1120  110606 z/OS    : Add values for ICSF      */         
*/*                                         ciphers and MACs.        */         
*/* $A2= C761.00  HOS1130  141119 z/OS    : New Ciphers/MACs,        */         
*/*                                         New subtypes (94,95),    */         
*/*                                         SFTP target path,        */         
*/*                                         Login failure reasons,   */         
*/*                                         get -a (reget) flag.     */         
*/* $A3= C797.00  HOS2220  150213 z/OS    : GSS/Kerberos Auth types  */         
*/* $A4= C399.00  HOS2220  150602 z/OS    : Add values for FIPS      */         
*/*                                         mode and key exchange    */         
*/*                                         method                   */         
*/* $A5= FP1986   HOS2230  161116 z/OS    : Correct AES CTR ICSF     */         
*/*                                         constants. Old symbols   */         
*/*                                         deprecated               */         
*/* $A6= D070.00  HOS2230  170505 z/OS    : Add values for CPACF     */         
*/*                                         ciphers and MACs.        */         
*/* $A7= FP2184   HOS2240  180626 z/OS    : Add Algs for OpenSSH 7.6 */         
*/* $A8= FP2184   HOS2240  180626 z/OS    : Includes SMF_119SSH_LF   */         
*/*                                         section with subtype 94  */         
*/*                                         and 95 records           */         
*/********************************************************************/         
*/* NOTE: Changes to this part likely need to be mirrored in         */         
*/*       /samples/ssh_smf.h as well.                                */         
*/********************************************************************/         
*%GOTO FOT772; /*                                                               
.M010000 ANOP                                                                   
         AIF   ('&HEADER' NE 'YES').M020000                                     
*---------------------------------------------------------------------*         
*                                                                               
* SMF Type 119 Record for OpenSSH                                               
*                                                                               
SMF_119SSH_Header   DSECT            SMF Record Header                          
SMF_119SSH_HDLength  DS  BL2         Record length                              
SMF_119SSH_HDSegDesc DS  BL2         Segment descriptor                         
SMF_119SSH_HDFlags   DS  BL1         Header flags                               
SMF_119SSH_HDType    DS  BL1         Record type (119, x'77')                   
SMF_119SSH_HDTime    DS  BL4         Time record moved to SMF buffer            
SMF_119SSH_HDDate    DS  PL4         Date record moved to SMF buffer            
SMF_119SSH_HDSID     DS  CL4         System ID                                  
SMF_119SSH_HDSSI     DS  CL4         Subsystem ID                               
SMF_119SSH_HDSubType DS  BL2         Record subtype                             
SMF_119SSH_HDST_CliConnStart EQU X'005E'                          @A2A          
SMF_119SSH_HDST_SvrConnStart EQU X'005F'                          @A2A          
SMF_119SSH_HDST_SSHServer  EQU X'0060'                                          
SMF_119SSH_HDST_SSHClient  EQU X'0061'                                          
SMF_119SSH_HDST_SrvLoginF  EQU X'0062'                                          
SMF_119SSH_HDLN      EQU *-SMF_119SSH_Header                                    
*                                                                               
* Self Defining section, basic level. All records will have at least            
* two triplets, one for the TCP/IP Identification section and one for           
* a record specific section                                                     
*                                                                               
SMF_119SSH_SDefSect DSECT            SMF Self-defining section                  
SMF_119SSH_SD_TRN    DS  BL2         Number of triplets                         
SMF_119SSH_SDrsvd    DS  BL2         reserved                                   
SMF_119SSH_IDOff     DS  BL4         Offset to TCP/IP Ident section             
SMF_119SSH_IDLen     DS  BL2         Length of TCP/IP Ident section             
SMF_119SSH_IDNum     DS  BL2         Number of TCP/IP Ident section             
SMF_119SSH_S1Off     DS  BL4         Offset to first record section             
SMF_119SSH_S1Len     DS  BL2         Length of first record section             
SMF_119SSH_S1Num     DS  BL2         Number of section instances                
SMF_119SSH_SDLN     EQU *-SMF_119SSH_SDefSect                                   
*                                                                               
* Additional mapping for records with three sections.                           
SMF_119SSH_SD2Triples  DSECT         SMF Self-defining sect                     
SMF_119SSH_S2Off     DS  BL4         Offset to 2nd record section               
SMF_119SSH_S2Len     DS  BL2         Length of 2nd record section               
SMF_119SSH_S2Num     DS  BL2         Number of section instances                
SMF_119SSH_S2LN     EQU *-SMF_119SSH_SD2Triples                                 
*                                                                               
* Additional mapping for records with four sections.                            
SMF_119SSH_SD3Triples  DSECT         SMF Self-defining sect                     
SMF_119SSH_S3Off     DS  BL4         Offset to 3rd record section               
SMF_119SSH_S3Len     DS  BL2         Length of 3rd record section               
SMF_119SSH_S3Num     DS  BL2         Number of section instances                
SMF_119SSH_S3LN     EQU *-SMF_119SSH_SD3Triples                                 
*                                                                               
* Additional mapping for records with five sections.                            
SMF_119SSH_SD4Triples  DSECT         SMF Self-defining sect                     
SMF_119SSH_S4Off     DS  BL4         Offset to 4th record section               
SMF_119SSH_S4Len     DS  BL2         Length of 4th record section               
SMF_119SSH_S4Num     DS  BL2         Number of section instances                
SMF_119SSH_S4LN     EQU *-SMF_119SSH_SD4Triples                                 
*                                                                               
* Additional mapping for records with six sections.                             
SMF_119SSH_SD5Triples  DSECT         SMF Self-def section                       
SMF_119SSH_S5Off     DS  BL4         Offset to 5th record section               
SMF_119SSH_S5Len     DS  BL2         Length of 5th record section               
SMF_119SSH_S5Num     DS  BL2         Number of section instances                
SMF_119SSH_S5LN     EQU *-SMF_119SSH_SD5Triples                                 
*                                                                               
* Additional mapping for records with seven sections.             @A2A          
SMF_119SSH_SD6Triples  DSECT         SMF Self-def section         @A2A          
SMF_119SSH_S6Off     DS  BL4         Offset to 6th record section @A2A          
SMF_119SSH_S6Len     DS  BL2         Length of 6th record section @A2A          
SMF_119SSH_S6Num     DS  BL2         Number of section instances  @A2A          
SMF_119SSH_S6LN     EQU *-SMF_119SSH_SD6Triples                   @A2A          
*                                                                               
*---------------------------------------------------------------------*         
*                                                                               
* TCP/IP Identification section, common to all records                          
*                                                                               
SMF_119SSH_Ident DSECT                                                          
SMF_119SSH_TI_SYSName      DS  CL8     System name                              
SMF_119SSH_TI_SysplexName  DS  CL8     Sysplex name                             
SMF_119SSH_TI_Stack        DS  CL8     Stack name                               
SMF_119SSH_TI_ReleaseID    DS  CL8     z/OS release identifier                  
SMF_119SSH_TI_Comp         DS  CL8     OpenSSH subcomponent                     
SMF_119SSH_TI_ASName       DS  CL8     Address space name of writer             
SMF_119SSH_TI_UserID       DS  CL8     User ID of security context              
SMF_119SSH_TI_Reserved     DS  BL2     Reserved                                 
SMF_119SSH_TI_ASID         DS  BL2     ASID of writer                           
SMF_119SSH_TI_Reason       DS  BL1     Reason for writing record                
SMF_119SSH_TI_ReasonEvt      EQU X'08'  - Event record                          
SMF_119SSH_TI_RecordID     DS  FL1     Record ID                                
SMF_119SSH_TI_rsvd         DS  BL2'0'  Reserved                                 
SMF_119SSHTILN    EQU *-SMF_119SSH_Ident                                        
*                                                                               
SMF_119SSH_TI_CompDefs   DSECT                                                  
SMF_119SSH_TI_CompSFTPS    DC  C'SFTPS   '                                      
SMF_119SSH_TI_CompSFTPC    DC  C'SFTPC   '                                      
SMF_119SSH_TI_CompSCPS     DC  C'SCPS    '                                      
SMF_119SSH_TI_CompSCPC     DC  C'SCPC    '                                      
SMF_119SSH_TI_CompSSHD     DC  C'SSHD    '                                      
SMF_119SSH_TI_CompSSH      DC  C'SSH     '                        @A2A          
*                                                                               
.M020000 ANOP                                                                   
         AIF   ('&SSH' NE 'YES').M030000                                        
*---------------------------------------------------------------------*         
*                                                                               
* Security Information section, common to all records                           
*                                                                               
SMF_119SSH_SEC DSECT                                                            
SMF_119SSH_SSHV          DS CL16    OpenSSH version                             
SMF_119SSH_SSLV          DS CL32    OpenSSL version                             
SMF_119SSH_ZlibV         DS CL16    zlib version                                
SMF_119SSH_ProtoV        DS CL8     Protocol version                            
SMF_119SSH_AuthMethod    DS BL2     Authentication method being used            
SMF_119SSH_AuthMethUnknown EQU X'0000' - Unknown                                
SMF_119SSH_AuthMethNone    EQU X'0001' - None                                   
SMF_119SSH_AuthMethPwd     EQU X'0002' - Password                               
SMF_119SSH_AuthMethPubkey  EQU X'0003' - Publickey                              
SMF_119SSH_AuthMethHost    EQU X'0004' - Hostbased                              
SMF_119SSH_AuthMethRhosts  EQU X'0005' - Rhosts                                 
SMF_119SSH_AuthMethRhstRSA EQU X'0006' - RhostsRSA                              
SMF_119SSH_AuthMethRSA     EQU X'0007' - RSA                                    
SMF_119SSH_AuthMethKeybInt EQU X'0008' - Keyboard-interactive                   
SMF_119SSH_AuthMethChalRsp EQU X'0009' - Challenge response                     
SMF_119SSH_AuthMethCtlSock EQU X'000A' - Control socket                         
SMF_119SSH_AuthMethGssMic  EQU X'000B' - GSSAPI w/ MIC   @A3A                   
SMF_119SSH_AuthMethGssKeyex EQU X'000C' - GSSAPI w/ Keyex @A3A                  
SMF_119SSH_Cipher        DS BL2     Cipher type being used                      
SMF_119SSH_CipherUNKNOWN   EQU X'0000' - Unknown                                
SMF_119SSH_CipherNONE      EQU X'0001' - None                                   
SMF_119SSH_Cipher3DES      EQU X'0002' - 3DES                                   
SMF_119SSH_CipherBLOWFISH  EQU X'0003' - BLOWFISH                               
SMF_119SSH_CipherDES       EQU X'0004' - DES                                    
SMF_119SSH_Cipher3DES_CBC  EQU X'0005' - 3DES-CBC                               
SMF_119SSH_CipherBLFISHCBC EQU X'0006' - BLOWFISH-CBC                           
SMF_119SSH_CipherCAST128CB EQU X'0007' - CAST128-CBC                            
SMF_119SSH_CipherARCF128   EQU X'0008' - ARCFOUR128                             
SMF_119SSH_CipherARCF256   EQU X'0009' - ARCFOUR256                             
SMF_119SSH_CipherARCFOUR   EQU X'000A' - ARCFOUR                                
SMF_119SSH_CipherAES128CBC EQU X'000B' - AES128-CBC                             
SMF_119SSH_CipherAES192CBC EQU X'000C' - AES192-CBC                             
SMF_119SSH_CipherAES256CBC EQU X'000D' - AES256-CBC                             
SMF_119SSH_CipherAES128CTR EQU X'000E' - AES128-CTR                             
SMF_119SSH_CipherAES192CTR EQU X'000F' - AES192-CTR                             
SMF_119SSH_CipherAES256CTR EQU X'0010' - AES256-CTR                             
SMF_119SSH_CipherRIJNDAEL  EQU X'0011' - RIJNDAEL-CBC@LYSATOR.LIU.SE            
SMF_119SSH_CipherACSS      EQU X'0012' - ACSS@OPENSSH.ORG                       
SMF_119SSH_CipherAES128GCM EQU X'0013' - AES128-GCM@OPENSSH.COM @A2A            
SMF_119SSH_CipherAES256GCM EQU X'0014' - AES256-GCM@OPENSSH.COM @A2A            
SMF_119SSH_CipherCHACHAPOLY EQU X'0015' - chacha20-poly1305     @A7A            
*                                         @openssh.com          @A7A            
* ICSF enabled Ciphers have byte 0 = x10                                        
SMF_119SSH_Cipher3DES_CB_I EQU X'1005' - 3DES-CBC (ICSF)                        
SMF_119SSH_CipherBLFISHC_I EQU X'1006' - BLOWFISH-CBC (ICSF)                    
SMF_119SSH_CipherARCF128_I EQU X'1008' - ARCFOUR128 (ICSF)                      
SMF_119SSH_CipherARCF256_I EQU X'1009' - ARCFOUR256 (ICSF)                      
SMF_119SSH_CipherARCFOUR_I EQU X'100A' - ARCFOUR (ICSF)                         
SMF_119SSH_CipherAES128C_I EQU X'100B' - AES128-CBC (ICSF)                      
SMF_119SSH_CipherAES192C_I EQU X'100C' - AES192-CBC (ICSF)                      
SMF_119SSH_CipherAES256C_I EQU X'100D' - AES256-CBC (ICSF)                      
SMF_119SSH_CipherAES128T_I2 EQU X'100E' - AES128-CTR (ICSF)     @A5C            
SMF_119SSH_CipherAES192T_I2 EQU X'100F' - AES192-CTR (ICSF)     @A5C            
SMF_119SSH_CipherAES256T_I2 EQU X'1010' - AES256-CTR (ICSF)     @A5C            
SMF_119SSH_CipherRIJNDAE_I EQU X'1011' - RIJNDAEL-CBC@LYSATOR.LIU.SE(I)         
SMF_119SSH_CipherAES128T_I EQU X'1012' - AES128-CTR (ICSF) DEPR  @A2A           
SMF_119SSH_CipherAES192T_I EQU X'1013' - AES192-CTR (ICSF) DEPR  @A2A           
SMF_119SSH_CipherAES256T_I EQU X'1014' - AES256-CTR (ICSF) DEPR  @A2A           
* CPACF enabled Ciphers have byte 0 = x40                                       
SMF_119SSH_Cipher3DES_CB_C EQU X'4005' - 3DES-CBC (CPACF)                       
SMF_119SSH_CipherAES128C_C EQU X'400B' - AES128-CBC (CPACF) @A6A                
SMF_119SSH_CipherAES192C_C EQU X'400C' - AES192-CBC (CPACF) @A6A                
SMF_119SSH_CipherAES256C_C EQU X'400D' - AES256-CBC (CPACF) @A6A                
SMF_119SSH_CipherAES128T_C EQU X'400E' - AES128-CTR (CPACF) @A6A                
SMF_119SSH_CipherAES192T_C EQU X'400F' - AES192-CTR (CPACF) @A6A                
SMF_119SSH_CipherAES256T_C EQU X'4010' - AES256-CTR (CPACF) @A6A                
SMF_119SSH_CipherRIJNDAE_C EQU X'4011' - RIJNDAEL-CBC@LYSATOR.LIU.SE(I)         
                                                                                
SMF_119SSH_MAC           DS BL2     MAC algorithm being used                    
SMF_119SSH_MAC_Unknown     EQU X'0000' - Unknown                                
SMF_119SSH_MAC_None        EQU X'0001' - None (SSHV1)                           
*                                        or SSHV2 w/Auth Cipher @A2A            
*                                        (e.g. AES-GCM)         @A2A            
SMF_119SSH_MAC_MD5         EQU X'0002' - HMAC-MD5                               
SMF_119SSH_MAC_SHA1        EQU X'0003' - HMAC-SHA1                              
SMF_119SSH_MAC_64OPENSSH   EQU X'0004' - UMAC-64@OPENSSH.COM                    
SMF_119SSH_MAC_RIPEMD160   EQU X'0005' - HMAC-RIPEMD160                         
SMF_119SSH_MAC_SHA1_96     EQU X'0006' - HMAC-SHA1-96                           
SMF_119SSH_MAC_MD5_96      EQU X'0007' - HMAC-MD5-96                            
SMF_119SSH_MAC_RIPEMD160CM EQU X'0008' - HMAC-RIPEMD160@OPENSSH.COM             
SMF_119SSH_MAC_SHA2_256    EQU X'0009' - HMAC-SHA2-256           @A2A           
SMF_119SSH_MAC_SHA2_512    EQU X'000A' - HMAC-SHA2-512           @A2A           
SMF_119SSH_MAC_128OPENSSH  EQU X'000B' - UMAC-128@OPENSSH.COM    @A2A           
*  ICSF enabled HMAC algorithms (byte0=x10)                                     
SMF_119SSH_MAC_MD5_I       EQU X'1002' - HMAC-MD5 (ICSF)                        
SMF_119SSH_MAC_SHA1_I      EQU X'1003' - HMAC-SHA1 (ICSF)                       
SMF_119SSH_MAC_RPMD160_I   EQU X'1005' - HMAC-RIPEMD160 (ICSF)                  
SMF_119SSH_MAC_SHA1_96_I   EQU X'1006' - HMAC-SHA1-96 (ICSF)                    
SMF_119SSH_MAC_MD5_96_I    EQU X'1007' - HMAC-MD5-96 (ICSF)                     
SMF_119SSH_MAC_RPMD160CM_I EQU X'1008' - HMAC-RIPEMD160@OPENSSH.COM (I)         
SMF_119SSH_MAC_SHA2_256_I  EQU X'1009' - HMAC-SHA2-256 (ICSF)    @A2A           
SMF_119SSH_MAC_SHA2_512_I  EQU X'100A' - HMAC-SHA2-512 (ICSF)    @A2A           
*  CPACF enabled HMAC algorithms (byte0=x40)                                    
SMF_119SSH_MAC_SHA1_C      EQU X'4003' - HMAC-SHA1 (CPACF)       @A6A           
SMF_119SSH_MAC_SHA1_96_C   EQU X'4006' - HMAC-SHA1-96 (CPACF)    @A6A           
SMF_119SSH_MAC_SHA2_256_C  EQU X'4009' - HMAC-SHA2-256 (CPACF)   @A6A           
SMF_119SSH_MAC_SHA2_512_C  EQU X'400A' - HMAC-SHA2-512 (CPACF)   @A6A           
*  -etm@openssh.com variants of HMAC algorithms (byte0=x20)      @A2A           
SMF_119SSH_MAC_MD5_E       EQU X'2002' - HMAC-MD5-ETM@O.C        @A2A           
SMF_119SSH_MAC_SHA1_E      EQU X'2003' - HMAC-SHA1-ETM@O.C       @A2A           
SMF_119SSH_MAC_64OPENSSH_E EQU X'2004' - UMAC-64-ETM@O.C         @A2A           
SMF_119SSH_MAC_RIPEMD160_E EQU X'2005' - HMAC-RIPEMD160ETM@O.C   @A2A           
SMF_119SSH_MAC_SHA1_96_E   EQU X'2006' - HMAC-SHA1-96-ETM@O.C    @A2A           
SMF_119SSH_MAC_MD5_96_E    EQU X'2007' - HMAC-MD5-96-ETM@O.C     @A2A           
SMF_119SSH_MAC_SHA2_256_E  EQU X'2009' - HMAC-SHA2-256-ETM@O.C   @A2A           
SMF_119SSH_MAC_SHA2_512_E  EQU X'200A' - HMAC-SHA2-512-ETM@O.C   @A2A           
SMF_119SSH_MAC_128OPENSSH_E EQU X'200B' - UMAC-128-ETM@O.C       @A2A           
*  -etm@openssh.com variants of HMAC algorithms (with ICSF):     @A2A           
SMF_119SSH_MAC_MD5_EI      EQU X'3002' - HMAC-MD5-ETM@O.C (I)    @A2A           
SMF_119SSH_MAC_SHA1_EI     EQU X'3003' - HMAC-SHA1-ETM@O.C (I)   @A2A           
SMF_119SSH_MAC_RPMD160_EI  EQU X'3005' - HMAC-RIPEMD160ETM@O.C(I)@A2A           
SMF_119SSH_MAC_SHA1_96_EI  EQU X'3006' - HMAC-SHA1-96-ETM@O.C(I) @A2A           
SMF_119SSH_MAC_MD5_96_EI   EQU X'3007' - HMAC-MD5-96-ETM@O.C (I) @A2A           
SMF_119SSH_MAC_SHA2_256_EI EQU X'3009' - HMAC-SHA2-256-ETM@O.C(I)@A2A           
SMF_119SSH_MAC_SHA2_512_EI EQU X'300A' - HMAC-SHA2-512-ETM@O.C(I)@A2A           
*  CPACF enabled and -ETM HMAC algorithms (byte0=x60)            @A6A           
SMF_119SSH_MAC_SHA1_EC     EQU X'6003' - HMAC-SHA1-ETM@O.C (C)   @A6A           
SMF_119SSH_MAC_SHA1_96_EC  EQU X'6006' - HMAC-SHA1-96-ETM@O.C(C) @A6A           
SMF_119SSH_MAC_SHA2_256_EC EQU X'6009' - HMAC-SHA2-256-ETM@O.C(C)@A6A           
SMF_119SSH_MAC_SHA2_512_EC EQU X'600A' - HMAC-SHA2-512-ETM@O.C(C)@A6A           
*                                                                               
SMF_119SSH_Comp          DS BL2     Compression method being used               
SMF_119SSH_CompUnknown     EQU X'0000' - Unknown                                
SMF_119SSH_CompNone        EQU X'0001' - None (no)                              
SMF_119SSH_CompZlib        EQU X'0002' - zlib (yes)                             
SMF_119SSH_CompZlibOpenSSH EQU X'0003' - zlib@openssh.com (delayed)             
SMF_119SSH_AuthMethod2   DS BL2          If not 0, the last      @A2A           
*                                   additional Auth method used  @A2A           
SMF_119SSH_FIPSMODE      DS BL2     Running in FIPS mode         @A4A           
SMF_119SSH_FIPSMODE_Disabled EQU X'0000' - Not running in FIPS mode             
SMF_119SSH_FIPSMODE_Enabled  EQU X'0001' - Running in FIPS       @A4A           
SMF_119SSH_KexMethod     DS BL2     Key exchange method          @A4A           
SMF_119SSH_KexMethod_Unknown    EQU X'0000'                      @A4A           
*                               Key exchange method unknown      @A4A           
SMF_119SSH_KexMethod_None       EQU X'0001'                      @A4A           
*                               Key exchange method None         @A4A           
SMF_119SSH_KexMethod_DHGESHA256 EQU X'0002'                      @A4A           
*                             diffie-hellman-group-exchange-sha256              
SMF_119SSH_KexMethod_DHGESHA1   EQU X'0003'                      @A4A           
*                             diffie-hellman-group-exchange-sha1 @A4A           
SMF_119SSH_KexMethod_DHG14SHA1  EQU X'0004'                      @A4A           
*                             diffie-hellman-group14-sha1        @A4A           
SMF_119SSH_KexMethod_DHG1SHA1   EQU X'0005'                      @A4A           
*                             diffie-hellman-group1-sha1         @A4A           
SMF_119SSH_KexMethod_ECDHSHA2NP256 EQU X'0006'                   @A4A           
*                             ecdh-sha2-nistp256                 @A4A           
SMF_119SSH_KexMethod_ECDHSHA2NP384 EQU X'0007'                   @A4A           
*                             ecdh-sha2-nistp384                 @A4A           
SMF_119SSH_KexMethod_ECDHSHA2NP521 EQU X'0008'                   @A4A           
*                             ecdh-sha2-nistp521                 @A4A           
SMF_119SSH_KexMethod_GSSGROUP1SHA1 EQU X'0009'                   @A4A           
*                             gss-group1-sha1-                   @A4A           
SMF_119SSH_KexMethod_GSSGROUP14SHA1    EQU X'000A'               @A4A           
*                             gss-group14-sha1-                  @A4A           
SMF_119SSH_KexMethod_GSSGEXSHA1       EQU X'000B'                @A4A           
*                             gss-gex-sha1-                      @A4A           
SMF_119SSH_KexMethod_DHG14SHA256   EQU X'000C'                   @A7A           
*                             diffie-hellman-group14-sha256      @A7A           
SMF_119SSH_KexMethod_DHG16SHA512   EQU X'000D'                   @A7A           
*                             diffie-hellman-group16-sha512      @A7A           
SMF_119SSH_KexMethod_DHG18SHA512   EQU X'000E'                   @A7A           
*                             diffie-hellman-group18-sha512      @A7A           
SMF_119SSH_KexMethod_C25519SHA256  EQU X'000F'                   @A7A           
*                             curve25519-sha256                  @A7A           
SMF_119SSH_KexMethod_DHGESHA256_I  EQU X'1002'                   @A4A           
*                             diffie-hellman-group-exchange-sha256 ICSF         
SMF_119SSH_KexMethod_DHGESHA1_I    EQU X'1003'                                  
*                             diffie-hellman-group-exchange-sha1   ICSF         
SMF_119SSH_KexMethod_DHG14SHA1_I   EQU X'1004'                                  
*                             diffie-hellman-group14-sha1          ICSF         
SMF_119SSH_KexMethod_DHG1SHA1_I    EQU X'1005'                                  
*                             diffie-hellman-group1-sha1           ICSF         
SMF_119SSH_KexMethod_ECDHSHA2NP256_I EQU X'1006'                                
*                             ecdh-sha2-nistp256            ICSF @A4A           
SMF_119SSH_KexMethod_ECDHSHA2NP384_I EQU X'1007'                 @A4A           
*                             ecdh-sha2-nistp384            ICSF @A4A           
SMF_119SSH_KexMethod_ECDHSHA2NP521_I EQU X'1008'                 @A4A           
*                             ecdh-sha2-nistp521            ICSF @A4A           
SMF_119SSH_KexMethod_GSSGROUP1SHA1_I EQU X'1009'                 @A4A           
*                             gss-group1-sha1-              ICSF @A4A           
SMF_119SSH_KexMethod_GSSGROUP14SHA1_I EQU X'100A'                @A4A           
*                             gss-group14-sha1-             ICSF @A4A           
SMF_119SSH_KexMethod_GSSGEXSHA1_I       EQU X'100B'              @A4A           
*                             gss-gex-sha1-                 ICSF @A4A           
*                                                                               
* Security Protocol version definitions                                         
*                                                                               
SMF_119SSH_ProtoVDefs   DSECT                                                   
SMF_119SSH_ProtoVSSHV1    DC C'SSHV1   '                                        
SMF_119SSH_ProtoVSSHV2    DC C'SSHV2   '                                        
*                                                                               
*---------------------------------------------------------------------*         
*                                                                               
* SFTP/SCP Server Transfer Completion section (Subtype 96)                      
*                                                                               
SMF_119SSH_FS DSECT                                                             
SMF_119SSH_FSOper       DS  BL1     SFTP/SCP Server Operation                   
SMF_119SSH_FSOperRMD     EQU X'01'    - Rmdir                                   
SMF_119SSH_FSOperRM      EQU X'02'    - Rm                                      
SMF_119SSH_FSOperRENM    EQU X'03'    - Rename                                  
SMF_119SSH_FSOperGET     EQU X'04'    - Get                                     
SMF_119SSH_FSOperPUT     EQU X'05'    - Put                                     
SMF_119SSH_FSOperCHMD    EQU X'06'    - Chmod                                   
SMF_119SSH_FSOperCHOW    EQU X'07'    - Chown/Chgrp                             
SMF_119SSH_FSOperMKD     EQU X'08'    - Mkdir                                   
SMF_119SSH_FSOperSLNK    EQU X'09'    - Symlink                                 
SMF_119SSH_FSRsvd       DS  CL3'0'  Reserved                                    
SMF_119SSH_FSCmd        DS  CL4     SFTP/SCP server subcommand                  
SMF_119SSH_FSRIP        DS  BL16    Remote IP address - client (IPv6)           
      ORG SMF_119SSH_FSRIP                                                      
SMF_119SSH_FSRIPRsvd    DS  CL12    unused if IPv4 address supplied             
      ORG SMF_119SSH_FSRIPRsvd                                                  
SMF_119SSH_FSRIPRsvd10  DS  CL10                                                
SMF_119SSH_FSRIPFmt     DS  CL2     IPv4 address flagging                       
SMF_119SSH_FSRIP_IPv4   DS  BL4     Remote IP address, IPv4 format              
SMF_119SSH_FSLIP        DS  BL16    Local IP address - server (IPv6)            
      ORG SMF_119SSH_FSLIP                                                      
SMF_119SSH_FSLIPRsvd    DS  CL12    unused if IPv4 address supplied             
      ORG SMF_119SSH_FSLIPRsvd                                                  
SMF_119SSH_FSLIPRsvd10  DS  CL10                                                
SMF_119SSH_FSLIPFmt     DS  CL2     IPv4 address flagging                       
SMF_119SSH_FSLIP_IPv4   DS  BL4     Local IP address, IPv4 format               
SMF_119SSH_FSRPort      DS  BL2     Remote port number - client                 
SMF_119SSH_FSLPort      DS  BL2     Local port number - server                  
SMF_119SSH_FSSUser      DS  CL8     Client User ID on server                    
SMF_119SSH_FSTType      DS  CL1     Data transfer type                          
SMF_119SSH_FSTTypeASCII  EQU C'A'   - ASCII                                     
SMF_119SSH_FSTTypeBinary EQU C'B'   - Binary                                    
SMF_119SSH_FSMode       DS  CL1     Transfer mode                               
SMF_119SSH_FSModeCmpress EQU C'C'   - Compressed                                
SMF_119SSH_FSModeStream  EQU C'S'   - Stream                                    
SMF_119SSH_FSReserved   DS  BL2     Reserved                                    
SMF_119SSH_FSSTime      DS  BL4     Start time of transmission (UTC)            
SMF_119SSH_FSSDate      DS  PL4     Start date of transmission                  
SMF_119SSH_FSETime      DS  BL4     End time of transmission (UTC)              
SMF_119SSH_FSEDate      DS  PL4     End date of transmission                    
SMF_119SSH_FSDur        DS  BL4     Duration of transmission (1/100 s)          
SMF_119SSH_FSBytes      DS  BL8     Bytes transmitted (64-bit)                  
SMF_119SSH_FSStat       DS  CL4     Server execution status                     
SMF_119SSH_FSCH1        DS  BL8     Old permissions or UID                      
SMF_119SSH_FSGP1        DS  BL8     Old GID for chown/chgrp                     
SMF_119SSH_FSCH2        DS  BL8     New permissions or UID                      
SMF_119SSH_FSGP2        DS  BL8     New GID for chown/chgrp                     
SMF119SSHFSLN  EQU *-SMF_119SSH_FS                                              
*                                                                               
* SFTP/SCP server subcommand definitions                                        
*                                                                               
SMF_119SSH_FSCmdDefs    DSECT                                                   
SMF_119SSH_FSCmdRMD       DC C'RMD '    - Rmdir                                 
SMF_119SSH_FSCmdRM        DC C'RM  '    - Rm                                    
SMF_119SSH_FSCmdRENM      DC C'RENM'    - Rename                                
SMF_119SSH_FSCmdGET       DC C'GET '    - Get                                   
SMF_119SSH_FSCmdPUT       DC C'PUT '    - Put                                   
SMF_119SSH_FSCmdCHMD      DC C'CHMD'    - Chmod                                 
SMF_119SSH_FSCmdCHOW      DC C'CHOW'    - Chown/Chgrp                           
SMF_119SSH_FSCmdMKD       DC C'MKD '    - Mkdir                                 
SMF_119SSH_FSCmdSLNK      DC C'SLNK'    - Symlink                               
*                                                                               
* SFTP/SCP server execution status definitions                                  
*                                                                               
SMF_119SSH_FSStatDefs   DSECT                                                   
SMF_119SSH_FSStatOK       DC C'OK  '    - Success                               
SMF_119SSH_FSStatFAIL     DC C'FAIL'    - Failure                               
*                                                                               
* SFTP/SCP Server Transfer Completion Hostname section (subtype 96)             
*                                                                               
SMF_119SSH_FSHN DSECT                                                           
SMF_119SSH_FSHostname   DS  0C      Hostname                                    
*                                                                               
*                                                                               
* SFTP/SCP Server Transfer Completion First Associated Path Name                
* section (subtype 96)                                                          
*                                                                               
SMF_119SSH_FSA1 DSECT                                                           
SMF_119SSH_FSPath1      DS  0C      First associated path name                  
*                                                                               
*                                                                               
* SFTP/SCP Server Transfer Completion Second Associated Path Name               
* section (subtype 96)                                                          
*                                                                               
SMF_119SSH_FSA2 DSECT                                                           
SMF_119SSH_FSPath2      DS  0C      Second associated path name                 
*                                                                               
*---------------------------------------------------------------------*         
*                                                                               
* SFTP/SCP Client Transfer Completion record (subtype 97)                       
*                                                                               
SMF_119SSH_FC DSECT                                                             
SMF_119SSH_FCCmd        DS  CL4     SFTP/SCP client subcommand                  
SMF_119SSH_FCRIP        DS  BL16    Remote IP address - server (IPv6)           
      ORG SMF_119SSH_FCRIP                                                      
SMF_119SSH_FCRIPRsvd    DS  CL12    unused if IPv4 address supplied             
      ORG SMF_119SSH_FCRIPRsvd                                                  
SMF_119SSH_FCRIPRsvd10  DS  CL10                                                
SMF_119SSH_FCRIPFmt     DS  CL2     IPv4 address flagging                       
SMF_119SSH_FCRIP_IPv4   DS  BL4     Remote IP address, IPv4 format              
SMF_119SSH_FCLIP        DS  BL16    Local IP address - client (IPv6)            
      ORG SMF_119SSH_FCLIP                                                      
SMF_119SSH_FCLIPRsvd    DS  CL12    unused if IPv4 address supplied             
      ORG SMF_119SSH_FCLIPRsvd                                                  
SMF_119SSH_FCLIPRsvd10  DS  CL10                                                
SMF_119SSH_FCLIPFmt     DS  CL2     IPv4 address flagging                       
SMF_119SSH_FCLIP_IPv4   DS  BL4     Local IP address, IPv4 format               
SMF_119SSH_FCRPort      DS  BL2     Remote port number - server                 
SMF_119SSH_FCLPort      DS  BL2     Local port number - client                  
SMF_119SSH_FCLUser      DS  CL8     Local User ID                               
SMF_119SSH_FCTType      DS  CL1     Data format                                 
SMF_119SSH_FCTTypeASCII  EQU C'A'   - ASCII                                     
SMF_119SSH_FCTTypeBinary EQU C'B'   - Binary                                    
SMF_119SSH_FCMode       DS  CL1     Transfer mode                               
SMF_119SSH_FCModeCmpress EQU C'C'   - Compressed                                
SMF_119SSH_FCModeStream  EQU C'S'   - Stream                                    
SMF_119SSH_FCFlags      DS  BL2     Flags                         @A2C          
SMF_119SSH_FCFlagREGET   EQU X'0001'  - sftp reget or get -a      @A2A          
SMF_119SSH_FCFlagRESRVD  EQU X'FFFE'  - reserver flags            @A2A          
SMF_119SSH_FCSTime      DS  BL4     Start time of transmission (UTC)            
SMF_119SSH_FCSDate      DS  PL4     Start date of transmission                  
SMF_119SSH_FCETime      DS  BL4     End time of transmission (UTC)              
SMF_119SSH_FCEDate      DS  PL4     End date of transmission                    
SMF_119SSH_FCDur        DS  BL4     Duration of transmission (1/100 s)          
SMF_119SSH_FCBytes      DS  BL8     Bytes transmitted (64-bit)                  
SMF_119SSH_FCStat       DS  CL4     Subcommand execution status                 
SMF119SSHFCLN  EQU *-SMF_119SSH_FC                                              
*                                                                               
* SFTP/SCP client subcommand definitions                                        
*                                                                               
SMF_119SSH_FCCmdDefs    DSECT                                                   
SMF_119SSH_FCCmdGET       DC C'GET '    - Get                                   
SMF_119SSH_FCCmdPUT       DC C'PUT '    - Put                                   
*                                                                               
*                                                                               
* SFTP/SCP subcommand execution status definitions                              
*                                                                               
SMF_119SSH_FCStatDefs   DSECT                                                   
SMF_119SSH_FCStatOK       DC C'OK  '  - Success                                 
SMF_119SSH_FCStatFAIL     DC C'FAIL'  - Failure                                 
*                                                                               
* SFTP/SCP Client Transfer Completion Hostname section (subtype 97)             
*                                                                               
SMF_119SSH_FCHN DSECT                                                           
SMF_119SSH_FCHostname   DS  0C      Hostname                                    
*                                                                               
* SFTP/SCP Client Transfer Completion user name section                         
* (Subtype 97)                                                                  
*                                                                               
SMF_119SSH_FCUI DSECT                                                           
SMF_119SSH_FCIUserID    DS  0C      User ID used to log into server             
*                                                                               
* SFTP/SCP Client Transfer Completion Associated Path Name                      
* (Subtype 97)                                                                  
*                                                                               
SMF_119SSH_FCAN DSECT                                                           
SMF_119SSH_FCPath       DS  0C      Associate Path Name                         
*                                                                               
*                                                                               
* SFTP Client Transfer Completion Target Path Name                @A2A          
* (Subtype 97)                                                    @A2A          
*                                                                 @A2A          
SMF_119SSH_FCAN2 DSECT                                            @A2A          
SMF_119SSH_FCPath2      DS  0C      SFTP Target Path Name         @A2A          
*                                                                               
*---------------------------------------------------------------------*         
*                                                                               
* SSH Login / Failure record (subtype 94, 95, 98)                 @A8C          
*                                                                               
SMF_119SSH_LF DSECT                                                             
SMF_119SSH_LFRIP        DS  BL16    Remote IP address - client (IPv6)           
      ORG SMF_119SSH_LFRIP                                                      
SMF_119SSH_LFRIPRsvd    DS  CL12    unused if IPv4 address supplied             
      ORG SMF_119SSH_LFRIPRsvd                                                  
SMF_119SSH_LFRIPRsvd10  DS  CL10                                                
SMF_119SSH_LFRIPFmt     DS  CL2     IPv4 address flagging                       
SMF_119SSH_LFRIP_IPv4   DS  BL4     Remote IP address, IPv4 format              
SMF_119SSH_LFLIP        DS  BL16    Local IP address - server (IPv6)            
      ORG SMF_119SSH_LFLIP                                                      
SMF_119SSH_LFLIPRsvd    DS  CL12    unused if IPv4 address supplied             
      ORG SMF_119SSH_LFLIPRsvd                                                  
SMF_119SSH_LFLIPRsvd10  DS  CL10                                                
SMF_119SSH_LFLIPFmt     DS  CL2     IPv4 address flagging                       
SMF_119SSH_LFLIP_IPv4   DS  BL4     Local IP address, IPv4 format               
SMF_119SSH_LFRPort      DS  BL2     Remote port number - client                 
SMF_119SSH_LFLPort      DS  BL2     Local port number - server                  
SMF_119SSH_LFUserID     DS  CL8     User ID received by / sent to @A8C          
*                                   server                        @A8C          
SMF_119SSH_LFReason     DS  BL2     Login failure reason                        
*                                   (subtype 98 only)             @A8C          
SMF_119SSH_LFReasonUnexpect EQU X'0000' - Unexpected auth fail                  
SMF_119SSH_LFReasonAuthChg  EQU X'0001' - Unexpected auth change                
SMF_119SSH_LFReasonInvalid  EQU X'0002' - Password is not valid                 
SMF_119SSH_LFReasonRevoked  EQU X'0003' - User ID has been revoked              
SMF_119SSH_LFReasonNoAccess EQU X'0004' - User does not have srv access         
SMF_119SSH_LFReasonBadMode  EQU X'0005' - Bad file modes or ownership           
SMF_119SSH_LFReasonExcess   EQU X'0006' - Too many failed login attempt         
SMF_119SSH_LFReasonError    EQU X'0007' - Password error                        
SMF_119SSH_LFReasonUnknown  EQU X'0008' - User ID is unknown                    
SMF_119SSH_LFReasonNoRoot   EQU X'0009' - No root user auth                     
SMF_119SSH_LFReasonNoEmpty  EQU X'000A' - No empty passwords                    
SMF_119SSH_LFReasonMethod   EQU X'000B' - No/bad auth method                    
SMF_119SSH_LFReasonKey      EQU X'000C' - No/bad key found                      
SMF_119SSH_LFReasonHost     EQU X'000D' - No/bad host found                     
SMF_119SSH_LFReasonHostKeyRevoked EQU X'000E' - Revoked host key  @A2A          
SMF_119SSH_LFReasonKeyLength      EQU X'000F' - Bad key length    @A4A          
SMF_119SSH_LFRsvd2      DS  BL2'0'  Reserved                                    
SMF119SSHFFLN  EQU *-SMF_119SSH_LF                                              
*                                                                               
.M030000 ANOP                                                                   
        MEND       */                                                           
*%FOT772: ;                                                                     
*                                                                               
*                                                                               
*/********************************************************************/         
*/*                                                                  */         
*/* Mapping for the Common SMF record header that is part of all     */         
*/* TCP/IP SMF records. The only fields that need to be set by the   */         
*/* SMF processing are the Length, Flags, Type, and Subtype values.  */         
*/* The rest are filled in by MVS SMF processing.                    */         
*/*                                                                  */         
*/********************************************************************/         
*                                                                               
*Declare                                                                        
*1 SMF_119SSH_Header  Based BDY(WORD), /* Header overlay             */         
*  3 SMF_119SSH_HDLength    Fixed(15), /* Length of record           */         
*  3 SMF_119SSH_HDSegDesc   Fixed(15), /* Segment Descriptor         */         
*  3 SMF_119SSH_HDFlags     BIT(8),    /* System Indicator           */         
*    5 *                    BIT(1),    /* Reserved                   */         
*    5 SMF_119SSH_HDSub     BIT(1),    /* Subtypes are valid.        */         
*    5 *                    BIT(1),    /* Reserved                   */         
*    5 SMF_119SSH_HDSP4     BIT(1),    /* MVS/SP Version 4 and above */         
*    5 SMF_119SSH_HDSP3     BIT(1),    /* MVS/SP Version 3 and above */         
*    5 SMF_119SSH_HDSP2     BIT(1),    /* MVS/SP Version 2 and above */         
*    5 SMF_119SSH_HDVS2     BIT(1),    /* MVS/VS2                    */         
*    5 *                    BIT(1),    /* Reserved                   */         
*  3 SMF_119SSH_HDType      Fixed(8),  /* Record type number is 119,            
*                                         or hex 77.                 */         
*  3 SMF_119SSH_HDTime      Fixed(31)  BDY(HWORD),                              
*                 /* TOD, Using format from TIME macro with BINARY   */         
*  3 SMF_119SSH_HDDate      Char(4),   /* DATE format  CCYYDDDS      */         
*  3 SMF_119SSH_HDSID       Char(4),   /* SYSTEM Id from Installation*/         
*  3 SMF_119SSH_HDSSI       Char(4),   /* Subsystem identification   */         
*  3 SMF_119SSH_HDSubType   Fixed(16), /* SMF sub type field         */         
*  3 SMF_119SSH_HDEnd       Char(0);   /* End of header mapping      */         
*                                                                               
*/********************************************************************/         
*/* Constants for SMF_119SSH_HDType Field                            */         
*/********************************************************************/         
*Declare                                                                        
*  SMF_119SSH_Type          Fixed(8) CONSTANT(119);                             
*                                                                               
*/********************************************************************/         
*/* Constants for SMF_119SSH_HDFlags Field                           */         
*/********************************************************************/         
*Declare                                                                        
*  SMF_119SSH_FlagsValue    BIT(8) CONSTANT('50'X); /* Subtypes are             
*                                      valid and MVS V4 and above    */         
*                                                                               
*/********************************************************************/         
*/* Constants for SMF_119SSH_HDSubType field                         */         
*/********************************************************************/         
*                                                                               
*Declare                                                                        
* SMF_119SSH_HDST_CliConnStart Fixed   Constant(005Ex),       /* @A2A*/         
* SMF_119SSH_HDST_SvrConnStart Fixed   Constant(005Fx),       /* @A2A*/         
* SMF_119SSH_HDST_SSHServer Fixed      Constant(0060x),                         
* SMF_119SSH_HDST_SSHClient Fixed      Constant(0061x),                         
* SMF_119SSH_HDST_SrvLoginF Fixed      Constant(0062x);                         
*                                                                               
*/********************************************************************/         
*/*                                                                  */         
*/* Self Defining section, basic level.  All records will have at    */         
*/* least two triplets, one for the TCP/IP Identification section    */         
*/* and one for a record specific section                            */         
*/*                                                                  */         
*/********************************************************************/         
*                                                                               
*Declare                                                                        
*1 SMF_119SSH_SDefSect      Based(ADDR(SMF_119SSH_HDEnd)),                      
*  3 SMF_119SSH_SD_TRN      Fixed(16), /* Number of triplets         */         
*  3 SMF_119SSH_SDrsvd      Fixed(16), /* Unused, available          */         
*                                                                               
*  /* The first triplet points to the TCP/IP Common Stack            */         
*  /* Identification section used by all Type 119 records.           */         
*                                                                               
*  3 SMF_119SSH_IDOff       Fixed(32), /* Offset to TCP/IP Ident     */         
*  3 SMF_119SSH_IDLen       Fixed(16), /* Length of TCP/IP Ident     */         
*  3 SMF_119SSH_IDNum       Fixed(16), /* Number of TCP/IP Ident     */         
*                                                                               
*  /* The next triplet defines the first of the record specific      */         
*  /* sections for a given record.                                   */         
*                                                                               
*  3 SMF_119SSH_S1Off       Fixed(32), /* Offset to first section    */         
*  3 SMF_119SSH_S1Len       Fixed(16), /* Length of first section    */         
*  3 SMF_119SSH_S1Num       Fixed(16), /* Number of sections         */         
*  3 SMF_119SSH_S1End       Char(0);   /* End of of first section    */         
*                                                                               
* /* The next mapping extends the self defining section to have an   */         
* /* additional (third) triplet, counting the Common Stack section.  */         
*                                                                               
* Declare                                                                       
*1 SMF_119SSH_SD3Triplets   Based(ADDR(SMF_119SSH_S1End)),                      
*  3 SMF_119SSH_S2Off       Fixed(32), /* Offset to second section   */         
*  3 SMF_119SSH_S2Len       Fixed(16), /* Length of second section   */         
*  3 SMF_119SSH_S2Num       Fixed(16), /* Number of sections         */         
*  3 SMF_119SSH_S2End       Char(0);   /* End of of second section   */         
*                                                                               
* /* The next mapping extends the self defining section to have an   */         
* /* additional (fourth) triplet, counting the Common Stack section. */         
*                                                                               
*Declare                                                                        
*1 SMF_119SSH_SD4Triplets   Based(ADDR(SMF_119SSH_S2End)),                      
*  3 SMF_119SSH_S3Off       Fixed(32), /* Offset to third section    */         
*  3 SMF_119SSH_S3Len       Fixed(16), /* Length of third section    */         
*  3 SMF_119SSH_S3Num       Fixed(16), /* Number of sections         */         
*  3 SMF_119SSH_S3End       Char(0);   /* End of of third section    */         
*                                                                               
* /* The next mapping extends the self defining section to have an   */         
* /* additional (fifth) triplet, counting the Common Stack section.  */         
*                                                                               
*Declare                                                                        
*1 SMF_119SSH_SD5Triplets   Based(ADDR(SMF_119SSH_S3End)),                      
*  3 SMF_119SSH_S4Off       Fixed(32), /* Offset to fourth section   */         
*  3 SMF_119SSH_S4Len       Fixed(16), /* Length of fourth section   */         
*  3 SMF_119SSH_S4Num       Fixed(16), /* Number of sections         */         
*  3 SMF_119SSH_S4End       Char(0);   /* End of of fourth section   */         
*                                                                               
* /* The next mapping extends the self defining section to have an   */         
* /* additional (sixth) triplet, counting the Common Stack section.  */         
*                                                                               
*Declare                                                                        
*1 SMF_119SSH_SD6Triplets   Based(ADDR(SMF_119SSH_S4End)),                      
*  3 SMF_119SSH_S5Off       Fixed(32), /* Offset to fifth section    */         
*  3 SMF_119SSH_S5Len       Fixed(16), /* Length of fifth section    */         
*  3 SMF_119SSH_S5Num       Fixed(16), /* Number of sections         */         
*  3 SMF_119SSH_S5End       Char(0);   /* End of of fifth section    */         
*                                                                               
* /* The next mapping extends the self defining section to have an   */         
* /* additional (seventh) triplet, counting the Common Stack         */         
* /* section.                                                    @A2A*/         
*                                                                               
*Declare                                                                        
*1 SMF_119SSH_SD7Triplets  Based(ADDR(SMF_119SSH_S5End)),  /*    @A2A*/         
*  3 SMF_119SSH_S6Off      Fixed(32), /* Offset to sixth section @A2A*/         
*  3 SMF_119SSH_S6Len      Fixed(16), /* Length of sixth section @A2A*/         
*  3 SMF_119SSH_S6Num      Fixed(16), /* Number of sections      @A2A*/         
*  3 SMF_119SSH_S6End      Char(0);   /* End of of sixth section @A2A*/         
*                                                                               
*                                                                               
*/*------------------------------------------------------------------*/         
* /* Mapping of a triplet in the Self-defining section               */         
*                                                                               
*Declare                                                                        
*1 SMF_119SSH_SDTriplet     Based,                                              
*  3 SMF_119SSH_Off         Fixed(32), /* Offset of section          */         
*  3 SMF_119SSH_Len         Fixed(16), /* Length of section          */         
*  3 SMF_119SSH_Num         Fixed(16), /* Number of sections         */         
*  3 SMF_119SSH_End         Char(0);   /* End of triplet             */         
*                                                                               
*                                                                               
*/********************************************************************/         
*/*                                                                  */         
*/* Mapping for the TCP/IP Common Stack Identification Section that  */         
*/* is included in all TCP/IP Type 119 SMF records. The section is   */         
*/* the first one included in the record, after the last of the      */         
*/* self defining triplets.                                          */         
*/*                                                                  */         
*/********************************************************************/         
*                                                                               
*Declare                                                                        
*1 SMF_119SSH_Ident Based,                                                      
*  3 SMF_119SSH_TI_SYSName  Char(8),  /* System name                */          
*  3 SMF_119SSH_TI_SysplexName Char(8),/* Sysplex name              */          
*  3 SMF_119SSH_TI_Stack    Char(8),  /* Stack name                 */          
*  3 SMF_119SSH_TI_ReleaseID Char(8), /* CS/390 release identifier  */          
*  3 SMF_119SSH_TI_Comp     Char(8),  /* OpenSSH subcomponent       */          
*  3 SMF_119SSH_TI_ASName   Char(8),  /* Address space name of write*/          
*  3 SMF_119SSH_TI_UserID   Char(8),  /* User ID of security context*/          
*  3 SMF_119SSH_TI_Reserved Fixed(16),/* Reserved                   */          
*  3 SMF_119SSH_TI_ASID     Fixed(16),/* ASID of writer             */          
*  3 SMF_119SSH_TI_Reason   Fixed(8), /* Reason for writing record  */          
*  3 SMF_119SSH_TI_RecordID Fixed(8), /* ID value used for          */          
*                                     /* correlating records        */          
*  3 SMF_119SSH_TI_rsvd     Fixed(16),/* Padding, available         */          
*  3 SMF_119SSH_TI_End      Char(0);  /* End of section mapping     */          
*                                                                               
*/********************************************************************/         
*/* Constants for SMF_119SSH_TI_Comp field                           */         
*/********************************************************************/         
*                                                                               
*Declare                                                                        
* SMF_119SSH_TI_CompSFTPS    Char(8) Constant('SFTPS   '),                      
* SMF_119SSH_TI_CompSFTPC    Char(8) Constant('SFTPC   '),                      
* SMF_119SSH_TI_CompSCPS     Char(8) Constant('SCPS    '),                      
* SMF_119SSH_TI_CompSCPC     Char(8) Constant('SCPC    '),                      
* SMF_119SSH_TI_CompSSHD     Char(8) Constant('SSHD    ');                      
* SMF_119SSH_TI_CompSSH      Char(8) Constant('SSH     '); /*    @A2A*/         
*                                                                               
*/*------------------------------------------------------------------*/         
*                                                                               
*/********************************************************************/         
*/* Security Information section, common to all records              */         
*/********************************************************************/         
*                                                                               
*Declare                                                                        
*1 SMF_119SSH_SEC           Based,                                              
*  3 SMF_119SSH_SSHV        Char(16),  /* OpenSSH version            */         
*  3 SMF_119SSH_SSLV        Char(32),  /* OpenSSL version            */         
*  3 SMF_119SSH_ZlibV       Char(16),  /* zlib version               */         
*  3 SMF_119SSH_AuthMethod  Char(1),   /* Authentication method      */         
*  3 SMF_119SSH_Reserved    Char(1),   /* Reserved                   */         
*  3 SMF_119SSH_Cipher      Fixed(16), /* Cipher type being used     */         
*  3 SMF_119SSH_MAC         Fixed(16), /* MAC algorithm being used   */         
*  3 SMF_119SSH_Comp        Fixed(16), /* Compression method  used   */         
*  3 SMF_119SSH_AuthMethod2 Fixed(16), /* If not 0, the last     @A2A*/         
*                                /* additional Auth method used  @A2A*/         
*  3 SMF_119SSH_FIPSMODE    Fixed(16), /* Running in FIPS mode   @A4A*/         
*  3 SMF_119SSH_KexMethod   Fixed(16); /* Key exchange method    @A4A*/         
*/********************************************************************/         
*/* Constants for SMF_119SSH_SSHV  field                             */         
*/* Security Protocol version definitions                            */         
*/********************************************************************/         
*                                                                               
*Declare                                                                        
* SMF_119SSH_ProtoVSSHV1    Char(*) Constant('SSHV1   '),                       
* SMF_119SSH_ProtoVSSHV2    Char(*) Constant('SSHV2   ');                       
*                                                                               
*/********************************************************************/         
*/* Constants for SMF_119SSH_AuthMethod  field                       */         
*/********************************************************************/         
*                                                                               
*Declare                                                                        
* SMF_119SSH_AuthMethUnknown Fixed Constant(0000x), /* Unknown       */         
* SMF_119SSH_AuthMethNone    Fixed Constant(0001x), /* None          */         
* SMF_119SSH_AuthMethPwd     Fixed Constant(0002x), /* Password      */         
* SMF_119SSH_AuthMethPubkey  Fixed Constant(0003x), /* Publickey     */         
* SMF_119SSH_AuthMethHost    Fixed Constant(0004x), /* HostBased     */         
* SMF_119SSH_AuthMethRhosts  Fixed Constant(0005x), /* Rhosts        */         
* SMF_119SSH_AuthMethRhstRSA Fixed Constant(0006x), /* RhostsRSA     */         
* SMF_119SSH_AuthMethRSA     Fixed Constant(0007x), /* RSA           */         
* SMF_119SSH_AuthMethKeybInt Fixed Constant(0008x),                             
*                                             /* Keyboard-interactive*/         
* SMF_119SSH_AuthMethChalRsp Fixed Constant(0009x),                             
*                                             /* Challenge response  */         
* SMF_119SSH_AuthMethCtlSock Fixed Constant(000Ax), /* Control socket*/         
* SMF_119SSH_AuthMethGssMic  Fixed Constant(000Bx), /* GSSAPI w/ MIC */         
* SMF_119SSH_AuthMethGssKeyex Fixed Constant(000Cx); /*GSSAPI w/Keyex*/         
*                                                                               
*                                                                               
*/********************************************************************/         
*/* Constants for SMF_119SSH_Cipher  field                           */         
*/********************************************************************/         
*                                                                               
*Declare                                                                        
* SMF_119SSH_CipherUNKNOWN   Fixed Constant(0000x), /* Unknown       */         
* SMF_119SSH_CipherNONE      Fixed Constant(0001x), /* None          */         
* SMF_119SSH_Cipher3DES      Fixed Constant(0002x), /* 3DES          */         
* SMF_119SSH_CipherBLOWFISH  Fixed Constant(0003x), /* BLOWFISH      */         
* SMF_119SSH_CipherDES       Fixed Constant(0004x), /* DES           */         
* SMF_119SSH_Cipher3DES_CBC  Fixed Constant(0005x), /* 3DES-CBC      */         
* SMF_119SSH_CipherBLFISHCBC Fixed Constant(0006x), /* BLOWFISH-CBC  */         
* SMF_119SSH_CipherCAST128CB Fixed Constant(0007x), /* CAST128-CBC   */         
* SMF_119SSH_CipherARCF128   Fixed Constant(0008x), /* ARCFOUR128    */         
* SMF_119SSH_CipherARCF256   Fixed Constant(0009x), /* ARCFOUR256    */         
* SMF_119SSH_CipherARCFOUR   Fixed Constant(000Ax), /* ARCFOUR       */         
* SMF_119SSH_CipherAES128CBC Fixed Constant(000Bx), /* AES128-CBC    */         
* SMF_119SSH_CipherAES192CBC Fixed Constant(000Cx), /* AES192-CBC    */         
* SMF_119SSH_CipherAES256CBC Fixed Constant(000Dx), /* AES256-CBC    */         
* SMF_119SSH_CipherAES128CTR Fixed Constant(000Ex), /* AES128-CTR    */         
* SMF_119SSH_CipherAES192CTR Fixed Constant(000Fx), /* AES192-CTR    */         
* SMF_119SSH_CipherAES256CTR Fixed Constant(0010x), /* AES256-CTR    */         
* SMF_119SSH_CipherRIJNDAEL  Fixed Constant(0011x),                             
*                                      /* RIJNDAEL-CBC@LYSATOR.LIU.SE*/         
* SMF_119SSH_CipherACSS      Fixed Constant(0012x),                             
*                                      /* ACSS@OPENSSH.ORG           */         
* SMF_119SSH_CipherAES128GCM Fixed Constant(0013x),                             
*                                      /* AES128-GCM@OPENSSH.COM @A2A*/         
* SMF_119SSH_CipherAES256GCM Fixed Constant(0014x),                             
*                                      /* AES256-GCM@OPENSSH.COM @A2A*/         
* SMF_119SSH_CipherCHACHAPOLY Fixed Constant(0015x),                            
*                               /* chacha20-poly1305@openssh.com @A7A*/         
* SMF_119SSH_Cipher3DES_CB_I Fixed Constant(1005x), /* 3DES-CBC I    */         
* SMF_119SSH_CipherBLFISHC_I Fixed Constant(1006x), /* BLOWFISH-CBC I*/         
* SMF_119SSH_CipherARCF128_I Fixed Constant(1008x), /* ARCFOUR128 I  */         
* SMF_119SSH_CipherARCF256_I Fixed Constant(1009x), /* ARCFOUR256 I  */         
* SMF_119SSH_CipherARCFOUR_I Fixed Constant(100Ax), /* ARCFOUR I     */         
* SMF_119SSH_CipherAES128C_I Fixed Constant(100Bx), /* AES128-CBC I  */         
* SMF_119SSH_CipherAES192C_I Fixed Constant(100Cx), /* AES192-CBC I  */         
* SMF_119SSH_CipherAES256C_I Fixed Constant(100Dx), /* AES256-CBC I  */         
* SMF_119SSH_CipherAES128T_I2 Fixed Constant(100Ex),                            
*                                      /* AES128-CTR (ICSF)      @A5A*/         
* SMF_119SSH_CipherAES192T_I2 Fixed Constant(100Fx),                            
*                                      /* AES192-CTR (ICSF)      @A5A*/         
* SMF_119SSH_CipherAES256T_I2 Fixed Constant(1010x),                            
*                                      /* AES256-CTR (ICSF)      @A5A*/         
* SMF_119SSH_CipherRIJNDAE_I Fixed Constant(1011x), /* RIJNDAEL-CBC I*/         
* SMF_119SSH_CipherAES128T_I Fixed Constant(1012x),                             
*                                      /* AES128-CTR (ICSF) DEPR @A5C*/         
* SMF_119SSH_CipherAES192T_I Fixed Constant(1013x),                             
*                                      /* AES192-CTR (ICSF) DEPR @A5C*/         
* SMF_119SSH_CipherAES256T_I Fixed Constant(1014x),                             
*                                      /* AES256-CTR (ICSF) DEPR @A5C*/         
* SMF_119SSH_Cipher3DES_CB_C Fixed Constant(4005x),                             
*                                           /* 3DES-CBC (CPACF) @A6A */         
* SMF_119SSH_CipherAES128C_C Fixed Constant(400Bx),                             
*                                         /* AES128-CBC (CPACF) @A6A */         
* SMF_119SSH_CipherAES192C_C Fixed Constant(400Cx),                             
*                                         /* AES192-CBC (CPACF) @A6A */         
* SMF_119SSH_CipherAES256C_C Fixed Constant(400Dx),                             
*                                         /* AES256-CBC (CPACF) @A6A */         
* SMF_119SSH_CipherAES128T_C Fixed Constant(400Ex),                             
*                                         /* AES128-CTR (CPACF) @A6A */         
* SMF_119SSH_CipherAES192T_C Fixed Constant(400Fx),                             
*                                         /* AES192-CTR (CPACF) @A6A */         
* SMF_119SSH_CipherAES256T_C Fixed Constant(4010x),                             
*                                         /* AES256-CTR (CPACF) @A6A */         
* SMF_119SSH_CipherRIJNDAE_C Fixed Constant(4011x);                             
*                        /* RIJNDAEL-CBC@LYSATOR.LIU.SE (CPACF) @A6A */         
*                                                                               
*/********************************************************************/         
*/* Constants for SMF_119SSH_MAC  field                              */         
*/********************************************************************/         
*                                                                               
*Declare                                                                        
* SMF_119SSH_MAC_Unknown   Fixed Constant(0000x), /* Unknown         */         
* SMF_119SSH_MAC_None      Fixed Constant(0001x), /* None (SSHV1)    */         
* SMF_119SSH_MAC_MD5       Fixed Constant(0002x), /* HMAC-MD5        */         
* SMF_119SSH_MAC_SHA1      Fixed Constant(0003x), /* HMAC-SHA1       */         
* SMF_119SSH_MAC_64OPENSSH Fixed Constant(0004x), /* UMAC-64@OPENSSH */         
* SMF_119SSH_MAC_RIPEMD160 Fixed Constant(0005x), /* HMAC-RIPEMD160  */         
* SMF_119SSH_MAC_SHA1_96   Fixed Constant(0006x), /* HMAC-SHA1-96    */         
* SMF_119SSH_MAC_MD5_96    Fixed Constant(0007x), /* HMAC-MD5-96     */         
* SMF_119SSH_MAC_RIPEMD160CM Fixed Constant(0008x),                             
*                                      /* HMAC-RIPEMD160@OPENSSH.COM */         
* SMF_119SSH_MAC_SHA2_256  Fixed Constant(0009x),                               
*                                      /* HMAC-SHA2_256          @A2A*/         
* SMF_119SSH_MAC_SHA2_512  Fixed Constant(000Ax),                               
*                                      /* HMAC-SHA2_512          @A2A*/         
* SMF_119SSH_MAC_128OPENSSH Fixed Constant(000Bx),                              
*                                      /* HMAC-128OPENSSH        @A2A*/         
* SMF_119SSH_MAC_MD5_I     Fixed Constant(1002x), /* HMAC-MD5 I      */         
* SMF_119SSH_MAC_SHA1_I    Fixed Constant(1003x), /* HMAC-SHA1 I     */         
* SMF_119SSH_MAC_RPMD160_I Fixed Constant(1005x), /* HMAC-RIPEMD160 I*/         
* SMF_119SSH_MAC_SHA1_96_I Fixed Constant(1006x), /* HMAC-SHA1-96 I  */         
* SMF_119SSH_MAC_MD5_96_I  Fixed Constant(1007x), /* HMAC-MD5-96 I   */         
* SMF_119SSH_MAC_RPMD160CM_I Fixed Constant(1008x),                             
*                                      /*HMAC-RIPEMD160@OPENSSH.COM I*/         
* SMF_119SSH_MAC_SHA2_256_I Fixed Constant(1009x),                              
*                                      /*HMAC-SHA2-256 (ICSF)    @A2A*/         
* SMF_119SSH_MAC_SHA2_512_I Fixed Constant(100Ax),                              
*                                      /*HMAC-SHA2-512 (ICSF)    @A2A*/         
* SMF_119SSH_MAC_SHA1_C Fixed Constant(4003x),                                  
*                                      /*HMAC-SHA1 (CPACF)    @A6A*/            
* SMF_119SSH_MAC_SHA1_96_C Fixed Constant(4006x),                               
*                                      /*HMAC-SHA1-96 (CPACF)   @A6A*/          
* SMF_119SSH_MAC_SHA2_256_C Fixed Constant(4009x),                              
*                                      /*HMAC-SHA2-256 (CPACF)    @A6A*/        
* SMF_119SSH_MAC_SHA2_512_C Fixed Constant(400Ax),                              
*                                      /*HMAC-SHA2-512 (CPACF)   @A6A*/         
* /* -etm@openssh.com variants of HMAC algorithms:               @A2A*/         
* SMF_119SSH_MAC_MD5_E      Fixed Constant(2002x),                              
*                                      /*HMAC-MD5-ETM@O.C        @A2A*/         
* SMF_119SSH_MAC_SHA1_E     Fixed Constant(2003x),                              
*                                      /*HMAC-SHA1-ETM@O.C       @A2A*/         
* SMF_119SSH_MAC_64OPENSSH_E Fixed Constant(2004x),                             
*                                      /*UMAC-64-ETM@O.C         @A2A*/         
* SMF_119SSH_MAC_RIPEMD160_E Fixed Constant(2005x),                             
*                                      /*HMAC-RIPEMD160ETM@O.C   @A2A*/         
* SMF_119SSH_MAC_SHA1_96_E  Fixed Constant(2006x),                              
*                                      /*HMAC-SHA1-96-ETM@O.C    @A2A*/         
* SMF_119SSH_MAC_MD5_96_E   Fixed Constant(2007x),                              
*                                      /*HMAC-MD5-96-ETM@O.C     @A2A*/         
* SMF_119SSH_MAC_SHA2_256_E Fixed Constant(2009x),                              
*                                      /*HMAC-SHA2-256-ETM@O.C   @A2A*/         
* SMF_119SSH_MAC_SHA2_512_E Fixed Constant(200Ax),                              
*                                      /*HMAC-SHA2-512-ETM@O.C   @A2A*/         
* SMF_119SSH_MAC_128OPENSSH_E Fixed Constant(200Bx),                            
*                                      /*UMAC-128-ETM@O.C        @A2A*/         
* /* -etm@openssh.com variants of HMAC algorithms (with ICSF):   @A2A*/         
* SMF_119SSH_MAC_MD5_EI Fixed Constant(3002x),                                  
*                                      /*HMAC-MD5-ETM@O.C (I)    @A2A*/         
* SMF_119SSH_MAC_SHA1_EI Fixed Constant(3003x),                                 
*                                      /*HMAC-SHA1-ETM@O.C (I)   @A2A*/         
* SMF_119SSH_MAC_RPMD160_EI Fixed Constant(3005x),                              
*                                      /*HMAC-RIPEMD160ETM@O.C(I)@A2A*/         
* SMF_119SSH_MAC_SHA1_96_EI Fixed Constant(3006x),                              
*                                      /*HMAC-SHA1-96-ETM@O.C(I) @A2A*/         
* SMF_119SSH_MAC_MD5_96_EI Fixed Constant(3007x),                               
*                                      /*HMAC-MD5-96-ETM@O.C (I) @A2A*/         
* SMF_119SSH_MAC_SHA2_256_EI Fixed Constant(3009x),                             
*                                      /*HMAC-SHA2-256-ETM@O.C(I)@A2A*/         
* SMF_119SSH_MAC_SHA2_512_EI Fixed Constant(300Ax),                             
*                                      /*HMAC-SHA2-512-ETM@O.C(I)@A2A*/         
* SMF_119SSH_MAC_SHA1_EC Fixed Constant(6003x),                                 
*                                      /*HMAC-SHA1-ETM@O.C (C)   @A6A*/         
* SMF_119SSH_MAC_SHA1_96_EC Fixed Constant(6006x),                              
*                                      /*HMAC-SHA1-96-ETM@O.C(C)   @A6A*/       
* SMF_119SSH_MAC_SHA2_256_EC Fixed Constant(6009x),                             
*                                      /*HMAC-SHA2-256-ETM@O.C(C)    @A6A*/     
* SMF_119SSH_MAC_SHA2_512_EC Fixed Constant(600Ax);                             
*                                      /*HMAC-SHA2-512-ETM@O.C(C)  @A6A*/       
*                                                                               
*/********************************************************************/         
*/* Constants for SMF_119SSH_Comp field                              */         
*/********************************************************************/         
*                                                                               
*Declare                                                                        
* SMF_119SSH_CompUnknown     Fixed Constant(0000x), /* Unknown       */         
* SMF_119SSH_CompNone        Fixed Constant(0001x), /* None (no)     */         
* SMF_119SSH_CompZlib        Fixed Constant(0002x), /* zlib (yes)    */         
* SMF_119SSH_CompZlibOpenSSH Fixed Constant(0003x);                             
*                                      /* zlib@openssh.com (delayed) */         
*                                                                               
*/********************************************************************/         
*/* Constants for SMF_119SSH_FIPSMODE field                     @A4A */         
*/********************************************************************/         
*                                                                               
*Declare                                                                        
* SMF_119SSH_FIPSMODE_Disabled    Fixed Constant(0000x),                        
*                                         /* Not running in FIPS mode*/         
* SMF_119SSH_FIPSMODE_Enabled     Fixed Constant(0001x);                        
*                                        /*      running in FIPS mode*/         
*                                                                               
*                                                                               
*/********************************************************************/         
*/* Constants for SMF_119SSH_KexMethod field                    @A4A */         
*/********************************************************************/         
*                                                                               
*Declare                                                                        
* SMF_119SSH_KexMethod_Unknown    Fixed Constant(0000x),                        
*                               /* Key exchange method unknown       */         
* SMF_119SSH_KexMethod_None       Fixed Constant(0001x),                        
*                               /* Key exchange method None          */         
* SMF_119SSH_KexMethod_DHGESHA256 Fixed Constant(0002x),                        
*                            /* diffie-hellman-group-exchange-sha256 */         
* SMF_119SSH_KexMethod_DHGESHA1   Fixed Constant(0003x),                        
*                            /* diffie-hellman-group-exchange-sha1   */         
* SMF_119SSH_KexMethod_DHG14SHA1  Fixed Constant(0004x),                        
*                            /* diffie-hellman-group14-sha1          */         
* SMF_119SSH_KexMethod_DHG1SHA1   Fixed Constant(0005x),                        
*                            /* diffie-hellman-group1-sha1           */         
* SMF_119SSH_KexMethod_ECDHSHA2NP256 Fixed Constant(0006x),                     
*                            /* ecdh-sha2-nistp256                   */         
* SMF_119SSH_KexMethod_ECDHSHA2NP384 Fixed Constant(0007x),                     
*                            /* ecdh-sha2-nistp384                   */         
* SMF_119SSH_KexMethod_ECDHSHA2NP521 Fixed Constant(0008x),                     
*                            /* ecdh-sha2-nistp521                   */         
* SMF_119SSH_KexMethod_GSSGROUP1SHA1 Fixed Constant(0009x),                     
*                            /* gss-group1-sha1-                     */         
* SMF_119SSH_KexMethod_GSSGROUP14SHA1    Fixed Constant(000Ax),                 
*                            /* gss-group14-sha1-                    */         
* SMF_119SSH_KexMethod_GSSGEXSHA1       Fixed Constant(000Bx),                  
*                            /* gss-gex-sha1-                        */         
* SMF_119SSH_KexMethod_DHG14SHA256   Fixed Constant(000Cx),                     
*                            /* diffie-hellman-group14-sha256    @A7A*/         
* SMF_119SSH_KexMethod_DHG16SHA512   Fixed Constant(000Dx),                     
*                            /* diffie-hellman-group16-sha512    @A7A*/         
* SMF_119SSH_KexMethod_DHG18SHA512   Fixed Constant(000Ex),                     
*                            /* diffie-hellman-group18-sha512    @A7A*/         
* SMF_119SSH_KexMethod_C25519SHA256  Fixed Constant(000Fx),                     
*                            /* curve25519-sha256                @A7A*/         
* SMF_119SSH_KexMethod_DHGESHA256_I  Fixed Constant(1002x),                     
*                       /* diffie-hellman-group-exchange-sha256 ICSF */         
* SMF_119SSH_KexMethod_DHGESHA1_I    Fixed Constant(1003x),                     
*                       /* diffie-hellman-group-exchange-sha1   ICSF */         
* SMF_119SSH_KexMethod_DHG14SHA1_I   Fixed Constant(1004x),                     
*                          /* diffie-hellman-group14-sha1       ICSF */         
* SMF_119SSH_KexMethod_DHG1SHA1_I    Fixed Constant(1005x),                     
*                          /* diffie-hellman-group1-sha1        ICSF */         
* SMF_119SSH_KexMethod_ECDHSHA2NP256_I Fixed Constant(1006x),                   
*                          /* ecdh-sha2-nistp256            ICSF     */         
* SMF_119SSH_KexMethod_ECDHSHA2NP384_I Fixed Constant(1007x),                   
*                          /* ecdh-sha2-nistp384            ICSF     */         
* SMF_119SSH_KexMethod_ECDHSHA2NP521_I Fixed Constant(1008x),                   
*                          /* ecdh-sha2-nistp521            ICSF     */         
* SMF_119SSH_KexMethod_GSSGROUP1SHA1_I Fixed Constant(1009x),                   
*                          /* gss-group1-sha1-              ICSF     */         
* SMF_119SSH_KexMethod_GSSGROUP14SHA1_I Fixed Constant(100Ax),                  
*                          /* gss-group14-sha1-             ICSF     */         
* SMF_119SSH_KexMethod_GSSGEXSHA1_I       Fixed Constant(100Bx);                
*                          /* gss-gex-sha1-                 ICSF     */         
*                                                                               
*                                                                               
*/*------------------------------------------------------------------*/         
*/* SFTP/SCP Server Transfer Completion section (Subtype 96)         */         
*/*------------------------------------------------------------------*/         
*                                                                               
*                                                                               
*Declare                                                                        
*1 SMF_119SSH_FS             Based,                                             
*  3 SMF_119SSH_FSOper       Fixed(8), /* SFTP/SCP Server Operation  */         
*  3 SMF_119SSH_FSRsvd       Char(3),  /* Reserved                   */         
*  3 SMF_119SSH_FSCmd        Char(4),  /* SFTP/SCP server subcommand */         
*  3 SMF_119SSH_FSRIP        Char(16), /* Remote IP address - client */         
*    5 SMF_119SSH_FSRIPRsvd  Char(12), /* unused if IPv4 address supp*/         
*      7 SMF_119SSH_FSRIPRsvd10  Char(10),                                      
*      7 SMF_119SSH_FSRIPFmt Char(2),  /* IPv4 address flagging      */         
*    5 SMF_119SSH_FSRIP_IPv4 Char(4),  /*  Remote IP address, IPv4 fo*/         
*  3 SMF_119SSH_FSLIP        Char(16), /* Local IP address - server (*/         
*    5 SMF_119SSH_FSLIPRsvd  Char(12), /* unused if IPv4 address supp*/         
*      7 SMF_119SSH_FSLIPRsvd10  Char(10),                                      
*      7 SMF_119SSH_FSLIPFmt Char(2),  /* IPv4 address flagging      */         
*    5 SMF_119SSH_FSLIP_IPv4 Char(4),  /* Local IP address, IPv4 form*/         
*  3 SMF_119SSH_FSRPort      Fixed(16),/* Remote port number - client*/         
*  3 SMF_119SSH_FSLPort      Fixed(16),/* Local port number - server */         
*  3 SMF_119SSH_FSSUser      Char(8),  /* Client User ID on server   */         
*  3 SMF_119SSH_FSTType      Char(1),  /* Data transfer type         */         
*  3 SMF_119SSH_FSMode       Char(1),  /* Transmission mode          */         
*  3 SMF_119SSH_FSReserved   Fixed(16),/* Reserved                   */         
*  3 SMF_119SSH_FSSTime      Fixed(32),/* Start time of transmission */         
*  3 SMF_119SSH_FSSDate      Char(4),  /* Start date of transmission */         
*  3 SMF_119SSH_FSETime      Fixed(32),/* End time of transmission   */         
*  3 SMF_119SSH_FSEDate      Char(4),  /* End date of transmission   */         
*  3 SMF_119SSH_FSDur        Fixed(32),/* Duration of transmission   */         
*  3 SMF_119SSH_FSBytes      Char(8),  /* Bytes transmitted (64-bit) */         
*  3 SMF_119SSH_FSStat       Char(4),  /* Server execution status    */         
*  3 SMF_119SSH_FSCH1        Char(8),  /* Old permissions or UID     */         
*  3 SMF_119SSH_FSGP1        Char(8),  /* Old GID for chown/chgrp    */         
*  3 SMF_119SSH_FSCH2        Char(8),  /* New permissions or UID     */         
*  3 SMF_119SSH_FSGP2        Char(8);  /* New GID for chown/chgrp    */         
*                                                                               
*/********************************************************************/         
*/* Constants for SMF_119SSH_FSOper field                            */         
*/********************************************************************/         
*                                                                               
*Declare                                                                        
* SMF_119SSH_FSOperRMD     Fixed Constant(01x), /* Rmdir             */         
* SMF_119SSH_FSOperRM      Fixed Constant(02x), /* Rm                */         
* SMF_119SSH_FSOperRENM    Fixed Constant(03x), /* Rename            */         
* SMF_119SSH_FSOperGET     Fixed Constant(04x), /* Get               */         
* SMF_119SSH_FSOperPUT     Fixed Constant(05x), /* Put               */         
* SMF_119SSH_FSOperCHMD    Fixed Constant(06x), /* Chmod             */         
* SMF_119SSH_FSOperCHOW    Fixed Constant(07x), /* Chown/Chgrp       */         
* SMF_119SSH_FSOperMKD     Fixed Constant(08x), /* Mkdir             */         
* SMF_119SSH_FSOperSLNK    Fixed Constant(09x); /* Symlink           */         
*                                                                               
*/********************************************************************/         
*/* Constants for SMF_119SSH_FSCmd field                             */         
*/********************************************************************/         
*                                                                               
*Declare                                                                        
* SMF_119SSH_FSCmdRMD       Char(*) Constant('RMD '), /* Rmdir       */         
* SMF_119SSH_FSCmdRM        Char(*) Constant('RM  '), /* Rm          */         
* SMF_119SSH_FSCmdRENM      Char(*) Constant('RENM'), /* Rename      */         
* SMF_119SSH_FSCmdGET       Char(*) Constant('GET '), /* Get         */         
* SMF_119SSH_FSCmdPUT       Char(*) Constant('PUT '), /* Put         */         
* SMF_119SSH_FSCmdCHMD      Char(*) Constant('CHMD'), /* Chmod       */         
* SMF_119SSH_FSCmdCHOW      Char(*) Constant('CHOW'), /* Chown/Chgrp */         
* SMF_119SSH_FSCmdMKD       Char(*) Constant('MKD '), /* Mkdir       */         
* SMF_119SSH_FSCmdSLNK      Char(*) Constant('SLNK'); /* Symlink     */         
*                                                                               
*/********************************************************************/         
*/* Constants for SMF_119SSH_FSTType field                           */         
*/********************************************************************/         
*                                                                               
*Declare                                                                        
* SMF_119SSH_FSTTypeASCII   Char(*) Constant('A'), /* ASCII          */         
* SMF_119SSH_FSTTypeBinary  Char(*) Constant('B'); /* Binary         */         
*                                                                               
*/********************************************************************/         
*/* Constants for SMF_119SSH_FSMode field                            */         
*/********************************************************************/         
*Declare                                                                        
* SMF_119SSH_FSModeCmpress  Char(*) Constant('C'), /* Compressed     */         
* SMF_119SSH_FSModeStream   Char(*) Constant('S'); /* Stream         */         
*                                                                               
*/********************************************************************/         
*/* Constants for SMF_119SSH_FSStat field                            */         
*/********************************************************************/         
*Declare                                                                        
* SMF_119SSH_FSStatOK       Char(*) Constant('OK  '), /*Success      */         
* SMF_119SSH_FSStatFAIL     Char(*) Constant('FAIL'); /*Failure      */         
*                                                                               
*/*------------------------------------------------------------------*/         
*/* SFTP/SCP Server Transfer Completion Hostname section (subtype 96)*/         
*/*------------------------------------------------------------------*/         
*                                                                               
*Declare                                                                        
*1 SMF_119SSH_FSHN          Based,                                              
*  3 SMF_119SSH_FSHostname  Char(*);   /* Hostname                   */         
*                                                                               
*/*------------------------------------------------------------------*/         
*/* SFTP/SCP Server Transfer Completion First Associated Path Name   */         
*/* section (subtype 96)                                             */         
*/*------------------------------------------------------------------*/         
*                                                                               
*Declare                                                                        
*1 SMF_119SSH_FSA1          Based,                                              
*  3 SMF_119SSH_FSPath1     Char(*);   /* First associated path name */         
*                                                                               
*/*------------------------------------------------------------------*/         
*/* SFTP/SCP Server Transfer Completion Second Associated Path Name  */         
*/* section (subtype 96)                                             */         
*/*------------------------------------------------------------------*/         
*                                                                               
*Declare                                                                        
*1 SMF_119SSH_FSA2          Based,                                              
* 3 SMF_119SSH_FSPath2      Char(*);  /* Second ssociated path name  */         
*                                                                               
*                                                                               
*/*------------------------------------------------------------------*/         
*                                                                               
*/*------------------------------------------------------------------*/         
*/* SFTP/SCP Client Transfer Completion record (subtype 97)          */         
*/*------------------------------------------------------------------*/         
*                                                                               
*Declare                                                                        
*1 SMF_119SSH_FC            Based,                                              
*  3 SMF_119SSH_FCCmd       Char(4),   /* SFTP/SCP client subcommand */         
*  3 SMF_119SSH_FCRIP       Char(16),  /* Remote IP address - server */         
*    5 SMF_119SSH_FCRIPRsvd Char(12),  /* unused if IPv4 address supp*/         
*      7 SMF_119SSH_FCRIPRsvd10  Char(10),                                      
*      7 SMF_119SSH_FCRIPFmt Char(2),  /* IPv4 address flagging      */         
*    5 SMF_119SSH_FCRIP_IPv4 Char(4),  /* Remote IP address, IPv4 for*/         
*  3 SMF_119SSH_FCLIP       Char(16),  /* Local IP address - client (*/         
*    5 SMF_119SSH_FCLIPRsvd Char(12),  /* unused if IPv4 address supp*/         
*      7 SMF_119SSH_FCLIPRsvd10 Char(10),                                       
*      7 SMF_119SSH_FCLIPFmt Char(2),  /* IPv4 address flagging      */         
*    5 SMF_119SSH_FCLIP_IPv4 Char(4),  /* Local IP address, IPv4 form*/         
*  3 SMF_119SSH_FCRPort     Fixed(16), /* Remote port number - server*/         
*  3 SMF_119SSH_FCLPort     Fixed(16), /* Local port number - client */         
*  3 SMF_119SSH_FCLUser     Char(8),   /* Local User ID              */         
*  3 SMF_119SSH_FCTType     Char(1),   /* Data format                */         
*  3 SMF_119SSH_FCMode      Char(1),   /* Transmission mode          */         
*  3 SMF_119SSH_FCFlags     Fixed(16), /* Flags                  @A2C*/         
*  3 SMF_119SSH_FCSTime     Fixed(32), /* Start time of transmission */         
*  3 SMF_119SSH_FCSDate     Char(4),   /* Start date of transmission */         
*  3 SMF_119SSH_FCETime     Fixed(32), /* End time of transmission (U*/         
*  3 SMF_119SSH_FCEDate     Char(4),   /* End date of transmission   */         
*  3 SMF_119SSH_FCDur       Fixed(32), /* Duration of transmission (1*/         
*  3 SMF_119SSH_FCBytes     Char(8),   /* Bytes transmitted (64-bit) */         
*  3 SMF_119SSH_FCStat      Char(4);   /* Subcommand execution status*/         
*                                                                               
*/********************************************************************/         
*/* Constants for SMF_119SSH_FCCmd field                             */         
*/********************************************************************/         
*                                                                               
*Declare                                                                        
* SMF_119SSH_FCCmdGET       Char(*) Constant('GET '), /* Get         */         
* SMF_119SSH_FCCmdPUT       Char(*) Constant('PUT '); /* Put         */         
*                                                                               
*                                                                               
*/********************************************************************/         
*/* Constants for SMF_119SSH_FCType field                            */         
*/********************************************************************/         
*                                                                               
*Declare                                                                        
*  SMF_119SSH_FCTTypeASCII  Char(*) Constant('A'), /* ASCII          */         
*  SMF_119SSH_FCTTypeBinary Char(*) Constant('B'); /* Binary         */         
*                                                                               
*/********************************************************************/         
*/* Constants for SMF_119SSH_FCMode field                            */         
*/********************************************************************/         
*                                                                               
*Declare                                                                        
* SMF_119SSH_FCModeCmpress  Char(*) Constant('C'), /* Compressed     */         
* SMF_119SSH_FCModeStream   Char(*) Constant('S'); /* Stream         */         
*                                                                               
*/********************************************************************/         
*/* Constants for SMF_119SSH_FCFlags field                       @A2A*/         
*/********************************************************************/         
*                                                                               
*Declare                                                                        
* SMF_119SSH_FCFlagREGET   Fixed Constant(0001x),                               
*                                    /* sftp reget or get -a     @A2A*/         
* SMF_119SSH_FCFlagRESRVD  Fixed Constant(FFFEx);                               
*                                    /* reserver flags           @A2A*/         
*                                                                               
*/********************************************************************/         
*/* Constants for SMF_119SSH_FCStat field                            */         
*/********************************************************************/         
*                                                                               
*Declare                                                                        
* SMF_119SSH_FCStatOK       Char(*) Constant('OK  '), /*Success      */         
* SMF_119SSH_FCStatFAIL     Char(*) Constant('FAIL'); /*Failure      */         
*                                                                               
*/*------------------------------------------------------------------*/         
*/* SFTP/SCP Server Transfer Completion Hostname section (subtype 97)*/         
*/*------------------------------------------------------------------*/         
*                                                                               
*Declare                                                                        
*1 SMF_119SSH_FCHN           Based,                                             
*  3 SMF_119SSH_FCHostname   Char(*);  /* Hostname                   */         
*                                                                               
*/*------------------------------------------------------------------*/         
*/* SFTP/SCP Client Transfer Completion Associated Path Name         */         
*/* section (subtype 97)                                             */         
*/*------------------------------------------------------------------*/         
*                                                                               
*Declare                                                                        
*1 SMF_119SSH_FCAN          Based,                                              
*  3 SMF_119SSH_FCname      Char(*);   /* associated path name       */         
*                                                                               
*/*------------------------------------------------------------------*/         
*/* SFTP Client Transfer Completion Target Path Name             @A2A*/         
*/* section (subtype 97)                                         @A2A*/         
*/*------------------------------------------------------------------*/         
*                                                                               
*Declare                                                                        
*1 SMF_119SSH_FCAN2         Based,     /*                        @A2A*/         
*  3 SMF_119SSH_FCPath2     Char(*);   /* SFTP Target Path Name  @A2A*/         
*                                                                               
*/*------------------------------------------------------------------*/         
*/* SFTP/SCP Client Transfer Completion user name section            */         
*/* section (subtype 97)                                             */         
*/*------------------------------------------------------------------*/         
*                                                                               
*Declare                                                                        
*1 SMF_119SSH_FCUI          Based,                                              
* 3 SMF_119SSH_FCIuserid    Char(*);  /* Second ssociated path name  */         
*                                                                               
*                                                                               
*/*------------------------------------------------------------------*/         
*/* SSH Login Login / Failure record (subtype 94, 95, 98)       @A8C */         
*/*------------------------------------------------------------------*/         
*                                                                               
*Declare                                                                        
*1 SMF_119SSH_LF            Based,                                              
*  3 SMF_119SSH_LFRIP       Char(16),  /* Remote IP address - client */         
*    5 SMF_119SSH_LFRIPRsvd Char(12),  /* unused if IPv4 address supp*/         
*      7 SMF_119SSH_LFRIPRsvd10  Char(10),                                      
*      7 SMF_119SSH_LFRIPFmt Char(2),  /* IPv4 address flagging      */         
*    5 SMF_119SSH_LFRIP_IPv4 Char(4),/* Remote IP address, IPv4 for*/           
*  3 SMF_119SSH_LFLIP       Char(16),  /* Local IP address - server (*/         
*    5 SMF_119SSH_LFLIPRsvd Char(12),  /* unused if IPv4 address supp*/         
*      7 SMF_119SSH_LFLIPRsvd10  Char(10),                                      
*      7 SMF_119SSH_LFLIPFmt Char(2),  /* IPv4 address flagging      */         
*    5 SMF_119SSH_LFLIP_IPv4 Char(4),  /* Local IP address, IPv4 form*/         
* 3 SMF_119SSH_LFRPort      Fixed(16), /* Remote port number - client*/         
* 3 SMF_119SSH_LFLPort      Fixed(16), /* Local port number - server */         
* 3 SMF_119SSH_LFUserID     Char(8),   /* User ID received by / sent            
*                                         to server              @A8C*/         
* 3 SMF_119SSH_LFReason     Fixed(16), /* Login failure reason                  
*                                           (subtype 98 only)    @A8C*/         
* 3 SMF_119SSH_LFRsvd2      Fixed(16); /* Reserved                   */         
*                                                                               
*/********************************************************************/         
*/* Constants for SMF_119SSH_LFReason field                          */         
*/********************************************************************/         
*                                                                               
*Declare                                                                        
* SMF_119SSH_LFReasonUnexpect Fixed Constant(0000x),                            
*                                      /* Unexpected auth fail       */         
* SMF_119SSH_LFReasonAuthChg  Fixed Constant(0001x),                            
*                                      /* Unexpected auth change     */         
* SMF_119SSH_LFReasonInvalid  Fixed Constant(0002x),                            
*                                      /* Password is not valid      */         
* SMF_119SSH_LFReasonRevoked  Fixed Constant(0003x),                            
*                                      /* User ID has been revoked   */         
* SMF_119SSH_LFReasonNoAccess Fixed Constant(0004x),                            
*                                      /* User does not have access  */         
* SMF_119SSH_LFReasonBadMode  Fixed Constant(0005x),                            
*                                      /* Bad file modes or ownership*/         
* SMF_119SSH_LFReasonExcess   Fixed Constant(0006x),                            
*                                      /* Too many failed login attem*/         
* SMF_119SSH_LFReasonError    Fixed Constant(0007x),                            
*                                      /* Password error             */         
* SMF_119SSH_LFReasonUnknown  Fixed Constant(0008x),                            
*                                      /* User ID is unknown         */         
* SMF_119SSH_LFReasonNoRoot   Fixed Constant(0009x),                            
*                                      /* No root user auth          */         
* SMF_119SSH_LFReasonNoEmpty  Fixed Constant(000Ax),                            
*                                      /* No empty passwords         */         
* SMF_119SSH_LFReasonMethod   Fixed Constant(000Bx),                            
*                                      /* No/bad auth method         */         
* SMF_119SSH_LFReasonKey      Fixed Constant(000Cx),                            
*                                      /* No/bad key found           */         
* SMF_119SSH_LFReasonHost     Fixed Constant(000Dx),                            
*                                      /* No/bad host found          */         
* SMF_119SSH_LFReasonHostKeyRevoked Fixed Constant(000Ex),                      
*                                      /* Revoked host key       @A2A*/         
* SMF_119SSH_LFReasonKeyLength Fixed Constant(000Fx);                           
*                                      /* Bad key length         @A4A*/         
*                                      /* in FIPS mode           @A4A*/         
*%end;                                                                          
