*********START OF SPECIFICATIONS*************************************** 00000100
*                                                                       00000200
* $MAC(FRACHECK) COMP(SC1BN) PROD(RACF):                                00000300
*                                                                       00000400
* DESCRIPTIVE NAME:                                                     00000500
*   FAST AUTHORIZATION CHECKING INTERFACE                               00000600
*                                                                       00000700
* *01* PROPRIETARY STATEMENT=                                         * 00000800
*  **PROPRIETARY_STATEMENT********************************************* 00000900
*                                                                     * 00001000
*                                                                     * 00001100
*   Licensed Materials - Property of IBM                              * 00001200
*   5650-ZOS Copyright IBM Corp. 1980, 2019                           * 00001300
*                                                                     * 00001400
*   STATUS= HBB77C0                                                   * 00001500
*                                                                     * 00001600
*  **END_OF_PROPRIETARY_STATEMENT************************************** 00001700
*                                                                    *  00001800
*01* EXTERNAL CLASSIFICATION:                                        *  00001900
*02* GUPI:                                                           *  00002000
*01* END OF EXTERNAL CLASSIFICATION:                                 *  00002100
*                                                                    *  00002200
*                                                                       00002300
* FUNCTION:                                                             00002400
*   THIS MACRO ALLOWS THE CALLER TO CHECK THE USER'S AUTHORIZATION      00002500
*   TO A GENERAL CLASS RESOURCE WHICH HAS HAD ITS PROFILE LOADED        00002600
*   INTO STORAGE BY A RACLIST.                                          00002700
*                                                                       00002800
*                                                                       00002900
* CHANGE ACTIVITY:                                                      00003000
*   $L0=RACF VERSION 1 RELEASE 3                               @PC003PY 00003100
*   $T1=UZ90211,SAF/RF15,810702,CNTDSD:                            @T1A 00003200
*   UZ90283                                                    @ZA90283 00003300
*   UZ90284                                                    @ZA90284 00003400
*   UZ90285                                                    @ZA90285 00003500
*   $L1=HRF1702,RACF/170,841205,CNTDSD:                            @L1A 00003600
*   $L2=HRF1802,RACF/180,870325,CNTDSD:                            @L2A 00003700
*   $L3=JRF1812,RACF/181,871123,CNTDSD: RELEASE=1.8.1 ALLOWED      @L3A 00003800
*   $L4=VMSFS   RACF/190 890517 PDB_S1: RELEASE=1.9 ALLOWED        @L4A 00003900
*   $01=OY46708 RACF/190 910822 PDJ_K3: SUPPORT FOR OY46708        @01A 00004000
*   $L5=RELID   RACF/192 900904 PDAHW1: SUPPORT FOR RACF 1.9.2     @L5A 00004100
*   $P1=PJA0029 RACF/192 910524 PDPSB1: PTM PJA0029                @P1A 00004200
*   $L6=OW04015 RACF/210 930426 PDKAF1: SUPPORT FOR RACF 2.1       @L6A 00004300
*   $D1=OW03465 RACF/210 940304 KDRB:   OW03465 (DCR 40)           @D1A 00004400
*   $L7=OW10709 RACF/220 940509 PDJMV1: SUPPORT FOR RACF 2.2       @L7A 00004500
*   $L8=RELID   RACF/230 960422 PDJMV1: SUPPORT FOR RACF 2.3       @L8A 00004600
*   $L9=RELID   RACF/240 960718 PD00XB: SUPPORT FOR RACF 2.4       @L9A 00004700
*   $LA=DB2FAST RACF/240 961118 PDAWS1: DB2 FASTAUTH SUPPORT       @LAA 00004800
*   $LB=DB2FAST RACF/240 961118 PDWJC1: DB2 FASTAUTH SUPPORT       @LBA 00004900
*   $P2=PSY0178 RACF/240 961218 PDAWS1: PTM PSY0178                @P2A 00005000
*   $P3=PSY0210 RACF/240 961219 PDAWS1: PTM PSY0210                @P3A 00005100
*   $P4=PSY0250 RACF/240 970115 PDAWS1: PTM PSY0250                @P4A 00005200
*   $D2=DCR0004 RACF/240 970130 PDAWS1: DCR DCRR0004               @D2A 00005300
*   $LC=NQN     HBB6605  970226 PDR_B1: NETWORK QUALIFIED NAMES    @LCA 00005400
*   $P5=PUX0611 HBB6605  971114 PDCAM1: CHANGES FOR NQN            @P5A 00005500
*   $02=OW32598 HBB6605  980224 PDMKL1: FASTAUTH RACO SUPPORT      @02A 00005600
*   $LD=RELID   HBB6608  980624 PDRDS2: SUPPORT FOR HRF2608        @LDA 00005700
*   $LE=RELID   HBB7703  990429 PDRDS2: SUPPORT FOR HRF7703        @LEA 00005800
*   $LF=RELID   HBB7705  000404 PDIFS2: SUPPORT FOR HRF7705        @LFA 00005900
*   $LG=RELID   HBB7706  010430 PDRDC1: SUPPORT FOR HBB7706        @LGA 00006000
*   $LH=RELID   HBB7707  020104 PDMSF1: SUPPORT FOR HBB7707        @LHA 00006100
*   $LI=RELID   HBB7708  020118 PDMSF1: SUPPORT FOR HBB7708        @LIA 00006200
*   $LJ=RELID   HBB7709  030430 PDMSD1: SUPPORT FOR HBB7709        @LJA 00006300
*   $LK=RELID   HBB7720  040224 PDRIV1: Support SAF FMID HBB7720   @LKA 00006400
*   $LL=RELID   HBB7730  050531 PDRIV1: Support SAF FMID HBB7730   @LLA 00006500
*   $LM=SQLROLE HBB7730  051221 PDISR1: Support SQLROLE: ME05478   @LMA 00006600
*   $LN=SQLROLE HBB7730  060207 PDISR1: Support SQLROLE: ME05847   @LNA 00006700
*   $LO=RELID   HBB7740  060330 PDRIV1: Support SAF FMID HBB7740   @LOA 00006800
*   $LP=RELID   HBB7750  070302 PDRIV1: Support SAF FMID HBB7750   @LPA 00006900
*   $LQ=RELID   HBB7760  080522 PDJLW1: Support SAF FMID HBB7760   @LQA 00007000
*   $LR=RELID   HBB7770  090511 PDJLW1: Support SAF FMID HBB7770   @LRA 00007100
*   $LS=RELID   HBB7780  100512 PDJLW1: Support SAF FMID HBB7780   @LSA 00007200
*   $LT=RELID   HBB7790  110110 PDJLW1: Support SAF FMID HBB7790   @LTA 00007300
*   $LU=RELID   HBB77A0  130115 PDAWS1: Support SAF FMID HBB77A0   @LUA 00007400
*   $LV=RELID   HBB77B0  150508 PDPGP1: Support SAF FMID HBB77B0   @LVA 00007500
*   $LW=CICSAUD HBB77B0  160714 PDGTM1: Support for LOGSTRX        @LWA 00007600
*   $LX=RELID   HBB77C0  180524 PDGTM1: ParmList Version Support   @LXA 00007700
*                                                                       00007800
*                                                                       00007900
*                                                                       00008000
* CHANGE DESCRIPTIONS:                                                  00008100
*   A000000-999999                                             @PC003PY 00008200
*   A - ALLOW RELEASE=1.9 BUT MUST BE FROM RACROUTE.               @L4A 00008300
*       NOTE THAT ENTITYX IS NOT SUPPORTED FOR FRACHECK. (PDSHL1)  @L4A 00008400
*   C - CORRECT ERROR INTRODUCED BY @L4 (FOR 1.8.1 FRACHECKS)      @01A 00008500
*   A - ALLOW RELEASE=1.9.2 TO BE SPECIFIED                        @L5A 00008600
*   C - STATUS TO CORRECTLY CORRESPOND TO MVS LEVEL                @P1A 00008700
*   A - ALLOW RELEASE=2.1 TO BE SPECIFIED                          @L6A 00008800
*   A - ALLOW LOG TO BE SPECIFIED                                  @D1A 00008900
*   A - ALLOW RELEASE=2.2 TO BE SPECIFIED                          @L7A 00009000
*   A - ALLOW RELEASE=2.3 TO BE SPECIFIED                          @L8A 00009100
*   A - ALLOW RELEASE=2.4 TO BE SPECIFIED                          @L9A 00009200
*   A - ALLOW ACEEALET PARAMETER TO BE SPECIFIED                   @LAA 00009300
*   A - ALLOW LOGSTR PARAMETER TO BE SPECIFIED                     @LBA 00009400
*   C - CORRECT SETTING OF LOGSTR ADDRESS AND ACEEALET ADDRESS     @P2A 00009500
*       IN PARAMETER LIST.                                         @P2A 00009600
*   C - ONLY PROCESS ACEEALET AND LOGSTR KEYWORDS IF RELEASE IS    @P3A 00009700
*       AT LEAST 2.4.                                              @P3A 00009800
*   C - CHECK THAT RELEASE KEYWORD WAS SPECIFIED BEFORE CHECKING   @P4A 00009900
*       THE RELEASE LEVEL.                                         @P4A 00010000
*   C - ADD PARAMETER LIST LENGTH AND VERSION TO PARAMETER LIST    @D2A 00010100
*   C - ADD ENTITYX KEYWORD TO SUPPORT NETWORK QUALIFIED LUNAME    @LCA 00010200
*   C - FIX ENTITYX KEYWORD TO SUPPORT NQN FOR HRF2260 AND HIGHER  @P5A 00010300
*   C - ADD ENVRIN KEYWORD                                         @02A 00010400
*   A - ALLOW RELEASE=2608 TO BE SPECIFIED                         @LDA 00010500
*   A - ALLOW RELEASE=7703 TO BE SPECIFIED                         @LEA 00010600
*   A - ALLOW RELEASE=7705 TO BE SPECIFIED                         @LFA 00010700
*   A - ALLOW RELEASE=7706 TO BE SPECIFIED                         @LGA 00010800
*   A - ALLOW RELEASE=7707 TO BE SPECIFIED                         @LHA 00010900
*   A - ALLOW RELEASE=7708 TO BE SPECIFIED                         @LIA 00011000
*   A - ALLOW RELEASE=7709 TO BE SPECIFIED                         @LJA 00011100
*   A - Add support for SAF Release FMID HBB7720                   @LKA 00011200
*   A - Add support for SAF Release FMID HBB7730                   @LLA 00011300
*   A - ADD CRITERIA KEYWORD TO SUPPORT SQLROLE                    @LMA 00011400
*   A - ADD AUTHCHKS KEYWORD TO SUPPORT SQLROLE                    @LNA 00011500
*   A - Add support for SAF Release FMID HBB7740                   @LOA 00011600
*   A - Add support for SAF Release FMID HBB7750                   @LPA 00011700
*   A - Add support for SAF Release FMID HBB7760                   @LQA 00011800
*   A - Add support for SAF Release FMID HBB7770                   @LRA 00011900
*   A - Add support for SAF Release FMID HBB7780                   @LSA 00012000
*   A - Add support for SAF Release FMID HBB7790                   @LTA 00012100
*   A - Add support for SAF Release FMID HBB77A0                   @LUA 00012200
*   A - Add support for SAF Release FMID HBB77B0                   @LVA 00012300
*   A - Support for ICSF CICS audit                                     00012400
*       - Add the keyword LOGSTRX to a FRACHECK request            @LWA 00012500
*   A - Support for Parameter List Version                              00012600
*       - Specify the parameter list version instead of                 00012700
*         the last 4 characters of the FMID by specifying               00012800
*         RELEASE=PLV0001                                          @LXA 00012900
*                                                                       00013000
*                                                                       00013100
*                                                                       00013200
*********END OF SPECIFICATIONS***************************************** 00013300
         MACRO                                                          00013400
&SYMBOL  FRACHECK &ENTITY=,&CLASS=,&WKAREA=,                           *00013500
               &ATTR=,&MF=S,&INSTLN=,                                  *00013600
               &ACEE=,&APPL=,&RELEASE=,&LOG=,&ACEEALET=,           @LAC*00013700
               &LOGSTR=,&ENTITYX=,&ENVRIN=,&CRITERIA=,&AUTHCHKS=,  @LNC*00013800
               &LOGSTRX=                                           @LWA 00013900
.******* DEFINE LOCAL SET SYMBOLS                                       00014000
         LCLA  &BIT0,&BIT1,&BIT2,&BIT3,&BIT4,&BIT5,&BIT6,&BIT7,&CLNGTH  00014100
         LCLA  &BIT8,&BIT9,&BIT10,&BIT11,&BIT12                    @LWC 00014200
         LCLB  &LGERRFG           ERROR WITH LOG ENCOUNTERED       @D1A 00014300
         LCLA  &OFFSET                                                  00014400
         LCLA  &PARMLEN                                            @D2A 00014500
         LCLA  &VERSION                                            @D2A 00014600
         LCLB  &MFFLAG                                                  00014700
         LCLB  &ACHKERR           ERROR WITH AUTHCHKS ENCOUNTERED  @LNA 00014800
         LCLB  &LOGXERR           Error with LOGSTRX encountered   @LWA 00014900
         LCLC  &RLVL              RELEASE LEVEL CHARACTER STRING   @LUA 00015000
.******* DEFINE GLOBAL SET VARIABLES                               @T1A 00015100
         GBLB  &ICHRAC            ICHRAC - A FLAG WHICH, WHEN      @T1A 00015200
.*                                ON, INDICATES THAT THIS MACRO    @T1A 00015300
.*                                IS BEING INVOKED INTERNALLY      @T1A 00015400
.*                                BY THE RACROUTE MACRO.           @T1A 00015500
         GBLC  &ICHL              SETS ADDRESSABILITY TO THE       @T1A 00015600
.*                                PARAMETER LIST FOR THE           @T1A 00015700
.*                                RACROUTE MACRO.                  @T1A 00015800
         GBLC  &ICHRLVL           SYMBOL TO BRANCH TO              @L1A 00015900
.*                                WHEN INCOMPATIBLE MACRO LEVEL.   @L1A 00016000
&OFFSET  SETA  32                                                  @P3C 00016100
&PARMLEN SETA  28                                                  @D2A 00016200
&VERSION SETA  0                                                   @D2A 00016300
.******* PERFORM PARAMETER DIAGNOSIS                                    00016400
.*                                                                      00016500
.* VALIDATE RELEASE PARAMETER                                      @L1A 00016600
         AIF   (&ICHRAC).RLVL01                                    @L1A 00016700
&ICHRLVL SETC  'ICH&SYSNDX.X'      CREATE LABEL FOR SVC BYPASS     @L1A 00016800
.RLVL01  ANOP                                                      @L1A 00016900
         AIF   ('&RELEASE' EQ '').NORLVL                           @LUC 00017000
         AIF   (N'&RELEASE GT 2).ERLVL1  INVALID RELEASE PARAMETER @L1A 00017100
         AIF   ('&RELEASE(1)' EQ '1.6').RLVL02                     @L5A 00017200
         AIF   ('&RELEASE(1)' EQ '1.7').RLVL02                     @L5A 00017300
         AIF   ('&RELEASE(1)' EQ '1.8').RLVL02                     @L5A 00017400
         AIF   ('&RELEASE(1)' EQ '1.8.1').RLVL02                   @L5A 00017500
         AIF   ('&RELEASE(1)' EQ '1.9').RLVL02                     @L5A 00017600
         AIF   ('&RELEASE(1)' EQ '1.9.2').RLVL02                   @L5A 00017700
         AIF   ('&RELEASE(1)' EQ '2.1').RLVL02                     @L6A 00017800
         AIF   ('&RELEASE(1)' EQ '2.2').RLVL02                     @L7A 00017900
         AIF   ('&RELEASE(1)' EQ '2.3').RLVL02                     @L8A 00018000
         AIF   ('&RELEASE(1)' EQ '2.4').RLVL02                     @L9A 00018100
         AIF   ('&RELEASE(1)' EQ '2.6').RLVL02                     @LCA 00018200
         AIF   ('&RELEASE(1)' EQ '2608').RLVL02                    @LDA 00018300
         AIF   ('&RELEASE(1)' EQ '7703').RLVL02                    @LEA 00018400
         AIF   ('&RELEASE(1)' EQ '7705').RLVL02                    @LFA 00018500
         AIF   ('&RELEASE(1)' EQ '7706').RLVL02                    @LGA 00018600
         AIF   ('&RELEASE(1)' EQ '7707').RLVL02                    @LHA 00018700
         AIF   ('&RELEASE(1)' EQ '7708').RLVL02                    @LIA 00018800
         AIF   ('&RELEASE(1)' EQ '7709').RLVL02                    @LJA 00018900
         AIF   ('&RELEASE(1)' EQ '7720').RLVL02                    @LKA 00019000
         AIF   ('&RELEASE(1)' EQ '7730').RLVL02                    @LLA 00019100
         AIF   ('&RELEASE(1)' EQ '7740').RLVL02                    @LOA 00019200
         AIF   ('&RELEASE(1)' EQ '7750').RLVL02                    @LPA 00019300
         AIF   ('&RELEASE(1)' EQ '7760').RLVL02                    @LQA 00019400
         AIF   ('&RELEASE(1)' EQ '7770').RLVL02                    @LRA 00019500
         AIF   ('&RELEASE(1)' EQ '7780').RLVL02                    @LSA 00019600
         AIF   ('&RELEASE(1)' EQ '7790').RLVL02                    @LTA 00019700
         AIF   ('&RELEASE(1)' EQ '77A0').RLVL02                    @LUA 00019800
         AIF   ('&RELEASE(1)' EQ '77B0').RLVL02                    @LVA 00019900
         AIF   ('&RELEASE(1)' EQ 'PLV0001').RLVL02                 @LXA 02010010
         AGO   .ERLVL1                                             @L5A 00020100
.*   RELEASE CHECKING WAS RESTRUCTURED                             @L5D 00020200
.RLVL02  ANOP                                                      @L5A 00020300
         AIF   (N'&RELEASE EQ 1).NORLVLC CHECK NOT SPECIFIED       @L1A 00020400
         AIF   ('&RELEASE(2)' NE 'CHECK').ERLVL1 INVALID VALUE     @L1A 00020500
         AIF   ('&MF(1)' NE 'E').ERLVL2 CHECK ONLY WITH MF=E       @L1A 00020600
.ERLVL2R ANOP                                                      @L1A 00020700
.NORLVLC ANOP                                                      @L1A 00020800
.ERLVL1R ANOP                                                      @L1A 00020900
.CHECKVER ANOP                                                     @LXA 02110006
         AIF   ('&RELEASE(1)' NE 'PLV0001').CHECKFMID              @LXA 02120011
.PLVER0001 ANOP                                                    @LXA 00021600
&RLVL    SETC  '46   '             Indicate the Parameter List     @LXA 00021700
.*                                 is at the RELEASE=77B0 level    @LXA 00021800
         AGO   .ENDRLVL                                            @LXA 00021900
.CHECKFMID ANOP                                                    @LXA 00022000
.RLVL77B0 ANOP                                                     @LXA 00022100
         AIF   ('&RELEASE(1)' NE '77B0').RLVL77A0                  @LVA 00022200
&RLVL    SETC  '46   '             INDICATE RELEASE=77B0           @LVA 00022300
         AGO   .ENDRLVL                                            @LVA 00022400
.RLVL77A0 ANOP                                                     @LVA 00022500
         AIF   ('&RELEASE(1)' NE '77A0').RLVL7790                  @LUA 00022600
&RLVL    SETC  '45   '             INDICATE RELEASE=77A0           @LUA 00022700
         AGO   .ENDRLVL                                            @LUA 00022800
.RLVL7790 ANOP                                                     @LUA 00022900
         AIF   ('&RELEASE(1)' NE '7790').RLVL7780                  @LUA 00023000
&RLVL    SETC  '44   '             INDICATE RELEASE=7790           @LUA 00023100
         AGO   .ENDRLVL                                            @LUA 00023200
.RLVL7780 ANOP                                                     @LUA 00023300
         AIF   ('&RELEASE(1)' NE '7780').RLVL7770                  @LUA 00023400
&RLVL    SETC  '43   '             INDICATE RELEASE=7780           @LUA 00023500
         AGO   .ENDRLVL                                            @LUA 00023600
.RLVL7770 ANOP                                                     @LUA 00023700
         AIF   ('&RELEASE(1)' NE '7770').RLVL7760                  @LUA 00023800
&RLVL    SETC  '42   '             INDICATE RELEASE=7770           @LUA 00023900
         AGO   .ENDRLVL                                            @LUA 00024000
.RLVL7760 ANOP                                                     @LUA 00024100
         AIF   ('&RELEASE(1)' NE '7760').RLVL7750                  @LUA 00024200
&RLVL    SETC  '41   '             INDICATE RELEASE=7760           @LUA 00024300
         AGO   .ENDRLVL                                            @LUA 00024400
.RLVL7750 ANOP                                                     @LUA 00024500
         AIF   ('&RELEASE(1)' NE '7750').RLVL7740                  @LUA 00024600
&RLVL    SETC  '40   '             INDICATE RELEASE=7750           @LUA 00024700
         AGO   .ENDRLVL                                            @LUA 00024800
.RLVL7740 ANOP                                                     @LUA 00024900
         AIF   ('&RELEASE(1)' NE '7740').RLVL7730                  @LUA 00025000
&RLVL    SETC  '39   '             INDICATE RELEASE=7740           @LUA 00025100
         AGO   .ENDRLVL                                            @LUA 00025200
.RLVL7730 ANOP                                                     @LUA 00025300
         AIF   ('&RELEASE(1)' NE '7730').RLVL7720                  @LUA 00025400
&RLVL    SETC  '38   '             INDICATE RELEASE=7730           @LUA 00025500
         AGO   .ENDRLVL                                            @LUA 00025600
.RLVL7720 ANOP                                                     @LUA 00025700
         AIF   ('&RELEASE(1)' NE '7720').RLVL7709                  @LUA 00025800
&RLVL    SETC  '37   '             INDICATE RELEASE=7720           @LUA 00025900
         AGO   .ENDRLVL                                            @LUA 00026000
.RLVL7709 ANOP                                                     @LUA 00026100
         AIF   ('&RELEASE(1)' NE '7709').RLVL7708                  @LUA 00026200
&RLVL    SETC  '36   '             INDICATE RELEASE=7709           @LUA 00026300
         AGO   .ENDRLVL                                            @LUA 00026400
.RLVL7708 ANOP                                                     @LUA 00026500
         AIF   ('&RELEASE(1)' NE '7708').RLVL7707                  @LUA 00026600
&RLVL    SETC  '35   '             INDICATE RELEASE=7708           @LUA 00026700
         AGO   .ENDRLVL                                            @LUA 00026800
.RLVL7707 ANOP                                                     @LUA 00026900
         AIF   ('&RELEASE(1)' NE '7707').RLVL7706                  @LUA 00027000
&RLVL    SETC  '34   '             INDICATE RELEASE=7707           @LUA 00027100
         AGO   .ENDRLVL                                            @LUA 00027200
.RLVL7706 ANOP                                                     @LUA 00027300
         AIF   ('&RELEASE(1)' NE '7706').RLVL7705                  @LUA 00027400
&RLVL    SETC  '33   '             INDICATE RELEASE=7706           @LUA 00027500
         AGO   .ENDRLVL                                            @LUA 00027600
.RLVL7705 ANOP                                                     @LUA 00027700
         AIF   ('&RELEASE(1)' NE '7705').RLVL7703                  @LUA 00027800
&RLVL    SETC  '32   '             INDICATE RELEASE=7705           @LUA 00027900
         AGO   .ENDRLVL                                            @LUA 00028000
.RLVL7703 ANOP                                                     @LUA 00028100
         AIF   ('&RELEASE(1)' NE '7703').RLVL2608                  @LUA 00028200
&RLVL    SETC  '31   '             INDICATE RELEASE=7703           @LUA 00028300
         AGO   .ENDRLVL                                            @LUA 00028400
.RLVL2608 ANOP                                                     @LUA 00028500
         AIF   ('&RELEASE(1)' NE '2608').RLVL260                   @LUA 00028600
&RLVL    SETC  '30   '             INDICATE RELEASE=2608           @LUA 00028700
         AGO   .ENDRLVL                                            @LUA 00028800
.RLVL260 ANOP                                                      @LUA 00028900
         AIF   ('&RELEASE(1)' NE '2.6').RLVL240                    @LUA 00029000
&RLVL    SETC  '2.6  '             INDICATE RELEASE=2.6            @LUA 00029100
         AGO   .ENDRLVL                                            @LUA 00029200
.RLVL240 ANOP                                                      @LUA 00029300
         AIF   ('&RELEASE(1)' NE '2.4').RLVL230                    @LUA 00029400
&RLVL    SETC  '2.4  '             INDICATE RELEASE=2.4            @LUA 00029500
         AGO   .ENDRLVL                                            @LUA 00029600
.RLVL230 ANOP                                                      @LUA 00029700
         AIF   ('&RELEASE(1)' NE '2.3').RLVL220                    @LUA 00029800
&RLVL    SETC  '2.3  '             INDICATE RELEASE=2.3            @LUA 00029900
         AGO   .ENDRLVL                                            @LUA 00030000
.RLVL220 ANOP                                                      @LUA 00030100
         AIF   ('&RELEASE(1)' NE '2.2').RLVL210                    @LUA 00030200
&RLVL    SETC  '2.2  '             INDICATE RELEASE=2.2            @LUA 00030300
         AGO   .ENDRLVL                                            @LUA 00030400
.RLVL210 ANOP                                                      @LUA 00030500
         AIF   ('&RELEASE(1)' NE '2.1').RLVL192                    @LUA 00030600
&RLVL    SETC  '2.1  '             INDICATE RELEASE=2.1            @LUA 00030700
         AGO   .ENDRLVL                                            @LUA 00030800
.RLVL192 ANOP                                                      @LUA 00030900
         AIF   ('&RELEASE(1)' NE '1.9.2').RLVL190                  @LUA 00031000
&RLVL    SETC  '1.9.2'             INDICATE RELEASE=1.9.2          @LUA 00031100
         AGO   .ENDRLVL                                            @LUA 00031200
.RLVL190 ANOP                                                      @LUA 00031300
         AIF   ('&RELEASE(1)' NE '1.9').RLVL181                    @LUA 00031400
&RLVL    SETC  '1.9  '             INDICATE RELEASE=1.9            @LUA 00031500
         AGO   .ENDRLVL                                            @LUA 00031600
.RLVL181 ANOP                                                      @LUA 00031700
         AIF   ('&RELEASE(1)' NE '1.8.1').RLVL180                  @LUA 00031800
&RLVL    SETC  '1.8.1'             INDICATE RELEASE= 1.8.1         @LUA 00031900
         AGO   .ENDRLVL                                            @LUA 00032000
.RLVL180 ANOP                                                      @LUA 00032100
         AIF   ('&RELEASE(1)' NE '1.8').RLVL17                     @LUA 00032200
&RLVL    SETC  '1.8  '             INDICATE RELEASE=1.8            @LUA 00032300
         AGO   .ENDRLVL                                            @LUA 00032400
.RLVL17  ANOP                                                      @LUA 00032500
         AIF   ('&RELEASE(1)' NE '1.7').RLVL16                     @LUA 00032600
&RLVL    SETC  '1.7  '             INDICATE RELEASE=1.7            @LUA 00032700
         AGO   .ENDRLVL                                            @LUA 00032800
.RLVL16  ANOP                                                      @LUA 00032900
.NORLVL  ANOP                                                      @LUA 00033000
&RLVL    SETC  '1.6  '             INDICATE RELEASE=1.6            @LUA 00033100
.ENDRLVL ANOP                                                      @LUA 00033200
         AIF   ('&RLVL'(1,3) LT '1.9').SKIPTST                     @LUC 00033300
         AIF   (NOT &ICHRAC).ERR11                                 @L4A 00033400
.ERTN11  ANOP                                                      @L4A 00033500
.SKIPTST ANOP                                                      @L4A 00033600
.************************                                          @D1A 00033700
.* TEST THAT THE FRACHECK KEYWORDS FOR RELEASE 2.1 ARE NOT         @D1A 00033800
.* SPECIFIED WITH PREVIOUS RELEASES.                               @D1A 00033900
.************************                                          @D1A 00034000
         AIF   ('&RELEASE' NE '').DOR21TS                          @D1A 00034100
         AIF   ('&LOG' NE '').ERR15                                @D1A 00034200
         AGO   .NO21TS                                             @D1A 00034300
.DOR21TS ANOP                                                      @D1A 00034400
         AIF   ('&RLVL'(1,3) GE '2.1').NO21TS                      @LUC 00034500
.DO21TS  ANOP                                                      @D1A 00034600
         AIF   ('&LOG' NE '').ERR14                                @D1A 00034700
.NO21TS  ANOP                                                      @D1A 00034800
.ERTN15  ANOP                                                      @D1A 00034900
.ERTN14  ANOP                                                      @D1A 00035000
.*                                                                 @LCD 00035100
.************************                                          @LAA 00035200
.* TEST THAT THE FRACHECK KEYWORDS FOR RELEASE 2.4 ARE NOT         @LAA 00035300
.* SPECIFIED WITH PREVIOUS RELEASES.                               @LAA 00035400
.************************                                          @LAA 00035500
         AIF   ('&RELEASE' NE '').DOR24TS                          @LAA 00035600
         AIF   ('&ACEEALET' NE '').ERR17                           @LAA 00035700
         AGO   .NO24TS                                             @LAA 00035800
.DOR24TS ANOP                                                      @LAA 00035900
         AIF   ('&RLVL'(1,3) GE '2.4').NO24TS                      @LUC 00036000
         AIF   ('&ACEEALET' NE '').ERR16                           @LAA 00036100
.NO24TS  ANOP                                                      @LAA 00036200
.ERTN17  ANOP                                                      @LAA 00036300
.ERTN16  ANOP                                                      @LAA 00036400
.************** TEST LOGSTR  *************************             @LBA 00036500
         AIF   ('&RELEASE' NE '').DOR24T2                          @LBA 00036600
         AIF   ('&LOGSTR' NE '').ERR19                             @LBA 00036700
         AGO   .NO24T2                                             @LBA 00036800
.DOR24T2 ANOP                                                      @LBA 00036900
         AIF   ('&RLVL'(1,3) GE '2.4').NO24T2                      @LUC 00037000
.DO24T2  ANOP                                                      @LBA 00037100
         AIF   ('&LOGSTR' NE '').ERR18                             @LBA 00037200
.NO24T2  ANOP                                                      @LBA 00037300
.ERTN18  ANOP                                                      @LBA 00037400
.ERTN19  ANOP                                                      @LBA 00037500
.************************                                          @LCA 00037600
.* TEST THAT THE FRACHECK KEYWORDS FOR RELEASE 2.6 ARE NOT         @LCA 00037700
.* SPECIFIED WITH PREVIOUS RELEASES.                               @LCA 00037800
.************************                                          @LCA 00037900
.************** TEST ENTITYX *************************             @LCA 00038000
         AIF   ('&RELEASE' NE '').DOR25T2                          @LCA 00038100
         AIF   ('&ENTITYX' NE '').ERR21                            @LCA 00038200
         AGO   .NO25T2                                             @LCA 00038300
.DOR25T2 ANOP                                                      @LCA 00038400
         AIF   ('&RLVL'(1,3) GE '2.6').NO25T2                      @LUC 00038500
.DO25T2  ANOP                                                      @LCA 00038600
         AIF   ('&ENTITYX' NE '').ERR20                            @LCA 00038700
.NO25T2  ANOP                                                      @LCA 00038800
.* VERIFY THAT ENTITY AND ENTITYX ARE NOT BOTH SPECIFIED           @LCA 00038900
         AIF   ('&ENTITYX' NE '' AND '&ENTITY' NE '').ERR22        @LCA 00039000
.ERTN20  ANOP                                                      @LCA 00039100
.ERTN21  ANOP                                                      @LCA 00039200
.ERTN22  ANOP                                                      @LCA 00039300
.************** TEST ENVRIN  *************************             @02A 00039400
.* VERIFY THAT ENVRIN IS SPECIFIED WITH RELEASE 2.6 OR LATER       @02A 00039500
         AIF   ('&RELEASE' NE '').DOR25T3                          @02A 00039600
         AIF   ('&ENVRIN' NE '' AND NOT &ICHRAC).ERR23             @02A 00039700
         AGO   .NO25T3                                             @02A 00039800
.DOR25T3 ANOP                                                      @02A 00039900
         AIF   ('&ENVRIN' NE '' AND NOT &ICHRAC).ERR23             @02A 00040000
         AIF   ('&RLVL'(1,3) GE '2.6').NO25T3                      @LUC 00040100
.DO25T3  ANOP                                                      @02A 00040200
         AIF   ('&ENVRIN' NE '').ERR24                             @02A 00040300
.NO25T3  ANOP                                                      @02A 00040400
.* VERIFY THAT ACEE AND ENVRIN ARE NOT BOTH SPECIFIED              @02A 00040500
         AIF   ('&ENVRIN' NE '' AND '&ACEE' NE '').ERR25           @02A 00040600
.* ISSUE INFORMATIONAL MESSAGE IF ACEEALET WAS SPECIFIED           @02A 00040700
         AIF   ('&ENVRIN' NE '' AND '&ACEEALET' NE '').ERR26       @02A 00040800
.ERTN23  ANOP                                                      @02A 00040900
.ERTN24  ANOP                                                      @02A 00041000
.ERTN25  ANOP                                                      @02A 00041100
.ERTN26  ANOP                                                      @02A 00041200
.************************                                          @LMA 00041300
.* TEST THAT THE FRACHECK KEYWORDS FOR RELEASE 7730 ARE NOT        @LMA 00041400
.* SPECIFIED WITH PREVIOUS RELEASES.                               @LMA 00041500
.************************                                          @LMA 00041600
.************** TEST CRITERIA ************************             @LMA 00041700
         AIF   ('&RELEASE' NE '').DO31T2                           @LMA 00041800
         AIF   ('&CRITERIA' NE '').ERR27                           @LMA 00041900
         AGO   .NO31T2                                             @LMA 00042000
.DO31T2  ANOP                                                      @LMA 00042100
         AIF   ('&RLVL'(1,2) GE '38').NO31T2  -GE Release 7730     @LUC 00042200
         AIF   ('&CRITERIA' NE '').ERR28                           @LMA 00042300
.NO31T2  ANOP                                                      @LMA 00042400
.ERTN27  ANOP                                                      @LMA 00042500
.ERTN28  ANOP                                                      @LMA 00042600
.************** TEST AUTHCHKS ************************             @LNA 00042700
         AIF   ('&RELEASE' NE '').DO32T2                           @LNA 00042800
         AIF   ('&AUTHCHKS' NE '').ERR29                           @LNA 00042900
         AGO   .NO32T2                                             @LNA 00043000
.DO32T2  ANOP                                                      @LNA 00043100
         AIF   ('&RLVL'(1,2) GE '38').NO32T2  -GE Release 7730     @LUC 00043200
         AIF   ('&AUTHCHKS' NE '').ERR30                           @LNA 00043300
.NO32T2  ANOP                                                      @LMA 00043400
.ERTN29  ANOP                                                      @LNA 00043500
.ERTN30  ANOP                                                      @LNA 00043600
.*                                                                 @LWA 00043700
.*****************************************************             @LWA 00043800
.* Test that the FRACHECK keywords for release 77B0                @LWA 00043900
.* are not specified with previous releases.                       @LWA 00044000
.*****************************************************             @LWA 00044100
.*                                                                 @LWA 00044200
.************** Test LOGSTRX *************************             @LWA 00044300
.*                                                                 @LWA 00044400
         AIF   ('&RELEASE' NE '').DO33T2                           @LWA 00044500
         AIF   ('&LOGSTRX' NE '').ERR33                            @LWA 00044600
         AGO   .NO33T2                                             @LWA 00044700
.DO33T2  ANOP                                                      @LWA 00044800
         AIF   ('&RLVL'(1,2) GE '46').NO33T2  -GE Release 77B0     @LWA 00044900
         AIF   ('&LOGSTRX' NE '').ERR34                            @LWA 00045000
.NO33T2  ANOP                                                      @LWA 00045100
.ERTN33  ANOP                                                      @LWA 00045200
.ERTN34  ANOP                                                      @LWA 00045300
.*                                                                 @LWA 00045400
.************************                                          @02A 00045500
.* NOW VALIDATE KEYWORD VALUES                                     @02A 00045600
.************************                                          @02A 00045700
.******* VALIDATE ATTR PARAMETER                                        00045800
         AIF   ('&ATTR' EQ 'READ' OR '&ATTR' EQ 'ALTER'                -00045900
                OR '&ATTR' EQ '').RCHK000                               00046000
         AIF   ( '&ATTR' EQ 'UPDATE' OR '&ATTR' EQ                     -00046100
               'CONTROL' OR '&ATTR'(1,1) EQ '(').RCHK000                00046200
         AGO   .ERR04                                                   00046300
.ERTN04  ANOP                                                           00046400
.RCHK000 ANOP                                                           00046500
.******* CHECK FOR VALID VALUES OF LOG                             @D1A 00046600
         AIF   ('&LOG' EQ '').RCHK002                              @D1A 00046700
         AIF   (NOT &ICHRAC).ERR13                                 @D1A 00046800
.ERTN13  ANOP                                                      @D1A 00046900
         AIF   ('&LOG' EQ ' ').RCHK002                             @D1A 00047000
         AIF   ('&LOG' EQ 'NONE').RCHK002                          @D1A 00047100
         AIF   ('&LOG' EQ 'ASIS').RCHK002                          @D1A 00047200
         AIF   ('&LOG' NE 'NOFAIL').ERR12                          @D1A 00047300
.ERTN12  ANOP                                                      @D1A 00047400
.RCHK002 ANOP                                                      @D1A 00047500
.******* CHECK FOR VALID VALUES OF AUTHCHKS                        @LNA 00047600
         AIF   ('&AUTHCHKS' EQ '').RCHK003                         @LNA 00047700
         AIF   (NOT &ICHRAC).ERR32                                 @LNA 00047800
.ERTN32  ANOP                                                      @LNA 00047900
         AIF   ('&AUTHCHKS' EQ ' ').RCHK003                        @LNA 00048000
         AIF   ('&AUTHCHKS' EQ 'ALL').RCHK003                      @LNA 00048100
         AIF   ('&AUTHCHKS' EQ 'CRITONLY').RCHK003                 @LNA 00048200
         AGO   .ERR31                                              @LNA 00048300
.ERTN31  ANOP                                                      @LNA 00048400
.RCHK003 ANOP                                                      @LNA 00048500
.*                                                                 @LWA 00048600
.******* Check for valid values of LOGSTRX                         @LWA 00048700
.*                                                                 @LWA 00048800
         AIF   ('&LOGSTRX' EQ '').RCHK004                          @LWA 00048900
         AIF   (NOT &ICHRAC).ERR36                                 @LWA 00049000
.ERTN36  ANOP                                                      @LWA 00049100
         AIF   ('&LOGSTRX' EQ ' ').RCHK004                         @LWA 00049200
         AIF   ('&LOGSTRX' EQ 'YES').RCHK004                       @LWA 00049300
         AIF   ('&LOGSTRX' EQ 'NO').RCHK004                        @LWA 00049400
         AGO   .ERR35                                              @LNA 00049500
.ERTN35  ANOP                                                      @LWA 00049600
.RCHK004 ANOP                                                      @LWA 00049700
.*                                                                      00049800
.******* Ensure that LOGSTR= has been specified with LOGSTRX=YES   @LWA 00049900
.*                                                                 @LWA 00050000
         AIF   ('&LOGSTRX' EQ 'YES' AND '&LOGSTR' EQ '').ERR37     @LWA 00050100
.ERTN37  ANOP                                                      @LWA 00050200
.RCHK005 ANOP                                                      @LWA 00050300
.*                                                                      00050400
.******* VALIDATE MF PARAMETER                                          00050500
         AIF   ('&MF' NE 'S' AND '&MF' NE 'L' AND '&MF'(1,2) NE        -00050600
               '(E').ERR06                                              00050700
.ERTN06  ANOP                                                           00050800
.******* REGISTER SPECIFICATION OF ADDR TYPE PARAMETERS NOT             00050900
.******* ALLOWED WITH LIST FORM                                         00051000
         AIF   ('&MF' NE 'L').RCHK020                                   00051100
         AIF   ('&ATTR' EQ '').RCHK010                                  00051200
         AIF   ('&ATTR'(1,1) EQ '(').ERR07                              00051300
.RCHK010 ANOP                                                           00051400
         AIF   ('&ENTITY' EQ '').RCHK011                                00051500
         AIF   ('&ENTITY'(1,1) EQ '(').ERR07                            00051600
.RCHK011 ANOP                                                           00051700
         AIF   ('&ENTITYX' EQ '').RCHK11A                          @LCA 00051800
         AIF   ('&ENTITYX'(1,1) EQ '(').ERR07                      @LCA 00051900
.RCHK11A ANOP                                                      @LCA 00052000
         AIF   ('&ENVRIN' EQ '').RCHK11B                           @02A 00052100
         AIF   ('&ENVRIN'(1,1) EQ '(').ERR07                       @02A 00052200
.RCHK11B ANOP                                                      @02A 00052300
         AIF   ('&CLASS' EQ '').RCHK012                                 00052400
         AIF   ('&CLASS'(1,1) EQ '(').ERR07                             00052500
.RCHK012 ANOP                                                           00052600
         AIF   ('&ACEE' EQ '').RCHK013                                  00052700
         AIF   ('&ACEE'(1,1) EQ '(').ERR07                              00052800
.RCHK013 ANOP                                                           00052900
         AIF   ('&APPL' EQ '').RCHK014                                  00053000
         AIF   ('&APPL'(1,1) EQ '(').ERR07                              00053100
.RCHK014 ANOP                                                           00053200
         AIF   ('&WKAREA' EQ '').RCHK015                                00053300
         AIF   ('&WKAREA'(1,1) EQ '(').ERR07                            00053400
.RCHK015 ANOP                                                           00053500
         AIF   ('&INSTLN(1)' NE '&INSTLN').ERR07                        00053600
.RCHK016 ANOP                                                     @LAA  00053700
         AIF   ('&ACEEALET' EQ '').RCHK017                        @LAA  00053800
         AIF   ('&ACEEALET'(1,1) EQ '(').ERR07                    @LAA  00053900
.RCHK017 ANOP                                                     @LBA  00054000
         AIF   ('&LOGSTR' EQ '').RCHK018                          @LMC  00054100
         AIF   ('&LOGSTR'(1,1) EQ '(').ERR07                      @LBA  00054200
.RCHK018 ANOP                                                     @LMA  00054300
         AIF   ('&CRITERIA' EQ '').RCHK020                        @LMA  00054400
         AIF   ('&CRITERIA'(1,1) EQ '(').ERR07                    @LMA  00054500
.RCHK020 ANOP                                                           00054600
.ERTN07  ANOP                                                           00054700
.*                                                                      00054800
.******* PRODUCE LIST FORM IF REQUESTED                                 00054900
.*                                                                      00055000
         AIF   ('&MF' NE 'L').RCHK400                                   00055100
&SYMBOL  DS    0F                                                       00055200
.RCHK100 ANOP                                                           00055300
ICH0&SYSNDX EQU *                                                       00055400
.RCHK105 ANOP                                                           00055500
.******* PRODUCE FLAG BYTE WITH ATTR PARAMETER                          00055600
&BIT0    SETA  0                                                        00055700
&BIT1    SETA  0                                                        00055800
&BIT4    SETA  0                                                        00055900
&BIT5    SETA  0                                                        00056000
&BIT6    SETA  0                                                        00056100
         AIF   ('&ATTR' EQ '').RCHK125                                  00056200
         AIF   ('&ATTR'(1,1) EQ '(').RCHK130                            00056300
         AIF   ('&ATTR' NE 'ALTER').RCHK110                             00056400
&BIT0    SETA  1                                                        00056500
         AGO   .RCHK130                                                 00056600
.RCHK110 ANOP                                                           00056700
         AIF   ('&ATTR' NE 'CONTROL').RCHK115                           00056800
&BIT4    SETA  1                                                        00056900
         AGO   .RCHK130                                                 00057000
.RCHK115 ANOP                                                           00057100
         AIF   ('&ATTR' NE 'UPDATE').RCHK120                            00057200
&BIT5    SETA  1                                                        00057300
         AGO   .RCHK130                                                 00057400
.RCHK120 ANOP                                                           00057500
         AIF   ('&ATTR' NE 'READ').RCHK130                              00057600
.RCHK125 ANOP                                                           00057700
&BIT6    SETA  1                                                        00057800
.RCHK130 ANOP                                                           00057900
.******* PRODUCE FLAG BYTE WITH LOG PARAMETER                      @D1A 00058000
&BIT8    SETA  0                                                   @D1A 00058100
&BIT9    SETA  0                                                   @D1A 00058200
&BIT10   SETA  0                                                   @LCA 00058300
         AIF   (&LGERRFG).RCHK140                                  @D1A 00058400
         AIF   ('&LOG' EQ '').RCHK140                              @D1A 00058500
         AIF   ('&LOG' EQ 'NONE').RCHK140                          @D1A 00058600
         AIF   ('&LOG' NE 'ASIS').RCHK135                          @D1A 00058700
&BIT8    SETA  1                        SET FOR LOG=ASIS           @D1A 00058800
         AGO   .RCHK140                                            @D1A 00058900
.RCHK135 ANOP                                                      @D1A 00059000
         AIF   ('&LOG' NE 'NOFAIL').RCHK140                        @D1A 00059100
&BIT9    SETA  1                        SET FOR LOG=NOFAIL         @D1A 00059200
.RCHK140 ANOP                                                      @D1A 00059300
         AIF   ('&ENTITYX' EQ '').RCHK141                          @LCA 00059400
&BIT10   SETA  1                        SET FOR ENTITYX            @LCA 00059500
.RCHK141 ANOP                                                      @LCA 00059600
.******* PRODUCE FLAG BYTE WITH AUTHCHKS                           @LNA 00059700
&BIT11   SETA  0                        AUTHCHKS=ALL or default    @LNA 00059800
         AIF   (&ACHKERR).RCHK305       INCORRECT AUTHCHKS PARM    @LNA 00059900
         AIF   ('&AUTHCHKS' EQ '').RCHK305                         @LNA 00060000
         AIF   ('&AUTHCHKS' EQ 'ALL').RCHK305                      @LNA 00060100
&BIT11   SETA  1                        AUTHCHKS=CRITONLY          @LNA 00060200
.RCHK305 ANOP                  AUTHCHKS=ALL or default or bad parm @LNA 00060300
.*                                                                 @LWA 00060400
.******* Produce flag byte with LOGSTRX                            @LWA 00060500
.*                                                                 @LWA 00060600
&BIT12   SETA  0                        LOGSTRX=NO or default      @LWA 00060700
         AIF   (&LOGXERR).RCHK306       INCORRECT LOGSTRX PARM     @LWA 00060800
         AIF   ('&LOGSTRX' EQ '').RCHK306                          @LWA 00060900
         AIF   ('&LOGSTRX' EQ 'NO').RCHK306                        @LWA 00061000
&BIT12   SETA  1                        LOGSTRX=YES                @LWA 00061100
.RCHK306 ANOP                   LOGSTRX=NO or default or bad parm  @LWA 00061200
.*                                                                 @LWA 00061300
&ICHL    DC    B'&BIT0.000&BIT4&BIT5&BIT6.0' - ATTR VALUE               00061400
.*                                                                 @LWA 00061500
.******* Set the flag byte with the LOG / AUTHCHKS and             @LWA 00061600
.*                                  LOGSTRX bits                   @LWA 00061700
.*                                                                 @LWA 00061800
         DC    B'&BIT8&BIT9&BIT10&BIT11&BIT12.000'  - LOG/AUTHCHKS/     00061900
*                                                     LOGSTRX      @LWC 00062000
.*                                                                 @LWA 00062100
.******* PRODUCE PARAMETER LIST LENGTH AND VERSION FIELDS          @D2A 00062200
         AIF   ('&RELEASE' EQ '').RCHK145                          @D2A 00062300
         AIF   ('&RLVL'(1,3) LT '2.4').RCHK145                     @LUC 00062400
         AIF   ('&RLVL'(1,3) LT '2.6').RCHK144                     @LUC 00062500
         AIF   ('&RLVL'(1,2) LT '38').RCHK143   -LT Release 7730   @LUC 00062600
.*       FOR RELEASE 7730 OR LATER                                 @LMA 00062700
&PARMLEN SETA  44                                                  @LMA 00062800
&VERSION SETA  3                                                   @LMA 00062900
         AGO   .RCHK145                                            @LMA 00063000
.*       FOR RELEASE 2.6 OR LATER                                  @02A 00063100
.RCHK143 ANOP                                                      @LMA 00063200
&PARMLEN SETA  40                                                  @02A 00063300
&VERSION SETA  2                                                   @02A 00063400
         AGO   .RCHK145                                            @02A 00063500
.*       FOR RELEASE 2.4 OR EARLIER                                @02A 00063600
.RCHK144 ANOP                                                      @02A 00063700
&PARMLEN SETA  36                                                  @D2A 00063800
&VERSION SETA  1                                                   @D2A 00063900
.RCHK145 ANOP                                                      @D2A 00064000
         DC    AL1(&PARMLEN)   - PARAMETER LIST LENGTH             @D2A 00064100
         DC    AL1(&VERSION)   - PARAMETER LIST VERSION            @D2A 00064200
.******* PRODUCE ENTITY NAME *****                                      00064300
         AIF   ('&ENTITY' EQ '').RCHK150                                00064400
         AIF   ('&ENTITY'(1,1) EQ '(').RCHK151                     @LCC 00064500
         DC    A(&ENTITY) - ENTITY NAME ADDRESS                         00064600
         AGO   .RCHK155                                                 00064700
.RCHK150 ANOP                                                           00064800
         AIF   ('&ENTITYX' EQ '').RCHK151                          @LCA 00064900
         AIF   ('&ENTITYX'(1,1) EQ '(').RCHK151                    @LCA 00065000
         DC    A(&ENTITYX) - ENTITYX NAME ADDRESS                  @LCA 00065100
         AGO   .RCHK155                                            @LCA 00065200
.RCHK151 ANOP                                                      @LCA 00065300
         DC    A(0)            - ENTITY NAME ADDRESS                    00065400
.RCHK155 ANOP                                                           00065500
.******* PRODUCE CLASS NAME ADDRESS IF REQUIRED                         00065600
         AIF   ('&CLASS' EQ '').RCHK165                                 00065700
         AIF   ('&CLASS'(1,1) EQ '(').RCHK165                           00065800
         AIF   ('&CLASS'(1,1) EQ '''').RCHK160                          00065900
         DC    A(&CLASS) -  CLASS NAME ADDRESS                          00066000
         AGO   .RCHK170                                                 00066100
.RCHK160 ANOP                                                           00066200
         DC    A(ICH1&SYSNDX) CLASS NAME ADDRESS WITHIN LIST            00066300
         AGO   .RCHK170                                                 00066400
.RCHK165 ANOP                                                           00066500
         DC    A(0) -       CLASS NAME ADDRESS FIELD                    00066600
.RCHK170 ANOP                                                           00066700
.******* PROCESS ACEE PARAMETER                                         00066800
         AIF   ('&ACEE' EQ '' ).RCHK175                                 00066900
         AIF   ('&ACEE'(1,1) EQ '(').RCHK175                            00067000
         DC    A(&ACEE) - ACEE ADDRESS                                  00067100
         AGO   .RCHK180                                                 00067200
.RCHK175 ANOP                                                           00067300
         DC    A(0)    - ACEE ADDRESS                                   00067400
.RCHK180 ANOP                                                           00067500
.******* PROCESS APPL PARAMETER                                         00067600
         AIF   ('&APPL' EQ '').RCHK190                                  00067700
         AIF   ('&APPL'(1,1) EQ '(').RCHK190                            00067800
         AIF   ('&APPL'(1,1) EQ '''').RCHK185                           00067900
         DC    A(&APPL) -   APPL NAME ADDRESS                           00068000
         AGO   .RCHK195                                                 00068100
.RCHK185 ANOP                                                           00068200
         DC    A(ICH2&SYSNDX) APPL NAME ADDRESS WITHIN LIST             00068300
         AGO   .RCHK195                                                 00068400
.RCHK190 ANOP                                                           00068500
         DC    A(0) -       APPL NAME ADDRESS FIELD                     00068600
.RCHK195 ANOP                                                           00068700
.******* PROCESS WKAREA PARAMETER                                       00068800
         AIF   ('&WKAREA' EQ '').RCHK200                                00068900
         AIF   ('&WKAREA'(1,1) EQ '(').RCHK200                          00069000
         DC    A(&WKAREA) - WORK AREA ADDRESS                           00069100
         AGO   .RCHK205                                                 00069200
.RCHK200 ANOP                                                           00069300
         DC    A(0) - WORK AREA ADDRESS                                 00069400
.RCHK205 ANOP                                                           00069500
.******* PROCESS INSTLN PARAMETER                                       00069600
         AIF   ('&INSTLN' EQ '' OR                                     *00069700
               '&INSTLN(1)' NE '&INSTLN').RCHK210                       00069800
         DC    A(&INSTLN) - ADDRESS OF INSTALLATION DATA                00069900
         AGO   .RCHK215                                                 00070000
.RCHK210 ANOP                                                           00070100
         DC    A(0) - ADDRESS OF INSTALLATION DATA                      00070200
.RCHK215 ANOP                                                           00070300
.***************************************************************   @P3A 00070400
.* BYPASS PROCESSING OF NEW KEYWORDS INTRODUCED IN RELEASE 2.4     @P3A 00070500
.* IF LOWER LEVEL RELEASE IS SPECIFIED.                            @P3A 00070600
.***************************************************************   @P3A 00070700
         AIF   ('&RELEASE' EQ '').RCHK229                          @P4A 00070800
         AIF   ('&RLVL'(1,3) LT '2.4').RCHK229                     @LUC 00070900
.******* PROCESS ACEEALET PARAMETER                                @LAA 00071000
         AIF   ('&ACEEALET' EQ '').RCHK220                         @LAA 00071100
         AIF   ('&ACEEALET'(1,1) EQ '(').RCHK220                   @LAA 00071200
         DC    A(&ACEEALET) - ACEEALET ADDRESS                     @LAA 00071300
         AGO   .RCHK225                                            @LAA 00071400
.RCHK220 ANOP                                                      @LAA 00071500
         DC    A(0) - ACEEALET ADDRESS                             @LAA 00071600
.RCHK225 ANOP                                                      @LAA 00071700
.******* PROCESS LOGSTR PARAMETER                                  @LBA 00071800
         AIF   ('&LOGSTR' EQ '').RCHK227 LOGSTR OMITTED            @LBA 00071900
         AIF   ('&LOGSTR'(1,1) EQ '(').RCHK227                     @LBA 00072000
         DC    A(&LOGSTR)    - LOGSTR ADDRESS                      @LBA 00072100
         AGO   .RCHK229                                            @LBA 00072200
.RCHK227 ANOP                                                      @LBA 00072300
         DC    A(0) - LOGSTR ADDRESS                               @LBA 00072400
.RCHK229 ANOP                                                      @LBA 00072500
.***************************************************************   @02A 00072600
.* BYPASS PROCESSING OF NEW KEYWORDS INTRODUCED IN RELEASE 2.6     @02A 00072700
.* IF LOWER LEVEL RELEASE IS SPECIFIED.                            @02A 00072800
.***************************************************************   @02A 00072900
         AIF   ('&RELEASE' EQ '').RCHK255                          @02A 00073000
         AIF   ('&RLVL'(1,3) LT '2.6').RCHK255                     @LUC 00073100
.******* PROCESS ENVRIN PARAMETER                                  @02A 00073200
         AIF   ('&ENVRIN' EQ '').RCHK253                           @02A 00073300
         AIF   ('&ENVRIN'(1,1) EQ '(').RCHK253                     @02A 00073400
         DC    A(&ENVRIN)    - ENVRIN ADDRESS                      @02A 00073500
         AGO   .RCHK255                                            @02A 00073600
.RCHK253 ANOP                                                      @02A 00073700
         DC    A(0)          - ENVRIN ADDRESS                      @02A 00073800
.RCHK255 ANOP                                                      @02A 00073900
.***************************************************************   @LMA 00074000
.* BYPASS PROCESSING OF NEW KEYWORDS INTRODUCED IN RELEASE 7730    @LMA 00074100
.* IF LOWER LEVEL RELEASE IS SPECIFIED.                            @LMA 00074200
.***************************************************************   @LMA 00074300
         AIF   ('&RELEASE' EQ '').RCHK259                          @LMA 00074400
         AIF   ('&RLVL'(1,2) LT '38').RCHK259   -LT Release 7730   @LUC 00074500
.******* PROCESS CRITERIA PARAMETER                                @LMA 00074600
         AIF   ('&CRITERIA' EQ '').RCHK256                         @LMA 00074700
         AIF   ('&CRITERIA'(1,1) EQ '(').RCHK256                   @LMA 00074800
         DC    A(&CRITERIA)    - CRITERIA ADDRESS                  @LMA 00074900
         AGO   .RCHK259                                            @LMA 00075000
.RCHK256 ANOP                                                      @LMA 00075100
         DC    A(0)          - CRITERIA ADDRESS                    @LMA 00075200
.RCHK259 ANOP                                                      @LMA 00075300
.******* IF CLASSNAME SPECIFIED EXPLICITLY, PRODUCE IT BELOW LIST FORM  00075400
         AIF   ('&CLASS' EQ '').RCHK230                                 00075500
         AIF   ('&CLASS'(1,1) NE '''').RCHK230                          00075600
ICH1&SYSNDX DC    CL8&CLASS    - CLASS NAME                             00075700
.RCHK230 ANOP                                                           00075800
.******* IF APPL NAME SPECIFIED EXPLICITLY, PRODUCE IT BELOW LIST FORM  00075900
         AIF   ('&APPL' EQ '').RCHK240                                  00076000
         AIF   ('&APPL'(1,1) NE '''').RCHK240                           00076100
ICH2&SYSNDX DC    CL8&APPL - APPL NAME                                  00076200
.RCHK240 ANOP                                                           00076300
.******* LIST FORM COMPLETE - TEST FOR STANDARD FORM PASS               00076400
.******* THROUGH LIST FORM                                              00076500
         AIF   (&MFFLAG).RCHK510                                        00076600
         MEXIT                                                          00076700
.******* TEST FOR STANDARD FORM OR EXECUTE FORM OF MACRO                00076800
.RCHK400 ANOP                                                           00076900
         AIF   ('&MF(1)' EQ 'E').RCHK600                                00077000
.******* STANDARD FORM REQUESTED                                        00077100
&SYMBOL  DS    0H                                                       00077200
&MFFLAG  SETB  1              SET TRUE FOR PASS THROUGH LIST FORM       00077300
.******* PRODUCE INSTRUCTIONS TO MODIFY IN-LINE LIST FORM               00077400
.******* WITH REGISTER ADDRS                                            00077500
         AIF   ('&ATTR' EQ '').RCHK410                                  00077600
         AIF   ('&ATTR'(1,1) NE '(').RCHK410                            00077700
         STC   &ATTR(1),ICH0&SYSNDX - STORE ATTR VALUE                  00077800
.RCHK410 ANOP                                                           00077900
         AIF   ('&ENTITY' EQ '').RCHK420                                00078000
         AIF   ('&ENTITY'(1,1) NE '(').RCHK420                          00078100
         AIF   ('&RELEASE' EQ '').RCHK411                          @P5A 00078200
         AIF   ('&RLVL'(1,3) LT '2.6').RCHK411                     @LUC 00078300
         NI    ICH0&SYSNDX+1,X'DF'    - TURN OFF ENTITYX INDICATOR @LCA 00078400
.RCHK411 ANOP                                                      @P5A 00078500
         ST    &ENTITY,ICH0&SYSNDX+4          -STORE ENTITY ADDRESS     00078600
.RCHK420 ANOP                                                           00078700
         AIF   ('&ENTITYX' EQ '').RCHK425                          @LCA 00078800
         AIF   ('&ENTITYX'(1,1) NE '(').RCHK425                    @LCA 00078900
         OI    ICH0&SYSNDX+1,X'20'    - TURN ON ENTITYX INDICATOR  @LCA 00079000
         ST    &ENTITYX,ICH0&SYSNDX+4       -STORE ENTITYX ADDRESS @LCA 00079100
.RCHK425 ANOP                                                      @LCA 00079200
         AIF   ('&CLASS' EQ '').RCHK430                                 00079300
         AIF   ('&CLASS'(1,1) NE '(').RCHK430                           00079400
         ST    &CLASS(1),ICH0&SYSNDX+8 - STORE CLASS NAME ADDRESS       00079500
.RCHK430 ANOP                                                           00079600
         AIF   ('&ACEE' EQ '').RCHK440                                  00079700
         AIF   ('&ACEE'(1,1) NE '(').RCHK440                            00079800
         ST    &ACEE(1),ICH0&SYSNDX+12 - STORE ACEE ADDRESS             00079900
.RCHK440 ANOP                                                           00080000
         AIF   ('&APPL' EQ '').RCHK450                                  00080100
         AIF   ('&APPL'(1,1) NE '(').RCHK450                            00080200
         ST    &APPL(1),ICH0&SYSNDX+16 - STORE APPL ADDRESS             00080300
.RCHK450 ANOP                                                           00080400
         AIF   ('&WKAREA' EQ '').RCHK460                                00080500
         AIF   ('&WKAREA'(1,1) NE '(').RCHK460                          00080600
         ST    &WKAREA(1),ICH0&SYSNDX+20 - STORE WKAREA ADDRESS         00080700
.RCHK460 ANOP                                                           00080800
         AIF   ('&INSTLN' EQ '' OR '&INSTLN(1)' EQ '&INSTLN').RCHK470   00080900
         ST    &INSTLN(1),ICH0&SYSNDX+24 - STORE INSTALLATION DATA ADDR 00081000
.RCHK470 ANOP                                                           00081100
.***************************************************************   @P3A 00081200
.* BYPASS PROCESSING OF NEW KEYWORDS INTRODUCED IN RELEASE 2.4     @P3A 00081300
.* IF LOWER LEVEL RELEASE IS SPECIFIED.                            @P3A 00081400
.***************************************************************   @P3A 00081500
         AIF   ('&RELEASE' EQ '').RCHK485                          @P4A 00081600
         AIF   ('&RLVL'(1,3) LT '2.4').RCHK485                     @LUC 00081700
&OFFSET  SETA  &OFFSET+8   ADD OFFSETS FOR ACEEALET AND LOGSTR     @P3A 00081800
         AIF   ('&ACEEALET' EQ '').RCHK480                         @LAA 00081900
         AIF   ('&ACEEALET'(1,1) NE '(').RCHK480                   @LAA 00082000
         ST    &ACEEALET(1),ICH0&SYSNDX+28 -STORE ACEEALET ADDRESS @LAA 00082100
.RCHK480 ANOP                                                      @LAA 00082200
         AIF   ('&LOGSTR' EQ '').RCHK485                           @LBA 00082300
         AIF   ('&LOGSTR'(1,1) NE '(').RCHK485                     @LBA 00082400
         ST    &LOGSTR(1),ICH0&SYSNDX+32 - STORE LOGSTR ADDRESS    @LBA 00082500
.RCHK485 ANOP                                                      @LBA 00082600
.***************************************************************   @02A 00082700
.* BYPASS PROCESSING OF NEW KEYWORDS INTRODUCED IN RELEASE 2.6     @02A 00082800
.* IF LOWER LEVEL RELEASE IS SPECIFIED.                            @02A 00082900
.***************************************************************   @02A 00083000
         AIF   ('&RELEASE' EQ '').RCHK487                          @02A 00083100
         AIF   ('&RLVL'(1,3) LT '2.6').RCHK487                     @LUC 00083200
&OFFSET  SETA  &OFFSET+4   ADD OFFSETS FOR ENVRIN                  @02A 00083300
         AIF   ('&ENVRIN' EQ '').RCHK487                           @02A 00083400
         AIF   ('&ENVRIN'(1,1) NE '(').RCHK487                     @02A 00083500
         ST    &ENVRIN(1),ICH0&SYSNDX+36 - STORE ENVRIN ADDRESS    @02A 00083600
.RCHK487 ANOP                                                      @02A 00083700
.***************************************************************   @LMA 00083800
.* BYPASS PROCESSING OF NEW KEYWORDS INTRODUCED IN RELEASE 7730    @LMA 00083900
.* IF LOWER LEVEL RELEASE IS SPECIFIED.                            @LMA 00084000
.***************************************************************   @LMA 00084100
         AIF   ('&RELEASE' EQ '').RCHK488                          @LMA 00084200
         AIF   ('&RLVL'(1,2) LT '38').RCHK488   -LT Release 7730   @LUC 00084300
&OFFSET  SETA  &OFFSET+4   ADD OFFSETS FOR CRITERIA                @LMA 00084400
         AIF   ('&CRITERIA' EQ '').RCHK488                         @LMA 00084500
         AIF   ('&CRITERIA'(1,1) NE '(').RCHK488                   @LMA 00084600
         ST    &CRITERIA(1),ICH0&SYSNDX+40 - STORE CRITERIA ADDR   @LMA 00084700
.RCHK488 ANOP                                                      @LMA 00084800
.******* LIST FORM MODIFICATION COMPLETE - PRODUCE                      00084900
.******* LIST FORM WITH BAL AROUND                                      00085000
         AIF   ('&CLASS' EQ '').RCHK490                            @LAC 00085100
         AIF   ('&CLASS'(1,1) NE '''').RCHK490                     @LAC 00085200
&OFFSET  SETA  &OFFSET+8                                                00085300
.RCHK490 ANOP                                                      @LAC 00085400
         AIF   ('&APPL' EQ '').RCHK495                             @LAC 00085500
         AIF   ('&APPL'(1,1) NE '''').RCHK495                      @LAC 00085600
&OFFSET  SETA  &OFFSET+8                                                00085700
.RCHK495 ANOP                                                      @LAC 00085800
         CNOP  0,4                                                      00085900
         BAL   1,*+&OFFSET    POINT REG 1 AT PARM LIST                  00086000
         AGO   .RCHK100       GO TO PRODUCE LIST                        00086100
.RCHK510 ANOP                                                           00086200
.***********************************************************       @T1A 00086300
.* IF THIS MACRO WAS INVOKED INTERNALLY BY THE RACROUTE            @T1A 00086400
.* MACRO, SIMPLY EXIT RATHER THAN GOING TO THE RACF ROUTINE.       @T1A 00086500
.***********************************************************       @T1A 00086600
         AIF   (&ICHRAC).RCHK520                                   @T1A 00086700
.******* RETURN FROM LIST FORM TO PRODUCE INTERFACE CODE                00086800
         L     15,16(0,0)            GET CVT ADDRESS                    00086900
         L     15,X'3E0'(0,15)       GET RACF CVT ADDRESS               00087000
         LTR   15,15                 RACF CVT EXIST                     00087100
         BZ    *+12                  NO, BRANCH TO SET NOT ACTIVE       00087200
         CLI   X'AC'(15),X'02'       RACF FUNCTION SUPPORTED (RCVTVERS) 00087300
         BNL   *+12                  YES, BRANCH                        00087400
         LA    15,20(0,0)            RACF FUNCTION NOT SUPPORTED        00087500
         B     *+10                  SKIP CALL                          00087600
         L     15,X'C4'(0,15)        GET ADDRESS OF FRACHECK ROUTINE    00087700
         BALR  14,15                 CALL FRACHECK ROUTINE              00087800
.RCHK520 ANOP                                                      @T1A 00087900
         MEXIT                                                          00088000
.******* PRODUCE EXECUTE FORM OF MACRO                                  00088100
.******* PRODUCE INSTRUCTIONS TO MODIFY LIST                            00088200
.******* PRODUCE FLAGS HALF-WORD WITH ATTR/LOG/ENTITYX/AUTHCHKS/   @LNC 00088300
.*******                              LOGSTRX                      @LWA 00088400
.RCHK600 ANOP                                                           00088500
         AIF   (&ICHRAC).RCHK603                                   @T1A 00088600
&SYMBOL  IHBINNRA &MF(2) -    POINT REG1 AT LIST FORM                   00088700
         AGO   .RCHK605                                            @T1A 00088800
.**************************************************************    @T1A 00088900
.*  IF THIS MACRO WERE INVOKED INTERNALLY BY THE RACROUTE MACRO,   @T1A 00089000
.*  PICK UP THE ADDRESS OF THE FRACHECK PARAMETER LIST FROM THE    @T1A 00089100
.*  RACROUTE PARAMETER LIST.                                       @T1A 00089200
.**************************************************************    @T1A 00089300
.RCHK603 ANOP                                                      @T1A 00089400
         A     1,36(1)         POINT REG 1 AT FRACHECK LIST        @T1A 00089500
.RCHK605 ANOP                                                      @T1A 00089600
         AIF   ('&ATTR' EQ '').RCHK650                                  00089700
         AIF   ('&ATTR'(1,1) EQ '(').RCHK640                            00089800
         AIF   ('&ATTR' NE 'ALTER').RCHK610                             00089900
         MVI   0(1),X'80' -   SET FOR ALTER ACCESS                      00090000
         AGO   .RCHK650                                                 00090100
.RCHK610 ANOP                                                           00090200
         AIF   ('&ATTR' NE 'UPDATE').RCHK620                            00090300
         MVI   0(1),X'04'               SET FOR UPDATE ACCESS           00090400
         AGO   .RCHK650                                                 00090500
.RCHK620 ANOP                                                           00090600
         AIF   ('&ATTR' NE 'READ').RCHK630                              00090700
         MVI   0(1),X'02'               SET FOR READ ACCESS             00090800
         AGO   .RCHK650                                                 00090900
.RCHK630 ANOP                                                           00091000
         AIF   ('&ATTR' NE 'CONTROL').RCHK650                           00091100
         MVI   0(1),X'08'               SET FOR CONTROL ACCESS          00091200
         AGO   .RCHK650                                                 00091300
.RCHK640 ANOP                                                           00091400
         STC   &ATTR(1),0(1) - STORE ATTR VALUE IN LIST FORM            00091500
.RCHK650 ANOP                                                           00091600
.******* HANDLE LOG PARAMETER                                      @D1A 00091700
         AIF   (&LGERRFG).RCHK653                                  @LNC 00091800
         AIF   ('&LOG' EQ '').RCHK653                              @LNC 00091900
         AIF   ('&LOG' NE 'NONE').RCHK651                          @D1A 00092000
         NI    1(1),X'3F'               AND OFF ASIS & NOFAIL BITS @D1A 00092100
         AGO   .RCHK653                                            @LNC 00092200
.RCHK651 ANOP                                                      @D1A 00092300
         AIF   ('&LOG' NE 'ASIS').RCHK652                          @D1A 00092400
         NI    1(1),X'BF'               AND OFF NOFAIL BIT         @D1A 00092500
         OI    1(1),X'80'               OR ON   ASIS   BIT         @D1A 00092600
         AGO   .RCHK653                                            @LNA 00092700
.RCHK652 ANOP                                                      @D1A 00092800
         AIF   ('&LOG' NE 'NOFAIL').RCHK653                        @LNC 00092900
         NI    1(1),X'7F'               AND OFF ASIS   BIT         @D1A 00093000
         OI    1(1),X'40'               OR ON   NOFAIL BIT         @D1A 00093100
.RCHK653 ANOP                                                      @LNA 00093200
.******* HANDLE AUTHCHKS PARAMETER                                 @LNA 00093300
         AIF   (&ACHKERR).RCHK655            BAD SPECIFICATION     @LNA 00093400
         AIF   ('&AUTHCHKS' EQ '').RCHK655   NO SPECIFICATION      @LNA 00093500
         AIF   ('&AUTHCHKS' EQ 'ALL').RCHK654                      @LNA 00093600
         OI    1(1),X'10'               OR ON AUTHCHKS=CRITONLY    @LNA 00093700
         AGO   .RCHK655                                            @LNA 00093800
.RCHK654 ANOP                                                      @LNA 00093900
         NI    1(1),X'EF'               AND OFF AUTHCHKS=ALL       @LNA 00094000
.RCHK655 ANOP                                                      @D1A 00094100
.*                                                                 @LWA 00094200
.******* Handle LOGSTRX parameter                                  @LWA 00094300
.*                                                                 @LWA 00094400
         AIF   (&LOGXERR).RCHK65B            BAD specification     @LWA 00094500
         AIF   ('&LOGSTRX' EQ '').RCHK65B    NO  specification     @LWA 00094600
         AIF   ('&LOGSTRX' EQ 'NO').RCHK65A  LOGSTRX=NO            @LWA 00094700
         OI    1(1),X'08'               LOGSTRX=YES - Turn BIT ON  @LWA 00094800
         AGO   .RCHK65B                                            @LWA 00094900
.RCHK65A ANOP                                                      @LWA 00095000
         NI    1(1),X'F7'               LOGSTRX=NO - Turn BIT OFF  @LWA 00095100
.*                                                                 @LWA 00095200
.RCHK65B ANOP                                                      @D1A 00095300
.******* HANDLE ENTITY PARAMETER                                        00095400
         AIF   ('&ENTITY' EQ '').RCHK665                                00095500
         AIF   ('&RELEASE' EQ '').RCHK656                          @P5A 00095600
         AIF   ('&RLVL'(1,3) LT '2.6').RCHK656                     @LUC 00095700
         NI    1(1),X'DF'   - TURN OFF ENTITYX INDICATOR           @LCA 00095800
.RCHK656 ANOP                                                      @P5A 00095900
         AIF   ('&ENTITY'(1,1) NE '(').RCHK660                          00096000
         ST    &ENTITY,4(1) - STORE ENTITY NAME ADDRESS                 00096100
         AGO   .RCHK665                                                 00096200
.RCHK660 ANOP                                                           00096300
         LA    0,&ENTITY - MOVE ENTITY NAME ADDRESS                     00096400
         ST    0,4(1) -      INTO PARM LIST                             00096500
.RCHK665 ANOP                                                           00096600
         AIF   ('&ENTITYX' EQ '').RCHK667                          @LCA 00096700
         OI    1(1),X'20'    - TURN ON ENTITYX INDICATOR           @LCA 00096800
         AIF   ('&ENTITYX'(1,1) NE '(').RCHK666                    @LCA 00096900
         ST    &ENTITYX,4(1) - STORE ENTITYX NAME ADDRESS          @LCA 00097000
         AGO   .RCHK667                                            @LCA 00097100
.RCHK666 ANOP                                                      @LCA 00097200
         LA    0,&ENTITYX - MOVE ENTITYX NAME ADDRESS              @LCA 00097300
         ST    0,4(1) -      INTO PARM LIST                        @LCA 00097400
.RCHK667 ANOP                                                      @LCA 00097500
.******* HANDLE CLASS PARAMETER                                         00097600
         AIF   ('&CLASS' EQ '').RCHK675                                 00097700
         AIF   ('&CLASS'(1,1) EQ '''').ERR09                            00097800
         AIF   ('&CLASS'(1,1) NE '(').RCHK670                           00097900
         ST    &CLASS(1),8(1) - STORE CLASS NAME ADDRESS                00098000
         AGO   .RCHK675                                                 00098100
.RCHK670 ANOP                                                           00098200
         LA    0,&CLASS -     MOVE CLASS NAME ADDRESS                   00098300
         ST    0,8(1) -      INTO PARM LIST                             00098400
.ERTN09  ANOP                                                           00098500
.RCHK675 ANOP                                                           00098600
.******* HANDLE ACEE PARAMTER                                           00098700
         AIF   ('&ACEE' EQ '').RCHK685                                  00098800
         AIF   ('&ACEE'(1,1) NE '(').RCHK680                            00098900
         ST    &ACEE(1),12(1) - STORE ACEE ADDRESS                      00099000
         AGO   .RCHK685                                                 00099100
.RCHK680 ANOP                                                           00099200
         LA    0,&ACEE - ADDRESS ACEE                                   00099300
         ST    0,12(1) - STORE INTO PARAMTER LIST                       00099400
.RCHK685 ANOP                                                           00099500
.******* HANDLE APPL PARAMETER                                          00099600
         AIF   ('&APPL' EQ '').RCHK695                                  00099700
         AIF   ('&APPL'(1,1) EQ '''').ERR10                             00099800
         AIF   ('&APPL'(1,1) NE '(').RCHK690                            00099900
         ST    &APPL(1),16(1) - STORE APPL NAME ADDRESS                 00100000
         AGO   .RCHK695                                                 00100100
.RCHK690 ANOP                                                           00100200
         LA    0,&APPL -      MOVE APPL NAME ADDRESS                    00100300
         ST    0,16(1) -      INTO PARM LIST                            00100400
.ERTN10  ANOP                                                           00100500
.RCHK695 ANOP                                                           00100600
.******* HANDLE WKAREA PARAMTER                                         00100700
         AIF   ('&WKAREA' EQ '').RCHK705                                00100800
         AIF   ('&WKAREA'(1,1) NE '(').RCHK700                          00100900
         ST    &WKAREA(1),20(1) - STORE WKAREA ADDRESS                  00101000
         AGO   .RCHK705                                                 00101100
.RCHK700 ANOP                                                           00101200
         LA    0,&WKAREA - ADDRESS WKAREA                               00101300
         ST    0,20(1) - STORE INTO PARAMTER LIST                       00101400
.RCHK705 ANOP                                                           00101500
.******* PRODUCE INSTALLATION DATA ADDRESS                              00101600
         AIF   ('&INSTLN' EQ '').RCHK715                                00101700
         AIF   ('&INSTLN'(1,1) NE '(').RCHK710                          00101800
         ST    &INSTLN(1),24(1) - STORE INSTALLATION ADDR               00101900
         AGO   .RCHK715                                                 00102000
.RCHK710 ANOP                                                           00102100
         LA    0,&INSTLN - ADDRESS INSTALLATION DATA ADDRESS            00102200
         ST    0,24(1) - STORE INSTALLATION DATA ADDRESS                00102300
.RCHK715 ANOP                                                           00102400
.***************************************************************   @P3A 00102500
.* BYPASS PROCESSING OF NEW KEYWORDS INTRODUCED IN RELEASE 2.4     @P3A 00102600
.* IF LOWER LEVEL RELEASE IS SPECIFIED.                            @P3A 00102700
.***************************************************************   @P3A 00102800
         AIF   ('&RELEASE' EQ '').RCHK735                          @P4A 00102900
         AIF   ('&RLVL'(1,3) LT '2.4').RCHK735                     @LUC 00103000
.******* HANDLE ACEEALET PARAMTER                                  @LAA 00103100
         AIF   ('&ACEEALET' EQ '').RCHK725                         @LAA 00103200
         AIF   ('&ACEEALET'(1,1) NE '(').RCHK720                   @LAA 00103300
         ST    &ACEEALET(1),28(1) - STORE ACEEALET ADDRESS         @LAA 00103400
         AGO   .RCHK725                                            @LAA 00103500
.RCHK720 ANOP                                                      @LAA 00103600
         LA    0,&ACEEALET - ADDRESS ACEEALET                      @P2M 00103700
         ST    0,28(1) - STORE INTO PARAMETER LIST                 @P2M 00103800
.RCHK725 ANOP                                                      @P2M 00103900
.******* HANDLE LOGSTR PARAMETER                                   @LBA 00104000
         AIF   ('&LOGSTR' EQ '').RCHK735                           @P2C 00104100
         AIF   ('&LOGSTR'(1,1) NE '(').RCHK730                     @P2C 00104200
         ST    &LOGSTR(1),32(1) - STORE LOGSTR ADDRESS             @LBA 00104300
         AGO   .RCHK735                                            @P2C 00104400
.RCHK730 ANOP                                                      @P2C 00104500
         LA    0,&LOGSTR -   LOAD LOGSTR ADDRESS                   @LBA 00104600
         ST    0,32(1) -     STORE INTO PARAMTER LIST              @LBA 00104700
.RCHK735 ANOP                                                      @P2C 00104800
.***************************************************************   @02A 00104900
.* BYPASS PROCESSING OF NEW KEYWORDS INTRODUCED IN RELEASE 2.6     @02A 00105000
.* IF LOWER LEVEL RELEASE IS SPECIFIED.                            @02A 00105100
.***************************************************************   @02A 00105200
         AIF   ('&RELEASE' EQ '').RCHK745                          @02A 00105300
         AIF   ('&RLVL'(1,3) LT '2.6').RCHK745                     @LUC 00105400
.******* HANDLE ENVRIN PARAMTER                                    @02A 00105500
         AIF   ('&ENVRIN' EQ '').RCHK745                           @02A 00105600
         AIF   ('&ENVRIN'(1,1) NE '(').RCHK740                     @02A 00105700
         ST    &ENVRIN(1),36(1) - STORE ENVRIN ADDRESS             @02A 00105800
         AGO   .RCHK745                                            @02A 00105900
.RCHK740 ANOP                                                      @02A 00106000
         LA    0,&ENVRIN        - ADDRESS ENVRIN                   @02A 00106100
         ST    0,36(1)          - STORE INTO PARAMETER LIST        @02A 00106200
.RCHK745 ANOP                                                      @02A 00106300
.***************************************************************   @LMA 00106400
.* BYPASS PROCESSING OF NEW KEYWORDS INTRODUCED IN RELEASE 7730    @LMA 00106500
.* IF LOWER LEVEL RELEASE IS SPECIFIED.                            @LMA 00106600
.***************************************************************   @LMA 00106700
         AIF   ('&RELEASE' EQ '').RCHK755                          @LMA 00106800
         AIF   ('&RLVL'(1,2) LT '38').RCHK755  -LT Release 7730    @LUC 00106900
.******* HANDLE CRITERIA PARAMETER                                 @LMA 00107000
         AIF   ('&CRITERIA' EQ '').RCHK755                         @LMA 00107100
         AIF   ('&CRITERIA'(1,1) NE '(').RCHK750                   @LMA 00107200
         ST    &CRITERIA(1),40(1) - STORE CRITERIA ADDRESS         @LMA 00107300
         AGO   .RCHK755                                            @LMA 00107400
.RCHK750 ANOP                                                      @LMA 00107500
         LA    0,&CRITERIA      - ADDRESS CRITERIA                 @LMA 00107600
         ST    0,40(1)          - STORE INTO PARAMETER LIST        @LMA 00107700
.RCHK755 ANOP                                                      @LMA 00107800
.******* MODIFICATION COMPLETE - AGO ABOVE TO PRODUCE ENTRY LOGIC       00107900
         AGO   .RCHK510                                                 00108000
.******* DIAGNOSTICS                                                    00108100
.*                                        (REMOVED DEAD CODE)      @LCD 00108200
.ERR04   ANOP                                                           00108300
         MNOTE 8,'*** INVALID ATTR PARAMETER SPECIFIED ***'             00108400
         AGO   .ERTN04                                                  00108500
.ERR06   ANOP                                                           00108600
         MNOTE 8,'*** INVALID MF PARAMETER SPECIFIED ***'               00108700
         AGO   .ERTN06                                                  00108800
.ERR07   ANOP                                                           00108900
         MNOTE 8,'*** REGISTER ADDRESS SPECIFICATION NOT ALLOWED WITH L-00109000
               IST FORM ***'                                            00109100
         AGO   .ERTN07                                                  00109200
.ERR09   ANOP                                                           00109300
         MNOTE 8,'*** ''CLASSNAME'' FORM NOT ALLOWED WITH MF=E ***'     00109400
         AGO   .ERTN09                                                  00109500
.ERR10   ANOP                                                           00109600
         MNOTE 8,'*** ''APPLNAME'' FORM NOT ALLOWED WITH MF=E ***'      00109700
         AGO   .ERTN10                                                  00109800
.ERR11   ANOP                                                      @L4A 00109900
         MNOTE 8,'*** FRACHECK CAN BE INVOKED ONLY VIA RACROUTE FOR REL-00110000
               EASE 1.9 AND LATER  ***'                            @L4A 00110100
         AGO   .ERTN11                                             @L4A 00110200
.ERR12   ANOP                                                      @D1A 00110300
         MNOTE 8,'*** INCORRECT SPECIFICATION OF ''LOG'' ***'      @D1A 00110400
&LGERRFG SETB  1                                                        00110500
         AGO   .ERTN12                                             @D1A 00110600
.ERR13   ANOP                                                      @D1A 00110700
         MNOTE 8,'*** FRACHECK WITH LOG CAN BE INVOKED ONLY VIA RACROUT+00110800
               E ***'                                              @D1A 00110900
&LGERRFG SETB  1                                                        00111000
         AGO   .ERTN13                                             @D1A 00111100
.ERR14   MNOTE 8,'*** ''LOG'' KEYWORD IS NOT SUPPORTED WITH SPECIFIED R+00111200
               ELEASE ***'                                         @D1A 00111300
&LGERRFG SETB  1                                                   @D1A 00111400
         AGO   .ERTN14                                             @D1A 00111500
.ERR15   MNOTE 8,'*** LOG MAY NOT BE SPECIFIED UNLESS RELEASE IS SPECIF+00111600
               IED ***'                                            @D1A 00111700
&LGERRFG SETB  1                                                   @D1A 00111800
         AGO   .ERTN15                                             @D1A 00111900
.ERR16   MNOTE 8,'*** ''ACEEALET'' KEYWORD IS NOT SUPPORTED WITH SPECIF+00112000
               IED RELEASE ***'                                    @LAA 00112100
         AGO   .ERTN16                                             @LAA 00112200
.ERR17   MNOTE 8,'*** ACEEALET MAY NOT BE SPECIFIED UNLESS RELEASE IS S+00112300
               PECIFIED ***'                                       @LAA 00112400
         AGO   .ERTN17                                             @LAA 00112500
.ERR18   MNOTE 8,'*** ''LOGSTR'' KEYWORD IS NOT SUPPORTED WITH SPECIFIE+00112600
               D RELEASE ***'                                      @LBA 00112700
         AGO   .ERTN18                                             @LBA 00112800
.ERR19   MNOTE 8,'*** LOGSTR MAY NOT BE SPECIFIED UNLESS RELEASE IS SPE+00112900
               CIFIED ***'                                         @LBA 00113000
         AGO   .ERTN19                                             @LBA 00113100
.ERR20   MNOTE 8,'*** ''ENTITYX'' KEYWORD IS NOT SUPPORTED WITH SPECIFI+00113200
               ED RELEASE ***'                                     @LCA 00113300
         AGO   .ERTN20                                             @LCA 00113400
.ERR21   MNOTE 8,'*** ENTITYX MAY NOT BE SPECIFIED UNLESS RELEASE IS SP+00113500
               ECIFIED ***'                                        @LCA 00113600
         AGO   .ERTN21                                             @LCA 00113700
.ERR22   MNOTE 8,'*** ENTITYX AND ENTITY ARE MUTUALLY EXCLUSIVE KEYWORD+00113800
               S ***'                                              @LCA 00113900
         AGO   .ERTN22                                             @LCA 00114000
.ERR23   MNOTE 8,'*** ''ENVRIN'' KEYWORD IS NOT SUPPORTED BY FRACHECK *+00114100
               **'                                                 @02A 00114200
         AGO   .ERTN23                                             @02A 00114300
.ERR24   MNOTE 8,'*** ''ENVRIN'' KEYWORD IS NOT SUPPORTED BY FASTAUTH W+00114400
               ITH SPECIFIED RELEASE ***'                          @02A 00114500
         AGO   .ERTN24                                             @02A 00114600
.ERR25   MNOTE 8,'*** ENVRIN AND ACEE ARE MUTUALLY EXCLUSIVE KEYWORDS *+00114700
               **'                                                 @02A 00114800
         AGO   .ERTN25                                             @02A 00114900
.ERR26   MNOTE 8,'*** ENVRIN AND ACEEALET ARE MUTUALLY EXCLUSIVE KEYWOR+00115000
               DS ***'                                             @02A 00115100
         AGO   .ERTN26                                             @02A 00115200
.ERR27   MNOTE 8,'*** CRITERIA MAY NOT BE SPECIFIED UNLESS RELEASE IS S+00115300
               PECIFIED ***'                                       @LMA 00115400
         AGO   .ERTN27                                             @LMA 00115500
.ERR28   MNOTE 8,'*** ''CRITERIA'' KEYWORD IS NOT SUPPORTED WITH SPECIF+00115600
               IED RELEASE ***'                                    @LMA 00115700
         AGO   .ERTN28                                             @LMA 00115800
.ERR29   MNOTE 8,'*** AUTHCHKS MAY NOT BE SPECIFIED UNLESS RELEASE IS S+00115900
               PECIFIED ***'                                       @LNA 00116000
&ACHKERR SETB  1                                                   @LNA 00116100
         AGO   .ERTN29                                             @LNA 00116200
.ERR30   MNOTE 8,'*** ''AUTHCHKS'' KEYWORD IS NOT SUPPORTED WITH SPECIF+00116300
               IED RELEASE ***'                                    @LNA 00116400
&ACHKERR SETB  1                                                   @LNA 00116500
         AGO   .ERTN30                                             @LNA 00116600
.ERR31   ANOP                                                      @LNA 00116700
         MNOTE 8,'*** INVALID AUTHCHKS PARAMETER SPECIFIED ***'    @LNA 00116800
&ACHKERR SETB  1                                                   @LNA 00116900
         AGO   .ERTN31                                             @LNA 00117000
.ERR32   ANOP                                                      @LNA 00117100
         MNOTE 8,'*** FRACHECK WITH AUTHCHKS CAN BE INVOKED ONLY VIA RA+00117200
               CROUTE ***'                                         @LNA 00117300
&ACHKERR SETB  1                                                        00117400
         AGO   .ERTN32                                             @LNA 00117500
.ERR33   MNOTE 8,'*** LOGSTRX MAY NOT BE SPECIFIED UNLESS RELEASE IS SP+00117600
               ECIFIED ***'                                        @LWA 00117700
&LOGXERR SETB  1                                                   @LWA 00117800
         AGO   .ERTN33                                             @LWA 00117900
.ERR34   MNOTE 8,'*** ''LOGSTRX'' KEYWORD IS NOT SUPPORTED WITH SPECIFI+00118000
               ED RELEASE ***'                                     @LWA 00118100
&LOGXERR SETB  1                                                   @LWA 00118200
         AGO   .ERTN34                                             @LWA 00118300
.ERR35   ANOP                                                      @LWA 00118400
         MNOTE 8,'*** NON-VALID LOGSTRX PARAMETER SPECIFIED ***'   @LWA 00118500
&LOGXERR SETB  1                                                   @LWA 00118600
         AGO   .ERTN35                                             @LWA 00118700
.ERR36   ANOP                                                      @LWA 00118800
         MNOTE 8,'*** FRACHECK WITH LOGSTRX CAN BE INVOKED ONLY VIA RAC+00118900
               ROUTE ***'                                          @LWA 00119000
&LOGXERR SETB  1                                                        00119100
         AGO   .ERTN36                                             @LWA 00119200
.ERR37   MNOTE 8,'*** "LOGSTRX=YES" CAN BE SPECIFIED ONLY IF "LOGSTR=" +00119300
               HAS BEEN ALSO SPECIFIED ***'                        @LWA 00119400
&LOGXERR SETB  1                                                        00119500
         AGO   .ERTN37                                             @LWA 00119600
.ERLVL1  MNOTE 8,'*** INCORRECT SPECIFICATION OF ''RELEASE'' ***'  @L1A 00119700
         AGO   .ERLVL1R                                            @L1A 00119800
.ERLVL2  MNOTE 4,'*** ''RELEASE-CHECK'' ONLY VALID WITH ''MF=E'' ***'  X00119900
                                                                   @L1A 00120000
         AGO   .ERLVL2R                                            @L1A 00120100
         MEND                                                           00120200
                                                                        00120300
                                                                        00120400
