*/* PROPRIETARY V3 STATEMENT                                   */       00004600
*/* LICENSED MATERIALS - PROPERTY OF IBM                       */       00006900
*/* "RESTRICTED MATERIALS OF IBM"                              */       00009200
*/* 5694-A01                                                   */       00011500
*/* COPYRIGHT IBM CORP. 1992, 2011                             */       00013800
*/* END PROPRIETARY V3 STATEMENT                               */       00016100
*/*  START OF PL/X COMMENT ENDING ON %MACRO STATEMENT              @L2A 00018000
         MACRO                                                          00020000
&NAME    FREEPOOL &PAR                                                  00026000
.* STATUS = z/OS 1.13 DFSMS                                        @L4A 00032000
.* FUNCTION: Free a buffer pool for BSAM, BPAM or QSAM that        @L4A 00038000
.*      was built by GETPOOL or OPEN.  Callable in 24 or 31-bit.   @L4A 00044000
.*                                                                 @L4A 00050000
.*    001800-002800                                                     00056000
.*  $01 =  OZ83983,HDP1102,UZ78277,KACST2: ABEND30A IEBISAM        @01A 00057400
.*  $02 =  OZ86200,HDP1102,UZ39665,KACST2: ABEND80A PE83983        @02A 00058800
.*  $03 =  OZ87512,HDP1102,UZ39665,KACST2: ABEND30A BCB            @03A 00060200
.*  $L1 =  31BIT,JDZ1110,,SJPLRK:  QSAM BUFFERS ABOVE LINE         @L1A 00061600
.*  $L2 =  PLX,JDZ1110,,SJPLMET: PL/X SUPPORT                      @L2A 00063000
.*  $04 =  OW13183,HDZ11C0,951115,SJPLMM: BYPASS FREE IF BUFFERS        00064800
.*                                        ARE ABOVE THE LINE       @04A 00068100
.*  $L3 =  GT32K,HDZ11F0,990120,SJPLRK: BYPASS FREE IF BCBCBLEN         00071400
.*                                        FIELD EXISTS             @L3A 00072500
.*  $05 =  OA20568,HDZ1190,070420,SVLML: USE BCBBFSZ2 IF BCBCBLNF       00073600
.*                                       IS ON                     @05A 00074200
.*  $L4 =  64BIT,JDZ1D10,20100303,SVLJH: 64 bit message            @L4A 00074800
         GBLC  &SYSAM64    AMODE64=YES set by SYSSTATE macro       @L4A 00075400
         GBLC  &SYSASCE    ASCENV=AR or ANY set by SYSSTATE macro  @L4A 00076000
         SYSSTATE TEST     Test how macros are to expand           @L4A 00076600
         AIF   ('&SYSAM64' EQ 'YES').E2    GO IF AMODE64=YES       @L4A 00077700
         AIF   (('&SYSASCE' NE '') AND ('&SYSASCE' NE 'P')).E3     @L4A 00078400
         AIF   ('&PAR' EQ '').E1                                        00079100
&NAME    IHBINNRA &PAR                                                  00080000
         TM    23(1),1             IS BUFCB ALREADY FREED          @L1A 00102800
         BO    IHB&SYSNDX          IF SO, NO FREEMAIN              @L1A 00125600
         SLR   15,15                                               @L1A 00148400
         ICM   15,7,21(1)          LOAD BUFCB ADDRESS              @L1C 00171200
         OI    23(1),1             INDICATE NO BUFCB ADDR               00194000
         SR    14,14               CLEAR REGISTER                       00216800
         SR    1,1                 CLEAR REGISTER                  @01A 00239600
         ICM   1,3,6(15)           LOAD BUF LEN FROM BCBBUFSZ      @05C 00262400
         TM    4(15),X'10'         IS BUFFER LENGTH 2 BYTES?       @05A 00285200
         BZ    *+8                 YES,BUF LEN IS IN BCBBFSZ2      @05A 00308000
         L     1,16(,15)           LOAD BUF LEN FROM BCBBFSZ2      @05A 00330800
         IC    14,5(0,15)          NUMBER OF BUFFERS               @01A 00353600
         MR    0,14                AREA TO BE FREED                @01A 00376400
         LH    0,6(,15)            GET POSSIBLE BCB LENGTH         @05A 00399200
         TM    4(15),X'10'         BRANCH TO AR IF WE GOT          @05A 00422000
         BO    *+20                  THE BCB LENGTH                @05A 00444800
         LA    0,8                 ACCOUNT FOR BCB                 @02C 00467600
         TM    4(15),X'40'         IS BUFCB 16 BYTES           @ZA19719 00490400
         BNO   *+8                 BRANCH IF BUFCB = 8 BYTES            00513200
         LA    0,16                BUFCB IS 16 BYTES               @05C 00536000
         AR    0,1                 ADD IN LENGTH OF BUFFERS        @05A 00558800
         LA    1,0(0,15)           LOAD AREA ADDRESS                    00581600
         SVC   10                  ISSUE FREEMAIN SVC                   00604400
IHB&SYSNDX DS    0H                                                @L1A 00627200
         MEXIT                                                          00650000
.E1      IHBERMAC 01                                                    00700000
         MEXIT                                                     @L4A 00708300
.E2      IGGERMAC 203,FREEPOOL THE FREEPOOL MACRO DOES NOT SUPPORT @L4A 00716600
         MEXIT                   SYSSTATE AMODE64=YES              @L4A 00724900
.E3      IGGERMAC 204,FREEPOOL THE FREEPOOL MACRO DOES NOT SUPPORT @L4A 00733200
         MEXIT                   SYSSTATE ASCENV=AR OR ANY         @L4A 00741500
         MEND                                                           00750000
**/%FREEPOOL: MACRO KEYS(DCB_NAME,DCB_ADDR);                   /*@L2A*/ 00800000
* ANS('? '!!MACLABEL!!' FREEPOOP '!!MACKEYS!!';') RESCAN SKIP; /*@L2A*/ 00850000
* %END FREEPOOL;                                               /*@L2A*/ 00900000
