*                                                                       00001000
* %DCL FXEZCTRL_INCLUDED CHAR EXT;                                      00002000
* %DEACTIVATE FXEZCTRL_INCLUDED;                                        00003000
* %IF FXEZCTRL_INCLUDED = '' %THEN                                      00004000
* %DO;                                                                  00005000
*/* Macro made bi-lingual on 19035. CBGEN compile date 15295         */ 00006000
*% /*                                                                   00007000
         MACRO                                                          00008000
         FXEZCTRL &DSECT=YES,&LIST=YES,&TITLE=YES                       00009000
         GBLC  &FXEZCTRL_INCLUDED                                       00010000
         GBLC  &ZCBPRINT                                                00011000
&FXEZCTRL_INCLUDED SETC 'YES'                                           00012000
         AIF   ('&LIST' EQ 'NONE').P0                                   00013000
         AIF   ('&TITLE' EQ 'NO').P5                                    00014000
 TITLE   'FXEZCTRL  - Function Registry service FXECNTRL related     '  00015000
.P5      ANOP                                                           00016000
**/ FXEZCTRL_1:;                                                        00017000
*/* START OF SPECIFICATIONS ******************************************* 00018000
*                                                                       00019000
*  **PROPRIETARY_STATEMENT********************************************* 00020000
***01* PROPRIETARY STATEMENT=                                         * 00021000
*                                                                     * 00022000
*                                                                     * 00023000
*   LICENSED MATERIALS - PROPERTY OF IBM                              * 00024000
*   5650-ZOS COPYRIGHT IBM CORP. 2017                                 * 00025000
*                                                                     * 00026000
*   STATUS= HBB77B0                                                   * 00027000
*                                                                     * 00028000
*  **END_OF_PROPRIETARY_STATEMENT************************************** 00029000
*                                                                       00030000
*01* DESCRIPTIVE NAME:  Function Registry service FXECNTRL related      00031000
*                       constants                                       00032000
*                                                                       00033000
*01* MACRO NAME:  FXEZCTRL                                              00034000
*                                                                       00035000
*01* EXTERNAL CLASSIFICATION: PI                                        00036000
*01* END OF EXTERNAL CLASSIFICATION:                                    00037000
*                                                                       00038000
*01* DSECT NAME:                                                        00039000
*     N/A                                                               00040000
*                                                                       00041000
*01* COMPONENT:  Function Registry (SCFXE)                              00042000
*                                                                       00043000
*01* EYE-CATCHER:  N/A                                                  00044000
*02*   OFFSET: N/A                                                      00045000
*02*   LENGTH: N/A                                                      00046000
*                                                                       00047000
*01* STORAGE ATTRIBUTES: N/A                                            00048000
*02*  SUBPOOL:   N/A                                                    00049000
*02*  KEY:       N/A                                                    00050000
*02*  RESIDENCY: N/A                                                    00051000
*                                                                       00052000
*01* SIZE: N/A                                                          00053000
*                                                                       00054000
*01* CREATED BY: N/A                                                    00055000
*                                                                       00056000
*01* POINTED TO BY: N/A                                                 00057000
*                                                                       00058000
*01* SERIALIZATION: N/A                                                 00059000
*                                                                       00060000
*01* FUNCTION:                                                          00061000
*     Provide definitions for return codes, reason codes, and other     00062000
*     constants related to the macro service FXECNTRL.                  00063000
*                                                                       00064000
*01* METHOD OF ACCESS:                                                  00065000
*02*  ASM:                                                              00066000
*      FXEZCTRL                                                         00067000
*                                                                       00068000
*02*  PL/X:                                                             00069000
*      %INCLUDE SYSLIB(FXEZCTRL)                                        00070000
*                                                                       00071000
*01* DEPENDENCIES:                                                      00072000
*      - FXECNTRL                                                       00073000
*      - SETFXE / DISPLAY FXE / SET FXE                                 00074000
*                                                                       00075000
*01* DISTRIBUTION LIBRARY:  AMACLIB                                     00076000
*                                                                       00077000
*01* CHANGE ACTIVITY:                                                   00078000
*   $L0=FP1818   HBB77B0 170103 RD00UT: Initial Create                  00079000
*   $L1=FP1818   HBB77B0 171201 RD00UT: Validation RSN                  00080000
*                                                                       00081000
* END OF SPECIFICATIONS **********************************************/ 00082000
*% /*                                                                   00083000
.P0      ANOP                                                           00084000
         AIF   ('&ZCBPRINT' EQ 'NO').P1                                 00085000
         AIF   ('&LIST' EQ 'YES').P2                                    00086000
.P1      ANOP                                                           00087000
         PUSH  PRINT                                                    00088000
         PRINT OFF                                                      00089000
.P2      ANOP                                                           00090000
*                                                                       00091000
*    Reason code format: ddddrrss, with rr=return code, ss=reason code  00092000
*    and dddd=component diagnostic data, which must not be assumed      00093000
*    to be 0. Apply FxeCntrlRsnCodeMask to an actual reason code value  00094000
*    to derive a value listed below.                                    00095000
*                                                                       00096000
*                                                                       00097000
*                                                                       00098000
FXECNTRLRSNCODEMASK EQU X'0000FFFF' Use this mask to isolate the non   *00099000
                         component-diagnostic portion of a reason code  00100000
*                                                                       00101000
*   ** AMGRET - START **                                                00102000
*   FXECNTRL Return and Reason Code definitions                         00103000
*                                                                       00104000
*                                                                       00105000
FXECNTRLRC_OK EQU X'00000000' Meaning: Successfully executed the       *00106000
                         request. Action: None required                 00107000
FXECNTRLRC_WARNING EQU X'00000004' Meaning: Warning Action: Refer to   *00108000
                         action under the individual reason code.       00109000
FXECNTRLRSN_VENDORNOTFOUND EQU X'000004F1' Meaning: Requested function *00110000
                         entry not found: No vendor matched. Action:   *00111000
                         Ensure that the given vendor, product, and    *00112000
                         function selectors identify an existent entry *00113000
                         in the IBM Function Registry for z/OS.         00114000
FXECNTRLRSN_PRODUCTNOTFOUND EQU X'000004F2' Meaning: Requested         *00115000
                         function entry not found: None of the         *00116000
                         matching vendors had a matching product.      *00117000
                         Action: Ensure that the given vendor,         *00118000
                         product, and function selectors identify an   *00119000
                         existent entry in the IBM Function Registry   *00120000
                         for z/OS.                                      00121000
FXECNTRLRSN_FUNCTIONNOTFOUND EQU X'000004F3' Meaning: Requested        *00122000
                         function entry not found: None of the         *00123000
                         matching products had a matching function     *00124000
                         entry. Action: Ensure that the given vendor,  *00125000
                         product, and function selectors identify an   *00126000
                         existent entry in the IBM Function Registry   *00127000
                         for z/OS.                                      00128000
FXECNTRLRC_ERROR EQU X'00000008' Meaning: Error Action: Refer to       *00129000
                         action under the individual reason code.       00130000
FXECNTRLRSN_BADENVNOTENABLED EQU X'00000801' Meaning: Not enabled.     *00131000
                         Action: Avoid using FXECNTRL when not enabled *00132000
                         for I/O and external interrupts.               00133000
FXECNTRLRSN_BADENVLOCKED EQU X'00000802' Meaning: Locked. Action:      *00134000
                         Avoid using FXECNTRL when a lock is held.      00135000
FXECNTRLRSN_BADENVSRBMODE EQU X'00000803' Meaning: SRB mode. Action:   *00136000
                         Avoid issuing FXECNTRL in SRB mode.            00137000
FXECNTRLRSN_BADENVFRR EQU X'00000804' Meaning: The caller had an EUT   *00138000
                         FRR established. Action: Avoid using FXECNTRL *00139000
                         when an EUT FRR is established.                00140000
FXECNTRLRSN_BADPARMLIST EQU X'00000805' Meaning: Error accessing       *00141000
                         parameter list. Action: Make sure that the    *00142000
                         provided parameter list is valid.              00143000
FXECNTRLRSN_BADPARMLISTALET EQU X'00000806' Meaning: Bad parameter     *00144000
                         list ALET. Action: Make sure that the ALET    *00145000
                         associated with the parameter list is valid.  *00146000
                         The access register might not have been set   *00147000
                         up correctly.                                  00148000
FXECNTRLRSN_BADVENDORNAME EQU X'00000807' Meaning: Error accessing     *00149000
                         VENDORNAME. Action: Make sure that the        *00150000
                         provided VENDORNAME parameter is valid.        00151000
FXECNTRLRSN_BADVENDORNAMEALET EQU X'00000808' Meaning: Bad VENDORNAME  *00152000
                         ALET. Action: Make sure that the ALET         *00153000
                         associated with the VENDORNAME parameter is   *00154000
                         valid. The access register might not have     *00155000
                         been set up correctly.                         00156000
FXECNTRLRSN_BADPRODUCTNAME EQU X'00000809' Meaning: Error accessing    *00157000
                         PRODUCTNAME. Action: Make sure that the       *00158000
                         provided PRODUCTNAME parameter is valid.       00159000
FXECNTRLRSN_BADPRODUCTNAMEALET EQU X'0000080A' Meaning: Bad            *00160000
                         PRODUCTNAME ALET. Action: Make sure that the  *00161000
                         ALET associated with the PRODUCTNAME          *00162000
                         parameter is valid. The access register might *00163000
                         not have been set up correctly.                00164000
FXECNTRLRSN_BADPRODUCTID EQU X'0000080B' Meaning: Error accessing      *00165000
                         PRODUCTID. Action: Make sure that the         *00166000
                         provided PRODUCTID parameter is valid.         00167000
FXECNTRLRSN_BADPRODUCTIDALET EQU X'0000080C' Meaning: Bad PRODUCTID    *00168000
                         ALET. Action: Make sure that the ALET         *00169000
                         associated with the PRODUCTID parameter is    *00170000
                         valid. The access register might not have     *00171000
                         been set up correctly.                         00172000
FXECNTRLRSN_BADINSTANCEID EQU X'0000080D' Meaning: Error accessing     *00173000
                         INSTANCEID. Action: Make sure that the        *00174000
                         provided INSTANCEID parameter is valid.        00175000
FXECNTRLRSN_BADINSTANCEIDALET EQU X'0000080E' Meaning: Bad INSTANCEID  *00176000
                         ALET. Action: Make sure that the ALET         *00177000
                         associated with the INSTANCEID parameter is   *00178000
                         valid. The access register might not have     *00179000
                         been set up correctly.                         00180000
FXECNTRLRSN_BADFUNCTIONNAME EQU X'0000080F' Meaning: Error accessing   *00181000
                         FUNCTIONAME. Action: Make sure that the       *00182000
                         provided FUNCTIONAME parameter is valid.       00183000
FXECNTRLRSN_BADFUNCTIONNAMEALET EQU X'00000810'                         00184000
*                                                                       00185000
*                                      Meaning: Bad FUNCTIONNAME        00186000
*                                      ALET. Action: Make sure that     00187000
*                                      the ALET associated with the     00188000
*                                      FUNCTIONNAME parameter is        00189000
*                                      valid. The access register       00190000
*                                      might not have been set up       00191000
*                                      correctly.                       00192000
*                                                                       00193000
FXECNTRLRSN_BADREQUEST EQU X'00000811' Meaning: A bad REQUEST type has *00194000
                         been specified. Action: Use one of the        *00195000
                         supported request types.                       00196000
FXECNTRLRSN_BADPARMLISTVERSION EQU X'00000812' Meaning: The specified  *00197000
                         version of the macro is not compatible with   *00198000
                         the current version of IBM Function Registry  *00199000
                         for z/OS. Action: Avoid requesting parameters *00200000
                         that are not supported by this version of IBM *00201000
                         Function Registry for z/OS.                    00202000
FXECNTRLRSN_BADFUNCTIONUPDATETYPE EQU X'00000813'                       00203000
*                                                                       00204000
*                                      Meaning: Bad function update     00205000
*                                      type. Action: Use only           00206000
*                                      supported updated types:         00207000
*                                      ANYAUTH, AUTHONLY, or VALUE.     00208000
*                                      If VALUE, then FUNCUPDTYPVALUE   00209000
*                                      has to be 0 (ANYAUTH) or 1       00210000
*                                      (AUTHONLY).                      00211000
*                                                                       00212000
FXECNTRLRSN_NOTAUTHORIZEDFORFUNCUPDTYPE EQU X'00000814' Meaning: Not   *00213000
                         authorized for FUNCTIONUPDTYPE. Action: Only  *00214000
                         authorized callers are allowed to use         *00215000
                         FUNCTIONUPDTYPE=AUTHONLY or                   *00216000
                         FUNCTIONUPDTYPE=VALUE and FUNCUPDTYPVALUE=1   *00217000
                         (AUTHONLY).                                    00218000
FXECNTRLRSN_BADENABLEDVALUE EQU X'00000815' Meaning: Bad ENABLED       *00219000
                         value. Action: Use only supported ENABLED     *00220000
                         values: YES, NO, or VALUE. If VALUE, then     *00221000
                         ENABLEDVALUE has to be 1 (YES) or 0 (NO).      00222000
FXECNTRLRSN_ENABLEDNOTTRACKED EQU X'00000816' Meaning: Enablement      *00223000
                         state is not tracked. The request was aborted *00224000
                         and no, or, if wildcards have been used in    *00225000
                         the VENDOR, PRODUCT, or FUNCTION selectors,   *00226000
                         not all, matching function entries had their  *00227000
                         enablement state changed. Action: The         *00228000
                         selected function entry is set up to not      *00229000
                         track enablement state. Refer to the          *00230000
                         documentation for this function entry for     *00231000
                         more information about its capabilities.       00232000
FXECNTRLRSN_USAGENOTTRACKED EQU X'00000817' Meaning: Usage information *00233000
                         is not tracked. The request was aborted and   *00234000
                         no, or, if wildcards have been used in the    *00235000
                         VENDOR, PRODUCT, or FUNCTION selectors, not   *00236000
                         all, matching function entries had their      *00237000
                         usage information changed. Action: The        *00238000
                         selected function entry is set up to not      *00239000
                         track usage information. Refer to the         *00240000
                         documentation for this function entry for     *00241000
                         more information about its capabilities.       00242000
FXECNTRLRSN_BADVENDORSLOT EQU X'00000818' Meaning: Invalid VENDORSLOT. *00243000
                         Action: Ensure a valid VENDORSLOT number is   *00244000
                         specified. In particular 0 (zero) is not      *00245000
                         valid. Slot numbers start at 1 (one).          00246000
FXECNTRLRSN_BADPRODUCTSLOT EQU X'00000819' Meaning: Invalid            *00247000
                         PRODUCTSLOT. Action: Ensure a valid           *00248000
                         PRODUCTSLOT number is specified. In           *00249000
                         particular 0 (zero) is not valid. Slot        *00250000
                         numbers start at 1 (one).                      00251000
FXECNTRLRSN_BADFUNCTIONSLOT EQU X'0000081A' Meaning: Invalid           *00252000
                         FUNCTIONSLOT. Action: Ensure a valid          *00253000
                         FUNCTIONSLOT number is specified. In          *00254000
                         particular 0 (zero) is not valid. Slot        *00255000
                         numbers start at 1 (one).                      00256000
FXECNTRLRSN_NOTAUTHORIZEDFORAPPLYIPLPARM EQU X'0000081B' Meaning: Not  *00257000
                         authorized for REQUEST=APPLYIPLPARM. Action:  *00258000
                         Only authorized callers are allowed to use    *00259000
                         request type APPLYIPLPARM.                     00260000
FXECNTRLRSN_BADPRODUCTAREA EQU X'0000081C' Meaning: Error accessing    *00261000
                         product area. Action: Make sure that the      *00262000
                         provided product area, referenced by          *00263000
                         parameter PRODUCTAREA or PRODAREAADDR, is     *00264000
                         valid (in common storage, writable, not NULL  *00265000
                         etc.).                                         00266000
FXECNTRLRSN_BADPARMLISTUPD EQU X'0000081D' Meaning: Error updating     *00267000
                         parameter list for output parameters. Action: *00268000
                         Make sure that the provided parameter list is *00269000
                         valid and writable.                            00270000
FXECNTRLRC_SEVEREERROR EQU X'0000000C' Meaning: Severe Error /         *00271000
                         Environment Error Action: Refer to action     *00272000
                         under the individual reason code.              00273000
FXECNTRLRSN_REGISTRYNOTAVAILABLE EQU X'00000C80'                        00274000
*                                                                       00275000
*                                      Meaning: IBM Function Registry   00276000
*                                      for z/OS is not available.       00277000
*                                      Action: This might be a          00278000
*                                      temporary situation in the       00279000
*                                      very early phases of the         00280000
*                                      system start. Contact IBM        00281000
*                                      support if this problem          00282000
*                                      persists and if problem          00283000
*                                      reporting databases do not       00284000
*                                      list an existing fix.            00285000
*                                                                       00286000
FXECNTRLRSN_ENABLEDVALNOTSUPPORTED EQU X'00000C81'                      00287000
*                                                                       00288000
*                                      Meaning: Unsupported ENABLED     00289000
*                                      value in registry. The request   00290000
*                                      was aborted and no, or, if       00291000
*                                      wildcards have been used in      00292000
*                                      the VENDOR, PRODUCT, or          00293000
*                                      FUNCTION selectors, not all,     00294000
*                                      matching function entries had    00295000
*                                      their enablement state           00296000
*                                      changed. Action: Contact the     00297000
*                                      owner of the selected function   00298000
*                                      entry. An unsupported enabled    00299000
*                                      value was found in the           00300000
*                                      registry for this function       00301000
*                                      entry.                           00302000
*                                                                       00303000
FXECNTRLRSN_ENABLEDVALLOCKED EQU X'00000C82' Meaning: ENABLED locked   *00304000
                         in registry. The request was aborted and no,  *00305000
                         or, if wildcards have been used in the        *00306000
                         VENDOR, PRODUCT, or FUNCTION selectors, not   *00307000
                         all, matching function entries had their      *00308000
                         enablement state changed. Action: The         *00309000
                         selected function entry is not set up to have *00310000
                         its enablement state changed. Refer to the    *00311000
                         documentation for this function entry for     *00312000
                         more information about its capabilities.       00313000
FXECNTRLRSN_USAGEVALNOTSUPPORTED EQU X'00000C83'                        00314000
*                                                                       00315000
*                                      Meaning: Unsupported usage       00316000
*                                      indicator in registry. The       00317000
*                                      request was aborted and no,      00318000
*                                      or, if wildcards have been       00319000
*                                      used in the VENDOR, PRODUCT,     00320000
*                                      or FUNCTION selectors, not       00321000
*                                      all, matching function entries   00322000
*                                      had their usage indicator        00323000
*                                      changed. Action: Contact the     00324000
*                                      owner of the selected function   00325000
*                                      entry. An unsupported usage      00326000
*                                      indicator was found in the       00327000
*                                      registry for this function       00328000
*                                      entry.                           00329000
*                                                                       00330000
FXECNTRLRSN_ENABLEDINVALIDFUNCENTRY EQU X'00000C8A' Meaning:           *00331000
                         Inconsistent function entry (FXEFRFE) in      *00332000
                         registry. The request was aborted and no, or, *00333000
                         if wildcards have been used in the VENDOR,    *00334000
                         PRODUCT, or FUNCTION selectors, not all,      *00335000
                         matching function entries had their           *00336000
                         enablement state changed. Action: Contact the *00337000
                         owner of the selected function entry. An      *00338000
                         inconsistent function entry was found in the  *00339000
                         registry. For example, the function entry did  00340000
*                        not have a recognized acronym value set in    *00341000
                         its FXEFRFE_ID field.                          00342000
FXECNTRLRSN_USAGEINVALIDFUNCENTRY EQU X'00000C8B'                       00343000
*                                                                       00344000
*                                      Meaning: Inconsistent function   00345000
*                                      entry (FXEFRFE) in registry.     00346000
*                                      The request was aborted and      00347000
*                                      no, or, if wildcards have been   00348000
*                                      used in the VENDOR, PRODUCT,     00349000
*                                      or FUNCTION selectors, not       00350000
*                                      all, matching function entries   00351000
*                                      had their function usage         00352000
*                                      indicator state changed.         00353000
*                                      Action: Contact the owner of     00354000
*                                      the selected function entry.     00355000
*                                      An inconsistent function entry   00356000
*                                      was found in the registry. For   00357000
*                                      example, the function entry      00358000
*                                      did not have a recognized        00359000
*                                      acronym value set in its         00360000
*                                      FXEFRFE_ID field.                00361000
*                                                                       00362000
FXECNTRLRC_COMPERROR EQU X'00000010' Meaning: Component error. Action: *00363000
                         Report the associated reason code to the      *00364000
                         system programmer to contact IBM Service.      00365000
         AIF   ('&ZCBPRINT' EQ 'NO').P3                                 00366000
         AIF   ('&LIST' EQ 'YES').P4                                    00367000
.P3      ANOP                                                           00368000
         POP   PRINT                                                    00369000
.P4      ANOP                                                           00370000
.P_EXIT  ANOP                                                           00371000
         MEND                                                           00372000
**/ FXEZCTRL_2:;                                                        00373000
* %FXEZCTRL_INCLUDED = 'YES';                                           00374000
* %DCL ZCBPRINT CHAR EXT;                                               00375000
* %DEACTIVATE ZCBPRINT;                                                 00376000
* %DCL FXEZCTRL_LIST CHAR EXT;                                          00377000
* %DEACTIVATE FXEZCTRL_LIST;                                            00378000
* %IF FXEZCTRL_LIST ^= 'NO' &                                           00379000
*    ZCBPRINT ^= 'NO' %THEN                                             00380000
*   %GOTO FXEZCTRL_3;                                                   00381000
*   @LIST PUSH NOECHO;                                                  00382000
*   @LIST NOASSEMBLE NOECHO;                                            00383000
*   @LIST OFF C NOECHO;                                                 00384000
* %FXEZCTRL_3:;                                                         00385000
*/* Start of PL/X Source                                             */ 00386000
*                                                                       00387000
* /* Reason code format: ddddrrss, with rr=return code, ss=reason code  00388000
*    and dddd=component diagnostic data, which must not be assumed      00389000
*    to be 0. Apply FxeCntrlRsnCodeMask to an actual reason code value  00390000
*    to derive a value listed below.                                    00391000
*  */                                                                   00392000
* Dcl FxeCntrlRsnCodeMask Bit(32) Constant('0000FFFF'x); /* Use this    00393000
*                mask to isolate the non component-diagnostic portion   00394000
*                of a reason code */                                    00395000
*                                                                       00396000
* /*** AMGRET - START ***/                                              00397000
*/* FXECNTRL Return and Reason Code definitions                      */ 00398000
*DCL FxeCntrlRc_OK BIT(32) Constant('00000000'X) ; /*                   00399000
*                        Meaning: Successfully executed the request.    00400000
*                        Action: None required                       */ 00401000
*DCL FxeCntrlRc_Warning BIT(32) Constant('00000004'X) ; /*              00402000
*                        Meaning: Warning                               00403000
*                        Action: Refer to action under the individual   00404000
*                        reason code.                                */ 00405000
*DCL FxeCntrlRsn_VendorNotFound BIT(32) Constant('000004F1'X) ; /*      00406000
*                        Meaning: Requested function entry not found:   00407000
*                        No vendor matched.                             00408000
*                        Action: Ensure that the given vendor, product, 00409000
*                        and function selectors identify an existent    00410000
*                        entry in the IBM Function Registry for z/OS.   00411000
*                                                                    */ 00412000
*DCL FxeCntrlRsn_ProductNotFound BIT(32) Constant('000004F2'X) ; /*     00413000
*                        Meaning: Requested function entry not found:   00414000
*                        None of the matching vendors had a matching    00415000
*                        product.                                       00416000
*                        Action: Ensure that the given vendor, product, 00417000
*                        and function selectors identify an existent    00418000
*                        entry in the IBM Function Registry for z/OS.   00419000
*                                                                    */ 00420000
*DCL FxeCntrlRsn_FunctionNotFound BIT(32) Constant('000004F3'X) ; /*    00421000
*                        Meaning: Requested function entry not found:   00422000
*                        None of the matching products had a matching   00423000
*                        function entry.                                00424000
*                        Action: Ensure that the given vendor, product, 00425000
*                        and function selectors identify an existent    00426000
*                        entry in the IBM Function Registry for z/OS.   00427000
*                                                                    */ 00428000
*DCL FxeCntrlRc_Error BIT(32) Constant('00000008'X) ; /*                00429000
*                        Meaning: Error                                 00430000
*                        Action: Refer to action under the individual   00431000
*                        reason code.                                */ 00432000
*DCL FxeCntrlRsn_BadEnvNotEnabled BIT(32) Constant('00000801'X) ; /*    00433000
*                        Meaning: Not enabled.                          00434000
*                        Action: Avoid using FXECNTRL when not enabled  00435000
*                        for I/O and external interrupts.            */ 00436000
*DCL FxeCntrlRsn_BadEnvLocked BIT(32) Constant('00000802'X) ; /*        00437000
*                        Meaning: Locked.                               00438000
*                        Action: Avoid using FXECNTRL when a lock is    00439000
*                        held.                                       */ 00440000
*DCL FxeCntrlRsn_BadEnvSrbmode BIT(32) Constant('00000803'X) ; /*       00441000
*                        Meaning: SRB mode.                             00442000
*                        Action: Avoid issuing FXECNTRL in SRB mode. */ 00443000
*DCL FxeCntrlRsn_BadEnvFRR BIT(32) Constant('00000804'X) ; /*           00444000
*                        Meaning: The caller had an EUT FRR             00445000
*                        established.                                   00446000
*                        Action: Avoid using FXECNTRL when an EUT FRR   00447000
*                        is established.                             */ 00448000
*DCL FxeCntrlRsn_BadParmlist BIT(32) Constant('00000805'X) ; /*         00449000
*                        Meaning: Error accessing parameter list.       00450000
*                        Action: Make sure that the provided parameter  00451000
*                        list is valid.                              */ 00452000
*DCL FxeCntrlRsn_BadParmlistALET BIT(32) Constant('00000806'X) ; /*     00453000
*                        Meaning: Bad parameter list ALET.              00454000
*                        Action: Make sure that the ALET associated     00455000
*                        with the parameter list is valid. The access   00456000
*                        register might not have been set up correctly. 00457000
*                                                                    */ 00458000
*DCL FxeCntrlRsn_BadVendorName BIT(32) Constant('00000807'X) ; /*       00459000
*                        Meaning: Error accessing VENDORNAME.           00460000
*                        Action: Make sure that the provided VENDORNAME 00461000
*                        parameter is valid.                         */ 00462000
*DCL FxeCntrlRsn_BadVendorNameALET BIT(32) Constant('00000808'X) ; /*   00463000
*                        Meaning: Bad VENDORNAME ALET.                  00464000
*                        Action: Make sure that the ALET associated     00465000
*                        with the VENDORNAME parameter is valid. The    00466000
*                        access register might not have been set up     00467000
*                        correctly.                                  */ 00468000
*DCL FxeCntrlRsn_BadProductName BIT(32) Constant('00000809'X) ; /*      00469000
*                        Meaning: Error accessing PRODUCTNAME.          00470000
*                        Action: Make sure that the provided            00471000
*                        PRODUCTNAME parameter is valid.             */ 00472000
*DCL FxeCntrlRsn_BadProductNameALET BIT(32) Constant('0000080A'X) ; /*  00473000
*                        Meaning: Bad PRODUCTNAME ALET.                 00474000
*                        Action: Make sure that the ALET associated     00475000
*                        with the PRODUCTNAME parameter is valid. The   00476000
*                        access register might not have been set up     00477000
*                        correctly.                                  */ 00478000
*DCL FxeCntrlRsn_BadProductID BIT(32) Constant('0000080B'X) ; /*        00479000
*                        Meaning: Error accessing PRODUCTID.            00480000
*                        Action: Make sure that the provided PRODUCTID  00481000
*                        parameter is valid.                         */ 00482000
*DCL FxeCntrlRsn_BadProductIdALET BIT(32) Constant('0000080C'X) ; /*    00483000
*                        Meaning: Bad PRODUCTID ALET.                   00484000
*                        Action: Make sure that the ALET associated     00485000
*                        with the PRODUCTID parameter is valid. The     00486000
*                        access register might not have been set up     00487000
*                        correctly.                                  */ 00488000
*DCL FxeCntrlRsn_BadInstanceID BIT(32) Constant('0000080D'X) ; /*       00489000
*                        Meaning: Error accessing INSTANCEID.           00490000
*                        Action: Make sure that the provided INSTANCEID 00491000
*                        parameter is valid.                         */ 00492000
*DCL FxeCntrlRsn_BadInstanceIdALET BIT(32) Constant('0000080E'X) ; /*   00493000
*                        Meaning: Bad INSTANCEID ALET.                  00494000
*                        Action: Make sure that the ALET associated     00495000
*                        with the INSTANCEID parameter is valid. The    00496000
*                        access register might not have been set up     00497000
*                        correctly.                                  */ 00498000
*DCL FxeCntrlRsn_BadFunctionName BIT(32) Constant('0000080F'X) ; /*     00499000
*                        Meaning: Error accessing FUNCTIONAME.          00500000
*                        Action: Make sure that the provided            00501000
*                        FUNCTIONAME parameter is valid.             */ 00502000
*DCL FxeCntrlRsn_BadFunctionNameALET BIT(32) Constant('00000810'X) ; /* 00503000
*                        Meaning: Bad FUNCTIONNAME ALET.                00504000
*                        Action: Make sure that the ALET associated     00505000
*                        with the FUNCTIONNAME parameter is valid. The  00506000
*                        access register might not have been set up     00507000
*                        correctly.                                  */ 00508000
*DCL FxeCntrlRsn_BadRequest BIT(32) Constant('00000811'X) ; /*          00509000
*                        Meaning: A bad REQUEST type has been           00510000
*                        specified.                                     00511000
*                        Action: Use one of the supported request       00512000
*                        types.                                      */ 00513000
*DCL FxeCntrlRsn_BadParmlistVersion BIT(32) Constant('00000812'X) ; /*  00514000
*                        Meaning: The specified version of the macro is 00515000
*                        not compatible with the current version of IBM 00516000
*                        Function Registry for z/OS.                    00517000
*                        Action: Avoid requesting parameters that are   00518000
*                        not supported by this version of IBM Function  00519000
*                        Registry for z/OS.                          */ 00520000
*DCL FxeCntrlRsn_BadFunctionUpdateType BIT(32) Constant('00000813'X)    00521000
*                        ; /*                                           00522000
*                        Meaning: Bad function update type.             00523000
*                        Action: Use only supported updated types:      00524000
*                        ANYAUTH, AUTHONLY, or VALUE. If VALUE, then    00525000
*                        FUNCUPDTYPVALUE has to be 0 (ANYAUTH) or 1     00526000
*                        (AUTHONLY).                                 */ 00527000
*DCL FxeCntrlRsn_NotAuthorizedForFuncUpdType BIT(32)                    00528000
*                        Constant('00000814'X) ; /*                     00529000
*                        Meaning: Not authorized for FUNCTIONUPDTYPE.   00530000
*                        Action: Only authorized callers are allowed to 00531000
*                        use FUNCTIONUPDTYPE=AUTHONLY or                00532000
*                        FUNCTIONUPDTYPE=VALUE and FUNCUPDTYPVALUE=1    00533000
*                        (AUTHONLY).                                 */ 00534000
*DCL FxeCntrlRsn_BadEnabledValue BIT(32) Constant('00000815'X) ; /*     00535000
*                        Meaning: Bad ENABLED value.                    00536000
*                        Action: Use only supported ENABLED values:     00537000
*                        YES, NO, or VALUE. If VALUE, then ENABLEDVALUE 00538000
*                        has to be 1 (YES) or 0 (NO).                */ 00539000
*DCL FxeCntrlRsn_EnabledNotTracked BIT(32) Constant('00000816'X) ; /*   00540000
*                        Meaning: Enablement state is not tracked. The  00541000
*                        request was aborted and no, or, if wildcards   00542000
*                        have been used in the VENDOR, PRODUCT, or      00543000
*                        FUNCTION selectors, not all, matching function 00544000
*                        entries had their enablement state changed.    00545000
*                        Action: The selected function entry is set up  00546000
*                        to not track enablement state. Refer to the    00547000
*                        documentation for this function entry for more 00548000
*                        information about its capabilities.         */ 00549000
*DCL FxeCntrlRsn_UsageNotTracked BIT(32) Constant('00000817'X) ; /*     00550000
*                        Meaning: Usage information is not tracked. The 00551000
*                        request was aborted and no, or, if wildcards   00552000
*                        have been used in the VENDOR, PRODUCT, or      00553000
*                        FUNCTION selectors, not all, matching function 00554000
*                        entries had their usage information changed.   00555000
*                        Action: The selected function entry is set up  00556000
*                        to not track usage information. Refer to the   00557000
*                        documentation for this function entry for more 00558000
*                        information about its capabilities.         */ 00559000
*DCL FxeCntrlRsn_BadVendorSlot BIT(32) Constant('00000818'X) ; /*       00560000
*                        Meaning: Invalid VENDORSLOT.                   00561000
*                        Action: Ensure a valid VENDORSLOT number is    00562000
*                        specified. In particular 0 (zero) is not       00563000
*                        valid. Slot numbers start at 1 (one).       */ 00564000
*DCL FxeCntrlRsn_BadProductSlot BIT(32) Constant('00000819'X) ; /*      00565000
*                        Meaning: Invalid PRODUCTSLOT.                  00566000
*                        Action: Ensure a valid PRODUCTSLOT number is   00567000
*                        specified. In particular 0 (zero) is not       00568000
*                        valid. Slot numbers start at 1 (one).       */ 00569000
*DCL FxeCntrlRsn_BadFunctionSlot BIT(32) Constant('0000081A'X) ; /*     00570000
*                        Meaning: Invalid FUNCTIONSLOT.                 00571000
*                        Action: Ensure a valid FUNCTIONSLOT number is  00572000
*                        specified. In particular 0 (zero) is not       00573000
*                        valid. Slot numbers start at 1 (one).       */ 00574000
*DCL FxeCntrlRsn_NotAuthorizedForApplyIplParm BIT(32)                   00575000
*                        Constant('0000081B'X) ; /*                     00576000
*                        Meaning: Not authorized for                    00577000
*                        REQUEST=APPLYIPLPARM.                          00578000
*                        Action: Only authorized callers are allowed to 00579000
*                        use request type APPLYIPLPARM.              */ 00580000
*DCL FxeCntrlRsn_BadProductArea BIT(32) Constant('0000081C'X) ; /*      00581000
*                        Meaning: Error accessing product area.         00582000
*                        Action: Make sure that the provided            00583000
*                        product area, referenced by parameter          00584000
*                        PRODUCTAREA or PRODAREAADDR, is valid          00585000
*                        (in common storage, writable, not NULL etc.).  00586000
*                                                                    */ 00587000
*DCL FxeCntrlRsn_BadParmlistUpd BIT(32) Constant('0000081D'X) ; /*      00588000
*                        Meaning: Error updating parameter list for     00589000
*                        output parameters.                             00590000
*                        Action: Make sure that the provided parameter  00591000
*                        list is valid and writable.                 */ 00592000
*DCL FxeCntrlRc_SevereError BIT(32) Constant('0000000C'X) ; /*          00593000
*                        Meaning: Severe Error / Environment Error      00594000
*                        Action: Refer to action under the individual   00595000
*                        reason code.                                */ 00596000
*DCL FxeCntrlRsn_RegistryNotAvailable BIT(32) Constant('00000C80'X)     00597000
*                        ; /*                                           00598000
*                        Meaning: IBM Function Registry for z/OS is not 00599000
*                        available.                                     00600000
*                        Action: This might be a temporary situation in 00601000
*                        the very early phases of the system start.     00602000
*                        Contact IBM support if this problem persists   00603000
*                        and if problem reporting databases do not list 00604000
*                        an existing fix.                            */ 00605000
*DCL FxeCntrlRsn_EnabledValNotSupported BIT(32) Constant('00000C81'X)   00606000
*                        ; /*                                           00607000
*                        Meaning: Unsupported ENABLED value in          00608000
*                        registry. The request was aborted and no, or,  00609000
*                        if wildcards have been used in the VENDOR,     00610000
*                        PRODUCT, or FUNCTION selectors, not all,       00611000
*                        matching function entries had their enablement 00612000
*                        state changed.                                 00613000
*                        Action: Contact the owner of the selected      00614000
*                        function entry. An unsupported enabled value   00615000
*                        was found in the registry for this function    00616000
*                        entry.                                      */ 00617000
*DCL FxeCntrlRsn_EnabledValLocked BIT(32) Constant('00000C82'X) ; /*    00618000
*                        Meaning: ENABLED locked in registry. The       00619000
*                        request was aborted and no, or, if wildcards   00620000
*                        have been used in the VENDOR, PRODUCT, or      00621000
*                        FUNCTION selectors, not all, matching function 00622000
*                        entries had their enablement state changed.    00623000
*                        Action: The selected function entry is not set 00624000
*                        up to have its enablement state changed. Refer 00625000
*                        to the documentation for this function entry   00626000
*                        for more information about its capabilities.*/ 00627000
*DCL FxeCntrlRsn_UsageValNotSupported BIT(32) Constant('00000C83'X)     00628000
*                        ; /*                                           00629000
*                        Meaning: Unsupported usage indicator in        00630000
*                        registry. The request was aborted and no, or,  00631000
*                        if wildcards have been used in the VENDOR,     00632000
*                        PRODUCT, or FUNCTION selectors, not all,       00633000
*                        matching function entries had their usage      00634000
*                        indicator changed.                             00635000
*                        Action: Contact the owner of the selected      00636000
*                        function entry. An unsupported usage indicator 00637000
*                        was found in the registry for this function    00638000
*                        entry.                                      */ 00639000
*DCL FxeCntrlRsn_EnabledInvalidFuncEntry BIT(32) Constant('00000C8A'X)  00640000
*                        ; /*                                           00641000
*                        Meaning: Inconsistent function entry (FXEFRFE) 00642000
*                        in registry. The request was aborted and no,   00643000
*                        or, if wildcards have been used in the VENDOR, 00644000
*                        PRODUCT, or FUNCTION selectors, not all,       00645000
*                        matching function entries had their enablement 00646000
*                        state changed.                                 00647000
*                        Action: Contact the owner of the selected      00648000
*                        function entry. An inconsistent function entry 00649000
*                        was found in the registry. For example, the    00650000
*                        function entry did not have a recognized       00651000
*                        acronym value set in its FXEFRFE_ID field.     00652000
*                                                                    */ 00653000
*DCL FxeCntrlRsn_UsageInvalidFuncEntry BIT(32) Constant('00000C8B'X)    00654000
*                        ; /*                                           00655000
*                        Meaning: Inconsistent function entry (FXEFRFE) 00656000
*                        in registry. The request was aborted and no,   00657000
*                        or, if wildcards have been used in the VENDOR, 00658000
*                        PRODUCT, or FUNCTION selectors, not all,       00659000
*                        matching function entries had their function   00660000
*                        usage indicator state changed.                 00661000
*                        Action: Contact the owner of the selected      00662000
*                        function entry. An inconsistent function entry 00663000
*                        was found in the registry. For example, the    00664000
*                        function entry did not have a recognized       00665000
*                        acronym value set in its FXEFRFE_ID field.     00666000
*                                                                    */ 00667000
*DCL FxeCntrlRc_CompError BIT(32) Constant('00000010'X) ; /*            00668000
*                        Meaning: Component error.                      00669000
*                        Action: Report the associated reason code to   00670000
*                        the system programmer to contact IBM Service.  00671000
*                                                                    */ 00672000
*/* End of FXECNTRL Return and Reason Code definitions               */ 00673000
* /*** AMGRET - END   ***/                                              00674000
*                                                                       00675000
*@LOGIC;                                                                00676000
*#PRAGMA TOOL=CBGEN.                                                    00677000
*#USEORG.                                                               00678000
*#ALIGNOP.                                                              00679000
*#NOTUPPER.                                                             00680000
*#EPRAGMA.                                                              00681000
*@ENDLOGIC;                                                             00682000
*/* End of PL/X Source                                               */ 00683000
* %IF FXEZCTRL_LIST ^= 'NO' &                                           00684000
*    ZCBPRINT ^= 'NO' %THEN                                             00685000
*   %GOTO FXEZCTRL_4;                                                   00686000
*   @LIST POP NOECHO;                                                   00687000
* %FXEZCTRL_4:;                                                         00688000
* %END;                                                                 00689000
