*/********************************************************************/         
*/*                                                                  */         
*/* $MAC(GFSAUSMF) COMP(5695DF121): NFSS XI                          */         
*/*                                                                  */         
*/* MACRO NAME: GFSAUSMF.ASM                                         */         
*/*                                                                  */         
*/* DESCRIPTION:  Contains ASM Language Mapping of SMF type 42       */         
*/*               and the subtype 7, 8 and 26 records.         @LCOC */         
*/*                                                                  */         
*/* STATUS:  z/OS V2R5 NFS Server                               @LI0C*/         
*/*                                                                  */         
*/* COPYRIGHT:                                                       */         
*/*PROPRIETARY V3 STATEMENT                                          */         
*/*Licensed Materials - Property of IBM                         @LI0C*/         
*/*5650-ZOS                                                     @P06C*/         
*/*Copyright IBM Corp. 1996, 2021                               @LI0C*/         
*/*END PROPRIETARY V3 STATEMENT                                      */         
*/*                                                                  */         
*/* EXTERNAL CLASSIFICATION: PI                                 @P07A*/         
*/* END OF EXTERNAL CLASSIFICATION:                             @P07A*/         
*/*                                                                  */         
*/* FUNCTION: Contains ASM Language Mapping of SMF type 42           */         
*/*           subtypes 7, 8 and 26 records in the following    @LCOC */         
*/*           format:                                                */         
*/*                                                           2@02D  */         
*/*            ---------------------------------------               */         
*/*            ! Subtype 7 or 8 or 26 Header         !         @LCOC */         
*/*            ---------------------------------------               */         
*/*            ! Product Section                     !               */         
*/*            ---------------------------------------               */         
*/*            ! Subtype 7 or 8 or 26 Data           !         @LCOC */         
*/*            ---------------------------------------               */         
*/*            ! Client Section                      !               */         
*/*            ---------------------------------------               */         
*/*                                                                  */         
*/*  Note: 1) To obtain address of the subtype 7,8 or 26 header @LCOC*/         
*/*           add SMF42LEN to the address of the type 42 header      */         
*/*        2) To obtain the address of the product section           */         
*/*           add SMF42OPS to the address of the type 42 header      */         
*/*        3) a) To obtain the address of the subtype 7 data portion */         
*/*              add SMF42NFO to the address of the type 42 header   */         
*/*           b) To obtain the address of the subtype 8 data portion */         
*/*              add SMF42NUO to the address of the type 42 header   */         
*/*           c) To obtain the address of the subtype 26 data   @LCOA*/         
*/*              add SMF42ADO to the addr of the type 42 header @LCOA*/         
*/*        4) a) To obtain the address of the subtype 7 client       */         
*/*              section add SMF42FLO to the address of the          */         
*/*              current subtype 7 data portion. There can be more   */         
*/*              than one subtype 7 record in a type 42 record.      */         
*/*              There will always be a subtype 7 and client pair.   */         
*/*           b) To obtain the address of the subtype 8 client       */         
*/*              section add SMF42UCO to the address of the          */         
*/*              type 42 header.                                     */         
*/*           c) To obtain the address of the subtype 26 client @LCOA*/         
*/*              section add SMF42ALO to the address of the     @LCOA*/         
*/*              type 42 header.                                @LCOA*/         
*/*                                                                  */         
*/*                                                                  */         
*/* NOTES:                                                           */         
*/*   DEPENDENCIES:  All changes made to this macro must be          */         
*/*                  reflected in GFSASSMF.                      @02C*/         
*/*                  All changes made into IGWSMF SMF42 header   @02A*/         
*/*                  should be reflected in GFSASSMF             @02A*/         
*/*   USAGE:         To get SMF42 header definitions if needed   @02A*/         
*/*                  IGWSMF should be used and precede GFSAUSMF: @02A*/         
*/*                  IGWSMF           ! GFSASSMF covers the both @02A*/         
*/*                  GFSAUSMF         ! macros definitions       @02A*/         
*/*                                                                  */         
*/* MACRO:                                                           */         
*/*   PROCESSOR:   High Level Assembler                              */         
*/*   LIBRARY:     NFSLB                                             */         
*/*   ATTRIBUTES:  Include                                           */         
*/*                                                                  */         
*/*                                                                  */         
*/* EXTERNAL REFERENCES:  (external to this header file)             */         
*/*   DATA AREAS:     None                                           */         
*/*   CONTROL BLOCKS: None                                           */         
*/*   MACROS:         None                                           */         
*/*                                                                  */         
*/* CHANGE ACTIVITY:                                                 */         
*/*                                                                  */         
*/*$L33=NFS,HDZ11NP,940310,SJPLTEM: New macro for DFSMS 1.2/NFSS@L33A*/         
*/*$P1=KA90085,HDZ11NP,940623,SJPLTEM: Add File sys & type values@P1A*/         
*/*$P2=KA90127,HDZ11NP,940726,SJPLTEM: Remove HFS block counters @P2A*/         
*/*$P3=KA90179,HDZ11NP,940909,SJPLTEM: Define HFS SMF42FSN & FDN @P3A*/         
*/*$L75=NFS,HDZ11VS,031209,IBSVKR:  IPv6 support                @L75A*/         
*/*$01=OA08867,HDZ11US,040712,IBSVKR: Add Sybtype Version Number @01A*/         
*/*$02=OA10174,HDZ11US,050311,IBSGYG: for IGWSMF compatibility as@02A*/         
*/*                                   IGWSMF contains SMF42 header02A*/         
*/*$03=OA15050,HDZ118N,060130,SJPLMTM: Remove SMF42PSV reserved  @03A*/         
*/*                                    field added from IPv6     @03A*/         
*/*                                    integration (@L75).       @03A*/         
*/*$LCO=__NFS__,HDZ1C1N,090407,IBSIPI :                         @LCOA*/         
*/*    1. Add SMF type 42 subtype 26 recording                  @LCOA*/         
*/*$P04=KCN0097,HDZ1C1N,091103,IBSVKR:                          @P04A*/         
*/*    1. Delete SMF42ATN field (New Data Set Type)             @P04A*/         
*/*$004=OA33868,HDZ1D1N,100730,IBSVKR:                          @004A*/         
*/*    1. Fix syntax errors                                     @004A*/         
*/*$P05=KDN0062,HDZ1D1N,100924,IBSVKR:                          @P05A*/         
*/*    1. Add comment to define 0 value of SMF42ATY             @P05A*/         
*/*------------------ Release V2R1 ---------------------------  @P06A*/         
*/*$P06=KEN0146,HDZ221N,20110911,SJPLMB:                        @P06A*/         
*/*    1. Change Copyright to "IBM Corp." before date(s).       @P06A*/         
*/*    2. Changed product id from "5694-A01" to "5650-ZOS".     @P06A*/         
*/*$LE7=__NFS__,HDZ221N,20120228,SJPLMB:                        @LE7A*/         
*/*    1. Changed Copyright from 2012 to 2013.                  @LE7A*/         
*/*$005=OA41861,HDZ221N,20130507,IBSVKR:                        @005A*/         
*/*    1. Avoid duplicate some fields with IGWSMF               @005A*/         
*/*------------------ Release V2R5 ---------------------------  @LI0A*/         
*/*$LI0=W355999,HDZ225N,20200110,PDSA:                          @LI0A*/         
*/*    1. Update constants for HDZ225N release.                 @LI0A*/         
*/*    2. Remove sequence numbers.                              @LI0A*/         
*/*$P07=PR00125,HDZ225N,20210316,PDEJH:                         @P07A*/         
*/*    1. Add external classification.                          @P07A*/         
*/*                                                                  */         
*/********************************************************************/         
         MACRO                                                                  
         GFSAUSMF &Subtype                                        @005C         
.*Values for &Subtype must be enclosed parentheses unless only one@005A         
         LCLA  &I             Index to each substring value       @005A         
         LCLB  &Subtypes(26)  Switch to map each subtype          @005A         
.* After the LCLB all bits are logically zero.                    @005A         
         AIF   ('&Subtype' EQ '').GotParms                        @005A         
.STLoop  ANOP                 Loop to examine subtypes            @005A         
&I       SETA  &I+1           Increment to first or next number   @005A         
         AIF   (&I GT N'&Subtype).GotParms   Go if no more numbers@005A         
         AIF   ('&Subtype(&I)' EQ '').E3     Go if null value     @005A         
         AIF   (T'&Subtype(&I) NE 'N').E4    Go if not numeric    @005A         
         AIF   (&Subtype(&I) NE 7 AND &Subtype(&I) NE 8 AND            *        
               &Subtype(&I) NE 26).E5        Go if invalid subtype@005A         
&Num     SETA  &Subtype(&I)                                       @005A         
&Subtypes(&Num) SETB 1          Ensure mapping of this subtype    @005A         
         AGO   .STLoop                                            @005A         
.E3      MNOTE 4,'Null record subtype ignored in GFSAUSMF'        @005A         
         AGO   .STLoop                                            @005A         
.E4      MNOTE 4,'&Subtype(&I) must be numeric in GFSAUSMF'       @005A         
         AGO   .STLoop                                            @005A         
.E5      MNOTE 4,'Invalid record type &Subtype(&I) specified and ignore*        
               d'                                                 @005A         
         AGO   .STLoop                                            @005A         
.GotParms ANOP                                                    @005A         
.* The &Subtypes array has bits to tell which subtypes to map.    @005A         
.* The default is for all of them to be zero.                     @005A         
*                                                                               
*                                                                               
********************************************************************            
*     Header for SMF record type 42 should be used from  IGWSMF   @02C          
********************************************************************            
*                                                                               
*                                                                               
*  SMF42 header definition is deleted from GFSAUSMF. For reference@02A          
*  the SMF42 header contains the following fields :               @02A          
*                                                                               
*SMF42    DSECT                                                 56@02D          
*SMF42BAS DS    0D        SMF42BAS is the basing expr.                          
*SMF42RCL DS    H         Record Length                                         
*SMF42SGD DS    H         Segment Descriptor (RDW) -- 0 if record is            
**                        not spanned                                           
*SMF42FLG DS    0BL1      System indicator flags                                
*SMF42FSI EQU   X'80'     When set=subsystem id follows system id               
*SMF42FSU EQU   X'40'     When set = subtypes are used                          
*SMF42FXA EQU   X'04'     When set = MVS/XA (SMF enters)                        
*SMF42FS2 EQU   X'02'     When set = VS2 (SMF enters)                           
*SMF42FS1 EQU   X'01'     When set = VS1 (SMF enters)                           
*         ORG   SMF42FLG+X'00000001'                                            
*SMF42RTY DS    X         Record type: 42 (X'2A')                               
*SMF42TME DS    FL4       Time in hundredths of a second when record            
*                        was moved to SMF buffer                                
*SMF42DTE DS    CL4       Date record written (by SMF)                          
*SMF42SID DS    CL4       System identification (by SMF)                        
*SMF42SSI DS    CL4       Subsystem Id                                          
*SMF42STY DS    HL2       Record subtype                                        
*SMF42NT  DS    HL2       Number of triplets (optional)                         
*         DS    HL2       Reserved (optional)                                   
**                                                                              
********************************************************************            
*    Product section triplet                                       *            
********************************************************************            
**                                                                              
*SMF42OPS DS    FL4       Offset to product section                             
*SMF42LPS DS    HL2       Length of product section                             
*SMF42NPS DS    HL2       Number of product sections                            
**                                                                              
********************************************************************            
*    Header must end on word boundary                              *            
********************************************************************            
**                                                                              
*SMF42END DS    0F        1st data section triplet                              
*SMF42LEN EQU  *-SMF42                                                          
**                                                                              
**                                                                              
********************************************************************            
*     Product Section                                              *            
********************************************************************            
**                                                             2@03D            
*SMF42PRD DSECT                                                                 
*SMF42PDL DS    CL8       Product Level                                         
*SMF42PDN DS    CL10      Product Name                                          
*SMF42PSV DS    CL1       Subtype Version Number                @01A            
*         DS    CL21      Reserved                              @01C            
**                                                                              
********************************************************************            
*    Product section must end on word boundary                     *            
********************************************************************            
**                                                                              
*SMF42PEN DS    0F                                                              
*SMF42PLN EQU   *-SMF42PRD Length of product section                            
**                                                                              
**    end of header deletion                                    56@02D          
*******************************************************************             
*  SMF42 subtype 7 header section                                 *             
*   (file timeout statistics)                                     *             
*******************************************************************             
*                                                                               
SMF427H  DSECT                                                                  
SMF42NFO DS    F         Offset to NFSS file timeout stats section              
SMF42NFL DS    H         Length of NFSS file timeout stats section              
SMF42NFN DS    H         Number of NFSS file timeout stats section              
SMF427HE EQU   *-SMF427H Length of subtype 7 header                             
*                                                                               
*                                                                               
********************************************************************            
*   SMF42 subtype 8 header section                                 *            
*    (user logout statistics )                                     *            
********************************************************************            
*                                                                               
SMF428H  DSECT                                                                  
SMF42NUO DS    F         Offset to NFSS user session stats section              
SMF42NUL DS    H         Length of NFSS user session stats section              
SMF42NUN DS    H         Number of NFSS user session stats section              
SMF428HE EQU   *-SMF428H Length of subtype 8 header                             
*                                                                               
*                                                                               
*******************************************************************             
*  SMF42 subtype 26 header section                          @LCOA *             
*  audit (delete/rename/create) statistics                  @LCOA *             
*******************************************************************             
*                                                                               
SMF4226H DSECT                                                                  
SMF42ADO DS    F    Offset to NFSS audit stats section          @LCOA           
SMF42ADL DS    H    Length to NFSS audit stats section          @LCOA           
SMF42ADN DS    H    Number to NFSS audit stats section          @LCOA           
SMF4226L EQU   *-SMF4226H Length of subtype 26 header           @004C           
*                                                                               
*                                                                               
        AIF (NOT &Subtypes(7) AND '&Subtype' NE '').SKIP_07     @005A           
********************************************************************            
*     SMF type 42 subtype 7 file timeout Statistics                *            
*       (file timeout statistics)                                  *            
********************************************************************            
*                                                                               
SMF42S7  DSECT                                                                  
         AIF ('&Subtype' EQ '').Old07A  Go if called the old way @005A          
SMF42FLOff DS  F         Offset to client identification section @005A          
SMF42FLLI  DS  H         Length of client identification section @005A          
SMF42FFST  DS  X         File system type indicator              @005A          
         AGO   .End07A                                           @005A          
.Old07A  ANOP                                                    @005A          
SMF42FLO DS    F         Offset to client identification section                
SMF42FLL DS    H         Length of client identification section                
SMF42FFS DS    X         File system type indicator                             
.End07A  ANOP                                                    @005A          
*                            01 = z/OS UNIX                   @LCOC             
*                            02 = MVS                          @P1A             
SMF42FTY DS    X         File type as defined in NFS protocol                   
*                            00 = Non-file                     @P1A             
*                            01 = Regular file                 @P1A             
*                            02 = Directory                    @P1A             
*                            03 = Block special device         @P1A             
*                            04 = Character special device     @P1A             
*                            05 = Symbolic link                @P1A             
SMF42FTM DS    X         MVS data set type                                      
*                             0 = unknown MVS file type        @P1A             
*                             1 = Sequential (BSAM) file       @P1A             
*                             2 = Partitioned (BPAM)           @P1A             
*                             3 = Direct Access file           @P1A             
*                             4 = ISAM is not supported        @P1A             
*                             5 = Virtual Sequential Access    @P1A             
*                             6 = VSAM Entry Sequenced         @P1A             
*                             7 = VSAM Relative Record         @P1A             
*                             8 = VSAM Keyed access            @P1A             
*                             9 = dummy index level file block @P1A             
*                            10 = z/OS UNIX file type         @LCOC             
         DS    XL3       Reserved                                               
SMF42FSN DS    F         File Serial Number, z/OS UNIX INODE  @LCOC             
         AIF ('&Subtype' EQ '').Old07B  Go if called the old way @005A          
SMF42FDNZ DS   F         Unique device number z/OS UNIX FSYS     @005A          
SMF42FIRN DS   F         Number of I/O blocks read               @005A          
SMF42FIWN DS   F         Number of I/O blocks written            @005A          
         AGO   .End07B                                           @005A          
.Old07B  ANOP                                                    @005A          
SMF42FDN DS    F         Unique device number z/OS UNIX FSYS  @LCOC             
SMF42FIR DS    F         Number of I/O blocks read                              
SMF42FIW DS    F         Number of I/O blocks written                           
.End07B  ANOP                                                    @005A          
         DS    F         Reserved                                               
SMF42FBR DS    D         Number of bytes read from file                         
SMF42FBW DS    D         Number of bytes written to file                        
         AIF ('&Subtype' EQ '').Old07C  Go if called the old way @005A          
SMF42FNLen  DS H         Length of file name                     @005A          
SMF42FCLB   DS 0D        C370 ends structure on dblword boundry  @005A          
SMF42FFName DS 0D        File name                               @005A          
         AGO   .End07C                                           @005A          
.Old07C  ANOP                                                    @005A          
SMF42FNL DS    H         Length of file name                                    
SMF42FCL DS    0D        C370 ends structure on doubleword boundry              
SMF42FFN DS    0D        File name                         @P2C                 
.End07C  ANOP                                                    @005A          
*                                                                               
* The file name is either a 256 byte character string, or a                     
* 1023 byte character string. SMF42FNL will contain the length                  
*                                                                               
*                        Start of Client Section                                
SMF42F7E EQU   *-SMF42S7 Length of subtype 7 data section                       
*                                                                               
SMFSNAME EQU   256       Short file name                                        
SMFLNAME EQU   1023      Long file name                                         
.SKIP_07 ANOP                                                    @005A          
*                                                                               
*                                                                               
********************************************************************            
*  Client Identification Section. Version 0                   @L75C*            
********************************************************************            
*                                                                               
SMF42CS0 DSECT                                                 @L75C            
SMF42CRI DS    CL8       RACF user ID                                           
SMF42CRG DS    CL8       RACF group name                                        
SMF42CAN DS    CL8       Account Number                                         
SMF42CUI DS    F         User ID at client host (UNIX style)                    
SMF42CGI DS    F         Group ID at client host (UNIX style)                   
SMF42CIP DS    F         IP address of client host                              
SMF42CHL DS    H         Length of client host name                             
SMF42CHN DS    CL256     Client host name                      @L75C            
SMF42CSE EQU   *-SMF42CS0 Length of Client Section Version 0   @P05C            
*                                                                               
*                                                                               
********************************************************************            
*  Client Identification Section. Version 2                   @L75A*            
********************************************************************            
*                                                                               
SMF42CS2 DSECT                                                 @L75A            
S2F42CRI DS    CL8       RACF user ID                          @L75A            
S2F42CRG DS    CL8       RACF group name                       @L75A            
S2F42CAN DS    CL8       Account Number                        @L75A            
S2F42CUI DS    F         User ID at client host                @L75A            
S2F42CGI DS    F         Group ID at client host               @L75A            
S2F42CIP DS    CL16      IPv6 address of client host           @L75A            
S2F42CHL DS    H         Length of client host name            @L75A            
S2F42CHN DS    CL256     Client host name                      @L75A            
S2F42CSE EQU   *-SMF42CS2 Length of Client Section Version 2   @L75A            
*                                                                               
*                                                                               
         AIF (NOT &Subtypes(8) AND '&Subtype' NE '').SKIP_08     @005A          
********************************************************************            
*  SMF type 42 subtype 8 user session completion Statistics        *            
*    (user logout statistics )                                     *            
********************************************************************            
*                                                                               
SMF42S8  DSECT                                                                  
SMF42UCO DS    F         Offset to client identification section                
SMF42UCL DS    H         Length of client identification section                
         DS    H         Reserved                                               
SMF42UST DS    D         Session start time (in STCK format)                    
SMF42UET DS    D         Session end time (in STCK format)                      
SMF42UEL DS    F         Session elapsed time (in milliseconds)                 
SMF42UNR DS    F         Number of RPC requests processed in this               
*                        session                                                
SMF42UTE DS    F         Total elapsed time of all RPC requests                 
*                        processes in this session                              
SMF42UAT DS    F         Total active time of all RPC requests                  
*                        processes in this session                              
SMF42URN DS    D         Number of bytes read in from the network in            
*                        this session                                           
SMF42UWN DS    D         Number of bytes written out to the network             
*                        in this session. */                                    
SMF42URF DS    D         Number of bytes read from files on this                
*                        session */                                             
SMF42UWF DS    D         Number of bytes written to files in this               
*                        session                                                
SMF42UCS DS    0F        Start of Client Section                                
SMF42S8E EQU   *-SMF42S8 Length of subtype 8 data section                       
.SKIP_08 ANOP                                                    @005A          
*                                                                               
         AIF (NOT &Subtypes(26) AND '&Subtype' NE '').SKIP_26     @005A         
********************************************************************            
*     SMF type 42 subtype 26 create/delete/rename Statistics @LCOA *            
********************************************************************            
*                                                                               
SMF42S26 DSECT                                                   @LCOA          
SMF42ALO DS    F       Offset to client identification section   @LCOA          
SMF42ALL DS    H       Length of client identification section   @LCOA          
SMF42AOV DS    X       NFS protocol version (2,3 or 4)           @LCOA          
SMF42AOP DS    X       NFS operation/procedure number            @LCOA          
SMF42AFS DS    X       File system type z/OS UNIX = 1, MVS = 2   @LCOA          
         DS    XL3     Reserved                                  @LCOA          
*                                                                @LCOA          
*  Legacy MVS audit data  *                                      @LCOA          
*                                                                @LCOA          
SMF42ATM DS    X       Data Set type                             @LCOA          
*                             0 = unknown MVS file type          @LCOA          
*                             1 = Sequential (BSAM) file         @LCOA          
*                             2 = Partitioned (BPAM)file         @LCOA          
*                             3 = Direct Access file             @LCOA          
*                             4 = ISAM is not supported          @LCOA          
*                             5 = Virtual Sequential Access      @LCOA          
*                             6 = VSAM Entry Sequenced           @LCOA          
*                             7 = VSAM Relative Record           @LCOA          
*                             8 = VSAM Keyed access              @LCOA          
*                             9 = dummy index level file block   @LCOA          
         DS    X       Reserved                                  @LCOA          
SMF42AVL DS    CL6     Volume name 6 chars                       @LCOA          
SMF42ANL DS    F       Data set name length                      @LCOA          
**                                                               @004C          
         DS    XL2     Reserved                                  @P04C          
SMF42AVN DS    CL6     New Volume name 6 chars                   @LCOA          
SMF42ANN DS    F       New Data set name length                  @LCOA          
*                                                                @LCOA          
*    z/OS UNIX audit data  *                                     @LCOA          
*                                                                @LCOA          
         ORG   SMF42ATM                                          @LCOA          
SMF42ATY DS    X       File object type                          @LCOA          
*                      0 = Unknown file type                     @P05A          
*                      1 = Directory                             @LCOA          
*                      2 = Character special file                @LCOA          
*                      3 = Regular file                          @LCOA          
*                      4 = Named pipe (FIFO) file                @LCOA          
*                      5 = Symbolic link                         @LCOA          
*                      6 = Block special file                    @LCOA          
*                      7 = Socket file                           @LCOA          
         DS    XL3     Reserved                                  @LCOA          
SMF42ASD DS    F       File system device number                 @LCOA          
SMF42ASL DS    F       File system name length                   @LCOA          
SMF42ASN DS    CL44    File system name 1-44 chars               @LCOA          
SMF42AFI DS    F       File inode attribute                      @LCOA          
SMF42AFA DS    CL16    File audited attribute                    @LCOA          
SMF42ADI DS    F       Directory inode attribute                 @LCOA          
SMF42ADA DS    CL16    Directory audited attribute               @LCOA          
SMF42AFL DS    F       File name length                          @LCOA          
*                                                                @LCOA          
SMF42ANI DS    F       New directory inode attribute             @LCOA          
SMF42ANA DS    CL16    New directory audited attribute           @LCOA          
SMF42AFN DS    F       New file name length                      @LCOA          
*                                                                @LCOA          
SMF42ANM DS    CL1     File name and New File name, if exist     @LCOA          
*                      It is not NULL terminated                 @LCOA          
SMF4226E EQU   *-SMF42S26 Length of subtype 26 data section      @LCOA          
.SKIP_26 ANOP                                                    @005A          
         MEND                                                                   
