         MACRO                                                                  
         GIMMASM                                                                
********************************************************************            
*                                                                  *            
* GIMMASM - SMP/E API MACRO FOR ASSEMBLER                          *            
*                                                                  *            
* Licensed Materials - Property of IBM                             *            
* 5694-A01  5655-G44                                               *            
* Copyright IBM Corp. 1998, 2001                                   *            
*                                                                  *            
********************************************************************            
********************************************************************            
*                                                                  *            
* CHANGE_ACTIVITY                                                  *            
*                                                                  *            
* ---------------------------------------------------------------- *            
* FLAG REASON  RELEASE   DATE   ORG  DESCRIPTION                   *            
* ---- ------- ------- -------- ---  ----------------------------- *            
* $L0= IR38136  25.11  06/25/98 WAG: CUSTOMER LVL 25.11            *            
*                                    API ASSEMBLER SUPPORT         *            
* $01= IR41893  27.14  01/04/00 WAG: INCORRECT POINTER STORAGE SIZE*            
* $P1=          37.00  11/16/18 KJQ: 3-CHAR PTF LEVEL              *            
*                                                                  *            
********************************************************************            
*   CHANGE FLAG KEY: M@PNC                                         *            
*   WHERE:                                                         *            
*                                                                  *            
* M= MULTIPLE    P= DCRS = D,E,F,G    N= 0-9,A-Z     C= A = ADD    *            
*    FOR DELETE     HDWE = H,I,J,K                      C = CHANGE *            
*    FLAGS ONLY     LINE = L,M,N,O                      P = COPY   *            
*                   PTMS = P,Q,R,S                      M = MOVE   *            
*                   APARS = 0-9                         D = DELETE *            
********************************************************************            
*****************************************************************               
* PARAMETERS FOR QUERY COMMAND                                  *               
*****************************************************************               
QUERY_PARMS DS 0CL40                   PARAMETERS FOR QUERY COMMAND             
PCSI        DS AL4                     PTR TO GLOBAL CSI DATASET                
CSILEN      DS FL4                     LENGTH OF DATA SET NAME                  
PZONE       DS AL4                     PTR TO LIST OF ZONES                     
ZONELEN     DS FL4                     LENGTH OF ZONE LIST                      
PENTRY      DS AL4                     PTR TO LIST OF ENTRIES                   
ENTRYLEN    DS FL4                     LENGTH OF ENTRY LIST                     
PSUBENTRY   DS AL4                     PTR TO LIST OF SUBENTRIES                
SUBENTRYLEN DS FL4                     LENGTH OF SUBENTRY LIST                  
PFILTER     DS AL4                     PTR TO QUERY FILTER                      
FILTERLEN   DS FL4                     LENGTH OF FILTER                         
*****************************************************************               
* LIST OF ENTRY TYPES                                           *               
*****************************************************************               
ENTRY_LIST  DSECT                      LIST OF ENTRY TYPES                      
NEXT        DS AL4                     PTR TO NEXT ITEM IN LINKED LIST          
ENTRIES     DS AL4                     PTR TO HEAD OF LINKED LIST OF            
*                                      CSIENTRY STRUCTURES LISTING THE          
*                                      INSTANCES OF THIS ENTRY TYPE             
TYPE        DS CL12                    ENTRY TYPE                               
*****************************************************************               
* DESCRIPTION OF A SPECIFIC ENTRY                               *               
*****************************************************************               
CSIENTRY    DSECT                      DESCRIPTION OF A SPECIFIC ENTRY          
CSINEXT     DS AL4                     PTR TO NEXT ITEM IN LINKED LIST          
SUBENTRIES  DS AL4                     PTR TO HEAD OF LINKED LIST OF            
*                                       SUBENTRY STRUCTURES LISTING THE         
*                                       SUBENTRY VALUES RETURNED FOR            
*                                       THIS ENTRY                              
ENTRYNAME   DS CL8                     NAME OF ENTRY                            
ZONENAME    DS CL7                     ZONE WHERE ENTRY WAS RETRIEVED           
*****************************************************************               
* SUBENTRY DATA                                                 *               
*****************************************************************               
SUBENTRY    DSECT                      CONTAINS SUBENTRY DATA                   
SUBNEXT     DS AL4                     PTR TO NEXT ITEM IN LINKED LIST          
SUBENTDATA  DS AL4                     PTR TO HEAD OF LINKED LIST OF            
*                                      DATA VALUES FOR THIS SUBENTRY            
SUBTYPE     DS CL12                    SUBENTRY TYPE                            
*****************************************************************               
* SUBENTRIES ASSOCIATED WITH ++VER RECORDS OF A SYSMOD          *               
*****************************************************************               
VER         DSECT                      PLACEHOLDER FOR SUBENTRIES               
*                                       ASSOCIATED WITH ++VER RECORDS           
*                                       OF A SYSMOD                             
VERNEXT     DS AL4                     PTR TO NEXT ITEM IN LINKED LIST          
VERDATA     DS AL4                     PTR TO HEAD OF LINKED LIST OF            
*                                       SUBENTRIES ASSOC WITH A ++VER           
VERNUM      DS CL3                     ++VER STATEMENT NUMBER                   
*****************************************************************               
* SUBENTRY DATA                                                 *               
*****************************************************************               
ITEM_LIST   DSECT                      HOLDS PIECE OF SUBENTRY DATA             
ITMNEXT     DS AL4                     PTR TO NEXT ITEM IN LINKED LIST          
DATALEN     DS FL4                     NUMBER OF CHARS OF REAL DATA             
DATA        DS AL4                     PTR TO STORAGE CONTAINING DATA           
*                                                                @01C           
*****************************************************************               
* API VERSION COMMAND                                           *               
*****************************************************************               
API_VERSION DSECT                      API VERSION COMMAND OUTPUT               
APIVER      DS CL2                     VERSION                                  
APIREL      DS CL2                     RELEASE                                  
APIMOD      DS CL2                     MODIFICATION                             
APIPTF      DS CL2                     2-CHAR PTF LEVEL                         
APIEPTF     DS CL3                     3-CHAR PTF LEVEL           @P1A          
          MEND                                                                  
