*                                                                               
* %DCL GRBSMFSC_INCLUDED CHAR EXT;                                              
* %DEACTIVATE GRBSMFSC_INCLUDED;                                                
* %IF GRBSMFSC_INCLUDED = '' %THEN                                              
* %DO;                                                                          
*/* Macro made bi-lingual on 21145. CBGEN compile date 21138         */         
*% /*                                                                           
         MACRO                                                                  
         GRBSMFSC &DSECT=YES,&LIST=YES,&TITLE=YES,&FILTLISTDATA=YES,   *        
               &SMFDSLT=COND,&SMFDSLTDATASECTION=COND                           
         GBLC  &GRBSMFSC_INCLUDED                                               
         GBLC  &ZCBPRINT                                                        
&GRBSMFSC_INCLUDED SETC 'YES'                                                   
         AIF   ('&LIST' EQ 'NONE').P0                                           
         AIF   ('&TITLE' EQ 'NO').P5                                            
 TITLE   'GRBSMFSC  - GRBSMFR constants and data structures       '             
.P5      ANOP                                                                   
**/ ;                                                                           
*/* START OF SPECIFICATIONS ******************************************/         
*/*                                                                  */         
*/*01* PROPRIETARY STATEMENT:                                        */         
*/*       Licensed Materials - Property of IBM                       */         
*/*       "Restricted Materials of IBM"                              */         
*/*       Copyright IBM Corp. 2021                                   */         
*/*                                                                  */         
*/*       Status: z/OS V2R5 Data Gatherer (HRG77D0)                  */         
*/*                                                                  */         
*/*01* DESCRIPTIVE-NAME: GRBSMFR constants and data structures       */         
*/*                                                                  */         
*/*02*   ACRONYM:                                                    */         
*/*        DSLT   - SMF data set lookup table                        */         
*/*                                                                  */         
*/*01* MACRO NAME:  GRBSMFSC                                         */         
*/*                                                                  */         
*/*01* DSECT NAME:                                                   */         
*/*02*   N/A                                                         */         
*/*                                                                  */         
*/*01* COMPONENT:  z/OS Data Gatherer (27401)                        */         
*/*                                                                  */         
*/*01* EYE-CATCHER:  None                                            */         
*/*                                                                  */         
*/*01* STORAGE ATTRIBUTES: N/A                                       */         
*/*                                                                  */         
*/*01* SIZE:                                                         */         
*/*            FILTLISTDATA       -- X'0028' bytes                   */         
*/*            SMFDSLT            -- X'0050' bytes                   */         
*/*            SMFDSLTDATASECTION -- X'0030' bytes                   */         
*/*                                                                  */         
*/*01* CREATED BY:                                                   */         
*/*      N/A                                                         */         
*/*                                                                  */         
*/*01* POINTED TO BY:                                                */         
*/*      N/A                                                         */         
*/*                                                                  */         
*/*01* SERIALIZATION:                                                */         
*/*      None                                                        */         
*/*                                                                  */         
*/*01* FUNCTION:                                                     */         
*/*02*   This macro defines data structures and constants for        */         
*/*      return and reason codes used by Data Gatherer service       */         
*/*      GRBSMFR                                                     */         
*/*                                                                  */         
*/*01* METHOD OF ACCESS:                                             */         
*/*02*   ASM:                                                        */         
*/*        GRBSMFSC                                                  */         
*/*                                                                  */         
*/*02*   PL/X:                                                       */         
*/*        %INCLUDE SYSLIB(GRBSMFSC)                                 */         
*/*                                                                  */         
*/*01* DELETED BY:                                                   */         
*/*      N/A                                                         */         
*/*                                                                  */         
*/*01* FREQUENCY:                                                    */         
*/*      Once                                                        */         
*/*                                                                  */         
*/*01* DEPENDENCIES:  None                                           */         
*/*                                                                  */         
*/*01* DISTRIBUTION LIBRARY:                                         */         
*/*      AMACLIB                                                     */         
*/*                                                                  */         
*/*01* CHANGE ACTIVITY:                                              */         
*/*      $A00=ZOSB,HRG77D0,,JK: Move Data Gatherer into z/OS base    */         
*/*      $A01=ZOSB,OA61287,,JK: DSLT enhancements               @A01A*/         
*/*                                                                  */         
*/* END OF SPECIFICATIONS ********************************************/         
*% /*                                                                           
.P0      ANOP                                                                   
         AIF   ('&ZCBPRINT' EQ 'NO').P1                                         
         AIF   ('&LIST' EQ 'YES').P2                                            
.P1      ANOP                                                                   
         PUSH  PRINT                                                            
         PRINT OFF                                                              
.P2      ANOP                                                                   
*                                                                               
* ********************************************************************          
* *                                                                  *          
* * Return and reason code constants used by Data Gatherer service   *          
* * GRBSMFR                                                          *          
* *                                                                  *          
* ********************************************************************          
*                                                                               
*                                                                               
GRBSMFRETCODESUCCESS EQU 0                                                      
GRBSMFRETCODEWARNING EQU 4                                                      
GRBSMFRETCODEERROR EQU 8                                                        
GRBSMFRETCODESEVEREERROR EQU 16                                                 
*                                                                               
* ********************************************************************          
* * RC =  0: Successful Completion                                   *          
* ********************************************************************          
*                                                                               
*                                                                               
GRBSMFRSNCODESUCCESS EQU 0                                                      
*                                                                               
* ********************************************************************          
* * RC =  4: Warning                                                 *          
* ********************************************************************          
*                                                                               
*                                                                               
GRBSMFRSNCODENODATA EQU 0                                                       
GRBSMFRSNCODEINCONSISTENTDATA EQU 4                                             
GRBSMFRSNCODEBADSERVICELEVEL EQU 8                                              
GRBSMFRSNCODEUNSUPPORTEDSMFTYPE EQU 12                                          
GRBSMFRSNCODEINCOMPLETEDATA EQU 16                                              
GRBSMFRSNCODESMFRECORDCONVERTED EQU 20                                          
*                                                                               
* ********************************************************************          
* * RC = 8: Error                                                    *          
* ********************************************************************          
*                                                                               
*                                                                               
GRBSMFRSNCODEAREATOOSMALL EQU 4                                                 
GRBSMFRSNCODEBADDATETIME EQU 8                                                  
GRBSMFRSNCODEINVALIDREQTOKEN EQU 12                                             
GRBSMFRSNCODEINVALIDRECSETTOKEN EQU 16                                          
GRBSMFRSNCODEINVALIDREQTYPE EQU 20                                              
GRBSMFRSNCODEINVALIDMODE EQU 24                                                 
GRBSMFRSNCODENOTENABLED EQU 28                                                  
GRBSMFRSNCODELOCKED EQU 32                                                      
*                                                                               
* ********************************************************************          
* * RC = 16: Severe Error                                            *          
* ********************************************************************          
*                                                                               
*                                                                               
GRBSMFRSNCODEQSAMERROR EQU 4                                                    
GRBSMFRSNCODERECOVERYENVIRONMENT EQU 8                                          
GRBSMFRSNCODEESTAEXCONTROL EQU 12                                               
GRBSMFRSNCODEINTERNALERROR EQU 16                                               
GRBSMFRSNCODETRIPLETERROR EQU 20                                                
         AIF   ('&FILTLISTDATA' EQ 'NO').L0002                                  
         AIF   ('&DSECT' EQ 'YES').L0003                                        
         AIF   ('&FILTLISTDATA' NE 'YES').L0002                                 
.L0003   ANOP                                                                   
*                                                                               
* ********************************************************************          
* *                                                                  *          
* * Data structures used by Data Gatherer service GRBSMFR            *          
* *                                                                  *          
* ********************************************************************          
*                                                                               
*                                                                               
         AIF   ('&DSECT' EQ 'YES').L0004                                        
FILTLISTDATA DS 0H                                                              
         AGO   .L0005                                                           
.L0004   ANOP                                                                   
FILTLISTDATA DSECT                                                              
.L0005   ANOP                                                                   
FILTVERSION DS H         Version of filter list                                 
FILTLENGTH DS  H         Length of filter list                                  
FILTTYPE DS    H         SMF type filter                                        
FILTSUBTYPE DS H         SMF subtype filter                                     
FILTSMFID DS   CL4       SMF ID filter                                          
FILTSTARTTIME DS CL14    Start of time interval in format              *        
                         YYYYMMDDHHMMSS                                         
FILTENDTIME DS CL14      End of time interval in format YYYYMMDDHHMMSS          
DSLTACRONYM EQU C'DSLT'                                                         
DSLTVERSION EQU 1                                                               
FILTLISTDATA_LEN EQU *-FILTLISTDATA                                             
.L0002   ANOP                                                                   
         AIF   ('&SMFDSLT' EQ 'NO').L0006                                       
         AIF   ('&DSECT' EQ 'YES').L0007                                        
         AIF   ('&SMFDSLT' NE 'YES').L0006                                      
SMFDSLT  DS    0F        SMF data set lookup table                              
         AGO   .L0008                                                           
.L0007   ANOP                                                                   
SMFDSLT  DSECT           SMF data set lookup table                              
.L0008   ANOP                                                                   
SMFDSLTHEADER DS CL32    SMF DSLT header                                        
         ORG   SMFDSLTHEADER                                                    
DSLTACR  DS    CL4       Acronym                                                
DSLTVER  DS    H         Version                                                
DSLTHDRLEN DS  H         Header length, can be used as offset to 1st   *        
                         section                                                
DSLTTOTLEN DS  F         Total length of DSLT                                   
DSLTDSNUM DS   F         Number of DSLT data sections                           
DSLTDSLEN DS   H         Data section length                                    
         DS    CL2       Not used                                               
DSLTRSNUM DS   F         Number of SMF record sets. An SMF record set  *        
                         consists of one unbroken or multiple broken   *        
                         SMF records that logically belong together             
DSLTREQTOKEN DS CL8      Request token passed in                                
DSLTDATASECTION DS CL48                                                         
SMFDSLT_LEN EQU *-SMFDSLT                                                       
.L0006   ANOP                                                                   
         AIF   ('&SMFDSLTDATASECTION' EQ 'NO').L0009                            
         AIF   ('&DSECT' EQ 'YES').L000A                                        
         AIF   ('&SMFDSLTDATASECTION' NE 'YES').L0009                           
SMFDSLTDATASECTION DS 0F SMF DSLT data section                                  
         AGO   .L000B                                                           
.L000A   ANOP                                                                   
SMFDSLTDATASECTION DSECT   SMF DSLT data section                                
.L000B   ANOP                                                                   
DSLTRECID DS   F         SMF record ID in DSLT                                  
DSLTSMFRECID DS F        SMF record ID in data set                              
DSLTRECSETTOKEN DS F     ID of SMF record set                                   
DSLTRECORDSETSEQNO DS H  Sequence number of record in SMF record set            
DSLTTOTBROKEN DS H       Total number of records in SMF record set              
DSLTTYPE DS    H         SMF type                                               
DSLTSUBTYPE DS H         SMF subtype                                            
DSLTSMFID DS   CL4       SMF ID                                                 
DSLTSTARTDATE DS CL4     Start date of SMF interval                             
DSLTSTARTTIME DS CL4     Start time of SMF interval                             
DSLTINTDUR DS  CL4       Length of SMF interval                                 
DSLTVALIDFLAG DS B       Valid indicators                                       
*  Bit definitions:                                                             
DSLTVALIDSUBTYPE EQU X'80' SMF subtype valid                                    
DSLTVALIDSTARTTIME EQU X'40' Start date, start time and duration are   *        
                         valid                                                  
         DS    CL1       Unused                                                 
DSLTSMFLENGTH DS H       SMF record length                                      
DSLTMOVETIME DS CL4      SMF record move time                                   
DSLTMOVEDATE DS CL4      SMF record move date                                   
SMFDSLTDATASECTION_LEN EQU *-SMFDSLTDATASECTION                                 
.L0009   ANOP                                                                   
         AIF   ('&ZCBPRINT' EQ 'NO').P3                                         
         AIF   ('&LIST' EQ 'YES').P4                                            
.P3      ANOP                                                                   
         POP   PRINT                                                            
.P4      ANOP                                                                   
.P_EXIT  ANOP                                                                   
         MEND                                                                   
**/ ;                                                                           
* %GRBSMFSC_INCLUDED = 'YES';                                                   
* %DCL ZCBPRINT CHAR EXT;                                                       
* %DEACTIVATE ZCBPRINT;                                                         
* %DCL GRBSMFSC_LIST CHAR EXT;                                                  
* %DEACTIVATE GRBSMFSC_LIST;                                                    
* %IF GRBSMFSC_LIST = 'NO' !                                                    
*    ZCBPRINT = 'NO' %THEN                                                      
* %DO;                                                                          
*   @LIST PUSH NOECHO;                                                          
*   @LIST NOASSEMBLE NOECHO;                                                    
*   @LIST OFF C NOECHO;                                                         
* %END;                                                                         
*/* Start of PL/X Source                                             */         
*/********************************************************************/         
*/*                                                                  */         
*/* Return and reason code constants used by Data Gatherer service   */         
*/* GRBSMFR                                                          */         
*/*                                                                  */         
*/********************************************************************/         
*                                                                               
*   Dcl GrbSmfRetCodeSuccess             Fixed(31) Constant( 0);                
*   Dcl GrbSmfRetCodeWarning             Fixed(31) Constant( 4);                
*   Dcl GrbSmfRetCodeError               Fixed(31) Constant( 8);                
*   Dcl GrbSmfRetCodeSevereError         Fixed(31) Constant(16);                
*                                                                               
*/********************************************************************/         
*/* RC =  0: Successful Completion                                   */         
*/********************************************************************/         
*                                                                               
*   Dcl GrbSmfRsnCodeSuccess             Fixed(31) Constant( 0);                
*                                                                               
*/********************************************************************/         
*/* RC =  4: Warning                                                 */         
*/********************************************************************/         
*                                                                               
*   Dcl GrbSmfRsnCodeNoData              Fixed(31) Constant( 0);                
*   Dcl GrbSmfRsnCodeInconsistentData    Fixed(31) Constant( 4);                
*   Dcl GrbSmfRsnCodeBadServiceLevel     Fixed(31) Constant( 8);                
*   Dcl GrbSmfRsnCodeUnsupportedSMFType  Fixed(31) Constant(12);                
*   Dcl GrbSmfRsnCodeIncompleteData      Fixed(31) Constant(16);                
*   Dcl GrbSmfRsnCodeSmfRecordConverted  Fixed(31) Constant(20);                
*                                                                               
*/********************************************************************/         
*/* RC = 8: Error                                                    */         
*/********************************************************************/         
*                                                                               
*   Dcl GrbSmfRsnCodeAreaTooSmall        Fixed(31) Constant( 4);                
*   Dcl GrbSmfRsnCodeBadDateTime         Fixed(31) Constant( 8);                
*   Dcl GrbSmfRsnCodeInvalidReqToken     Fixed(31) Constant(12);                
*   Dcl GrbSmfRsnCodeInvalidRecSetToken  Fixed(31) Constant(16);                
*   Dcl GrbSmfRsnCodeInvalidReqType      Fixed(31) Constant(20);                
*   Dcl GrbSmfRsnCodeInvalidMode         Fixed(31) Constant(24);                
*   Dcl GrbSmfRsnCodeNotEnabled          Fixed(31) Constant(28);                
*   Dcl GrbSmfRsnCodeLocked              Fixed(31) Constant(32);                
*                                                                               
*/********************************************************************/         
*/* RC = 16: Severe Error                                            */         
*/********************************************************************/         
*                                                                               
*   Dcl GrbSmfRsnCodeQsamError           Fixed(31) Constant( 4);                
*   Dcl GrbSmfRsnCodeRecoveryEnvironment Fixed(31) Constant( 8);                
*   Dcl GrbSmfRsnCodeEstaexControl       Fixed(31) Constant(12);                
*   Dcl GrbSmfRsnCodeInternalError       Fixed(31) Constant(16);                
*   Dcl GrbSmfRsnCodeTripletError        Fixed(31) Constant(20);                
*                                                                               
*/********************************************************************/         
*/*                                                                  */         
*/* Data structures used by Data Gatherer service GRBSMFR            */         
*/*                                                                  */         
*/********************************************************************/         
*   Dcl 1 filtListData Based,                                                   
*         3 filtVersion   Fixed(16),    /* Version of filter list    */         
*         3 filtLength    Fixed(16),    /* Length of filter list     */         
*         3 filtType      Fixed(16),    /* SMF type filter           */         
*         3 filtSubType   Fixed(16),    /* SMF subtype filter        */         
*         3 filtSmfID     Char(4),      /* SMF ID filter             */         
*         3 filtStartTime Char(14),     /* Start of time interval in            
*                                          format YYYYMMDDHHMMSS     */         
*         3 filtEndTime   Char(14);     /* End of time interval in              
*                                          format YYYYMMDDHHMMSS     */         
*                                                                               
*   Dcl DSLTAcronym Char(4) Constant('DSLT');                                   
*   Dcl DSLTVersion Fixed(16) Constant(1);                                      
*                                                                               
*   Dcl 1 smfDslt Based,                /* SMF data set lookup table */         
*         3 smfDsltHeader,              /* SMF DSLT header           */         
*           5 dsltAcr Char(4),          /* Acronym                   */         
*           5 dsltVer Fixed(16),        /* Version                   */         
*           5 dsltHdrLen Fixed(16),     /* Header length, can be used           
*                                          as offset to 1st section  */         
*           5 dsltTotLen Fixed(32),     /* Total length of DSLT      */         
*           5 dsltdsNum Fixed(32),      /* Number of DSLT data                  
*                                          sections                  */         
*           5 dsltdsLen Fixed(16),      /* Data section length       */         
*           5 *         Char(2),        /* Not used                  */         
*           5 dsltrsNum Fixed(32),      /* Number of SMF record sets.           
*                                          An SMF record set consists           
*                                          of one unbroken or multiple          
*                                          broken SMF records that              
*                                          logically belong together */         
*           5 dsltReqToken Char(8),     /* Request token passed in   */         
*         3 dsltDataSection(0:*) Char(Length(smfDsltDataSection));              
*                                                                               
*   Dcl 1 smfDsltDataSection Based,     /* SMF DSLT data section     */         
*         3 dsltRecId Fixed(32),        /* SMF record ID in DSLT     */         
*         3 dsltSmfRecId Fixed(32),     /* SMF record ID in data set */         
*         3 dsltRecSetToken Fixed(32),  /* ID of SMF record set      */         
*         3 dsltRecordSetSeqNo Fixed(16), /* Sequence number of record          
*                                            in SMF record set       */         
*         3 dsltTotBroken Fixed(16),    /* Total number of records in           
*                                          SMF record set            */         
*         3 dsltType Fixed(16),         /* SMF type                  */         
*         3 dsltSubType   Fixed(16),    /* SMF subtype               */         
*         3 dsltSmfID     Char(4),      /* SMF ID                    */         
*         3 dsltStartDate Char(4),      /* Start date of SMF interval*/         
*         3 dsltStartTime Char(4),      /* Start time of SMF interval*/         
*         3 dsltIntDur Char(4),         /* Length of SMF interval    */         
*         3 dsltValidFlag Bit(8),       /* Valid indicators     @A01A*/         
*           5 dsltValidSubType Bit(1),  /* SMF subtype valid    @A01A*/         
*           5 dsltValidStartTime Bit(1),/* Start date, start time and           
*                                          duration are valid   @A01A*/         
*           5 *              Bit(6),    /* Not used             @A01A*/         
*         3 *          Char(1),         /* Unused               @A01C*/         
*         3 dsltSmfLength Fixed(16),    /* SMF record length    @A01A*/         
*         3 dsltMoveTime  Char(4),      /* SMF record move time @A01A*/         
*         3 dsltMoveDate  Char(4);      /* SMF record move date @A01A*/         
*/********************************************************************/         
*/* End of PL/X Source                                               */         
* %IF GRBSMFSC_LIST = 'NO' !                                                    
*    ZCBPRINT = 'NO' %THEN                                                      
* %DO;                                                                          
*   @LIST POP NOECHO;                                                           
* %END;                                                                         
* %END;                                                                         
