*                                                                       00001000
* %DCL GTZZTRK_INCLUDED CHAR EXT;                                       00002000
* %DEACTIVATE GTZZTRK_INCLUDED;                                         00003000
* %IF GTZZTRK_INCLUDED = '' %THEN                                       00004000
* %DO;                                                                  00005000
*/* Macro made bi-lingual on 21063. CBGEN compile date 20027         */ 00006000
*% /*                                                                   00007000
         MACRO                                                          00008000
         GTZZTRK &DSECT=YES,&LIST=YES,&TITLE=YES                        00009000
                      GBLC  &GTZZTRK_INCLUDED                           00010000
                      GBLC  &ZCBPRINT                                   00011000
&GTZZTRK_INCLUDED     SETC  'YES'                                       00012000
                      AIF   ('&LIST' EQ 'NONE').P0                      00013000
                      AIF   ('&TITLE' EQ 'NO').P5                       00014000
 TITLE                'GTZZTRK  - GTZTRACK constants                   *00015000
                         '                                              00016000
.P5                   ANOP                                              00017000
**/ GTZZTRK_1:;                                                         00018000
*/* START OF SPECIFICATIONS ******************************************* 00019000
*                                                                       00020000
***01* PROPRIETARY STATEMENT=                                        *  00021000
*                                                                    *  00022000
*   LICENSED MATERIALS - PROPERTY OF IBM                             *  00023000
*   5650-ZOS COPYRIGHT IBM CORP. 2013                                *  00024000
*                                                                    *  00025000
*   STATUS= HBB7790                                                  *  00026000
*                                                                    *  00027000
*  **END_OF_PROPRIETARY_STATEMENT*************************************  00028000
*                                                                       00029000
*01* DESCRIPTIVE NAME:  GTZTRACK constants                              00030000
*                                                                       00031000
*01* MACRO NAME:  GTZZTRK                                               00032000
*                                                                       00033000
*01* EXTERNAL CLASSIFICATION: PI                                        00034000
*01* END OF EXTERNAL CLASSIFICATION:                                    00035000
*                                                                       00036000
*01* DSECT NAME:                                                        00037000
*     None                                                              00038000
*                                                                       00039000
*01* COMPONENT:  IBM Generic Tracker (SCGTZ)                            00040000
*                                                                       00041000
*01* EYE-CATCHER:  NONE                                                 00042000
*                                                                       00043000
*01* STORAGE ATTRIBUTES:                                                00044000
*02*  SUBPOOL:  N/A                                                     00045000
*02*  KEY:  N/A                                                         00046000
*02*  RESIDENCY:  Caller-supplied                                       00047000
*                                                                       00048000
*01* SIZE:  N/A                                                         00049000
*                                                                       00050000
*01* CREATED BY:                                                        00051000
*     N/A                                                               00052000
*                                                                       00053000
*01* POINTED TO BY:                                                     00054000
*     N/A                                                               00055000
*                                                                       00056000
*01* SERIALIZATION:                                                     00057000
*     None required                                                     00058000
*                                                                       00059000
*01* FUNCTION:                                                          00060000
*02* Provide equates for return and reason codes and other              00061000
*    constants related to service GTZTRACK                              00062000
*                                                                       00063000
*01* METHOD OF ACCESS:                                                  00064000
*02*  ASM:                                                              00065000
*      GTZZTRK                                                          00066000
*                                                                       00067000
*02*  PL/X:                                                             00068000
*      %INCLUDE SYSLIB(GTZZTRK)                                         00069000
*                                                                       00070000
*01* DELETED BY:  N/A                                                   00071000
*                                                                       00072000
*01* FREQUENCY:  N/A                                                    00073000
*                                                                       00074000
*01* DEPENDENCIES: GTZTRACK.amg, as source for RC/RSN via AMGRET        00075000
*                                                                       00076000
*01* DISTRIBUTION LIBRARY:  AMACLIB                                     00077000
*                                                                       00078000
*01* CHANGE ACTIVITY:                                                   00079000
*   $L0=GENTRKR  ,HBB7790,110615,RD00UT: Initial create                 00080000
*   $L1=GENTRKR  ,HBB7790,110803,RD00UT: Limits                         00081000
*   $L2=GENTRKR  ,HBB7790,110909,RD00UT: Generic "DoNotTrack"           00082000
*                                                                       00083000
* END OF SPECIFICATIONS **********************************************/ 00084000
*% /*                                                                   00085000
.P0                   ANOP                                              00086000
                      AIF   ('&ZCBPRINT' EQ 'NO').P1                    00087000
                      AIF   ('&LIST' EQ 'YES').P2                       00088000
.P1                   ANOP                                              00089000
                      PUSH  PRINT                                       00090000
                      PRINT OFF                                         00091000
.P2                   ANOP                                              00092000
*                                                                       00093000
*   Limits                                                              00094000
*                                                                       00095000
*                                                                       00096000
cGtzTrack_MaxEventDescLen EQU 64                                        00097000
cGtzTrack_MaxPathNameLen EQU 1024                                       00098000
*                                                                       00099000
* ****************************************************************** *  00100000
* * GTZTRACK return and reason codes                                 *  00101000
* ****************************************************************** *  00102000
* * Reason code format: ddddrrxy, with rr= return code, x=0..2,y=0..F   00103000
*   and dddd = component diagnostic data, which must not be assumed     00104000
*   to be 0. Apply GtzTrackRsnCodeMask to an actual reason code value   00105000
*   to derive a value listed below.                                     00106000
*                                                                    *  00107000
*                                                                       00108000
*                                                                       00109000
GtzTrackRsnCodeMask   EQU   X'0000FFFF' Use this mask to isolate the   *00110000
                                   non component-diagnostic portion of *00111000
                                   the reason code or abend reason     *00112000
                                   code                                 00113000
*                                                                       00114000
* *** AMGRET - START (RC 0-16, RSNs for RC=4,8,12) **                *  00115000
*                                                                       00116000
*                                                                       00117000
GtzTrackRc_OK         EQU   X'00000000' Meaning: Successful request.   *00118000
                                   Action: None required                00119000
GtzTrackRc_Warn       EQU   X'00000004' Meaning: Warning. Action:      *00120000
                                   Refer to action under the           *00121000
                                   individual reason code.              00122000
GtzTrackRsn_NotReady  EQU   X'00000401' Meaning: The tracking facility *00123000
                                   is not ready. It is down or it is   *00124000
                                   still starting and initialization   *00125000
                                   is not complete yet or it is in     *00126000
                                   flood control mode. Track data has  *00127000
                                   not been recorded. Action: This     *00128000
                                   might be a temporary condition. If  *00129000
                                   it persists, report it to the       *00130000
                                   system programmer. See also the     *00131000
                                   description of message GTZ1000I and  00132000
*                                  GTZ0004E for further information.    00133000
GtzTrackRc_Error      EQU   X'00000008' Meaning: Error Action: Refer   *00134000
                                   to action under the individual      *00135000
                                   reason code.                         00136000
GtzTrackRsn_BadGTZATRKP EQU X'00000801' Meaning: Invalid GTZATRKP      *00137000
                                   value. Action: Ensure that only     *00138000
                                   macro GTZTRACK is used to built the *00139000
                                   parameter list for the GTZTRACK     *00140000
                                   service.                             00141000
GtzTrackRsn_BadParmlist EQU X'00000803' Meaning: Error accessing the   *00142000
                                   GTZTRACK parameter list. Action:    *00143000
                                   Make sure that the provided         *00144000
                                   parameter list is valid.             00145000
GtzTrackRsn_BadSourcePath EQU X'00000804' Meaning: Error accessing the *00146000
                                   SOURCEPATH parameter. Action: Make  *00147000
                                   sure that the provided parameter is *00148000
                                   valid.                               00149000
GtzTrackRsn_BadEventDesc EQU X'00000805' Meaning: Error accessing the  *00150000
                                   EVENTDESC parameter. Action: Make   *00151000
                                   sure that the provided parameter is *00152000
                                   valid.                               00153000
GtzTrackRsn_BadEnvNotEnabled EQU X'00000806' Meaning: Not Enabled.     *00154000
                                   Action: Avoid using GTZTRACK when   *00155000
                                   not enabled for I/O and external    *00156000
                                   interrupts                           00157000
GtzTrackRsn_BadEnvLocked EQU X'00000807' Meaning: Lock is held.        *00158000
                                   Action: Avoid using GTZTRACK when a *00159000
                                   lock is held.                        00160000
GtzTrackRsn_BadEnvSrbmode EQU X'00000808' Meaning: SRB mode. Action:   *00161000
                                   Avoid using GTZTRACK when in SRB    *00162000
                                   mode.                                00163000
GtzTrackRsn_BadEnvFRR EQU   X'00000809' Meaning: The caller had an EUT *00164000
                                   FRR established. Action: Avoid      *00165000
                                   using GTZTRACK when an EUT FRR is   *00166000
                                   established.                         00167000
GtzTrackRsn_BadParmlistVersion EQU X'0000080A' Meaning: The specified  *00168000
                                   version of the macro is not         *00169000
                                   compatible with the current version *00170000
                                   of IBM Generic Tracker for z/OS.    *00171000
                                   Action: Avoid requesting parameters *00172000
                                   that are not supported by this      *00173000
                                   version of IBM Generic Tracker for  *00174000
                                   z/OS.                                00175000
GtzTrackRsn_BadEventAddrZero EQU X'0000080B' Meaning: EVENTADDR is     *00176000
                                   zero. Action: Do not specify zero   *00177000
                                   as value for the EVENTADDR. The     *00178000
                                   Console Tracking facility and its   *00179000
                                   service CNZTRKR used to allow for a *00180000
                                   Violator address of zero, but       *00181000
                                   Generic Tracker by default does     *00182000
                                   not.                                 00183000
GtzTrackRsn_BadSourcePathLen EQU X'0000080C' Meaning: SOURCEPATHLEN is *00184000
                                   invalid. Action: SOURCEPATHLEN has  *00185000
                                   to be between 1 and 1024.            00186000
GtzTrackRsn_BadSourcePathALET EQU X'0000080D' Meaning: Bad SOURCEPATH  *00187000
                                   ALET. Action: Make sure that the    *00188000
                                   ALET associated with the SOURCEPATH *00189000
                                   parameter is valid. The access      *00190000
                                   register might not have been set up *00191000
                                   correctly.                           00192000
GtzTrackRsn_NotAuthorized_EventASID EQU X'0000080E' Meaning: Not       *00193000
                                   authorized to specify this          *00194000
                                   EVENTASID value. Action: Only       *00195000
                                   EVENTASID(HOME) can be used when    *00196000
                                   not running authorized.              00197000
GtzTrackRsn_BadEventASIDKey EQU X'0000080F' Meaning: Bad EVENTASID     *00198000
                                   value. Action: Specify one of HOME, *00199000
                                   PRIMARY, SECONDARY, or VALUE.        00200000
GtzTrackRsn_BadEventDescLen EQU X'00000810' Meaning: EVENTDESCLEN is   *00201000
                                   invalid. Action: EVENTDESCLEN has   *00202000
                                   to be between 1 and 64.              00203000
GtzTrackRsn_BadEventDescALET EQU X'00000811' Meaning: Bad EVENTDESC    *00204000
                                   ALET. Action: Make sure that the    *00205000
                                   ALET associated with the EVENTDESC  *00206000
                                   parameter is valid. The access      *00207000
                                   register might not have been set up *00208000
                                   correctly.                           00209000
GtzTrackRsn_NotAuthorized_CNZTRKR EQU X'00000812'                       00210000
*                                                                       00211000
*                                      Meaning: Not authorized to       00212000
*                                      specify parameter CNZTRKR.       00213000
*                                      Action: Do not use parameter     00214000
*                                      CNZTRKR and ensure that only     00215000
*                                      macro GTZTRACK is used to        00216000
*                                      built the parameter list for     00217000
*                                      the GTZTRACK service.            00218000
*                                                                       00219000
GtzTrackRsn_NotAuthorized_EVENTADDR0 EQU X'00000813' Meaning: Not      *00220000
                                   authorized to specify parameter     *00221000
                                   EVENTADDR0. Action: Do not use      *00222000
                                   parameter EVENTADDR0 and ensure     *00223000
                                   that only macro GTZTRACK is used to *00224000
                                   built the parameter list for the    *00225000
                                   GTZTRACK service.                    00226000
GtzTrackRsn_BadParmlistALET EQU X'00000814' Meaning: Bad parameter     *00227000
                                   list ALET. Action: Make sure that   *00228000
                                   the ALET associated with the        *00229000
                                   parameter list is valid. The access *00230000
                                   register might not have been set up *00231000
                                   correctly.                           00232000
GtzTrackRsn_BadEventASIDSlot EQU X'00000815' Meaning: Bad EVENTASID    *00233000
                                   value. Action: Specify one of HOME, *00234000
                                   PRIMARY, SECONDARY for EVENTASID,   *00235000
                                   or specify VALUE with a valid       *00236000
                                   EVENTASIDVAL.                        00237000
GtzTrackRsn_BadEventASID EQU X'00000816' Meaning: Bad EVENTASID value. *00238000
                                   Action: Specify one of HOME,        *00239000
                                   PRIMARY, SECONDARY, or VALUE, with  *00240000
                                   a valid EVENTASIDVAL.                00241000
GtzTrackRsn_BadEnvNotInGtz EQU X'00000818' Meaning: The processing     *00242000
                                   module for GTZTRACK has been        *00243000
                                   invoked outside of the GTZ address  *00244000
                                   space. Action: Use the provided     *00245000
                                   GTZTRACK macro to call the          *00246000
                                   processing module.                   00247000
GtzTrackRsn_NotAuthorized_Caller EQU X'00000819'                        00248000
*                                                                       00249000
*                                      Meaning: A processing module     00250000
*                                      for GTZTRACK has been invoked    00251000
*                                      in the wrong state. Action:      00252000
*                                      Use the provided GTZTRACK        00253000
*                                      macro to call the processing     00254000
*                                      module.                          00255000
*                                                                       00256000
GtzTrackRsn_BadProgramPathALET EQU X'0000081A' Meaning: Bad            *00257000
                                   PROGRAMPATHALET. Action: Make sure  *00258000
                                   that the ALET associated with the   *00259000
                                   PROGRAMPATH parameter is valid. The *00260000
                                   access register might not have been *00261000
                                   set up correctly.                    00262000
GtzTrackRsn_BadProgramPathLen EQU X'0000081B' Meaning: PROGRAMPATHLEN  *00263000
                                   is invalid. Action: PROGRAMPATHLEN  *00264000
                                   has to be between 1 and 1024.        00265000
GtzTrackRsn_BadNoAbend EQU  X'0000081C' Meaning: NOABEND or NOABENDVAL *00266000
                                   is invalid. Action: NOABEND has to  *00267000
                                   be YES or NO. NOABENDVAL has to be  *00268000
                                   1 or 0.                              00269000
GtzTrackRsn_BadOwnerValue EQU X'0000081D' Meaning: Bad OWNER text      *00270000
                                   value. Action: Ensure that the      *00271000
                                   OWNER value contains only the       *00272000
                                   documented allowed characters.       00273000
GtzTrackRsn_BadEventDescValue EQU X'0000081E' Meaning: Bad EVENTDESC   *00274000
                                   text value. Action: Ensure that the *00275000
                                   EVENTDESC value does not contain    *00276000
                                   only blanks or only binary zeroes.   00277000
GtzTrackRsn_BadSourceValue EQU X'0000081F' Meaning: Bad SOURCE text    *00278000
                                   value. Action: Ensure that the      *00279000
                                   SOURCE value contains only the      *00280000
                                   documented allowed characters.       00281000
GtzTrackRsn_BadSourcePathValue EQU X'00000820' Meaning: Bad SOURCEPATH *00282000
                                   text value. Action: Ensure that the *00283000
                                   SOURCEPATH value does not contain   *00284000
                                   only blanks or only binary zeroes.   00285000
GtzTrackRc_SevereError EQU  X'0000000C' Meaning: Severe Error. Action: *00286000
                                   Refer to action under the           *00287000
                                   individual reason code.              00288000
GtzTrackRc_OutOfMemory EQU  X'0000000D' Meaning: Tracking facility is  *00289000
                                   low on memory. Action: See the      *00290000
                                   description of message GTZ0004E.     00291000
GtzTrackRc_CompError  EQU   X'00000010' Meaning: Component error.      *00292000
                                   Action: Report the associated       *00293000
                                   reason code to the system           *00294000
                                   programmer to contact IBM Service.   00295000
*                                                                       00296000
* *** AMGRET - END (RC 0-16, RSNs for RC=4,8,12) **                  *  00297000
* *** Reason codes for RC=16                                         *  00298000
*                                                                       00299000
*                                                                       00300000
GtzTrackRsn_InternalError_BadPC EQU 4099                                00301000
*                                                                       00302000
*                                      Meaning: Component error.        00303000
*                                      Action: Report the problem to    00304000
*                                      the system programmer.           00305000
*                                                                       00306000
GtzTrackRsn_InternalError_BadUserErr EQU 4100 Meaning: Component       *00307000
                                   error. Action: Report the problem   *00308000
                                   to the system programmer.            00309000
GtzTrackRsn_InternalError EQU 4101 Meaning: Component error. Action:   *00310000
                                   Report the problem to the system    *00311000
                                   programmer.                          00312000
GtzTrackRsn_InternalError_RepeatAbend EQU 4102 Meaning: Component      *00313000
                                   error. Action: Report the problem   *00314000
                                   to the system programmer.            00315000
                      AIF   ('&ZCBPRINT' EQ 'NO').P3                    00316000
                      AIF   ('&LIST' EQ 'YES').P4                       00317000
.P3                   ANOP                                              00318000
                      POP   PRINT                                       00319000
.P4                   ANOP                                              00320000
.P_EXIT               ANOP                                              00321000
                      MEND                                              00322000
**/ GTZZTRK_2:;                                                         00323000
* %GTZZTRK_INCLUDED = 'YES';                                            00324000
* %DCL ZCBPRINT CHAR EXT;                                               00325000
* %DEACTIVATE ZCBPRINT;                                                 00326000
* %DCL GTZZTRK_LIST CHAR EXT;                                           00327000
* %DEACTIVATE GTZZTRK_LIST;                                             00328000
* %IF GTZZTRK_LIST = 'NO' !                                             00329000
*    ZCBPRINT = 'NO' %THEN                                              00330000
* %DO;                                                                  00331000
*   @LIST PUSH NOECHO;                                                  00332000
*   @LIST NOASSEMBLE NOECHO;                                            00333000
*   @LIST OFF C NOECHO;                                                 00334000
* %END;                                                                 00335000
*/* Start of PL/X Source                                             */ 00336000
*/* Start of PL/X Source                                             */ 00337000
*                                                                       00338000
*/* Limits */                                                           00339000
*Dcl cGtzTrack_MaxEventDescLen Fixed(16) Constant(64);                  00340000
*Dcl cGtzTrack_MaxPathNameLen  Fixed(16) Constant(1024);                00341000
*                                                                       00342000
*                                                                       00343000
*/*******************************************************************/  00344000
*/* GTZTRACK return and reason codes                                */  00345000
*/*******************************************************************/  00346000
*                                                                       00347000
*/* Reason code format: ddddrrxy, with rr= return code, x=0..2,y=0..F   00348000
*   and dddd = component diagnostic data, which must not be assumed     00349000
*   to be 0. Apply GtzTrackRsnCodeMask to an actual reason code value   00350000
*   to derive a value listed below.                                     00351000
* */                                                                    00352000
*Dcl GtzTrackRsnCodeMask Bit(32) Constant('0000FFFF'x); /* Use this     00353000
*               mask to isolate the non component-diagnostic portion    00354000
*               of the reason code or abend reason code */              00355000
*                                                                       00356000
*                                                                       00357000
*/*** AMGRET - START (RC 0-16, RSNs for RC=4,8,12) ***/                 00358000
*DCL GtzTrackRc_OK BIT(32) Constant('00000000'X) ; /*                   00359000
*                        Meaning: Successful request.                   00360000
*                        Action: None required                       */ 00361000
*DCL GtzTrackRc_Warn BIT(32) Constant('00000004'X) ; /*                 00362000
*                        Meaning: Warning.                              00363000
*                        Action: Refer to action under the individual   00364000
*                        reason code.                                */ 00365000
*DCL GtzTrackRsn_NotReady BIT(32) Constant('00000401'X) ; /*            00366000
*                        Meaning: The tracking facility is not ready.   00367000
*                        It is down or it is still starting and         00368000
*                        initialization is not complete yet or it is in 00369000
*                        flood control mode. Track data has not been    00370000
*                        recorded.                                      00371000
*                        Action: This might be a temporary condition.   00372000
*                        If it persists, report it to the system        00373000
*                        programmer. See also the description of        00374000
*                        message GTZ1000I and GTZ0004E for further      00375000
*                        information.                                */ 00376000
*DCL GtzTrackRc_Error BIT(32) Constant('00000008'X) ; /*                00377000
*                        Meaning: Error                                 00378000
*                        Action: Refer to action under the individual   00379000
*                        reason code.                                */ 00380000
*DCL GtzTrackRsn_BadGTZATRKP BIT(32) Constant('00000801'X) ; /*         00381000
*                        Meaning: Invalid GTZATRKP value.               00382000
*                        Action: Ensure that only macro GTZTRACK is     00383000
*                        used to built the parameter list for the       00384000
*                        GTZTRACK service.                           */ 00385000
*DCL GtzTrackRsn_BadParmlist BIT(32) Constant('00000803'X) ; /*         00386000
*                        Meaning: Error accessing the GTZTRACK          00387000
*                        parameter list.                                00388000
*                        Action: Make sure that the provided parameter  00389000
*                        list is valid.                              */ 00390000
*DCL GtzTrackRsn_BadSourcePath BIT(32) Constant('00000804'X) ; /*       00391000
*                        Meaning: Error accessing the SOURCEPATH        00392000
*                        parameter.                                     00393000
*                        Action: Make sure that the provided parameter  00394000
*                        is valid.                                   */ 00395000
*DCL GtzTrackRsn_BadEventDesc BIT(32) Constant('00000805'X) ; /*        00396000
*                        Meaning: Error accessing the EVENTDESC         00397000
*                        parameter.                                     00398000
*                        Action: Make sure that the provided parameter  00399000
*                        is valid.                                   */ 00400000
*DCL GtzTrackRsn_BadEnvNotEnabled BIT(32) Constant('00000806'X) ; /*    00401000
*                        Meaning: Not Enabled.                          00402000
*                        Action: Avoid using GTZTRACK when not enabled  00403000
*                        for I/O and external interrupts                00404000
*                                                                    */ 00405000
*DCL GtzTrackRsn_BadEnvLocked BIT(32) Constant('00000807'X) ; /*        00406000
*                        Meaning: Lock is held.                         00407000
*                        Action: Avoid using GTZTRACK when a lock is    00408000
*                        held.                                       */ 00409000
*DCL GtzTrackRsn_BadEnvSrbmode BIT(32) Constant('00000808'X) ; /*       00410000
*                        Meaning: SRB mode.                             00411000
*                        Action: Avoid using GTZTRACK when in SRB mode. 00412000
*                                                                    */ 00413000
*DCL GtzTrackRsn_BadEnvFRR BIT(32) Constant('00000809'X) ; /*           00414000
*                        Meaning: The caller had an EUT FRR             00415000
*                        established.                                   00416000
*                        Action: Avoid using GTZTRACK when an EUT FRR   00417000
*                        is established.                             */ 00418000
*DCL GtzTrackRsn_BadParmlistVersion BIT(32) Constant('0000080A'X) ; /*  00419000
*                        Meaning: The specified version of the macro is 00420000
*                        not compatible with the current version of IBM 00421000
*                        Generic Tracker for z/OS.                      00422000
*                        Action: Avoid requesting parameters that are   00423000
*                        not supported by this version of IBM Generic   00424000
*                        Tracker for z/OS.                           */ 00425000
*DCL GtzTrackRsn_BadEventAddrZero BIT(32) Constant('0000080B'X) ; /*    00426000
*                        Meaning: EVENTADDR is zero.                    00427000
*                        Action: Do not specify zero as value for the   00428000
*                        EVENTADDR. The Console Tracking facility and   00429000
*                        its service CNZTRKR used to allow for a        00430000
*                        Violator address of zero, but Generic Tracker  00431000
*                        by default does not.                        */ 00432000
*DCL GtzTrackRsn_BadSourcePathLen BIT(32) Constant('0000080C'X) ; /*    00433000
*                        Meaning: SOURCEPATHLEN is invalid.             00434000
*                        Action: SOURCEPATHLEN has to be between 1 and  00435000
*                        1024.                                       */ 00436000
*DCL GtzTrackRsn_BadSourcePathALET BIT(32) Constant('0000080D'X) ; /*   00437000
*                        Meaning: Bad SOURCEPATH ALET.                  00438000
*                        Action: Make sure that the ALET associated     00439000
*                        with the SOURCEPATH parameter is valid. The    00440000
*                        access register might not have been set up     00441000
*                        correctly.                                  */ 00442000
*DCL GtzTrackRsn_NotAuthorized_EventASID BIT(32) Constant('0000080E'X)  00443000
*                        ; /*                                           00444000
*                        Meaning: Not authorized to specify this        00445000
*                        EVENTASID value.                               00446000
*                        Action: Only EVENTASID(HOME) can be used when  00447000
*                        not running authorized.                     */ 00448000
*DCL GtzTrackRsn_BadEventASIDKey BIT(32) Constant('0000080F'X) ; /*     00449000
*                        Meaning: Bad EVENTASID value.                  00450000
*                        Action: Specify one of HOME, PRIMARY,          00451000
*                        SECONDARY, or VALUE.                        */ 00452000
*DCL GtzTrackRsn_BadEventDescLen BIT(32) Constant('00000810'X) ; /*     00453000
*                        Meaning: EVENTDESCLEN is invalid.              00454000
*                        Action: EVENTDESCLEN has to be between 1 and   00455000
*                        64.                                         */ 00456000
*DCL GtzTrackRsn_BadEventDescALET BIT(32) Constant('00000811'X) ; /*    00457000
*                        Meaning: Bad EVENTDESC ALET.                   00458000
*                        Action: Make sure that the ALET associated     00459000
*                        with the EVENTDESC parameter is valid. The     00460000
*                        access register might not have been set up     00461000
*                        correctly.                                  */ 00462000
*DCL GtzTrackRsn_NotAuthorized_CNZTRKR BIT(32) Constant('00000812'X)    00463000
*                        ; /*                                           00464000
*                        Meaning: Not authorized to specify parameter   00465000
*                        CNZTRKR.                                       00466000
*                        Action: Do not use parameter CNZTRKR and       00467000
*                        ensure that only macro GTZTRACK is used to     00468000
*                        built the parameter list for the GTZTRACK      00469000
*                        service.                                    */ 00470000
*DCL GtzTrackRsn_NotAuthorized_EVENTADDR0 BIT(32) Constant('00000813'X) 00471000
*                        ; /*                                           00472000
*                        Meaning: Not authorized to specify parameter   00473000
*                        EVENTADDR0.                                    00474000
*                        Action: Do not use parameter EVENTADDR0 and    00475000
*                        ensure that only macro GTZTRACK is used to     00476000
*                        built the parameter list for the GTZTRACK      00477000
*                        service.                                    */ 00478000
*DCL GtzTrackRsn_BadParmlistALET BIT(32) Constant('00000814'X) ; /*     00479000
*                        Meaning: Bad parameter list ALET.              00480000
*                        Action: Make sure that the ALET associated     00481000
*                        with the parameter list is valid. The access   00482000
*                        register might not have been set up correctly. 00483000
*                                                                    */ 00484000
*DCL GtzTrackRsn_BadEventASIDSlot BIT(32) Constant('00000815'X) ; /*    00485000
*                        Meaning: Bad EVENTASID value.                  00486000
*                        Action: Specify one of HOME, PRIMARY,          00487000
*                        SECONDARY for EVENTASID, or specify VALUE with 00488000
*                        a valid EVENTASIDVAL.                       */ 00489000
*DCL GtzTrackRsn_BadEventASID BIT(32) Constant('00000816'X) ; /*        00490000
*                        Meaning: Bad EVENTASID value.                  00491000
*                        Action: Specify one of HOME, PRIMARY,          00492000
*                        SECONDARY, or VALUE, with a valid              00493000
*                        EVENTASIDVAL.                               */ 00494000
*DCL GtzTrackRsn_BadEnvNotInGtz BIT(32) Constant('00000818'X) ; /*      00495000
*                        Meaning: The processing module for GTZTRACK    00496000
*                        has been invoked outside of the GTZ address    00497000
*                        space.                                         00498000
*                        Action: Use the provided GTZTRACK macro to     00499000
*                        call the processing module.                 */ 00500000
*DCL GtzTrackRsn_NotAuthorized_Caller BIT(32) Constant('00000819'X)     00501000
*                        ; /*                                           00502000
*                        Meaning: A processing module for GTZTRACK has  00503000
*                        been invoked in the wrong state.               00504000
*                        Action: Use the provided GTZTRACK macro to     00505000
*                        call the processing module.                 */ 00506000
*DCL GtzTrackRsn_BadProgramPathALET BIT(32) Constant('0000081A'X) ; /*  00507000
*                        Meaning: Bad PROGRAMPATHALET.                  00508000
*                        Action: Make sure that the ALET associated     00509000
*                        with the PROGRAMPATH parameter is valid. The   00510000
*                        access register might not have been set up     00511000
*                        correctly.                                  */ 00512000
*DCL GtzTrackRsn_BadProgramPathLen BIT(32) Constant('0000081B'X) ; /*   00513000
*                        Meaning: PROGRAMPATHLEN is invalid.            00514000
*                        Action: PROGRAMPATHLEN has to be between 1 and 00515000
*                        1024.                                       */ 00516000
*DCL GtzTrackRsn_BadNoAbend BIT(32) Constant('0000081C'X) ; /*          00517000
*                        Meaning: NOABEND or NOABENDVAL is invalid.     00518000
*                        Action: NOABEND has to be YES or NO.           00519000
*                        NOABENDVAL has to be 1 or 0.                */ 00520000
*DCL GtzTrackRsn_BadOwnerValue BIT(32) Constant('0000081D'X) ; /*       00521000
*                        Meaning: Bad OWNER text value.                 00522000
*                        Action: Ensure that the OWNER value contains   00523000
*                        only the documented allowed characters.     */ 00524000
*DCL GtzTrackRsn_BadEventDescValue BIT(32) Constant('0000081E'X) ; /*   00525000
*                        Meaning: Bad EVENTDESC text value.             00526000
*                        Action: Ensure that the EVENTDESC value does   00527000
*                        not contain only blanks or only binary zeroes. 00528000
*                                                                    */ 00529000
*DCL GtzTrackRsn_BadSourceValue BIT(32) Constant('0000081F'X) ; /*      00530000
*                        Meaning: Bad SOURCE text value.                00531000
*                        Action: Ensure that the SOURCE value contains  00532000
*                        only the documented allowed characters.     */ 00533000
*DCL GtzTrackRsn_BadSourcePathValue BIT(32) Constant('00000820'X) ; /*  00534000
*                        Meaning: Bad SOURCEPATH text value.            00535000
*                        Action: Ensure that the SOURCEPATH value does  00536000
*                        not contain only blanks or only binary zeroes. 00537000
*                                                                    */ 00538000
*DCL GtzTrackRc_SevereError BIT(32) Constant('0000000C'X) ; /*          00539000
*                        Meaning: Severe Error.                         00540000
*                        Action: Refer to action under the individual   00541000
*                        reason code.                                */ 00542000
*DCL GtzTrackRc_OutOfMemory BIT(32) Constant('0000000D'X) ; /*          00543000
*                        Meaning: Tracking facility is low on memory.   00544000
*                        Action: See the description of message         00545000
*                        GTZ0004E.                                   */ 00546000
*DCL GtzTrackRc_CompError BIT(32) Constant('00000010'X) ; /*            00547000
*                        Meaning: Component error.                      00548000
*                        Action: Report the associated reason code to   00549000
*                        the system programmer to contact IBM Service.  00550000
*                                                                    */ 00551000
*                                                                       00552000
*/*** AMGRET - END (RC 0-16, RSNs for RC=4,8,12) ***/                   00553000
*                                                                       00554000
*/*** Reason codes for RC=16 */                                         00555000
*                                                                       00556000
*Dcl GtzTrackRsn_InternalError_BadPC Fixed(32) Constant('00001003'x);/* 00557000
*       Meaning: Component error.                                       00558000
*       Action:  Report the problem to the system programmer. */        00559000
*Dcl GtzTrackRsn_InternalError_BadUserErr                               00560000
*                                 Fixed(32) Constant('00001004'x); /*   00561000
*   Meaning: Component error.                                           00562000
*   Action: Report the problem to the system programmer.                00563000
*   */                                                                  00564000
*Dcl GtzTrackRsn_InternalError   Fixed(32) Constant('00001005'x); /*    00565000
*   Meaning: Component error.                                           00566000
*   Action: Report the problem to the system programmer.                00567000
*   */                                                                  00568000
*Dcl GtzTrackRsn_InternalError_RepeatAbend                              00569000
*                                 Fixed(32) Constant('00001006'x); /*   00570000
*   Meaning: Component error.                                           00571000
*   Action: Report the problem to the system programmer.                00572000
*   */                                                                  00573000
*                                                                       00574000
* @SPACE;                                                               00575000
* @LOGIC;                                                               00576000
* #PRAGMA TOOL=CBGEN.                                                   00577000
* #USEORG.                                                              00578000
* #ALIGNOP.                                                             00579000
* #NOTUPPER.                                                            00580000
* #EPRAGMA.                                                             00581000
* @ENDLOGIC;                                                            00582000
*/* End of PL/X Source                                               */ 00583000
*/* End of PL/X Source                                               */ 00584000
* %IF GTZZTRK_LIST = 'NO' !                                             00585000
*    ZCBPRINT = 'NO' %THEN                                              00586000
* %DO;                                                                  00587000
*   @LIST POP NOECHO;                                                   00588000
* %END;                                                                 00589000
* %END;                                                                 00590000
