*                                                                       00001000
* %DCL GTZZSMF1_INCLUDED CHAR EXT;                                      00002000
* %DEACTIVATE GTZZSMF1_INCLUDED;                                        00003000
* %IF GTZZSMF1_INCLUDED = '' %THEN                                      00004000
* %DO;                                                                  00005000
*/* Macro made bi-lingual on 19035. CBGEN compile date 15295         */ 00006000
*% /*                                                                   00007000
         MACRO                                                          00008000
         GTZZSMF1 &DSECT=YES,&LIST=YES,&TITLE=YES,&SMF125=YES           00009000
         GBLC  &GTZZSMF1_INCLUDED                                       00010000
         GBLC  &ZCBPRINT                                                00011000
&GTZZSMF1_INCLUDED SETC 'YES'                                           00012000
         AIF   ('&LIST' EQ 'NONE').P0                                   00013000
         AIF   ('&TITLE' EQ 'NO').P5                                    00014000
 TITLE   'GTZZSMF1  - Mapping of GTZ SMF records (type 125) and      '  00015000
.P5      ANOP                                                           00016000
**/ GTZZSMF1_1:;                                                        00017000
*/* START OF SPECIFICATIONS ******************************************* 00018000
*                                                                       00019000
*01* PROPRIETARY STATEMENT=                                             00020000
*                                                                       00021000
*   LICENSED MATERIALS - PROPERTY OF IBM                                00022000
*   5650-ZOS                                                            00023000
*   COPYRIGHT IBM CORP. 2017                                            00024000
*                                                                       00025000
*01* STATUS = HBB77B0                                                   00026000
*                                                                       00027000
*01* END OF PROPRIETARY STATEMENT                                       00028000
*                                                                       00029000
*01* EXTERNAL CLASSIFICATION: PI                                        00030000
*01* END OF EXTERNAL CLASSIFICATION:                                    00031000
*                                                                       00032000
*01* DESCRIPTIVE NAME:  Mapping of GTZ SMF records (type 125) and       00033000
*     declarations of associated constants                              00034000
*                                                                       00035000
*01* MACRO NAME:  GTZZSMF1                                              00036000
*                                                                       00037000
*01* DSECT NAME:                                                        00038000
*     GTZSMF125                                                         00039000
*                                                                       00040000
*01* COMPONENT:  IBM Generic Tracker for z/OS (SCGTZ)                   00041000
*                                                                       00042000
*01* EYE-CATCHER:  None                                                 00043000
*                                                                       00044000
*01* STORAGE ATTRIBUTES:                                                00045000
*02*  SUBPOOL:  Caller-supplied                                         00046000
*02*  KEY:  Caller-supplied                                             00047000
*02*  RESIDENCY:  Caller-supplied                                       00048000
*                                                                       00049000
*01* SIZE:                                                              00050000
*            SMF125 -- X'00C0' bytes                                    00051000
*            potentially accompanied by additional, variable length     00052000
*            data, resulting in a total record length given by          00053000
*            field SMF125LEN                                            00054000
*                                                                       00055000
*01* CREATED BY:                                                        00056000
*     GTZ tracking service GTZTRACK via SMF write services              00057000
*     (SMFWTM/SMFEWTM) and then stored in SMF backend datastore         00058000
*     (datasets or logstreams).                                         00059000
*     Note that GTZ SMF recording has to be enabled via the             00060000
*     SETGTZ PERSIST=SMF command or the GTZPRMxx parmlib member         00061000
*     statement PERSIST(SMF). Further, general SMF customization        00062000
*     might apply and prevent recording of GTZ SMF records.             00063000
*                                                                       00064000
*01* POINTED TO BY:                                                     00065000
*     For example by parameters to the user exits (e.g. USER2)          00066000
*     supported by the SMF dump programs (IFASMFDP or IFASMFDL).        00067000
*                                                                       00068000
*01* SERIALIZATION:                                                     00069000
*     None required                                                     00070000
*                                                                       00071000
*01* FUNCTION:                                                          00072000
*02* The GTZ SMF record 125 starts with a standard header for SMF       00073000
*    records which support sub-types. The header is followed by a       00074000
*    field count and a list of field information blocks containing      00075000
*    the offset to and length of the actual field data located further  00076000
*    into the individual SMF record.                                    00077000
*                                                                       00078000
*01* METHOD OF ACCESS:                                                  00079000
*02*  ASM:                                                              00080000
*      GTZZSMF1                                                         00081000
*                                                                       00082000
*02*  PL/X:                                                             00083000
*      %INCLUDE SYSLIB(GTZZSMF1)                                        00084000
*                                                                       00085000
*01* DELETED BY:                                                        00086000
*      N/A                                                              00087000
*                                                                       00088000
*01* FREQUENCY:                                                         00089000
*      One SMF record for each unique tracked instances if SMF          00090000
*      recording is enabled.                                            00091000
*                                                                       00092000
*01* DEPENDENCIES:                                                      00093000
*      None                                                             00094000
*                                                                       00095000
*01* DISTRIBUTION LIBRARY:  AMACLIB                                     00096000
*                                                                       00097000
*01* CHANGE ACTIVITY:                                                   00098000
*                                                                       00099000
* $P0=OA51475 HBB77A0,161103,RDUT: Copied from GTZZSMF and updated      00100000
*                                  117 to new 125                       00101000
*                                                                       00102000
* END OF SPECIFICATIONS *********************************************/  00103000
*% /*                                                                   00104000
.P0      ANOP                                                           00105000
         AIF   ('&ZCBPRINT' EQ 'NO').P1                                 00106000
         AIF   ('&LIST' EQ 'YES').P2                                    00107000
.P1      ANOP                                                           00108000
         PUSH  PRINT                                                    00109000
         PRINT OFF                                                      00110000
.P2      ANOP                                                           00111000
SMF125RECORDTYPE EQU 125                                                00112000
SMF125RECORDSUBTYPETRACKDATA EQU 1                                      00113000
*                                                                       00114000
*   Maximums for variable length fields                                 00115000
*                                                                       00116000
*                                                                       00117000
SMF125MAXPATHLEN EQU 1024 SOURCEPATH,PROGRAMPATH                        00118000
SMF125MAXEVENTDESCLEN EQU 64 EVENTDESC                                  00119000
SMF125TRACKDATAV1 EQU 1                                                 00120000
SMF125TRACKDATAV1MAXVARLEN EQU 2112 In to the length of the fixed      *00121000
                         portion of structure GtzSmf125                 00122000
         AIF   ('&SMF125' EQ 'NO').L0002                                00123000
         AIF   ('&DSECT' EQ 'YES').L0003                                00124000
         AIF   ('&SMF125' NE 'YES').L0002                               00125000
.L0003   ANOP                                                           00126000
*                                                                       00127000
*   Mapping for GTZ SMF record type 125                                 00128000
*                                                                       00129000
*                                                                       00130000
         AIF   ('&DSECT' EQ 'YES').L0004                                00131000
SMF125   DS    0F                                                       00132000
         AGO   .L0005                                                   00133000
.L0004   ANOP                                                           00134000
SMF125   DSECT                                                          00135000
.L0005   ANOP                                                           00136000
SMF125HDR DS   0CL24     Standard SMF header w/subtype                  00137000
SMF125LEN DS   H         Record length                                  00138000
SMF125SEG DS   H         Segment descriptor                             00139000
SMF125FLG DS   X         System indicator                               00140000
SMF125RTY DS   X         Record Type (=125)                             00141000
SMF125TME DS   FL4       Time since midnight in 1/100s that the record *00142000
                         was moved into the SMF buffer                  00143000
SMF125DTE DS   BL4       Date when record was moved into the SMF       *00144000
                         buffer. Format: 0cyydddF                       00145000
SMF125SID DS   CL4       System identification                          00146000
SMF125SSI DS   CL4       Subsystem identification, 'GTZ '               00147000
SMF125STY DS   H         Record subtype. See GtzSmfRecordSubType*      *00148000
                         above                                          00149000
SMF125DTA DS   0CL168    Data for the different supported subtypes      00150000
         ORG   SMF125DTA                                                00151000
SMF125TRK DS   0CL168    Fields for subtype TRACKDATA                   00152000
SMF125TVR DS   0X        Version:GtzSmfVersionTRACKDATA 1 Future,      *00153000
                         higher versions might indicate fields have    *00154000
                         been added to the end of the current format.   00155000
SMF125TVERSION DS X                                                     00156000
SMF125TF1 DS   0B        Flags byte 1                                   00157000
SMF125TFS EQU  X'80'     If ON, use SOURCEPATH, via SMF125TSPL and     *00158000
                         SMF125TSPO, otherwise use SOURCE, via         *00159000
                         SMF125TSO                                      00160000
SMF125TISSOURCEPATH EQU X'80'                                           00161000
SMF125TFP EQU  X'40'     If ON, use PROGRAMPATH, via SMF125TPPL and    *00162000
                         SMF125TPPO, otherwise use PROGRAM, via        *00163000
                         SMF125TPR                                      00164000
SMF125TISPROGRAMPATH EQU X'40'                                          00165000
SMF125TFA EQU  X'20'     If ON, the tracked EVENT ran authorized        00166000
SMF125TISAUTHORIZED EQU X'20'                                           00167000
SMF125TFC EQU  X'10'     Not part of the intended interface             00168000
SMF125TISCNZTRKR EQU X'10'                                              00169000
         ORG   SMF125TF1+1                                              00170000
         DS    CL6                                                      00171000
         DS    B                                                        00172000
SMF125TFT DS   0BL8      The timestamp when the first instance of this *00173000
                         unique tracked instance was recorded           00174000
SMF125TFIRSTTOD DS BL8                                                  00175000
         DS    BL7                                                      00176000
SMF125TOW DS   0CL16     OWNER value                                    00177000
SMF125TOWNER DS CL16                                                    00178000
SMF125TSO DS   0CL8      SOURCE value. Only valid if SMF125TFS is OFF   00179000
SMF125TSOURCE DS CL8                                                    00180000
SMF125TSPL DS  0H        Length of SOURCEPATH value. Only valid if     *00181000
                         SMF125TFS is ON                                00182000
SMF125TSOURCEPATHLEN DS H                                               00183000
SMF125TSPO DS  0H        Offset from the start of this GtzSmf125       *00184000
                         record to the SOURCEPATH value of the above   *00185000
                         length. Only valid if SMF125TFS is ON          00186000
SMF125TSOURCEPATHOFFSET DS H                                            00187000
SMF125TEDL DS  0H        Length of EVENTDESC value                      00188000
SMF125TEVENTDESCLEN DS H                                                00189000
SMF125TEDO DS  0H        Offset from the start of this GtzSmf125       *00190000
                         record to the EVENTDESC value of the above    *00191000
                         length.                                        00192000
SMF125TEVENTDESCOFFSET DS H                                             00193000
SMF125TED DS   0CL16     EVENTDATA value                                00194000
SMF125TEVENTDATA DS 0CL16                                               00195000
SMF125TEVENTDATA1 DS FL8                                                00196000
SMF125TEVENTDATA2 DS FL8                                                00197000
SMF125TEJ DS   0CL8      Derived EVENTJOB-name value                    00198000
SMF125TEVENTJOB DS CL8                                                  00199000
SMF125THJ DS   0CL8      Derived HOMEJOB-name value                     00200000
SMF125THOMEJOB DS CL8                                                   00201000
SMF125TPR DS   0CL8      Derived PROGRAM-name value. Only valid if     *00202000
                         SMF125TFP is OFF                               00203000
SMF125TPROGRAM DS CL8                                                   00204000
SMF125TPO DS   0FL8      Derived PROGRAMOFFSET value                    00205000
SMF125TPROGRAMOFFSET DS FL8                                             00206000
SMF125TPPL DS  0H        Length of PROGRAMPATH value. Only valid if    *00207000
                         SMF125TFP is ON                                00208000
SMF125TPROGRAMPATHLEN DS H                                              00209000
SMF125TPPO DS  0H        Offset from the start of this GtzSmf125       *00210000
                         record to the PROGRAMPATH value of the above  *00211000
                         length. Only valid if SMF125TFP is ON          00212000
SMF125TPROGRAMPATHOFFSET DS H                                           00213000
SMF125TEA DS   0H        EVENTASID value                                00214000
SMF125TEVENTASID DS H                                                   00215000
SMF125THA DS   0H        HOMEASID value                                 00216000
SMF125THOMEASID DS H                                                    00217000
SMF125SYN DS   0CL8      Name of system on which this tracked instance *00218000
                         was recorded                                   00219000
SMF125TSYSTEMNAME DS CL8                                                00220000
SMF125SXN DS   0CL8      Name of sysplex on which this tracked         *00221000
                         instance was recorded                          00222000
SMF125TSYSPLEXNAME DS CL8                                               00223000
         DS    CL40      Reserved                                       00224000
SMF125_LEN EQU *-SMF125                                                 00225000
.L0002   ANOP                                                           00226000
         AIF   ('&ZCBPRINT' EQ 'NO').P3                                 00227000
         AIF   ('&LIST' EQ 'YES').P4                                    00228000
.P3      ANOP                                                           00229000
         POP   PRINT                                                    00230000
.P4      ANOP                                                           00231000
.P_EXIT  ANOP                                                           00232000
         MEND                                                           00233000
**/ GTZZSMF1_2:;                                                        00234000
* %GTZZSMF1_INCLUDED = 'YES';                                           00235000
* %DCL ZCBPRINT CHAR EXT;                                               00236000
* %DEACTIVATE ZCBPRINT;                                                 00237000
* %DCL GTZZSMF1_LIST CHAR EXT;                                          00238000
* %DEACTIVATE GTZZSMF1_LIST;                                            00239000
* %IF GTZZSMF1_LIST ^= 'NO' &                                           00240000
*    ZCBPRINT ^= 'NO' %THEN                                             00241000
*   %GOTO GTZZSMF1_3;                                                   00242000
*   @LIST PUSH NOECHO;                                                  00243000
*   @LIST NOASSEMBLE NOECHO;                                            00244000
*   @LIST OFF C NOECHO;                                                 00245000
* %GTZZSMF1_3:;                                                         00246000
*/* Start of PL/X Source                                             */ 00247000
*%GTZSMF125m = 'GtzSmf125';                                   /* @xxA*/ 00248000
*%IF IBM_CBGENC = 'YES' %THEN                                 /* @xxA*/ 00249000
*%DO;                                                         /* @xxA*/ 00250000
*  %GTZSMF125m = 'SMF125';                                    /* @xxA*/ 00251000
*%END;                                                        /* @xxA*/ 00252000
*                                                                       00253000
*Dcl GTZSMF125m%%RecordType           Fixed(8)  Constant(125);          00254000
*Dcl GTZSMF125m%%RecordSubTypeTRACKDATA Fixed(16) Constant(1);          00255000
*                                                                       00256000
*/* Maximums for variable length fields */                              00257000
*Dcl GTZSMF125m%%MaxPathLen Constant(1024);/* SOURCEPATH,PROGRAMPATH */ 00258000
*Dcl GTZSMF125m%%MaxEventDescLen Constant(64); /* EVENTDESC */          00259000
*                                                                       00260000
*Dcl GTZSMF125m%%TRACKDATAV1       Fixed(8)  Constant(1);               00261000
*                                                                       00262000
*Dcl GTZSMF125m%%TRACKDATAV1MaxVarLen Fixed(31)                         00263000
*                          Constant(GTZSMF125m%%MaxPathLen+             00264000
*                                   GTZSMF125m%%MaxPathLen+             00265000
*                                   GTZSMF125m%%MaxEventDescLen); /* In 00266000
*                                   to the length of the fixed portion  00267000
*                                   of structure GtzSmf125 */           00268000
*                                                                       00269000
*/* Mapping for GTZ SMF record type 125 */                              00270000
*Dcl 1 GTZSMF125m Type Bdy(WORD)                                        00271000
*    ,3 SMF125HDR                   /* Standard SMF header w/subtype*/  00272000
*     ,5 SMF125LEN Fixed(16)        /* Record length                */  00273000
*     ,5 SMF125SEG Fixed(16)        /* Segment descriptor           */  00274000
*     ,5 SMF125FLG Fixed(8)         /* System indicator             */  00275000
*     ,5 SMF125RTY Fixed(8)         /* Record Type (=125)           */  00276000
*     ,5 SMF125TME Fixed(32) Bdy(HWORD) /* Time since midnight in       00277000
*                                       1/100s that the record was      00278000
*                                       moved into the SMF buffer   */  00279000
*     ,5 SMF125DTE Bit(32)          /* Date when record was moved into  00280000
*                                       the SMF buffer.                 00281000
*                                       Format: 0cyydddF            */  00282000
*     ,5 SMF125SID Char(4)          /* System identification        */  00283000
*     ,5 SMF125SSI Char(4)          /* Subsystem identification,        00284000
*                                      'GTZ '                       */  00285000
*     ,5 SMF125STY Fixed(16)        /* Record subtype. See              00286000
*                                      GtzSmfRecordSubType* above   */  00287000
*   ,3 SMF125DTA UNION              /* Data for the different           00288000
*                                      supported subtypes           */  00289000
*    ,5 SMF125TRK                   /* Fields for subtype TRACKDATA */  00290000
*     ,7 SMF125TVR Fixed(8)         /* Version:GtzSmfVersionTRACKDATA1  00291000
*                                      Future, higher versions          00292000
*                                      might indicate fields            00293000
*                                      have been added to the end       00294000
*                                      of the current format.       */  00295000
*      ,9 GTZSMF125m%%TVersion Fixed(8)                                 00296000
*     ,7 SMF125TF1 Bit(8)           /* Flags byte 1 */                  00297000
*      ,9 SMF125TFS Bit(1)          /* If ON, use SOURCEPATH, via       00298000
*                                      SMF125TSPL and SMF125TSPO,       00299000
*                                      otherwise use SOURCE, via        00300000
*                                      SMF125TSO */                     00301000
*       ,11 GTZSMF125m%%TisSourcePath Bit(1)                            00302000
*      ,9 SMF125TFP Bit(1)          /* If ON, use PROGRAMPATH, via      00303000
*                                      SMF125TPPL and SMF125TPPO,       00304000
*                                      otherwise use PROGRAM, via       00305000
*                                      SMF125TPR */                     00306000
*       ,11 GTZSMF125m%%TisProgramPath Bit(1)                           00307000
*      ,9 SMF125TFA Bit(1)          /* If ON, the tracked EVENT         00308000
*                                      ran authorized */                00309000
*       ,11 GTZSMF125m%%TisAuthorized Bit(1)                            00310000
*      ,9 SMF125TFC Bit(1)          /* Not part of the intended         00311000
*                                      interface */                     00312000
*       ,11 GTZSMF125m%%TisCNZTRKR Bit(1)                               00313000
*      ,9 * Bit(4)                                                      00314000
*     ,7 * Char(6)                                                      00315000
*     ,7 * Bit(8)                                                       00316000
*     ,7 SMF125TFT Bit(64)          /* The timestamp when the           00317000
*                                      first instance of this unique    00318000
*                                      tracked instance was recorded*/  00319000
*      ,9 GTZSMF125m%%TFirstTOD Bit(64)                                 00320000
*     ,7 * Bit(56)                                                      00321000
*     ,7 SMF125TOW Char(16)         /* OWNER value */                   00322000
*      ,9 GTZSMF125m%%TOwner Char(16)                                   00323000
*     ,7 SMF125TSO Char(8)          /* SOURCE value. Only valid if      00324000
*                                      SMF125TFS is OFF */              00325000
*      ,9 GTZSMF125m%%TSource Char(8)                                   00326000
*     ,7 SMF125TSPL Fixed(16)       /* Length of SOURCEPATH value.      00327000
*                                      Only valid if SMF125TFS is ON*/  00328000
*      ,9 GTZSMF125m%%TSourcePathLen Fixed(16)                          00329000
*     ,7 SMF125TSPO Fixed(16)       /* Offset from the start of this    00330000
*                                      GtzSmf125 record to the          00331000
*                                      SOURCEPATH value of the above    00332000
*                                      length.                          00333000
*                                      Only valid if SMF125TFS is ON*/  00334000
*      ,9 GTZSMF125m%%TSourcePathOffset Fixed(16)                       00335000
*     ,7 SMF125TEDL Fixed(16)       /* Length of EVENTDESC value */     00336000
*      ,9 GTZSMF125m%%TEventDescLen Fixed(16)                           00337000
*     ,7 SMF125TEDO Fixed(16)       /* Offset from the start of this    00338000
*                                      GtzSmf125 record to the          00339000
*                                      EVENTDESC value of the above     00340000
*                                      length. */                       00341000
*      ,9 GTZSMF125m%%TEventDescOffset Fixed(16)                        00342000
*     ,7 SMF125TED  Char(16) Bdy(Word) /* EVENTDATA value */            00343000
*      ,9 GTZSMF125m%%TEventData Char(16) Bdy(Word)                     00344000
*       ,11 GTZSMF125m%%TEventData1 Fixed(64) Bdy(Word)                 00345000
*       ,11 GTZSMF125m%%TEventData2 Fixed(64) Bdy(Word)                 00346000
*     ,7 SMF125TEJ Char(8)          /* Derived EVENTJOB-name value */   00347000
*      ,9 GTZSMF125m%%TEventJob Char(8)                                 00348000
*     ,7 SMF125THJ Char(8)          /* Derived HOMEJOB-name value */    00349000
*      ,9 GTZSMF125m%%THomeJob Char(8)                                  00350000
*     ,7 SMF125TPR Char(8)          /* Derived PROGRAM-name value.      00351000
*                                      Only valid if SMF125TFP          00352000
*                                      is OFF*/                         00353000
*      ,9 GTZSMF125m%%TProgram Char(8)                                  00354000
*     ,7 SMF125TPO Fixed(64) Bdy(Word)/* Derived PROGRAMOFFSET value*/  00355000
*      ,9 GTZSMF125m%%TProgramOffset Fixed(64) Bdy(Word)                00356000
*     ,7 SMF125TPPL Fixed(16)       /* Length of PROGRAMPATH value.     00357000
*                                      Only valid if SMF125TFP is ON*/  00358000
*      ,9 GTZSMF125m%%TProgramPathLen Fixed(16)                         00359000
*     ,7 SMF125TPPO Fixed(16)       /* Offset from the start of this    00360000
*                                      GtzSmf125 record to the          00361000
*                                      PROGRAMPATH value of the above   00362000
*                                      length.                          00363000
*                                      Only valid if SMF125TFP is ON*/  00364000
*      ,9 GTZSMF125m%%TProgramPathOffset Fixed(16)                      00365000
*     ,7 SMF125TEA Fixed(16)        /* EVENTASID value */               00366000
*      ,9 GTZSMF125m%%TEventASID Fixed(16)                              00367000
*     ,7 SMF125THA Fixed(16)        /* HOMEASID value */                00368000
*      ,9 GTZSMF125m%%THomeASID Fixed(16)                               00369000
*     ,7 SMF125SYN Char(8)          /* Name of system on which this     00370000
*                                      tracked instance was recorded */ 00371000
*      ,9 GTZSMF125m%%TSystemName Char(8)                               00372000
*     ,7 SMF125SXN Char(8)          /* Name of sysplex on which this    00373000
*                                      tracked instance was recorded */ 00374000
*      ,9 GTZSMF125m%%TSysplexName Char(8)                              00375000
*     ,7 * Char(40)                 /* Reserved */                      00376000
*     ;                                                                 00377000
*                                                                       00378000
*                                                                       00379000
*@LOGIC;                                                                00380000
*#PRAGMA TOOL=CBGEN.                                                    00381000
*#ALIGNOP.                                                              00382000
*#EPRAGMA.                                                              00383000
*@ENDLOGIC;                                                             00384000
*/* End of PL/X Source                                               */ 00385000
* %IF GTZZSMF1_LIST ^= 'NO' &                                           00386000
*    ZCBPRINT ^= 'NO' %THEN                                             00387000
*   %GOTO GTZZSMF1_4;                                                   00388000
*   @LIST POP NOECHO;                                                   00389000
* %GTZZSMF1_4:;                                                         00390000
* %END;                                                                 00391000
