*/** START OF SPECIFICATIONS *****************************************          
*                                                                    *          
* *****PROPRIETARY_STATEMENT******************************************          
* **01* PROPRIETARY STATEMENT=                                       *          
*                                                                    *          
*                                                                    *          
*  LICENSED MATERIALS - PROPERTY OF IBM                              *          
*  5694-A01 COPYRIGHT IBM CORP. 2006, 2007                           *          
*                                                                    *          
*                                                                    *          
*  STATUS= HBB7740                                                   *          
*                                                                    *          
* ****END_OF_PROPRIETARY_STATEMENT************************************          
*                                                                    *          
* 01* DESCRIPTIVE NAME: XML Parser Query XML Document Output Area    *          
* 02* ACRONYM: QXD                                                   *          
*                                                                    *          
* 01* MACRO NAME: GXLYQXD                                            *          
*                                                                    *          
* 01* EXTERNAL CLASSIFICATION: PI                                    *          
* 01* END OF EXTERNAL CLASSIFICATION:                                *          
*                                                                    *          
* 01* DSECT NAME: N/A                                                *          
*                                                                    *          
* 01* COMPONENT: z/OS XML Parser (SCXML)                             *          
*                                                                    *          
* 01* EYE-CATCHER: N/A                                               *          
*                                                                    *          
* 01* STORAGE ATTRIBUTES:                                            *          
* 02* SUBPOOL: N/A                                                   *          
* 02* KEY: N/A                                                       *          
* 02* RESIDENCY: N/A                                                 *          
*                                                                    *          
* 01* SIZE: N/A                                                      *          
*                                                                    *          
* 01* CREATED BY: N/A                                                *          
*                                                                    *          
* 01* POINTED TO BY: N/A                                             *          
*                                                                    *          
* 01* SERIALIZATION: None                                            *          
*                                                                    *          
* 01* FUNCTION:                                                      *          
*  z/OS XML mapping of the system service vector                     *          
*                                                                    *          
*                                                                    *          
* 01* METHOD OF ACCESS:                                              *          
* 02* ASM:                                                           *          
* 02* PL/AS: %INCLUDE SYSLIB(GXLYQXD)                                *          
*                                                                    *          
* 01* DELETED BY: N/A                                                *          
*                                                                    *          
* 01* FREQUENCY: N/A                                                 *          
*                                                                    *          
* 01* DEPENDENCIES: None                                             *          
*                                                                    *          
* 01* NOTES:                                                         *          
*  The GXLYQXD file is generated.                                    *          
*                                                                    *          
*                                                                    *          
* 01* DISTRIBUTION LIBRARY: AMACLIB                                  *          
*                                                                    *          
* 01* CHANGE ACTIVITY:                                               *          
*   $L0=HZZ ,HBB7730,040930,PDXX: PLX XML Parser first release       *          
*   $P1=ME06040,HBB7730,060307,PDTH: classification prolog update    *          
*                                                                    *          
**** END OF SPECIFICATIONS ******************************************/          
*                                                                               
* DCL 1 QXD based bdy(dword),                                                   
*                                                                               
* /*QXD control block version                                       */          
*       3 QXD_Version fixed(31),                                                
*                                                                               
* /******************************************************************/          
* /*After evaluating the first few bytes of the document,           */          
* /*a specific character set is determined to be used to do         */          
* /*the rest of the parse. QXD_XML_Autodet_value is set             */          
* /*to that detected value. See QXD_XML_AUTODETxxx values           */          
* /*below for possible values                                       */          
* /******************************************************************/          
*       3 QXD_XML_Autodet_value fixed(32),                                      
*                                                                               
* /******************************************************************/          
* /*The detected value is then assigned a CCSID                     */          
* /*If a Byte Order Mark is found the detected CCSID is             */          
* /*known and is set. If no Byte Order Mark is found the            */          
* /*detected CCSID is a default value which we set                  */          
* /******************************************************************/          
*       3 QXD_XML_Autodet_CCSID fixed(32),                                      
*                                                                               
* /******************************************************************/          
* /*XML version and release numbers. This defaults to               */          
* /*x'00010000' if not specified in the document itself             */          
* /******************************************************************/          
*       3 QXD_XML_Version fixed(16),                                            
*                                                                               
* /*XML release                                                     */          
*       3 QXD_XML_Release fixed(16),                                            
*                                                                               
* /******************************************************************/          
* /*If the encoding is valid and is specified in the document       */          
* /*the ccsid is returned in this field                             */          
* /******************************************************************/          
*       3 QXD_XML_Specified_CCSID fixed(32),                                    
*                                                                               
* /******************************************************************/          
* /*QXD Flag1                                                       */          
* /*- standalone bit is on if standalone = yes                      */          
* /*- bom is on if byte order mark detected in the doc              */          
* /*- encoding undetected bit is on if encoding not auto-detected   */          
* /******************************************************************/          
*       3 QXD_XML_Flag1 bit(8),                                                 
*                                                                               
* /*Standalone flag                                                 */          
*         5 QXD_XML_Flag1_sa bit(1),                                            
*                                                                               
* /*With Byte order mark flag                                       */          
*         5 QXD_XML_Flag1_bom bit(1),                                           
*                                                                               
* /*No encoding detected. CCSID is a default value.                 */          
*         5 QXD_XML_Flag1_enc_undetected bit(1),                                
*                                                                               
* /*Reserved                                                        */          
*         5 * bit(5),                                                           
*                                                                               
* /******************************************************************/          
* /*QXD Flag2                                                       */          
* /*- sa_specified is on if standalone is specified in the          */          
* /*xml declaration                                                 */          
* /*- enc_specified is on if encoding is specified in the           */          
* /*xml declaration                                                 */          
* /*- ver_specified is on if the version is specified in            */          
* /*xml declaration                                                 */          
* /******************************************************************/          
*       3 QXD_XML_Flag2 bit(8),                                                 
*                                                                               
* /*Standalone value                                                */          
*         5 QXD_XML_Flag2_sa_specified bit(1),                                  
*                                                                               
* /*Encoding specified                                              */          
*         5 QXD_XML_Flag2_enc_specified bit(1),                                 
*                                                                               
* /*version specified                                               */          
*         5 QXD_XML_Flag2_Ver_specified bit(1),                                 
*                                                                               
*         5 * bit(5),                                                           
*                                                                               
* /*reserved, alignment                                             */          
*       3 * fixed(16),                                                          
*                                                                               
* /*Length of decl statement, including the BOM (if present).       */          
* /*If the decl statement is NWF, the length only includes what has */          
* /*been processed.                                                 */          
*       3 QXD_XML_Decl_Len fixed(32);                                           
*                                                                               
*                                                                               
*/*******************************************************************/          
*/*Constants                                                        */          
*/*******************************************************************/          
*                                                                               
* /*QXD Version                                                     */          
* DCL  QXD_CURRENT_VERSION fixed(31) constant(1),                               
*                                                                               
* /*Version 1                                                       */          
*      QXD_VERSION_1 fixed(31) constant(1),                                     
*                                                                               
* /*1.X                                                             */          
*      QXD_XML_VERSION_1 fixed(16) constant(1),                                 
*                                                                               
* /*X.0                                                             */          
*      QXD_XML_RELEASE_0 fixed(16) constant(0),                                 
*                                                                               
* /*X.1                                                             */          
*      QXD_XML_RELEASE_1 fixed(16) constant(1),                                 
*                                                                               
*      QXD_MIN_INPUT_LEN fixed(16) constant(4);                                 
*                                                                               
*                                                                               
*/*******************************************************************/          
*/*Flag Constants                                                   */          
*/*******************************************************************/          
*                                                                               
* DCL  QXD_XML_FLAG1_SA_BIT fixed(8) constant('80'x),                           
*                                                                               
*      QXD_XML_FLAG1_BOM_BIT fixed(8) constant('40'x),                          
*                                                                               
*      QXD_XML_FLAG2_SA_SPEC_BIT fixed(8) constant('80'x),                      
*                                                                               
*      QXD_XML_FLAG2_ENC_SPEC_BIT fixed(8) constant('40'x),                     
*                                                                               
*      QXD_XML_FLAG2_VER_SPEC_BIT fixed(8) constant('20'x),                     
*                                                                               
*      QXD_XML_FLAG2_DECL_SPEC_BIT fixed(8) constant('20'x);                    
*                                                                               
*                                                                               
*/*******************************************************************/          
*/*Character Encodings Constants                                    */          
*/*******************************************************************/          
*                                                                               
* /*Big end ucs4                                                    */          
* DCL  QXD_XML_AUTODET_BEU4 fixed(32) constant(1),                              
*                                                                               
* /*Lit end ucs4                                                    */          
*      QXD_XML_AUTODET_LEU4 fixed(32) constant(2),                              
*                                                                               
* /*Unusual oct1                                                    */          
*      QXD_XML_AUTODET_UOU41 fixed(32) constant(3),                             
*                                                                               
* /*Unusual oct2                                                    */          
*      QXD_XML_AUTODET_UOU42 fixed(32) constant(4),                             
*                                                                               
* /*Big end utf16                                                   */          
*      QXD_XML_AUTODET_BEU2 fixed(32) constant(5),                              
*                                                                               
* /*Lit end utf16                                                   */          
*      QXD_XML_AUTODET_LEU2 fixed(32) constant(6),                              
*                                                                               
* /*utf8                                                            */          
*      QXD_XML_AUTODET_U1 fixed(32) constant(7),                                
*                                                                               
* /*ebcdic                                                          */          
*      QXD_XML_AUTODET_EB fixed(32) constant(8);                                
*                                                                               
*                                                                               
*/*                                                                             
                      MACRO                                                     
                      GXLYQXD                                                   
*                                                                               
QXD                   DSECT                                                     
* QXD control block version                                          *          
QXD_Version           DS   F                                                    
**********************************************************************          
* After evaluating the first few bytes of the document,              *          
* a specific character set is determined to be used to do            *          
* the rest of the parse. QXD_XML_Autodet_value is set                *          
* to that detected value. See QXD_XML_AUTODETxxx values              *          
* below for possible values                                          *          
**********************************************************************          
QXD_XML_Autodet_value DS   F                                                    
**********************************************************************          
* The detected value is then assigned a CCSID                        *          
* If a Byte Order Mark is found the detected CCSID is                *          
* known and is set. If no Byte Order Mark is found the               *          
* detected CCSID is a default value which we set                     *          
**********************************************************************          
QXD_XML_Autodet_CCSID DS   F                                                    
**********************************************************************          
* XML version and release numbers. This defaults to                  *          
* x'00010000' if not specified in the document itself                *          
**********************************************************************          
QXD_XML_Version       DS   H                                                    
* XML release                                                        *          
QXD_XML_Release       DS   H                                                    
**********************************************************************          
* If the encoding is valid and is specified in the document          *          
* the ccsid is returned in this field                                *          
**********************************************************************          
QXD_XML_Specified_CCSID DS   F                                                  
**********************************************************************          
* QXD Flag1                                                          *          
* - standalone bit is on if standalone = yes                         *          
* - bom is on if byte order mark detected in the doc                 *          
* - encoding undetected bit is on if encoding not auto-detected      *          
**********************************************************************          
QXD_XML_Flag1         DS   1CL1  *converted from bit(8)*                        
* Standalone flag                                                    *          
QXD_XML_Flag1_sa      EQU  B'10000000'                                          
* With Byte order mark flag                                          *          
QXD_XML_Flag1_bom     EQU  B'01000000'                                          
* No encoding detected. CCSID is a default value.                    *          
QXD_XML_Flag1_enc_undetected EQU  B'00100000'                                   
* Reserved                                                           *          
                                                                                
**********************************************************************          
* QXD Flag2                                                          *          
* - sa_specified is on if standalone is specified in the             *          
* xml declaration                                                    *          
* - enc_specified is on if encoding is specified in the              *          
* xml declaration                                                    *          
* - ver_specified is on if the version is specified in               *          
* xml declaration                                                    *          
**********************************************************************          
QXD_XML_Flag2         DS   1CL1  *converted from bit(8)*                        
* Standalone value                                                   *          
QXD_XML_Flag2_sa_specified EQU  B'10000000'                                     
* Encoding specified                                                 *          
QXD_XML_Flag2_enc_specified EQU  B'01000000'                                    
* version specified                                                  *          
QXD_XML_Flag2_Ver_specified EQU  B'00100000'                                    
                                                                                
* reserved, alignment                                                *          
                      DS   H                                                    
* Length of decl statement, including the BOM (if present).          *          
* If the decl statement is NWF, the length only includes what has    *          
* been processed.                                                    *          
QXD_XML_Decl_Len      DS   F                                                    
* Length of this DSECT                                                          
QXD#LEN               EQU  *-QXD                                                
*                                                                               
*                                                                               
**********************************************************************          
* Constants                                                          *          
**********************************************************************          
*                                                                               
* QXD Version                                                        *          
QXD_CURRENT_VERSION  EQU  1                                                     
*                                                                               
* Version 1                                                          *          
QXD_VERSION_1  EQU  1                                                           
*                                                                               
* 1.X                                                                *          
QXD_XML_VERSION_1  EQU  1                                                       
*                                                                               
* X.0                                                                *          
QXD_XML_RELEASE_0  EQU  0                                                       
*                                                                               
* X.1                                                                *          
QXD_XML_RELEASE_1  EQU  1                                                       
*                                                                               
QXD_MIN_INPUT_LEN  EQU  4                                                       
*                                                                               
*                                                                               
**********************************************************************          
* Flag Constants                                                     *          
**********************************************************************          
*                                                                               
QXD_XML_FLAG1_SA_BIT  EQU  X'80'                                                
*                                                                               
QXD_XML_FLAG1_BOM_BIT  EQU  X'40'                                               
*                                                                               
QXD_XML_FLAG2_SA_SPEC_BIT  EQU  X'80'                                           
*                                                                               
QXD_XML_FLAG2_ENC_SPEC_BIT  EQU  X'40'                                          
*                                                                               
QXD_XML_FLAG2_VER_SPEC_BIT  EQU  X'20'                                          
*                                                                               
QXD_XML_FLAG2_DECL_SPEC_BIT  EQU  X'20'                                         
*                                                                               
*                                                                               
**********************************************************************          
* Character Encodings Constants                                      *          
**********************************************************************          
*                                                                               
* Big end ucs4                                                       *          
QXD_XML_AUTODET_BEU4  EQU  1                                                    
*                                                                               
* Lit end ucs4                                                       *          
QXD_XML_AUTODET_LEU4  EQU  2                                                    
*                                                                               
* Unusual oct1                                                       *          
QXD_XML_AUTODET_UOU41  EQU  3                                                   
*                                                                               
* Unusual oct2                                                       *          
QXD_XML_AUTODET_UOU42  EQU  4                                                   
*                                                                               
* Big end utf16                                                      *          
QXD_XML_AUTODET_BEU2  EQU  5                                                    
*                                                                               
* Lit end utf16                                                      *          
QXD_XML_AUTODET_LEU2  EQU  6                                                    
*                                                                               
* utf8                                                               *          
QXD_XML_AUTODET_U1  EQU  7                                                      
*                                                                               
* ebcdic                                                             *          
QXD_XML_AUTODET_EB  EQU  8                                                      
*                                                                               
*                                                                               
                      MEND                                                      
**/                                                                             
