*/** START OF SPECIFICATIONS *****************************************          
*                                                                    *          
* *****PROPRIETARY_STATEMENT******************************************          
* **01* PROPRIETARY STATEMENT=                                       *          
*                                                                    *          
*                                                                    *          
*  LICENSED MATERIALS - PROPERTY OF IBM                              *          
*  5694-A01 COPYRIGHT IBM CORP. 2010                                 *          
*                                                                    *          
*                                                                    *          
*  STATUS= HBB7770                                                   *          
*                                                                    *          
* ****END_OF_PROPRIETARY_STATEMENT************************************          
*                                                                    *          
* 01* DESCRIPTIVE NAME: XML Parser Control Feature                   *          
* 02* ACRONYM: CTL                                                   *          
*                                                                    *          
* 01* MACRO NAME: GXLYCTL                                            *          
*                                                                    *          
* 01* EXTERNAL CLASSIFICATION: PI                                    *          
* 01* END OF EXTERNAL CLASSIFICATION:                                *          
*                                                                    *          
* 01* DSECT NAME: N/A                                                *          
*                                                                    *          
* 01* COMPONENT: z/OS XML Parser (SCXML)                             *          
*                                                                    *          
* 01* EYE-CATCHER: N/A                                               *          
*                                                                    *          
* 01* STORAGE ATTRIBUTES:                                            *          
* 02* SUBPOOL: N/A                                                   *          
* 02* KEY: N/A                                                       *          
* 02* RESIDENCY: N/A                                                 *          
*                                                                    *          
* 01* SIZE: N/A                                                      *          
*                                                                    *          
* 01* CREATED BY: N/A                                                *          
*                                                                    *          
* 01* POINTED TO BY: N/A                                             *          
*                                                                    *          
* 01* SERIALIZATION: None                                            *          
*                                                                    *          
* 01* FUNCTION:                                                      *          
*  Macros used by control callable service                           *          
*                                                                    *          
*                                                                    *          
* 01* METHOD OF ACCESS:                                              *          
* 02* ASM:                                                           *          
* 02* PL/AS: %INCLUDE SYSLIB(GXLYCTL)                                *          
*                                                                    *          
* 01* DELETED BY: N/A                                                *          
*                                                                    *          
* 01* FREQUENCY: N/A                                                 *          
*                                                                    *          
* 01* DEPENDENCIES: None                                             *          
*                                                                    *          
* 01* NOTES:                                                         *          
*  The GXLYCTL file is a generated file.                             *          
*                                                                    *          
*                                                                    *          
* 01* DISTRIBUTION LIBRARY: AMACLIB                                  *          
*                                                                    *          
* 01* CHANGE ACTIVITY:                                               *          
*   @LTA=CTLHDR ,HBB7770,081009,PDGL: Combine Ctl macros into one mac*          
*                                                                    *          
**** END OF SPECIFICATIONS ******************************************/          
*%DCL GXLYCTL_CHECK CHAR EXTERNAL;                                              
*%IF GXLYCTL_CHECK = ''                                                         
*%THEN                                                                          
*%DO;                                                                           
*%GXLYCTL_CHECK = 'YES';                                                        
*                                                                               
*/*******************************************************************/          
*/*XML Parser Entities and References input output area             */          
*/*******************************************************************/          
* DCL 1 XEAR based bdy(dword),                                                  
*                                                                               
* /*XEAR Version                                                    */          
*       3 XEAR_VERSION fixed(32),                                               
*                                                                               
* /*XEAR operation flags                                            */          
*       3 XEAR_OP_FLAGS bit(32),                                                
*                                                                               
* /*Stop on unresolved character                                    */          
*         5 XEAR_ENTREF_STOP_UNRESOLVED bit(1),                                 
*                                                                               
* /*unrepresentable character reference record                      */          
*         5 XEAR_ENTREF_UNREP_CHARREF_REC bit(1),                               
*                                                                               
*         5 * bit(30),                                                          
*                                                                               
* /*XEAR replacement character length                               */          
*       3 XEAR_REPLACEMENT_CHAR_LENGTH fixed(8),                                
*                                                                               
* /*XEAR replacement character value                                */          
*       3 XEAR_REPLACEMENT_CHAR char(4),                                        
*                                                                               
*       3 * char(3),                                                            
*                                                                               
* /*Pointer to XD area 64 bit                                       */          
*       3 XEAR_XD_PTR ptr(64),                                                  
*                                                                               
*         5 * char(4),                                                          
*                                                                               
* /*31 bit pointer to XD area                                       */          
*         5 XEAR1_XD_PTR ptr(31);                                               
*                                                                               
*                                                                               
*/*******************************************************************/          
*/*Constants                                                        */          
*/*******************************************************************/          
*                                                                               
* DCL  XEAR_Version_1 FIXED(31) constant(1);                                    
*                                                                               
*                                                                               
*                                                                               
*/*******************************************************************/          
*/*This length/value pair mapping is for the namespace prefix       */          
*/*and uri entry in the fragment parsing table                      */          
*/*******************************************************************/          
* DCL 1 XFC_ENTRY based bdy(dword),                                             
*                                                                               
* /*The length of the namespace prefix                              */          
*       3 XFC_ENTRY_NSPFX_LEN fixed(31),                                        
*                                                                               
*       3 * char(4),                                                            
*                                                                               
* /*64 bit pointer to namespace prefix                              */          
*       3 XFC_ENTRY_NSPFX_PTR ptr(64),                                          
*                                                                               
*         5 * char(4),                                                          
*                                                                               
* /*31 bit pointer to namespace prefix                              */          
*         5 XFC1_ENTRY_NSPFX_PTR ptr(31),                                       
*                                                                               
* /*The length of the namespace uri                                 */          
*       3 XFC_ENTRY_NSURI_LEN fixed(31),                                        
*                                                                               
*       3 * char(4),                                                            
*                                                                               
* /*64 bit pointer to namespace uri                                 */          
*       3 XFC_ENTRY_NSURI_PTR ptr(64),                                          
*                                                                               
*         5 * char(4),                                                          
*                                                                               
* /*31 bit pointer to namespace uri                                 */          
*         5 XFC1_ENTRY_NSURI_PTR ptr(31);                                       
*                                                                               
*                                                                               
*                                                                               
*/*******************************************************************/          
*/*The fragment context data structure                              */          
*/*******************************************************************/          
* DCL 1 XFC based bdy(dword),                                                   
*                                                                               
* /*Fragment context structure version                              */          
*       3 XFC_VERSION fixed(32),                                                
*                                                                               
* /*Flags reserved for future use                                   */          
*       3 XFC_FLAGS bit(32),                                                    
*                                                                               
* /*The length of the fragment path                                 */          
*       3 XFC_FRAGPATH_LEN fixed(31),                                           
*                                                                               
*       3 * char(4),                                                            
*                                                                               
* /*64 bit pointer to fragment path                                 */          
*       3 XFC_FRAGPATH_PTR ptr(64),                                             
*                                                                               
*         5 * char(4),                                                          
*                                                                               
* /*31 bit pointer to fragment path                                 */          
*         5 XFC1_FRAGPATH_PTR ptr(31),                                          
*                                                                               
* /*64 bit pointer to XD area                                       */          
*       3 XFC_XD_PTR ptr(64),                                                   
*                                                                               
*         5 * char(4),                                                          
*                                                                               
* /*31 bit pointer to XD area                                       */          
*         5 XFC1_XD_PTR ptr(31),                                                
*                                                                               
* /*The number of namespace entries in XFC_ENTRY array              */          
*       3 XFC_ENTRY_NSCOUNT fixed(31),                                          
*                                                                               
*       3 * char(4),                                                            
*                                                                               
* /*64 bit pointer to the first entry of the XFC_ENTRY array        */          
*       3 XFC_ENTRY_NS_PTR ptr(64),                                             
*                                                                               
*         5 * char(4),                                                          
*                                                                               
* /*31 bit pointer to the first entry of the XFC_ENTRY array        */          
*         5 XFC1_ENTRY_NS_PTR ptr(31);                                          
*                                                                               
*                                                                               
*/*******************************************************************/          
*/*Constants                                                        */          
*/*******************************************************************/          
*                                                                               
* DCL  XFC_Version_1 FIXED(32) constant(1);                                     
*                                                                               
*                                                                               
*                                                                               
*/*******************************************************************/          
*/*The document fragment parsing control block.                     */          
*/*******************************************************************/          
* DCL 1 XFP based bdy(dword),                                                   
*                                                                               
* /*Fragment parsing structure version                              */          
*       3 XFP_VERSION fixed(32),                                                
*                                                                               
* /*Flags input area                                                */          
*       3 XFP_FLAGS bit(32),                                                    
*                                                                               
* /*Flags that control the fragment mode                            */          
*         5 XFP_FLAGS_FRAGMENT_MODE bit(1),                                     
*                                                                               
*         5 * bit(31),                                                          
*                                                                               
* /*64 bit pointer to XD area                                       */          
*       3 XFP_XD_PTR ptr(64),                                                   
*                                                                               
*         5 * char(4),                                                          
*                                                                               
* /*31 bit pointer to XD area                                       */          
*         5 XFP1_XD_PTR ptr(31);                                                
*                                                                               
*                                                                               
*/*******************************************************************/          
*/*Constants                                                        */          
*/*******************************************************************/          
*                                                                               
* DCL  XFP_Version_1 FIXED(32) constant(1);                                     
*                                                                               
*                                                                               
*                                                                               
*/*******************************************************************/          
*/*XML Parser Error Handling input output area                      */          
*/*******************************************************************/          
* DCL 1 XERR based bdy(dword),                                                  
*                                                                               
* /*XERR Version                                                    */          
*       3 XERR_VERSION fixed(32),                                               
*                                                                               
* /*XERR operation flags                                            */          
*       3 XERR_FLAGS bit(32),                                                   
*                                                                               
* /*Error Information Flag                                          */          
*         5 XERR_ERROR_INFORMATION bit(1),                                      
*                                                                               
* /*Enhanced Error Information Flag                                 */          
*         5 XERR_ENH_ERROR_INFORMATION bit(1),                                  
*                                                                               
* /*Enhanced Error Location Flag                                    */          
*         5 XERR_ENH_ERROR_LOCATION bit(1),                                     
*                                                                               
* /*Error flag in end element                                       */          
*         5 XERR_FLAG_END_ELEMENT bit(1),                                       
*                                                                               
*         5 * bit(28),                                                          
*                                                                               
* /*XERR Error Toleration feature                                   */          
*       3 XERR_ERROR_TOLERATION bit(32),                                        
*                                                                               
* /*XERR Tolerate Undeclared NameSpace Prefixes                     */          
*         5 XERR_TOL_UNDECL_NS_PREFIX bit(1),                                   
*                                                                               
* /*XERR Tolerate Multiple Root Elements                            */          
*         5 * bit(1),                                                           
*                                                                               
* /*XERR Tolerate Schema Validation Errors                          */          
*         5 * bit(1),                                                           
*                                                                               
* /*XERR Tolerate Duplicate Attributes                              */          
*         5 * bit(1),                                                           
*                                                                               
*         5 * bit(28),                                                          
*                                                                               
*       3 * bit(32),                                                            
*                                                                               
* /*64 bit pointer to XD area                                       */          
*       3 XERR_XD_PTR ptr(64),                                                  
*                                                                               
*         5 * char(4),                                                          
*                                                                               
* /*31 bit pointer to XD area                                       */          
*         5 XERR1_XD_PTR ptr(31);                                               
*                                                                               
*                                                                               
*                                                                               
*/*******************************************************************/          
*/*XML Split Record structure                                       */          
*/*******************************************************************/          
* DCL 1 XSR based bdy(dword),                                                   
*                                                                               
* /*XSR Version                                                     */          
*       3 XSR_VERSION fixed(32),                                                
*                                                                               
* /*XSR threshold. The range is 0~2G. Default is 0.                 */          
*       3 XSR_THRESHOLD fixed(32),                                              
*                                                                               
* /*64 bit pointer to XD area                                       */          
*       3 XSR_XD_PTR ptr(64),                                                   
*                                                                               
*         5 * char(4),                                                          
*                                                                               
* /*31 bit pointer to XD area                                       */          
*         5 XSR1_XD_PTR ptr(31);                                                
*                                                                               
*                                                                               
*/*******************************************************************/          
*/*Constants                                                        */          
*/*******************************************************************/          
*                                                                               
* DCL  XSR_Version_1 FIXED(31) constant(1);                                     
*                                                                               
*                                                                               
*                                                                               
*/*******************************************************************/          
*/*GXLYXFT: Map the control feature area                            */          
*/*******************************************************************/          
* DCL 1 XFT based bdy(dword),                                                   
*                                                                               
* /*Feature flgs input area                                         */          
*       3 XFT_FEAT_FLAGS bit(32),                                               
*                                                                               
* /*alignment                                                       */          
*       3 * fixed(32),                                                          
*                                                                               
* /*Pointer to XD area 64 bit                                       */          
*       3 XFT_XD_PTR ptr(64),                                                   
*                                                                               
*         5 * char(4),                                                          
*                                                                               
* /*31 bit pointer to XD area                                       */          
*         5 XFT1_XD_PTR ptr(31);                                                
*                                                                               
*                                                                               
*/*Max OSR name length                                              */          
*                                                                               
* DCL  XOSR_MAX_OSR_NAME_LEN fixed(32) constant('80'x);                         
*                                                                               
*                                                                               
*                                                                               
*/*******************************************************************/          
*/*GXLYXOSR: Map the optimized schema representation control area   */          
*/*******************************************************************/          
* DCL 1 XOSR based bdy(dword),                                                  
*                                                                               
* /*64 bit pointer to optimized schema representation (OSR)         */          
*       3 XOSR_OSR_PTR ptr(64),                                                 
*                                                                               
*         5 * char(4),                                                          
*                                                                               
* /*31 bit pointer to optimized schema representation (OSR)         */          
*         5 XOSR1_OSR_PTR ptr(31),                                              
*                                                                               
* /*64 bit pointer to OSR name                                      */          
*       3 XOSR_OSR_NAME_PTR ptr(64),                                            
*                                                                               
*         5 * char(4),                                                          
*                                                                               
* /*31 bit pointer to OSR name                                      */          
*         5 XOSR1_OSR_NAME_PTR ptr(31),                                         
*                                                                               
* /*Length of OSR name (128 max)                                    */          
*       3 XOSR_OSR_NAME_LEN fixed(32),                                          
*                                                                               
*       3 * char(4),                                                            
*                                                                               
* /*64 bit pointer to XD area                                       */          
*       3 XOSR_XD_PTR ptr(64),                                                  
*                                                                               
*         5 * char(4),                                                          
*                                                                               
* /*31 bit pointer to XD area                                       */          
*         5 XOSR1_XD_PTR ptr(31);                                               
*                                                                               
*                                                                               
*                                                                               
*/*******************************************************************/          
*/*XML Restricted Root Element Entry                                */          
*/*******************************************************************/          
* DCL 1 XRR_ENTRY based bdy(dword),                                             
*                                                                               
* /*The length of the Root Element name                             */          
*       3 XRR_ENTRY_ROOT_LEN fixed(32),                                         
*                                                                               
*       3 * char(4),                                                            
*                                                                               
* /*Pointer to Root Element name                                    */          
*       3 XRR_ENTRY_ROOT_PTR ptr(64),                                           
*                                                                               
*         5 * char(4),                                                          
*                                                                               
* /*Pointer to Root Element name                                    */          
*         5 XRR1_ENTRY_ROOT_PTR ptr(31),                                        
*                                                                               
* /*The length of the Root Element namespace                        */          
*       3 XRR_ENTRY_NSURI_LEN fixed(32),                                        
*                                                                               
*       3 * char(4),                                                            
*                                                                               
* /*The namespace binding entry                                     */          
*       3 XRR_ENTRY_NSURI_PTR ptr(64),                                          
*                                                                               
*         5 * char(4),                                                          
*                                                                               
* /*Pointer to Root Element namespace                               */          
*         5 XRR1_ENTRY_NSURI_PTR ptr(31);                                       
*                                                                               
*                                                                               
*                                                                               
*/*******************************************************************/          
*/*XML Restricted Root Element Data Structure                       */          
*/*******************************************************************/          
* DCL 1 XRR based bdy(dword),                                                   
*                                                                               
* /*XRR version number                                              */          
*       3 XRR_VERSION fixed(32),                                                
*                                                                               
* /*Flags reserved for future use                                   */          
*       3 XRR_FLAGS fixed(32),                                                  
*                                                                               
* /*The number of Root Element Name entries in XRR_ENTRY            */          
*       3 XRR_ENTRY_COUNT fixed(32),                                            
*                                                                               
*       3 * char(4),                                                            
*                                                                               
* /*64 bit pointer to XD area                                       */          
*       3 XRR_XD_PTR ptr(64),                                                   
*                                                                               
*         5 * char(4),                                                          
*                                                                               
* /*31 bit pointer to XD area                                       */          
*         5 XRR1_XD_PTR ptr(31),                                                
*                                                                               
* /*Pointer to Root Element namespace                               */          
*       3 XRR_ENTRY_PTR ptr(64),                                                
*                                                                               
*         5 * char(4),                                                          
*                                                                               
* /*31 bit pointer to Root Element namespace                        */          
*         5 XRR1_ENTRY_PTR ptr(31);                                             
*                                                                               
*                                                                               
*/*******************************************************************/          
*/*Constants                                                        */          
*/*******************************************************************/          
*                                                                               
* DCL  XRR_Version_1 FIXED(31) constant(1);                                     
*                                                                               
*                                                                               
*%END;                                                                          
*/*                                                                             
                      MACRO                                                     
                      GXLYCTL                                                   
*                                                                               
                      GBLC   &GXLCTLCK                                          
                      AIF    ('&GXLCTLCK' NE '').GXLCTLBL                       
&GXLCTLCK             SETC   'YES'                                              
*                                                                               
**********************************************************************          
* XML Parser Entities and References input output area               *          
**********************************************************************          
XEAR                  DSECT                                                     
* XEAR Version                                                       *          
XEAR_VERSION          DS   F                                                    
* XEAR operation flags                                               *          
XEAR_OP_FLAGS         DS   1CL4  *converted from bit(32)*                       
* Stop on unresolved character                                       *          
XEAR_ENTREF_STOP_UNRESOLVED EQU  B'10000000000000000000000000000000'            
* unrepresentable character reference record                         *          
XEAR_ENTREF_UNREP_CHARREF_REC EQU  B'01000000000000000000000000000000'          
                                                                                
* XEAR replacement character length                                  *          
XEAR_REPLACEMENT_CHAR_LENGTH DS   C                                             
* XEAR replacement character value                                   *          
XEAR_REPLACEMENT_CHAR DS   CL4                                                  
                      DS   CL3                                                  
* Pointer to XD area 64 bit                                          *          
XEAR_XD_PTR           DS   0AD                                                  
                      DS   CL4                                                  
* 31 bit pointer to XD area                                          *          
XEAR1_XD_PTR          DS   A                                                    
* Length of this DSECT                                                          
XEAR#LEN              EQU  *-XEAR                                               
*                                                                               
*                                                                               
**********************************************************************          
* Constants                                                          *          
**********************************************************************          
*                                                                               
XEAR_Version_1  EQU  1                                                          
*                                                                               
*                                                                               
*                                                                               
**********************************************************************          
* This length/value pair mapping is for the namespace prefix         *          
* and uri entry in the fragment parsing table                        *          
**********************************************************************          
XFC_ENTRY             DSECT                                                     
* The length of the namespace prefix                                 *          
XFC_ENTRY_NSPFX_LEN   DS   F                                                    
                      DS   CL4                                                  
* 64 bit pointer to namespace prefix                                 *          
XFC_ENTRY_NSPFX_PTR   DS   0AD                                                  
                      DS   CL4                                                  
* 31 bit pointer to namespace prefix                                 *          
XFC1_ENTRY_NSPFX_PTR  DS   A                                                    
* The length of the namespace uri                                    *          
XFC_ENTRY_NSURI_LEN   DS   F                                                    
                      DS   CL4                                                  
* 64 bit pointer to namespace uri                                    *          
XFC_ENTRY_NSURI_PTR   DS   0AD                                                  
                      DS   CL4                                                  
* 31 bit pointer to namespace uri                                    *          
XFC1_ENTRY_NSURI_PTR  DS   A                                                    
* Length of this DSECT                                                          
XFC_ENTRY#LEN         EQU  *-XFC_ENTRY                                          
*                                                                               
*                                                                               
*                                                                               
**********************************************************************          
* The fragment context data structure                                *          
**********************************************************************          
XFC                   DSECT                                                     
* Fragment context structure version                                 *          
XFC_VERSION           DS   F                                                    
* Flags reserved for future use                                      *          
XFC_FLAGS             DS   CL4  *converted from bit(32)*                        
* The length of the fragment path                                    *          
XFC_FRAGPATH_LEN      DS   F                                                    
                      DS   CL4                                                  
* 64 bit pointer to fragment path                                    *          
XFC_FRAGPATH_PTR      DS   0AD                                                  
                      DS   CL4                                                  
* 31 bit pointer to fragment path                                    *          
XFC1_FRAGPATH_PTR     DS   A                                                    
* 64 bit pointer to XD area                                          *          
XFC_XD_PTR            DS   0AD                                                  
                      DS   CL4                                                  
* 31 bit pointer to XD area                                          *          
XFC1_XD_PTR           DS   A                                                    
* The number of namespace entries in XFC_ENTRY array                 *          
XFC_ENTRY_NSCOUNT     DS   F                                                    
                      DS   CL4                                                  
* 64 bit pointer to the first entry of the XFC_ENTRY array           *          
XFC_ENTRY_NS_PTR      DS   0AD                                                  
                      DS   CL4                                                  
* 31 bit pointer to the first entry of the XFC_ENTRY array           *          
XFC1_ENTRY_NS_PTR     DS   A                                                    
* Length of this DSECT                                                          
XFC#LEN               EQU  *-XFC                                                
*                                                                               
*                                                                               
**********************************************************************          
* Constants                                                          *          
**********************************************************************          
*                                                                               
XFC_Version_1  EQU  1                                                           
*                                                                               
*                                                                               
*                                                                               
**********************************************************************          
* The document fragment parsing control block.                       *          
**********************************************************************          
XFP                   DSECT                                                     
* Fragment parsing structure version                                 *          
XFP_VERSION           DS   F                                                    
* Flags input area                                                   *          
XFP_FLAGS             DS   1CL4  *converted from bit(32)*                       
* Flags that control the fragment mode                               *          
XFP_FLAGS_FRAGMENT_MODE EQU  B'10000000000000000000000000000000'                
                                                                                
* 64 bit pointer to XD area                                          *          
XFP_XD_PTR            DS   0AD                                                  
                      DS   CL4                                                  
* 31 bit pointer to XD area                                          *          
XFP1_XD_PTR           DS   A                                                    
* Length of this DSECT                                                          
XFP#LEN               EQU  *-XFP                                                
*                                                                               
*                                                                               
**********************************************************************          
* Constants                                                          *          
**********************************************************************          
*                                                                               
XFP_Version_1  EQU  1                                                           
*                                                                               
*                                                                               
*                                                                               
**********************************************************************          
* XML Parser Error Handling input output area                        *          
**********************************************************************          
XERR                  DSECT                                                     
* XERR Version                                                       *          
XERR_VERSION          DS   F                                                    
* XERR operation flags                                               *          
XERR_FLAGS            DS   1CL4  *converted from bit(32)*                       
* Error Information Flag                                             *          
XERR_ERROR_INFORMATION EQU  B'10000000000000000000000000000000'                 
* Enhanced Error Information Flag                                    *          
XERR_ENH_ERROR_INFORMATION EQU  B'01000000000000000000000000000000'             
* Enhanced Error Location Flag                                       *          
XERR_ENH_ERROR_LOCATION EQU  B'00100000000000000000000000000000'                
* Error flag in end element                                          *          
XERR_FLAG_END_ELEMENT EQU  B'00010000000000000000000000000000'                  
                                                                                
* XERR Error Toleration feature                                      *          
XERR_ERROR_TOLERATION DS   1CL4  *converted from bit(32)*                       
* XERR Tolerate Undeclared NameSpace Prefixes                        *          
XERR_TOL_UNDECL_NS_PREFIX EQU  B'10000000000000000000000000000000'              
* XERR Tolerate Multiple Root Elements                               *          
                                                                                
* XERR Tolerate Schema Validation Errors                             *          
                                                                                
* XERR Tolerate Duplicate Attributes                                 *          
                                                                                
                                                                                
                      DS   CL4  *converted from bit(32)*                        
* 64 bit pointer to XD area                                          *          
XERR_XD_PTR           DS   0AD                                                  
                      DS   CL4                                                  
* 31 bit pointer to XD area                                          *          
XERR1_XD_PTR          DS   A                                                    
* Length of this DSECT                                                          
XERR#LEN              EQU  *-XERR                                               
*                                                                               
*                                                                               
*                                                                               
**********************************************************************          
* XML Split Record structure                                         *          
**********************************************************************          
XSR                   DSECT                                                     
* XSR Version                                                        *          
XSR_VERSION           DS   F                                                    
* XSR threshold. The range is 0~2G. Default is 0.                    *          
XSR_THRESHOLD         DS   F                                                    
* 64 bit pointer to XD area                                          *          
XSR_XD_PTR            DS   0AD                                                  
                      DS   CL4                                                  
* 31 bit pointer to XD area                                          *          
XSR1_XD_PTR           DS   A                                                    
* Length of this DSECT                                                          
XSR#LEN               EQU  *-XSR                                                
*                                                                               
*                                                                               
**********************************************************************          
* Constants                                                          *          
**********************************************************************          
*                                                                               
XSR_Version_1  EQU  1                                                           
*                                                                               
*                                                                               
*                                                                               
**********************************************************************          
* GXLYXFT: Map the control feature area                              *          
**********************************************************************          
XFT                   DSECT                                                     
* Feature flgs input area                                            *          
XFT_FEAT_FLAGS        DS   CL4  *converted from bit(32)*                        
* alignment                                                          *          
                      DS   F                                                    
* Pointer to XD area 64 bit                                          *          
XFT_XD_PTR            DS   0AD                                                  
                      DS   CL4                                                  
* 31 bit pointer to XD area                                          *          
XFT1_XD_PTR           DS   A                                                    
* Length of this DSECT                                                          
XFT#LEN               EQU  *-XFT                                                
*                                                                               
*                                                                               
* Max OSR name length                                                *          
*                                                                               
XOSR_MAX_OSR_NAME_LEN  EQU  X'80'                                               
*                                                                               
*                                                                               
*                                                                               
**********************************************************************          
* GXLYXOSR: Map the optimized schema representation control area     *          
**********************************************************************          
XOSR                  DSECT                                                     
* 64 bit pointer to optimized schema representation (OSR)            *          
XOSR_OSR_PTR          DS   0AD                                                  
                      DS   CL4                                                  
* 31 bit pointer to optimized schema representation (OSR)            *          
XOSR1_OSR_PTR         DS   A                                                    
* 64 bit pointer to OSR name                                         *          
XOSR_OSR_NAME_PTR     DS   0AD                                                  
                      DS   CL4                                                  
* 31 bit pointer to OSR name                                         *          
XOSR1_OSR_NAME_PTR    DS   A                                                    
* Length of OSR name (128 max)                                       *          
XOSR_OSR_NAME_LEN     DS   F                                                    
                      DS   CL4                                                  
* 64 bit pointer to XD area                                          *          
XOSR_XD_PTR           DS   0AD                                                  
                      DS   CL4                                                  
* 31 bit pointer to XD area                                          *          
XOSR1_XD_PTR          DS   A                                                    
* Length of this DSECT                                                          
XOSR#LEN              EQU  *-XOSR                                               
*                                                                               
*                                                                               
*                                                                               
**********************************************************************          
* XML Restricted Root Element Entry                                  *          
**********************************************************************          
XRR_ENTRY             DSECT                                                     
* The length of the Root Element name                                *          
XRR_ENTRY_ROOT_LEN    DS   F                                                    
                      DS   CL4                                                  
* Pointer to Root Element name                                       *          
XRR_ENTRY_ROOT_PTR    DS   0AD                                                  
                      DS   CL4                                                  
* Pointer to Root Element name                                       *          
XRR1_ENTRY_ROOT_PTR   DS   A                                                    
* The length of the Root Element namespace                           *          
XRR_ENTRY_NSURI_LEN   DS   F                                                    
                      DS   CL4                                                  
* The namespace binding entry                                        *          
XRR_ENTRY_NSURI_PTR   DS   0AD                                                  
                      DS   CL4                                                  
* Pointer to Root Element namespace                                  *          
XRR1_ENTRY_NSURI_PTR  DS   A                                                    
* Length of this DSECT                                                          
XRR_ENTRY#LEN         EQU  *-XRR_ENTRY                                          
*                                                                               
*                                                                               
*                                                                               
**********************************************************************          
* XML Restricted Root Element Data Structure                         *          
**********************************************************************          
XRR                   DSECT                                                     
* XRR version number                                                 *          
XRR_VERSION           DS   F                                                    
* Flags reserved for future use                                      *          
XRR_FLAGS             DS   F                                                    
* The number of Root Element Name entries in XRR_ENTRY               *          
XRR_ENTRY_COUNT       DS   F                                                    
                      DS   CL4                                                  
* 64 bit pointer to XD area                                          *          
XRR_XD_PTR            DS   0AD                                                  
                      DS   CL4                                                  
* 31 bit pointer to XD area                                          *          
XRR1_XD_PTR           DS   A                                                    
* Pointer to Root Element namespace                                  *          
XRR_ENTRY_PTR         DS   0AD                                                  
                      DS   CL4                                                  
* 31 bit pointer to Root Element namespace                           *          
XRR1_ENTRY_PTR        DS   A                                                    
* Length of this DSECT                                                          
XRR#LEN               EQU  *-XRR                                                
*                                                                               
*                                                                               
**********************************************************************          
* Constants                                                          *          
**********************************************************************          
*                                                                               
XRR_Version_1  EQU  1                                                           
*                                                                               
*                                                                               
.GXLCTLBL             ANOP                                                      
                      MEXIT                                                     
                      MEND                                                      
**/                                                                             
