*/** START OF SPECIFICATIONS *****************************************          
*                                                                    *          
* *****PROPRIETARY_STATEMENT******************************************          
* **01* PROPRIETARY STATEMENT=                                       *          
*                                                                    *          
*                                                                    *          
*  LICENSED MATERIALS - PROPERTY OF IBM                              *          
*  5694-A01 COPYRIGHT IBM CORP. 2006, 2007                           *          
*                                                                    *          
*                                                                    *          
*  STATUS= HBB7740                                                   *          
*                                                                    *          
* ****END_OF_PROPRIETARY_STATEMENT************************************          
*                                                                    *          
* 01* DESCRIPTIVE NAME: XML Parser Diagnostic Area                   *          
* 02* ACRONYM: XD                                                    *          
*                                                                    *          
* 01* MACRO NAME: GXLYXD                                             *          
*                                                                    *          
* 01* EXTERNAL CLASSIFICATION: PI                                    *          
* 01* END OF EXTERNAL CLASSIFICATION:                                *          
*                                                                    *          
* 01* DSECT NAME: N/A                                                *          
*                                                                    *          
* 01* COMPONENT: z/OS XML Parser (SCXML)                             *          
*                                                                    *          
* 01* EYE-CATCHER: N/A                                               *          
*                                                                    *          
* 01* STORAGE ATTRIBUTES:                                            *          
* 02* SUBPOOL: N/A                                                   *          
* 02* KEY: N/A                                                       *          
* 02* RESIDENCY: N/A                                                 *          
*                                                                    *          
* 01* SIZE: N/A                                                      *          
*                                                                    *          
* 01* CREATED BY: N/A                                                *          
*                                                                    *          
* 01* POINTED TO BY: N/A                                             *          
*                                                                    *          
* 01* SERIALIZATION: None                                            *          
*                                                                    *          
* 01* FUNCTION:                                                      *          
*  z/OS XML mapping of the system service vector                     *          
*                                                                    *          
*                                                                    *          
* 01* METHOD OF ACCESS:                                              *          
* 02* ASM:                                                           *          
* 02* PL/AS: %INCLUDE SYSLIB(GXLYXD)                                 *          
*                                                                    *          
* 01* DELETED BY: N/A                                                *          
*                                                                    *          
* 01* FREQUENCY: N/A                                                 *          
*                                                                    *          
* 01* DEPENDENCIES: None                                             *          
*                                                                    *          
* 01* NOTES:                                                         *          
*  The GXLYXD file is generated.                                     *          
*                                                                    *          
*                                                                    *          
* 01* DISTRIBUTION LIBRARY: AMACLIB                                  *          
*                                                                    *          
* 01* CHANGE ACTIVITY:                                               *          
*   $L0=HZZ ,HBB7730,040930,PDXX: PLX XML Parser first release       *          
*   $P1=ME06040,HBB7730,060307,PDTH: classification prolog update    *          
*                                                                    *          
**** END OF SPECIFICATIONS ******************************************/          
*                                                                               
* DCL 1 XD based bdy(dword),                                                    
*                                                                               
*       3 * ,                                                                   
*                                                                               
* /*eye catcher                                                     */          
*         5 XD_EyeCatcher char(8),                                              
*                                                                               
* /*XD version number                                               */          
*         5 XD_Version fixed(31),                                               
*                                                                               
* /*Boundary alignment                                              */          
*         5 * fixed(31),                                                        
*                                                                               
* /*Addr of PAB used to tie this XD to the right parse data         */          
*         5 XD_PAB ptr(64),                                                     
*                                                                               
*           7 * char(4),                                                        
*                                                                               
* /*Back ptr to anchor block                                        */          
*           7 XD1_PAB ptr(31),                                                  
*                                                                               
* /*Used to clear the XD in PRS following a CTL RESET               */          
*       3 XD_Clear ,                                                            
*                                                                               
* /*Addr current input buffer                                       */          
*         5 XD_InBuff ptr(64),                                                  
*                                                                               
*           7 * char(4),                                                        
*                                                                               
* /*Addr current input buffer                                       */          
*           7 XD1_InBuff ptr(31),                                               
*                                                                               
* /*Offset into input buffer where the parser stopped               */          
*         5 XD_InBuffOffset fixed(64),                                          
*                                                                               
*           7 * char(4),                                                        
*                                                                               
* /*Offset into input buffer                                        */          
*           7 XD1_InBuffOffset fixed(32),                                       
*                                                                               
* /*Addr current output buffer                                      */          
*         5 XD_OutBuff ptr(64),                                                 
*                                                                               
*           7 * char(4),                                                        
*                                                                               
* /*Addr current output buffer                                      */          
*           7 XD1_OutBuff ptr(31),                                              
*                                                                               
* /*Offset into output buf where last valid entry can found         */          
*         5 XD_OutBuffOffset fixed(64),                                         
*                                                                               
*           7 * char(4),                                                        
*                                                                               
* /*Offset into output buffer                                       */          
*           7 XD1_OutBuffOffset fixed(32),                                      
*                                                                               
* /*Amount of storage that requested for request that failed        */          
*         5 XD_StorageRequested fixed(64),                                      
*                                                                               
*           7 * char(4),                                                        
*                                                                               
*           7 XD1_StorageRequested fixed(32),                                   
*                                                                               
* /*Last RC from PRS                                                */          
*         5 XD_LastRC fixed(31),                                                
*                                                                               
* /*Last RSN from PRS                                               */          
*         5 XD_LastRsn fixed(31),                                               
*                                                                               
* /*RC from storage obtain                                          */          
*         5 XD_StorageRC fixed(31),                                             
*                                                                               
* /*RSN from storage obtain                                         */          
*         5 XD_StorageRsn fixed(31),                                            
*                                                                               
* /*RC from IARV64 getstor                                          */          
*         5 XD_Iarv64Rc fixed(31),                                              
*                                                                               
* /*RSN from IARV64 getstor                                         */          
*         5 XD_Iarv64RSN fixed(31),                                             
*                                                                               
* /*RC from storage exit                                            */          
*         5 XD_StorExitRc fixed(32),                                            
*                                                                               
* /*RSN from storage exit                                           */          
*         5 XD_StorExitRsn fixed(32),                                           
*                                                                               
* /*Diag code from storage exit                                     */          
*         5 XD_StorExitDiag fixed(32),                                          
*                                                                               
* /*RC from symbol exit                                             */          
*         5 XD_SymExitRc fixed(32),                                             
*                                                                               
* /*Diag code from symbol exit                                      */          
*         5 XD_SymExitDiag fixed(32),                                           
*                                                                               
* /*Length of symbol which was rejected by user symbol exit         */          
*         5 XD_SymbolLength fixed(32),                                          
*                                                                               
* /*Return code from attempt to switch to running IFA               */          
*         5 XD_IFA_RC fixed(32),                                                
*                                                                               
* /*Return code from a finished parse                               */          
*         5 XD_EndOfDocRC fixed(32),                                            
*                                                                               
* /*Reason code from a finished parse                               */          
*         5 XD_EndOfDocRSN fixed(32),                                           
*                                                                               
* /*Boundary alignment                                              */          
*         5 * fixed(32),                                                        
*                                                                               
* /*Error count that has been tolerated                             */          
*         5 XD_TolErrCount fixed(32),                                           
*                                                                               
* /*Minimum output buffer size required on next prs call            */          
*         5 XD_MIN_OB fixed(32),                                                
*                                                                               
* /*Addr for the last output buffer                                 */          
*         5 XD_LastOutput ptr(64),                                              
*                                                                               
*           7 * char(4),                                                        
*                                                                               
* /*Addr for the last output buffer                                 */          
*           7 XD1_LastOutput ptr(31),                                           
*                                                                               
* /*Reserved - keep dword align                                     */          
*         5 XD_Rsv char(24),                                                    
*                                                                               
* /*Dyn area follows and requires dword boundry                     */          
*         5 XD_End char(0) bdy(dword);                                          
*                                                                               
*                                                                               
*/*******************************************************************/          
*/*Constants                                                        */          
*/*******************************************************************/          
*                                                                               
* DCL  XD_EyeCatcher_Constant char(8) constant("GXLYXD  ");                     
*                                                                               
*                                                                               
*                                                                               
* DCL  XD_Current_Version FIXED(31) constant(3),                                
*                                                                               
*      XD_Version_1 FIXED(31) constant(1);                                      
*                                                                               
*                                                                               
*/*                                                                             
                      MACRO                                                     
                      GXLYXD                                                    
*                                                                               
XD                    DSECT                                                     
* eye catcher                                                        *          
XD_EyeCatcher         DS   CL8                                                  
* XD version number                                                  *          
XD_Version            DS   F                                                    
* Boundary alignment                                                 *          
                      DS   F                                                    
* Addr of PAB used to tie this XD to the right parse data            *          
XD_PAB                DS   0AD                                                  
                      DS   CL4                                                  
* Back ptr to anchor block                                           *          
XD1_PAB               DS   A                                                    
* Used to clear the XD in PRS following a CTL RESET                  *          
XD_Clear              DS   0CL144                                               
* Addr current input buffer                                          *          
XD_InBuff             DS   0AD                                                  
                      DS   CL4                                                  
* Addr current input buffer                                          *          
XD1_InBuff            DS   A                                                    
* Offset into input buffer where the parser stopped                  *          
XD_InBuffOffset       DS   0D                                                   
                      DS   CL4                                                  
* Offset into input buffer                                           *          
XD1_InBuffOffset      DS   F                                                    
* Addr current output buffer                                         *          
XD_OutBuff            DS   0AD                                                  
                      DS   CL4                                                  
* Addr current output buffer                                         *          
XD1_OutBuff           DS   A                                                    
* Offset into output buf where last valid entry can found            *          
XD_OutBuffOffset      DS   0D                                                   
                      DS   CL4                                                  
* Offset into output buffer                                          *          
XD1_OutBuffOffset     DS   F                                                    
* Amount of storage that requested for request that failed           *          
XD_StorageRequested   DS   0D                                                   
                      DS   CL4                                                  
XD1_StorageRequested  DS   F                                                    
* Last RC from PRS                                                   *          
XD_LastRC             DS   F                                                    
* Last RSN from PRS                                                  *          
XD_LastRsn            DS   F                                                    
* RC from storage obtain                                             *          
XD_StorageRC          DS   F                                                    
* RSN from storage obtain                                            *          
XD_StorageRsn         DS   F                                                    
* RC from IARV64 getstor                                             *          
XD_Iarv64Rc           DS   F                                                    
* RSN from IARV64 getstor                                            *          
XD_Iarv64RSN          DS   F                                                    
* RC from storage exit                                               *          
XD_StorExitRc         DS   F                                                    
* RSN from storage exit                                              *          
XD_StorExitRsn        DS   F                                                    
* Diag code from storage exit                                        *          
XD_StorExitDiag       DS   F                                                    
* RC from symbol exit                                                *          
XD_SymExitRc          DS   F                                                    
* Diag code from symbol exit                                         *          
XD_SymExitDiag        DS   F                                                    
* Length of symbol which was rejected by user symbol exit            *          
XD_SymbolLength       DS   F                                                    
* Return code from attempt to switch to running IFA                  *          
XD_IFA_RC             DS   F                                                    
* Return code from a finished parse                                  *          
XD_EndOfDocRC         DS   F                                                    
* Reason code from a finished parse                                  *          
XD_EndOfDocRSN        DS   F                                                    
* Boundary alignment                                                 *          
                      DS   F                                                    
* Error count that has been tolerated                                *          
XD_TolErrCount        DS   F                                                    
* Minimum output buffer size required on next prs call               *          
XD_MIN_OB             DS   F                                                    
* Addr for the last output buffer                                    *          
XD_LastOutput         DS   0AD                                                  
                      DS   CL4                                                  
* Addr for the last output buffer                                    *          
XD1_LastOutput        DS   A                                                    
* Reserved - keep dword align                                        *          
XD_Rsv                DS   CL24                                                 
* Dyn area follows and requires dword boundry                        *          
XD_End                DS   0C                                                   
* Length of this DSECT                                                          
XD#LEN                EQU  *-XD                                                 
*                                                                               
*                                                                               
**********************************************************************          
* Constants                                                          *          
**********************************************************************          
*                                                                               
*                                                                               
*                                                                               
XD_Current_Version  EQU  3                                                      
*                                                                               
XD_Version_1  EQU  1                                                            
*                                                                               
*                                                                               
                      MEND                                                      
**/                                                                             
