*                                                                       00001000
* %DCL HISYSMFR_INCLUDED CHAR EXT;                                      00002000
* %DEACTIVATE HISYSMFR_INCLUDED;                                        00003000
* %IF HISYSMFR_INCLUDED = '' %THEN                                      00004000
* %DO;                                                                  00005000
*/* Macro made bi-lingual on 19035. CBGEN compile date 15295         */ 00006000
*% /*                                                                   00007000
         MACRO                                                          00008000
         HISYSMFR &DSECT=YES,&LIST=YES,&TITLE=YES,&SMFR113=YES,        *00009000
               &SMF113SDS=COND,&SMF113SSS=COND,&SMF113ID=COND,         *00010000
               &SMF113_1_CTR=COND,&SMF113_1_CSS=COND,                  *00011000
               &SMF113_1_SCDS=COND,&SMF113_1_LCDS=COND,                *00012000
               &SMF113_2_CTR=COND,&SMF113_2_CSS=COND,                  *00013000
               &SMF113_2_CDS=COND                                       00014000
         GBLC  &HISYSMFR_INCLUDED                                       00015000
         GBLC  &ZCBPRINT                                                00016000
&HISYSMFR_INCLUDED SETC 'YES'                                           00017000
         AIF   ('&LIST' EQ 'NONE').P0                                   00018000
         AIF   ('&TITLE' EQ 'NO').P5                                    00019000
 TITLE   'HISYSMFR  - SMF Record format for record type 113           '*00020000
                                                                        00021000
.P5      ANOP                                                           00022000
**/ HISYSMFR_1:;                                                        00023000
*/****START OF SPECIFICATIONS****************************************** 00024000
*                                                                       00025000
*    $MAC (HISYSMFR) COMP(SCHIS) PROD(HIS):                             00026000
*                                                                       00027000
*01* MACRO NAME: HISYSMFR                                               00028000
*                                                                       00029000
*01* DSECT NAME: SMFR113                                                00030000
*                                                                       00031000
*01* DESCRIPTIVE NAME: SMF Record format for record type 113            00032000
*                                                                       00033000
*02*   ACRONYM: SMFR                                                    00034000
**/                                                                     00035000
*/*01* PROPRIETARY STATEMENT=                                        */ 00036000
*/***PROPRIETARY_STATEMENT********************************************/ 00037000
*/*                                                                  */ 00038000
*/*                                                                  */ 00039000
*/* LICENSED MATERIALS - PROPERTY OF IBM                             */ 00040000
*/* 5650-ZOS COPYRIGHT IBM CORP. 2007, 2019                          */ 00041000
*/*                                                                  */ 00042000
*/* STATUS= HBB77C0                                                  */ 00043000
*/*                                                                  */ 00044000
*/***END_OF_PROPRIETARY_STATEMENT*************************************/ 00045000
*/*                                                                     00046000
*                                                                       00047000
*01* EXTERNAL CLASSIFICATION:  GUPI                                     00048000
*01* END OF EXTERNAL CLASSIFICATION:                                    00049000
*                                                                       00050000
*01* FUNCTION:                                                          00051000
*                                                                       00052000
*      The SMFR113 maps the structure of SMF (System Management         00053000
*      Facilities) record type 113 and its subtypes.                    00054000
*                                                                       00055000
*      The following subtypes are currently defined:                    00056000
*                                                                       00057000
*      . Subtype 1 -- data record containing the content of             00058000
*        event counter deltas.                                          00059000
*        When event counters are being collected,                       00060000
*        Subtype 1 records are created at specified intervals           00061000
*        during the Hardware Instrumentation Services run,              00062000
*        as well as when the HIS data collection activity               00063000
*        ends. Note the meaning of z/OS counters are for                00064000
*        IBM use only.                                                  00065000
*                                                                       00066000
*      . Subtype 2 -- data record containing the content of             00067000
*        specified hardware event counters.                             00068000
*        Subtype 2 records are created at the beginning of the          00069000
*        Hardware Instrumentation Services run, and at                  00070000
*        specified intervals until the HIS data collection              00071000
*        activity ends, at which time the final subtype 2               00072000
*        record(s) are written. Note only Basic, Problem,               00073000
*        Crypto, and Extended counters are collected in the             00074000
*        Subtype 2 record.                                              00075000
*                                                                       00076000
*                                                                       00077000
*01* METHOD OF ACCESS:                                                  00078000
*                                                                       00079000
*02*   PL/X:                                                            00080000
*                                                                       00081000
*        %INCLUDE SYSLIB(HISYSMFR)                                      00082000
*        By default, the SMFR113 is based on SMF113PTR. If              00083000
*        other basing is desired, use %SMFRBASE='BASED(XXXXXX)'.        00084000
*        If %SMFRBASE='BASED(SMF113PTR)' is coded, a declare for        00085000
*        SMF113PTR is also generated.                                   00086000
*                                                                       00087000
*01* SIZE:                                                              00088000
*            SMFR113       -- X'001C' bytes                             00089000
*            SMF113SDS     -- X'0018' bytes                             00090000
*            SMF113SSS     -- X'0014' bytes                             00091000
*            SMF113ID      -- X'0030' bytes                             00092000
*            SMF113_1_CTR  -- X'004E' bytes                             00093000
*            SMF113_1_CSS  -- X'000C' bytes                             00094000
*            SMF113_1_SCDS -- X'0004' bytes                             00095000
*            SMF113_1_LCDS -- X'0008' bytes                             00096000
*            SMF113_2_CTR  -- X'0054' bytes                             00097000
*            SMF113_2_CSS  -- X'000C' bytes                             00098000
*            SMF113_2_CDS  -- X'0008' bytes                             00099000
*                                                                       00100000
*01* POINTED TO BY: SMF113PTR                                           00101000
*                                                                       00102000
*01* CREATED BY:                                                        00103000
*             Hardware Instrumentation Services - HISPSMF               00104000
*                                                                       00105000
*01* DELETED BY: Caller of SMFEWTM                                      00106000
*                                                                       00107000
*01* STORAGE ATTRIBUTES:                                                00108000
*02*   SUBPOOL:            N/A                                          00109000
*02*   KEY:                N/A                                          00110000
*02*   RESIDENCY:          N/A                                          00111000
*                                                                       00112000
*01* FREQUENCY: 1 per call to SMFEWTM                                   00113000
*                                                                       00114000
*01* SERIALIZATION: N/A                                                 00115000
*                                                                       00116000
*01* DEPENDENCIES: None                                                 00117000
*                                                                       00118000
*01* NOTES:  The assembly language portion of this macro is             00119000
*            generated using the CBGEN tool - it is not                 00120000
*            to be edited manually.                                     00121000
*                                                                       00122000
*    IBM recommends products process SMF 113 subtype 1             @03A 00123000
*    records when available because that is where future           @03A 00124000
*    enhancements will be made.  If subtype 1 records are not      @03A 00125000
*    available, but subtype 2 records are available,               @03A 00126000
*    products may process the subtype 2 records.                   @03A 00127000
*                                                                       00128000
*    SMF 113 records have the following header/self-defining            00129000
*    structure                                                          00130000
*                                                                       00131000
*    <Standard type 113 record header -- x'1C' bytes>                   00132000
*      ...                                                              00133000
*    <Self-defining section>:                                           00134000
*      Offset to subsystem section (from beginning of record)           00135000
*      Length of subsystem section                                      00136000
*      Number of subsystem sections                                     00137000
*      Offset to identification section (from beginning of record)      00138000
*      Length of identification section                                 00139000
*      Number of identification sections                                00140000
*      Offset to data section (from beginning of record)                00141000
*      Length of data section                                           00142000
*      Number of data sections                                          00143000
*    <Subsystem section>:                                               00144000
*      Record version number                                            00145000
*      Product name                                                     00146000
*      MVS product level                                                00147000
*    <Identification section>:                                          00148000
*      Job name                                                         00149000
*      Reader start time                                                00150000
*      Reader start date                                                00151000
*      Step name                                                        00152000
*      Interval start time                                              00153000
*      Interval end time                                                00154000
*                                                                       00155000
*                                                                       00156000
*    The subtype 1 record has the following structure:                  00157000
*                                                                       00158000
*    <Header for data section>:                                         00159000
*      TOD SMF started                                                  00160000
*      TOD SMF written                                                  00161000
*      CPU #                                                            00162000
*      Flags                                                            00163000
*      CPU Proc class                                                   00164000
*      Counter zero version number                                      00165000
*      Counter first version number                                     00166000
*      Counter second version number                                    00167000
*    <CPU Information section>:                                         00168000
*      CPU Speed                                                        00169000
*      Machine Type                                                     00170000
*      Machine Model                                                    00171000
*    <Counter Self-defining section>:                                   00172000
*      Offset of counter set section                                    00173000
*      Length of counter set section                                    00174000
*      Number of counter set sections                                   00175000
*                                                                       00176000
*    <Counter set section 1>:                                           00177000
*      Offset of counter section   <--- Offset to ctr data section 1    00178000
*      Length of counter section                                        00179000
*      Number of counter sections  <--- This is "n"                     00180000
*    <Counter set section 2>:                                           00181000
*      Offset of counter section   <--- Offset to ctr data section n+1  00182000
*      Length of counter section                                        00183000
*      Number of counter sections  <--- This is "m"                     00184000
*                                                                       00185000
*    <Counter data section 1>:                                          00186000
*      Counter data delta                                               00187000
*    <Counter data section 2>:                                          00188000
*      Counter data delta                                               00189000
*    ....                                                               00190000
*    <Counter data section n>:                                          00191000
*      Counter data delta                                               00192000
*    <Counter data section n+1>:                                        00193000
*      Counter data delta                                               00194000
*    ....                                                               00195000
*    <Counter data section n+m>:                                        00196000
*      Counter data delta                                               00197000
*                                                                       00198000
*                                                                       00199000
*    The subtype 2 record has the following structure:                  00200000
*                                                                       00201000
*    <Header for data section>:                                         00202000
*      TOD SMF started                                                  00203000
*      TOD SMF written                                                  00204000
*      CPU #                                                            00205000
*      Flags                                                            00206000
*      Counter first version number                                     00207000
*      Counter second version number                                    00208000
*    <Counter Self-defining section>:                                   00209000
*      Offset of counter set section                                    00210000
*      Length of counter set section                                    00211000
*      Number of counter set section     <--- assume 2 countersets      00212000
*      Offset of counter data                                           00213000
*      Length of counter data       <---This is 8 (size of a counter)   00214000
*      Number of counter data       <---This is "n+m" (see below)       00215000
*    <CPU Information section>:                                         00216000
*      CPU Speed                                                        00217000
*      Machine Type                                                     00218000
*      Machine Model                                                    00219000
*                                                                       00220000
*    <Counter set section 1>:                                           00221000
*      counterset type ("Basic")                                        00222000
*      Bit map pattern identifying the counters being recorded          00223000
*      # of counters in the counter set  <--- This is "n"               00224000
*                                                                       00225000
*    <Counter set section 2>:                                           00226000
*      counterset type ("Prob")                                         00227000
*      Bit map pattern identifying the counters being recorded          00228000
*      # of counters in the counter set  <--- This is "m"               00229000
*                                                                       00230000
*    <Counter data section 1>                                           00231000
*      Counter data                                                     00232000
*    <Counter data section 2>                                           00233000
*      Counter data                                                     00234000
*        ...                                                            00235000
*    <Counter data section n>                                           00236000
*      Counter data                                                     00237000
*        ...                                                            00238000
*    <Counter data section n+m>                                         00239000
*      Counter data                                                     00240000
*                                                                       00241000
*    Note: Counter data section 1-n is tied to the first counter set,   00242000
*          counter data section n+1 - n+m to the second counter set,    00243000
*          etc.                                                         00244000
*                                                                       00245000
*01* COMPONENT: HIS (SCHIS)                                             00246000
*                                                                       00247000
*01* DISTRIBUTION LIBRARY:  AMACLIB                                     00248000
*                                                                       00249000
*01* EYE-CATCHER: none                                                  00250000
*                                                                       00251000
*01* CHANGE-ACTIVITY:                                                   00252000
*                                                                       00253000
* $L0=HISCTR  HBB7740 060925 PDJI: Hardware instrumentation (B117.00)   00254000
* $P1=ME08524 HBB7740 061117 PDJI: Update copyright statement           00255000
* $L1=HISSAMP HBB7750 070628 PDJI: Hardware instrumentation (B378.00)   00256000
* $01=OA27623 HBB7730 090109 PDBS: Add CPU Speed                        00257000
* $L2=ME17825 HBB7770 091203 PDBS: Add CPU Proc Class                   00258000
* $L3=ME19358 HBB7780 100719 PDBS: Add Machine Type & Model             00259000
* $L4=HISSERV HBB7790 110120 PDBS: HIS Extendability                    00260000
* $L5=ME21815 HBB7790 110601 PDBS: DATALOSS Enhancements                00261000
* $L6=ME24659 HBB7790 120901 PDXB: SEQCODE                              00262000
* $L7=ME25674 HBB7790 130208 PDKP: Restore SMF113_2_CSP                 00263000
* $L8=ZZSIM2  HBB77A0 130909 PD0AAA: HIS MT-diagnostic counter set      00264000
* $02=OA43366 HBB77A0 131029 PD0AAA: ZZSIM2 rollup                      00265000
* $03=OA47460 HBB77A0 150424 PD00D0: Recommend Subtype 1                00266000
* $L9=zCBP    HBB77C0 180425 PD00NJ: zCBP                               00267000
*                                                                       00268000
****END OF SPECIFICATIONS*********************************************/ 00269000
*% /*                                                                   00270000
.P0      ANOP                                                           00271000
         AIF   ('&ZCBPRINT' EQ 'NO').P1                                 00272000
         AIF   ('&LIST' EQ 'YES').P2                                    00273000
.P1      ANOP                                                           00274000
         PUSH  PRINT                                                    00275000
         PRINT OFF                                                      00276000
.P2      ANOP                                                           00277000
         AIF   ('&SMFR113' EQ 'NO').L0002                               00278000
         AIF   ('&DSECT' EQ 'YES').L0003                                00279000
         AIF   ('&SMFR113' NE 'YES').L0002                              00280000
SMFR113  DS    0D                                                       00281000
         AGO   .L0004                                                   00282000
.L0003   ANOP                                                           00283000
SMFR113  DSECT                                                          00284000
.L0004   ANOP                                                           00285000
SMF113RPS DS   0CL28     Fixed record sections                          00286000
*                                                                       00287000
*                                                                       00288000
*    SMF Record Header Section                                          00289000
*                                                                       00290000
*                                                                       00291000
*                                                                       00292000
SMF113RHD DS   0CL28     Record header section                          00293000
SMF113LEN DS   H         Record length                                  00294000
SMF113SEG DS   H         Segment descriptor                             00295000
SMF113FLG DS   0B        Header flag byte                               00296000
SMF113SSF EQU  X'80'     Bit 0 - Subsys ID after Sys ID                 00297000
SMF113SBT EQU  X'40'     Bit 1 - Subtypes utilized                      00298000
         ORG   SMF113FLG+1                                              00299000
SMF113RTY DS   B         Record type - 113 ('71'x)                      00300000
SMF113TME DS   FL4       Record written time                            00301000
SMF113DTE DS   FL4       Record written date                            00302000
SMF113SID DS   CL4       System identifier                              00303000
SMF113WID DS   CL4       Subsystem identifier                           00304000
SMF113STY DS   H         Record subtype: 1 = Delta event counters 2 =  *00305000
                         Hardware event counters                        00306000
         DS    CL2       Reserved                                       00307000
SMF113SDL DS   H         Length of self-defining section                00308000
SMFR113_LEN EQU *-SMFR113                                               00309000
.L0002   ANOP                                                           00310000
         AIF   ('&SMF113SDS' EQ 'NO').L0005                             00311000
         AIF   ('&DSECT' EQ 'YES').L0006                                00312000
         AIF   ('&SMF113SDS' NE 'YES').L0005                            00313000
.L0006   ANOP                                                           00314000
*                                                                       00315000
*                                                                       00316000
*    Self Defining Section                                              00317000
*                                                                       00318000
*                                                                       00319000
*                                                                       00320000
         AIF   ('&DSECT' EQ 'YES').L0007                                00321000
SMF113SDS DS   0F                                                       00322000
         AGO   .L0008                                                   00323000
.L0007   ANOP                                                           00324000
SMF113SDS DSECT                                                         00325000
.L0008   ANOP                                                           00326000
SMF113SOF DS   F         Offset to subsystem section from beginning of *00327000
                         record                                         00328000
SMF113SLN DS   H         Length of subsystem section                    00329000
SMF113SON DS   H         Number of subsystem sections                   00330000
SMF113IOF DS   F         Offset of identification section from         *00331000
                         beginning of record                            00332000
SMF113ILN DS   H         Length of identification section               00333000
SMF113ION DS   H         Number of identification section               00334000
SMF113DOF DS   F         Offset of data section from beginning of      *00335000
                         record                                         00336000
SMF113DLN DS   H         Length of data section                         00337000
SMF113DON DS   H         Number of data sections                        00338000
SMF113SDS_LEN EQU *-SMF113SDS                                           00339000
.L0005   ANOP                                                           00340000
         AIF   ('&SMF113SSS' EQ 'NO').L0009                             00341000
         AIF   ('&DSECT' EQ 'YES').L000A                                00342000
         AIF   ('&SMF113SSS' NE 'YES').L0009                            00343000
.L000A   ANOP                                                           00344000
*                                                                       00345000
*                                                                       00346000
*    Subsystem Section.                                                 00347000
*                                                                       00348000
*    Its location in the SMF record is calculated by (Address of        00349000
*    SMFR113 record + offset value in SMF113SOF).                       00350000
*                                                                       00351000
*                                                                       00352000
*                                                                       00353000
         AIF   ('&DSECT' EQ 'YES').L000B                                00354000
SMF113SSS DS   0X                                                       00355000
         AGO   .L000C                                                   00356000
.L000B   ANOP                                                           00357000
SMF113SSS DSECT                                                         00358000
.L000C   ANOP                                                           00359000
         DS    CL2       Reserved                                       00360000
SMF113RVN DS   CL2       Record version number                          00361000
SMF113PNM DS   CL8       Product name - HIS                             00362000
SMF113OSL DS   CL8       MVS product level                              00363000
SMF113SSS_LEN EQU *-SMF113SSS                                           00364000
.L0009   ANOP                                                           00365000
         AIF   ('&SMF113ID' EQ 'NO').L000D                              00366000
         AIF   ('&DSECT' EQ 'YES').L000E                                00367000
         AIF   ('&SMF113ID' NE 'YES').L000D                             00368000
.L000E   ANOP                                                           00369000
*                                                                       00370000
*                                                                       00371000
*    Identification Section.                                            00372000
*                                                                       00373000
*    Its location in the SMF record is calculated by (Address of        00374000
*    SMFR113 record + offset value in SMF113IOF).                       00375000
*                                                                       00376000
*                                                                       00377000
*                                                                       00378000
         AIF   ('&DSECT' EQ 'YES').L000F                                00379000
SMF113ID DS    0F                                                       00380000
         AGO   .L0010                                                   00381000
.L000F   ANOP                                                           00382000
SMF113ID DSECT                                                          00383000
.L0010   ANOP                                                           00384000
SMF113JBN DS   CL8       JobName                                        00385000
SMF113RST DS   F         Reader start time                              00386000
SMF113RSD DS   CL4       Reader start date                              00387000
SMF113STP DS   CL8       Step name                                      00388000
SMF113INTERVALSTART DS CL8 The interval start time -- STCK format       00389000
SMF113INTERVALEND DS CL8 The interval end time -- STCK format           00390000
         DS    CL8       Reserved                                       00391000
SMF113ID_LEN EQU *-SMF113ID                                             00392000
.L000D   ANOP                                                           00393000
         AIF   ('&SMF113_1_CTR' EQ 'NO').L0011                          00394000
         AIF   ('&DSECT' EQ 'YES').L0012                                00395000
         AIF   ('&SMF113_1_CTR' NE 'YES').L0011                         00396000
.L0012   ANOP                                                           00397000
*                                                                       00398000
*  ------------------------------------------------------------------   00399000
*                                                                       00400000
*    Data Section for HIS event counters delta (subtype 1).             00401000
*                                                                       00402000
*  ------------------------------------------------------------------   00403000
*                                                                       00404000
*    Subtype 1 records are CPU specific.                                00405000
*    For each SMF recording cycle, there is one subtype 1 record        00406000
*    created for each active CPU.                                       00407000
*                                                                       00408000
*    Its location in the SMF record is calculated by (Address of        00409000
*    SMFR113 record + offset value in SMF113DOF).                       00410000
*                                                                       00411000
*       SMF113_1_CTR                                                    00412000
*    +--------------------+                                             00413000
*    ! SMF113_1_CSOF      !---+                                         00414000
*    ! SMF113_1_CSLN      !   !    <- Is length of SMF113_1_CSS         00415000
*    ! SMF113_1_CSON      !   !    <- Can be 1-5, depending on CTRSET   00416000
*    +--------------------+   !                                         00417000
*       SMF113_1_CSS          !                                         00418000
*    +--------------------+<--+                                         00419000
*    ! SMF113_1_CSType    !        <- Identifies this counter set       00420000
*    ! SMF113_1_CSUseLCDS !        <- In this case, this is off         00421000
*    ! SMF113_1_CDOF      !---+                                         00422000
*    ! SMF113_1_CDLN      !   !    <- Is length of SMF113_1_SCDS        00423000
*    ! SMF113_1_CDON      !   !    <- Is lastctr-firstctr+1             00424000
*    +--------------------+   !                                         00425000
*       SMF113_1_CSS          !                                         00426000
*    +--------------------+   !                                         00427000
*    ! SMF113_1_CSType    !   !    <- Identifies this counter set       00428000
*    ! SMF113_1_CSUseLCDS !   !    <- In this case, this is on          00429000
*    ! SMF113_1_CDOF      !-----+                                       00430000
*    ! SMF113_1_CDLN      !   ! !  <- Is length of SMF113_1_LCDS        00431000
*    ! SMF113_1_CDON      !   ! !  <- Is lastctr-firstctr+1             00432000
*    +--------------------+   ! !                                       00433000
*                             ! !                                       00434000
*    +--------------------+<--! !                                       00435000
*    !  SMF113_1_SCDS     !     !                                       00436000
*    +--------------------+     !                                       00437000
*    !  SMF113_1_SCDS     !     !                                       00438000
*    +--------------------+     !                                       00439000
*                               !                                       00440000
*    +--------------------+<----!                                       00441000
*    !  SMF113_1_LCDS     !                                             00442000
*    +--------------------+                                             00443000
*    !  SMF113_1_LCDS     !                                             00444000
*    +--------------------+                                             00445000
*                                                                       00446000
*    The nth counter data section in a counter set section represents   00447000
*    the counter data for the nth counter in a counter set. If the      00448000
*    nth counter isn't defined, the counter data will be zero.          00449000
*    Counter data is expressed as deltas, the number indicates the      00450000
*    number of times a particular event occurred since the previous     00451000
*    SMF113 interval, or the start of a HIS collection run (whichever   00452000
*    is most recent.                                                    00453000
*                                                                       00454000
*                                                                       00455000
*                                                                       00456000
         AIF   ('&DSECT' EQ 'YES').L0013                                00457000
SMF113_1_CTR DS 0F       Delta Event                                    00458000
         AGO   .L0014                                                   00459000
.L0013   ANOP                                                           00460000
SMF113_1_CTR DSECT       Delta Event                                    00461000
.L0014   ANOP                                                           00462000
SMF113_1_CTS DS BL8      Time when HIS Data collection started -- STCK *00463000
                         format                                         00464000
SMF113_1_CTM DS BL8      Time when this SMF record is written -- STCK  *00465000
                         format                                         00466000
SMF113_1_CPUID DS H      Processor ID for which the hardware event     *00467000
                         counters are recorded. Note that zero is a    *00468000
                         valid processor number.                        00469000
SMF113_1_CPUPROCCLASS DS X The processor type for which the hardware   *00470000
                         event counters are recorded. Will be one of   *00471000
                         the following: 0 = Standard CP 2 = zCBP or    *00472000
                         zAAP see SMF113_1_zCBP 4 = zIIP                00473000
         DS    CL1                                                      00474000
SMF113_1_CPUSPEED DS F   Processor speed for which the event counters  *00475000
                         are recorded. Speed is in cycles/microsecond.  00476000
SMF113_1_MACHTYPE DS CL4 The machine type                               00477000
SMF113_1_MACHMODEL DS CL16 The machine model                            00478000
SMF113_1_CTRVERSION0 DS H Zero counter version number. This number is  *00479000
                         incremented when there is a change to the     *00480000
                         meaning of a counter in the z/OS counter set   00481000
SMF113_1_CTRVERSION1 DS H First counter version number. This number is *00482000
                         incremented when there is a change to the     *00483000
                         meaning of a counter or the number of         *00484000
                         installed counters in the Basic or            *00485000
                         Problem-state counter sets                     00486000
SMF113_1_CTRVERSION2 DS H Second counter version number. This number   *00487000
                         is incremented when there is a change to the  *00488000
                         meaning of a counter or the number of         *00489000
                         installed counters in the Crypto-activity,    *00490000
                         Extended or MT-diagnostic counters             00491000
SMF113_1_FLAGS DS 0CL2                                                  00492000
SMF113_1_LOSTCTRDATA EQU X'80' When ON, the hardware indicated the     *00493000
                         hardware has lost counter data during the     *00494000
                         current interval                               00495000
SMF113_1_LOSTDATA EQU X'80'                                             00496000
SMF113_1_LOSTMTDATA EQU X'40' When ON, the hardware indicated the      *00497000
                         hardware has lost MT counter data during the  *00498000
                         current interval                               00499000
SMF113_1_ZCBP EQU X'20'  When ON, a value of 2 for                     *00500000
                         SMF113_1_CpuProcClass refers to a zCBP        *00501000
                         processor type, when off a zAAP processor     *00502000
                         type.                                          00503000
         ORG   SMF113_1_FLAGS+2                                         00504000
SMF113_1_CSOF DS F       Offset to counter set section from beginning  *00505000
                         of record                                      00506000
SMF113_1_CSLN DS H       Length of counter set section                  00507000
SMF113_1_CSON DS H       Number of counter set sections                 00508000
SMF113_1_MACHSEQCODE DS CL16 The machine sequence code                  00509000
SMF113_1_COREID DS H     Core ID for which the hardware event counters *00510000
                         are recorded. Note that zero is a valid core  *00511000
                         ID number.                                     00512000
SMF113_1_CTR_LEN EQU *-SMF113_1_CTR                                     00513000
.L0011   ANOP                                                           00514000
         AIF   ('&SMF113_1_CSS' EQ 'NO').L0015                          00515000
         AIF   ('&DSECT' EQ 'YES').L0016                                00516000
         AIF   ('&SMF113_1_CSS' NE 'YES').L0015                         00517000
SMF113_1_CSS DS 0F       Counter set section                            00518000
         AGO   .L0017                                                   00519000
.L0016   ANOP                                                           00520000
SMF113_1_CSS DSECT       Counter set section                            00521000
.L0017   ANOP                                                           00522000
SMF113_1_CSTYPE DS H     Counter set type for counters recorded: 1 =   *00523000
                         Basic, 2 = Problem state, 3 =                 *00524000
                         Crypto-activity, 4 = Extended 5 = z/OS 6 =    *00525000
                         MT-diagnostic                                  00526000
SMF113_1_CSFLAGS DS 0CL2                                                00527000
SMF113_1_CSUSELCDS EQU X'80' When on the counter set's counter data    *00528000
                         section described by fields SMF113_1_CDOF,    *00529000
                         SMF113_1_CDLN, and SMF113_1_CDON is mapped by *00530000
                         SMF113_1_LCDS, otherwise it is mapped by      *00531000
                         SMF113_1_SCDS.                                 00532000
         ORG   SMF113_1_CSFLAGS+2                                       00533000
SMF113_1_CDOF DS F       Offset to counter data section for this       *00534000
                         counter set, from the beginning of record.    *00535000
                         This can be to a SMF113_1_SCDS section or a   *00536000
                         SMF113_1_LCDS section, depending              *00537000
                         SMF113_1_CSUseLCDS                             00538000
SMF113_1_CDLN DS H       Length of counter data section                 00539000
SMF113_1_CDON DS H       Number of counter data sections                00540000
SMF113_1_CSS_LEN EQU *-SMF113_1_CSS                                     00541000
.L0015   ANOP                                                           00542000
         AIF   ('&SMF113_1_SCDS' EQ 'NO').L0018                         00543000
         AIF   ('&DSECT' EQ 'YES').L0019                                00544000
         AIF   ('&SMF113_1_SCDS' NE 'YES').L0018                        00545000
SMF113_1_SCDS DS 0X      Short counter data section. This is used when *00546000
                         the counter data delta is 4 bytes              00547000
         AGO   .L001A                                                   00548000
.L0019   ANOP                                                           00549000
SMF113_1_SCDS DSECT      Short counter data section. This is used when *00550000
                         the counter data delta is 4 bytes              00551000
.L001A   ANOP                                                           00552000
SMF113_1_SCR DS CL4      Event counter value delta. Contains the       *00553000
                         number of times a particular counter event    *00554000
                         has occurred since either the start of the    *00555000
                         HIS collection run, or the previous SMF 113   *00556000
                         Type 1 record.                                 00557000
SMF113_1_SCDS_LEN EQU *-SMF113_1_SCDS                                   00558000
.L0018   ANOP                                                           00559000
         AIF   ('&SMF113_1_LCDS' EQ 'NO').L001B                         00560000
         AIF   ('&DSECT' EQ 'YES').L001C                                00561000
         AIF   ('&SMF113_1_LCDS' NE 'YES').L001B                        00562000
SMF113_1_LCDS DS 0X      Long counter data section. This is used when  *00563000
                         the counter data delta is 8 bytes              00564000
         AGO   .L001D                                                   00565000
.L001C   ANOP                                                           00566000
SMF113_1_LCDS DSECT      Long counter data section. This is used when  *00567000
                         the counter data delta is 8 bytes              00568000
.L001D   ANOP                                                           00569000
SMF113_1_LCR DS CL8      Event counter value delta. Contains the       *00570000
                         number of times a particular counter event    *00571000
                         has occurred since either the start of the    *00572000
                         HIS collection run, or the previous SMF 113   *00573000
                         Type 1 record.                                 00574000
SMF113_1_LCDS_LEN EQU *-SMF113_1_LCDS                                   00575000
.L001B   ANOP                                                           00576000
         AIF   ('&SMF113_2_CTR' EQ 'NO').L001E                          00577000
         AIF   ('&DSECT' EQ 'YES').L001F                                00578000
         AIF   ('&SMF113_2_CTR' NE 'YES').L001E                         00579000
.L001F   ANOP                                                           00580000
*                                                                       00581000
*  ------------------------------------------------------------------   00582000
*                                                                       00583000
*    Data Section for HIS hardware event counters subtype               00584000
*    (subtype 2).                                                       00585000
*                                                                       00586000
*  ------------------------------------------------------------------   00587000
*                                                                       00588000
*    Subtype 2 records are CPU specific.                                00589000
*    For each SMF recording cycle, there is one subtype 2 record        00590000
*    created for each active CPU.                                       00591000
*                                                                       00592000
*    Its location in the SMF record is calculated by (Address of        00593000
*    SMFR113 record + offset value in SMF113DOF).                       00594000
*                                                                       00595000
*                                                                       00596000
*                                                                       00597000
         AIF   ('&DSECT' EQ 'YES').L0020                                00598000
SMF113_2_CTR DS 0F       Event counters                                 00599000
         AGO   .L0021                                                   00600000
.L0020   ANOP                                                           00601000
SMF113_2_CTR DSECT       Event counters                                 00602000
.L0021   ANOP                                                           00603000
SMF113_2_CTR_HDR_SDS DS 0CL84 Header and self defining section          00604000
SMF113_2_CTS DS BL8      Time when HIS Data collection started -- STCK *00605000
                         format                                         00606000
SMF113_2_CTM DS BL8      Time when this SMF record is written -- STCK  *00607000
                         format                                         00608000
SMF113_2_CPU# DS X       Processor number for which the event counters *00609000
                         are recorded. Note that zero is a valid       *00610000
                         processor number. This field is deprecated,   *00611000
                         use SMF113_2_CpuId instead.                    00612000
SMF113_2_CPUPROCCLASS DS X The processor type for which the event      *00613000
                         counters are recorded. Will be one of the     *00614000
                         following: 0 = Standard CP 2 = zCBP or zAAP   *00615000
                         see SMF113_2_zCBP 4 = zIIP                     00616000
SMF113_2_CF DS 0BL2      Record flags                                   00617000
SMF113_2_CFF EQU X'80'   First SMF record for the instrumentation run. *00618000
                         The counter values are the initial values.     00619000
SMF113_2_CFM EQU X'40'   Middle SMF record (activated by interval      *00620000
                         timers). The counter values are intermediate  *00621000
                         values. The number of intermediate records    *00622000
                         varies from 0 to many, depending on the       *00623000
                         duration of the instrumentation run. An       *00624000
                         intermediate recrod is produced periodically  *00625000
                         based on the SMFINTVAL parameter.              00626000
SMF113_2_CFL EQU X'20'   Final SMF record for the instrumentation run. *00627000
                         The counter values are the values at the end  *00628000
                         of the run.                                    00629000
SMF113_2_CFNS EQU X'10'  1=Internal flag indicating SMF record is      *00630000
                         created on non-standard instrumentation       *00631000
                         hardware                                       00632000
SMF113_2_LOSTDATA EQU X'08' When ON, the hardware indicated the        *00633000
                         hardware has lost counter data on during the  *00634000
                         current interval                               00635000
SMF113_2_ZCBP EQU X'04'  When ON, a value of 2 for                     *00636000
                         SMF113_2_CpuProcClass refers to a zCBP        *00637000
                         processor type, when off a zAAP processor     *00638000
                         type.                                          00639000
         ORG   SMF113_2_CF+2                                            00640000
SMF113_2_CTRVN1 DS H     First counter version number. This number is  *00641000
                         incremented when there is a change to the     *00642000
                         meaning of a counter or the number of         *00643000
                         installed counters in the Basic or            *00644000
                         Problem-state counter sets                     00645000
SMF113_2_CTRVN2 DS H     Second counter version number. This number is *00646000
                         incremented when there is a change to the     *00647000
                         meaning of a counter or the number of         *00648000
                         installed counters in the Crypto-activity or  *00649000
                         Extended counter sets                          00650000
SMF113_2_CSOF DS F       Offset to counter set section from beginning  *00651000
                         of record                                      00652000
SMF113_2_CSLN DS H       Length of counter set sections                 00653000
SMF113_2_CSON DS H       Number of counter set sections                 00654000
SMF113_2_CDOF DS F       Offset to counter data section from beginning *00655000
                         of record                                      00656000
SMF113_2_CDLN DS H       Length of counter data sections                00657000
SMF113_2_CDON DS H       Number of counter data sections. This is the  *00658000
                         total number of SMF113_2_CDS sections for all *00659000
                         the counter sets                               00660000
SMF113_2_CPSP DS F       Processor speed for which the event counters  *00661000
                         are recorded. Speed is in cycles/microsecond.  00662000
SMF113_2_MACHTYPE DS CL4 The machine type                               00663000
SMF113_2_MACHMODEL DS CL16 The machine model                            00664000
SMF113_2_CPUID DS H      Processor ID for which the hardware event     *00665000
                         counters are recorded. Note that zero is a    *00666000
                         valid processor ID.                            00667000
         DS    CL2                                                      00668000
SMF113_2_MACHSEQCODE DS CL16 The machine sequence code                  00669000
SMF113_2_CTR_LEN EQU *-SMF113_2_CTR                                     00670000
.L001E   ANOP                                                           00671000
         AIF   ('&SMF113_2_CSS' EQ 'NO').L0022                          00672000
         AIF   ('&DSECT' EQ 'YES').L0023                                00673000
         AIF   ('&SMF113_2_CSS' NE 'YES').L0022                         00674000
SMF113_2_CSS DS 0H       Counter set section                            00675000
         AGO   .L0024                                                   00676000
.L0023   ANOP                                                           00677000
SMF113_2_CSS DSECT       Counter set section                            00678000
.L0024   ANOP                                                           00679000
SMF113_2_CST DS X        Counterset type for counters recorded in      *00680000
                         SMF113_2_CR: 1 = Basic, 2 = Problem state, 3  *00681000
                         = Crypto-activity, 4 = Extended                00682000
         DS    CL1       Reserved                                       00683000
SMF113_2_CSN DS H        Number of counter sections                     00684000
SMF113_2_CSP DS BL8      Not used, but kept for compatibility           00685000
SMF113_2_CSS_LEN EQU *-SMF113_2_CSS                                     00686000
.L0022   ANOP                                                           00687000
         AIF   ('&SMF113_2_CDS' EQ 'NO').L0025                          00688000
         AIF   ('&DSECT' EQ 'YES').L0026                                00689000
         AIF   ('&SMF113_2_CDS' NE 'YES').L0025                         00690000
SMF113_2_CDS DS 0F       Counter data section                           00691000
         AGO   .L0027                                                   00692000
.L0026   ANOP                                                           00693000
SMF113_2_CDS DSECT       Counter data section                           00694000
.L0027   ANOP                                                           00695000
SMF113_2_CR DS CL8       Hardware event counter value. Contains the    *00696000
                         absolute number of times a particular         *00697000
                         hardware counter event has occurred.           00698000
*                                                                       00699000
*     Declare constants                                                 00700000
*                                                                       00701000
*                                                                       00702000
SMF113#VERSION01 EQU C'01' Record version 01                            00703000
SMF113#VERSION EQU C'01' Record version number                          00704000
SMF113RTY#113 EQU 113    Record type 113                                00705000
*                                                                       00706000
*     Declare SMF record 113 subtypes                                   00707000
*                                                                       00708000
*                                                                       00709000
SMF113#HISCTRDELTA EQU 1 Subtype for HIS event counter deltas           00710000
SMF113#HISCTR EQU 2      Subtype for HIS event counter absolutes        00711000
*                                                                       00712000
*     Declare SMF counterset types (for variable SMF113_2_CST)          00713000
*                                                                       00714000
*                                                                       00715000
SMF113CST#BASIC EQU 1    Basic counter set                              00716000
SMF113CST#PROB EQU 2     Problem state counter set                      00717000
SMF113CST#CRYPTO EQU 3   Crypto activity counter set                    00718000
SMF113CST#EXT EQU 4      Extended counter set                           00719000
SMF113CST#ZOS EQU 5      z/OS counter set                               00720000
SMF113CST#MTDIAG EQU 6   MT-diagnostic counter set                      00721000
SMF113_2_CDS_LEN EQU *-SMF113_2_CDS                                     00722000
.L0025   ANOP                                                           00723000
         AIF   ('&ZCBPRINT' EQ 'NO').P3                                 00724000
         AIF   ('&LIST' EQ 'YES').P4                                    00725000
.P3      ANOP                                                           00726000
         POP   PRINT                                                    00727000
.P4      ANOP                                                           00728000
.P_EXIT  ANOP                                                           00729000
         MEND                                                           00730000
**/ HISYSMFR_2:;                                                        00731000
* %HISYSMFR_INCLUDED = 'YES';                                           00732000
* %DCL ZCBPRINT CHAR EXT;                                               00733000
* %DEACTIVATE ZCBPRINT;                                                 00734000
* %DCL HISYSMFR_LIST CHAR EXT;                                          00735000
* %DEACTIVATE HISYSMFR_LIST;                                            00736000
* %IF HISYSMFR_LIST ^= 'NO' &                                           00737000
*    ZCBPRINT ^= 'NO' %THEN                                             00738000
*   %GOTO HISYSMFR_3;                                                   00739000
*   @LIST PUSH NOECHO;                                                  00740000
*   @LIST NOASSEMBLE NOECHO;                                            00741000
*   @LIST OFF C NOECHO;                                                 00742000
* %HISYSMFR_3:;                                                         00743000
*/* Start of PL/X Source                                             */ 00744000
*%IF SMFRBASE='' %THEN                                                  00745000
*  %DO;                                                                 00746000
*    %SMFRBASE='BASED(SMF113PTR)';                                      00747000
*  %END;                                                                00748000
*%IF SMFRBASE='BASED(SMF113PTR)' %THEN                                  00749000
*  %DO;                                                                 00750000
*    DCL SMF113PTR PTR(31);       /* Pointer to SMFR113              */ 00751000
*  %END;                                                                00752000
*                                                                       00753000
*                                                                       00754000
*                                                                       00755000
*DCL                                                                    00756000
*  1 SMFR113 SMFRBASE BDY(DWORD),                                       00757000
*    2 SMF113RPS,                 /* Fixed record sections           */ 00758000
*/*                                                                  */ 00759000
*/*  SMF Record Header Section                                       */ 00760000
*/*                                                                  */ 00761000
*      3 SMF113RHD,               /* Record header section           */ 00762000
*        5 SMF113LEN  Fixed(15),  /* Record length                   */ 00763000
*        5 SMF113SEG  Fixed(15),  /* Segment descriptor              */ 00764000
*        5 SMF113FLG  Bit(8),     /* Header flag byte                */ 00765000
*          7 SMF113SSF Bit(1),    /* Bit 0 - Subsys ID after Sys ID  */ 00766000
*          7 SMF113SBT Bit(1),    /* Bit 1 - Subtypes utilized       */ 00767000
*          7 * Bit(1),            /* Bit 2 - reserved                */ 00768000
*          7 * Bit(1),            /* Bit 3 - MVS/4.X                 */ 00769000
*          7 * Bit(1),            /* Bit 4 - MVS/ESA                 */ 00770000
*          7 * Bit(1),            /* Bit 5 - MVS/XA                  */ 00771000
*          7 * Bit(1),            /* Bit 6 - VS2                     */ 00772000
*          7 * Bit(1),            /* Bit 7 - Reserved                */ 00773000
*        5 SMF113RTY  Bit(8),     /* Record type - 113 ('71'x)       */ 00774000
*        5 SMF113TME  Fixed(31) Bdy(HWord), /* Record written time   */ 00775000
*        5 SMF113DTE  Fixed(31) Bdy(HWord), /* Record written date   */ 00776000
*        5 SMF113SID  Char(4),    /* System identifier               */ 00777000
*        5 SMF113WID  Char(4),    /* Subsystem identifier            */ 00778000
*        5 SMF113STY  Fixed(15),  /* Record subtype:                    00779000
*                                    1 = Delta event counters           00780000
*                                    2 = Hardware event counters     */ 00781000
*        5 *          Char(2),    /* Reserved                        */ 00782000
*        5 SMF113SDL  Fixed(15);  /* Length of self-defining section */ 00783000
*/*                                                                  */ 00784000
*/*  Self Defining Section                                           */ 00785000
*/*                                                                  */ 00786000
*DCL                                                                    00787000
*  1 SMF113SDS BASED(ADDR(SMFR113)+LENGTH(SMF113RPS)),                  00788000
*    3 SMF113SOF      Fixed(31),  /* Offset to subsystem section        00789000
*                                    from beginning of record        */ 00790000
*    3 SMF113SLN      Fixed(15),  /* Length of subsystem section     */ 00791000
*    3 SMF113SON      Fixed(15),  /* Number of subsystem sections    */ 00792000
*    3 SMF113IOF      Fixed(31),  /* Offset of identification section   00793000
*                                    from beginning of record        */ 00794000
*    3 SMF113ILN      Fixed(15),  /* Length of identification section*/ 00795000
*    3 SMF113ION      Fixed(15),  /* Number of identification section*/ 00796000
*    3 SMF113DOF      Fixed(31),  /* Offset of data section from        00797000
*                                    beginning of record             */ 00798000
*    3 SMF113DLN      Fixed(15),  /* Length of data section          */ 00799000
*    3 SMF113DON      Fixed(15);  /* Number of data sections         */ 00800000
*                                                                       00801000
*/*                                                                  */ 00802000
*/*  Subsystem Section.                                              */ 00803000
*/*                                                                  */ 00804000
*/*  Its location in the SMF record is calculated by (Address of     */ 00805000
*/*  SMFR113 record + offset value in SMF113SOF).                    */ 00806000
*/*                                                                  */ 00807000
*                                                                       00808000
*DCL                                                                    00809000
*  1 SMF113SSS BASED(ADDR(SMFR113)+SMF113SOF),                          00810000
*    3 *              Char(2),    /* Reserved                        */ 00811000
*    3 SMF113RVN      Char(2),    /* Record version number           */ 00812000
*    3 SMF113PNM      Char(8),    /* Product name - HIS              */ 00813000
*    3 SMF113OSL      Char(8);    /* MVS product level               */ 00814000
*                                                                       00815000
*/*                                                                  */ 00816000
*/*  Identification Section.                                         */ 00817000
*/*                                                                  */ 00818000
*/*  Its location in the SMF record is calculated by (Address of     */ 00819000
*/*  SMFR113 record + offset value in SMF113IOF).                    */ 00820000
*/*                                                                  */ 00821000
*DCL                                                                    00822000
*  1 SMF113ID BASED(ADDR(SMFR113)+SMF113IOF),                           00823000
*    3 SMF113JBN      Char(8),    /* JobName                         */ 00824000
*    3 SMF113RST      Fixed(31),  /* Reader start time               */ 00825000
*    3 SMF113RSD      Char(4),    /* Reader start date               */ 00826000
*    3 SMF113STP      Char(8),    /* Step name                       */ 00827000
*    3 SMF113IntervalStart Char(8), /* The interval start time -- STCK  00828000
*                                    format                          */ 00829000
*    3 SMF113IntervalEnd   Char(8), /* The interval end time -- STCK    00830000
*                                    format                          */ 00831000
*    3 *              Char(8);    /* Reserved                        */ 00832000
*                                                                       00833000
*/*------------------------------------------------------------------*/ 00834000
*/*                                                                  */ 00835000
*/*  Data Section for HIS event counters delta (subtype 1).          */ 00836000
*/*                                                                  */ 00837000
*/*------------------------------------------------------------------*/ 00838000
*/*                                                                  */ 00839000
*/*  Subtype 1 records are CPU specific.                             */ 00840000
*/*  For each SMF recording cycle, there is one subtype 1 record     */ 00841000
*/*  created for each active CPU.                                    */ 00842000
*/*                                                                  */ 00843000
*/*  Its location in the SMF record is calculated by (Address of     */ 00844000
*/*  SMFR113 record + offset value in SMF113DOF).                    */ 00845000
*/*                                                                  */ 00846000
*/*     SMF113_1_CTR                                                 */ 00847000
*/*  +--------------------+                                          */ 00848000
*/*  ! SMF113_1_CSOF      !---+                                      */ 00849000
*/*  ! SMF113_1_CSLN      !   !    <- Is length of SMF113_1_CSS      */ 00850000
*/*  ! SMF113_1_CSON      !   !    <- Can be 1-5, depending on CTRSET*/ 00851000
*/*  +--------------------+   !                                      */ 00852000
*/*     SMF113_1_CSS          !                                      */ 00853000
*/*  +--------------------+<--+                                      */ 00854000
*/*  ! SMF113_1_CSType    !        <- Identifies this counter set    */ 00855000
*/*  ! SMF113_1_CSUseLCDS !        <- In this case, this is off      */ 00856000
*/*  ! SMF113_1_CDOF      !---+                                      */ 00857000
*/*  ! SMF113_1_CDLN      !   !    <- Is length of SMF113_1_SCDS     */ 00858000
*/*  ! SMF113_1_CDON      !   !    <- Is lastctr-firstctr+1          */ 00859000
*/*  +--------------------+   !                                      */ 00860000
*/*     SMF113_1_CSS          !                                      */ 00861000
*/*  +--------------------+   !                                      */ 00862000
*/*  ! SMF113_1_CSType    !   !    <- Identifies this counter set    */ 00863000
*/*  ! SMF113_1_CSUseLCDS !   !    <- In this case, this is on       */ 00864000
*/*  ! SMF113_1_CDOF      !-----+                                    */ 00865000
*/*  ! SMF113_1_CDLN      !   ! !  <- Is length of SMF113_1_LCDS     */ 00866000
*/*  ! SMF113_1_CDON      !   ! !  <- Is lastctr-firstctr+1          */ 00867000
*/*  +--------------------+   ! !                                    */ 00868000
*/*                           ! !                                    */ 00869000
*/*  +--------------------+<--! !                                    */ 00870000
*/*  !  SMF113_1_SCDS     !     !                                    */ 00871000
*/*  +--------------------+     !                                    */ 00872000
*/*  !  SMF113_1_SCDS     !     !                                    */ 00873000
*/*  +--------------------+     !                                    */ 00874000
*/*                             !                                    */ 00875000
*/*  +--------------------+<----!                                    */ 00876000
*/*  !  SMF113_1_LCDS     !                                          */ 00877000
*/*  +--------------------+                                          */ 00878000
*/*  !  SMF113_1_LCDS     !                                          */ 00879000
*/*  +--------------------+                                          */ 00880000
*/*                                                                  */ 00881000
*/*  The nth counter data section in a counter set section represents*/ 00882000
*/*  the counter data for the nth counter in a counter set. If the   */ 00883000
*/*  nth counter isn't defined, the counter data will be zero.       */ 00884000
*/*  Counter data is expressed as deltas, the number indicates the   */ 00885000
*/*  number of times a particular event occurred since the previous  */ 00886000
*/*  SMF113 interval, or the start of a HIS collection run (whichever*/ 00887000
*/*  is most recent.                                                 */ 00888000
*/*                                                                  */ 00889000
*Dcl                                                                    00890000
* 1 SMF113_1_CTR Based(Addr(SMFR113)+SMF113DOF) /* Delta Event       */ 00891000
*  ,3 SMF113_1_CTS   Bit(64)      /* Time when HIS Data collection      00892000
*                                    started -- STCK format          */ 00893000
*  ,3 SMF113_1_CTM   Bit(64)      /* Time when this SMF record is       00894000
*                                    written -- STCK format          */ 00895000
*  ,3 SMF113_1_CpuId Fixed(16)    /* Processor ID for which the         00896000
*                                    hardware event counters are        00897000
*                                    recorded. Note that zero is a      00898000
*                                    valid processor number.         */ 00899000
*  ,3 SMF113_1_CpuProcClass Fixed(8)  /* The processor type for which   00900000
*                                    the hardware event counters are    00901000
*                                    recorded. Will be one of the       00902000
*                                    following:                         00903000
*                                       0 = Standard CP                 00904000
*                                       2 = zCBP or zAAP                00905000
*                                            see SMF113_1_zCBP          00906000
*                                       4 = zIIP                        00907000
*                                                                @L9C*/ 00908000
*  ,3 * Char(1)                                                         00909000
*  ,3 SMF113_1_CpuSpeed Fixed(32)  /* Processor speed for which the     00910000
*                                    event counters are recorded. Speed 00911000
*                                    is in cycles/microsecond.   @01A*/ 00912000
*  ,3 SMF113_1_MachType  Char(4)  /* The machine type            @L3A*/ 00913000
*  ,3 SMF113_1_MachModel Char(16) /* The machine model           @L3A*/ 00914000
*  ,3 SMF113_1_CtrVersion0 Fixed(16) /* Zero counter version number.    00915000
*                                    This number is incremented when    00916000
*                                    there is a change to the meaning   00917000
*                                    of a counter in the z/OS counter   00918000
*                                    set                             */ 00919000
*  ,3 SMF113_1_CtrVersion1 Fixed(16) /* First counter version number.   00920000
*                                    This number is incremented when    00921000
*                                    there is a change to the meaning   00922000
*                                    of a counter or the number of      00923000
*                                    installed counters in the Basic    00924000
*                                    or Problem-state counter sets   */ 00925000
*  ,3 SMF113_1_CtrVersion2 Fixed(16) /* Second counter version number.  00926000
*                                    This number is incremented when    00927000
*                                    there is a change to the meaning   00928000
*                                    of a counter or the number of      00929000
*                                    installed counters in the          00930000
*                                    Crypto-activity, Extended or       00931000
*                                    MT-diagnostic counters      @02C*/ 00932000
*  ,3 SMF113_1_Flags Char(2)                                            00933000
*    ,5 SMF113_1_LostCtrData Bit(1)  /* When ON, the hardware indicated 00934000
*                                    the hardware has lost counter      00935000
*                                    data during the current interval   00936000
*                                                                @02C*/ 00937000
*      ,7 SMF113_1_LostData Bit(1)                                      00938000
*    ,5 SMF113_1_LostMTData Bit(1) /* When ON, the hardware indicated   00939000
*                                    the hardware has lost MT counter   00940000
*                                    data during the current interval   00941000
*                                                                @02A*/ 00942000
*    ,5 SMF113_1_zCBP Bit(1)      /* When ON, a value of 2 for          00943000
*                                    SMF113_1_CpuProcClass refers to    00944000
*                                    a zCBP processor type, when off    00945000
*                                    a zAAP processor type.      @L9A*/ 00946000
*  ,3 SMF113_1_CSOF  Fixed(31)    /* Offset to counter set section      00947000
*                                    from beginning of record        */ 00948000
*  ,3 SMF113_1_CSLN  Fixed(15)    /* Length of counter set section   */ 00949000
*  ,3 SMF113_1_CSON  Fixed(15)    /* Number of counter set sections  */ 00950000
*  ,3 SMF113_1_MachSeqCode Char(16) /* The machine sequence code @L6A*/ 00951000
*  ,3 SMF113_1_CoreID Fixed(16)   /* Core ID for which the              00952000
*                                    hardware event counters are        00953000
*                                    recorded. Note that zero is a      00954000
*                                    valid core ID number.       @02A*/ 00955000
*  ;                                                                    00956000
*                                                                       00957000
*Dcl                                                                    00958000
* 1 SMF113_1_CSS Based(Addr(SMFR113)+SMF113_1_CSOF) /* Counter set      00959000
*                                    section                         */ 00960000
*  ,3 SMF113_1_CSType  Fixed(16)  /* Counter set type for counters      00961000
*                                    recorded:                          00962000
*                                    1 = Basic,                         00963000
*                                    2 = Problem state,                 00964000
*                                    3 = Crypto-activity,               00965000
*                                    4 = Extended                       00966000
*                                    5 = z/OS                           00967000
*                                    6 = MT-diagnostic           @02C*/ 00968000
*  ,3 SMF113_1_CSFlags Char(2)                                          00969000
*    ,5 SMF113_1_CSUseLCDS Bit(1) /* When on the counter set's counter  00970000
*                                    data section described by fields   00971000
*                                    SMF113_1_CDOF, SMF113_1_CDLN, and  00972000
*                                    SMF113_1_CDON is mapped by         00973000
*                                    SMF113_1_LCDS, otherwise it is     00974000
*                                    mapped by SMF113_1_SCDS.        */ 00975000
*  ,3 SMF113_1_CDOF    Fixed(31)  /* Offset to counter data section     00976000
*                                    for this counter set, from the     00977000
*                                    beginning of record. This can      00978000
*                                    be to a SMF113_1_SCDS section      00979000
*                                    or a SMF113_1_LCDS section,        00980000
*                                    depending SMF113_1_CSUseLCDS    */ 00981000
*  ,3 SMF113_1_CDLN    Fixed(15)  /* Length of counter data section  */ 00982000
*  ,3 SMF113_1_CDON    Fixed(15)  /* Number of counter data sections */ 00983000
*  ;                                                                    00984000
*                                                                       00985000
*Dcl                                                                    00986000
* 1 SMF113_1_SCDS Based(Addr(SMFR113)+SMF113_1_CDOF) /* Short           00987000
*                                    counter data section. This is      00988000
*                                    used when the counter data delta   00989000
*                                    is 4 bytes                      */ 00990000
*  ,3 SMF113_1_SCR Char(4)        /* Event counter value delta.         00991000
*                                    Contains the number of times a     00992000
*                                    particular counter event has       00993000
*                                    occurred since either the start    00994000
*                                    of the HIS collection run, or the  00995000
*                                    previous SMF 113 Type 1 record. */ 00996000
*  ;                                                                    00997000
*                                                                       00998000
*Dcl                                                                    00999000
* 1 SMF113_1_LCDS Based(Addr(SMFR113)+SMF113_1_CDOF) /* Long counter    01000000
*                                    data section. This is used when    01001000
*                                    the counter data delta is 8        01002000
*                                    bytes                           */ 01003000
*  ,3 SMF113_1_LCR Char(8)        /* Event counter value delta.         01004000
*                                    Contains the number of times a     01005000
*                                    particular counter event has       01006000
*                                    occurred since either the start    01007000
*                                    of the HIS collection run, or the  01008000
*                                    previous SMF 113 Type 1 record. */ 01009000
*  ;                                                                    01010000
*                                                                       01011000
*                                                                       01012000
*/*------------------------------------------------------------------*/ 01013000
*/*                                                                  */ 01014000
*/*  Data Section for HIS hardware event counters subtype            */ 01015000
*/*  (subtype 2).                                                    */ 01016000
*/*                                                                  */ 01017000
*/*------------------------------------------------------------------*/ 01018000
*/*                                                                  */ 01019000
*/*  Subtype 2 records are CPU specific.                             */ 01020000
*/*  For each SMF recording cycle, there is one subtype 2 record     */ 01021000
*/*  created for each active CPU.                                    */ 01022000
*/*                                                                  */ 01023000
*/*  Its location in the SMF record is calculated by (Address of     */ 01024000
*/*  SMFR113 record + offset value in SMF113DOF).                    */ 01025000
*/*                                                                  */ 01026000
*DCL                                                                    01027000
*  1 SMF113_2_CTR BASED(ADDR(SMFR113)+SMF113DOF), /*                    01028000
*                                    Event counters                  */ 01029000
*   2  SMF113_2_CTR_HDR_SDS,      /* Header and self defining section*/ 01030000
*    3 SMF113_2_CTS   Bit(64),    /* Time when HIS Data collection      01031000
*                                    started -- STCK format          */ 01032000
*    3 SMF113_2_CTM   Bit(64),    /* Time when this SMF record is       01033000
*                                    written -- STCK format          */ 01034000
*    3 SMF113_2_CPU#  FIXED(8),   /* Processor number for which the     01035000
*                                    event counters are recorded. Note  01036000
*                                    that zero is a valid processor     01037000
*                                    number. This field is deprecated,  01038000
*                                    use SMF113_2_CpuId instead.     */ 01039000
*    3 SMF113_2_CpuProcClass Fixed(8), /* The processor type for which  01040000
*                                    the event counters are recorded.   01041000
*                                    Will be one of the following:      01042000
*                                       0 = Standard CP                 01043000
*                                       2 = zCBP or zAAP                01044000
*                                            see SMF113_2_zCBP          01045000
*                                       4 = zIIP                        01046000
*                                                                @L9C*/ 01047000
*    3 SMF113_2_CF    BIT(16),    /* Record flags                    */ 01048000
*      5 SMF113_2_CFF BIT(1),     /* First SMF record for the           01049000
*                                    instrumentation run.  The          01050000
*                                    counter values are the initial     01051000
*                                    values.                         */ 01052000
*      5 SMF113_2_CFM BIT(1),     /* Middle SMF record (activated by    01053000
*                                    interval timers). The counter      01054000
*                                    values are intermediate values.    01055000
*                                    The number of intermediate         01056000
*                                    records varies from 0 to many,     01057000
*                                    depending on the duration of       01058000
*                                    the instrumentation run. An        01059000
*                                    intermediate recrod is produced    01060000
*                                    periodically based on the          01061000
*                                    SMFINTVAL parameter.            */ 01062000
*      5 SMF113_2_CFL BIT(1),     /* Final SMF record for the           01063000
*                                    instrumentation run.  The          01064000
*                                    counter values are the values      01065000
*                                    at the end of the run.          */ 01066000
*      5 SMF113_2_CFNS BIT(1),    /* 1=Internal flag indicating SMF     01067000
*                                    record is created on               01068000
*                                    non-standard instrumentation       01069000
*                                    hardware                        */ 01070000
*      5 SMF113_2_LostData Bit(1), /* When ON, the hardware indicated   01071000
*                                    the hardware has lost counter      01072000
*                                    data on during the current         01073000
*                                    interval                    @L5A*/ 01074000
*      5 SMF113_2_zCBP Bit(1),    /* When ON, a value of 2 for          01075000
*                                    SMF113_2_CpuProcClass refers to    01076000
*                                    a zCBP processor type, when off    01077000
*                                    a zAAP processor type.      @L9A*/ 01078000
*    3 SMF113_2_CtrVN1 FIXED(16), /* First counter version number.      01079000
*                                    This number is incremented when    01080000
*                                    there is a change to the meaning   01081000
*                                    of a counter or the number of      01082000
*                                    installed counters in the Basic    01083000
*                                    or Problem-state counter sets   */ 01084000
*    3 SMF113_2_CtrVN2 FIXED(16), /* Second counter version number.     01085000
*                                    This number is incremented when    01086000
*                                    there is a change to the meaning   01087000
*                                    of a counter or the number of      01088000
*                                    installed counters in the          01089000
*                                    Crypto-activity or Extended        01090000
*                                    counter sets                    */ 01091000
*    3 SMF113_2_CSOF  Fixed(31),  /* Offset to counter set section      01092000
*                                    from beginning of record        */ 01093000
*    3 SMF113_2_CSLN  Fixed(15),  /* Length of counter set sections  */ 01094000
*    3 SMF113_2_CSON  Fixed(15),  /* Number of counter set sections  */ 01095000
*    3 SMF113_2_CDOF  Fixed(31),  /* Offset to counter data section     01096000
*                                    from beginning of record        */ 01097000
*    3 SMF113_2_CDLN  Fixed(15),  /* Length of counter data sections */ 01098000
*    3 SMF113_2_CDON  Fixed(15)   /* Number of counter data sections.   01099000
*                                    This is the total number of        01100000
*                                    SMF113_2_CDS sections for all      01101000
*                                    the counter sets            @01C*/ 01102000
*   ,3 SMF113_2_CPSP  Fixed(32)   /* Processor speed for which the      01103000
*                                    event counters are recorded.       01104000
*                                    Speed is in cycles/microsecond.    01105000
*                                                                @01A*/ 01106000
*   ,3 SMF113_2_MachType  Char(4) /* The machine type            @L3A*/ 01107000
*   ,3 SMF113_2_MachModel Char(16) /* The machine model          @L3A*/ 01108000
*   ,3 SMF113_2_CpuId Fixed(16)   /* Processor ID for which the         01109000
*                                    hardware event counters are        01110000
*                                    recorded. Note that zero is a      01111000
*                                    valid processor ID.             */ 01112000
*   ,3 * Char(2)                  /*                             @L6A*/ 01113000
*   ,3 SMF113_2_MachSeqCode Char(16) /* The machine sequence code       01114000
*                                                                @L6A*/ 01115000
*   ;                                                                   01116000
*                                                                       01117000
*                                                                       01118000
*DCL                                                                    01119000
*  1 SMF113_2_CSS BASED(ADDR(SMFR113)+SMF113_2_CSOF), /*                01120000
*                                    Counter set section             */ 01121000
*    3 SMF113_2_CST   Fixed(8),   /* Counterset type for counters       01122000
*                                    recorded in SMF113_2_CR:           01123000
*                                    1 = Basic,                         01124000
*                                    2 = Problem state,                 01125000
*                                    3 = Crypto-activity,               01126000
*                                    4 = Extended                    */ 01127000
*    3 *              Char(1),    /* Reserved                        */ 01128000
*    3 SMF113_2_CSN   Fixed(15),  /* Number of counter sections      */ 01129000
*    3 SMF113_2_CSP   Bit(64)     /* Not used, but kept for             01130000
*                                    compatibility               @L7C*/ 01131000
*   ;                                                                   01132000
*                                                                       01133000
*Dcl                                                                    01134000
* 1 SMF113_2_CDS BASED(ADDR(SMFR113)+SMF113_2_CDOF), /* Counter data    01135000
*                                    section                         */ 01136000
*   3 SMF113_2_CR Char(8) BDY(Word); /* Hardware event counter value.   01137000
*                                    Contains the absolute number of    01138000
*                                    times a particular hardware        01139000
*                                    counter event has occurred.     */ 01140000
*                                                                       01141000
*                                                                       01142000
*  /* Declare constants                                              */ 01143000
*                                                                       01144000
*  DCL SMF113#Version01 Char(2) Constant('01'); /* Record version 01 */ 01145000
*  DCL SMF113#Version   Char(2) Constant('01'); /* Record version       01146000
*                                    number                          */ 01147000
*  DCL SMF113RTY#113  Fixed(8) Constant(113);   /* Record type 113   */ 01148000
*                                                                       01149000
*  /* Declare SMF record 113 subtypes                                */ 01150000
*                                                                       01151000
*  DCL SMF113#HisCtrDelta Fixed(15) Constant(01); /* Subtype for        01152000
*                                    HIS event counter deltas        */ 01153000
*  DCL SMF113#HisCtr      Fixed(15) Constant(02); /* Subtype for        01154000
*                                    HIS event counter absolutes     */ 01155000
*                                                                       01156000
*  /* Declare SMF counterset types (for variable SMF113_2_CST)       */ 01157000
*                                                                       01158000
*  DCL SMF113CST#Basic Fixed(8) Constant(1); /* Basic counter set    */ 01159000
*  DCL SMF113CST#Prob  Fixed(8) Constant(2); /* Problem state counter   01160000
*                                    set                             */ 01161000
*  DCL SMF113CST#Crypto Fixed(8) Constant(3); /* Crypto activity        01162000
*                                    counter set                     */ 01163000
*  DCL SMF113CST#Ext   Fixed(8) Constant(4); /* Extended counter set */ 01164000
*  DCL SMF113CST#ZOS   Fixed(8) Constant(5); /* z/OS counter set     */ 01165000
*  DCL SMF113CST#MTDiag Fixed(8) Constant(6); /* MT-diagnostic          01166000
*                                                counter set     @02C*/ 01167000
*/* End of PL/X Source                                               */ 01168000
* %IF HISYSMFR_LIST ^= 'NO' &                                           01169000
*    ZCBPRINT ^= 'NO' %THEN                                             01170000
*   %GOTO HISYSMFR_4;                                                   01171000
*   @LIST POP NOECHO;                                                   01172000
* %HISYSMFR_4:;                                                         01173000
* %END;                                                                 01174000
