*                                                                               
* %DCL HWISMF6A_INCLUDED CHAR EXT;                                              
* %DEACTIVATE HWISMF6A_INCLUDED;                                                
* %IF HWISMF6A_INCLUDED = '' %THEN                                              
* %DO;                                                                          
*%/* Start of PL/X PreProlog Code */;                                           
*/*******************************************************************/          
*%/* End of PL/X PreProlog Code */;                                             
*/* Macro made bi-lingual on 21026. CBGEN compile date 20027         */         
*% /*                                                                           
         MACRO                                                                  
         HWISMF6A &DSECT=YES,&LIST=YES,&TITLE=YES,&SMFRCD6A=YES,       *        
               &SMF6APSD=COND,&SMF6AESD=COND,&SMF6ASET=COND,           *        
               &SMF6ACMD=COND,&SMF6ADAT=COND,&SMF6A_REST=COND                   
         GBLC  &HWISMF6A_INCLUDED                                               
         GBLC  &ZCBPRINT                                                        
&HWISMF6A_INCLUDED SETC 'YES'                                                   
         AIF   ('&LIST' EQ 'NONE').P0                                           
         AIF   ('&TITLE' EQ 'NO').P5                                            
 TITLE   'HWISMF6A  - BCPii mapping for SMF Record Type 106       '             
.P5      ANOP                                                                   
**/ HWISMF6A_1:;                                                                
*/* START OF SPECIFICATIONS ******************************************/         
*/*                                                                  */         
*/*                                                                  */         
*/***PROPRIETARY_STATEMENT********************************************/         
*/*                                                                  */         
*/*                                                                  */         
*/* LICENSED MATERIALS - PROPERTY OF IBM                             */         
*/* 5650-ZOS                                                         */         
*/* COPYRIGHT IBM CORP. 2015, 2021                                   */         
*/*                                                                  */         
*/* STATUS = HBB77C0                                                 */         
*/*                                                                  */         
*/***END_OF_PROPRIETARY_STATEMENT*************************************/         
*/*                                                                  */         
*/*02* ACRONYM:  HWISMF6A                                            */         
*/*                                                                  */         
*/*01* DESCRIPTIVE NAME: BCPii mapping for SMF Record Type 106       */         
*/*                                                                  */         
*/*01* MACRO NAME: HWISMF6A                                          */         
*/*                                                                  */         
*/*01* DSECT NAME:  SMFRCD6A                                         */         
*/*                                                                  */         
*/*01* COMPONENT:  BCPii                                             */         
*/*                                                                  */         
*/*01* EYE CATCHER: None                                             */         
*/*02*   OFFSET:    N/A                                              */         
*/*02*   LENGTH:    N/A                                              */         
*/*                                                                  */         
*/*01* STORAGE ATTRIBUTES:                                           */         
*/*02*  Subpool: Caller-determined                                   */         
*/*02*  Key: Caller-determined                                       */         
*/*02*  Residency: Caller-determined                                 */         
*/*                                                                  */         
*/*01* SIZE: Sum of component sections:                              */         
*/*           SMF6A_REST -- X'306C' bytes                            */         
*/*           SMFRCD6A   -- X'0040' bytes                            */         
*/*           SMF6AESD   -- X'0036' bytes                            */         
*/*        subtype 1:                                                */         
*/*           SMF6ARPS -- X'0018' bytes                              */         
*/*           SMF6ASDS -- X'001C' bytes                              */         
*/*           SMF6APSD   -- X'001A' bytes                            */         
*/*           SMF88ESD -- X'0036' bytes                              */         
*/*           SMF6ASET   -- X'0109' bytes                            */         
*/*                                                                  */         
*/*        subtype  2:                                               */         
*/*           SMF6ARPS -- X'0018' bytes                              */         
*/*           SMF88SDS -- X'001C' bytes                              */         
*/*           SMF88PSD -- X'001A' bytes                              */         
*/*           SMF88ESD -- X'0036' bytes                              */         
*/*           SMF6ACMD   -- X'0150' bytes                            */         
*/*           SMF6ADAT   -- X'0D9F' bytes                            */         
*/*                                                                  */         
*/*01* CREATED BY: HWICMSET or HWICMCMD (or caller)                  */         
*/*                                                                  */         
*/*01* POINTED TO BY:  Basing set up by module that calls IFASMFRA   */         
*/*                                                                  */         
*/*01* SERIALIZATION:  None                                          */         
*/*                                                                  */         
*/*01* FUNCTION:  BCPii mapping for SMF Record Type 106              */         
*/*                                                                  */         
*/*01* EXTERNAL CLASSIFICATION: PI                              @P1C */         
*/*01* END OF EXTERNAL CLASSIFICATION:                               */         
*/*                                                                  */         
*/*01* METHOD OF ACCESS:                                             */         
*/*                                                                  */         
*/*   PLX: %HWISMF6A_LIST = 'NO' suppresses printing of this macro,  */         
*/*                          any other value will list the macro.    */         
*/*        %IXGSMF6ABASE = '' results in the SMFRCD6A structure      */         
*/*                   being declared 'BASED'.  %ISGSMF6ABASE can be  */         
*/*                   set to override this to something else, for ex.*/         
*/*                   'BASED(SMF6APTR)' or ' '.                      */         
*/*                                                                  */         
*/*   ASM: IRASMFRA HWISMF6A                                         */         
*/*                                                                  */         
*/* DELETED-BY: Caller                                               */         
*/*                                                                  */         
*/* DEPENDENCIES: N/A                                                */         
*/*                                                                  */         
*/* NOTES:                                                           */         
*/* 1-SYS1.SAMPLIB member HWI6AFMT uses this mapping macro,          */         
*/*   and would need updating if incompatible changes were made.     */         
*/*   Any fields added/deleted to this macro has to be reflected     */         
*/*   in the sort portion of SYS1.SAMPLIB member HWI6AFMT.           */         
*/*                                                                  */         
*/* 2-Any changes made to this macro has to be reflected in the      */         
*/*   "MVS System Management Facilities" book in section for         */         
*/*   SMF6A records.                                                 */         
*/*                                                                  */         
*/*                                                                  */         
*/* 5-Time stamps in HWISMF6A are GMT times, not local.              */         
*/*                                                                  */         
*/*01* CHANGE ACTIVITY:                                              */         
*/*                                                                  */         
*/*   Flag LineItem  FMID    Date   ID    Comment                    */         
*/*                                                                  */         
*/*    $L0=ME28068 HBB77A0 140701   PDVP:  Initial release.          */         
*/*    $P1=ME28413 HBB77A0 141119   PDLH:  Missing CDPI in prolog    */         
*/*    $LQ=306220  HBB77C0 200817   PDDS: BCPii V2 (REST) Support    */         
*/*                                                                  */         
*/*END OF SPECIFICATIONS *********************************************/         
*% /*                                                                           
.P0      ANOP                                                                   
         AIF   ('&ZCBPRINT' EQ 'NO').P1                                         
         AIF   ('&LIST' EQ 'YES').P2                                            
.P1      ANOP                                                                   
         PUSH  PRINT                                                            
         PRINT OFF                                                              
.P2      ANOP                                                                   
         AIF   ('&SMFRCD6A' EQ 'NO').L0002                                      
         AIF   ('&DSECT' EQ 'YES').L0003                                        
         AIF   ('&SMFRCD6A' NE 'YES').L0002                                     
SMFRCD6A DS    0F                                                               
         AGO   .L0004                                                           
.L0003   ANOP                                                                   
SMFRCD6A DSECT                                                                  
.L0004   ANOP                                                                   
*                                                                               
* ********************************************************************          
* *   HEADER SECTION                                                 *          
* ********************************************************************          
*                                                                               
*                                                                               
SMF6ARPS DS    CL24      Record Header Section                                  
         ORG   SMF6ARPS                                                         
SMF6ALEN DS    H         Record Length                                          
SMF6ASEG DS    H         Segment Descriptor                                     
SMF6AFLG DS    CL1       Header Flag Byte                                       
SMF6ARTY DS    CL1       Record Type - 6A                                       
SMF6ATME DS    FL4       Recd Written Time                                      
SMF6ADTE DS    CL4       Record Written Date                                    
SMF6ASID DS    CL4       System Identification (from SMFPRMxx SID      *        
                         Parameter)                                             
SMF6AWID DS    CL4       Subsystem ID                                           
SMF6ASTP DS    H         Record Subtype                                         
*                                                                               
* ********************************************************************          
* *   SELF DEFINING SECTION                                          *          
* ********************************************************************          
*                                                                               
*                                                                               
SMF6ASDS DS    CL40      Self Defining Section                                  
         ORG   SMF6ASDS                                                         
SMF6ASDL DS    F         Length of Self Defining Section                        
SMF6APOF DS    F         Offset to Product Section                              
SMF6APLN DS    H         Length of Product Section                              
SMF6APON DS    H         Number of Product Section                              
SMF6AEOF DS    F         Offset to Common Execution env                         
SMF6AELN DS    H         Length of Common Execution env                         
SMF6AEON DS    H         Number of Common Execution env                         
SMF6ADOF DS    F         Offset to CMSET/CMD Data                               
SMF6ADLN DS    H         Length of CMSET/CMD Data                               
SMF6ADON DS    H         Number of CMSET/CMD Data                               
*                                                                               
*                                                             ]                 
*                                                                               
*                                                                               
SMF6AROF DS    F         Offset to REST data section                            
SMF6ARLN DS    H         Length of REST data section                            
SMF6ARON DS    H         Number of REST data section                            
SMF6A_NUM_OF_REST_RECS DS F Num of REST Recs                                    
SMFRCD6A_LEN EQU *-SMFRCD6A                                                     
.L0002   ANOP                                                                   
         AIF   ('&SMF6APSD' EQ 'NO').L0005                                      
         AIF   ('&DSECT' EQ 'YES').L0006                                        
         AIF   ('&SMF6APSD' NE 'YES').L0005                                     
.L0006   ANOP                                                                   
*                                                                               
* ********************************************************************          
* *   PRODUCT SECTION                                                *          
* ********************************************************************          
*                                                                               
*                                                                               
         AIF   ('&DSECT' EQ 'YES').L0007                                        
SMF6APSD DS    0X                                                               
         AGO   .L0008                                                           
.L0007   ANOP                                                                   
SMF6APSD DSECT                                                                  
.L0008   ANOP                                                                   
SMF6ARVN DS    CL2       Record Version Number                                  
SMF6APNM DS    CL8       Product Name - 'BCPII '                                
SMF6AOSL DS    CL8       MVS Product Level                                      
SMF6ASYN DS    CL8       Current System Name (from SYSNAME PARMLIB     *        
                         option)                                                
SMF6APSD_LEN EQU *-SMF6APSD                                                     
.L0005   ANOP                                                                   
         AIF   ('&SMF6AESD' EQ 'NO').L0009                                      
         AIF   ('&DSECT' EQ 'YES').L000A                                        
         AIF   ('&SMF6AESD' NE 'YES').L0009                                     
.L000A   ANOP                                                                   
*                                                                               
* ********************************************************************          
* *   Execution environment                                          *          
* ********************************************************************          
*                                                                               
*                                                                               
         AIF   ('&DSECT' EQ 'YES').L000B                                        
SMF6AESD DS    0H                                                               
         AGO   .L000C                                                           
.L000B   ANOP                                                                   
SMF6AESD DSECT                                                                  
.L000C   ANOP                                                                   
SMF6ACTP DS    H         Connect type from HWICONN                              
SMF6ACPC DS    CL17      CPC Name                                               
SMF6ANLL DS    CL1       Word boundary use                                      
SMF6ARTN DS    CL16      Request parameter                                      
SMF6AASD DS    H         2 Byte Address space ID ASID                           
SMF6AJOB DS    CL8       Job name                                               
SMF6AUSR DS    CL8       User name                                              
SMF6AESD_LEN EQU *-SMF6AESD                                                     
.L0009   ANOP                                                                   
         AIF   ('&SMF6ASET' EQ 'NO').L000D                                      
         AIF   ('&DSECT' EQ 'YES').L000E                                        
         AIF   ('&SMF6ASET' NE 'YES').L000D                                     
.L000E   ANOP                                                                   
*                                                                               
* ********************************************************************          
* *   HWISET data (Type 1)                                           *          
* ********************************************************************          
*                                                                               
*                                                                               
         AIF   ('&DSECT' EQ 'YES').L000F                                        
SMF6ASET DS    0F                                                               
         AGO   .L0010                                                           
.L000F   ANOP                                                                   
SMF6ASET DSECT                                                                  
.L0010   ANOP                                                                   
SMF6ATYP DS    F         Set Type                                               
SMF6ATVL DS    F         Set Type Value Len                                     
SMFSETDA DS    CL257     Set Parameter Data                                     
SMF6ASET_LEN EQU *-SMF6ASET                                                     
.L000D   ANOP                                                                   
         AIF   ('&SMF6ACMD' EQ 'NO').L0011                                      
         AIF   ('&DSECT' EQ 'YES').L0012                                        
         AIF   ('&SMF6ACMD' NE 'YES').L0011                                     
.L0012   ANOP                                                                   
*                                                                               
* ********************************************************************          
* *   HWICMD data (Type 2)                                           *          
* ********************************************************************          
*                                                                               
*                                                                               
         AIF   ('&DSECT' EQ 'YES').L0013                                        
SMF6ACMD DS    0F                                                               
         AGO   .L0014                                                           
.L0013   ANOP                                                                   
SMF6ACMD DSECT                                                                  
.L0014   ANOP                                                                   
SMF6ACTY DS    F         Command type                                           
SMF6AAOS DS    F         CMD Parameter Data Offset                              
SMFCMDPM DS    CL328     CMD Passed in Parameter.                               
SMF6ACMD_LEN EQU *-SMF6ACMD                                                     
.L0011   ANOP                                                                   
         AIF   ('&SMF6ADAT' EQ 'NO').L0015                                      
         AIF   ('&DSECT' EQ 'YES').L0016                                        
         AIF   ('&SMF6ADAT' NE 'YES').L0015                                     
SMF6ADAT DS    0F                                                               
         AGO   .L0017                                                           
.L0016   ANOP                                                                   
SMF6ADAT DSECT                                                                  
.L0017   ANOP                                                                   
SMFCMDDL DS    F         XML or IPL Token data length                           
SMFCMDDA DS    CL3483    XML or IPL Token data                                  
SMF6ADAT_LEN EQU *-SMF6ADAT                                                     
.L0015   ANOP                                                                   
         AIF   ('&SMF6A_REST' EQ 'NO').L0018                                    
         AIF   ('&DSECT' EQ 'YES').L0019                                        
         AIF   ('&SMF6A_REST' NE 'YES').L0018                                   
.L0019   ANOP                                                                   
*                                                                               
* ********************************************************************          
* *   HWIREST data                                             ]@LQA *          
* ********************************************************************          
*                                                                               
*                                                                               
         AIF   ('&DSECT' EQ 'YES').L001A                                        
SMF6A_REST DS  0F                                                               
         AGO   .L001B                                                           
.L001A   ANOP                                                                   
SMF6A_REST DSECT                                                                
.L001B   ANOP                                                                   
SMF6A_REST_RQST_IDL DS F REST Request Id Len                                    
SMF6A_REST_RQST_ID DS CL64 REST Request Id                                      
SMF6A_REST_SEQ_NUM DS F  REST SMF Sequence Num                                  
SMF6A_REST_MTHD DS F     REST Http Method                                       
SMF6A_REST_ENCD DS F     REST Encoding                                          
SMF6A_REST_URIL DS F     REST URI Length                                        
SMF6A_REST_URI DS CL2048 REST URI                                               
SMF6A_REST_TARGETNAMEL DS F REST Targetname Len                                 
SMF6A_REST_TARGETNAME DS CL256 REST Targetname                                  
SMF6A_REST_RQST_BDYL DS F REST Request Body Len                                 
SMF6A_REST_RQST_BDY DS CL10000 REST Request Body                                
*                                                                               
* ********************************************************************          
* *   HWISMF6A - CONSTANTS                                           *          
* ********************************************************************          
*                                                                               
*                                                                               
SMF6A_SMF_RECORD_TYPE EQU 106 Value of SMF6ARTY record-type            *        
                         106(decimal)                                           
SMF6A_SMF_HWISET_SUBTYPE EQU 1 HWICMSET data                                    
SMF6A_SMF_HWICMD_SUBTYPE EQU 2 HWICMCMD data                                    
SMF6A_SMF_RECORD_VERSION EQU C'02' ]                                            
SMF6A_REST_LEN EQU *-SMF6A_REST                                                 
.L0018   ANOP                                                                   
         AIF   ('&ZCBPRINT' EQ 'NO').P3                                         
         AIF   ('&LIST' EQ 'YES').P4                                            
.P3      ANOP                                                                   
         POP   PRINT                                                            
.P4      ANOP                                                                   
.P_EXIT  ANOP                                                                   
         MEND                                                                   
**/ HWISMF6A_2:;                                                                
* %HWISMF6A_INCLUDED = 'YES';                                                   
* %DCL ZCBPRINT CHAR EXT;                                                       
* %DEACTIVATE ZCBPRINT;                                                         
* %DCL HWISMF6A_LIST CHAR EXT;                                                  
* %DEACTIVATE HWISMF6A_LIST;                                                    
* %IF HWISMF6A_LIST = 'NO' !                                                    
*    ZCBPRINT = 'NO' %THEN                                                      
* %DO;                                                                          
*   @LIST PUSH NOECHO;                                                          
*   @LIST NOASSEMBLE NOECHO;                                                    
*   @LIST OFF C NOECHO;                                                         
* %END;                                                                         
*/* Start of PL/X Source                                             */         
*                                                                               
* %IF IXGSMF6ABASE = '' %THEN                                                   
*   %GOTO IXGSMF6A_10;                                                          
*DCL 1 SMFRCD6A IXGSMF6ABASE,                                                   
*   %GOTO IXGSMF6A_20;                                                          
* %IXGSMF6A_10:;                                                                
*DCL 1 SMFRCD6A BASED,                                                          
* %IXGSMF6A_20:;                                                                
*                                                                               
*/********************************************************************/         
*/*   HEADER SECTION                                                 */         
*/********************************************************************/         
*                                                                               
*      3 SMF6ARPS,                  /* Record Header Section         */         
*        5 SMF6ALEN FIXED(15),      /* Record Length                 */         
*        5 SMF6ASEG FIXED(15),      /* Segment Descriptor            */         
*        5 SMF6AFLG CHAR(1),        /* Header Flag Byte              */         
*          7 * BIT(1),              /* BIT 0 - SUBSYSTEM name follows           
*                                      Standard Header               */         
*          7 * BIT(1),              /* BIT 1 - SUBTYPES Utilized     */         
*          7 * BIT(6),              /* BITS 2-7 Reserved             */         
*        5 SMF6ARTY CHAR(1),        /* Record Type - 6A              */         
*        5 SMF6ATME FIXED(31) BDY(HWORD),  /* Recd Written Time      */         
*        5 SMF6ADTE CHAR(4),        /* Record Written Date           */         
*        5 SMF6ASID CHAR(4),        /* System Identification (from   */         
*                                   /*   SMFPRMxx SID Parameter)     */         
*        5 SMF6AWID CHAR(4),        /* Subsystem ID                  */         
*        5 SMF6ASTP FIXED(15),      /* Record Subtype                */         
*/********************************************************************/         
*/*   SELF DEFINING SECTION                                          */         
*/********************************************************************/         
*                                                                               
*      3 SMF6ASDS,                  /* Self Defining Section         */         
*        5 SMF6ASDL FIXED(31),    /* Length of Self Defining Section */         
*        5 SMF6APOF FIXED(31),      /* Offset to Product Section     */         
*        5 SMF6APLN FIXED(15),      /* Length of Product Section     */         
*        5 SMF6APON FIXED(15),      /* Number of Product Section     */         
*        5 SMF6AEOF FIXED(31),      /* Offset to Common Execution env*/         
*        5 SMF6AELN FIXED(15),      /* Length of Common Execution env*/         
*        5 SMF6AEON FIXED(15),      /* Number of Common Execution env*/         
*        5 SMF6ADOF FIXED(31),      /* Offset to CMSET/CMD Data      */         
*        5 SMF6ADLN FIXED(15),      /* Length of CMSET/CMD Data      */         
*        5 SMF6ADON FIXED(15),      /* Number of CMSET/CMD Data      */         
*/*                                                           ]@LQA4 */         
*        5 SMF6AROF FIXED(31),      /* Offset to REST data section   */         
*        5 SMF6ARLN FIXED(15),      /* Length of REST data section   */         
*        5 SMF6ARON FIXED(15),      /* Number of REST data section   */         
*        5 SMF6A_NUM_OF_REST_RECS FIXED(32),  /* Num of REST Recs    */         
*/********************************************************************/         
*/*   PRODUCT SECTION                                                */         
*/********************************************************************/         
*                                                                               
*    1 SMF6APSD BASED(ADDR(SMFRCD6A)+SMF6APOF),  /*                  */         
*      3 SMF6ARVN CHAR(2),          /* Record Version Number         */         
*      3 SMF6APNM CHAR(8),          /* Product Name - 'BCPII   '     */         
*      3 SMF6AOSL CHAR(8),          /* MVS Product Level             */         
*      3 SMF6ASYN CHAR(8),          /* Current System Name (from */             
*                                   /* SYSNAME PARMLIB option)       */         
*/********************************************************************/         
*/*   Execution environment                                          */         
*/********************************************************************/         
*                                                                               
*    1 SMF6AESD BASED(ADDR(SMFRCD6A)+SMF6AEOF),                                 
*      3 SMF6ACTP FIXED(15),      /* Connect type from HWICONN       */         
*      3 SMF6ACPC CHAR(17),       /* CPC Name                        */         
*      3 SMF6ANLL CHAR(1),        /* Word boundary use               */         
*      3 SMF6ARTN CHAR(16),       /* Request parameter               */         
*      3 SMF6AASD FIXED(16),      /* 2 Byte Address space ID ASID    */         
*      3 SMF6AJOB CHAR(8),        /* Job name                        */         
*      3 SMF6AUSR CHAR(8),        /* User name                       */         
*/********************************************************************/         
*/*   HWISET data (Type 1)                                           */         
*/********************************************************************/         
*                                                                               
*    1 SMF6ASET BASED(ADDR(SMFRCD6A)+SMF6ADOF),                                 
*      3 SMF6ATYP FIXED(31),      /* Set Type                        */         
*      3 SMF6ATVL FIXED(31),      /* Set Type Value Len              */         
*      3 SMFSETDA CHAR(257),      /* Set Parameter Data              */         
*/********************************************************************/         
*/*   HWICMD data (Type 2)                                           */         
*/********************************************************************/         
*                                                                               
*    1 SMF6ACMD BASED(ADDR(SMFRCD6A)+SMF6ADOF),                                 
*      3 SMF6ACTY FIXED(31),      /* Command type                    */         
*      3 SMF6AAOS FIXED(31),      /* CMD Parameter Data Offset       */         
*      3 SMFCMDPM CHAR(328),      /* CMD Passed in Parameter.        */         
*    1 SMF6ADAT BASED(ADDR(SMFRCD6A)+SMF6AAOS),                                 
*      3 SMFCMDDL FIXED(31),      /* XML or IPL Token data length    */         
*      3 SMFCMDDA CHAR(3483),     /* XML or IPL Token data           */         
*/********************************************************************/         
*/*   HWIREST data                                             ]@LQA */         
*/********************************************************************/         
*                                                                               
*    1 SMF6A_REST BASED(ADDR(SMFRCD6A)+SMF6AROF),                               
*      3 SMF6A_REST_RQST_IDL    FIXED(32),  /* REST Request Id Len   */         
*      3 SMF6A_REST_RQST_ID     CHAR(64),   /* REST Request Id       */         
*      3 SMF6A_REST_SEQ_NUM     FIXED(32),  /* REST SMF Sequence Num */         
*      3 SMF6A_REST_MTHD        FIXED(32),  /* REST Http Method      */         
*      3 SMF6A_REST_ENCD        FIXED(32),  /* REST Encoding         */         
*      3 SMF6A_REST_URIL        FIXED(32),  /* REST URI Length       */         
*      3 SMF6A_REST_URI         CHAR(2048), /* REST URI              */         
*      3 SMF6A_REST_TARGETNAMEL FIXED(32),  /* REST Targetname Len   */         
*      3 SMF6A_REST_TARGETNAME  CHAR(256),  /* REST Targetname       */         
*      3 SMF6A_REST_RQST_BDYL   FIXED(32),  /* REST Request Body Len */         
*      3 SMF6A_REST_RQST_BDY    CHAR(10000);/* REST Request Body     */         
*/********************************************************************/         
*/*   HWISMF6A - CONSTANTS                                           */         
*/********************************************************************/         
*                                                                               
*DCL SMF6A_SMF_RECORD_TYPE FIXED(8) constant(106);/* Value of SMF6ARTY          
*                                            record-type 106(decimal)*/         
*                                                                               
*DCL SMF6A_SMF_HWISET_SUBTYPE FIXED(8) constant(1);  /* HWICMSET data*/         
*DCL SMF6A_SMF_HWICMD_SUBTYPE FIXED(8) constant(2);  /* HWICMCMD data*/         
*                                                                               
*DCL SMF6A_SMF_RECORD_VERSION CHAR(2) Constant('02');       /* ]@LQC */         
*/* End of PL/X Source                                               */         
* %IF HWISMF6A_LIST = 'NO' !                                                    
*    ZCBPRINT = 'NO' %THEN                                                      
* %DO;                                                                          
*   @LIST POP NOECHO;                                                           
* %END;                                                                         
* %END;                                                                         
