*                                                                       00001000
* %DCL HZSDPQE_INCLUDED CHAR EXT;                                       00002000
* %DEACTIVATE HZSDPQE_INCLUDED;                                         00003000
* %IF HZSDPQE_INCLUDED = '' %THEN                                       00004000
* %DO;                                                                  00005000
*/* Macro made bi-lingual on 15191. CBGEN compile date 12258         */ 00006000
*% /*                                                                   00007000
         MACRO                                                          00008000
         HZSDPQE &DSECT=YES,&LIST=YES,&TITLE=YES,&HZSDPQE=YES,         *00009000
               &DPQE_LASTUPDATEDBY_TYPE=COND                            00010000
                      GBLC  &HZSDPQE_INCLUDED                           00011000
                      GBLC  &ZCBPRINT                                   00012000
&HZSDPQE_INCLUDED     SETC  'YES'                                       00013000
                      AIF   ('&LIST' EQ 'NONE').P0                      00014000
                      AIF   ('&TITLE' EQ 'NO').P5                       00015000
 TITLE                'HZSDPQE  - Deleted Process Queue Element        *00016000
                         '                                              00017000
.P5                   ANOP                                              00018000
**/ HZSDPQE_1:;                                                         00019000
*/* START OF SPECIFICATIONS ******************************************* 00020000
*                                                                       00021000
*01* PROPRIETARY STATEMENT =                                            00022000
*                                                                       00023000
*    Licensed Materials - Property of IBM                               00024000
*    5694-A01                                                           00025000
*    COPYRIGHT IBM CORP. 2005,2008                                      00026000
*                                                                       00027000
*01* STATUS = HBB7750                                                   00028000
*                                                                       00029000
*01* END OF PROPRIETARY STATEMENT                                       00030000
*                                                                       00031000
*01* EXTERNAL CLASSIFICATION: GUPI                                      00032000
*01* END OF EXTERNAL CLASSIFICATION:                                    00033000
*                                                                       00034000
*01* DESCRIPTIVE NAME:  Deleted Process Queue Element                   00035000
*02*  ACRONYM:  DPQE                                                    00036000
*                                                                       00037000
*01* MACRO NAME:  HZSDPQE                                               00038000
*                                                                       00039000
*01* DSECT NAME:                                                        00040000
*     HZSDPQE                                                           00041000
*     DPQE_LASTUPDATEDBY_TYPE                                           00042000
*                                                                       00043000
*01* COMPONENT:  IBM Health Checker for z/OS (SCHZS)                    00044000
*                                                                       00045000
*01* EYE-CATCHER:  DPQE                                                 00046000
*02*   OFFSET:   0                                                      00047000
*02*   LENGTH:   4                                                      00048000
*                                                                       00049000
*01* STORAGE ATTRIBUTES:                                                00050000
*02*  SUBPOOL:  user-supplied                                           00051000
*02*  SUBPOOL INTERNAL:  Hchecker data space or private                 00052000
*02*  KEY:   user-supplied                                              00053000
*02*  KEY INTERNAL:   8                                                 00054000
*02*  RESIDENCY: user-supplied                                          00055000
*                                                                       00056000
*01* SIZE:                                                              00057000
*      HZSDPQE                 -- X'0400' bytes                         00058000
*      DPQE_LASTUPDATEDBY_TYPE -- X'0010' bytes                         00059000
*                                                                       00060000
*01* CREATED BY:                                                        00061000
*     A DPQE is created within a user-supplied area by HZSQUERY         00062000
*     processing when returning data about a deleted check              00063000
*                                                                       00064000
*01* CREATED BY INTERNAL:                                               00065000
*     A DPQE is created when a check is deleted                         00066000
*                                                                       00067000
*01* POINTED TO BY:                                                     00068000
*                                                                       00069000
*     None. Contained within HZSQUAAC DSECT.                            00070000
*                                                                       00071000
*01* POINTED TO BY INTERNAL:                                            00072000
*                                                                       00073000
*     DPQEs are chained via DPQE_Fwd_Chain and DPQE_Back_chain          00074000
*     The entire DPQE chain is anchored by XHC_DPQE_Base Ptr,           00075000
*                                                                       00076000
*01* SERIALIZATION:                                                     00077000
*     None required                                                     00078000
*                                                                       00079000
*01* FUNCTION:                                                          00080000
*02*   Map data about a check that has been deleted                     00081000
*                                                                       00082000
*01* METHOD OF ACCESS:                                                  00083000
*02*  ASM:                                                              00084000
*      HZSDPQE                                                          00085000
*           DSECT=YES!NO  -- Request DSECT definition                   00086000
*           HZSDPQE=YES!NO!COND -- Request Header record mapping        00087000
*                            USING on HZSDPQE                           00088000
*           DPQE_LASTUPDATEDBY_TYPE=YES!NO!COND -- Request mapping      00089000
*                            for LastUpdatedBy.                         00090000
*                            USING on DPQE_LASTUPDATEDBY_TYPE           00091000
*     Default: DSECT=YES,HZSDPQE=YES,DPQE_LASTUPDATEDBY_TYPE=COND       00092000
*     Notes: name=YES  => expand                                        00093000
*            name=NO   => do not expand                                 00094000
*            name=COND => expand only if DSECT=YES                      00095000
*                                                                       00096000
*02*   PL/X:                                                            00097000
*                                                                       00098000
*        ?ASAADMAC NAME(HZSDPQE)                                        00099000
*                                                                       00100000
*        By default, the DPQE is based on DPQE_Ptr. If other            00101000
*        basing is desired, use %DPQEBASED='xxxxx'.                     00102000
*        Or specify %HZSDPQE_TYPE = 'NODCL' to get a TYPE definition    00103000
*          with no additional DCLs                                      00104000
*                                                                       00105000
*01* DELETED BY:                                                        00106000
*        Caller of HZSQUERY                                             00107000
*                                                                       00108000
*01* DELETED BY INTERNAL:  IBM Health Checker for z/OS when             00109000
*                 one of the following occures:                         00110000
*                 * A check is added with the same check-name and       00111000
*                   check owner                                         00112000
*                 * Health Checker is shtdown.                          00113000
*                                                                       00114000
*01* FREQUENCY:  One DPQE per deleted check                             00115000
*                                                                       00116000
*01* DEPENDENCIES:  hzshdpqe.h Metal C header file                      00117000
*                                                                       00118000
*01* DISTRIBUTION LIBRARY:  AMACLIB                                     00119000
*                                                                       00120000
*01* CHANGE ACTIVITY:                                                   00121000
*  $L0=HCHECK   HZS7720,040401,PD00MP: Health Checker Initial release   00122000
*  $P1=ME01424  HZS7720,040804,PD00MP: Bilingual support                00123000
*  $L1=ME01560  HZS7720,040821,PD00ZJ: change basing default            00124000
*  $L2=HCR8     HBB7730 051001 PD00XB: R8                               00125000
*  $P2=MExxxxx  HBB7730 060418 PD00XB: LastUpdatedBy: System            00126000
*  $L8=HCR10    HBB7750 070101 PD00XB: R10                              00127000
*  $P3=ME10529  HBB7750,070701,PD00XB: R10                              00128000
*                                                                       00129000
* ****************************************************************      00130000
* *** Any and all changes to this macro MUST also be reflected ***      00131000
* *** in the corresponding Metal C header file hzshdpqe.h      ***      00132000
* ****************************************************************      00133000
*                                                                       00134000
* END OF SPECIFICATIONS *********************************************/  00135000
*% /*                                                                   00136000
.P0                   ANOP                                              00137000
                      AIF   ('&ZCBPRINT' EQ 'NO').P1                    00138000
                      AIF   ('&LIST' EQ 'YES').P2                       00139000
.P1                   ANOP                                              00140000
                      PUSH  PRINT                                       00141000
                      PRINT OFF                                         00142000
.P2                   ANOP                                              00143000
                      AIF   ('&HZSDPQE' EQ 'NO').L0002                  00144000
                      AIF   ('&DSECT' EQ 'YES').L0003                   00145000
                      AIF   ('&HZSDPQE' NE 'YES').L0002                 00146000
HZSDPQE               DS    0D     Deleted Process Queue Element        00147000
                      AGO   .L0004                                      00148000
.L0003                ANOP                                              00149000
HZSDPQE               DSECT        Deleted Process Queue Element        00150000
.L0004                ANOP                                              00151000
DPQE_ID               DS    CL4    Eye catcher: 'DPQE'                  00152000
DPQE_VERSION          DS    H      Version - 0 (Incompatible DPQE      *00153000
                                   mappings will result in new version *00154000
                                   numbers.)                            00155000
                      DS    CL2    Reserved                             00156000
DPQE_RESERVED1        DS    CL8    RESERVED FOR IBM PROPRIETARY        *00157000
                                   PROGRAMMING SUPPORT                  00158000
DPQE_FLAGS            DS    BL4    Misc flags                           00159000
                      ORG   DPQE_FLAGS                                  00160000
DPQE_FLAGSB1          DS    B      Byte 1                               00161000
*  Bit definitions:                                                     00162000
DPQE_AVAILABLE        EQU   X'80'  =1: DPQE is available for reuse     *00163000
                                   (Entry is unused, or Check was      *00164000
                                   added back                           00165000
DPQE_FLAGSB2          DS    B      Byte 2                               00166000
*  Bit definitions:                                                     00167000
DPQE_REMOTE           EQU   X'80'  This is a REMOTE check               00168000
DPQE_REXX             EQU   X'40'                                       00169000
DPQE_FLAGSB3          DS    B      Byte 3                               00170000
                      ORG   DPQE_FLAGSB3                                00171000
                      DS    B      Reserved for future use              00172000
DPQE_FLAGSB4          DS    B      Byte 4                               00173000
*  Bit definitions:                                                     00174000
DPQE_GLOBAL_CHECK     EQU   X'80'  Check was global                     00175000
                      ORG   DPQE_FLAGS+4                                00176000
                      DS    CL4    Reserved                             00177000
DPQE_EXTENDED_TOD     DS    BL16   Place holder for extended tod        00178000
                      ORG   DPQE_EXTENDED_TOD                           00179000
                      DS    B      Wrap word                            00180000
DPQE_TOD              DS    BL8    TOD: When check was deleted          00181000
                      ORG   DPQE_TOD                                    00182000
DPQE_TOD_HIGH         DS    BL4    High order word of TOD               00183000
DPQE_TOD_LOW          DS    BL4    Low order word of TOD                00184000
                      DS    BL7    macro word                           00185000
DPQE_CHECKOWNERNAME   DS    CL48                                        00186000
                      ORG   DPQE_CHECKOWNERNAME                         00187000
DPQE_CHECKOWNER       DS    CL16                                        00188000
*                                                                       00189000
*                                      Owning company and/or            00190000
*                                      component                        00191000
*                                                                       00192000
DPQE_CHECKNAME        DS    CL32   Check name                           00193000
DPQE_CHECKEXITRTN     DS    CL8    Exit ModName that added this check   00194000
DPQE_LASTUPDATEDBY_AREA DS  CL16   Either policy statement name or     *00195000
                                   'HZSCHECK' !! jobname (HZSCHECK     *00196000
                                   macro) or 'COMMAND' (modify         *00197000
                                   command) or 'PARMLIB' (a statement  *00198000
                                   in a parmlib member). This is       *00199000
                                   mapped by the                       *00200000
                                   DPqe_LastUpdatedBy_Type DSECT        00201000
                      DS    CL16   Reserved for future use              00202000
DPQE_CATEGORYAREA     DS    CL260                                       00203000
                      ORG   DPQE_CATEGORYAREA                           00204000
DPQE_NUMCATEGORIESDEFINED DS F     Number of categories associated     *00205000
                                   with this check. The "n" categories *00206000
                                   occupy the first "n" slots in the   *00207000
                                   DPQE_CategoryArray.                  00208000
DPQE_CATEGORYARRAY    DS    CL16   array of categories associated with *00209000
                                   this check. There are               *00210000
                                   DPQE_MaxCategoryEntries contiguous  *00211000
                                   entries in the array. Each array    *00212000
                                   entry consists of a 16-byte         *00213000
                                   category and one byte of flags.      00214000
                      ORG   DPQE_CATEGORYARRAY                          00215000
DPQE_CATEGORY         DS    CL16   Category name                        00216000
                      ORG   DPQE_CATEGORYAREA+260                       00217000
                      DS    CL12   Padding                              00218000
DPQE_RESERVED2        DS    CL136  RESERVED FOR IBM PROPRIETARY        *00219000
                                   PROGRAMMING SUPPORT                  00220000
DPQE_TEXT_STRINGS     DS    CL64   Text strings that can be used for   *00221000
                                   display. Valid only as output from  *00222000
                                   HZSQUERY when TEXTSTRING=YES         00223000
                      ORG   DPQE_TEXT_STRINGS                           00224000
DPQE_TEXT_STRING_MODIFIEDBY DS CL24 For example,                       *00225000
                                   STMT(pppppppppppppppp). Valid only  *00226000
                                   as output from HZSQUERY when        *00227000
                                   TEXTSTRING=YES                       00228000
*                                                                       00229000
* ********************************************************************  00230000
* * DPQE and check-related constants                                 *  00231000
* ********************************************************************  00232000
*                                                                       00233000
*                                                                       00234000
CDPQE_ACRONYM         EQU   C'DPQE' Eye catcher for DPQE                00235000
CDPQE_VERSION         EQU   0      Version number for DPQE              00236000
DPQE_MAXCATEGORYENTRIES EQU 16                                          00237000
                      ORG   HZSDPQE+1024                                00238000
HZSDPQE_LEN           EQU   *-HZSDPQE                                   00239000
.L0002                ANOP                                              00240000
                      AIF   ('&DPQE_LASTUPDATEDBY_TYPE' EQ 'NO').L0005  00241000
                      AIF   ('&DSECT' EQ 'YES').L0006                   00242000
                      AIF   ('&DPQE_LASTUPDATEDBY_TYPE' NE 'YES').L0005*00243000
                                                                        00244000
DPQE_LASTUPDATEDBY_TYPE DS  0X                                          00245000
                      AGO   .L0007                                      00246000
.L0006                ANOP                                              00247000
DPQE_LASTUPDATEDBY_TYPE DSECT                                           00248000
.L0007                ANOP                                              00249000
DPQE_LASTUPDATEDBY_TYPE_UNION DS CL16                                   00250000
                      ORG   DPQE_LASTUPDATEDBY_TYPE_UNION               00251000
                      DS    CL16                                        00252000
                      ORG   DPQE_LASTUPDATEDBY_TYPE_UNION               00253000
DPQE_LASTUPDATEDBY_HZSCHECK_STRUCTURE DS CL16                           00254000
                      ORG   DPQE_LASTUPDATEDBY_HZSCHECK_STRUCTURE       00255000
DPQE_LASTUPDATEDBY_HZSCHECK_HEADER DS CL8                               00256000
DPQE_LASTUPDATEDBY_HZSCHECK_JOBNAME DS CL8                              00257000
                      ORG   DPQE_LASTUPDATEDBY_TYPE_UNION               00258000
DPQE_LASTUPDATEDBY_PARMLIB_STRUCTURE DS CL16                            00259000
                      ORG   DPQE_LASTUPDATEDBY_PARMLIB_STRUCTURE        00260000
DPQE_LASTUPDATEDBY_PARMLIB_HEADER DS CL8                                00261000
DPQE_LASTUPDATEDBY_PARMLIB_HZSPRMXX DS CL8                              00262000
                      ORG   DPQE_LASTUPDATEDBY_TYPE_UNION               00263000
DPQE_LASTUPDATEDBY_SYSTEM_AREA DS CL8                                   00264000
DPQE_LASTUPDATEDBY_HZSCHECK_0TO3 EQU C'HZSC' This is the first 4-byte  *00265000
                                   segment of an 8-byte constant. The  *00266000
                                   trailing 8 characters of the field  *00267000
                                   in this case are the jobname         00268000
DPQE_LASTUPDATEDBY_HZSCHECK_4TO7 EQU C'HECK' This is the second 4-byte *00269000
                                   segment of an 8-byte constant. The  *00270000
                                   trailing 8 characters of the field  *00271000
                                   in this case are the jobname         00272000
DPQE_LASTUPDATEDBY_COMMAND_0TO3 EQU C'COMM' This is the first 4-byte   *00273000
                                   segment of an 8-byte constant.       00274000
DPQE_LASTUPDATEDBY_COMMAND_4TO7 EQU C'AND ' This is the second 4-byte  *00275000
                                   segment of an 8-byte constant.       00276000
DPQE_LASTUPDATEDBY_PARMLIB_0TO3 EQU C'PARM' This is the first 4-byte   *00277000
                                   segment of an 8-byte constant. The  *00278000
                                   trailing 8 characters of the field  *00279000
                                   in this case are the parmlib member *00280000
                                   name                                 00281000
DPQE_LASTUPDATEDBY_PARMLIB_4TO7 EQU C'LIB ' This is the second 4-byte  *00282000
                                   segment of an 8-byte constant. The  *00283000
                                   trailing 8 characters of the field  *00284000
                                   in this case are the parmlib member *00285000
                                   name                                 00286000
DPQE_LASTUPDATEDBY_SYSTEM_0TO3 EQU C'SYST' This is the first 4-byte    *00287000
                                   segment of an 8-byte constant.       00288000
DPQE_LASTUPDATEDBY_SYSTEM_4TO7 EQU C'EM  ' This is the second 4-byte   *00289000
                                   segment of an 8-byte constant.       00290000
                      ORG   DPQE_LASTUPDATEDBY_TYPE+16                  00291000
DPQE_LASTUPDATEDBY_TYPE_LEN EQU *-DPQE_LASTUPDATEDBY_TYPE               00292000
.L0005                ANOP                                              00293000
                      AIF   ('&ZCBPRINT' EQ 'NO').P3                    00294000
                      AIF   ('&LIST' EQ 'YES').P4                       00295000
.P3                   ANOP                                              00296000
                      POP   PRINT                                       00297000
.P4                   ANOP                                              00298000
.P_EXIT               ANOP                                              00299000
                      MEND                                              00300000
**/ HZSDPQE_2:;                                                         00301000
* %HZSDPQE_INCLUDED = 'YES';                                            00302000
* %DCL ZCBPRINT CHAR EXT;                                               00303000
* %DEACTIVATE ZCBPRINT;                                                 00304000
* %DCL HZSDPQE_LIST CHAR EXT;                                           00305000
* %DEACTIVATE HZSDPQE_LIST;                                             00306000
* %IF HZSDPQE_LIST ^= 'NO' &                                            00307000
*    ZCBPRINT ^= 'NO' %THEN                                             00308000
*   %GOTO HZSDPQE_3;                                                    00309000
*   @LIST PUSH NOECHO;                                                  00310000
*   @LIST NOASSEMBLE NOECHO;                                            00311000
*   @LIST OFF C NOECHO;                                                 00312000
* %HZSDPQE_3:;                                                          00313000
*/* Start of PL/X Source                                             */ 00314000
*                                                                       00315000
*%DCL HZS_INTERNAL CHAR EXTERNAL;   /*                           @P3A*/ 00316000
*%HZSALET = '';                                                         00317000
*                                                                       00318000
*%IF HZSDPQE_TYPE ^= '' &                                               00319000
*    Translate(HZSDPQE_TYPE) ^= 'NO' %Then                              00320000
*%DO;                                                                   00321000
*  %HZSDPQE_ATTR_STRING = ' TYPE ';                                     00322000
*  %If Translate(HZSDPQE_TYPE) ^= 'NODCL' %Then                         00323000
*  %DO;                                                                 00324000
*  DCL bDPQE isa(HZSDPQE) based;                              /* @L8C*/ 00325000
*  %END;                                                                00326000
*%END;                                                                  00327000
*%ELSE %DO;                                                             00328000
*  %IF DPQEBASED='' %THEN                                               00329000
*  %DO;                                                                 00330000
*    %DPQEBASED='BASED(DPQE_Ptr) ';                                     00331000
*   %IF HZS_INTERNAL='YES' %THEN    /*                           @L8A*/ 00332000
*   %DO;                            /*                           @L8A*/ 00333000
*    DCL  DPQE_Ptr Ptr(64);         /* Pointer to the DPQE       @L8A*/ 00334000
*   %END;                           /*                           @L8A*/ 00335000
*   %ELSE %DO;                      /*                           @L8A*/ 00336000
*    DCL  DPQE_Ptr Ptr(31);         /* Pointer to the DPQE           */ 00337000
*   %END;                           /*                           @L8A*/ 00338000
*  %END;                                                                00339000
*  %HZSDPQE_ATTR_STRING = DPQEBASED !! HZSALET;                         00340000
*%END;                                                                  00341000
*Dcl                                                                    00342000
*  1  HZSDPQE Bdy(DWord) char(1024) HZSDPQE_ATTR_STRING                 00343000
*                       ,           /* Deleted Process Queue Element */ 00344000
*    3  DPQE_ID   Char(4),          /* Eye catcher: 'DPQE'           */ 00345000
*    3  DPQE_Version Fixed(15),     /* Version - 0 (Incompatible DPQE   00346000
*                                      mappings will result in new      00347000
*                                      version numbers.)             */ 00348000
*    3  * Char(2),                  /* Reserved                      */ 00349000
*    3  DPQE_Reserved1 char(8) BDY(DWORD), /* RESERVED FOR IBM          00350000
*                                    PROPRIETARY PROGRAMMING SUPPORT    00351000
*                                                                    */ 00352000
*  %IF HZS_INTERNAL='YES' %THEN     /*                               */ 00353000
*    %DO;                           /*                               */ 00354000
*      %HZSDPQEI_PART = '1';        /*                               */ 00355000
*      %INCLUDE SYSLIB(HZSDPQEI);   /*                               */ 00356000
*    %END;                          /*                               */ 00357000
*    3  DPQE_FLAGS Bit(32),         /* Misc flags                    */ 00358000
*     4  DPQE_FLAGSB1 BIT(8),       /* Byte 1                    @P1A*/ 00359000
*      5  DPQE_Available BIT(1),    /* =1: DPQE is available for reuse  00360000
*                                      (Entry is unused, or Check was   00361000
*                                      added back                    */ 00362000
*      5  *        Bit(7),          /* Reserved for future use       */ 00363000
*     4  DPQE_FLAGSB2 BIT(8),       /* Byte 2                    @P1A*/ 00364000
*      5 DPQE_Remote Bit(1),        /* This is a REMOTE check    @L2A*/ 00365000
*      5 DPQE_REXX Bit(1),          /*                           @L2A*/ 00366000
*      5 * Bit(6),                  /* Reserved for future use       */ 00367000
*     4  DPQE_FLAGSB3 BIT(8),       /* Byte 3                    @P1A*/ 00368000
*      5  *        Bit(8),          /* Reserved for future use       */ 00369000
*     4  DPQE_FLAGSB4 BIT(8),       /* Byte 4                    @P1A*/ 00370000
*      5  DPQE_Global_Check Bit(1), /* Check was global              */ 00371000
*      5  *        Bit(7),          /* Reserved for future use       */ 00372000
*    3  * Char(4),                  /* Reserved                      */ 00373000
*    3  DPQE_Extended_TOD bit(128) Bdy(Dword)                           00374000
*                                 , /* Place holder for extended tod */ 00375000
*      5 *        Bit(8),           /* Wrap word                     */ 00376000
*      5  DPQE_TOD bit(64),         /* TOD: When check was deleted   */ 00377000
*        7  DPQE_TOD_High BIT(32),  /* High order word of TOD        */ 00378000
*        7  DPQE_TOD_Low BIT(32),   /* Low order word of TOD         */ 00379000
*      5 *        Bit(56),          /* macro word                    */ 00380000
*    3  DPQE_CheckOwnerName,                                            00381000
*      5 DPQE_CheckOwner isa(DPQE_CheckOwner_Type) Bdy(DWord), /*       00382000
*                                      Owning company and/or            00383000
*                                      component                     */ 00384000
*      5 DPQE_CheckName isa(DPQE_CheckName_Type) Bdy(Dword), /*         00385000
*                                      Check name                    */ 00386000
*    3  DPQE_CheckExitRtn CHAR(8) bdy(Dword), /* Exit ModName that      00387000
*                                      added this check              */ 00388000
*    3  DPQE_LastUpdatedBy_Area                                         00389000
*         Char(Length(DPQE_LastUpdatedBy_Type)), /*                     00390000
*                                      Either policy statement name or  00391000
*                                      'HZSCHECK' !! jobname            00392000
*                                      (HZSCHECK macro) or              00393000
*                                      'COMMAND' (modify command) or    00394000
*                                      'PARMLIB' (a statement in a      00395000
*                                      parmlib member).                 00396000
*                                      This is mapped by the            00397000
*                                      DPqe_LastUpdatedBy_Type DSECT */ 00398000
*%IF HZSDPQE_ASMONLY = '' %THEN                                         00399000
*%DO;                                                                   00400000
*      5 DPQE_LastUpdatedBy isa(DPQE_LastUpdatedBy_Type),               00401000
*%END;                                                                  00402000
*    3  * Char(16) Bdy(Dword),      /* Reserved for future use       */ 00403000
*    3  DPQE_CategoryArea Bdy(Dword),                                   00404000
*     5 DPQE_NumcategoriesDefined Fixed(31), /* Number of categories    00405000
*                                    associated with this check.        00406000
*                                    The "n" categories occupy the      00407000
*                                    first "n" slots in the             00408000
*                                    DPQE_CategoryArray.             */ 00409000
*     5 DPQE_CategoryArray (DPQE_MaxCategoryEntries), /*                00410000
*                                    array of categories associated     00411000
*                                    with this check. There are         00412000
*                                    DPQE_MaxCategoryEntries            00413000
*                                    contiguous entries in the array.   00414000
*                                    Each array entry consists of       00415000
*                                    a 16-byte category and one         00416000
*                                    byte of flags.                  */ 00417000
*      7 DPQE_Category isa(DPQE_Category_Type),  /* Category name    */ 00418000
*   3 * Char(12),                   /* Padding                       */ 00419000
*   3  DPQE_Reserved2 char(136) BDY(DWORD), /* RESERVED FOR IBM         00420000
*                                    PROPRIETARY PROGRAMMING SUPPORT */ 00421000
*  %IF HZS_INTERNAL='YES' %THEN     /*                               */ 00422000
*    %DO;                           /*                               */ 00423000
*      %HZSDPQEI_PART = '2';        /*                               */ 00424000
*      %INCLUDE SYSLIB(HZSDPQEI);   /*                               */ 00425000
*    %END;                          /*                               */ 00426000
*   3 DPQE_Text_Strings Char(64) Bdy(Word), /* Text strings that        00427000
*                                      can be used for display. Valid   00428000
*                                      only as output from HZSQUERY     00429000
*                                      when TEXTSTRING=YES       @L1A*/ 00430000
*  %IF HZS_INTERNAL='YES' %THEN     /*                           @P3A*/ 00431000
*    %DO;                           /*                           @P3A*/ 00432000
*    4 * UNION,                     /*                           @P3A*/ 00433000
*    %END;                          /*                           @P3A*/ 00434000
*     5 DPQE_Text_String_ModifiedBy char(24), /* For example,           00435000
*                                      STMT(pppppppppppppppp). Valid    00436000
*                                      only as output from HZSQUERY     00437000
*                                      when TEXTSTRING=YES       @L1A*/ 00438000
*  %IF HZS_INTERNAL='YES' %THEN     /*                           @P3A*/ 00439000
*    %DO;                           /*                           @P3A*/ 00440000
*      %HZSDPQEI_PART = '3';        /*                           @P3A*/ 00441000
*      %INCLUDE SYSLIB(HZSDPQEI);   /*                           @P3A*/ 00442000
*    %END;                          /*                           @P3A*/ 00443000
*/********************************************************************/ 00444000
*/* DPQE and check-related constants                                 */ 00445000
*/********************************************************************/ 00446000
*cDPQE_acronym Constant('DPQE') Char(*), /* Eye catcher for DPQE     */ 00447000
*cDPQE_version Constant(0) fixed;   /* Version number for DPQE       */ 00448000
*Dcl DPqe_MaxCategoryEntries Constant(16);                              00449000
*Dcl DPqe_Category_Type Char(16) TYPE Synonym;                          00450000
*Dcl DPqe_Checkname_Type Char(32) TYPE Synonym;                         00451000
*Dcl DPqe_CheckOwner_Type Char(16) TYPE Synonym;                        00452000
*Dcl DPQE_PolicyStatementName Char(16) TYPE Synonym;                    00453000
*DCL 1 DPQE_LastUpdatedBy_Type TYPE                                     00454000
*      ,3 DPQE_LastUpdatedBy_Type_Union UNION                           00455000
*        ,5 * isa(DPQE_PolicyStatementName)                             00456000
*        ,5 DPQE_LastUpdatedBy_Hzscheck_Structure                       00457000
*          ,7 DPQE_LastUpdatedBy_Hzscheck_Header Char(8)                00458000
*          ,7 DPQE_LastUpdatedBy_Hzscheck_Jobname Char(8)               00459000
*        ,5 DPQE_LastUpdatedBy_Parmlib_Structure                        00460000
*          ,7 DPQE_LastUpdatedBy_Parmlib_Header Char(8)                 00461000
*          ,7 DPQE_LastUpdatedBy_Parmlib_HZSPRMxx Char(8)               00462000
*        ,5 DPQE_LastUpdatedBy_System_Area Char(8)            /* @P2A*/ 00463000
*          ;                                                            00464000
*Dcl DPQE_LastUpdatedBy_Hzscheck Char(8)                                00465000
*      Constant('HZSCHECK');     /* The trailing 8 characters of        00466000
*                         the field in this case are the jobname     */ 00467000
*Dcl DPQE_LastUpdatedBy_Command Char(8)                                 00468000
*      Constant('COMMAND ');                                            00469000
*Dcl DPQE_LastUpdatedBy_Parmlib Char(8)                                 00470000
*      Constant('PARMLIB ');    /* The trailing 8 characters of         00471000
*                         the field in this case are the parmlib        00472000
*                         member name                                */ 00473000
*Dcl DPQE_LastUpdatedBy_System Char(8)                                  00474000
*      Constant('SYSTEM  ');    /*                               @P2A*/ 00475000
* @LOGIC;                                                               00476000
* #PRAGMA TOOL=CBGEN.                                                   00477000
* #LINE.%HZSDPQE_ASMONLY = 'YES';                                       00478000
* #LINE.%INCLUDE SYSLIB(HZSDPQE);                                       00479000
* #USEORG.                                                              00480000
* #ALIGNOP.                                                             00481000
* #EPRAGMA.                                                             00482000
* @ENDLOGIC;                                                            00483000
*/* End of PL/X Source                                               */ 00484000
* %IF HZSDPQE_LIST ^= 'NO' &                                            00485000
*    ZCBPRINT ^= 'NO' %THEN                                             00486000
*   %GOTO HZSDPQE_4;                                                    00487000
*   @LIST POP NOECHO;                                                   00488000
* %HZSDPQE_4:;                                                          00489000
* %END;                                                                 00490000
