*                                                                       00001000
* %DCL HZSMGB_INCLUDED CHAR EXT;                                        00002000
* %DEACTIVATE HZSMGB_INCLUDED;                                          00003000
* %IF HZSMGB_INCLUDED = '' %THEN                                        00004000
* %DO;                                                                  00005000
*/* Macro made bi-lingual on 15191. CBGEN compile date 12258         */ 00006000
*% /*                                                                   00007000
         MACRO                                                          00008000
         HZSMGB &DSECT=YES,&LIST=YES,&TITLE=YES,&HZSMGB=YES,           *00009000
               &MGB_MsgInsertD=COND,&HZSMGB1=COND,                     *00010000
               &MGB1_MsgInsertDesc=COND                                 00011000
                      GBLC  &HZSMGB_INCLUDED                            00012000
                      GBLC  &ZCBPRINT                                   00013000
&HZSMGB_INCLUDED      SETC  'YES'                                       00014000
                      AIF   ('&LIST' EQ 'NONE').P0                      00015000
                      AIF   ('&TITLE' EQ 'NO').P5                       00016000
 TITLE                'HZSMGB  - Message Block                         *00017000
                        '                                               00018000
.P5                   ANOP                                              00019000
**/ HZSMGB_1:;                                                          00020000
*/* START OF SPECIFICATIONS ******************************************* 00021000
*                                                                       00022000
*01* PROPRIETARY STATEMENT =                                            00023000
*                                                                       00024000
*    Licensed Materials - Property of IBM                               00025000
*    5694-A01 COPYRIGHT IBM CORP. 2005,2007                             00026000
*                                                                       00027000
*01* STATUS = HBB7740                                                   00028000
*                                                                       00029000
*01* END OF PROPRIETARY STATEMENT                                       00030000
*                                                                       00031000
*01* EXTERNAL CLASSIFICATION: GUPI                                      00032000
*01* END OF EXTERNAL CLASSIFICATION:                                    00033000
*                                                                       00034000
*01* DESCRIPTIVE NAME:  Message Block                                   00035000
*02*  ACRONYM:  None                                                    00036000
*                                                                       00037000
*01* MACRO NAME:  HZSMGB                                                00038000
*                                                                       00039000
*01* DSECT NAME:                                                        00040000
*     HZSMGB                                                            00041000
*     MGB_MsgInsertD                                                    00042000
*     HZSMGB1                                                           00043000
*     MGB1_MsgInsertDesc                                                00044000
*                                                                       00045000
*01* COMPONENT:  IBM Health Checker for z/OS (SCHZS)                    00046000
*                                                                       00047000
*01* EYE-CATCHER:  NONE                                                 00048000
*                                                                       00049000
*01* STORAGE ATTRIBUTES:                                                00050000
*02*  SUBPOOL:    user-supplied                                         00051000
*02*  KEY:        HZSFMSG callers key                                   00052000
*02*  RESIDENCY:  z/OS Health CHecker                                   00053000
*                                                                       00054000
*01* SIZE:  variable                                                    00055000
*     HZSMGB             -- X'000C' bytes                               00056000
*     MGB_MsgInsertD     -- X'0002' bytes                               00057000
*     HZSMGB1            -- X'0008' bytes                               00058000
*     MGB1_MsgInsertDesc -- X'0008' bytes                               00059000
*                                                                       00060000
*01* CREATED BY:                                                        00061000
*     Caller of HZSFMSG macro.                                          00062000
*                                                                       00063000
*01* POINTED TO BY:                                                     00064000
*     HZSFMSG parameter list                                            00065000
*                                                                       00066000
*01* SERIALIZATION:                                                     00067000
*     None required                                                     00068000
*                                                                       00069000
*01* FUNCTION:                                                          00070000
*02* Maps the message id and variables used to write a message to       00071000
*    check buffer using HZSFMSG                                         00072000
*                                                                       00073000
*01* USAGE NOTES:                                                       00074000
*  For HZSMGB (HZSFMSG with MGBFORMAT=0)                                00075000
*   - Create an area big enough for N fillin addresses.                 00076000
*   - Fill in MGB_MessageNumber with the xreftext id of the             00077000
*     message you want to issue.                                        00078000
*   - Fill in MGB_insert_cnt with the number of fillins.                00079000
*   - Fill in "n" MGB_InsertAddr fields with the address of the         00080000
*     "n" fillins                                                       00081000
*   - Fill in each fillin with its length and the data.                 00082000
*  For HZSMGB1 (HZSFMSG with MGBFORMAT=1)                               00083000
*   - Create an area big enough for N fillin length/address pairs.      00084000
*   - Fill in MGB1_MessageNumber with the xreftext id of the            00085000
*     message you want to issue.                                        00086000
*   - Fill in MGB1_insert_cnt with the number of fillins.               00087000
*   - Fill in "n" MGB1_MsgInsertDescs fields with the length and        00088000
*     address of the "n" fillins                                        00089000
*                                                                       00090000
*01* METHOD OF ACCESS:                                                  00091000
*                                                                       00092000
*02*   PL/X:                                                            00093000
*                                                                       00094000
*        ?ASAADMAC NAME(HZSMGB)                                         00095000
*                                                                       00096000
*        By default, the MGB is based on the Mgb_PTR. If other          00097000
*        basing is desired, use %MGBBASED='xxxxxxxxxxxxxx'.             00098000
*        The number of inserts available is controlled by setting       00099000
*        %MGBINSERTCNT='nn'.  The default is 1 and the maximum          00100000
*        number of 20 is supported.                                     00101000
*                                                                       00102000
*        Note: DCL MGB_PTR PTR  is required when the default is used.   00103000
*                                                                       00104000
*02*   ASM:                                                             00105000
*                                                                       00106000
*        HZSMGB                                                         00107000
*        When using a MGBFORMAT=0 MGB (DSECT HZSMGB),                   00108000
*          If you are using more than one insert, be sure to allocate   00109000
*          enough space to hold the HZSMGB structure itself plus        00110000
*          four bytes for each insert beyond the first one.             00111000
*          When initializing the HZSMGB area, be sure to fill in the    00112000
*          appropriate MGB_InsertAddr for each insert.                  00113000
*        When using a MGBFORMAT=1 MGB (DSECT HZSMGB1),                  00114000
*          Be sure to allocate enough space to hold the HZSMGB1         00115000
*          structure plus eight bytes for each insert.                  00116000
*                                                                       00117000
*                                                                       00118000
*01* DELETED BY:  n/a                                                   00119000
*                                                                       00120000
*01* DEPENDENCIES:  hzshmgb.h Metal C header file                       00121000
*                                                                       00122000
*01* DISTRIBUTION LIBRARY:  AMACLIB                                     00123000
*                                                                       00124000
*01* CHANGE ACTIVITY:                                                   00125000
*                                                                       00126000
*  $L0=HCHECK   HZS7720,040401,PD00ZJ: Health Checker Initial release   00127000
*  $P1=ME01424  HZS7720,040804,PD00MP: Bilingual support                00128000
*  $P2=ME01717  HZS7720,040920,PD00ZJ: Usability reference              00129000
*  $L1=HCR8     HBB7730 051001 PD00XB: R8                               00130000
*  $P3=ME08493  HBB7740,061115,PD00MP: Fix copyright statement          00131000
*                                                                       00132000
* ****************************************************************      00133000
* *** Any and all changes to this macro MUST also be reflected ***      00134000
* *** in the corresponding Metal C header file hzshmgb.h       ***      00135000
* ****************************************************************      00136000
*                                                                       00137000
* END OF SPECIFICATIONS **********************************************/ 00138000
*% /*                                                                   00139000
.P0                   ANOP                                              00140000
                      AIF   ('&ZCBPRINT' EQ 'NO').P1                    00141000
                      AIF   ('&LIST' EQ 'YES').P2                       00142000
.P1                   ANOP                                              00143000
                      PUSH  PRINT                                       00144000
                      PRINT OFF                                         00145000
.P2                   ANOP                                              00146000
                      AIF   ('&HZSMGB' EQ 'NO').L0002                   00147000
                      AIF   ('&DSECT' EQ 'YES').L0003                   00148000
                      AIF   ('&HZSMGB' NE 'YES').L0002                  00149000
HZSMGB                DS    0F                                          00150000
                      AGO   .L0004                                      00151000
.L0003                ANOP                                              00152000
HZSMGB                DSECT                                             00153000
.L0004                ANOP                                              00154000
MGB_insert_structure  DS    0C                                          00155000
MGB_insert_structure_header DS CL8 Message inserts header               00156000
                      ORG   MGB_insert_structure_header                 00157000
MGB_MessageNumber     DS    F      The message number. This is the     *00158000
                                   value provided in                   *00159000
                                   "XREFTEXT=MessageNumber" within the *00160000
                                   <msgnum> tag of the message source.  00161000
                      ORG   MGB_MessageNumber                           00162000
MGB_ID                DS    F      Same as MGB_MessageNumber            00163000
MGB_insert_cnt        DS    F      The number of insert addresses in   *00164000
                                   the MGB_Insert_Structure_Entries    *00165000
                                   area                                 00166000
MGB_insert_structure_entries DS 0C                                      00167000
MGB_inserts           DS    A      An array of pointers, each of which *00168000
                                   contains the address of an area     *00169000
                                   mapped by Mgb_MsgInsertD. Note that *00170000
                                   if you use HZSMGB_LEN that will     *00171000
                                   provide room for only one insert,   *00172000
                                   so if you want more than one        *00173000
                                   insert, be sure to account for      *00174000
                                   that. For example, use HZSMGB_LEN + *00175000
                                   (n-1)*L'MGB_inserts where n is the  *00176000
                                   number of inserts                    00177000
                      ORG   MGB_inserts                                 00178000
Mgb_InsertAddr        DS    A      Address of the Mgb_MsgInsertD area  *00179000
                                   for the insert                       00180000
Mgb_MaxInserts        EQU   20     The maximum number of inserts        00181000
HZSMGB_Len            EQU   *-HZSMGB                                    00182000
.L0002                ANOP                                              00183000
                      AIF   ('&MGB_MsgInsertD' EQ 'NO').L0005           00184000
                      AIF   ('&DSECT' EQ 'YES').L0006                   00185000
                      AIF   ('&MGB_MsgInsertD' NE 'YES').L0005          00186000
.L0006                ANOP                                              00187000
*                                                                       00188000
* ********************************************************************  00189000
* * MGB_MsgInsertD is the insert desription, which is a contiguous   *  00190000
* * area consisting of a halfword length "m" followed by "m"         *  00191000
* * characters of data                                               *  00192000
* ********************************************************************  00193000
*                                                                       00194000
*                                                                       00195000
                      AIF   ('&DSECT' EQ 'YES').L0007                   00196000
MGB_MsgInsertD        DS    0H     Insert description                   00197000
                      AGO   .L0008                                      00198000
.L0007                ANOP                                              00199000
MGB_MsgInsertD        DSECT        Insert description                   00200000
.L0008                ANOP                                              00201000
MGB_MsgInsertD_Header DS    CL2                                         00202000
                      ORG   MGB_MsgInsertD_Header                       00203000
MGB_MsgILen           DS    H      The length of the insert For a null *00204000
                                   insert, use a length of 0.           00205000
MGB_MsgInsertD_Data   DS    0C                                          00206000
MGb_MsgIVal           DS    0C     The insert value                     00207000
Mgb_MaxInsertLen      EQU   256    The maximum length of an insert     *00208000
                                   unless otherwise indicated within   *00209000
                                   the HZSFMSG macro                    00210000
MGB_MsgInsertD_Len    EQU   *-MGB_MsgInsertD                            00211000
.L0005                ANOP                                              00212000
                      AIF   ('&HZSMGB1' EQ 'NO').L0009                  00213000
                      AIF   ('&DSECT' EQ 'YES').L000A                   00214000
                      AIF   ('&HZSMGB1' NE 'YES').L0009                 00215000
.L000A                ANOP                                              00216000
*                                                                       00217000
* ********************************************************************  00218000
* * HZSMGB1 maps the MGB when MGBFORMAT=1 is specified on HZSFMSG.   *  00219000
* ********************************************************************  00220000
*                                                                       00221000
*                                                                       00222000
                      AIF   ('&DSECT' EQ 'YES').L000B                   00223000
HZSMGB1               DS    0F                                          00224000
                      AGO   .L000C                                      00225000
.L000B                ANOP                                              00226000
HZSMGB1               DSECT                                             00227000
.L000C                ANOP                                              00228000
MGB1_insert_structure DS    CL8                                         00229000
                      ORG   MGB1_insert_structure                       00230000
MGB1_insert_structure_header DS CL8 Message inserts header              00231000
                      ORG   MGB1_insert_structure_header                00232000
MGB1_MessageNumber    DS    F      The message number. This is the     *00233000
                                   value provided in                   *00234000
                                   "XREFTEXT=MessageNumber" within the *00235000
                                   <msgnum> tag of the message source. *00236000
                                   This field need not be when         *00237000
                                   REQUEST=HZSMSG is specified on      *00238000
                                   HZSFMSG.                             00239000
                      ORG   MGB1_MessageNumber                          00240000
MGB1_ID               DS    F      Same as MGB1_MessageNumber           00241000
MGB1_insert_cnt       DS    F      The number of insert addresses in   *00242000
                                   the MGB1_Insert_Structure_Entries   *00243000
                                   area                                 00244000
MGB1_insert_structure_Entries DS 0C The start of a contiguous area     *00245000
                                   identifying the inserts. The area   *00246000
                                   consist of "MGB1_insert_cnt" 8-byte *00247000
                                   segments where each segment is      *00248000
                                   mapped by DSECT MGB1_MsgInsertDesc. *00249000
                                   Note that equate HZSMGB1_LEN        *00250000
                                   provides only enough room for the   *00251000
                                   HZSMGB1 area itself. To account for *00252000
                                   inserts as well, use something like *00253000
                                   HZSMGB1_Len +                        00254000
*                                  (n)*MGB1_MsgInsertDesc_Len where n  *00255000
                                   is the number of inserts             00256000
Mgb1_MaxInserts       EQU   20     The maximum number of inserts        00257000
HZSMGB1_Len           EQU   *-HZSMGB1                                   00258000
.L0009                ANOP                                              00259000
                      AIF   ('&MGB1_MsgInsertDesc' EQ 'NO').L000D       00260000
                      AIF   ('&DSECT' EQ 'YES').L000E                   00261000
                      AIF   ('&MGB1_MsgInsertDesc' NE 'YES').L000D      00262000
.L000E                ANOP                                              00263000
*                                                                       00264000
* ********************************************************************  00265000
* * MGB1_MsgInsertDesc provides the description (length and address) *  00266000
* * of a message insert when MGBFORMAT=1 is specified on HZSFMSG.    *  00267000
* ********************************************************************  00268000
*                                                                       00269000
*                                                                       00270000
                      AIF   ('&DSECT' EQ 'YES').L000F                   00271000
MGB1_MsgInsertDesc    DS    0F                                          00272000
                      AGO   .L0010                                      00273000
.L000F                ANOP                                              00274000
MGB1_MsgInsertDesc    DSECT                                             00275000
.L0010                ANOP                                              00276000
MGB1_MsgInsertDesc_Length DS H     The length of the insert. For a     *00277000
                                   null insert, use a length of 0.      00278000
                      DS    CL2    Reserved                             00279000
MGB1_MsgInsertDesc_Addr DS  A      The address of the insert. This     *00280000
                                   need not be set when the length is  *00281000
                                   0.                                   00282000
Mgb1_MaxInsertLen     EQU   256    The maximum length of an insert      00283000
MGB1_MsgInsertDesc_Len EQU  *-MGB1_MsgInsertDesc                        00284000
.L000D                ANOP                                              00285000
                      AIF   ('&ZCBPRINT' EQ 'NO').P3                    00286000
                      AIF   ('&LIST' EQ 'YES').P4                       00287000
.P3                   ANOP                                              00288000
                      POP   PRINT                                       00289000
.P4                   ANOP                                              00290000
.P_EXIT               ANOP                                              00291000
                      MEND                                              00292000
**/ HZSMGB_2:;                                                          00293000
* %HZSMGB_INCLUDED = 'YES';                                             00294000
* %DCL ZCBPRINT CHAR EXT;                                               00295000
* %DEACTIVATE ZCBPRINT;                                                 00296000
* %DCL HZSMGB_LIST CHAR EXT;                                            00297000
* %DEACTIVATE HZSMGB_LIST;                                              00298000
* %IF HZSMGB_LIST ^= 'NO' &                                             00299000
*    ZCBPRINT ^= 'NO' %THEN                                             00300000
*   %GOTO HZSMGB_3;                                                     00301000
*   @LIST PUSH NOECHO;                                                  00302000
*   @LIST NOASSEMBLE NOECHO;                                            00303000
*   @LIST OFF C NOECHO;                                                 00304000
* %HZSMGB_3:;                                                           00305000
*/* Start of PL/X Source                                             */ 00306000
*%IF MGBBASED = '' %THEN                                                00307000
*  %DO;                                                                 00308000
*    %MGBBASED = 'based(Mgb_Ptr)';                                      00309000
*  %END;                                                                00310000
*%IF MGBINSERTCNT = '' %THEN                                            00311000
*    %MGBINSERTCNT = '*';                                               00312000
*%IF Translate(HZSMGB_TYPE) = 'YES' %THEN                               00313000
*%DO;                                                                   00314000
*DCL   1 HZSMGB Bdy(word) Type,                                         00315000
*%END;                                                                  00316000
*%ELSE %DO;                                                             00317000
*DCL   1 HZSMGB  Bdy(word) MGBBASED,                                    00318000
*%END;                                                                  00319000
*        2 MGB_insert_structure,                                        00320000
*         3 MGB_insert_structure_header,  /* Message inserts header  */ 00321000
*          4 MGB_MessageNumber Fixed(31), /* The message number. This   00322000
*                              is the value provided in                 00323000
*                              "XREFTEXT=MessageNumber" within the      00324000
*                              <msgnum> tag of the message source.   */ 00325000
*            5 MGB_ID Fixed(31),          /* Same as MGB_MessageNumber  00326000
*                                                                    */ 00327000
*          4 MGB_insert_cnt Fixed (31),   /* The number of insert       00328000
*                              addresses in the                         00329000
*                              MGB_Insert_Structure_Entries area     */ 00330000
*         3 MGB_insert_structure_entries,                               00331000
*          4 MGB_inserts(MGBINSERTCNT) ptr(31),  /* An array            00332000
*                              of pointers, each of which contains the  00333000
*                              address of an area mapped by             00334000
*                              Mgb_MsgInsertD. Note that if you use     00335000
*                              HZSMGB_LEN that will provide room for    00336000
*                              only one insert, so if you want more     00337000
*                              than one insert, be sure to account for  00338000
*                              that. For example, use HZSMGB_LEN +      00339000
*                              (n-1)*L'MGB_inserts where n is the       00340000
*                              number of inserts                     */ 00341000
*            5 Mgb_InsertAddr Ptr(31);    /* Address of the             00342000
*                              Mgb_MsgInsertD area for the insert    */ 00343000
*Dcl Mgb_MaxInserts Constant(20);         /* The maximum number         00344000
*                              of inserts                            */ 00345000
*/********************************************************************/ 00346000
*/* MGB_MsgInsertD is the insert desription, which is a contiguous   */ 00347000
*/* area consisting of a halfword length "m" followed by "m"         */ 00348000
*/* characters of data                                               */ 00349000
*/********************************************************************/ 00350000
*%IF Translate(HZSMGB_TYPE) = 'YES' %THEN                               00351000
*%DO;                                                                   00352000
*DCL 1 MGB_MsgInsertD Type,               /* Insert description      */ 00353000
*%END;                                                                  00354000
*%ELSE %DO;                                                             00355000
*DCL 1 MGB_MsgInsertD  Based,             /* Insert description      */ 00356000
*%END;                                                                  00357000
*      3 MGB_MsgInsertD_Header,                                         00358000
*          5 MGB_MsgILen Fixed(16),      /* The length of the insert    00359000
*                              For a null insert, use a length of 0. */ 00360000
*      3 MGB_MsgInsertD_Data,                                           00361000
*          5 MGb_MsgIVal Char(*);        /* The insert value         */ 00362000
*Dcl Mgb_MaxInsertLen Constant(256);     /* The maximum length of       00363000
*                              an insert unless otherwise indicated     00364000
*                              within the HZSFMSG macro          @L1A*/ 00365000
*/********************************************************************/ 00366000
*/* HZSMGB1 maps the MGB when MGBFORMAT=1 is specified on HZSFMSG.   */ 00367000
*/********************************************************************/ 00368000
*DCL   1 HZSMGB1 Type,                                        /* @L1A*/ 00369000
*        2 MGB1_insert_structure,                             /* @L1A*/ 00370000
*         3 MGB1_insert_structure_header, /* Message inserts header     00371000
*                                                                @L1A*/ 00372000
*          4 MGB1_MessageNumber Fixed(31), /* The message number. This  00373000
*                              is the value provided in                 00374000
*                              "XREFTEXT=MessageNumber" within the      00375000
*                              <msgnum> tag of the message source.      00376000
*                              This field need not be                   00377000
*                              when REQUEST=HZSMSG is specified on      00378000
*                              HZSFMSG.                          @L1A*/ 00379000
*            5 MGB1_ID Fixed(31),      /* Same as MGB1_MessageNumber    00380000
*                                                                @L1A*/ 00381000
*          4 MGB1_insert_cnt Fixed (31),  /* The number of insert       00382000
*                              addresses in the                         00383000
*                              MGB1_Insert_Structure_Entries area       00384000
*                                                                @L1A*/ 00385000
*         3 MGB1_insert_structure_Entries Char(0);  /* The start        00386000
*                              of a contiguous area identifying the     00387000
*                              inserts. The area consist of             00388000
*                              "MGB1_insert_cnt" 8-byte segments        00389000
*                              where each segment is mapped by          00390000
*                              DSECT MGB1_MsgInsertDesc. Note that      00391000
*                              equate HZSMGB1_LEN provides only         00392000
*                              enough room for the HZSMGB1 area         00393000
*                              itself. To account for inserts as well,  00394000
*                              use something like HZSMGB1_Len +         00395000
*                              (n)*MGB1_MsgInsertDesc_Len where n is    00396000
*                              the number of inserts             @L1A*/ 00397000
*Dcl Mgb1_MaxInserts Constant(Mgb_MaxInserts);  /* The maximum number   00398000
*                              of inserts                        @L1A*/ 00399000
*/********************************************************************/ 00400000
*/* MGB1_MsgInsertDesc provides the description (length and address) */ 00401000
*/* of a message insert when MGBFORMAT=1 is specified on HZSFMSG.    */ 00402000
*/********************************************************************/ 00403000
*DCL   1 MGB1_MsgInsertDesc Type,                             /* @L1A*/ 00404000
*        2 MGB1_MsgInsertDesc_Length Fixed(15), /* The length of the    00405000
*                              insert. For a null insert, use a         00406000
*                              length of 0.                          */ 00407000
*        2 * Char(2),          /* Reserved                       @L1A*/ 00408000
*        2 MGB1_MsgInsertDesc_Addr Ptr(31); /* The address of the       00409000
*                              insert. This need not be set when        00410000
*                              the length is 0.                  @L1A*/ 00411000
*Dcl Mgb1_MaxInsertLen Constant(Mgb_MaxInsertLen)                       00412000
*                                   ;    /* The maximum length of       00413000
*                                           an insert            @L1A*/ 00414000
*@LOGIC;                                                                00415000
*#PRAGMA TOOL=CBGEN.                                                    00416000
* #LINE.DCL MGB_PTR Ptr;                                                00417000
* #LINE.%INCLUDE SYSLIB(HZSMGB);                                        00418000
*#USEORG.                                                               00419000
*#ALIGNOP.                                                              00420000
*#NOTUPPER.                                                             00421000
*#EPRAGMA.                                                              00422000
*@ENDLOGIC;                                                             00423000
*/* End of PL/X Source                                               */ 00424000
* %IF HZSMGB_LIST ^= 'NO' &                                             00425000
*    ZCBPRINT ^= 'NO' %THEN                                             00426000
*   %GOTO HZSMGB_4;                                                     00427000
*   @LIST POP NOECHO;                                                   00428000
* %HZSMGB_4:;                                                           00429000
* %END;                                                                 00430000
