*        %GOTO ASINCMTS;          /* Bilingual Mapping Macro            00010000
         MACRO                                                          00020000
         IAZASINF ,                                                     00030000
*          */                                                           00040000
*        %ASINCMTS: ;                                             /* */ 00050000
*/**** START OF SPECIFICATIONS *******************************          00060000
.****PROPRIETARY-STATEMENT************************************          00070000
.*01* PROPRIETARY STATEMENT:                                 *          00080000
.*                                                           *          00090000
.*    LICENSED MATERIALS-PROPERTY OF IBM                     *          00100000
.*    5650-ZOS Copyright IBM Corp. 2015                      *          00110000
.*    STATUS:  HBB77A0                                       *          00120000
.*                                                           *          00130000
.****END-OF-PROPRIETARY-STATEMENT*****************************          00140000
*                                                            *          00150000
*01* DESCRIPTIVE NAME:  Active Step information mapping      *          00160000
*02*  ACRONYM:  IAZASINF                                     *          00170000
*                                                            *          00180000
*01* MACRO NAME:  IAZASINF                                   *          00190000
*                                                            *          00200000
*01* DSECT NAME:  ASINF                                      *          00210000
*01* LABEL PREFIX:  ASINF                                    *          00220000
*                                                            *          00230000
*01* COMPONENT ID:  JES Common (SC141)                       *          00240000
*                                                            *          00250000
*01* EXTERNAL CLASSIFICATION: GUPI                           *          00260000
*01* END OF EXTERNAL CLASSIFICATION:                         *          00270000
*                                                            *          00280000
*01* EYE-CATCHER:  ASIN                                      *          00290000
*02*  OFFSET:      0                                         *          00300000
*02*  LENGTH:      4                                         *          00310000
*                                                            *          00320000
*01* STORAGE ATTRIBUTES:                                     *          00330000
*02*  SUBPOOL:  caller                                       *          00340000
*02*  KEY:  Any                                              *          00350000
*02*  RESIDENCY: Any                                         *          00360000
*                                                            *          00370000
*01* SIZE:                                                   *          00380000
*                                                            *          00390000
*     See ASINSIZE equate                                    *          00400000
*                                                            *          00410000
*01* CREATED BY:  Caller of JES access method GET service    *          00420000
*                                                            *          00430000
*01* POINTED TO BY:  RPLERMSA in the IFGRPL mapping macro    *          00440000
*                                                            *          00450000
*01* SERIALIZATION: None required                            *          00460000
*                                                            *          00470000
*01* FUNCTION:                                               *          00480000
*                                                            *          00490000
*     This DSECT maps the information returned on the JES    *          00500000
*     access method GET interface for the active job step.   *          00510000
*     The caller provides the address of the area in         *          00520000
*     RPLERMSA and the length of the area in RPLEMLEN. JES   *          00530000
*     will then fill in this area on a successful GET (RC=0) *          00540000
*     via SRB of the unwritten buffer from the target        *          00550000
*     address space.                                         *          00560000
*                                                            *          00570000
*02*  In order for JES to set the output area, the caller    *          00580000
*     must set the eyecatcher in the first 4 bytes of the    *          00590000
*     area passed.                                           *          00600000
*                                                            *          00610000
*01* METHOD OF ACCESS:                                       *          00620000
*                                                            *          00630000
*02*  ASM:                                                   *          00640000
*      IAZASINF                                              *          00650000
*                                                            *          00660000
*02*  PL/X:                                                  *          00670000
*      %DCL ASINF_ATRB CHAR                                  *          00680000
*      %ASINF_ATRB = 'value'                                 *          00690000
*      %INCLUDE SYSLIB(IAZASINF)                             *          00700000
*                                                            *          00710000
*      where value is valid control block attributes,        *          00720000
*      such as 'BASED(ASINUSER)'.  If ASINF_ATRB='',         *          00730000
*      then 'BASED' will be used.                            *          00740000
*                                                            *          00750000
*01* DELETED BY:  Caller of JES access method                *          00760000
*                                                            *          00770000
*01* FREQUENCY: 1 per call to GET function                   *          00780000
*                                                            *          00790000
*01* RESTRICTIONS:  None                                     *          00800000
*                                                            *          00810000
****** END OF SPECIFICATIONS ********************************/          00820000
*/********************************************************************/ 00830000
*/*01* CHANGE ACTIVITY:                                              */ 00840000
*/*                                                                  */ 00850000
*/*01* A000000-999999    Created for z/OS 2.2                @Z22LEVT*/ 00860000
*/********************************************************************/ 00870000
*/************************************************************          00880000
*01* NOTES:                                                  *          00890000
*                                                            *          00900000
*                                                            *          00910000
*************************************************************/          00920000
*/*                                                                  */ 00930000
* % GOTO END_OF_ASM_ASIN; /*                                            00940000
*                                                                       00950000
ASINF    DSECT                                                          00960000
ASINEYE  DC    CL4'ASIN'           Eyecatcher (set by caller)           00970000
ASINLEN  DS    H                   Length of area filled in             00980000
ASINVER  DS    X                   Version of data                      00990000
ASINVER1 EQU   1                     Version 1 of IAZASINF              01000000
ASINVERC EQU   ASINVER1              Current version of data            01010000
         SPACE 1                                                        01020000
ASINFLG1 DS    B                   Flag byte                            01030000
         SPACE 1                                                        01040000
*------------------------------------------------------------*          01050000
*        Active Job Step information                         *          01060000
*------------------------------------------------------------*          01070000
         SPACE 1                                                        01080000
ASINSTPN DS    FL1                 Step number                          01090000
         DS    XL3                 Reserved                             01100000
ASINSTEP DS    CL8                 Step name                            01110000
ASINPROC DS    CL8                 Procedure name                       01120000
ASINPGMN DS    CL8                 Program name                         01130000
         SPACE 1                                                        01140000
         DS    XL20                Reserved                             01150000
ASINSIZ1 EQU   *-ASINF             Version 1 size of area               01160000
ASINSIZE EQU   *-ASINF             Size of area                         01170000
         SPACE 2                                                        01180000
         MEND  ,                                                        01190000
.*                                                                      01200000
**/                                                                     01210000
* % END_OF_ASM_ASIN: ;                                                  01220000
*                                                                       01230000
* %IF ASINF_ATRB = ''               /* If no attribute is specified  */ 01240000
*   %THEN                                                               01250000
*     %ASINF_ATRB = 'BASED';        /* establish default attribute   */ 01260000
*                                                                       01270000
*DECLARE                                                                01280000
*   1 ASINF   ASINF_ATRB,                                               01290000
*     3 ASINEYE      CHAR(4),       /* Eyecatcher (set by caller)    */ 01300000
*     3 ASINLEN      FIXED(16),     /* Length of area filled in      */ 01310000
*     3 ASINVER      FIXED(8),      /* Version of data               */ 01320000
*     3 ASINFLG1     BIT(8),        /* Flag byte                     */ 01330000
*       5  *         BIT(8),        /*   Reserved                    */ 01340000
*     3 ASINSTPN     FIXED(8),      /* Step number                   */ 01350000
*     3 *            CHAR(3),       /* Reserved                      */ 01360000
*     3 ASINSTEP     CHAR(8),       /* Step name                     */ 01370000
*     3 ASINPROC     CHAR(8),       /* Procedure name                */ 01380000
*     3 ASINPGMN     CHAR(8),       /* Program name                  */ 01390000
*     3 *            CHAR(20);            /* Reserved                */ 01400000
*                                                                       01410000
*   DCL ASINSIZ1  FIXED(15) CONSTANT(56); /* Size of ver 1 ASINF     */ 01420000
*   DCL ASINSIZE  FIXED(15) CONSTANT(LENGTH(ASINF)); /* Size of ASINF*/ 01430000
*   DCL ASINVER1  FIXED(8)  CONSTANT(1); /* Version 1 constant       */ 01440000
*   DCL ASINVERC  FIXED(8)  CONSTANT(1); /* Current version constant */ 01450000
*   DCL ASINEYEC  CHAR(4)   CONSTANT('ASIN'); /* Eyecatcher value    */ 01460000
* % IAZASINFEND: ;                                                      01470000
*/*                          END OF MACRO                            */ 99999999
