*        %GOTO CKPDCMT;           /* Bilingual Mapping Macro            00010000
         MACRO                                                          00020000
         IAZCKPD                                                        00030000
.*/      %CKPDCMT: ;                                              /* */ 00040000
*                                                                       00050000
*/**** START OF SPECIFICATIONS *******************************          00060000
.****PROPRIETARY-STATEMENT************************************          00070000
.*01* PROPRIETARY STATEMENT:                                 *          00080000
.*                                                           *          00090000
.*   LICENSED MATERIALS-PROPERTY OF IBM                      *          00100000
.*   5650-ZOS Copyright IBM Corp. 2017                       *          00110000
.*                                                           *          00120000
.*   STATUS = HBB77B0                                        *          00130000
.*                                                           *          00140000
.****END-OF-PROPRIETARY-STATEMENT*****************************          00150000
*                                                            *          00160000
*01* DESCRIPTIVE NAME: JES CKPT Information Parm List        *          00170000
*02*  ACRONYM:  IAZCKPD                                      *          00180000
*                                                            *          00190000
*01* MACRO NAME:  IAZCKPD                                    *          00200000
*                                                            *          00210000
*01* DSECT NAME:  CKPD                                       *          00220000
*01* LABEL PREFIX:  CKPD                                     *          00230000
*                                                            *          00240000
*01* COMPONENT ID:  JES Common (SC141)                       *          00250000
*                                                            *          00260000
*01* EXTERNAL CLASSIFICATION:  NONE                          *          00270000
*01* END OF EXTERNAL CLASSIFICATION:                         *          00280000
*                                                            *          00290000
*01* EYE-CATCHER:  CKPD                                      *          00300000
*02*  OFFSET:      CKPDSSID                                  *          00310000
*02*  LENGTH:      L'CKPDSSID                                *          00320000
*                                                            *          00330000
*01* STORAGE ATTRIBUTES:                                     *          00340000
*02*  SUBPOOL:  caller                                       *          00350000
*02*  KEY:  Any                                              *          00360000
*02*  RESIDENCY:                                             *          00370000
*      Virtual = 31 bit storage                              *          00380000
*      real    = 31 or 64 bit storage                        *          00390000
*02*  FREQUENCY = 1 per call to function code 71 with        *          00400000
*                 function request byte of SSJICKPD          *          00410000
*                                                            *          00420000
*01* SIZE:                                                   *          00430000
*                                                            *          00440000
*     See CKPDSZE                                            *          00450000
*                                                            *          00460000
*01* CREATED BY:                                             *          00470000
*                                                            *          00480000
*     Caller of SSI function 'SSOBSSJI' = 71                 *          00490000
*                                                            *          00500000
*01* POINTED TO BY:                                          *          00510000
*                                                            *          00520000
*     SSJIUSER in the SSOB extension                         *          00530000
*                                                            *          00540000
*01* SERIALIZATION:                                          *          00550000
*                                                            *          00560000
*     None                                                   *          00570000
*                                                            *          00580000
*01* FUNCTION:                                               *          00590000
*                                                            *          00600000
*     This macro provides the mapping of the parameter       *          00610000
*     list used by authorized programs to request the        *          00620000
*     Monitor Information function.                          *          00630000
*                                                            *          00640000
*01* METHOD OF ACCESS:                                       *          00650000
*                                                            *          00660000
*02*  ASM:                                                   *          00670000
*      IAZCKPD                                               *          00680000
*                                                            *          00690000
*02*  PL/X:                                                  *          00700000
*      %DCL CKPD_ATRB CHAR                                   *          00710000
*      %CKPD_ATRB = 'value'                                  *          00720000
*      %INCLUDE SYSLIB(IAZCKPD)                              *          00730000
*                                                            *          00740000
*      where value is a valid control block attribute,       *          00750000
*      such as 'BASED(SSJIUSER)'.  If CKPD_ATRB='',          *          00760000
*      then 'BASED' will be used.                            *          00770000
*                                                            *          00780000
*01* USED BY:                                                *          00790000
*                                                            *          00800000
*     This is used internally by the JES2 init deck checker  *          00810000
*     to request CKPT data.                                  *          00820000
*                                                            *          00830000
*01* DELETED BY:                                             *          00840000
*                                                            *          00850000
*     Caller                                                 *          00860000
*                                                            *          00870000
*01* FREQUENCY:                                              *          00880000
*                                                            *          00890000
*     1 per call to function code 71 with function request   *          00900000
*     byte of SSJICKPD                                       *          00910000
*                                                            *          00920000
*01* RESTRICTIONS:                                           *          00930000
*                                                            *          00940000
*     None                                                   *          00950000
*                                                            *          00960000
****** END OF SPECIFICATIONS ********************************/          00970000
*/********************************************************************/ 00980000
*/*01* CHANGE ACTIVITY:                                              */ 00990000
*/*                                                                  */ 01000000
*/* A000000-999999    Created for z/OS 2.3                   @Z23LICK*/ 01010000
*/********************************************************************/ 01020000
*/************************************************************          01030000
*01* NOTES:                                                  *          01040000
*                                                            *          01050000
*          Bilingual Mapping Macro (PL/AS and BAL)           *          01060000
*                                                            *          01070000
*        Dependencies =                                      *          01080000
*                                                            *          01090000
*          PL/AS Version = This macro uses the macro         *          01100000
*            variable CKPD_ATRB. CKPD_ATRB must be           *          01110000
*            declared and set to valid control block         *          01120000
*            attributes before the macro is invoked.         *          01130000
*                                                            *          01140000
*          BAL Version = None                                *          01150000
*                                                            *          01160000
*************************************************************/          01170000
*/*                                                                  */ 01180000
* % GOTO END_OF_ASM_CKPD; /*                                            01190000
*                                                                       01200000
CKPD     DSECT                                                          01210000
CKPDSSID DC    CL4'CKPD'           I.Eyecatcher                         01220000
CKPDLEN  DC    Y(CKPDSZE)          I.Length of CKPD area                01230000
CKPDVER  DC    0FL2'0'             I.CKPD caller version                01240000
CKPDVERL DC    AL1(CKPDCVRL)         I.CKPD version level               01250000
CKPDVERM DC    AL1(CKPDCVRM)         I.CKPD version modifier            01260000
         SPACE 1                                                        01270000
CKPDV010 EQU   X'0100'               Initial version of macro           01280000
CKPDSVR# EQU   X'0100'               Current version                    01290000
         SPACE 1                                                        01300000
CKPDCVRL EQU   1                     Current version level              01310000
CKPDCVRM EQU   0                     Current version modifier           01320000
         SPACE 1                                                        01330000
CKPDVERO DC    FL2'0'              O.Subsystem version/modifier         01340000
         DC    XL2'0'              Reserved for future use and          01350000
         DC    F'0'                  must be zero                       01360000
CKPDRETC DC    F'0'                O.Request return code                01370000
         DC    3F'0'               Reserved must be zero                01380000
         SPACE 1                                                        01390000
*------------------------------------------------------------*          01400000
*        Request type                                        *          01410000
*------------------------------------------------------------*          01420000
         SPACE 1                                                        01430000
CKPDREQ  DC    X'0'                I.Request type                       01440000
         SPACE 1                                                        01450000
CKPDRHCT EQU   1                     Get CKPTed HCT info                01460000
         SPACE 1                                                        01470000
         DC    XL3'0'              Reserved                             01480000
         SPACE 1                                                        01490000
CKPDXCFN DC    CL8' '              I.XCF group name to query            01500000
CKPDMEMB DC    CL4' '              I.Preferred member name (opt)        01510000
         DC    XL4'0'              Reserved                             01520000
         SPACE 1                                                        01530000
*------------------------------------------------------------*          01540000
*        Returned data area.  This 32K byte data area is     *          01550000
*        where the output of the request will be stored.     *          01560000
*        The output is mapped by $XREQ data area starting at *          01570000
*        XCKPREQ.                                            *          01580000
*------------------------------------------------------------*          01590000
         SPACE 1                                                        01600000
         DC    F'0'                Reserved                             01610000
CKPDBUFA DC    A(0)                IO. Address of 32K buffer            01620000
         SPACE 1                                                        01630000
         DC    11F'0'              Reserved must be zero                01640000
         SPACE 1                                                        01650000
         DS    0D                  Align length                         01660000
CKPDSZE1 EQU   *-CKPD              Version 1 length                     01670000
CKPDSZE  EQU   *-CKPD              Current length of area               01680000
         SPACE 2                                                        01690000
**************************************************************          01700000
*                                                            *          01710000
*        Reason codes                                        *          01720000
*        Values of SSJIRETN when SSOBRETN is zero for        *          01730000
*        function (values of SSJIFREQ) SSJICKPD.             *          01740000
*                                                            *          01750000
**************************************************************          01760000
         SPACE 1                                                        01770000
CKPDOK   EQU   0                   Success                              01780000
CKPDUNKN EQU   4                   Unknown function request             01790000
CKPDNCKD EQU   8                   Input validation error               01800000
CKPDNBUF EQU   12                  Required 32K buffer not passed       01810000
CKPDSTRG EQU   16                  Unable to obtain storage             01820000
CKPDXQRY EQU   20                  Unable to query other systems        01830000
CKPDNSYS EQU   24                  No active system found               01840000
CKPDSEND EQU   28                  Error sending message                01850000
         SPACE 2                                                        01860000
         MEND  ,                                                        01870000
.*                                                                      01880000
**/                                                                     01890000
* % END_OF_ASM_CKPD: ;                                                  01900000
*                                                                       01910000
* %IF CKPD_ATRB = ''               /* If no attribute is specified   */ 01920000
*   %THEN                                                               01930000
*     %CKPD_ATRB = 'BASED';        /* establish default attribute    */ 01940000
*                                                                       01950000
*DECLARE                                                                01960000
*   1 CKPD    CKPD_ATRB,                                                01970000
*     3 CKPDSSID CHAR(4),          /* I.Eyecatcher                   */ 01980000
*     3 CKPDLEN  FIXED(16),        /* I.Length of CKPD                  01990000
*                                         parameter list             */ 02000000
*     3 CKPDVER  FIXED(16),        /* I.CKPD input version           */ 02010000
*       5 CKPDVERL FIXED(8),       /*   I.CKPD version level         */ 02020000
*       5 CKPDVERM FIXED(8),       /*   I.CKPD version modifier      */ 02030000
*     3 CKPDVERO FIXED(16),        /* O.Subsystem version number     */ 02040000
*     3 *        FIXED(16),        /* Reserved                       */ 02050000
*     3 *        FIXED(32),        /* Reserved                       */ 02060000
*     3 CKPDRETC FIXED(32),        /* O.Request return code          */ 02070000
*     3 *(3)     FIXED(32),        /* Reserved                       */ 02080000
*     3 CKPDREQ  FIXED(8),         /* I.Request type                 */ 02090000
*     3 *        FIXED(24),        /* Reserved                       */ 02100000
*     3 CKPDXCFN CHAR(8),          /* I.XCF group name to query      */ 02110000
*     3 CKPDMEMB CHAR(4),          /* I.Preferred member name (opt)  */ 02120000
*     3 *        CHAR(4),          /* Reserved                       */ 02130000
*     3 *        FIXED(32),        /* Reserved                       */ 02140000
*     3 CKPDBUFA PTR(31),          /* IO. Address of 32K buffer      */ 02150000
*     3 *(11)    FIXED(32);        /* Reserved                       */ 02160000
*                                                                       02170000
*   DCL CKPDSZE  FIXED(15) CONSTANT(LENGTH(CKPD)); /* Size of CKPD   */ 02180000
*   DCL CKPDSZE1 FIXED(15) CONSTANT(LENGTH(CKPD)); /* Parameter end-    02190000
*                                        version 1 size              */ 02200000
*   DCL CKPDV010 FIXED(16)         /* z/OS 2.3 version level         */ 02210000
*                CONSTANT('0100'X);                                     02220000
*   DCL CKPDCVRL FIXED(8) CONSTANT(1); /* Current ver level          */ 02230000
*   DCL CKPDCVRM FIXED(8) CONSTANT(0); /* Current version modifier   */ 02240000
*   DCL CKPDEYEC  CHAR(4) CONSTANT('CKPD'); /* JES2 CKPT data ID     */ 02250000
*                                                                       02260000
*   DCL CKPDRHCT FIXED(8)  CONSTANT(1);  /* Get CKPTed HCT info      */ 02270000
*                                                                       02280000
*/********************************************************************/ 02290000
*/*                                                                  */ 02300000
*/*      Reason codes                                                */ 02310000
*/*      Values of SSJIRETN when SSOBRETN is zero for                */ 02320000
*/*      function (values of SSJIFREQ) SSJICKPD                      */ 02330000
*/*                                                                  */ 02340000
*/********************************************************************/ 02350000
*   DCL CKPDOK   FIXED(15) CONSTANT(0);  /* Success                  */ 02360000
*   DCL CKPDUNKN FIXED(15) CONSTANT(4);  /* Unknown function request */ 02370000
*   DCL CKPDNCKD FIXED(15) CONSTANT(8);  /* Input validation error   */ 02380000
*   DCL CKPDNBUF FIXED(15) CONSTANT(12); /* Req buffer not passed    */ 02390000
*   DCL CKPDSTRG FIXED(15) CONSTANT(16); /* Unable to obtain storage */ 02400000
*   DCL CKPDXQRY FIXED(15) CONSTANT(20); /* Unable to query JESXCF   */ 02410000
*   DCL CKPDNSYS FIXED(15) CONSTANT(24); /* No active system found   */ 02420000
* % IAZCKPDEND: ;                                                       02430000
*/*                          END OF MACRO                            */ 99999999
