*        %GOTO DSERVCMT;          /* Bilingual Mapping Macro            00100000
         MACRO                                                          00200000
         IAZDSERV                                                       00300000
*                                                                       00400000
*/**** START OF SPECIFICATIONS *******************************          00400800
.****PROPRIETARY-STATEMENT************************************          00401600
.*01* PROPRIETARY STATEMENT:                                 *          00402400
.*                                                           *          00403200
.*   LICENSED MATERIALS-PROPERTY OF IBM                      *          00404000
.*   5650-ZOS Copyright IBM Corp. 1990, 2019                 *          00405000
.*                                                           *          00406400
.*   STATUS:  HBB77C0                                        *          00407200
.*                                                           *          00408000
.****END-OF-PROPRIETARY-STATEMENT*****************************          00408800
*                                                            *          00409600
*01* DESCRIPTIVE NAME: JES Job Information Service Token List*          00410400
*02*  ACRONYM:  IAZDSERV                                     *          00411200
*                                                            *          00412000
*01* MACRO NAME:  IAZDSERV                                   * @520LSDS 00412800
*                                                            *          00413600
*01* DSECT NAME:  DSERV                                      *          00414000
*01* LABEL PREFIX:  DSRV                                     *          00414400
*                                                            *          00415200
*01* COMPONENT ID:  JES Common (SC141)                       *          00416000
*                                                            *          00416800
*      DISTRIBUTION LIBRARY = SYS1.MACLIB                    *          00417600
*                                                            *          00418400
*01* EXTERNAL CLASSIFICATION:  PSPI                          *          00419200
*01* END OF EXTERNAL CLASSIFICATION:                         *          00420000
*                                                            *          00420800
*01* EYE-CATCHER:  DSRV                                      *          00421600
*02*  OFFSET:      DSRVSSID                                  *          00422400
*02*  LENGTH:      L'DSRVSSID                                *          00423000
*                                                            *          00423200
*01* STORAGE ATTRIBUTES:                                     *          00424000
*02*  SUBPOOL:  caller                                       *          00424800
*02*  KEY:  1, caller must be in key 1                       *          00425600
*02*  RESIDENCY:                                             *          00426400
*      Virtual = any                                         *          00427200
*      real    = any                                         *          00428000
*02*  FREQUENCY = 1 per call to function code 71             *          00428800
*                                                            *          00429600
*01* SIZE:                                                   *          00430400
*                                                            *          00431200
*     See DSRVSZE                                            *          00432000
*                                                            *          00432800
*01* CREATED BY:                                             *          00433600
*                                                            *          00434400
*     caller of SSI function 'SSOBSSJI' = 71                 *          00435200
*                                                            *          00436000
*01* POINTED TO BY:                                          *          00436800
*                                                            *          00437600
*     SSJIUSER in the SSOB extension                         *          00438400
*                                                            *          00439200
*01* SERIALIZATION:                                          *          00440000
*                                                            *          00440800
*     None                                                   *          00441000
*                                                            *          00441600
*01* FUNCTION:                                               *          00442400
*                                                            *          00443200
*     This macro provides the mapping of the parameter       *          00444000
*     list used by authorized programs to request Job        *          00444800
*     Information Service from the JES checkpoint data       *          00445600
*     space.                                                 *          00446400
*                                                            *          00447200
*01* METHOD OF ACCESS:                                       *          00448000
*                                                            *          00448800
*02*  ASM:                                                   *          00449600
*      IADSERV                                               *          00450000
*                                                            *          00450400
*02*  PL/X:                                                  *          00451200
*      %DCL DSERV_ATRB CHAR                                  *          00452000
*      %DSERV_ATRB = 'value'                                 *          00452800
*      %INCLUDE SYSLIB(IAZDSERV)                             *          00453600
*                                                            *          00454400
*      where value is valid control block attributes,        *          00455200
*      such as 'BASED(SSJIUSER)'.  If DSERV_ATRB='',         *          00456000
*      then 'BASED' will be used.                            *          00456800
*                                                            *          00457600
*01* USED BY:                                                *          00458400
*                                                            *          00459000
*     This is used by authorized programs to request Job     *          00459200
*     Information Service from the JES checkpoint data       *          00460000
*     space.                                                 *          00460800
*                                                            *          00461600
*01* DELETED BY:                                             *          00462400
*                                                            *          00463200
*     caller                                                 *          00464000
*                                                            *          00464800
*01* FREQUENCY:                                              *          00465600
*                                                            *          00466400
*     1 per call to function code 71                         *          00467200
*                                                            *          00468000
*01* RESTRICTIONS:                                           *          00468800
*                                                            *          00469600
*     None                                                   *          00470400
*                                                            *          00471200
****** END OF SPECIFICATIONS ********************************/          00472000
*/********************************************************************/ 00472800
*/*01* CHANGE ACTIVITY:                                              */ 00473600
*/*                                                                  */ 00474400
*/* $410LCKV          HBB4410 890127 STH: Checkpoint Versioning      */ 00474600
*/* $410LCKV          HBB4410 890426 RPG: SSI Services recovery      */ 00474800
*/*                                                                  */ 00475000
*/* $520LSDS=SDSFIV   HBB5520 940510 W_C1: SDSF SYSPLEX Wide DA      */ 00475200
*/*                                                                  */ 00475400
*/* $Z02LG64=G64K     HBB7705 000908 JMS:  IAZ updates               */ 00475600
*/*                                                                  */ 00475800
*/* $Z07LTCP=NJETCP   HBB7720 040305 CLW:  NJE/TCP Transmitter Code  */ 00476000
*/*                                                                  */ 00476200
*/* $Z11LTJN=APIAPPC  HBB7760 081022 AAM:  Trans job name select     */ 00476400
*/*                                                                  */ 00476600
*/* $Z13LMIG=SPLMIG   HBB7780 110209 BWT:  SPOOL Migr SSI 82 code    */ 00476800
*/*                                                                  */ 00477000
*/* $MG16178=QUAL     HBB7790 110420 J_K2: IAZDSERV Compiler error   */ 00477200
*/*                                        MG16178                   */ 00477400
*/* $Z21LCLS=CLASS8   HBB7790 111127 KJK:  8 character jobclass      */ 00477600
*/* $Z21LVER=BASEQ    HBB7790 130102 TJW:  CKPT versions serializati */ 00477800
*/*                                                                  */ 00477840
*/* $Z22LDEP=DEPJOB   HBB77A0 140616 KJK:  Dep Job Control 1 - IAZDS */ 00477900
*/*                                                                  */ 00477930
*/* $Z24LRES=RESIL    HBB77C0 180222 BWT:  Resil - Fix $DADFRCT      */ 00477960
*/* $Z24L64B=64BDSERV HBB77C0 181112 TJW:  64 bit CKPT versions      */ 00477980
*/*                                                                  */ 00478000
*/*01* A000000-999999    Created for MVS  4.1.0              @410LCKV*/ 00478400
*/********************************************************************/ 00479200
*/************************************************************          00480000
*01* NOTES:                                                  *          00480800
*                                                            *          00481600
*          Bilingual Mapping Macro (PL/AS and BAL)           *          00482400
*                                                            *          00483200
*        Dependencies =                                      *          00484000
*                                                            *          00484800
*          PL/AS Version = This macro uses the macro         *          00485600
*            variable DSERV_ATRB. DSERV_ATRB must be         *          00486000
*            declared and set to valid control block         *          00486900
*            attributes before the macro is invoked.         *          00487800
*                                                            *          00488700
*          BAL Version = None                                *          00489600
*                                                            *          00490500
*     Additional functional information or internal info     *          00491400
*     can be put here.  This information will not appear     *          00492300
*     in the Data Areas publication.  If no information      *          00493200
*     for here at this time, say "None".                     *          00494100
*                                                            *          00495000
*     For compound structures such as arrays and lists,      *          00495900
*     describe the ordering of elements.                     *          00496800
*                                                            *          00497700
*************************************************************/          00498600
.*/      %DSERVCMT: ;                                             /* */ 00500000
*/*                                                                  */ 09200000
* % GOTO END_OF_ASM_DSRV; /*                                            09300000
*                                                                       09400000
         SPACE 1                                               @Z24L64B 09408000
*------------------------------------------------------------* @Z24L64B 09416000
*        This is the 31 bit data space version of the DSERV  * @Z24L64B 09424000
*        (aka as the type 1 DSERV).  See label DSERVX for    * @Z24L64B 09432000
*        the 64 bit (type 2) DSERV.                          * @Z24L64B 09440000
*                                                            * @Z24L64B 09448000
*        Note: The fields DSRVSSID, DSRVLEN, and DSRVSVRN    * @Z24L64B 09456000
*        must map to the same offsets as DSRXSSID, DSRXLEN,  * @Z24L64B 09464000
*        and DSRXSVRN                                        * @Z24L64B 09472000
*------------------------------------------------------------* @Z24L64B 09480000
         SPACE 1                                               @Z24L64B 09488000
DSERV    DSECT                                                          09500000
DSRVSSID DC    C'DSRV'            CONTROL BLOCK IDENTIFIER              09600000
DSRVLEN  DC    AL2(DSRVSZE)       LENGTH OF DSERV TOKEN AREA            09700000
DSRVSVRN DS    H                  SERVICE VERSION NUMBER                09800000
DSRVSVR1 EQU   1                  Service version number of    @520LSDSC09810000
                                     IAZDSERV - Version 4.1.0  @520LSDS 09820000
DSRVSVR2 EQU   2                  Service version number of    @520LSDSC09830000
                                     IAZDSERV - Version 5.2.0  @520LSDS 09840000
DSRVSVR3 EQU   3                  Service version number of    @Z02LG64C09850000
                                     IAZDSERV - z/OS 1.2       @Z02LG64 09860000
DSRVSVR4 EQU   4                  Service version number of    @Z07LTCPC09870000
                                     IAZDSERV - z/OS 1.7       @Z07LTCP 09880000
DSRVSVR5 EQU   5                  Service version number of      @Z23AYC09882000
                                     IAZDSERV - OA26875          @Z23AY 09888000
DSRVSVR6 EQU   6                  Service version number of    @Z11LTJNC09894000
                                     IAZDSERV - z/OS 1.11      @Z11LTJN 09900000
DSRVSVR7 EQU   7                  Service version number of    @Z13LMIGC09903000
                                     IAZDSERV - z/OS 1.13      @Z13LMIG 09906000
DSRVSVR8 EQU   8                  Service version number of    @Z21LCLSC09907000
                                     IAZDSERV - z/OS 2.1       @Z21LCLS 09908000
DSRVSVR9 EQU   9                  Service version number of    @Z22LDEPC09908400
                                     IAZDSERV - z/OS 2.2       @Z22LDEP 09909000
DSRVSVR# EQU   9                  Service version number of    @Z22LDEPC09910000
                                     IAZDSERV - Latest Version @Z22LDEP 10000000
*                                 DSRVSVRN MUST BE SET TO DSVRSVR#      10100000
DSRVUSER DS    0F                                              @Z24L64B 10110000
DSRVCVPT DS    A                  RESERVED FOR SUBSYSTEM USE            10200000
DSRVCNUM DS    F                  RESERVED FOR SUBSYSTEM USE            10300000
DSRVJOTK DS    0D                 JOT  TOKEN                            10400000
DSRVJOPT DS    A                   POINTER TO JOT                       10500000
DSRVJOAL DS    F                   ALET OF JOT                          10600000
DSRVJQTK DS    0D                 JQE  TOKEN                            10700000
DSRVJQPT DS    A                   POINTER TO JQE                       10800000
DSRVJQAL DS    F                   ALET OF JQE                          10900000
DSRVQSTK DS    0D                 QSE  TOKEN                            11000000
DSRVQSPT DS    A                   POINTER TO QSE                       11100000
DSRVQSAL DS    F                   ALET OF QSE                          11200000
DSRVHCTK DS    0D                 HCT  TOKEN                            11300000
DSRVHCPT DS    A                   POINTER TO HCT                       11400000
DSRVHCAL DS    F                   ALET OF HCT                          11500000
DSRVTIME DS    D                  TIME STAMP                            11600000
DSRVSZE1 EQU   *-DSERV            DSERV Version 1 fixed        @520LSDSC11610000
                                   parameter length            @520LSDS 11620000
DSRVJNTK DS    0D                 JNT  TOKEN                   @520LSDS 11630000
DSRVJNPT DS    A                   POINTER TO JNT              @520LSDS 11640000
DSRVJNAL DS    F                   ALET OF JNT                 @520LSDS 11650000
DSRVSZE2 EQU   *-DSERV            DSERV Version 2 fixed        @520LSDSC11660000
                                   parameter length            @520LSDS 11670000
DSRVJQXK DS    0D                 JQX token                    @Z02LG64 11672000
DSRVJXPT DS    A                   Pointer to JQX              @Z02LG64 11674000
DSRVJXAL DS    F                   ALET of JQX                 @Z02LG64 11676000
DSRVJTTK DS    0D                 JQE trackgroup extension     @Z02LG64C11678000
                                    token                               11680000
DSRVJTPT DS    A                   Pointer to JQE trkg ext     @Z02LG64 11682000
DSRVJTAL DS    F                   ALET of JQE trkg ext        @Z02LG64 11684000
DSRVDASK DS    0D                 DAS token                    @Z02LG64 11686000
DSRVDAPT DS    A                   Pointer to DAS              @Z02LG64 11688000
DSRVDAAL DS    F                   ALET of DAS                 @Z02LG64 11690000
DSRVSZE3 EQU   *-DSERV            DSERV Version 3 fixed        @Z02LG64C11690200
                                   parameter length            @Z02LG64 11690400
DSRVFLG1 DS    B                  DSERV flags                  @Z07LTCP 11690600
DSRVF1LI EQU   B'10000000'         Use live version            @Z07LTCP 11690800
         SPACE 1                                               @Z21LVER 11691000
*------------------------------------------------------------* @Z21LVER 11691200
*        The following flags will cause the version request  * @Z21LVER 11691400
*        to be delayed until the latest information is       * @Z21LVER 11691600
*        available from JES2.  Setting these bits can result * @Z21LVER 11691800
*        in additional processing overhead in JES2.  Setting * @Z21LVER 11692000
*        DSRVF1LI overrides this request.                    * @Z21LVER 11692200
*------------------------------------------------------------* @Z21LVER 11692400
         SPACE 1                                               @Z21LVER 11692600
DSRVF1WS EQU   B'01000000'         Wait for latest MAS level   @Z21LVERC11692800
                                     version                   @Z21LVER 11693000
DSRVF1WB EQU   B'00100000'         Wait for latest member      @Z21LVERC11693200
                                     level version             @Z21LVER 11693400
DSRVJ2LV DS    XL1                Checkpoint level ($MSTRVER)    @Z23BI 11693600
         DS    XL6                Reserved for future use        @Z23BI 11693800
DSRVSZE4 EQU   *-DSERV            DSERV Version 4 fixed        @Z07LTCPC11694000
                                   parameter length            @Z07LTCP 11694200
DSRVWQSK DS    0D                 WLM Q position token           @Z23AY 11694400
DSRVWQST DS    A                   Pointer to WQPOS              @Z23AY 11694600
DSRVWQSL DS    F                   ALET of WQPOS                 @Z23AY 11694800
DSRVSZE5 EQU   *-DSERV            DSERV Version 5 fixed          @Z23AYC11695000
                                   parameter length              @Z23AY 11695200
DSRVJOXK DS    0D                 JOX token                    @Z11LTJN 11695400
DSRVOXPT DS    A                   Pointer to JOX              @Z11LTJN 11695600
DSRVOXAL DS    F                   ALET of JOX                 @Z11LTJN 11695800
DSRVCNPT DS    A                  RESERVED FOR SUBSYSTEM USE   @Z11LTJN 11696000
DSRVSZE6 EQU   *-DSERV            DSERV Version 6 fixed          @Z23AYC11696200
                                   parameter length            @Z11LTJN 11696400
         DS    A                  Reserved for future use      @Z23D125 11696600
DSRVTGMK DS    0D                 TGM token                    @Z13LMIG 11696800
DSRVTGPT DS    A                   Pointer to TGM              @Z13LMIG 11697000
DSRVTGAL DS    F                   ALET of TGM                 @Z13LMIG 11697200
DSRVSZE7 EQU   *-DSERV            DSERV Version 7 fixed        @Z13LMIGC11697400
                                   parameter length            @Z13LMIG 11697600
         SPACE 1                                                        11697800
         DS    CL8                Reserved for future use.     @Z21LCLS 11698000
         SPACE 1                                                        11698200
DSRVCATC DS    A                  Pointer to CAT/GRPOBJ cache  @Z21LCLSC11698400
                                   if NOT a live version and   @Z21LCLSC11698600
                                   cache is requested.         @Z21LCLS 11698800
DSRVSZE8 EQU   *-DSERV            DSERV Version 8 fixed        @Z21LCLSC11699000
                                   parameter length            @Z21LCLS 11699200
         SPACE 1                                               @Z21LCLS 11699400
DSRVDFCT DS    F                  Total TG Free from DADCOUNT  @Z24LRESC11699460
                                    - includes BLOB            @Z24LRES 11699490
         SPACE 1                                               @Z22LDEP 11699520
DSRVZJTK DS    0D                 ZJC Token                    @Z22LDEP 11699580
DSRVZJPT DS    A                   Pointer to ZJC              @Z22LDEP 11699640
DSRVZJAL DS    F                   ALET of ZJC                 @Z22LDEP 11699700
         SPACE 1                                               @Z22LDEP 11699760
DSRVSZE9 EQU   *-DSERV            DSERV Version 9 fixed        @Z22LDEPC11699820
                                   parameter length            @Z22LDEP 11699880
         SPACE 1                                               @Z22LDEP 11699940
DSRVSZE  EQU   *-DSERV            DSERV Current version        @520LSDSC11700000
                                   fixed parameter length      @520LSDS 11710000
.*                                                                      11800000
         EJECT ,                                               @Z24L64B 11800800
*------------------------------------------------------------* @Z24L64B 11801700
*        This is the 64 bit storage version of the DSERV     * @Z24L64B 11802600
*        (aka the type 2 DSERV or the DSERVX).               * @Z24L64B 11803500
*                                                            * @Z24L64B 11804400
*        Note: The fields DSRXSSID, DSRXLEN, and DSRXSVRN    * @Z24L64B 11805300
*        must map to the same offsets as DSRVSSID, DSRVLEN,  * @Z24L64B 11806200
*        and DSRVSVRN                                        * @Z24L64B 11807100
*------------------------------------------------------------* @Z24L64B 11808000
         SPACE 1                                               @Z24L64B 11808900
DSERVX   DSECT                                                 @Z24L64B 11809800
DSRXSSID DC    C'DSRV'            Control block identifier     @Z24L64B 11810700
DSRXLEN  DC    AL2(DSRXSZE)       Length of DSERV token area   @Z24L64B 11811600
DSRXSVRN DS    H                  Service version number       @Z24L64B 11812500
DSRXSV10 EQU   10                 Service version number of    @Z24L64BC11813400
                                     IAZDSERV - z/OS 2.4       @Z24L64B 11814300
DSRXSVR# EQU   10                 Service version number of    @Z24L64BC11815200
                                     IAZDSERV - Latest Version @Z24L64B 11816100
*                                 Set DSRVSVRN to DSVRSVR#     @Z24L64B 11817000
DSRXUSER DS    0FD                                             @Z24L64B 11817900
         SPACE 1                                               @Z24L64B 11818800
DSRXCVPT DS    AD                 Reserved for subsystem use   @Z24L64B 11819700
DSRXCNPT DS    AD                 Reserved for subsystem use   @Z24L64B 11820600
         SPACE 1                                               @Z24L64B 11821500
DSRXFLG1 DS    B                  DSERV flags                  @Z24L64B 11822400
DSRXF1LI EQU   B'10000000'         Use live version            @Z24L64B 11823300
         SPACE 1                                               @Z24L64B 11824200
*------------------------------------------------------------* @Z24L64B 11825100
*        The following flags will cause the version request  * @Z24L64B 11826000
*        to be delayed until the latest information is       * @Z24L64B 11826900
*        available from JES2.  Setting these bits can result * @Z24L64B 11827800
*        in additional processing overhead in JES2.  Setting * @Z24L64B 11828700
*        DSRVF1LI overrides this request.                    * @Z24L64B 11829600
*------------------------------------------------------------* @Z24L64B 11830500
         SPACE 1                                               @Z24L64B 11831400
DSRXF1WS EQU   B'01000000'         Wait for latest MAS level   @Z24L64BC11832300
                                     version                   @Z24L64B 11833200
DSRXF1WB EQU   B'00100000'         Wait for latest member      @Z24L64BC11834100
                                     level version             @Z24L64B 11835000
         SPACE 1                                               @Z24L64B 11835900
DSRXJ2LV DS    XL1                Checkpoint level ($MSTRVER)  @Z24L64B 11836800
         DS    XL2                Reserved for future use      @Z24L64B 11837700
DSRXCNUM DS    F                  Reserved for subsystem use   @Z24L64B 11838600
         SPACE 1                                               @Z24L64B 11839500
DSRXDFCT DS    F                  Total TG Free from DADCOUNT  @Z24L64BC11840400
                                    - includes BLOB            @Z24L64B 11841300
         DS    F                  Reserved for future use      @Z24L64B 11842200
DSRXTIME DS    FD                 Time stamp                   @Z24L64B 11843100
DSRXCATC DS    AD                 Pointer to CAT/GRPOBJ cache  @Z24L64BC11844000
                                   if NOT a live version and   @Z24L64BC11844900
                                   cache is requested.         @Z24L64B 11845800
         SPACE 1                                               @Z24L64B 11846700
*------------------------------------------------------------* @Z24L64B 11847600
*        The following fields are all to be accessed as      * @Z24L64B 11848500
*        64 bit pointers using the corresponding ALETs       * @Z24L64B 11849400
*------------------------------------------------------------* @Z24L64B 11850300
         SPACE 1                                               @Z24L64B 11851200
DSRXWQST DS    AD                 Pointer to WQPOS             @Z24L64B 11852100
DSRXQSPT DS    AD                 Pointer to QSE               @Z24L64B 11853000
DSRXHCPT DS    AD                 Pointer to HCT               @Z24L64B 11853900
DSRXTGPT DS    AD                 Pointer to TGM               @Z24L64B 11854800
DSRXJNPT DS    AD                 Pointer to JNT               @Z24L64B 11855700
DSRXJQPT DS    AD                 Pointer to JQE               @Z24L64B 11856600
DSRXJXPT DS    AD                 Pointer to JQX               @Z24L64B 11857500
DSRXJTPT DS    AD                 Pointer to JQE trkg ext      @Z24L64B 11858400
DSRXJOPT DS    AD                 Pointer to JOT (JOEs)        @Z24L64B 11859300
DSRXOXPT DS    AD                 Pointer to JOX               @Z24L64B 11860200
DSRXDAPT DS    AD                 Pointer to DAS               @Z24L64B 11861100
DSRXZJPT DS    AD                 Pointer to ZJC               @Z24L64B 11862000
         SPACE 1                                               @Z24L64B 11862900
         DS    8FD                Reserved for future use      @Z24L64B 11863800
         SPACE 1                                               @Z24L64B 11864700
DSRXWQSL DS    F                  ALET for WQPOS               @Z24L64B 11865600
DSRXQSAL DS    F                  ALET for QSE                 @Z24L64B 11866500
DSRXHCAL DS    F                  ALET for HCT                 @Z24L64B 11867400
DSRXTGAL DS    F                  ALET for TGM                 @Z24L64B 11868300
DSRXJNAL DS    F                  ALET for JNT                 @Z24L64B 11869200
DSRXJQAL DS    F                  ALET for JQE                 @Z24L64B 11870100
DSRXJXAL DS    F                  ALET for JQX                 @Z24L64B 11871000
DSRXJTAL DS    F                  ALET for JQE trkg ext        @Z24L64B 11871900
DSRXJOAL DS    F                  ALET for JOT (JOEs)          @Z24L64B 11872800
DSRXOXAL DS    F                  ALET for JOX                 @Z24L64B 11873700
DSRXDAAL DS    F                  ALET for DAS                 @Z24L64B 11874600
DSRXZJAL DS    F                  ALET for ZJC                 @Z24L64B 11875500
         SPACE 1                                               @Z24L64B 11876400
         DS    8F                 Reserved for future use      @Z24L64B 11877300
         SPACE 1                                               @Z24L64B 11878200
*------------------------------------------------------------* @Z24L64B 11879100
*        End of pointer list                                 * @Z24L64B 11880000
*------------------------------------------------------------* @Z24L64B 11880900
         SPACE 1                                               @Z24L64B 11881800
DSRXSZ10 EQU   *-DSERVX           DSERVX Version 10 fixed      @Z24L64BC11882700
                                   parameter length            @Z24L64B 11883600
         SPACE 1                                               @Z24L64B 11884500
DSRXSZE  EQU   *-DSERVX           DSERVX Current version       @Z24L64BC11885400
                                   fixed parameter length      @Z24L64B 11886300
         SPACE 1                                               @Z24L64B 11887200
         DC    0S((DSRVSSID-DSERV)-(DSRXSSID-DSERVX))          @Z24L64B 11888100
         DC    0S((DSRXSSID-DSERVX)-(DSRVSSID-DSERV))          @Z24L64B 11889000
         DC    0S((DSRVLEN-DSERV)-(DSRXLEN-DSERVX))            @Z24L64B 11889900
         DC    0S((DSRXLEN-DSERVX)-(DSRVLEN-DSERV))            @Z24L64B 11890800
         DC    0S((DSRVSVRN-DSERV)-(DSRXSVRN-DSERVX))          @Z24L64B 11891700
         DC    0S((DSRXSVRN-DSERVX)-(DSRVSVRN-DSERV))          @Z24L64B 11892600
         MEND  ,                                                        11900000
.*                                                                      12000000
**/                                                                     12100000
* % END_OF_ASM_DSRV: ;                                                  12200000
*                                                                       12300000
* %IF DSERV_ATRB = ''            /* IF NO ATTRIBUTE SPECIFIED      */   12400000
*   %THEN                                                               12500000
*     %DSERV_ATRB = 'BASED';     /* ESTABLISH DEFAULT ATTRIBUTE    */   12600000
*                                                                       12700000
*DECLARE                                                                12800000
*   1   DSERV   DSERV_ATRB,                                             12900000
*       3 DSRVSSID CHAR(4),         /* CONTROL BLOCK IDENTIFIER      */ 13000000
*       3 DSRVLEN  FIXED(16),       /* LENGTH OF DSERV AREA          */ 13100000
*       3 DSRVSVRN FIXED(15),       /* SERVICE VERSION NUMBER        */ 13200000
*       3 DSRVUSER ,                /* USER AREA             @410LCKV*/ 13210000
*         5 DSRVCVPT PTR(31),       /* RESERVED FOR SUBSYSTEM USE    */ 13300000
*         5 DSRVCNUM FIXED(31),     /* RESERVED FOR SUBSYSTEM USE    */ 13400000
*         5 DSRVJOTK BDY(DWORD),    /*   JOT  token                  */ 13500000
*          7  DSRVJOPT  PTR(31),    /*     Pointer to JOT            */ 13600000
*          7  DSRVJOAL  FIXED(32),  /*     ALET of JOT               */ 13700000
*         5 DSRVJQTK BDY(DWORD),    /*   JQE  token                  */ 13800000
*          7  DSRVJQPT  PTR(31),    /*     Pointer to JQE            */ 13900000
*          7  DSRVJQAL  FIXED(32),  /*     ALET of JQE               */ 14000000
*         5 DSRVQSTK BDY(DWORD),    /*   QSE  token                  */ 14100000
*          7  DSRVQSPT  PTR(31),    /*     Pointer to QSE            */ 14200000
*          7  DSRVQSAL  FIXED(32),  /*     ALET of QSE               */ 14300000
*         5 DSRVHCTK BDY(DWORD),    /*   HCT  token                  */ 14400000
*          7  DSRVHCPT PTR(31),     /*     Pointer to HCT            */ 14500000
*          7  DSRVHCAL FIXED(32),   /*     ALET of HCT               */ 14600000
*         5 DSRVTIME CHARACTER(8) BDY(DWORD),                           14700000
*                                   /*       TIME STAMP              */ 14800000
*         5 DSRVJNTK BDY(DWORD),    /*   JNT  TOKEN          @520LSDS*/ 14810000
*          7  DSRVJNPT  PTR(31),    /*     JNT Pointer       @520LSDS*/ 14820000
*          7  DSRVJNAL  FIXED(32),  /*     ALET of JNT       @Z02LG64*/ 14830000
*         5 DSRVJQXK BDY(DWORD),    /*   JQX  token          @Z02LG64*/ 14831000
*          7  DSRVJXPT  PTR(31),    /*     JQX Pointer       @Z02LG64*/ 14832000
*          7  DSRVJXAL  FIXED(32),  /*     ALET of JQX       @Z02LG64*/ 14833000
*         5 DSRVJTTK BDY(DWORD),    /*   JQE trkg ext token  @Z02LG64*/ 14834000
*          7  DSRVJTPT  PTR(31),    /*     JQE trkg ext adr  @Z02LG64*/ 14835000
*          7  DSRVJTAL  FIXED(32),  /*     ALET of JQE trkg  @Z02LG64*/ 14836000
*         5 DSRVDASK BDY(DWORD),    /*   DAS  token          @Z02LG64*/ 14837000
*          7  DSRVDAPT  PTR(31),    /*     DAS Pointer       @Z02LG64*/ 14837200
*          7  DSRVDAAL  FIXED(32),  /*     ALET of DAS       @Z07LTCP*/ 14837400
*         5 DSRVFLG1 BIT(8),        /*   Flag bytes          @Z07LTCP*/ 14837600
*          7 DSRVF1LI BIT(1),       /*     Use live version  @Z07LTCP*/ 14837800
*          7 DSRVF1WS BIT(1),       /*     Wait for latest MAS level    14838000
*                                           version          @Z21LVER*/ 14838200
*          7 DSRVF1WB BIT(1),       /*     Wait for latest member       14838600
*                                           level version    @Z21LVER*/ 14839000
*         5 DSRVJ2LV FIXED(8),      /*   Checkpoint level      @Z23BI*/ 14839400
*         5 *        CHAR(6),       /*   Reserved space        @Z23BI*/ 14839800
*         5 DSRVWQSK BDY(DWORD),    /*   WLM Q position tkn    @Z23AY*/ 14840200
*          7  DSRVWQST  PTR(31),    /*     WQPOS Pointer       @Z23AY*/ 14840600
*          7  DSRVWQSL  FIXED(32),  /*     ALET of WQPOS       @Z23AY*/ 14841000
*         5 DSRVJOXK BDY(DWORD),    /*   JOX  token          @Z11LTJN*/ 14841400
*          7  DSRVOXPT  PTR(31),    /*     JOX Pointer       @Z11LTJN*/ 14841800
*          7  DSRVOXAL  FIXED(32),  /*     ALET of JOX       @Z11LTJN*/ 14842200
*         5 DSRVCNPT PTR(31),       /*   Reserved for subsystem         14842600
*                                          use               @Z11LTJN*/ 14843000
*         5 *           FIXED(32),  /*   Reserved for future use        14843400
*                                                            @Z23D125*/ 14843800
*         5 DSRVTGMK BDY(DWORD),    /*   TGM  token          @Z13LMIG*/ 14844200
*          7  DSRVTGPT  PTR(31),    /*     TGM Pointer       @Z13LMIG*/ 14844600
*          7  DSRVTGAL  FIXED(32),  /*     ALET of TGM       @Z21LCLS*/ 14845000
*                                                                       14845400
*         5 *        CHAR(8),       /*   Reserved for                   14845800
*                                          future use.       @Z21LCLS*/ 14846200
*         5 DSRVCATC PTR(31),       /*   CAT/GRPOBJ cache               14846600
*                                          pointer.          @Z21LCLS*/ 14847000
*         5 DSRVDFCT FIXED(32),     /*   Total TG Free from DADCOUNT    14847060
*                                           includes BLOB    @Z24LRES*/ 14847120
*         5 DSRVZJTK BDY(DWORD),    /*   ZJC Token           @Z22LDEP*/ 14847180
*          7  DSRVZJPT  PTR(31),    /*     Pointer to ZJC    @Z22LDEP*/ 14847240
*          7  DSRVZJAL  FIXED(32);  /*     ALET of ZJC       @Z22LDEP*/ 14847300
*                                                                       14847400
*   DCL DSRVSZE  FIXED(15) CONSTANT(OFFSET(DSRVZJAL,DSERV)+             14847800
*                          LENGTH(DSRVZJAL)); /* ver 9 size  @Z21LCLS*/ 14848000
*   DCL DSRVSZE1 FIXED(15) CONSTANT(OFFSET(DSRVTIME,DSERV)+             14850000
*                          LENGTH(DSRVTIME)); /* ver 1 size  @520LSDS*/ 14860000
*   DCL DSRVSZE2 FIXED(15) CONSTANT(OFFSET(DSRVJNAL,DSERV)+             14862000
*                          LENGTH(DSRVJNAL)); /* ver 2 size  @Z02LG64*/ 14864000
*   DCL DSRVSZE3 FIXED(15) CONSTANT(OFFSET(DSRVDAAL,DSERV)+             14866000
*                          LENGTH(DSRVDAAL)); /* ver 3 size  @Z02LG64*/ 14868000
*   DCL DSRVSZE4 FIXED(15) CONSTANT(OFFSET(DSRVWQSK,DSERV));    /*      14868600
*                                                ver 4 size    @Z23BI*/ 14868800
*   DCL DSRVSZE5 FIXED(15) CONSTANT(OFFSET(DSRVWQSL,DSERV)+             14869000
*                          LENGTH(DSRVWQSL)); /* ver 5 size    @Z23AY*/ 14869200
*   DCL DSRVSZE6 FIXED(15) CONSTANT(OFFSET(DSRVCNPT,DSERV)+             14869400
*                          LENGTH(DSRVCNPT)); /* ver 6 size    @Z23AY*/ 14869600
*   DCL DSRVSZE7 FIXED(15) CONSTANT(OFFSET(DSRVTGAL,DSERV)+             14869700
*                          LENGTH(DSRVTGAL)); /* ver 7 size  @Z13LMIG*/ 14869800
*   DCL DSRVSZE8 FIXED(15) CONSTANT(OFFSET(DSRVCATC,DSERV)+             14871800
*                          LENGTH(DSRVCATC)); /* ver 8 size  @Z21LCLS*/ 14873800
*   DCL DSRVSZE9 FIXED(15) CONSTANT(OFFSET(DSRVZJAL,DSERV)+             14874000
*                          LENGTH(DSRVZJAL)); /* ver 9 size  @Z21LCLS*/ 14874600
*   DCL DSRVSVR1 FIXED(15) CONSTANT(1); /* VERSION 4.1.0     @520LSDS*/ 14875800
*   DCL DSRVSVR2 FIXED(15) CONSTANT(2); /* VERSION 5.2.0     @520LSDS*/ 14880000
*   DCL DSRVSVR3 FIXED(15) CONSTANT(3); /* z/OS 1.2 version  @Z11LTJN*/ 14890000
*   DCL DSRVSVR4 FIXED(15) CONSTANT(4); /* z/OS 1.7 version  @Z11LTJN*/ 14895000
*   DCL DSRVSVR5 FIXED(15) CONSTANT(5); /* OA26875 size        @Z23AY*/ 14895500
*   DCL DSRVSVR6 FIXED(15) CONSTANT(6); /* z/OS 1.11 version   @Z23AY*/ 14896000
*   DCL DSRVSVR7 FIXED(15) CONSTANT(7); /* z/OS 1.13 version @Z13LMIG*/ 14898000
*   DCL DSRVSVR8 FIXED(15) CONSTANT(8); /* z/OS 2.1  version @Z21LCLS*/ 14899000
*   DCL DSRVSVR9 FIXED(15) CONSTANT(9); /* z/OS 2.2  version @Z22LDEP*/ 14899500
*   DCL DSRVSVR# FIXED(15) CONSTANT(9); /* Current Version   @Z22LDEP*/ 14900000
*/*     ID VALUE FOR DSRVSSID                                        */ 14910000
*   DCL DSRVEYEC  CHAR(4) CONSTANT('DSRV'); /* JES JOB INFORMATION      14920000
*                                               TOKEN ID    @410LCKV*/  14930000
*                                                                       14940000
* %IF DSERVX_ATRB = ''           /* If no attribute specified        */ 14950000
*   %THEN                                                               14960000
*     %DSERVX_ATRB = 'BASED';    /* Establish default attribute      */ 14970000
*                                                                       14980000
*DECLARE                                                                14990000
*   1   DSERVX  DSERVX_ATRB,                                            15000000
*       3 DSRXSSID CHAR(4),      /* CONTROL BLOCK IDENTIFIER @Z24L64B*/ 15010000
*       3 DSRXLEN  FIXED(16),    /* LENGTH OF DSERV AREA     @Z24L64B*/ 15020000
*       3 DSRXSVRN FIXED(15),    /* SERVICE VERSION NUMBER   @Z24L64B*/ 15030000
*       3 DSRXUSER ,             /* User area                @Z24L64B*/ 15040000
*         5 DSRXCVPT PTR(64),    /* Reserved for subsys use  @Z24L64B*/ 15050000
*         5 DSRXCNPT PTR(64),    /* Reserved for subsys use  @Z24L64B*/ 15060000
*         5 DSRXFLG1 BIT(8),     /* Flag bytes               @Z24L64B*/ 15070000
*          7 DSRXF1LI BIT(1),    /*   Use live version       @Z24L64B*/ 15080000
*          7 DSRXF1WS BIT(1),    /*   Wait for latest MAS level         15090000
*                                      version               @Z24L64B*/ 15100000
*          7 DSRXF1WB BIT(1),    /*   Wait for latest member            15110000
*                                      level version         @Z24L64B*/ 15120000
*         5 DSRXJ2LV FIXED(8),   /*   Checkpoint level       @Z24L64B*/ 15130000
*         5 *        CHAR(2),    /* Reserved for future use  @Z24L64B*/ 15140000
*         5 DSRXCNUM FIXED(31),  /* Reserved for subsys use  @Z24L64B*/ 15150000
*         5 DSRXDFCT FIXED(32),  /*   Total TG Free from DADCOUNT       15160000
*                                       includes BLOB        @Z24L64B*/ 15170000
*         5 *        FIXED(32),  /* Reserved for future use  @Z24L64B*/ 15180000
*         5 DSRXTIME FIXED(64),  /* Time stamp               @Z24L64B*/ 15190000
*         5 DSRXCATC PTR(64),    /* Ptr to CAT/GRPOBJ cache  @Z24L64B*/ 15200000
*/*----------------------------------------------------------@Z24L64B*/ 15210000
*/*      The following fields are all to be accessed as      @Z24L64B*/ 15220000
*/*      64 bit pointers using the corresponding ALETs       @Z24L64B*/ 15230000
*/*----------------------------------------------------------@Z24L64B*/ 15240000
*         5 DSRXWQST PTR(64),    /* Pointer to WQPOS         @Z24L64B*/ 15250000
*         5 DSRXQSPT PTR(64),    /* Pointer TO QSE           @Z24L64B*/ 15260000
*         5 DSRXHCPT PTR(64),    /* Pointer TO HCT           @Z24L64B*/ 15270000
*         5 DSRXTGPT PTR(64),    /* Pointer to TGM           @Z24L64B*/ 15280000
*         5 DSRXJNPT PTR(64),    /* Pointer TO JNT           @Z24L64B*/ 15290000
*         5 DSRXJQPT PTR(64),    /* Pointer TO JQE           @Z24L64B*/ 15300000
*         5 DSRXJXPT PTR(64),    /* Pointer to JQX           @Z24L64B*/ 15310000
*         5 DSRXJTPT PTR(64),    /* Pointer to JQE trkg ext  @Z24L64B*/ 15320000
*         5 DSRXJOPT PTR(64),    /* Pointer TO JOT (JOEs)    @Z24L64B*/ 15330000
*         5 DSRXOXPT PTR(64),    /* Pointer to JOX           @Z24L64B*/ 15340000
*         5 DSRXDAPT PTR(64),    /* Pointer to DAS           @Z24L64B*/ 15350000
*         5 DSRXZJPT PTR(64),    /* Pointer to ZJC           @Z24L64B*/ 15360000
*         5 *(8)     FIXED(64),  /* Reserved for future use  @Z24L64B*/ 15370000
*         5 DSRXWQSL FIXED(32),  /* ALET for WQPOS           @Z24L64B*/ 15380000
*         5 DSRXQSAL FIXED(32),  /* ALET for QSE             @Z24L64B*/ 15390000
*         5 DSRXHCAL FIXED(32),  /* ALET for HCT             @Z24L64B*/ 15400000
*         5 DSRXTGAL FIXED(32),  /* ALET for TGM             @Z24L64B*/ 15410000
*         5 DSRXJNAL FIXED(32),  /* ALET for JNT             @Z24L64B*/ 15420000
*         5 DSRXJQAL FIXED(32),  /* ALET for JQE             @Z24L64B*/ 15430000
*         5 DSRXJXAL FIXED(32),  /* ALET for JQX             @Z24L64B*/ 15440000
*         5 DSRXJTAL FIXED(32),  /* ALET for JQE trkg ext    @Z24L64B*/ 15450000
*         5 DSRXJOAL FIXED(32),  /* ALET for JOT (JOEs)      @Z24L64B*/ 15460000
*         5 DSRXOXAL FIXED(32),  /* ALET for JOX             @Z24L64B*/ 15470000
*         5 DSRXDAAL FIXED(32),  /* ALET for DAS             @Z24L64B*/ 15480000
*         5 DSRXZJAL FIXED(32),  /* ALET for ZJC             @Z24L64B*/ 15490000
*         5 *(8)     FIXED(32);  /* Reserved for future use  @Z24L64B*/ 15500000
*/*----------------------------------------------------------@Z24L64B*/ 15510000
*/*      End of pointer list                                 @Z24L64B*/ 15520000
*/*----------------------------------------------------------@Z24L64B*/ 15530000
*                                                                       15540000
*   DCL DSRXSZE  FIXED(15) CONSTANT(LENGTH(DSERVX));  /*                15550000
*                                       Current version size @Z24L64B*/ 15560000
*   DCL DSRXSZ10 FIXED(15) CONSTANT(LENGTH(DSERVX));  /*                15570000
*                                                ver 10 size @Z24L64B*/ 15580000
*                                                                       15590000
*   DCL DSRXSV10 FIXED(15) CONSTANT(10); /* z/OS 2.4 version @Z24L64B*/ 15600000
*   DCL DSRXSVR# FIXED(15) CONSTANT(10); /* Current Version  @Z24L64B*/ 15610000
*/*     ID VALUE FOR DSRXSSID                                @Z24L64B*/ 15620000
*   DCL DSRXEYEC CHAR(4) CONSTANT('DSRX'); /* JES job info   @Z24L64B*/ 15630000
* @Logic;                                                               15640000
* #PRAGMA TOOL=PADI.                                                    15650000
* #PADIDELETE.DSRVEYEC                                                  15660000
* #PADIDELETE.DSRXEYEC                                                  15670000
* #EPRAGMA                                                              15680000
* @ENDLOGIC;                                                            15690000
*/*                          END OF MACRO                            */ 99999999
