* %GOTO ENF58CMT;             /* Bilingual Mapping Macro                00100000
         MACRO                                                          00200000
         IAZENF58 &DSECT=YES                                            00300000
*          */                                                           00400000
*  %ENF58CMT: ;                                                         00500000
*/**** START OF SPECIFICATIONS *******************************          00600000
.****PROPRIETARY-STATEMENT************************************          00700000
.*01* PROPRIETARY STATEMENT:                                 *          00800000
.*                                                           *          00900000
.*    LICENSED MATERIALS-PROPERTY OF IBM                     *          01000000
.*    5650-ZOS Copyright IBM Corp. 1998, 2021                *          01200000
.*                                                           *          01300000
.*    STATUS:  HBB77D0                                       *          01400000
.*                                                           *          01500000
.****END-OF-PROPRIETARY-STATEMENT*****************************          01600000
*                                                            *          01700000
*01* DESCRIPTIVE NAME:  ENF58 Parameter List                 *          01800000
*                                                            *          01900000
*02*  ACRONYM:  IAZENF58                                     *          02000000
*                                                            *          02100000
*01* MACRO NAME:  IAZENF58                                   * @R05LOPI 02200000
*                                                            *          02300000
*01* DSECT NAME:  ENF58                                      *          02400000
*01* LABEL PREFIX:  ENF58                                    *          02500000
*                                                            *          02600000
*01* COMPONENT ID:  JES Common (SC141)                       *          02700000
*                                                            *          02800000
*01* EXTERNAL CLASSIFICATION:                                * @Z13LSSI 02900000
*02*  GUPI:  BASE                                            * @Z13LSSI 02910000
*02*  DMTI:  FIELDS                                          * @Z13LSSI 02920000
*            ENF58_SIZE1   ENF58_SIZE2   ENF58_SIZE3         * @Z13LSSI 02930000
*            ENF58_SIZE4   ENF58_SIZE5   ENF58_MAXSIZE       * @Z13LSSI 02940000
*            ENF58_EXT_SIZE                                  * @Z13LSSI 02950000
*            ENF58_EXT_SIZE1                                 * @Z21LCOR 02952000
*            ENF58_EXT_SIZE2                                 * @Z21LCOR 02955000
*            ENF58_DEVICE_JESDATA                            * @Z13LSSI 02960000
*                                                            * @Z13LSSI 02970000
*01* END OF EXTERNAL CLASSIFICATION:                         *          03000000
*                                                            *          03100000
*01* EYE-CATCHER: ENF58                                      *          03200000
*02*  OFFSET:      ENF58_ID-ENF58                            *          03300000
*02*  LENGTH:      L'ENF58_ID                                *          03400000
*                                                            *          03500000
*01* STORAGE ATTRIBUTES:                                     *          03600000
*02*  SUBPOOL:  241                                          *          03700000
*02*  KEY:  Key 1                                            *          03800000
*02*  RESIDENCY:  Any                                        *          03900000
*                                                            *          04000000
*01* SIZE:                                                   *          04100000
*                                                            *          04200000
*     Variable depending on the type of ENF58 being          *          04300000
*     issued.  See ENF58_LENGTH for the run-time length      *          04400000
*     of the entire ENF. An ENF58 contains an extension      *          04410000
*     at offset ENF58_EXT_DW_OFF from the start of the ENF.  * @Z13LSSI 04500000
*     The size of the extension is contained in field        * @Z13LSSI 04510000
*     ENF58_EXT_LENGTH.                                      * @Z13LSSI 04520000
*                                                            * @Z13LSSI 04530000
*01* CREATED BY:                                             *          04600000
*                                                            *          04700000
*    The Job Entry Subsystem issuing the ENF 58 signal       *          04800000
*                                                            *          04900000
*01* POINTED TO BY:                                          *          05000000
*                                                            *          05100000
*    The ENFREQ parameter list                               *          05200000
*                                                            *          05300000
*01* SERIALIZATION:                                          *          05400000
*                                                            *          05500000
*     None required                                          *          05600000
*                                                            *          05700000
*01* FUNCTION:                                               *          05800000
*                                                            *          05900000
*     Maps the ENF 58 parameter list received by ENF         *          06000000
*     listen exits.                                          *          06100000
*                                                            *          06200000
*01* METHOD OF ACCESS:                                       *          06300000
*                                                            *          06400000
*02*  ASM:                                                   *          06500000
*      IAZENF58 DSECT=YES!NO                                 *          06600000
*                                                            *          06700000
*        DSECT=YES  - Provided DSECT for ENF58               *          06800000
*                                                            *          06900000
*        DSECT=NO   - Provides storage definition for ENF58  *          07000000
*                                                            *          07100000
*02*  PL/X:                                                  *          07200000
*                                                            *          07300000
*       %DCL EF58 CHAR                                       *          07400000
*       %EF58 = 'value'                                      *          07500000
*       %DCL EF58X CHAR                                      *          07510000
*       %EF58X = 'value'                                     *          07520000
*       %INCLUDE SYSLIB(IAZENF58)                            *          07600000
*                                                            *          07700000
*       EF58 is a global variable that determines the        *          07800000
*       attributes of the base section of the ENF, EF58X     *          07900000
*       is a global variable that determines the attributes  *          07910000
*       of the extension.                                    *          07920000
*       The variables should each be set to a valid          *          07930000
*       control block attribute, such as 'BASED' or ''       *          08000000
*       (null).  The default is '' (null).                   *          08100000
*                                                            *          08200000
*01* DELETED BY:                                             *          08300000
*                                                            *          08400000
*     ENFREQ service routine if FREEPRM= specified.          * @R05P407 08500000
*     Otherwise, deleted by the signaller's exit routine.    * @R05P407 08600000
*                                                            *          08700000
*01* FREQUENCY:                                              *          08800000
*                                                            *          08900000
*     One per ENF 58 signal issued                           *          09000000
*                                                            *          09100000
*01* RESTRICTIONS:                                           *          09200000
*                                                            *          09300000
*     None                                                   *          09400000
*                                                            *          09500000
****** END OF SPECIFICATIONS ********************************/          09600000
*/********************************************************************/ 09700000
*/*01* CHANGE ACTIVITY:                                              */ 09800000
*/*                                                                  */ 09900000
*/* $R05LOPI=OPI      HBB6605 970611 JMS:  IAZENF58                  */ 10000000
*/* $R05P407=OPI      HBB6605 970814 JMS:  Change ENF58_LENGTH size  */ 10100000
*/*                                                                  */ 10110000
*/* $Z05LENF=ENVIRON  HBB7708 021003 .:    ENF 58 for checkpoints    */ 10120000
*/*                                                                  */ 10130000
*/* $Z05LENF=ENVIRON  HBB7708 021004 .:    ENF 58 for checkpoints    */ 10140000
*/*                                                                  */ 10150000
*/* $Z11LSSF=SDSFASST HBB7760 080709 CLW:  ENF changes               */ 10160000
*/* $Z11LSSF=SDSFASST HBB7760 080904 CLW:  Device status broadcast   */ 10170000
*/* $Z11LSSF=SDSFASST HBB7760 090312 CLW:  IAZ changes for gathering */ 10180000
*/*                                                                  */ 10182000
*/* $Z13LSSI=SDSFASST HBB7770 091111 BWT:  JES3 Changes to IAZENF58  */ 10188000
*/*                                                                  */ 10192000
*/* $Z21LCOR=JOBCOR   HBB7790 110818 BWT:  Job Correlator            */ 10196000
*/*                                                                  */ 10197000
*/*                                                                  */ 10200000
*/*01* A000000-999999    Created for OS/390 Release 5        @R05LOPI*/ 10300000
*/********************************************************************/ 10400000
*/************************************************************          10500000
*01* NOTES:                                                  *          10600000
*                                                            *          10700000
*     None                                                   *          10800000
*                                                            *          10900000
*************************************************************/          11000000
*  %GOTO ENF58_PLX; /*                                                  11100000
         AIF   ('&DSECT' EQ 'YES').ENF5810                              11200000
         AIF   ('&DSECT' EQ 'NO').ENF5820                               11300000
         MNOTE 12,'IAZENF58:  DSECT MUST BE EITHER YES OR NO'           11400000
         AGO   .END                                                     11500000
.ENF5810 ANOP                                                           11600000
ENF58            DSECT             ENF58 mapping                        11700000
         AGO   .ENF5830                                                 11800000
.ENF5820 ANOP                                                           11900000
ENF58            DS    0D          ENF58 mapping                        12000000
.ENF5830 ANOP                                                           12100000
ENF58_ID         DS    CL6         Eye catcher 'ENF58 '                 12200000
ENF58_VERSION    DS    X           Version of mapping                   12300000
ENF58_VONE       EQU   1           Version 1                            12400000
ENF58_VTWO       EQU   2           Version 2                   @Z05LENF 12410000
ENF58_VTHREE     EQU   3           Version 3                   @Z11LSSF 12420000
ENF58_VFOUR      EQU   4           Version 4                   @Z13LSSI 12430000
ENF58_VFIVE      EQU   5           Version 5                   @Z21LCOR 12440000
ENF58_CVER       EQU   ENF58_VFIVE   Current version           @Z21LCOR 12500000
ENF58_EXT_DW_OFF DS    X           Offset to fixed extension   @Z11LSSFC12600000
                                    (in doublewords) or 0      @Z11LSSF 12610000
ENF58_LENGTH     DS    F           Length of parameter list    @R05P407 12700000
ENF58_QUALIFIER  DS    XL1         Qualifier code - defined below       12800000
         SPACE 1                                                        12900000
ENF58_Q_PURGE    EQU   1           Data Set was purged                  13000000
ENF58_Q_SELECT   EQU   2           Data Set was selected                13100000
         SPACE 1                                                        13200000
**************************************************************          13300000
*     A data set has been "processed" by JES2 if a $#DISPRO  *          13400000
*     is issued to update the data set disposition.          *          13500000
*     A data set has been "processed" by JES3 if the data    *          13600000
*     set is complete.                                       *          13700000
**************************************************************          13800000
ENF58_Q_DESELECT_PROCESSED EQU 3   Data set was processed               13900000
         SPACE 1                                                        14000000
ENF58_Q_DESELECT_NOT_PROCESSED EQU 4  Data set is no longer            C14100000
                                    selected, disposition was          C14200000
                                    not updated                         14300000
ENF58_Q_DESELECT_NOT_PROCESSED_HELD EQU 5  Data set is no longer       C14400000
                                    selected, disposition was not      C14500000
                                    updated and data set is held        14600000
ENF58_Q_DESELECT_ERROR EQU 6       An error resulting in a             C14700000
                                    system level hold occurred          14800000
ENF58_Q_EOD_OK   EQU   7           End of data set notification        C14900000
                                    occurred - successful               15000000
ENF58_Q_EOD_ERROR EQU  8           End of data set notification        C15100000
                                    occurred - unsuccessful             15200000
ENF58_Q_JOB_CHANGE EQU 9           Job-status change occurred           15300000
ENF58_Q_TOKEN_CHANGE EQU 10        Client token has changed             15400000
ENF58_Q_CHECKPOINT EQU 11          Checkpoint taken            @Z05LENF 15410000
ENF58_Q_UPDATEJOE  EQU 12          JOE1CKV update (JES2          @Z10DSC15420000
                                     internal use only)                 15430000
ENF58_Q_INSTANCE  EQU  13          Additional instance of data @Z11LSSFC15440000
                                    set created                @Z11LSSF 15450000
ENF58_Q_GRP_SELECT EQU  14         Data set group select       @Z11LSSF 15460000
ENF58_Q_GRP_DESELECT EQU  15       Data set group deselect     @Z11LSSF 15470000
         SPACE 1                                                        15500000
*------------------------------------------------------------* @OA41738 15505000
*        The following equates (ENF58_Q1) define bits in the * @OA41738 15512000
*        last byte of the ENF bit map qualifier (ENFPBMQ+31) * @OA41738 15519000
*        - Device related has a JES2 device name in          * @OA41738 15526000
*          ENF58_DEVICE_JESDATA                              * @OA41738 15533000
*        - Group related has a qualifier of ENF58_Q_GRP* or  * @OA41738 15540000
*          ENF58_Q_CHECKPOINT                                * @OA41738 15547000
*------------------------------------------------------------* @OA41738 15554000
         SPACE 1                                               @OA41738 15561000
ENF58_Q1_DEVICE  EQU   B'10000000'  ENF is device related      @OA41738 15568000
ENF58_Q1_GROUP   EQU   B'01000000'  ENF is group related       @OA41738 15575000
         SPACE 1                                                        15582000
ENF58_SYS_HOLD   DS    XL1         System hold reason - refer          C15600000
                                    to IAZOHLD for possible values      15700000
ENF58_JES_NAME   DS    CL8         JES2 Member Name / JES3 MAIN name   C15800000
                                    where this signal originated        15900000
         SPACE 1                                                        16000000
**************************************************************          16100000
*        ENF58_REASON can contain a variety of different     *          16200000
*        information depending on the ENF type being issued. *          16300000
*                                                            *          16400000
*        ENF 58 type          Information in ENF58_REASON    *          16500000
*        --------------       ------------------------------ *          16600000
*        ENF58_Q_SELECT       Device/process name that       *   @Z23BH 16700000
*                             selected the data set.         *   @Z23BH 16800000
*        ENF58_Q_DESELECT_PROCESSED  Either process name     *   @Z23BH 16810000
*                             that processed the data set or *   @Z23BH 16820000
*                             hex zeros.                     *   @Z23BH 16830000
*        ENF58_Q_DESELECT_NOT_PROCESSED  Either process name *   @Z23BH 16840000
*                             that deselected the data set   *   @Z23BH 16850000
*                             or hex zeros.                  *   @Z23BH 16860000
*        ENF58_Q_DESELECT_ERROR If ENF58_SYS_HOLD indicates  *          16900000
*                             that a RELDS Unprintable error *          17000000
*                             occurred, RDSMIDSE from the    *          17100000
*                             IAZFSIP RELDS parameter list.  *   @Z23BH 17200000
*                             Otherwise, either process name *   @Z23BH 17300000
*                             that kept the data set in      *   @Z23BH 17310000
*                             system level hold or hex zeros *   @Z23BH 17320000
*        ENF58_Q_JOB_CHANGE   Status change that occurred    *          17400000
*                             for the job (eg. PURGED)       *          17500000
*        ENF58_Q_GRP_SELECT   Device name that selected the  *   @Z23BH 17510000
*                             data set group.                *   @Z23BH 17520000
*                                                            *          17600000
**************************************************************          17700000
ENF58_REASON     DS    CL18        Reason text                          17800000
         SPACE 1                                                        17900000
                 DS    0D          Establish alignment                  18000000
ENF58_CTOKEN     DS    XL80        Data Set Client Token                18100000
ENF58_SIZE1      EQU   *-ENF58     Small Version of ENF58 ends here     18200000
         SPACE 1                                                        18300000
ENF58_NEW_CTOKEN DS    XL80        New client token that should        C18400000
                                    replace the Ctoken for a           C18500000
                                    TOKEN_CHANGE ENF type, or  @Z11LSSFC18600000
                                    be added for a INSTANCE    @Z11LSSFC18610000
                                    request.                   @Z11LSSF 18620000
ENF58_SIZE2      EQU   *-ENF58     ENF58 for TOKEN_CHANGE ends here    C18700000
                                                               @Z05LENF 18702000
         SPACE 1                                               @Z05LENF 18711000
                 ORG   ENF58_NEW_CTOKEN                        @Z05LENF 18720000
ENF58_COPY       DS    F           Checkpointed copy count     @Z05LENF 18729000
ENF58_RECORD     DS    F           Checkpointed current record @Z05LENF 18738000
ENF58_PAGE       DS    F           Checkpointed current page   @Z05LENF 18747000
                 DS    XL4         Reserved                    @Z05LENF 18756000
                 DS    0D          Establish alignment         @Z05LENF 18765000
ENF58_SIZE3      EQU   *-ENF58     ENF58 for checkpoints ends here     C18774000
                                                               @Z05LENF 18783000
         SPACE 1                                                 @Z10DS 18783100
*  Used only if ENF58_Q_UPDATEJOE                                @Z10DS 18783200
*                                                                @Z10DS 18783300
                 ORG   ENF58_NEW_CTOKEN                          @Z10DS 18783400
ENF58_JOEINDEX   DS    F           Offset of work JOE            @Z10DS 18783500
                 DS    XL4         Reserved                      @Z10DS 18783600
                 DS    0D          Establish alignment           @Z10DS 18783700
ENF58_SIZE4      EQU   *-ENF58     ENF58 for JOE Update ends here      C18783800
                                                                 @Z10DS 18783900
         SPACE 1                                               @Z11LSSF 18784500
*  Used only if ENF58_Q_GRP_SELECT                             @Z11LSSF 18785100
*                                                              @Z11LSSF 18785700
                 ORG   ENF58_NEW_CTOKEN                        @Z11LSSF 18786300
ENF58_TOT_PAGE   DS    F           Total page count            @Z11LSSF 18786900
ENF58_TOT_RECORD DS    F           Total record count          @Z11LSSF 18787500
ENF58_JOB_NAME   DS    CL8         Job name of selected job             18788100
ENF58_GS_JESDATA DS    XL8         JES-specific data                    18788700
ENF58_SIZE5      EQU   *-ENF58     ENF58 for JOE Select ends here      C18789300
                                                               @Z11LSSF 18789900
                 ORG   ,                                       @Z05LENF 18790500
ENF58_MAXSIZE    EQU   *-ENF58     Largest base ENF58 parm lst @Z13LSSI 18792000
         SPACE 1                                               @Z11LSSF 18792400
************************************************************** @Z11LSSF 18792800
*        ENF58 fixed extension.                              * @Z11LSSF 18793200
************************************************************** @Z11LSSF 18793600
         SPACE 1                                               @Z11LSSF 18794000
         AIF   ('&DSECT' EQ 'NO').ENF5840                      @Z11LSSF 18794400
ENF58_EXT        DSECT             ENF58 fixed extension       @Z11LSSF 18794800
         AGO   .ENF5850                                        @Z11LSSF 18795200
.ENF5840 ANOP                                                  @Z11LSSF 18795600
ENF58_EXT        DS    0D          ENF58 fixed extension       @Z11LSSF 18796000
.ENF5850 ANOP                                                  @Z11LSSF 18796400
ENF58_EXT_EYE    DC    CL6'ENF58X' Eyecatcher                  @Z11LSSF 18796800
ENF58_EXT_LENGTH DS    H           Length of fixed extension   @Z11LSSF 18797200
                 SPACE 1                                       @Z11LSSF 18797400
ENF58_JESPLEX_ID DS    XL8         Unique JESPLEX token        @Z11LSSF 18797600
ENF58_DEVICE     DS    CL10        Related device name if any  @Z11LSSF 18797800
ENF58_DEVICE_JESDATA  DS XL30      JES-related device information       18798000
                 DS    0D                                      @Z11LSSF 18798200
ENF58_EXT_SIZE1  EQU   *-ENF58_EXT  Size of fixed extension    @Z21LCORC18798400
                                      version 1                @Z21LCOR 18798600
ENF58_JOB_CORR   DS    CL64        Job correlator              @Z21LCOR 18798800
ENF58_EXT_SIZE2  EQU   *-ENF58_EXT  Size of fixed extension    @Z21LCORC18799000
                                      version 2                @Z21LCOR 18799200
                 SPACE 1                                       @Z21LCOR 18799400
                 DS    0D          Establish alignment         @Z21LCOR 18799600
ENF58_EXT_SIZE   EQU   *-ENF58_EXT  Size of fixed extension    @Z11LSSF 18799800
.END     ANOP                                                           18800000
         MEND  ,          */                                            18900000
*                                                                       19000000
* %ENF58_PLX: ;                                                         19100000
*  %IF EF58 = '' %THEN                                                  19200000
*    %EF58 = ' ';                                                       19300000
*  DCL ENF58_VONE  FIXED(8)  CONSTANT(1);    /* Version One          */ 19400000
*  DCL ENF58_VTWO  FIXED(8)  CONSTANT(2);    /* Version Two  @Z05LENF*/ 19410000
*  DCL ENF58_VTHREE FIXED(8) CONSTANT(3);    /* Version 3    @Z11LSSF*/ 19420000
*  DCL ENF58_VFOUR FIXED(8)  CONSTANT(4);    /* Version 4    @Z13LSSI*/ 19430000
*  DCL ENF58_VFIVE FIXED(8)  CONSTANT(5);    /* Version 5    @Z21LCOR*/ 19440000
*  DCL ENF58_CVER  FIXED(8)  CONSTANT(ENF58_VFIVE);       /* @Z21LCOR*/ 19500000
*                                            /* Current Version      */ 19600000
*  DCL ENF58_SIZE1 FIXED(8) CONSTANT(LENGTH(ENF58_BASIC));              19700000
*                                            /* Length of small         19800000
*                                               version of ENF58     */ 19900000
*  DCL ENF58_SIZE2 FIXED(8) CONSTANT(LENGTH(ENF58_BASIC)+               20000000
*                                    LENGTH(ENF58_LONG1));              20100000
*                                            /* Length of ENF58 for     20200000
*                                               TOKEN_CHANGE @Z05LENF*/ 20300000
*  DCL ENF58_SIZE3 FIXED(8) CONSTANT(LENGTH(ENF58_BASIC)+               20310000
*                                    LENGTH(ENF58_LONG2));              20320000
*                                            /* Length of version of    20330000
*                                               ENF58 for checkpoints   20340000
*                                                            @Z05LENF*/ 20350000
*  DCL ENF58_SIZE4 FIXED(8) CONSTANT(LENGTH(ENF58_BASIC)+               20352000
*                                    LENGTH(ENF58_LONG3));              20355000
*                                            /* Length of version of    20358000
*                                               ENF58 for JOE updates   20361000
*                                                            @Z13LSSI*/ 20364000
*  DCL ENF58_SIZE5 FIXED(8) CONSTANT(LENGTH(ENF58_BASIC)+               20367000
*                                    LENGTH(ENF58_LONG4));              20370000
*                                            /* Length of version of    20373000
*                                               ENF58 for JOE select    20376000
*                                                            @Z13LSSI*/ 20379000
*  DCL ENF58_EXT_SIZE FIXED(8) CONSTANT(LENGTH(ENF58_EXT_FULL));        20382000
*                                            /* Length of extension     20385000
*                                               of ENF58     @Z21LCOR*/ 20388000
*  DCL ENF58_EXT_SIZE1 FIXED(8) CONSTANT(LENGTH(ENF58_EXT_BASIC));      20389000
*                                            /* Length of extension of  20390000
*                                               ENF58 basic  @Z21LCOR*/ 20391000
*  DCL ENF58_EXT_SIZE2 FIXED(8) CONSTANT(LENGTH(ENF58_EXT_BASIC)+       20392000
*                                    LENGTH(ENF58_EXT_LONG1));          20393000
*                                            /* Length of extension     20394000
*                                               of ENF58 - basic plus   20395000
*                                               job correlator          20396000
*                                                            @Z21LCOR*/ 20397000
*  DCL ENF58_Q_PURGE                  FIXED(8) CONSTANT(1);             20400000
*                                            /* Data Set was purged  */ 20500000
*  DCL ENF58_Q_SELECT                 FIXED(8) CONSTANT(2);             20600000
*                                            /* Data Set was selected   20700000
*                                                                    */ 20800000
*  DCL ENF58_Q_DESELECT_PROCESSED     FIXED(8) CONSTANT(3);             20900000
*                                            /* Data Set was processed  21000000
*                                                                    */ 21100000
*  DCL ENF58_Q_DESELECT_NOT_PROCESSED FIXED(8) CONSTANT(4);             21200000
*                                            /* Data set is no longer   21300000
*                                               selected, disposition   21400000
*                                               was not updated      */ 21500000
*  DCL ENF58_Q_DESELECT_NOT_PROCESSED_HELD                              21600000
*                                     FIXED(8) CONSTANT(5);             21700000
*                                            /* Data set is no longer   21800000
*                                               selected, disposition   21900000
*                                               was not updated and     22000000
*                                               data set is held     */ 22100000
*  DCL ENF58_Q_DESELECT_ERROR         FIXED(8) CONSTANT(6);             22200000
*                                            /* An error resulting in   22300000
*                                               a system level hold     22400000
*                                               occurred.            */ 22500000
*  DCL ENF58_Q_EOD_OK                 FIXED(8) CONSTANT(7);             22600000
*                                            /* End of data set         22700000
*                                               notification occurred   22800000
*                                               - successful         */ 22900000
*  DCL ENF58_Q_EOD_ERROR              FIXED(8) CONSTANT(8);             23000000
*                                            /* End of data set         23100000
*                                               notification occurred   23200000
*                                               - unsuccessful       */ 23300000
*  DCL ENF58_Q_JOB_CHANGE             FIXED(8) CONSTANT(9);             23400000
*                                            /* Job-status change       23500000
*                                               occurred             */ 23600000
*  DCL ENF58_Q_TOKEN_CHANGE           FIXED(8) CONSTANT(10);            23700000
*                                            /* Client token has        23800000
*                                               changed              */ 23900000
*  DCL ENF58_Q_CHECKPOINT             FIXED(8) CONSTANT(11);            23910000
*                                            /* Checkpoint has been     23920000
*                                               taken        @Z05LENF*/ 23930000
*  DCL ENF58_Q_UPDATEJOE              FIXED(8) CONSTANT(12);            23940000
*                                            /* Mark JOE CHK as valid   23950000
*                                              (JES2 internal use only) 23960000
*                                                              @Z10DS*/ 23970000
*  DCL ENF58_Q_INSTANCE               FIXED(8) CONSTANT(13);            23972000
*                                            /* Additional instance of  23974000
*                                              data set created         23976000
*                                                            @Z11LSSF*/ 23978000
*  DCL ENF58_Q_GRP_SELECT             FIXED(8) CONSTANT(14);            23980000
*                                            /* Data set group has      23982000
*                                              been selected            23984000
*                                                            @Z11LSSF*/ 23986000
*  DCL ENF58_Q_GRP_DESELECT           FIXED(8) CONSTANT(15);            23988000
*                                            /* Data set group has      23990000
*                                              been deselected          23992000
*                                                            @Z11LSSF*/ 23994000
*                                                         /* @OA41738*/ 23994300
*/*--------------------------------------------------------- @OA41738*/ 23994600
*/*      The following equates (ENF58_Q1) define bits in the @OA41738*/ 23994900
*/*      last byte of the ENF bit map qualifier (ENFPBMQ+31) @OA41738*/ 23995200
*/*      - Device related has a JES2 device name in          @OA41738*/ 23995500
*/*        ENF58_DEVICE_JESDATA                              @OA41738*/ 23995800
*/*      - Group related has a qualifier of ENF58_Q_GRP* or  @OA41738*/ 23996100
*/*        ENF58_Q_CHECKPOINT                                @OA41738*/ 23996400
*/*--------------------------------------------------------- @OA41738*/ 23996700
*  DCL ENF58_Q1_DEVICE   FIXED(8) CONSTANT('80'X);        /* @OA41738*/ 23997000
*                                            /* ENF is device related   23997300
*                                                            @OA41738*/ 23997600
*  DCL ENF58_Q1_GROUP    FIXED(8) CONSTANT('40'X);        /* @OA41738*/ 23997900
*                                            /* ENF is group related    23998200
*                                                            @OA41738*/ 23998500
*                                                         /* @OA41738*/ 23998800
*                                                         /* @OA41738*/ 23999100
*  DECLARE                                                              24000000
*   1       ENF58 EF58 BDY(DWORD),                                      24100000
*     3       ENF58_FULL,                                               24200000
*       5       ENF58_BASIC,                                            24300000
*         7       ENF58_ID        CHAR(6),   /* Eye catcher 'ENF58 ' */ 24400000
*         7       ENF58_VERSION   FIXED(8),  /* Version of mapping   */ 24500000
*         7       ENF58_EXT_DW_OFF FIXED(8), /* Offset in dwords to     24600000
*                                               fixed extension         24610000
*                                                            @Z11LSSF*/ 24620000
*         7       ENF58_LENGTH    FIXED(31), /* Length of parameter     24700000
*                                               list         @R05P407*/ 24800000
*         7       ENF58_QUALIFIER FIXED(8),  /* Qualifier code       */ 24900000
*         7       ENF58_SYS_HOLD  FIXED(8),  /* System hold reason   */ 25000000
*         7       ENF58_JES_NAME  CHAR(8),   /* JES2 Member Name or     25100000
*                                               JES3 MAIN name where    25200000
*                                               this signal originated  25300000
*                                                                    */ 25400000
*         7       ENF58_REASON    CHAR(18),  /* Reason text          */ 25500000
*         7       ENF58_CTOKEN    CHAR(80) BDY(DWORD), /* Data set      25600000
*                                               client token @Z05LENF*/ 25700000
*       5       ENF58_LONG UNION,                          /*@Z05LENF*/ 25800000
*         7     ENF58_LONG1,                               /*@Z05LENF*/ 25810000
*           9     ENF58_NEW_CTOKEN CHAR(80), /* New client token that   25900000
*                                               should replace the      26000000
*                                               Ctoken for a            26100000
*                                               TOKEN_CHANGE ENF        26200000
*                                               type         @Z05LENF*/ 26300000
*         7     ENF58_LONG2       BDY(DWORD), /*             @Z05LENF*/ 26310000
*           9     ENF58_COPY      FIXED(31), /* Checkpointed copy count 26320000
*                                                            @Z05LENF*/ 26330000
*           9     ENF58_RECORD    FIXED(31), /* Checkpointed record     26340000
*                                               count        @Z05LENF*/ 26350000
*           9     ENF58_PAGE      FIXED(31), /* Checkpointed page       26360000
*                                               count        @Z05LENF*/ 26370000
*           9     *               FIXED(31), /* Reserved       @Z10DS*/ 26380000
*         7     ENF58_LONG3       BDY(DWORD), /*               @Z10DS*/ 26390000
*           9     ENF58_JOEINDEX  FIXED(32), /* Work JOE index          26400000
*                                                              @Z10DS*/ 26410000
*           9     *               FIXED(31), /* Reserved     @Z11LSSF*/ 26420000
*         7     ENF58_LONG4       BDY(DWORD), /*             @Z11LSSF*/ 26430000
*           9     ENF58_TOT_PAGE  FIXED(32), /* Total page count        26440000
*                                                            @Z11LSSF*/ 26450000
*           9     ENF58_TOT_RECORD  FIXED(32), /* Total record count    26460000
*                                                            @Z11LSSF*/ 26470000
*           9     ENF58_JOB_NAME    CHAR(8),   /* Job name of selected  26472000
*                                                 job        @Z11LSSF*/ 26475000
*           9     ENF58_GS_JESDATA  CHAR(8); /* JES-specific data       26476000
*                                                            @Z11LSSF*/ 26476500
*                                                                       26477000
*                                                                       26480000
*  DECLARE                                                              26490000
*   1       ENF58_EXT  BDY(DWORD),                                      26500000
*     3       ENF58_EXT_FULL,                            /*  @Z21LCOR*/ 26502000
*       5       ENF58_EXT_BASIC,                         /*  @Z21LCOR*/ 26505000
*         7       ENF58_EXT_EYE       CHAR(6),  /* Eyecatcher           26510000
*                                                            @Z11LSSF*/ 26515000
*         7       ENF58_EXT_LENGTH    FIXED(16),/* Fixed extension      26520000
*                                                  length    @Z11LSSF*/ 26530000
*         7       ENF58_JESPLEX_ID    CHAR(8),  /* Unique JESPLEX token 26540000
*                                                            @Z11LSSF*/ 26550000
*         7       ENF58_DEVICE        CHAR(10), /* Associated device    26560000
*                                                  name      @Z11LSSF*/ 26570000
*         7       ENF58_DEVICE_JESDATA CHAR(30), /* JES data associated 26580000
*                                              with device   @Z21LCOR*/ 26590000
*       5       ENF58_EXT_LONG,                            /*@Z21LCOR*/ 26600000
*         7     ENF58_EXT_LONG1,                           /*@Z21LCOR*/ 26610000
*           9     ENF58_JOB_CORR      CHAR(64); /* Job correlator       26620000
*                                                            @Z21LCOR*/ 26630000
* @Logic;                                                               26640000
* #PRAGMA TOOL=PADI.                                                    26650000
* #PADIDELETE.ENF58_FULL                                                26660000
* #PADIDELETE.ENF58_BASIC                                               26670000
* #PADIDELETE.ENF58_LONG                                                26680000
* #PADIDELETE.ENF58_LONG1                                               26690000
* #PADIDELETE.ENF58_LONG2                                               26700000
* #PADIDELETE.ENF58_LONG3                                               26710000
* #PADIDELETE.ENF58_LONG4                                               26720000
* #PADIDELETE.ENF58_EXT_FULL                                            26730000
* #PADIDELETE.ENF58_EXT_BASIC                                           26740000
* #PADIDELETE.ENF58_EXT_LONG                                            26750000
* #PADIDELETE.ENF58_EXT_LONG1                                           26760000
* #PADIDELETE.ENF58_MAXSIZE                                             26770000
* #EPRAGMA                                                              26780000
* @ENDLOGIC;                                                            26790000
*/*                          END OF MACRO                            */ 99999999
