* %GOTO ENF78CMT;             /* Bilingual Mapping Macro                00010000
         MACRO                                                          00020000
         IAZENF78 &DSECT=YES                                            00030000
*          */                                                           00040000
*  %ENF78CMT: ;                                                         00050000
*/**** START OF SPECIFICATIONS *******************************          00060000
.****PROPRIETARY-STATEMENT************************************          00070000
.*01* PROPRIETARY STATEMENT:                                 *          00080000
.*                                                           *          00090000
.*    LICENSED MATERIALS-PROPERTY OF IBM                     *          00100000
.*    5650-ZOS Copyright IBM Corp. 2013, 2015                *          00110000
.*                                                           *          00120000
.*    STATUS:  HBB77A0                                       *          00130000
.*                                                           *          00140000
.****END-OF-PROPRIETARY-STATEMENT*****************************          00150000
*                                                            *          00160000
*01* DESCRIPTIVE NAME:  ENF78 Parameter List                 *          00170000
*                                                            *          00180000
*02*  ACRONYM:  IAZENF78                                     *          00190000
*                                                            *          00200000
*01* MACRO NAME:  IAZENF78                                   *          00210000
*                                                            *          00220000
*01* DSECT NAME:  ENF78                                      *          00230000
*01* LABEL PREFIX:  ENF78                                    *          00240000
*                                                            *          00250000
*01* COMPONENT ID:  JES Common (SC141)                       *          00260000
*                                                            *          00270000
*01* EXTERNAL CLASSIFICATION: GUPI                           *          00280000
*01* END OF EXTERNAL CLASSIFICATION:                         *          00290000
*                                                            *          00300000
*01* EYE-CATCHER: ENF78                                      *          00310000
*02*  OFFSET:      ENF78_ID-ENF78                            *          00320000
*02*  LENGTH:      L'ENF78_ID                                *          00330000
*                                                            *          00340000
*01* STORAGE ATTRIBUTES:                                     *          00350000
*02*  SUBPOOL:  241                                          *          00360000
*02*  KEY:  Key 1                                            *          00370000
*02*  RESIDENCY:  Any                                        *          00380000
*                                                            *          00390000
*01* SIZE:                                                   *          00400000
*                                                            *          00410000
*     Variable depending on the type of ENF78 being          *          00420000
*     issued.  See ENF78_LENGTH for the run-time length.     *          00430000
*                                                            *          00440000
*01* CREATED BY:                                             *          00450000
*                                                            *          00460000
*    The Job Entry Subsystem issuing the ENF 78 signal       *          00470000
*                                                            *          00480000
*01* POINTED TO BY:                                          *          00490000
*                                                            *          00500000
*    The ENFREQ parameter list                               *          00510000
*                                                            *          00520000
*01* SERIALIZATION:                                          *          00530000
*                                                            *          00540000
*     None required                                          *          00550000
*                                                            *          00560000
*01* FUNCTION:                                               *          00570000
*                                                            *          00580000
*     Maps the ENF 78 parameter list received by ENF         *          00590000
*     listen exits.                                          *          00600000
*                                                            *          00610000
*01* METHOD OF ACCESS:                                       *          00620000
*                                                            *          00630000
*02*  ASM:                                                   *          00640000
*      IAZENF78 DSECT=YES!NO                                 *          00650000
*                                                            *          00660000
*        DSECT=YES  - Provides DSECT for ENF78               *          00670000
*                                                            *          00680000
*        DSECT=NO   - Provides storage definition for ENF78  *          00690000
*                                                            *          00700000
*02*  PL/X:                                                  *          00710000
*                                                            *          00720000
*       %DCL EF78 CHAR                                       *          00730000
*       %EF78 = 'value'                                      *          00740000
*       %DCL EF78X CHAR                                      *          00750000
*       %EF78X = 'value'                                     *          00760000
*       %INCLUDE SYSLIB(IAZENF78)                            *          00770000
*                                                            *          00780000
*       EF78 is a global variable that determines the        *          00790000
*       attributes of the base section of the ENF, EF78X     *          00800000
*       is a global variable that determines the attributes  *          00810000
*       of the extension.                                    *          00820000
*       The variables should each be set to a valid          *          00830000
*       control block attribute, such as 'BASED' or ''       *          00840000
*       (null).  The default is '' (null).                   *          00850000
*                                                            *          00860000
*01* DELETED BY:                                             *          00870000
*                                                            *          00880000
*     ENFREQ service routine if FREEPRM= specified.          *          00890000
*     Otherwise, deleted by the signaller's exit routine.    *          00900000
*                                                            *          00910000
*01* FREQUENCY:                                              *          00920000
*                                                            *          00930000
*     One per ENF 78 signal issued                           *          00940000
*                                                            *          00950000
*01* RESTRICTIONS:                                           *          00960000
*                                                            *          00970000
*     Ensure that the fixed and variable sections of the     *          00980000
*     ENF end with a DS 0D to accomodate $NOTENF processing. *          00990000
*                                                            *          01000000
****** END OF SPECIFICATIONS ********************************/          01010000
*/********************************************************************/ 01020000
*/*01* CHANGE ACTIVITY:                                              */ 01030000
*/*                                                                  */ 01040000
*/* $Z22LDEP=DEPJOB   HBB77A0 140814 BWT:  Dep Job Control 1 - Cmd 1 */ 01045000
*/*                                                                  */ 01050000
*/*01* A000000-999999    Created for z/OS release 2.1        @Z21LCOR*/ 01060000
*/********************************************************************/ 01070000
*/************************************************************          01080000
*01* NOTES:                                                  *          01090000
*                                                            *          01100000
*     None                                                   *          01110000
*                                                            *          01120000
*************************************************************/          01130000
*  %GOTO ENF78_PLX; /*                                                  01140000
         AIF   ('&DSECT' EQ 'YES').ENF7810                              01150000
         AIF   ('&DSECT' EQ 'NO').ENF7820                               01160000
         MNOTE 12,'IAZENF78:  DSECT must be either YES or NO'           01170000
         AGO   .END                                                     01180000
.ENF7810 ANOP                                                           01190000
ENF78            DSECT             ENF78 mapping                        01200000
         AGO   .ENF7830                                                 01210000
.ENF7820 ANOP                                                           01220000
ENF78            DS    0D          ENF78 mapping                        01230000
.ENF7830 ANOP                                                           01240000
ENF78_ID         DS    CL6         Eye catcher 'ENF78 '                 01250000
ENF78_VERSION    DS    X           Version of mapping                   01260000
ENF78_VONE       EQU   1           Version 1                            01270000
ENF78_CVER       EQU   ENF78_VONE  Current version                      01280000
                 DS    X           Reserved                             01290000
ENF78_LENGTH     DS    F           Total length of ENF78 data           01300000
ENF78_FIXED_LENGTH DS  H           Length of fixed section              01310000
         SPACE 1                                                        01320000
ENF78_QUALIFIER  DS    XL1         Qualifier code - defined below       01330000
         SPACE 1                                                        01340000
ENF78_JOB_NOTIFY EQU   1           Job was processed                    01350000
         SPACE 1                                                        01360000
ENF78_OPTIONS    DS    XL1         ENF Options - defined below          01370000
         SPACE 1                                                        01380000
ENF78_OPT_JOB_NOTIFY_EXIST EQU B'10000000'  Job Notification data      C01390000
                                              exists                    01400000
ENF78_OPT_JES_HANDLED      EQU B'01000000'  Handled by JES     @OA62182 01405000
         SPACE 1                                                        01410000
ENF78_JES_NAME   DS    CL8         JES2 Member Name / JES3 MAIN name   C01420000
                                    where this signal originated        01430000
ENF78_JESPLEX_ID DS    XL8         Unique JESPLEX identifier            01440000
         SPACE 1                                                        01450000
ENF78_JOBNAME    DS    CL8         Job name                             01460000
ENF78_JOBID      DS    CL8         Job ID                               01470000
ENF78_ORG_JOBID  DS    CL8         Original Job ID                      01480000
ENF78_ORG_NODE   DS    CL8         Origin Node                          01490000
ENF78_SUB_MVS    DS    CL8         Submitting MVS system name           01500000
ENF78_JOBCLASS   DS    CL8         Job Class                            01510000
ENF78_SRVCLASS   DS    CL8         Service class                        01520000
ENF78_OWNERID    DS    CL8         Job owner ID                         01530000
ENF78_RDR_DATE   DS    F           Reader on date                       01540000
ENF78_RDR_TIME   DS    F           Reader on time                       01550000
         SPACE 1                                                        01560000
ENF78_MAXCC      DS    0XL4        Job completion code                  01570000
ENF78_COMP       DS    XL1         Job completion indicator             01580000
ENF78_CAB        EQU   X'80'       ABEND CODE                           01590000
ENF78_CCC        EQU   X'40'       Completion code                      01600000
ENF78_CREQ       EQU   X'20'       JOBRC completion code set            01610000
ENF78_CUNK       EQU   0             No completion info                 01620000
ENF78_CNRM       EQU   1             Job ended normally                 01630000
ENF78_CECC       EQU   2             Job ended by cc                    01640000
ENF78_CJCL       EQU   3             Job had a JCL error                01650000
ENF78_CCAN       EQU   4             Job was canceled                   01660000
ENF78_CABN       EQU   5             Job ABENDed                        01670000
ENF78_CCAB       EQU   6             Converter ABENDed                  01680000
ENF78_CSEC       EQU   7             Security error                     01690000
ENF78_CEOM       EQU   8             Job ABENDed in end of             C01700000
                                      memory processing                 01710000
ENF78_CCNV       EQU   9             Converter error                    01720000
ENF78_CSYS       EQU   10            System failure                     01730000
ENF78_CFLU       EQU   11            Job has been flushed               01735000
ENF78_CODE       DS    XL3         Completion code (if                 C01740000
                                     applicable), or ABEND             C01750000
                                     codes (system code in             C01760000
                                     first 12 bits, user code          C01770000
                                     in last 12 bits).                  01780000
         SPACE 1                                                        01790000
ENF78_QUEUE      DS    XL1         Current phase job is queued for      01800000
         SPACE 1                                                        01810000
*------------------------------------------------------------*          01820000
*        JES3 Phases                                         *          01830000
*------------------------------------------------------------*          01840000
         SPACE 1                                                        01850000
ENF78_Q_NONE     EQU   0           No previous queue (job create)       01860000
ENF78_Q_CONVERT  EQU   2           Conversion                           01870000
ENF78_Q_PSCBAT   EQU   3           Postscan (batch)                     01880000
ENF78_Q_PSCDSL   EQU   4           Postscan (demand select)             01890000
ENF78_Q_FETCH    EQU   5           Volume fetch                         01900000
ENF78_Q_VOLWT    EQU   6           Start Setup                          01910000
ENF78_Q_SYSSEL   EQU   7           MDS system select processing         01920000
ENF78_Q_ALLOC    EQU   8           resource allocation                  01930000
ENF78_Q_VOLUAV   EQU   9           unavailable VOL(s)                   01940000
ENF78_Q_VERIFY   EQU   10          volume mounts                        01950000
ENF78_Q_SYSVER   EQU   11          MDS system verify processing         01960000
ENF78_Q_ERROR    EQU   12          Demand Select                        01970000
ENF78_Q_SELECT   EQU   13          Execution                            01980000
ENF78_Q_ONMAIN   EQU   14          Execution                            01990000
ENF78_Q_BRKDWN   EQU   17          Breakdown                            02000000
ENF78_Q_RESTRT   EQU   18          MDS restart proc                     02010000
ENF78_Q_DONE     EQU   19          Main and MDS proc. complete          02020000
ENF78_Q_OUTPUT   EQU   20          Output service                       02030000
ENF78_Q_OUTQUE   EQU   21          Output service WTR                   02040000
ENF78_Q_OSWAIT   EQU   22          Awaiting rsvd services               02050000
ENF78_Q_CMPLT    EQU   23          Output service complete              02060000
ENF78_Q_DEMSEL   EQU   24          Demand Select                        02070000
ENF78_Q_EFWAIT   EQU   25          Ending function rq waiting          C02080000
                                     or i/o completion                  02090000
ENF78_Q_EFBAD    EQU   26          Ending function rq not Processed     02100000
         SPACE 1                                                        02110000
*------------------------------------------------------------*          02120000
*        JES2 Phases - phases common to both JES2 and JES3   *          02130000
*        are listed above and commented below.               *          02140000
*------------------------------------------------------------*          02150000
         SPACE 1                                                        02160000
ENF78_Q_INPUT    EQU   128         Input queue (pre-execution)          02170000
ENF78_Q_RECEIVER EQU   136         Input queue (post-execution)         02180000
*     Q_CONVERT  EQU   2           Conversion queue                     02190000
*     Q_VOLWT    EQU   6           Setup queue                          02200000
*     Q_ONMAIN   EQU   14          Execution queue                      02210000
ENF78_Q_SPIN     EQU   132         Spin queue                           02220000
*     Q_BRKDWN   EQU   17          Output queue                         02230000
*     Q_OUTPUT   EQU   20          Hardcopy queue                       02240000
ENF78_Q_PURGE    EQU   134         Purge queue                          02250000
ENF78_Q_XMIT     EQU   137         NJE transmission queue               02260000
         SPACE 1                                                        02270000
                 DS    XL3         Reserved                             02280000
         SPACE 1                                                        02290000
ENF78_JESDATA    DS    CL16        JES-specific data for job            02300000
         SPACE 1                                                        02310000
ENF78_JOB_CORR   DS    CL64        Job correlator              @Z21LCOR 02320000
         SPACE 1                                                        02330000
                 DS    0D          Establish alignment                  02340000
         SPACE 1                                                        02350000
ENF78_FIXED_SIZE EQU   *-ENF78     Size of ENF78 fixed section          02360000
         SPACE 1                                                        02370000
         AIF   ('&DSECT' EQ 'NO').ENF7840                               02380000
ENF78_VEXT       DSECT             ENF78 variable data extension        02390000
         AGO   .ENF7850                                                 02400000
.ENF7840 ANOP                                                           02410000
ENF78_VEXT       DS    0D          ENF78 variable data extension        02420000
.ENF7850 ANOP                                                           02430000
ENF78_VEXT_EYE   DC    CL6'ENF78X' Eyecatcher                           02440000
ENF78_VEXT_LENGTH  DS  H           Length of variable extension         02450000
ENF78_REQDATA    DS    0D          Beginning of variable data           02460000
ENF78_VEXT_SIZE0 EQU   *-ENF78_VEXT                                     02470000
         SPACE 1                                                        02480000
*                                                                       02490000
*        ENF78_OPTIONS =  ENF78_OPT_JOB_NOTIFY_EXIST                    02500000
*                                                                       02510000
         SPACE 1                                                        02520000
                 ORG   ENF78_REQDATA                                    02530000
ENF78_JOB_NOTIFY_DATA DS    XL4096     Job Notification data            02540000
                 DS    0D                                               02550000
         SPACE 1                                                        02560000
ENF78_VEXT_SIZE1 EQU   *-ENF78_VEXT                                     02570000
                 ORG   ,                                                02580000
                 DS    0D                                               02590000
ENF78_VEXT_MAXSIZE EQU *-ENF78_VEXT  Largest size for ENF 78           C02600000
                                      variable extension                02610000
.END     ANOP                                                           02620000
         MEND  ,          */                                            02630000
*                                                                       02640000
* %ENF78_PLX: ;                                                         02650000
*  %IF EF78 = '' %THEN                                                  02660000
*    %EF78 = ' ';                                                       02670000
*  %IF EF78X = '' %THEN                                                 02680000
*    %EF78X = ' ';                                                      02690000
*  DCL ENF78_VONE  FIXED(8)  CONSTANT(1);    /* Version One          */ 02700000
*  DCL ENF78_CVER  FIXED(8)  CONSTANT(ENF78_VONE);                      02710000
*                                            /* Current Version      */ 02720000
*  DCL ENF78_FIXED_SIZE  FIXED(16)  CONSTANT(LENGTH(ENF78));            02730000
*                              /* Length of fixed portion of ENF     */ 02740000
*  DCL ENF78_VEXT_SIZE0  FIXED(16)  CONSTANT(LENGTH(ENF78_VEXT_BASIC)); 02750000
*                              /* Length of basic extension          */ 02760000
*  DCL ENF78_VEXT_SIZE1  FIXED(16)  CONSTANT(LENGTH(ENF78_VEXT_BASIC)+  02770000
*                                  LENGTH(ENF78_VEXT_REQDATA1));        02780000
*                              /* Length of basic extension plus        02790000
*                                 request data 1 - job notification     02800000
*                                 data                               */ 02810000
*  DCL ENF78_VEXT_MAXSIZE FIXED(16) CONSTANT(LENGTH(ENF78_VEXT));       02820000
*                              /* Length of variable portion of ENF  */ 02830000
*  DCL ENF78_JOB_NOTIFY               FIXED(8) CONSTANT(1);             02840000
*                              /* Job was processed                  */ 02850000
*                                                                       02860000
*  DCL ENF78_Q_NONE                   FIXED(8) CONSTANT(0);             02870000
*                              /*  No previous queue (job create)    */ 02880000
*  DCL ENF78_Q_CONVERT                FIXED(8) CONSTANT(2);             02890000
*                              /*  Conversion                        */ 02900000
*  DCL ENF78_Q_PSCBAT                 FIXED(8) CONSTANT(3);             02910000
*                              /*  Postscan (batch)                  */ 02920000
*  DCL ENF78_Q_PSCDSL                 FIXED(8) CONSTANT(4);             02930000
*                              /*  Postscan (demand select)          */ 02940000
*  DCL ENF78_Q_FETCH                  FIXED(8) CONSTANT(5);             02950000
*                              /*  Volume fetch                      */ 02960000
*  DCL ENF78_Q_VOLWT                  FIXED(8) CONSTANT(6);             02970000
*                              /*  Start Setup                       */ 02980000
*  DCL ENF78_Q_SYSSEL                 FIXED(8) CONSTANT(7);             02990000
*                              /*  MDS system select processing      */ 03000000
*  DCL ENF78_Q_ALLOC                  FIXED(8) CONSTANT(8);             03010000
*                              /*  resource allocation               */ 03020000
*  DCL ENF78_Q_VOLUAV                 FIXED(8) CONSTANT(9);             03030000
*                              /*  unavailable VOL(s)                */ 03040000
*  DCL ENF78_Q_VERIFY                 FIXED(8) CONSTANT(10);            03050000
*                              /*  volume mounts                     */ 03060000
*  DCL ENF78_Q_SYSVER                 FIXED(8) CONSTANT(11);            03070000
*                              /*  MDS system verify processing      */ 03080000
*  DCL ENF78_Q_ERROR                  FIXED(8) CONSTANT(12);            03090000
*                              /*  Demand Select                     */ 03100000
*  DCL ENF78_Q_SELECT                 FIXED(8) CONSTANT(13);            03110000
*                              /*  Execution                         */ 03120000
*  DCL ENF78_Q_ONMAIN                 FIXED(8) CONSTANT(14);            03130000
*                              /*  Execution                         */ 03140000
*  DCL ENF78_Q_BRKDWN                 FIXED(8) CONSTANT(17);            03150000
*                              /*  Breakdown                         */ 03160000
*  DCL ENF78_Q_RESTRT                 FIXED(8) CONSTANT(18);            03170000
*                              /*  MDS restart proc                  */ 03180000
*  DCL ENF78_Q_DONE                   FIXED(8) CONSTANT(19);            03190000
*                              /*  Main and MDS proc. complete       */ 03200000
*  DCL ENF78_Q_OUTPUT                 FIXED(8) CONSTANT(20);            03210000
*                              /*  Output service                    */ 03220000
*  DCL ENF78_Q_OUTQUE                 FIXED(8) CONSTANT(21);            03230000
*                              /*  Output service WTR                */ 03240000
*  DCL ENF78_Q_OSWAIT                 FIXED(8) CONSTANT(22);            03250000
*                              /*  Awaiting rsvd services            */ 03260000
*  DCL ENF78_Q_CMPLT                  FIXED(8) CONSTANT(23);            03270000
*                              /*  Output service complete           */ 03280000
*  DCL ENF78_Q_DEMSEL                 FIXED(8) CONSTANT(24);            03290000
*                              /*  Demand Select                     */ 03300000
*  DCL ENF78_Q_EFWAIT                 FIXED(8) CONSTANT(25);            03310000
*                              /*  Ending function rq waiting        */ 03320000
*  DCL ENF78_Q_EFBAD                  FIXED(8) CONSTANT(26);            03330000
*                              /*  Ending function rq not Processed  */ 03340000
*  DCL ENF78_Q_INPUT                  FIXED(8) CONSTANT(128);           03350000
*                              /*  Input queue (pre-execution)       */ 03360000
*  DCL ENF78_Q_RECEIVER               FIXED(8) CONSTANT(136);           03370000
*                              /*  Input queue (post-execution)      */ 03380000
*  DCL ENF78_Q_SPIN                   FIXED(8) CONSTANT(132);           03390000
*                              /*  Spin queue                        */ 03400000
*  DCL ENF78_Q_PURGE                  FIXED(8) CONSTANT(134);           03410000
*                              /*  Purge queue                       */ 03420000
*  DCL ENF78_Q_XMIT                   FIXED(8) CONSTANT(137);           03430000
*                              /*  NJE transmission queue            */ 03440000
*                                                                       03450000
*  DCL ENF78_CUNK                     FIXED(8) CONSTANT(0);             03460000
*                                            /* No completion info   */ 03470000
*  DCL ENF78_CNRM                     FIXED(8) CONSTANT(1);             03480000
*                                            /* Job ended normally   */ 03490000
*  DCL ENF78_CECC                     FIXED(8) CONSTANT(2);             03500000
*                                            /* Job ended by cc      */ 03510000
*  DCL ENF78_CJCL                     FIXED(8) CONSTANT(3);             03520000
*                                            /* Job had a JCL error  */ 03530000
*  DCL ENF78_CCAN                     FIXED(8) CONSTANT(4);             03540000
*                                            /* Job was canceled     */ 03550000
*  DCL ENF78_CABN                     FIXED(8) CONSTANT(5);             03560000
*                                            /* Job ABENDed          */ 03570000
*  DCL ENF78_CCAB                     FIXED(8) CONSTANT(6);             03580000
*                                            /* Converter ABENDed    */ 03590000
*  DCL ENF78_CSEC                     FIXED(8) CONSTANT(7);             03600000
*                                            /* Security error       */ 03610000
*  DCL ENF78_CEOM                     FIXED(8) CONSTANT(8);             03620000
*                                            /* Job ABENDed in end of   03630000
*                                                memory processing   */ 03640000
*  DCL ENF78_CCNV                     FIXED(8) CONSTANT(9);             03650000
*                                            /* Converter error         03660000
*                                                            @Z13LJBR*/ 03670000
*  DCL ENF78_CSYS                     FIXED(8) CONSTANT(10);            03680000
*                                            /* System failure          03690000
*                                                            @Z13LJBR*/ 03700000
*  DCL ENF78_CFLU                     FIXED(8) CONSTANT(11);            03702000
*                                            /* Job has been flushed    03704000
*                                                            @Z22LDEP*/ 03706000
*  DECLARE                                                              03710000
*   1       ENF78 EF78 BDY(DWORD),                                      03720000
*     3       ENF78_ID        CHAR(6),       /* Eye catcher 'ENF78 ' */ 03730000
*     3       ENF78_VERSION   FIXED(8),      /* Version of mapping   */ 03740000
*     3       *               FIXED(8),      /* Reserved             */ 03750000
*     3       ENF78_LENGTH    FIXED(31),     /* Length of parameter     03760000
*                                               list                 */ 03770000
*     3       ENF78_FIXED_LENGTH  FIXED(16), /* Length of fixed         03780000
*                                               section              */ 03790000
*     3       ENF78_QUALIFIER FIXED(8),      /* Qualifier code       */ 03800000
*     3       ENF78_OPTIONS   FIXED(8),      /* ENF Options          */ 03810000
*       5       ENF78_OPT_JOB_NOTIFY_EXIST   /* Job Notification     */ 03811000
*                               BIT(1),      /*  data exists @OA62182*/ 03812000
*       5       ENF78_OPT_JES_HANDLED        /* Handled by JES       */ 03813000
*                               BIT(1),      /*              @OA62182*/ 03814000
*       5       *               BIT(6),      /* Reserved     @OA62182*/ 03815000
*     3       ENF78_JES_NAME  CHAR(8),       /* JES2 Member Name or     03820000
*                                               JES3 MAIN name where    03830000
*                                               this signal originated  03840000
*                                                                    */ 03850000
*     3       ENF78_JESPLEX_ID  CHAR(8),     /* Unique JESPLEX          03860000
*                                               identifier              03870000
*                                                                    */ 03880000
*     3       ENF78_JOBNAME     CHAR(8),     /* Job name                03890000
*                                                                    */ 03900000
*     3       ENF78_JOBID       CHAR(8),     /* Job id                  03910000
*                                                                    */ 03920000
*     3       ENF78_ORG_JOBID   CHAR(8),     /* Original job id         03930000
*                                                                    */ 03940000
*     3       ENF78_ORG_NODE    CHAR(8),     /* Origin node             03950000
*                                                                    */ 03960000
*     3       ENF78_SUB_MVS     CHAR(8),     /* Submitting MVS system   03970000
*                                               name                 */ 03980000
*     3       ENF78_JOBCLASS    CHAR(8),     /* Current job class       03990000
*                                               identifier              04000000
*                                                                    */ 04010000
*     3       ENF78_SRVCLASS    CHAR(8),     /* Current service         04020000
*                                               class                   04030000
*                                                                    */ 04040000
*     3       ENF78_OWNERID     CHAR(8),     /* Job owner ID            04050000
*                                                                    */ 04060000
*     3       ENF78_RDR_DATE    FIXED(32),   /* Reader on date       */ 04070000
*     3       ENF78_RDR_TIME    FIXED(32),   /* Reader on time       */ 04080000
*     3       ENF78_MAXCC       FIXED(32),   /* Completion code         04090000
*                                               information          */ 04100000
*       5       ENF78_COMP      FIXED(8),    /* Code identifier      */ 04110000
*         7     ENF78_CAB          BIT(1),   /* ABEND CODE           */ 04120000
*         7     ENF78_CCC          BIT(1),   /* Completion code      */ 04130000
*         7     ENF78_CREQ         BIT(1),   /* JOBRC comp code set     04140000
*                                                                    */ 04150000
*         7     ENF78_CTYPE        BIT(5),   /* Completion type         04160000
*                                                                    */ 04170000
*       5       ENF78_CODE      FIXED(24),   /* Completion code      */ 04180000
*     3     ENF78_QUEUE       FIXED(8),      /* Current phase        */ 04190000
*     3     *                 CHAR(3),       /* Reserved             */ 04200000
*     3     ENF78_JESDATA     CHAR(16),      /* JES-specific data    */ 04210000
*     3     ENF78_JOB_CORR    CHAR(64),      /* Job correlator       */ 04220000
*     3     *                 CHAR(0) BDY(DWORD);  /* End on a          04230000
*                                               double word boundary */ 04240000
*                                                                       04250000
*  DECLARE                                                              04260000
*   1     ENF78_VEXT EF78X BDY(DWORD),                                  04270000
*     3     ENF78_VEXT_FULL,                                            04280000
*       5     ENF78_VEXT_BASIC,                                         04290000
*         7     ENF78_VEXT_EYE    CHAR(6),   /* Eyecatcher           */ 04300000
*         7     ENF78_VEXT_LENGTH FIXED(16), /* Length of extension  */ 04310000
*         7     *                 CHAR(0) BDY(DWORD), /* End on double  04320000
*                                               word boundary        */ 04330000
*       5     ENF78_VEXT_REQDATA,            /* Request specific data   04340000
*                                                                    */ 04350000
*         7   ENF78_VEXT_REQDATA1 BDY(DWORD),  /* Job Notify data    */ 04360000
*           9   ENF78_JOB_NOTIFY_DATA  CHAR(4096),  /* Job notification 04370000
*                                                      data          */ 04380000
*           9   *                 CHAR(0) BDY(DWORD), /* End on double  04390000
*                                                word boundary       */ 04400000
*       5     *                   CHAR(0) BDY(DWORD); /* End on double  04410000
*                                                word boundary       */ 04420000
*                                                                       04430000
* @Logic;                                                               04440000
* #PRAGMA TOOL=PADI.                                                    04450000
* #PADIDELETE.ENF78_CTYPE                                               04460000
* #PADIDELETE.ENF78_VEXT_FULL                                           04470000
* #PADIDELETE.ENF78_VEXT_BASIC                                          04480000
* #PADIDELETE.ENF78_VEXT_REQDATA                                        04490000
* #PADIDELETE.ENF78_VEXT_REQDATA1                                       04500000
* #PADIDELETE.ENF78_REQDATA                                             04510000
* #EPRAGMA                                                              04520000
* @ENDLOGIC;                                                            04530000
*/*                          END OF MACRO                            */ 99999999
