*        %GOTO JPLEXCMT;          /* Bilingual Mapping Macro            00010000
         MACRO                                                          00020000
         IAZJPLEX                                                       00030000
.*/      %JPLEXCMT: ;                                             /* */ 00040000
*                                                                       00050000
*/**** START OF SPECIFICATIONS *******************************          00060000
.****PROPRIETARY-STATEMENT************************************          00070000
.*01* PROPRIETARY STATEMENT:                                 *          00080000
.*                                                           *          00090000
.*   LICENSED MATERIALS-PROPERTY OF IBM                      *          00100000
.*   5650-ZOS Copyright IBM Corp. 2009, 2021                 *          00110000
.*                                                           *          00120000
.*   STATUS:  HBB77D0                                        *          00130000
.*                                                           *          00140000
.****END-OF-PROPRIETARY-STATEMENT*****************************          00150000
*                                                            *          00160000
*01* DESCRIPTIVE NAME: JESplex  Information Parameter List   *          00170000
*                      for SSI 82.                           *          00180000
*02*  ACRONYM:  IAZJPLEX                                     *          00190000
*                                                            *          00200000
*                                                            *          00210000
*01* MACRO NAME:  IAZJPLEX                                   *          00220000
*                                                            *          00230000
*01* DSECT NAME:  JPLEX                                      *          00240000
*01* LABEL PREFIX:  JPLX                                     *          00250000
*                                                            *          00260000
*01* COMPONENT ID:  JES Common (SC141)                       *          00270000
*                                                            *          00280000
*01* EXTERNAL CLASSIFICATION:                                *          00290000
*02*  GUPI:  BASE                                            *          00300000
*02*  DMTI:  FIELDS                                          *          00310000
*            JPLXSTRP  JPLXSTOR  JPLXSTHL                    *          00320000
*            JPLXSTSP  JPLXSTPL  JPLXSTTL  JPLXSTNX          *          00330000
*            JPLXSTCP  JPLXSTBG  JPLXUSER                    *          00340000
*            JPLXSZE1  JPXHDSZ   JPXGENSZ                    *          00350000
*            JPX3SZ    JPX2SIZ                               *          00360000
*01* END OF EXTERNAL CLASSIFICATION:                         *          00370000
*                                                            *          00380000
*01* EYE-CATCHER:  JESPLEXI                                  *          00390000
*02*  OFFSET:      JPLXID                                    *          00400000
*02*  LENGTH:      L'JPLXID                                  *          00410000
*                                                            *          00420000
*01* STORAGE ATTRIBUTES:                                     *          00430000
*02*  SUBPOOL: Parameter List = Subpool of Caller            *          00440000
*              Output Data    = Subpool 230                  *          00450000
*02*  KEY:     Parameter List = Key of Caller                *          00460000
*              Output Data    = Key 1                        *          00470000
*02*  RESIDENCY:                                             *          00480000
*      Virtual = 31 bit private storage                      *          00490000
*      real    = 64 bit storage                              *          00500000
*02*  FREQUENCY = 1 per call to function code 82 with        *          00510000
*                 function request byte of SSJPJXOD.         *          00520000
*                                                            *          00530000
*                                                            *          00540000
*01* SIZE:                                                   *          00550000
*                                                            *          00560000
*     See JPLXSZE                                            *          00570000
*                                                            *          00580000
*01* CREATED BY:                                             *          00590000
*                                                            *          00600000
*     caller of SSI function 'SSOBSSJP' = 82                 *          00610000
*                                                            *          00620000
*01* POINTED TO BY:                                          *          00630000
*                                                            *          00640000
*     SSJPUSER in the SSOB extension                         *          00650000
*                                                            *          00660000
*01* SERIALIZATION:                                          *          00670000
*                                                            *          00680000
*     None                                                   *          00690000
*                                                            *          00700000
*01* FUNCTION:                                               *          00710000
*                                                            *          00720000
*     This macro provides the mapping of the parameter       *          00730000
*     list used by programs to request JESplex Data from     *          00740000
*     the JES subsystem.                                     *          00750000
*                                                            *          00760000
*01* METHOD OF ACCESS:                                       *          00770000
*                                                            *          00780000
*02*  ASM:                                                   *          00790000
*      IAZJPLEX                                              *          00800000
*                                                            *          00810000
*02*  PL/X:                                                  *          00820000
*      %DCL JPLEX_ATRB CHAR                                  *          00830000
*      %JPLEX_ATRB = 'value'                                 *          00840000
*      %INCLUDE SYSLIB(IAZJPLEX)                             *          00850000
*                                                            *          00860000
*      where value is valid control block attributes,        *          00870000
*      such as 'BASED(SSJPUSER)'.  If JPLEX_ATRB='',         *          00880000
*      then 'BASED' will be used.                            *          00890000
*                                                            *          00900000
*01* USED BY:                                                *          00910000
*                                                            *          00920000
*     This is used by programs to request JESplex Data       *          00930000
*     from the JES subsystem.                                *          00940000
*                                                            *          00950000
*01* DELETED BY:                                             *          00960000
*                                                            *          00970000
*     caller                                                 *          00980000
*                                                            *          00990000
*01* RESTRICTIONS:                                           *          01000000
*                                                            *          01010000
*     None                                                   *          01020000
*                                                            *          01030000
*01* NOTES:                                                  *          01040000
*                                                            *          01050000
*     In the following description of fields, the notation   *          01060000
*     before the field description can be one of the         *          01070000
*     following:                                             *          01080000
*                                                            *          01090000
*        I.    Input (application supplied information)      *          01100000
*        IS    Input (used for selection/filtering )         *          01110000
*        IS*   Same as IS, but field supports wild cards:    *          01120000
*                * = any zero or more characters             *          01130000
*                ? = any single character                    *          01140000
*        O.    Output (system supplied information)          *          01150000
*                                                            *          01160000
*     The term "Member" is used throughout this macro to     *          01170000
*     refer to a JES2 member.  For JES3 implementations      *          01180000
*     you may substitute the notion of System or Main when   *          01190000
*     you encounter this term.                               *          01200000
*                                                            *          01210000
****** END OF SPECIFICATIONS ********************************/          01220000
*/********************************************************************/ 01230000
*/*01* CHANGE ACTIVITY:                                              */ 01240000
*/* $MG11386=SDSFASST HBB7760 080930 MLN:  JPLEX FCS fixes           */ 01248600
*/*                                        MG11386                   */ 01249200
*/* $ME15533=SDSFASST HBB7760 090227 BWT:  IAZ macro PLX Section Siz */ 01249400
*/*                                        ME15533                   */ 01249600
*/*                                                                  */ 01249700
*/* $APBLSSF=SDSFAST  HBB7780 100322 ALP:  IAZJPLEX macro updates    */ 01249800
*/*                                                                  */ 01251800
*/* $Z22LSSF=SDSFASST HBB77A0 131107 CLW:  SDSF Assist               */ 01253800
*/* $Z22LACT=CKPTUNE  HBB77A0 140120 ALP:  Ckpt tuning stage 2       */ 01255800
*/*                                                                  */ 01256400
*/* $Z24LCKS=CKPTHC   HBB77B0 171113 TJW:  CKPT information SSI      */ 01257000
*/*                                                                  */ 01257200
*/* $Z24LSDS=SDSFAST  HBB77C0 181130 TJW:  Updates for SDSF          */ 01257400
*/* $Z24D144=BASEQ    HBB77C0 190203 TJW:  Emergency subsys name in  */ 01257500
*/*                                        S298109                   */ 01257600
*/* $Z25LPCN=JES2PLCY HBB77D0 190731 TJW:  $P CNVT                   */ 01257700
*/* $Z25LENZ=ENCRYPT  HBB77D0 210204 NAB:  Advanced format indicator */ 01258400
*/*                                                                  */ 01259100
*/*01* A000000-999999    Created for Z/OS release 11         @Z11LSSI*/ 01260000
*/********************************************************************/ 01270000
*/************************************************************          01280000
*01* NOTES:                                                  *          01290000
*                                                            *          01300000
*          Bilingual Mapping Macro PL/X                      *          01310000
*                                                            *          01320000
*        Dependencies =                                      *          01330000
*                                                            *          01340000
*          PL/X Version = This macro uses the macro          *          01350000
*            variable JPLEX_ATRB. JPLEX_ATRB must be         *          01360000
*            declared and set to valid control block         *          01370000
*            attributes before the macro is invoked.         *          01380000
*                                                            *          01390000
*                                                            *          01395000
*************************************************************/          01400000
*/*                                                                  */ 01410000
* % GOTO END_OF_ASM_JPLX; /*                                            01420000
*                                                                       01430000
         SPACE 1                                                        01440000
**************************************************************          01450000
*                                                            *          01460000
*        Additional return codes, specific to this function, *          01470000
*        that can be placed into SSJPRETN in IAZSSJP.  See   *          01480000
*        IAZSSJP for common SSJPRETN return codes.           *          01490000
*                                                            *          01500000
**************************************************************          01510000
JPLXINVA EQU   132                 Invalid search arguments.            01520000
JPLXINV1 EQU   136                 Status filter invalid                01530000
JPLXINV2 EQU   140                 System Name filter Invalid           01540000
JPLXINV3 EQU   144                 Member Name filter Invalid           01550000
JPLXINV4 EQU   148                 JES Specific filter invalid          01560000
         EJECT ,                                                        01570000
**************************************************************          01580000
*                                                            *          01590000
*        The following structure (JPLEX) defines the         *          01600000
*        input parameters passed on the call to this SSI.    *          01610000
*                                                            *          01620000
**************************************************************          01630000
JPLEX    DSECT                                                          01640000
JPLXID   DS    CL8'JESPLEXI'       I.Eye catcher                        01650000
JPLXLEN  DS    AL2(JPLXSZE)        I.Length of JPLEX parameter          01660000
         SPACE 1                                                        01670000
**************************************************************          01680000
*                                                            *          01690000
*        There are two 2 byte versions for this SSOB         *          01700000
*        extension.  JPLXVER is the version provided by the  *          01710000
*        caller.  They indicate the level of the control     *          01720000
*        block passed to the service.  As new input          *          01730000
*        fields are added to the service, the caller         *          01740000
*        provided version indicates what the service is to   *          01750000
*        consider valid.                                     *          01760000
*                                                            *          01770000
*        JPLXVERO is the version information returned from   *          01780000
*        the service.  This implies what fields the service  *          01790000
*        actually examined and what data is returned.  If    *          01800000
*        the service is at a level higher than the level of  *          01810000
*        the caller, JPLXVERO may be higher than JPLXVER.    *          01820000
*        In this case, only the fields valid at the JPLXVER  *          01830000
*        level are actually examined or set.                 *          01840000
*                                                            *          01850000
*        The 2 bytes of version information is a 1 byte      *          01860000
*        level number (changed only when a new release adds  *          01870000
*        significant function) and a 1 byte modifier         *          01880000
*        (changed only when function is added via service).  *          01890000
*                                                            *          01900000
**************************************************************          01910000
JPLXVER  DC    0FL2'0'             I.SSOB version                       01920000
JPLXVERL DC    AL1(JPLXCVRL)       I.SSOB version level                 01930000
JPLXVERM DC    AL1(JPLXCVRM)       I.SSOB version modifier              01940000
JPLXV010 EQU   X'0100'               Initial version number of         C01950000
                                     IAZJPLEX.                          01960000
JPLXV011 EQU   X'0101'                 Active volume info        @Z23BH 01962000
JPLXV020 EQU   X'0200'               z/OS 1.13 version           @Z23BH 01965000
JPLXSVR# EQU   X'0200'               Service version number of   @Z23BGC01970000
                                     IAZJPLEX - Latest Version   @Z23BG 01980000
JPLXCVRL EQU   2                     Current version level       @Z23BG 01990000
JPLXCVRM EQU   0                     Current version modifier           02000000
         SPACE 1                                                        02010000
JPLXVERO DC    FL2'0'              O.Subsystem version/modifier         02020000
         SPACE 1                                                        02030000
         DC    XL2'0'              Reserved.                            02040000
JPLXUSER DS    0F                  Placeholder. Do not use.             02050000
         SPACE 1                                                        02060000
**************************************************************          02070000
*                                                            *          02080000
*        JPLXSTRP is an anchor for use by the subsystem      *          02090000
*        that responds to this request.  It is expected that *          02100000
*        the caller will set this to zero the FIRST time an  *          02110000
*        SSOB extension is used and from that point on it    *          02120000
*        will be managed by the subsystem.                   *          02130000
*                                                            *          02140000
**************************************************************          02150000
JPLXSTRP DC    A(0)                Storage management anchor.    @Z24BK 02160000
         SPACE 1                                                        02190000
**************************************************************          02200000
*                                                            *          02210000
*        Begin input-only fields.                            *          02220000
*                                                            *          02230000
*        NOTES: - Many of the filters only apply to JES2 or  *          02240000
*                 JES3.  Each filter is denoted with what    *          02250000
*                 applies.                                   *          02260000
*                                                            *          02270000
**************************************************************          02280000
JPLXFLTR DC    BL1'0'              IS.Indicate desired filters          02290000
JPLXFSNM EQU   X'80'                  Filter on System Name             02300000
JPLXFMNM EQU   X'40'                  Filter on Member Name             02310000
         SPACE 1                                                        02320000
         DS    XL3                 Reserved                             02330000
JPLXSTS1 DS    XL1                 Composite Status                     02340000
JPLDRAIN EQU   X'80'                  Drained. (For Jes3 -             C02350000
                                      it is a Down main)                02360000
JPLINITZ EQU   X'40'                  Initializing (JES2 Only)          02370000
JPLXACTV EQU   X'20'                  Active member                     02380000
JPLDRING EQU   X'10'                  Draining Member                  C02390000
                                       (JES2 Only)                      02395000
JPLOUDEF EQU   X'08'                  Omit Undefined Members           C02400000
                                       (JES2 Only)                      02403000
JPLNATCH EQU   X'04'                  Not Attached (JES3 Only)          02406000
         SPACE 1                                                        02410000
JPLXSPEC DC    BL1'0'              IS.JES specific filters              02420000
JPLXINDP EQU   B'10000000'           Member is independent             C02430000
                                     (JES2 Only)                        02440000
JPLXBOSS EQU   B'01000000'           Member is BOSS (JES2 only)         02450000
JPLXPRIM EQU   B'00100000'           Member is primary subsystem       C02460000
                                       (JES2 only)                      02465000
JPLXGLOB EQU   B'00010000'           Global (J3 Only)                   02470000
JPLXLOCL EQU   B'00001000'           Local  (J3 Only)                   02480000
         SPACE 1                                                        02490000
         DS    XL3                   Reserved                           02500000
         SPACE 1                                                        02510000
**************************************************************          02520000
*       NOTE: Each filter below is enabled via one           *          02530000
*             of the bit settings above.                     *          02540000
*                                                            *          02550000
**************************************************************          02560000
         SPACE 1                                                        02570000
JPLXSNAM DC    CL8' '              IS*.MVS System Name filter          C02580000
                                     See JPLXFSNM bit                   02590000
JPLXMNAM DC    CL8' '              IS*.Member Name filter              C02600000
                                     See JPLXFMNM bit                   02610000
         DC    XL3'0'              Reserved                             02615000
         DC    10F'0'              Reserved for future use              02620000
         SPACE 1                                                        02630000
**************************************************************          02640000
*                                                            *          02650000
*                                                            *          02660000
*        Begin output-only fields.                           *          02670000
*                                                            *          02680000
*                                                            *          02690000
**************************************************************          02700000
JPLXLPTR DC    A(0)                O.Pointer to first Member           C02710000
                                     (JPXHDR) data buffer.              02720000
JPLXNMBR DC    F'0'                O.Number of Member                  C02730000
                                     (JPXHDR) data buffers             C02740000
                                     returned.                          02750000
JPLXTRKT DC    FD'0'               O.Total Spool Tracks Defined         02760000
JPLXTRKU DC    FD'0'               O.Spool Tracks used.                 02770000
JPLXTRAT DC    FD'0'               O.Total Active Spool Tracks   @Z23BGC02772000
                                      Defined                    @Z23BG 02774000
JPLXTRAU DC    FD'0'               O.Active Spool Tracks used.   @Z23BG 02776000
JPLXXGNM DC    CL8' '              O.XCF Group name            @Z22LSSF 02776200
         SPACE 1                                                        02776400
JPLXOPT1 DC    B'00000000'         O.JESPLEX options:          @Z22LACT 02776600
JPLX1ADJ EQU   B'10000000'          CYCLEMGT=AUTO (JES2 only)  @Z22LACT 02776800
JPLX1ADV EQU   B'01000000'          Advanced format has been           C02777000
                                     activated at least once           C02777200
                                     in the MAS - advanced             C02777400
                                     format structures may             C02777600
                                     exist on SPOOL                     02777800
JPLX1ADE EQU   B'00100000'          Advanced format is                 C02778000
                                     currently enabled in the          C02778200
                                     MAS                       @Z25LENZ 02778400
         SPACE 1                                                        02779600
         DS    XL3                 Reserved                    @Z24LCKS 02779700
JPLXCKLV DS    CL8                 O.JES2 checkpoint level     @Z24LCKSC02779800
                                     ($ACTIVATE level)         @Z24LCKS 02779900
         DC    XL4'00'             Reserved for future use     @Z24LCKS 02780000
         SPACE 1                                                        02790000
JPLXSZE1 EQU   *-JPLEX             Fix parameter End: Ver 1             02800000
JPLXSZE2 EQU   *-JPLEX             Fix parameter End: Ver 2      @Z23BG 02805000
JPLXSZE  EQU   *-JPLEX             JPLX Current version                C02810000
                                    fixed parameter length              02820000
         EJECT ,                                                        02830000
**************************************************************          02840000
*                                                            *          02850000
*        Storage management fields for use by the subsystem  *          02860000
*        only.  JPLXSTRP is a token used to locate a chain   *   @Z24BK 02865000
*        of these control blocks.  All storage will be       *   @Z24BK 02870000
*        obtained in KEY 1.                                  *   @Z24BK 02880000
*                                                            *          02890000
**************************************************************          02900000
         SPACE 1                                                        02910000
JPLXSTOR DSECT ,                   Storage management DSECT             02920000
JPLXSTID DC    CL8'JPLXSTOR'       Eyecatcher                           02930000
JPLXSTHL DC    AL2(JPLXSTBG-JPLXSTOR)  Length of header area            02940000
         DC    AL2(0)              Reserved for future use              02950000
JPLXSTSP DC    X'0'                Subpool of area                      02960000
JPLXSTPL EQU   230                 Recommended subpool to use           02970000
JPLXSTTL DC    AL3(0)              Total length of area (this          C02980000
                                    includes the header)                02990000
JPLXSTNX DC    A(0)                Pointer to next area                 03000000
JPLXSTCP DC    A(0)                Pointer to 1st available            C03010000
                                     byte in this area                  03020000
JPLXSTBG DS    0A                  Start of data area                   03030000
JPLXSTSZ EQU   (JPLXSTBG-JPLXSTOR) JPLXSTOR length                      03040000
         EJECT ,                                                        03050000
**************************************************************          03060000
*                                                            *          03070000
*        The following structures define output data for this*          03080000
*        SSI. The basic layout is a chain of JESplex         *          03090000
*        Information sections.   Each JESplex section has    *          03100000
*        a common section and a  subsystem specific section. *          03110000
*        See diagram below for a high level view of the data *          03120000
*        structure layout.                                   *          03130000
*                                                            *          03140000
*                                                            *          03150000
*          JESplex INFO SECTION                              *          03160000
*          +----------------+                                *          03170000
*   JPXHDR ! JPXNXTP   =-----------> POINTER TO THE NEXT     *          03180000
*          !                !        JPXHDR IN THE CHAIN.    *          03190000
*          !                !        ZERO IF END OF CHAIN.   *          03200000
*          +----------------+                                *          03210000
*  JPXPREF ! Prefix Section !                                *          03220000
*          ! . . .          !                                *          03230000
*          +----------------+                                *          03240000
*  JPXGENI ! General        !                                *          03250000
*          ! JESplex Data   !                                *          03260000
*          ! Section        !                                *          03270000
*          ! . . .          !                                *          03280000
*          +----------------+                                *          03290000
* JPXJES3I ! Optional JES3  !                                *          03300000
*          ! JESplex        !                                *          03310000
*          ! Info Section   !                                *          03320000
*          ! . . .          !                                *          03330000
*          +----------------+                                *          03340000
* JPXJES2I ! Optional JES2  !                                *          03350000
*          ! JESplex        !                                *          03360000
*          ! Info Section   !                                *          03370000
*          ! . . .          !                                *          03380000
*          +----------------+                                *          03390000
* JPXCPREF ! Command prefix !                                *          03400000
*          ! array section  !                                *          03410000
*          ! . . .          !                                *          03420000
*          +----------------+                                *          03430000
*                                                            *          03440000
**************************************************************          03450000
         EJECT ,                                                        03460000
**************************************************************          03470000
*                                                            *          03480000
*        JESplex Header Section                              *          03490000
*                                                            *          03500000
*        Information about the JESPLEX is returned to        *          03510000
*        the issuer of the SSI.                              *          03520000
*                                                            *          03530000
*        - There can be multiple JESPLEX Areas returned.     *          03540000
*          The JPXNXTP pointer is used to navigate to the    *          03550000
*          next JESplex Header section in the chain.         *          03560000
*                                                            *          03570000
*        - To get from this header to the partition prefix   *          03580000
*          section for this partition, add the JPXOPRF       *          03590000
*          offset to the JESplex header (JPXHDR) address.    *          03600000
*                                                            *          03610000
**************************************************************          03620000
         SPACE 1                                                        03630000
JPXHDR   DSECT ,                   JESplex Header Section               03640000
JPXEYE   DC    CL8'JPXHDR  '       Eye catcher                          03650000
         SPACE 1                                                        03660000
JPXOPRF  DC    Y(JPXHDSZ)          Offset to prefix section             03670000
         DC    AL2(0)              Reserved for future use              03675000
JPXNXTP  DC    A(*-*)              Address of next JESplex              03680000
         DC    A(*-*)              Reserved for future use              03690000
         SPACE 1                                                        03700000
JPXHDSZ  EQU   *-JPXHDR            Size of this section                C03710000
                                     (Internal use only)                03720000
         SPACE 4                                                        03730000
**************************************************************          03740000
*                                                            *          03750000
*        JESplex Section Identifiers                         *          03760000
*                                                            *          03770000
**************************************************************          03780000
JPXIDPRF EQU   X'00'               JESplex Info - Prefix                03790000
JPXIDGEN EQU   X'01'               JESplex Info - General               03800000
JPXIDJS2 EQU   X'02'               JESplex Info - JES2                  03810000
JPXIDJS3 EQU   X'03'               JESplex Info - JES3                  03820000
JPXIDPFX EQU   X'04'               JESplex Info - Cmd Prefix            03830000
         SPACE 4                                                        03840000
**************************************************************          03850000
*                                                            *          03860000
*        JESplex Section Modifiers                           *          03870000
*                                                            *          03880000
**************************************************************          03890000
JPXIMGEN EQU   X'00'               Modifier - General                   03900000
         SPACE 4                                                        03910000
**************************************************************          03920000
*                                                            *          03930000
*        JESplex Prefix Section                              *          03940000
*                                                            *          03950000
*        NOTE: To get here, add the JPXOPRF header field     *          03960000
*              to the header (JPXHDR) address.               *          03970000
*                                                            *          03980000
**************************************************************          03990000
         SPACE 1                                                        04000000
JPXPREF  DSECT ,                   JESplex Prefix                       04010000
JPXPRLN  DC    AL2(0)              Length of entire JESplex            C04020000
                                    entry (Max value is 65535)         C04030000
                                    returned - other than hdr           04040000
         SPACE 1                                                        04050000
JPXPRTP  DC    AL1(JPXIDPRF)       Type     = Prefix Section            04060000
JPXPRMD  DC    AL1(JPXIMGEN)       Type Mod = General                   04070000
         SPACE 1                                                        04080000
JPXPRSZ  EQU   *-JPXPREF           Size of this section                 04090000
         SPACE 4                                                        04100000
**************************************************************          04110000
*                                                            *          04120000
*        JESplex General Information Section                 *          04130000
*                                                            *          04140000
*        NOTE: To get here, add the JPXOPRF header field     *          04150000
*              and the prefix size (JPXPRSZ) to the header   *          04160000
*              (JPXHDR) address.                             *          04170000
*                                                            *          04180000
**************************************************************          04190000
         SPACE 1                                                        04200000
JPXGENI  DSECT ,                   JESplex General                     C04210000
                                    Information.                        04220000
         SPACE 1                                                        04230000
JPXGLN   DC    Y(JPXGENSZ)         Length of this section               04240000
JPXGTY   DC    AL1(JPXIDGEN)       Type     = General Info              04250000
JPXGMD   DC    AL1(JPXIMGEN)       Type Mod = General                   04260000
JPXSBSNM DC    CL4' '              Subsystem name                       04270000
         SPACE 1                                                        04280000
JPXSTIME DC    D'0'                Date/Time of last start             C04290000
                                   STCK format                          04300000
JPXSTAT1 DC    XL1'00'             Member status                        04310000
JPXUNDEF EQU   0                      Not defined                       04315000
JPXDRAIN EQU   1                      Drained Member                    04320000
JPXINITZ EQU   2                      Initializing (J2 Only)            04330000
JPXACTIV EQU   3                      Active member                     04340000
JPXDRING EQU   4                      Draining Member (J2 Only)         04350000
JPXNATCH EQU   5                      Not Attached (J3 Only)            04355000
         SPACE 1                                                        04360000
JPXSTATC DC    CL32' '             Current Status (character string)    04370000
JPXMVSNM DC    CL8' '              MVS system name                      04380000
JPXMEMNM DC    CL8' '              JES Member Name                      04390000
JPXVERSN DC    CL8' '              Version of Product (character)       04400000
JPXSMFID DC    CL8' '              SMF ID                               04410000
JPXSYSLG DS    XL1                 Syslog Indicator                     04420000
JPXSLOGY EQU   X'80'                 Release 11 syslog support         C04422000
                                     is active for this member          04425000
JPXMEMNO DC    H'0'                JES Member Number                    04430000
JPXSTYPE DC    FL1'0'              Type of last start                   04440000
JPXCOLD  EQU   10                     COLD START                        04450000
JPX2COLF EQU   11                     COLD START with format            04460000
JPXWARM  EQU   20                     WARM START                        04470000
JPX2SRMS EQU   21                     SINGLE MEMBER WARM START          04480000
JPX3WRMD EQU   25                    JES3 WARM START TO                C04490000
                                     REPLACE A SPOOL DATASET            04500000
JPX3WRMA EQU   26                    JES3 WARM START WITH              C04510000
                                     ANALYSIS                           04520000
JPX3WDA  EQU   27                    JES3 WARM START TO                C04530000
                                     REPLACE A SPOOL DATASET WITH      C04540000
                                     ANALYSIS.                          04550000
JPXHOT   EQU   30                     HOT START                         04560000
JPX3HOTR EQU   35                    JES3 HOT START WITH               C04570000
                                     REFRESH.                           04580000
JPX3HOTA EQU   36                    JES3 HOT START WITH               C04590000
                                     ANALYSIS                           04600000
JPX3HTRA EQU   37                    JES3 HOT START WITH               C04610000
                                     REFRESH AND ANALYSIS               04620000
JPX2QUIK EQU   40                     QUICK START                       04630000
JPX3LCL  EQU   50                     JES3 LOCAL START                  04650000
         SPACE 2                                                        04660000
JPXPRODL DC    XL1'00'             Product Level (binary)               04670000
JPXSERVL DC    XL1'00'             Service Level                        04680000
         SPACE 1                                                        04690000
         DC    XL1'0'              Reserved for future use              04700000
         SPACE 1                                                        04701000
JPXTMOF  DS    F                   UTC offset of the member    @Z22LDEPC04702000
                                    in seconds                 @Z22LDEPC04703000
                                    (including leap seconds)   @Z22LDEP 04704000
JPXEMGNM DC    CL4' '              Emergency subsystem name    @Z24D144 04704500
         SPACE 1                                                        04705000
JPXGENSZ EQU   *-JPXGENI           Size of this section                C04710000
                                     (Internal use only)                04720000
         SPACE 4                                                        04730000
**************************************************************          04740000
*                                                            *          04750000
*        JESplex JES3 Specific Information                   *          04760000
*                                                            *          04770000
*        Note: To get here, add the prefix offset (JPXOPRF), *          04780000
*              the prefix size (JPXPRSZ), the general        *          04790000
*              information section size (JPXGLN)             *          04800000
*                                                            *          04810000
**************************************************************          04820000
         SPACE 1                                                        04830000
JPXJES3I DSECT ,                   JESplex JES3-specific               C04840000
                                     information                        04850000
         SPACE 1                                                        04860000
JPX3LN   DC    Y(JPX3SZ)           Section length                       04870000
JPX3TY   DC    AL1(JPXIDJS3)       Type     = JES3 Info                 04880000
JPX3MD   DC    AL1(JPXIMGEN)       Type Mod = General                   04890000
         SPACE 1                                                        04900000
         DC    F'0'                Reserved for future use              04910000
JPX3GCON DC    D'0'                Last global contact time             04920000
JPX3TRK1 DC    H'0'                Primary track group                 C04930000
                                     allocation                         04940000
JPX3TRK2 DC    H'0'                Secondary track group               C04950000
                                     allocation                         04960000
JPX3WTOL DC    H'0'                WTO message limit                    04970000
JPX3WTOI DC    H'0'                WTO message interval                C04980000
                                     (seconds)                          04990000
JPX3CSA  DC    H'0'                PBUF CSA limit                       05000000
JPX3AUX  DC    H'0'                PBUF JES3AUX limit                   05010000
JPX3FIX  DC    H'0'                Fixed PBUFS                          05020000
JPX3USR  DC    H'0'                User pages per open                 C05030000
                                     SYSOUT dataset                     05040000
JPX3SELM DC    CL8' '              Selection mode name                  05050000
JPX3SPl  DC    CL8' '              Spool partition name                 05060000
JPX3MPFX DC    CL11' '             Message prefix                       05070000
JPX3MDST DC    CL3' '              Message destination                 C05080000
                                     (M1-M32 or 1-28, 41-128)           05090000
JPX3FLG1 DC    BL1'0'              Flag byte                            05100000
JPX3GBL  EQU   B'10000000'           Global node                        05110000
JPX3ONL  EQU   B'01000000'           Online                             05120000
JPX3FLSH EQU   B'00100000'           Flushed                            05130000
JPX3CNN  EQU   B'00010000'           Connected                          05140000
JPX3NCNN EQU   JPX3FLSH+JPX3CNN      Not connected                      05150000
JPX3DOWN EQU   B'00001000'           Down                               05160000
JPX3ATT  EQU   B'00000100'           Attached                           05170000
JPX3NATT EQU   JPX3DOWN+JPX3ATT      Not attached                       05180000
         SPACE 1                                                        05190000
         DC    XL1'0'                Reserved                           05200000
JPX3SZ   EQU   *-JPXJES3I          Size of this section                C05210000
                                     (Internal use only)                05220000
         SPACE 4                                                        05230000
**************************************************************          05240000
*                                                            *          05250000
*        JESplex JES2 Specific Information                   *          05260000
*                                                            *          05270000
*        Note: To get here, add the prefix offset (JPXOPRF), *          05280000
*              the prefix size (JPXPRSZ), the general        *          05290000
*              information section size (JPXGLN)             *          05300000
*                                                            *          05310000
**************************************************************          05320000
         SPACE 1                                                        05330000
JPXJES2I DSECT ,                   JESplex  JES2                       C05340000
                                    specific Information                05350000
         SPACE 1                                                        05360000
JPX2LN   DC    Y(JPX2SIZ)          Length of this section               05370000
JPX2TY   DC    AL1(JPXIDJS2)       Type     = JES2 Info                 05380000
JPX2MD   DC    AL1(JPXIMGEN)       Type Mod = General                   05390000
         SPACE 1                                                        05400000
JPX2FLG1 DC    BL1'0'              JES2 Indicators                      05410000
JPX21IND EQU   B'10000000'           Independent Mode                   05420000
JPX21BOS EQU   B'01000000'           BOSS Indicator                     05430000
JPX21PRI EQU   B'00100000'           Primary subsystem Indicator        05440000
         SPACE 1                                                        05450000
         DS    CL3                 padding for alignment                05460000
JPX2ITIM DC    D'0'                Time last accessed checkpoint        05470000
JPX2FLG2 DC    BL1'0'              Current command being processed      05480000
JPX21P   EQU   B'00100000'           $P command                         05490000
JPX21PXQ EQU   B'00010000'           $PXEQ Command                      05500000
JPX22PCN EQU   B'00001000'           $PCNVT Command            @Z25LPCN 05505000
         SPACE 1                                                        05510000
         DC    XL3'000000'           Reserved                           05520000
JPX2HOLD DC    F'0'                Current setting MASDEF HOLD          05530000
JPX2MIND DC    F'0'                Current setting MASDEF MIN DORMANCY  05540000
JPX2MAXD DC    F'0'                Current setting MASDEF MAX DORMANCY  05550000
JPX2SYNC DC    F'0'                Current setting MASDEF SYNCTOL       05560000
JPX2AHLD DC    F'0'                Actual HOLD last checkpoint          05570000
JPX2ADRM DC    F'0'                Actual DORMANCY last checkpoint      05580000
JPX2RSID DC    CL8' '              Name of member doing reset          C05590000
                                   (reset by member - $EMEMBER)         05600000
JPX2STAT DC    FL1'0'                 Specific status indicator         05610000
JPX2DOWN EQU   B'10000000'              Down                            05620000
JPX2DEF  EQU   B'01000000'              DEFINED fiter                   05630000
JPX2INU  EQU   B'00100000'              INUSE                           05640000
JPX2FAIL EQU   B'00010000'              FAILED                          05650000
         SPACE 1                                                        05660000
JPX2UNDF EQU   X'01'                    Member UNDEFINED                05670000
JPX2UPND EQU   X'02'                    Member UNDEFINED-PENDING        05680000
JPX2ACTV EQU   JPX2DEF+JPX2INU+X'03'    Member ACTIVE                   05690000
JPX2INAC EQU   JPX2DEF+JPX2DOWN+X'04'   Member TERMINATED               05700000
JPX2INIT EQU   JPX2DEF+JPX2INU+X'05'    Member INITIALIZING             05710000
JPX2TERM EQU   JPX2DEF+JPX2INU+X'06'    Member TERMINATING              05720000
JPX2JESF EQU   JPX2DEF+JPX2DOWN+JPX2FAIL+X'07' Memb JES2-FAILED         05730000
JPX2XCFF EQU   JPX2DEF+JPX2DOWN+JPX2FAIL+X'08' Memb JESXCF-FAILED       05740000
JPX2MVSG EQU   JPX2DEF+JPX2DOWN+JPX2FAIL+X'09' Memb MVS-GONE            05750000
JPX2DORM EQU   JPX2DEF+JPX2INU+X'0A'    Member DORMANT                 C05760000
                                        (Never set)                     05770000
JPX2DRAN EQU   JPX2DEF+JPX2DOWN+X'0B'   Member DRAINED                  05780000
JPX2ALIC EQU   JPX2DEF+JPX2DOWN+JPX2FAIL+X'0C' Member awaiting         C05790000
                                        ALICE processing                05800000
         SPACE 1                                                        05810000
JPX2STA2 DC    XL1'0'              2nd status byte                      05820000
JPX2EDEL EQU   B'10000000'           Member deleted                     05820300
JPX2$IND EQU   B'01000000'           Member in independent mode         05821200
JPX2SIOT EQU   B'00100000'           SPIN IOT being purged              05822100
JPX2NMAL EQU   B'00010000'           Member has two checkpoint         C05823000
                                       datasets allocated               05823900
JPX2EGON EQU   B'00001000'           XCF system gone                    05824800
JPX2PRIM EQU   B'00000010'           Member is a primary subsystem      05825700
JPX2SPLX EQU   B'00000001'           Command Prefix has                C05826600
                                       SYSplex scope                    05827500
         SPACE 1                                                        05828400
JPX2STA3 DC    XL1'0'              3rd status byte             @Z24LSDS 05828600
JPX2TRCK EQU   B'10000000'          A TRACK exists for member  @Z24LSDS 05828800
JPX2ALRT EQU   B'01000000'          An ALERT exists for member @Z24LSDS 05829000
JPX2NTCE EQU   B'00100000'          A NOTICE exists for member @Z24LSDS 05829200
JPX2CRIT EQU   B'00010000'            at least 1 is critical   @Z24LSDS 05829400
         DC    XL1'0'              Reserved for future use     @Z24LSDS 05830000
         SPACE 1                                                        05840000
JPX2SIZ  EQU   *-JPXJES2I          Size of this section                C05850000
                                     (Internal use only)                05860000
         EJECT                                                          05870000
**************************************************************          05880000
*                                                            *          05890000
*        JESplex Command Prefix Information                  *          05900000
*                                                            *          05910000
*        Note:  This section follows immediately after       *          05920000
*               the JES2 or Jes3 specific section            *          05930000
*               depending on whether JES2 or JES3            *          05940000
*               implementation.                              *          05950000
*                                                            *          05960000
*               This is a variable length section.  The      *          05970000
*               length depends upon the number of command    *          05980000
*               prefix entries.   (JES2 will have only one   *          05990000
*               entry.  JES3 may have up to 14 entries.      *          06000000
*                                                            *          06010000
**************************************************************          06020000
         SPACE 1                                                        06030000
JPXCPREF DSECT ,                   JESplex command prefix              C06040000
                                   information.                         06050000
         SPACE 1                                                        06060000
JPXCLN   DC    Y(0)                Length of this section               06070000
JPXCTY   DC    AL1(JPXIDPFX)       Type     = Command Prefix            06080000
JPXCMD   DC    AL1(JPXIMGEN)       Type Mod = General                   06090000
JPXPFXC  DC    H'0'                Command prefix count                 06100000
JPXPFXL  DC    AL2(JPXCPFSZ)       Command prefix entry length          06110000
JPXPFXO  DC    AL2(0)              Offset to first entry                06120000
         SPACE 1                                                        06130000
         DS    XL2                 Reserved                             06140000
         SPACE 1                                                        06150000
JPXCSIZ  EQU   *-JPXCPREF          Size of this fixed portion          C06160000
                                     of this section                   C06170000
                                     (Internal use only)                06180000
JPXCARAY DS    0X                  Start of variable length            C06190000
                                   portion of section                   06200000
**************************************************************          06210000
*                                                            *          06220000
*        Command prefix array entry                          *          06230000
*                                                            *          06240000
*        The prefixes are stored in consecutive array        *          06250000
*        entries.                                            *          06260000
*        entries contains a scope indicator and the command  *          06270000
*        prefix (left justified and padded on the right      *          06280000
*        with blanks.  A prefix is either system or SYSplex  *          06290000
*        scoped.                                             *          06300000
*                                                            *          06310000
*        NOTE: To get here, add the prefix offset (JPXOPRF), *          06320000
*              the prefix size (JPXPRSZ), the general        *          06330000
*              information section size (JPXGENSZ).          *          06340000
*                                                            *          06350000
**************************************************************          06360000
JPXCPRFE DSECT ,                   Element of prefix array              06370000
JPXCPFXS DC    XL1'0'              Scope flags                          06380000
JPXCSYSP EQU   X'80'                 SYSplex scope                      06390000
JPXCSYST EQU   X'40'                 System scope                       06400000
JPXCPFXP DC    CL8' '              Command prefix                       06410000
JPXCPFSZ EQU   *-JPXCPRFE          Length of an array element           06420000
         SPACE 4                                                        06430000
         MEND  ,                                                        06440000
.*                                                                      06450000
**/                                                                     06460000
* % END_OF_ASM_JPLX: ;                                                  06470000
*                                                                       06480000
* %IF JPLEX_ATRB = ''            /* IF NO ATTRIBUTE SPECIFIED        */ 06490000
*   %THEN                                                               06500000
*     %JPLEX_ATRB = 'BASED';     /* ESTABLISH DEFAULT ATTRIBUTE      */ 06510000
*                                                                       06520000
* DCL JPLXINVA FIXED(31) CONSTANT(132); /* Invalid search arguments  */ 06530000
* DCL JPLXINV1 FIXED(31) CONSTANT(136); /* Status filter invalid     */ 06540000
* DCL JPLXINV2 FIXED(31) CONSTANT(140); /* System Name filter           06550000
*                                          Invalid                   */ 06560000
* DCL JPLXINV3 FIXED(31) CONSTANT(144); /* Member Name filter           06570000
*                                          Invalid                   */ 06580000
* DCL JPLXINV4 FIXED(31) CONSTANT(148); /* JES Specific filter          06590000
*                                          invalid                   */ 06600000
*                                                                       06610000
*DECLARE                                                                06620000
*   1 JPLEX   JPLEX_ATRB,                                               06630000
*     3 JPLXID   CHAR(8),           /* I.Eyecatcher                  */ 06640000
*     3 JPLXLEN  FIXED(16),         /* I.Length of JPLEX             */ 06650000
*     3 JPLXVER  FIXED(15),         /* I.Parm list version number    */ 06660000
*       5 JPLXVERL FIXED(8),        /*   I.Parm list version level   */ 06670000
*       5 JPLXVERM FIXED(8),        /*   I.Parm list version mod     */ 06680000
*     3 JPLXVERO FIXED(15),         /* O.Subsystem version number    */ 06690000
*     3 *        FIXED(16),         /* Reserved                      */ 06700000
*     3 JPLXUSER ,                  /* USER AREA                     */ 06710000
*/********************************************************************/ 06720000
*/*      JPLXSTRP is an anchor for use by the subsystem              */ 06730000
*/*      that responds to this request.  It is expected that         */ 06740000
*/*      the caller will set this to zero the FIRST time an          */ 06750000
*/*      SSOB extension is used and from that point on it            */ 06760000
*/*      will be managed by the subsystem.                           */ 06770000
*/********************************************************************/ 06780000
*       5 JPLXSTRP PTR(31),         /* Storage management anchor     */ 06790000
*       5 JPLXFLTR BIT(8),          /* IS.Filters                    */ 06800000
*                                                                       06810000
*         7 JPLXFSNM BIT(1),        /* Use JPLXSNAM (MVS System         06820000
*                                      name) as a filter        */      06830000
*         7 JPLXFMNM  BIT(1),       /* Use JPLXMNAM (Member name)       06840000
*                                      as a filter        */            06850000
*         7 *         BIT(6),       /* Reserved                   */    06860000
*                                                                       06870000
*                                                                       06880000
*       5 *         CHAR(3),        /* Reserved                      */ 06890000
*       5 JPLXSTS1 BIT(8),            /* IS.This allows for high level  06940000
*                                        filtering on a composite       06950000
*                                        status. See the JES            06960000
*                                        specific sections for          06970000
*                                        More detailed JES              06980000
*                                        specific status information */ 06990000
*         7 JPLDRAIN BIT(1) ,        /* Drained. (For Jes3 -            07000000
*                                     it is a Down main)             */ 07010000
*         7 JPLINITZ BIT(1),         /* Initializing              J2 */ 07020000
*         7 JPLXACTV BIT(1),         /* Active member                */ 07030000
*         7 JPLDRING BIT(1),         /* Draining Member           J2 */ 07040000
*         7 JPLOUDEF BIT(1),         /* Omit Undefined Members    J2 */ 07050000
*         7 JPLNATCH BIT(1),         /* Not attached Member       J3 */ 07055000
*         7 *        BIT(2),         /* Reserved                     */ 07060000
*                                                                       07070000
*       5 JPLXSPEC  BIT(8),          /* Misc. JES specific filters      07080000
*                                       See JPLXFSPC bit             */ 07090000
*         7 JPLXINDP  BIT(1),       /* Independent Member       (J2) */ 07100000
*         7 JPLXBOSS  BIT(1),       /* BOSS Member              (J2) */ 07110000
*         7 JPLXPRIM  BIT(1),       /* Primary subsystem        (J2) */ 07120000
*         7 JPLXGLOB  BIT(1),       /* Global Processor         (J3) */ 07130000
*         7 JPLXLOCL  BIT(1),       /* Local processor          (J3) */ 07140000
*         7 *         BIT(3),       /* Reserved                      */ 07150000
*        5 *          CHAR(3),      /* Reserved                      */ 07160000
*                                                                       07170000
*/********************************************************************/ 07180000
*/*     NOTE: Each filter below is enabled via one                   */ 07190000
*/*           of the JPLXFLTR bit settings above.                    */ 07200000
*/********************************************************************/ 07210000
*                                                                       07220000
*       5 JPLXSNAM  CHAR(8),         /* IS*.System name (MVS)           07230000
*                                           See JPLXFSNM bit.        */ 07240000
*       5 JPLXMNAM  CHAR(8),         /* IS*.Member Name Filter.         07250000
*                                           This is the member name     07260000
*                                           in JES2 and MAIN            07270000
*                                           name in JES3                07280000
*                                           See JPLXFMNM bit.           07290000
*                                           bit.                     */ 07300000
*       5 *        CHAR(3),         /* Padding                       */ 07310000
*       5 *(10)    FIXED(32),       /* Reserved for future use       */ 07320000
*                                                                       07330000
*/********************************************************************/ 07340000
*/*      Begin output-only fields.                                   */ 07350000
*/********************************************************************/ 07360000
*       5 JPLXLPTR PTR(31),         /* O.Pointer to first Member        07370000
*                                         (JPXHDR) data buffer. See     07380000
*                                         output data discussion        07390000
*                                         below for layout.          */ 07400000
*       5 JPLXNMBR FIXED(32),       /* O.Number of Members              07410000
*                                         (JPXHDR) data buffers         07420000
*                                         returned.                  */ 07430000
*       5 JPLXTRKT FIXED(64),       /* O.Total Spool tracks             07440000
*                                      Defined                       */ 07450000
*       5 JPLXTRKU FIXED(64),       /* O.Spool tracks used           */ 07460000
*       5 JPLXTRAT FIXED(64),       /* O.Total Active Spool tracks      07462000
*                                         Defined              @Z23BG*/ 07464000
*       5 JPLXTRAU FIXED(64),       /* O.Active Spool tracks            07466000
*                                         used                 @Z23BG*/ 07466200
*       5 JPLXXGNM Char(8),         /* O.XCF Group name      @Z22LSSF*/ 07466400
*       5 JPLXOPT1 BIT(8),          /* O.JESPLEX options:    @Z22LACT*/ 07466600
*         7 JPLX1ADJ BIT(1),        /*   CYCLEMGT=AUTO (JES2 only)   */ 07466800
*         7 JPLX1ADV BIT(1),        /*   Advanced format has been    */ 07467000
*                                   /*    activated at least once    */ 07467200
*                                   /*    in the MAS - advanced      */ 07467400
*                                   /*    format structures may      */ 07467600
*                                   /*    exist on SPOOL     @Z25LENZ*/ 07467800
*         7 JPLX1ADE BIT(1),        /*   Advanced format is          */ 07468000
*                                   /*    currently enabled in the   */ 07468200
*                                   /*    MAS                @Z25LENZ*/ 07468400
*         7 *        BIT(5),        /*   Reserved for future use     */ 07469600
*       5 *        CHAR(3),         /* Reserved for future use          07470500
*                                      use                   @Z24LCKS*/ 07471400
*       5 JPLXCKLV CHAR(8),         /* O.JES2 checkpoint level          07472300
*                                        ($ACTIVATE level)   @Z24LCKS*/ 07473200
*       5 *        CHAR(4);         /* Reserved for future              07474100
*                                      use                   @Z24LCKS*/ 07475000
*                                                                       07480000
*   DCL JPLXSZE  FIXED(16) CONSTANT(LENGTH(JPLEX)); /* Size of JPLEX */ 07490000
*   DCL JPLXSZE1 FIXED(16) CONSTANT(152); /* Parameter end-             07500000
*                                      version 1 size.         @Z23BH*/ 07510000
*   DCL JPLXSZE2 FIXED(16) CONSTANT(LENGTH(JPLEX)); /* Parameter end-   07512000
*                                      version 2 size.         @Z23BG*/ 07515000
*   DCL JPLXV010 FIXED(16) CONSTANT('0100'X); /* Version 1 level     */ 07520000
*   DCL JPLXV011 FIXED(16) CONSTANT('0101'X); /*   Active volume        07520100
*                                      information             @Z23BH*/ 07520400
*   DCL JPLXV020 FIXED(16) CONSTANT('0200'X); /* Version 2 level -      07521000
*                                      z/OS 1.13               @Z23BH*/ 07524000
*   DCL JPLXSVR# FIXED(16) CONSTANT('0200'X); /* Latest Version         07530000
*                                          level               @Z23BG*/ 07535000
*   DCL JPLXCVRL FIXED(8)  CONSTANT(2); /* Current version              07540000
*                                          level               @Z23BG*/ 07545000
*   DCL JPLXCVRM FIXED(8)  CONSTANT(0); /* Current version modifier  */ 07550000
*/*     ID VALUE FOR JPLXID                                          */ 07560000
* DCL JPLXEYEC CHAR(8)  CONSTANT('JESPLEXI');/* JESPLEX Data ID    */   07570000
*                                                                       07580000
*                                                                       07590000
*                                                                       07600000
*/********************************************************************/ 07610000
*/*                                                                  */ 07620000
*/*        Storage management fields for use by the subsystem        */ 07630000
*/*        only.  JPLXSTRP is a token used to locate a chain   @Z24BK*/ 07640000
*/*        of these control blocks.  All storage will be       @Z24BK*/ 07650000
*/*        obtained in KEY 1.                                  @Z24BK*/ 07655000
*/*                                                                  */ 07660000
*/********************************************************************/ 07670000
*DECLARE                                                                07680000
*   1 JPLXSTOR  BASED,         /* Storage management block           */ 07690000
*     3 JPLXSTID  CHAR(8),     /* Eyecatcher                         */ 07700000
*     3 JPLXSTHL  FIXED(16),   /* Length of header area              */ 07710000
*     3 *         CHAR(2),     /* Reserved for future use            */ 07720000
*     3 JPLXSTSP  FIXED(8),    /* Subpool of this block              */ 07730000
*     3 JPLXSTTL  FIXED(24),   /* Total length of area (this            07740000
*                                   includes the header              */ 07750000
*     3 JPLXSTNX  PTR(31),     /* Pointer to next area               */ 07760000
*     3 JPLXSTCP  PTR(31),     /* Pointer to first available byte       07770000
*                                   in this area                     */ 07780000
*     3 JPLXSTBG  CHAR(0);      /* Start of data area                */ 07790000
*                                                                       07800000
*   DCL JPLXSTEC CHAR(8)  CONSTANT('JPLXSTOR'); /* Storage management   07810000
*                                                    eyecatcher value*/ 07820000
*   DCL JPLXSTPL FIXED(8) CONSTANT(230); /* Recommended subpool to      07830000
*                                             use                    */ 07840000
*   DCL JPLXSTSZ FIXED(16) CONSTANT(LENGTH(JPLXSTOR)); /* JPLXSTOR      07850000
*                                                           length   */ 07860000
*                                                                       07870000
*                                                                       07880000
*/**************************************************************/       07890000
*/*                                                            */       07900000
*/*        JESPLEX Header Section                              */       07910000
*/*                                                            */       07920000
*/*        Information about the JESPLEX is returned to        */       07930000
*/*        the issuer of the SSI.                              */       07940000
*/*                                                            */       07950000
*/*        - There can be multiple JESPLEX Areas returned.     */       07960000
*/*          The JPXNXTP pointer is used to navigate to the    */       07970000
*/*          next JESPLEX Header section in the chain.         */       07980000
*/*                                                            */       07990000
*/*                                                            */       08000000
*/**************************************************************/       08010000
*DECLARE                                                                08020000
*   1 JPXHDR BASED,                 /* JESPLEX Header Section        */ 08030000
*     3 JPXEYE   CHAR(8),           /* Eye catcher                   */ 08040000
*     3 JPXOPRF  FIXED(16),         /* Offset to prefix section      */ 08050000
*     3 *        FIXED(16),         /* Reserved for future use       */ 08060000
*     3 JPXNXTP  PTR(31),           /* Address of next JPXHDR        */ 08070000
*     3 *        FIXED(32);         /* Reserved for future use       */ 08080000
*                                                                       08090000
*   DCL JPXEYEC  CHAR(8)  CONSTANT('JPXHDR  '); /* Eye catcher value */ 08100000
*                                                                       08120000
*/********************************************************************/ 08130000
*/*                                                                  */ 08140000
*/*        JESPLEX Section Identifiers                               */ 08150000
*/*                                                                  */ 08160000
*/********************************************************************/ 08170000
*  DCL JPXIDPRF FIXED(8) CONSTANT('00'X); /* JESPLEX Info - Prefix  */  08180000
*  DCL JPXIDGEN FIXED(8) CONSTANT('01'X); /* JESPLEX Info - General */  08190000
*  DCL JPXIDJS2 FIXED(8) CONSTANT('02'X); /* JESPLEX Info - JES2    */  08200000
*  DCL JPXIDJS3 FIXED(8) CONSTANT('03'X); /* JESPLEX Info - JES3    */  08210000
*  DCL JPXIDPFX FIXED(8) CONSTANT('04'X); /* JESPLEX Info -             08220000
*                                                         Cmd Prefix */ 08230000
*/********************************************************************/ 08240000
*/*                                                                  */ 08250000
*/*        JESPLEX Section Modifiers                                 */ 08260000
*/*                                                                  */ 08270000
*/********************************************************************/ 08280000
*   DCL JPXIMGEN FIXED(8) CONSTANT('00'X); /* Modifier - General     */ 08290000
*/********************************************************************/ 08300000
*/*                                                                  */ 08310000
*/*        JESPLEX Prefix Section                                    */ 08320000
*/*                                                                  */ 08330000
*/*        NOTE: To get here, add the JPXOPRF header field           */ 08340000
*/*              to the header (JPXHDR) address.                     */ 08350000
*/*                                                                  */ 08360000
*/********************************************************************/ 08370000
*DECLARE                                                                08380000
*   1 JPXPREF BASED,                /* JESPLEX Prefix                */ 08390000
*     3 JPXPRLN  FIXED(16),         /* Length of entire JESPLEX         08400000
*                                      entry (Max value is 65535)       08410000
*                                      returned - other than hdr.    */ 08420000
*     3 JPXPRTP  FIXED(8),          /* Type     = Prefix   (JPXIDPRF)*/ 08430000
*     3 JPXPRMD  FIXED(8);          /* Type Mod = General  (JPXIDGEN)*/ 08440000
*                                                                       08450000
*   DCL JPXPRSZ  FIXED(8) CONSTANT(LENGTH(JPXPREF)); /* Length       */ 08460000
*/********************************************************************/ 08470000
*/*                                                                  */ 08480000
*/*        JESPLEX General Information Section                       */ 08490000
*/*                                                                  */ 08500000
*/*        NOTE: To get here, add the JPXOPRF header field           */ 08510000
*/*              and the prefix size (JPXPRSZ) to the header         */ 08520000
*/*              (JPXHDR) address.                                   */ 08530000
*/*                                                                  */ 08540000
*/********************************************************************/ 08550000
*DECLARE                                                                08560000
*   1 JPXGENI BASED,                /* JESPLEX General                  08570000
*                                      Information.                  */ 08580000
*     3 JPXGLN   FIXED(16),         /* Length of this section        */ 08590000
*     3 JPXGTY   FIXED(8),          /* Type     = General  (JPXIDGEN)*/ 08600000
*     3 JPXGMD   FIXED(8),          /* Type Mod = General  (JPXIMGEN)*/ 08610000
*     3 JPXSBSNM CHAR(4),           /* Subsystem name                */ 08620000
*     3 JPXSTIME CHAR(8),           /* Date/Time of last start          08630000
*                                      STCK format                   */ 08640000
*     3 JPXSTAT1 FIXED(8),          /* Member status                 */ 08650000
*     3 JPXSTATC CHAR(32),          /* Current Status (character        08660000
*                                      string)                       */ 08670000
*     3 JPXMVSNM CHAR(8),           /* MVS system name               */ 08680000
*     3 JPXMEMNM CHAR(8),           /* JES Member Name               */ 08690000
*     3 JPXVERSN CHAR(8),           /* Version of Product (character)*/ 08700000
*     3 JPXSMFID CHAR(8),           /* SMF ID                        */ 08710000
*     3 JPXSYSLG BIT(8),            /* Syslog indicator              */ 08720000
*      5 JPXSLOGY BIT(1),           /* R11 Syslog support active     */ 08721000
*      5 *        BIT(7),           /* Reserved                      */ 08724000
*     3 JPXMEMNO FIXED(16),         /* JES Member Number             */ 08730000
*     3 JPXSTYPE FIXED(8),          /* Type of last start            */ 08740000
*     3 JPXPRODL   BIT(8),          /* Product Level (binary)        */ 08750000
*     3 JPXSERVL   BIT(8),          /* Service Level                 */ 08760000
*     3 *        CHAR(1),           /* Reserved for future use       */ 08770000
*     3 JPXTMOF  FIXED(31),         /* UTC offset of the member      */ 08772000
*                                   /*  in seconds           @Z22LDEP*/ 08774000
*                                   /*  (with leap seconds)  @Z22LDEP*/ 08776000
*     3 JPXEMGNM CHAR(4);           /* Emergency subsystem name         08777000
*                                                            @Z24D144*/ 08778000
*                                                                       08780000
* Dcl JPXUNDEF Fixed(8) Constant(0);  /* Undefined Member            */ 08790000
* Dcl JPXDRAIN Fixed(8) Constant(1);  /* Drained Member              */ 08795000
* Dcl JPXINITZ Fixed(8) Constant(2);  /* Initializing                */ 08800000
* Dcl JPXACTIV Fixed(8) Constant(3);  /* Active Member               */ 08810000
* Dcl JPXDRING Fixed(8) Constant(4);  /* Draining Member             */ 08820000
* Dcl JPXNATCH Fixed(8) Constant(5);  /* Not Attached Member         */ 08825000
* Dcl JPXCOLD  Fixed(8) Constant(10); /* Cold START                  */ 08830000
* Dcl JPX2COLF Fixed(8) Constant(11); /* Cold START with format      */ 08840000
* Dcl JPXWARM  Fixed(8) Constant(20); /* WARM START                  */ 08850000
* Dcl JPX2SRMS Fixed(8) Constant(21); /* SINGLE MEMBER WARM START    */ 08860000
* Dcl JPX3WRMD Fixed(8) Constant(25); /* JES3 WARM START TO             08870000
*                                        REPLACE A SPOOL DATASET     */ 08880000
* Dcl JPX3WRMA Fixed(8) Constant(26); /* JES3 WARM START WITH           08890000
*                                        Analysis                    */ 08900000
* Dcl JPX3WDA   Fixed(8) Constant(27); /* JES3 WARM START TO            08910000
*                                         REPLACE A SPOOL DATASET WITH  08920000
*                                         Analysis.                  */ 08930000
* Dcl JPXHOT   Fixed(8) Constant(30);  /* Hot Start                  */ 08940000
* Dcl JPX3HOTR Fixed(8) Constant(35);  /* JES3 Hot start with           08950000
*                                         refresh.                   */ 08960000
* Dcl JPX3HOTA Fixed(8)  Constant(36); /* JES3 HOT start with           08970000
*                                         analysis.                  */ 08980000
* Dcl JPX3HTRA Fixed(8)  Constant(37); /* JES3 Hot start with           08990000
*                                         refresh and analysis.      */ 09000000
* Dcl JPX2QUIK Fixed(8)  Constant(40); /* JES2 Quick Start           */ 09010000
*                                                                       09020000
* Dcl JPX3LCL  Fixed(8)  Constant(50); /* JES3 LOCAL Start           */ 09030000
*                                                                       09040000
*                                                                       09060000
*/***********************************************************/          09080000
*/*                                                         */          09090000
*/*        JESPLEX JES3 Specific Information                */          09100000
*/*                                                         */          09110000
*/*        NOTE: This section follows the General section.  */          09120000
*/*                                                         */          09130000
*/***********************************************************/          09140000
*                                                                       09150000
*DECLARE                                                                09160000
*   1 JPXJES3I BASED,                /* JESPLEX JES3-specific           09170000
*                                       information         */          09180000
*     3 JPX3LN FIXED(16),            /* Section length      */          09190000
*     3 JPX3TY BIT(8),               /* Type    = JES3 Info */          09200000
*     3 JPX3MD BIT(8),               /* Type Mod = General  */          09210000
*     3 *      FIXED(31),            /* Reserved for future             09220000
*                                       use                 */          09230000
*     3 JPX3GCON CHAR(8) BDY(DWORD), /* Last global contact             09240000
*                                       time                */          09250000
*     3 JPX3TRK1 FIXED(16),          /* Primary track group             09260000
*                                     allocation            */          09270000
*     3 JPX3TRK2 FIXED(16),          /* Secondary track group           09280000
*                                     allocation            */          09290000
*     3 JPX3WTOL FIXED(15),          /* WTO message limit   */          09300000
*     3 JPX3WTOI FIXED(16),          /* WTO message interval            09310000
*                                       (seconds)           */          09320000
*     3 JPX3CSA  FIXED(15),          /* PBUF CSA limit      */          09330000
*     3 JPX3AUX  FIXED(15),          /* PBUF JES3AUX limit  */          09340000
*     3 JPX3FIX  FIXED(15),          /* Fixed PBUFS         */          09350000
*     3 JPX3USR  FIXED(15),          /* User pages per open             09360000
*                                       SYSOUT dataset      */          09370000
*     3 JPX3SELM CHAR(8),            /* Selection mode name */          09380000
*     3 JPX3SPl  CHAR(8),            /* Spool partition name*/          09390000
*     3 JPX3MPFX CHAR(11),           /* Message prefix      */          09400000
*     3 JPX3MDST CHAR(3),            /* Message destination             09410000
*                                       (M1-M32 or 1-28,                09420000
*                                        41-128)            */          09430000
*     3 JPX3FLG1 BIT(8),             /* Flag byte           */          09440000
*       5 JPX3GBL  BIT(1),           /* Global Node         */          09450000
*       5 JPX3ONL  BIT(1),           /* Online              */          09460000
*       5 JPX3NCNN BIT(2),           /* 0 = not connected   */          09470000
*         7 JPX3FLSH BIT(1),         /* Flushed             */          09480000
*         7 JPX3CNN  BIT(1),         /* Connected           */          09490000
*       5 JPX3NATT BIT(2),           /* 0 = not attached    */          09500000
*         7 JPX3DOWN BIT(1),         /* Down                */          09510000
*         7 JPX3ATT  BIT(1),         /* Attached            */          09520000
*     3 *          BIT(8);           /* Reserved for future             09530000
*                                       use                 */          09540000
*                                                                       09550000
*/***********************************************************/          09590000
*/*                                                         */          09600000
*/*        JESPLEX JES2 Specific Information                */          09610000
*/*                                                         */          09620000
*/*        NOTE:                                            */          09630000
*/*                                                         */          09640000
*/***********************************************************/          09650000
*                                                                       09660000
* DECLARE                                                               09670000
*    1 JPXJES2I BASED,            /* JES2 specific                      09680000
*                                    JESPLEX Information    */          09690000
*      3 JPX2LN   FIXED(16),      /* Length of this section */          09700000
*      3 JPX2TY   BIT(8),         /* Type     = JES2 Info   */          09710000
*      3 JPX2MD   BIT(8),         /* Type Mod = General     */          09720000
*      3 JPX2FLG1 BIT(8),         /* JES2 Indicators        */          09730000
*        5 JPX21IND BIT(1),       /* Independent Mode       */          09740000
*        5 JPX21BOS BIT(1),       /* BOSS Indicator         */          09750000
*        5 JPX21PRI BIT(1),       /* Primary subsystem                  09760000
*                                    Indicator              */          09770000
*      3 *        CHAR(3),        /* Padding for alignment  */          09780000
*      3 JPX2ITIM CHAR(8)                                               09790000
*                 BDY(DWORD),     /* Time last accessed                 09800000
*                                    checkpoint             */          09810000
*      3 JPX2FLG2 BIT(8),         /* Current command being              09820000
*                                    processed              */          09830000
*        5 *        BIT(2),       /* Reserved               */          09840000
*        5 JPX21P   BIT(1),       /* $P command             */          09850000
*        5 JPX21PXQ BIT(1),       /* $PXEQ Command          */          09860000
*        5 JPX22PCN BIT(1),       /* $PCNVT Command          @Z25LPCN*/ 09865000
*      3 *           CHAR(3),     /* Reserved               */          09870000
*      3 JPX2HOLD    FIXED(31),   /* Current setting MASDEF             09880000
*                                    HOLD                   */          09890000
*      3 JPX2MIND FIXED(31),      /* Current setting MASDEF             09900000
*                                    MIN DORMANCY           */          09910000
*      3 JPX2MAXD FIXED(31),      /* Current setting MASDEF             09920000
*                                    MAX DORMANCY           */          09930000
*      3 JPX2SYNC FIXED(31),      /* Current setting MASDEF             09940000
*                                    SYNCTOL                */          09950000
*      3 JPX2AHLD FIXED(31),      /* Actual HOLD last                   09960000
*                                    checkpoint             */          09970000
*      3 JPX2ADRM FIXED(31),      /* Actual DORMANCY last               09980000
*                                    checkpoint             */          09990000
*      3 JPX2RSID CHAR(8),        /* Name of member doing               10000000
*                                    reset (reset by member             10010000
*                                    - $EMEMBER)            */          10020000
*      3 JPX2STAT Fixed(8),       /* Specific status                    10030000
*                                    indicator              */          10040000
*      3 JPX2STA2 Bit(8),         /* Status byte 2           @Z24LSDS*/ 10050000
*      3 JPX2STA3 Bit(8),         /* Status byte 3           @Z24LSDS*/ 10051000
*        5 JPX2TRCK BIT(1),       /* TRACK exists for member @Z24LSDS*/ 10052000
*        5 JPX2ALRT BIT(1),       /* ALERT exists for member @Z24LSDS*/ 10053000
*        5 JPX2NTCE BIT(1),       /* NOTICE exists for memb  @Z24LSDS*/ 10054000
*        5 JPX2CRIT BIT(1),       /*   one is critical       @Z24LSDS*/ 10055000
*        5 *        BIT(4),       /* Reserved                @Z24LSDS*/ 10056000
*      3 * CHAR(1);               /* Reserved                @Z24LSDS*/ 10060000
*                                                                       10070000
* /* Bit definitions for JPX2STAT field                              */ 10080000
*                                                                       10090000
* Dcl JPX2DOWN Fixed(8)                                                 10110000
*                     Constant('10000000'B); /* Down                 */ 10120000
* Dcl JPX2DEF  Fixed(8)                                                 10130000
*                     Constant('01000000'B); /* DEFINED              */ 10140000
* Dcl JPX2INU  Fixed(8)                                                 10150000
*                     Constant('00100000'B); /* INUSE                */ 10160000
* Dcl JPX2FAIL Fixed(8)                                                 10170000
*                     Constant('00010000'B); /* FAILED               */ 10180000
*                                                                       10190000
* Dcl JPX2UNDF Bit(8) Constant('01'X); /* Member UNDEFINED           */ 10200000
* Dcl JPX2UPND Bit(8) Constant('02'X); /* Member UNDEFINED-PENDING   */ 10210000
* Dcl JPX2ACTV Fixed(8)                                                 10220000
*    Constant(JPX2DEF+JPX2INU+'03'X);  /* Member ACTIVE              */ 10230000
* Dcl JPX2INAC Fixed(8)                                                 10240000
*    Constant(JPX2DEF+JPX2DOWN+'04'X); /* Member TERMINATED          */ 10250000
* Dcl JPX2INIT Fixed(8)                                                 10260000
*    Constant(JPX2DEF+JPX2INU+'05'X);  /* Member INITIALIZING        */ 10270000
* Dcl JPX2TERM Fixed(8)                                                 10280000
*    Constant(JPX2DEF+JPX2INU+'06'X);  /* Member TERMINATING         */ 10290000
* Dcl JPX2JESF Fixed(8)                                                 10300000
*    Constant(JPX2DEF+JPX2DOWN+JPX2FAIL+'07'X); /*                      10310000
*                                         Memb JES2-FAILED           */ 10320000
* Dcl JPX2XCFF Fixed(8)                                                 10330000
*    Constant(JPX2DEF+JPX2DOWN+JPX2FAIL+'08'X); /*                      10340000
*                                         Memb JESXCF-FAILED         */ 10350000
* Dcl JPX2MVSG Fixed(8)                                                 10360000
*    Constant(JPX2DEF+JPX2DOWN+JPX2FAIL+'09'X); /*                      10370000
*                                         Memb MVS-GONE              */ 10380000
* Dcl JPX2DORM Fixed(8)                                                 10390000
*    Constant(JPX2DEF+JPX2INU+'0A'X);  /* Member DORMANT                10400000
*                                       (Never set)                  */ 10410000
* Dcl JPX2DRAN Fixed(8)                                                 10420000
*    Constant(JPX2DEF+JPX2DOWN+'0B'X);  /* Member DRAINED      @Z23BG*/ 10430000
* Dcl JPX2ALIC Fixed(8)                                                 10440000
*    Constant(JPX2DEF+JPX2DOWN+JPX2FAIL+'0C'X);                         10450000
*                                       /* Member awaiting ALICE        10460000
*                                          processing                */ 10470000
*                                                                       10470400
* /* Bit definitions for JPX2STA2 field                              */ 10470800
*                                                                       10471200
* Dcl JPX2EDEL Fixed(8)                                                 10471600
*                    Constant('10000000'B); /* Member deleted        */ 10472000
* Dcl JPX2$IND Fixed(8)                                                 10472400
*                    Constant('01000000'B); /* Member in                10472800
*                                                independent mode    */ 10473200
* Dcl JPX2SIOT Fixed(8)                                                 10473600
*                    Constant('00100000'B); /* SPIN IOT being purged */ 10474000
* Dcl JPX2NMAL Fixed(8)                                                 10474400
*                    Constant('00010000'B); /* Member has 2 checkpoint  10474800
*                                                datasets allocated  */ 10475200
* Dcl JPX2EGON Fixed(8)                                                 10475600
*                    Constant('00001000'B); /* XCF system gone       */ 10476000
* Dcl JPX2PRIM Fixed(8)                                                 10476400
*                    Constant('00000010'B); /* Member is a primary      10476800
*                                                a primary subsystem */ 10477200
* Dcl JPX2SPLX Fixed(8)                                                 10477600
*                    Constant('00000001'B); /* Command Prefix has       10478000
*                                                SYSplex scope       */ 10478400
*                                                                       10480000
*/**************************************************************/       10490000
*/*                                                            */       10500000
*/*        JESplex Command Prefix Information                  */       10510000
*/*                                                            */       10520000
*/*        Note:  This section follows immediately after       */       10530000
*/*               the JES2 or JES3 specific section            */       10540000
*/*               depending on whether it is a JES2            */       10550000
*/*               or JES3 implementation.                      */       10560000
*/*                                                            */       10570000
*/*               This is a variable length section.  The      */       10580000
*/*               length depends upon the number of command    */       10590000
*/*               prefix entries.   (JES2 will have only one   */       10600000
*/*               entry.  JES3 may have up to 14 entries.      */       10610000
*/*                                                            */       10620000
*/**************************************************************/       10630000
*                                                                       10640000
*/**************************************************************/       10650000
*/*                                                            */       10660000
*/*        JESPLEX Command Prefix Entry                        */       10670000
*/*                                                            */       10680000
*/*        This structure describes the layout of a command    */       10690000
*/*        prefix entry.                                       */       10700000
*/*                                                            */       10710000
*/*        prefixes are left justified and padded on the       */       10720000
*/*        right with blanks.                                  */       10730000
*/*        Each element contains the 8 byte command prefix     */       10740000
*/*        along with the scope indicator. Scopes may be       */       10750000
*/*        System or JESplex.                                  */       10760000
*/*                                                            */       10770000
*/**************************************************************/       10780000
*DECLARE                                                                10790000
*   1 JPXCPRFE    BASED,               /* Prefix array         */       10800000
*                                                                       10810000
*     3 JPXCPFXE,                    /* Command prefix array            10820000
*                                       element.               */       10830000
*       5 JPXCPFXS  BIT(8),          /* Prefix scope flags     */       10840000
*         7 JPXCSYSP  BIT(1),        /* JESPLEX scope          */       10850000
*         7 JPXCSYST  BIT(1),        /* System scope           */       10860000
*       5 JPXCPFXP  CHAR(8);         /* Prefix entry           */       10870000
*                                                                       10880000
* DCL JPXCPFSZ FIXED(16)                                                10890000
*              CONSTANT(LENGTH(JPXCPRFE)); /* Entry length     */       10900000
*                                                                       10910000
*/**************************************************************/       10920000
*/*                                                            */       10930000
*/*      JESPLEX Command Prefix Section Structure              */       10940000
*/*                                                            */       10950000
*/**************************************************************/       10960000
* DECLARE                                                               10970000
*    1 JPXCPREF BASED,            /* JESplex command prefix             10980000
*                                    information.              */       10990000
*      3 JPXCLN   FIXED(16),      /* Length of this section    */       11000000
*      3 JPXCTY   BIT(8),         /* Type = Command Prefix     */       11010000
*      3 JPXCMD   BIT(8),         /* Type Mod = General        */       11020000
*      3 JPXPFXC  FIXED(15),      /* Command prefix count      */       11030000
*      3 JPXPFXL  FIXED(16),      /* Command prefix entry               11040000
*                                    length                    */       11050000
*      3 JPXPFXO  FIXED(16),      /* Offset to first entry     */       11060000
*      3 *        CHAR(2),        /* Reserved                  */       11070000
*      3 JPXCARAY(*)  Char(LENGTH(JPXCPRFE));                           11080000
*                                                                       11090000
* % JPLXLEND: ;                                                         11120000
* @Logic;                                                               11130000
* #PRAGMA TOOL=PADI.                                                    11140000
* #PADIDELETE.JPLXEYEC                                                  11150000
* #PADIDELETE.JPLXSTEC                                                  11160000
* #PADIDELETE.JPXEYEC                                                   11170000
* #PADIDELETE.JPXCPFXE                                                  11180000
* #PADIDELETE.JPXHDSZ                                                   11190000
* #PADIDELETE.JPXGENSZ                                                  11200000
* #PADIDELETE.JPX3SZ                                                    11210000
* #PADIDELETE.JPX2SIZ                                                   11220000
* #PADIDELETE.JPXCSIZ                                                   11230000
*#EPRAGMA                                                               11240000
*@ENDLOGIC;                                                             11250000
*/*                          END OF MACRO                            */ 99999999
