*        %GOTO JCORCMT;            /* Bilingual mapping macro           00100000
         MACRO                                                          00200000
         IAZJCOR                                                        00300000
.*/      %JCORCMT: ;                                                    00400000
*                                                                       00500000
*/**** START OF SPECIFICATIONS ***************************************  00600000
.****PROPRIETARY-STATEMENT********************************************  00700000
.*01* PROPRIETARY STATEMENT:                                         *  00800000
.*                                                                   *  00900000
.*   LICENSED MATERIALS-PROPERTY OF IBM                              *  01000000
.*   5650-ZOS Copyright IBM Corp. 2013, 2019                         *  01100000
.*                                                                   *  01200000
.*   STATUS:  HBB77C0                                                *  01300000
.*                                                                   *  01400000
.****END-OF-PROPRIETARY-STATEMENT*************************************  01500000
*                                                                    *  01600000
*01* DESCRIPTIVE NAME: JES Job Correlator mapping                    *  01700000
*                                                                    *  01800000
*02* ACRONYM:     IAZJCOR                                            *  01900000
*                                                                    *  02000000
*01* MACRO NAME:  IAZJCOR                                            *  02100000
*                                                                    *  02200000
*01* DSECT NAME:  DSECT name is JOBCORR                              *  02300000
*                                                                    *  02400000
*01* LABEL PREFIX: Field prefix is JCOR.                             *  02500000
*                                                                    *  02600000
*01* COMPONENT ID:  JES Common (SC141)                               *  02700000
*                                                                    *  02800000
*01* EXTERNAL CLASSIFICATION:                                        *  02900000
*     None                                                           *  03000000
*                                                                    *  03100000
*01* END OF EXTERNAL CLASSIFICATION:                                 *  03200000
*                                                                    *  03300000
*01* EYE-CATCHER:  None                                              *  03400000
*                                                                    *  03500000
*01* STORAGE ATTRIBUTES:                                             *  03600000
*02*  SUBPOOL:  Determined by the location of the job correlator     *  03700000
*                                                                    *  03800000
*02*  KEY:  Determined by the location of the job correlator         *  03900000
*                                                                    *  04000000
*02*  RESIDENCY:                                                     *  04100000
*      Virtual - anywhere in 31-bit storage                          *  04200000
*      Real    - anywhere in 64 bit storage                          *  04300000
*                                                                    *  04400000
*01* SIZE:                                                           *  04500000
*     JCORSIZE                                                       *  04600000
*                                                                    *  04700000
*01* CREATED BY:                                                     *  04800000
*     Internal JES processing.                                       *  04900000
*                                                                    *  05000000
*01* POINTED TO BY:                                                  *  05100000
*     Various                                                        *  05200000
*                                                                    *  05300000
*01* SERIALIZATION:                                                  *  05400000
*                                                                    *  05500000
*     None required                                                  *  05600000
*                                                                    *  05700000
*01* FUNCTION:                                                       *  05800000
*                                                                    *  05900000
*     This macro provides the mapping of the JES Job Correlator      *  06000000
*     data structure.                                                *  06100000
*                                                                    *  06200000
*                                                                    *  06300000
*01* METHOD OF ACCESS:                                               *  06400000
*                                                                    *  06500000
*02*  ASM:                                                           *  06600000
*      IAZJCOR                                                       *  06700000
*                                                                    *  06800000
*                                                                    *  06900000
*02*  PL/X:                                                          *  07000000
*      %DCL JCOR_ATRB CHAR                                           *  07100000
*      %JCOR_ATRB = 'value'                                          *  07200000
*      %INCLUDE SYSLIB(IAZJCOR)                                      *  07300000
*                                                                    *  07400000
*      where 'value' is a valid variable storage attribute,          *  07500000
*      e.g. 'BASED(JCORPTR@)'. If %JCOR_ATRB was not set,            *  07600000
*      it defaults to '' (null).                                     *  07700000
*                                                                    *  07800000
*01* USED BY:                                                        *  07900000
*     Internal JES processing.                                       *  08000000
*                                                                    *  08100000
*01* DELETED BY:                                                     *  08200000
*     Various                                                        *  08300000
*                                                                    *  08400000
*01* FREQUENCY:                                                      *  08500000
*     A job correlator is generated by various internal JES          *  08600000
*     processes.                                                     *  08700000
*                                                                    *  08800000
*01* RESTRICTIONS:                                                   *  08900000
*     None.                                                          *  09000000
*                                                                    *  09100000
*01* NOTES:                                                          *  09200000
*                                                                    *  09300000
*     Dependencies:                                                  *  09400000
*       PL/X Version - macro variable JCOR_ATRB must be              *  09500000
*       declared and set to valid storage attributes before          *  09600000
*       the macro is invoked.                                        *  09700000
*                                                                    *  09800000
*                                                                    *  09900000
****** END OF SPECIFICATIONS ****************************************/  10000000
*/********************************************************************  10100000
*01* CHANGE ACTIVITY:                                                *  10200000
* $Z21LCOR=JOBCOR   HBB7790 110923 BWT:  Job Correlator - Symbol sup  * 10210000
*                                                                    *  10220000
* $S202710=CHEADERS HBB77C0 190212 TJW:  Updates for C headers       *  10230000
*                                        S202710                     *  10240000
*                                                                    *  10300000
*01* A000000-999999    Created for z/OS rel 2.1               @Z21LCOR  10400000
*********************************************************************/  10500000
*/*                                                                 */  10600000
* % GOTO END_OF_ASM_JCOR; /*                                            10700000
*                                                                       10800000
         SPACE 1                                                        10900000
**************************************************************          11000000
*        JOBCORR - JES Job Correlator DSECT                  *          11100000
*                                                            *          11200000
**************************************************************          11300000
         SPACE 1                                                        11400000
JOBCORR  DSECT ,                   Job correlator mapping               11500000
         SPACE 1                                                        11600000
JCORJCOR DS    0CL64               Complete Job Correlator              11700000
JCORSCOR DS    0CL31                 System portion of the Job         C11800000
                                       Correlator                       11900000
JCORJBID DS    CL8                     Job ID                           12000000
JCORXCFG DS    CL8                     XCF Group Name                   12100000
JCORJKEY DS    CL8                     Unique job value/key             12200000
JCORRSVD DS    CL7                     7 periods "." reserved           12300000
JCORSEPR DS    CL1                   Colon separator                    12400000
JCORUCOR DS    CL32                  User portion Job corr              12500000
JCORSIZE EQU   *-JOBCORR          Size of a job correlator              12600000
         SPACE 2                                                        12700000
.JCOREND MEND                                                           12800000
.*                                                                      12900000
**/                                                                     13000000
* %END_OF_ASM_JCOR: ;                                                   13100000
*  %IF IBM_CBGENC = 'YES' %THEN                                         13110000
*    %JCOR_ATRB = 'Based Bdy(Dword)';                                   13120000
*  %IF JCOR_ATRB = '' %THEN                                             13200000
*    %JCOR_ATRB = 'BDY(DWORD)';                                         13300000
*                                                                       13400000
*                                                                       13500000
*/********************************************************************/ 13600000
*/*                                                                  */ 13700000
*/*      The following data structure is mapping of the              */ 13800000
*/*      JES Job Correlator.                                         */ 13900000
*/*                                                                  */ 14000000
*/********************************************************************/ 14100000
*                                                                       14200000
* DCL                                                                   14300000
*   1   JOBCORR  JCOR_ATRB,                                             14400000
*     3   JCORJCOR CHAR(64),       /* Job Correlator                 */ 14500000
*       5   JCORSCOR CHAR(31),     /* System portion of the Job         14600000
*                                       Correlator                   */ 14700000
*         7   JCORJBID CHAR(8),    /* Job ID                         */ 14800000
*         7   JCORXCFG CHAR(8),    /* XCF Group Name                 */ 14900000
*         7   JCORJKEY CHAR(8),    /* Unique job value-key           */ 15000000
*         7   JCORRSVD CHAR(7),    /* Reserved. 7 periods "."        */ 15100000
*       5   JCORSEPR CHAR(1),      /* Colon separator                */ 15200000
*       5   JCORUCOR CHAR(32);     /* User portion of the job           15300000
*                                       correlator                   */ 15400000
*                                                                       15500000
* DCL JCORSIZE FIXED(15) CONSTANT(LENGTH(JOBCORR));  /* Size of a job   15600000
*                                       correlator                   */ 15700000
*/*                                  End of macro                    */ 99999999
