*        %GOTO JPROCCMT;          /* Bilingual Mapping Macro            00010000
         MACRO                                                          00020000
         IAZJPROC                                                       00030000
.*/      %JPROCCMT: ;                                             /* */ 00040000
*                                                                       00050000
*/**** START OF SPECIFICATIONS *******************************          00060000
.****PROPRIETARY-STATEMENT************************************          00070000
.*01* PROPRIETARY STATEMENT:                                 *          00080000
.*                                                           *          00090000
.*   LICENSED MATERIALS-PROPERTY OF IBM                      *          00100000
.*   5650-ZOS Copyright IBM Corp. 2015, 2021                 *          00110000
.*                                                           *          00120000
.*   STATUS:  HBB77D0                                        *          00130000
.*                                                           *          00140000
.****END-OF-PROPRIETARY-STATEMENT*****************************          00150000
*                                                            *          00160000
*01* DESCRIPTIVE NAME: PROCLIB, SUBMITLIB, and POLICYIB      *   @Z25DW 00170000
*                      concatenation info parameter list for *   @Z25DW 00175000
*                      SSI 82.                               *   @Z25DW 00180000
*02*  ACRONYM:  IAZJPROC                                     *          00190000
*                                                            *          00200000
*                                                            *          00210000
*01* MACRO NAME:  IAZJPROC                                   *          00220000
*                                                            *          00230000
*01* DSECT NAME:  JPROC                                      *          00240000
*01* LABEL PREFIX:  JPRC                                     *          00250000
*                                                            *          00260000
*01* COMPONENT ID:  JES Common (SC141)                       *          00270000
*                                                            *          00280000
*01* EXTERNAL CLASSIFICATION:                                *          00290000
*02*  GUPI:  BASE                                            *          00300000
*02*  DMTI:  FIELDS                                          *          00310000
*            JPRCSTRP  JPRCSTOR  JPRCSTHL  JPRCSTID          *          00320000
*            JPRCSTSP  JPRCSTPL  JPRCSTTL  JPRCSTNX          *          00330000
*            JPRCSTCP  JPRCSTBG  JPRCSTSZ  JPRHDSZ           *          00340000
*            JPRGENSZ  JPRDSTRT  JPRDSIZE  JPRDSLEN          *          00350000
*                                                            *          00360000
*01* END OF EXTERNAL CLASSIFICATION:                         *          00370000
*                                                            *          00380000
*01* EYE-CATCHER:  JESPROCI                                  *          00390000
*02*  OFFSET:      JPRCID                                    *          00400000
*02*  LENGTH:      L'JPRCID                                  *          00410000
*                                                            *          00420000
*01* STORAGE ATTRIBUTES:                                     *          00430000
*02*  SUBPOOL: Parameter List = Subpool of Caller            *          00440000
*              Output Data    = Subpool 230                  *          00450000
*02*  KEY:     Parameter List = Key of Caller                *          00460000
*              Output Data    = Key 1                        *          00470000
*02*  RESIDENCY:                                             *          00480000
*      Virtual = 31 bit private storage                      *          00490000
*      real    = 64 bit storage                              *          00500000
*02*  FREQUENCY = 1 per call to function code 82 with        *          00510000
*                 function request byte of SSJPPROD.         *          00520000
*                                                            *          00530000
*01* SIZE:                                                   *          00540000
*                                                            *          00550000
*     See JPRCSZE                                            *          00560000
*                                                            *          00570000
*01* CREATED BY:                                             *          00580000
*                                                            *          00590000
*     Caller of SSI function 'SSOBSSJP' = 82                 *          00600000
*                                                            *          00610000
*01* POINTED TO BY:                                          *          00620000
*                                                            *          00630000
*     SSJPUSER in the SSOB extension                         *          00640000
*                                                            *          00650000
*01* SERIALIZATION:                                          *          00660000
*                                                            *          00670000
*     None                                                   *          00680000
*                                                            *          00690000
*01* FUNCTION:                                               *          00700000
*                                                            *          00710000
*     This macro provides the mapping of the parameter       *          00720000
*     list used by programs to request PROCLIB, SUBMITLIB,   *   @Z25DW 00730000
*     and POLICYLIB data from the JES subsystem.             *   @Z25DW 00740000
*                                                            *          00750000
*01* METHOD OF ACCESS:                                       *          00760000
*                                                            *          00770000
*02*  ASM:                                                   *          00780000
*      IAZJPROC                                              *          00790000
*                                                            *          00800000
*02*  PL/X:                                                  *          00810000
*      %DCL JPROC_ATRB CHAR                                  *          00820000
*      %JPROC_ATRB = 'value'                                 *          00830000
*      %INCLUDE SYSLIB(IAZJPROC)                             *          00840000
*                                                            *          00850000
*      where value is valid control block attributes,        *          00860000
*      such as 'BASED(SSJPUSER)'.  If JPROC_ATRB='',         *          00870000
*      then 'BASED' will be used.                            *          00880000
*                                                            *          00890000
*01* USED BY:                                                *          00900000
*                                                            *          00910000
*     This is used by programs to request PROCLIB Data       *          00920000
*     from the JES subsystem.                                *          00930000
*                                                            *          00940000
*01* DELETED BY:                                             *          00950000
*                                                            *          00960000
*     Caller                                                 *          00970000
*                                                            *          00980000
*01* RESTRICTIONS:                                           *          00990000
*                                                            *          01000000
*     None                                                   *          01010000
*                                                            *          01020000
*01* NOTES:                                                  *          01030000
*                                                            *          01040000
*     In the following description of fields, the notation   *          01050000
*     before the field description can be one of the         *          01060000
*     following:                                             *          01070000
*                                                            *          01080000
*        I.    Input (application supplied information)      *          01090000
*        IS    Input (used for selection/filtering )         *          01100000
*        IS*   Same as IS, but field supports wild cards:    *          01110000
*                * = any zero or more characters             *          01120000
*                ? = any single character                    *          01130000
*        O.    Output (system supplied information)          *          01140000
*                                                            *          01150000
****** END OF SPECIFICATIONS ********************************/          01160000
*/********************************************************************/ 01170000
*/*01* CHANGE ACTIVITY:                                              */ 01180000
*/* $Z22LCKP=64BCKPT  HBB77A0 140214 TJW:  $ACTIVATE for z22         */ 01190000
*/*                                                                  */ 01191000
*/* $Z23LSDS=SDSFAST  HBB77B0 160729 TJW:  Tweaks for SDSF           */ 01194000
*/*                                                                  */ 01195000
*/* $S202710=CHEADERS HBB77C0 190212 TJW:  Updates for C headers     */ 01196000
*/*                                        S202710                   */ 01197000
*/*                                                                  */ 01200000
*/*01* A000000-999999    Created for Z/OS release 2.2        @Z22LPRO*/ 01210000
*/********************************************************************/ 01220000
*/************************************************************          01230000
*01* NOTES:                                                  *          01240000
*                                                            *          01250000
*          Bilingual Mapping Macro PL/X                      *          01260000
*                                                            *          01270000
*        Dependencies =                                      *          01280000
*                                                            *          01290000
*          PL/X Version = This macro uses the macro          *          01300000
*            variable JPROC_ATRB. JPROC_ATRB must be         *          01310000
*            declared and set to valid control block         *          01320000
*            attributes before the macro is invoked.         *          01330000
*                                                            *          01340000
*                                                            *          01350000
*************************************************************/          01360000
*/*                                                                  */ 01370000
* % GOTO END_OF_ASM_JPRC; /*                                            01380000
*                                                                       01390000
         SPACE 1                                                        01400000
**************************************************************          01410000
*                                                            *          01420000
*        Additional return codes, specific to this function, *          01430000
*        that can be placed into SSJPRETN in IAZSSJP.  See   *          01440000
*        IAZSSJP for common SSJPRETN return codes.           *          01450000
*                                                            *          01460000
**************************************************************          01470000
         SPACE 1                                                        01480000
JPRCINVA EQU   132                 Invalid search arguments.            01490000
JPRCEPRC EQU   136                 PROCLIB name not valid               01500000
JPRCECLS EQU   140                 JOBCLASS not found                   01510000
JPRCINTE EQU   144                 Internal error building       @Z25DWC01512000
                                    system info data area        @Z25DW 01515000
         EJECT ,                                                        01520000
**************************************************************          01530000
*                                                            *          01540000
*        The following structure (JPROC) defines the         *          01550000
*        input parameters passed on the call to this SSI.    *          01560000
*                                                            *          01570000
**************************************************************          01580000
JPROC    DSECT                                                          01590000
JPRCID   DS    CL8'JESPROCI'       I.Eye catcher                        01600000
JPRCLEN  DS    AL2(JPRCSZE)        I.Length of JPROC parameter          01610000
         SPACE 1                                                        01620000
**************************************************************          01630000
*                                                            *          01640000
*        There are two 2 byte versions for this SSOB         *          01650000
*        extension.  JPRCVER is the version provided by the  *          01660000
*        caller.  They indicate the level of the control     *          01670000
*        block passed to the service.  As new input          *          01680000
*        fields are added to the service, the caller         *          01690000
*        provided version indicates what the service is to   *          01700000
*        consider valid.                                     *          01710000
*                                                            *          01720000
*        JPRCVERO is the version information returned from   *          01730000
*        the service.  This implies what fields the service  *          01740000
*        actually examined and what data is returned.  If    *          01750000
*        the service is at a level higher than the level of  *          01760000
*        the caller, JPRCVERO may be higher than JPRCVER.    *          01770000
*        In this case, only the fields valid at the JPRCVER  *          01780000
*        level are actually examined or set.                 *          01790000
*                                                            *          01800000
*        The 2 bytes of version information is a 1 byte      *          01810000
*        level number (changed only when a new release adds  *          01820000
*        significant function) and a 1 byte modifier         *          01830000
*        (changed only when function is added via service).  *          01840000
*                                                            *          01850000
**************************************************************          01860000
         SPACE 1                                                        01870000
JPRCVER  DC    0FL2'0'             I.SSOB version                       01880000
JPRCVERL DC    AL1(JPRCCVRL)       I.SSOB version level                 01890000
JPRCVERM DC    AL1(JPRCCVRM)       I.SSOB version modifier              01900000
JPRCV010 EQU   X'0100'               Initial version number of         C01910000
                                     IAZJPROC.                          01920000
JPRCSVR# EQU   X'0100'               Latest version                     01930000
JPRCCVRL EQU   1                     Current version level              01940000
JPRCCVRM EQU   0                     Current version modifier           01950000
         SPACE 1                                                        01960000
JPRCVERO DC    FL2'0'              O.Subsystem version/modifier         01970000
         SPACE 1                                                        01980000
         DC    XL2'0'              Reserved.                            01990000
         SPACE 1                                                        02000000
**************************************************************          02010000
*                                                            *          02020000
*        JPRCSTRP is an anchor for use by the subsystem      *          02030000
*        that responds to this request.  It is expected that *          02040000
*        the caller will set this to zero the FIRST time an  *          02050000
*        SSOB extension is used and from that point on it    *          02060000
*        will be managed by the subsystem.                   *          02070000
*                                                            *          02080000
**************************************************************          02090000
         SPACE 1                                                        02100000
JPRCSTRP DC    A(0)                Storage management anchor.    @Z24BK 02110000
         SPACE 1                                                        02140000
**************************************************************          02150000
*                                                            *          02160000
*        Begin input-only fields.                            *          02170000
*                                                            *          02180000
*        NOTES: - Many of the filters only apply to JES2 or  *          02190000
*                 JES3.  Each filter is denoted with what    *          02200000
*                 applies.                                   *          02210000
*               - In JES2, this SSI can be used to obtain    *   @Z25DW 02220000
*                 information on the SUBMITLIB and           *   @Z25DW 02230000
*                 POLICYLIB concatenations.  Only one type   *   @Z25DW 02235000
*                 of concatenation can be returned on a      *   @Z25DW 02240000
*                 call.                                      *   @Z25DW 02245000
*                                                            *   @Z25DW 02250000
*        When requesting PROCLIB information, the JPRCFJBC,  *   @Z25DW 02255000
*        JPRCFSTC, JPRCFTSO, JPRCFINT, and JPRCFLOC filters  *   @Z25DW 02260000
*        in JPRCFLTR are a list of PROCLIBs to include in    *   @Z25DW 02265000
*        the output area.  For example, setting JPRCFNAM     *   @Z25DW 02270000
*        with JPRCPNAM set to PROC00 and setting JPRCFTSO    *   @Z25DW 02275000
*        will return PROC00 AND the PROCLIB used for TSO     *   @Z25DW 02280000
*        logon.  A particular PROCLIB concatenation will     *   @Z25DW 02285000
*        only be returned once even if it matches multiple   *   @Z25DW 02290000
*        filters.                                            *   @Z25DW 02295000
*                                                            *          02300000
*        If the class specified in JPRCJCLS does not exist,  *          02310000
*        this is considered an input error and no data will  *          02320000
*        be returned.                                        *          02330000
*                                                            *          02340000
*        Filters JPRCFJBC, JPRCFSTC, JPRCFTSO, JPRCFINT, and *   @Z25DW 02341000
*        JPRCFLOC only apply when PROCLIB data is being      *   @Z25DW 02342000
*        requested (that is, when JPRCFTYP is not set or     *   @Z25DW 02343000
*        when set and JPRCTYPE is set to JPRTPROC).          *   @Z25DW 02344000
*                                                            *   @Z25DW 02345000
**************************************************************          02350000
         SPACE 1                                                        02360000
JPRCFLTR DC    BL1'0'              IS.Indicate desired filters          02370000
JPRCFNAM EQU   B'10000000'            Filter on PROCLIB DD name         02380000
JPRCFJBC EQU   B'01000000'            Return PROCLIB for JOBCLASS      C02390000
                                        (JES2 only)                     02400000
JPRCFSTC EQU   B'00100000'            Return started task PROCLIB       02410000
JPRCFTSO EQU   B'00010000'            Return TSO logon PROCLIB          02420000
JPRCFINT EQU   B'00001000'            Return internal reader PROCLIB   C02430000
                                        (JES3 only)                     02440000
JPRCFLOC EQU   B'00000100'            Return PROCLIB for address       C02450000
                                        space calling the SSI           02460000
         SPACE 1                                                 @Z25DW 02460600
*------------------------------------------------------------*   @Z25DW 02461200
*        If type filtering is not set, then only PROCLIB     *   @Z25DW 02461800
*        type concatenations are returned.  If JPRCFTYP is   *   @Z25DW 02462400
*        set and JPRCTYPE is zero, then only PROCLIB         *   @Z25DW 02463000
*        concatenations are returned.                        *   @Z25DW 02463600
*------------------------------------------------------------*   @Z25DW 02464200
         SPACE 1                                                 @Z25DW 02464800
JPRCFTYP EQU   B'00000010'            Filter on concatenation    @Z25DWC02465400
                                        type (JPRCTYPE)          @Z25DWC02466000
                                        (JES2 only)              @Z25DW 02466600
         SPACE 1                                                 @Z25DW 02467200
*************************************************************    @Z25DW 02467800
*                                                           *    @Z25DW 02468400
*        Filter by the system name or JES2 member name      *    @Z25DW 02470000
*        of the system(s) in the JESplex, which should be   *    @Z25DW 02470200
*        processed for the data.                            *    @Z25DW 02470800
*                                                           *    @Z25DW 02471400
*        If none of these filters are specified, SSI will   *    @Z25DW 02472000
*        only return data from the system where SSI was     *    @Z25DW 02472600
*        called. To request information from other systems  *    @Z25DW 02473200
*        (or members) in a JESplex, specify system or       *    @Z25DW 02473800
*        member selection filter.                           *    @Z25DW 02474400
*                                                           *    @Z25DW 02475000
*************************************************************    @Z25DW 02475600
         SPACE 1                                                 @Z25DW 02476200
JPRCFLTS DC    BL1'0'              IS.System/member selection:   @Z25DW 02476800
JPRCSSYS EQU   B'10000000'           use system selection filter       C02477400
                                      (see JPRCSYSN)             @Z25DW 02478000
JPRCSMBR EQU   B'01000000'           use member selection filter       C02480000
                                      (see JPRCMBRN)             @Z25DW 02481000
         SPACE 1                                                 @Z25DW 02482000
JPRCTYPE DC    XL1'0'              IS.Type of concatenation to   @Z25DWC02483000
                                     return (JES2 only)          @Z25DW 02484000
JPRTPROC EQU   1                     PROCLIB type concat         @Z25DW 02485000
JPRTSBMT EQU   2                     SUBMITLIB type concat       @Z25DW 02486000
JPRTPLCY EQU   3                     POLICYLIB type concat       @Z25DW 02487000
         SPACE 1                                                 @Z25DW 02488000
         DC    XL5'0'              Reserved                      @Z25DW 02489000
         SPACE 1                                                        02490000
**************************************************************          02500000
*       NOTE: Each filter below is enabled via one           *          02510000
*             of the bit settings above.                     *          02520000
**************************************************************          02530000
         SPACE 1                                                        02540000
JPRCPNAM DC    CL8' '              IS*.PROCLIB DD name filter          C02550000
                                     See JPRCFNAM bit                   02560000
JPRCJCLS DC    CL8' '              IS.JOBCLASS whose PROCLIB you want  C02570000
                                     See JPRCFJBC bit                   02580000
JPRCSYSN DC    CL8' '              IS*.System name for selection       C02585000
                                       (used with JPRCSSYS)      @Z25DW 02590000
JPRCMBRN DC    CL8' '              IS*.JES2 MAS member name      @Z25DWC02592000
                                       for selection             @Z25DWC02595000
                                       (used with JPRCSMBR)      @Z25DW 02600000
         DC    6F'0'               Reserved for future use       @Z25DW 02601000
         SPACE 1                                                 @Z25DW 02604000
**************************************************************          02610000
*                                                            *          02620000
*        Begin output-only fields.                           *          02630000
*                                                            *          02640000
**************************************************************          02650000
         SPACE 1                                                        02660000
JPRCLPTR DC    A(0)                O.Pointer to first PROCLIB          C02670000
                                     (JPRHDR) data buffer.              02680000
JPRCNMBR DC    F'0'                O.Number of PROCLIB                 C02690000
                                     (JPRHDR) data buffers             C02700000
                                     returned.                          02710000
JPRCMPTR DC    A(0)                O.Ptr to 1st system/member    @Z25DWC02712000
                                     data area (see JPSHDR)      @Z25DW 02714000
JPRCMNUM DC    A(0)                O.Number of system/member     @Z25DWC02716000
                                     data areas returned         @Z25DW 02718000
         DC    9F'0'               Reserved for future use       @Z25DW 02720000
         SPACE 1                                                        02730000
JPRCSZE1 EQU   *-JPROC             Fix parameter End: Ver 1             02740000
JPRCSZE  EQU   *-JPROC             JPRC Current version                C02750000
                                    fixed parameter length              02760000
         EJECT                                                   @Z25DW 02761000
**************************************************************   @Z25DW 02762000
*                                                            *   @Z25DW 02763000
*        System information data header.                     *   @Z25DW 02764000
*        Sections created within this header are mapped by   *   @Z25DW 02765000
*        the IAZJPLXI macro.                                 *   @Z25DW 02766000
*                                                            *   @Z25DW 02767000
**************************************************************   @Z25DW 02768000
         SPACE 1                                                 @Z25DW 02769000
JPSHDR   DSECT ,                   System information header     @Z25DW 02770000
JPSHEYE  DC    CL8'JPRCSYSI'       Eye-catcher                   @Z25DW 02771000
JPSHOHDR DC    Y(JPSHSIZE)         Offset to 1st (prefix) sect   @Z25DW 02772000
         DC    XL2'0'              Reserved                      @Z25DW 02773000
JPSHNEXT DC    A(*-*)              Address of next header        @Z25DW 02774000
         SPACE 1                                                 @Z25DW 02775000
JPSHSIZE EQU   *-JPSHDR            Header size (internal use)    @Z25DW 02776000
         EJECT ,                                                 @Z25DW 02777000
**************************************************************          02780000
*                                                            *          02790000
*        Storage management fields for use by the subsystem  *          02800000
*        only.  JPRCSTRP is a token used to locate a chain   *   @Z24BK 02810000
*        of these control blocks.  All storage will be       *   @Z24BK 02820000
*        obtained in KEY 1.                                  *   @Z24BK 02825000
*                                                            *          02830000
**************************************************************          02840000
         SPACE 1                                                        02850000
JPRCSTOR DSECT ,                   Storage management DSECT             02860000
JPRCSTID DC    CL8'JPRCSTOR'       Eyecatcher                           02870000
JPRCSTHL DC    AL2(JPRCSTBG-JPRCSTOR)  Length of header area            02880000
         DC    AL2(0)              Reserved for future use              02890000
JPRCSTSP DC    X'0'                Subpool of area                      02900000
JPRCSTPL EQU   230                 Recommended subpool to use           02910000
JPRCSTTL DC    AL3(0)              Total length of area (this          C02920000
                                    includes the header)                02930000
JPRCSTNX DC    A(0)                Pointer to next area                 02940000
JPRCSTCP DC    A(0)                Pointer to 1st available            C02950000
                                     byte in this area                  02960000
JPRCSTBG DS    0A                  Start of data area                   02970000
JPRCSTSZ EQU   (JPRCSTBG-JPRCSTOR) JPRCSTOR length                      02980000
         EJECT ,                                                        02990000
**************************************************************          03000000
*                                                            *          03010000
*        The following structures define output data for     *          03020000
*        this SSI.  The basic layout is a chain of PROCLIB   *          03030000
*        DD name Information sections.  Each PROCLIB section *          03040000
*        has a common section and a data set section (with   *          03050000
*        the list of data sets in the concatenation).  See   *          03060000
*        diagram below for a high level view of the data     *          03070000
*        structure layout.                                   *          03080000
*                                                            *          03090000
*          PROCLIB info section                              *          03100000
*          +----------------+                                *          03110000
*   JPRHDR ! JPRNXTP   =-----------> Pointer to the next     *          03120000
*          !                !        JPRHDR in the chain.    *          03130000
*          !                !        Zero if end of chain.   *          03140000
*          +----------------+                                *          03150000
*  JPRPREF ! Prefix Section !                                *          03160000
*          ! . . .          !                                *          03170000
*          +----------------+                                *          03180000
*  JPRGENI ! General        !                                *          03190000
*          ! PROCLIB Data   !                                *          03200000
*          ! Section        !                                *          03210000
*          ! . . .          !                                *          03220000
*          +----------------+                                *          03230000
*  JPRDSNM ! Data Set Data  !                                *          03240000
*          ! Section        !                                *          03250000
*          ! . . .          !                                *          03260000
*          +----------------+                                *          03270000
*                                                            *          03280000
**************************************************************          03290000
         EJECT ,                                                        03300000
**************************************************************          03310000
*                                                            *          03320000
*        PROCLIB Header Section                              *          03330000
*                                                            *          03340000
*        Information about the PROCLIB is returned to        *          03350000
*        the issuer of the SSI.                              *          03360000
*                                                            *          03370000
*        - There can be multiple PROCLIB Areas returned.     *          03380000
*          The JPRNXTP pointer is used to navigate to the    *          03390000
*          next PROCLIB Header section in the chain.         *          03400000
*                                                            *          03410000
*        - To get from this header to the PROCLIB prefix     *          03420000
*          section for this partition, add the JPROPRF       *          03430000
*          offset to the PROCLIB header (JPRHDR) address.    *          03440000
*                                                            *          03450000
**************************************************************          03460000
         SPACE 1                                                        03470000
JPRHDR   DSECT ,                   PROCLIB Header Section               03480000
JPREYE   DC    CL8'JPRHDR  '       Eye catcher                          03490000
         SPACE 1                                                        03500000
JPROPRF  DC    Y(JPRHDSZ)          Offset to prefix section             03510000
         DC    AL2(0)              Reserved for future use              03520000
JPRNXTP  DC    A(*-*)              Address of next PROCLIB              03530000
JPRJPLEX DC    A(*-*)              Address of system info        @Z25DWC03540000
                                     entry for this entry        @Z25DW 03545000
         SPACE 1                                                        03550000
JPRHDSZ  EQU   *-JPRHDR            Size of this section                C03560000
                                     (Internal use only)                03570000
         SPACE 1                                                        03580000
**************************************************************          03590000
*                                                            *          03600000
*        PROCLIB Section Identifiers                         *          03610000
*                                                            *          03620000
**************************************************************          03630000
         SPACE 1                                                        03640000
JPRIDPRF EQU   X'00'               PROCLIB Info - Prefix                03650000
JPRIDGEN EQU   X'01'               PROCLIB Info - General               03660000
         SPACE 1                                                        03670000
**************************************************************          03680000
*                                                            *          03690000
*        PROCLIB Section Modifiers                           *          03700000
*                                                            *          03710000
**************************************************************          03720000
         SPACE 1                                                        03730000
JPRIMGEN EQU   X'00'               Modifier - General                   03740000
JPRIMDSN EQU   X'01'               Modifier - Data set info             03750000
         SPACE 1                                                        03760000
**************************************************************          03770000
*                                                            *          03780000
*        PROCLIB Prefix Section                              *          03790000
*                                                            *          03800000
*        NOTE: To get here, add the JPROPRF header field     *          03810000
*              to the header (JPRHDR) address.               *          03820000
*                                                            *          03830000
**************************************************************          03840000
         SPACE 1                                                        03850000
JPRPREF  DSECT ,                   PROCLIB Prefix                       03860000
JPRPRLN  DC    AL2(0)              Length of entire PROCLIB            C03870000
                                    entry (Max value is 65535)         C03880000
                                    returned - other than hdr           03890000
         SPACE 1                                                        03900000
JPRPRTP  DC    AL1(JPRIDPRF)       Type     = Prefix Section            03910000
JPRPRMD  DC    AL1(JPRIMGEN)       Type Mod = General                   03920000
         SPACE 1                                                        03930000
JPRPRSZ  EQU   *-JPRPREF           Size of this section                 03940000
         SPACE 1                                                        03950000
**************************************************************          03960000
*                                                            *          03970000
*        PROCLIB General Information Section                 *          03980000
*                                                            *          03990000
*        NOTE: To get here, add the JPROPRF header field     *          04000000
*              and the prefix size (JPRPRSZ) to the header   *          04010000
*              (JPRHDR) address.                             *          04020000
*                                                            *          04030000
**************************************************************          04040000
         SPACE 1                                                        04050000
JPRGENI  DSECT ,                   PROCLIB General                     C04060000
                                    Information.                        04070000
         SPACE 1                                                        04080000
JPRGLN   DC    Y(JPRGENSZ)         Length of this section               04090000
JPRGTY   DC    AL1(JPRIDGEN)       Type     = General Info              04100000
JPRGMD   DC    AL1(JPRIMGEN)       Type Mod = General                   04110000
JPRDDNAM DC    CL8' '              PROCLIB DD name                      04120000
         SPACE 1                                                        04130000
JPRFLAG1 DC    BL1'0'              Flag byte                            04140000
JPRP1STA EQU   B'10000000'           Static PROCLIB (from JES PROC)     04150000
JPRP1STC EQU   B'01000000'           Started task PROCLIB               04160000
JPRP1TSO EQU   B'00100000'           TSO logon PROCLIB                  04170000
JPRP1PTH EQU   B'00010000'           PROCLIB includes a PATH=    @Z25DW 04172000
JPRP1NMV EQU   B'00001000'           A path was not allocated    @Z25DWC04174000
                                      because OMVS not active    @Z25DW 04176000
         SPACE 2                                                 @Z25DW 04180000
JPRPTYPE DC    X'0'                Type of concatenation         @Z25DW 04182000
JPRPTPRC EQU   1                     PROCLIB type concat         @Z25DW 04184000
JPRPTSTM EQU   2                     SUBMITLIB type concat       @Z25DW 04186000
JPRPTPCY EQU   3                     POLICYLIB type concat       @Z25DW 04190000
         SPACE 1                                                 @Z25DW 04191000
         DC    XL2'0'              Reserved                      @Z25DW 04194000
         SPACE 1                                                        04200000
JPRDSCNT DC    HL2'0'              Number of data sets in concatenation 04210000
JPRDUSCT DC    HL2'0'              Concatenation use count     @Z23LSDS 04215000
JPRDMVSN DC    CL8' '              MVS system name               @Z25DW 04216000
JPRDSID  DC    CL8' '              JES member name               @Z25DW 04217000
         SPACE 1                                                        04220000
JPRGENSZ EQU   *-JPRGENI           Size of this section                C04230000
                                     (Internal use only)                04240000
         SPACE 1                                                        04250000
**************************************************************          04260000
*                                                            *          04270000
*        PROCLIB data set information section                *          04280000
*                                                            *          04290000
*        This section describes the data sets that are       *          04300000
*        associated with the PROCLIB DD name.                *          04310000
*                                                            *          04320000
**************************************************************          04330000
         SPACE 1                                                        04340000
JPRDSETS DSECT ,                   Data set info data area              04350000
JPRDLEN  DC    AL2(0)              Length of data set info section      04360000
JPRDTYPE DC    AL1(JPRIDGEN)       Type of this header                  04370000
JPRDMOD  DC    AL1(JPRIMDSN)       Modifier                             04380000
         SPACE 1                                                        04390000
JPRDOFFS DC    AL2(JPRDSTRT-JPRDSETS)  Offset to first info area        04400000
JPRDNUM  DC    HL2'0'              Number of data set areas             04410000
JPRDINFL DC    AL2(JPRDSLEN)       Length of a data set area     @Z25DW 04420000
JPRDSTRT DS    0XL(JPRDSLEN)       First data set info area            C04430000
                                     (Internal use only)                04440000
JPRDSIZE EQU   *-JPRDSETS          Length of basic section             C04450000
                                     (Internal use only)                04460000
         SPACE 1                                                        04470000
*------------------------------------------------------------*          04480000
*        PROCLIB data set information area                   *          04490000
*                                                            *          04500000
*        This area maps the information for each data set in *          04510000
*        the PROCLIB concatenation.                          *          04520000
*------------------------------------------------------------*          04530000
         SPACE 1                                                        04540000
JPRDSINF DSECT ,                   Info for PROCLIB data sets           04550000
JPRDDSN  DS    CL44                Data set name                        04560000
JPRDUNIT DS    CL8                 Data set unit                        04570000
JPRDVOL  DS    CL6                 Data set VOLSER                      04580000
JPRDFLG1 DS    B                   Data set flags              @Z23LSDS 04581000
JPRDALCF EQU   B'10000000'           Allocation failed         @Z23LSDS 04584000
JPRDOPNE EQU   B'01000000'           OPEN error encountered      @Z25DW 04585000
JPRDPTHS EQU   B'00100000'           PATH= specified             @Z25DW 04586000
JPRDPTHT EQU   B'00010000'           PATH= value truncated       @Z25DW 04587000
         SPACE 1                                                 @Z25DW 04588000
JPRDRCFM DS    X                   Record format (RECFM)         @Z25DW 04589000
JPRDLRCL DS    XL2                 Record length (LRECL)         @Z25DW 04590000
JPRDBLKS DS    XL2                 Block size (BLKSIZE)          @Z25DW 04591000
JPRDXDSN DS    CL44                Extracted data set name       @Z25DW 04592000
JPRDXVOL DS    CL6                 Extracted data set VOLSER     @Z25DW 04593000
         DS    XL6                 Reserved                      @Z25DW 04594000
JPRDSLEN EQU   *-JPRDSINF          Length of area (no PATH)      @Z25DWC04595000
                                     (Internal use only)         @Z25DW 04596000
JPRDPATH DS    CL128               Specified PATH value          @Z25DW 04600000
JPRDSLNP EQU   *-JPRDSINF          Length of area (with PATH)    @Z25DWC04605000
                                     (Internal use only)         @Z25DW 04610000
         MEND  ,                                                        04620000
.*                                                                      04630000
**/                                                                     04640000
* % END_OF_ASM_JPRC: ;                                                  04650000
*                                                                       04660000
* %IF JPROC_ATRB = ''            /* If no attribute specified        */ 04670000
*   %THEN                                                               04680000
*     %JPROC_ATRB = 'BASED';     /* Establish default attribute      */ 04690000
*                                                                       04700000
* DCL JPRCINVA FIXED(31) CONSTANT(132); /* Invalid search arguments  */ 04710000
* DCL JPRCEPRC FIXED(31) CONSTANT(136); /* PROCLIB not valid         */ 04720000
* DCL JPRCECLS FIXED(31) CONSTANT(140); /* JOBCLASS not found        */ 04730000
* DCL JPRCINTE FIXED(31) CONSTANT(144); /* Internal error building      04731000
*                                          system info area    @Z25DW*/ 04734000
*                                                                       04740000
*DECLARE                                                                04750000
*   1 JPROC   JPROC_ATRB,                                               04760000
*     3 JPRCID   CHAR(8),           /* I.Eyecatcher                  */ 04770000
*     3 JPRCLEN  FIXED(16),         /* I.Length of JPROC             */ 04780000
*     3 JPRCVER  FIXED(15),         /* I.Parm list version number    */ 04790000
*       5 JPRCVERL FIXED(8),        /*   I.Parm list version level   */ 04800000
*       5 JPRCVERM FIXED(8),        /*   I.Parm list version mod     */ 04810000
*     3 JPRCVERO FIXED(15),         /* O.Subsystem version number    */ 04820000
*     3 *        FIXED(16),         /* Reserved                      */ 04830000
*/********************************************************************/ 04840000
*/*      JPRCSTRP is an anchor for use by the subsystem              */ 04850000
*/*      that responds to this request.  It is expected that         */ 04860000
*/*      the caller will set this to zero the FIRST time an          */ 04870000
*/*      SSOB extension is used and from that point on it            */ 04880000
*/*      will be managed by the subsystem.                           */ 04890000
*/********************************************************************/ 04900000
*     3 JPRCSTRP PTR(31),           /* Storage management anchor     */ 04910000
*     3 JPRCFLTR BIT(8),            /* IS.Filters                    */ 04920000
*                                                                       04930000
*       5 JPRCFNAM BIT(1),          /* Filter on PROCLIB DD name     */ 04940000
*       5 JPRCFJBC BIT(1),          /* Return PROCLIB for JOBCLASS      04950000
*                                        (JES2 only)                 */ 04960000
*       5 JPRCFSTC BIT(1),          /* Return started task PROCLIB   */ 04970000
*       5 JPRCFTSO BIT(1),          /* Return TSO logon PROCLIB      */ 04980000
*       5 JPRCFINT BIT(1),          /* Return INTRDR PROCLIB            04990000
*                                        (JES3 only)                 */ 05000000
*       5 JPRCFLOC BIT(1),          /* Return PROCLIB for address       05010000
*                                        space calling the SSI       */ 05020000
*       5 JPRCFTYP BIT(1),          /* Filter on concatenation          05022000
*                                        type (JPRCTYPE)                05024000
*                                        (JES2 only)           @Z25DW*/ 05026000
*       5 *        BIT(1),          /* Reserved                @Z25DW*/ 05030000
*                                                                       05032000
*     3 JPRCFLTS BIT(8),       /* IS.System/member selection   @Z25DW*/ 05034000
*       5 JPRCSSYS BIT(1),     /*   use system selection filter         05036000
*                                    (see JPRCSYSN)            @Z25DW*/ 05040000
*       5 JPRCSMBR BIT(1),     /*   use member selection filter         05042000
*                                    (see JPRCMBRN)            @Z25DW*/ 05044000
*       5 *        BIT(6),     /*   Reserved                   @Z25DW*/ 05046000
*                                                                       05048000
*     3 JPRCTYPE FIXED(8),          /* IS. Type of concatenation to     05050000
*                                        return (JES2 only)    @Z25DW*/ 05052000
*     3 *         CHAR(5),          /* Reserved                @Z25DW*/ 05055000
*                                                                       05060000
*/********************************************************************/ 05070000
*/*     NOTE: Each filter below is enabled via one                   */ 05080000
*/*           of the bit settings above.                       @Z25DW*/ 05090000
*/********************************************************************/ 05100000
*                                                                       05110000
*     3 JPRCPNAM  CHAR(8),          /* IS*.PROCLIB DD name filter       05120000
*                                           See JPRCFNAM bit.        */ 05130000
*     3 JPRCJCLS  CHAR(8),          /* IS.JOBCLASS for PROCLIB          05140000
*                                           See JPRCFJBC bit.        */ 05150000
*     3 JPRCSYSN  CHAR(8),     /* IS*.System name for selection         05152000
*                                     (used with JPRCSSYS)     @Z25DW*/ 05154000
*     3 JPRCMBRN  CHAR(8),     /* IS*.JES2 MAS member name              05156000
*                                     for selection                     05160000
*                                     (used with JPRCSMBR)     @Z25DW*/ 05163000
*     3 *(6)      FIXED(32),   /* Reserved for future use      @Z25DW*/ 05166000
*                                                                       05170000
*/********************************************************************/ 05180000
*/*      Begin output-only fields.                                   */ 05190000
*/********************************************************************/ 05200000
*     3 JPRCLPTR PTR(31),           /* O.Pointer to first PROCLIB       05210000
*                                         (JPRHDR) data buffer. See     05220000
*                                         output data discussion        05230000
*                                         below for layout.          */ 05240000
*     3 JPRCNMBR FIXED(32),         /* O.Number of PROCLIB              05250000
*                                         (JPRHDR) data buffers         05260000
*                                         returned.                  */ 05270000
*     3 JPRCMPTR PTR(31),           /* O.Ptr to 1st system/member       05272000
*                                        data area             @Z25DW*/ 05274000
*     3 JPRCMNUM PTR(31),           /* O.Number of system/member        05276000
*                                        data areas returned   @Z25DW*/ 05278000
*     3 *(9)     FIXED(32);         /* Reserved                      */ 05280000
*                                                                       05290000
*   DCL JPRCSZE  FIXED(16) CONSTANT(LENGTH(JPROC)); /* Size of JPROC */ 05300000
*   DCL JPRCSZE1 FIXED(16) CONSTANT(136); /* Parameter end-             05310000
*                                      version 1 size.               */ 05320000
*   DCL JPRCV010 FIXED(16) CONSTANT('0100'X); /* Version 1 level     */ 05330000
*   DCL JPRCSVR# FIXED(16) CONSTANT('0100'X); /* Latest Version         05340000
*                                          level                     */ 05350000
*   DCL JPRCCVRL FIXED(8)  CONSTANT(1); /* Current version              05360000
*                                          level                     */ 05370000
*   DCL JPRCCVRM FIXED(8)  CONSTANT(0); /* Current version modifier  */ 05380000
*/*     ID VALUE FOR JPRCID                                          */ 05390000
* DCL JPRCEYEC CHAR(8)  CONSTANT('JESPROCI'); /* PROCLIB Data ID     */ 05400000
*                                                                       05402000
*/*------------------------------------------------------------------*/ 05404000
*/*        JPRCTYPE concatenation types                        @Z25DW*/ 05406000
*/*------------------------------------------------------------------*/ 05408000
*  DCL JPRTPROC FIXED(8) CONSTANT('01'X); /* PROCLIB type      @Z25DW*/ 05410000
*  DCL JPRTSBMT FIXED(8) CONSTANT('02'X); /* SUBMITLIB type    @Z25DW*/ 05412000
*  DCL JPRTPLCY FIXED(8) CONSTANT('03'X); /* POLICYLIB type    @Z25DW*/ 05415000
*                                                                       05420000
*                                                                       05430000
*/********************************************************************/ 05440000
*/*                                                                  */ 05450000
*/*        Storage management fields for use by the subsystem        */ 05460000
*/*        only.  JPRCSTRP is a token used to locate a chain   @Z24BK*/ 05470000
*/*        of these control blocks.  All storage will be       @Z24BK*/ 05480000
*/*        obtained in KEY 1.                                  @Z24BK*/ 05485000
*/*                                                                  */ 05490000
*/********************************************************************/ 05500000
*DECLARE                                                                05510000
*   1 JPRCSTOR  BASED,         /* Storage management block           */ 05520000
*     3 JPRCSTID  CHAR(8),     /* Eyecatcher                         */ 05530000
*     3 JPRCSTHL  FIXED(16),   /* Length of header area              */ 05540000
*     3 *         CHAR(2),     /* Reserved for future use            */ 05550000
*     3 JPRCSTSP  FIXED(8),    /* Subpool of this block              */ 05560000
*     3 JPRCSTTL  FIXED(24),   /* Total length of area (this            05570000
*                                   includes the header              */ 05580000
*     3 JPRCSTNX  PTR(31),     /* Pointer to next area               */ 05590000
*     3 JPRCSTCP  PTR(31),     /* Pointer to first available byte       05600000
*                                   in this area                     */ 05610000
*     3 JPRCSTBG  CHAR(0);      /* Start of data area                */ 05620000
*                                                                       05630000
*   DCL JPRCSTEC CHAR(8)  CONSTANT('JPRCSTOR'); /* Storage management   05640000
*                                                    eyecatcher value*/ 05650000
*   DCL JPRCSTPL FIXED(8) CONSTANT(230); /* Recommended subpool to      05660000
*                                             use                    */ 05670000
*   DCL JPRCSTSZ FIXED(16) CONSTANT(LENGTH(JPRCSTOR)); /* JPRCSTOR      05680000
*                                                           length   */ 05690000
*                                                                       05700000
*                                                                       05710000
*/**************************************************************/       05720000
*/*                                                            */       05730000
*/*        PROCLIB Header Section                              */       05740000
*/*                                                            */       05750000
*/*        Information about the PROCLIB is returned to        */       05760000
*/*        the issuer of the SSI.                              */       05770000
*/*                                                            */       05780000
*/*        - There can be multiple PROCLIB Areas returned.     */       05790000
*/*          The JPRNXTP pointer is used to navigate to the    */       05800000
*/*          next PROCLIB Header section in the chain.         */       05810000
*/*                                                            */       05820000
*/*                                                            */       05830000
*/**************************************************************/       05840000
*DECLARE                                                                05850000
*   1 JPRHDR BASED,                 /* PROCLIB Header Section        */ 05860000
*     3 JPREYE   CHAR(8),           /* Eye catcher                   */ 05870000
*     3 JPROPRF  FIXED(16),         /* Offset to prefix section      */ 05880000
*     3 *        FIXED(16),         /* Reserved for future use       */ 05890000
*     3 JPRNXTP  PTR(31),           /* Address of next JPRHDR        */ 05900000
*     3 JPRJPLEX PTR(31);      /* Address of system information         05910000
*                                   entry for this member      @Z25DW*/ 05915000
*                                                                       05920000
*   DCL JPREYEC  CHAR(8)  CONSTANT('JPRHDR  '); /* Eye catcher value */ 05930000
*                                                                       05940000
*/********************************************************************/ 05950000
*/*                                                                  */ 05960000
*/*        PROCLIB Section Identifiers                               */ 05970000
*/*                                                                  */ 05980000
*/********************************************************************/ 05990000
*  DCL JPRIDPRF FIXED(8) CONSTANT('00'X); /* PROCLIB Info - Prefix  */  06000000
*  DCL JPRIDGEN FIXED(8) CONSTANT('01'X); /* PROCLIB Info - General */  06010000
*/********************************************************************/ 06020000
*/*                                                                  */ 06030000
*/*        PROCLIB Section Modifiers                                 */ 06040000
*/*                                                                  */ 06050000
*/********************************************************************/ 06060000
*   DCL JPRIMGEN FIXED(8) CONSTANT('00'X); /* Modifier - General     */ 06070000
*   DCL JPRIMDSN FIXED(8) CONSTANT('01'X); /* Modifier - DS info     */ 06080000
*/********************************************************************/ 06090000
*/*                                                                  */ 06100000
*/*        PROCLIB Prefix Section                                    */ 06110000
*/*                                                                  */ 06120000
*/*        NOTE: To get here, add the JPROPRF header field           */ 06130000
*/*              to the header (JPRHDR) address.                     */ 06140000
*/*                                                                  */ 06150000
*/********************************************************************/ 06160000
*DECLARE                                                                06170000
*   1 JPRPREF BASED,                /* PROCLIB Prefix                */ 06180000
*     3 JPRPRLN  FIXED(16),         /* Length of entire PROCLIB         06190000
*                                      entry (Max value is 65535)       06200000
*                                      returned - other than hdr.    */ 06210000
*     3 JPRPRTP  FIXED(8),          /* Type     = Prefix   (JPRIDPRF)*/ 06220000
*     3 JPRPRMD  FIXED(8);          /* Type Mod = General  (JPRIMGEN)*/ 06230000
*                                                                       06240000
*   DCL JPRPRSZ  FIXED(8) CONSTANT(LENGTH(JPRPREF)); /* Length       */ 06250000
*/********************************************************************/ 06260000
*/*                                                                  */ 06270000
*/*        PROCLIB General Information Section                       */ 06280000
*/*                                                                  */ 06290000
*/*        NOTE: To get here, add the JPROPRF header field           */ 06300000
*/*              and the prefix size (JPRPRSZ) to the header         */ 06310000
*/*              (JPRHDR) address.                                   */ 06320000
*/*                                                                  */ 06330000
*/********************************************************************/ 06340000
*DECLARE                                                                06350000
*   1 JPRGENI BASED,                /* PROCLIB General                  06360000
*                                      Information.                  */ 06370000
*     3 JPRGLN   FIXED(16),         /* Length of this section        */ 06380000
*     3 JPRGTY   FIXED(8),          /* Type     = General  (JPRIDGEN)*/ 06390000
*     3 JPRGMD   FIXED(8),          /* Type Mod = General  (JPRIMGEN)*/ 06400000
*     3 JPRDDNAM CHAR(8),           /* PROCLIB DD name               */ 06410000
*     3 JPRFLAG1 BIT(8),            /* Flag byte                     */ 06420000
*      5 JPRP1STA BIT(1),           /* Static PROCLIB (from JES PROC)*/ 06430000
*      5 JPRP1STC BIT(1),           /* Started task PROCLIB          */ 06440000
*      5 JPRP1TSO BIT(1),           /* TSO logon PROCLIB             */ 06450000
*      5 JPRP1PTH BIT(1),           /* PATH= in PROCLIB        @Z25DW*/ 06455000
*      5 JPRP1NMV BIT(1),           /* Path not allocated because       06460000
*                                      OMVS is not active      @Z25DW*/ 06462000
*      5 *        BIT(3),           /* Reserved                @Z25DW*/ 06465000
*     3 JPRPTYPE FIXED(8),          /* Concatenation type      @Z25DW*/ 06470000
*     3 *        CHAR(2),           /* Reserved                @Z25DW*/ 06475000
*     3 JPRDSCNT FIXED(16),         /* Number of DS in concat        */ 06480000
*     3 JPRDUSCT FIXED(16),         /* Concatenation use cnt @Z23LSDS*/ 06481000
*     3 JPRDMVSN CHAR(8),           /* MVS system name         @Z25DW*/ 06482000
*     3 JPRDSID  CHAR(8);           /* JES member name         @Z25DW*/ 06483000
*                                                                       06484000
*/*------------------------------------------------------------------*/ 06485000
*/*        JPRPTYPE concatenation types                        @Z25DW*/ 06485600
*/*------------------------------------------------------------------*/ 06486400
*  DCL JPRPTPRC FIXED(8) CONSTANT('01'X); /* PROCLIB type      @Z25DW*/ 06487200
*  DCL JPRPTSTM FIXED(8) CONSTANT('02'X); /* SUBMITLIB type    @Z25DW*/ 06488000
*  DCL JPRPTPCY FIXED(8) CONSTANT('03'X); /* POLICYLIB type    @Z25DW*/ 06488800
*                                                                       06490000
*/********************************************************************/ 06500000
*/*                                                                  */ 06510000
*/*        PROCLIB data set information section                      */ 06520000
*/*                                                                  */ 06530000
*/*        This section describes the data sets that are             */ 06540000
*/*        associated with the PROCLIB DD name.                      */ 06550000
*/*                                                                  */ 06560000
*/********************************************************************/ 06570000
*DECLARE                                                                06580000
*   1 JPRDSETS BASED,               /* Data set info data area       */ 06590000
*     3 JPRDLEN  FIXED(16),         /* Length of this section        */ 06600000
*     3 JPRDTYPE FIXED(8),          /* Type     = General  (JPRIDGEN)*/ 06610000
*     3 JPRDMOD  FIXED(8),          /* Type Mod = General  (JPRIMDSN)*/ 06620000
*     3 JPRDOFFS FIXED(16),         /* Offset to first info area     */ 06630000
*     3 JPRDNUM  FIXED(16),         /* Number of data set areas      */ 06640000
*     3 JPRDINFL FIXED(16);         /* Length of a data set area     */ 06650000
*                                                                       06660000
*/*------------------------------------------------------------------*/ 06670000
*/*        PROCLIB data set information area                         */ 06680000
*/*                                                                  */ 06690000
*/*        This area maps the information for each data set in       */ 06700000
*/*        the PROCLIB concatenation.                                */ 06710000
*/*------------------------------------------------------------------*/ 06720000
*DECLARE                                                                06730000
*   1 JPRDSINF BASED,               /* Info for PROCLIB data sets    */ 06740000
*     3 JPRDDSN  CHAR(44),          /* Data set name                 */ 06750000
*     3 JPRDUNIT CHAR(8),           /* Data set unit                 */ 06760000
*     3 JPRDVOL  CHAR(6),           /* Data set VOLSER               */ 06770000
*     3 JPRDFLG1 BIT(8),            /* Data set flags        @Z23LSDS*/ 06771000
*       5 JPRDALCF BIT(1),          /* Allocation failed     @Z23LSDS*/ 06774000
*       5 JPRDOPNE BIT(1),          /* OPEN error encounter    @Z25DW*/ 06774400
*       5 JPRDPTHS BIT(1),          /* PATH= specified         @Z25DW*/ 06774800
*       5 JPRDPTHT BIT(1),          /* PATH= value truncated   @Z25DW*/ 06775200
*       5 *        BIT(4),          /* Reserved                @Z25DW*/ 06775600
*     3 JPRDRCFM FIXED(8),          /* Record format (RECFM)   @Z25DW*/ 06776000
*     3 JPRDLRCL FIXED(16),         /* Record length (LRECL)   @Z25DW*/ 06776400
*     3 JPRDBLKS FIXED(16),         /* Block size (BLKSIZE)    @Z25DW*/ 06777000
*     3 JPRDXDSN CHAR(44),          /* Extracted DS name       @Z25DW*/ 06777500
*     3 JPRDXVOL CHAR(6),           /* Extracted VOLSER        @Z25DW*/ 06778000
*     3 *        CHAR(6),           /* Reserved                @Z25DW*/ 06778500
*     3 JPRDPATH CHAR(128);         /* Specified PATH value    @Z25DW*/ 06779000
*                                                                       06779500
*/*------------------------------------------------------------------*/ 06780000
*/*        System information data header.                     @Z25DW*/ 06781000
*/*        Sections created within this header are mapped by   @Z25DW*/ 06782000
*/*        the IAZJPLXI macro.                                 @Z25DW*/ 06783000
*/*------------------------------------------------------------------*/ 06784000
*                                                                       06785000
*DECLARE                                                                06786000
*   1 JPSHDR   BASED,               /* System info header      @Z25DW*/ 06787000
*     3 JPSHEYE  CHAR(8),           /* Eye-catcher             @Z25DW*/ 06788000
*     3 JPSHOHDR FIXED(16),         /* Offset to 1st (prefix) section*/ 06789000
*     3 *        CHAR(2),           /* Reserved                @Z25DW*/ 06790000
*     3 JPSHNEXT PTR(31),           /* Address of next hdr     @Z25DW*/ 06791000
*     3 *        CHAR(0);           /* End of structure        @Z25DW*/ 06792000
*                                                                       06793000
*/* Eye-catcher in JPSHEYE                                     @Z25DW*/ 06794000
* DCL JPSHEYEC CHAR(8) CONSTANT('JPRCSYSI');               /*  @Z25DW*/ 06795000
*                                                                       06796000
*/*                          END OF MACRO                            */ 06800000
* @Logic;                                                               06810000
* #PRAGMA TOOL=PADI.                                                    06820000
* #PADIDELETE.JPRCEYEC                                                  06830000
* #PADIDELETE.JPRCSTEC                                                  06840000
* #PADIDELETE.JPREYEC                                                   06850000
* #PADIDELETE.JPRHDSZ                                                   06860000
* #PADIDELETE.JPRGENSZ                                                  06870000
* #PADIDELETE.JPRDSTRT                                                  06880000
* #PADIDELETE.JPRDSIZE                                                  06890000
* #PADIDELETE.JPRDSLEN                                                  06900000
* #PADIDELETE.JPRDSLNP                                                  06902000
* #PADIDELETE.JPSHSIZE                                                  06904000
* #PADIDELETE.JPSHEYEC                                                  06906000
*#EPRAGMA                                                               06910000
*@ENDLOGIC;                                                             99999999
