*        %GOTO JPCLSCMT;          /* Bilingual Mapping Macro            00010000
         MACRO                                                          00020000
         IAZJPCLS                                                       00030000
.*/      %JPCLSCMT: ;                                             /* */ 00040000
*                                                                       00050000
*/**** START OF SPECIFICATIONS *******************************          00060000
.****PROPRIETARY-STATEMENT************************************          00070000
.*01* PROPRIETARY STATEMENT:                                 *          00080000
.*                                                           *          00090000
.*   LICENSED MATERIALS-PROPERTY OF IBM                      *          00100000
.*   5650-ZOS Copyright IBM Corp. 2009, 2021                 *          00110000
.*                                                           *          00120000
.*   STATUS:  HBB77D0                                        *          00130000
.*                                                           *          00140000
.****END-OF-PROPRIETARY-STATEMENT*****************************          00150000
*                                                            *          00160000
*01* DESCRIPTIVE NAME: JES Class Information Parameter List  *          00170000
*                      for JES Properties SSI 82             *          00180000
*02*  ACRONYM:  IAZJPCLS                                     *          00190000
*                                                            *          00200000
*01* MACRO NAME:  IAZJPCLS                                   *          00210000
*                                                            *          00220000
*01* DSECT NAME:  JPCLS                                      *          00230000
*01* LABEL PREFIX:  JPCL                                     *          00240000
*                                                            *          00250000
*01* COMPONENT ID:  JES Common (SC141)                       *          00260000
*                                                            *          00270000
*01* EXTERNAL CLASSIFICATION:                                *          00280000
*02*  GUPI:  BASE                                            *          00290000
*02*  DMTI:  FIELDS                                          *          00300000
*            JPCLSTRP  JPCLSTOR  JPCLSTID  JPCLSTHL          *          00310000
*            JPCLSTSP  JPCLSTPL  JPCLSTTL  JPCLSTNX          *          00320000
*            JPCLSTCP  JPCLSTBG  JPCLUSER  CLSHDSZ           *          00330000
*            CLSGENSZ  CLS2FSZ   CLS3FSZ   CLS3TLSZ          *          00340000
*            CLMHDSZ   CLMGENSZ  CLM3FSZ   CLM3MLSZ          *          00350000
*01* END OF EXTERNAL CLASSIFICATION:                         *          00360000
*                                                            *          00370000
*01* EYE-CATCHER:  'JPCLASSD'                                *          00380000
*02*  OFFSET:      JPCLID                                    *          00390000
*02*  LENGTH:      L'JPCLID                                  *          00400000
*                                                            *          00410000
*01* STORAGE ATTRIBUTES:                                     *          00420000
*02*  SUBPOOL: Parameter List = Subpool of Caller            *          00430000
*              Output Data    = Subpool 230                  *          00440000
*02*  KEY:     Parameter List = Key of Caller                *          00450000
*              Output Data    = Key 1                        *          00460000
*02*  RESIDENCY:                                             *          00470000
*      Virtual = 31 bit private storage                      *          00480000
*      Real    = 64 bit storage                              *          00490000
*02*  FREQUENCY = 1 per call to function code 82 with        *          00500000
*                 function request byte of SSJPJCOD or       *          00510000
*                 SSJPJCRS.                                  *          00520000
*                                                            *          00530000
*01* SIZE:                                                   *          00540000
*                                                            *          00550000
*     See JPCLSZE                                            *          00560000
*                                                            *          00570000
*01* CREATED BY:                                             *          00580000
*                                                            *          00590000
*     Caller of SSI function 'SSOBSSJP' = 82                 *          00600000
*                                                            *          00610000
*01* POINTED TO BY:                                          *          00620000
*                                                            *          00630000
*     SSJPUSER in the SSOB extension                         *          00640000
*                                                            *          00650000
*01* SERIALIZATION:                                          *          00660000
*                                                            *          00670000
*     None                                                   *          00680000
*                                                            *          00690000
*01* FUNCTION:                                               *          00700000
*                                                            *          00710000
*     This macro provides the mapping of the parameter       *          00720000
*     list used by programs to request Class Data from       *          00730000
*     the JES subsystem.                                     *          00740000
*                                                            *          00750000
*01* METHOD OF ACCESS:                                       *          00760000
*                                                            *          00770000
*02*  ASM:                                                   *          00780000
*      IAZJPCLS                                              *          00790000
*                                                            *          00800000
*02*  PL/X:                                                  *          00810000
*      %DCL JPCLS_ATRB CHAR                                  *          00820000
*      %JPCLS_ATRB = 'value'                                 *          00830000
*      %INCLUDE SYSLIB(IAZJPCLS)                             *          00840000
*                                                            *          00850000
*      where value is valid control block attributes,        *          00860000
*      such as 'BASED(SSXXUSER)'.  If JPCLS_ATRB='',         *          00870000
*      then 'BASED' will be used.                            *          00880000
*                                                            *          00890000
*01* USED BY:                                                *          00900000
*                                                            *          00910000
*     This is used by programs to request Class Data         *          00920000
*     from the JES subsystem.                                *          00930000
*                                                            *          00940000
*01* DELETED BY:                                             *          00950000
*                                                            *          00960000
*     Caller                                                 *          00970000
*                                                            *          00980000
*01* RESTRICTIONS:                                           *          00990000
*                                                            *          01000000
*     None                                                   *          01010000
*                                                            *          01020000
*01* NOTES:                                                  *          01030000
*                                                            *          01040000
*        In the following description of the JPCLS DSECT     *          01050000
*        fields, the notation before the field description   *          01060000
*        can be one of the following:                        *          01070000
*                                                            *          01080000
*        I.    Input (application supplied information)      *          01090000
*        IS.   Input (used for selection/filtering )         *          01100000
*        IS*.  Same as IS, but field supports wild cards:    *          01110000
*                * = any zero or more characters             *          01120000
*                ? = any single character                    *          01130000
*        O.    Output (system supplied information)          *          01140000
*                                                            *          01150000
*                                                            *          01160000
****** END OF SPECIFICATIONS ********************************@Z23D105*/ 01170000
*/********************************************************************/ 01180000
*/*01* CHANGE ACTIVITY:                                              */ 01190000
*/* $ME15275=SDSFASST HBB7760 090109 BWT:  Removed unused fields fro */ 01198200
*/*                                        ME15275                   */ 01198800
*/* $ME15533=SDSFASST HBB7760 090227 BWT:  IAZ macro PLX Section Siz */ 01199200
*/*                                        ME15533                   */ 01199600
*/*                                                                  */ 01199700
*/* $Z13LJBR=JOBRC    HBB7780 100917 TJW:  JOBRC support             */ 01199800
*/*                                                                  */ 01200800
*/* $Z21LCLS=CLASS8   HBB7790 110623 TJW:  8 char jobclass updates   */ 01201800
*/* $Z21LENQ=DSENQSHR HBB7790 110721 TJW:  DSN ENQ downgrade support */ 01202800
*/* $Z21LSYM=JCLSYM   HBB7790 121206 TJW:  Batch job system symbolic */ 01203800
*/*                                                                  */ 01203900
*/* $Z22LDEP=DEPJOB   HBB77A0 140613 ALP:  DLS STARTBY               */ 01204200
*/* $Z22LSYM=JCLSYM   HBB77A0 150105 TJW:  New SYSSYM bit            */ 01204500
*/*                                                                  */ 01204600
*/* $Z23LGDG=GDGBIAS  HBB77B0 160310 TJW:  GDGBIAS support           */ 01204700
*/* $Z23LNFY=EMNOTIFY HBB77B0 160921 TJW:  CONV=STRING support       */ 01205700
*/*                                                                  */ 01205800
*/* $S202710=CHEADERS HBB77C0 190212 TJW:  Updates for C headers     */ 01206000
*/*                                        S202710                   */ 01206200
*/*                                                                  */ 01206700
*/*01* A000000-999999    Created for z/OS release 11         @Z11LSSI*/ 01210000
*/********************************************************************/ 01220000
*/************************************************************          01230000
*01* NOTES:                                                  *          01240000
*                                                            *          01250000
*          Bilingual Mapping Macro (PL/X and BAL)            *          01260000
*                                                            *          01270000
*        Dependencies =                                      *          01280000
*                                                            *          01290000
*          PL/X Version = This macro uses the macro          *          01300000
*            variable JPCLS_ATRB. JPCLS_ATRB must be         *          01310000
*            declared and set to valid control block         *          01320000
*            attributes before the macro is invoked.         *          01330000
*                                                            *          01340000
*          BAL Version = None                                *          01350000
*                                                            *          01360000
*************************************************************/          01370000
*/*                                                                  */ 01380000
* % GOTO END_OF_ASM_JPCL; /*                                            01390000
*                                                                       01400000
         EJECT                                                          01410000
**************************************************************          01520000
*                                                            *          01530000
*        The following structure (JPCLS) defines the         *          01540000
*        input parameters passed on the call to this SSI.    *          01550000
*                                                            *          01560000
**************************************************************          01570000
JPCLS    DSECT ,                                                        01580000
JPCLID   DC    CL8'JPCLASSD'       I.Eye catcher                        01590000
JPCLLEN  DC    AL2(JPCLSZE)        I.Length of JPCLS parameter         C01600000
                                     list                               01610000
         SPACE 1                                                        01620000
*-------------------------------------------------------------*         01630000
*        There are two 2 byte versions for this SSOB          *         01640000
*        extension.  JPCLVER is the version provided by the   *         01650000
*        caller.  They indicate the level of the control      *         01660000
*        block passed to the service.  As new input           *         01670000
*        fields are added to the service, the caller          *         01680000
*        provided version indicates what the service is to    *         01690000
*        consider valid.                                      *         01700000
*                                                             *         01710000
*        JPCLVERO is the version information returned from    *         01720000
*        the service.  This implies what fields the service   *         01730000
*        actually examined and what data is returned.  If     *         01740000
*        the service is at a level higher than the level of   *         01750000
*        the caller, JPCLVERO may be higher than JPCLVER.     *         01760000
*        In this case, only the fields valid at the JPCLVER   *         01770000
*        level are actually examined or set.                  *         01780000
*                                                             *         01790000
*        The 2 bytes of version information is a 1 byte       *         01800000
*        level number (changed only when a new release adds   *         01810000
*        significant function) and a 1 byte modifier          *         01820000
*        (changed only when function is added via service).   *         01830000
*-------------------------------------------------------------*         01840000
JPCLVER  DC    0FL2'0'             I.Parm list version/modifier         01850000
JPCLVERL DC    AL1(JPCLCVRL)         I.Parm list version level          01860000
JPCLVERM DC    AL1(JPCLCVRM)         I.Parm list version               C01870000
                                         modifier                       01880000
JPCLV010 EQU   X'0100'             Initial version number of           C01890000
                                     IAZJPCLS                           01900000
JPCLVER# EQU   X'0100'             Service version number of           C01910000
                                     IAZJPCLS - Latest Version          01920000
JPCLCVRL EQU   1                   Current version level                01930000
JPCLCVRM EQU   0                   Current version modifier             01940000
         SPACE 1                                                        01950000
JPCLVERO DC    FL2'0'              O.Subsystem version/modifier         01960000
         SPACE 1                                                        01970000
         DC    XL2'0'              Reserved                             01980000
JPCLUSER DS    0F                  Placeholder. Do not use.             01990000
         SPACE 1                                                        02000000
**************************************************************          02010000
*                                                            *          02020000
*        JPCLSTRP is an anchor for use by the subsystem      *          02030000
*        that responds to this request.  It is expected that *          02040000
*        the caller will set this to zero the FIRST time an  *          02050000
*        SSOB extension is used and from that point on it    *          02060000
*        will be managed by the subsystem.                   *          02070000
*                                                            *          02080000
**************************************************************          02090000
JPCLSTRP DS    A                   Storage management anchor.    @Z24BK 02100000
         SPACE 1                                                        02130000
*------------------------------------------------------------*          02140000
*        Begin input-only fields.                            *          02150000
*------------------------------------------------------------*          02160000
JPCLFLG1 DS    BL1                 IS.Flag byte                         02170000
JPCL1CLS EQU   B'10000000'           Return data for class name        C02180000
                                     (see JPCLCNAM)                     02190000
JPCL1GRP EQU   B'01000000'           Return data for job class @Z21LCLSC02193000
                                     group name (see JPCLGNAM) @Z21LCLS 02196000
         SPACE 1                                                        02200000
         DC    XL3'00'             Reserved for future use              02210000
*------------------------------------------------------------*          02230000
*        NOTE: Each filter below is enabled via one of the   *          02240000
*              bit settings above.                           *          02250000
*------------------------------------------------------------*          02260000
JPCLCNAM DS    CL8' '              IS*.Class name for filter            02270000
JPCLGNAM DS    CL8' '              IS*.Class group name as a   @Z21LCLSC02271000
                                     filter                    @Z21LCLS 02274000
         DC    18F'0'              Reserved for future use     @Z21LCLS 02280000
         SPACE 1                                                        02290000
*------------------------------------------------------------*          02300000
*        Begin output-only fields.                           *          02310000
*------------------------------------------------------------*          02320000
JPCLDPTR DS    A                   O.Pointer to first Class            C02330000
                                     (CLSHDR) data buffer. See         C02340000
                                     output data discussion            C02350000
                                     below for layout.                  02360000
JPCLNCLS DS    F                   O.Number of Class                   C02370000
                                     (CLSHDR) data buffers             C02380000
                                     returned.                          02390000
         DC    20F'0'              Reserved for future use              02400000
         SPACE 1                                                        02410000
JPCLSZE1 EQU   *-JPCLS             Fixed parameter end: Ver 1           02420000
JPCLSZE  EQU   *-JPCLS             JPCLS Current version               C02430000
                                    fixed parameter length              02440000
         EJECT ,                                                        02450000
**************************************************************          02460000
*                                                            *          02470000
*        Storage management fields for use by the subsystem  *          02480000
*        only.  JPCLSTRP is a token used to locate a chain   *   @Z24BK 02490000
*        of these control blocks.  All storage will be       *   @Z24BK 02500000
*        obtained in KEY 1.                                  *   @Z24BK 02505000
*                                                            *          02510000
**************************************************************          02520000
         SPACE 1                                                        02530000
JPCLSTOR DSECT ,                   Storage management DSECT             02540000
JPCLSTID DC    CL8'JPCLSTOR'       Eyecatcher                           02550000
JPCLSTHL DC    AL2(JPCLSTSZ)       Length of header area                02560000
         DS    AL2                 Reserved for future use              02570000
JPCLSTSP DS    X                   Subpool of area                      02580000
JPCLSTPL EQU   230                 Recommended subpool to use           02590000
JPCLSTTL DS    AL3                 Total length of area (this          C02600000
                                    includes the header)                02610000
JPCLSTNX DS    A                   Pointer to next area                 02620000
JPCLSTCP DS    A                   Pointer to 1st available            C02630000
                                     byte in this area                  02640000
JPCLSTBG DS    0A                  Start of data area                   02650000
JPCLSTSZ EQU   (JPCLSTBG-JPCLSTOR) JPCLSTOR length                      02660000
         EJECT ,                                                        02670000
**************************************************************          02680000
*                                                            *          02690000
*        The following structures define output data for     *          02700000
*        this SSI. The basic layout is a chain of Class      *          02710000
*        Information sections.   Each Class section has      *          02720000
*        an attached chain of Member Information sections.   *          02730000
*        See diagram below for a high level view of the data *          02740000
*        structure layout.                                   *          02750000
*                                                            *          02760000
*        Note that the term member refers to members in a    *          02762000
*        MAS for JES2.  For JES3 member refers to Mains in   *          02764000
*        a JESplex.                                          *          02766000
*                                                            *          02770000
*          CLASS INFO SECTION                                *          02780000
*          +----------------+                                *          02790000
*   CLSHDR ! CLSNXTP   =-----------> POINTER TO THE NEXT     *          02800000
*          !                !        CLSHDR IN THE CHAIN.    *          02810000
*          ! CLSFRSTM  =--------+    ZERO IF END OF CHAIN.   *          02820000
*          !                !   !                            *          02830000
*          +----------------+   !                            *          02840000
*  CLSPREF ! Prefix Section !   !                            *          02850000
*          !                !   !                            *          02860000
*          +----------------+   !                            *          02870000
*  CLSGENI ! General        !   !                            *          02880000
*          ! Class Info     !   !                            *          02890000
*          ! Section        !   !                            *          02900000
*          !                !   !                            *          02910000
*          +----------------+   !                            *          02920000
* CLSJES2I ! Optional JES2  !   !  NOTE: Included if JES2    *          02930000
*          ! Class Info     !   !                            *          02940000
*          ! Section        !   !                            *          02950000
*          !                !   !                            *          02960000
*          +----------------+   !                            *          02970000
* CLSJES3I ! Optional JES3  !   !  NOTE: Included if JES3    *          02980000
*          ! Class Info     !   !                            *          02990000
*          ! Section        !   !                            *          03000000
*          !                !   !                            *          03010000
*          +----------------+   !                            *          03020000
* CLS3TLIM ! Optional JES3  !   !  NOTE: Number of elements  *          03030000
*  (0..N)  ! TLIMIT Array   !   !        specified in        *          03040000
*          ! Elements       !   !        CLS3TLCT.           *          03050000
*          !                !   !                            *          03060000
*          +----------------+   !                            *          03070000
*                               !                            *          03080000
*                               !                            *          03090000
*       +-----------------------+                            *          03100000
*       !                                                    *          03110000
*       !                                                    *          03120000
*       !  CLASS MEMBER INFO SECTION                         *          03130000
*       +->+----------------+                                *          03140000
*   CLMHDR !                !                                *          03150000
*          ! CLMNXTM --------------> POINTER TO THE NEXT     *          03160000
*          !                !        CLMHDR IN THE CHAIN.    *          03170000
*          +----------------+        ZERO IF END OF CHAIN.   *          03180000
*  CLMPREF ! Prefix Section !                                *          03190000
*          !                !                                *          03200000
*          +----------------+                                *          03210000
*  CLMGENI ! General Member !                                *          03220000
*          ! Info Section   !                                *          03230000
*          !                !                                *          03240000
*          +----------------+                                *          03250000
* CLMJES3I ! Optional JES3  ! NOTE: Included if JES3         *          03260000
*          ! Member Info    !                                *          03270000
*          ! Section        !                                *          03280000
*          !                !                                *          03290000
*          +----------------+                                *          03300000
* CLM3MLIM ! Optional JES3  ! NOTE: Number of elements       *          03310000
*  (0..N)  ! MLIMIT Array   !       specified in CLM3MLCT.   *          03320000
*          ! Elements       !                                *          03330000
*          !                !                                *          03340000
*          +----------------+                                *          03350000
*                                                            *          03360000
**************************************************************          03370000
         SPACE 4                                                        03380000
**************************************************************          03390000
*                                                            *          03400000
*        Class Header                                        *          03410000
*                                                            *          03420000
*        Information about Job Classes is returned to the    *          03430000
*        issuer of the SSI.                                  *          03440000
*                                                            *          03450000
*        - There can be multiple Class sections returned.    *          03460000
*          The CLSNXTP pointer is used to navigate to the    *          03470000
*          next Class Header section in the chain.           *          03480000
*                                                            *          03490000
*        - To get from this header to the class prefix       *          03500000
*          section for this class, add the CLSOPRF           *          03510000
*          offset to the class header (CLSHDR) address.      *          03520000
*                                                            *          03530000
*        - To get from this header to the member chain for   *          03540000
*          this class, follow the CLSFRSTM pointer.  The     *          03550000
*          pointer will be ZERO if no members exist under    *          03560000
*          this class.                                       *          03570000
*                                                            *          03580000
**************************************************************          03590000
         SPACE 1                                                        03600000
CLSHDR   DSECT ,                   Class Header                         03610000
CLSID    DC    CL8'CLASSHDR'       Eye catcher                          03620000
         SPACE 1                                                        03630000
CLSOPRF  DC    Y(CLSHDSZ)          Offset to prefix section             03640000
         DC    XL2'0'              Reserved for future use              03650000
CLSNXTP  DC    A(*-*)              Address of next Class                03660000
CLSFRSTM DC    A(*-*)              Address of first member              03670000
         SPACE 1                                                        03680000
CLSHDSZ  EQU   *-CLSHDR            Size of this section                C03690000
                                     (internal use only)                03700000
         SPACE 4                                                        03710000
**************************************************************          03720000
*                                                            *          03730000
*        Class Section Identifiers                           *          03740000
*                                                            *          03750000
**************************************************************          03760000
CLSIDPRF EQU   X'00'               Class Info - Prefix                  03770000
CLSIDGEN EQU   X'01'               Class Info - General                 03780000
CLSIDJS2 EQU   X'02'               Class Info - JES2                    03790000
CLSIDJS3 EQU   X'03'               Class Info - JES3                    03800000
         SPACE 4                                                        03810000
**************************************************************          03820000
*                                                            *          03830000
*        Class Section Modifiers                             *          03840000
*                                                            *          03850000
**************************************************************          03860000
CLSIMGEN EQU   X'00'               Modifier - General                   03870000
         SPACE 4                                                        03880000
**************************************************************          03890000
*                                                            *          03900000
*        Class Prefix Section                                *          03910000
*                                                            *          03920000
*        NOTE: To get here, add the CLSOPRF header field     *          03930000
*              to the header (CLSHDR) address.               *          03940000
*                                                            *          03950000
**************************************************************          03960000
CLSPREF  DSECT ,                   Class Prefix                         03970000
CLSPRLN  DC    AL2(0)              Length of entire Class              C03980000
                                    entry (Max value is 65535)         C03990000
                                    returned - other than hdr           04000000
CLSPRTP  DC    AL1(CLSIDPRF)       Type     = Prefix Section            04010000
CLSPRMD  DC    AL1(CLSIMGEN)       Type Mod = General                   04020000
         SPACE 1                                                        04030000
CLSPRSZ  EQU   *-CLSPREF           Size of this section                C04040000
                                     (internal use only)                04050000
         SPACE 4                                                        04060000
**************************************************************          04070000
*                                                            *          04080000
*        Class General Information Section                   *          04090000
*                                                            *          04100000
*        NOTE: To get here, add the CLSOPRF header field     *          04110000
*              and the prefix size (CLSPRSZ) to the header   *          04120000
*              (CLSHDR) address.                             *          04130000
*                                                            *          04140000
**************************************************************          04150000
CLSGENI  DSECT ,                   Class General Information            04160000
CLSGLN   DC    Y(CLSGENSZ)         Length of this section               04170000
CLSGTY   DC    AL1(CLSIDGEN)       Type     = General Info              04180000
CLSGMD   DC    AL1(CLSIMGEN)       Type Mod = General                   04190000
         SPACE 1                                                        04200000
CLSGNAME DS    CL8' '              Class Name                           04210000
CLSGFLG1 DS    BL1                 Class Flag 1                         04220000
CLSG1WLM EQU   B'10000000'           Class is in WLM mode               04230000
CLSG1NAC EQU   B'01000000'           JOB class is not enabled  @Z21LCLSC04232000
                                     for new work (jobs trying @Z21LCLSC04234000
                                     to use this class will    @Z21LCLSC04236000
                                     fail input processing)    @Z21LCLS 04238000
CLSG1JRN EQU   B'00010000'           No journal option                  04240000
CLSG1SYM EQU   B'00001000'           System symbols            @Z22LSYMC04242000
                                     substitution in batch     @Z22LSYMC04244000
                                     jobs is supported         @Z22LSYM 04246000
CLSG1GST EQU   B'00000100'           GDGBIAS default set to    @Z23LGDGC04247000
                                     STEP                      @Z23LGDG 04248000
         SPACE 1                                                        04250000
CLSGREST DS    BL1                 Restart Options                      04260000
CLSGRCAN EQU   B'00001000'           Print output, then cancel         C04270000
                                       the job (JES3 only)              04280000
CLSGRHLD EQU   B'00000100'           Hold the job (JES3 only)           04290000
CLSGRPRT EQU   B'00000010'           Print output, then hold           C04300000
                                       the job (JES3 only)              04310000
CLSGRSTR EQU   B'00000001'           Allow warmstart to                C04320000
                                       re-queue to Execution           C04330000
                                       Phase                            04340000
         SPACE 1                                               @Z23D106 04341000
         DC    XL1'0'              Reserved                    @Z23D106 04344000
         SPACE 1                                                        04350000
CLSGJFLG DS    BL1                 JESLOG default settings              04390000
CLSGELIG EQU   B'10000000'           Spin eligible                      04400000
CLSGTIMI EQU   B'01000000'           Spin on time interval              04410000
CLSGTIMD EQU   B'00100000'           Spin on time of day                04420000
CLSGLINE EQU   B'00010000'           Spin upon line delta               04430000
CLSGSUP  EQU   B'00001000'           Suppress                           04440000
CLSGNOSP EQU   B'00000000'           No spin                            04450000
         SPACE 1                                                        04460000
CLSGJVAL DS    F                   Spin value.  Number of              C04470000
                                     seconds if CLSGTIMI.              C04480000
                                     Number of seconds past            C04490000
                                     midnight if CLSGTIMD.             C04500000
                                     Number of lines if                C04510000
                                     CLSGLINE.                          04520000
         SPACE 1                                                        04530000
*------------------------------------------------------------*          04540000
*        NOTE: The following four values (CLSGMAXJ, CLSGCURJ,*          04550000
*              CLSGQSIZ, and CLSGHELD) are JESplex-wide      *          04560000
*              counts.                                       *          04570000
*------------------------------------------------------------*          04580000
CLSGMAXJ DS    F                   Max number of concurrently          C04590000
                                     executing jobs of this class      C04600000
                                     (TDEPTH for JES3 if               C04610000
                                      specified)                        04615000
CLSGCURJ DS    F                   Current number of concurrently      C04620000
                                     executing jobs of this class       04630000
CLSGQSIZ DS    F                   Number of jobs of this class        C04640000
                                     eligible for execution            C04650000
                                     (awaiting job selection)          C04660000
                                     (JES2 only)                        04665000
CLSGHELD DS    F                   Number of jobs of this class        C04670000
                                     that are held (JES2 only)          04680000
CLSGGRP  DS    CL8' '              Job class group name        @Z21LCLS 04685000
CLSGDESC DS    CL80' '             Job class description       @Z23LNFY 04686000
         SPACE 1                                                        04690000
CLSGENSZ EQU   *-CLSGENI           Size of this section                C04700000
                                     (internal use only)                04710000
         SPACE 4                                                        04720000
**************************************************************          04730000
*                                                            *          04740000
*        Class Information - JES2 Specific                   *          04750000
*                                                            *          04760000
*        NOTE: To get here, add the CLSGLN field to          *          04770000
*              the Class General Info section (CLSGENI)      *          04780000
*              address.                                      *          04790000
*                                                            *          04800000
**************************************************************          04810000
CLSJES2I DSECT ,                   JES2-specific Class Info             04820000
CLS2LN   DC    Y(CLS2FSZ)          Length of this section               04830000
CLS2TY   DC    AL1(CLSIDJS2)       Type     = JES2 Info                 04840000
CLS2MD   DC    AL1(CLSIMGEN)       Type Mod = General                   04850000
         SPACE 1                                                        04860000
CLS2JBFL DS    BL1                 Job class flag                       04870000
CLS2BCH  EQU   B'10000000'           Batch job                          04880000
CLS2TSU  EQU   B'01000000'           Time sharing user                  04890000
CLS2STC  EQU   B'00100000'           Started task                       04900000
CLS2NOUT EQU   B'00001000'           No output option                   04910000
         SPACE 1                                                        04920000
CLS2TYPR DS    BL1                 TYPRUN setting                       04930000
CLS2HOLD EQU   B'00100000'           TYPRUN = HOLD                      04940000
CLS2SCAN EQU   B'00000100'           TYPRUN = SCAN                      04950000
CLS2COPY EQU   B'00000010'           TYPRUN = COPY                      04960000
         SPACE 1                                                        04970000
CLS2CACT DS    BL1                 Accounting information               04980000
CLS2CSWA EQU   B'00000100'           SWA above 16M line                 04990000
CLS2CNUM EQU   B'00000010'           Account number required            05000000
CLS2CNAM EQU   B'00000001'           Programmer name required           05010000
CLS2CNON EQU   B'00000000'           No information required            05020000
CLS2CALL EQU   CLS2CNUM+CLS2CNAM     Account number and                C05030000
                                       programmer name required         05040000
         SPACE 1                                                        05050000
CLS2CTIM DS    0CL8                Default for job time limit           05060000
CLS2CMNT DS    CL6                   Maximum minutes                    05070000
CLS2CSEC DS    CL2                   Maximum seconds                    05080000
         SPACE 1                                                        05090000
CLS2CREG DS    0CL5                Default for job step region          05100000
CLS2CRGN DS    CL4                   Numeric specification              05110000
CLS2CRGA DS    CL1                   Kilobyte or megabyte              C05120000
                                       specification                    05130000
CLS2CRKB EQU   C'K'                  Kilobyte specification             05140000
CLS2CRMB EQU   C'M'                  Megabyte specification             05150000
         SPACE 1                                                        05160000
CLS2CMND DS    CL1                 Command disposition                  05170000
CLS2CEXE EQU   C'0'                  Pass the command through           05180000
CLS2CDSP EQU   C'1'                  Display and then pass cmd          05190000
CLS2CVER EQU   C'2'                  Ask operator disposition           05200000
CLS2CIGN EQU   C'3'                  Ignore the command                 05210000
         SPACE 1                                                        05220000
CLS2CBLP DS    CL1                 Bypass label processing              05230000
CLS2CBLY EQU   B'00000001'           Process bypass label parm          05240000
         SPACE 1                                                        05250000
CLS2COCG DS    CL1                 Operator command group               05260000
CLS2CGSY EQU   B'00000100'           Group 1 commands (SYS)             05270000
CLS2CGIO EQU   B'00000010'           Group 2 commands (I/O)             05280000
CLS2CGCO EQU   B'00000001'           Group 3 commands (CONS)            05290000
CLS2CGAL EQU   CLS2CGSY+CLS2CGIO+CLS2CGCO  All groups                   05300000
         SPACE 1                                                        05310000
CLS2CJCL DS    CL1                 Default MSGLEVEL, JCL               C05320000
                                     listed if not MSGLEVEL             05330000
CLS2CMSG DS    CL1                 Allocation termination              C05340000
                                     messages value of                 C05350000
                                     MSGLEVEL                           05360000
         SPACE 1                                                        05370000
CLS2JOPT DS    BL1                 Job options flag                     05380000
CLS2NLOG EQU   B'00010000'           No joblog indicator                05385000
CLS2XBMI EQU   B'00001000'           XBM II job class                   05390000
CLS2QHLD EQU   B'00000001'           Class queue is held                05400000
         SPACE 1                                                        05410000
CLS2XBM  DS    CL8                 Procedure name for XBM II           C05420000
                                     jobs                               05430000
CLS2PRCN DS    CL2                 Procedure library number             05440000
CLS2SMF  DS    BL1                 SMF flags                            05450000
CLS2NUSO EQU   B'00100000'           Do not take IEFUSO exit            05460000
CLS2NTY6 EQU   B'00000100'           Do not produce Type 6             C05470000
                                       SMF record                       05480000
CLS2NUJP EQU   B'00000010'           Do not take IEFUJP exit            05490000
CLS2NT26 EQU   B'00000001'           Do not produce Type 26            C05500000
                                       SMF record                       05510000
         SPACE 1                                                        05520000
CLS2PERF DS    CL3                 Default performance group            05530000
CLS2DMCL DS    CL1                 Default msgclass,                   C05540000
                                      TSU and STC classes only          05550000
         SPACE 1                                                        05560000
CLS2FLG1 DS    BL1                 Normal output disposition           C05570000
                                     for JES data sets                  05580000
CLS21CDP EQU   B'10000000'           Conditionally purge output        C05590000
                                       for jobs in this class           05600000
CLS21NOP EQU   B'00010000'           NORMAL OUTDISP=PURGE               05610000
CLS21NOW EQU   B'00001000'           NORMAL OUTDISP=WRITE               05620000
CLS21NOH EQU   B'00000100'           NORMAL OUTDISP=HOLD                05630000
CLS21NOK EQU   B'00000010'           NORMAL OUTDISP=KEEP                05640000
CLS21NOL EQU   B'00000001'           NORMAL OUTDISP=LEAVE               05650000
         SPACE 1                                                        05660000
CLS2FLG2 DS    BL1                 Abnormal output disposition         C05670000
                                     for JES data sets                  05680000
CLS22AOP EQU   B'00010000'           ABNORMAL OUTDISP=PURGE             05690000
CLS22AOW EQU   B'00001000'           ABNORMAL OUTDISP=WRITE             05700000
CLS22AOH EQU   B'00000100'           ABNORMAL OUTDISP=HOLD              05710000
CLS22AOK EQU   B'00000010'           ABNORMAL OUTDISP=KEEP              05720000
CLS22AOL EQU   B'00000001'           ABNORMAL OUTDISP=LEAVE             05730000
         SPACE 1                                                        05740000
CLS2FLG3 DS    BL1                 Processing flags                     05750000
CLS23SPC EQU   B'01000000'           Special class (STC/TSU)            05760000
CLS23SNV EQU   B'00000100'           Default SCHENV (CLS2SCHE)         C05770000
                                       no longer defined to WLM         05780000
CLS23DOK EQU   B'00000010'           Duplicate job names OK            C05790000
                                       for this job class               05800000
CLS23LSR EQU   B'00000001'           JOBRC=LASTRC specified    @Z13LJBRC05802000
                                      for this job class       @Z13LJBR 05805000
         SPACE 1                                                        05810000
CLS2SCHE DS    CL16                Default SCHENV                       05820000
         SPACE 1                                                        05830000
CLS2CFL1 DS    BL1                 Converter parm byte         @Z21LENQ 05830500
CLS21NQU EQU   B'10000000'         - Automatically downgrade   @Z21LENQC05831000
                                     SYSDSN ENQs to SHR        @Z21LENQC05831500
                                     control when no longer    @Z21LENQC05832000
                                     needed EXCLUSIVE          @Z21LENQC05832500
                                     (DSENQSHR=AUTO)           @Z21LENQ 05833000
CLS21NQA EQU   B'01000000'         - Allow jobs to downgrade   @Z21LENQC05833500
                                     SYSDSN ENQs to SHR        @Z21LENQC05834000
                                     control when no longer    @Z21LENQC05834500
                                     needed EXCL when          @Z21LENQC05835000
                                     requested via JCL         @Z21LENQC05835500
                                     DSENQSHR keyword on JOB   @Z21LENQC05836000
                                     stmt (DSENQSHR=ALLOW)     @Z21LENQ 05836500
*                                  - Both bits off indicates   @Z21LENQ 05837000
*                                    that SYSDSN ENQ SHR       @Z21LENQ 05837500
*                                    function is disabled      @Z21LENQ 05838000
*                                    (DSENQSHR=DISALLOW)       @Z21LENQ 05838500
CLS21SYM EQU   B'00100000'         - System symbols            @Z21LSYMC05838600
                                     substitution in batch     @Z21LSYMC05839600
                                     jobs is supported         @Z21LSYMC05840600
                                     (SYMSYS=ALLOW)            @Z22LSYMC05841600
                                     Deprecated, use CLSG1SYM  @Z22LSYM 05842600
         SPACE 1                                               @Z21LENQ 05843600
CLS2PRRT DS    XL1                 STARTBY promotion rate      @Z22LDEP 05844600
CLS2PROC DS    CL8                 Procedure library name        @Z25DW 05845000
         SPACE 1                                               @Z22LDEP 05845600
CLS2FSZ  EQU   *-CLSJES2I          Size of this section                C05846600
                                     (internal use only)                05850000
         SPACE 4                                                        05860000
**************************************************************          05870000
*                                                            *          05880000
*        Class Information - JES3 Specific                   *          05890000
*                                                            *          05900000
*        This section includes a variable length array of    *          05910000
*        TLIMIT data for the class being reported.           *          05920000
*        TLIMIT data is JESplex-wide information.  Each      *          05930000
*        entry in this TLIMIT array defines the number of    *          05940000
*        jobs that can be running in the entire JES3         *          05950000
*        complex for a controlling class and allow jobs      *          05960000
*        in this class (the "owning" class) to be selected.  *          05970000
*        For example, if we are reporting data for class     *          05980000
*        CLSA (owning class) and the TLIMIT array has an     *          05990000
*        entry which says class CLSB has a job count limit   *          06000000
*        of 3 and 4 jobs for class CLSB are currently        *          06010000
*        running in the complex, then no jobs from class     *          06020000
*        CLSA will be selected to run in the complex.        *          06030000
*                                                            *          06040000
*        Each TLIMIT array entry is mapped by the CLS3TLIM   *          06050000
*        DSECT (see below).                                  *          06060000
*                                                            *          06070000
*        NOTE: To get here, add the CLSGLN field to          *          06080000
*              the Class General Info section (CLSGENI)      *          06090000
*              address.                                      *          06100000
*                                                            *          06110000
**************************************************************          06120000
CLSJES3I DSECT ,                   JES3-specific Class Info             06130000
CLS3LN   DC    Y(0)                Length of this section -            C06140000
                                     includes variable length          C06150000
                                     TLIMIT information                 06160000
CLS3TY   DC    AL1(CLSIDJS3)       Type     = JES3 Info                 06170000
CLS3MD   DC    AL1(CLSIMGEN)       Type Mod = General                   06180000
         SPACE 1                                                        06190000
CLS3GRP  DS    CL8' '              Job class group name        @Z21LCLSC06200000
                                   (same as CLSGGRP)           @Z21LCLS 06210000
CLS3PART DS    CL8' '              Spool partition name                 06220000
CLS3TRK1 DS    H                   Primary track group                 C06230000
                                     allocation                         06240000
CLS3TRK2 DS    H                   Secondary track group               C06250000
                                     allocation                         06260000
CLS3SDEP DS    X                   SDEPTH setting                       06270000
CLS3PTY  DS    X                   JES3 priority                        06280000
CLS3FLG1 DS    BL1                 Flag byte                            06282000
CLS31DEF EQU   B'00010000'           ON -> Default class                06285000
         SPACE 1                                                        06290000
CLS3JOPT DS    BL1                 Job option                           06295000
CLS3NLOG EQU   B'10000000'           Suppress JESMSG                    06300000
CLS3LOG  EQU   B'01000000'           Log JESMSG                         06303000
         SPACE 1                                                        06306000
CLS3TLOF DC    AL2(CLS3FSZ)        Offset to 1st TLIMIT entry           06310000
CLS3TLCT DC    AL2(0)              TLIMIT entry count                   06320000
CLS3TLSI DC    AL2(CLS3TLSZ)       Size of a TLIMIT entry               06330000
         DC    XL2'0'              Reserved for future use              06340000
         SPACE 1                                                        06350000
CLS3FSZ  EQU   *-CLSJES3I          Fixed section length                C06360000
                                     (internal use only)                06370000
         SPACE 1                                                        06380000
*------------------------------------------------------------*          06390000
*        TLIMIT array entry - JES3 Specific                  *          06400000
*------------------------------------------------------------*          06410000
CLS3TLIM DSECT ,                   TLIMIT entry                         06420000
CLS3TCLS DS    CL8' '              Controlling class name               06430000
CLS3TMAX DS    F                   Maximum jobs in controlling         C06440000
                                     class                              06450000
CLS3TCUR DS    F                   Current jobs in controlling         C06460000
                                     class                              06470000
         SPACE 1                                                        06480000
CLS3TLSZ EQU   *-CLS3TLIM          TLIMIT entry length                 C06490000
                                     (internal use only)                06500000
         SPACE 1                                                        06510000
**************************************************************          06520000
*                                                            *          06530000
*        Class Member Header                                 *          06540000
*                                                            *          06550000
*        Information about this class and members in the     *          06560000
*        JESplex.                                            *          06570000
*                                                            *          06580000
*        - To get here, use the CLSFRSTM pointer in the      *          06590000
*          class header (CLSHDR).                            *          06600000
*                                                            *          06610000
*        - There can be multiple members returned.  The      *          06620000
*          CLMNXTM pointer is used to navigate to the        *          06630000
*          next member in the chain.                         *          06640000
*                                                            *          06650000
*        - To get from this header to the member prefix      *          06660000
*          section for this member, add the CLMOPRF          *          06670000
*          offset to the member header (CLMHDR) address.     *          06680000
*                                                            *          06690000
**************************************************************          06700000
CLMHDR   DSECT ,                   Member Header                        06710000
CLMID    DC    CL8'CLASSMBR'       Eyecatcher                           06720000
CLMOPRF  DC    Y(CLMHDSZ)          Offset to member prefix             C06730000
                                     section.                           06740000
         DC    XL2'0'              Reserved for future use              06750000
CLMNXTM  DC    A(*-*)              Next member header address           06760000
         SPACE 1                                                        06770000
CLMHDSZ  EQU   *-CLMHDR            Size of this section                C06780000
                                     (internal use only)                06790000
         SPACE 4                                                        06800000
**************************************************************          06810000
*                                                            *          06820000
*        Member Section Identifiers                          *          06830000
*                                                            *          06840000
**************************************************************          06850000
CLMIDPRF EQU   X'80'               Member Info - Prefix                 06860000
CLMIDGEN EQU   X'81'               Member Info - General                06870000
CLMIDJS2 EQU   X'82'               Member Info - JES2                   06880000
CLMIDJS3 EQU   X'83'               Member Info - JES3                   06890000
         SPACE 4                                                        06900000
**************************************************************          06910000
*                                                            *          06920000
*        Member Section Modifiers                            *          06930000
*                                                            *          06940000
**************************************************************          06950000
CLMIMGEN EQU   X'80'               Modifier - General                   06960000
CLMIMJ2A EQU   X'82'               Modifier - JES2                      06970000
CLMIMJ3A EQU   X'83'               Modifier - JES3                      06980000
         SPACE 4                                                        06990000
**************************************************************          07000000
*                                                            *          07010000
*        Member Prefix Section                               *          07020000
*                                                            *          07030000
*        NOTE: To get here, add the CLMOPRF header field     *          07040000
*              to the header (CLMHDR) address.               *          07050000
*                                                            *          07060000
**************************************************************          07070000
CLMPREF  DSECT ,                   Member Prefix                        07080000
CLMPRLN  DC    AL2(0)              Length of entire Member             C07090000
                                     entry (Max value is 65535)         07100000
CLMPRTP  DC    AL1(CLMIDPRF)       Type     = Prefix Section            07110000
CLMPRMD  DC    AL1(CLMIMGEN)       Type Mod = General                   07120000
         SPACE 1                                                        07130000
CLMPRSZ  EQU   *-CLMPREF           Size of this section                C07140000
                                     (internal use only)                07150000
         SPACE 4                                                        07160000
**************************************************************          07170000
*                                                            *          07180000
*        Member General Information Section                  *          07190000
*                                                            *          07200000
*        NOTE: To get here, add the CLMOPRF header field     *          07210000
*              and the prefix size (CLMPRSZ) to the header   *          07220000
*              (CLMHDR) address.                             *          07230000
*                                                            *          07240000
**************************************************************          07250000
CLMGENI  DSECT ,                   Member General Information           07260000
CLMGLN   DC    Y(CLMGENSZ)         Length of this section               07270000
CLMGTY   DC    AL1(CLMIDGEN)       Type     = General Info              07280000
CLMGMD   DC    AL1(CLMIMGEN)       Type Mod = General                   07290000
         SPACE 1                                                        07300000
CLMGMNAM DS    CL8' '              Member name                          07310000
CLMGSNAM DS    CL8' '              MVS System name                      07320000
CLMGFLG1 DS    BL1                 Flag byte                            07330000
CLMG1ENB EQU   B'10000000'           Class is enabled / active         C07340000
                                       on member                        07350000
CLMG1ACT EQU   B'01000000'           Member is active                   07360000
CLMG1PXQ EQU   B'00100000'           Class is on halted member,        C07370000
                                       $PXEQ issued                    C07380000
                                       (JES2 only)                      07390000
CLMG1DRN EQU   B'00010000'           Class is on draining member       C07400000
                                       (JES2 only)                      07410000
CLMG1DEF EQU   B'00001000'           Class is defined on member        C07420000
                                       (JES3 only)                      07430000
         SPACE 1                                                        07440000
         DC    XL3'0'              Reserved for future use              07450000
         SPACE 1                                                        07460000
CLMGJMAX DS    F                   Maximum job count for               C07470000
                                     this class on member              C07480000
                                     (MDEPTH for JES3 if               C07490000
                                      specified)                        07495000
CLMGJCUR DS    F                   Current active job count            C07500000
                                     for this class on member           07510000
         SPACE 1                                                        07520000
CLMGENSZ EQU   *-CLMGENI           Size of this section                C07530000
                                     (internal use only)                07540000
         SPACE 4                                                        07550000
**************************************************************          07560000
*                                                            *          07570000
*        Class Member Information - JES3 specific            *          07580000
*                                                            *          07590000
*        This section includes a variable length array of    *          07600000
*        MLIMIT data for the member being reported.  Each    *          07610000
*        entry in this MLIMIT array defines the number of    *          07620000
*        jobs that can be running on the reported member     *          07630000
*        for a controlling class and still allow jobs in     *          07640000
*        in this class (the "owning" class) to be selected.  *          07650000
*        For example, if we are reporting data for class     *          07660000
*        CLSA (owning class) on member SY1, and the MLIMIT   *          07670000
*        array for SY1 has an entry which says class CLSB    *          07680000
*        has a job count limit of 2 and currently 4 jobs     *          07690000
*        from class CLSB are running on member SY1,          *          07695000
*        then no jobs from class CLSA will be selected       *          07700000
*        to run on this member.                              *          07710000
*                                                            *          07720000
*        Each MLIMIT array entry is mapped by the CLM3MLIM   *          07730000
*        DSECT (see below).                                  *          07740000
*                                                            *          07750000
*        NOTE: To get here, add the CLMGLN field to the      *          07760000
*              General Info section (CLMGENI) address.       *          07770000
*                                                            *          07780000
**************************************************************          07790000
CLMJES3I DSECT ,                   Member JES3 specific                C07800000
                                     information                        07810000
CLM3LN   DC    Y(0)                Length of this section              C07820000
                                     (variable length)                  07830000
CLM3TY   DC    AL1(CLMIDJS3)       Type     = JES3 Info                 07840000
CLM3MD   DC    AL1(CLMIMGEN)       Type Mod = General                   07850000
         SPACE 1                                                        07860000
CLM3SELM DS    CL8' '              Selection mode name                  07870000
CLM3MLOF DC    AL2(CLM3FSZ)        Offset to 1st MLIMIT entry           07930000
CLM3MLCT DC    AL2(0)              MLIMIT entry count                   07940000
CLM3MLSI DC    AL2(CLM3MLSZ)       Size of a MLIMIT entry               07950000
         DC    XL2'00'             Reserved for future use              07960000
         SPACE 1                                                        07970000
CLM3FSZ  EQU   *-CLMJES3I          Section fixed length                C07980000
                                     (internal use only)                07990000
         SPACE 1                                                        08000000
*------------------------------------------------------------*          08010000
*        MLIMIT array entry - JES3 specific                  *          08020000
*------------------------------------------------------------*          08030000
CLM3MLIM DSECT ,                   MLIMIT entry                         08040000
CLM3MCLS DS    CL8' '              Controlling class name               08050000
CLM3MMAX DS    F                   Maximum jobs in controlling         C08060000
                                     class                              08070000
CLM3MCUR DS    F                   Current jobs in controlling         C08080000
                                     class                              08090000
         SPACE 1                                                        08100000
CLM3MLSZ EQU   *-CLM3MLIM          MLIMIT entry length                 C08110000
                                     (internal use only)                08120000
         SPACE 1                                                        08130000
         MEND  ,                                                        08140000
.*                                                                      08150000
**/                                                                     08160000
* % END_OF_ASM_JPCL: ;                                                  08170000
*                                                                       08180000
* %IF JPCLS_ATRB = ''            /* IF NO ATTRIBUTE SPECIFIED        */ 08190000
*   %THEN                                                               08200000
*     %JPCLS_ATRB = 'BASED';     /* ESTABLISH DEFAULT ATTRIBUTE      */ 08210000
*                                                                       08220000
*/*                                                                  */ 08230000
*/* Return codes from SSI 82 are defined in IAZSSJP macro            */ 08240000
*                                                                       08250000
*DECLARE                                                                08300000
*   1 JPCLS   JPCLS_ATRB,                                               08310000
*     3 JPCLID   CHAR(8),           /* I.Eye catcher                 */ 08320000
*     3 JPCLLEN  FIXED(16),         /* I.Length of JPCLS             */ 08330000
*     3 JPCLVER  FIXED(16),         /* I.Parm list version number    */ 08340000
*       5 JPCLVERL FIXED(8),        /*   I.Parm list version level   */ 08350000
*       5 JPCLVERM FIXED(8),        /*   I.Parm list version         */ 08360000
*     3 JPCLVERO FIXED(16),         /* O.Subsystem version number    */ 08370000
*     3 *        FIXED(16),         /* Reserved                      */ 08380000
*     3 JPCLUSER,                   /* USER AREA                     */ 08390000
*/********************************************************************/ 08400000
*/*      JPCLSTRP is an anchor for use by the subsystem              */ 08410000
*/*      that responds to this request.  It is expected that         */ 08420000
*/*      the caller will set this to zero the FIRST time an          */ 08430000
*/*      SSOB extension is used and from that point on it            */ 08440000
*/*      will be managed by the subsystem.                           */ 08450000
*/********************************************************************/ 08460000
*       5 JPCLSTRP PTR(31),         /* Storage management anchor     */ 08470000
*       5 JPCLFLG1 BIT(8),          /* IS.Flag byte                  */ 08480000
*         7 JPCL1CLS BIT(1),        /*    Return data for class         08490000
*                                           name (see JPCLCNAM)      */ 08500000
*         7 JPCL1GRP BIT(1),        /*    Return data for job class     08502000
*                                           group (JPCLGNAM) @Z21LCLS*/ 08505000
*         7 *        BIT(6),        /*    Reserved                   */ 08506000
*       5 *(3)     FIXED(8),        /* Reserved                      */ 08510000
*/********************************************************************/ 08530000
*/*     NOTE: Each filter below is enabled via one of the            */ 08540000
*/*           bit settings above.                                    */ 08550000
*/********************************************************************/ 08560000
*       5 JPCLCNAM CHAR(8),         /* IS*.Class name for filter        08570000
*                                           See JPCL1CLS bit         */ 08580000
*       5 JPCLGNAM CHAR(8),         /* IS*.Class group name as a        08583000
*                                          filter (JPCL1GRP) @Z21LCLS*/ 08586000
*       5 *(18)    FIXED(32),       /* Reserved              @Z21LCLS*/ 08590000
*/********************************************************************/ 08600000
*/*      Begin output-only fields.                                   */ 08610000
*/********************************************************************/ 08620000
*       5 JPCLDPTR PTR(31),         /* O.Pointer to first Class         08630000
*                                        (CLSHDR) data buffer. See      08640000
*                                        output data discussion         08650000
*                                        below for layout.           */ 08660000
*       5 JPCLNCLS FIXED(32),       /* O.Number of Class                08670000
*                                        (CLSHDR) data buffers          08680000
*                                        returned.                   */ 08690000
*       5 *(20)    FIXED(32);       /* Reserved for future use       */ 08700000
*   DCL JPCLSZE  FIXED(16) CONSTANT(LENGTH(JPCLS)); /* Size of JPCLS */ 08710000
*   DCL JPCLSZE1 FIXED(16) CONSTANT(LENGTH(JPCLS)); /* Parameter end-   08720000
*                                      version 1 size.               */ 08730000
*   DCL JPCLV010 FIXED(16) CONSTANT('0100'X); /* Version 1 level     */ 08740000
*   DCL JPCLVER# FIXED(16) CONSTANT('0100'X); /* Latest Version level*/ 08750000
*   DCL JPCLCVRL FIXED(8)  CONSTANT(1); /* Current version level     */ 08760000
*   DCL JPCLCVRM FIXED(8)  CONSTANT(0); /* Current version modifier  */ 08770000
*/*     ID VALUE FOR JPCLID                                          */ 08780000
*   DCL JPCLEYEC CHAR(8)  CONSTANT('JPCLASSD'); /* Class Data ID     */ 08790000
*/********************************************************************/ 08800000
*/*                                                                  */ 08810000
*/*        Storage management fields for use by the subsystem        */ 08820000
*/*        only.  JPCLSTRP is a token used to locate a chain   @Z24BK*/ 08830000
*/*        of these control blocks.  All storage will be       @Z24BK*/ 08840000
*/*        obtained in KEY 1.                                  @Z24BK*/ 08845000
*/*                                                                  */ 08850000
*/********************************************************************/ 08860000
*DECLARE                                                                08870000
*   1 JPCLSTOR  BASED,         /* Storage management block           */ 08880000
*     3 JPCLSTID  CHAR(8),     /* Eyecatcher                         */ 08890000
*     3 JPCLSTHL  FIXED(16),   /* Length of header area              */ 08900000
*     3 *         CHAR(2),     /* Reserved for future use            */ 08910000
*     3 JPCLSTSP  FIXED(8),    /* Subpool of this block              */ 08920000
*     3 JPCLSTTL  FIXED(24),   /* Total length of area (this            08930000
*                                   includes the header              */ 08940000
*     3 JPCLSTNX  PTR(31),     /* Pointer to next area               */ 08950000
*     3 JPCLSTCP  PTR(31),     /* Pointer to first available byte       08960000
*                                   in this area                     */ 08970000
*     3 JPCLSTBG  CHAR(0);      /* Start of data area                */ 08980000
*                                                                       08990000
*   DCL JPCLSTEC CHAR(8)  CONSTANT('JPCLSTOR'); /* Storage management   09000000
*                                                    eyecatcher value*/ 09010000
*   DCL JPCLSTPL FIXED(8) CONSTANT(230); /* Recommended subpool to      09020000
*                                             use                    */ 09030000
*   DCL JPCLSTSZ FIXED(16) CONSTANT(LENGTH(JPCLSTOR)); /* JPCLSTOR      09040000
*                                                           length   */ 09050000
*/********************************************************************/ 09060000
*/*                                                                  */ 09070000
*/*      Class Header                                                */ 09080000
*/*                                                                  */ 09090000
*/*      Information about Job Classes is returned to the            */ 09100000
*/*      issuer of the SSI.                                          */ 09110000
*/*                                                                  */ 09120000
*/*      - There can be multiple Class sections returned.            */ 09130000
*/*        The CLSNXTP pointer is used to navigate to the            */ 09140000
*/*        next Class Header section in the chain.                   */ 09150000
*/*                                                                  */ 09160000
*/*      - To get from this header to the class prefix               */ 09170000
*/*        section for this class, add the CLSOPRF                   */ 09180000
*/*        offset to the class header (CLSHDR) address.              */ 09190000
*/*                                                                  */ 09200000
*/*      - To get from this header to the member chain for           */ 09210000
*/*        this class, follow the CLSFRSTM pointer.  The             */ 09220000
*/*        pointer will be ZERO if no members exist under            */ 09230000
*/*        this class.                                               */ 09240000
*/*                                                                  */ 09250000
*/********************************************************************/ 09260000
*DECLARE                                                                09270000
*   1 CLSHDR BASED,                 /* Class Header                  */ 09280000
*     3 CLSID    CHAR(8),           /* Eye catcher                   */ 09290000
*     3 CLSOPRF  FIXED(16),         /* Offset to prefix section      */ 09300000
*     3 *        FIXED(16),         /* Reserved for future use       */ 09310000
*     3 CLSNXTP  PTR(31),           /* Address of next Class         */ 09320000
*     3 CLSFRSTM PTR(31);           /* Address of first member       */ 09330000
*   DCL CLSEYEC  CHAR(8)  CONSTANT('CLASSHDR'); /* Eye catcher value */ 09340000
*/********************************************************************/ 09360000
*/**                                                                 */ 09370000
*/*      Class Section Identifiers                                   */ 09380000
*/*                                                                  */ 09390000
*/********************************************************************/ 09400000
*   DCL CLSIDPRF FIXED(8) CONSTANT('00'X); /* Class Info - Prefix    */ 09410000
*   DCL CLSIDGEN FIXED(8) CONSTANT('01'X); /* Class Info - General   */ 09420000
*   DCL CLSIDJS2 FIXED(8) CONSTANT('02'X); /* Class Info - JES2      */ 09430000
*   DCL CLSIDJS3 FIXED(8) CONSTANT('03'X); /* Class Info - JES3      */ 09440000
*/********************************************************************/ 09450000
*/*                                                                  */ 09460000
*/*      CLass Section Modifiers                                     */ 09470000
*/*                                                                  */ 09480000
*/********************************************************************/ 09490000
*   DCL CLSIMGEN FIXED(8) CONSTANT('00'X); /* Modifier - General     */ 09500000
*/********************************************************************/ 09510000
*/*                                                                  */ 09520000
*/*      Class Prefix Section                                        */ 09530000
*/*                                                                  */ 09540000
*/*      NOTE: To get here, add the CLSOPRF header field             */ 09550000
*/*            to the header (CLSHDR) address.                       */ 09560000
*/*                                                                  */ 09570000
*/********************************************************************/ 09580000
*DECLARE                                                                09590000
*   1 CLSPREF BASED,                /* Class Prefix                  */ 09600000
*     3 CLSPRLN  FIXED(16),         /* Length of entire Class           09610000
*                                      entry (Max value is 65535)       09620000
*                                      returned - other than hdr.    */ 09630000
*     3 CLSPRTP  FIXED(8),          /* Type     = Prefix   (CLSIDPRF)*/ 09640000
*     3 CLSPRMD  FIXED(8);          /* Type Mod = General  (CLSIMGEN)*/ 09650000
*   DCL CLSPRSZ  FIXED(8) CONSTANT(LENGTH(CLSPREF)); /* Section size */ 09660000
*/********************************************************************/ 09670000
*/*                                                                  */ 09680000
*/*      Class General Information Section                           */ 09690000
*/*                                                                  */ 09700000
*/*      NOTE: To get here, add the CLSOPRF header field             */ 09710000
*/*            and the prefix size (CLSPRSZ) to the header           */ 09720000
*/*            (CLSHDR) address.                                     */ 09730000
*/*                                                                  */ 09740000
*/********************************************************************/ 09750000
*DECLARE                                                                09760000
*   1 CLSGENI BASED,                /* Class General Information     */ 09770000
*     3 CLSGLN   FIXED(16),         /* Length of this section        */ 09780000
*     3 CLSGTY   FIXED(8),          /* Type     = General  (CLSIDGEN)*/ 09790000
*     3 CLSGMD   FIXED(8),          /* Type Mod = General  (CLSIMGEN)*/ 09800000
*     3 CLSGNAME CHAR(8),           /* Class Name                    */ 09810000
*     3 CLSGFLG1 BIT(8),            /* Class Flag 1                  */ 09820000
*       5 CLSG1WLM BIT(1),          /*   Class is in WLM mode        */ 09830000
*       5 CLSG1NAC BIT(1),          /*   Class not enabled   @Z21LCLS*/ 09835000
*       5 *        BIT(1),          /*   Reserved            @Z21LCLS*/ 09840000
*       5 CLSG1JRN BIT(1),          /*   No journal option           */ 09850000
*       5 CLSG1SYM BIT(1),          /*   System symbols in batch        09852000
*                                        jobs is supported   @Z22LSYM*/ 09855000
*       5 CLSG1GST BIT(1),          /*   GDGBIAS default set            09856000
*                                        to STEP             @Z23LGDG*/ 09857000
*       5 *        BIT(2),          /*   Reserved            @Z21LCLS*/ 09858000
*     3 CLSGREST BIT(8),            /* Restart Options               */ 09860000
*       5 *        BIT(4),          /*   Reserved                    */ 09870000
*       5 CLSGRCAN BIT(1),          /*   Print output, then cancel      09880000
*                                        the job (JES3 only)         */ 09890000
*       5 CLSGRHLD BIT(1),          /*   Hold the job (JES3 only)    */ 09900000
*       5 CLSGRPRT BIT(1),          /*   Print output, then hold        09910000
*                                        the job (JES3 only)         */ 09920000
*       5 CLSGRSTR BIT(1),          /*   Allow warmstart to             09930000
*                                        re-queue to Execution Phase */ 09940000
*     3 *        FIXED(8),          /* Reserved for future   @Z23D106*/ 09950000
*     3 CLSGJFLG BIT(8),            /* JESLOG default settings       */ 09980000
*       5 CLSGELIG BIT(1),          /*   Spin eligible               */ 09990000
*       5 CLSGTIMI BIT(1),          /*   Spin on time interval       */ 10000000
*       5 CLSGTIMD BIT(1),          /*   Spin on time of day         */ 10010000
*       5 CLSGLINE BIT(1),          /*   Spin upon line delta        */ 10020000
*       5 CLSGSUP  BIT(1),          /*   Suppress                    */ 10030000
*       5 *        BIT(3),          /*   Reserved            @Z21LCLS*/ 10040000
*     3 CLSGJVAL FIXED(31),         /* Spin value.  Number of           10050000
*                                        seconds if CLSGTIMI.           10060000
*                                        Number of seconds past         10070000
*                                        midnight if CLSGTIMD.          10080000
*                                        Number of lines if             10090000
*                                        CLSGLINE.                   */ 10100000
*/********************************************************************/ 10110000
*/*      NOTE: The following four values (CLSGMAXJ, CLSGCURJ,        */ 10120000
*/*            CLSGQSIZ, and CLSGHELD) are JESplex-wide              */ 10130000
*/*            counts.                                               */ 10140000
*/********************************************************************/ 10150000
*     3 CLSGMAXJ FIXED(32),         /* Max number of concurrently       10160000
*                                        executing jobs of this class   10170000
*                                        (TDEPTH for JES3 if            10180000
*                                         specified)                 */ 10185000
*     3 CLSGCURJ FIXED(32),         /* Current number of concurrently   10190000
*                                        executing jobs of this class*/ 10200000
*     3 CLSGQSIZ FIXED(32),         /* Number of jobs of this class     10210000
*                                        eligible for execution         10220000
*                                        (awaiting job selection)       10230000
*                                        (JES2 only)                 */ 10235000
*     3 CLSGHELD FIXED(32),         /* Number of jobs of this class     10240000
*                                        that are held (JES2            10250000
*                                        only)                       */ 10255000
*     3 CLSGGRP  CHAR(8),           /* Job class group name  @Z21LCLS*/ 10256000
*     3 CLSGDESC CHAR(80),          /* Job class description @Z23LNFY*/ 10258000
*     3 *        CHAR(0);           /* End of structure              */ 10260000
*/********************************************************************/ 10280000
*/*                                                                  */ 10290000
*/*      Class Information - JES2 Specific                           */ 10300000
*/*                                                                  */ 10310000
*/*      NOTE: To get here, add the CLSGLN field to                  */ 10320000
*/*            the Class General Info section (CLSGENI)              */ 10330000
*/*            address.                                              */ 10340000
*/*                                                                  */ 10350000
*/********************************************************************/ 10360000
*DECLARE                                                                10370000
*   1 CLSJES2I BASED,               /* JES2-specific Class Info      */ 10380000
*     3 CLS2LN   FIXED(16),         /* Length of this section        */ 10390000
*     3 CLS2TY   FIXED(8),          /* Type     = JES2     (CLSIDJS2)*/ 10400000
*     3 CLS2MD   FIXED(8),          /* Type Mod = General  (CLSIMGEN)*/ 10410000
*     3 CLS2JBFL BIT(8),            /* Job class flag                */ 10420000
*       5 CLS2BCH  BIT(1),          /*   Batch job                   */ 10430000
*       5 CLS2TSU  BIT(1),          /*   Time sharing user           */ 10440000
*       5 CLS2STC  BIT(1),          /*   Started task                */ 10450000
*       5 *        BIT(1),          /*   Reserved for future use     */ 10460000
*       5 CLS2NOUT BIT(1),          /*   No output option            */ 10470000
*       5 *        BIT(3),          /*   Reserved                    */ 10475000
*     3 CLS2TYPR BIT(8),            /* TYPRUN setting                */ 10480000
*       5 *        BIT(2),          /*   Reserved for future use     */ 10490000
*       5 CLS2HOLD BIT(1),          /*   TYPRUN = HOLD               */ 10500000
*       5 *        BIT(2),          /*   Reserved for future use     */ 10510000
*       5 CLS2SCAN BIT(1),          /*   TYPRUN = SCAN               */ 10520000
*       5 CLS2COPY BIT(1),          /*   TYPRUN = COPY               */ 10530000
*       5 *        BIT(1),          /*   Reserved                    */ 10535000
*     3 CLS2CACT BIT(8),            /* Accounting information        */ 10540000
*       5 *        BIT(5),          /*   Reserved for future use     */ 10550000
*       5 CLS2CSWA BIT(1),          /*   SWA above 16M line          */ 10560000
*       5 CLS2CALL BIT(2),          /*   Account number and             10570000
*                                          programmer name required  */ 10580000
*         7 CLS2CNUM BIT(1),        /*     Account number required   */ 10590000
*         7 CLS2CNAM BIT(1),        /*     Programmer name required  */ 10600000
*     3 CLS2CTIM CHAR(8),           /* Default for job time limit    */ 10610000
*       5 CLS2CMNT CHAR(6),         /*   Maximum minutes             */ 10620000
*       5 CLS2CSEC CHAR(2),         /*   Maximum seconds             */ 10630000
*     3 CLS2CREG CHAR(5),           /* Default for job step region   */ 10640000
*       5 CLS2CRGN CHAR(4),         /*   Numeric specification       */ 10650000
*       5 CLS2CRGA CHAR(1),         /*   Kilobyte or megabyte           10660000
*                                          specification             */ 10670000
*     3 CLS2CMND CHAR(1),           /* Command disposition           */ 10680000
*     3 CLS2CBLP CHAR(1),           /* Bypass label processing       */ 10690000
*       5 *        BIT(7),          /*   Reserved                    */ 10700000
*       5 CLS2CBLY BIT(1),          /*   Process bypass label parm   */ 10710000
*     3 CLS2COCG CHAR(1),           /* Operator command group        */ 10720000
*       5 *        BIT(5),          /*   Reserved                    */ 10730000
*       5 CLS2CGAL BIT(3),          /*   All groups                  */ 10740000
*         7 CLS2CGSY BIT(1),        /*     Group 1 commands (SYS)    */ 10750000
*         7 CLS2CGIO BIT(1),        /*     Group 2 commands (I/O)    */ 10760000
*         7 CLS2CGCO BIT(1),        /*     Group 3 commands (CONS)   */ 10770000
*     3 CLS2CJCL CHAR(1),           /* Default MSGLEVEL, JCL            10780000
*                                        listed if not MSGLEVEL      */ 10790000
*     3 CLS2CMSG CHAR(1),           /* Allocation termination           10800000
*                                        messages value of MSGLEVEL  */ 10810000
*     3 CLS2JOPT BIT(8),            /* Job options flag              */ 10820000
*       5 *        BIT(3),          /*   Reserved                    */ 10830000
*       5 CLS2NLOG BIT(1),          /*   No joblog indicator         */ 10835000
*       5 CLS2XBMI BIT(1),          /*   XBM II job class            */ 10840000
*       5 *        BIT(2),          /*   Reserved                    */ 10850000
*       5 CLS2QHLD BIT(1),          /*   Class queue is held         */ 10860000
*     3 CLS2XBM  CHAR(8),           /* Procedure name for XBM II        10870000
*                                        jobs                        */ 10880000
*     3 CLS2PRCN CHAR(2),           /* Procedure library number      */ 10890000
*     3 CLS2SMF  BIT(8),            /* SMF flags                     */ 10900000
*       5 *        BIT(2),          /*   Reserved                    */ 10910000
*       5 CLS2NUSO BIT(1),          /*   Do not take IEFUSO exit     */ 10920000
*       5 *        BIT(2),          /*   Reserved                    */ 10930000
*       5 CLS2NTY6 BIT(1),          /*   Do not produce Type 6          10940000
*                                          SMF record                */ 10950000
*       5 CLS2NUJP BIT(1),          /*   Do not take IEFUJP exit     */ 10960000
*       5 CLS2NT26 BIT(1),          /*   Do not produce Type 26         10970000
*                                          SMF record                */ 10980000
*     3 CLS2PERF CHAR(3),           /* Default performance group     */ 10990000
*     3 CLS2DMCL CHAR(1),           /* Default msgclass,                11000000
*                                         TSU and STC classes only   */ 11010000
*     3 CLS2FLG1 BIT(8),            /* Normal output disposition        11020000
*                                        for JES data sets           */ 11030000
*       5 CLS21CDP BIT(1),          /*   Conditionally purge output     11040000
*                                          for jobs in this class    */ 11050000
*       5 *        BIT(2),          /*   Reserved                    */ 11060000
*       5 CLS21NOP BIT(1),          /*   NORMAL OUTDISP=PURGE        */ 11070000
*       5 CLS21NOW BIT(1),          /*   NORMAL OUTDISP=WRITE        */ 11080000
*       5 CLS21NOH BIT(1),          /*   NORMAL OUTDISP=HOLD         */ 11090000
*       5 CLS21NOK BIT(1),          /*   NORMAL OUTDISP=KEEP         */ 11100000
*       5 CLS21NOL BIT(1),          /*   NORMAL OUTDISP=LEAVE        */ 11110000
*     3 CLS2FLG2 BIT(8),            /* Abnormal output disposition      11120000
*                                        for JES data sets           */ 11130000
*       5 *        BIT(3),          /*   Reserved                    */ 11140000
*       5 CLS22AOP BIT(1),          /*   ABNORMAL OUTDISP=PURGE      */ 11150000
*       5 CLS22AOW BIT(1),          /*   ABNORMAL OUTDISP=WRITE      */ 11160000
*       5 CLS22AOH BIT(1),          /*   ABNORMAL OUTDISP=HOLD       */ 11170000
*       5 CLS22AOK BIT(1),          /*   ABNORMAL OUTDISP=KEEP       */ 11180000
*       5 CLS22AOL BIT(1),          /*   ABNORMAL OUTDISP=LEAVE      */ 11190000
*     3 CLS2FLG3 BIT(8),            /* Processing flags              */ 11200000
*       5 *        BIT(1),          /*   Reserved                    */ 11210000
*       5 CLS23SPC BIT(1),          /*   Special class (STC/TSU)     */ 11220000
*       5 *        BIT(3),          /*   Reserved                    */ 11230000
*       5 CLS23SNV BIT(1),          /*   Default SCHENV (CLS2SCHE)      11240000
*                                          no longer defined to WLM  */ 11250000
*       5 CLS23DOK BIT(1),          /*   Duplicate job names OK         11260000
*                                          for this job class        */ 11270000
*       5 CLS23LSR BIT(1),          /*   JOBRC=LASTRC specified         11271000
*                                         for this job class @Z13LJBR*/ 11274000
*     3 CLS2SCHE CHAR(16),          /* Default SCHENV                */ 11280000
*     3 CLS2CFL1 BIT(8),            /* Converter parm byte   @Z21LENQ*/ 11281000
*       5 CLS21NQU BIT(1),          /*   DSENQSHR=AUTO       @Z21LENQ*/ 11282000
*       5 CLS21NQA BIT(1),          /*   DSENQSHR=ALLOW      @Z21LENQ*/ 11283000
*                                   /*   Both off is                    11284000
*                                        DSENQSHR=DISALLOW   @Z21LENQ*/ 11285000
*       5 CLS21SYM BIT(1),          /*   SYSSYM=ALLOW System symbol     11285200
*                                        substitution in batch jobs     11285400
*                                        is supported - Deprecated,     11285600
*                                        use CLSG1SYM        @Z22LSYM*/ 11285800
*       5 *        BIT(5),          /*   Reserved            @Z21LSYM*/ 11286000
*     3 CLS2PRRT FIXED(8),          /* Class promotion rate  @Z22LDEP*/ 11288000
*     3 CLS2PROC CHAR(8),           /* PROCLIB name            @Z25DW*/ 11289000
*     3 *        CHAR(0);           /* End of structure              */ 11290000
*   DCL CLS2CRKB CHAR(1) CONSTANT('K'); /* Kilobyte specification    */ 11300000
*   DCL CLS2CRMB CHAR(1) CONSTANT('M'); /* Megabyte specification    */ 11310000
*   DCL CLS2CEXE CHAR(1) CONSTANT('0'); /* Pass the command through  */ 11320000
*   DCL CLS2CDSP CHAR(1) CONSTANT('1'); /* Display and then pass cmd */ 11330000
*   DCL CLS2CVER CHAR(1) CONSTANT('2'); /* Ask operator disposition  */ 11340000
*   DCL CLS2CIGN CHAR(1) CONSTANT('3'); /* Ignore the command        */ 11350000
*/********************************************************************/ 11370000
*/*                                                                  */ 11380000
*/*      Class Information - JES3 Specific                           */ 11390000
*/*                                                                  */ 11400000
*/*      This section includes a variable length array of            */ 11410000
*/*      TLIMIT data for the class being reported.                   */ 11420000
*/*      TLIMIT data is JESplex-wide information.  Each              */ 11430000
*/*      entry in this TLIMIT array defines the number of            */ 11440000
*/*      jobs that can be running in the entire JES3                 */ 11450000
*/*      complex for a controlling class and allow jobs              */ 11460000
*/*      in this class (the "owning" class) to be selected.          */ 11470000
*/*      For example, if we are reporting data for class             */ 11480000
*/*      CLSA (owning class) and the TLIMIT array has an             */ 11490000
*/*      entry which says class CLSB has a job count limit           */ 11500000
*/*      of 3 and 4 jobs for class CLSB are currently                */ 11510000
*/*      running in the complex, then no jobs from class             */ 11520000
*/*      CLSA will be selected to run in the complex.                */ 11530000
*/*                                                                  */ 11540000
*/*      Each TLIMIT array entry is mapped by the CLS3TLIM           */ 11550000
*/*      DSECT (see below).                                          */ 11560000
*/*                                                                  */ 11570000
*/*      NOTE: To get here, add the CLSGLN field to                  */ 11580000
*/*            the Class General Info section (CLSGENI)              */ 11590000
*/*            address.                                              */ 11600000
*/*                                                                  */ 11610000
*/********************************************************************/ 11620000
*DECLARE                                                                11630000
*   1 CLSJES3I BASED,               /* JES3-specific Class Info      */ 11640000
*     3 CLS3LN   FIXED(16),         /* Length of this section -         11650000
*                                        includes variable length       11660000
*                                        TLIMIT information          */ 11670000
*     3 CLS3TY   FIXED(8),          /* Type     = JES3     (CLSIDJS3)*/ 11680000
*     3 CLS3MD   FIXED(8),          /* Type Mod = General  (CLSIMGEN)*/ 11690000
*     3 CLS3GRP  CHAR(8),           /* Job class group name             11700000
*                                      (same as CLSGGRP)     @Z21LCLS*/ 11710000
*     3 CLS3PART CHAR(8),           /* Spool partition name          */ 11720000
*     3 CLS3TRK1 FIXED(15),         /* Primary track group              11730000
*                                        allocation                  */ 11740000
*     3 CLS3TRK2 FIXED(15),         /* Secondary track group            11750000
*                                        allocation                  */ 11760000
*     3 CLS3SDEP FIXED(8),          /* SDEPTH setting                */ 11770000
*     3 CLS3PTY  FIXED(8),          /* JES3 priority                 */ 11780000
*     3 CLS3FLG1 BIT(8),            /* Flag byte                     */ 11782000
*       5 *        BIT(3),          /*   Reserved                    */ 11784000
*       5 CLS31DEF BIT(1),          /*   ON -> Default class         */ 11786000
*       5 *        BIT(4),          /*   Reserved                    */ 11788000
*     3 CLS3JOPT BIT(8),            /* Job option                    */ 11790000
*       5 CLS3NLOG BIT(1),          /*   Suppress JESMSG             */ 11792000
*       5 CLS3LOG  BIT(1),          /*   Log JESMSG                  */ 11795000
*       5 *        BIT(6),          /*   Reserved                    */ 11796000
*     3 CLS3TLOF FIXED(16),         /* Offset to 1st TLIMIT entry    */ 11800000
*     3 CLS3TLCT FIXED(16),         /* TLIMIT entry count            */ 11810000
*     3 CLS3TLSI FIXED(16),         /* Size of a TLIMIT entry        */ 11820000
*     3 *(2)     FIXED(8),          /* Reserved for future use       */ 11830000
*     3 *        CHAR(0);           /* End of structure              */ 11840000
*/********************************************************************/ 11860000
*/*      TLIMIT array entry - JES3 Specific                          */ 11870000
*/********************************************************************/ 11880000
*DECLARE                                                                11890000
*   1 CLS3TLIM BASED,               /* TLIMIT entry                  */ 11900000
*     3 CLS3TCLS CHAR(8),           /* Controlling class name        */ 11910000
*     3 CLS3TMAX FIXED(32),         /* Maximum jobs in controlling      11920000
*                                        class                       */ 11930000
*     3 CLS3TCUR FIXED(32),         /* Current jobs in controlling      11940000
*                                        class                       */ 11950000
*     3 *        CHAR(0);           /* End of structure              */ 11960000
*/********************************************************************/ 11990000
*/*                                                                  */ 12000000
*/*      Class Member Header                                         */ 12010000
*/*                                                                  */ 12020000
*/*      Information about this class and members in the             */ 12030000
*/*      JESplex.                                                    */ 12040000
*/*                                                                  */ 12050000
*/*      - To get here, use the CLSFRSTM pointer in the              */ 12060000
*/*        class header (CLSHDR).                                    */ 12070000
*/*                                                                  */ 12080000
*/*      - There can be multiple members returned.  The              */ 12090000
*/*        CLMNXTM pointer is used to navigate to the                */ 12100000
*/*        next member in the chain.                                 */ 12110000
*/*                                                                  */ 12120000
*/*      - To get from this header to the member prefix              */ 12130000
*/*        section for this member, add the CLMOPRF                  */ 12140000
*/*        offset to the member header (CLMHDR) address.             */ 12150000
*/*                                                                  */ 12160000
*/********************************************************************/ 12170000
*DECLARE                                                                12180000
*   1 CLMHDR BASED,                 /* Member Header                 */ 12190000
*     3 CLMID    CHAR(8),           /* Eye catcher                   */ 12200000
*     3 CLMOPRF  FIXED(16),         /* Offset to member prefix          12210000
*                                        section                     */ 12220000
*     3 *        FIXED(16),         /* Reserved for future use       */ 12230000
*     3 CLMNXTM  PTR(31);           /* Next member header address    */ 12240000
*   DCL CLMEYEC  CHAR(8)  CONSTANT('CLASSMBR'); /* Eye catcher value */ 12250000
*/********************************************************************/ 12270000
*/*                                                                  */ 12280000
*/*      Member Section Identifiers                                  */ 12290000
*/*                                                                  */ 12300000
*/********************************************************************/ 12310000
*   DCL CLMIDPRF FIXED(8) CONSTANT('80'X); /* Member Info - Prefix   */ 12320000
*   DCL CLMIDGEN FIXED(8) CONSTANT('81'X); /* Member Info - General  */ 12330000
*   DCL CLMIDJS2 FIXED(8) CONSTANT('82'X); /* Member Info - JES2     */ 12340000
*   DCL CLMIDJS3 FIXED(8) CONSTANT('83'X); /* Member Info - JES3     */ 12350000
*/********************************************************************/ 12360000
*/*                                                                  */ 12370000
*/*      Member Section Modifiers                                    */ 12380000
*/*                                                                  */ 12390000
*/********************************************************************/ 12400000
*   DCL CLMIMGEN FIXED(8) CONSTANT('80'X); /* Modifier - General     */ 12410000
*   DCL CLMIMJ2A FIXED(8) CONSTANT('82'X); /* Modifier - JES2        */ 12420000
*   DCL CLMIMJ3A FIXED(8) CONSTANT('83'X); /* Modifier - JES3        */ 12430000
*/********************************************************************/ 12440000
*/*                                                                  */ 12450000
*/*      Member Prefix Section                                       */ 12460000
*/*                                                                  */ 12470000
*/*      NOTE: To get here, add the CLMOPRF header field             */ 12480000
*/*            to the header (CLMHDR) address.                       */ 12490000
*/*                                                                  */ 12500000
*/********************************************************************/ 12510000
*DECLARE                                                                12520000
*   1 CLMPREF BASED,                /* Member Prefix                 */ 12530000
*     3 CLMPRLN  FIXED(16),         /* Length of entire Member          12540000
*                                      entry (Max value is 65535)    */ 12550000
*     3 CLMPRTP  FIXED(8),          /* Type     = Prefix   (CLMIDPRF)*/ 12560000
*     3 CLMPRMD  FIXED(8);          /* Type Mod = General  (CLMIMGEN)*/ 12570000
*   DCL CLMPRSZ  FIXED(8) CONSTANT(LENGTH(CLMPREF)); /* Section size */ 12580000
*/********************************************************************/ 12590000
*/*                                                                  */ 12600000
*/*      Member General Information Section                          */ 12610000
*/*                                                                  */ 12620000
*/*      NOTE: To get here, add the CLMOPRF header field             */ 12630000
*/*            and the prefix size (CLMPRSZ) to the header           */ 12640000
*/*            (CLMHDR) address.                                     */ 12650000
*/*                                                                  */ 12660000
*/********************************************************************/ 12670000
*DECLARE                                                                12680000
*   1 CLMGENI  BASED,               /* Member General Information    */ 12690000
*     3 CLMGLN   FIXED(16),         /* Length of this section        */ 12700000
*     3 CLMGTY   FIXED(8),          /* Type     = General  (CLMIDGEN)*/ 12710000
*     3 CLMGMD   FIXED(8),          /* Type Mod = General  (CLMIMGEN)*/ 12720000
*     3 CLMGMNAM CHAR(8),           /* Member name                   */ 12730000
*     3 CLMGSNAM CHAR(8),           /* MVS System name               */ 12740000
*     3 CLMGFLG1 BIT(8),            /* Flag byte                     */ 12750000
*       5 CLMG1ENB BIT(1),          /*   Class is enabled / active      12760000
*                                          on member                 */ 12770000
*       5 CLMG1ACT BIT(1),          /*   Member is active            */ 12780000
*       5 CLMG1PXQ BIT(1),          /*   Class is on halted member,     12790000
*                                          $PXEQ issued                 12800000
*                                          (JES2 only)               */ 12810000
*       5 CLMG1DRN BIT(1),          /*   Class is on draining member    12820000
*                                          (JES2 only)               */ 12830000
*       5 CLMG1DEF BIT(1),          /*   Class is defined on member     12840000
*                                          (JES3 only)               */ 12850000
*       5 *        BIT(3),          /*   Reserved            @Z21LCLS*/ 12855000
*     3 *(3)     FIXED(8),          /* Reserved for future use       */ 12860000
*     3 CLMGJMAX FIXED(32),         /* Maximum job count for            12870000
*                                        this class on member           12880000
*                                        (MDEPTH for JES3 if            12890000
*                                         specified)                 */ 12895000
*     3 CLMGJCUR FIXED(32),         /* Current active job count         12900000
*                                        for this class on member    */ 12910000
*     3 *        CHAR(0);           /* End of structure              */ 12920000
*/********************************************************************/ 12940000
*/*                                                                  */ 12950000
*/*      Class Member Information - JES3 specific                    */ 12960000
*/*                                                                  */ 12970000
*/*      This section includes a variable length array of            */ 12980000
*/*      MLIMIT data for the member being reported.  Each            */ 12990000
*/*      entry in this MLIMIT array defines the number of            */ 13000000
*/*      jobs that can be running on the reported member             */ 13010000
*/*      for a controlling class and still allow jobs in             */ 13020000
*/*      in this class (the "owning" class) to be selected.          */ 13030000
*/*      For example, if we are reporting data for class             */ 13040000
*/*      CLSA (owning class) on member SY1, and the MLIMIT           */ 13045000
*/*      array for SY1 has an entry which says class CLSB            */ 13050000
*/*      has a job count limit of 2 and currently 4 jobs             */ 13060000
*/*      from class CLSB are running on member SY1,                  */ 13070000
*/*      then no jobs from class CLSA will be selected               */ 13080000
*/*      to run on this member.                                      */ 13090000
*/*                                                                  */ 13100000
*/*      Each MLIMIT array entry is mapped by the CLM3MLIM           */ 13110000
*/*      DSECT (see below).                                          */ 13120000
*/*                                                                  */ 13130000
*/*      NOTE: To get here, add the CLMGLN field to the              */ 13140000
*/*            General Info section (CLMGENI) address.               */ 13150000
*/*                                                                  */ 13160000
*/********************************************************************/ 13170000
*DECLARE                                                                13180000
*   1 CLMJES3I BASED,               /* Member JES3 specific info     */ 13190000
*     3 CLM3LN   FIXED(16),         /* Length of this section -         13200000
*                                        includes variable length       13210000
*                                        MLIMIT information          */ 13220000
*     3 CLM3TY   FIXED(8),          /* Type     = JES3     (CLMIDJS3)*/ 13230000
*     3 CLM3MD   FIXED(8),          /* Type Mod = General  (CLMIMGEN)*/ 13240000
*     3 CLM3SELM CHAR(8),           /* Selection mode name           */ 13250000
*     3 CLM3MLOF FIXED(16),         /* Offset to 1st MLIMIT entry    */ 13310000
*     3 CLM3MLCT FIXED(16),         /* MLIMIT entry count            */ 13320000
*     3 CLM3MLSI FIXED(16),         /* Size of a MLIMIT entry        */ 13330000
*     3 *(2)     FIXED(8),          /* Reserved for future use       */ 13340000
*     3 *        CHAR(0);           /* End of structure              */ 13350000
*/********************************************************************/ 13370000
*/*      MLIMIT array entry - JES3 specific                          */ 13380000
*/********************************************************************/ 13390000
*DECLARE                                                                13400000
*   1 CLM3MLIM BASED,               /* MLIMIT entry                  */ 13410000
*     3 CLM3MCLS CHAR(8),           /* Controlling class name        */ 13420000
*     3 CLM3MMAX FIXED(32),         /* Maximum jobs in controlling      13430000
*                                        class                       */ 13440000
*     3 CLM3MCUR FIXED(32),         /* Current jobs in controlling      13450000
*                                        class                       */ 13460000
*     3 *        CHAR(0);           /* End of structure              */ 13470000
* % JPCLSEND: ;                                                         13500000
*/*                          END OF MACRO                            */ 13510000
* @Logic;                                                               13520000
* #PRAGMA TOOL=PADI.                                                    13530000
* #PADIDELETE.JPCLEYEC                                                  13540000
* #PADIDELETE.JPCLSTEC                                                  13550000
* #PADIDELETE.CLSEYEC                                                   13560000
* #PADIDELETE.CLMEYEC                                                   13570000
* #PADIDELETE.CLSHDSZ                                                   13580000
* #PADIDELETE.CLSGNOSP                                                  13590000
* #PADIDELETE.CLSGENSZ                                                  13600000
* #PADIDELETE.CLS2CNON                                                  13610000
* #PADIDELETE.CLS2FSZ                                                   13620000
* #PADIDELETE.CLS3FSZ                                                   13630000
* #PADIDELETE.CLS3TLSZ                                                  13640000
* #PADIDELETE.CLMHDSZ                                                   13650000
* #PADIDELETE.CLMGENSZ                                                  13660000
* #PADIDELETE.CLM3FSZ                                                   13670000
* #PADIDELETE.CLM3MLSZ                                                  13680000
* #EPRAGMA                                                              13690000
* @ENDLOGIC;                                                            99999999
