*        %GOTO NJENDCMT;          /* Bilingual mapping macro            00010000
         MACRO                                                          00020000
         IAZJPNJN                                                       00030000
.*/      %NJENDCMT: ;                                                   00040000
*                                                                       00050000
*/**** START OF SPECIFICATIONS *******************************          00060000
.****PROPRIETARY-STATEMENT************************************          00070000
.*01* PROPRIETARY STATEMENT:                                 *          00080000
.*                                                           *          00090000
.*   LICENSED MATERIALS-PROPERTY OF IBM                      *          00100000
.*   5650-ZOS Copyright IBM Corp. 2009, 2019                 *          00110000
.*                                                           *          00120000
.*   STATUS:  HBB77C0                                        *          00130000
.*                                                           *          00140000
.****END-OF-PROPRIETARY-STATEMENT*****************************          00150000
*                                                            *          00160000
*01* DESCRIPTIVE NAME: Parameters and data structures        *          00170000
*                      returned by NJE node information SSI  *          00180000
*                      (subfunction of SSI 82)               *          00190000
*02*  ACRONYM:  IAZJPNJN                                     *          00200000
*                                                            *          00210000
*01* MACRO NAME:  IAZJPNJN                                   *          00220000
*                                                            *          00230000
*01* DSECT NAME:  See below for DSECT names of individual    *          00240000
*                 data structures                            *          00250000
*01* LABEL PREFIX:  See below for label prefixes of          *          00260000
*                   individual DSECTs                        *          00270000
*                                                            *          00280000
*01* COMPONENT ID:  JES Common (SC141)                       *          00290000
*                                                            *          00300000
*01* EXTERNAL CLASSIFICATION:                                *          00310000
*      GUPI:  base                                           *          00320000
*      DMTI:  fields                                         *          00330000
*             NJNLSTRP NJNSTOR  NJNSEYE  NJNSSTHL            *          00340000
*             NJNSSTSP NJNSSTPL NJNSSTTL NJNSNEXT            *          00350000
*             NJNSAVL  NJNSDATA NJNSSIZE NJNHSIZE            *          00360000
*             NJNCSIZE N2NGSIZE N2NPSIZE N2NPESZE            *          00370000
*             N3NGSIZE N3NPSIZE N3NPESZE NJSHSIZE            *          00380000
*01* END OF EXTERNAL CLASSIFICATION:                         *          00390000
*                                                            *          00400000
*01* EYE-CATCHER:  SSI parameter list - 'SSJPNJNL'           *          00410000
*                  See other DSECTs for the eye-catchers     *          00420000
*                  they use.                                 *          00430000
*02*  OFFSET:      NJNLEYE                                   *          00440000
*02*  LENGTH:      L'NJNLEYE                                 *          00450000
*                                                            *          00460000
*01* STORAGE ATTRIBUTES:                                     *          00470000
*02*  SUBPOOL:  Parameter list - determined by caller        *          00480000
*               Data structures returned by the SSI - 230    *          00490000
*02*  KEY:  Parameter list - determined by caller            *          00500000
*           Data structures returned by the SSI - key 1      *          00510000
*02*  RESIDENCY:                                             *          00520000
*      Virtual - anywhere in 31-bit private storage          *          00530000
*      Real    - anywhere in 64 bit storage                  *          00540000
*                                                            *          00550000
*01* SIZE:                                                   *          00560000
*     See below for sizes of individual DSECTs               *          00570000
*                                                            *          00580000
*01* CREATED BY:                                             *          00590000
*     Parameter list - by SSI caller                         *          00600000
*     Data structures returned by the SSI - by SSI code      *          00610000
*                                                            *          00620000
*01* POINTED TO BY:                                          *          00630000
*                                                            *          00640000
*     SSJPUSER in the SSOB extension for SSI 82              *          00650000
*     (see IAZSSJP macro)                                    *          00660000
*                                                            *          00670000
*01* SERIALIZATION:                                          *          00680000
*                                                            *          00690000
*     None                                                   *          00700000
*                                                            *          00710000
*01* FUNCTION:                                               *          00720000
*                                                            *          00730000
*     This macro provides the mapping of the data structures *          00740000
*     used by NJE node information SSI (subfunction of       *          00750000
*     SSI 82):                                               *          00760000
*      - SSI parameter list                                  *          00770000
*      - data structures returned by the SSI                 *          00780000
*      - storage areas managed by the SSI                    *          00790000
*                                                            *          00800000
*     The SSI returns information about NJE nodes managed    *          00810000
*     by job entry subsystem.                                *          00820000
*     By default, SSI returns information only from the      *          00830000
*     local system (the one where SSI was called).           *          00840000
*     Options are provided to request information from other *          00850000
*     systems in a JESplex (MAS members for JES2).           *          00860000
*     This SSI is supported by JES2 and JES3.                *          00870000
*                                                            *          00880000
*01* METHOD OF ACCESS:                                       *          00890000
*                                                            *          00900000
*02*  ASM:                                                   *          00910000
*      IAZJPNJN macro                                        *          00920000
*                                                            *          00930000
*02*  PL/X:                                                  *          00940000
*      %DCL NJEND_ATRB CHAR                                  *          00950000
*      %NJEND_ATRB = 'value'                                 *          00960000
*      %INCLUDE SYSLIB(IAZJPNJN)                             *          00970000
*                                                            *          00980000
*      where 'value' is a valid variable storage attribute,  *          00990000
*      such as 'BASED(XYZ)'. If %NJEND_ATRB was not set,     *          01000000
*      it defaults to 'BASED'.                               *          01010000
*                                                            *          01020000
*      This applies to parameter list structure only.        *          01030000
*      All other structures are always generated as BASED.   *          01040000
*                                                            *          01050000
*01* USED BY:                                                *          01060000
*                                                            *          01070000
*     Applications which need information about NJE network  *          01080000
*     managed by the job entry subsystem.                    *          01090000
*                                                            *          01100000
*01* DELETED BY:                                             *          01110000
*                                                            *          01120000
*     Parameter list disposition is caller's responsibility. *          01130000
*     To release storage used by the data structures         *          01140000
*     returned by the SSI, caller must call the SSI with     *          01150000
*     subfunction id SSJPNJRS.                               *          01160000
*                                                            *          01170000
*01* FREQUENCY:                                              *          01180000
*                                                            *          01190000
*     Parameter list - one per SSI call                      *          01200000
*     Returned data - a call to SSI will return data for     *          01210000
*     zero or more NJE nodes depending on NJE configuration  *          01220000
*     and selection parameters provided on the call to SSI.  *          01230000
*                                                            *          01240000
*01* RESTRICTIONS: None                                      *          01250000
*                                                            *          01260000
*01* NOTES:                                                  *          01270000
*                                                            *          01280000
*   1.In the description of fields in the parameter list,    *          01290000
*     notation before the field description can be one of    *          01300000
*     the following:                                         *          01310000
*                                                            *          01320000
*     I     Input (application supplies information)         *          01330000
*     IS    Input (used for data selection/filtering)        *          01340000
*     IS*   Same as IS, but field supports wild cards:       *          01350000
*           '*' matches any zero or more characters          *          01360000
*           '?' matches any single character                 *          01370000
*     IO    Inout (SSI both returns information and uses it  *          01380000
*           as input)                                        *          01390000
*     O     Output (system supplies information)             *          01400000
*                                                            *          01410000
*   2.Dependencies:                                          *          01420000
*     PL/X Version = macro variable NJEND_ATRB must be       *          01430000
*     declared and set to valid structure variable           *          01440000
*     attributes before the macro is invoked.                *          01450000
*                                                            *          01460000
****** END OF SPECIFICATIONS ********************************/          01470000
*/********************************************************************/ 01480000
*/*01* CHANGE ACTIVITY:                                              */ 01490000
*/* $Z12LSSI=SDSFAST  HBB7770 090727 ALP:  Misc SSI fixes            */ 01495000
*/*                                                                  */ 01496000
*/* $APILSSF=SDSFAST  HBB7780 100528 ALP:  MAS wide node SSI         */ 01497000
*/* $APNLSSF=SDSFAST  HBB7780 101008 ALP:  Misc SSI updates          */ 01498000
*/*                                                                  */ 01498500
*/* $S202710=CHEADERS HBB77C0 190212 TJW:  Updates for C headers     */ 01499000
*/*                                        S202710                   */ 01499500
*/*                                                                  */ 01500000
*/*01* A000000-999999    Created for z/OS rel 11             @Z11LSDS*/ 01510000
*/********************************************************************/ 01520000
*/*                                                                  */ 01530000
* % GOTO END_OF_ASM_NJND; /*                                            01540000
*                                                                       01550000
         EJECT                                                          01560000
**************************************************************          01570000
*                                                            *          01580000
*        After the call to this SSI, return code is placed   *          01590000
*        in SSOBRETN field in SSOB header.                   *          01600000
*        See IAZSSJP macro for definitions of return codes   *          01610000
*        for subfunctions of SSI 82.                         *          01620000
*                                                            *          01630000
**************************************************************          01640000
         SPACE 1                                                        01650000
**************************************************************          01660000
*                                                            *          01670000
*        For non-zero return codes, additional information   *          01680000
*        about error is provided by a reason code - SSJPRETN *          01690000
*        field in SSOB extension (see IAZSSJP macro).        *          01700000
*        Common reason codes are defined in IAZSSJP macro.   *          01710000
*        Reason codes unique for NJE node SSI are defined    *          01720000
*        below.                                              *          01730000
*                                                            *          01740000
**************************************************************          01750000
         SPACE 1                                                        01760000
NJNDSUBF EQU   256                 Invalid subfunction                  01770000
NJNDSPTE EQU   260                 Invalid NJNLSTRP pointer             01780000
NJNDRNGE EQU   264                 NJNLRNGH < NJNLRNGL                  01790000
NJNDRNGZ EQU   268                 NJNLRNGL is zero                     01800000
NJNDOWNE EQU   272                 Own node filter should not be used  C01810000
                                    with other connection status       C01820000
                                    filters                             01830000
NJNDSTRE EQU   276                 Not enough storage for all data      01840000
NJNDINTE EQU   280                 Internal error building system      C01842000
                                    information data area               01845000
*                                                                       01850000
         EJECT                                                          01860000
**************************************************************          01870000
*                                                            *          01880000
*        The following DSECT defines parameter structure     *          01890000
*        which is passed on the call to NJE node data SSI.   *          01900000
*                                                            *          01910000
**************************************************************          01920000
         SPACE 1                                                        01930000
NJNL     DSECT ,                   NJE node SSI parameter list          01940000
NJNLEYE  DC    CL8'SSJPNJNL'       I.Eye-catcher                        01950000
NJNLLNG  DC    AL2(NJNLSIZE)       I.Length of parameter list           01960000
         SPACE 1                                                        01970000
NJNLVRM  DS    0XL2                I.Parm list ver/mod                  01980000
NJNLVER  DS    X                   I.Parm list version                  01990000
NJNLMOD  DS    X                   I.Parm list modification             02000000
         SPACE 1                   Valid versions:                      02010000
NJNLVER1 EQU   1                    original version                    02020000
NJNLMOD0 EQU   0                    original modification               02030000
NJNLVRM1 EQU   X'0100'              original ver/mod                    02040000
NJNLVRMC EQU   X'0100'              latest   ver/mod                    02050000
         SPACE 1                                                        02060000
NJNLSVRM DS    0XL2                O.Subsystem ver/mod                  02070000
NJNLSVER DS    X                   O.Subsystem version                  02080000
NJNLSMOD DS    X                   O.Subsystem modification             02090000
         SPACE 1                   Supported versions:                  02100000
NJNLSVR1 EQU   1                    original version                    02110000
NJNLSVR2 EQU   2                    version 2                  @Z13LSSI 02115000
NJNLSMD0 EQU   0                    original modification               02120000
NJNLSVM1 EQU   X'0100'              original ver/mod                    02130000
NJNLSVM2 EQU   X'0200'              ver/mod 2                  @Z13LSSI 02135000
NJNLSVMC EQU   X'0200'              latest   ver/mod           @Z13LSSI 02140000
         SPACE 1                                                        02150000
         DS    XL1                 Reserved                             02160000
         SPACE 1                                                        02170000
NJNLOPT1 DS    BL1                 I.Processing options:                02180000
NJNLODMC EQU   B'10000000'           perform security label dominance  C02190000
                                      check (this check is always      C02200000
                                      performed for non-authorized     C02210000
                                      callers)                  (JES2)  02220000
         SPACE 1                                                        02230000
**************************************************************          02240000
*                                                            *          02250000
*        The following fields specify filters which can be   *          02260000
*        used to limit output to a subset of available data. *          02270000
*                                                            *          02280000
*        Implicit OR is performed between filters which      *          02290000
*        apply to the same node attribute. E.g. if both      *          02300000
*        NJNL1SSG and NJNL1CSG are selected, SSI will return *          02310000
*        NJE nodes which are defined with compatible signon  *          02320000
*        in addition to NJE nodes which are defined with     *          02330000
*        a secure signon.                                    *          02340000
*                                                            *          02350000
*        Implicit AND is performed between filters which     *          02360000
*        apply to the different node attributes.             *          02370000
*        E.g. if both NJNL1NAM and NJNL1SNA filters are      *          02380000
*        selected, SSI will return NJE nodes with the names  *          02390000
*        matching NJNLNOD1 field and which are at the same   *          02400000
*        time connected via SNA protocol.                    *          02410000
*                                                            *          02420000
*        If filter is not recognized (e.g. filter added in   *          02430000
*        a future release), or does not apply, it will not   *          02440000
*        have impact on the result of the SSI call.          *          02450000
*        E.g. JES3-only filters will not have impact on SSI  *          02460000
*        output from JES2.                                   *          02470000
*                                                            *          02480000
**************************************************************          02490000
         SPACE 1                                                        02500000
NJNLFLT1 DS    BL1                 IS.Filter by node attributes (1):    02510000
NJNL1NAM EQU   B'10000000'           select by node name               C02520000
                                      (see NJNLNOD1)                    02530000
NJNL1RNG EQU   B'01000000'           select by range of node numbers   C02540000
                                                                (JES2) C02550000
                                      (see NJNLRNGL and NJNLRNGH)       02560000
NJNL1SSG EQU   B'00100000'           select nodes with secure signon    02570000
NJNL1CSG EQU   B'00010000'           select nodes with compatible      C02580000
                                      signon                            02590000
NJNL1NET EQU   B'00001000'           select by subnet name      (JES2) C02600000
                                      (see NJNLSUBN)                    02610000
NJNL1SNA EQU   B'00000100'           select nodes using                C02620000
                                      SNA protocol              (JES3)  02630000
NJNL1BSC EQU   B'00000010'           select nodes using                C02640000
                                      BSC protocol              (JES3)  02650000
NJNL1TCP EQU   B'00000001'           select nodes using                C02660000
                                      TCP protocol              (JES3)  02670000
         SPACE 1                                                        02680000
NJNLFLT2 DS    BL1                 IS.Filter by node attributes (2):    02690000
NJNL2PMY EQU   B'10000000'           select nodes managed              C02700000
                                      by path manager           (JES2)  02710000
NJNL2PMN EQU   B'01000000'           select nodes not managed          C02720000
                                      by path manager           (JES2)  02730000
NJNL2TLS EQU   B'00100000'           select nodes using secure         C02740000
                                      sockets (TLS)             (JES3)  02750000
         SPACE 1                                                        02760000
NJNLFLTC DS    BL1                 IS.Filter by connection status:      02770000
NJNLCOWN EQU   B'10000000'           select only local (own or home)   C02780000
                                      node - this filter should not    C02790000
                                      be used with any other           C02800000
                                      connection filter                 02810000
NJNLCADJ EQU   B'01000000'           select adjacent nodes -           C02820000
                                      adjacent node is one hop away    C02830000
                                      from the local node               02840000
NJNLCDIR EQU   B'00100000'           select directly attached nodes -  C02850000
                                      these are adjacent nodes which   C02860000
                                      use dedicated lines               02870000
NJNLCCNC EQU   B'00010000'           select connected (reachable)      C02880000
                                      nodes - JES is ready to send     C02890000
                                      data to connected nodes           02900000
NJNLCNCN EQU   B'00001000'           select not connected nodes -      C02910000
                                      node is configured but JES       C02920000
                                      is not able to communicate       C02930000
                                      with it                           02940000
NJNLCPDN EQU   B'00000100'           select nodes pending connection    02950000
NJNLCVIA EQU   B'00000010'           select nodes connected via        C02960000
                                      specified adjacent node          C02970000
                                      (see NJNLNOD2)                    02980000
         SPACE 1                                                        02990000
NJNLFLTA DS    BL1                 IS.Filter by node authority: (JES2)  03000000
NJNLADCY EQU   B'10000000'           with    authority to device cmds   03010000
NJNLADCN EQU   B'01000000'           without authority to device cmds   03020000
NJNLAJCY EQU   B'00100000'           with    authority to job    cmds   03030000
NJNLAJCN EQU   B'00010000'           without authority to job    cmds   03040000
NJNLANCY EQU   B'00001000'           with    authority to net    cmds   03050000
NJNLANCN EQU   B'00000100'           without authority to net    cmds   03060000
NJNLASCY EQU   B'00000010'           with    authority to system cmds   03070000
NJNLASCN EQU   B'00000001'           without authority to system cmds   03080000
         SPACE 1                                                        03090000
*************************************************************           03100000
*                                                           *           03110000
*        Filter by the system name or JES2 member name      *           03120000
*        of the system(s) in the JESplex, which should be   *           03130000
*        processed for the data.                            *           03140000
*                                                           *           03150000
*        If none of these filters are specified, SSI will   *           03160000
*        only return data from the system where SSI was     *           03170000
*        called. To request information from other systems  *           03180000
*        (or members) in a JESplex, specify system or       *           03190000
*        member selection filter.                           *           03200000
*                                                           *           03210000
*************************************************************           03220000
         SPACE 1                                                        03230000
NJNLFLTS DS    BL1                 IS.System/member selection:          03240000
NJNLSSYS EQU   B'10000000'           use system selection filter       C03250000
                                      (see NJNLSYSN)            (JES2)  03260000
NJNLSMBR EQU   B'01000000'           use member selection filter       C03270000
                                      (see NJNLMBRN)            (JES2)  03280000
         DS    XL3                 Reserved                             03290000
         SPACE 1                                                        03300000
         DS    0F                  IS.Node number range                C03310000
                                      (used with NJNL1RNG)      (JES2)  03320000
NJNLRNGL DS    F                     node number range low              03330000
NJNLRNGH DS    F                     node number range high             03340000
         SPACE 1                                                        03350000
NJNLNOD1 DS    CL8                 IS*.Node name for selection         C03360000
                                       (used with NJNL1NAM)             03370000
NJNLNOD2 DS    CL8                 IS*.Node name for selection         C03380000
                                       (used with NJNLCVIA)             03390000
NJNLSUBN DS    CL8                 IS*.Subnet name for selection       C03400000
                                       (used with NJNL1NET)     (JES2)  03410000
NJNLSYSN DS    CL8                 IS*.System name for selection       C03420000
                                       (used with NJNLSSYS)     (JES2)  03430000
NJNLMBRN DS    CL8                 IS*.JES2 MAS member name for        C03440000
                                       selection                       C03450000
                                       (used with NJNLSMBR)     (JES2)  03460000
         SPACE 1                                                        03470000
         DS    10F                 Reserved                             03480000
         SPACE 1                                                        03490000
NJNLDPTR DS    A                   O.Ptr to data for first NJE node    C03500000
                                     (see NJNHDR)                       03510000
NJNLMPTR DS    A                   O.Ptr to first system/member data   C03520000
                                     area (see NJSHDR)          (JES2)  03530000
NJNLDNUM DS    F                   O.Number of NJE node data areas     C03540000
                                     in a chain (see NJNLDPTR)          03550000
NJNLMNUM DS    F                   O.Number of system/member data      C03560000
                                      areas in a chain (see NJNLMPTR)   03570000
         SPACE 1                                                        03580000
         CEJECT 16                                                      03590000
**************************************************************          03600000
*                                                            *          03610000
*        NJNLSTRP is an anchor for use by the subsystem that *          03620000
*        responds to this request.                           *          03630000
*        The caller must set this to zero on the first call  *          03640000
*        and after that this field will be managed by        *          03650000
*        subsystem.                                          *          03660000
*                                                            *          03670000
**************************************************************          03680000
         SPACE 1                                                        03690000
NJNLSTRP DS    A                   O.Storage management anchor          03700000
         SPACE 1                                                 @Z23ED 03700200
**************************************************************   @Z23ED 03700900
*                                                            *   @Z23ED 03701600
*        NJE operating constants (output areas)              *   @Z23ED 03702300
*                                                            *   @Z23ED 03703000
**************************************************************   @Z23ED 03703700
         SPACE 1                                                 @Z23ED 03704400
NJNOPTS  DS    B                   O. NJE operating constants    @Z23ED 03705100
NJNOPREC EQU   B'10000000'           PRECHECK active             @Z23ED 03705800
NJNOLOCV EQU   B'01000000'           Local node VFYPATH active   @Z23ED 03706500
NJNOSUBV EQU   B'00100000'           SUBNET verify active        @Z23ED 03707200
         SPACE 1                                                 @Z23ED 03707900
         DS    XL3                 Reserved                      @Z23ED 03708600
         SPACE 1                                                        03710000
         DS    9F                  Reserved                      @Z23ED 03720000
         SPACE 1                                                        03730000
NJNLSZE1 EQU   *-NJNL              Version 1 length                     03740000
NJNLSIZE EQU   *-NJNL              Current version length               03750000
         EJECT                                                          03760000
**************************************************************          03770000
*                                                            *          03780000
*        The following DSECTs define data structures         *          03790000
*        returned by NJE node SSI.                           *          03800000
*                                                            *          03810000
*        After successful call to the SSI, field NJNLDPTR    *          03820000
*        points to a chain of data areas representing data   *          03830000
*        for each NJE node.                                  *          03840000
*        Data area for one NJE node consists of the          *          03850000
*        following contiguous data structures:               *          03860000
*        - Header -                               (NJNHDR  ) *          03870000
*        - Prefix section                         (NJNFPREF) *          03880000
*        - Common section                         (NJNCMN  ) *          03890000
*        - JES-dependent general data section                *          03900000
*        - optional detailed data sections                   *          03910000
*                                                            *          03920000
*        JES2 returns these sections:                        *          03930000
*        - JES2 general data section              (N2NGEN  ) *          03940000
*        - optional JES2 path data section,       (N2NPATH ) *          03950000
*          which contains one or more JES2 path information  *          03960000
*          entries (N2NPTEN)                                 *          03970000
*                                                            *          03980000
*        JES3 returns these sections:                        *          03990000
*        - JES3 general data section              (N3NGEN  ) *          04000000
*        - optional JES3 path data section,       (N3NPATH ) *          04010000
*          which contains one or more JES3 path information  *          04020000
*          entries (N3NPTEN)                                 *          04030000
*                                                            *          04040000
*        In addition, field NJNLMPTR points to a chain of    *          04050000
*        system information data areas. One such data area   *          04060000
*        is returned for each SSI call, provided that at     *          04070000
*        least one system/member matches system and member   *          04080000
*        selection filters. This data area returns basic     *          04090000
*        data about systems (or members) in a JESplex,       *          04100000
*        which were processed to obtain data for this SSI    *          04110000
*        call.                                               *          04120000
*                                                            *          04130000
*        System information data area consists of the        *          04140000
*        following contiguous data structures:               *          04150000
*        - Header                                 (NJSHDR  ) *          04160000
*        - Prefix section       (JPSYSPRF in macro IAZJPLXI) *          04170000
*        - System information section                        *          04180000
*                               (JPSYSINF in macro IAZJPLXI) *          04190000
*                                                            *          04200000
*        Note that repeated calls to the "obtain data"       *          04210000
*        subfunction of this SSI (SSJPNJOD) without          *          04220000
*        intervening call to "release storage" subfunction   *          04230000
*        (SSJPNJRS), will cause data from a new SSI call     *          04240000
*        to be prepended to data from an earlier SSI call.   *          04250000
*                                                            *          04260000
**************************************************************          04270000
         SPACE 1                                                        04280000
**************************************************************          04290000
*                                                            *          04300000
*        Section types and modifiers                         *          04310000
*                                                            *          04320000
**************************************************************          04330000
         SPACE 1                                                        04340000
NJNTYPRF EQU   X'00'               Prefix section                       04350000
NJNTYCMN EQU   X'01'               Common section                       04360000
NJNTYJS2 EQU   X'02'               JES2-specific section                04370000
NJNTYJS3 EQU   X'03'               JES3-specific section                04380000
         SPACE 1                                                        04390000
*************************************************************           04400000
*                                                           *           04410000
*        Modifiers for the JES2 sections (NJNTYJS2)         *           04420000
*                                                           *           04430000
*************************************************************           04440000
         SPACE 1                                                        04450000
NJNMDJ2G EQU   X'01'               JES2 general data section            04460000
NJNMDJ2P EQU   X'02'               JES2 path data section               04470000
         SPACE 1                                                        04480000
*************************************************************           04490000
*                                                           *           04500000
*        Modifiers for the JES3 sections (NJNTYJS3)         *           04510000
*                                                           *           04520000
*************************************************************           04530000
         SPACE 1                                                        04540000
NJNMDJ3G EQU   X'01'               JES3 general data section            04550000
NJNMDJ3P EQU   X'02'               JES3 path data section               04560000
         EJECT                                                          04570000
**************************************************************          04580000
*                                                            *          04590000
*        NJE node data header.                               *          04600000
*        Identifies the data area returned by the SSI and    *          04610000
*        provides for chaining of data for multiple nodes.   *          04620000
*                                                            *          04630000
**************************************************************          04640000
         SPACE 1                                                        04650000
NJNHDR   DSECT ,                   NJE node data header                 04660000
NJNHEYE  DC    CL8'JPNJNODE'       Eye-catcher                          04670000
NJNHOHDR DC    Y(NJNHSIZE)         Offset to first section (prefix)     04680000
         DS    XL2                 Reserved                             04690000
NJNHNEXT DC    A(*-*)              Address of next header               04700000
NJNHJPLX DC    A(*-*)              Address of system information       C04701000
                                     entry for this member     @Z13LSSI 04704000
         SPACE 1                                                        04710000
NJNHSIZE EQU   *-NJNHDR            Header size (internal use only)      04720000
         SPACE 1                                                        04730000
**************************************************************          04740000
*                                                            *          04750000
*        Prefix section.                                     *          04760000
*        Contains total length of data returned for an NJE   *          04770000
*        node.                                               *          04780000
*                                                            *          04790000
**************************************************************          04800000
         SPACE 1                                                        04810000
NJNFPREF DSECT ,                   Prefix section                       04820000
NJNFLNG  DC    AL2(0)              Total length of all                 C04830000
                                    sections for this header (header   C04840000
                                    itself is not included)             04850000
NJNFTYPE DC    AL1(NJNTYPRF)       Section type                         04860000
NJNFMOD  DC    AL1(0)              Section type modifier                04870000
NJNFSIZE EQU   *-NJNFPREF          Prefix section size                  04880000
         SPACE 1                                                        04890000
**************************************************************          04900000
*                                                            *          04910000
*        NJE node common section.                            *          04920000
*        Contains node attributes common for JES2 and JES3.  *          04930000
*                                                            *          04940000
**************************************************************          04950000
         SPACE 1                                                        04960000
NJNCMN   DSECT ,                   NJE node common section              04970000
NJNCLNG  DC    AL2(0)              Length of this section               04980000
NJNCTYPE DC    AL1(NJNTYCMN)       Section type                         04990000
NJNCMOD  DC    AL1(1)              Section type modifier                05000000
         SPACE 1                                                        05010000
NJNCNAME DS    CL8                 Node name                            05020000
NJNCSYSN DS    CL8                 Name of the reporting system         05030000
NJNCMBRN DS    CL8                 MAS member name of the              C05040000
                                    reporting system            (JES2)  05050000
         SPACE 1                                                        05060000
NJNCSFLG DS    BL1                 Node status flags:                   05070000
NJNCSLCL EQU   B'10000000'          local node - also known as own     C05080000
                                     or home node                       05090000
NJNCSCNC EQU   B'01000000'          connected node (at least one path  C05100000
                                     is connected)                      05110000
NJNCSPND EQU   B'00100000'          pending node (at least one path    C05120000
                                     is pending)                        05130000
NJNCSADJ EQU   B'00010000'          adjacent node                       05140000
NJNCSDIR EQU   B'00001000'          directly attached node              05150000
         SPACE 1                                                        05160000
NJNCFLG1 DS    BL1                 Processing flags:                    05170000
NJNC1SPW EQU   B'10000000'          send signon password                05180000
NJNC1VPW EQU   B'01000000'          verify signon password              05185000
NJNC1EPW EQU   B'00100000'          encrypt job password                05190000
NJNC1PWL EQU   B'00010000'          local password check        (JES3)  05200000
NJNC1SSG EQU   B'00001000'          secure sign-on                      05220000
NJNC1CSG EQU   B'00000100'          compatible sign-on                  05230000
         SPACE 1                                                        05240000
NJNCFLG2 DS    BL1                 More processing flags:               05250000
NJNC2TRC EQU   B'10000000'          trace requested                     05260000
NJNC2RST EQU   B'01000000'          autoconnect/restart                 05270000
NJNC2HDJ EQU   B'00100000'          hold received jobs                  05280000
NJNC2HDS EQU   B'00010000'          hold received SYSOUT                05290000
NJNC2VFY EQU   B'00001000'          Verify path set for node     @Z23ED 05295000
         SPACE 1                                                        05300000
         DS    XL1                 Reserved                             05310000
         SPACE 1                                                        05320000
NJNCLINE DS    CL10                Associated line name:               C05330000
                                    dedicated line              (JES2) C05340000
                                    default line                (JES3)  05350000
NJNCRINT DS    H                   Automatic restart (reconnect)       C05360000
                                    interval - minutes                  05370000
NJNCRETR DS    H                   Max number of reconnection retries  C05380000
                                    (0 - indefinite retry)              05390000
NJNCSECL DS    CL8                 Security label               (JES2)  05400000
         DS    XL2                 Reserved                             05410000
         SPACE 1                                                        05420000
NJNCSIZE EQU   *-NJNCMN            NJE node common section size        C05430000
                                    (internal use)                      05440000
         SPACE 1                                                        05450000
**************************************************************          05460000
*                                                            *          05470000
*        NJE node JES2 general data section.                 *          05480000
*        Contains node attributes unique for JES2.           *          05490000
*                                                            *          05500000
**************************************************************          05510000
         SPACE 1                                                        05520000
N2NGEN   DSECT ,                   JES2 general data section            05530000
N2NGLNG  DC    AL2(0)              Length of this section               05540000
N2NGTYPE DC    AL1(NJNTYJS2)       Section type                         05550000
N2NGMOD  DC    AL1(NJNMDJ2G)       Section type modifier                05560000
         SPACE 1                                                        05570000
N2NGNUM  DS    F                   Node number                          05580000
         SPACE 1                                                        05590000
N2NGSFLG DS    BL1                 Node status flags:                   05600000
N2NGSPMD EQU   B'10000000'          path manager is down                05610000
N2NGSNOP EQU   B'01000000'          non path manager mode               05620000
N2NGSEND EQU   B'00100000'          end node (no forwarding)            05630000
N2NGSPRV EQU   B'00010000'          private node                        05640000
N2NGSDIR EQU   B'00001000'          only allow direct connection        05650000
         SPACE 1                                                        05660000
N2NGFLG1 DS    BL1                 Processing flags:                    05670000
N2NG1ADV EQU   B'10000000'          authority to device cmds            05680000
N2NG1AJB EQU   B'01000000'          authority to job    cmds            05690000
N2NG1ANT EQU   B'00100000'          authority to net    cmds            05700000
N2NG1ASY EQU   B'00010000'          authority to system cmds            05710000
N2NG1XMJ EQU   B'00001000'          transmit jobs                       05720000
N2NG1XMS EQU   B'00000100'          transmit sysout                     05730000
N2NG1RCJ EQU   B'00000010'          receive jobs                        05740000
N2NG1RCS EQU   B'00000001'          receive sysout                      05750000
         SPACE 1                                                        05760000
N2NGFLG2 DS    BL1                 More processing flags:               05770000
N2NG2ARS EQU   B'10000000'          accept resistance                   05780000
         SPACE 1                                                        05790000
N2NGCMPT DS    X                   Compaction table id                  05800000
N2NGREST DS    F                   Node resistance                      05810000
N2NGSUBN DS    CL8                 NJE subnet name                      05820000
N2NGLOGM DS    CL8                 VTAM logmode                         05830000
N2NGLOGN DS    CL10                Logon device name                    05840000
N2NGNSVN DS    CL10                NETSRV name                          05850000
         SPACE 1                                                        05860000
N2NGLNID DS    XL3                 Binary device id for NJNCLINE        05861000
N2NGLGID DS    XL3                 Binary device id for N2NGLOGN        05862000
N2NGNSID DS    XL3                 Binary device id for N2NGNSVN        05863000
         DS    XL3                 Reserved                             05864000
         SPACE 1                                                        05865000
N2NGSIZE EQU   *-N2NGEN            JES2 general data section size      C05870000
                                    (internal use)                      05880000
         SPACE 1                                                        05890000
**************************************************************          05900000
*                                                            *          05910000
*        NJE node JES2 path information section.             *          05920000
*        Contains array of JES2 path information entries.    *          05930000
*                                                            *          05940000
**************************************************************          05950000
         SPACE 1                                                        05960000
N2NPATH  DSECT ,                   JES2 path information section        05970000
N2NPLNG  DC    AL2(0)              Length of this section              C05980000
                                    including all path entries          05985000
N2NPTYPE DC    AL1(NJNTYJS2)       Section type                         05990000
N2NPMOD  DC    AL1(NJNMDJ2P)       Section type modifier                06000000
         SPACE 1                                                        06010000
N2NPOENT DC    AL2(N2NPSIZE)       Offset to first entry                06020000
N2NPNENT DC    AL2(0)              Number of entries                    06030000
N2NPSENT DC    AL2(0)              Size of each entry                   06040000
         DS    XL2                 Reserved                             06050000
         SPACE 1                                                        06060000
N2NPSIZE EQU   *-N2NPATH           JES2 path information section size  C06070000
                                    (internal use)                      06080000
         SPACE 1                                                        06090000
**************************************************************          06100000
*                                                            *          06110000
*        JES2 path information entry in JES2 path            *          06120000
*        information section.                                *          06130000
*        Contains NJE path attributes unique for JES2.       *          06140000
*                                                            *          06150000
**************************************************************          06160000
         SPACE 1                                                        06170000
N2NPTEN  DSECT ,                   JES2 path information entry          06180000
         SPACE 1                                                        06190000
N2NPSFLG DS    BL1                 Path status flags:                   06200000
N2NPSVLN EQU   B'10000000'          connected via line                  06210000
N2NPSVMB EQU   B'01000000'          connected via member                06220000
N2NPSAWR EQU   B'00100000'          awaiting reset                      06230000
N2NPSSGN EQU   B'00010000'          signon in progress                  06240000
N2NPSPND EQU   B'00001000'          connection pending                  06250000
         SPACE 1                                                        06260000
         DS    XL1                 Reserved                             06270000
         SPACE 1                                                        06280000
*------------------------------------------------------------*          06290000
*                                                            *          06300000
*        Intermediate node name when path status is:         *          06310000
*        "connected via line" (N2NPSVLN),                    *          06320000
*        "connection pending" (N2NPSPND),                    *          06330000
*        "awaiting reset" (N2NPSAWR)                         *          06340000
*                                                            *          06350000
*------------------------------------------------------------*          06360000
N2NPNAM1 DS    CL8                 Via node name                        06370000
         SPACE 1                                                        06380000
*------------------------------------------------------------*          06390000
*                                                            *          06400000
*        Associated line name if path status is              *          06410000
*         "connected via line" (N2NPSVLN) or                 *          06420000
*         "signon in progress" (N2NPSSGN)                    *          06430000
*                                                            *          06440000
*        Associated member if path status is                 *          06450000
*        "connected via member N2NPSVMB or                   *          06460000
*        "connection pending" (N2NPSPND)                     *          06470000
*                                                            *          06480000
*------------------------------------------------------------*          06490000
N2NPNAM2 DS    CL10                Associated line/member name          06500000
         SPACE 1                                                        06510000
N2NPREST DS    F                   Path resistance                      06520000
         SPACE 1                                                        06530000
N2NPESZE EQU   *-N2NPTEN           JES2 path entry size                C06540000
                                    (internal use)                      06550000
         EJECT                                                          06560000
**************************************************************          06570000
*                                                            *          06580000
*        JES3 general data section.                          *          06590000
*        Contains node attributes unique for JES3.           *          06600000
*                                                            *          06610000
**************************************************************          06620000
         SPACE 1                                                        06630000
N3NGEN   DSECT ,                   JES3 general data section            06640000
N3NGLNG  DC    AL2(0)              Length of this section               06650000
N3NGTYPE DC    AL1(NJNTYJS3)       Section type                         06660000
N3NGMOD  DC    AL1(NJNMDJ3G)       Section type modifier                06670000
         SPACE 1                                                        06680000
N3NGSFLG DS    BL1                 Node connection status:              06690000
N3NGSSNA EQU   B'10000000'          connected via SNA                   06700000
N3NGSBSC EQU   B'01000000'          connected via BSC                   06710000
N3NGSTCP EQU   B'00100000'          connected via TCP                   06720000
N3NGSIND EQU   B'00010000'          indirect node                       06730000
N3NGSALS EQU   B'00001000'          alias of home node                  06740000
N3NGSCTC EQU   B'00000100'          CTC node                            06750000
N3NGSSGS EQU   B'00000010'          send signature                      06760000
N3NGSSGV EQU   B'00000001'          verify signature                    06770000
         SPACE 1                                                        06780000
N3NGFLG1 DS    BL1                 Processing flags:                    06790000
N3NG1DFC EQU   B'10000000'          default class                       06800000
N3NG1XNR EQU   B'01000000'          writer name is required to hold    C06810000
                                     SYSOUT for external writer         06820000
N3NG1NTH EQU   B'00100000'          net hold                            06830000
N3NG1TLS EQU   B'00010000'          secure socket (TLS)                 06840000
         SPACE 1                                                        06850000
N3NGEPR  DS    XL1                 NETPR                                06860000
N3NGEPU  DS    XL1                 NETPU                                06870000
N3NGBUFS DS    AL2                 Buffer size                          06880000
         SPACE 1                                                        06890000
N3NGPRCL DS    CL8                 PRTDEF class                         06900000
N3NGTSCL DS    CL8                 PRTTSO class                         06910000
N3NGXWCL DS    CL8                 PRTXWTR class                        06920000
N3NGPUCL DS    CL8                 PUNDEF class                         06930000
         SPACE 1                                                        06940000
N3NGPART DS    CL8                 Spool partition                      06950000
N3NGBDTI DS    CL8                 Bulk data transfer (BDT) id          06960000
N3NGSTRM DS    XL1                 Stream                               06970000
N3NGMAXL DS    XL1                 Max number of lines                  06975000
N3NGNRJT DS    AL1                 Number of job transmitters           06980000
N3NGNRJR DS    AL1                 Number of job receivers              06990000
N3NGNROT DS    AL1                 Number of output transmitters        07000000
N3NGNROR DS    AL1                 Number of output receivers           07010000
         SPACE 1                                                        07030000
N3NGSIZE EQU   *-N3NGEN            JES3 general data section size      C07040000
                                    (internal use)                      07050000
         SPACE 1                                                        07060000
**************************************************************          07070000
*                                                            *          07080000
*        JES3 path information section                       *          07090000
*        Contains array of JES3 path information entries.    *          07100000
*                                                            *          07110000
**************************************************************          07120000
         SPACE 1                                                        07130000
N3NPATH  DSECT ,                   JES3 path information section        07140000
N3NPLNG  DC    AL2(0)              Length of this section               07150000
N3NPTYPE DC    AL1(NJNTYJS3)       Section type                         07160000
N3NPMOD  DC    AL1(NJNMDJ3P)       Section type modifier                07170000
         SPACE 1                                                        07180000
N3NPOENT DC    AL2(N3NPSIZE)       Offset to first entry                07190000
N3NPNENT DC    AL2(0)              Number of entries                    07200000
N3NPSENT DC    AL2(0)              Size of each entry                   07210000
         DS    XL2                 Reserved                             07220000
         SPACE 1                                                        07230000
N3NPSIZE EQU   *-N3NPATH           JES3 path information section size  C07240000
                                    (internal use)                      07250000
         SPACE 1                                                        07260000
**************************************************************          07270000
*                                                            *          07280000
*        JES3 path information entry in JES3 path            *          07290000
*        information section.                                *          07300000
*        Contains NJE path attributes unique for JES3.       *          07310000
*                                                            *          07320000
**************************************************************          07330000
         SPACE 1                                                        07340000
N3NPTEN  DSECT ,                   JES3 path information entry          07350000
         SPACE 1                                                        07360000
N3NPNNAM DS    CL8                 Node name                            07370000
         SPACE 1                                                        07380000
N3NPESZE EQU   *-N3NPTEN           JES3 path entry size                C07390000
                                    (internal use)                      07400000
         EJECT                                                          07410000
**************************************************************          07420000
*                                                            *          07430000
*        System information data header.                     *          07440000
*        Sections created within this header are mapped by   *          07450000
*        the IAZJPLXI macro.                                 *          07460000
*                                                            *          07470000
**************************************************************          07480000
         SPACE 1                                                        07490000
NJSHDR   DSECT ,                   System information header            07500000
NJSHEYE  DC    CL8'JPNJSYSI'       Eye-catcher                          07510000
NJSHOHDR DC    Y(NJSHSIZE)         Offset to first (prefix) section     07520000
         DS    XL2                 Reserved                             07530000
NJSHNEXT DC    A(*-*)              Address of next header               07540000
         SPACE 1                                                        07550000
NJSHSIZE EQU   *-NJSHDR            Header size (internal use only)      07560000
         EJECT                                                          07570000
**************************************************************          07580000
*                                                            *          07590000
*        Storage management fields for use by the subsystem  *          07600000
*        only.                                               *          07610000
*        NJNLSTRP is a token used to locate a chain of these *   @Z24BK 07620000
*        control blocks.                                     *   @Z24BK 07625000
*        Storage controlled by these control blocks is       *          07630000
*        readable for SSI caller but is protected from       *          07640000
*        modification.                                       *          07650000
*                                                            *          07660000
**************************************************************          07670000
         SPACE 1                                                        07680000
NJNSTOR  DSECT ,                   Storage management header            07690000
NJNSEYE  DC    CL8'NJNDSTOR'       Eye-catcher                          07700000
NJNSSTHL DC    AL2(NJNSSIZE)       Length of header                     07710000
         SPACE 1                                                        07720000
         DS    XL2                 Reserved                             07730000
         SPACE 1                                                        07740000
NJNSSTSP DS    X                   Subpool of this storage block        07750000
NJNSSTPL EQU   230                  Recommended subpool to use          07760000
NJNSSTTL DS    XL3                 Total length of this storage block  C07770000
                                    (including this header)             07780000
NJNSNEXT DS    A                   Pointer to next storage management  C07790000
                                    header                              07800000
NJNSAVL  DS    A                   Pointer to first available byte      07810000
         SPACE 1                                                        07820000
NJNSDATA DS    0A                  Start of data in the block           07830000
NJNSSIZE EQU   *-NJNSTOR                                                07840000
         SPACE 1                                                        07850000
         MEND                                                           07860000
.*                                                                      07870000
**/                                                                     07880000
* % END_OF_ASM_NJND: ;                                                  07890000
*                                                                       07900000
* %IF NJEND_ATRB = ''          /* If no attribute specified          */ 07910000
*   %THEN                                                               07920000
*     %NJEND_ATRB = 'BASED';   /* establish default                  */ 07930000
*                                                                       07940000
*/*                                                                  */ 07950000
*/* Return codes from SSI 82 are defined in IAZSSJP macro            */ 07960000
*                                                                       07970000
*/* Reason codes for non-zero return codes.                          */ 07980000
*/* Reason code is returned in SSJPRETN.                             */ 07990000
* DCL NJNDSUBF FIXED(31) CONSTANT(256); /* Invalid subfunction       */ 08000000
* DCL NJNDSPTE FIXED(31) CONSTANT(260); /* Invalid NJNLSTRP pointer  */ 08010000
* DCL NJNDRNGE FIXED(31) CONSTANT(264); /* NJNLRNGH < NJNLRNGL       */ 08020000
* DCL NJNDRNGZ FIXED(31) CONSTANT(268); /* NJNLRNGL is zero          */ 08030000
* DCL NJNDOWNE FIXED(31) CONSTANT(272); /* Own node filter should       08040000
*                                          not be used with other       08050000
*                                          connection status            08060000
*                                          filters                   */ 08070000
* DCL NJNDSTRE FIXED(31) CONSTANT(276); /* Not enough storage           08080000
*                                          for all data              */ 08090000
* DCL NJNDINTE FIXED(31) CONSTANT(280); /* Internal error building      08092000
*                                          system information data      08094000
*                                          area                      */ 08096000
*                                                                       08100000
*                                                                       08110000
* DCL                                                                   08120000
*   1 NJNL   NJEND_ATRB,                                                08130000
*     3 NJNLEYE  CHAR(8),      /* I.Eyecatcher                       */ 08140000
*     3 NJNLLNG  FIXED(16),    /* I.Length of parameter list         */ 08150000
*     3 NJNLVRM  FIXED(16),    /* I.Parm list ver/mod                */ 08160000
*       5 NJNLVER  FIXED(8),   /* I.Parm list version                */ 08170000
*       5 NJNLMOD  FIXED(8),   /* I.Parm list modification           */ 08180000
*     3 NJNLSVRM FIXED(16),    /* O.Subsystem ver/mod                */ 08190000
*       5 NJNLSVER FIXED(8),   /* O.Subsystem version                */ 08200000
*       5 NJNLSMOD FIXED(8),   /* O.Subsystem modification           */ 08210000
*     3 *        CHAR(1),      /* Reserved                           */ 08220000
*     3 NJNLOPT1 BIT(8),       /* I.Processing options:              */ 08230000
*       5 NJNLODMC BIT(1),     /*   perform security label dominance    08240000
*                                    check (this check is always        08250000
*                                    performed for non-authorized       08260000
*                                    callers)                        */ 08270000
*       5 *        BIT(7),     /*   Reserved                         */ 08275000
*                                                                       08280000
*     3 NJNLFLT1 BIT(8),       /* IS.Filter by node attributes (1):  */ 08290000
*       5 NJNL1NAM BIT(1),     /*   select by node name                 08300000
*                                    (see NJNLNOD1)                  */ 08310000
*       5 NJNL1RNG BIT(1),     /*   select by range of node numbers     08320000
*                                                              (JES2)   08330000
*                                    (see NJNLRNGL and NJNLRNGH)     */ 08340000
*       5 NJNL1SSG BIT(1),     /*   select nodes with secure signon  */ 08350000
*       5 NJNL1CSG BIT(1),     /*   select nodes with compatible        08360000
*                                    signon                          */ 08370000
*       5 NJNL1NET BIT(1),     /*   select by subnet name      (JES2)   08380000
*                                   (see NJNLSUBN)                   */ 08390000
*       5 NJNL1SNA BIT(1),     /*   select nodes using                  08400000
*                                    SNA protocol              (JES3)*/ 08410000
*       5 NJNL1BSC BIT(1),     /*   select nodes using                  08420000
*                                    BSC protocol              (JES3)*/ 08430000
*       5 NJNL1TCP BIT(1),     /*   select nodes using                  08440000
*                                    TCP protocol              (JES3)*/ 08450000
*                                                                       08460000
*     3 NJNLFLT2 BIT(8),       /* IS.Filter by node attributes (2):  */ 08470000
*       5 NJNL2PMY BIT(1),     /*   select nodes managed                08480000
*                                    by path manager           (JES2)*/ 08490000
*       5 NJNL2PMN BIT(1),     /*   select nodes not managed            08500000
*                                    by path manager           (JES2)*/ 08510000
*       5 NJNL2TLS BIT(1),     /*   select nodes using secure           08520000
*                                    sockets (TLS)             (JES3)*/ 08530000
*       5 *        BIT(5),     /*   Reserved                         */ 08535000
*                                                                       08540000
*     3 NJNLFLTC BIT(8),       /* IS.Filter by connection status:    */ 08550000
*       5 NJNLCOWN BIT(1),     /*    select only local (own or home)    08560000
*                                     node - this filter should not     08570000
*                                     be used with any other            08580000
*                                     connection filter              */ 08590000
*       5 NJNLCADJ BIT(1),     /*    select adjacent nodes -            08600000
*                                     adjacent node is one hop away     08610000
*                                     from the local node            */ 08620000
*       5 NJNLCDIR BIT(1),     /*    select directly attached nodes -   08630000
*                                     these are adjacent nodes which    08640000
*                                     use a dedicated line           */ 08650000
*       5 NJNLCCNC BIT(1),     /*    select connected (reachable)       08660000
*                                     nodes - JES is ready to send      08670000
*                                     data to connected nodes        */ 08680000
*       5 NJNLCNCN BIT(1),     /*    select not connected nodes         08690000
*                                     node is configured but JES        08700000
*                                     is not able to communicate        08710000
*                                     with it                  (JES2)*/ 08720000
*       5 NJNLCPDN BIT(1),     /*    select nodes pending connection */ 08730000
*       5 NJNLCVIA BIT(1),     /*    select nodes connected via         08740000
*                                     specified adjacent node           08750000
*                                     (see NJNLNOD2)                 */ 08760000
*       5 *        BIT(1),     /*    Reserved                        */ 08765000
*                                                                       08770000
*     3 NJNLFLTA BIT(8),       /* IS.Filter by node authority        */ 08780000
*       5 NJNLADCY BIT(1),     /*   with    authority to device cmds */ 08790000
*       5 NJNLADCN BIT(1),     /*   without authority to device cmds */ 08800000
*       5 NJNLAJCY BIT(1),     /*   with    authority to job    cmds */ 08810000
*       5 NJNLAJCN BIT(1),     /*   without authority to job    cmds */ 08820000
*       5 NJNLANCY BIT(1),     /*   with    authority to net    cmds */ 08830000
*       5 NJNLANCN BIT(1),     /*   without authority to net    cmds */ 08840000
*       5 NJNLASCY BIT(1),     /*   with    authority to system cmds */ 08850000
*       5 NJNLASCN BIT(1),     /*   without authority to system cmds */ 08860000
*                                                                       08870000
*     3 NJNLFLTS BIT(8),       /* IS.System/member selection:        */ 08880000
*       5 NJNLSSYS BIT(1),     /*   use system selection filter         08890000
*                                    (see NJNLSYSN)                  */ 08900000
*       5 NJNLSMBR BIT(1),     /*   use member selection filter         08910000
*                                    (see NJNLMBRN)            (JES2)*/ 08920000
*       5 *        BIT(6),     /*   Reserved                         */ 08925000
*                                                                       08930000
*     3 *        CHAR(3),      /*  Reserved                          */ 08940000
*                                                                       08950000
*     3 *,                     /* IS.Node number range                  08960000
*                                    (used with NJNL1RNG)      (JES2)*/ 08970000
*       5 NJNLRNGL FIXED(32),  /*   node number range low            */ 08980000
*       5 NJNLRNGH FIXED(32),  /*   node number range high           */ 08990000
*                                                                       09000000
*     3 NJNLNOD1 CHAR(8),      /* IS*.Node name for selection           09010000
*                                     (used with NJNL1NAM)           */ 09020000
*                                                                       09030000
*     3 NJNLNOD2 CHAR(8),      /* IS*.Node name for selection           09040000
*                                     (used with NJNLCVIA)           */ 09050000
*     3 NJNLSUBN CHAR(8),      /* IS*.Subnet name for selection         09060000
*                                     (used with NJNL1NET)           */ 09070000
*     3 NJNLSYSN CHAR(8),      /* IS*.System name for selection         09080000
*                                     (used with NJNLSSYS)           */ 09090000
*     3 NJNLMBRN CHAR(8),      /* IS*.JES2 MAS member name for          09100000
*                                     selection                         09110000
*                                     (used with NJNLSMBR)    (JES2) */ 09120000
*                                                                       09130000
*     3 *(10) FIXED(31),       /* Reserved                           */ 09140000
*                                                                       09150000
*     3 NJNLDPTR PTR(31),      /* IO.Ptr to data for first NJE node     09160000
*                                    (see NJNHDR)                    */ 09170000
*     3 NJNLMPTR PTR(31),      /* IO.Ptr to system/member data          09180000
*                                    (see NJSHDR)                    */ 09190000
*     3 NJNLDNUM FIXED(31),    /* IO.Number of NJE nodes returned       09200000
*                                    in a chain (see NJNLDPTR)       */ 09210000
*     3 NJNLMNUM FIXED(31),    /* IO.Number of system/member data       09220000
*                                    areas in a chain (see NJNLMPTR) */ 09230000
*                                                                       09240000
*     3 NJNLSTRP PTR(31),      /* IO.Storage management anchor       */ 09250000
*                                                                       09260000
*     3 NJNOPTS  BIT(8),       /* O. NJE operating constants   @Z23ED*/ 09262000
*       5 NJNOPREC BIT(1),     /*  PRECHECK active             @Z23ED*/ 09264000
*       5 NJNOLOCV BIT(1),     /*  Local node VFYPATH active   @Z23ED*/ 09266000
*       5 NJNOSUBV BIT(1),     /*  SUBNET verify active        @Z23ED*/ 09268000
*       5 *        BIT(5),     /*  Reserved                          */ 09269000
*                                                                       09270000
*     3 *     CHAR(3),         /* Reserved                     @Z23ED*/ 09272000
*                                                                       09274000
*     3 *(9)  FIXED(31),       /* Reserved                     @Z23ED*/ 09276000
*                                                                       09280000
*     3 *        CHAR(0);      /* End of structure                   */ 09290000
*                                                                       09300000
*/* Eye-catcher in NJNLEYE                                           */ 09310000
* DCL NJNLEYEC CHAR(8) CONSTANT('SSJPNJNL');                            09320000
*/* Length of parameter list structure for NJNLLNG                   */ 09330000
* DCL NJNLSIZE FIXED(16) CONSTANT(LENGTH(NJNL));                        09340000
*                                                                       09350000
*/* Valid version/modifications in NJNLVRM                           */ 09360000
* DCL NJNLVER1 FIXED(8)  CONSTANT(1); /* original version            */ 09370000
* DCL NJNLMOD0 FIXED(8)  CONSTANT(0); /* original modification       */ 09380000
* DCL NJNLVRM1 FIXED(16) CONSTANT('0100'X); /* original ver/mod      */ 09390000
* DCL NJNLVRMC FIXED(16) CONSTANT('0100'X); /* latest   ver/mod      */ 09400000
*                                                                       09410000
*/* Valid version/modifications in NJNLSVRM                          */ 09420000
* DCL NJNLSVR1 FIXED(8)  CONSTANT(1); /* original version            */ 09430000
* DCL NJNLSVR2 FIXED(8)  CONSTANT(2); /* version 2           @Z13LSSI*/ 09435000
* DCL NJNLSMD0 FIXED(8)  CONSTANT(0); /* original modification       */ 09440000
* DCL NJNLSVM1 FIXED(16) CONSTANT('0100'X); /* original ver/mod      */ 09450000
* DCL NJNLSVM2 FIXED(16) CONSTANT('0200'X); /* ver/mod 2     @Z13LSSI*/ 09455000
* DCL NJNLSVMC FIXED(16) CONSTANT('0200'X); /* latest   ver/mod      */ 09460000
*                                                                       09470000
*                                                                       09480000
*/********************************************************************/ 09490000
*/*                                                                  */ 09500000
*/* Section types and modifiers                                      */ 09510000
*/*                                                                  */ 09520000
*/********************************************************************/ 09530000
*                                                                       09540000
* DCL NJNTYPRF FIXED(8) CONSTANT('00'X); /* Prefix section           */ 09550000
* DCL NJNTYCMN FIXED(8) CONSTANT('01'X); /* Common section           */ 09560000
* DCL NJNTYJS2 FIXED(8) CONSTANT('02'X); /* JES2-specific section    */ 09570000
* DCL NJNTYJS3 FIXED(8) CONSTANT('03'X); /* JES3-specific section    */ 09580000
*                                                                       09590000
* DCL NJNMDJ2G FIXED(8) CONSTANT('01'X); /* JES2 general data section*/ 09600000
* DCL NJNMDJ2P FIXED(8) CONSTANT('02'X); /* JES2 path data section   */ 09610000
*                                                                       09620000
* DCL NJNMDJ3G FIXED(8) CONSTANT('01'X); /* JES3 general data section*/ 09630000
* DCL NJNMDJ3P FIXED(8) CONSTANT('02'X); /* JES3 path data section   */ 09640000
*                                                                       09650000
*                                                                       09660000
* DCL                                                                   09670000
*   1 NJNHDR   BASED,          /* NJE node data header               */ 09680000
*     3 NJNHEYE  CHAR(8),      /* Eye-catcher                        */ 09690000
*     3 NJNHOHDR FIXED(16),    /* Offset to first section (prefix)   */ 09700000
*     3 *        CHAR(2),      /* Reserved                           */ 09710000
*     3 NJNHNEXT PTR(31),      /* Address of next header             */ 09720000
*     3 NJNHJPLX PTR(31),      /* Address of system information         09723000
*                                   entry for this member    @Z13LSSI*/ 09726000
*                                                                       09730000
*     3 *        CHAR(0);      /* End of structure                   */ 09740000
*                                                                       09750000
*/* Eye-catcher in NJNHEYE                                           */ 09760000
* DCL NJNHEYEC CHAR(8) CONSTANT('JPNJNODE');                            09770000
*                                                                       09780000
*                                                                       09790000
* DCL                                                                   09800000
*   1 NJNFPREF BASED,          /* Prefix section                     */ 09810000
*     3 NJNFLNG  FIXED(16),    /* Total length of all                   09820000
*                                  sections for this header (header     09830000
*                                  itself is not included)           */ 09840000
*     3 NJNFTYPE FIXED(8),     /* Section type                       */ 09850000
*     3 NJNFMOD  FIXED(8),     /* Section type modifier              */ 09860000
*     3 *        CHAR(0);      /* End of structure                   */ 09870000
*                                                                       09880000
*/* Length of the prefix section                                     */ 09890000
* DCL NJNFSIZE FIXED(16) CONSTANT(LENGTH(NJNFPREF));                    09900000
*                                                                       09910000
*                                                                       09920000
* DCL                                                                   09930000
*   1 NJNCMN   BASED,          /* NJE node common section            */ 09940000
*     3 NJNCLNG  FIXED(16),    /* Length of this section             */ 09950000
*     3 NJNCTYPE FIXED(8),     /* Section type                       */ 09960000
*     3 NJNCMOD  FIXED(8),     /* Section type modifier              */ 09970000
*                                                                       09980000
*     3 NJNCNAME CHAR(8),      /* Node name                          */ 09990000
*     3 NJNCSYSN CHAR(8),      /* Name of the reporting system       */ 10000000
*     3 NJNCMBRN CHAR(8),      /* MAS member name of the                10010000
*                                  reporting system            (JES2)*/ 10020000
*                                                                       10030000
*     3 NJNCSFLG BIT(8),       /* Node status flags:                 */ 10040000
*       5 NJNCSLCL BIT(1),     /*  local (own or home) node          */ 10050000
*       5 NJNCSCNC BIT(1),     /*  connected node (at least one path    10060000
*                                   is connected)                    */ 10070000
*       5 NJNCSPND BIT(1),     /*  pending node (at least one path      10080000
*                                   is pending)                      */ 10090000
*       5 NJNCSADJ BIT(1),     /*  adjacent node                     */ 10100000
*       5 NJNCSDIR BIT(1),     /*  directly attached node            */ 10110000
*       5 *        BIT(3),     /*  Reserved                          */ 10115000
*                                                                       10120000
*     3 NJNCFLG1 BIT(8),       /* Processing flags:                  */ 10130000
*       5 NJNC1SPW BIT(1),     /*  send signon password              */ 10140000
*       5 NJNC1VPW BIT(1),     /*  verify signon password            */ 10145000
*       5 NJNC1EPW BIT(1),     /*  encrypt job password              */ 10150000
*       5 NJNC1PWL BIT(1),     /*  local password check        (JES3)*/ 10160000
*       5 NJNC1SSG BIT(1),     /*  secure sign-on                    */ 10180000
*       5 NJNC1CSG BIT(1),     /*  compatible sign-on                */ 10190000
*       5 *        BIT(2),     /*  Reserved                          */ 10195000
*                                                                       10200000
*     3 NJNCFLG2 BIT(8),       /* More processing flags:             */ 10210000
*       5 NJNC2TRC BIT(1),     /*  trace requested                   */ 10220000
*       5 NJNC2RST BIT(1),     /*  autoconnect/restart               */ 10230000
*       5 NJNC2HDJ BIT(1),     /*  hold received jobs                */ 10240000
*       5 NJNC2HDS BIT(1),     /*  hold received SYSOUT        (JES2)*/ 10250000
*       5 NJNC2VFY BIT(1),     /*  Verify path set for node    @Z23ED*/ 10255000
*       5 *        BIT(3),     /*  Reserved                          */ 10256000
*                                                                       10260000
*     3 *        CHAR(1),      /* Reserved                           */ 10270000
*                                                                       10280000
*     3 NJNCLINE CHAR(10),     /* Associated line name                  10290000
*                                  dedicated line              (JES2)   10300000
*                                  default line                (JES3)*/ 10310000
*     3 NJNCRINT FIXED(15),    /* Automatic restart (reconnect)         10320000
*                                  interval - minutes                */ 10330000
*     3 NJNCRETR FIXED(15),    /* Max number of reconnection retries    10340000
*                                  (0 - indefinite retry)            */ 10350000
*     3 NJNCSECL CHAR(8),      /* Security label                     */ 10360000
*     3 *        CHAR(2),      /* Reserved                           */ 10370000
*     3 *        CHAR(0);      /* End of structure                   */ 10380000
*                                                                       10390000
*                                                                       10400000
* DCL                                                                   10410000
*   1 N2NGEN   BASED,          /* JES2 general data section          */ 10420000
*     3 N2NGLNG  FIXED(16),    /* Length of this section             */ 10430000
*     3 N2NGTYPE FIXED(8),     /* Section type                       */ 10440000
*     3 N2NGMOD  FIXED(8),     /* Section type modifier              */ 10450000
*                                                                       10460000
*     3 N2NGNUM  FIXED(31),    /* Node number                        */ 10470000
*                                                                       10480000
*     3 N2NGSFLG BIT(8),       /* Node status flags:                 */ 10490000
*       5 N2NGSPMD BIT(1),     /*  path manager is down              */ 10500000
*       5 N2NGSNOP BIT(1),     /*  non path manager mode             */ 10510000
*       5 N2NGSEND BIT(1),     /*  end node (no forwarding)          */ 10520000
*       5 N2NGSPRV BIT(1),     /*  private node                      */ 10530000
*       5 N2NGSDIR BIT(1),     /*  only allow direct connection      */ 10540000
*       5 *        BIT(3),     /*  Reserved                          */ 10545000
*                                                                       10550000
*     3 N2NGFLG1 BIT(8),       /* Processing flags                   */ 10560000
*       5 N2NG1ADV BIT(1),     /*  authority to device cmds          */ 10570000
*       5 N2NG1AJB BIT(1),     /*  authority to job    cmds          */ 10580000
*       5 N2NG1ANT BIT(1),     /*  authority to net    cmds          */ 10590000
*       5 N2NG1ASY BIT(1),     /*  authority to system cmds          */ 10600000
*       5 N2NG1XMJ BIT(1),     /*  transmit jobs                     */ 10610000
*       5 N2NG1XMS BIT(1),     /*  transmit sysout                   */ 10620000
*       5 N2NG1RCJ BIT(1),     /*  receive jobs                      */ 10630000
*       5 N2NG1RCS BIT(1),     /*  receive sysout                    */ 10640000
*                                                                       10650000
*     3 N2NGFLG2 BIT(8),       /* More processing flags:             */ 10660000
*       5 N2NG2ARS BIT(1),     /*  accept resistance                 */ 10670000
*       5 *        BIT(7),     /*  Reserved                          */ 10675000
*                                                                       10680000
*     3 N2NGCMPT FIXED(8),     /* Compaction table id                */ 10690000
*     3 N2NGREST FIXED(31),    /* Node resistance                    */ 10700000
*     3 N2NGSUBN CHAR(8),      /* NJE subnet name                    */ 10710000
*     3 N2NGLOGM CHAR(8),      /* VTAM logmode                       */ 10720000
*     3 N2NGLOGN CHAR(10),     /* Logon device name                  */ 10730000
*     3 N2NGNSVN CHAR(10),     /* NETSRV name                        */ 10740000
*     3 N2NGLNID CHAR(3),      /* Binary device id for NJNCLINE      */ 10742000
*     3 N2NGLGID CHAR(3),      /* Binary device id for N2NGLOGN      */ 10744000
*     3 N2NGNSID CHAR(3),      /* Binary device id for N2NGNSVN      */ 10746000
*     3 *        CHAR(3),      /* Reserved                           */ 10748000
*                                                                       10750000
*     3 *        CHAR(0);      /* End of structure                   */ 10760000
*                                                                       10770000
*                                                                       10780000
* DCL                                                                   10790000
*   1 N2NPATH  BASED,          /* JES2 path information section      */ 10800000
*     3 N2NPLNG  FIXED(16),    /* Length of this section,               10810000
*                                  including all path entries        */ 10815000
*     3 N2NPTYPE FIXED(8),     /* Section type                       */ 10820000
*     3 N2NPMOD  FIXED(8),     /* Section type modifier              */ 10830000
*                                                                       10840000
*     3 N2NPOENT FIXED(16),    /* Offset to first entry              */ 10850000
*     3 N2NPNENT FIXED(15),    /* Number of entries                  */ 10860000
*     3 N2NPSENT FIXED(16),    /* Size of each entry                 */ 10870000
*     3 *        CHAR(2),      /* Reserved                           */ 10880000
*                                                                       10890000
*     3 *        CHAR(0);      /* End of structure                   */ 10900000
*                                                                       10910000
*                                                                       10920000
* DCL                                                                   10930000
*   1 N2NPTEN  BASED,          /* Info for one JES2 path             */ 10940000
*                                                                       10950000
*     3 N2NPSFLG BIT(8),       /* Path status flags                  */ 10960000
*       5 N2NPSVLN BIT(1),     /*  connected via line                */ 10970000
*       5 N2NPSVMB BIT(1),     /*  connected via member              */ 10980000
*       5 N2NPSAWR BIT(1),     /*  awaiting reset                    */ 10990000
*       5 N2NPSSGN BIT(1),     /*  signon in progress                */ 11000000
*       5 N2NPSPND BIT(1),     /*  connection pending                */ 11010000
*       5 *        BIT(3),     /*  Reserved                          */ 11015000
*                                                                       11020000
*     3 *        CHAR(1),      /* Reserved                           */ 11030000
*                                                                       11040000
*     3 N2NPNAM1 CHAR(8),      /* Intermediate node name             */ 11050000
*                                                                       11060000
*     3 N2NPNAM2 CHAR(10),     /* Associated line/member name        */ 11070000
*                                                                       11080000
*     3 N2NPREST FIXED(31),    /* Path resistance                    */ 11090000
*                                                                       11100000
*     3 *        CHAR(0);      /* End of structure                   */ 11110000
*                                                                       11120000
*                                                                       11130000
* DCL                                                                   11140000
*   1 N3NGEN   BASED,          /* JES3 general data section          */ 11150000
*     3 N3NGLNG  FIXED(16),    /* Length of this section             */ 11160000
*     3 N3NGTYPE FIXED(8),     /* Section type                       */ 11170000
*     3 N3NGMOD  FIXED(8),     /* Section type modifier              */ 11180000
*                                                                       11190000
*     3 N3NGSFLG BIT(8),       /* Node connection status:            */ 11200000
*       5 N3NGSSNA BIT(1),     /*  connected via SNA                 */ 11210000
*       5 N3NGSBSC BIT(1),     /*  connected via BSC                 */ 11220000
*       5 N3NGSTCP BIT(1),     /*  connected via TCP                 */ 11230000
*       5 N3NGSIND BIT(1),     /*  indirect node                     */ 11240000
*       5 N3NGSALS BIT(1),     /*  alias of home node                */ 11250000
*       5 N3NGSCTC BIT(1),     /*  CTC node                          */ 11260000
*       5 N3NGSSGS BIT(1),     /*  send signature                    */ 11270000
*       5 N3NGSSGV BIT(1),     /*  verify signature                  */ 11280000
*                                                                       11290000
*     3 N3NGFLG1 BIT(8),       /* Processing flags:                  */ 11300000
*       5 N3NG1DFC BIT(1),     /*  default class                     */ 11310000
*       5 N3NG1XNR BIT(1),     /*  writer name is required to hold      11320000
*                                  SYSOUT for external writer        */ 11330000
*       5 N3NG1NTH BIT(1),     /*  net hold                          */ 11340000
*       5 N3NG1TLS BIT(1),     /*  secure socket (TLS)               */ 11350000
*       5 *        BIT(4),     /*  Reserved                          */ 11355000
*                                                                       11360000
*     3 N3NGEPR  FIXED(8),     /* NETPR                              */ 11370000
*     3 N3NGEPU  FIXED(8),     /* NETPU                              */ 11380000
*     3 N3NGBUFS FIXED(16),    /* Buffer size                        */ 11390000
*                                                                       11400000
*     3 N3NGPRCL CHAR(8),      /* PRTDEF class                       */ 11410000
*     3 N3NGTSCL CHAR(8),      /* PRTTSO class                       */ 11420000
*     3 N3NGXWCL CHAR(8),      /* PRTXWTR class                      */ 11430000
*     3 N3NGPUCL CHAR(8),      /* PUNDEF class                       */ 11440000
*                                                                       11450000
*     3 N3NGPART CHAR(8),      /* Spool partition                    */ 11460000
*     3 N3NGBDTI CHAR(8),      /* Bulk data transfer (BDT) id        */ 11470000
*     3 N3NGSTRM FIXED(8),     /* Stream                             */ 11480000
*     3 N3NGMAXL FIXED(8),     /* Max number of lines                */ 11485000
*     3 N3NGNRJT FIXED(8),     /* Number of job transmitters         */ 11490000
*     3 N3NGNRJR FIXED(8),     /* Number of job receivers            */ 11500000
*     3 N3NGNROT FIXED(8),     /* Number of output transmitters      */ 11510000
*     3 N3NGNROR FIXED(8),     /* Number of output receivers         */ 11520000
*                                                                       11540000
*     3 *        CHAR(0);      /* End of structure                   */ 11550000
*                                                                       11560000
*                                                                       11570000
* DCL                                                                   11580000
*   1 N3NPATH  BASED,          /* JES3 path information section      */ 11590000
*     3 N3NPLNG  FIXED(16),    /* Length of this section             */ 11600000
*     3 N3NPTYPE FIXED(8),     /* Section type                       */ 11610000
*     3 N3NPMOD  FIXED(8),     /* Section type modifier              */ 11620000
*                                                                       11630000
*     3 N3NPOENT FIXED(16),    /* Offset to first entry              */ 11640000
*     3 N3NPNENT FIXED(16),    /* Number of entries                  */ 11650000
*     3 N3NPSENT FIXED(16),    /* Size of each entry                 */ 11660000
*     3 *        CHAR(2),      /* Reserved                           */ 11670000
*     3 *        CHAR(0);      /* End of structure                   */ 11680000
*                                                                       11690000
*                                                                       11700000
* DCL                                                                   11710000
*   1 N3NPTEN  BASED,          /* JES3 path information entry        */ 11720000
*                                                                       11730000
*     3 N3NPNNAM CHAR(8),      /* Node name                          */ 11740000
*     3 *        CHAR(0);      /* End of structure                   */ 11750000
*                                                                       11760000
*                                                                       11770000
* DCL                                                                   11780000
*   1 NJSHDR   BASED,          /* System information header          */ 11790000
*                                                                       11800000
*     3 NJSHEYE  CHAR(8),      /* Eye-catcher                        */ 11810000
*     3 NJSHOHDR FIXED(16),    /* Offset to first (prefix) section   */ 11820000
*     3 *        CHAR(2),      /* Reserved                           */ 11830000
*     3 NJSHNEXT PTR(31),      /* Address of next header             */ 11840000
*     3 *        CHAR(0);      /* End of structure                   */ 11850000
*                                                                       11860000
*/* Eye-catcher in NJSHEYE                                           */ 11870000
* DCL NJSHEYEC CHAR(8) CONSTANT('JPNJSYSI');                            11880000
*                                                                       11890000
*                                                                       11900000
* DCL                                                                   11910000
*   1 NJNSTOR  BASED,          /* Storage management block           */ 11920000
*     3 NJNSEYE  CHAR(8),      /* Eye-catcher                        */ 11930000
*     3 NJNSSTHL FIXED(16),    /* Length of header                   */ 11940000
*     3 *        CHAR(2),      /* Reserved                           */ 11950000
*                                                                       11960000
*     3 NJNSSTSP FIXED(8),     /* Subpool of this block              */ 11970000
*     3 NJNSSTTL FIXED(24),    /* Total length of this block            11980000
*                                   (including this header)          */ 11990000
*     3 NJNSNEXT PTR(31),      /* Pointer to next storage management    12000000
*                                  header                            */ 12010000
*     3 NJNSAVL  PTR(31),      /* Pointer to first available byte    */ 12020000
*                                                                       12030000
*     3 NJNSDATA CHAR(0);      /* Start of data in the block         */ 12040000
*                                                                       12050000
*/* Eye-catcher in NJNSEYE                                           */ 12060000
* DCL NJNSEYEC CHAR(8) CONSTANT('NJNDSTOR');                            12070000
*                                                                       12080000
*/* Recommended subpool to use - see NJNSSTSP                        */ 12090000
* DCL NJNSSTPL FIXED(8) CONSTANT(230);                                  12100000
*                                                                       12110000
* % NJENDEND: ;                                                         12120000
*/*                          end of macro                            */ 12130000
* @Logic;                                                               12140000
* #PRAGMA TOOL=PADI.                                                    12150000
* #PADIDELETE.NJNLEYEC                                                  12160000
* #PADIDELETE.NJNHEYEC                                                  12170000
* #PADIDELETE.NJSHEYEC                                                  12180000
* #PADIDELETE.NJNSEYEC                                                  12190000
* #PADIDELETE.NJNLSZE1                                                  12200000
* #PADIDELETE.NJNHSIZE                                                  12210000
* #PADIDELETE.NJNCSIZE                                                  12220000
* #PADIDELETE.N2NGSIZE                                                  12230000
* #PADIDELETE.N2NPSIZE                                                  12240000
* #PADIDELETE.N2NPESZE                                                  12250000
* #PADIDELETE.N3NGSIZE                                                  12260000
* #PADIDELETE.N3NPSIZE                                                  12270000
* #PADIDELETE.N3NPESZE                                                  12280000
* #PADIDELETE.NJSHSIZE                                                  12290000
* #PADIDELETE.NJNSSIZE                                                  12300000
*#EPRAGMA                                                               12310000
*@ENDLOGIC;                                                             99999999
