*        %GOTO JESCBCMT;          /* Bilingual Mapping Macro            00010000
         MACRO                                                          00020000
         IAZJESCB &LIST=NO                                              00030000
.*/      %JESCBCMT: ;                                             /* */ 00040000
*                                                                       00050000
*/**** START OF SPECIFICATIONS *******************************          00060000
.****PROPRIETARY-STATEMENT************************************          00070000
.*01* PROPRIETARY STATEMENT:                                 *          00080000
.*                                                           *          00090000
.*   LICENSED MATERIALS-PROPERTY OF IBM                      *          00100000
.*   5650-ZOS Copyright IBM Corp. 2019                       *          00110000
.*                                                           *          00120000
.*   STATUS:  HBB77C0                                        *          00130000
.*                                                           *          00140000
.****END-OF-PROPRIETARY-STATEMENT*****************************          00150000
*                                                            *          00160000
*01* DESCRIPTIVE NAME: JES address space control block       *          00170000
*02*  ACRONYM:  IAZJESCB                                     *          00180000
*                                                            *          00190000
*01* MACRO NAME:  IAZJESCB                                   *          00200000
*                                                            *          00210000
*01* DSECT NAME:  JESCB                                      *          00220000
*01* LABEL PREFIX:  JESC                                     *          00230000
*                                                            *          00240000
*01* COMPONENT ID:  JES Common (SC141)                       *          00250000
*                                                            *          00260000
*01* EXTERNAL CLASSIFICATION:                                *          00270000
*02*  DMTI:  BASE                                            *          00280000
*                                                            *          00290000
*01* END OF EXTERNAL CLASSIFICATION:                         *          00300000
*                                                            *          00310000
*01* EYE-CATCHER:  JESCB                                     *          00320000
*02*  OFFSET:      JESCBID                                   *          00330000
*02*  LENGTH:      L'JESCBID                                 *          00340000
*                                                            *          00350000
*01* STORAGE ATTRIBUTES:                                     *          00360000
*02*  SUBPOOL: 230                                           *          00370000
*02*  KEY:     1                                             *          00380000
*02*  RESIDENCY:                                             *          00390000
*      Virtual = 31 bit private storage                      *          00400000
*      real    = 64 bit storage                              *          00410000
*02*  FREQUENCY = 1 per address space using JES SSIs         *          00420000
*                                                            *          00430000
*01* SIZE:                                                   *          00440000
*                                                            *          00450000
*     See JESCSZE                                            *          00460000
*                                                            *          00470000
*01* CREATED BY:                                             *          00480000
*                                                            *          00490000
*     1st caller of a JES SSI that used IAZAKSRV             *          00500000
*                                                            *          00510000
*01* POINTED TO BY:                                          *          00520000
*                                                            *          00530000
*     FSVTJESC in the IAZFSVT data area                      *          00540000
*                                                            *          00550000
*01* SERIALIZATION:                                          *          00560000
*                                                            *          00570000
*     Local lock to create entry                             *          00580000
*                                                            *          00590000
*01* FUNCTION:                                               *          00600000
*                                                            *          00610000
*     This macro provides the mapping of the data areas      *          00620000
*     used by JES2 and JES3 to anchor data in a user address *          00630000
*     space.                                                 *          00640000
*                                                            *          00650000
*01* METHOD OF ACCESS:                                       *          00660000
*                                                            *          00670000
*02*  ASM:                                                   *          00680000
*      IAZJESCB                                              *          00690000
*                                                            *          00700000
*02*  PL/X:                                                  *          00710000
*      %DCL JESCB_ATRB CHAR                                  *          00720000
*      %JESCB_ATRB = 'value'                                 *          00730000
*      %INCLUDE SYSLIB(IAZJESCB)                             *          00740000
*                                                            *          00750000
*      where value is valid control block attributes,        *          00760000
*      such as 'BASED(FSVTJESC)'.  If JESCB_ATRB='',         *          00770000
*      then 'BASED' will be used.                            *          00780000
*                                                            *          00790000
*01* USED BY:                                                *          00800000
*                                                            *          00810000
*     This is JES to anchor data areas needed by both JES2   *          00820000
*     and JES3 in various address spaces                     *          00830000
*                                                            *          00840000
*01* DELETED BY:                                             *          00850000
*                                                            *          00860000
*     Job step task termination                              *          00870000
*                                                            *          00880000
*01* RESTRICTIONS:                                           *          00890000
*                                                            *          00900000
*     None                                                   *          00910000
*                                                            *          00920000
****** END OF SPECIFICATIONS ********************************/          00930000
* % GOTO END_OF_ASM_JESCB; /*                                           00940000
*********************************************************************** 00950000
*01* CHANGE ACTIVITY:                                                 * 00960000
*                                                                     * 00970000
*01* A000000-999999    Created for APAR OA54595                  @Z24BK 00980000
*********************************************************************** 00990000
         GBLB  &IAZJESCB                                                01000000
         AIF   (&IAZJESCB).END                                          01010000
&IAZJESCB SETB  1                                                       01020000
         PUSH  PRINT                                                    01030000
         AIF   ('&LIST' EQ 'YES').MAP1                                  01040000
         PRINT OFF                                                      01050000
.MAP1    ANOP                                                           01060000
IAZJESCB DSECT                    JES anchor control block              01070000
JESCBID  DS    CL8'JESCB'         Eyecatcher                            01080000
JESCBLEN DS    H                  Length of JESCB                       01090000
JESCVER  DS    AL1(JESCVER#)      Version of control block              01100000
JESCVER# EQU   1                  Current version number                01110000
         DS    X                  Reserved                              01120000
JESCJSSK DS    A                  1st level 1 JSSK                      01130000
JESCJSFR DS    F                  1st free JSSK slot                    01140000
JESCJL2C DS    F                  Count of level 2 JSSKs                01150000
JESCJCNT DS    F                  Count of used JSSKs          @OA60092 01160000
         DS    F                  Reserved                     @OA60092 01165000
         DS    0D                 Align                                 01170000
JESCSZE  EQU   *-IAZJESCB         Size of IAZJESCB                      01180000
         POP   PRINT                                                    01190000
.END     MEND , -         */                                            01200000
*  %END_OF_ASM_JESCB: ;                                                 01210000
*/********************************************************************/ 01220000
*/*                                                                  */ 01230000
*/*      IAZJESCB data area                                          */ 01240000
*/*                                                                  */ 01250000
*/********************************************************************/ 01260000
*DCL 1 IAZJESCB BASED(JESCBPTR),   /* JES control block              */ 01270000
*     3 JESCBID  CHAR(8),          /* Eyecatcher                     */ 01280000
*     3 JESCBLEN FIXED(16),        /* Length of JESCB                */ 01290000
*     3 JESCVER  FIXED(8),         /* Version of control block       */ 01300000
*     3 *        CHAR(1),          /* Reserved                       */ 01310000
*     3 JESCJSSK PTR(31),          /* 1st level 1 JSSK               */ 01320000
*     3 JESCJSFR FIXED(32),        /* 1st free JSSK slot             */ 01330000
*     3 JESCJL2C FIXED(32),        /* Count of level 2 JSSKs         */ 01340000
*     3 JESCJCNT FIXED(32),        /* Count of used JSSKs    @OA60092*/ 01350000
*     3 *        FIXED(32),        /* Reserved               @OA60092*/ 01355000
*     3 *        CHAR(0) BDY(DWORD);                                    01360000
*                                                                       01370000
*DCL JESCVER# FIXED(8) CONSTANT(1);  /* Current version number       */ 01380000
*                                                                       99999999
