*        %GOTO LIMDCMT;           /* Bilingual Mapping Macro            00010000
         MACRO                                                          00020000
         IAZLIMD                                                        00030000
.*/      %LIMDCMT: ;                                              /* */ 00040000
*                                                                       00050000
*/**** START OF SPECIFICATIONS *******************************          00060000
.****PROPRIETARY-STATEMENT************************************          00070000
.*01* PROPRIETARY STATEMENT:                                 *          00080000
.*                                                           *          00090000
.*   LICENSED MATERIALS-PROPERTY OF IBM                      *          00100000
.*   5650-ZOS Copyright IBM Corp. 2019, 2021                 *          00110000
.*                                                           *          00120000
.*   STATUS = HBB77D0                                        *          00130000
.*                                                           *          00140000
.****END-OF-PROPRIETARY-STATEMENT*****************************          00150000
*                                                            *          00160000
*01* DESCRIPTIVE NAME: JES Resource Limits Information       *          00170000
*                        Parameter List                      *          00180000
*02*  ACRONYM:  IAZLIMD                                      *          00190000
*                                                            *          00200000
*01* MACRO NAME:  IAZLIMD                                    *          00210000
*                                                            *          00220000
*01* DSECT NAME:  LIMD                                       *          00230000
*01* LABEL PREFIX:  LIMD                                     *          00240000
*                                                            *          00250000
*01* COMPONENT ID:  JES Common (SC141)                       *          00260000
*                                                            *          00270000
*01* EXTERNAL CLASSIFICATION:  PSPI                          *          00280000
*01* END OF EXTERNAL CLASSIFICATION:                         *          00290000
*                                                            *          00300000
*01* EYE-CATCHER:  LIMD                                      *          00310000
*02*  OFFSET:      LIMDSSID                                  *          00320000
*02*  LENGTH:      L'LIMDSSID                                *          00330000
*                                                            *          00340000
*01* STORAGE ATTRIBUTES:                                     *          00350000
*02*  SUBPOOL:  caller                                       *          00360000
*02*  KEY:  Any                                              *          00370000
*02*  RESIDENCY:                                             *          00380000
*      Virtual = 31 bit storage                              *          00390000
*      real    = 31 or 64 bit storage                        *          00400000
*02*  FREQUENCY = 1 per call to function code 71 with        *          00410000
*                 function request byte of SSJILMOD          *          00420000
*                 or SSJILMRS                                *          00430000
*                                                            *          00440000
*01* SIZE:                                                   *          00450000
*                                                            *          00460000
*     See LIMDSZE                                            *          00470000
*                                                            *          00480000
*01* CREATED BY:                                             *          00490000
*                                                            *          00500000
*     caller of SSI function 'SSOBSSJI' = 71                 *          00510000
*                                                            *          00520000
*01* POINTED TO BY:                                          *          00530000
*                                                            *          00540000
*     SSJIUSER in the SSOB extension                         *          00550000
*                                                            *          00560000
*01* SERIALIZATION:                                          *          00570000
*                                                            *          00580000
*     None                                                   *          00590000
*                                                            *          00600000
*01* FUNCTION:                                               *          00610000
*                                                            *          00620000
*     This macro provides the mapping of the parameter       *          00630000
*     list used by authorized programs to request the        *          00640000
*     Resource Limits Information function                   *          00650000
*                                                            *          00660000
*01* METHOD OF ACCESS:                                       *          00670000
*                                                            *          00680000
*02*  ASM:                                                   *          00690000
*      IAZLIMD                                               *          00700000
*                                                            *          00710000
*02*  PL/X:                                                  *          00720000
*      %DCL LIMD_ATRB CHAR                                   *          00730000
*      %LIMD_ATRB = 'value'                                  *          00740000
*      %INCLUDE SYSLIB(IAZLIMD)                              *          00750000
*                                                            *          00760000
*      where value is a valid control block attribute,       *          00770000
*      such as 'BASED(SSJIUSER)'.  If LIMD_ATRB='',          *          00780000
*      then 'BASED' will be used.                            *          00790000
*                                                            *          00800000
*01* USED BY:                                                *          00810000
*                                                            *          00820000
*     This is used by authorized programs to request         *          00830000
*     resource limits Information.                           *          00840000
*                                                            *          00850000
*01* DELETED BY:                                             *          00860000
*                                                            *          00870000
*     caller                                                 *          00880000
*                                                            *          00890000
*01* FREQUENCY:                                              *          00900000
*                                                            *          00910000
*     1 per call to function code 71 with function request   *          00920000
*     byte of SSJILMOD or SSJILMRS                           *          00930000
*                                                            *          00940000
*01* RESTRICTIONS:                                           *          00950000
*                                                            *          00960000
*     None                                                   *          00970000
*                                                            *          00980000
****** END OF SPECIFICATIONS ********************************/          00990000
*/********************************************************************/ 01000000
*/*01* CHANGE ACTIVITY:                                              */ 01010000
*/* $S202710=CHEADERS HBB77C0 190212 TJW:  Updates for C headers     */ 01011000
*/*                                        S202710                   */ 01014000
*/* $Z25LENZ=ENCRYPT  HBB77D0 190612 BWT:  SPOOL Encryption - DSKEYL */ 01017000
*/*                                                                  */ 01020000
*/* A000000-999999    Created for z/OS 2.4                   @Z24LRES*/ 01030000
*/********************************************************************/ 01040000
*/************************************************************          01050000
*01* NOTES:                                                  *          01060000
*                                                            *          01070000
*          Bilingual Mapping Macro (PL/AS and BAL)           *          01080000
*                                                            *          01090000
*        Dependencies =                                      *          01100000
*                                                            *          01110000
*          PL/AS Version = This macro uses the macro         *          01120000
*            variable LIMD_ATRB. LIMD_ATRB must be           *          01130000
*            declared and set to valid control block         *          01140000
*            attributes before the macro is invoked.         *          01150000
*                                                            *          01160000
*          BAL Version = None                                *          01170000
*                                                            *          01180000
*************************************************************/          01190000
*/*                                                                  */ 01200000
* % GOTO END_OF_ASM_LIMD; /*                                            01210000
*                                                                       01220000
LIMD     DSECT                                                          01230000
LIMDSSID DC    CL4'LIMD'           I.Eyecatcher                         01240000
LIMDLEN  DC    Y(LIMDSZE)          I.Length of LIMD area                01250000
LIMDVER  DC    0FL2'0'             I.LIMD caller version                01260000
LIMDVERL DC    AL1(LIMDCVRL)         I.LIMD version level               01270000
LIMDVERM DC    AL1(LIMDCVRM)         I.LIMD version modifier            01280000
         SPACE 1                                                        01290000
LIMDV010 EQU   X'0100'               Initial version of macro           01300000
         SPACE 1                                                        01310000
LIMDCVRL EQU   1                     Current version level              01320000
LIMDCVRM EQU   0                     Current version modifier           01330000
         SPACE 1                                                        01340000
LIMDVERO DC    FL2'0'              O.Subsystem version/modifier         01350000
         DC    XL2'0'              Reserved for future use and          01360000
         DC    F'0'                  must be zero                       01370000
LIMDRETC DC    F'0'                O.Request return code                01380000
         DC    3F'0'               Reserved must be zero                01390000
LIMDUSER DS    0H                                                       01400000
         SPACE 1                                                        01410000
**************************************************************          01420000
*                                                            *          01430000
*        LIMDSTRP is an anchor for use by the subsystem that *          01440000
*        responds to this request.  It is expected that the  *          01450000
*        caller will set this to zero the FIRST time the     *          01460000
*        LIMD is used and from that point on it will be      *          01470000
*        managed by the subsystem.  If this field is         *          01480000
*        non-zero, then a return storage request must be     *          01490000
*        made to release data held by this request.          *          01500000
*                                                            *          01510000
**************************************************************          01520000
         SPACE 1                                                        01530000
LIMDSTRP DS    AD                  Storage management anchor            01540000
         DS    2F                  Reserved for future use and         C01550000
                                     must be zero                       01560000
         SPACE 1                                                        01570000
**************************************************************          01580000
*                                                            *          01590000
*        Resource Limits Information selection data          *          01600000
*        The following input fields identify what fields you *          01610000
*        want returned on this request.  At least one bit    *          01620000
*        must be set to successfully complete a call.        *          01630000
*                                                            *          01640000
**************************************************************          01650000
         SPACE 1                                                        01660000
LIMDSEL1 DC    B'00000000'         IS.Info selection flag 1             01670000
LIMDSRES EQU   B'10000000'           Resource usage stats               01680000
LIMDSREH EQU   B'01000000'           Resource usage history      @Z25BKC01690000
                                       - must also request       @Z25BKC01692000
                                         LIMDSRES                @Z25BK 01695000
LIMDSPRI EQU   B'00100000'           Privilege space usage              01700000
LIMDSCNT EQU   B'00010000'           Top 100 by Count tables            01710000
LIMDSRAT EQU   B'00001000'           Top 100 by Rate tables             01720000
         SPACE 1                                                        01730000
         DS    BL1                 Reserved                      @Z25BK 01740000
         SPACE 1                                                        01770000
*------------------------------------------------------------*          01780000
*        Resource Type selection data                        *          01790000
*        The following flag indicates the resource types     *          01800000
*        for which data should be returned. If all LIMDSEL3  *          01810000
*        bits are OFF that implies all resource types are    *          01820000
*        returned.                                           *          01830000
*------------------------------------------------------------*          01840000
         SPACE 1                                                        01850000
LIMDSEL3 DC    B'00000000'         IS.Info selection flag 3             01860000
LIMDSSPL EQU   B'10000000'           SPOOL resource type                01870000
LIMDSJQE EQU   B'01000000'           JQE resource type                  01880000
LIMDSJOE EQU   B'00100000'           JOE resource type                  01890000
LIMDSBRT EQU   B'00010000'           BERT resource type                 01900000
         SPACE 1                                                        01910000
LIMDRESM EQU   B'11110000'         Resource mask - select all           01920000
         SPACE 1                                                        01930000
**************************************************************          01940000
*                                                            *          01950000
*        Resource Limits Option Information                  *          01960000
*        Indicate options for returned data.                 *          01970000
*        LIMD1LOC will return Top 100 tables from the local  *          01980000
*        member only when turned ON. If turned OFF the Top   *          01990000
*        100 tables from a MAS-wide view will be returned.   *          02000000
*                                                            *          02010000
**************************************************************          02020000
         SPACE 1                                                        02030000
LIMDOPT1 DC    B'00000000'         I.Resource limits                   C02040000
                                       option information               02050000
LIMD1LOC EQU   B'10000000'           ON - Return local member          C02060000
                                      Top 100 tables                    02070000
LIMDPD64 EQU   B'01000000'           ON - Return output in             C02080000
                                       64-bit virtual storage           02090000
         SPACE 1                                                        02100000
         DC    16F'0'              Reserved for future use and         C02110000
                                     must be zero                       02120000
         SPACE 1                                                        02130000
**************************************************************          02140000
*                                                            *          02150000
*        Output areas                                        *          02160000
*        Output from a Resource Limits Information request   *          02170000
*        is organized by the mapping of the returned data.   *          02180000
*                                                            *          02190000
**************************************************************          02200000
         SPACE 1                                                        02210000
LIMDFLG1 DS    BL1                 LIMITS Flag 1                        02220000
LIMD1INI EQU   B'10000000'         LIMITS initialization comp           02230000
LIMD1SME EQU   B'00000100'         LIMITS Privilege support            C02240000
                                           is ACTIVE in Small          C02250000
                                           Environment mode             02260000
LIMD1PRI EQU   B'00000010'         LIMITS Privilege support            C02270000
                                           is ACTIVE                    02280000
LIMD1SUS EQU   B'00000001'         LIMITS Privilege support            C02290000
                                           is SUSPENDED                 02300000
         DS    XL3                 Reserved                             02310000
LIMDDSTM DS    D                   Time stamp when LIMITS              C02320000
                                      data was collected                02330000
         SPACE 1                                                        02340000
LIMDLMDU DC    AD(*-*)             O.Resource usage (LMDUDATA)          02350000
LIMDLMU4 EQU   LIMDLMDU+4,4,C'A'     31-bit part of LIMDLMDU            02360000
LIMDLMDP DC    AD(*-*)             O.Privilege space usage (LMDPDATA)   02370000
LIMDLMD4 EQU   LIMDLMDP+4,4,C'A'     31-bit part of LIMDLMDP            02380000
LIMDLMTC DC    AD(*-*)             O.Top 100 by Count tables (LMTCDATA) 02390000
LIMDLMC4 EQU   LIMDLMTC+4,4,C'A'     31-bit part of LIMDLMTC            02400000
LIMDLMTR DC    AD(*-*)             O.Top 100 by Rate tables (LMTRDATA)  02410000
LIMDLMR4 EQU   LIMDLMTR+4,4,C'A'     31-bit part of LIMDLMTR            02420000
         SPACE 1                                                        02430000
         DC    14F'0'              Reserved for future use and         C02440000
                                     must be zero                       02450000
         DS    0D                  Align length                         02460000
         SPACE 1                                                        02470000
LIMDSZE1 EQU   *-LIMD              Parameter end-version 1             C02480000
                                     size                               02490000
LIMDSZE  EQU   *-LIMD              Size of LIMD                         02500000
         SPACE 2                                                        02510000
**************************************************************          02520000
*                                                            *          02530000
*        Reason codes                                        *          02540000
*        Values of SSJIRETN when SSOBRETN is 4 for           *          02550000
*        function (values of SSJIFREQ) SSJILMOD.             *          02560000
*                                                            *          02570000
**************************************************************          02580000
         SPACE 1                                                        02590000
LIMDOK   EQU   0                   Success                              02600000
LIMDUNKN EQU   4                   Unknown function request             02610000
LIMDNCKD EQU   8                   Input validation error               02620000
LIMDSTRG EQU   12                  Unable to obtain storage             02630000
LIMDNODT EQU   16                  Either LIMITS control block         C02640000
                                     not available or no copy          C02650000
                                     storage area supplied              02660000
LIMDNO64 EQU   20                  No 64 bit storage for work          C02670000
                                     copy of LIMITS data                02680000
LIMDBADS EQU   24                  Bad storage pointer in LIMD          02690000
LIMDNOLM EQU   28                  No LIMITS subtask to                C02700000
                                     process the request                02710000
         EJECT ,                                                        02720000
**************************************************************          02730000
*                                                            *          02740000
*        Resource usage data area                            *          02750000
*                                                            *          02760000
**************************************************************          02770000
         SPACE 1                                                        02780000
LMDUDATA DSECT ,                   Resource usage data                  02790000
LMDUEYE  DC    C'LMDU'             Area eyecatcher                      02800000
LMDULEN  DC    Y(LMDUBASL)         Length of section             @Z25BK 02805000
         DS    XL2                 Reserved                      @Z25BK 02810000
         SPACE 1                                                        02820000
LMDUNEXT DC    AD(*-*)             Next LMDU entry                      02830000
LMDUNXT4 EQU   LMDUNEXT+4,4,C'A'     31-bit part of LMDUNEXT            02840000
         SPACE 1                                                        02850000
LMDUTYPE DS    XL1                 Resource type. Refer to             C02860000
                                     ARTTYPE field values in           C02870000
                                     $ARTABL                            02880000
LMDUFLG1 DS    B                   Resource type flag                   02890000
LMDU1050 EQU   B'10000000'           Resource shortage message         C02900000
                                      issued (HASP050)                  02910000
LMDU1EX0 EQU   B'01000000'           Exhaustion date/time              C02920000
                                      prediction not available          02930000
LMDU1NPE EQU   B'00100000'           Non-privileged resource           C02940000
                                      exhausted                         02950000
LMDUSTS  DS    B                   Privilege support status            C02960000
                                    for this resource                   02970000
LMDUSACT EQU   B'10000000'           Privilege support active           02980000
LMDUSMSG EQU   B'01000000'           Message issued indicating         C02990000
                                      privilege support no longer      C03000000
                                      active                            03010000
LMDUSSHO EQU   B'00100000'           Non-privilege resource            C03020000
                                      shortage exists                   03030000
LMDUSSML EQU   B'00010000'           Small environment active           03040000
         DS    XL1                 Reserved                             03050000
LMDUNAME DS    CL8                 Resource name                        03060000
         DS    XL4                 Reserved                             03070000
         SPACE 1                                                        03080000
LMDUWAP  DS    AL2                 Warning percentage for              C03090000
                                     current % of maximum               03100000
LMDUUUSP DS    AL2                 Percentage of in-use                C03110000
                                     non-privileged resource            03120000
LMDUPUSP DS    AL2                 Percentage of in-use                C03130000
                                     privileged resource                03140000
         DS    XL2                 Reserved                             03150000
LMDUMAX  DS    F                   Maximum count of                    C03160000
                                     non-privileged resource            03170000
LMDUUSE  DS    F                   Count of non-privileged             C03180000
                                     resource in-use                    03190000
LMDUPMAX DS    F                   Maximum count of                    C03200000
                                     privileged resource                03210000
LMDUPUSE DS    F                   Count of privileged                 C03220000
                                     resource in-use                    03230000
LMDUEXH  DS    D                   Projected date/time when            C03240000
                                     resource will be                  C03250000
                                     exhausted                          03260000
         SPACE 1                                                        03270000
LMDUDESC DS    CL20                Descriptive resource name            03280000
LMDUSTMT DS    CL16                Resource limit statement             03290000
LMDUKEYW DS    CL20                  and keyword                        03300000
         SPACE 1                                                        03310000
         DS    0D                  Align on word                        03320000
LMDULMUH DC    AD(*-*)             Resource usage history (LMUHDATA)   C03330000
                                     chain head                         03340000
LMDULMH4 EQU   LMDULMUH+4,4,C'A'     31-bit part of LMDULMUH            03350000
         DS    0D                  Align length                         03360000
LMDUBASL EQU   *-LMDUDATA          Length of base section              C03370000
                                   NOT FOR APPLICATION USE              03380000
         SPACE 1                                                        03390000
LMUHDATA DSECT ,                   Resource usage history entry         03400000
LMUHEYE  DC    C'LMUH'             Area eyecatcher                      03410000
LMUHLEN  DC    Y(LMUHENTS)         Length of section             @Z25BK 03415000
         DS    XL2                 Reserved                      @Z25BK 03420000
         SPACE 1                                                        03430000
LMUHNEXT DC    AD(*-*)             Resource usage history (LMUHDATA)   C03440000
                                     next entry                         03450000
LMUHNXT4 EQU   LMUHNEXT+4,4,C'A'     31-bit part of LMUHNEXT            03460000
         SPACE 1                                                        03470000
LMUHNAME DS    CL8                 Resource name                        03480000
                                                                        03490000
LMUHTYPE DS    XL1                 Resource type. Refer to             C03500000
                                     ARTTYPE field values in           C03510000
                                     $ARTABL                            03520000
         DS    XL3                 Reserved                             03530000
         SPACE 1                                                        03540000
LMUHCNT  DS    F                   Count of non-privileged             C03550000
                                     resource in-use at the            C03560000
                                     recorded date/time                 03570000
LMUHTOD  DS    D                   Date/time when this in-use          C03580000
                                     count was recorded                 03590000
         DS    0D                  Align length                         03600000
LMUHENTS EQU   *-LMUHDATA          Length of a history entry           C03610000
                                   NOT FOR APPLICATION USE              03620000
         EJECT ,                                                        03630000
**************************************************************          03640000
*                                                            *          03650000
*        Privilege space usage data area                     *          03660000
*                                                            *          03670000
**************************************************************          03680000
         SPACE 1                                                        03690000
LMDPDATA DSECT ,                   Privilege space data                 03700000
LMDPEYE  DC    C'LMDP'             Area eyecatcher                      03710000
LMDPLEN  DC    Y(LMDPBASL)         Length of section             @Z25BK 03715000
         DS    XL2                 Reserved                      @Z25BK 03720000
         SPACE 1                                                        03730000
LMDPNEXT DC    AD(*-*)             Next LMDP entry                      03740000
LMDPNXT4 EQU   LMDPNEXT+4,4,C'A'     31-bit part of LMDPNEXT            03750000
         SPACE 1                                                        03760000
LMDPTYPE DS    XL1                 Resource type. Refer to             C03770000
                                     ARTTYPE field values in           C03780000
                                     $ARTABL                            03790000
LMDPSTS  DS    B                   Privilege support status            C03800000
                                    for this resource                   03810000
LMDPSACT EQU   B'10000000'           Privilege support active           03820000
LMDPSMSG EQU   B'01000000'           Message issued indicating         C03830000
                                      privilege support no             C03840000
                                      active                            03850000
LMDPSSHO EQU   B'00100000'           Non-privilege resource            C03860000
                                      shortage exists                   03870000
LMDPSSML EQU   B'00010000'           Small environment active           03880000
         DS    XL2                 Reserved                             03890000
LMDPNAME DS    CL8                 Resource name                        03900000
         SPACE 1                                                        03910000
LMDPPUSP DS    AL2                 Percentage of in-use                C03920000
                                     privileged resource                03930000
         DS    XL2                 Reserved                             03940000
LMDPPMAX DS    F                   Maximum count of                    C03950000
                                     privileged resource                03960000
LMDPPUSE DS    F                   Count of privileged                 C03970000
                                     resource in-use                    03980000
         SPACE 1                                                        03990000
LMDPDESC DS    CL20                Descriptive resource name            04000000
LMDPSTMT DS    CL16                Resource limit statement             04010000
LMDPKEYW DS    CL20                  and keyword                        04020000
         DS    0D                  Align length                         04030000
LMDPBASL EQU   *-LMDPDATA          Length of base section              C04040000
                                   NOT FOR APPLICATION USE              04050000
         EJECT ,                                                        04060000
**************************************************************          04070000
*                                                            *          04080000
*        Top 100 by Count data area                          *          04090000
*                                                            *          04100000
**************************************************************          04110000
         SPACE 1                                                        04120000
LMTCDATA DSECT ,                   Top 100 by Count data                04130000
LMTCEYE  DC    C'LMTC'             Area eyecatcher                      04140000
LMTCLEN  DC    Y(LMTCBASL)         Length of section             @Z25BK 04145000
         DS    XL2                 Reserved                      @Z25BK 04150000
         SPACE 1                                                        04160000
LMTCNEXT DC    AD(*-*)             Next LMTC entry                      04170000
LMTCNXT4 EQU   LMTCNEXT+4,4,C'A'     31-bit part of LMTCNEXT            04180000
         SPACE 1                                                        04190000
LMTCTYPE DS    XL1                 Resource type. Refer to             C04200000
                                     ARTTYPE field values in           C04210000
                                     $ARTABL                            04220000
         DS    XL3                 Reserved                             04230000
LMTCHCT  DS    F                   Total count of resource             C04240000
                                     allocated by the largest          C04250000
                                     consumer in the listed            C04260000
                                     jobs                               04270000
LMTCLCT  DS    F                   Total count of resource             C04280000
                                     allocated by the lowest           C04290000
                                     consumer in the listed            C04300000
                                     jobs                               04310000
LMTCNAME DS    CL8                 Resource name                        04320000
         SPACE 1                                                        04330000
LMTCDESC DS    CL20                Descriptive resource name            04340000
LMTCSTMT DS    CL16                Resource limit statement             04350000
LMTCKEYW DS    CL20                  and keyword                        04360000
         DS    XL4                 Reserved                             04370000
         SPACE 1                                                        04380000
         DS    0D                  Align on word                        04390000
LMTCLMCE DC    AD(*-*)             Top 100 by count entry (LMCEDATA)   C04400000
                                     chain head                         04410000
LMTCLMC4 EQU   LMTCLMCE+4,4,C'A'     31-bit part of LMTCLMCE            04420000
         DS    0D                  Align length                         04430000
LMTCBASL EQU   *-LMTCDATA          Length of base section              C04440000
                                   NOT FOR APPLICATION USE              04450000
         SPACE 1                                                        04460000
LMCEDATA DSECT ,                   Top 100 by count entry               04470000
LMCEEYE  DC    C'LMCE'             Area eyecatcher                      04480000
LMCELEN  DC    Y(LMCEENTS)         Length of section             @Z25BK 04485000
         DS    XL2                 Reserved                      @Z25BK 04490000
         SPACE 1                                                        04500000
LMCENEXT DC    AD(*-*)             Top 100 by count (LMCEDATA) next    C04510000
                                     entry                              04520000
LMCENXT4 EQU   LMCENEXT+4,4,C'A'     31-bit part of LMCENEXT            04530000
         SPACE 1                                                        04540000
LMCETYPE DS    XL1                 Resource type. Refer to             C04550000
                                     ARTTYPE field values in           C04560000
                                     $ARTABL                            04570000
LMCEFLG1 DS    B                   Indicator flag 1                     04580000
LMCE1EXE EQU   B'10000000'           Job is executing                   04590000
LMCE1NOT EQU   B'01000000'           Job is not executing on this      C04600000
                                       member                           04610000
LMCE1TC0 EQU   B'00100000'           Job total resource count          C04620000
                                       is zero                          04630000
LMCE1RT0 EQU   B'00010000'           Job resource allocation rate      C04640000
                                       is zero                          04650000
LMCEBUSY DS    XL1                 MAS member where job is or was      C04660000
                                     executing                   @Z25BK 04670000
         DS    XL1                 Reserved                             04680000
LMCEPRCT DS    AL2                 Percentage of total allocated       C04690000
                                     resource represented by this      C04700000
                                     job resource alloc count    @Z25BK 04710000
         DS    XL2                 Reserved                             04720000
LMCERATE DS    F                   Resource allocation rate            C04730000
                                     of this resource by this          C04740000
                                     job times 1000              @Z25BK 04750000
LMCEECNT DS    F                   Total count of allocated            C04760000
                                     resource by this job               04770000
LMCEMBRN DS    CL4                 MAS member executing this job        04780000
LMCEJOBN DS    CL8                 Job name                             04790000
LMCEJOBI DS    CL8                 Job ID                               04800000
LMCENAME DS    CL8                 Resource name                        04810000
LMCEJOBK DS    XL4                 Job key                       @Z25BK 04820000
LMCEJOWN DS    CL8                 Job owner                     @Z25BK 04825000
LMCESNAM DS    CL4                 JES2 subsystem where job is @Z25LENZC04826000
                                     or was executing          @Z25LENZ 04827000
         DS    XL4                 Reserved                      @Z25DD 04828000
         SPACE 1                                                        04830000
         DS    0D                  Align length                         04840000
LMCEENTS EQU   *-LMCEDATA          Length of a Top 100 entry           C04850000
                                   NOT FOR APPLICATION USE              04860000
         EJECT ,                                                        04870000
**************************************************************          04880000
*                                                            *          04890000
*        Top 100 by Rate data area                           *          04900000
*                                                            *          04910000
**************************************************************          04920000
         SPACE 1                                                        04930000
LMTRDATA DSECT ,                   Top 100 by Rate data                 04940000
LMTREYE  DC    C'LMTR'             Area eyecatcher                      04950000
LMTRLEN  DC    Y(LMTRBASL)         Length of section             @Z25BK 04955000
         DS    XL2                 Reserved                      @Z25BK 04960000
         SPACE 1                                                        04970000
LMTRNEXT DC    AD(*-*)             Next LMTC entry                      04980000
LMTRNXT4 EQU   LMTRNEXT+4,4,C'A'     31-bit part of LMTRNEXT            04990000
         SPACE 1                                                        05000000
LMTRTYPE DS    XL1                 Resource type. Refer to             C05010000
                                     ARTTYPE field values in           C05020000
                                     $ARTABL                            05030000
         DS    XL3                 Reserved                             05040000
LMTRHCT  DS    F                   Resource allocation rate            C05050000
                                     by the largest consumer           C05060000
                                     in the listed jobs                 05070000
LMTRLCT  DS    F                   Resource allocation rate            C05080000
                                     by the lowest consumer            C05090000
                                     in the listed jobs                 05100000
LMTRNAME DS    CL8                 Resource name                        05110000
         SPACE 1                                                        05120000
LMTRDESC DS    CL20                Descriptive resource name            05130000
LMTRSTMT DS    CL16                Resource limit statement             05140000
LMTRKEYW DS    CL20                  and keyword                        05150000
         DS    XL4                 Reserved                             05160000
         SPACE 1                                                        05170000
         DS    0D                  Align on word                        05180000
LMTRLMRE DC    AD(*-*)             Top 100 by rate entry (LMREDATA)    C05190000
                                     chain head                         05200000
LMTRLMR4 EQU   LMTRLMRE+4,4,C'A'     31-bit part of LMTRLMRE            05210000
         DS    0D                  Align length                         05220000
LMTRBASL EQU   *-LMTRDATA          Length of base section              C05230000
                                   NOT FOR APPLICATION USE              05240000
         SPACE 1                                                        05250000
LMREDATA DSECT ,                   Top 100 by rate entry                05260000
LMREEYE  DC    C'LMRE'             Area eyecatcher                      05270000
LMRELEN  DC    Y(LMREENTS)         Length of section             @Z25BK 05275000
         DS    XL2                 Reserved                      @Z25BK 05280000
         SPACE 1                                                        05290000
LMRENEXT DC    AD(*-*)             Top 100 by rate (LMREDATA) next     C05300000
                                     entry                              05310000
LMRENXT4 EQU   LMRENEXT+4,4,C'A'     31-bit part of LMRENEXT            05320000
         SPACE 1                                                        05330000
LMRETYPE DS    XL1                 Resource type. Refer to             C05340000
                                     ARTTYPE field values in           C05350000
                                     $ARTABL                            05360000
LMREFLG1 DS    B                   Indicator flag 1                     05370000
LMRE1EXE EQU   B'10000000'           Job is executing                   05380000
LMRE1NOT EQU   B'01000000'           Job is not executing on this      C05390000
                                       member                           05400000
LMRE1TC0 EQU   B'00100000'           Job total resource count          C05410000
                                       is zero                          05420000
LMRE1RT0 EQU   B'00010000'           Job resource allocation rate      C05430000
                                       is zero                          05440000
LMREBUSY DS    XL1                 MAS member where job is or was      C05450000
                                     executing                   @Z25BK 05460000
         DS    XL1                 Reserved                             05470000
LMREPRCT DS    AL2                 Percentage of total allocated       C05480000
                                     resource represented by this      C05490000
                                     job resource alloc count    @Z25BK 05500000
         DS    XL2                 Reserved                             05510000
LMRERATE DS    F                   Resource allocation rate            C05520000
                                     of this resource by this          C05530000
                                     job times 1000              @Z25BK 05540000
LMREECNT DS    F                   Total count of allocated            C05550000
                                     resource by this job               05560000
LMREMBRN DS    CL4                 MAS member executing this job        05570000
LMREJOBN DS    CL8                 Job name                             05580000
LMREJOBI DS    CL8                 Job ID                               05590000
LMRENAME DS    CL8                 Resource name                        05600000
LMREJOBK DS    XL4                 Job key                       @Z25BK 05610000
LMREJOWN DS    CL8                 Job owner                     @Z25BK 05615000
LMRESNAM DS    CL4                 JES2 subsystem where job is @Z25LENZC05616000
                                     or was executing          @Z25LENZ 05617000
         DS    XL4                 Reserved                      @Z25DD 05618000
         SPACE 1                                                        05620000
         DS    0D                  Align length                         05630000
LMREENTS EQU   *-LMREDATA          Length of a Top 100 entry           C05640000
                                   NOT FOR APPLICATION USE              05650000
         EJECT ,                                                        05660000
**************************************************************          05670000
*                                                            *          05680000
*        Storage management fields for use by the subsystems *          05690000
*        only.                                               *          05700000
*                                                            *          05710000
*        The LIMDSTRP field in LIMD is a token used to       *          05720000
*        locate a chain of these control blocks.  All of     *          05730000
*        this storage is accessible to the caller but is     *          05740000
*        protected from modification.                        *          05750000
*                                                            *          05760000
**************************************************************          05770000
         SPACE 1                                                        05780000
LIMDSTOR DSECT ,                   Storage management header.           05790000
         SPACE 1                                                        05800000
LIMDSTID DC    CL8'LIMDSTOR'       Eye-catcher                          05810000
LIMDSTHL DC    AL2(LIMDSTSZ)       Length of storage header             05820000
         SPACE 1                                                        05830000
LIMDSTSP DS    X                   Subpool of this block                05840000
LIMDSTPL EQU   230                   Recommended subpool                05850000
         DS    XL1                 Reserved                             05860000
         SPACE 1                                                        05870000
LIMDSTTL DS    F                   Total length of this block          C05880000
                                     (including this header)            05890000
         SPACE 1                                                        05900000
LIMDSTNX DS    AD                  Pointer to next block                05910000
LIMDSTCP DS    AD                  Ptr to 1st available byte            05920000
         SPACE 1                                                        05930000
LIMDDATA DS    0A                  Start of data in the block           05940000
         SPACE 1                                                        05950000
LIMDSTSZ EQU   *-LIMDSTOR          Size of Storage management          C05960000
                                     header.                            05970000
         SPACE 1                                                        05980000
         MEND  ,                                                        05990000
.*                                                                      06000000
**/                                                                     06010000
* % END_OF_ASM_LIMD: ;                                                  06020000
*                                                                       06030000
* %IF LIMD_ATRB = ''               /* If no attribute is specified   */ 06040000
*   %THEN                                                               06050000
*     %LIMD_ATRB = 'BASED';        /* establish default attribute    */ 06060000
*                                                                       06070000
*DECLARE                                                                06080000
*   1 LIMD    LIMD_ATRB,                                                06090000
*     3 LIMDSSID CHAR(4),          /* I.Eyecatcher                   */ 06100000
*     3 LIMDLEN  FIXED(16),        /* I.Length of MOND                  06110000
*                                         parameter list             */ 06120000
*     3 LIMDVER  FIXED(16),        /* I.MOND input version           */ 06130000
*       5 LIMDVERL FIXED(8),       /*   I.MOND version level         */ 06140000
*       5 LIMDVERM FIXED(8),       /*   I.MOND version modifier      */ 06150000
*     3 LIMDVERO FIXED(16),        /* O.Subsystem version number     */ 06160000
*     3 *        FIXED(16),        /* Reserved                       */ 06170000
*     3 *        FIXED(32),        /* Reserved                       */ 06180000
*     3 LIMDRETC FIXED(32),        /* O.Request return code          */ 06190000
*     3 *(3)     FIXED(32),        /* Reserved                       */ 06200000
*     3 LIMDUSER ,                 /* User area                      */ 06210000
*/********************************************************************/ 06220000
*/*      LIMDSTRP is an anchor for use by the subsystem that         */ 06230000
*/*      responds to this request.  It is expected that the          */ 06240000
*/*      caller will set this to zero the FIRST time the             */ 06250000
*/*      LIMD is used and from that point on it will be              */ 06260000
*/*      managed by the subsystem.  If this field is                 */ 06270000
*/*      non-zero, then a return storage request must be             */ 06280000
*/*      made to release data held by this request.                  */ 06290000
*/********************************************************************/ 06300000
*       5 LIMDSTRP CHAR(8),        /* Storage management anchor      */ 06310000
*       5 *(2)     FIXED(32),      /* Reserved                       */ 06320000
*/********************************************************************/ 06330000
*/*      Resource Limits Information selection data                  */ 06340000
*/*      The following input fields identify what fields you         */ 06350000
*/*      want returned on this request.  At least one bit            */ 06360000
*/*      must be set to successfully complete a call.                */ 06370000
*/********************************************************************/ 06380000
*       5 LIMDSEL1 BIT(8),         /* IS.Info selection flag 1       */ 06390000
*         7 LIMDSRES BIT(1),       /*   Resource usage stats         */ 06400000
*         7 LIMDSREH BIT(1),       /*   Resource usage history          06410000
*                                       - must req LIMDSRES    @Z25BK*/ 06415000
*         7 LIMDSPRI BIT(1),       /*   Privilege space usage        */ 06420000
*         7 LIMDSCNT BIT(1),       /*   Top 100 by Count tables      */ 06430000
*         7 LIMDSRAT BIT(1),       /*   Top 100 by Rate tables       */ 06440000
*         7 *        BIT(3),       /*   Reserved                     */ 06450000
*       5 *        BIT(8),         /* Reserved                 @Z25BK*/ 06460000
*       5 LIMDSEL3 BIT(8),         /* IS.Info selection flag 3       */ 06490000
*         7 LIMDSSPL BIT(1),       /*   SPOOL resource type          */ 06500000
*         7 LIMDSJQE BIT(1),       /*   JQE resource type            */ 06510000
*         7 LIMDSJOE BIT(1),       /*   JOE resource type            */ 06520000
*         7 LIMDSBRT BIT(1),       /*   BERT resource type           */ 06530000
*         7 *        BIT(4),       /*   Reserved                     */ 06540000
*       5 LIMDOPT1 BIT(8),         /* I.Resource Limits option info  */ 06550000
*         7 LIMD1LOC BIT(1),       /*   ON - return local member        06560000
*                                            Top 100 tables          */ 06570000
*         7 LIMDPD64 BIT(1),       /*   ON - return output in 64-bit    06580000
*                                            virtual storage         */ 06590000
*         7 *        BIT(6),       /*   Reserved                     */ 06600000
*       5 *(16)    FIXED(32),      /* Reserved                       */ 06610000
*/********************************************************************/ 06620000
*/*      Output areas                                                */ 06630000
*/*      Output from a Resource Limits Information request is        */ 06640000
*/*      organized by the mapping of the returned data.              */ 06650000
*/********************************************************************/ 06660000
*       5 LIMDFLG1 BIT(8),         /* O.Limits processing status     */ 06670000
*         7 LIMD1INI BIT(1),       /*   Limits control block            06680000
*                                         initialization complete    */ 06690000
*         7 *        BIT(4),       /*   Reserved                     */ 06700000
*         7 LIMD1SME BIT(1),       /*   Limits privilege support is     06710000
*                                         ACTIVE in Small Environment   06720000
*                                         mode                       */ 06730000
*         7 LIMD1PRI BIT(1),       /*   Limits privilege support is     06740000
*                                         ACTIVE                     */ 06750000
*         7 LIMD1SUS BIT(1),       /*   Limits privilege support is     06760000
*                                         SUSPENDED                  */ 06770000
*       5 *        CHAR(3),        /*   Reserved                     */ 06780000
*       5 LIMDDSTM CHAR(8),        /* O.Time stamp when LIMITS data     06790000
*                                         was collected              */ 06800000
*       5 LIMDLMDU PTR(64),        /* O.Resource usage     (LMDUDATA)*/ 06810000
*         7   *        BIT(32),                                         06820000
*         7   LIMDLMU4 PTR(31),    /*     31-bit part of LIMDLMDU    */ 06830000
*       5 LIMDLMDP PTR(64),        /* O.Privilege space use(LMDPDATA)*/ 06840000
*         7   *        BIT(32),                                         06850000
*         7   LIMDLMD4 PTR(31),    /*     31-bit part of LIMDLMDP    */ 06860000
*       5 LIMDLMTC PTR(64),        /* O.Top 100 by Count tb(LMTCDATA)*/ 06870000
*         7   *        BIT(32),                                         06880000
*         7   LIMDLMC4 PTR(31),    /*     31-bit part of LIMDLMTC    */ 06890000
*       5 LIMDLMTR PTR(64),        /* O.Top 100 by Rate tbl(LMTRDATA)*/ 06900000
*         7   *        BIT(32),                                         06910000
*         7   LIMDLMR4 PTR(31),    /*     31-bit part of LIMDLMTR    */ 06920000
*       5 *(14)    FIXED(32);      /* Reserved                       */ 06930000
*   DCL LIMDSZE  FIXED(15) CONSTANT(LENGTH(LIMD)); /* Size of LIMD   */ 06940000
*   DCL LIMDSZE1 FIXED(15) CONSTANT(LENGTH(LIMD)); /* Parameter end-    06950000
*                                        version 1 size              */ 06960000
*   DCL LIMDV010 FIXED(16)         /* z/OS 2.4 version level         */ 06970000
*                CONSTANT('0100'X);                                     06980000
*   DCL LIMDCVRL FIXED(8) CONSTANT(1); /* Current ver level          */ 06990000
*   DCL LIMDCVRM FIXED(8) CONSTANT(0); /* Current version modifier   */ 07000000
*   DCL LIMDEYEC  CHAR(4) CONSTANT('LIMD'); /* JES2 Resource Limits  */ 07010000
*/********************************************************************/ 07020000
*/*                                                                  */ 07030000
*/*      Reason codes                                                */ 07040000
*/*      On exit, the reason code is placed in SSJIRETN.             */ 07050000
*/*                                                                  */ 07060000
*/********************************************************************/ 07070000
*   DCL LIMDOK   FIXED(15) CONSTANT(0);  /* Success                  */ 07080000
*   DCL LIMDUNKN FIXED(15) CONSTANT(4);  /* Unknown function request */ 07090000
*   DCL LIMDNCKD FIXED(15) CONSTANT(8);  /* Input validation error   */ 07100000
*   DCL LIMDSTRG FIXED(15) CONSTANT(12); /* Unable to obtain storage */ 07110000
*   DCL LIMDNODT FIXED(15) CONSTANT(16); /* Either LIMITS control       07120000
*                                           block not available or no   07130000
*                                           copy storage area avail  */ 07140000
*   DCL LIMDNO64 FIXED(15) CONSTANT(20); /* No 64-bit storage for work  07150000
*                                           copy of LIMITS data      */ 07160000
*   DCL LIMDBADS FIXED(15) CONSTANT(24); /* Bad storage pointer LIMD */ 07170000
*   DCL LIMDNOLM FIXED(15) CONSTANT(28); /* No LIMITS subtask to        07180000
*                                           process the request      */ 07190000
*/********************************************************************/ 07200000
*/*                                                                  */ 07210000
*/*      Resource usage data area                                    */ 07220000
*/*                                                                  */ 07230000
*/********************************************************************/ 07240000
*DECLARE                                                                07250000
*   1 LMDUDATA BASED,                                                   07260000
*     3 LMDUEYE  CHAR(4),          /* Area eyecatcher                */ 07270000
*     3 LMDULEN  FIXED(16),        /* Length of section        @Z25BK*/ 07275000
*     3 *        CHAR(2),          /* Reserved                 @Z25BK*/ 07280000
*     3 LMDUNEXT PTR(64),          /* Next LMDU entry                */ 07290000
*       5   *        BIT(32),                                           07300000
*       5   LMDUNXT4 PTR(31),   /*     31-bit part of LMDUNEXT       */ 07310000
*     3 LMDUTYPE CHAR(1),          /* Resource type                  */ 07320000
*     3 LMDUFLG1 BIT(8),           /* Resource type flag             */ 07330000
*         7 LMDU1050 BIT(1),       /*   Resource shortage message       07340000
*                                        issued (HASP050)            */ 07350000
*         7 LMDU1EX0 BIT(1),       /*   Exhaustion date/time prediction 07360000
*                                        not available               */ 07370000
*         7 LMDU1NPE BIT(1),       /*   Non-privileged resource         07380000
*                                        exhausted                   */ 07390000
*     3 LMDUSTS  BIT(8),           /* Privilege support status          07400000
*                                        for this resource           */ 07410000
*         7 LMDUSACT BIT(1),       /*   Privilege support active     */ 07420000
*         7 LMDUSMSG BIT(1),       /*   Message issued indicating       07430000
*                                        privilege support no longer    07440000
*                                        active                      */ 07450000
*         7 LMDUSSHO BIT(1),       /*   Non-privileged resource         07460000
*                                        shortage exists             */ 07470000
*         7 LMDUSSML BIT(1),       /*   Small environment active     */ 07480000
*     3 *        FIXED(8),         /* Reserved                       */ 07490000
*     3 LMDUNAME CHAR(8),          /* Resource name                  */ 07500000
*     3 *        FIXED(32),        /* Reserved                       */ 07510000
*     3 LMDUWAP  FIXED(16),        /* Warning percentage for current %  07520000
*                                        of maximum                  */ 07530000
*     3 LMDUUUSP FIXED(16),        /* Percentage of in-use              07540000
*                                        non-privileged resource     */ 07550000
*     3 LMDUPUSP FIXED(16),        /* Percentage of in-use              07560000
*                                        privileged resource         */ 07570000
*     3 *        FIXED(16),        /* Reserved                       */ 07580000
*     3 LMDUMAX  FIXED(32),        /* Maximum count of non-privileged   07590000
*                                        resource              @Z25BK*/ 07600000
*     3 LMDUUSE  FIXED(32),        /* Count of non-privileged resource  07610000
*                                        in-use                @Z25BK*/ 07620000
*     3 LMDUPMAX FIXED(32),        /* Maximum count of privileged       07630000
*                                        resource              @Z25BK*/ 07640000
*     3 LMDUPUSE FIXED(32),        /* Count of privileged resource      07650000
*                                        in-use                @Z25BK*/ 07660000
*     3 LMDUEXH  CHAR(8),          /* Projected date/time when resource 07670000
*                                        will be exhausted           */ 07680000
*     3 LMDUDESC CHAR(20),         /* Descriptive resource name      */ 07690000
*     3 LMDUSTMT CHAR(16),         /* Resource limit statement       */ 07700000
*     3 LMDUKEYW CHAR(20),         /*   and keyword                  */ 07710000
*     3 LMDULMUH PTR(64),          /* Resource usage history (LMUHDATA) 07720000
*                                        chain head                  */ 07730000
*       5   *        BIT(32),                                           07740000
*       5   LMDULMH4 PTR(31);   /*     31-bit part of LMDULMUH       */ 07750000
*   DCL LMDUEYEC  CHAR(4) CONSTANT('LMDU'); /* LMDUDATA eyecatcher   */ 07760000
*   DCL LMDUBASL FIXED(15) CONSTANT(LENGTH(LMDUDATA)); /* Size of       07761000
*                                        LMDUDATA section      @Z25BK*/ 07764000
*DECLARE                                                                07770000
*   1 LMUHDATA BASED,                                                   07780000
*     3 LMUHEYE  CHAR(4),          /* Area eyecatcher                */ 07790000
*     3 LMUHLEN  FIXED(16),        /* Length of section        @Z25BM*/ 07795000
*     3 *        CHAR(2),          /* Reserved                 @Z25BK*/ 07800000
*     3 LMUHNEXT PTR(64),          /* Next LMUH entry                */ 07810000
*       5   *        BIT(32),                                           07820000
*       5   LMUHNXT4 PTR(31),   /*     31-bit part of LMUHNEXT       */ 07830000
*     3 LMUHNAME CHAR(8),          /* Resource name                  */ 07840000
*     3 LMUHTYPE CHAR(1),          /* Resource type                  */ 07850000
*     3 *        CHAR(3),          /* Reserved                       */ 07860000
*     3 LMUHCNT  FIXED(32),        /* Count of non-privileged resource  07870000
*                                        in-use at the recorded         07880000
*                                        date/time                   */ 07890000
*     3 LMUHTOD  CHAR(8);          /* Date/time when this in-use count  07900000
*                                        was recorded                */ 07910000
*   DCL LMUHEYEC  CHAR(4) CONSTANT('LMUH'); /* LMUHDATA eyecatcher   */ 07920000
*   DCL LMUHENTS FIXED(15) CONSTANT(LENGTH(LMUHDATA)); /* Size of       07923000
*                                        LMUHDATA section      @Z25BM*/ 07926000
*/********************************************************************/ 07930000
*/*                                                                  */ 07940000
*/*      Privilege space usage data area                             */ 07950000
*/*                                                                  */ 07960000
*/********************************************************************/ 07970000
*DECLARE                                                                07980000
*   1 LMDPDATA BASED,                                                   07990000
*     3 LMDPEYE  CHAR(4),          /* Area eyecatcher                */ 08000000
*     3 LMDPLEN  FIXED(16),        /* Length of section        @Z25BK*/ 08005000
*     3 *        CHAR(2),          /* Reserved                 @Z25BK*/ 08010000
*     3 LMDPNEXT PTR(64),          /* Next LMDP entry                */ 08020000
*       5   *        BIT(32),                                           08030000
*       5   LMDPNXT4 PTR(31),   /*     31-bit part of LMDPNEXT       */ 08040000
*     3 LMDPTYPE CHAR(1),          /* Resource type                  */ 08050000
*     3 LMDPSTS  BIT(8),           /* Privilege support status          08060000
*                                        for this resource           */ 08070000
*         7 LMDPSACT BIT(1),       /*   Privilege support active     */ 08080000
*         7 LMDPSMSG BIT(1),       /*   Message issued indicating       08090000
*                                        privilege support no longer    08100000
*                                        active                      */ 08110000
*         7 LMDPSSHO BIT(1),       /*   Non-privileged resource         08120000
*                                        shortage exists             */ 08130000
*         7 LMDPSSML BIT(1),       /*   Small environment active     */ 08140000
*     3 *        FIXED(16),        /* Reserved                       */ 08150000
*     3 LMDPNAME CHAR(8),          /* Resource name                  */ 08160000
*     3 LMDPPUSP FIXED(16),        /* Percentage of in-use              08170000
*                                        privileged resource         */ 08180000
*     3 *        FIXED(16),        /* Reserved                       */ 08190000
*     3 LMDPPMAX FIXED(32),        /* Maximum count of privileged       08200000
*                                        resource              @Z25BK*/ 08210000
*     3 LMDPPUSE FIXED(32),        /* Count of privileged resource      08220000
*                                        in-use                @Z25BK*/ 08230000
*     3 LMDPDESC CHAR(20),         /* Descriptive resource name      */ 08240000
*     3 LMDPSTMT CHAR(16),         /* Resource limit statement       */ 08250000
*     3 LMDPKEYW CHAR(20);         /*   and keyword                  */ 08260000
*   DCL LMDPEYEC  CHAR(4) CONSTANT('LMDP'); /* LMDPDATA eyecatcher   */ 08270000
*   DCL LMDPBASL FIXED(15) CONSTANT(LENGTH(LMDPDATA)); /* Size of       08271000
*                                        LMDPDATA section      @Z25BK*/ 08274000
*/********************************************************************/ 08280000
*/*                                                                  */ 08290000
*/*      Top 100 by Count data area                                  */ 08300000
*/*                                                                  */ 08310000
*/********************************************************************/ 08320000
*DECLARE                                                                08330000
*   1 LMTCDATA BASED,                                                   08340000
*     3 LMTCEYE  CHAR(4),          /* Area eyecatcher                */ 08350000
*     3 LMTCLEN  FIXED(16),        /* Length of section        @Z25BK*/ 08355000
*     3 *        CHAR(2),          /* Reserved                 @Z25BK*/ 08360000
*     3 LMTCNEXT PTR(64),          /* Next LMTC entry                */ 08370000
*       5   *        BIT(32),                                           08380000
*       5   LMTCNXT4 PTR(31),   /*     31-bit part of LMTCNEXT       */ 08390000
*     3 LMTCTYPE CHAR(1),          /* Resource type                  */ 08400000
*     3 *        FIXED(24),        /* Reserved                       */ 08410000
*     3 LMTCHCT  FIXED(32),        /* Total count of resource allocated 08420000
*                                        by the largest consumer in     08430000
*                                        the listed jobs             */ 08440000
*     3 LMTCLCT  FIXED(32),        /* Total count of resource allocated 08450000
*                                        by the lowest consumer in      08460000
*                                        the listed jobs             */ 08470000
*     3 LMTCNAME CHAR(8),          /* Resource name                  */ 08480000
*     3 LMTCDESC CHAR(20),         /* Descriptive resource name      */ 08490000
*     3 LMTCSTMT CHAR(16),         /* Resource limit statement       */ 08500000
*     3 LMTCKEYW CHAR(20),         /*   and keyword                  */ 08510000
*     3 *        CHAR(4),          /* Reserved                       */ 08520000
*     3 LMTCLMCE PTR(64),          /* Top 100 by count entry (LMCEDATA) 08530000
*                                        chain head                  */ 08540000
*       5   *        BIT(32),                                           08550000
*       5   LMTCLMC4 PTR(31);   /*     31-bit part of LMTCLMCE       */ 08560000
*   DCL LMTCEYEC  CHAR(4) CONSTANT('LMTC'); /* LMTCDATA eyecatcher   */ 08570000
*   DCL LMTCBASL FIXED(15) CONSTANT(LENGTH(LMTCDATA)); /* Size of       08571000
*                                        LMTCDATA section      @Z25BK*/ 08574000
*DECLARE                                                                08580000
*   1 LMCEDATA BASED,                                                   08590000
*     3 LMCEEYE  CHAR(4),          /* Area eyecatcher                */ 08600000
*     3 LMCELEN  FIXED(16),        /* Length of section        @Z25BK*/ 08605000
*     3 *        CHAR(2),          /* Reserved                 @Z25BK*/ 08610000
*     3 LMCENEXT PTR(64),          /* Next LMCE entry                */ 08620000
*       5   *        BIT(32),                                           08630000
*       5   LMCENXT4 PTR(31),   /*     31-bit part of LMCENEXT       */ 08640000
*     3 LMCETYPE CHAR(1),          /* Resource type                  */ 08650000
*     3 LMCEFLG1 BIT(8),           /* Indicator flag 1               */ 08660000
*         7 LMCE1EXE BIT(1),       /*   Job is executing             */ 08670000
*         7 LMCE1NOT BIT(1),       /*   Job is not executing on this    08680000
*                                        member                      */ 08690000
*         7 LMCE1TC0 BIT(1),       /*   Job total resource count        08700000
*                                        is zero                     */ 08710000
*         7 LMCE1RT0 BIT(1),       /*   Job resource allocation rate    08720000
*                                        is zero                     */ 08730000
*     3 LMCEBUSY FIXED(8),         /* MAS member where job is or was    08740000
*                                        executing             @Z25BK*/ 08750000
*     3 *        CHAR(1),          /* Reserved                       */ 08755000
*     3 LMCEPRCT FIXED(16),        /* Percentage of total allocated     08760000
*                                        resource represented by this   08770000
*                                        job resource alloc    @Z25BK*/ 08780000
*     3 *        FIXED(16),        /* Reserved                       */ 08790000
*     3 LMCERATE FIXED(32),        /* Resource allocation rate of this  08800000
*                                        resource by this job           08810000
*                                        times 1000            @Z25BK*/ 08815000
*     3 LMCEECNT FIXED(32),        /* Total count of allocated          08820000
*                                        resource by this job        */ 08830000
*     3 LMCEMBRN CHAR(4),          /* MAS member executing this job  */ 08840000
*     3 LMCEJOBN CHAR(8),          /* Job name                       */ 08850000
*     3 LMCEJOBI CHAR(8),          /* Job ID                         */ 08860000
*     3 LMCENAME CHAR(8),          /* Resource name            @Z25BK*/ 08870000
*     3 LMCEJOBK FIXED(32),        /* Job key                  @Z25BK*/ 08871000
*     3 LMCEJOWN CHAR(8),          /* Job owner              @Z25LENZ*/ 08874000
*     3 LMCESNAM CHAR(4),          /* JES2 subsystem name that is or    08875000
*                                       was executing this job          08876000
*                                                              @Z25DD*/ 08877000
*     3 *        CHAR(4);          /* Reserved                 @Z25DD*/ 08878000
*   DCL LMCEEYEC  CHAR(4) CONSTANT('LMCE'); /* LMCEDATA eyecatcher   */ 08880000
*   DCL LMCEENTS FIXED(15) CONSTANT(LENGTH(LMCEDATA)); /* Size of       08883000
*                                        LMCEDATA section      @Z25BK*/ 08886000
*/********************************************************************/ 08890000
*/*                                                                  */ 08900000
*/*      Top 100 by Rate data area                                   */ 08910000
*/*                                                                  */ 08920000
*/********************************************************************/ 08930000
*DECLARE                                                                08940000
*   1 LMTRDATA BASED,                                                   08950000
*     3 LMTREYE  CHAR(4),          /* Area eyecatcher                */ 08960000
*     3 LMTRLEN  FIXED(16),        /* Length of section        @Z25BK*/ 08965000
*     3 *        CHAR(2),          /* Reserved                 @Z25BK*/ 08970000
*     3 LMTRNEXT PTR(64),          /* Next LMTR entry                */ 08980000
*       5   *        BIT(32),                                           08990000
*       5   LMTRNXT4 PTR(31),   /*     31-bit part of LMTRNEXT       */ 09000000
*     3 LMTRTYPE CHAR(1),          /* Resource type                  */ 09010000
*     3 *        FIXED(24),        /* Reserved                       */ 09020000
*     3 LMTRHCT  FIXED(32),        /* Resource allocation rate          09030000
*                                        by the largest consumer in     09040000
*                                        the listed jobs             */ 09050000
*     3 LMTRLCT  FIXED(32),        /* Resource allocation rate          09060000
*                                        by the lowest consumer in      09070000
*                                        the listed jobs             */ 09080000
*     3 LMTRNAME CHAR(8),          /* Resource name                  */ 09090000
*     3 LMTRDESC CHAR(20),         /* Descriptive resource name      */ 09100000
*     3 LMTRSTMT CHAR(16),         /* Resource limit statement       */ 09110000
*     3 LMTRKEYW CHAR(20),         /*   and keyword                  */ 09120000
*     3 *        CHAR(4),          /* Reserved                       */ 09130000
*     3 LMTRLMRE PTR(64),          /* Top 100 by count entry (LMREDATA) 09140000
*                                        chain head                  */ 09150000
*       5   *        BIT(32),                                           09160000
*       5   LMTRLMR4 PTR(31);   /*     31-bit part of LMTRLMRE       */ 09170000
*   DCL LMTREYEC  CHAR(4) CONSTANT('LMTR'); /* LMTRDATA eyecatcher   */ 09180000
*   DCL LMTRBASL FIXED(15) CONSTANT(LENGTH(LMTRDATA)); /* Size of       09183000
*                                        LMTRDATA section      @Z25BK*/ 09186000
*DECLARE                                                                09190000
*   1 LMREDATA BASED,                                                   09200000
*     3 LMREEYE  CHAR(4),          /* Area eyecatcher                */ 09210000
*     3 LMRELEN  FIXED(16),        /* Length of section        @Z25BK*/ 09215000
*     3 *        CHAR(2),          /* Reserved                 @Z25BK*/ 09220000
*     3 LMRENEXT PTR(64),          /* Next LMRE entry                */ 09230000
*       5   *        BIT(32),                                           09240000
*       5   LMRENXT4 PTR(31),   /*     31-bit part of LMRENEXT       */ 09250000
*     3 LMRETYPE CHAR(1),          /* Resource type                  */ 09260000
*     3 LMREFLG1 BIT(8),           /* Indicator flag 1               */ 09270000
*         7 LMRE1EXE BIT(1),       /*   Job is executing             */ 09280000
*         7 LMRE1NOT BIT(1),       /*   Job is not executing on this    09290000
*                                        member                      */ 09300000
*         7 LMRE1TC0 BIT(1),       /*   Job total resource count        09310000
*                                        is zero                     */ 09320000
*         7 LMRE1RT0 BIT(1),       /*   Job resource allocation rate    09330000
*                                        is zero                     */ 09340000
*     3 LMREBUSY FIXED(8),         /* MAS member where job is or was    09350000
*                                        executing             @Z25BK*/ 09360000
*     3 *        CHAR(1),          /* Reserved                       */ 09365000
*     3 LMREPRCT FIXED(16),        /* Percentage of total allocated     09370000
*                                        resource represented by this   09380000
*                                        job resource alloc    @Z25BK*/ 09390000
*     3 *        FIXED(16),        /* Reserved                       */ 09400000
*     3 LMRERATE FIXED(32),        /* Resource allocation rate of this  09410000
*                                        resource by this job           09420000
*                                        times 1000            @Z25BK*/ 09425000
*     3 LMREECNT FIXED(32),        /* Total count of allocated          09430000
*                                        resource by this job        */ 09440000
*     3 LMREMBRN CHAR(4),          /* MAS member executing this job  */ 09450000
*     3 LMREJOBN CHAR(8),          /* Job name                       */ 09460000
*     3 LMREJOBI CHAR(8),          /* Job ID                         */ 09470000
*     3 LMRENAME CHAR(8),          /* Resource name            @Z25BK*/ 09480000
*     3 LMREJOBK FIXED(32),        /* Job key                  @Z25BK*/ 09483000
*     3 LMREJOWN CHAR(8),          /* Job owner              @Z25LENZ*/ 09486000
*     3 LMRESNAM CHAR(4),          /* JES2 subsystem name that is or    09487000
*                                       was executing this job          09488000
*                                                              @Z25DD*/ 09489000
*     3 *        CHAR(4);          /* Reserved                 @Z25DD*/ 09489500
*   DCL LMREEYEC  CHAR(4) CONSTANT('LMRE'); /* LMREDATA eyecatcher   */ 09490000
*   DCL LMREENTS FIXED(15) CONSTANT(LENGTH(LMREDATA)); /* Size of       09492000
*                                        LMREDATA section      @Z25BK*/ 09495000
* % IAZLIMDEND: ;                                                       09500000
* @Logic;                                                               09510000
* #PRAGMA TOOL=PADI.                                                    09520000
* #PADIDELETE.LIMDSTOR                                                  09530000
* #PADIDELETE.LIMDSTID                                                  09540000
* #PADIDELETE.LIMDSTHL                                                  09550000
* #PADIDELETE.LIMDSTSP                                                  09560000
* #PADIDELETE.LIMDSTPL                                                  09570000
* #PADIDELETE.LIMDSTTL                                                  09580000
* #PADIDELETE.LIMDSTNX                                                  09590000
* #PADIDELETE.LIMDSTCP                                                  09600000
* #PADIDELETE.LIMDDATA                                                  09610000
* #PADIDELETE.LIMDSTSZ                                                  09620000
* #PADIDELETE.LMDUBASL                                                  09630000
* #PADIDELETE.LMUHENTS                                                  09640000
* #PADIDELETE.LMDPBASL                                                  09650000
* #PADIDELETE.LMTCBASL                                                  09660000
* #PADIDELETE.LMCEENTS                                                  09670000
* #PADIDELETE.LMTRBASL                                                  09680000
* #PADIDELETE.LMREENTS                                                  09690000
* #PADIDELETE.LIMDRESM                                                  09700000
* #PADIDELETE.LIMDEYEC                                                  09710000
* #PADIDELETE.LMDUEYEC                                                  09720000
* #PADIDELETE.LMUHEYEC                                                  09730000
* #PADIDELETE.LMDPEYEC                                                  09740000
* #PADIDELETE.LMTCEYEC                                                  09750000
* #PADIDELETE.LMCEEYEC                                                  09760000
* #PADIDELETE.LMTREYEC                                                  09770000
* #PADIDELETE.LMREEYEC                                                  09780000
* #PADIDELETE.LMDSDATA                                                  09790000
* #PADIDELETE.LMDSEYE                                                   09800000
* #PADIDELETE.LMDSNEXT                                                  09810000
* #PADIDELETE.LMDSFLG1                                                  09820000
* #PADIDELETE.LMDSBASL                                                  09830000
*#EPRAGMA                                                               09860000
*@ENDLOGIC;                                                             09870000
*/*                          END OF MACRO                            */ 99999999
