*  %GOTO LGFPRO; /*                                                     00010000
         MACRO                                                          00020000
         IAZLGINF &DSECT=YES,&LIST=YES                                  00030000
*          */                                                           00040000
*  %LGFPRO: ;                                                           00050000
*/**** START OF SPECIFICATIONS *******************************          00060000
.****PROPRIETARY-STATEMENT************************************          00070000
.*01* PROPRIETARY STATEMENT:                                 *          00080000
.*                                                           *          00090000
.*    LICENSED MATERIALS-PROPERTY OF IBM                     *          00100000
.*    5650-ZOS Copyright IBM Corp. 2015                      *          00110000
.*                                                           *          00120000
.*    STATUS:  HBB77A0                                       *          00130000
.*                                                           *          00140000
.****END-OF-PROPRIETARY-STATEMENT*****************************          00150000
**************************************************************          00160000
*                                                            *          00170000
*01* Descriptive name:  JES EVENTLOG record prefix           *          00180000
*                                                            *          00190000
*02*  Acronym:  IAZLGINF                                     *          00200000
*                                                            *          00210000
*01* Macro name:  IAZLGINF                                   *          00220000
*                                                            *          00230000
*01* DSECT name:  IAZLGINF                                   *          00240000
*01* Label prefix:  LGP                                      *          00250000
*                                                            *          00260000
*01* Component ID:  JES Common (SC141)                       *          00270000
*                                                            *          00280000
*01* External classification:  PSPI                          *          00290000
*01* End of external classification:                         *          00300000
*                                                            *          00310000
*01* Eye-catcher:  none                                      *          00320000
*02*  Offset:                                                *          00330000
*02*  Length:                                                *          00340000
*                                                            *          00350000
*01* Storage attributes:                                     *          00360000
*02*  Subpool:  Caller                                       *          00370000
*02*  Key:  Any                                              *          00380000
*02*  Residency:                                             *          00390000
*      Virtual and real storage are anywhere.                *          00400000
*                                                            *          00410000
*01* Size:                                                   *          00420000
*                                                            *          00430000
*     variable                                               *          00440000
*                                                            *          00450000
*01* Created by:                                             *          00460000
*                                                            *          00470000
*     IAZLGDAT invocation                                    *          00480000
*                                                            *          00490000
*01* Pointed to by:                                          *          00500000
*                                                            *          00510000
*     not applicable                                         *          00520000
*                                                            *          00530000
*01* Serialization:                                          *          00540000
*                                                            *          00550000
*     None required                                          *          00560000
*                                                            *          00570000
*01* Function:                                               *          00580000
*                                                            *          00590000
*     This macro maps the prefix of a record written to      *          00600000
*     the EVENTLOG data set. The IAZLGDT service uses        *          00610000
*     this mapping.                                          *          00620000
*                                                            *          00630000
*01* Method of access:                                       *          00640000
*                                                            *          00650000
*02*  ASM:                                                   *          00660000
*      IAZLGINF       Provides DSECT for IAZLGINF            *          00670000
*                                                            *          00680000
*02*  PL/X:                                                  *          00690000
*                                                            *          00700000
*      %DCL LGP_ATRB CHAR                                    *          00710000
*      %LGP_ATRB = 'value'                                   *          00720000
*      %INCLUDE SYSLIB(IAZLGINF)                             *          00730000
*                                                            *          00740000
*      where 'value' is a valid variable storage attribute,  *          00750000
*      e.g. 'BASED(LGPPTR@)'. If %LGP_ATRB was not set,      *          00760000
*      it defaults to 'BASED BDY(DWORD)'.                    *          00770000
*                                                            *          00780000
*01* Used by:                                                *          00790000
*                                                            *          00800000
*     IAZLGDT EVENTLOG data service, JES GET processing      *          00810000
*                                                            *          00820000
*01* Deleted by:                                             *          00830000
*                                                            *          00840000
*     not applicable                                         *          00850000
*                                                            *          00860000
*01* Frequency:                                              *          00870000
*                                                            *          00880000
*      not applicable                                        *          00890000
*                                                            *          00900000
*01* Restrictions:                                           *          00910000
*                                                            *          00920000
*     None                                                   *          00930000
*                                                            *          00940000
****** END OF SPECIFICATIONS ********************************/          00950000
*/********************************************************************/ 00960000
*/*01* CHANGE ACTIVITY:                                              */ 00970000
*/*                                                                  */ 00980000
*/* $Z22LEVT=EVENTLOG HBB77A0 140410 BWT:  EVENTLOG data set support */ 00990000
*/*                                                                  */ 01000000
*/* A000000-999999    CREATED FOR Z/OS RELEASE 2.2           @Z22LEVT*/ 01010000
*/********************************************************************/ 01020000
*/************************************************************          01030000
*01* NOTES:                                                  *          01040000
*     None                                                   *          01050000
*************************************************************/          01060000
*                                                                       01070000
*  %GOTO LGPDCL; /*                                                     01080000
         GBLB  &IAZLGIF                                                 01090000
         AIF   (&IAZLGIF).END                                           01100000
&IAZLGIF SETB  1                                                        01110000
         PUSH  PRINT                                                    01120000
         AIF   ('&LIST' EQ 'YES').MAP1                                  01130000
         PRINT OFF                                                      01140000
.MAP1    ANOP                                                           01150000
IAZLGINF DSECT                                                          01160000
LGPREFIX DS    0XL8                Full EVENTLOG record prefix          01170000
LGPLENG  DS    XL1                 Record prefix length                 01180000
LGPRLEN  DS    XL2                 EVENTLOG record length,             C01190000
                                     excluding the prefix               01200000
LGPRTYP  DS    XL2                 EVENTLOG record type                 01210000
LGPRTYPT EQU   LGPRTYP,1,C'A'       - record type                       01220000
LGPRTYPS EQU   LGPRTYP+1,1,C'A'     - record subtype                    01230000
LGPFLAG  DS    BL1                 EVENTLOG record flags               C01240000
                                     REQUIRED record (first            C01250000
                                       two bits are OFF)                01260000
LGP1STND EQU   B'10000000'           STANDARD record                    01270000
LGP1VERB EQU   B'01000000'           VERBOSE record                     01280000
         SPACE 1                                                        01290000
         DS    XL2                 Reserved                             01300000
LGPRFLN  EQU   *-IAZLGINF          Length of prefix area                01310000
LGPREC   EQU   *                   Start of record data                 01320000
         SPACE 1                                                        01330000
**************************************************************          01340000
*                                                            *          01350000
*        Data set "views" recognized by JES GET processing   *          01360000
*        are converted to these numeric equivalents which    *          01370000
*        are used to filter EVENTLOG records. These numeric  *          01380000
*        values must match the type definitions found in     *          01390000
*        macro IAZLGDDF.                                     *          01400000
*                                                            *          01410000
**************************************************************          01420000
         SPACE 1                                                        01430000
LGPRSMF  EQU   01                  SMF record type                      01440000
LGPRSTEP EQU   02                  Step Completion Code record type     01450000
LGPRRST  EQU   03                  Job restart record type              01460000
LGPRTRC  EQU   04                  Trace record type                    01470000
LGPRUSER EQU   05                  User record type                     01480000
LGPRSFST EQU   255                 SMF STEP records (SMF type          C01490000
                                     30 subtype 4 records)     @Z22LEVT 01500000
         POP   PRINT                                                    01510000
.END     MEND  , -         */                                           01520000
*  %LGPDCL: ;                                                           01530000
*                                                                       01540000
*  %IF LGP_ATRB = '' %THEN                                              01550000
*    %LGP_ATRB = 'BASED BDY(DWORD)';                                    01560000
*                                                                       01570000
*DCL 1 IAZLGINF LGP_ATRB,           /* EVENTLOG record prefix        */ 01580000
*     3 LGPREFIX      CHAR(8),      /* Record prefix                 */ 01590000
*       5 LGPLENG       FIXED(8),   /* Record prefix length          */ 01600000
*       5 LGPRLEN       FIXED(16),  /* EVENTLOG record length        */ 01610000
*       5 LGPRTYP       FIXED(16),  /* EVENTLOG record type          */ 01620000
*         7   LGPRTYPT  FIXED(8),   /*   - record type               */ 01630000
*         7   LGPRTYPS  FIXED(8),   /*   - record subtype            */ 01640000
*       5 LGPFLAG       BIT(8),     /* EVENTLOG record flags         */ 01650000
*                                   /*   - REQUIRED record (1st two  */ 01660000
*                                   /*       bits are OFF)           */ 01670000
*         7 LGP1STND      BIT(1),   /*   - STANDARD record           */ 01680000
*         7 LGP1VERB      BIT(1),   /*   - VERBOSE record            */ 01690000
*         7 *             BIT(6),   /* Reserved                      */ 01700000
*       5 *             FIXED(16),  /* Reserved                      */ 01710000
*     3 LGPREC        CHAR(0);      /* Start of record data          */ 01720000
*                                                                       01730000
*DCL LGPRFLN FIXED(31) CONSTANT(LENGTH(LGPREFIX));  /* Size of log      01740000
*                                     record prefix structure        */ 01750000
*                                                                       01760000
*/*------------------------------------------------------------------*/ 01770000
*/*   Data set "views" are converted to numeric equivalents and      */ 01780000
*/*   used by JES GET processing to filter EVENTLOG records.         */ 01790000
*/*------------------------------------------------------------------*/ 01800000
* DCL LGPRSMF  FIXED(8) CONSTANT(1);  /* SMF record type             */ 01810000
* DCL LGPRSTEP FIXED(8) CONSTANT(2);  /* Step Completion Code record    01820000
*                                        type                        */ 01830000
* DCL LGPRRST  FIXED(8) CONSTANT(3);  /* Job Restart record type     */ 01840000
* DCL LGPRTRC  FIXED(8) CONSTANT(4);  /* Trace record type           */ 01850000
* DCL LGPRUSER FIXED(8) CONSTANT(5);  /* User record type            */ 01860000
* DCL LGPRSFST FIXED(8) CONSTANT(255);  /* SMF STEP records (SMF type   01870000
*                                        30 subtype 4 recs   @Z22LEVT*/ 99999999
