*        %GOTO LGDDFCMT;          /* Bilingual Mapping Macro            00010000
         MACRO                                                          00020000
         IAZLGDDF &DSECT=YES                                            00030000
.*/      %LGDDFCMT: ;                                                   00040000
*                                                                       00050000
*/**** START OF SPECIFICATIONS *******************************          00060000
.****PROPRIETARY-STATEMENT********************************************  00070000
.*01* PROPRIETARY STATEMENT:                                         *  00080000
.*                                                                   *  00090000
.*   LICENSED MATERIALS-PROPERTY OF IBM                              *  00100000
.*   5650-ZOS Copyright IBM Corp. 2015                               *  00110000
.*                                                                   *  00120000
.*   STATUS:  HBB77A0                                                *  00130000
.*                                                                   *  00140000
.****END-OF-PROPRIETARY-STATEMENT*************************************  00150000
*                                                            *          00160000
*01* DESCRIPTIVE NAME:  Parameter list used by the EVENTLOG  *          00170000
*                       data service IAZLGDT.                *          00180000
*                                                            *          00190000
*02*  ACRONYM:  IAZLGDDF                                     *          00200000
*                                                            *          00210000
*01* MACRO NAME:  IAZLGDDF                                   *          00220000
*                                                            *          00230000
*01* DSECT NAME:  LGDTPLST                                   *          00240000
*01* LABEL PREFIX:  LGD                                      *          00250000
*                                                            *          00260000
*01* COMPONENT ID:  JES2 (SC1BH)                             *          00270000
*                                                            *          00280000
*01* EXTERNAL CLASSIFICATION:  GUPI                          *          00290000
*01* END OF EXTERNAL CLASSIFICATION:                         *          00300000
*                                                            *          00310000
*01* EYE-CATCHER:  'LGDTPLST'                                *          00320000
*02*  OFFSET:      LGDEYE                                    *          00330000
*02*  LENGTH:      L'LGDEYE                                  *          00340000
*                                                            *          00350000
*01* STORAGE ATTRIBUTES:                                     *          00360000
*02*  SUBPOOL:    determined by caller of the service        *          00370000
*02*  KEY:        determined by caller of the service        *          00380000
*02*  RESIDENCY:                                             *          00390000
*      Virtual - anywhere is 31-bit storage                  *          00400000
*      Real    - anywhere in 64 bit storage                  *          00410000
*                                                            *          00420000
*01* SIZE:                                                   *          00430000
*                                                            *          00440000
*     See LGDLEN                                             *          00450000
*                                                            *          00460000
*01* CREATED BY:                                             *          00470000
*                                                            *          00480000
*     IAZLGDDF macro invocation by caller                    *          00490000
*                                                            *          00500000
*01* POINTED TO BY:                                          *          00510000
*                                                            *          00520000
*     Register one when branching to IAZLGDT service module  *          00530000
*                                                            *          00540000
*01* SERIALIZATION:                                          *          00550000
*                                                            *          00560000
*     None required                                          *          00570000
*                                                            *          00580000
*01* FUNCTION:                                               *          00590000
*                                                            *          00600000
*     Defines the parameters for issuing a write or read     *          00610000
*     record request. The storage includes the input         *          00620000
*     parameters to the EVENTLOG data service.               *          00630000
*                                                            *          00640000
*01* METHOD OF ACCESS:                                       *          00650000
*                                                            *          00660000
*02*  ASM:                                                   *          00670000
*      IAZLGDDF DSECT=YES!NO                                 *          00680000
*                                                            *          00690000
*        DSECT=YES  - Generate DSECT statement for           *          00700000
*                     the parameter list structure           *          00710000
*                                                            *          00720000
*        DSECT=NO   - Do not generate DSECT statement.       *          00730000
*                     Could be used to reserve space for     *          00740000
*                     the parameter list in the current      *          00750000
*                     CSECT or DSECT.                        *          00760000
*                                                            *          00770000
*02*  PL/X:                                                  *          00780000
*      %DCL LGDP_ATRB CHAR                                   *          00790000
*      %LGDP_ATRB = 'value'                                  *          00800000
*      %INCLUDE SYSLIB(IAZLGDDF)                             *          00810000
*                                                            *          00820000
*      where 'value' is a valid variable storage attribute,  *          00830000
*      e.g. 'BASED(LGDPTR@)'. If %LGDP_ATRB was not set,     *          00840000
*      it defaults to 'BASED BDY(DWORD)'.                    *          00850000
*                                                            *          00860000
*01* USED BY:                                                *          00870000
*                                                            *          00880000
*     EVENTLOG data service.                                 *          00890000
*                                                            *          00900000
*01* DELETED BY:                                             *          00910000
*                                                            *          00920000
*     Caller.                                                *          00930000
*                                                            *          00940000
*01* FREQUENCY:                                              *          00950000
*                                                            *          00960000
*     One per call to service                                *          00970000
*                                                            *          00980000
*01* RESTRICTIONS:                                           *          00990000
*                                                            *          01000000
*     None                                                   *          01010000
*                                                            *          01020000
****** END OF SPECIFICATIONS ********************************/          01030000
*/********************************************************************  01040000
*01* CHANGE ACTIVITY:                                                *  01050000
* $Z22LEVT=EVENTLOG HBB77A0 140410 BWT:  EVENTLOG data set support p  * 01060000
*                                                                    *  01070000
*01* A000000-999999    Created for z/OS rel 2.2                @Z22LEVT 01080000
*********************************************************************/  01090000
*/*                                                                 */  01100000
* % GOTO END_OF_ASM_LGDTPLST; /*                                        01110000
*                                                                       01120000
         SPACE 1                                                        01130000
**************************************************************          01140000
*                                                            *          01150000
*        LGDTPLIST is the parameter list used by the         *          01160000
*        EVENTLOG data service (IAZLGDT). A pointer to the   *          01170000
*        parameter list is passed to the service module      *          01180000
*        IAZLGDT in register 1.                              *          01190000
*                                                            *          01200000
**************************************************************          01210000
         SPACE 1                                                        01220000
         AIF   ('&DSECT' EQ 'YES').LGDDS,                              C01230000
               ('&DSECT' EQ 'NO').LGDNODS                               01240000
         MNOTE 8,'IAZLGDDF:  DSECT= must be either YES or NO'           01250000
         AGO   .LGDMEND                                                 01260000
.LGDDS   ANOP                                                           01270000
LGDTPLST DSECT ,                   EVENTLOG data service req            01280000
         AGO   .LGDDATA                                                 01290000
.LGDNODS ANOP                                                           01300000
LGDTPLST DS    0D                  EVENTLOG data service req            01310000
.LGDDATA ANOP                                                           01320000
         SPACE 1                                                        01330000
LGDEYE   DS    CL8'LGDTPLST'       Eyecatcher                           01340000
LGDLEN   DS    F                   Length of parameter list             01350000
LGDFUNC  DS    XL1                 Function to perform                  01360000
LGDWRITE EQU   1                     Write the log record               01370000
LGDLEVEL DS    BL1                 Level of data requested             C01380000
                                     REQUIRED level (first             C01390000
                                       two bits are OFF)                01400000
LGDLREQD EQU   B'00000000'           REQUIRED level                     01410000
LGDLSTND EQU   B'10000000'           STANDARD level                     01420000
LGDLVERB EQU   B'01000000'           VERBOSE level                      01430000
LGDLBADB EQU   B'00111111'           Invalid level bit settings        C01440000
                                       If a new level is defined       C01450000
                                       its corresponding bit in        C01460000
                                       LGDLBADB should be set to 0      01470000
LGDRTYP  DS    XL2                 EVENTLOG record type                 01480000
LGDRTYPT EQU   LGDRTYP,1,C'A'       - record type                       01490000
LGDRTYPS EQU   LGDRTYP+1,1,C'A'     - record subtype                    01500000
LGDDLEN  DS    F                   Length of log data                   01510000
LGDWALEN DS    F                   Length of user supplied             C01520000
                                     work area. Should be              C01530000
                                     LGSSIZE+length of log data+       C01540000
                                     length of LGPREFIX in             C01550000
                                     macro IAZLGINF                     01560000
LGDDATAP DS    AD(*-*)             Address of log data                  01570000
LGDDATA4 EQU   LGDDATAP+4,4,C'A'     31-bit part of address             01580000
LGDWORKP DS    AD(*-*)             Address of work area                 01590000
LGDWORK4 EQU   LGDWORKP+4,4,C'A'     31-bit part of address             01600000
LGDRETCD DS    F                   Overall return code                  01610000
LGDRSUCC EQU   X'00'               Successful completion.               01620000
LGDRNOTW EQU   X'04'               Record not written.                  01630000
LGDRNOST EQU   X'08'               No storage available for            C01640000
                                     work area                          01650000
LGDRBADP EQU   X'10'               Parameter list address or           C01660000
                                     length is zero                     01670000
LGDRERR  EQU   X'14'               Request not processed due           C01680000
                                     to error                           01690000
LGDRBADF EQU   X'18'               Invalid function requested           01700000
LGDRNACB EQU   X'1C'               ACB for the data set not found       01710000
LGDRNOUT EQU   X'20'               Log data pointer or length          C01720000
                                     is zeroes                          01730000
LGDRINWA EQU   X'24'               Insufficient space in caller        C01740000
                                     supplied work area                 01750000
LGDRMAXL EQU   X'28'               Log data length > maximum            01760000
LGDRLHLD EQU   X'2C'               Local lock already held              01770000
LGDRFRR  EQU   X'30'               FRR active, request failed           01780000
LGDRBADT EQU   X'34'               Bad record type                      01790000
LGDRBADL EQU   X'38'               Bad level indicator                  01800000
LGDRNAUT EQU   X'3C'               Not running authorized               01810000
LGDRABND EQU   X'40'               ABEND occurred proc request          01820000
LGDRRECS EQU   X'44'               Record type(s) are being            C01830000
                                     suppressed                         01840000
LGDREQSZ DS    F                   Size of user supplied work          C01850000
                                     area required.                     01860000
LGDTPLN  EQU   *-LGDTPLST          Length of LGDTPLST DSECT             01870000
         SPACE 1                                                        01880000
LGDLRMXL EQU   32752               Max size log data record             01890000
         SPACE 1                                                        01900000
**************************************************************          01910000
*                                                            *          01920000
*        EVENTLOG record types recognized by the EVENTLOG    *          01930000
*        data service IAZLGDT, converted to numeric          *          01940000
*        equivalents                                         *          01950000
*                                                            *          01960000
**************************************************************          01970000
         SPACE 1                                                        01980000
LGDTSMF  EQU   01                  SMF record type                      01990000
LGDTSTEP EQU   02                  Step Completion Code record type     02000000
LGDTRST  EQU   03                  Job restart record type              02010000
LGDTTRC  EQU   04                  Trace record type                    02020000
LGDTUSER EQU   05                  User record type                     02030000
.LGDMEND MEND                                                           02040000
.*                                                                      02050000
.*                                                                      02060000
**/                                                                     02070000
*  %END_OF_ASM_LGDTPLST: ;                                              02080000
*  %IF LGDP_ATRB = '' %THEN                                             02090000
*    %LGDP_ATRB = 'BASED BDY(DWORD)';                                   02100000
*                                                                       02110000
*/********************************************************************/ 02120000
*/*                                                                  */ 02130000
*/*   PLX interface for IAZLGDAT                                     */ 02140000
*/*                                                                  */ 02150000
*/********************************************************************/ 02160000
*                                                                       02170000
*/*------------------------------------------------------------------*/ 02180000
*/*   Eyecatcher for LGDTPLST                                        */ 02190000
*/*------------------------------------------------------------------*/ 02200000
* DCL LGDTID   CHAR(8)  CONSTANT('LGDTPLST');                           02210000
*                                                                       02220000
*                                                                       02230000
*/*------------------------------------------------------------------*/ 02240000
*/*   LGDTPLST parameter list for IAZLGDT EVENTLOG data service      */ 02250000
*/*   module.                                                        */ 02260000
*/*------------------------------------------------------------------*/ 02270000
* DCL                                                                   02280000
*   1   LGDTPLST  LGDP_ATRB,                                            02290000
*     3   LGDEYE      CHAR(8),    /* Eye catcher                     */ 02300000
*     3   LGDLEN      FIXED(31),  /* Length of parameter list        */ 02310000
*     3   LGDFUNC     FIXED(8),   /* Function to perform             */ 02320000
*     3   LGDLEVEL    BIT(8),     /* Level of data requested         */ 02330000
*                                 /*   REQUIRED level (first 2 bits  */ 02340000
*                                 /*     are OFF)                    */ 02350000
*       5   LGDLSTND  BIT(1),     /*   STANDARD level                */ 02360000
*       5   LGDLVERB  BIT(1),     /*   VERBOSE level                 */ 02370000
*       5   *         BIT(6),     /* Reserved                        */ 02380000
*     3   LGDRTYP     FIXED(16),  /* EVENTLOG record type            */ 02390000
*       5   LGDRTYPT  FIXED(8),    /*   - record type                */ 02400000
*       5   LGDRTYPS  FIXED(8),    /*   - record subtype             */ 02410000
*     3   LGDDLEN     FIXED(31),  /* Length of log data              */ 02420000
*     3   LGDWALEN    FIXED(31),  /* Length of work area             */ 02430000
*     3   LGDDATAP    PTR(64),    /* Address of log data             */ 02440000
*       5   *         BIT(32),                                          02450000
*       5   LGDDATA4  PTR(31),    /* 31-bit part of LGDDATAP         */ 02460000
*     3   LGDWORKP    PTR(64),    /* Address of work area            */ 02470000
*       5   *         BIT(32),                                          02480000
*       5   LGDWORK4  PTR(31),    /* 31-bit part of LGDWORKP         */ 02490000
*     3   LGDRETCD    FIXED(31),  /* Overall return code             */ 02500000
*     3   LGDREQSZ    FIXED(31);  /* Size of user supplied work area    02510000
*                                    required                        */ 02520000
*                                                                       02530000
*/*------------------------------------------------------------------*/ 02540000
*/*   Function codes valid for LGDFUNC                               */ 02550000
*/*------------------------------------------------------------------*/ 02560000
* DCL LGDWRITE FIXED(8) CONSTANT(1);    /* Write function            */ 02570000
*                                                                       02580000
*/*------------------------------------------------------------------*/ 02590000
*/*   IAZLGDT return codes in LGDRETCD, IAZLGDAT return codes in R15 */ 02600000
*/*------------------------------------------------------------------*/ 02610000
* DCL LGDRSUCC FIXED(31) CONSTANT(0);   /* Successful completion.    */ 02620000
* DCL LGDRNOTW FIXED(31) CONSTANT(4);   /* Record not written        */ 02630000
* DCL LGDRNOST FIXED(31) CONSTANT(8);   /* No storage available for     02640000
*                                          work area                 */ 02650000
* DCL LGDRBADP FIXED(31) CONSTANT(16);  /* Parameter list address or    02660000
*                                          length is zero            */ 02670000
* DCL LGDRERR  FIXED(31) CONSTANT(20);  /* Request not processed due    02680000
*                                          to error                  */ 02690000
* DCL LGDRBADF FIXED(31) CONSTANT(24);  /* Invalid function requested*/ 02700000
* DCL LGDRNACB FIXED(31) CONSTANT(28);  /* ACB for the data set not     02710000
*                                          found                     */ 02720000
* DCL LGDRNOUT FIXED(31) CONSTANT(32);  /* Log data pointer or length   02730000
*                                          is zeroes                 */ 02740000
* DCL LGDRINWA FIXED(31) CONSTANT(36);  /* Insufficient space in caller 02750000
*                                          provided work area        */ 02760000
* DCL LGDRMAXL FIXED(31) CONSTANT(40);  /* Log data length greater      02770000
*                                          than maximum allowed      */ 02780000
* DCL LGDRLHLD FIXED(31) CONSTANT(44);  /* Local lock already held   */ 02790000
* DCL LGDRFRR  FIXED(31) CONSTANT(48);  /* FRR active, fail request  */ 02800000
* DCL LGDRBADT FIXED(31) CONSTANT(52);  /* Bad record type           */ 02810000
* DCL LGDRBADL FIXED(31) CONSTANT(56);  /* Bad level indicator       */ 02820000
* DCL LGDRNAUT FIXED(31) CONSTANT(60);  /* Not running authorized    */ 02830000
* DCL LGDRABND FIXED(31) CONSTANT(64);  /* ABEND occurred proc req   */ 02840000
* DCL LGDRRECS FIXED(31) CONSTANT(68);  /* Record type(s) are being     02850000
*                                          suppressed                */ 02860000
*                                                                       02870000
* DCL LGDTPLN FIXED(31) CONSTANT(LENGTH(LGDTPLST)); /* Structure size   02880000
*                                     (internal use only)            */ 02890000
* DCL LGDLRMXL FIXED(31) CONSTANT(32752); /* Max log data record size   02900000
*                                                                    */ 02910000
*                                                                       02920000
*/*------------------------------------------------------------------*/ 02930000
*/*   EVENTLOG record types recognized by the EVENTLOG data service  */ 02940000
*/*   IAZLGDT                                                        */ 02950000
*/*------------------------------------------------------------------*/ 02960000
* DCL LGDTSMF  FIXED(8) CONSTANT(1);  /* SMF record type             */ 02970000
* DCL LGDTSTEP FIXED(8) CONSTANT(2);  /* Step Completion Code record    02980000
*                                        type                        */ 02990000
* DCL LGDTRST  FIXED(8) CONSTANT(3);  /* Job Restart record type     */ 03000000
* DCL LGDTTRC  FIXED(8) CONSTANT(4);  /* Trace record type           */ 03010000
* DCL LGDTUSER FIXED(8) CONSTANT(5);  /* User record type            */ 03020000
*                                                                       03030000
*/*                                  End of macro                    */ 99999999
