*        %GOTO LGRSCMTS;          /* Bilingual Mapping Macro            00010000
         MACRO                                                          00020000
         IAZLGRST &DSECT=YES                                            00030000
*          */                                                           00040000
*        %LGRSCMTS: ;                                             /* */ 00050000
*/**** START OF SPECIFICATIONS *******************************          00060000
.****PROPRIETARY-STATEMENT************************************          00070000
.*01* PROPRIETARY STATEMENT:                                 *          00080000
.*                                                           *          00090000
.*    LICENSED MATERIALS-PROPERTY OF IBM                     *          00100000
.*    5650-ZOS Copyright IBM Corp. 2015                      *          00110000
.*    STATUS:  HBB77A0                                       *          00120000
.*                                                           *          00130000
.****END-OF-PROPRIETARY-STATEMENT*****************************          00140000
*                                                            *          00150000
*01* DESCRIPTIVE NAME:  EVENTLOG RESTART record format       *          00160000
*02*  ACRONYM:  IAZLGRST                                     *          00170000
*                                                            *          00180000
*01* MACRO NAME:  IAZLGRST                                   *          00190000
*                                                            *          00200000
*01* DSECT NAME:  RSTREC                                     *          00210000
*01* LABEL PREFIX:  RSTR                                     *          00220000
*                                                            *          00230000
*01* COMPONENT ID:  JES Common (SC141)                       *          00240000
*                                                            *          00250000
*01* EXTERNAL CLASSIFICATION: PSPI                           *          00260000
*01* END OF EXTERNAL CLASSIFICATION:                         *          00270000
*                                                            *          00280000
*01* EYE-CATCHER:  RESTART                                   *          00290000
*02*  OFFSET:      0                                         *          00300000
*02*  LENGTH:      8                                         *          00310000
*                                                            *          00320000
*01* STORAGE ATTRIBUTES:                                     *          00330000
*02*  SUBPOOL:    230                                        *          00340000
*02*  KEY:        1                                          *          00350000
*02*  RESIDENCY:                                             *          00360000
*      Virtual and Real storage are anywhere (above or       *          00370000
*      below 16M) in the private storage of the address      * @430P811 00380000
*      space of the task that is currently running in        * @430P811 00390000
*      the JES2 code.                                        * @430P811 00400000
*                                                            *          00410000
*01* SIZE:                                                   *          00420000
*                                                            *          00430000
*     See RSTRECSZ equate                                    *          00440000
*                                                            *          00450000
*01* CREATED BY:  1) Job termination when a job will be      *          00460000
*                    re-enqueued                             *          00470000
*                 2) Job selection when a job starts         *          00480000
*                    executing after being re-enqueued       *          00490000
*                                                            *          00500000
*01* POINTED TO BY:  N/A                                     *          00510000
*                                                            *          00520000
*01* SERIALIZATION: PUT serialization                        *          00530000
*                                                            *          00540000
*01* FUNCTION:                                               *          00550000
*                                                            *          00560000
*     This DSECT maps the information stored by JES in the   *          00570000
*     EVENTLOG records that are TYPE=RESTART.  This record   *          00580000
*     is written when a job is being re-enqueued for         *          00590000
*     execution and then again when the job re-executes.     *          00600000
*                                                            *          00610000
*                                                            *          00620000
*01* METHOD OF ACCESS:                                       *          00630000
*                                                            *          00640000
*    SPOOL data set browse. Use either of the following      *          00650000
*    data set names:                                         *          00660000
*     - userid.jobname.jobid.D0000008.EVENTLOG for all       *          00670000
*         records and their prefixes                         *          00680000
*     - userid.jobname.jobid.EVENTLOG for all records and    *          00690000
*         their prefixes                                     *          00700000
*     - userid.jobname.jobid.EVENTLOG.RESTART for just the   *          00710000
*         RESTART records, minus their prefix data           *          00720000
*                                                            *          00730000
*     Prefix data in EVENTLOG records is defined by macro    *          00740000
*     IAZLGINF. JES uses it to identify the type of data     *          00750000
*     stored in the record.                                  *          00760000
*                                                            *          00770000
*02*  ASM:                                                   *          00780000
*      IAZLGRST DSECT=YES                                    *          00790000
*                                                            *          00800000
*02*  PL/X:                                                  *          00810000
*      %DCL LGRST_ATRB CHAR                                  *          00820000
*      %LGRST_ATRB = 'value'                                 *          00830000
*      %INCLUDE SYSLIB(IAZLGRST)                             *          00840000
*                                                            *          00850000
*      where value is valid control block attributes,        *          00860000
*      such as 'BASED(RSTRECRD)'.  If LGRST_ATRB='',         *          00870000
*      then 'BASED' will be used.                            *          00880000
*                                                            *          00890000
*01* DELETED BY:  When EVENTLOG data set is purged           *          00900000
*                                                            *          00910000
*01* FREQUENCY:                                              *          00920000
*     - 1 "JOB TERMINATED/RE-ENQUEUED" when the job is       *          00930000
*       re-enqueued                                          *          00940000
*     - 1 "JOB RESTARTED" when the job starts executing      *          00950000
*       after being re-enqueued                              *          00960000
*                                                            *          00970000
*01* RESTRICTIONS:  None                                     *          00980000
*                                                            *          00990000
****** END OF SPECIFICATIONS ********************************/          01000000
*/********************************************************************/ 01010000
*/*01* CHANGE ACTIVITY:                                              */ 01020000
*/* $Z22LEVT=EVENTLOG HBB77A0 140521 BWT:  EVENTLOG Stage 2          */ 01030000
*/*                                                                  */ 01040000
*/*01* A000000-999999    Created for z/OS 2.2                @Z22LEVT*/ 01050000
*/********************************************************************/ 01060000
*/************************************************************          01070000
*01* NOTES:                                                  *          01080000
*                                                            *          01090000
*                                                            *          01100000
*************************************************************/          01110000
*/*                                                                  */ 01120000
* % GOTO END_OF_ASM_LGRS; /*                                            01130000
*                                                                       01140000
         AIF   ('&DSECT' EQ 'YES').LGRDS,                              C01150000
               ('&DSECT' EQ 'NO').LGRNODS                               01160000
         MNOTE 8,'IAZLGRST:  DSECT= must be either YES or NO'           01170000
         AGO   .LGRMEND                                                 01180000
.LGRDS   ANOP                                                           01190000
RSTREC   DSECT ,                   EVENTLOG RESTART record              01200000
         AGO   .LGDDATA                                                 01210000
.LGRNODS ANOP                                                           01220000
RSTREC   DS    0D                  EVENTLOG RESTART record              01230000
.LGDDATA ANOP                                                           01240000
         SPACE 1                                                        01250000
RSTREYEC DS    CL8'RESTART '       RESTART eyecatcher                   01260000
RSTRLEN  DS    H                   Length of RESTART record             01270000
RSTRVER  DS    X                   Version of data                      01280000
RSTRVER1 EQU   1                     Version 1 of IAZLGRST              01290000
RSTRVERC EQU   RSTRVER1              Current version of data            01300000
RSTRFLAG DS    BL1                 RESTART Record flags                 01310000
RSTRETXT EQU   B'10000000'           Re-enqueue text inserted           01320000
RSTRRTXT EQU   B'01000000'           Job restarted text inserted        01330000
RSTRTEXT DS    CL26'JOB TERMINATED/RE-ENQUEUED'  variable txt           01340000
*                  'JOB RESTARTED             '  variable txt           01350000
RSTRSFLG DS    BL1                 JCT restart flags (JCTJSFLG)         01360000
RSTRSTRS EQU   X'80'                 STEP RESTART                       01370000
RSTRCHRS EQU   X'40'                 CHECKPOINT RESTART                 01380000
RSTRCNRS EQU   X'20'                 CONTINUE RESTART                   01390000
RSTRHOLD EQU   X'10'                 HOLD THE JOB                       01400000
RSTRBOPT DS    BL1                 JCT job option flags (JCTJBOPT)     C01410000
                                   (same as CATJBOPT)                   01420000
RSTTHOLD EQU   B'00100000'         TYPRUN=HOLD                          01430000
RSTNOLOG EQU   B'00010000'         NO job log option                    01440000
RSTINRDR EQU   B'00000100'         Job was entered on INTRDR           C01450000
                                     (not used in CATJBOPT             C01460000
                                     field                              01470000
RSTRERUN EQU   B'00000010'         Job was re-run (not used in         C01480000
                                    CATJBOPT field)                     01490000
RSTRSJF2 DS    BL1                 SJB restart flags (SJBFLG2)          01500000
RST2EJST EQU   X'40'                 $EJOB,STEP was processed           01510000
RST2EOM  EQU   X'20'                 END-OF-MEMORY DETECTED             01520000
RST2CNCL EQU   X'10'                 CANCEL AFTER SWA CREATE            01530000
RST2HOLD EQU   X'04'                 HOLD JOB AFTER RE-QUEUE            01540000
RSTRSJF4 DS    BL1                 SJB re-enqueue flgs (SJBFLG4)        01550000
RST4MEND EQU   X'80'                 MSG 'ENDED'                        01560000
RST4MTRM EQU   X'40'                 MSG 'TERMINATED'                   01570000
RST4MREQ EQU   X'20'                 MSG 'RE-ENQUEUED'                  01580000
RST4MREX EQU   X'10'                 MSG 'QUEUED FOR RE-EXECUTION'      01590000
RST4MRQH EQU   X'04'                 MSG 'RE-ENQUEUED AND HELD'         01600000
RST4OCAN EQU   X'02'                 Operator cancelled this SJB        01610000
RST4TERM EQU   X'01'                 BATCH JOB HAS TERMINATED          C01620000
                                      SJB4TERM DIRECTLY INFLUENCES THE C01630000
                                      CREATION AND DELETION OF THE     C01640000
                                      JSAB                              01650000
         DS    XL6                 Reserved                             01660000
RSTRTIME DS    D                   Time job re-enqueued/restarted      C01670000
                                     (STCK)                             01680000
RSTRSYSN DS    CL8                 JCT execution MVS system name        01690000
RSTRJOBN DS    CL8                 Job name                             01700000
RSTRJBID DS    CL8                 Job ID                               01710000
RSTRSSTP DS    XL2                 Job step to restart (JCTJSSTP)       01720000
RSTRJCOR DS    CL64                Job correlator                       01730000
RSTRSIZ1 EQU   *-RSTREC            Version 1 size of area               01740000
RSTRSIZE EQU   *-RSTREC            Size of area                         01750000
         SPACE 1                                                        01760000
RSTSSI   EQU   C'S'                RESTART rec subtype of "S"           01770000
         SPACE 2                                                        01780000
.LGRMEND MEND  ,                                                        01790000
.*                                                                      01800000
**/                                                                     01810000
* % END_OF_ASM_LGRS: ;                                                  01820000
*                                                                       01830000
* %IF LGRST_ATRB = ''               /* If no attribute is specified  */ 01840000
*   %THEN                                                               01850000
*     %LGRST_ATRB = 'BASED';        /* establish default attribute   */ 01860000
*                                                                       01870000
*DECLARE                                                                01880000
*   1 RSTREC  LGRST_ATRB,                                               01890000
*     3 RSTREYEC     CHAR(8),       /* Eyecatcher ('RESTART ')       */ 01900000
*     3 RSTRLEN      FIXED(15),     /* Length of RESTART record      */ 01910000
*     3 RSTRVER      FIXED(8),      /* Version of data               */ 01920000
*     3 RSTRFLAG     BIT(8),        /* RESTART record flags          */ 01930000
*       5 RSTRETXT   BIT(1),        /*   Re-enqueue text inserted    */ 01940000
*       5 RSTRRTXT   BIT(1),        /*   Job restarted text inserted */ 01950000
*       5 *          BIT(6),        /*   Reserved                    */ 01960000
*     3 RSTRTEXT     CHAR(26),      /* Variable text string          */ 01970000
*     3 RSTRSFLG     BIT(8),        /* JCT restart flags             */ 01980000
*       5 RSTRSTRS   BIT(1),        /*   STEP RESTART                */ 01990000
*       5 RSTRCHRS   BIT(1),        /*   CHECKPOINT RESTART inserted */ 02000000
*       5 RSTRCNRS   BIT(1),        /*   CONTINUE RESTART            */ 02010000
*       5 RSTRHOLD   BIT(1),        /*   HOLD THE JOB                */ 02020000
*       5 *          BIT(4),        /*   Reserved                    */ 02030000
*     3 RSTRBOPT     BIT(8),        /* JCT job option flags          */ 02040000
*       5 *          BIT(2),        /*   Reserved                    */ 02050000
*       5 RSTTHOLD   BIT(1),        /*   TYPRUN=HOLD                 */ 02060000
*       5 RSTNOLOG   BIT(1),        /*   NO job log option           */ 02070000
*       5 *          BIT(1),        /*   Reserved                    */ 02080000
*       5 RSTINRDR   BIT(1),        /*   Job was entered on INTRDR   */ 02090000
*       5 RSTRERUN   BIT(1),        /*   Job was re-run              */ 02100000
*       5 *          BIT(1),        /*   Reserved                    */ 02110000
*     3 RSTRSJF2     BIT(8),        /* SJB restart flags             */ 02120000
*       5 *          BIT(1),        /*   Reserved                    */ 02130000
*       5 RST2EJST   BIT(1),        /*   $EJOB,STEP was processed    */ 02140000
*       5 RST2EOM    BIT(1),        /*   END-OF-MEMORY DETECTED      */ 02150000
*       5 RST2CNCL   BIT(1),        /*   CANCEL AFTER SWA CREATE     */ 02160000
*       5 *          BIT(1),        /*   Reserved                    */ 02170000
*       5 RST2HOLD   BIT(1),        /*   HOLD JOB AFTER RE-QUEUE     */ 02180000
*       5 *          BIT(2),        /*   Reserved                    */ 02190000
*     3 RSTRSJF4     BIT(8),        /* SJB re-enqueue flags          */ 02200000
*       5 RST4MEND   BIT(1),        /*   MSG 'ENDED'                 */ 02210000
*       5 RST4MTRM   BIT(1),        /*   MSG 'TERMINATED'            */ 02220000
*       5 RST4MREQ   BIT(1),        /*   MSG 'RE-ENQUEUED'           */ 02230000
*       5 RST4MREX   BIT(1),        /*   MSG 'QUEUED FOR RE-EXECUTION'  02240000
*                                                                    */ 02250000
*       5 *          BIT(1),        /*   Reserved                    */ 02260000
*       5 RST4MRQH   BIT(1),        /*   MSG 'RE-ENQUEUED AND HELD'  */ 02270000
*       5 RST4OCAN   BIT(1),        /*   Operator cancelled this SJB */ 02280000
*       5 RST4TERM   BIT(1),        /*   BATCH JOB HAS TERMINATED    */ 02290000
*     3 *            CHAR(6),       /* Reserved                      */ 02300000
*     3 RSTRTIME     CHAR(8),       /* Time job re-enqueued/restarted   02310000
*                                      (STCK)                        */ 02320000
*     3 RSTRSYSN     CHAR(8),       /* JCT execution MVS system name */ 02330000
*     3 RSTRJOBN     CHAR(8),       /* Job name                      */ 02340000
*     3 RSTRJBID     CHAR(8),       /* Job ID                        */ 02350000
*     3 RSTRSSTP     FIXED(15),     /* Job step to restart           */ 02360000
*     3 RSTRJCOR     CHAR(64);      /* Job correlator                */ 02370000
*                                                                       02380000
*   DCL RSTRSIZ1  FIXED(15) CONSTANT(146); /* Size of ver 1 RSTREC   */ 02390000
*   DCL RSTRSIZE  FIXED(15) CONSTANT(LENGTH(RSTREC)); /* Sz of RSTREC*/ 02400000
*   DCL RSTRVER1  FIXED(8)  CONSTANT(1); /* Version 1 constant       */ 02410000
*   DCL RSTRVERC  FIXED(8)  CONSTANT(1); /* Current version constant */ 02420000
*   DCL RSTREYE   CHAR(8)   CONSTANT('RESTART '); /* Eyecatcher value*/ 02430000
*   DCL RSTRTXT1  CHAR(26)  CONSTANT('JOB TERMINATED/RE-ENQUEUED');     02440000
*                                   /* Job re-enqueued variable text */ 02450000
*   DCL RSTRTXT2  CHAR(26)  CONSTANT('JOB RESTARTED             ');     02460000
*                                   /* Job restarted variable text   */ 02470000
*                                                                       02480000
* % IAZLGRSTEND: ;                                                      02490000
*/*                          END OF MACRO                            */ 99999999
