*  %GOTO RESPRO; /*                                                     00100000
         MACRO                                                          00200000
         IAZRESPA &LIST=NO                                              00300000
*          */                                                           00400000
*  %RESPRO: ;                                                           00500000
*/**** START OF SPECIFICATIONS ******************************/          00510000
*/***PROPRIETARY-STATEMENT***********************************/          00520000
*/*01* PROPRIETARY STATEMENT:                               */          00530000
*/*                                                         */          00540000
*/*    LICENSED MATERIALS-PROPERTY OF IBM                   */          00550000
*/*    5650-ZOS Copyright IBM Corp. 1983, 2015              */          00560000
*/*                                                         */          00570000
*/*    STATUS = HBB77A0                                     */          00580000
*/*                                                         */          00590000
*/*****END-OF-PROPRIETARY-STATEMENT**************************/          00600000
*/*                                                         */          00610000
*/*01* DESCRIPTIVE NAME:  FSI ORDER response area mapping   */          00620000
*/*02*  ACRONYM:  RESPA                                     */          00630000
*/*                                                         */          00640000
*/*01* MACRO NAME: IAZRESPA                                 */          00650000
*/*                                                         */          00660000
*/*01* DSECT NAME:  IAZRESPA                                */          00670000
*/*01* LABEL PREFIX:  RESP                                  */          00680000
*/*                                                         */          00690000
*/*01* COMPONENT ID:  JES Common (SC141)                    */          00700000
*/*                                                         */          00710000
*/*01* EXTERNAL CLASSIFICATION:  PSPI                       */          00720000
*/*01* END OF EXTERNAL CLASSIFICATION:                      */          00730000
*/*                                                         */          00740000
*/*01* EYE-CATCHER:  RESP                                   */          00750000
*/*02*  OFFSET:      RESPID-IAZRESPA                        */          00760000
*/*02*  LENGTH:      L'RESPID                               */          00770000
*/*                                                         */          00780000
*/*01* STORAGE ATTRIBUTES:                                  */          00790000
*/*02*  SUBPOOL:  230                                       */          00800000
*/*02*  KEY:  1                                             */          00810000
*/*02*  RESIDENCY:                                          */          00820000
*/*      Virtual and real storage is based on the           */          00830000
*/*      addressing mode of the FSS.  If restricted to 24   */          00840000
*/*      bit storage, then the RESPA must be in 24 bit      */          00850000
*/*      storage.  Otherwise it can be anywhere in 31 bit   */          00860000
*/*      storage.                                           */          00870000
*/*                                                         */          00880000
*/*01* SIZE:                                                */          00890000
*/*                                                         */          00900000
*/*     See RESPSIZ (run time length in RESPLEN)            */          00910000
*/*                                                         */          00920000
*/*01* CREATED BY:                                          */          00930000
*/*                                                         */          00940000
*/*     Issuers of FSIREQ REQUEST=FSIORDER                  */          00950000
*/*                                                         */          00960000
*/*01* POINTED TO BY:                                       */          00970000
*/*                                                         */          00980000
*/*     ORDRSPAD field of the IAZFSIP data area             */          00990000
*/*                                                         */          01000000
*/*01* SERIALIZATION:                                       */          01010000
*/*                                                         */          01020000
*/*     None required                                       */          01030000
*/*                                                         */          01040000
*/*01* FUNCTION:                                            */          01050000
*/*                                                         */          01060000
*/*     Part of the Functional Subsystem Interface (FSI),   */          01070000
*/*     this part maps the response area for any ORDER.  It */          01080000
*/*     is pointed to by ORDRSPAD in the standard base      */          01090000
*/*     section of the FSI parameter list (FSIP).           */          01100000
*/*                                                         */          01110000
*/*01* METHOD OF ACCESS:                                    */          01120000
*/*                                                         */          01130000
*/*02*  ASM:                                                */          01140000
*/*      Specify IAZRESPA LIST=YES to cause this mapping to */          01150000
*/*      be generated.  A USING must be done on field       */          01160000
*/*      IAZRESPA.                                          */          01170000
*/*                                                         */          01180000
*/*02*  PL/X:                                               */          01190000
*/*      Specify a %INCLUDE SYSLIB(IAZRESPA) to cause this  */          01200000
*/*      mapping to be generated.                           */          01210000
*/*                                                         */          01220000
*/*01* USED BY:                                             */          01230000
*/*                                                         */          01240000
*/*     Describe what processors or JES2 functions use this */          01800000
*/*     DSECT.  Especially point out if code outside JES2   */          01810000
*/*     references any fields.  For example the $JCT contain*/          01830000
*/*     the JMR which is referenced by the BCP.             */          01840000
*/*                                                         */          01900000
*/*01* DELETED BY:                                          */          02000000
*/*                                                         */          02010000
*/*     Issuers of FSIREQ                                   */          02020000
*/*                                                         */          02030000
*/*01* FREQUENCY:                                           */          02100000
*/*                                                         */          02200000
*/*     Based on the number of FSIREQs.  Generally one per  */          02300000
*/*     FSS and FSA.                                        */          02400000
*/*                                                         */          02500000
*/*01* RESTRICTIONS:                                        */          02600000
*/*                                                         */          02700000
*/*     None                                                */          02800000
*/*                                                         */          02900000
*/**** END OF SPECIFICATIONS ********************************/          03000000
*/********************************************************************/ 03100000
*/*01* CHANGE ACTIVITY:                                              */ 03110000
*/*                                                                  */ 03120000
*/*               MVS/SP RELEASE 3 LEVEL 3 (SP1.3.3, JBB1329)        */ 03130000
*/*      @OZ78298 MVS/SP RELEASE 3 LEVEL 3                           */ 03140000
*/* $VC1PB36=PTM      HJE6603 951109 VLC:  BCP Ext.Classifications   */ 03141000
*/* $VC1P036=PTM      HJE6603 951208 VLC:  BCP PR20036 Ext.Class     */ 03144000
*/*                                                                  */ 03146000
*/* $Z22LDEP=DEPJOB   HBB77A0 140827 BWT:  Dep Job Control 1 - IAZSS */ 03148000
*/*                                                                  */ 03150000
*/* A000000-999999    CREATED FOR MVS 1.3.3                      @133*/ 03160000
*/********************************************************************/ 03200000
*  %GOTO RESPDCL; /*                                                    03300000
         GBLB  &IAZRSPA                                                 03400000
         AIF   (&IAZRSPA).END                                           03500000
&IAZRSPA SETB  1                                                        03600000
         PUSH  PRINT                                                    03700000
         AIF   ('&LIST' EQ 'YES').MAP1                                  03800000
         PRINT OFF                                                      03900000
.MAP1    ANOP                                                           04000000
IAZRESPA DSECT                                                          04100000
RESPA    EQU   IAZRESPA            ALTERNATE DSECT NAME                 04200000
RESPID   DS    CL4'RESP'           RESPONSE AREA ID                     04300000
RESPLEN  DS    F                   LENGTH OF RESPONSE AREA              04400000
         SPACE 1                                                        04500000
RESPFL1  DS    AL1                 FLAG BYTE (DEVICE STATUS)   @OZ78298 04600000
RESP1DIN EQU   B'10000000'              DEVICE IS INACTIVE     @OZ78298 04700000
RESPDIN  EQU   RESP1DIN                 (ALTERNATE FLAG NAME)  @OZ78298 04710000
RESP1DSP EQU   B'01000000'              DEVICE IS STOPPED      @OZ78298 04800000
         SPACE 1                                                        04810000
RESPFL2  DS    AL1                 FLAG BYTE (PROCESSING STATUS)       C04820000
                                                               @OZ78298 04821000
RESP2EOD EQU   B'10000000'              EOD REACHED ON FWD SYNCH       C04830000
                                                               @OZ78298 04831000
RESP2NDS EQU   B'01000000'              NO DS AT OOP DETECTED  @OZ78298 04840000
RESP2ETE EQU   B'00100000'              ENVIRONMENTAL TYPE ERROR -     C04842000
                                         USED ONLY ON START FSA        C04844000
                                         ORDER RESPONSE        @OY15325 04846000
         SPACE 1                                                        04850000
         DS    AL2                 RESERVED                    @OZ78298 04860000
RESPRETC DS    F                   RETURN CODE OF REQUESTED FUNCTION   C04900000
                                   - 00 = SUCCESSFUL COMPLETION        C05000000
                                   - >0 = UNSUCCESSFUL COMPLETION       05100000
         DS    F                   RESERVED                             05200000
RESPCPYC DS    H                   COPY NUMBER OF DATA SET AT OOP       05300000
         DS    H                   RESERVED                             05400000
RESPPGEC DS    F                   PAGE NUMBER OF DATA SET AT OOP       05500000
RESPLREC DS    F                   LOGICAL REC NUM AT OOP (APPROX)     C05600000
                                                               @OZ78298 05610000
RESPOOPI DS    CL12                IDENTIFIER OF DATA SET AT OOP        05700000
RESPEXTN DS    A                   RESERVED POINTER            @OZ78298 05710000
         DS    3F                  RESERVED                    @OZ78298 05720000
         DS    0F                  BOUNDARY ALIGNMENT                   05800000
RESPSIZ  EQU   *-RESPA             RESPONSE AREA SIZE                   05900000
         POP   PRINT                                                    06000000
.END     MEND  , -         */                                           06100000
*  %RESPDCL: ;                                                          06200000
*DCL 1 IAZRESPA BASED(RESPAPTR) BDY(WORD), /*RESPONSE AREA FOR ORDERS*/ 06300000
*     3 RESPA    CHAR(0) BDY(WORD), /*RESPONSE AREA FOR ORDERS       */ 06400000
*     3 RESPID   CHAR(4),           /*RESPONSE AREA ID = 'RESP'      */ 06500000
*     3 RESPLEN  FIXED(31),         /*LENGTH OF RESPONSE AREA        */ 06600000
*     3 RESPFL1  BIT(8),            /*FLAG BYTE (DEVICE STATUS)         06700000
*                                                            @OZ78298*/ 06710000
*      5 RESP1DIN BIT(1),               /*DEVICE IS INACTIVE @OZ78298*/ 06800000
*      5 RESP1DSP BIT(1),               /*DEVICE IS STOPPED  @OZ78298*/ 06900000
*     3 RESPFL2  BIT(8),            /*FLAG BYTE (PROCESSING STATUS)     06910000
*                                                            @OZ78298*/ 06911000
*      5 RESP2EOD BIT(1),               /*EOD ON FORWARD SYNCH          06920000
*                                                            @OZ78298*/ 06921000
*      5 RESP2NDS BIT(1),               /*NO DS AT OOP DETECTED         06930000
*                                                            @OZ78298*/ 06931000
*      5 RESP2ETE BIT(1),               /*ENVIRONMENTAL TYPE ERROR -    06940000
*                                          USED ONLY ON START FSA       06950000
*                                          ORDER RESPONSE    @OY15325*/ 06960000
*     3   *      FIXED(15),         /*RESERVED               @OZ78298*/ 07000000
*     3 RESPRETC FIXED(31),         /*RETURN CODE OF REQUESTED          07100000
*                                     - 00 = SUCCESSFUL COMPLETION      07200000
*                                     - >0 = UNSUCCESSFUL COMPLETION*/  07300000
*     3   *      FIXED(31),         /*RESERVED        */                07400000
*     3 RESPCPYC FIXED(15),         /*COPY NUMBER OF DS AT OOP      */  07500000
*     3   *      FIXED(15),         /*RESERVED        */                07600000
*     3 RESPPGEC FIXED(31),         /*PAGE NUMBER OF DS AT OOP      */  07700000
*     3 RESPLREC FIXED(31),         /*LOGICAL REC NUM AT OOP(APPROX)*/  07800000
*     3 RESPOOPI CHAR(12),          /*IDENTIFIER OF DS AT OOP       */  07900000
*     3 RESPEXTN PTR(31),           /*RESERVED POINTER       @OZ78298*/ 17900000
*     3   *      CHAR(3*4),         /*RESERVED               @OZ78298*/ 27900000
*     3   *      CHAR(0) BDY(WORD); /*BOUNDARY ALIGNMENT        */      99999999
