*        %GOTO SSJPCMTS;          /* Bilingual Mapping Macro            00010000
         MACRO                                                          00020000
         IAZSSJP &DSECT=NO                                              00030000
*          */                                                           00040000
*        %SSJPCMTS: ;                                             /* */ 00050000
*/**** START OF SPECIFICATIONS *******************************          00060000
.****PROPRIETARY-STATEMENT************************************          00070000
.*01* PROPRIETARY STATEMENT:                                 *          00080000
.*                                                           *          00090000
.*    LICENSED MATERIALS-PROPERTY OF IBM                     *          00100000
.*    5650-ZOS Copyright IBM Corp. 2009, 2019                *          00110000
.*    STATUS:  HBB77C0                                       *          00120000
.*                                                           *          00130000
.****END-OF-PROPRIETARY-STATEMENT*****************************          00140000
*                                                            *          00150000
*01* DESCRIPTIVE NAME:  SSOB Extension for the JES Property  *          00160000
*                       Information Service (SSI 82)         *          00170000
*02*  ACRONYM:  IAZSSJP                                      *          00180000
*                                                            *          00190000
*01* MACRO NAME:  IAZSSJP                                    *          00200000
*                                                            *          00210000
*01* DSECT NAME:  SSJP                                       *          00220000
*01* LABEL PREFIX:  SSJP                                     *          00230000
*                                                            *          00240000
*01* COMPONENT ID:  JES Common (SC141)                       *          00250000
*                                                            *          00260000
*01* EXTERNAL CLASSIFICATION: GUPI                           *          00270000
*01* END OF EXTERNAL CLASSIFICATION:                         *          00310000
*                                                            *          00320000
*01* EYE-CATCHER:  SSJP                                      *          00330000
*02*  OFFSET:      0                                         *          00340000
*02*  LENGTH:      4                                         *          00350000
*                                                            *          00360000
*01* STORAGE ATTRIBUTES:                                     *          00370000
*02*  SUBPOOL:  caller                                       *          00380000
*02*  KEY:  Any                                              *          00390000
*02*  RESIDENCY: Any                                         *          00400000
*                                                            *          00410000
*01* SIZE:                                                   *          00420000
*                                                            *          00430000
*     See SSJPSIZE equate                                    *          00440000
*                                                            *          00450000
*01* CREATED BY:  Caller of SSI function 'SSOBSSJP' = 82     *          00460000
*                                                            *          00470000
*01* POINTED TO BY:  SSOBINDV in the IEFSSOBH mapping macro  *          00480000
*                                                            *          00490000
*01* SERIALIZATION: None required                            *          00500000
*                                                            *          00510000
*01* FUNCTION:                                               *          00520000
*                                                            *          00530000
*     Defines the SSOB extension used by application         *          00540000
*     programs to request JES Property Service from JES.     *          00550000
*                                                            *          00560000
*01* METHOD OF ACCESS:                                       *          00570000
*                                                            *          00580000
*02*  ASM:                                                   *          00590000
*                                                            *          00600000
*        IAZSSJP DSECT=YES!NO                                *          00610000
*                                                            *          00620000
*        DSECT=YES  - Provided DSECT for SSJP                *          00630000
*                                                            *          00640000
*        DSECT=NO   - Provides storage definition for SSJP   *          00650000
*                                                            *          00660000
*        If DSECT=NO is specified, then you must ensure      *          00670000
*        that label SSOBGN is defined.  This can be          *          00680000
*        accomplished by either using the IEFJSSOB macro     *          00690000
*        to define the SSOB header along with at least one   *          00700000
*        extension.  Otherwise, you must define label        *          00710000
*        SSOBGN immediately following the SSOB header.       *          00720000
*                                                            *          00730000
*        In addition, the SSOB header field SSOBINDV should  *          00740000
*        always be initialized by the caller to point to     *          00750000
*        the functional extension.                           *          00760000
*                                                            *          00770000
*02*  PL/X:                                                  *          00780000
*                                                            *          00790000
*        %DCL SSJP_ATRB CHAR                                 *          00800000
*        %SSJP_ATRB = 'value'      (see description below)   *          00810000
*        %INCLUDE SYSLIB(IAZSSJP)                            *          00820000
*                                                            *          00830000
*        SSJP_ATRB is a global variable that determines      *          00840000
*        SSJP's attributes.  The variable should be set to   *          00850000
*        a valid control block attribute such as             *          00860000
*        'BASED(SSOBINDV)' or '' (null).                     *          00870000
*                                                            *          00880000
*        In addition, the SSOB header field SSOBINDV should  *          00890000
*        always be initialized by the caller to point to     *          00900000
*        the functional extension.                           *          00910000
*                                                            *          00920000
*01* DELETED BY:  Caller of SSI                              *          00930000
*                                                            *          00940000
*01* FREQUENCY: 1 per call to function code 82               *          00950000
*                                                            *          00960000
*01* RESTRICTIONS:  None                                     *          00970000
*                                                            *          00980000
****** END OF SPECIFICATIONS ********************************/          00990000
*/********************************************************************/ 01000000
*/*01* CHANGE ACTIVITY:                                              */ 01010000
*/*                                                                  */ 01020000
*/* $Z22LPRO=PROCSSI  HBB77A0 131127 TJW:  PROCLIB SSI               */ 01025000
*/*                                                                  */ 01026000
*/* $Z24LCKS=CKPTHC   HBB77B0 171113 TJW:  CKPT information SSI      */ 01027000
*/*                                                                  */ 01027600
*/* $S202710=CHEADERS HBB77C0 190212 TJW:  Updates for C headers     */ 01028300
*/*                                        S202710                   */ 01029000
*/*                                                                  */ 01030000
*/*01* A000000-999999    Created for z/OS 1.11               @Z11LSDS*/ 01040000
*/********************************************************************/ 01050000
*/************************************************************          01060000
*01* NOTES:                                                  *          01070000
*                                                            *          01072000
*        In the following description of fields, the         *          01074000
*        notation before the field description can be one    *          01076000
*        of the following:                                   *          01078000
*                                                            *          01080000
*              I.    Input (appl always supplies information)*          01082000
*              O.    Output (appl receives information)      *          01084000
*                                                            *          01086000
*************************************************************/          01090000
*/*                                                                  */ 01100000
* % GOTO END_OF_ASM_SSJP; /*                                            01110000
*                                                                       01120000
*        Function value for SSOBFUNC                                    01130000
SSOBSSJP EQU   82                  JES Property information service id  01140000
         SPACE 1                                                        01150000
         AIF   ('&DSECT' EQ 'YES').SSJP010                              01160000
         AIF   ('&DSECT' EQ 'NO').SSJP020                               01170000
         MNOTE 8,'IAZSSJP:  DSECT MUST BE EITHER YES OR NO'             01180000
         AGO   .END                                                     01190000
.SSJP010 ANOP                                                           01200000
SSJP     DSECT                     SSOB extension mapping - SSJP        01210000
         AGO   .SSJP030                                                 01220000
.SSJP020 ANOP                                                           01230000
         ORG   SSOBGN                                                   01240000
SSJP     DS    0D                  SSOB extension mapping - SSJP        01250000
.SSJP030 ANOP                                                           01270000
         SPACE 1                                                        01280000
*------------------------------------------------------------*          01285000
*        Return code values for SSOBRETN                     *          01290000
*------------------------------------------------------------*          01293000
         SPACE 1                                                        01296000
SSJPOK   EQU   0                   Request successful                   01300000
SSJPERRW EQU   4                   Request completed with possible     C01310000
                                   errors, see SSJPRETN for reason     C01320000
                                   code                                 01330000
SSJPERRU EQU   8                   Request cannot be completed due     C01340000
                                   to user error, see SSJPRETN for     C01350000
                                   reason code                          01360000
SSJPERRJ EQU   12                  Request cannot be completed due     C01370000
                                   to an internal (JES) error,         C01380000
                                   SSJPRETN contains internal JES      C01390000
                                   reason code                          01400000
SSJPPARM EQU   16                  The parameter list, ie the SSJP     C01410000
                                   extension, is an invalid format -   C01420000
                                   it is not an SSJP, the service      C01430000
                                   version number is not supported,    C01440000
                                   or the SSJP is not large enough      01450000
SSJPSTOR EQU   20                  Request cannot be processed         C01452000
                                   because required storage cannot     C01456000
                                   be obtained.  No data can be        C01460000
                                   returned to the caller               01461000
         SPACE 1                                                        01464000
SSJPBGN  EQU   *                                                        01470000
SSJPID   DC    C'SSJP'             Extension identifier                 01480000
SSJPLEN  DC    AL2(SSJPSIZE)       Length of SSOB extension area        01490000
SSJPVER  DS    H                   I.Version number of SSOB             01500000
SSJPVER1 EQU   X'0100'               z/OS 1.11 version (initial)        01510000
SSJPVERC EQU   X'0100'               Current version number (z/OS 1.11) 01520000
         SPACE 1                                                        01530000
SSJPFREQ DS    X                   I.Function request byte              01540000
SSJPNJOD EQU   4                     NJE node info obtain               01550000
SSJPNJRS EQU   8                     NJE node storage return            01560000
SSJPSPOD EQU   12                    Spool info obtain                  01570000
SSJPSPRS EQU   16                    Spool storage return               01580000
SSJPITOD EQU   20                    Initiator info obtain              01590000
SSJPITRS EQU   24                    Initiator storage return           01600000
SSJPJXOD EQU   28                    JESPLEX info obtain                01610000
SSJPJXRS EQU   32                    JESPLEX storage return             01620000
SSJPJCOD EQU   36                    Job class info obtain              01630000
SSJPJCRS EQU   40                    Job class storage return           01640000
SSJPPROD EQU   44                    PROCLIB concat obtain     @Z22LPRO 01641000
SSJPPRRS EQU   48                    PROCLIB storage return    @Z22LPRO 01644000
SSJPCKOD EQU   52                    CKPT information obtain   @Z24LCKS 01646000
SSJPCKRS EQU   56                    CKPT storage return       @Z24LCKS 01648000
         SPACE 1                                                        01650000
SSJPRSV1 DS    XL3                 Reserved                             01660000
**************************************************************          01670000
*                                                            *          01680000
*        SSJPRETN provides additional information for some   *          01690000
*        values of SSOBRETN.  The meaning of the return      *          01700000
*        codes is based on the value in SSOBRETN and the     *          01710000
*        function being requested (SSJPFREQ).                *          01720000
*                                                            *          01730000
*        Values of SSJPRETN from 0-124 (x'7C') are reserved  *          01740000
*        for the SSI router and problems it detects.         *          01750000
*                                                            *          01780000
*        Values of SSJPRETN from 128-252 ('FC') are reserved *          01781000
*        as COMMON reason codes for problems detected by the *          01782000
*        sub functions.                                      *          01783000
*                                                            *          01784000
*        Values of 256 (x'100') and above are SHARED by the  *          01785000
*        sub functions.                                      *          01786000
*                                                            *          01787000
*        Additional SSJPRETN values can be found in the      *          01790000
*        following data areas (based on function code):      *          01800000
*                                                            *          01810000
*                       Related                              *          01820000
*        Function code  data area  Description               *          01830000
*        -------------  ---------  ------------------------  *          01840000
*        SSJPNJOD (4)   IAZJPNJN   NJE node info obtain      *          01850000
*        SSJPNJRS (8)   IAZJPNJN   NJE node storage return   *          01860000
*        SSJPSPOD (12)  IAZJPSPL   Spool info obtain         *          01870000
*        SSJPSPRS (16)  IAZJPSPL   Spool storage return      *          01880000
*        SSJPITOD (20)  IAZJPITD   Initiator info obtain     *          01890000
*        SSJPITRS (24)  IAZJPITD   Initiator storage return  *          01900000
*        SSJPJXOD (28)  IAZJPLEX   JESPLEX info obtain       *          01910000
*        SSJPJXRS (32)  IAZJPLEX   JESPLEX storage return    *          01920000
*        SSJPJCOD (36)  IAZJPCLS   Job class info obtain     *          01930000
*        SSJPJCRS (40)  IAZJPCLS   Job class storage return  *          01940000
*        SSJPPROD (44)  IAZJPROC   PROCLIB concat obtain     * @Z22LPRO 01941000
*        SSJPPRRS (48)  IAZJPROC   PROCLIB storage return    * @Z22LPRO 01944000
*        SSJPCKOD (52)  IAZJPCKP   CKPT information obtain   * @Z24LCKS 01946000
*        SSJPCKRS (56)  IAZJPCKP   CKPT storage return       * @Z24LCKS 01948000
*                                                            *          01950000
**************************************************************          01960000
SSJPRETN DS    F                  O.Reason code for error return code   01970000
         SPACE 1                                                        01980000
*------------------------------------------------------------*          01990000
*        Values of SSJPRETN when SSOBRETN is SSJPERRU (8)    *          02000000
*        for all functions (values of SSJPFREQ)              *          02010000
*------------------------------------------------------------*          02020000
SSJPUNSF EQU   4                  Function code passed in              C02030000
                                    SSJPFREQ is not supported           02040000
SSJPNTDS EQU   8                  SSJPUSER pointer is zero              02050000
SSJPUNSD EQU   12                 SSJPUSER CB version number           C02060000
                                    is not correct                      02070000
SSJPSMLE EQU   16                 SSJPUSER CB length is too small       02080000
SSJPEYEE EQU   20                 SSJPUSER CB eyecatcher is not correct 02090000
SSJPINVA EQU   136                Invalid filter arguments.             02091000
SSJPGLBL EQU   140                Function not supported on            C02091300
                                    global (JES3)                       02091600
SSJPSMAP EQU   144                Error with storage addressed         C02091660
                                    by storage management              C02091720
                                    anchor pointer - e.g. not          C02091780
                                    key 1, fetch protected,            C02091840
                                    incorrect eyecatcher                02091900
         SPACE 1                                                        02092000
*------------------------------------------------------------*          02093000
*        Values of SSJPRETN when SSOBRETN is SSJPSTOR (20)   *          02094000
*        for all functions (values of SSJPFREQ)              *          02095000
*------------------------------------------------------------*          02096000
SSJPGETM EQU   128                $GETMAIN failed                       02097000
SSJPSTGO EQU   132                STORAGE OBTAIN failed                 02098000
         SPACE 1                                                        02100000
**************************************************************          02110000
*                                                            *          02120000
*        This SSI function is a router for various JES       *          02130000
*        requests.  Each function has a related data area    *          02140000
*        that must be pointed to by SSJPUSER.  The mapping   *          02150000
*        of the data area depends on the function code in    *          02160000
*        SSJPFREQ.                                           *          02170000
*                                                            *          02180000
*        The list of valid functions and related data areas  *          02190000
*        is listed above                                     *          02200000
*                                                            *          02210000
**************************************************************          02220000
         SPACE 1                                                        02230000
SSJPUSER DS    A                  I.Pointer to user parameter area      02240000
         DS    2F                 Reserved                              02250000
         DS    0D                 Align for length                      02260000
*                                                                       02270000
SSJPSIZ1 EQU   *-SSJPBGN          Version 1 SSOB extension size         02280000
SSJPSIZE EQU   *-SSJPBGN          Current SSOB extension length         02290000
SSJPLEN8 EQU   ((SSOBHSIZ+7)/8)*8+SSJPSIZE  Total length of SSOB       C02300000
                                             with SSOB extension        02305000
.*                                                                      02310000
         MEND  ,                                                        02320000
.*                                                                      02330000
**/                                                                     02340000
* % END_OF_ASM_SSJP: ;                                                  02350000
*                                                                       02360000
* %IF SSJP_ATRB = ''               /* If no attribute is specified   */ 02370000
*   %THEN                                                               02380000
*     %SSJP_ATRB = 'BASED';        /* establish default attribute    */ 02390000
*                                                                       02400000
*/*                                                                  */ 02410000
*/*     FUNCTION VALUE FOR SSOBFUNC                                  */ 02420000
* DCL SSOBSSJP FIXED(15) CONSTANT(82);  /* JES Property Info SSI     */ 02430000
*/*                                                                  */ 02440000
*/*     RETURN CODE VALUES FOR SSOBRETN                              */ 02450000
* DCL SSJPOK   FIXED(31) CONSTANT(0);   /* Request successful        */ 02460000
* DCL SSJPERRW FIXED(31) CONSTANT(4);   /* Request completed with       02470000
*                                          possible errors, see         02480000
*                                          SSJPRETN for reason code  */ 02490000
* DCL SSJPERRU FIXED(31) CONSTANT(8);   /* Request cannot be completed  02500000
*                                          due to user error, see       02510000
*                                          SSJPRETN for reason code  */ 02520000
* DCL SSJPERRJ FIXED(31) CONSTANT(12);  /* Request cannot be completed  02530000
*                                          due to an internal (JES)     02540000
*                                          error, SSJPRETN contains     02550000
*                                          internal JES reason code. */ 02560000
* DCL SSJPPARM FIXED(31) CONSTANT(16);  /* The parameter list, ie the   02570000
*                                          SSJP extension, is an        02580000
*                                          invalid format - it is not   02590000
*                                          an SSJP, the service version 02600000
*                                          number is not supported, or  02610000
*                                          the SSJP is not large        02620000
*                                          enough                    */ 02630000
* DCL SSJPSTOR FIXED(31) CONSTANT(20);  /* Request cannot be processed  02631000
*                                          because required storage     02634000
*                                          cannot be obtain.  No data   02637000
*                                          can be returned to the       02640000
*                                          caller.                   */ 02643000
*                                                                       02646000
* DCL                                                                   02650000
*   1   SSJP      SSJP_ATRB,                                            02660000
*     3  SSJPID    CHAR(4),        /* Extension identifier           */ 02670000
*     3  SSJPLEN   FIXED(15),      /* Length of SSOB extension area  */ 02680000
*     3  SSJPVER   FIXED(15),      /* Version number of SSOB         */ 02690000
*     3  SSJPFREQ  FIXED(8),       /* Function request byte          */ 02700000
*     3  SSJPRSV1  CHAR(3),        /* Reserved                       */ 02710000
*     3  SSJPRETN  FIXED(31),      /* Reason code for error return   */ 02720000
*/********************************************************************* 02730000
*                                                                     * 02740000
*        This SSI function is a router for various JES                * 02750000
*        requests.  Each function has a related data area             * 02760000
*        that must be pointed to by SSJPUSER.  The mapping            * 02770000
*        of the data area depends on the function code in             * 02780000
*        SSJPFREQ.                                                    * 02790000
*                                                                     * 02800000
*                       Related                                       * 02810000
*        Function code  data area  Description                        * 02820000
*        -------------  ---------  ------------------------           * 02830000
*        SSJPNJOD (4)   IAZJPNJN   NJE node info obtain               * 02840000
*        SSJPNJRS (8)   IAZJPNJN   NJE node storage return            * 02850000
*        SSJPSPOD (12)  IAZJPSPL   Spool info obtain                  * 02860000
*        SSJPSPRS (16)  IAZJPSPL   Spool storage return               * 02870000
*        SSJPITOD (20)  IAZJPITD   Initiator info obtain              * 02880000
*        SSJPITRS (24)  IAZJPITD   Initiator storage return           * 02890000
*        SSJPJXOD (28)  IAZJPLEX   JESPLEX info obtain                * 02900000
*        SSJPJXRS (32)  IAZJPLEX   JESPLEX storage return             * 02910000
*        SSJPJCOD (36)  IAZJPCLS   Job class info obtain              * 02920000
*        SSJPJCRS (40)  IAZJPCLS   Job class storage return           * 02930000
*        SSJPPROD (44)  IAZJPROC   PROCLIB concat obtain      @Z22LPRO* 02931000
*        SSJPPRRS (48)  IAZJPROC   PROCLIB storage return     @Z22LPRO* 02934000
*        SSJPCKOD (52)  IAZJPCKP   CKPT information obtain    @Z24LCKS* 02936000
*        SSJPCKRS (56)  IAZJPCKP   CKPT storage return        @Z24LCKS* 02938000
*                                                                     * 02940000
**********************************************************************/ 02950000
*     3  SSJPUSER  PTR(31),        /* Pointer to user parameter area */ 02960000
*     3  *         CHAR(12);       /* Reserved                       */ 02970000
*/*                                                                  */ 02980000
*/*     ID VALUE FOR SSJPID                                          */ 02990000
*   DCL SSJPCID   CHAR(4) CONSTANT('SSJP'); /* JES Property info        03000000
*                                              eyecatcher            */ 03010000
*/*                                                                  */ 03020000
*/*     Function values for SSJPFREQ                                 */ 03030000
*   DCL SSJPNJOD  FIXED(8) CONSTANT(4);  /* NJE node info obtain     */ 03040000
*   DCL SSJPNJRS  FIXED(8) CONSTANT(8);  /* NJE node storage return  */ 03050000
*   DCL SSJPSPOD  FIXED(8) CONSTANT(12); /* Spool info obtain        */ 03060000
*   DCL SSJPSPRS  FIXED(8) CONSTANT(16); /* Spool storage return     */ 03070000
*   DCL SSJPITOD  FIXED(8) CONSTANT(20); /* Initiator info obtain    */ 03080000
*   DCL SSJPITRS  FIXED(8) CONSTANT(24); /* Initiator storage return */ 03090000
*   DCL SSJPJXOD  FIXED(8) CONSTANT(28); /* JESPLEX info obtain      */ 03100000
*   DCL SSJPJXRS  FIXED(8) CONSTANT(32); /* JESPLEX storage return   */ 03110000
*   DCL SSJPJCOD  FIXED(8) CONSTANT(36); /* Job class info obtain    */ 03120000
*   DCL SSJPJCRS  FIXED(8) CONSTANT(40); /* Job class storage return */ 03130000
*   DCL SSJPPROD  FIXED(8) CONSTANT(44); /* PROCLIB concat obtain       03132000
*                                                            @Z22LPRO*/ 03134000
*   DCL SSJPPRRS  FIXED(8) CONSTANT(48); /* PROCLIB storage return      03136000
*                                                            @Z22LPRO*/ 03138000
*   DCL SSJPCKOD  FIXED(8) CONSTANT(52); /* CKPT information obtain     03138400
*                                                            @Z24LCKS*/ 03138800
*   DCL SSJPCKRS  FIXED(8) CONSTANT(56); /* CKPT storage return         03139200
*                                                            @Z24LCKS*/ 03139600
*/*                                                                  */ 03140000
*/*     Version number value for SSJPVER                             */ 03150000
*   DCL SSJPVER1  FIXED(15) CONSTANT('0100'X); /* z/OS 1.11 version  */ 03160000
*   DCL SSJPVERC  FIXED(15) CONSTANT('0100'X); /* Current version    */ 03170000
*/*                                                                  */ 03180000
*   DCL SSJPSIZ1 FIXED(31) CONSTANT(Length(SSJP));                      03181000
*                                        /* Version 1 size SSJP      */ 03182000
*   DCL SSJPSIZE FIXED(31) CONSTANT(Length(SSJP));                      03183000
*                                        /* Current size of SSJP     */ 03184000
*/*                                                                  */ 03185000
*/************************************************************          03190000
*                                                            *          03200000
*        SSJPRETN provides additional information for some   *          03210000
*        values of SSOBRETN.  The meaning of the return      *          03220000
*        return codes is based on the value in SSOBRETN and  *          03230000
*        the function being requested (SSJPFREQ).            *          03240000
*                                                            *          03250000
*        Values of SSJPRETN from 0-124 (x'7C') are reserved  *          03255000
*        for the SSI router and problems it detects.         *          03260000
*                                                            *          03265000
*        Values of SSJPRETN from 128-252 ('FC') are reserved *          03270000
*        as COMMON reason codes for problems detected by the *          03275000
*        sub functions.                                      *          03280000
*                                                            *          03282000
*        Values of 256 (x'100') and above are SHARED by the  *          03285000
*        sub functions.                                      *          03290000
*                                                            *          03300000
*        Additional SSJPRETN values can be found in the      *          03310000
*        following data areas (based on function code):      *          03320000
*                                                            *          03330000
*                       Related                              *          03340000
*        Function code  data area  Description               *          03350000
*        -------------  ---------  ------------------------  *          03360000
*        SSJPNJOD (4)   IAZJPNJN   NJE node info obtain      *          03370000
*        SSJPNJRS (8)   IAZJPNJN   NJE node storage return   *          03380000
*        SSJPSPOD (12)  IAZJPSPL   Spool info obtain         *          03390000
*        SSJPSPRS (16)  IAZJPSPL   Spool storage return      *          03400000
*        SSJPITOD (20)  IAZJPITD   Initiator info obtain     *          03410000
*        SSJPITRS (24)  IAZJPITD   Initiator storage return  *          03420000
*        SSJPJXOD (28)  IAZJPLEX   JESPLEX info obtain       *          03430000
*        SSJPJXRS (32)  IAZJPLEX   JESPLEX storage return    *          03440000
*        SSJPJCOD (36)  IAZJPCLS   Job class info obtain     *          03450000
*        SSJPJCRS (40)  IAZJPCLS   Job class storage return  *          03460000
*        SSJPPROD (44)  IAZJPROC   PROCLIB concat obtain     * @Z22LPRO 03462000
*        SSJPPRRS (48)  IAZJPROC   PROCLIB storage return    * @Z22LPRO 03465000
*        SSJPCKOD (52)  IAZJPCKP   CKPT information obtain   * @Z24LCKS 03466000
*        SSJPCKRS (56)  IAZJPCKP   CKPT storage return       * @Z24LCKS 03467000
*                                                            *          03470000
*************************************************************/          03480000
*                                                                       03490000
*   DCL SSJPUNSF FIXED(31) CONSTANT(4);  /* Function code passed in     03500000
*                                           SSJPFREQ is not             03510000
*                                           supported                */ 03520000
*   DCL SSJPNTDS FIXED(31) CONSTANT(8);  /* SSJPUSER pointer is zero */ 03530000
*   DCL SSJPUNSD FIXED(31) CONSTANT(12); /* SSJPUSER CB version number  03540000
*                                           is not correct           */ 03550000
*   DCL SSJPSMLE FIXED(31) CONSTANT(16); /* SSJPUSER CB length is too   03560000
*                                           small                    */ 03570000
*   DCL SSJPEYEE FIXED(31) CONSTANT(20); /* SSJPUSER CB eyecatcher is   03580000
*                                           not correct              */ 03590000
*   DCL SSJPINVA FIXED(31) CONSTANT(136);/* Invalid filter arguments */ 03591000
*   DCL SSJPGLBL FIXED(31) CONSTANT(140);/* Function not supported on   03592000
*                                           global (JES3)            */ 03593000
*   DCL SSJPSMAP FIXED(31) CONSTANT(144);/* Error with storage          03593100
*                                           addressed by storage        03593200
*                                           management anchor pointer   03593300
*                                           - e.g. not key 1, fetch     03593400
*                                           protected, incorrect        03593500
*                                           eyecatcher               */ 03593600
*   DCL SSJPGETM FIXED(31) CONSTANT(128);/* $GETMAIN failed          */ 03594000
*   DCL SSJPSTGO FIXED(31) CONSTANT(132);/* STORAGE OBTAIN failed    */ 03595000
* % IAZSSJPEND: ;                                                       03600000
*/*                          END OF MACRO                            */ 03610000
* @Logic;                                                               03620000
* #PRAGMA TOOL=PADI.                                                    03630000
* #ASMLINE.  IEFSSOBH                                                   03640000
* #ASMLINE.  IAZSSJP DSECT=YES                                          03650000
* #PADIDELETE.SSJPCID                                                   03660000
* #PADIDELETE.SSJPBGN                                                   03670000
* #PADIDELETE.SSJPLEN8                                                  03680000
*#EPRAGMA                                                               03690000
*@ENDLOGIC;                                                             99999999
