*%GOTO IAZPRO48  ;   /*                                                 00100000
         MACRO                                                          00200000
         IAZSMF48 ,                                                  */ 00300000
*%IAZPRO48: ;                                                           00400000
*/* START OF SPECIFICATIONS **********************************          00410000
.****PROPRIETARY-STATEMENT************************************          00420000
.*01* PROPRIETARY STATEMENT:                                 *          00430000
.*                                                           *          00440000
.*    LICENSED MATERIALS-PROPERTY OF IBM                     *          00450000
.*    5650-ZOS Copyright IBM Corp. 1983, 2019                *          00460000
.*                                                           *          00470000
.*    STATUS:  HBB77C0                                       *          00480000
.*                                                           *          00490000
.****END-OF-PROPRIETARY-STATEMENT*****************************          00500000
*                                                            *          00510000
*01* DESCRIPTIVE NAME:  JES SMF subsystem event stop record  *          00520000
*02*  ACRONYM:  IAZSMF48                                     *          00530000
*                                                            *          00540000
*01* MACRO NAME:  IAZSMF48                                   *          00550000
*                                                            *          00560000
*01* DSECT NAME:  N/A                                        *          00570000
*01* LABEL PREFIX:  SMF48                                    *          00580000
*                                                            *          00590000
*01* COMPONENT ID:  JES Common (SC141)                       *          00600000
*                                                            *          00610000
*01* EXTERNAL CLASSIFICATION: PI                             *          00700000
*01* END OF EXTERNAL CLASSIFICATION:                         *          00710000
*                                                            *          00800000
*** END OF SPECIFICATIONS   **********************************       */ 00900000
*%GOTO IAZ48;                                                        /* 01000000
.*                                                                   *  02000000
.* INVOCATION =                                                      *  02100000
.*               BAL  - IAZSMF48 (NO DSECT CREATED - START OF RECORD *  02200000
.*                       IS AT SMFRCD48 )                            *  02300000
.*               PL/S - %INCLUDE SYSLIB(IAZSMF48)                    *  02400000
.*                      DCL SMF48PTR PTR                             *  02500000
.*                                                                   *  02510000
.* CHANGE ACTIVITY:                                                  *  02600000
.*                                                                   *  02700000
.*                MVS/SP RELEASE 3 LEVEL 3 (SP1.3.3,JBB1329,JBB2125) *  02800000
.*                THIS MACRO ADDED TO SC141 VIA OZ81648              *  02810000
.*                                                                   *  02820000
.* $510LFDD=4-DIGIT  HBB4440 930414 T_K1: 4-Digit Device Support     *  02830000
.*                                                                   *  02840000
.* $ME03755=BASEQ    HBB7730 050912 A_D:  Bilingual miscellaneous    *  02850000
.*                                        ME03755                    *  02860000
.*                                                                   *  02870000
.* $S202710=CHEADERS HBB77C0 190212 TJW:  Updates for C headers      *  02880000
.*                                        S202710                    *  02890000
.*                                                                   *  02900000
.* A000000-999999    CREATED FOR MVS 1.3.3                        @133  02910000
.*********************************************************************  03000000
         SPACE 2                                                        03100000
*SWITCH TO DETERMINE WHETHER TO GENERATE EQUATES FOR WRITING REC        03200000
         GBLB  &EQUSW                                                   03300000
         SPACE 1                                                        03400000
* SUBSYSTEM EVENT STOP RECORD TYPE 48                                   03500000
         DS    0F       ALIGN TO FULL WORD BOUNDRY                      03600000
SMFRCD48 EQU   *        START OF RECORD                                 03700000
SMF48PTR EQU   *        HEADER SEGMENT                         @OZ82688 03800000
SMF48LEN DS    BL2      RECORD LENGTH                                   03900000
SMF48SEG DS    BL2      SEGMENT DESCRIPTOR                              04000000
SMF48FLG DS    BL1      HEADER FLAG BYTE                                04100000
SMF48RTY DS    BL1      RECORD TYPE 48                                  04200000
SMFJ48   EQU   48          STOP SUBSYSTEM EVENT ID             @OZ82688 04300000
SMF48TME DS    BL4      TOD FROM TIME MACRO BINARY                      04400000
SMF48DTE DS    PL4      DATE FROM TIME MACRO                            04500000
SMF48SID DS    CL4      SYSTEM IDENTIFICATION                           04600000
* SUBSYSTEM IDENTIFICATION SECTION                                      04700000
SMF48SBS DS    BL2      SUBSYSTEN IDENTIFIER                            04800000
SMF48HSP EQU   X'0002'     JES2 ID                                      04900000
SMF48ASP EQU   X'0005'     JES3 ID                                      05000000
*                       X'0006' SS06                                    05100000
SMF48RSV DS    BL2      RESV                                            05200000
SMF48LRR DS    BL2      LGTH OF REMAINDER OF RECORD                     05300000
*                       (NOT INCLUDING THIS FIELD)                      05400000
SMF48SBP EQU   *        SUBSYSTEM SECTION BEGINNING                     05500000
* JES2 AND JES3 COMMON SECTION                                          05600000
SMF48EVT DS    BL2      TYPE OF EVENT STOPPED                           05700000
SMF48SOF EQU   1        LINE HAS SIGNED OFF                             05800000
SMF48CAN EQU   2        LINE CANCELLED BY OPERATOR                      05900000
SMF48LOF EQU   4        TERMINAL LOGGED OFF                             06000000
SMF48RV1 DS    BL2      RESV                                            06100000
SMF48RMT DS    CL8      REMOTE NAME                                     06200000
SMF48LIN DS    CL8      LINE NAME                                       06300000
SMF48PSW DS    CL8      PASSWORD                                        06400000
SMF48SBG EQU   *        JES2 AND JES3 UNCOMMON SECTIONS                 06500000
* JES2 SECTION                                                          06600000
SMF48IO  DS    BL4      # EXCPS(NOT INCLUDING LINE REPEATS)             06700000
SMF48NAK DS    BL4      # NAKS TO WRITE TEXT-NEG ACKNOWLEDGEMTS         06800000
SMF48DCK DS    BL4      # DATA CHECKS TO READ TEXT                      06900000
SMF48OUT DS    BL4      # TIME OUTS TO READ TEXT                        07000000
SMF48ERR DS    BL4      SUM OF ALL OTHER LINE ERRORS                    07100000
SMF48LAA DS    CL3      LINE ADAPTER ADDRESS FROM UCB                   07200000
SMF48LA4 DS    CL4      4-Digit Line Adapter Address           @510LFDD 07210000
SMF48B2L EQU   *-SMF48SBG  JES2 section length                          07220000
         ORG   SMF48SBG                                                 07300000
* JES3 SECTION                                                          07400000
SMF48XCP DS    BL28        EXCP COUNTS AND ERROR STATISTICS             07500000
SMF48BXL EQU   *-SMF48SBG  EXCP section length                          07510000
         ORG   SMF48XCP                                                 07600000
SMF48TRN DS    BL4      NUMBER OF TRANSMISSIONS                         07700000
SMF48ERS DS    BL4      NUMBER OF LINE ERRORS                           07800000
SMF48TOT DS    BL2      NUMBER OF TIME-OUTS                             07900000
SMF48NKS DS    BL2      NUMBER OF NAK RESPONSES TO WRITE                08000000
SMF48S0  DS    BL1      NUMBER OF COMMAND REJECTS                       08100000
SMF48S1  DS    BL1      NUMBER OF INTERVENTIONS REQUIRED                08200000
SMF48S2  DS    BL1      NUMBER OF BUS-OUT CHECKS                        08300000
SMF48S3  DS    BL1      NUMBER OF EQUIPMENT CHECKS                      08400000
SMF48S4  DS    BL1      NUMBER OF DATA CHECKS                           08500000
SMF48S5  DS    BL1      NUMBER OF DATA OVERRUNS                         08600000
SMF48S6  DS    BL1      NUMBER OF LOST DATAS                            08700000
SMF48USR DS    BL9      RESERVED FOR USER                               08800000
SMF48ADP DS    CL3      LINE ADAPTER ADDRESS                            08900000
SMF48AD4 DS    CL4      4-Digit Line Adapter Address           @510LFDD 08910000
SMF48RVJ DS    CL4      Reserved for JES3                      @510LFDD 09000000
SMF48RVU DS    CL4      RESERVED FOR USER                               09100000
SMF48END DS    0X       END OF JES3 RECORD                              09200000
SMF48B3L EQU   *-SMF48SBG  JES3 section length                          09210000
SMF48SIZ DS    0XL(SMF48END-SMFRCD48)  SIZE OF JES3 48 RECORD           09300000
         ORG   SMF48SBP                                                 09400000
* SS06 SECTION                                                          09500000
SMF48FLS DS    BL1      LOGOFF FLAGS                                    09600000
SMF48RPI EQU   128      RECORD FOR PREVIOUS INCOMPLETE SESSION          09700000
SMF48CNI EQU   64       CANCEL ISSUED                                   09800000
SMF48CWK EQU   32       CONTINUE WORKSPACE SAVED                        09900000
SMF48CPG EQU   16       CONTINUE PURGED                                 10000000
SMF48HSI EQU   8        HALT OR STOP ISSUED                             10100000
SMF48SPA EQU   4        SERVICE PROGRAM ACCOUNT RECORD                  10200000
SMF48ULK EQU   1        USER LOCKED                                     10300000
SMF48UID DS    BL3      USER ID                                         10400000
SMF48CPU DS    BL4      CPU TIME                                        10500000
SMF48CNT DS    BL4      CONNECT TIME (SECONDS FOR                       10600000
*                       THIS TERMINAL SESSION                           10700000
SMF48CTH DS    BL4      CONNECT TIME (SECONDS) FOR THIS                 10800000
*                       TERMINAL SESSION FOR ATTACHED                   10900000
*                       HARDCOPY DEVICE                                 11000000
SMF48VIR DS    BL4      VIRTUAL STORAGE USED                            11100000
*                       (THOUSANDS OF BYTE-SECONDS)                     11200000
*                       DURING TERMINAL SESSION                         11300000
SMF48DIO DS    BL4      DASD I/O COUNT FOR THIS                         11400000
*                       TERMINAL SESSION                                11500000
SMF48TIO DS    BL4      TELEPROCESSING I/O COUNTS                       11600000
*                       DURING TERMINAL SESSION                         11700000
SMF48DSL DS    BL4      DASD SPACE IN THIS LIBRARY                      11800000
*                       (IN 1K UNITS)                                   11900000
SMF48DSP DS    BL4      DASD SPACE IN PROJECT/PUB                       12000000
*                       LIBRARIES (1K UNITS)                            12100000
SMF48CPD DS    BL4      CPU TIME TO DATE (HUNDREDTHS                    12200000
*                       OF SECONDS                                      12300000
SMF48CTD DS    BL4      CONNECT TIME TO DATE (SECS)                     12400000
SMF48CDH DS    BL4      CONNECT TIME FOR HARDCOPY                       12500000
*                       DEVICE TO DATE (SECONDS)                        12600000
SMF48VSD DS    BL4      VIRT STORAGE USED TO DATE                       12700000
*                       (THOUSANDS OF BYTE-SECONDS)                     12800000
SMF48DID DS    BL4      DASD I/O COUNTS TO DATE                         12900000
SMF48TID DS    BL4      TP I/O COUNTS TO DATE                           13000000
         SPACE 2                                                        13100000
         AIF (NOT &EQUSW).SKIP                                          13200000
*      LENGTH EQUATES                                                   13300000
SMF48L1  EQU   SMF48LA4+L'SMF48LA4-SMF48LEN Type 48 Record Len @510LFDD 13400000
SMF48CT  EQU   SMF48ERR+L'SMF48ERR-SMF48IO  LENGTH OF LINE EVENT COUNT C13500000
                                                SECTION                 13600000
.SKIP    ANOP                                                           13700000
         MEND                                                        */ 13800000
*%IAZ48: ;                                                              13900000
*%  DCL   EQUSW FIXED EXTERNAL; /* SWITCH TO DETERMINE WHETHER TO       14000000
*                                  GENERATE EQUATES FOR WRITING REC  */ 14100000
*   DCL 1 SMFRCD48 BASED(SMF48PTR) BDY(WORD),                           14200000
*/* RECORD TYPE 48 - SUBSYSTEM EVENT STOP                            */ 14300000
*       2 SMF48TY2 ,              /* BEGINING OF JES2 TYPE 48        */ 14400000
*        3 SMF48LEN FIXED(15),    /* RDW RECORD LENGTH               */ 14500000
*        3 SMF48SEG FIXED(15),    /* RDW SEGMENT DESCRIPTOR          */ 14600000
*        3 SMF48FLG BIT(8),       /* OPERATING ENVIRONMENT           */ 14700000
*        3 SMF48RTY FIXED(8),     /* RECORD TYPE 48                  */ 14800000
*        3 SMF48TME FIXED(31) BDY(BYTE), /* TOD RECORD WRITTEN       */ 14900000
*        3 SMF48DTE CHAR(4),      /* DATE RECORD WRITTEN             */ 15000000
*        3 SMF48SID CHAR(4),      /* SYSTEM ID FROM INSTALLATION     */ 15100000
*                                 /* SUBSYSTEM IDENTIFICATION SECTION*/ 15200000
*        3 SMF48SBS FIXED(15),    /* SUBSYSTEM IDENTIFIER            */ 15300000
*                                 /* 2 JES2                          */ 15400000
*                                 /* 5 JES3                          */ 15500000
*                                 /* 6 SS06                          */ 15600000
*        3 SMF48RSV CHAR(2),      /* RESV                            */ 15700000
*        3 SMF48LRR PTR(15),      /* LGTH OF REMAINDER OF RECORD        15800000
*                                    (NOT INCLUDING THIS FIELD)      */ 15900000
*        3 SMF48SBP CHAR(28),     /* SUBSYSTEM SECTION               */ 16000000
*/* JES2 AND JES3 COMMON SECTION                                     */ 16100000
*         5 SMF48EVT FIXED(15) BDY(BYTE), /* EVENT TYPE STARTING     */ 16200000
*          6 SMF48EV1 BIT(8),     /* First byte of event type        */ 16210000
*           7 *        BIT(8),    /* RESERVED                        */ 16300000
*          6 SMF48EV2 BIT(8),     /* Second byte of event type       */ 16310000
*           7 *        BIT(5),    /* RESERVED                        */ 16320000
*           7 SMF48LOF BIT(1),    /* TERMINAL LOGGED OFF             */ 16400000
*           7 SMF48CAN BIT(1),    /* LINE HAS SIGNED OFF             */ 16500000
*           7 SMF48SOF BIT(1),    /* LINE CANCELLED BY OPER          */ 16600000
*         5 SMF48RV1 CHAR(2),     /* RESV                            */ 16700000
*         5 SMF48RMT CHAR(8),     /* REMOTE NAME                     */ 16800000
*         5 SMF48LIN CHAR(8),     /* LINE NAME                       */ 16900000
*         5 SMF48PSW CHAR(8),     /* PASSWORD                        */ 17000000
*       3 SMF48SBG ,              /* JES2,JES3 UNCOMMON AREA         */ 17100000
*/* JES2 SUBSYSTEM DATA                                              */ 17200000
*        4 SMF48LEC,                     /* BEGIN LINE EVENT COUNT   */ 17300000
*         5 SMF48IO FIXED(31) BDY(BYTE), /* # EXCPS(NOT LINE REPEATS */ 17400000
*         5 SMF48NAK FIXED(31) BDY(BYTE), /* # NAKS TO WRITE TEXT    */ 17500000
*         5 SMF48DCK FIXED(31) BDY(BYTE), /* # DATA CHECKS TO RD TEXT*/ 17600000
*         5 SMF48OUT FIXED(31) BDY(BYTE), /* # TIME OUTS TO READ TEXT*/ 17700000
*         5 SMF48ERR FIXED(31) BDY(BYTE), /*SUM OF ALL OTHER LINE ERR*/ 17800000
*        4 SMF48EEC,                      /* END LINE EVENT COUNT    */ 17900000
*         5 SMF48LAA CHAR(3),     /* LINE ADAPTER ADDRESS FROM UCB      18000000
*                                                            @Z23D037*/ 18005000
*         5 SMF48LA4 CHAR(4);     /* 4-Digit Adapter Address @510LFDD*/ 18010000
*/* JES3 SUBSYSTEM DATA                                              */ 18100000
* DCL 1 SMF48JS3 BASED(ADDR(SMF48SBG)),                    /*        */ 18200000
*       3 SMF48XCP CHAR(28),      /* EXCP COUNTS AND                    18300000
*                                    ERROR STATISTICS                */ 18400000
*         5 SMF48TRN CHAR(4),     /* NO. OF TRANSMISSIONS            */ 18500000
*         5 SMF48ERS CHAR(4),     /* NO. OF LINE ERRORS              */ 18600000
*         5 SMF48TOT CHAR(2),     /* NO. OF TIME-OUTS                */ 18700000
*         5 SMF48NKS CHAR(2),     /* NO. OF NAK RESPONSES TO            18800000
*                                           WRITE                    */ 18900000
*         5 SMF48S0  CHAR(1),     /* NO. OF CMD. REJECTS             */ 19000000
*         5 SMF48S1  CHAR(1),     /* NO. OF INTERVENTION REQ.        */ 19100000
*         5 SMF48S2  CHAR(1),     /* NO. OF BUS-OUT CHECKS           */ 19200000
*         5 SMF48S3  CHAR(1),     /* NO. OF EQUIP. CHECKS            */ 19300000
*         5 SMF48S4  CHAR(1),     /* NO. OF DATA CHECKS              */ 19400000
*         5 SMF48S5  CHAR(1),     /* NO. OF DATA OVERRUNS            */ 19500000
*         5 SMF48S6  CHAR(1),     /* NO. OF LOST DATA                */ 19600000
*         5 SMF48USR CHAR(9),     /* RESERVED FOR USER               */ 19700000
*       3 SMF48ADP CHAR(3),       /* LINE ADAPTER ADDRESS            */ 19800000
*       3 SMF48AD4 CHAR(4),       /* 4-Digit Adapter Address @510LFDD*/ 19810000
*       3 SMF48RVJ CHAR(4),       /* Reserved for JES3       @510LFDD*/ 19900000
*       3 SMF48RVU CHAR(4),       /* RESERVED FOR USER               */ 20000000
*       3 SMF48END CHAR(0);       /* END OF JES3 RECORD              */ 20100000
*/* SS06 SUBSYSTEM DATA                                              */ 20200000
*   DCL 1 SMF48PCO BASED(ADDR(SMF48SBP)),                               20300000
*        3 SMF48FLS BIT(8),        /* LOGOFF FLAGS                   */ 20400000
*          5 SMF48RPI BIT(1),      /* RECORD FOR PREVIOUS               20500000
*                                     INCOMPLETE SECTION             */ 20600000
*          5 SMF48CNI BIT(1),      /* CANCEL ISSUED                  */ 20700000
*          5 SMF48CWK BIT(1),      /* CONTINUE WORKSPACE SAVED          20800000
*                                                                    */ 20900000
*          5 SMF48CPG BIT(1),      /* CONTINUE PURGED                */ 21000000
*          5 SMF48HSI BIT(1),      /* HALT OR STOP ISSUED            */ 21100000
*          5 SMF48SPA BIT(1),      /* SERVICE PROGRAM ACCOUNT RECORD    21200000
*                                                                    */ 21300000
*          5 SMF48RV2 BIT(1),      /* RESERVED                       */ 21400000
*          5 SMF48ULK BIT(1),      /* USER LOCKED                    */ 21500000
*        3 SMF48UID CHAR(3),       /* USER ID                        */ 21600000
*        3 SMF48CPU FIXED(31),     /* CPU TIME                       */ 21700000
*        3 SMF48CNT FIXED(31),     /* CONNECT TIME (SECONDS) FOR        21800000
*                                     THIS TERMINAL SESSION          */ 21900000
*        3 SMF48CTH FIXED(31),     /* CONNECT TIME (SECONDS) FOR        22000000
*                                     ATTACHED HARDCOPY DEV.         */ 22100000
*        3 SMF48VIR FIXED(31),     /* VIRTUAL STORAGE USED              22200000
*                                     (THOUSANDS OF BYTE-SECONDS)       22300000
*                                     DURING TERMINAL SESSION        */ 22400000
*        3 SMF48DIO FIXED(31),     /* DASD I/O COUNT FOR THIS           22500000
*                                     TERMINAL SESSION               */ 22600000
*        3 SMF48TIO FIXED(31),     /* TP I/O COUNTS DURING              22700000
*                                     TERMINAL SESSION               */ 22800000
*        3 SMF48DSL FIXED(31),     /* DASD SPACE IN THIS LIBRARY        22900000
*                                     (IN 1K UNITS)                  */ 23000000
*        3 SMF48DSP FIXED(31),     /* DASD SPACE IN PROJECT/PUBLIC      23100000
*                                     LIBRARIES (1K UNITS)           */ 23200000
*        3 SMF48CPD FIXED(31),     /* CPU TIME TO DATE (HUNDREDTHS      23300000
*                                     OF SECONDS                     */ 23400000
*        3 SMF48CTD FIXED(31),     /* CONNECT TIME TO DATE (SECS)       23500000
*                                                                    */ 23600000
*        3 SMF48CDH FIXED(31),     /* CONNECT TIME FOR HARDCOPY         23700000
*                                     DEVICE TO DATE (SECONDS)          23800000
*                                                                    */ 23900000
*        3 SMF48VSD FIXED(31),     /* VIRT STORAGE USED TO DATE         24000000
*                                     (THOUSANDS OF BYTE-SECONDS)       24100000
*                                                                    */ 24200000
*        3 SMF48DID FIXED(31),     /* DASD I/O COUNTS TO DATE        */ 24300000
*        3 SMF48TID FIXED(31);     /* TP I/O COUNTS TO DATE          */ 24400000
*%IF EQUSW=0 %THEN %GOTO SKIP48;                                        24410000
*/*    EQUATES USED FOR WRITING RECORD                               */ 24420000
*   DCL   SMF48L1 FIXED(32) CONSTANT(LENGTH(SMF48TY2)),                 24430000
*                                       /* LEN JES2 TYPE 48          */ 24440000
*         SMF48CT FIXED(32) CONSTANT(LENGTH(SMF48LEC)),                 24450000
*                                       /* LEN LINE EVENT COUNT      */ 24460000
*         SMF48B2L FIXED(32)                                            24470000
*             CONSTANT(LENGTH(SMF48LEC)+LENGTH(SMF48EEC)),              24480000
*         SMF48BXL FIXED(32) CONSTANT(LENGTH(SMF48XCP)),                24490000
*         SMF48B3L FIXED(32) CONSTANT(LENGTH(SMF48JS3)),                24500000
*/*    Equates used for field SMF48RTY                               */ 24510000
*         SMFJ48   FIXED(8)  CONSTANT(48), /* STOP SUBSYS EVENT ID   */ 24520000
*/*    Equates used for field SMF48SBS                               */ 24530000
*         SMF48HSP FIXED(32) CONSTANT(2), /* JES2 ID                 */ 24540000
*         SMF48ASP FIXED(32) CONSTANT(5); /* JES3 ID                 */ 24550000
*%SKIP48: ;                                                             24560000
* @Logic;                                                               24570000
* #PRAGMA TOOL=PADI.                                                    24580000
* #ASMLINE.         GBLB  &EQUSW                                        24590000
* #ASMLINE.&EQUSW   SETB  1                                             24600000
* #ASMLINE.         IAZSMF48                                            24610000
* #LINE.Dcl SMF48PTR Pointer(31);                                       24620000
* #LINE.% DCL   EQUSW FIXED EXTERNAL;                                   24630000
* #LINE.% EQUSW = 1;                                                    24640000
* #PADIDELETE.SMF48TY2                                                  24650000
* #PADIDELETE.SMF48LEC                                                  24660000
* #PADIDELETE.SMF48EEC                                                  24670000
* #PADIDELETE.SMF48JS3                                                  24680000
* #PADIDELETE.SMF48PCO                                                  24690000
* #PADIDELETE.SMF48RV2                                                  24700000
* #PADIDELETE.SMF48PTR                                                  24710000
* #PADIDELETE.SMFJ48                                                    24720000
* #PADIDELETE.SMF48HSP                                                  24730000
* #PADIDELETE.SMF48B2L                                                  24800000
* #PADIDELETE.SMF48BXL                                                  24900000
* #PADIDELETE.SMF48B3L                                                  25000000
* #PADIDELETE.SMF48SIZ                                                  25100000
* #PADIDELETE.SMF48EV1                                                  25110000
* #PADIDELETE.SMF48EV2                                                  25120000
* #EPRAGMA                                                              25200000
* @ENDLOGIC;                                                            99999999
