*%GOTO IAZR;        /*                                                  00100000
         MACRO                                                          00200000
         IAZSMFR &RECTYPE                                               00300000
.*********************************************************************  00500000
.* MODULE NAME = IAZSMFR                                             *  00600000
.*                                                                   *  00700000
.* DESCRIPTIVE NAME = JES SMF RECORD ROUTER                          *  00800000
.*********************************************************************  00900000
.*                                                                   *  01600000
.* COPYRIGHT = LICENSED MATERIALS-PROPERTY OF IBM                    *  01610000
.*             5650-ZOS Copyright IBM Corp. 1983, 2021               *  01630000
.*                                                                   *  01640000
.*  STATUS = HBB77D0                                                 *  01700000
.*                                                                   *  01800000
.*01* EXTERNAL CLASSIFICATION:  NONE                                 *  01810000
.*01* END OF EXTERNAL CLASSIFICATION:                                *  01820000
.*                                                                   *  01830000
.*  MODULE TYPE = MACRO                                              *  01900000
.*                                                                   *  02000000
.*  INVOCATION =                                                     *  02100000
.*               BAL  - CALLED FROM IFASMFR WITH RECTYPE             *  02200000
.*               PL/S - USER DEFINES MACRO VARIABLE IAZRXX           *  02300000
.*                                                                   *  02400000
.*                      INCLUDE MACRO FROM LIBRARY                   *  02500000
.*                      DECLARE THE RECORD PTR                       *  02600000
.*                      EX: %IAZR06 = 'YES'                          *  02700000
.*                          %INCLUDE SYSLIB(IAZSMFR)                 *  02800000
.*                          DCL SMF06PTR PTR                         *  02900000
.*                                                                   *  03000000
.* CHANGE ACTIVITY:                                                  *  03100000
.*                                                                   *  03200000
.*                MVS/SP RELEASE 3 LEVEL 3 (SP1.3.3,JBB1329,JBB2125) *  03300000
.*                THIS MACRO ADDED TO SC141 VIA OZ81648              *  03310000
.* $S202710=CHEADERS HBB77C0 190212 TJW:  Updates for C headers      *  03320000
.*                                        S202710                    *  03330000
.* $Z25LSMF=SMF84    HBB77D0 210208 NAB:  SMF1153 mapping            *  03340000
.*                                                                   *  03400000
.* A000000-999999    CREATED FOR MVS 1.3.3                        @133  03410000
.*********************************************************************  03500000
         LCLA  &NUM,&B                                                  03600000
.* &NUM IS SET TO THE NUMBER OF SUBSTRING ITEMS IN THE FIRST PARAMETER  03700000
.* AND &B IS USED TO POINT AT EACH SUBSTRING ITEM.                      03800000
         AIF   ('&RECTYPE' EQ '').E1                                    03900000
&NUM     SETA  N'&RECTYPE                                               04000000
         AGO   .CONTC                                                   04100000
.CONTB   ANOP                                                           04200000
&NUM     SETA  &NUM-1                                                   04300000
.CONTC   ANOP                                                           04400000
         AIF   (&NUM LE 0).OUT                                          04500000
&B       SETA  &B+1                                                     04600000
.RTYCHK  AIF   ('&RECTYPE(&B)' EQ '').E3                                04700000
.CONTA   AIF   (&RECTYPE(&B) EQ 24).G24                        @OZ82688 04800000
         AIF   (&RECTYPE(&B) EQ 25).G25                                 04900000
         AIF   (&RECTYPE(&B) EQ 26).G26                                 05000000
         AIF   (&RECTYPE(&B) EQ 43).G43                                 05100000
         AIF   (&RECTYPE(&B) EQ 45).G45                                 05200000
         AIF   (&RECTYPE(&B) EQ 47).G47                                 05300000
         AIF   (&RECTYPE(&B) EQ 48).G48                                 05400000
         AIF   (&RECTYPE(&B) EQ 49).G49                                 05500000
         AIF   (&RECTYPE(&B) EQ 52).G52                                 05600000
         AIF   (&RECTYPE(&B) EQ 53).G53                                 05700000
         AIF   (&RECTYPE(&B) EQ 54).G54                                 05800000
         AIF   (&RECTYPE(&B) EQ 55).G55                                 05900000
         AIF   (&RECTYPE(&B) EQ 56).G56                                 06000000
         AIF   (&RECTYPE(&B) EQ 57).G57                                 06100000
         AIF   (&RECTYPE(&B) EQ 58).G58                                 06200000
         AIF   (&RECTYPE(&B) EQ 84).G84                                 06210000
         AIF   (&RECTYPE(&B) EQ 1153).G1153                             06220000
         AGO   .E5                                                      06300000
.G24     ANOP                                                           06400000
         IAZSMF24                                                       06500000
         AGO   .CONTB                                                   06600000
.G25     ANOP                                                           06700000
         IAZSMF25                                                       06800000
         AGO   .CONTB                                                   06900000
.G26     ANOP                                                           07000000
         IAZSMF26                                                       07100000
         AGO   .CONTB                                                   07200000
.G43     ANOP                                                           07300000
         IAZSMF43                                                       07400000
         AGO   .CONTB                                                   07500000
.G45     ANOP                                                           07600000
         IAZSMF45                                                       07700000
         AGO   .CONTB                                                   07800000
.G47     ANOP                                                           07900000
         IAZSMF47                                                       08000000
         AGO   .CONTB                                                   08100000
.G48     ANOP                                                           08200000
         IAZSMF48                                                       08300000
         AGO   .CONTB                                                   08400000
.G49     ANOP                                                           08500000
         IAZSMF49                                                       08600000
         AGO   .CONTB                                                   08700000
.G52     ANOP                                                           08800000
         IAZSMF52                                                       08900000
         AGO   .CONTB                                                   09000000
.G53     ANOP                                                           09100000
         IAZSMF53                                                       09200000
         AGO   .CONTB                                                   09300000
.G54     ANOP                                                           09400000
         IAZSMF54                                                       09500000
         AGO   .CONTB                                                   09600000
.G55     ANOP                                                           09700000
         IAZSMF55                                                       09800000
         AGO   .CONTB                                                   09900000
.G56     ANOP                                                           10000000
         IAZSMF56                                                       10100000
         AGO   .CONTB                                                   10200000
.G57     ANOP                                                           10300000
         IAZSMF57                                                       10400000
         AGO   .CONTB                                                   10500000
.G58     ANOP                                                           10600000
         IAZSMF58                                                       10700000
         AGO   .CONTB                                                   10800000
.G84     ANOP                                                           10810000
         IAZSMF84                                                       10820000
         AGO   .CONTB                                                   10830000
.G1153   ANOP                                                           10840000
         IAZS1153                                                       10850000
         AGO   .CONTB                                                   10860000
.E1      ANOP                                                           10900000
         SPACE 3                                                        11000000
         MNOTE 8,'PARAMETERS OMITTED, PROCESSING TERMINATED'            11100000
         MEXIT                                                          11200000
.E3      ANOP                                                           11300000
         SPACE 3                                                        11400000
         MNOTE 4,'NULL RECORD TYPE PASSED'                              11500000
         AGO   .CONTB                                                   11600000
.E5      ANOP                                                           11700000
         SPACE 3                                                        11800000
         MNOTE 8,'&RECTYPE(&B) INVALID SC141 RECORD TYPE SPECIFIED'     11900000
         AGO   .CONTB                                                   12000000
.OUT     MEND                    */                                     12100000
*%IAZR:     ;                                                           12200000
*%IAZL24: IF IAZR24='' %THEN %GOTO IAZL25;                              12210000
    %INCLUDE SYSLIB(IAZSMF24);                                          12220000
                                                                        12230000
*%IAZL25: IF IAZR25='' %THEN %GOTO IAZL26;                              12300000
    %INCLUDE SYSLIB(IAZSMF25);                                          12400000
                                                                        12500000
*%IAZL26: IF IAZR26='' %THEN %GOTO IAZL43;                              12600000
    %INCLUDE SYSLIB(IAZSMF26);                                          12700000
                                                                        12800000
*%IAZL43: IF IAZR43='' %THEN %GOTO IAZL45;                              12900000
    %INCLUDE SYSLIB(IAZSMF43);                                          13000000
                                                                        13100000
*%IAZL45: IF IAZR45='' %THEN %GOTO IAZL47;                              13200000
    %INCLUDE SYSLIB(IAZSMF45);                                          13300000
                                                                        13400000
*%IAZL47: IF IAZR47='' %THEN %GOTO IAZL48;                              13500000
    %INCLUDE SYSLIB(IAZSMF47);                                          13600000
                                                                        13700000
*%IAZL48: IF IAZR48='' %THEN %GOTO IAZL49;                              13800000
    %INCLUDE SYSLIB(IAZSMF48);                                          13900000
                                                                        14000000
*%IAZL49: IF IAZR49='' %THEN %GOTO IAZL52;                              14100000
    %INCLUDE SYSLIB(IAZSMF49);                                          14200000
                                                                        14300000
*%IAZL52: IF IAZR52='' %THEN %GOTO IAZL53;                              14310000
    %INCLUDE SYSLIB(IAZSMF52);                                          14320000
                                                                        14330000
*%IAZL53: IF IAZR53='' %THEN %GOTO IAZL54;                              14340000
    %INCLUDE SYSLIB(IAZSMF53);                                          14350000
                                                                        14360000
*%IAZL54: IF IAZR54='' %THEN %GOTO IAZL55;                              14370000
    %INCLUDE SYSLIB(IAZSMF54);                                          14380000
                                                                        14390000
*%IAZL55: IF IAZR55='' %THEN %GOTO IAZL56;                              14400000
    %INCLUDE SYSLIB(IAZSMF55);                                          14410000
                                                                        14420000
*%IAZL56: IF IAZR56='' %THEN %GOTO IAZL57;                              14430000
    %INCLUDE SYSLIB(IAZSMF56);                                          14440000
                                                                        14450000
*%IAZL57: IF IAZR57='' %THEN %GOTO IAZL58;                              14460000
    %INCLUDE SYSLIB(IAZSMF57);                                          14470000
                                                                        14480000
*%IAZL58: IF IAZR58='' %THEN %GOTO IAZL84;                              14490000
    %INCLUDE SYSLIB(IAZSMF58);                                          14500000
                                                                        14510000
*%IAZL84: IF IAZR84='' %THEN %GOTO IAZL1153;                            14520000
    %INCLUDE SYSLIB(IAZSMF84);                                          14530000
                                                                        14540000
*%IAZL1153: IF IAZR1153='' %THEN %GOTO IAZLXX;                          14550000
    %INCLUDE SYSLIB(IAZS1153);                                          14560000
                                                                        14570000
*%IAZLXX:  ;                                                            99999999
