*%GOTO IAZPRO84;         /*                                             00010000
      MACRO                                                             00020000
      IAZSMF84 &SUBTYPE=                                             */ 00030000
*%IAZPRO84: ;                                                           00040000
*/* START OF SPECIFICATIONS **********************************          00050000
.****PROPRIETARY-STATEMENT************************************          00060000
.*01* PROPRIETARY STATEMENT:                                 *          00070000
.*                                                           *          00080000
.*    LICENSED MATERIALS-PROPERTY OF IBM                     *          00090000
.*    5650-ZOS Copyright IBM Corp. 1983, 2021                *          00100000
.*                                                           *          00110000
.*    STATUS:  HBB77D0                                       *          00120000
.*                                                           *          00130000
.****END-OF-PROPRIETARY-STATEMENT*****************************          00140000
*                                                            *          00150000
*01* DESCRIPTIVE NAME:  JES SMF 84 JMF (JES performance)     *          00160000
*02*  ACRONYM:  IAZSMF84                                     *          00162000
*                                                            *          00164000
*01* MACRO NAME:  IAZSMF84                                   *          00166000
*                                                            *          00170000
*01* DSECT NAME:  SMF84HDR                                   *          00180000
*01* LABEL PREFIX:  SMF84, R84                               *          00190000
*                                                            *          00200000
*01* COMPONENT ID:  JES Common (SC141)                       *          00210000
*                                                            *          00220000
*01* EXTERNAL CLASSIFICATION: PI                             *          00230000
*01* END OF EXTERNAL CLASSIFICATION:                         *          00231000
*                                                            *          00240000
*01* METHOD OF ACCESS:                                       *          00250000
*                                                            *          00260000
*02*  ASM:                                                   *          00270000
*      IAZSMF84 &SUBTYPE=value                               *          00280000
*                                                            *          00285000
*      SUBTYPE= specifies which subtypes of SMF84 should be  *          00290000
*      generated.  It is a required parameter and generates  *          00295000
*      an MNOTE if not specified.                            *          00300000
*                                                            *          00305000
*02*  PL/X:                                                  *          00310000
*      %DCL IAZSMF84_SUBTYPE CHAR EXTERNAL                   *          00315000
*      %IAZSMF84_SUBTYPE = 'value'                           *          00320000
*      %INCLUDE SYSLIB(IAZSMF84)                             *          00325000
*                                                            *          00330000
*      IAZSMF84_SUBTYPE is a global variable that determines *          00333000
*      which subtypes of SMF84 should be generated.  The     *          00336000
*      default if not specified (or specified as '') is      *          00340000
*      'ALLJES'.                                             *          00345000
*                                                            *          00350000
*02*   PARAMETER = SUBTYPE                                   *          00355000
*                                                            *          00360000
*      TYPE = KEYWORD                                        *          00365000
*                                                            *          00370000
*      value = SUBTYPE indicator, accepted values are:       *          00375000
*           0  -  No subtypes, just maps for common sections *          00380000
*           1  -  Generate mapping for all common sections,  *          00385000
*                 and SUBTYPE 1                              *          00390000
*           2  -  Generate mapping for all common sections,  *          00395000
*                 and SUBTYPE 2                              *          00400000
*           3  -  Generate mapping for all common sections,  *          00405000
*                 and SUBTYPE 3                              *          00410000
*           4  -  Generate mapping for all common sections,  *          00415000
*                 and SUBTYPE 4                              *          00420000
*           5  -  Generate mapping for all common sections,  *          00425000
*                 and SUBTYPE 5                              *          00430000
*           6  -  Generate mapping for all common sections,  *          00435000
*                 and SUBTYPE 6                              *          00440000
*           7  -  Generate mapping for all common sections,  *          00445000
*                 and SUBTYPE 7                              *          00450000
*           8  -  Generate mapping for all common sections,  *          00451000
*                 and SUBTYPE 8                              *          00452000
*           9  -  Generate mapping for all common sections,  *          00456000
*                 and SUBTYPE 9                              *          00460000
*          10  -  Generate mapping for all common sections,  *          00465000
*                 and SUBTYPE 10                             *          00470000
*         ALL  -  Generate mapping for all common sections,  *          00471000
*                 and mapping for all JES3 subtypes          *          00472000
*       ALLJ3  -  Generate mapping for all common sections,  *          00474000
*                 and mapping for all JES3 subtypes (same as *          00480000
*                 all)                                       *          00481000
*                                                            *          00482000
*          21  -  Generate mapping for all common sections,  *          00483000
*                 and subtype 21 (JES2)                      *          00484000
*       ALLJ2  -  Generate mapping for all common sections,  *          00485000
*                 and mapping for all JES2 subtypes          *          00486000
*                                                            *          00487000
*      ALLJES  -  Generate mapping for all common sections,  *          00488000
*                 and mapping for all JES2 and JES3 subtypes *          00490000
*                                                            *          00492000
*                                                            *          00495000
*** END OF SPECIFICATIONS   **********************************       */ 00500000
*%GOTO IAZ84;                                                        /* 00505000
.*  FUNCTION = This macro maps the SMF record type 84 record.      @RWC 00510000
.*             It has the following subtypes (JES3):           @Z23LSMF 00520000
.*                                                                 @RWA 00525000
.*             - SUBTYPE 1 IS CREATED BY THE FCT ANALYSIS RECORD     *  00530000
.*               GENERATOR                                           *  00540000
.*                                                                 @RWA 00545000
.*             - SUBTYPE 2 IS CREATED BY THE FCT SUMMARY AND         *  00550000
.*               HIGHLIGHT RECORD GENERATOR                          *  00560000
.*                                                                 @RWA 00565000
.*             - SUBTYPE 3 IS CREATED BY THE SPOOL DATA MANAGEMENT   *  00570000
.*               RECORD GENERATOR                                    *  00580000
.*                                                                 @RWA 00585000
.*             - SUBTYPE 4 IS CREATED BY THE RESQUEUE CELL POOL,   @MPC 00590000
.*               JCT ACCESS METHOD, AND JES3 CONTROL BLOCK         @MPA 00600000
.*               RECORD GENERATOR                                  @MPC 00610000
.*                                                                 @RWA 00615000
.*             - SUBTYPE 5 IS CREATED BY THE JOB ANALYSIS RECORD     *  00620000
.*               GENERATOR                                           *  00630000
.*                                                                 @RWA 00635000
.*             - SUBTYPE 6 IS CREATED BY THE JES3 HOT SPOT ANALYSIS  *  00640000
.*               RECORD GENERATOR                                    *  00650000
.*                                                                 @RWA 00655000
.*             - SUBTYPE 7 IS CREATED BY THE JES3 INTERNAL READER DSP*  00660000
.*               ANALYSIS RECORD GENERATOR                           *  00670000
.*                                                                 @RWA 00675000
.*             - SUBTYPE 8 IS CREATED BY THE JES3 SUBSYSTEM INTERFACE*  00680000
.*               (SSI) RESPONSE RECORD GENERATOR                     *  00690000
.*                                                                 @RWA 00695000
.*             - SUBTYPE 9 IS CREATED BY THE JES3 SSI DESTINATION    *  00700000
.*               QUEUE RECORD GENERATOR                              *  00710000
.*             THE RECORD CONSISTS OF FOLLOWING PARTS:               *  00720000
.*             - THE SMF HEADER;                                     *  00730000
.*             - THE JMF PRODUCT SECTION;                            *  00740000
.*             - THE JMF GENERAL INFORMATION SECTION;                *  00750000
.*             - THE FCT ANALYSIS SUBTYPE WHICH JES3 GENERAL         *  00760000
.*               INFORMATION SECTION AND AN FCT AND AWAIT ANALYSIS   *  00770000
.*               SECTION;                                            *  00780000
.*             - THE FCT SUMMARY AND HIGHLIGHT SUBTYPE WHICH CONSISTS*  00790000
.*               OF AN FCT SUMMARY SECTION, FCT AND AWAIT HIGHLIGHT  *  00800000
.*               SECTION AND A JES3 WAIT ANALYSIS DATA SECTION;      *  00810000
.*             - THE SDM SUBTYPE WHICH CONSISTS OF A GENERAL SDM SEC-*  00820000
.*               TION, SPOOL DATASET DESCRIPTION SECTION, SPOOL PARTI*  00830000
.*               TION DESCRIPTION SECTION, SPOOL SPACE UTILIZATION   *  00840000
.*               SNAPSHOT SECTION, SINGLE TRACK TABLE SPACE ALLOCATIO*  00850000
.*               SNAPSHOT SECTION, SPOOL I/O ACTIVITY -- BUFFERS READ*  00860000
.*               AND WRITTEN -- SECTION, BUFFERS CHAINING     #0508@MEC 00870000
.*               BY SPOOL DATASET SECTION AND MINIMAL/MARGINAL TRACK *  00880000
.*               CONDITION SECTION;                                  *  00890000
.*             - THE RESQUEUE CELLPOOL AND CONTROL BLOCK SUBTYPE     *  00900000
.*               CONSISTS OF RESQUEUE CELL POOL STATISTICS AND JES3  *  00910000
.*               CONTROL BLOCK UTILIZATION RECORD;                   *  00920000
.*             - THE JOB ANALYSIS SUBTYPE CONSISTS OF A JOB ANALYSIS *  00930000
.*               SECTION, JES3 FUNCTION SUMMARY SECTION, AND JES3    *  00940000
.*               WORK-TO-D0 QUEUE SECTION;                           *  00950000
.*             - THE INTERNAL READER DSP ANALYSIS SUBTYPE;           *  00960000
.*             - THE JES3 SSI RESPONSE SUBTYPE;                      *  00970000
.*             - THE JES3 SSI DESTINATION QUEUE SUBTYPE.             *  00980000
.*                                                                 @RWA 00981000
.*             - Subtype 10 is created by the WLM analysis         @RWA 00982000
.*               record generator.                                 @RWA 00983000
.*                                                                 @RWA 00984000
.*             The following subtypes are used by JES2 when    @Z23LSMF 00984800
.*             it issues SMF 84 records:                       @Z23LSMF 00985600
.*                                                             @Z23LSMF 00986400
.*             - Subtype 21 is created by the resource limit   @Z23LSMF 00987200
.*               record generator.                             @Z23LSMF 00988000
.*                                                             @Z23LSMF 00988800
*                                                                    *  00990000
* CHANGE ACTIVITY =                                                  *  01000000
*                                                                    *  01010000
*     $M0= SP311    HJS3311 880428 PD1JF:        SP3.1.1       @OY16159 01020000
*     $ME= JMF311   HJS3311 880201 PD1JF:        SP3.1.1      #0776@MEC 01030000
*     $MP= RESJCT   HJS3311 880111 PD0DR:        SP3.1.1           @MPA 01040000
*     $MD= SMSSTG2  HJS3312 880603 PD0PW:        SP3.1.2       @OY16159 01050000
*     $MR= SP312    HJS3312 880502 PD1JF:        SP3.1.2       @OY16159 01060000
*                                                                    *  01062000
*     $PF= 4DIGIT   HJS5511 930414 PD0TK:        SP5.1.1             *  01065000
*     $RJ= OS140    HJS6604 970212 PD0DR:        OS2.4.0           @RJA 01065500
*                                                                    *  01066000
*     $MF= WLM      JBB6604 970221 J_K2: record 84                   *  01067000
*     $RW= WLMBATCH HBB6608 981012 PD0DR:        OS2.8.0           @RWA 01067600
*     $SF= z1.4.0   HBB7707 020108 PD0TN:        z 1.4.0       0082@SFA 01068200
*     $SO= WLMBAL   HJS7708 020606 ID1RS:        z 1.5.0           @SOA 01068800
*     $SL= z1.7.0   HJS7720 050225 PD4RH:        z 1.7.0       08280SLA 01069400
*     $S8= EAV      HJS7760 080630 PD0RF:        z 1.11.0      @Z11LSSI 01069500
*                                                                    *  01069600
* $Z11LSSI=SDSFASST HBB7760 080715 BWT:  SMF84 EAV Support fix       *  01069800
*                                                                    *  01070800
* $Z23LSMF=SMF84    HBB77B0 160930 TJW:  SMF 84 support              *  01071800
*                                                                    *  01072000
* $S202710=CHEADERS HBB77C0 190212 TJW:  Updates for C headers       *  01072200
*                                        S202710                     *  01072400
* $Z25LSMF=SMF84    HBB77D0 210222 NAB:  ICN 1819                     * 01072600
*                                                                     * 01072800
* A000000-999999          Created for MVS  3.1.1                   @311 01075000
*********************************************************************** 01080000
         SPACE 2                                                        01090000
*******************************************************************     01100000
*                                                                 *     01110000
*             SMF 84 HEADER                                       *     01120000
*                                                                 *     01130000
*******************************************************************     01140000
SMF84HDR DSECT                                                          01150000
SMF84PTR EQU   *                                                        01160000
SMF84LEN DS    H            RECORD LENGTH                               01170000
SMF84SEG DS    H            SEGMENT DESCRIPTOR                          01180000
SMF84FLG DS    X            SYSTEM INDICATOR                            01190000
*        EQU   X'80'        RESERVED                           #569@MEA 01200000
SMF84STI EQU   X'40'        SUBTYPE INDICATOR INDICATES WHICH  #0733MEC 01210000
*                            SUBSYSTEM IS BEING USED           #0733MEA 01220000
*        EQU   X'20'        RESERVED                           #569@MEA 01230000
*        EQU   X'10'        RESERVED                           #569@MEA 01240000
*        EQU   X'08'        RESERVED                           #569@MEA 01250000
*        EQU   X'04'        MVS/XA                            #0733@MEC 01260000
*        EQU   X'02'        VS2                                #569@MEA 01270000
*        EQU   X'01'        VS1                                #569@MEA 01280000
SMF84RTY DS    X            RECORD TYPE (84 OR X'54')         #0275@MEC 01290000
SMFJ84   EQU   84           SMF number                                  01295000
SMF84TME DS    PL4          TIME, IN HUNDREDS OF A SECOND WHEN#0275@MEC 01300000
*                           RECORD WAS WRITTEN  (SET BY SMF)  #0733@MEC 01310000
SMF84DTE DS    PL4          DATE RECORD WAS WRITTEN, IN THE FORM        01320000
*                           00YYDDDF WHERE F IS THE SIGN      #0275@MEC 01330000
*                           (SET BY SMF)                      #0733@MEA 01340000
SMF84SID DS    XL4          SYSTEM IDENTIFICATION (SET BY SMF)#0733@MEC 01350000
SMF84SBS DS    H            SUBSYSTEM IDENTIFICATION --                 01360000
SMF84HAS EQU   X'0002'        Signifies JES2                   @Z23LSMF 01370000
SMF84ASP EQU   X'0005'        Signifies JES3                   @Z23LSMF 01375000
SMF84SGN DS    H            SEGMENT NUMBER                     #569@MEC 01380000
SMF84FL1 DS    X            FLAG BYTE 1 FOR SMF TYPE 84        #569@MEA 01390000
SMF84LST EQU   X'80'        LAST SMF SEGMENT INDICATOR         #569@MEA 01400000
SMF84VER DS    X            SMF84 VERSION NUMBER               @OY34777 01410000
*                           DEFAULT IS '00'                    @OY34777 01413000
SMF84V2  EQU   X'02'        TEMPORARY FIX INDICATOR            @OY34777 01416000
SMF84V3  EQU   X'03'        OS390 2.4.0                            @RJA 01418000
SMF84STY DS    H            RECORD SUBTYPE                              01420000
SMF84TRN DS    H            NUMBER OF TRIPLETS IN THIS RECORD           01430000
*                                                              #569@MED 01440000
SMF84PRS DS    F            OFFSET TO JMF PRODUCT SECTION               01450000
SMF84PRL DS    H            LENGTH OF JMF PRODUCT SECTION               01460000
SMF84PRN DS    H            NUMBER OF JMF PRODUCT SECTIONS    #0733@MEC 01470000
SMF84GNS DS    F            OFFSET TO JMF GENERAL SECTION               01480000
SMF84GNL DS    H            LENGTH OF JMF GENERAL SECTION               01490000
SMF84GNN DS    H            NUMBER OF JMF GENERAL SECTIONS              01500000
SMF84J1O DS    F            OFFSET TO JMF DATA SECTION                  01510000
SMF84J1L DS    H            LENGTH OF JMF DATA SECTION                  01520000
SMF84J1N DS    H            NUMBER OF JMF DATA SECTIONS                 01530000
SMF84SZ1 EQU   *-SMF84LEN   SIZE OF SMF HEADER                          01540000
         SPACE ,                                                        01550000
         AIF   ('&SUBTYPE' EQ '').PROSEC                                01555000
         AIF   ('&SUBTYPE' EQ 'ALL').PROSEC                             01560000
         AIF   ('&SUBTYPE' EQ 'ALLJ2').PROSEC                  @Z23LSMF 01562000
         AIF   ('&SUBTYPE' EQ 'ALLJ3').PROSEC                  @Z23LSMF 01564000
         AIF   ('&SUBTYPE' EQ 'ALLJES').PROSEC                 @Z23LSMF 01566000
         AIF   ('&SUBTYPE' EQ '0').PROSEC                               01570000
         AIF   ('&SUBTYPE' EQ '1').PROSEC                               01580000
         AIF   ('&SUBTYPE' EQ '2').PROSEC                               01590000
         AIF   ('&SUBTYPE' EQ '3').PROSEC                               01600000
         AIF   ('&SUBTYPE' EQ '4').PROSEC                               01610000
         AIF   ('&SUBTYPE' EQ '5').PROSEC                               01620000
         AIF   ('&SUBTYPE' EQ '6').PROSEC                               01630000
         AIF   ('&SUBTYPE' EQ '7').PROSEC                               01640000
         AIF   ('&SUBTYPE' EQ '8').PROSEC                               01650000
         AIF   ('&SUBTYPE' EQ '9').PROSEC                               01660000
         AIF   ('&SUBTYPE' EQ '10').PROSEC                         @RWA 01661000
         AIF   ('&SUBTYPE' EQ '21').PROSEC                     @Z23LSMF 01664000
         SPACE 3                                                        01670000
.ERROR   MNOTE 8,'&SUBTYPE INVALID RECORD SUBTYPE SPECIFIED'   @Z23LSMF 01680000
.CONTB   ANOP                                                           01690000
         MEXIT                                                          01700000
         SPACE 1                                                        01710000
.PROSEC  ANOP                                                           01720000
         SPACE 2                                                        01730000
*******************************************************************     01740000
*                                                                 *     01750000
*          SMF 84 PRODUCT SECTION                                 *     01760000
*                                                                 *     01770000
*******************************************************************     01780000
SMF84PRO DSECT                                                          01790000
R84MFVER DS    H            JMF VERSION NUMBER                          01800000
R84PRDNM DS    CL8          PRODUCT NAME (I.E., SC1BA    )              01810000
R84INTST DS    PL4          TOD JMF MEASUREMENT INTERVAL STARTED,       01820000
*                           IN THE FORM HHMMSSTF, F = SIGN,   #0733@MEC 01830000
*                           T IS TENTHS OF SECONDS            #0733@MEA 01840000
R84SDATE DS    PL4          DATE JMF MEASUREMENT INTERVAL STARTED,      01850000
*                           IN THE FORM 00YYDDDF, WHERE F IS THE SIGN   01860000
R84INTEN DS    PL4          TOD JMF MEASUREMENT INTERVAL ENDED,         01870000
*                           IN THE FORM HHMMSSTF, F = SIGN,   #0733@MEC 01880000
*                           T IS TENTHS OF SECONDS            #0733@MEA 01890000
R84EDATE DS    PL4          DATE JMF MEASUREMENT INTERVAL ENDED,        01900000
*                           IN THE FORM 00YYDDDF, WHERE F IS THE SIGN   01910000
R84INTER DS    PL4          JMF INTERVAL LENGTH IN SECONDS    #0776@MEC 01920000
*                                                            2#0776@MED 01930000
R84MFCYC DS    PL4          JMF SAMPLING CYCLE LENGTH IN THE  #0275@MEC 01940000
*                           FORM OF 00SSSTTF, F = SIGN,       #0402@MEC 01950000
*                           (TAKEN FROM THE CYCLE OPTION)     #0275@MEC 01960000
         DS    XL2          RESERVED FOR DEVELOPMENT          #0275@MEA 01970000
R84SAMPL DS    F            NUMBER OF JMF SAMPLES                       01980000
R84MFCMD DS    CL80         *CALL,JMF COMMAND                           01990000
R84MVSRL DS    CL8          MVS SOFTWARE LEVEL (CONSISTS OF AN          02000000
*                           ACRONYM AND THE VERSION, RELEASE, AND       02010000
*                           MODIFICATION LEVEL NUMBERS)                 02020000
R84JESRL DS    CL8          JES3 RELEASE LEVEL                          02030000
R84CPUM  DS    CL4          CPU MODEL NUMBER                            02040000
R84RSTO  DS    F            Real storage size at IPL in KB -   @Z25LSMFC02050000
                              set to x'FFFFFFFF' if the value  @Z25LSMFC02052000
                              exceeds 4T-1 - see R84RST4K      @Z25LSMF 02055000
R84CPUNM DS    CL8          CPU SERIAL NUMBER                           02060000
R84CPUID DS    CL4          JES3 CPU ID                       #0275@MEC 02070000
R84MPNAM DS    CL8          MAIN PROCESSOR NAME                         02080000
R84J3FLG DS    X            JES3 STATUS INDICATOR FLAG                  02090000
R84J3PRO EQU   X'80'        JES3 PROCESSOR INDICATOR:         #0275@MEC 02100000
*                             OFF MEANS JES3 GLOBAL                     02110000
*                             ON  MEANS JES3 LOCAL                      02120000
R84J3APG EQU   X'40'        JES3 IS IN THE APG PRIORITY LEVEL           02130000
R84J3SWP EQU   X'20'        JES3 IS NON-SWAPPABLE                       02140000
         DS    XL1          RESERVED                                    02150000
R84JPRTY DS    H            JES3 DISPATCHING PRIORITY                   02160000
R84JMFMN DS    F            MIN. JMF OVERHEAD IN MICROSECONDS #0615@MEC 02170000
R84JMFMX DS    F            MAX. JMF OVERHEAD IN MICROSECONDS #0615@MEC 02180000
R84JMFAV DS    F            AVG. JMF OVERHEAD IN MICROSECONDS #0615@MEC 02190000
*                           % OF JMF INTERVAL TIME = JMF AVG   @OY20511 02200000
*                           TIME * JMF SAMPLES / JMF INTERVAL  @OY20511 02210000
*                           TIME IN MICROSECONDS * 100         @OY20511 02220000
R84MVSMN DS    F            MIN. MVS OVERHEAD IN MICROSECONDS #0615@MEC 02230000
R84MVSMX DS    F            MAX. MVS OVERHEAD IN MICROSECONDS #0615@MEC 02240000
R84MVSAV DS    F            AVG. MVS OVERHEAD IN MICROSECONDS #0615@MEC 02250000
*                           % OF JMF INTERVAL TIME = MVS AVG   @OY20511 02260000
*                           TIME * JMF SAMPLES / JMF INTERVAL  @OY20511 02260100
*                           TIME IN MICROSECONDS * 100         @OY20511 02260200
R84RST4K DS    FD           Real storage size at IPL in 4K     @Z25LSMFC02262000
                              pages                            @Z25LSMF 02268000
R84PSSZ1 EQU   *-R84MFVER   SIZE OF JMF PRODUCT SECTION                 02280000
         SPACE 2                                                        02290000
*******************************************************************     02300000
*                                                                 *     02310000
*         SMF 84 GENERAL SECTION                                  *     02320000
*                                                                 *     02330000
*******************************************************************     02340000
SMF84GS  DSECT                                                          02350000
R84CPUSC DS    F            CPU BUSY SAMPLE COUNT                       02360000
R84NPA   DS    F            IATNUC POSTED-ACTIVE COUNT;                 02370000
*                           % OF IATNUC POSTED-ACTIVE = IATNUC POSTED-  02380000
*                           ACTIVE COUNT / CPU BUSY SAMPLE COUNT * 100  02390000
R84APA   DS    F            IATAUX POSTED-ACTIVE COUNT;                 02400000
*                           % OF IATAUX POSTED-ACTIVE = IATAUX POSTED-  02410000
*                           ACTIVE COUNT / CPU BUSY SAMPLE COUNT * 100  02420000
R84NPNA  DS    F            IATNUC POSTED--NOT-ACTIVE COUNT;            02430000
*                           % OF IATNUC POSTED-NOT-ACTIVE = IATNUC      02440000
*                           POSTED-NOT-ACTIVE COUNT / CPU BUSY SAMPLE   02450000
*                           COUNT * 100                                 02460000
R84APNA  DS    F            IATAUX POSTED--NOT-ACTIVE COUNT;            02470000
*                           % OF IATAUX POSTED-NOT-ACTIVE = IATAUX      02480000
*                           POSTED-NOT-ACTIVE COUNT / CPU BUSY SAMPLE   02490000
*                           COUNT * 100                                 02500000
R84NNP   DS    F            IATNUC NOT-POSTED COUNT;                    02510000
*                           % OF IATNUC NOT-POSTED = IATNUC NOT-POSTED  02520000
*                           COUNT / CPU BUSY SAMPLE COUNT * 100         02530000
R84ANP   DS    F            IATAUX NOT-POSTED COUNT;                    02540000
*                           % OF IATAUX NOT-POSTED = IATAUX NOT-POSTED  02550000
*                           COUNT / CPU BUSY SAMPLE COUNT * 100         02560000
R84NNW   DS    F            IATNUC NONSTANDARD-WAIT COUNT;              02570000
*                           % OF IATNUC NONSTANDARD-WAIT = IATNUC NON-  02580000
*                           STANDARD WAIT COUNT / CPU BUSY SAMPLE COUNT 02590000
*                           * 100                                       02600000
R84ANW   DS    F            IATAUX NONSTANDARD-WAIT COUNT;              02610000
*                           % OF IATAUX NONSTANDARD-WAIT = IATAUX NON-  02620000
*                           STANDARD-WAIT COUNT / CPU BUSY SAMPLE COUNT 02630000
*                           * 100                                       02640000
R84NSLLR DS    F            IATNUC SUSPENDED-LOCAL-LOCK-REQUEST COUNT;  02650000
*                           % OF IATNUC SUSPENDED-LOCAL-LOCK-REQUEST =  02660000
*                           IATNUC SUSPENDED-LOCAL-LOCK-REQUEST COUNT / 02670000
*                           CPU BUSY SAMPLE COUNT * 100                 02680000
R84ASLLR DS    F            IATAUX SUSPENDED-LOCAL-LOCK-REQUEST COUNT;  02690000
*                           % OF IATAUX SUSPENDED-LOCAL-LOCK-REQUEST =  02700000
*                           IATAUX SUSPENDED-LOCAL-LOCK-REQUEST COUNT   02710000
*                           / CPU BUSY SAMPLE COUNT * 100               02720000
R84NSO   DS    F            IATNUC SUSPENDED-OTHER COUNT;               02730000
*                           % OF IATNUC SUSPENDED-OTHER = IATNUC        02740000
*                           SUSPENDED-OTHER COUNT / CPU BUSY SAMPLE     02750000
*                           COUNT * 100                                 02760000
R84ASO   DS    F            IATAUX SUSPENDED-OTHER COUNT;               02770000
*                           % OF IATAUX SUSPENDED-OTHER = IATAUX        02780000
*                           SUSPENDED-OTHER COUNT / CPU BUSY SAMPLE     02790000
*                           COUNT * 100                                 02800000
R84GISZ1 EQU   *-R84CPUSC   SIZE OF JMF GENERAL INFO SECTION            02810000
         EJECT                                                          02820000
         AIF   ('&SUBTYPE' EQ '1').SUBTYP1                     #695@MEA 02830000
         AIF   ('&SUBTYPE' EQ '2').SUBTYP2                     #695@MEA 02840000
         AIF   ('&SUBTYPE' EQ '3').SUBTYP3                              02850000
         AIF   ('&SUBTYPE' EQ '4').SUBTYP4                              02860000
         AIF   ('&SUBTYPE' EQ '5').SUBTYP5                              02870000
         AIF   ('&SUBTYPE' EQ '6').SUBTYP6                              02880000
         AIF   ('&SUBTYPE' EQ '7').SUBTYP7                              02890000
         AIF   ('&SUBTYPE' EQ '8').SUBTYP8                              02900000
         AIF   ('&SUBTYPE' EQ '9').SUBTYP9                              02910000
         AIF   ('&SUBTYPE' EQ '10').SUBTY10                        @RWA 02911000
         AIF   ('&SUBTYPE' EQ '21').SUBTY21                    @Z23LSMF 02912000
         AIF   ('&SUBTYPE' EQ 'ALL').SUBTYP1                   #695@MEA 02920000
         AIF   ('&SUBTYPE' EQ 'ALLJ3').SUBTYP1                 @Z23LSMF 02922000
         AIF   ('&SUBTYPE' EQ 'ALLJ2').SUBTY21                 @Z23LSMF 02924000
         AIF   ('&SUBTYPE' EQ 'ALLJES').SUBTYP1                @Z23LSMF 02926000
         AIF   ('&SUBTYPE' EQ '').SUBTYP1                               02928000
         MEXIT                                                 #695@MEA 02930000
.SUBTYP1 ANOP                                                           02940000
*******************************************************************     02950000
*                                                                 *     02960000
*          SUBTYPE 1  HEADER SECTION                           #569@MEC 02970000
*                                                                 *     02980000
*******************************************************************     02990000
SMF84JS3 DSECT                                                          03000000
R84JES3O DS    F        OFFSET TO JES3 GENERAL INFO. SECTION   #569@MEA 03010000
R84IRBSC DS    F        OFFSET TO THE IRB SECTION              @OY16159 03020000
R84FCTO  DS    F        OFFSET TO FCT AND AWAIT ANALYSIS SECTION        03030000
R84FFLG1 DS    X        MISC. FLAG                             #569@MEA 03040000
R84JSSEC EQU   X'80'    RECORD CONTAINS JES3 GENERAL INFO. SEC #569@MEA 03050000
R84FCSEC EQU   X'40'    RECORD CONTAINS FCT AND AWAIT ANALYSIS #569@MEA 03060000
*                       SECTION                                #569@MEA 03070000
R84RBSEC EQU   X'20'    RECORD CONTAINS IRB SECTION            @OY16159 03080000
         DS    XL3      RESERVED                               #569@MEA 03090000
R84JS3S0 EQU   *-R84JES3O SIZE OF SUBTYPE 1 HEADER             #569@MEA 03100000
***************************************************************#569@MEA 03110000
*   JES3 GENERAL INFORMATION SECTION                          *#569@MEA 03120000
***************************************************************#569@MEA 03130000
R84JES3  DSECT                                                 #569@MEA 03140000
*******************************************************************     03150000
*   PAGING INFORMATION                                            *     03160000
*******************************************************************     03170000
R84FOE   DS    F        NUMBER OF FIXED PAGES                           03180000
R84FOESZ DS    F        TOTAL SIZE OF ALL FIX PAGES IN K      #0360@MEC 03190000
R84SLOT  DS    F        AUXILIARY SLOT COUNT                            03200000
R84SLOTS DS    F        TOTAL SIZE OF ALL AUXILIARY SLOTS IN K#0360@MEC 03210000
R84JPIN  DS    F        JES3 PAGE-INS DURING JMF MONITORING             03220000
R84JPOUT DS    F        JES3 PAGE-OUTS DURING JMF MONITORING            03230000
R84JPREC DS    F        JES3 PAGE-RECLAIMS DURING JMF MONITORING        03240000
R84JPGCT DS    F        JES3 PAGING COUNT DURING JMF          #0409@MEC 03250000
*                       MONITORING                            #0409@MEA 03260000
**************************************************************#0409@MEA 03270000
* JES3 PAGING RATE PER SECOND DURING JMF MONITORING = (THE   *#0409@MEA 03280000
* TOTAL NUMBER OF PAGE-IN'S AND PAGE-OUT'S DURING JMF MON-   *#0409@MEA 03290000
* ITORING ( I.E. JES3 PAGING COUNT, R84JPGCT ))/ JMF INTERVAL* @OY16159 03300000
* LENGTH IN SECONDS (R84INTER). THEN RESULTS IN THE FORMAT   * @OY16159 03310000
* OF XXX.XX PAGES/SECOND                                     * @OY16159 03320000
**************************************************************#0409@MEA 03330000
R84SPGCT DS    F        SYSTEM PAGING COUNT (NON-SWAPPABLE    #0409@MEC 03340000
*                       AND NON-VIO) DURING JMF MONITORING    #0409@MEC 03350000
**************************************************************#0409@MEA 03360000
* SYSTEM PAGING RATE PER SECOND DURING JMF MONITORING = (THE *#0409@MEA 03370000
* TOTAL NUMBER OF SYSTEM PAGE-IN'S AND PAGE-OUT'S DURING JMF *#0615@MEC 03380000
* MONITORING ( I.E. SYSTEM PAGING COUNT, R84SPGCT )) / JMF   * @OY16159 03390000
* INTERVAL LENGTH IN SECONDS (R84INTER).  RESULTS IN THE     * @OY16159 03400000
* FORMAT OF XXX.XX PAGES/SECOND                              *#0776@MEC 03410000
**************************************************************#0409@MEA 03420000
         SPACE 1                                                        03430000
**********************************************************************  03440000
*   JES3 WORKING SET INFORMATION                                     *  03450000
**********************************************************************  03460000
R84WSPLO DS    F        LOW RANGE OF WORKING SET PLOT SCALE             03470000
*                       IN K                                  #0361@MEA 03480000
R84WSPHI DS    F        HIGH RANGE OF WORKING SET PLOT SCALE            03490000
*                       IN K                                  #0361@MEA 03500000
R84WSINC DS    F        INCREMENT FOR WORKING SET PLOT IN K   #0360@MEC 03510000
R84WSMIN DS    F        MINIMUM WORKING SET SIZE IN K                   03520000
R84WSMAX DS    F        MAXIMUM WORKING SET SIZE IN K                   03530000
R84WSAVG DS    F        AVERAGE WORKING SET SIZE IN K                   03540000
R84JMFSZ DS    F        JMF SIZE THAT IS INCLUDED IN WORKING SET SIZE   03550000
*                       IN K                                  #0361@MEA 03560000
R84WSPTN DS    F        Total num of working set plot counter  08280SLC 03570000
*                       entries with a count greater than zero 08280SLC 03580000
R84WSPTO DS    F        Offset of 1st working set plot counter 08280SLC 03590000
*                       entry with a count greater than zero.  08280SLA 03595000
         SPACE 1                                                        03600000
**********************************************************************  03610000
*   JES3 SUBTASKS INFORMATION                                        *  03620000
**********************************************************************  03630000
R84ONES  DS    F            COUNT FOR ONE JES3 SUBTASK POSTED;          03640000
*                           % OF ONE JES3 SUBTASK POSTED = ONE JES3SUB  03650000
*                           TASK POSTED COUNT / CPU BUSY SAMPLE COUNT   03660000
*                           * 100                                       03670000
R84TWOS  DS    F            COUNT FOR TWO JES3 SUBTASKS POSTED          03680000
*                           CONCURRENTLY;                               03690000
*                           % OF TWO JES3 SUBTASK POSTED CONCURRENTLY   03700000
*                           = TWO JES3 SUBTASK POSTED CONCURRENTLY      03710000
*                           COUNT / CPU BUSY SAMPLE COUNT * 100         03720000
R84THREE DS    F            COUNT FOR THREE JES3 SUBTASKS POSTED        03730000
*                           CONCURRENTLY;                               03740000
*                           % OF THREE JES3 SUBTASK POSTED CONCURRENTLY 03750000
*                           = THREE JES3 SUBTASK POSTED CONCURRENTLY/   03760000
*                           CPU BUSY SAMPLE COUNT * 100                 03770000
R84FOURS DS    F            COUNT FOR FOUR OR MORE JES3 SUBTASK POSTED  03780000
*                           CONCURRENTLY;                               03790000
*                           % OF FOUR OR MORE JES3 SUBTASKS POSTED      03800000
*                           CONCURRENTLY = FOUR OR MORE JES3 SUBTASKS   03810000
*                           POSTED CONCURRENTLY COUNT / CPU BUSY SAMPLE 03820000
*                           COUNT * 100                                 03830000
R84SUBNM DS    F            TOTAL NUMBER OF JES3 SUBTASK ENTRIES        03840000
R84SUBOF DS    F            OFFSET OF THE 1ST JES3-SUBTASK ENTRY        03850000
R84NNFCT DS    F            IATNUC POSTED-BUT-NO-FCT-POSTED COUNT;      03860000
*                           % OF IATNUC POSTED-BUT-NO-FCT-POSTED =      03870000
*                           IATNUC POSTED-BUT-NO-FCT-POSTED COUNT /     03880000
*                           (IATNUC POSTED-ACTIVE COUNT + IATNUC        03890000
*                           POSTED-NOT-ACTIVE COUNT) * 100    #0371@MEC 03900000
R84ANFCT DS    F            IATAUX POSTED-BUT-NO-FCT-POSTED COUNT;      03910000
*                           % OF IATAUX POSTED-BUT-NO-FCT-POSTED =      03920000
*                           IATAUX POSTED-BUT-NO-FCT-POSTED COUNT /     03930000
*                           (IATAUX POSTED-ACTIVE COUNT + IATAUX        03940000
*                           POSTED-NOT-ACTIVE COUNT) * 100    #0371@MEC 03950000
R84JS3S1 EQU   *-R84FOE     SIZE OF JES3 GENERAL INFO. SECTION #569@MEC 03960000
         SPACE 1                                                        03970000
*********************************************************************   03980000
*   THE FOLLOWING DSECT WILL MAP EACH JES3 SUBTASK ENTRY            *   03990000
*********************************************************************   04000000
R84SUB   DSECT                                                          04010000
R84SSEQN DS    F            SUBTASK SEQUENCE NUMBER           #0371@MEC 04020000
R84SNAME DS    CL8          SUBTASK NAME                                04030000
R84SPPC  DS    F            SUBTASK POSTED COUNT;                       04040000
*                           % OF SUBTASK POSTED =             #0371@MEA 04050000
*                           SUBTASK POSTED COUNT /            #0371@MEA 04060000
*                           CPU BUSY SAMPLE COUNT * 100       #0371@MEA 04070000
*                                                              @OY34777 04075000
R84TSKSZ EQU   *-R84SSEQN   SIZE OF JES3 SUBTASK ENTRY                  04080000
         SPACE 1                                                        04090000
*********************************************************************** 04100000
*   THE FOLLOWING DSECT WILL MAP EACH WORKING SET PLOT COUNTER ENTRY  * 04110000
*********************************************************************** 04120000
R84WSPLT DSECT          WORKING SET PLOT ENTRY                          04130000
R84WSPTS DS    F        WORKING SET PLOT SCALE                          04140000
R84WSPTC DS    F        COUNT FOR WORKING SET SIZE FOR ABOVE            04150000
*                                                              @OY34777 04155000
R84WSPS1 EQU   *-R84WSPTS SIZE OF JES3 WORKING SET PLOT COUNTER ENTRY   04160000
*                       MENTIONED SCALE                                 04170000
         SPACE 2                                                        04180000
************************************************************** @OY16159 04190000
*                                                            * @OY16159 04200000
*          SUBTYPE 1 -- IRB HEADER SECTION                   * @OY16159 04210000
*                                                            * @OY16159 04220000
************************************************************** @OY16159 04230000
R84IRBH  DSECT                                                 @OY16159 04240000
R84NIRBO DS    F        OFFSET OF THE FIRST NUC IRB TAB ENTRY  @OY16159 04250000
R84NIRBC DS    F        TOTAL NUMBER OF JES3 IRBS IN IATNUC    @OY16159 04260000
R84NTOTA DS    F        TOTAL NUM OF ACTIVE NUC IRB ENTRIES    @OY16159 04270000
R84NTOTS DS    F        TOTAL NUM OF SUSPENDED NUC IRB ENTRIES @OY16159 04280000
R84NTOTO DS    F        TOTAL NUM OF IN-OS-WAIT IRB ENTRIES    @OY16159 04290000
*                       IN IATNUC                              @OY16159 04300000
R84AIRBO DS    F        OFFSET OF THE FIRST AUX IRB TAB ENTRY  @OY16159 04310000
R84AIRBC DS    F        TOTAL NUMBER OF JES3 IRBS IN IATAUX    @OY16159 04320000
R84ATOTA DS    F        TOTAL NUM OF ACTIVE AUX IRB ENTRIES    @OY16159 04330000
R84ATOTS DS    F        TOTAL NUM OF SUSPENDED AUX IRB ENTRIES @OY16159 04340000
R84ATOTO DS    F        TOTAL NUM OF IN-OS-WAIT IRB ENTRIES    @OY16159 04350000
*                       IN IATAUX                              @OY16159 04360000
R84IRBFG DS    X        MISC. FLAG FOR THE IRB SECTION         @OY16159 04370000
R84NUCOV EQU   X'40'    NUC IRB TABLE HAS OVERFLOWED           @OY16159 04380000
R84AUXOV EQU   X'80'    AUX IRB TABLE HAS OVERFLOWED           @OY16159 04390000
         DS    XL3      RESERVED                               @OY16159 04400000
R84IRBHS EQU   *-R84NIRBO SIZE OF THE IRB HEADER SECTION       @OY16159 04410000
************************************************************** @OY16159 04420000
*    THE FOLLOWING IS A MAPPING FOR EACH IRB TABLE ENTRY     * @OY16159 04430000
*   NUC IRB AND AUX IRB BOTH USE THIS MAPPING FOR ITS TABLE  * @OY16159 04440000
************************************************************** @OY16159 04450000
R84IRBD  DSECT                                                 @OY16159 04460000
R84IRBNM DS    CL8      NAME OR ADDRESS OF THE JES3 IRB        @OY16159 04470000
R84IRBAC DS    F        COUNT FOR ACTIVE JES3 IRB              @OY16159 04480000
R84IRBSU DS    F        COUNT FOR SUSPENDED JES3 IRB           @OY16159 04490000
R84IRBWT DS    F        COUNT FOR IN-OS-WAIT JES3 IRB          @OY16159 04500000
*                                                              @OY34777 04505000
R84IRBSZ EQU   *-R84IRBNM SIZE OF JES3 IRB TABLE ENTRY         @OY16159 04510000
*******************************************************************     04520000
*                                                                 *     04530000
*          SUBTYPE 1 -- FCT AND AWAIT ANALYSIS HEADER SECTION  #569@MEC 04540000
*                                                                 *     04550000
*******************************************************************     04560000
SMF84FAW DSECT                                                          04570000
R84FAWLN DS    F        LENGTH OF THE FCT AND AWAIT SECTION   #0371@MEC 04580000
R84NMFMA DS    F        COUNT FOR MULTI-FUNCTION MONITOR ACTIVE IN      04590000
*                       IATNUC; % OF SAMPLES = MFM ACTIVE IN IATNUC     04600000
*                       COUNT / CPU BUSY SAMPLE COUNT * 100;            04610000
*                       % OF IATNUC = MFM ACTIVE IN IATNUC COUNT /      04620000
*                       IATNUC POSTED-ACTIVE COUNT * 100      #0615@MEC 04630000
R84NMFMS DS    F        COUNT FOR MULTI-FUNCTION MONITOR SUSPENDED IN   04640000
*                       IATNUC;                                         04650000
*                       % OF SAMPLES = MFM SUSPENDED IN IATNUC          04660000
*                       COUNT / CPU BUSY SAMPLE COUNT * 100             04670000
R84NMFMW DS    F        COUNT FOR MULTI-FUNCTION MONITOR IN-OS-WAIT IN  04680000
*                       IATNUC; % OF SAMPLES = MFM IN-OS-WAIT IN        04690000
*                       IATNUC COUNT / CPU BUSY SAMPLE COUNT * 100      04700000
*                                                            9#0406@MRD 04710000
R84AMFMA DS    F        COUNT FOR MULTI-FUNCTION MONITOR ACTIVE IN      04720000
*                       IATAUX; % OF SAMPLES = MFM ACTIVE IN  #0615@MEC 04730000
*                       IATAUX CNT / CPU BUSY SAMPLE CNT *100;#0615@MEC 04740000
*                       % OF IATAUX = MFM ACTIVE IN IATAUX CNT#0615@MEC 04750000
*                       / IATAUX POSTED-ACTIVE COUNT * 100    #0615@MEC 04760000
R84AMFMS DS    F        COUNT FOR MULTI-FUNCTION MONITOR SUSPENDED IN   04770000
*                       IATAUX;  % OF SAMPLES = MFM SUSPENDED IN IATAUX 04780000
*                       COUNT / CPU BUSY SAMPLE COUNT * 100             04790000
R84AMFMW DS    F        COUNT FOR MULTI-FUNCTION MONITOR IN-OS-WAIT IN  04800000
*                       IATAUX; % OF SAMPLES = MFM IN-OS-WAIT IN IATAUX 04810000
*                       COUNT / CPU BUSY SAMPLE COUNT * 100             04820000
*                                                            9#0406@MRD 04830000
R84FCTN  DS    H        TOTAL NUMBER OF FCT ENTRIES                     04840000
         DS    XL2      RESERVED FOR DEVELOPMENT              #0411@MEA 04850000
R84FCTOF DS    F        OFFSET OF THE FIRST FCT ENTRY                   04860000
R84FASZ1 EQU   *-R84FAWLN   SIZE OF THE FCT AND AWAIT SECTION           04870000
*********************************************************************** 04880000
*   THE FOLLOWING IS A MAPPING FOR EACH FCT ENTRY                     * 04890000
*********************************************************************** 04900000
R84FCT   DSECT                                                          04910000
R84FSEQN DS    H        FCT SEQUENCE NUMBER                             04920000
         DS    H        RESERVED                               #569@MEA 04930000
R84FNEXT DS    F        LENGTH OF THIS FCT ENTRY               @OY16159 04940000
*                       ALSO USED AS OFFSET TO NEXT FCT,UNLESS#0479@MRA 04950000
*                       THIS IS THE LAST FCT                  #0479@MRA 04960000
R84FNAM  DS    CL8      DSP NAME                                        04970000
R84FDEV  DS    CL8      DEVICE NAME                                     04980000
R84FPRTY DS    H        FCT PRIORITY                                    04990000
R84FCXOF DS    H        Offset of FCT entry extension from the     @RJC 05000000
*                         start of the this FCT entry              @RJA 05005000
R84FFCT  DS    F        FCT ON FCT CHAIN COUNT;                         05010000
*                       % OF SAMPLES = FCT ON FCT CHAIN COUNT           05020000
*                       / CPU BUSY SAMPLE COUNT * 100         #0285@MEC 05030000
R84FNUC  DS    F        FCT IN IATNUC MODE COUNT;                       05040000
*                       % OF SAMPLES = FCT IN IATNUC MODE COUNT         05050000
*                       / CPU BUSY SAMPLE COUNT * 100;                  05060000
*                       % OF FCT = FCT IN IATNUC MODE COUNT             05070000
*                       / FCT ON FCT CHAIN COUNT * 100                  05080000
R84FAUX  DS    F        FCT IN IATAUX MODE COUNT;                       05090000
*                       % OF SAMPLES = FCT IN IATAUX MODE COUNT         05100000
*                       / CPU BUSY SAMPLE COUNT * 100;                  05110000
*                       % OF FCT = FCT IN IATAUX MODE COUNT / #0615@MEC 05120000
*                       FCT ON FCT CHAIN COUNT * 100                    05130000
*********************************************************************** 05140000
*   ACTIVITY UNDER IATNUC MODE                                        * 05150000
*********************************************************************** 05160000
R84FNFPA DS    F        COUNT FOR FCT POSTED-ACTIVE IN IATNUC;          05170000
*                       % OF SAMPLES = FCT POSTED-ACTIVE IN IATNUC      05180000
*                       COUNT / CPU BUSY SAMPLE COUNT * 100;            05190000
*                       % OF IATNUC = FCT POSTED-ACTIVE IN IATNUC COUNT 05200000
*                       / IATNUC POSTED-ACTIVE COUNT * 100;             05210000
*                       % OF FCT = FCT POSTED-ACTIVE IN IATNUC COUNT    05220000
*                       / FCT ON FCT CHAIN COUNT * 100                  05230000
R84FNFNA DS    F        COUNT FOR FCT POSTED-NOT ACTIVE IN IATNUC;      05240000
*                       % OF SAMPLES = FCT POSTED-NOT ACTIVE IN IATNUC  05250000
*                       COUNT / CPU BUSY SAMPLE COUNT * 100;            05260000
*                       % OF FCT = FCT POSTED-NOT ACTIVE IN IATNUC      05270000
*                       COUNT / FCT ON FCT CHAIN COUNT * 100            05280000
R84FNFNP DS    F        COUNT FOR FCT NOT POSTED IN IATNUC;             05290000
*                       % OF SAMPLES = FCT NOT POSTED IN IATNUC COUNT   05300000
*                       / CPU BUSY SAMPLE COUNT * 100;                  05310000
*                       % OF FCT = FCT NOT POSTED IN IATNUC COUNT /     05320000
*                       FCT ON FCT CHAIN COUNT * 100                    05330000
R84FNFW  DS    F        COUNT FOR FCT IN-OS-WAIT IN IATNUC;             05340000
*                       % OF SAMPLES = FCT IN-OS-WAIT IN IATNUC COUNT   05350000
*                       / CPU BUSY SAMPLE COUNT * 100;                  05360000
*                       % OF FCT = FCT IN-OS-WAIT IN IATNUC COUNT /     05370000
*                       FCT ON FCT CHAIN COUNT * 100                    05380000
R84FNFS  DS    F        COUNT FOR FCT SUSPENDED--LOCAL LOCK REQUEST IN  05390000
*                       IATNUC;                                         05400000
*                       % OF SAMPLES = FCT SUSPENDED--LOCAL LOCK        05410000
*                       REQUEST IN IATNUC / CPU BUSY SAMPLE COUNT * 100 05420000
*                       % OF FCT =  FCT SUSPENDED--LOCAL LOCK REQUEST   05430000
*                       IN IATNUC COUNT / FCT ON FCT CHAIN COUNT * 100  05440000
R84FNFSO DS    F        COUNT FOR FCT SUSPENDED--OTHER IN IATNUC;       05450000
*                       % OF SAMPLES = FCT SUSPENDED--OTHER IN IATNUC   05460000
*                       COUNT / CPU BUSY SAMPLE COUNT * 100;            05470000
*                       % OF FCT =  FCT SUSPENDED--OTHER IN IATNUC      05480000
*                       COUNT / FCT ON FCT CHAIN COUNT * 100            05490000
R84FNENT DS    H        TOTAL NUMBER OF FCT AWAIT ENTRIES IN IATNUC     05500000
         DS    XL2      RESERVED FOR DEVELOPMENT              #0286@MEA 05510000
R84FNOFF DS    F        OFFSET OF THE 1ST AWAIT ENTRY IN IATNUC         05520000
*                                                              @OY34777 05525000
*********************************************************************** 05530000
*   ACTIVITY UNDER IATAUX MODE                                        * 05540000
*********************************************************************** 05550000
R84FAFPA DS    F        COUNT FOR FCT POSTED-ACTIVE IN IATAUX;          05560000
*                       % OF SAMPLES = FCT POSTED-ACTIVE IN IATAUX      05570000
*                       COUNT / CPU BUSY SAMPLE COUNT * 100;            05580000
*                       % OF IATAUX = FCT POSTED-ACTIVE IN IATAUX COUNT 05590000
*                       / IATAUX POSTED-ACTIVE COUNT * 100;             05600000
*                       % OF FCT = FCT POSTED-ACTIVE IN IATAUX COUNT    05610000
*                       / FCT ON FCT CHAIN COUNT * 100                  05620000
R84FAFNA DS    F        COUNT FOR FCT POSTED-NOT ACTIVE IN IATAUX;      05630000
*                       % OF SAMPLES = FCT POSTED-NOT ACTIVE IN IATAUX  05640000
*                       COUNT / CPU BUSY SAMPLE COUNT * 100;            05650000
*                       % OF FCT = FCT POSTED-NOT ACTIVE IN IATAUX      05660000
*                       COUNT / FCT ON FCT CHAIN COUNT * 100            05670000
R84FAFNP DS    F        COUNT FOR FCT NOT POSTED IN IATAUX;             05680000
*                       % OF SAMPLES = FCT NOT POSTED IN IATAUX COUNT   05690000
*                       / CPU BUSY SAMPLE COUNT * 100;                  05700000
*                       % OF FCT = FCT NOT POSTED IN IATAUX COUNT /     05710000
*                       FCT ON FCT CHAIN COUNT * 100                    05720000
R84FAFW  DS    F        COUNT FOR FCT IN-OS-WAIT IN IATNUC;             05730000
*                       % OF SAMPLES = FCT IN-OS-WAIT IN IATAUX COUNT / 05740000
*                       CPU BUSY SAMPLE COUNT * 100;                    05750000
*                       % OF FCT = FCT IN-OS-WAIT IN IATAUX COUNT / FCT 05760000
*                       ON FCT CHAIN COUNT * 100                        05770000
R84FAFS  DS    F        COUNT FOR FCT SUSPENDED--LOCAL LOCK REQUEST IN  05780000
*                       IATAUX;                                         05790000
*                       % OF SAMPLES = FCT SUSPENDED--LOCAL LOCK        05800000
*                       REQUEST IN IATAUX COUNT / CPU BUSY SAMPLE COUNT 05810000
*                       * 100;                                          05820000
*                       % OF FCT =  FCT SUSPENDED--LOCAL LOCK REQUEST   05830000
*                       IN IATAUX COUNT / FCT ON FCT CHAIN COUNT * 100  05840000
R84FAFSO DS    F        COUNT FOR FCT SUSPENDED--OTHER IN IATAUX;       05850000
*                       % OF SAMPLES = FCT SUSPENDED--OTHER IN IATAUX   05860000
*                       COUNT / CPU BUSY SAMPLE COUNT * 100;            05870000
*                       % OF FCT =  FCT SUSPENDED--OTHER IN IATAUX      05880000
*                       COUNT / FCT ON FCT CHAIN COUNT * 100            05890000
R84FAENT DS    H        TOTAL NUMBER OF FCT AWAIT ENTRIES IN IATAUX     05900000
         DS    XL2      RESERVED FOR DEVELOPMENT              #0286@MEA 05910000
R84FAOFF DS    F        OFFSET OF THE 1ST AWAIT ENTRY IN IATAUX         05920000
*                                                              @OY34777 05925000
R84FCSZ1 EQU   *-R84FSEQN   SIZE OF THE FCT ENTRY                       05930000
         EJECT ,                                                   @RJA 05930100
***************************************************************    @RJA 05930200
*                                                             *    @RJA 05930300
*        FCT Entry Extension.                                 *    @RJA 05930400
*                                                             *    @RJA 05930500
***************************************************************    @RJA 05930600
R84FCTX  DSECT ,                   FCT Entry Extension             @RJA 05930700
R84FCXLN DC    H'0'                Length of extension.  Use       @RJA 05930800
*                                    this field to determine       @RJA 05930900
*                                    what data is present in       @RJA 05931000
*                                    extension.                    @RJA 05931100
*                                                                  @RJA 05931200
R84FCXRS DC    H'0'                Reserved for development        @RJA 05931300
*                                                                  @RJA 05931400
R84MRFRI DC    F'0'                Number of multi-record file     @RJA 05931500
*                                    read I/O's                    @RJA 05931600
R84MRFWI DC    F'0'                Number of multi-record file     @RJA 05931700
*                                    write I/O's                   @RJA 05931800
R84SRFRI DC    F'0'                Number of single record         @RJA 05931900
*                                    file read I/O's               @RJA 05932000
R84SRFRB DC    F'0'                Number of single record         @RJA 05932100
*                                    file buffers read             @RJA 05932200
R84SRFWI DC    F'0'                Number of single record         @RJA 05932300
*                                    file write I/O's              @RJA 05932400
R84SRFWB DC    F'0'                Number of single record         @RJA 05932500
*                                    file buffers written          @RJA 05932600
*                                                                  @RJA 05932700
R84FCXR2 DC    25F'0'              Reserved for development        @RJA 05932800
*                                                                  @RJA 05939700
R84FCXSZ EQU   *-R84FCTX           Size of FCT entry extension     @RJA 05939800
         EJECT ,                                                   @RJA 05939900
*********************************************************************** 05940000
*   THE FOLLOWING IS A MAPPING FOR EACH FCT AWAIT ENTRY               * 05950000
*********************************************************************** 05960000
R84AWAIT DSECT                                                          05970000
         SPACE 1                                               @OY16159 05980000
*-------------------------------------------------------------*@OY16159 05990000
*        FCT AWAIT FLAG ONE                                   *@OY16159 06000000
*-------------------------------------------------------------*@OY16159 06010000
R84AWFL1 DS    X         FCT AWAIT FLAG 1                               06020000
R84AWGS  EQU   X'80'     AWAIT IS FOR GENERALIZED SUBTASK               06030000
R84AWRJP EQU   X'40'     AWAIT IS FOR RJP I/O                           06040000
R84AWRS  EQU   X'20'     AWAIT IS FOR SPECIALIZED RESCHEDULING          06050000
R84AWCAT EQU   X'10'     AWAIT IS FOR CATALOG LOCATE                    06060000
R84AWGAV EQU   X'08'     AWAIT IS FOR GENERALIZED SUBTASK TO BECOME     06070000
*                        AVAILABLE                                      06080000
R84AWMVC EQU   X'04'     AWAIT IS FOR MVS/CI                   @OY16159 06090000
R84AWRCD EQU   X'02'     AWAIT is described by a reason code       @RJA 06091000
*                          (see IATYAWR for the definitions        @RJA 06092000
*                          of the reason codes)                    @RJA 06093000
         SPACE 1                                               @OY16159 06100000
*-------------------------------------------------------------*@OY16159 06110000
*        FCT AWAIT FLAG TWO                                   *@OY16159 06120000
*-------------------------------------------------------------*@OY16159 06130000
R84AWFL2 DS    X         FCT AWAIT FLAG 2                               06140000
R84AWSTD EQU   X'80'     AWAIT IS STANDARD AWAIT                        06150000
R84AWALD EQU   X'40'     AWAIT IS FOR ALOAD OF A MODULE                 06160000
R84AWFDB EQU   X'20'     AWAIT IS FOR FDB I/O                           06170000
R84AWSDM EQU   X'10'     AWAIT IS FOR SDM                               06180000
R84AWENQ EQU   X'08'     AWAIT IS FOR AENQ ON A RESOURCE                06190000
R84AWCNB EQU   X'04'     AWAIT IS FOR CONSOLE BUFFERS                   06200000
R84AWUNK EQU   X'02'     AWAIT IS UNKNOWN                               06210000
         SPACE 1                                               @OY16159 06220000
*-------------------------------------------------------------*@OY16159 06230000
*        FCT AWAIT FLAG THREE                                 *@OY16159 06240000
*-------------------------------------------------------------*@OY16159 06250000
R84AWFL3 DS    X         FCT AWAIT FLAG 3                      @OY16159 06260000
R84AWLCS EQU   1         AWAIT IS FOR LOCATE SCHEDULE          @OY16159 06270000
R84AWCTS EQU   2         AWAIT IS FOR CATALOG SETUP            @OY16159 06280000
         SPACE 1                                               @OY16159 06290000
         DS    XL1       RESERVED FOR DEVELOPMENT              @OY16159 06300000
R84AWUSE DS    F         AWAIT IN USE COUNT;                            06310000
*                        % OF SAMPLES = AWAIT IN USE COUNT / CPU BUSY   06320000
*                        SAMPLE COUNT * 100;                            06330000
*                        % OF FCT = AWAIT IN USE COUNT / FCT ON FCT     06340000
*                        CHAIN COUNT * 100                              06350000
R84AWPA  DS    F         COUNT FOR AWAIT POSTED-ACTIVE;                 06360000
*                        % OF SAMPLES = AWAIT POSTED-ACTIVE COUNT /     06370000
*                        CPU BUSY SAMPLE COUNT * 100;                   06380000
*                        % OF NUC OR AUX MODE = AWAIT POSTED-ACTIVE     06390000
*                        COUNT / IATNUC OR IATAUX POSTED-ACTIVE COUNT;  06400000
*                        * 100;                                         06410000
*                        % OF FCT = AWAIT POSTED-ACTIVE COUNT / FCT     06420000
*                        ON FCT CHAIN COUNT * 100                       06430000
R84AWPNA DS    F         COUNT FOR AWAIT POSTED-NOT ACTIVE;             06440000
*                        % OF SAMPLES = AWAIT POSTED-NOT ACTIVE COUNT / 06450000
*                        CPU BUSY SAMPLE COUNT * 100;                   06460000
*                        % OF FCT = AWAIT POSTED-NOT ACTIVE COUNT /     06470000
*                        FCT ON FCT CHAIN COUNT * 100                   06480000
R84AWNP  DS    F         COUNT FOR AWAIT NOT POSTED;                    06490000
*                        % OF SAMPLES = AWAIT NOT POSTED COUNT /        06500000
*                        CPU BUSY SAMPLE COUNT * 100;                   06510000
*                        % OF FCT = AWAIT NOT POSTED COUNT / FCT        06520000
*                        ON FCT CHAIN COUNT * 100                       06530000
R84AWAVG DS    F         AVERAGE AWAIT DURATION TIME                    06540000
R84AWTOT DS    F         TOTAL AWAIT DURATION TIME                      06550000
R84AWMAX DS    F         MAXIMUM AWAIT DURATION TIME                    06560000
R84AWMOD DS    CL8       MODULE NAME FOR MAXIMUM AWAIT                  06570000
R84AWDIS DS    F         MODULE DISPLACEMENT TO MAXIMUM AWAIT           06580000
         DS    XL8       RESERVED FOR DEVELOPMENT              @OY16159 06590000
*                                                              @OY34777 06595000
*********************************************************************** 06600000
*    FOR STANDARD AWAIT (WHEN R84AWFL2 = X'80')                       * 06610000
*********************************************************************** 06620000
R84STDAW DS    CL8       STANDARD AWAIT NAME                            06630000
R84STDRS DS    XL12      RESERVED FOR DEVELOPMENT             #0411@MEA 06640000
R84STDSZ EQU   *-R84AWFL1 SIZE OF THE FCT AWAIT ENTRY                   06650000
*********************************************************************** 06660000
*    FOR ALOAD AWAIT (WHEN R84AWFL2 = X'40')                          * 06670000
*********************************************************************** 06680000
         ORG   R84STDAW                                                 06690000
R84MODNM DS    CL8       MODULE NAME                                    06700000
R84MODRS DS    XL12      RESERVED FOR DEVELOPMENT             #0411@MEA 06710000
R84MODSZ EQU   *-R84AWFL1 SIZE OF THE FCT AWAIT ENTRY                   06720000
*********************************************************************** 06730000
*    FOR FDB AWAIT (WHEN R84AWFL2 = X'20')                            * 06740000
*********************************************************************** 06750000
         ORG   R84STDAW                                                 06760000
R84FDBIO DS    CL6        INPUT/OUTPUT FDB;                             06770000
R84FDBRF DS    CL3        MRF OR SRF                                    06780000
         DS    X          UNUSED                                        06790000
R84FDBTY DS    CL3        I/O OR BLANKS                                 06800000
R84FDBRS DS    XL7        RESERVED FOR DEVELOPMENT            #0411@MEA 06810000
R84FDBSZ EQU   *-R84AWFL1 SIZE OF THE FCT AWAIT ENTRY                   06820000
*********************************************************************** 06830000
*    FOR SDM AWAIT (WHEN R84AWFL2 = X'10')                            * 06840000
*********************************************************************** 06850000
         ORG   R84STDAW                                                 06860000
R84SDMTY DS    CL20       SDM AWAIT TYPE; BUFFERS OR FILE DIRECTORY     06870000
*                         SPACE 1                                       06880000
R84SDMSZ EQU   *-R84AWFL1 SIZE OF THE FCT AWAIT ENTRY                   06890000
*********************************************************************** 06900000
*    FOR AENQ AWAIT (WHEN R84AWFL2 = X'08')                           * 06910000
*********************************************************************** 06920000
         ORG   R84STDAW                                                 06930000
R84ENQRN DS    CL8        AENQ RESOURCE NAME                            06940000
R84ENQRS DS    XL12       RESERVED FOR DEVELOPMENT            #0411@MEA 06950000
R84ENQSZ EQU   *-R84AWFL1 SIZE OF THE FCT AWAIT ENTRY                   06960000
*********************************************************************** 06970000
*    FOR CONSOLE BUFFERS AWAIT (WHEN R84AWFL2 = X'04')                * 06980000
*********************************************************************** 06990000
         ORG   R84STDAW                                                 07000000
R84CNBTY DS    CL8        CONSOLE BUFFERS AWAIT TYPE                    07010000
R84CNBRS DS    XL12       RESERVED FOR DEVELOPMENT            #0411@MEA 07020000
R84CNBSZ EQU   *-R84AWFL1 SIZE OF THE FCT AWAIT ENTRY                   07030000
         SPACE 1                                                   @RJA 07030500
*******************************************************************@RJA 07031000
*    For AWAITs when an AWAIT reason code is used to describe      @RJA 07031500
*    the AWAIT (when R84AWFL1 = R84AWRCD).                         @RJA 07032000
*******************************************************************@RJA 07032500
         ORG   R84STDAW                                            @RJA 07033000
R84AWRSN DS    XL2                 AWAIT reason code               @RJA 07033500
R84AWRSV DS    X                   Reserved for development        @RJA 07034000
R84AWDLN DS    X                   AWAIT data length or zero       @RJA 07034500
R84AWDAT DS    CL16                Up to 16 bytes of AWAIT         @RJA 07035000
*                                    related data or zeroes        @RJA 07035100
R84AWCSZ EQU   *-R84AWFL1          Size of the AWAIT entry         @RJA 07035200
         SPACE 1                                                   @RJA 07036000
**********************************************************************  07040000
*    FOR UNKNOWN AWAIT (WHEN R84AWFL2 = X'02')                       *  07050000
**********************************************************************  07060000
         ORG   R84STDAW                                                 07070000
R84AWMSK DS    X          AWAIT MASK                                    07080000
         DS    XL3        UNUSED                              #0286@MEC 07090000
R84AWADR DS    F          AWAIT ADDRESS                                 07100000
R84AWARS DS    XL12       RESERVED FOR DEVELOPMENT            #0411@MEA 07110000
R84AWSZ1 EQU   *-R84AWFL1 SIZE OF THE FCT AWAIT ENTRY                   07120000
         SPACE 2                                                        07130000
         AIF   ('&SUBTYPE' EQ 'ALL').SUBTYP2                  #0622@MEA 07140000
         AIF   ('&SUBTYPE' EQ 'ALLJ3').SUBTYP2                 @Z23LSMF 07143000
         AIF   ('&SUBTYPE' EQ 'ALLJES').SUBTYP2                @Z23LSMF 07146000
         AIF   ('&SUBTYPE' EQ '').SUBTYP2                               07148000
         MEXIT                                                #0622@MEA 07150000
.SUBTYP2 ANOP                                                           07160000
*********************************************************************** 07170000
*                                                                     * 07180000
*      RELOCATE BLOCK FOR SUBTYPE 2 - FCT SUMMARY AND HIGHLIGHT DATA  * 07190000
*                                                                     * 07200000
*      THERE ARE 3 DATA SECTION:  1) FCT SUMMARY, 2) FCT AWAIT AND    * 07210000
*      HIGHLIGHT, 3) JES3 WAIT ANALYSIS                               * 07220000
*                                                                     * 07230000
*********************************************************************** 07240000
         SPACE 2                                                        07250000
*******************************************************************     07260000
*                                                                 *     07270000
*                  SUBTYPE 2  --  HEADER                       #569@MEC 07280000
*                                                                 *     07290000
*******************************************************************     07300000
SMF84HR2 DSECT                                                 #693@MEC 07310000
R84FCTNM DS    F        NUMBER OF FCT ENTRIES                           07320000
R84FSMLN DS    F        LENGTH OF THE FCT SUMMARY SECTION               07330000
R84FSMOF DS    F        OFFSET TO THE FIRST FCT SUMMARY ENTRY #0615@MEC 07340000
R84FAHOF DS    F        OFFSET OF THE FCT AWAIT AND HIGHLIGHT SECTION   07350000
R84WAITO DS    F        OFFSET OF THE JES3 WAIT ANALYSIS SECTION        07360000
R84S2FLG DS    X'00'    SUBTYPE-2 HEADER FLAG                  #569@MEA 07370000
R84SFCT  EQU   X'80'    FCT SUMMARY AND HIGHLIGHT SEGMENT      #691@MEA 07380000
R84WAIT  EQU   X'40'    WAIT ANALYSIS SEGMENT                  #569@MEA 07390000
         DS    XL3      RESERVED FOR DEVELOPMENT               #569@MEA 07400000
R84FSSZ1 EQU   *-R84FCTNM SIZE OF THE SUBTYPE 2 HEADER                  07410000
*********************************************************************** 07420000
*         SUBTYPE 2  --  FCT SUMMARY SECTION                   #569@MEA 07430000
*                                                              #569@MEA 07440000
*   THE FOLLOWING IS A MAPPING FOR EACH FCT SUMMARY ENTRY             * 07450000
*********************************************************************** 07460000
R84FCTSM DSECT                                                          07470000
R84FSNUM DS    F        FCT SEQUENCE NUMBER                             07480000
R84FSNAM DS    CL8      DSP NAME                                        07490000
R84DEV   DS    CL8      DEVICE                                          07500000
R84FSPRT DS    H        FCT PRIORITY                                    07510000
         DS    XL2      RESERVED FOR DEVELOPMENT              #0286@MEA 07520000
R84FCHN  DS    F        FCT ON FCT CHAIN COUNT;                         07530000
*                       % OF FCT ON FCT CHAIN = FCT ON FCT CHAIN        07540000
*                       COUNT / CPU BUSY SAMPLE COUNT * 100             07550000
R84FSNUC DS    F        FCT IN IATNUC MODE COUNT;                       07560000
*                       % OF FCT IN IATNUC MODE = FCT IN IATNUC MODE    07570000
*                       COUNT / CPU BUSY SAMPLE COUNT * 100             07580000
R84FSAUX DS    F        FCT IN IATAUX MODE COUNT;                       07590000
*                       % OF FCT IN IATAUX MODE = FCT IN IATAUX MODE    07600000
*                       COUNT / CPU BUSY SAMPLE COUNT * 100             07610000
R84FNPA  DS    F        COUNT FOR FCT POSTED-ACTIVE IN IATNUC;          07620000
*                       % OF FCT POSTED-ACTIVE IN IATNUC = FCT POSTED-  07630000
*                       ACTIVE IN IATNUC COUNT / CPU BUSY SAMPLE COUNT  07640000
*                       * 100                                           07650000
R84FAPA  DS    F        COUNT FOR FCT POSTED-ACTIVE IN IATAUX;          07660000
*                       % OF FCT POSTED-ACTIVE IN IATAUX = FCT POSTED-  07670000
*                       ACTIVE IN IATAUX COUNT / CPU BUSY SAMPLE COUNT  07680000
*                       * 100                                           07690000
R84FNPNA DS    F        COUNT FOR FCT POSTED-NOT-ACTIVE IN IATNUC       07700000
*                       % OF FCT POSTED-NOT-ACTIVE IN IATNUC = FCT      07710000
*                       POSTED-NOT-ACTIVE IN IATNUC COUNT / CPU         07720000
*                       BUSY SAMPLE COUNT * 100                         07730000
R84FAPNA DS    F        COUNT FOR FCT POSTED-NOT-ACTIVE IN IATAUX;      07740000
*                       % OF FCT POSTED-NOT-ACTIVE IN IATNUC = FCT      07750000
*                       POSTED-NOT-ACTIVE IN IATAUX COUNT / CPU BUSY    07760000
*                       SAMPLE COUNT * 100                              07770000
R84FNNP  DS    F        COUNT FOR FCT NOT-POSTED IN IATNUC;             07780000
*                       % OF FCT NOT-POSTED IN IATNUC = FCT NOT-POSTED  07790000
*                       IN IATNUC COUNT / CPU BUSY SAMPLE COUNT * 100   07800000
R84FANP  DS    F        COUNT FOR FCT NOT-POSTED IN IATAUX;             07810000
*                       % OF FCT NOT-POSTED IN IATAUX = FCT NOT-POSTED  07820000
*                       IN IATAUX COUNT / CPU BUSY SAMPLE COUNT * 100   07830000
R84FNSOS DS    F        COUNT FOR FCT IN-OS-WAIT IN IATNUC;             07840000
*                       % OF FCT IN-OS-WAIT IN IATNUC = FCT IN-OS-WAIT  07850000
*                       IN IATNUC COUNT / CPU BUSY SAMPLE COUNT * 100   07860000
R84FASOS DS    F        COUNT FOR FCT IN-OS-WAIT IN IATAUX;             07870000
*                       % OF FCT IN-OS-WAIT IN IATAUX = FCT IN-OS-WAIT  07880000
*                       IN IATAUX COUNT  / CPU BUSY SAMPLE COUNT * 100  07890000
*                                                              @OY34777 07895000
R84FESZ1 EQU   *-R84FSNUM SIZE OF THE FCT SUMMARY ENTRY                 07900000
         SPACE 2                                                        07910000
*******************************************************************     07920000
*                                                                 *     07930000
*          SUBTYPE 2  --  FCT AND AWAIT HIGHLIGHT SECTION         *     07940000
*                                                                 *     07950000
*******************************************************************     07960000
SMF84FAH DSECT                                                          07970000
R84FHLNG DS    F        LENGTH OF THE FCT AND AWAIT HIGHLIGHT SECTION   07980000
*******************************************************************     07990000
*    THE 5 MOST ACTIVE FCT S IN IATNUC.                           *     08000000
*    EACH ENTRY IS MAPPED BY R845MOST.                            *     08005000
*******************************************************************     08010000
R84N1MA  DS    5F       1ST MOST ACTIVE FCT IN IATNUC          @OY34777 08020000
R84N2MA  DS    5F       2ND MOST ACTIVE FCT IN IATNUC          @OY34777 08030000
R84N3MA  DS    5F       3RD MOST ACTIVE FCT IN IATNUC          @OY34777 08040000
R84N4MA  DS    5F       4TH MOST ACTIVE FCT IN IATNUC          @OY34777 08050000
R84N5MA  DS    5F       5TH MOST ACTIVE FCT IN IATNUC          @OY34777 08060000
*********************************************************************** 08070000
*    THE 5 MOST ACTIVE FCT S IN IATAUX.                               * 08080000
*    EACH ENTRY IS MAPPED BY R845MOST.                                * 08085000
*********************************************************************** 08090000
R84A1MA  DS    5F       1ST MOST ACTIVE FCT IN IATAUX          @OY34777 08100000
R84A2MA  DS    5F       2ND MOST ACTIVE FCT IN IATAUX          @OY34777 08110000
R84A3MA  DS    5F       3RD MOST ACTIVE FCT IN IATAUX          @OY34777 08120000
R84A4MA  DS    5F       4TH MOST ACTIVE FCT IN IATAUX          @OY34777 08130000
R84A5MA  DS    5F       5TH MOST ACTIVE FCT IN IATAUX          @OY34777 08140000
*********************************************************************** 08150000
*    THE 5 MOST POSTED-NOT ACTIVE FCT S IN IATNUC.                    * 08160000
*    EACH ENTRY IS MAPPED BY R845MOST.                                * 08165000
*********************************************************************** 08170000
R84N1PNA DS    5F       1ST MOST POSTED-NOT-ACTIVE FCT IN NUC  @OY34777 08180000
R84N2PNA DS    5F       2ND MOST POSTED-NOT-ACTIVE FCT IN NUC  @OY34777 08190000
R84N3PNA DS    5F       3RD MOST POSTED-NOT-ACTIVE FCT IN NUC  @OY34777 08200000
R84N4PNA DS    5F       4TH MOST POSTED-NOT-ACTIVE FCT IN NUC  @OY34777 08210000
R84N5PNA DS    5F       5TH MOST POSTED-NOT-ACTIVE FCT IN NUC  @OY34777 08220000
*********************************************************************** 08230000
*    THE 5 MOST POSTED-NOT ACTIVE FCT S IN IATAUX.                    * 08240000
*    EACH ENTRY IS MAPPED BY R845MOST.                                * 08245000
*********************************************************************** 08250000
R84A1PNA DS    5F       1ST MOST POSTED-NOT-ACTIVE FCT IN AUX  @OY34777 08260000
R84A2PNA DS    5F       2ND MOST POSTED-NOT-ACTIVE FCT IN AUX  @OY34777 08270000
R84A3PNA DS    5F       3RD MOST POSTED-NOT-ACTIVE FCT IN AUX  @OY34777 08280000
R84A4PNA DS    5F       4TH MOST POSTED-NOT-ACTIVE FCT IN AUX  @OY34777 08290000
R84A5PNA DS    5F       5TH MOST POSTED-NOT-ACTIVE FCT IN AUX  @OY34777 08300000
*********************************************************************** 08310000
*    THE 5 MOST IN-OS-WAIT FCT S IN IATNUC                            * 08320000
*    EACH ENTRY IS MAPPED BY R845MOST.                                * 08325000
*********************************************************************** 08330000
R84N1OSW DS    5F       1ST MOST IN-OS-WAIT FCT IN IATNUC      @OY34777 08340000
R84N2OSW DS    5F       2ND MOST IN-OS-WAIT FCT IN IATNUC      @OY34777 08350000
R84N3OSW DS    5F       3RD MOST IN-OS-WAIT FCT IN IATNUC      @OY34777 08360000
R84N4OSW DS    5F       4TH MOST IN-OS-WAIT FCT IN IATNUC      @OY34777 08370000
R84N5OSW DS    5F       5TH MOST IN-OS-WAIT FCT IN IATNUC      @OY34777 08380000
*********************************************************************** 08390000
*    THE 5 MOST IN-OS-WAIT FCT S IN IATAUX                            * 08400000
*    EACH ENTRY IS MAPPED BY R845MOST.                                * 08405000
*********************************************************************** 08410000
R84A1OSW DS    5F        1ST MOST IN-OS-WAIT FCT IN IATAUX     @OY34777 08420000
R84A2OSW DS    5F        2ND MOST IN-OS-WAIT FCT IN IATAUX     @OY34777 08430000
R84A3OSW DS    5F        3RD MOST IN-OS-WAIT FCT IN IATAUX     @OY34777 08440000
R84A4OSW DS    5F        4TH MOST IN-OS-WAIT FCT IN IATAUX     @OY34777 08450000
R84A5OSW DS    5F        5TH MOST IN-OS-WAIT FCT IN IATAUX     @OY34777 08460000
*********************************************************************** 08470000
*    THE 10 BIGGEST JES3 AWAIT BOTTLENECKS                            * 08480000
*    EACH ENTRY IS MAPPED BY R84BNECK.                                * 08485000
*********************************************************************** 08490000
R84AW1BN DS    12F       1ST BIGGEST JES3 AWAIT BOTTLENECK     @OY34777 08500000
R84AW2BN DS    12F       2ND BIGGEST JES3 AWAIT BOTTLENECK     @OY34777 08510000
R84AW3BN DS    12F       3RD BIGGEST JES3 AWAIT BOTTLENECK     @OY34777 08520000
R84AW4BN DS    12F       4TH BIGGEST JES3 AWAIT BOTTLENECK     @OY34777 08530000
R84AW5BN DS    12F       5TH BIGGEST JES3 AWAIT BOTTLENECK     @OY34777 08540000
R84AW6BN DS    12F       6TH BIGGEST JES3 AWAIT BOTTLENECK     @OY34777 08550000
R84AW7BN DS    12F       7TH BIGGEST JES3 AWAIT BOTTLENECK     @OY34777 08560000
R84AW8BN DS    12F       8TH BIGGEST JES3 AWAIT BOTTLENECK     @OY34777 08570000
R84AW9BN DS    12F       9TH BIGGEST JES3 AWAIT BOTTLENECK     @OY34777 08580000
R84AWABN DS    12F       10TH BIGGEST JES3 AWAIT BOTTLENECK    @OY34777 08590000
*********************************************************************** 08600000
*    DMJA FCT SUMMARY SECTION                                         * 08610000
*********************************************************************** 08620000
R84DMMXA DS    F         MAXIMUM ACTIVE DMJA FCTS ALLOWED               08630000
R84DMMN  DS    F         MINIMUM NUMBER OF ACTIVE DMJA FCTS             08640000
R84DMMX  DS    F         MAXIMUM NUMBER OF ACTIVE DMJA FCTS             08650000
R84DMAV  DS    F         AVERAGE NUMBER OF ACTIVE DMJA FCTS             08660000
R84FHSZ1 EQU   *-R84FHLNG SIZE OF THE FCT AWAIT HIGHLIGHT ENTRY         08670000
*********************************************************************** 08680000
*    EACH OF THE 5 MOST ACTIVE, 5 MOST POSTED-NOT-ACTIVE AND 5 MOST   * 08690000
*    IN-OS-WAIT ENTRIES CAN BE MAPPED BY THE FOLLOWING FORMAT.        * 08700000
*                                                             #0479@MRA 08710000
*    NOTE:  R84TPA IS NOT USED FOR IN-OS-WAIT AND POSTED-NOT- #0479@MRA 08720000
*           ACTIVE                                            #0479@MRA 08730000
*********************************************************************** 08740000
R845MOST DSECT                                                          08750000
R84FSQNM DS    F         FCT SEQUENCE NUMBER                            08760000
R84FNAME DS    CL8       DSP NAME                                       08770000
R84TPA   DS    F         TASK COUNT;                          #0479@MRC 08780000
R84FPA   DS    F         FCT COUNT;                           #0479@MRC 08790000
*                        % OF SAMPLES = FCT COUNT /           #0479@MRC 08800000
*                        CPU BUSY SAMPLE * 100;                         08810000
*                        % OF TASK = FCT COUNT /              #0479@MRC 08820000
*                        TASK COUNT * 100;                    #0479@MRC 08830000
*                                                              @OY34777 08835000
R84MOSZ1 EQU   *-R84FSQNM SIZE OF THE "5 MOST ..." ENTRY      #0479@MRC 08840000
*********************************************************************** 08850000
*    EACH OF THE 10 BIGGEST JES3 AWAIT BOTTLENECK ENTRY CAN BE MAPPED * 08860000
*    BY THE FOLLOWING FORMAT.                                         * 08870000
*********************************************************************** 08880000
R84BNECK DSECT                                                          08890000
R84BSEQN DS    F         FCT SEQUENCE NUMBER                            08900000
R84BNAME DS    CL8       DSP NAME                                       08910000
R84BTSK  DS    CL8       TASK NAME                                      08920000
R84BADAT DS    CL8       Up to 8 bytes of AWAIT data               @RJC 08930000
R84BEQNM EQU   R84BADAT,8  Old field name no longer used           @RJA 08931000
R84BRSN  DS    X         REASON FOR AWAITING                            08940000
R84BENQ  EQU   X'80'     AENQ                                           08950000
R84BSDMF EQU   X'40'     SDM - WAITING FOR FILE DIRECTORY               08960000
R84BSDMB EQU   X'20'     SDM - WAITING FOR JSAM BUFFERS                 08970000
R84BCNB  EQU   X'10'     CONSOLE BUFFERS                                08980000
R84BCAT  EQU   X'08'     CATALOG LOCATE                                 08990000
R84BLOCS EQU   X'04'     LOCATE SCHEDULE                       @OY16159 09000000
R84BAWRC EQU   X'02'     AWAIT reason code describes the           @RJA 09003000
*                          AWAIT bottleneck                        @RJA 09006000
R84BARSN DC    XL2'00'   AWAIT reason code                         @RJC 09010000
R84BADLN DC    X'00'     AWAIT data length or zero                 @RJA 09015000
R84BCNNM DS    CL8       Old field name no longer used             @RJC 09020000
R84BTOTD DS    F         TOTAL AWAIT DURATION TIME =          #0615@MEC 09030000
*                        (IN HUNDREDTHS OF SECONDS)           #0615@MEA 09040000
*                        NOT POSTED (TOTAL DURATION) COUNT *  #0615@MEA 09050000
*                        JMF CYCLE TIME.                      #0615@MEA 09060000
R84BMAXD DS    F         MAXIMUM AWAIT DURATION TIME =        #0622@MEC 09070000
*                        (IN HUNDREDTHS OF SECONDS)           #0615@MEA 09080000
*                        MAXIMUM AWAIT DURATION COUNT *       #0615@MEA 09090000
*                        JMF CYCLE TIME.                      #0615@MEA 09100000
*                                                              @OY34777 09105000
R84BNSZ1 EQU   *-R84BSEQN SIZE OF THE AWAIT BOTTLENECK ENTRY            09110000
*******************************************************************     09120000
*                                                                 *     09130000
*          SUBTYPE 2  --  JES3 WAIT ANALYSIS SECTON               *     09140000
*                                                                 *     09150000
*******************************************************************     09160000
SMF84WT  DSECT                                                          09170000
R84WTLNG DS    F        LENGTH OF THE JES3 WAIT ANALYSIS SECTION        09180000
R84WTNUM DS    F        TOTAL NUMBER OF WAIT ANALYSIS ENTRIES           09190000
R84WTOFF DS    F        OFFSET OF THE 1ST ENTRY                         09200000
*                                                             #0497@MED 09210000
R84WTSZ1 EQU   *-R84WTLNG SIZE OF THE JES3 WAIT ANALYSIS SECTION        09220000
**********************************************************************  09230000
*    EACH IATNUC AND IATAUX WAIT ANALYSIS ENTRY CAN BE MAPPED BY THE *  09240000
*    FOLLOWING FORMAT.                                               *  09250000
**********************************************************************  09260000
R84WTNUC DSECT                                                          09270000
R84WTNAM DS    CL8      DSP NAME                                        09280000
R84WTFSN DS    F        FCT SEQUENCE NUMBER                             09290000
R84WTTSK DS    CL8      TASK NAME                                       09300000
R84WTFOS DS    F        COUNT FOR FCT IN OS WAIT;                       09310000
*                       % OF FCT IN OS WAIT = FCT IN OS WAIT / JMF      09320000
*                       SAMPLE COUNT  * 100                             09330000
R84WTFLG DS    X        TYPE OF A WAIT                                  09340000
R84WTPAG EQU   X'80'    PAGE FAULT                                      09350000
R84WTSVC EQU   X'40'    SVC WAIT                                        09360000
R84WTLOD EQU   X'20'    LOAD WAIT                                       09370000
         DS    XL3      RESERVED                                        09380000
*                                                              @OY34777 09385000
*********************************************************************** 09390000
*    THE FOLLOWING FIELDS ARE APPLICABLE ONLY TO PAGE FAULT           * 09400000
*********************************************************************** 09410000
R84PADR  DS    F        ADDRESS OF WHERE THE PAGE FAULT OCCURED         09420000
R84PNAM  DS    CL8      MODULE NAME                                     09430000
R84PMOF  DS    F        OFFSET INTO THE MODULE                          09440000
R84PCNT  DS    F        PAGE FAULT COUNT                                09450000
         DS    3F       RESERVED                                        09460000
R84WTPS1 EQU   *-R84WTNAM SIZE OF IATNUC/AUX JES3 WAIT ANALYSIS ENTRY   09470000
*********************************************************************** 09480000
*    THE FOLLOWING FIELDS ARE APPLICABLE ONLY TO SVC WAIT             * 09490000
*********************************************************************** 09500000
         ORG   R84PADR                                                  09510000
R84SNUM  DS    F        SVC NUMBER                                      09520000
R84SNAM  DS    CL8      SVC NAME                                        09530000
R84SADR  DS    F        ADDRESS OF WHERE THE SVC WAIT OCCURED           09540000
R84SMNAM DS    CL8      MODULE NAME                                     09550000
R84SMOFS DS    F        OFFSET INTO THE MODULE                          09560000
R84SCNT  DS    F        SVC COUNT                                       09570000
R84WTSS1 EQU   *-R84WTNAM SIZE OF IATNUC/AUX JES3 WAIT ANALYSIS ENTRY   09580000
**********************************************************************  09590000
*    THE FOLLOWING FIELDS ARE APPLICABLE ONLY TO LOAD WAIT           *  09600000
**********************************************************************  09610000
         ORG   R84PADR                                                  09620000
R84LMNAM DS    CL8      LOADING MODULE NAME                             09630000
R84LCNT  DS    F        LOAD COUNT                                      09640000
         DS    5F       RESERVED                                        09650000
R84WTLS1 EQU   *-R84WTNAM SIZE OF IATNUC/AUX JES3 WAIT ANALYSIS ENTRY   09660000
         AIF   ('&SUBTYPE' EQ 'ALL').SUBTYP3                            09670000
         AIF   ('&SUBTYPE' EQ 'ALLJ3').SUBTYP3                 @Z23LSMF 09672000
         AIF   ('&SUBTYPE' EQ 'ALLJES').SUBTYP3                @Z23LSMF 09675000
         AIF   ('&SUBTYPE' EQ '').SUBTYP3                               09676000
         MEXIT                                                          09680000
.SUBTYP3 ANOP                                                           09690000
*********************************************************************** 09700000
*                                                                     * 09710000
*      RELOCATE BLOCK FOR SUBTYPE 3 - SPOOL DATA MANAGEMENT SECTION   * 09720000
*                                                                     * 09730000
*      THERE ARE 8 DATA SECTIONS:  1) GENERAL SDM DATA SECTION,       * 09740000
*      2) SPOOL DATA DESCRIBTION SECTION, 3) SPOOL PARTITION DESCRIP- * 09750000
*      TION SECTION, 4) SPOOL SPACE UTILIZATION SNAPSHOT SECTION,     * 09760000
*      5) SINGLE TRACK TABLE SPACE ALLOCATION SNAPSHOT SECTION,       * 09770000
*      6) SPOOL I/O ACTIVITY -- BUFFERS READ AND WRITTEN,     #0508@MEC 09780000
*      7) BUFFERS CHAINING BY SPOOL DATASET SECTION AND 8) MINIMAL/   * 09790000
*      MARGINAL TRACK CONDITION SECTION.                              * 09800000
*                                                                     * 09810000
*********************************************************************** 09820000
*******************************************************************     09830000
*                                                                 *     09840000
*          SUBTYPE 3  --  GENERAL SDM DATA SECTION                *     09850000
*                                                                 *     09860000
*******************************************************************     09870000
SMF84SDM DSECT                  GENERAL SDM DATA SECTION                09880000
R84SDMLN DS    F        LENGTH OF THE SDM SECTION                       09890000
R84BUFSZ DS    F        SPOOL BUFFER SIZE                               09900000
R84NBFPG DS    F        NUMBER OF BUFFERS PER 4K PAGE                   09910000
R84FDENT DS    F        FILE DIRECTORY ENTRIES                          09920000
R84SPDSU DS    F        NUMBER OF SPOOL DATASETS IN USE                 09930000
R84JSAMB DS    F        NUMBER OF JSAM BUFFERS                          09940000
R84JSAMT DS    F        JSAM THRESHOLD FOR JSAM MINBUF CONDITION        09950000
R84PBUFC DS    F        NUMBER OF PROTECTED USAM BUFFERS IN CSA         09960000
R84PBUFA DS    F        NUMBER OF PROTECTED USAM BUFFERS IN AUX         09970000
R84UPBUF DS    F        NUMBER OF UNPROTECTED USAM BUFFERS PER OPEN     09980000
*                       USAM DATASET                                    09990000
R84MAXB  DS    F        MAXIMUM DATA BYTES IN A USAM BUFFERS            10000000
R84DSENT DS    F        TOTAL NUMBER OF SPOOL DATASET DESCRIPTION       10010000
*                       ENTRIES                                         10020000
R84DSOFF DS    F        OFFSET OF THE 1ST SPOOL DATASET DESCRIPTION     10030000
*                       ENTRY                                           10040000
R84PRENT DS    F        TOTAL NUMBER OF SPOOL PARTITION DESCRIPTION     10050000
*                       ENTRIES                                         10060000
R84PROFF DS    F        OFFSET OF THE 1ST SPOOL PARTITION DESCRIPTION   10070000
*                       ENTRY                                           10080000
R84SUENT DS    F        TOTAL NUMBER OF SPOOL SPACE UTILIZATION SNAP-   10090000
*                       SHOT ENTRIES                                    10100000
R84SUOFF DS    F        ADDRESS OF THE 1ST SPOOL SPACE UTILIZATION      10110000
*                       SNAPSHOT ENTRY                                  10120000
R84STENT DS    F        TOTAL NUMBER OF SINGLE TRACK TABLE SPACE        10130000
*                       ALLOCATION SNAPSHOT ENTRIES                     10140000
R84STOFF DS    F        OFFSET OF THE 1ST SINGLE TRACK TABLE SPACE      10150000
*                       ALLOCATION SNAPSHOT ENTRY             #0615@MEC 10160000
R84IOENT DS    F        TOTAL NUMBER OF SPOOL I/O ACTIVITY -- BUFFER    10170000
*                       READ AND WRITTEN -- ENTRIES           #0508@MEC 10180000
R84IOOFF DS    F        OFFSET OF THE 1ST SPOOL I/O ACTIVITY --         10190000
*                       BUFFERS READ AND WRITTEN ENTRY         #569@MEC 10200000
R84BCENT DS    F        TOTAL NUMBER OF BUFFER CHAINING BY SPOOL        10210000
*                       DATASET ENTRIES                                 10220000
R84BCOFF DS    F        OFFSET OF THE 1ST BUFFER CHAINING BY SPOOL      10230000
*                       DATASET ENTRY                                   10240000
**********************************************************************  10250000
*   SDM EXCEPTIONAL CONDITIONS                                       *  10260000
**********************************************************************  10270000
R84JSAMU DS    F        COUNT FOR JSAM UNAVAILABLE BUFFERS;             10280000
*                       % OF JSAM UNAVAILABLE BUFFERS = JSAM UNAVAIL-   10290000
*                       ABLE BUFFERS COUNT/CPU BUSY SAMPLE    #0402@MEC 10300000
*                       COUNT * 100                                     10310000
R84USAMU DS    F        COUNT FOR USAM UNAVAILABLE BUFFERS;             10320000
*                       % OF USAM UNAVAILABLE BUFFERS = USAM UNAVAILA-  10330000
*                       BLE BUFFERS COUNT / CPU BUSY SAMPLE COUNT       10340000
*                       * 100                                           10350000
R84MMENT DS    F        TOTAL NUMBER OF MINIMAL/MARGINAL TRACK          10360000
*                       CONDITION ENTRIES                               10370000
R84MMOFF DS    F        OFFSET OF THE 1ST MINIMAL/MARGINAL TRACK CONDI- 10380000
*                       TION ENTRY                                      10390000
R84AWBUF DS    F        AWAITS OF BUFFERS DURING MONITORING             10400000
R84AWEVR DS    F        AWAITS OF BUFFERS EVER                          10410000
R84SDSZ1 EQU   *-R84SDMLN SIZE OF GENERAL SDM DATA SECTION              10420000
*******************************************************************     10430000
*                                                                 *     10440000
*          SUBTYPE 3  --  SPOOL DATASET DESCRIPTION SECTION       *     10450000
*                                                                 *     10460000
*******************************************************************     10470000
R84SDMDS DSECT                                                          10480000
R84DSDSN DS    H        DATASET NUMBER                                  10490000
R84DSDDN DS    CL8      DDNAME                                          10500000
R84DSPRT DS    CL8      PARTITION NAME                                  10510000
R84DSFLG DS    X        EXTENT STATUS FLAG                              10520000
R84DSUNV EQU   X'80'    EXTENT UNAVAILABLE                              10530000
R84DSDRN EQU   X'40'    EXTENT MOVED TO DRAINING PARTITION              10540000
R84DSHLD EQU   X'20'    EXTENT HELD                                     10550000
R84DSUSE EQU   X'10'    EXTENT IN USE                                   10560000
R84DSDVA DS    CL3      DEVICE ADDRESS                                  10570000
R84DSVLS DS    CL6      VOLSER                                          10580000
R84DSDVT DS    CL7      DEVICE TYPE                                     10590000
         DS    X        UNUSED                                          10600000
R84DSLWA DS    0XL4     Low address                            @Z11LSSI 10605000
R84DSLWC DS    H        Low cylinder, lower portion            @Z11LSSI 10610000
R84DSLWH DS    H        Low head and low cyl, upper portion    @Z11LSSI 10620000
R84DSHIA DS    0XL4     High address                           @Z11LSSI 10625000
R84DSHIC DS    H        High cylinder, lower portion           @Z11LSSI 10630000
R84DSHIH DS    H        High head and high cyl, upper portion  @Z11LSSI 10640000
R84DSRT  DS    H        RECORDS PER TRACKS                              10650000
R84DSRTG DS    H        RECORDS PER TRACK GROUP                         10660000
R84DSBUF DS    F        BUFFER SIZE IN BYTES                            10670000
R84DSDV4 DS    CL4      4-Digit Device Address                     @PFA 10672000
*                                                              @OY34777 10675000
R84DSSZ1 EQU   *-R84DSDSN SIZE OF SPOOL DATASET DESCRIPTION ENTRY       10680000
*******************************************************************     10690000
*                                                                 *     10700000
*          SUBTYPE 3  --  SPOOL PARTITION DESCRIPTION SECTION     *     10710000
*                                                                 *     10720000
*******************************************************************     10730000
**********************************************************************  10740000
*   THE FOLLOWING IS A MAPPING FOR SPOOL PARTITION DESCRIPTION ENTRY *  10750000
**********************************************************************  10760000
R84SDMPR DSECT                                                          10770000
R84PRPRT DS    CL8      PARTITION NAME                                  10780000
R84PRMIN DS    X        MINIMAL SPOOL THRESHOLD %                       10790000
R84PRMRG DS    X        MARGINAL SPOOL THRESHOLD %                      10800000
R84PROVP DS    CL8      OVERFLOW PARTITION NAME                         10810000
R84PRFLG DS    X        SPART ENTRY FLAG FIELD                          10820000
R84PRDEF EQU   X'80'    DEFAULT PARTITION INDICATOR                     10830000
         DS    XL1      RESERVED FOR DEVELOPMENT              #0403@MEA 10840000
*                                                              @OY34777 10845000
R84PRSZ1 EQU   *-R84PRPRT SIZE OF SPOOL PARTITION DESCRIPTION ENTRY     10850000
*******************************************************************     10860000
*                                                                 *     10870000
*         SUBTYPE 3  --  SPOOL SPACE UTILIZATION SNAPSHOT SECTION *     10880000
*                                                                 *     10890000
*******************************************************************     10900000
**********************************************************************  10910000
*   THE FOLLOWING IS A MAPPING FOR SPOOL SPACE UTILIZATION SNAPSHOT  *  10920000
*   ENTRY.                                                           *  10930000
**********************************************************************  10940000
R84SDMSU DSECT                                                          10950000
R84SUPRT DS    CL8      PARTITION NAME                                  10960000
R84SUDDN DS    CL8      DDNAME                                          10970000
R84SUDEF DS    F        TRACK GROUPS DEFINED                            10980000
R84SUALO DS    F        TRACK GROUPS ALLOCATED;                         10990000
*                       % OF TRACK GROUPS ALLOCATED = TRACK GROUPS      11000000
*                       ALLOCATED / TRACK GROUPS DEFINED * 100          11010000
*                                                              @OY34777 11015000
R84SUSZ1 EQU   *-R84SUPRT SIZE OF SPOOL SPACE UTILIZATION SNAPSHOT      11020000
*******************************************************************     11030000
*                                                                 *     11040000
*  SUBTYPE 3  --  SINGLE TRACK TABLE SPACE UTILIZATION SECTION#0402@MEC 11050000
*                                                                 *     11060000
*******************************************************************     11070000
**********************************************************************  11080000
* THE FOLLOWING IS A MAPPING FOR SINGLE TRACK TABLE SPACE UTILIZATION*  11090000
* ENTRY.                                                             *  11100000
**********************************************************************  11110000
R84SDMST DSECT                                                          11120000
R84STDSN DS    H        DATASET NUMBER                                  11130000
         DS    XL2      RESERVED FOR DEVELOPMENT              #0403@MEA 11140000
R84STDDN DS    CL8      DDNAME                                          11150000
R84STLWA DS    0XL4     Low address                            @Z11LSSI 11155000
R84STLWC DS    H        Low cylinder, lower portion            @Z11LSSI 11160000
R84STLWH DS    H        Low head and low cyl, upper portion    @Z11LSSI 11170000
R84STHIA DS    0XL4     High address                           @Z11LSSI 11175000
R84STHIC DS    H        High cylinder, lower portion           @Z11LSSI 11180000
R84STHIH DS    H        High head and high cyl, upper portion  @Z11LSSI 11190000
R84STDEF DS    F        RECORDS DEFINED                                 11200000
R84STALO DS    F        RECORDS ALLOCATED;                              11210000
*                       % OF RECORDS ALLOCATED = RECORDS ALLOCATED /    11220000
*                       RECORDS DEFINED * 100                           11230000
R84STFLG DS    X        SINGLE TRACK TABLE FLAG                         11240000
R84STEXP EQU   X'80'    EXPANSION INDICATOR FOR ANY OR ALL SUBSEQUENT   11250000
*                       STT ENTRIES THAT MATCHES DATASET NUMBER         11260000
         DS    XL3      RESERVED FOR DEVELOPMENT              #0615@MEC 11270000
*                                                              @OY34777 11275000
R84STSZ1 EQU   *-R84STDSN SIZE OF SINGLE TRACK SPACE UTILIZATION        11280000
*******************************************************************     11290000
*                                                                 *     11300000
*          SUBTYPE 3  --  SPOOL I/O ACTIVITY SECTION              *     11310000
*                                                                 *     11320000
* NOTE: TO CALCULATE BUFFERS READ AND WRITTEN PER SECOND, USE #0508@MEA 11330000
*       THE FOLLOWING FORMULA:                                #0508@MEA 11340000
*             NUMBER OF BUFFERS READ/WRITTEN PER SECOND = I/O #0508@MEA 11350000
*             COUNT / JMF REPORT INTERVAL LENGTH IN SECONDS   #0508@MEA 11360000
*******************************************************************     11370000
**********************************************************************  11380000
*   THE FOLLOWING IS A MAPPING FOR SPOOL I/O ACTIVITY ENTRY          *  11390000
**********************************************************************  11400000
R84SDMIO DSECT                                                          11410000
R84IOVLS DS    CL6      VOLSER                                          11420000
R84IODDN DS    CL8      DDNAME                                          11430000
         DS    XL2      UNUSED                                          11440000
R84IOTOT DS    F        TOTAL I/O COUNTS                                11450000
R84IOLOC DS    F        I/O COUNTS FOR LOW NUMBER CYLINDERS             11460000
R84IO2CY DS    F        I/O COUNTS FOR 2 CYLINDERS                      11470000
R84IO3CY DS    F        I/O COUNTS FOR 3 CYLINDERS                      11480000
R84IO4CY DS    F        I/O COUNTS FOR 4 CYLINDERS                      11490000
R84IO5CY DS    F        I/O COUNTS FOR 5 CYLINDERS                      11500000
R84IO6CY DS    F        I/O COUNTS FOR 6 CYLINDERS                      11510000
R84IO7CY DS    F        I/O COUNTS FOR 7 CYLINDERS                      11520000
R84IO8CY DS    F        I/O COUNTS FOR 8 CYLINDERS                      11530000
R84IO9CY DS    F        I/O COUNTS FOR 9 CYLINDERS                      11540000
R84IOHIC DS    F        I/O COUNTS FOR HIGH NUMBER CYLINDERS            11550000
*                                                              @OY34777 11555000
R84IOSZ1 EQU   *-R84IOVLS SIZE OF SPOOL I/O ACTIVITY ENTRY              11560000
*******************************************************************     11570000
*                                                                 *     11580000
*          SUBTYPE 3  --  BUFFERS CHAINING BY SPOOL DATASET       *     11590000
*                                                                 *     11600000
*******************************************************************     11610000
**********************************************************************  11620000
*   THE FOLLOWING IS A MAPPING FOR BUFFERS CHAINING BY SPOOL DATASET *  11630000
*   ENTRY.                                                           *  11640000
**********************************************************************  11650000
R84SDMBC DSECT                                                          11660000
R84BCDSN DS    H        DATASET NUMBER                                  11670000
         DS    XL2      RESERVED FOR DEVELOPMENT              #0403@MEA 11680000
R84BCTOT DS    F        TOTAL I/O BUFFER COUNT                #0403@MEC 11690000
*                                                             #0403@MED 11700000
R84BC1B  DS    F        COUNT FOR 1 CHAINED BUFFER;                     11710000
*                       % OF 1 CHAINED BUFFER = 1 CHAINED BUFFER COUNT  11720000
*                       / TOTAL I/O BUFFER COUNT * 100        #0403@MEC 11730000
R84BC2B  DS    F        COUNT FOR 2 CHAINED BUFFERS;                    11740000
*                       % OF 2 CHAINED BUFFER = 2 CHAINED BUFFER COUNT  11750000
*                       / TOTAL I/O BUFFER COUNT * 100        #0615@MEC 11760000
R84BC3B  DS    F        COUNT FOR 3 CHAINED BUFFERS;                    11770000
*                       % OF 3 CHAINED BUFFER = 3 CHAINED BUFFER COUNT  11780000
*                       / TOTAL I/O BUFFER COUNT * 100        #0403@MEC 11790000
R84BC4B  DS    F        COUNT FOR 4 CHAINED BUFFERS;                    11800000
*                       % OF 4 CHAINED BUFFER = 4 CHAINED BUFFER COUNT  11810000
*                       / TOTAL I/O BUFFER COUNT * 100        #0403@MEC 11820000
R84BC5B  DS    F        COUNT FOR 5 CHAINED BUFFERS;                    11830000
*                       % OF 5 CHAINED BUFFER = 5 CHAINED BUFFER COUNT  11840000
*                       / TOTAL I/O BUFFER COUNT * 100        #0403@MEC 11850000
R84BC6B  DS    F        COUNT FOR 6 CHAINED BUFFERS;                    11860000
*                       % OF 6 CHAINED BUFFER = 6 CHAINED BUFFER COUNT  11870000
*                       / TOTAL I/O BUFFER COUNT * 100        #0403@MEC 11880000
R84BC7B  DS    F        COUNT FOR 7 CHAINED BUFFERS;                    11890000
*                       % OF 7 CHAINED BUFFER = 7 CHAINED BUFFER COUNT  11900000
*                       / TOTAL I/O BUFFER COUNT * 100        #0403@MEC 11910000
R84BC8B  DS    F        COUNT FOR 8 CHAINED BUFFERS;                    11920000
*                       % OF 8 CHAINED BUFFER = 8 CHAINED BUFFER COUNT  11930000
*                       / TOTAL I/O BUFFER COUNT * 100        #0403@MEC 11940000
R84BC9B  DS    F        COUNT FOR 9 CHAINED BUFFERS;                    11950000
*                       % OF 9 CHAINED BUFFER = 9 CHAINED BUFFER COUNT  11960000
*                       / TOTAL I/O BUFFER COUNT * 100        #0403@MEC 11970000
R84BC10B DS    F        COUNT FOR 10 CHAINED BUFFERS;                   11980000
*                       % OF 10 CHAINED BUFFER = 10 CHAINED   #0403@MEC 11990000
*                       BUFFER COUNT / TOTAL I/O BUFFER COUNT #0403@MEC 12000000
*                       * 100                                           12010000
R84BC11B DS    F        COUNT FOR 11 OR MORE CHAINED BUFFERS;           12020000
*                       % OF 11 OR MORE CHAINED BUFFERS = 11 OR MORE    12030000
*                       BUFFER COUNT / TOTAL I/O BUFFER COUNT #0403@MEC 12040000
*                       * 100                                           12050000
*                                                              @OY34777 12055000
R84BCSZ1 EQU   *-R84BCDSN SIZE OF BUFFERS BY SPOOL DATASET ENTRY        12060000
*******************************************************************     12070000
*                                                                 *     12080000
*          SUBTYPE 3  --  MINIMAL/MARGINAL TRACK CONDITION        *     12090000
*                                                                 *     12100000
*******************************************************************     12110000
**********************************************************************  12120000
*   THE FOLLOWING IS A MAPPING FOR MINIMAL/MARGINAL TRACK CONDITION  *  12130000
*   ENTRY                                                            *  12140000
**********************************************************************  12150000
R84SDMMM DSECT                                                          12160000
R84MMPRT DS    CL8      PARTITION NAME                                  12170000
R84MMMIN DS    F        COUNT OF SAMPLES PARTITION IN MINIMAL TRACK     12180000
*                       CONDITION;                                      12190000
*                       % MINIMAL = COUNT OF SAMPLES IN MINIMAL TRACK   12200000
*                       CONDITION / CPU BUSY SAMPLE COUNT * 100         12210000
R84MMMRG DS    F        COUNT OF SAMPLES PARTITION IN MARGINAL TRACK    12220000
*                       CONDITION;                                      12230000
*                       % MARGINAL = COUNT OF SAMPLES IN MARGINAL       12240000
*                       TRACK CONDITION / CPU BUSY SAMPLE COUNT * 100   12250000
*                                                              @OY34777 12255000
R84MMSZ1 EQU   *-R84MMPRT SIZE OF MIN/MARG. TRACK CONDITION ENTRY       12260000
         AIF   ('&SUBTYPE' EQ 'ALL').SUBTYP4                            12270000
         AIF   ('&SUBTYPE' EQ 'ALLJ3').SUBTYP4                 @Z23LSMF 12273000
         AIF   ('&SUBTYPE' EQ 'ALLJES').SUBTYP4                @Z23LSMF 12276000
         AIF   ('&SUBTYPE' EQ '').SUBTYP4                               12278000
         MEXIT                                                          12280000
.SUBTYP4 ANOP                                                           12290000
***************************************************************    @MPC 12300000
*                                                             *    @MPC 12310000
*   RELOCATE BLOCK FOR SUBTYPE 4 - RESQUEUE CELL POOL         *    @MPC 12320000
*   STATISTICS, JCT ACCESS METHOD STATISTICS AND CONTROL      *    @MPC 12330000
*   BLOCK UTILIZATION.                                        *    @MPA 12340000
*                                                             *    @MPC 12350000
*    THERE ARE 3 DATA SECTIONS:                               *    @MPC 12360000
*                                                             *    @MPA 12370000
*    1) RESQUEUE CELL POOL STATISTICS                         *    @MPC 12380000
*    2) JCT ACCESS METHOD STATISTICS                          *    @MPC 12390000
*    3) CONTROL BLOCK UTILIZATION.                            *    @MPA 12400000
*                                                             *    @MPA 12410000
***************************************************************    @MPC 12420000
         SPACE 2                                                        12430000
**************************************************************#0402@MEC 12440000
*                                                            *#0402@MEC 12450000
*    SUBTYPE 4  --  RESQUEUE CELL POOL STATISTICS SECTION    *#0402@MEC 12460000
*                                                            *#0402@MEC 12470000
**************************************************************#0402@MEC 12480000
SMF84RSQ DSECT                                                          12490000
R84JCOFF DS    F        OFFSET TO JCT ACCESS METHOD SECTION        @MPC 12500000
R84CBOFF DS    F        OFFSET TO JES3 CONTROL BLOCK UTILIZATION   @MPA 12510000
R84CIEXT DS    H        TOTAL NUMBER OF CI SECONDARY EXTENTS IN POOL    12520000
         DS    XL2      RESERVED FOR DEVELOPMENT              #0403@MEA 12530000
R84CICEL DS    F        TOTAL NUMBER OF CI RESQUEUES IN POOL            12540000
R84CIUSE DS    F        TOTAL NUMBER OF CI RESQUEUES USED IN POOL       12550000
R84CIRQP DS    F        NUMBER OF CI RESQUEUES IN PRIMARY EXTENT        12560000
R84NCISX DS    F        NUMBER OF CI RSQ 2NDARY EXTENT ENTRIES          12570000
R84CISXO DS    F        OFFSET TO 1ST CI RSQ 2NDARY EXTENT ENTRY        12580000
R84MNEXT DS    H        TOTAL NUMBER OF MAIN SECONDARY EXTENTS IN POOL  12590000
         DS    XL2      RESERVED FOR DEVELOPMENT              #0403@MEA 12600000
R84MNCEL DS    F        TOTAL NUMBER OF MAIN RESQUEUES IN POOL          12610000
R84MNUSE DS    F        TOTAL NUMBER OF MAIN RESQUEUE USED IN POOL      12620000
R84MNRQP DS    F        TOTAL NUMBER OF MAIN RESQUEUES IN PRIMARY       12630000
*                       EXTENT                                          12640000
R84NMNSX DS    F        NUMBER OF MAIN RSQ 2NDARY EXTENT ENTRIES        12650000
R84MNSXO DS    F        OFFSET TO 1ST MAIN RSQ 2NDARY EXTENT ENTRY      12660000
R84OSEXT DS    H        TOTAL NUMBER OF OUTSERV SECONDARY EXTENTS IN    12670000
*                       POOL                                            12680000
         DS    XL2      RESERVED FOR DEVELOPMENT              #0403@MEA 12690000
R84OSCEL DS    F        TOTAL NUMBER OF OUTSERV RESQUEUES IN POOL       12700000
R84OSUSE DS    F        TOTAL NUMBER OF OUTSERV RESQUEUES USED IN POOL  12710000
R84OSRQP DS    F        NUMBER OF OUTSERV RESQUEUES IN PRIMARY EXTENT   12720000
R84NOSSX DS    F        NUMBER OF OS RSQ 2NDARY EXTENT ENTRIES          12730000
R84OSSXO DS    F        OFFSET TO 1ST OS RSQ 2NDARY EXTENT ENTRY        12740000
R84CMEXT DS    H        TOTAL NUMBER OF COMMON SECONDARY EXTENTS IN     12750000
*                       POOL                                            12760000
         DS    XL2      RESERVED FOR DEVELOPMENT              #0403@MEA 12770000
R84CMCEL DS    F        TOTAL NUMBER OF COMMON RESQUEUES IN POOL        12780000
R84CMUSE DS    F        TOTAL NUMBER OF COMMON RESQUEUES USED IN POOL   12790000
R84CMRQP DS    F        TOTAL NUMBER OF COMMON RESQUEUES IN PRIMARY     12800000
*                       EXTENT                                          12810000
R84NCMSX DS    F        NUMBER OF COMMON RSQ 2NDARY EXTENT ENTRIES      12820000
R84CMSXO DS    F        OFFSET TO 1ST COMMON RSQ 2NDARY EXTENT ENTRY    12830000
R84RQSZ1 EQU   *-R84JCOFF SIZE OF RESQ CELL POOL STAT. SECTION     @MPC 12840000
************************************************************** @OY20511 12842000
*   EACH RESQUEUE SECONDARY EXTENT WILL BE MAPPED BY THIS      @OY20511 12844000
*   FIELD                                                      @OY20511 12846000
************************************************************** @OY20511 12848000
R84RQEXT DSECT                                                          12850000
R84RQSXT DS    F        NUMBER OF CI, MAIN, OUTSERV, OR COMMON @OY20511 12860000
*                       RESQUEUES FOR SECONDARY EXTENT         @OY20511 12870000
*                                                              @OY20511 12880000
R84RQXSZ EQU   *-R84RQEXT SIZE OF RESQ 2NDARY EXTENT ENTRY     @OY20511 12890000
         EJECT ,                                                   @MPA 12900000
***************************************************************    @MPA 12910000
*                                                             *    @MPA 12920000
*    SUBTYPE 4  --  JCT ACCESS METHOD STATISTICS SECTION      *    @MPA 12930000
*                                                             *    @MPA 12940000
***************************************************************    @MPA 12950000
SMF84JCT DSECT ,                                                   @MPA 12960000
*                                                                  @MPA 12970000
***************************************************************    @MPA 12980000
*        JCT DATA SET INFORMATION                             *    @MPA 12990000
***************************************************************    @MPA 13000000
R84SZJCT DS    F        SIZE OF A JCT (IN BYTES)                   @MPA 13010000
R84REDIO DS    F        NUMBER OF JCT READ I/O'S                   @MPA 13020000
R84WRTIO DS    F        NUMBER OF JCT WRITE I/O'S                  @MPA 13030000
R84JBADD DS    F        NUMBER OF JOBS ADDED TO JOB QUEUE          @MPA 13040000
R84JBDEL DS    F        NUMBER OF JOBS DELETED FROM JOB QUEUE      @MPA 13050000
*                                                                  @MPA 13060000
***************************************************************    @MPA 13070000
*        JCT DATA SPACE INFORMATION                           *    @MPA 13080000
***************************************************************    @MPA 13090000
R84DSPFL DS    X        JCT DATA SPACE FLAG ONE                    @MPA 13100000
R84DSDIS EQU   X'80'    THE JCT DATA SPACE WAS DISABLED DURING     @MPA 13110000
*                       SOME PORTION OF THE INTERVAL.  THE         @MPA 13120000
*                       REMAINDER OF THE JCT DATA SPACE            @MPA 13130000
*                       INFORMATION IS ZERO                        @MPA 13140000
*                                                                  @MPA 13150000
R84JRSVD DS    XL3      RESERVED FOR DEVELOPMENT                   @MPA 13160000
*                                                                  @MPA 13170000
R84DSPSZ DS    F        MAXIMUM JCT DATA SPACE SIZE (IN            @MPA 13180000
*                       HUNDRETHS OF A MEGABYTE)                   @MPA 13190000
*                                                                  @MPA 13200000
*-------------------------------------------------------------*    @MPA 13210000
*        JCT DATA SPACE PAGE FAULT INFORMATION                *    @MPA 13220000
*-------------------------------------------------------------*    @MPA 13230000
R84RDINS DC    F'0'     NUMBER OF JCT READ REQUESTS WHERE THE      @MPA 13240000
*                       CORRESPONDING JCT DATA SPACE PAGE(S)       @MPA 13250000
*                       WERE IN REAL STORAGE                       @MPA 13260000
*                                                                  @MPA 13270000
R84PRINS DC    F'0'     PERCENT OF JCT READ REQUESTS WHERE THE     @MPA 13280000
*                       CORRESPONDING JCT DATA SPACE PAGE(S)       @MPA 13290000
*                       WERE IN REAL STORAGE (IN HUNDRETHS OF      @MPA 13300000
*                       A PERCENT)                                 @MPA 13310000
*                                                                  @MPA 13320000
R84RDNIS DC    F'0'     NUMBER OF JCT READ REQUESTS WHERE THE      @MPA 13330000
*                       CORRESPONDING JCT DATA SPACE PAGE(S)       @MPA 13340000
*                       WERE ---NOT--- IN REAL STORAGE             @MPA 13350000
*                                                                  @MPA 13360000
R84PRNIS DC    F'0'     PERCENT OF JCT READ REQUESTS WHERE THE     @MPA 13370000
*                       CORRESPONDING JCT DATA SPACE PAGE(S)       @MPA 13380000
*                       WERE ---NOT--- IN REAL STORAGE (IN         @MPA 13390000
*                       HUNDRETHS OF A PERCENT)                    @MPA 13400000
*                                                                  @MPA 13410000
R84WTINS DC    F'0'     NUMBER OF JCT WRITE REQUESTS WHERE THE     @MPA 13420000
*                       CORRESPONDING JCT DATA SPACE PAGE(S)       @MPA 13430000
*                       WERE IN REAL STORAGE                       @MPA 13440000
*                                                                  @MPA 13450000
R84PWINS DC    F'0'     PERCENT OF JCT WRITE REQUESTS WHERE THE    @MPA 13460000
*                       CORRESPONDING JCT DATA SPACE PAGE(S)       @MPA 13470000
*                       WERE IN REAL STORAGE (IN HUNDRETHS OF      @MPA 13480000
*                       A PERCENT)                                 @MPA 13490000
*                                                                  @MPA 13500000
R84WTNIS DC    F'0'     NUMBER OF JCT WRITE REQUESTS WHERE THE     @MPA 13510000
*                       CORRESPONDING JCT DATA SPACE PAGE(S)       @MPA 13520000
*                       WERE ---NOT--- IN REAL STORAGE             @MPA 13530000
*                                                                  @MPA 13540000
R84PWNIS DC    F'0'     PERCENT OF JCT WRITE REQUESTS WHERE THE    @MPA 13550000
*                       CORRESPONDING JCT DATA SPACE PAGE(S)       @MPA 13560000
*                       WERE ---NOT--- IN REAL STORAGE (IN         @MPA 13570000
*                       HUNDRETHS OF A PERCENT)                    @MPA 13580000
*                                                                  @MPA 13590000
*-------------------------------------------------------------*    @MPA 13600000
*        JCT DATA SPACE PAGE USAGE INFORMATION                *    @MPA 13610000
*-------------------------------------------------------------*    @MPA 13620000
R84DUSMN DC    F'0'     MINIMUM NUMBER OF JCT DATA SPACE PAGES     @MPA 13630000
*                       IN USE                                     @MPA 13640000
R84DUSAV DC    F'0'     AVERAGE NUMBER OF JCT DATA SPACE PAGES     @MPA 13650000
*                       IN USE                                     @MPA 13660000
R84DUSMX DC    F'0'     MAXIMUM NUMBER OF JCT DATA SPACE PAGES     @MPA 13670000
*                       IN USE                                     @MPA 13680000
*                                                                  @MPA 13690000
*-------------------------------------------------------------*    @MPA 13700000
*        JCT DATA SPACE PAGE UTILIZATION.  THESE VALUES SHOW  *    @MPA 13710000
*        THE PERCENTAGE OF THE TOTAL JCT DATA SPACE PAGES     *    @MPA 13720000
*        THAT CONTAIN ALLOCATED JCTS.                         *    @MPA 13730000
*-------------------------------------------------------------*    @MPA 13740000
R84DUTMN DC    F'0'     MINIMUM JCT DATA SPACE PAGE UTILIZATION    @MPA 13750000
*                       (IN HUNDRETHS OF A PERCENT)                @MPA 13760000
R84DUTAV DC    F'0'     AVERAGE JCT DATA SPACE PAGE UTILIZATION    @MPA 13770000
*                       (IN HUNDRETHS OF A PERCENT)                @MPA 13780000
R84DUTMX DC    F'0'     MAXIMUM JCT DATA SPACE PAGE UTILIZATION    @MPA 13790000
*                       (IN HUNDRETHS OF A PERCENT)                @MPA 13800000
*                                                                  @MPA 13810000
*-------------------------------------------------------------*    @MPA 13820000
*        JCT DATA SPACE PAGE RELEASE INFORMATION              *    @MPA 13830000
*-------------------------------------------------------------*    @MPA 13840000
R84PGSRL DC    F'0'     NUMBER OF JCT DATA SPACE PAGES RELEASED    @MPA 13850000
*                                                                  @MPA 13860000
*                                                                  @MPA 13870000
***************************************************************    @MPA 13880000
*        JQE INFORMATION                                      *    @MPA 13890000
***************************************************************    @MPA 13900000
*                                                                  @MPA 13910000
*-------------------------------------------------------------*    @MPA 13920000
*        JQE STORAGE REQUIREMENTS                             *    @MPA 13930000
*-------------------------------------------------------------*    @MPA 13940000
R84JQ0SZ DC    F'0'     JQE0 TABLE SIZE (IN HUNDRETHS OF A         @MPA 13950000
*                       KILOBYTE)                                  @MPA 13960000
R84JQ1SZ DC    F'0'     JQE1 TABLE SIZE (IN HUNDRETHS OF A         @MPA 13970000
*                       KILOBYTE)                                  @MPA 13980000
R84JQ2SZ DC    F'0'     JQE2 TABLE SIZE (IN HUNDRETHS OF A         @MPA 13990000
*                       KILOBYTE)                                  @MPA 14000000
R84JQ3SZ DC    F'0'     JQE3 TABLE SIZE (IN HUNDRETHS OF A         @MPA 14010000
*                       KILOBYTE)                                  @MPA 14020000
R84JQ4SZ DC    F'0'     JQE4 TABLE SIZE (IN HUNDRETHS OF A         @MPA 14030000
*                       KILOBYTE)                                  @MPA 14040000
*                                                                  @MPA 14050000
*-------------------------------------------------------------*    @MPA 14060000
*        JQE4 STORAGE USAGE INFORMATION                       *    @MPA 14070000
*-------------------------------------------------------------*    @MPA 14080000
R84JUSMN DC    F'0'     MINIMUM NUMBER OF JQE4'S IN USE            @MPA 14090000
R84JUSAV DC    F'0'     AVERAGE NUMBER OF JQE4'S IN USE            @MPA 14100000
R84JUSMX DC    F'0'     MAXIMUM NUMBER OF JQE4'S IN USE            @MPA 14110000
*                                                                  @MPA 14120000
*-------------------------------------------------------------*    @MPA 14130000
*        JQE4 STORAGE UTILIZATION.  THESE VALUES SHOW THE     *    @MPA 14140000
*        PERCENTAGE OF THE TOTAL JQE4 PAGES THAT CONTAIN      *    @MPA 14150000
*        ALLOCATED JQE4'S.                                    *    @MPA 14160000
*-------------------------------------------------------------*    @MPA 14170000
R84JUTMN DC    F'0'     MINIMUM JQE4 STORAGE UTILIZATION           @MPA 14180000
*                       (IN HUNDRETHS OF A PERCENT)                @MPA 14190000
R84JUTAV DC    F'0'     AVERAGE JQE4 STORAGE UTILIZATION           @MPA 14200000
*                       (IN HUNDRETHS OF A PERCENT)                @MPA 14210000
R84JUTMX DC    F'0'     MAXIMUM JQE4 STORAGE UTILIZATION           @MPA 14220000
*                       (IN HUNDRETHS OF A PERCENT)                @MPA 14230000
*                                                                  @MPA 14240000
*                                                                  @MPA 14250000
R84JCTSZ EQU   *-SMF84JCT  SIZE OF JCT ACCESS METHOD STATISTICS    @MPA 14260000
*                        SECTION                                   @MPA 14270000
         EJECT ,                                                   @MPA 14280000
*******************************************************************@MPM 14290000
*                                                                 *     14300000
*          SUBTYPE 4  --  JES3 CONTROL BLOCK UTILIZATION SECTION  *     14310000
*                                                                 *     14320000
*******************************************************************     14330000
R84J3CB  DSECT                                                          14340000
*********************************************************************   14350000
*                 FCT ENTRY USAGE                                   *   14360000
*********************************************************************   14370000
R84FCTPR DS    F        TOTAL NUMBER OF PREALLOCATED FCTS               14380000
R84FCTPM DS    F        TOTAL NUMBER OF PERMANENT FCTS                  14390000
R84FCTMN DS    F        MINIMUM NUMBER OF FCT ENTRIES USED              14400000
R84FCTMX DS    F        MAXIMUM NUMBER OF FCT ENTRIES USED              14410000
R84FCTAV DS    F        AVERAGE NUMBER OF FCT ENTRIES USED              14420000
*********************************************************************   14430000
*                        CONSOLE BUFFER USAGE                       *   14440000
*********************************************************************   14450000
R84PCNBF DS    F        TOTAL NUMBER OF PREALLOCATED CONSOLE BUFFERS    14460000
R84PCBPT DS    F        TOTAL NUMBER OF PREALLOCATED CONSOLE BUFFER     14470000
*                       POINTERS                                        14480000
R84PDDBL DS    F        TOTAL NUMBER OF PREALLOCATED DOM DATA BLOCKS    14490000
R84MNCBU DS    F        MINIMUM NUMBER OF CONSOLE BUFFERS USED          14500000
R84MNBPU DS    F        MINIMUM NUMBER OF CONS. BUF. PTRS USED          14510000
R84MNDBU DS    F        MINIMUN NUMBER OF DOM DATA BLOCKS USED          14520000
R84MXCBU DS    F        MAXIMUM NUMBER OF CONSOLE BUFFERS USED          14530000
R84MXBPU DS    F        MAXIMUM NUMBER OF CONS. BUF. PTRS USED          14540000
R84MXDBU DS    F        MAXIMUM NUMBER OF DOM DATA BLOCKS USED          14550000
R84AVCBU DS    F        AVERAGE NUMBER OF CONSOLE BUFFERS USED          14560000
R84AVBPU DS    F        AVERAGE CONSOLSE BUFFER POINTERS USED #0451@MEC 14570000
R84AVDBU DS    F        AVERAGE NUMBER OF DOM DATA BLOCKS USED          14580000
R84SZCPE DS    F        SIZE OF CONSOLE BUFFER PRIMARY EXTENT           14590000
R84SCBSE DS    F        SIZE OF CONSOLE BUFFER SECONDARY EXTENT         14600000
R84CBSEL DS    H        SIZE OF CONS BUFF SECONDARY EXT LIMIT #0410@MEC 14610000
         DS    XL2      RESERVED FOR DEVELOPMENT              #0410@MEA 14620000
R84TNRCB DS    F        TOTAL NUMBER OF RESERVED CONSOLE BUFFERS        14630000
R84CBSEU DS    H        NUMBER OF CONSOLE BUFFER SECONDARY EXTENTS      14640000
*                       IN USE                                          14650000
R84BPSEU DS    H        NUMBER OF BUFFER POINTER SECONDARY EXTENTS      14660000
*                       IN USE                                          14670000
R84DBSEU DS    H        NUMBER OF DOM DATA BLOCK SECONDARY EXTENTS      14680000
*                       IN USE                                          14690000
R84SEMAX DS    H        MAXIMUM NUMBER OF SECONDARY EXTENTS EVER USED   14700000
R84RBMAX DS    F        MAXIMUM NUMBER OF RESERVED BUFFERS EVER USED    14710000
R84SCBEE DS    F        COUNT FOR SECONDARY CONSOLE           #0451@MEC 14720000
*                       BUFFER EXTENTS EXCEEDED;              #0451@MEC 14730000
*                       % OF SECONDARY CONSOLE BUFFER EXTENTS EXCEEDED  14740000
*                       = SECONDARY CONSOLE BUFFER EXTENTS    #0451@MEC 14750000
*                       * 100 / JMF SAMPLE COUNT              #0503@MEC 14760000
R84SCBPE DS    F        COUNT FOR SECONDARY CONSOLE           #0451@MEC 14770000
*                       BUFFER POINTER EXTENTS EXCEEDED;      #0451@MEC 14780000
*                       % OF SECONDARY CONSOLE BUFFER POINTER EXTENTS   14790000
*                       EXCEEDED =  SECONDARY CONSOLE BUFFER POINTER    14800000
*                       EXTENTS * 100 / JMF SAMPLE COUNT      #0503@MEC 14810000
R84SAQPE DS    F        COUNT FOR SECONDARY ACTION            #0451@MEC 14820000
*                       QUEUE POINTER EXTENTS EXCEEDED;       #0451@MEC 14830000
*                       % OF SECONDARY ACTION QUEUE POINTER EXTENTS     14840000
*                       EXCEEDED = SECONDARY ACTION QUEUE POINTER       14850000
*                       EXTENTS * 100 / JMF SAMPLE COUNT      #0503@MEC 14860000
*********************************************************************   14870000
*                           JSAM BUFFER USAGE                       *   14880000
*********************************************************************   14890000
R84TOTJB DS    H        TOTAL DEFINED JSAM BUFFERS                      14900000
         DS    XL2      RESERVED FOR DEVELOPMENT              #0403@MEA 14910000
R84MNJBU DS    F        MINIMUM JSAM BUFFERS USED                       14920000
R84MXJBU DS    F        MAXIMUM JSAM BUFFERS USED                       14930000
R84AVJBU DS    F        AVERAGE JSAM BUFFERS USED                       14940000
*                                                              @OY34777 14945000
**********************************************************************  14950000
*                     USAM (PROTECTED) BUFFER USAGE                  *  14960000
**********************************************************************  14970000
R84TOTUB DS    H        TOTAL DEFINED USAM BUFFERS                      14980000
         DS    XL2      RESERVED FOR DEVELOPMENT              #0403@MEA 14990000
R84MNUBU DS    F        MINIMUM USAM BUFFERS USED                       15000000
R84MXUBU DS    F        MAXIMUM USAM BUFFERS USED                       15010000
R84AVUBU DS    F        AVERAGE USAM BUFFERS USED                       15020000
*********************************************************************   15030000
*                        STAGING AREA USAGE                         *   15040000
*********************************************************************   15050000
R84SSAPE DS    H        SIZE OF STAGING AREA PRIMARY EXTENT             15060000
*                       IN 'K' BYTES                          #0451@MEA 15070000
         DS    XL2      RESERVED FOR DEVELOPMENT              #0403@MEA 15080000
R84TNPSA DS    F        TOTAL NUMBER OF PRIMARY STAGING AREAS           15090000
R84SSASE DS    H        SIZE OF STAGING AREA SECONDARY EXTENT           15100000
         DS    XL2      RESERVED FOR DEVELOPMENT              #0403@MEA 15110000
R84TNSSA DS    F        TOTAL NUMBER OF SECONDARY STAGING AREAS         15120000
R84SASEL DS    H        STAGING AREA SECONDARY EXTENT LIMIT   #0410@MEC 15130000
R84MNSAL DS    H        MINIMAL STAGING AREA LIMIT            #0410@MEC 15140000
*                       % OF TOTAL STAGING AREAS DEFINED =    #0503@MEA 15150000
*                       R84MNSAL * 100 / R84TNSAD             #0503@MEA 15160000
*                                                            3#0503@MED 15170000
R84SASIZ DS    F        STAGING AREA SIZE                               15180000
R84TNSAD DS    F        TOTAL NUMBER OF STAGING AREAS DEFINED           15190000
R84MCSAI DS    F        MAXIMUM CSA STAGING AREAS FOR INTERVAL @OY34777 15200000
R84MASAI DS    F        MAXIMUM AUXILIARY STAGING AREAS DURING @OY34777 15210000
*                       THIS INTERVAL.                         @OY34777 15220000
R84ASACS DS    F        ACTIVE STAGING AREA COUNT FROM SVT (SVTSACNT)   15230000
R84ACSCS DS    F        ACTIVE CSA STAGING AREA COUNT FROM              15240000
*                       SVT (SVTCSACT)                                  15250000
R84AASCS DS    F        ACTIVE AUXILIARY STAGING AREA COUNT FROM        15260000
*                       SVT (SVTXSACT)                                  15270000
R84MCSAU DS    F        MAXIMUM CSA STAGING AREAS EVER USED             15280000
R84MASAU DS    F        MAXIMUM AUXILIARY STAGING AREAS EVER USED       15290000
R84PUSAE DS    F        COUNT FOR USER MEMORY                 #0451@MEC 15300000
*                       STAGING AREA LIMIT EXCEEDED;          #0451@MEC 15310000
*                       % OF USER MEMORY STAGING AREA LIMIT EXCEEDED    15320000
*                       = USER MEMORY STAGING AREA LIMIT      #0503@MEC 15330000
*                       EXCEEDED COUNT / JMF SAMPLE COUNT *   #0503@MEC 15340000
*                       100                                   #0616@MEC 15350000
R84PMSAE DS    F        COUNT FOR MINIMAL STAGING             #0451@MEC 15360000
*                       AREA LIMIT EXCEEDED;                  #0451@MEA 15370000
*                       % OF MINIMAL STAGING AREA LIMIT EXCEEDED =      15380000
*                       MINIMAL STAGING AREA LIMIT EXCEEDED   #0616@MEC 15390000
*                       COUNT / JMF SAMPLE COUNT * 100        #0503@MEA 15400000
*********************************************************************   15410000
*                       TOTAL ACTIVE STAGING AREAS                  *   15420000
*********************************************************************   15430000
*                                                             #0451@MED 15440000
R84MNTSA DS    F        MINIMUM NUMBER OF ACTIVE STAGING AREAS          15450000
R84MXTSA DS    F        MAXIMUM NUMBER OF ACTIVE STAGING AREAS          15460000
R84AVTSA DS    F        AVERAGE NUMBER OF ACTIVE STAGING AREAS          15470000
*********************************************************************   15480000
*                        CSA ACTIVE STAGING AREAS                   *   15490000
*********************************************************************   15500000
R84MNCSA DS    F         MINIMUM OF CSA ACTIVE STAGING AREAS            15510000
R84MXCSA DS    F         MAXIMUM OF CSA ACTIVE STAGING AREAS            15520000
R84AVCSA DS    F         AVERAGE OF CSA ACTIVE STAGING AREAS            15530000
*********************************************************************   15540000
*                      AUXILIARY ACTIVE STAGING AREAS               *   15550000
*********************************************************************   15560000
R84MNASA DS    F         MINIMUM OF AUXILIARY ACTIVE STAGING AREAS      15570000
R84MXASA DS    F         MAXIMUM OF AUXILIARY ACTIVE STAGING AREAS      15580000
R84AVASA DS    F         AVERAGE OF AUXILIARY ACTIVE STAGING AREAS      15590000
************************************************************** @OY34777 15591000
*                      JSAM BUFFER EXTENT AREAS                @OY34777 15592000
************************************************************** @OY34777 15593000
R84JBPSZ DS    F         SIZE OF PRIMARY EXTENT                @OY34777 15594000
R84JBSSZ DS    F         SIZE OF SECONDARY EXTENT              @OY34777 15595000
R84JBLIM DS    F         NUMBER OF SECONDARY EXTENTS ALLOWED   @OY34777 15596000
R84J3SZ1 EQU   *-R84FCTPR SIZE OF CONTROL BLOCK UTILIZATION SECTION     15600000
         AIF   ('&SUBTYPE' EQ 'ALL').SUBTYP5                            15610000
         AIF   ('&SUBTYPE' EQ 'ALLJ3').SUBTYP5                 @Z23LSMF 15612000
         AIF   ('&SUBTYPE' EQ 'ALLJES').SUBTYP5                @Z23LSMF 15615000
         AIF   ('&SUBTYPE' EQ '').SUBTYP5                               15616000
         MEXIT                                                          15620000
.SUBTYP5 ANOP                                                           15630000
*********************************************************************   15640000
*                                                                   *   15650000
*   RELOCATE BLOCK FOR SUBTYPE 5 - JOB SECTION                 #569@MEC 15660000
*                                                                   *   15670000
*    THERE ARE 3 DATA SECTIONS:  1) JES3 WORK-TO-DO QUEUE,     #569@MEC 15680000
*     2) JOB ANALYSIS AND  3) JES3 FUNCTION SUMMARY SECTION    #569@MEC 15690000
*********************************************************************   15700000
         SPACE 2                                                        15710000
*******************************************************************     15720000
*                                                                 *     15730000
*                  SUBTYPE 5   HEADER                          #569@MEC 15740000
*                                                                 *     15750000
*******************************************************************     15760000
SMF84JOB DSECT                                                          15770000
R84JBLNG DS    F          LENGTH OF THE JOB ANALYSIS SECTION   #569@MEC 15780000
R84JBNUM DS    F          TOTAL NUMBER OF JES3 JOB ANALYSIS ENTRIES     15790000
R84WTDO  DS    F          OFFSET OF WORK-TO-DO ANALYSIS SECTION#569@MEC 15800000
R84JBOF  DS    F          OFFSET TO THE JOB ANALYSIS SECTION   #569@MEC 15810000
R84FSUMO DS    F          OFFSET OF JES3 FUNCTION SUMMARY SECTION       15820000
R84PLOTO DS    F          OFFSET OF PLOT SECTION                        15830000
R84S5FLG DS    X'00'      JOB ENTRY HEADER FLAG                #569@MEA 15840000
R84JAS   EQU   X'80'      JOB ANALYSIS SEGMENT INDICATOR       #569@MEA 15850000
R84FSS   EQU   X'40'      FUNCTION SUMMARY SEGMENT INDICATOR   #569@MEA 15860000
R84PLT1  EQU   X'20'      INITIATOR PLOT SECTION INDICATOR     #569@MEA 15870000
R84PLT2  EQU   X'10'      RQINDEX PLOT SECTION SEGMENT         #569@MEA 15880000
R84PLT3  EQU   X'08'      DEVICE CLASS PLOT SECTION SEGMENT    #569@MEA 15890000
R84PLT4  EQU   X'04'      SETNAME PLOT SECTION SEGMENT         #569@MEA 15900000
R84PLT5  EQU   X'02'      JOB CLASS PLOT SECTION SEGMENT       #569@MEA 15910000
         DS    XL3        RESERVED FOR DEVELOPMENT             #569@MEA 15920000
R84JBSZ1 EQU   *-R84JBLNG SIZE OF THE JOB HEADER               #569@MEC 15930000
         SPACE 2                                               #569@MEA 15940000
***************************************************************#569@MEA 15950000
*                                                              #569@MEA 15960000
*          SUBTYPE 5  --  JES3 WORK-TO-DO SECTION              #569@MEA 15970000
*                                                              #569@MEA 15980000
***************************************************************#569@MEA 15990000
SMF84WTD DSECT                                                 #569@MEA 16000000
R84WKLNG DS    F        LEN OF JSS WORK-TO-DO QUEUE SECTION    #569@MEA 16010000
R84RDYMN DS    F        MIN QUEUE LEN FOR THE JSS-READY QUEUE  #569@MEA 16020000
R84RDYMX DS    F        MAX QUEUE LEN FOR THE JSS-READY QUEUE  #569@MEA 16030000
R84RDYAV DS    F        AV QUEUE LEN FOR THE JSS-READY QUEUE   #569@MEA 16040000
R84CATMN DS    F        MIN QUEUE LEN FOR THE CATLG-WAIT QUEUE @OY16159 16050000
R84CATMX DS    F        MAX QUEUE LEN FOR THE CATLG-WAIT QUEUE @OY16159 16060000
R84CATAV DS    F        AV QUEUE LEN FOR THE CATLG-WAIT QUEUE  @OY16159 16070000
R84RSQMN DS    F        MIN QUEUE LEN FOR THE RQ-WAIT QUEUE    #569@MEA 16080000
R84RSQMX DS    F        MAX QUEUE LEN FOR THE RQ-WAIT QUEUE    #569@MEA 16090000
R84RSQAV DS    F        AV QUEUE LEN FOR THE RQ-WAIT QUEUE     #569@MEA 16100000
R84PLBMN DS    F        MIN QUEUE LEN FOR THE PROCLIB-WAIT QUEU#569@MEA 16110000
R84PLBMX DS    F        MAX QUEUE LEN FOR THE PROCLIB-WAIT QUEU#569@MEA 16120000
R84PLBAV DS    F        AV QUEUE LEN FOR THE PROCLIB-WAIT QUEUE#569@MEA 16130000
R84MCGMN DS    F        MIN QUEUE LEN FOR THE MAIN-WAIT QUEUE  #569@MEA 16140000
R84MCGMX DS    F        MAX QUEUE LEN FOR THE MAIN-WAIT QUEUE  #569@MEA 16150000
R84MCGAV DS    F        AV QUEUE LEN FOR THE MAIN-WAIT QUEUE   #569@MEA 16160000
R84DSPMN DS    F        MIN QUEUE LEN FOR THE DSP-WAIT QUEUE   #569@MEA 16170000
R84DSPMX DS    F        MAX QUEUE LEN FOR THE DSP-WAIT QUEUE   #569@MEA 16180000
R84DSPAV DS    F        AV QUEUE LEN FOR THE DSP-WAIT QUEUE    #569@MEA 16190000
R84MPLMN DS    F        MIN QUEUE LEN FOR THE MPLOC-WAIT QUEUE @OY16159 16200000
R84MPLMX DS    F        MAX QUEUE LEN FOR THE MPLOC-WAIT QUEUE @OY16159 16210000
R84MPLAV DS    F        AV QUEUE LEN FOR THE MPLOC-WAIT QUEUE  @OY16159 16220000
R84DUPMN DS    F        MIN QUEUE LEN FOR THE DUP JOBNAME Q    @OW18785 16222000
R84DUPMX DS    F        MAX QUEUE LEN FOR THE DUP JOBNAME Q    @OW18785 16224000
R84DUPAV DS    F        AV QUEUE LEN FOR THE DUP JOBNAME QUEUE @OW18785 16226000
R84CIJMN DS    F        Min queue len for C/I JSAM buffer Q    0082@SFA 16227000
R84CIJMX DS    F        Max queue len for C/I JSAM buffer Q    0082@SFA 16227100
R84CIJAV DS    F        Avg queue len for C/I JSAM buffer Q    0082@SFA 16227200
R84JBSZ4 EQU   *-R84WKLNG  SIZE OF WORK TO DO SECTION          #569@MEA 16230000
         EJECT                                                 #569@MEA 16240000
***************************************************************#569@MEA 16250000
*                                                              #569@MEA 16260000
*          SUBTYPE 5  --  JOB ANALYSIS SECTION                 #569@MEA 16270000
*                                                              #569@MEA 16280000
*                                                              #569@MEA 16290000
*                R84JOB                 R84STAT                #569@MEA 16300000
*               +-------+   R84JBGOF  +-----------+            #569@MEA 16310000
*    R84NXTJB   !///////!---------->  !  GMS/MDS  !            #569@MEA 16320000
*        +------!///////!             +-----------+            #569@MEA 16330000
*        !      !///////!------+      !///////////!            #569@MEA 16340000
*        !      +-------+      !      +-----------+            #569@MEA 16350000
*        !                     +--->  !  JSTAT    !            #569@MEA 16360000
*        !                  R84JSTOF  +-----------+            #569@MEA 16370000
*        !                                                     #569@MEA 16380000
*        !       R84JOB                                        #569@MEA 16390000
*        !      +-------+                                      #569@MEA 16400000
*        +----->!///////!                                      #569@MEA 16410000
*               !///////!                                      #569@MEA 16420000
*               !///////!                                      #569@MEA 16430000
*               +-------+                                      #569@MEA 16440000
*                                                              #569@MEA 16450000
*   EACH JOB ANALYSIS ENTRY CAN BE MAPPED BY THE FOLLOWING FORMAT   *   16460000
*********************************************************************   16470000
R84JOB   DSECT                                                          16480000
R84JBNAM DS    CL8        JOB NAME                                      16490000
R84JBID  DS    CL8        JOB ID                                        16500000
         DS    XL3        UNUSED                                        16510000
R84JBRQP DS    XL1        JOB RESQUEUE PRIORITY                         16520000
R84JBCLS DS    CL8        JOB CLASS                                     16530000
R84JSGRP DS    CL8        GROUP NAME                                    16540000
R84NXTJB DS    F          OFFSET TO NEXT JOB ANALYSIS ENTRY    #569@MEA 16550000
R84JSTAT DS    F          TOTAL NUMBER OF JOBSTAT ENTRIES               16560000
R84JSTOF DS    F          OFFSET OF THE 1ST JOBSTAT ENTRY               16570000
R84JBGMS DS    F          TOTAL NUMBER OF GMS/MDS  ENTRIES              16580000
R84JBGOF DS    F          OFFSET OF THE 1ST GMS/MDS  ENTRY              16590000
*                                                              @OY34777 16595000
R84JBSZ2 EQU   *-R84JBNAM SIZE OF EACH JOB ANALYSIS ENTRY               16600000
*********************************************************************   16610000
*   EACH JOB STAT ENTRY AND GMS/MDS ENTRY CAN BE MAPPED BY    #0488@MEC 16620000
*   THE FOLLOWING FORMAT.                                     #0488@MEA 16630000
*********************************************************************   16640000
R84STAT  DSECT                                                          16650000
R84JBFNM DS    CL33       ACTIVE FUNCTION, DSP, OR PROC NAME            16660000
         DS    CL3        RESERVED FOR DEVELOPMENT                      16670000
R84JBJSR DS    X          JSTAT REASON (USED FOR MDS/GMS ONLY)          16680000
*                         NOTE: REFERENCE FIELD R84JSJSR FOR  #0615@MEA 16690000
*                         A LIST OF POSSIBLE JSTAT REASONS    #0615@MEA 16700000
         DS    XL3        RESERVED FOR DEVELOPMENT            #0488@MEA 16710000
R84JBFTM DS    F          ACTIVE FUNCTION TIME IN SECONDS     #0488@MEC 16720000
*                                                              @OY34777 16725000
R84JBSZ3 EQU   *-R84JBFNM SIZE OF EACH JOB STAT ENTRY                   16730000
*                                                            25#569@MED 16740000
         SPACE 2                                                        16750000
*******************************************************************     16760000
*                                                                 *     16770000
*          SUBTYPE 5  --  JES3 FUNCTION SUMMARY SECTION           *     16780000
*                                                                 *     16790000
*******************************************************************     16800000
SMF84FSM DSECT                                                          16810000
R84JSLNG DS    F        LENGTH OF THE FUNCTION  SUMMARY SECTION#569@MEC 16820000
R84JSNUM DS    F        TOTAL NUMBER OF JES3 FUNCTION SUMMARY ENTRIES   16830000
R84JSOF  DS    F        OFFSET OF THE 1ST JES3 FUNCTION SUMMARY ENTRY   16840000
R84GSNUM DS    F        TOTAL NUMBER OF GMS/MDS SUMMARY ENTRIES#569@MEM 16850000
R84GSOF  DS    F        OFFSET OF THE 1ST GMS/MDS SUMMARY ENTRY#569@MEM 16860000
**********************************************************************  16870000
*   MDS AND GMS SCHEDULING ANALYSIS SUMMARY INFORMATION              *  16880000
**********************************************************************  16890000
R84ALRET DS    F        ALLOCATION ATTEMPT  RETRIES DURING    #0718@MEC 16900000
*                       JMF INTERVAL. (= R84ATMPT+R84ARLSK)   #0718@MEC 16910000
R84ARLSK DS    F        ALLOCATION ATTEMPTS REJECTED WITHOUT  #0718@MEC 16920000
*                       READING JST DURING JMF INTERVAL       #0718@MEC 16930000
R84ATMPT DS    F        ALLOCATION ATTEMPTS ALLOWED TO READ   #0718@MEC 16940000
*                       JST DURING JMF INTERVAL               #0718@MEA 16950000
R84ARLF  DS    F        ALLOCATION ATTEMPTS REJECTED AFTER    #0718@MEC 16960000
*                       READING JST DURING JMF INTERVAL       #0718@MEC 16970000
R84SUCCS DS    F        SUCCESSFUL ALLOCATIONS DURING JMF     #0718@MEC 16980000
*                       INTERVAL                              #0718@MEA 16990000
*                                                              @OY34777 16995000
R84JBSZ5 EQU   *-R84JSLNG SIZE OF JES3 FUNCTION SUMRY SEC HDR  #569@MEC 17000000
**********************************************************************  17010000
*   EACH JES3 FUNCTION SUMMARY AND GMS/MDS SUMMARY ENTRY CAN  #0488@MEC 17020000
*   BE MAPPED BY THE FOLLOWING ENTRY.                         #0488@MEC 17030000
**********************************************************************  17040000
R84JFSUM DSECT                                                          17050000
R84JSNAM DS    CL33     JES3 FUNCTION NAME OR DSP NAME                  17060000
         DS    XL3      RESERVED FOR DEVELOPMENT                        17070000
R84JSJSR DS    X        RQJSTAT SCHEDULING BYPASS CODE        #0488@MEC 17080000
*                       X'01' - INSUFFICIENT STORAGE          #0488@MEA 17090000
*                       X'02' - TLIMIT EXCEEDED               #0488@MEA 17100000
*                       X'03' - I/O RATE INAPPROPRIATE        #0488@MEA 17110000
*                       X'04' - NO MATCH ON RQMAINS           #0488@MEA 17120000
*                       X'05' - CHOICE INAPPROPRIATE          #0488@MEA 17130000
*                       X'06' - NO MATCH ON CONTROL PROG. TYPE#0488@MEA 17140000
*                       X'07' - JOB CLASS NOT ENABLED         #0488@MEA 17150000
*                       X'08' - LSTOR UPDATE PENDING          #0488@MEA 17160000
*                       X'09' - CLASS CAN'T RUN ON THIS MAIN  #0488@MEA 17170000
*                       X'0A' - MIX INAPPROPRIATE (1)         #0488@MEA 17180000
*                       X'0B' - FIT INAPPROPRIATE (1)         #0488@MEA 17190000
*                       X'0C' - FIT INAPPROPRIATE (2)         #0488@MEA 17200000
*                       X'0D' - MIX INAPPROPRIATE (2)         #0488@MEA 17210000
*                       X'0E' - JOB IN HOLD OR ACTIVE         #0488@MEA 17220000
*                       X'0F' - RQINDEX NOT IN SELECT         #0488@MEA 17230000
*                       X'10' - JOB IS IN DJC HOLD            #0488@MEA 17240000
*                       X'11' - MINPART NOT AVAILABLE         #0488@MEA 17250000
*                       X'12' - GROUP DISABLED ON THIS MAIN   #0488@MEA 17260000
*                       X'13' - MAIN IS OFFLINE               #0488@MEA 17270000
*                       X'14' - TDEPTH EXCEEDED               #0488@MEA 17280000
*           THE REMAINING GMS BYPASS CODES ARE SET BY JMF     #0488@MEA 17290000
*                       X'7E' - NO GROUP INITIATORS STARTED   #0488@MEA 17300000
*                       X'7F' - ALL GROUP INITIATORS IN USE   #0488@MEA 17310000
* STORAGE DECLARATIONS FOR THE 'MDS SCHEDULING BYPASS REASONS'#0488@MEA 17320000
*                       X'80' - RESOURCE UPDATE ONLY          #0488@MEA 17330000
*                       X'81' - JOB HOLD STATUS               #0488@MEA 17340000
*                       X'82' - MAX REGION SIZE EXCEEDED      #0488@MEA 17350000
*                       X'83' - RESTART JOB PASS ONLY         #0488@MEA 17360000
*                       X'84' - ELIGIBLE MAIN NOT ONLINE OR IP#0488@MEA 17370000
*                               IPLED                         #0488@MEA 17380000
*                       X'85' - INCORRECT CONTROL PROGRAM TYPE#0488@MEA 17390000
*                       X'86' - GMS GROUP OR CLASS NOT ENABLED#0488@MEA 17400000
*                       X'87' - REQUIRED RESOURCE NOT AVAILABL#0488@MEA 17410000
*                       X'88' - DEVICE POOL FENCE NOT BUILT   #0488@MEA 17420000
*                       X'89' - MAIN SETUP DEPTH EXCEEDED     #0488@MEA 17430000
*                       X'8A' - JOB CLASS SETUP DEPTH EXCEEDED#0488@MEA 17440000
*                       X'8B' - FAILED PREALLOCATION SCAN     #0488@MEA 17450000
*                       X'FF' - JOB SELECTED FOR A MAIN       #0488@MEA 17460000
         DS    XL3      RESERVED FOR DEVELOPMENT               #693@MEA 17470000
R84JSAV  DS    F        AVERAGE FUNCTION TIME IN SECONDS      #0488@MEC 17480000
R84JSCNT DS    F        ACTIVE JOB COUNT                                17490000
R84JSMIN DS    F        MINIMUM FUNCTION TIME IN SECONDS      #0488@MEC 17500000
R84JSMAX DS    F        MAXIMUM FUNCTION TIME IN SECONDS      #0488@MEC 17510000
R84JSMNJ DS    CL8      JOB ID FOR THE MINIMUM FUNCTION TIME            17520000
R84JSMXJ DS    CL8      JOB ID FOR THE MAXIMUM FUNCTION TIME            17530000
*                                                              @OY34777 17535000
R84JBSZ6 EQU   *-R84JSNAM SIZE OF EACH JES3 FUNCTION SUMMARY ENTRY      17540000
*******************************************************************     17550000
*                                                                 *     17560000
*          SUBTYPE 5  --  PLOT SECTION                            *     17570000
*                                                                 *     17580000
*  NOTE: EACH PLOT COUNTER ENTRY CONTAINS TWO FIELDS: SCALE   #0488@MEA 17590000
*        AND COUNT. THE SCALE FIELD REFERS TO THE VALUE ALONG #0488@MEA 17600000
*        THE VERTICAL LINE.  THE COUNT FIELD CAN BE USED TO   #0488@MEA 17610000
*        CALCULATE THE POINTS ON THE HORIZONTAL LINE. YOU CAN #0488@MEA 17620000
*        CALCULATE THE PERCENTAGE OF JMF INTERVAL TIME SPENT  #0733@MEC 17630000
*        AT THE GIVEN SCALE (RECORDED BY THE PREVIOUS FIELD)  #0488@MEA 17640000
*        BY THE FOLLOWING FORMULA:                            #0488@MEA 17650000
*        % OF JMF INTERVAL TIME = COUNT / JOB SAMPLE COUNT    #0488@MEA 17660000
*                                 (R84JOBCG) * 100            #0488@MEA 17670000
*******************************************************************     17680000
SMF84PLT DSECT                                                          17690000
R84PLTLN DS    F        LENGTH OF PLOT SECTION                #0227@MEC 17700000
R84JOBCG DS    F        NUMBER OF JOB SAMPLE COUNTS           #0488@MEA 17710000
R84INITN DS    F        NUMBER OF PLOTS FOR "JOBS IN          #0227@MEC 17720000
*                       EXECUTION BY MAIN PROCESSOR"                    17730000
R84INITO DS    F        OFFSET TO THE 1ST ENTRY OF "JOBS IN   #0227@MEC 17740000
*                       EXECUTION BY MAIN  PROCESSOR"                   17750000
R84RQNXN DS    F        NUMBER OF PLOTS FOR "JOB Q LENGTH      #569@MEM 17760000
*                       BY JES3 FUNCTION"                      #569@MEM 17770000
R84RQNXO DS    F        OFFSET TO 1ST ENTRY OF "JOB Q LENGTH   #569@MEM 17780000
*                       BY JES3 FUNCTION"                      #569@MEM 17790000
R84DCLSN DS    F        NUMBER OF PLOTS FOR "ALLOCATED JES3    #569@MEM 17800000
*                       DEVICES BY DEVICE  CLASS"              #569@MEM 17810000
R84DCLSO DS    F        OFFSET TO THE 1ST ENTRY OF             #569@MEM 17820000
*                       "ALLOCATED JES3 DEVICES BY DEVICE CLASS#569@MEM 17830000
R84SETNN DS    F        NUMBER OF PLOTS FOR "ALLOCATED         #569@M3M 17840000
*                       JES3 DEVICES BY SETNAME"               #569@M3M 17850000
R84SETNO DS    F        OFFSET TO THE 1ST ENTRY OF             #569@M3M 17860000
*                       "ALLOCATED JES3 DEVICES BY SETNAME"    #569@M3M 17870000
R84JCLSN DS    F        NUMBER OF PLOTS FOR "JOBS IN          #0227@MEC 17880000
*                       EXECUTION BY JOB CLASS GROUP"                   17890000
R84JCLSO DS    F        OFFSET TO THE 1ST ENTRY OF "JOBS      #0227@MEC 17900000
*                       IN EXECUTION BY JOB CLASS GROUP"                17910000
R84PLTSZ EQU   *-R84PLTLN  SIZE OF PLOT SECTION                         17920000
*******************************************************************     17930000
*   THE FOLLOWING DSECT WILL MAP EACH "JOBS IN EXECUTION BY MAIN  *     17940000
*   PROCESSOR (I.E. INITIATOR PLOT)"  ENTRY                       *     17950000
*******************************************************************     17960000
R84IPLOT DSECT                                                          17970000
R84INEXT DS    F        OFFSET TO NEXT INITIATOR PLOT ENTRY             17980000
R84INAME DS    CL8      PROCESSOR NAME                                  17990000
R84IFLG  DS    XL1      FLAG BYTE 1                                     18000000
R84IGBL  EQU   X'80'    JES3 GLOBAL                                     18010000
R84ILCL  EQU   X'40'    JES3 LOCAL                                      18020000
         DS    XL3      RESERVED                                        18030000
R84IINIT DS    F        COUNT FOR STARTED INITIATORS                    18040000
R84IPLLO DS    F        SMALLEST SCALE FOR INITIATOR PLOT     #0227@MEC 18050000
R84IPLHI DS    F        LARGEST SCALE FOR INITIATOR PLOT      #0227@MEC 18060000
R84IPLIN DS    F        INCREMENT FOR PLOTTING INITIATOR PLOT           18070000
R84IPTMN DS    F        MINIMUM PLOT VALUE FOR INITIATOR PLOT           18080000
R84IPTMX DS    F        MAXIMUM PLOT VALUE FOR INITIATOR PLOT           18090000
R84IPTAV DS    F        AVERAGE PLOT VALUE FOR INITIATOR PLOT           18100000
R84IPTN  DS    F        NUMBER OF INITIATOR PLOT COUNTER ENTRIES        18110000
R84IPTO  DS    F        OFFSET TO 1ST INITIATOR PLOT COUNTER ENTRY      18120000
*                                                              @OY34777 18125000
R84ISZ1  EQU   *-R84INEXT  LENGTH OF INITIATOR PLOT ENTRY               18130000
*******************************************************************     18140000
*  THE FOLLOWING DSECT WILL MAP EACH INITIATOR PLOT COUNTER ENTRY *     18150000
*******************************************************************     18160000
R84IPT   DSECT                                                          18170000
R84IPTS  DS    F        INITIATOR PLOT SCALE                            18180000
R84IPTC  DS    F        COUNT FOR INITIATOR PLOT SCALE                  18190000
*                                                              @OY34777 18195000
R84IPSZ1 EQU   *-R84IPTS LENGTH OF INIT. PLOT COUNTER ENTRY   #0227@MEC 18200000
*******************************************************************     18210000
*THE FOLLOWING DSECT WILL MAP EACH "JOBS IN EXECUTION BY JOB CLASS*     18220000
*GROUP" ENTRY                                                     *     18230000
*******************************************************************     18240000
R84JPLOT DSECT                                                          18250000
R84JNEXT DS    F        OFFSET TO NEXT ENTRY FOR "JOBS IN               18260000
*                       EXECUTION BY JOB CLASS GROUP"                   18270000
R84JNAME DS    CL8      PROCESSOR NAME                                  18280000
R84JCGRP DS    CL8      JOB CLASS GROUP NAME                  #0227@MEA 18290000
R84JCSIN DS    F        COUNT FOR STARTED INITIATORS          #0227@MEA 18300000
R84JPLLO DS    F        SMALLEST SCALE FOR JOB CLASS PLOT     #0227@MEA 18310000
R84JPLHI DS    F        LARGEST SCALE FOR JOB CLASS PLOT      #0227@MEA 18320000
R84JPLIN DS    F        INCREMENT FOR PLOTTING JOB CLASS PLOT #0227@MEA 18330000
R84JPTMN DS    F        MINIMUM PLOT VALUE FOR JOB CLASS PLOT #0227@MEA 18340000
R84JPTMX DS    F        MAXIMUM PLOT VALUE FOR JOB CLASS PLOT #0227@MEA 18350000
R84JPTAV DS    F        AVERAGE PLOT VALUE FOR JOB CLASS PLOT #0227@MEA 18360000
R84JPTN  DS    F        NUMBER OF PLOT COUNTER ENTRIES FOR JOB#0227@MEA 18370000
*                       CLASS PLOT                            #0227@MEA 18380000
R84JPTO  DS    F        OFFSET TO 1ST PLOT COUNTER ENTRY      #0227@MEA 18390000
*                       FOR JOB CLASS PLOT                    #0227@MEA 18400000
*                                                            4#0227@MED 18410000
*                                                              @OY34777 18415000
R84JSZ1  EQU   *-R84JNEXT  LENGTH OF JOB CLASS GROUP ENTRY              18420000
*                                                           18#0227@MED 18430000
*******************************************************************     18440000
*   THE FOLLOWING DSECT WILL MAP EACH JOB CLASS GROUP PLOT COUNTER*     18450000
*   ENTRY                                                         *     18460000
*******************************************************************     18470000
R84JCPT  DSECT                                                          18480000
R84JPTS  DS    F        JOB CLASS GROUP PLOT SCALE                      18490000
R84JPTC  DS    F        COUNT FOR JOB CLASS GROUP PLOT SCALE            18500000
*                                                              @OY34777 18505000
R84JPSZ1 EQU   *-R84JCPT  LENGTH OF JOB CLASS GROUP PLOT COUNTER ENT    18510000
*******************************************************************     18520000
* THE FOLLOWING DSECT WILL MAP EACH "ALLOCATED JES3 DEVICES BY    *     18530000
* DEVICE CLASS (I.E. DEVICE PLOT)" ENTRY                          *     18540000
*******************************************************************     18550000
R84DPLOT DSECT                                                #0227@MEC 18560000
R84DNEXT DS    F        OFFSET TO NEXT DEVICE PLOT                      18570000
R84DFLG  DS    XL1      FLAG BYTE 1                                     18580000
R84DTA   EQU   X'80'    TAPE DEVICE                                     18590000
R84DDA   EQU   X'40'    DIRECT ACCESS DEVICE                            18600000
R84DUR   EQU   X'20'    UNIT RECORD DEVICE                              18610000
R84DGR   EQU   X'10'    GRAPHICS DEVICE                                 18620000
         DS    XL1      RESERVED                              #0227@MEC 18630000
R84DNAME DS    CL2      DEVICE NAME                           #0227@MEC 18640000
R84DCNT  DS    F        COUNT FOR TOTAL NUMBER OF DEVICES               18650000
R84DPLLO DS    F        SMALLEST SCALE FOR DEVICE PLOT        #0227@MEC 18660000
R84DPLHI DS    F        LARGEST SCALE FOR DEVICE PLOT         #0227@MEC 18670000
R84DPLIN DS    F        INCREMENT FOR PLOTTING DEVICE PLOT              18680000
R84DPTMN DS    F        MINIMUM PLOT VALUE FOR DEVICE PLOT              18690000
R84DPTMX DS    F        MAXIMUM PLOT VALUE FOR DEVICE PLOT              18700000
R84DPTAV DS    F        AVERAGE PLOT VALUE FOR DEVICE PLOT              18710000
R84DPTN  DS    F        NUMBER OF PLOT COUNTER ENTRIES FOR              18720000
*                       DEVICE PLOT                                     18730000
R84DPTO  DS    F        OFFSET TO 1ST PLOT COUNTER ENTRY                18740000
*                       FOR DEVICE PLOT                                 18750000
*                                                              @OY34777 18755000
R84DSZ1  EQU   *-R84DNEXT    LENGTH OF DEVICE PLOT ENTRY                18760000
*******************************************************************     18770000
*   THE FOLLOWING DSECT WILL MAP EACH DEVICE PLOT COUNTER ENTRY   *     18780000
*******************************************************************     18790000
R84DPT   DSECT                                                          18800000
R84DPTS  DS    F        DEVICE PLOT SCALE                               18810000
R84DPTC  DS    F        COUNT FOR DEVICE PLOT SCALE                     18820000
*                                                              @OY34777 18825000
R84DPSZ1 EQU   *-R84DPTS    LENGTH OF DEVICE PLOT COUNTER ENTRY         18830000
*******************************************************************     18840000
*   THE FOLLOWING DSECT WILL MAP EACH "ALLOCATED JES3 DEVICES BY  *     18850000
*   SETNAME (I.E. SETNAME PLOT)" ENTRY                            *     18860000
*******************************************************************     18870000
R84SPLOT DSECT                                                #0227@MEC 18880000
R84SNEXT DS    F        OFFSET TO NEXT SETNAME PLOT                     18890000
R84SMPCN DS    CL8      PROCESSOR NAME                        #0499@MEC 18900000
R84SFLG  DS    XL1      FLAG BYTE 1                                     18910000
R84SGBL  EQU   X'80'    JES3 GLOBAL                                     18920000
R84SLCL  EQU   X'40'    JES3 LOCAL                                      18930000
         DS    XL3      RESERVED                                        18940000
R84SXTYP DS    CL8      SETNAME DEVICE NAME                   #0227@MEA 18950000
R84SXTOT DS    F        TOTAL SETNAME DEVICES                 #0227@MEA 18960000
R84SPLLO DS    F        SMALLEST SCALE FOR SETNAME PLOT       #0227@MEA 18970000
R84SPLHI DS    F        LARGEST SCALE FOR SETNAME PLOT        #0227@MEA 18980000
R84SPLIN DS    F        INCREMENT FOR PLOTTING SETNAME PLOT   #0227@MEA 18990000
         SPACE 1                                                        18995000
R84SPTMN DS    F        MINIMUM PLOT VALUE FOR SETNAME PLOT   #0227@MEA 19000000
R84SPTMX DS    F        MAXIMUM PLOT VALUE FOR SETNAME PLOT   #0227@MEA 19010000
R84SPTAV DS    F        AVERAGE PLOT VALUE FOR SETNAME PLOT   #0227@MEA 19020000
R84SPTN  DS    F        NUMBER OF SETNAME PLOT COUNTER ENTRIES#0227@MEA 19030000
R84SPTO  DS    F        OFFSET TO 1ST SETNAME PLOT COUNTER ENT#0227@MEA 19040000
*                                                            2#0227@MED 19050000
R84SSZ1  EQU   *-R84SNEXT   LENGTH OF SETNAME PLOT ENTRY      #0227@MEC 19060000
         ORG   R84SPTMN                                       #0227@MEA 19070000
R84XJMIN DS    F        MINIMUM PLOT VALUE FOR J TYPE DEVICES.#0227@MEA 19080000
*                       J TYPE DEVICES ARE SETUP DEVICES THAT #0227@MEA 19090000
*                       ARE ALLOCATED BY JES3.                #0227@MEA 19100000
R84XJMAX DS    F        MAXIMUM PLOT VALUE FOR J TYPE DEVICES #0227@MEA 19110000
R84XJAVG DS    F        AVERAGE PLOT VALUE FOR J TYPE DEVICES #0227@MEA 19120000
R84XJPTN DS    F        NUMBER OF PLOT COUNTER ENTRIES FOR    #0227@MEA 19130000
*                       J TYPE DEVICES                        #0227@MEA 19140000
R84XJPTO DS    F        OFFSET TO 1ST PLOT COUNTER ENTRY FOR  #0227@MEA 19150000
*                       J TYPE DEVICES.                       #0227@MEA 19160000
R84XXMIN DS    F        MINIMUM PLOT VALUE FOR X TYPE DEVICES;#0227@MEA 19170000
*                       X TYPE DEVICES ARE SETUP DEVICES THAT #0227@MEA 19180000
*                       IN EXECUTION ON MAIN (CLASS 1 DEVICES #0227@MEA 19190000
*                       ONLY).                                #0227@MEA 19200000
R84XXMAX DS    F        MAXIMUM PLOT VALUE FOR X TYPE DEVICES #0227@MEA 19210000
R84XXAVG DS    F        AVERAGE PLOT VALUE FOR X TYPE DEVICES #0227@MEA 19220000
R84XXPTN DS    F        NUMBER OF PLOT COUNTER ENTRIES FOR    #0227@MEA 19230000
*                       X TYPE DEVICES                        #0227@MEA 19240000
R84XXPTO DS    F        OFFSET TO 1ST PLOT COUNTER ENTRY FOR  #0227@MEA 19250000
*                       X TYPE DEVICES                        #0227@MEA 19260000
R84XMMIN DS    F        MINIMUM PLOT VALUE FOR M TYPE DEVICES;#0227@MEA 19270000
*                       M TYPE DEVICES ARE SETUP DEVICES THAT #0227@MEA 19280000
*                       ARE ALLOCATED BY MVS.                 #0227@MEA 19290000
R84XMMAX DS    F        MAXIMUM PLOT VALUE FOR M TYPE DEVICES #0227@MEA 19300000
R84XMAVG DS    F        AVERAGE PLOT VALUE FOR M TYPE DEVICES #0227@MEA 19310000
R84XMPTN DS    F        NUMBER OF PLOT COUNTER ENTRIES FOR M  #0227@MEA 19320000
*                       TYPE DEVICES                          #0227@MEA 19330000
R84XMPTO DS    F        OFFSET TO 1ST PLOT COUNTER ENTRY FOR  #0227@MEA 19340000
*                       M TYPE DEVICES                        #0227@MEA 19350000
*                                                              @OY34777 19355000
R84SSZ2  EQU   *-R84SNEXT  LENGTH OF XTYPE PLOT ENTRY         #0227@MEA 19360000
*                                                           43#0227@MED 19370000
**************************************************************#0227@MEC 19380000
* THE FOLLOWING DSECT WILL MAP EACH SETNAME, X TYPE, J TYPE, *#0227@MEC 19390000
* OR M TYPE PLOT COUNTER ENTRY                               *#0227@MEC 19400000
**************************************************************#0227@MEC 19410000
R84XPT   DSECT                                                          19420000
R84XPTS  DS    F        XTYPE PLOT SCALE                      #0227@MEC 19430000
R84XPTC  DS    F        COUNT FOR XTYPE PLOT SCALE                      19440000
*                                                              @OY34777 19445000
R84XPSZ1 EQU   *-R84XPTS    LENGTH OF XTYPE PLOT COUNTER ENTRY          19450000
*******************************************************************     19460000
*THE FOLLOWING DSECT WILL MAP EACH "JES3 Q LENGTH BY JES3 FUNCTION*     19470000
*   (I.E. RQINDEX PLOT)" ENTRY                                    *     19480000
*******************************************************************     19490000
R84RPLOT DSECT                                                #0227@MEC 19500000
R84RNEXT DS    F        OFFSET TO NEXT RQINDEX PLOT                     19510000
R84RQNAM DS    CL33     NAME OF RQINDEX                                 19520000
         DS    XL3      RESERVED                                        19530000
R84RPLLO DS    F        SMALLEST SCALE FOR RQINDEX PLOT       #0227@MEC 19540000
R84RPLHI DS    F        LARGEST SCALE FOR RQINDEX PLOT        #0227@MEC 19550000
R84RPLIN DS    F        INCREMENT FOR PLOTTING RQINDEX PLOT             19560000
R84RPTMN DS    F        MINIMUM PLOT VALUE FOR RQINDEX PLOT             19570000
R84RPTMX DS    F        MAXIMUM PLOT VALUE FOR RQINDEX PLOT             19580000
R84RPTAV DS    F        AVERAGE PLOT VALUE FOR RQINDEX PLOT             19590000
R84RPTN  DS    F        NUMBER OF PLOT COUNTER ENTRIES FOR              19600000
*                       RQINDEX PLOT                                    19610000
R84RPTO  DS    F        OFFSET TO 1ST PLOT COUNTER ENTRY                19620000
*                       FOR RQINDEX PLOT                                19630000
*                                                              @OY34777 19635000
R84RSZ1  EQU   *-R84RNEXT  LENGTH OF RQINDEX PLOT ENTRY                 19640000
*******************************************************************     19650000
*   THE FOLLOWING DSECT WILL MAP EACH RQINDEX PLOT COUNTER ENTRY  *     19660000
*******************************************************************     19670000
R84RPT   DSECT                                                #0227@MEC 19675000
R84RQPTS DS    F        RQINDEX PLOT SCALE                              19680000
R84RQPTC DS    F        COUNT FOR RQINDEX PLOT SCALE                    19690000
*                                                              @OY34777 19695000
R84RQPS1 EQU   *-R84RQPTS  LENGTH OF RQINDEX PLOT COUNTER ENTRY         19700000
         SPACE ,                                                        19710000
         AIF   ('&SUBTYPE' EQ 'ALL').SUBTYP6                            19720000
         AIF   ('&SUBTYPE' EQ 'ALLJ3').SUBTYP6                 @Z23LSMF 19722000
         AIF   ('&SUBTYPE' EQ 'ALLJES').SUBTYP6                @Z23LSMF 19725000
         AIF   ('&SUBTYPE' EQ '').SUBTYP6                               19726000
         MEXIT                                                          19730000
.SUBTYP6 ANOP                                                           19740000
*******************************************************************     19750000
*                                                                 *     19760000
*          SUBTYPE 6  --  HOT SPOT ANALYSIS SECTION               *     19770000
*                                                                 *     19780000
*******************************************************************     19790000
         SPACE 2                                                        19800000
SMF84HSP DSECT                                                          19810000
R84SPLNG DS    F        LENGTH OF THE JES3 HOT SPOT ANALYSIS SECTION    19820000
R84SPNUM DS    F        TOTAL NUMBER OF HOT SPOT ENTRIES                19830000
R84SPOF  DS    F        OFFSET OF THE 1ST HOT SPOT ENTRY                19840000
R84SPOT  DS    CL8      SPOT = VALUE                          #0415@MEC 19850000
R84WIDTH DS    CL8      WIDTH = VALUE                         #0415@MEC 19860000
R84NAME  DS    CL8      NAME = VALUE                          #0415@MEC 19870000
R84HFCT  DS    CL8      HFCT = VALUE                          #0415@MEC 19880000
R84HSPFL DS    X'00'    HOT SPOT FLAG                         #0586@MEA 19890000
R84HSPOV EQU   X'80'    HOT SPOT TABLE EXCEEDED FLAG          #0586@MEA 19900000
         DS    XL3      RESERVED FOR DEVELOPMENT              #0586@MEA 19910000
*                                                            3#0415@MED 19920000
R84SPSZ1 EQU   *-R84SPLNG SIZE OF JES3 HOT SPOT ANALYSIS HEADER         19930000
**********************************************************************  19940000
*   EACH HOT SPOT ENTRY CAN BE MAPPED BY THE FOLLOWING FORMAT.       *  19950000
**********************************************************************  19960000
R84HSP   DSECT                                                          19970000
R84SCSCT DS    CL8      CSECT NAME                                      19980000
R84STYPE DS    CL2      CSECT TYPE                                      19990000
         DS    XL2      RESERVED FOR DEVELOPMENT              #0415@MEC 20000000
R84SSTRT DS    F        STARTING ADDRESS OR DISPLACEMENT      #0611@MEC 20010000
R84SEND  DS    F        ENDING ADDRESS OR DISPLACEMENT        #0611@MEC 20020000
R84SPCNT DS    F        CSECT REFERENCE COUNT;                          20030000
*                       % OF RUN ACTIVE--OVERALL = CSECT REFERENCE      20040000
*                       COUNT / CPU BUSY SAMPLE COUNT * 100             20050000
R84SPNRF DS    F        CSECT REFERENCE COUNT IN IATNUC;                20060000
*                       % OF RUN ACTIVE--IATNUC = CSECT REFERENCE       20070000
*                       COUNT IN IATNUC / CPU BUSY SAMPLE COUNT * 100;  20080000
*                       % OF TASK ACTIVE--IATNUC = CSECT REFERENCE      20090000
*                       COUNT IN IATNUC / IATNUC POSTED-ACTIVE COUNT    20100000
*                       * 100                                           20110000
R84SPARF DS    F        CSECT REFERENCE COUNT IN IATAUX;                20120000
*                       % OF RUN ACTIVE--IATAUX = CSECT REFERENCE COUNT 20130000
*                       IN IATAUX / CPU BUSY SAMPLE COUNT * 100;        20140000
*                       % OF TASK ACTIVE--IATAUX = CSECT REFERENCE      20150000
*                       COUNT IN IATAUX / IATAUX POSTED-ACTIVE COUNT    20160000
*                       * 100                                           20170000
*                                                              @OY34777 20175000
R84SPSZ2 EQU   *-R84SCSCT SIZE OF JES3 HOT SPOT ANALYSIS HEADER         20180000
         SPACE ,                                                        20190000
         AIF   ('&SUBTYPE' EQ 'ALL').SUBTYP7                            20200000
         AIF   ('&SUBTYPE' EQ 'ALLJ3').SUBTYP7                 @Z23LSMF 20202000
         AIF   ('&SUBTYPE' EQ 'ALLJES').SUBTYP7                @Z23LSMF 20205000
         AIF   ('&SUBTYPE' EQ '').SUBTYP7                               20206000
         MEXIT                                                          20210000
.SUBTYP7 ANOP                                                           20220000
*******************************************************************     20230000
*                                                                 *     20240000
*          SUBTYPE 7  --  JES3 INTERNAL READER DSP ANALYSIS       *     20250000
*                                                                 *     20260000
*******************************************************************     20270000
         SPACE 2                                                        20280000
SMF84IR  DSECT                                                          20290000
R84IRLNG DS    F        LENGTH OF THE JES3 INTERNAL READER DSP ANALYSIS 20300000
*                       SECTION                                         20310000
R84IRMN  DS    F        MINIMUM NUMBER OF ACTIVE INTERNAL READER DSPS   20320000
R84IRMX  DS    F        MAXIMUM NUMBER OF ACTIVE INTERNAL READER DSPS   20330000
R84IRAV  DS    F        AVERAGE NUMBER OF ACTIVE INTERNAL READER DSPS   20340000
R84IRIR  DS    F        AVERAGE NUMBER OF IDLE INTERNAL READER DSPS     20350000
R84IRHWM DS    F        INTERNAL READER DSP HIGH WATER MARK    @OY16159 20360000
R84IRATM DS    F        ACTIVE-INTRDR-AT-MAX COUNT;                     20370000
*                       % OF ACTIVE-INTRDR-AT-MAX = ACTIVE-INTRDR-AT-   20380000
*                       MAX COUNT / JMF SAMPLE COUNT * 100              20390000
R84IRAT0 DS    F        NO-INTRDR-ACTIVE COUNT;                         20400000
*                       % OF ACTIVE-INTRDR-AT-ZERO = NO-INTRDR-ACTIVE   20410000
*                       COUNT / JMF SAMPLE COUNT * 100                  20420000
R84IRAVL DS    F        AVERAGE LENGTH OF THE INTRDR QUEUE              20430000
R84IRMXA DS    F        MAXIMUM INTERNAL READER DSPS ALLOWED;  @OY16159 20440000
*                       IF IT IS 0000FFFF, THERE IS NO LIMIT   @OY16159 20450000
*                       ON INTRDR DSPS ALLOWED                 @OY16159 20460000
R84IRSZ1 EQU   *-R84IRLNG SIZE OF INTRDR DSP ANALYSIS SECTION           20470000
         SPACE ,                                                        20480000
         AIF   ('&SUBTYPE' EQ 'ALL').SUBTYP8                            20490000
         AIF   ('&SUBTYPE' EQ 'ALLJ3').SUBTYP8                 @Z23LSMF 20493000
         AIF   ('&SUBTYPE' EQ 'ALLJES').SUBTYP8                @Z23LSMF 20496000
         AIF   ('&SUBTYPE' EQ '').SUBTYP8                               20498000
         MEXIT                                                          20500000
.SUBTYP8 ANOP                                                           20510000
*******************************************************************     20520000
*                                                                 *     20530000
*          SUBTYPE 8  --  JES3 SSI RESPONSE TIME ANALYSIS         *     20540000
*                                                                 *     20550000
*******************************************************************     20560000
         SPACE 2                                                        20570000
SMF84SSI DSECT                                                          20580000
R84SILNG DS    F        LENGTH OF THE SSI RESPONSE TIME SECTION         20590000
R84SSIN  DS    F        TOTAL NUMBER OF SSI ENTRIES                     20600000
R84SSIO  DS    F        OFFSET OF THE 1ST SSI ENTRY                     20610000
R84SISZ1 EQU   *-R84SILNG SIZE OF SSI RESPONSE TIME ANALYSIS            20620000
**********************************************************************  20630000
*   EACH SSI ENTRY CAN BE MAPPED BY THE FOLLOWING FORMAT             *  20640000
**********************************************************************  20650000
R84SSI   DSECT                                                          20660000
R84SIFN  DS    CL12     SSI FUNCTION CODE NAME                          20670000
R84SIREQ DS    F        NUMBER OF REQUESTS RECEIVED                     20680000
R84SIRSP DS    F        NUMBER OF RESPONSES RECEIVED                    20690000
R84SIMIN DS    F        MINIMUM RESPONSE TIME IN MICROSECONDS  @OY16159 20700000
R84SIMAX DS    F        MAXIMUM RESPONSE TIME IN MICROSECONDS  @OY16159 20710000
R84SIAVG DS    F        AVERAGE RESPONSE TIME IN MICROSECONDS  @OY16159 20720000
*                                                              @OY34777 20725000
R84SISZ2 EQU   *-R84SIFN  SIZE OF EACH SSI RESPONSE TIME ENTRY          20730000
         SPACE ,                                                        20740000
         AIF   ('&SUBTYPE' EQ 'ALL').SUBTYP9                            20750000
         AIF   ('&SUBTYPE' EQ 'ALLJ3').SUBTYP9                 @Z23LSMF 20751000
         AIF   ('&SUBTYPE' EQ 'ALLJES').SUBTYP9                @Z23LSMF 20754000
         AIF   ('&SUBTYPE' EQ '').SUBTYP9                               20757000
         MEXIT                                                          20760000
.SUBTYP9 ANOP                                                           20770000
*******************************************************************     20780000
*                                                                 *     20790000
*          SUBTYPE 9  --  JES3 SSI DESTINATION QUEUE ANALYSIS     *     20800000
*                                                                 *     20810000
*******************************************************************     20820000
         SPACE 2                                                        20830000
SMF84DSQ DSECT                                                          20840000
R84DQLNG DS    F        LENGTH OF THE SSI DESTINATION QUEUE SECTION     20850000
R84DQNUM DS    F        TOTAL NUMBER OF SSI DESTINATION ENTRIES         20860000
R84DQOF  DS    F        OFFSET OF THE 1ST SSI DESTINATION QUEUE ENTRY   20870000
R84DQSZ1 EQU   *-R84DQLNG SIZE OF SSI DEST QUEUE ANALYSIS HEADER        20880000
**********************************************************************  20890000
*   EACH SSI DESTINATION ENTRY CAN BE MAPPED BY THE FOLLOWING FORMAT.*  20900000
**********************************************************************  20910000
R84DSQ   DSECT                                                          20920000
R84DQNAM DS    CL30     SSI DESTINATION QUEUE NAME                      20930000
*                                                              @OY34777 20930100
R84DQFLG DS    X        DYNAMIC DESTQ FLAG BYTE                @OY16159 20940000
R84DGFSS EQU   X'80'    DYN DESTQ / GLOBAL / FSS ONLY ENTRY    @OY16159 20950000
R84DGFSA EQU   X'40'    DYN DESTQ / GLOBAL / FSS/FSA ENTRY     @OY16159 20960000
R84DLFSS EQU   X'20'    DYN DESTQ / LOCAL / FSS ONLY ENTRY     @OY16159 20970000
R84DLFSA EQU   X'10'    DYN DESTQ / LOCAL / FSS/FSA ENTRY      @OY16159 20980000
         DS    X        RESERVED FOR DEVELOPMENT              #0286@MEA 20990000
R84FSSNM DS    CL8      FSS NAME (GLOBAL/DYN DESTQ;            @OY16159 21000000
*                       HEX ZEROS IF GLOBAL/NOT DYN DESTQ)     @OY16159 21010000
         ORG   R84FSSNM                                        @OY16159 21020000
R84FSSID DS    XL2      FSS ID ( LOCAL/DYN DESTQ)              @OY16159 21030000
*                       (REDEFINES 1ST TWO BYTES OF R85FSSNM)  @OY16159 21040000
         ORG   ,                                               @OY16159 21050000
R84FSANM DS    CL8      FSA NAME (GLOBAL/DYN DESTQ AND FSS/FSA @OY16159 21060000
*                       ENTRY. HEX ZEROS IF GLOBAL/NOT DYN     @OY16159 21070000
*                       DESTQ, OR IF GLOBAL/DYN DESTQ AND      @OY16159 21080000
*                       FSS ONLY ENTRY).                       @OY16159 21090000
         ORG   R84FSANM                                        @OY16159 21100000
R84FSAID DS    XL2      FSA ID  (LOCAL/DYN DESTQ)              @OY16159 21110000
*                       (HEX ZEROS IF LOCAL/DYN DESTQ AND FSS  @OY16159 21120000
*                       ONLY ENTRY). (REDEFINES 1ST TWO BYTES  @OY16159 21130000
*                       OF R84FSANM).                          @OY16159 21140000
         ORG   ,                                               @OY16159 21150000
************************************************************** @OY16159 21160000
*                                                              @OY16159 21170000
* THE FOLLOWING TABLE SHOWS THE CONTENTS OF R84DQFLG,          @OY16159 21180000
* R84FSSNM/R84FSSID, AND R84FSANM/R84FSAID FOR THE VARIOUS     @OY16159 21190000
* TYPES OF RECORDS MAPPED HERE. (A = ALPHANUMERIC CHARACTER,   @OY16159 21200000
* X = HEXADECIMAL BYTE, AND Z = HEX ZEROS BYTE).               @OY16159 21210000
*                                                              @OY16159 21220000
* TYPE                 R84DQFLG  R84FSSNM    R84FSANM          @OY16159 21230000
*                                /R84FSSID   /R84FSAID         @OY16159 21240000
* NON-DYN.             X'00'     ZZZZZZZZ    ZZZZZZZZ          @OY16159 21250000
* DYN. GLOBAL FSS ONLY X'80'     AAAAAAAA    ZZZZZZZZ          @OY16159 21260000
* DYN. GLOBAL FSS/FSA  X'40'     AAAAAAAA    AAAAAAAA          @OY16159 21270000
* DYN. LOCAL  FSS ONLY X'20'     XXZZZZZZ    ZZZZZZZZ          @OY16159 21280000
* DYN. LOCAL  FSS/FSA  X'10'     XXZZZZZZ    XXZZZZZZ          @OY16159 21290000
*                                                             #0418@MED 21300000
R84DQMAX DS    F        MAXIMUM DESTINATION QUEUE LENGTH                21310000
R84DQMIN DS    F        MINIMUM DESTINATION QUEUE LENGTH                21320000
R84DQAVG DS    F        AVERAGE DESTINATION QUEUE LENGTH                21330000
*                                                              @OY34777 21335000
R84DQSZ2 EQU   *-R84DQNAM SIZE OF EACH SSI DEST QUEUE ANALYSIS ENTRY    21340000
         SPACE ,                                                   @RWA 21350000
         AIF   ('&SUBTYPE' EQ 'ALL').SUBTY10                       @RWA 21360000
         AIF   ('&SUBTYPE' EQ 'ALLJ3').SUBTY10                 @Z23LSMF 21363000
         AIF   ('&SUBTYPE' EQ 'ALLJES').SUBTY10                @Z23LSMF 21366000
         AIF   ('&SUBTYPE' EQ '').SUBTY10                               21368000
         MEXIT ,                                                   @RWA 21370000
.SUBTY10 ANOP  ,                                                   @RWA 21380000
         EJECT ,                                                   @RWA 21390000
***************************************************************    @RWA 21400000
*                                                             *    @RWA 21410000
*        The following maps the subtype 10 - Workload Manager *    @RWA 21420000
*        (WLM) information.                                   *    @RWA 21430000
*                                                             *    @RWA 21440000
*        The WLM information consists of the following data   *    @RWA 21450000
*        sections:                                            *    @RWA 21460000
*                                                             *    @RWA 21470000
*        (1) WLM General section - contains offsets to the    *    @RWA 21480000
*            other sections.                                  *    @RWA 21490000
*                                                             *    @RWA 21500000
*        (2) Service class section - Information is collected *    @RWA 21510000
*            for each service class that had activity during  *    @RWA 21520000
*            the sampling interval.  The following sections   *    @RWA 21530000
*            are created for each service class:              *    @RWA 21540000
*                                                             *    @RWA 21550000
*            -- Service class fixed section - Contains the    *    @RWA 21560000
*               service class name and offsets to the other   *    @RWA 21570000
*               sections.                                     *    @RWA 21580000
*                                                             *    @RWA 21590000
*            -- Service class non-system information -        *    @RWA 21600000
*               Contains non-system related information such  *    @RWA 21610000
*               as the number of jobs in MDS, GMS etc.        *    @RWA 21620000
*                                                             *    @RWA 21630000
*            -- Service class system information - one entry  *    @RWA 21640000
*               for every system that had activity during     *    @RWA 21650000
*               the sampling interval.                        *    @RWA 21660000
*                                                             *    @RWA 21670000
*-------------------------------------------------------------*    @RWA 21680000
*                                                             *    @RWA 21690000
*        The SMF 84 record for WLM has the following format.  *    @RWA 21700000
*        If all of the information fits into a single SMF     *    @RWA 21710000
*        buffer, the SMF record looks like this:              *    @RWA 21720000
*                                                             *    @RWA 21730000
*        -- SMF 84 header                                     *    @RWA 21740000
*        -- SMF 84 product section                            *    @RWA 21750000
*        -- SMF 84 general section                            *    @RWA 21760000
*                                                             *    @RWA 21770000
*        -- WLM General/subtype 10 section                    *    @RWA 21780000
*                                                             *    @RWA 21790000
*           -- Service Class Fixed Section - Srvclass #1      *    @RWA 21800000
*              -- Service Class - Non-system info             *    @RWA 21810000
*              -- Service Class - System info #1              *    @RWA 21820000
*                    .                                        *    @RWA 21830000
*                    .                                        *    @RWA 21840000
*                    .                                        *    @RWA 21850000
*              -- Service Class - System info #n              *    @RWA 21860000
*                                                             *    @RWA 21870000
*           -- Service Class Fixed Section - Srvclass #2      *    @RWA 21880000
*                    .                                        *    @RWA 21890000
*                    .                                        *    @RWA 21900000
*                    .                                        *    @RWA 21910000
*                                                             *    @RWA 21920000
*-------------------------------------------------------------*    @RWA 21930000
*                                                             *    @RWA 21940000
*        If one or more service classes will not fit into     *    @RWA 21950000
*        a single buffer, the first buffer will look like     *    @RWA 21960000
*        the first example, but the second through nth        *    @RWA 21970000
*        buffers will look like this:                         *    @RWA 21980000
*                                                             *    @RWA 21990000
*        -- SMF 84 header                                     *    @RWA 22000000
*                                                             *    @RWA 22010000
*        -- WLM General/subtype 10 section                    *    @RWA 22020000
*                                                             *    @RWA 22030000
*           -- Service Class Fixed Section - Srvclass #n      *    @RWA 22040000
*              -- Service Class - Non-system info             *    @RWA 22050000
*              -- Service Class - System info #1              *    @RWA 22060000
*                    .                                        *    @RWA 22070000
*                    .                                        *    @RWA 22080000
*                    .                                        *    @RWA 22090000
*              -- Service Class - System info #n              *    @RWA 22100000
*                                                             *    @RWA 22110000
*           -- Service Class Fixed Section - Srvclass #n+1    *    @RWA 22120000
*                    .                                        *    @RWA 22130000
*                    .                                        *    @RWA 22140000
*                    .                                        *    @RWA 22150000
*                                                             *    @RWA 22160000
*-------------------------------------------------------------*    @RWA 22170000
*                                                             *    @RWA 22180000
*        It is also possible that the system specific         *    @RWA 22190000
*        information for a service class will not fit into    *    @RWA 22200000
*        a single buffer.  In this case, the information      *    @RWA 22210000
*        will be continued in the next buffer.  When this     *    @RWA 22220000
*        happens, the offset in the next buffer to the        *    @RWA 22230000
*        non-system specific information will be zero because *    @RWA 22240000
*        the non-system information exists in the previous    *    @RWA 22250000
*        buffer.                                              *    @RWA 22260000
*                                                             *    @RWA 22270000
*        The continuation buffer will look like this:         *    @RWA 22280000
*                                                             *    @RWA 22290000
*                                                             *    @RWA 22300000
*        -- SMF 84 header                                     *    @RWA 22310000
*                                                             *    @RWA 22320000
*        -- WLM General/subtype 10 section                    *    @RWA 22330000
*                                                             *    @RWA 22340000
*           -- Service Class Fixed Section                    *    @RWA 22350000
*              -- Service Class - System info #m              *    @RWA 22360000
*                    .                                        *    @RWA 22370000
*                    .                                        *    @RWA 22380000
*                    .                                        *    @RWA 22390000
*              -- Service Class - System info #n              *    @RWA 22400000
*                                                             *    @RWA 22410000
*           -- Service Class Fixed Section                    *    @RWA 22420000
*                    .                                        *    @RWA 22430000
*                    .                                        *    @RWA 22440000
*                    .                                        *    @RWA 22450000
*                                                             *    @RWA 22460000
***************************************************************    @RWA 22470000
         SPACE 1                                                   @RWA 22480000
***************************************************************    @RWA 22490000
*                                                             *    @RWA 22500000
*        Subtype 10 - WLM General Section                     *    @RWA 22510000
*                                                             *    @RWA 22520000
***************************************************************    @RWA 22530000
SMF84WLM DSECT ,                   WLM General Data Section        @RWA 22540000
R84WLMLN DS    F                   Length of the WLM general       @RWA 22550000
*                                    section                       @RWA 22560000
*                                                                  @RWA 22570000
R84SRVOF DS    F                   Offset to from this section     @RWA 22580000
*                                    to the first service          @RWA 22590000
*                                    class section or zero         @RWA 22600000
*                                                                  @RWA 22610000
R84WLMGR DS    20F                 Reserved for IBM                @RWA 22620000
*                                                                  @RWA 22630000
R84WLMEN DS    0F                  End of WLM general section      @RWA 22640000
R84WLMSZ EQU   *-SMF84WLM          Size of WLM general section     @RWA 22650000
         SPACE 1                                                   @RWA 22660000
***************************************************************    @RWA 22670000
*                                                             *    @RWA 22680000
*        Subtype 10 - Service Class Fixed Section             *    @RWA 22690000
*                                                             *    @RWA 22700000
***************************************************************    @RWA 22710000
R84_SRVCLASS  DSECT ,              Service Class Fixed Section     @RWA 22720000
R84_SRVCLEN   DS  F                Length of this section          @RWA 22730000
*                                                                  @RWA 22740000
R84_SRVCNAME  DS  CL8              Service class name              @RWA 22750000
*                                                                  @RWA 22760000
R84_SRVCSMPC  DS  F                Number of samples this          @RWA 22770000
*                                    service class was found       @RWA 22780000
*                                                                  @RWA 22790000
R84_SRVCNXOF  DS  F                Offset from this section        @RWA 22800000
*                                    to the next service           @RWA 22810000
*                                    class fixed section in        @RWA 22820000
*                                    this buffer                   @RWA 22830000
*                                                                  @RWA 22840000
R84_SRVNSYOF  DS  F                Offset from this section to     @RWA 22850000
*                                    the non-system specific       @RWA 22860000
*                                    information for this          @RWA 22870000
*                                    service class.  This will     @RWA 22880000
*                                    be zero if this is a          @RWA 22890000
*                                    continuation buffer for       @RWA 22900000
*                                    system specific               @RWA 22910000
*                                    information.                  @RWA 22920000
*                                                                  @RWA 22930000
R84_SRVSYSOF  DS  F                Offset from this section to     @RWA 22940000
*                                    the system specific           @RWA 22950000
*                                    information for this          @RWA 22960000
*                                    service class in this         @RWA 22970000
*                                    buffer                        @RWA 22980000
*                                                                  @RWA 22990000
R84_SRVCRSV1  DS  4F               Reserved for IBM                @RWA 23000000
*                                                                  @RWA 23010000
R84_SRVCFEND  DS  0F               End of fixed section            @RWA 23020000
R84_SRVCFSIZ  EQU *-R84_SRVCLASS   Size of fixed section           @RWA 23030000
         EJECT ,                                                   @RWA 23040000
***************************************************************    @RWA 23050000
*                                                             *    @RWA 23060000
*        Subtype 10 - Service Class Non-System Specific       *    @RWA 23070000
*                     Section                                 *    @RWA 23080000
*                                                             *    @RWA 23090000
***************************************************************    @RWA 23100000
R84_SRVCNSYS  DSECT ,              Non-System Specific Section     @RWA 23110000
*                                                                  @RWA 23120000
R84_NSYSLEN   DS  F                Length of this section          @RWA 23130000
         SPACE 1                                                   @RWA 23140000
*-------------------------------------------------------------*    @RWA 23150000
*        Start of sampling counts where we track the minimum, *    @RWA 23160000
*        maximum, and average number of jobs.                 *    @RWA 23170000
*-------------------------------------------------------------*    @RWA 23180000
R84_NSYCCNTS  DS  0F               Start of sampling counts        @RWA 23190000
         SPACE 1                                                   @RWA 23200000
*-------------------------------------------------------------*    @RWA 23210000
*        Main service wait and MDS sampling counts.           *    @RWA 23220000
*-------------------------------------------------------------*    @RWA 23230000
R84_MAINW     DS  0F               Main service wait counts        @RWA 23240000
R84_MAINWMIN  DS  F                Minimum count                   @RWA 23250000
R84_MAINWMAX  DS  F                Maximum count                   @RWA 23260000
R84_MAINWAVG  DS  F                Average count                   @RWA 23270000
*                                                                  @RWA 23280000
R84_MDS       DS  0F               MDS counts                      @RWA 23290000
R84_MDSMIN    DS  F                Minimum count                   @RWA 23300000
R84_MDSMAX    DS  F                Maximum count                   @RWA 23310000
R84_MDSAVG    DS  F                Average count                   @RWA 23320000
         SPACE 1                                                   @RWA 23330000
*-------------------------------------------------------------*    @RWA 23340000
*        GMS sampling counts.                                 *    @RWA 23350000
*-------------------------------------------------------------*    @RWA 23360000
R84_GMS       DS  0F               GMS total counts                @RWA 23370000
R84_GMSMIN    DS  F                Minimum count                   @RWA 23380000
R84_GMSMAX    DS  F                Maximum count                   @RWA 23390000
R84_GMSAVG    DS  F                Average count                   @RWA 23400000
*                                                                  @RWA 23410000
R84_MOFNC     DS  0F               Main offline/not connected      @RWA 23420000
R84_MOFNCMIN  DS  F                Minimum count                   @RWA 23430000
R84_MOFNCMAX  DS  F                Maximum count                   @RWA 23440000
R84_MOFNCAVG  DS  F                Average count                   @RWA 23450000
*                                                                  @RWA 23460000
R84_GRPDS     DS  0F               Group disabled                  @RWA 23470000
R84_GRPDSMIN  DS  F                Minimum count                   @RWA 23480000
R84_GRPDSMAX  DS  F                Maximum count                   @RWA 23490000
R84_GRPDSAVG  DS  F                Average count                   @RWA 23500000
*                                                                  @RWA 23510000
R84_JBHLD     DS  0F               Job held                        @RWA 23520000
R84_JBHLDMIN  DS  F                Minimum count                   @RWA 23530000
R84_JBHLDMAX  DS  F                Maximum count                   @RWA 23540000
R84_JBHLDAVG  DS  F                Average count                   @RWA 23550000
*                                                                  @RWA 23560000
R84_CLSDS     DS  0F               Class disabled                  @RWA 23570000
R84_CLSDSMIN  DS  F                Minimum count                   @RWA 23580000
R84_CLSDSMAX  DS  F                Maximum count                   @RWA 23590000
R84_CLSDSAVG  DS  F                Average count                   @RWA 23600000
*                                                                  @RWA 23610000
R84_SCHEN     DS  0F               Scheduling environment is       @RWA 23620000
*                                    not available                 @RWA 23630000
R84_SCHENMIN  DS  F                Minimum count                   @RWA 23640000
R84_SCHENMAX  DS  F                Maximum count                   @RWA 23650000
R84_SCHENAVG  DS  F                Average count                   @RWA 23660000
*                                                                  @RWA 23670000
R84_SPOOL     DS  0F               Spool space shortage            @RWA 23680000
R84_SPOOLMIN  DS  F                Minimum count                   @RWA 23690000
R84_SPOOLMAX  DS  F                Maximum count                   @RWA 23700000
R84_SPOOLAVG  DS  F                Average count                   @RWA 23710000
*                                                                  @RWA 23720000
R84_TDEPT     DS  0F               TDEPTH reached                  @RWA 23730000
R84_TDEPTMIN  DS  F                Minimum count                   @RWA 23740000
R84_TDEPTMAX  DS  F                Maximum count                   @RWA 23750000
R84_TDEPTAVG  DS  F                Average count                   @RWA 23760000
*                                                                  @RWA 23770000
R84_TLIMT     DS  0F               TLIMIT exceeded                 @RWA 23780000
R84_TLIMTMIN  DS  F                Minimum count                   @RWA 23790000
R84_TLIMTMAX  DS  F                Maximum count                   @RWA 23800000
R84_TLIMTAVG  DS  F                Average count                   @RWA 23810000
*                                                                  @RWA 23820000
R84_MDEPT     DS  0F               MDEPTH reached                  @RWA 23830000
R84_MDEPTMIN  DS  F                Minimum count                   @RWA 23840000
R84_MDEPTMAX  DS  F                Maximum count                   @RWA 23850000
R84_MDEPTAVG  DS  F                Average count                   @RWA 23860000
*                                                                  @RWA 23870000
R84_MLIMT     DS  0F               MLIMIT exceeded                 @RWA 23880000
R84_MLIMTMIN  DS  F                Minimum count                   @RWA 23890000
R84_MLIMTMAX  DS  F                Maximum count                   @RWA 23900000
R84_MLIMTAVG  DS  F                Average count                   @RWA 23910000
         SPACE 1                                                   @RWA 23920000
*-------------------------------------------------------------*    @RWA 23930000
*        SYSPLEX sampling counts.                             *    @RWA 23940000
*-------------------------------------------------------------*    @RWA 23950000
R84_PLELG     DS  0F               Number of jobs eligible to      @RWA 23960000
*                                    run anywhere in the           @RWA 23970000
*                                    SYSPLEX                       @RWA 23980000
R84_PLELGMIN  DS  F                Minimum count                   @RWA 23990000
R84_PLELGMAX  DS  F                Maximum count                   @RWA 24000000
R84_PLELGAVG  DS  F                Average count                   @RWA 24010000
*                                                                  @RWA 24020000
R84_PLINE     DS  0F               Number of jobs ineligible       @RWA 24030000
*                                    to run anywhere in the        @RWA 24040000
*                                    SYSPLEX for reasons           @RWA 24050000
*                                    other than class limits       @RWA 24060000
R84_PLINEMIN  DS  F                Minimum count                   @RWA 24070000
R84_PLINEMAX  DS  F                Maximum count                   @RWA 24080000
R84_PLINEAVG  DS  F                Average count                   @RWA 24090000
*                                                                  @RWA 24100000
R84_PLLMT     DS  0F               Number of jobs ineligible       @RWA 24110000
*                                    to run anywhere in the        @RWA 24120000
*                                    SYSPLEX because of            @RWA 24130000
*                                    class limits                  @RWA 24140000
R84_PLLMTMIN  DS  F                Minimum count                   @RWA 24150000
R84_PLLMTMAX  DS  F                Maximum count                   @RWA 24160000
R84_PLLMTAVG  DS  F                Average count                   @RWA 24170000
*                                                                  @RWA 24180000
R84_PLEXE     DS  0F               Number of jobs in execution     @RWA 24190000
*                                    somewhere in the SYSPLEX      @RWA 24200000
R84_PLEXEMIN  DS  F                Minimum count                   @RWA 24210000
R84_PLEXEMAX  DS  F                Maximum count                   @RWA 24220000
R84_PLEXEAVG  DS  F                Average count                   @RWA 24230000
         SPACE 1                                                   @RWA 24240000
R84_NSYSRSV1  DS  6F               Reserved for IBM                @RWA 24250000
         SPACE 1                                                   @RWA 24260000
*-------------------------------------------------------------*    @RWA 24270000
*        End of non-system service class section.             *    @RWA 24280000
*-------------------------------------------------------------*    @RWA 24290000
R84_NSYSEND   DS  0F               End of section                  @RWA 24300000
R84_NSYSSIZE  EQU *-R84_SRVCNSYS   Size of section                 @RWA 24310000
         EJECT ,                                                   @RWA 24320000
***************************************************************    @RWA 24330000
*                                                             *    @RWA 24340000
*        Subtype 10 - Service Class System Specific Section   *    @RWA 24350000
*                                                             *    @RWA 24360000
***************************************************************    @RWA 24370000
R84_SRVCSYS   DSECT ,              System Specific Service         @RWA 24380000
*                                    Class Section                 @RWA 24390000
*                                                                  @RWA 24400000
R84_SYSLEN    DS  F                Length of this section          @RWA 24410000
*                                                                  @RWA 24420000
R84_SYSNXOF   DS  F                Offset of next system           @RWA 24430000
*                                    specific information for      @RWA 24440000
*                                    this service class in         @RWA 24450000
*                                    this buffer                   @RWA 24460000
*                                                                  @RWA 24470000
R84_SYSNAME   DS  CL8              System name                     @RWA 24480000
*                                                                  @RWA 24490000
R84_SYELG     DS  0F               Number of jobs eligible to      @RWA 24500000
*                                    run on this system            @RWA 24510000
R84_SYELGMIN  DS  F                Minimum count                   @RWA 24520000
R84_SYELGMAX  DS  F                Maximum count                   @RWA 24530000
R84_SYELGAVG  DS  F                Average count                   @RWA 24540000
*                                                                  @RWA 24550000
R84_SYINE     DS  0F               Number of jobs ineligible       @RWA 24560000
*                                    to run on this system         @RWA 24570000
R84_SYINEMIN  DS  F                Minimum count                   @RWA 24580000
R84_SYINEMAX  DS  F                Maximum count                   @RWA 24590000
R84_SYINEAVG  DS  F                Average count                   @RWA 24600000
*                                                                  @RWA 24610000
R84_SYEXE     DS  0F               Number of jobs in execution     @RWA 24620000
*                                    on this system                @RWA 24630000
R84_SYEXEMIN  DS  F                Minimum count                   @RWA 24640000
R84_SYEXEMAX  DS  F                Maximum count                   @RWA 24650000
R84_SYEXEAVG  DS  F                Average count                   @RWA 24660000
*                                                                  @RWA 24670000
R84_SYCON     DS  0F               Number of jobs that can         @SOA 24671000
*                                    execute only                  @SOA 24672000
*                                      on this system              @SOA 24673000
R84_SYCONMIN  DS  F                Minimum count                   @SOA 24674000
R84_SYCONMAX  DS  F                Maximum count                   @SOA 24675000
R84_SYCONAVG  DS  F                Average count                   @SOA 24676000
*                                                                  @SOA 24677000
R84_SYSRSVD1  DS  3F               Reserved for IBM                @SOC 24680000
*                                                                  @RWA 24690000
R84_SYSEND    DS  0F               End of system specific          @RWA 24700000
*                                    section                       @RWA 24710000
R84_SYSSIZE   EQU *-R84_SRVCSYS    Size of system specific         @RWA 24720000
*                                    section                       @RWA 24730000
         SPACE 1                                               @Z23LSMF 24740000
         AIF   ('&SUBTYPE' EQ 'ALLJES').SUBTY21                @Z23LSMF 24750000
         AIF   ('&SUBTYPE' EQ '').SUBTY21                               24755000
         MEXIT ,                                               @Z23LSMF 24760000
.SUBTY21 ANOP  ,                                               @Z23LSMF 24770000
         EJECT ,                                               @Z23LSMF 24780000
************************************************************** @Z23LSMF 24790000
*                                                            * @Z23LSMF 24800000
*        Subtype 21 - JES2 resource usage section            * @Z23LSMF 24810000
*                                                            * @Z23LSMF 24820000
************************************************************** @Z23LSMF 24830000
SMF84JRU DSECT ,                   WLM General Data Section    @Z23LSMF 24840000
R84J2RUL DS    F                   Length of the JES2 resource @Z23LSMFC24850000
                                     usage section             @Z23LSMF 24860000
         DS    XL(6*4+2)           Reserved                    @Z23LSMF 24870000
         SPACE 1                                               @Z23LSMF 24880000
*------------------------------------------------------------* @Z23LSMF 24890000
*        Triplets to describe data areas being returned.     * @Z23LSMF 24900000
*        All offsets in the section are from SMF84JRU.       * @Z23LSMF 24910000
*------------------------------------------------------------* @Z23LSMF 24920000
         SPACE 1                                               @Z23LSMF 24930000
R84J2RTR DS    H                   Number of triplets          @Z23LSMF 24940000
         SPACE 1                                               @Z23LSMF 24950000
*------------------------------------------------------------* @Z23LSMF 24960000
*        Memory usage section (R84MEMJ2 DSECTs)              * @Z23LSMF 24970000
*------------------------------------------------------------* @Z23LSMF 24980000
         SPACE 1                                               @Z23LSMF 24990000
R84J2RMO DS    F                   Offset to 1st R84MEMJ2      @Z23LSMF 25000000
R84J2RML DS    H                   Length of a R84MEMJ2 entry  @Z23LSMF 25010000
R84J2RMN DS    H                   Number of R84MEMJ2 entries  @Z23LSMF 25020000
         SPACE 1                                               @Z23LSMF 25030000
*------------------------------------------------------------* @Z23LSMF 25040000
*        Resource usage section (R84RSUJ2 DSECTs)            * @Z23LSMF 25050000
*------------------------------------------------------------* @Z23LSMF 25060000
         SPACE 1                                               @Z23LSMF 25070000
R84J2RRO DS    F                   Offset to 1st R84RSUJ2      @Z23LSMF 25080000
R84J2RRL DS    H                   Length of a R84RSUJ2 entry  @Z23LSMF 25090000
R84J2RRN DS    H                   Number of R84RSUJ2 entries  @Z23LSMF 25100000
         DS    0D                  Align                       @Z23LSMF 25110000
         SPACE 1                                               @Z23LSMF 25120000
R84J2RZ1 EQU   *-SMF84JRU          Size of area                @Z23LSMF 25130000
         EJECT ,                                               @Z23LSMF 25140000
*------------------------------------------------------------* @Z23LSMF 25150000
*        R84MEMJ2 maps each storage element (corresponds to  * @Z23LSMF 25160000
*        a storage area tracked)                             * @Z23LSMF 25170000
*------------------------------------------------------------* @Z23LSMF 25180000
         SPACE 1                                               @Z23LSMF 25190000
R84MEMJ2 DSECT ,                   Memory usage data entry     @Z23LSMF 25200000
R84MEM_NAME    DS  CL12            Area name                   @Z23LSMF 25210000
         SPACE 1                                               @Z23LSMF 25220000
               DS  F               Reserved                    @Z23LSMF 25230000
R84MEM_REGION  DS  D               Region size in bytes        @Z23LSMF 25240000
R84MEM_USE     DS  D               Current area usage in bytes @Z23LSMF 25250000
R84MEM_LOW     DS  D               Low usage value in bytes    @Z23LSMF 25260000
R84MEM_HIGH    DS  D               High usage value in bytes   @Z23LSMF 25270000
R84MEM_AVERAGE DS  D               Average in use in bytes     @Z23LSMF 25280000
         SPACE 1                                               @Z23LSMF 25290000
               DS  0D              Align                       @Z23LSMF 25300000
R84MEM_LEN     EQU *-R84MEMJ2      Length of memory data       @Z23LSMF 25310000
         EJECT ,                                               @Z23LSMF 25320000
*------------------------------------------------------------* @Z23LSMF 25330000
*        R84RSUJ2 maps each resource element (corresponds to * @Z23LSMF 25340000
*        an individual resource)                             * @Z23LSMF 25350000
*------------------------------------------------------------* @Z23LSMF 25360000
         SPACE 1                                               @Z23LSMF 25370000
R84RSUJ2 DSECT ,                   Limit monitoring data entry @Z23LSMF 25380000
R84RSU_NAME    DS  CL8             Resource name               @Z23LSMF 25390000
R84RSU_LIMIT   DS  F               Current upper limit         @Z23LSMF 25400000
R84RSU_INUSE   DS  F               Current number in use       @Z23LSMF 25410000
R84RSU_LOW     DS  F               Low usage value             @Z23LSMF 25420000
R84RSU_HIGH    DS  F               High usage value            @Z23LSMF 25430000
R84RSU_WARN    DS  FL2             WARN= value for resource    @Z23LSMFC25440000
                                     (zero if none)            @Z23LSMF 25450000
R84RSU_FLG1    DS  B               Flag bytes                  @Z23LSMF 25460000
R84RSU_F1OVER  EQU B'10000000'       Usage over warn level     @Z23LSMF 25470000
               DS  FL1             Reserved                    @Z23LSMF 25480000
R84RSU_OVER    DS  F               Count of samples over warn  @Z23LSMFC25490000
                                     level (HASP050 needed)    @Z23LSMF 25500000
R84RSU_AVERAGE DS  F               Average in use value        @Z23LSMF 25510000
               DS  0D              Align                       @Z23LSMF 25520000
R84RSU_LEN     EQU *-R84RSUJ2      Length of resource data     @Z23LSMF 25530000
*                                                              @Z23LSMF 25540000
         AIF   ('&SUBTYPE' EQ 'ALLJ2').SUBTY22                 @Z23LSMF 25550000
         AIF   ('&SUBTYPE' EQ 'ALLJES').SUBTY22                @Z23LSMF 25560000
         AIF   ('&SUBTYPE' EQ '').SUBTY22                               25565000
         MEXIT ,                                               @Z23LSMF 25570000
.SUBTY22 ANOP  ,                                               @Z23LSMF 25580000
         MEND       */                                                  25590000
*%IAZ84:;                                                               25600000
*/********************************************************************/ 25610000
*/*                                                                  */ 25620000
*/*           SMF 84 HEADER                                          */ 25630000
*/*                                                                  */ 25640000
*/********************************************************************/ 25650000
*                                                                       25660000
*%DCL IAZSMF84_SUBTYPE CHAR EXTERNAL; /* Parameter used to determine    25670000
*                                        which subtypes to generate. */ 25680000
*%IF IBM_CBGENC = 'YES' %THEN                                           25690000
*%DO;                                                                   25700000
*  %S84_    = 'SMF84_';                                                 25710000
*  %S84U_   = 'SMF84_';                                                 25720000
*  %SUBTYPE = 'ALLJES';                                                 25730000
*%END;                                                                  25740000
*%ELSE %DO;                                                             25750000
*  %S84_    = 'R84';                                                    25760000
*  %S84U_   = 'R84_';                                                   25770000
*%END;                                                                  25780000
*                                                                       25790000
*   DCL 1 SMF84HDR BASED(SMF84PTR) BDY(WORD),                           25800000
*        3 SMF84LEN FIXED(15),    /* RECORD LENGTH                   */ 25810000
*        3 SMF84SEG FIXED(15),    /* SEGMENT DESCRIPTOR              */ 25820000
*        3 SMF84FLG BIT(8),       /* SYSTEM INDICATOR                */ 25830000
*          5 *        BIT(1),     /*   Reserved                      */ 25840000
*          5 SMF84STI BIT(1),     /*   SUBTYPE INDICATOR INDICATES      25850000
*                                       WHICH SUBSYSTEM BEING USED   */ 25860000
*          5 *        BIT(3),     /*   Reserved                      */ 25870000
*          5 *        BIT(1),     /*   MVS/XA                        */ 25880000
*          5 *        BIT(1),     /*   VS2                           */ 25890000
*          5 *        BIT(1),     /*   VS1                           */ 25900000
*        3 SMF84RTY FIXED(8),     /* RECORD TYPE (84 OR X'54')       */ 25910000
*        3 SMF84TME FIXED(32)     /* TIME, IN HUNDREDS OF A SECOND   */ 25920000
*                   BDY(BYTE),    /* WHEN RECORD WAS WRITTEN            25930000
*                                    (SET BY SMF)                    */ 25940000
*        3 SMF84DTE FIXED(32)     /* DATE RECORD WAS WRITTEN, IN THE */ 25950000
*                   BDY(BYTE),    /* FORM 00YYDDDF (SET BY SMF)      */ 25960000
*        3 SMF84SID CHAR(4),      /* SYSTEM IDENTIFIER (SET BY SMF)  */ 25970000
*        3 SMF84SBS FIXED(16),    /* SUBSYSTEM IDENTIFICATION        */ 25980000
*        3 SMF84SGN FIXED(16),    /* SEGMENT NUMBER                  */ 25990000
*        3 SMF84FL1 BIT(8),       /* FLAG BYTE 1 FOR SMF TYPE 84     */ 26000000
*          5 SMF84LST BIT(1),     /*   LAST SMF SEGMENT INDICATOR    */ 26010000
*          5 *        BIT(7),     /*   Reserved                      */ 26020000
*        3 SMF84VER FIXED(8),     /* SMF84 VERSION NUMBER            */ 26030000
*        3 SMF84STY FIXED(16),    /* RECORD SUBTYPE                  */ 26040000
*        3 SMF84TRN FIXED(16),    /* NUMBER OF TRIPLETS IN RECORD    */ 26050000
*  @SPACE (1);                                                          26060000
*        3 SMF84PRS FIXED(31),    /* OFFSET TO PRODUCT SECTION       */ 26070000
*        3 SMF84PRL FIXED(16),    /* LENGTH OF PRODUCT SECTION       */ 26080000
*        3 SMF84PRN FIXED(16),    /* NUMBER OF PRODUCT SECTIONS      */ 26090000
*        3 SMF84GNS FIXED(31),    /* OFFSET TO GENERAL SECTION       */ 26100000
*        3 SMF84GNL FIXED(16),    /* LENGTH OF GENERAL SECTION       */ 26110000
*        3 SMF84GNN FIXED(16),    /* NUMBER OF GENERAL SECTIONS      */ 26120000
*        3 SMF84J1O FIXED(31),    /* OFFSET TO DATA SECTION          */ 26130000
*        3 SMF84J1L FIXED(16),    /* LENGTH OF DATA SECTION          */ 26140000
*        3 SMF84J1N FIXED(16);    /* NUMBER OF DATA SECTIONS         */ 26150000
*                                                                       26160000
* DCL SMF84SZ1 FIXED(31) CONSTANT(Length(SMF84HDR));  /*                26170000
*                                           Len of heading section   */ 26180000
*% IF IAZSMF84_SUBTYPE=''       %THEN %GOTO PROSEC;                     26190000
*% IF IAZSMF84_SUBTYPE='ALL'    %THEN %GOTO PROSEC;                     26200000
*% IF IAZSMF84_SUBTYPE='ALLJ2'  %THEN %GOTO PROSEC;                     26210000
*% IF IAZSMF84_SUBTYPE='ALLJ3'  %THEN %GOTO PROSEC;                     26220000
*% IF IAZSMF84_SUBTYPE='ALLJES' %THEN %GOTO PROSEC;                     26230000
*% IF IAZSMF84_SUBTYPE='0'      %THEN %GOTO PROSEC;                     26240000
*% IF IAZSMF84_SUBTYPE='1'      %THEN %GOTO PROSEC;                     26250000
*% IF IAZSMF84_SUBTYPE='2'      %THEN %GOTO PROSEC;                     26260000
*% IF IAZSMF84_SUBTYPE='3'      %THEN %GOTO PROSEC;                     26270000
*% IF IAZSMF84_SUBTYPE='4'      %THEN %GOTO PROSEC;                     26280000
*% IF IAZSMF84_SUBTYPE='5'      %THEN %GOTO PROSEC;                     26290000
*% IF IAZSMF84_SUBTYPE='6'      %THEN %GOTO PROSEC;                     26300000
*% IF IAZSMF84_SUBTYPE='7'      %THEN %GOTO PROSEC;                     26310000
*% IF IAZSMF84_SUBTYPE='8'      %THEN %GOTO PROSEC;                     26320000
*% IF IAZSMF84_SUBTYPE='9'      %THEN %GOTO PROSEC;                     26330000
*% IF IAZSMF84_SUBTYPE='10'     %THEN %GOTO PROSEC;                     26340000
*% IF IAZSMF84_SUBTYPE='21'     %THEN %GOTO PROSEC;                     26350000
* @SPACE (1);                                                           26360000
*% NOTE ("IAZSMF84 - Bad subtype value specifed - " !! SUBTYPE)         26370000
*       Msglevel(8);                                                    26380000
*%PROSEC:;                                                              26390000
* @SPACE (1);                                                           26400000
*/********************************************************************/ 26410000
*/*                                                                  */ 26420000
*/*           SMF 84 PRODUCT SECTION                                 */ 26430000
*/*                                                                  */ 26440000
*/********************************************************************/ 26450000
*                                                                       26460000
*   DCL 1 SMF84PRO BASED(Addr(SMF84HDR)+SMF84PRS),                      26470000
*     3 S84_%%MFVER FIXED(16),    /* JMF VERSION NUMBER              */ 26480000
*     3 S84_%%PRDNM CHAR(8),      /* PRODUCT NAME (I.E., SC1BA    )  */ 26490000
*     3 S84_%%INTST FIXED(32)     /* TOD JMF MEASUREMENT INTERVAL    */ 26500000
*                   BDY(BYTE),    /* STARTED IN THE FORM HHMMSSTF    */ 26510000
*     3 S84_%%SDATE FIXED(32)     /* DATE JMF MEASUREMENT INTERVAL   */ 26520000
*                   BDY(BYTE),    /* STARTED IN THE FORM 00YYDDDF    */ 26530000
*     3 S84_%%INTEN FIXED(32)     /* TOD JMF MEASUREMENT INTERVAL    */ 26540000
*                   BDY(BYTE),    /* ENDED IN THE FORM HHMMSSTF      */ 26550000
*     3 S84_%%EDATE FIXED(32)     /* DATE JMF MEASUREMENT INTERVAL   */ 26560000
*                   BDY(BYTE),    /* ENDED IN THE FORM 00YYDDDF      */ 26570000
*     3 S84_%%INTER FIXED(32)     /* JMF INTERVAL LENGTH IN SECONDS  */ 26580000
*                   BDY(BYTE),                                          26590000
*     3 S84_%%MFCYC FIXED(32)     /* JMF SAMPLING CYCLE LENGTH IN THE*/ 26600000
*                   BDY(BYTE),    /* FORM OF 00SSSTTF, F = SIGN,        26610000
*                                    (TAKEN FROM THE CYCLE OPTION)   */ 26620000
*     3 *           CHAR(2),      /* RESERVED FOR DEVELOPMENT        */ 26630000
*     3 S84_%%SAMPL FIXED(31),    /* NUMBER OF JMF SAMPLES           */ 26640000
*     3 S84_%%MFCMD CHAR(80),     /* *CALL,JMF COMMAND               */ 26650000
*     3 S84_%%MVSRL CHAR(8),      /* MVS SOFTWARE LEVEL              */ 26660000
*     3 S84_%%JESRL CHAR(8),      /* JES3 RELEASE LEVEL              */ 26670000
*     3 S84_%%CPUM  CHAR(4),      /* CPU MODEL NUMBER                */ 26680000
*     3 S84_%%RSTO  FIXED(32),    /* Real storage size at IPL in KB -   26690000
*                                      set to X'FFFFFFFF' if the value  26692000
*                                      exceeds 4T-1 - see R84RST4K      26694000
*                                                            @Z25LSMF*/ 26696000
*     3 S84_%%CPUNM CHAR(8),      /* CPU SERIAL NUMBER               */ 26700000
*     3 S84_%%CPUID CHAR(4),      /* JES3 CPU ID                     */ 26710000
*     3 S84_%%MPNAM CHAR(8),      /* MAIN PROCESSOR NAME             */ 26720000
*     3 S84_%%J3FLG BIT(8),       /* JES3 STATUS INDICATOR FLAG      */ 26730000
*       5 S84_%%J3PRO BIT(1),     /*   JES3 PROCESSOR INDICATOR:        26740000
*                                        OFF MEANS JES3 GLOBAL          26750000
*                                        ON  MEANS JES3 LOCAL        */ 26760000
*       5 S84_%%J3APG BIT(1),     /*   JES3 IN THE APG PRIORITY LEVL */ 26770000
*       5 S84_%%J3SWP BIT(1),     /*   JES3 IS NON-SWAPPABLE         */ 26780000
*       5 *           BIT(5),     /*   Reserved                      */ 26790000
*     3 *           FIXED(8),     /* Reserved                        */ 26800000
*     3 S84_%%JPRTY FIXED(16),    /* JES3 DISPATCHING PRIORITY       */ 26810000
*     3 S84_%%JMFMN FIXED(31),    /* MIN. JMF OVERHEAD IN MICROSEC   */ 26820000
*     3 S84_%%JMFMX FIXED(31),    /* MAX. JMF OVERHEAD IN MICROSEC   */ 26830000
*     3 S84_%%JMFAV FIXED(31),    /* AVG. JMF OVERHEAD IN MICROSECONDS  26840000
*                                    % OF JMF INTERVAL TIME = JMF AVG   26850000
*                                    TIME * JMF SAMPLES / JMF INTERVAL  26860000
*                                    TIME IN MICROSECONDS * 100      */ 26870000
*     3 S84_%%MVSMN FIXED(31),    /* MIN. MVS OVERHEAD IN MICROSEC   */ 26880000
*     3 S84_%%MVSMX FIXED(31),    /* MAX. MVS OVERHEAD IN MICROSEC   */ 26890000
*     3 S84_%%MVSAV FIXED(31),    /* AVG. MVS OVERHEAD IN MICROSEC      26900000
*                                    % OF JMF INTERVAL TIME = MVS AVG   26910000
*                                    TIME * JMF SAMPLES / JMF INTERVAL  26920000
*                                    TIME IN MICROSECONDS * 100      */ 26930000
*     3 S84_%%RST4K FIXED(64);    /* Real storage size at IPL in 4K     26931000
*                                      pages                 @Z25LSMF*/ 26934000
* DCL S84_%%PSSZ1 FIXED(31) CONSTANT(Length(SMF84PRO));  /*             26940000
*                                           Len of product section   */ 26950000
* @SPACE (1);                                                           26960000
*/********************************************************************/ 26970000
*/*                                                                  */ 26980000
*/*           SMF 84 GENERAL SECTION                                 */ 26990000
*/*                                                                  */ 27000000
*/********************************************************************/ 27010000
*                                                                       27020000
*   DCL 1 SMF84GS  BASED(Addr(SMF84HDR)+SMF84GNS),                      27030000
*     3 S84_%%CPUSC FIXED(31),    /* CPU BUSY SAMPLE COUNT           */ 27040000
*     3 S84_%%NPA   FIXED(31),    /* IATNUC POSTED-ACTIVE COUNT      */ 27050000
*     3 S84_%%APA   FIXED(31),    /* IATAUX POSTED-ACTIVE COUNT      */ 27060000
*     3 S84_%%NPNA  FIXED(31),    /* IATNUC POSTED--NOT-ACTIVE COUNT */ 27070000
*     3 S84_%%APNA  FIXED(31),    /* IATAUX POSTED--NOT-ACTIVE COUNT */ 27080000
*     3 S84_%%NNP   FIXED(31),    /* IATNUC NOT-POSTED COUNT         */ 27090000
*     3 S84_%%ANP   FIXED(31),    /* IATAUX NOT-POSTED COUNT         */ 27100000
*     3 S84_%%NNW   FIXED(31),    /* IATNUC NONSTANDARD-WAIT COUNT   */ 27110000
*     3 S84_%%ANW   FIXED(31),    /* IATAUX NONSTANDARD-WAIT COUNT   */ 27120000
*     3 S84_%%NSLLR FIXED(31),    /* IATNUC SUSP-LOCAL-LOCK-REQUEST  */ 27130000
*     3 S84_%%ASLLR FIXED(31),    /* IATAUX SUSP-LOCAL-LOCK-REQUEST  */ 27140000
*     3 S84_%%NSO   FIXED(31),    /* IATNUC SUSPENDED-OTHER COUNT    */ 27150000
*     3 S84_%%ASO   FIXED(31);    /* IATAUX SUSPENDED-OTHER COUNT    */ 27160000
* DCL S84_%%GISZ1 FIXED(31) CONSTANT(Length(SMF84GS));  /*              27170000
*                                           Len of general section   */ 27180000
*                                                                       27190000
*% IF IAZSMF84_SUBTYPE='1'      %THEN %GOTO SUBTYP1;                    27200000
*% IF IAZSMF84_SUBTYPE='2'      %THEN %GOTO SUBTYP2;                    27210000
*% IF IAZSMF84_SUBTYPE='3'      %THEN %GOTO SUBTYP3;                    27220000
*% IF IAZSMF84_SUBTYPE='4'      %THEN %GOTO SUBTYP4;                    27230000
*% IF IAZSMF84_SUBTYPE='5'      %THEN %GOTO SUBTYP5;                    27240000
*% IF IAZSMF84_SUBTYPE='6'      %THEN %GOTO SUBTYP6;                    27250000
*% IF IAZSMF84_SUBTYPE='7'      %THEN %GOTO SUBTYP7;                    27260000
*% IF IAZSMF84_SUBTYPE='8'      %THEN %GOTO SUBTYP8;                    27270000
*% IF IAZSMF84_SUBTYPE='9'      %THEN %GOTO SUBTYP9;                    27280000
*% IF IAZSMF84_SUBTYPE='10'     %THEN %GOTO SUBTY10;                    27290000
*% IF IAZSMF84_SUBTYPE='21'     %THEN %GOTO SUBTY21;                    27300000
*% IF IAZSMF84_SUBTYPE='ALL'    %THEN %GOTO SUBTYP1;                    27310000
*% IF IAZSMF84_SUBTYPE='ALLJ2'  %THEN %GOTO SUBTY21;                    27320000
*% IF IAZSMF84_SUBTYPE='ALLJ3'  %THEN %GOTO SUBTYP1;                    27330000
*% IF IAZSMF84_SUBTYPE='ALLJES' %THEN %GOTO SUBTYP1;                    27340000
*% IF IAZSMF84_SUBTYPE=''       %THEN %GOTO SUBTYP1;                    27350000
*% GOTO SUBDONE;                                                        27360000
*                                                                       27370000
*%SUBTYP1:;                                                             27380000
* @EJECT;                                                               27390000
*/********************************************************************/ 27400000
*/*                                                                  */ 27410000
*/*           SUBTYPE 1  HEADER SECTION                              */ 27420000
*/*                                                                  */ 27430000
*/********************************************************************/ 27440000
*                                                                       27450000
*   DCL 1 SMF84JS3 BASED(Addr(SMF84HDR)+SMF84J1O),                      27460000
*     3 S84_%%JES3O FIXED(31),    /* OFFSET TO JES3 GENERAL INFO. SEC*/ 27470000
*     3 S84_%%IRBSC FIXED(31),    /* OFFSET TO THE IRB SECTION       */ 27480000
*     3 S84_%%FCTO  FIXED(31),    /* OFFSET TO FCT AND AWAIT ANALYSIS*/ 27490000
*     3 S84_%%FFLG1 BIT(8),       /* MISC. FLAG (SECTION PRESENT)    */ 27500000
*       5 S84_%%JSSEC BIT(1),     /*   JES3 GENERAL INFO. SECTION    */ 27510000
*       5 S84_%%FCSEC BIT(1),     /*   FCT AND AWAIT ANALYSIS SECTION*/ 27520000
*       5 S84_%%RBSEC BIT(1),     /*   IRB SECTION                   */ 27530000
*       5 *           BIT(5),     /*   Reserved                      */ 27540000
*     3 *           CHAR(3);      /* RESERVED                        */ 27550000
* DCL S84_%%JS3S0 FIXED(31) CONSTANT(Length(SMF84JS3));  /*             27560000
*                                           Len of subtype 1 header  */ 27570000
* @SPACE (1);                                                           27580000
*/********************************************************************/ 27590000
*/*   JES3 GENERAL INFORMATION SECTION                               */ 27600000
*/********************************************************************/ 27610000
* DCL 1 S84_%%JES3  BASED(Addr(SMF84JS3)+S84_%%JES3O),                  27620000
*/********************************************************************/ 27630000
*/*   PAGING INFORMATION                                             */ 27640000
*/********************************************************************/ 27650000
*     3 S84_%%FOE   FIXED(31),    /* NUMBER OF FIXED PAGES           */ 27660000
*     3 S84_%%FOESZ FIXED(31),    /* TOTAL SIZE OF ALL FIX PAGES IN K*/ 27670000
*     3 S84_%%SLOT  FIXED(31),    /* AUXILIARY SLOT COUNT            */ 27680000
*     3 S84_%%SLOTS FIXED(31),    /* TOTAL SIZE OF ALL AUX SLOTS     */ 27690000
*     3 S84_%%JPIN  FIXED(31),    /* JES3 PAGE-INS DURING            */ 27700000
*     3 S84_%%JPOUT FIXED(31),    /* JES3 PAGE-OUTS DURING           */ 27710000
*     3 S84_%%JPREC FIXED(31),    /* JES3 PAGE-RECLAIMS              */ 27720000
*     3 S84_%%JPGCT FIXED(31),    /* JES3 PAGING COUNT               */ 27730000
*/********************************************************************/ 27740000
*/*   JES3 PAGING RATE PER SECOND DURING JMF MONITORING = (THE       */ 27750000
*/*   TOTAL NUMBER OF PAGE-IN'S AND PAGE-OUT'S DURING JMF MON-       */ 27760000
*/*   ITORING ( I.E. JES3 PAGING COUNT, R84JPGCT ))/ JMF INTERVAL    */ 27770000
*/*   LENGTH IN SECONDS (R84INTER). THEN RESULTS IN THE FORMAT       */ 27780000
*/*   OF XXX.XX PAGES/SECOND                                         */ 27790000
*/********************************************************************/ 27800000
*     3 S84_%%SPGCT FIXED(31),    /* SYSTEM PAGING COUNT (NON-          27810000
*                                    SWAPPABLE AND NON-VIO)          */ 27820000
*/********************************************************************/ 27830000
*/*   SYSTEM PAGING RATE PER SECOND DURING JMF MONITORING = (THE     */ 27840000
*/*   TOTAL NUMBER OF SYSTEM PAGE-IN'S AND PAGE-OUT'S DURING JMF     */ 27850000
*/*   MONITORING ( I.E. SYSTEM PAGING COUNT, R84SPGCT )) / JMF       */ 27860000
*/*   INTERVAL LENGTH IN SECONDS (R84INTER).  RESULTS IN THE         */ 27870000
*/*   FORMAT OF XXX.XX PAGES/SECOND                                  */ 27880000
*/********************************************************************/ 27890000
* @SPACE (1);                                                           27900000
*/********************************************************************/ 27910000
*/*   JES3 WORKING SET INFORMATION                                   */ 27920000
*/********************************************************************/ 27930000
*     3 S84_%%WSPLO FIXED(31),    /* LOW RANGE OF WORKING SET PLOT      27940000
*                                    SCALE IN K                      */ 27950000
*     3 S84_%%WSPHI FIXED(31),    /* HIGH RANGE OF WORKING SET PLOT     27960000
*                                    SCALE IN K                      */ 27970000
*     3 S84_%%WSINC FIXED(31),    /* INCREMENT FOR WORKING SET PLOT     27980000
*                                    in K                            */ 27990000
*     3 S84_%%WSMIN FIXED(31),    /* MINIMUM WORKING SET SIZE IN K   */ 28000000
*     3 S84_%%WSMAX FIXED(31),    /* MAXIMUM WORKING SET SIZE IN K   */ 28010000
*     3 S84_%%WSAVG FIXED(31),    /* AVERAGE WORKING SET SIZE IN K   */ 28020000
*     3 S84_%%JMFSZ FIXED(31),    /* JMF SIZE THAT IS INCLUDED IN       28030000
*                                    WORKING SET SIZE IN K           */ 28040000
*     3 S84_%%WSPTN FIXED(31),    /* Total num of working set plot      28050000
*                                    counter entries with a count       28060000
*                                    greater than zero               */ 28070000
*     3 S84_%%WSPTO FIXED(31),    /* Offset of 1st working set plot     28080000
*                                    counter entries with a count       28090000
*                                    greater than zero               */ 28100000
* @SPACE (1);                                                           28110000
*/********************************************************************/ 28120000
*/*   JES3 SUBTASKS INFORMATION                                      */ 28130000
*/********************************************************************/ 28140000
*     3 S84_%%ONES  FIXED(31),    /* COUNT FOR ONE JES3 SUBTASK         28150000
*                                    POSTED                          */ 28160000
*     3 S84_%%TWOS  FIXED(31),    /* COUNT FOR TWO JES3 SUBTASKS        28170000
*                                    POSTED CONCURRENTLY             */ 28180000
*     3 S84_%%THREE FIXED(31),    /* COUNT FOR THREE JES3 SUBTASKS      28190000
*                                    POSTED CONCURRENTLY             */ 28200000
*     3 S84_%%FOURS FIXED(31),    /* COUNT FOR FOUR OR MORE JES3        28210000
*                                    SUBTASKS POSTED CONCURRENTLY    */ 28220000
*     3 S84_%%SUBNM FIXED(31),    /* TOTAL NUMBER OF JES3 SUBTASK       28230000
*                                    ENTRIES                         */ 28240000
*     3 S84_%%SUBOF FIXED(31),    /* OFFSET OF THE 1ST JES3-SUBTASK     28250000
*                                    ENTRY                           */ 28260000
*     3 S84_%%NNFCT FIXED(31),    /* IATNUC POSTED-BUT-NO-FCT-POSTED    28270000
*                                    COUNT                           */ 28280000
*     3 S84_%%ANFCT FIXED(31);    /* IATAUX POSTED-BUT-NO-FCT-POSTED    28290000
*                                    COUNT                           */ 28300000
* DCL S84_%%JS3S1 FIXED(31) CONSTANT(Length(S84_%%JES3));   /*          28310000
*                                           Len of JES3 general info */ 28320000
* @SPACE (1);                                                           28330000
*/********************************************************************/ 28340000
*/*   THE FOLLOWING DSECT WILL MAP EACH JES3 SUBTASK ENTRY           */ 28350000
*/********************************************************************/ 28360000
* DCL 1 S84_%%SUB   BASED,                                              28370000
*     3 S84_%%SSEQN FIXED(31),    /* SUBTASK SEQUENCE NUMBER         */ 28380000
*     3 S84_%%SNAME CHAR(8),      /* SUBTASK NAME                    */ 28390000
*     3 S84_%%SPPC  FIXED(31);    /* SUBTASK POSTED COUNT            */ 28400000
* DCL S84_%%TSKSZ FIXED(31) CONSTANT(Length(S84_%%SUB));    /*          28410000
*                                           Len of JES3 subtask         28420000
*                                           entry                    */ 28430000
* @SPACE (1);                                                           28440000
*/********************************************************************/ 28450000
*/*   THE FOLLOWING DSECT WILL MAP EACH WORKING SET PLOT COUNTER     */ 28460000
*/*   ENTRY                                                          */ 28470000
*/********************************************************************/ 28480000
* DCL 1 S84_%%WSPLT BASED,                                              28490000
*     3 S84_%%WSPTS FIXED(31),    /* WORKING SET PLOT SCALE          */ 28500000
*     3 S84_%%WSPTC FIXED(31);    /* COUNT FOR WORKING SET SIZE         28510000
*                                    FOR ABOVE                       */ 28520000
* DCL S84_%%WSPS1 FIXED(31) CONSTANT(Length(S84_%%WSPLT));  /*          28530000
*                                           Len of JES3 working set     28540000
*                                           plot counter entry       */ 28550000
* @SPACE (1);                                                           28560000
*/********************************************************************/ 28570000
*/*                                                                  */ 28580000
*/*           SUBTYPE 1 -- IRB HEADER SECTION                        */ 28590000
*/*                                                                  */ 28600000
*/********************************************************************/ 28610000
*                                                                       28620000
* DCL 1 S84_%%IRBH  BASED(Addr(SMF84JS3)+S84_%%IRBSC),                  28630000
*     3 S84_%%NIRBO FIXED(31),    /* OFFSET OF THE FIRST NUC IRB TAB    28640000
*                                    ENTRY                           */ 28650000
*     3 S84_%%NIRBC FIXED(31),    /* TOTAL NUMBER OF JES3 IRBS IN       28660000
*                                    IATNUC                          */ 28670000
*     3 S84_%%NTOTA FIXED(31),    /* TOTAL NUM OF ACTIVE NUC IRB        28680000
*                                    ENTRIES                         */ 28690000
*     3 S84_%%NTOTS FIXED(31),    /* TOTAL NUM OF SUSPENDED NUC IRB     28700000
*                                    ENTRIES                         */ 28710000
*     3 S84_%%NTOTO FIXED(31),    /* TOTAL NUM OF IN-OS-WAIT IRB        28720000
*                                    ENTRIES IN IATNUC               */ 28730000
*     3 S84_%%AIRBO FIXED(31),    /* OFFSET OF THE FIRST AUX IRB TAB    28740000
*                                    ENTRY                           */ 28750000
*     3 S84_%%AIRBC FIXED(31),    /* TOTAL NUMBER OF JES3 IRBS IN       28760000
*                                    IATAUX                          */ 28770000
*     3 S84_%%ATOTA FIXED(31),    /* TOTAL NUM OF ACTIVE AUX IRB        28780000
*                                    ENTRIES                         */ 28790000
*     3 S84_%%ATOTS FIXED(31),    /* TOTAL NUM OF SUSPENDED AUX IRB     28800000
*                                    ENTRIES                         */ 28810000
*     3 S84_%%ATOTO FIXED(31),    /* TOTAL NUM OF IN-OS-WAIT IRB        28820000
*                                    ENTRIES IN IATAUX               */ 28830000
*     3 S84_%%IRBFG BIT(8),       /* MISC. FLAG FOR THE IRB SECTION  */ 28840000
*       5 S84_%%AUXOV BIT(1),     /*   AUX IRB TABLE HAS OVERFLOWED  */ 28850000
*       5 S84_%%NUCOV BIT(1),     /*   NUC IRB TABLE HAS OVERFLOWED  */ 28860000
*       5 *           BIT(6),     /*   Reserved                      */ 28870000
*     3 *           CHAR(3);      /* RESERVED                        */ 28880000
* DCL S84_%%IRBHS FIXED(31) CONSTANT(Length(S84_%%IRBH));   /*          28890000
*                                           Len of IRB header        */ 28900000
* @SPACE (1);                                                           28910000
*/********************************************************************/ 28920000
*/*   THE FOLLOWING IS A MAPPING FOR EACH IRB TABLE ENTRY            */ 28930000
*/*   NUC IRB AND AUX IRB BOTH USE THIS MAPPING FOR ITS TABLEE       */ 28940000
*/********************************************************************/ 28950000
* DCL 1 S84_%%IRBD  BASED,                                              28960000
*     3 S84_%%IRBNM CHAR(8),      /* NAME OR ADDRESS OF THE JES3 IRB */ 28970000
*     3 S84_%%IRBAC FIXED(31),    /* COUNT FOR ACTIVE JES3 IRB       */ 28980000
*     3 S84_%%IRBSU FIXED(31),    /* COUNT FOR SUSPENDED JES3 IRB    */ 28990000
*     3 S84_%%IRBWT FIXED(31);    /* COUNT FOR IN-OS-WAIT JES3 IRB   */ 29000000
* DCL S84_%%IRBSZ FIXED(31) CONSTANT(Length(S84_%%IRBD));   /*          29010000
*                                           Len of JES3 IRB table       29020000
*                                           entry                    */ 29030000
* @SPACE (1);                                                           29040000
*/********************************************************************/ 29050000
*/*                                                                  */ 29060000
*/*           SUBTYPE 1 -- FCT AND AWAIT ANALYSIS HEADER SECTION     */ 29070000
*/*                                                                  */ 29080000
*/********************************************************************/ 29090000
*                                                                       29100000
*   DCL 1 SMF84FAW BASED(Addr(SMF84JS3)+S84_%%FCTO),                    29110000
*     3 S84_%%FAWLN FIXED(31),    /* LENGTH OF THE FCT AND AWAIT        29120000
*                                    SECTION                         */ 29130000
*     3 S84_%%NMFMA FIXED(31),    /* COUNT FOR MULTI-FUNCTION           29140000
*                                    MONITOR ACTIVE IN IATNUC        */ 29150000
*     3 S84_%%NMFMS FIXED(31),    /* COUNT FOR MULTI-FUNCTION           29160000
*                                    MONITOR SUSPENDED IN IATNUC     */ 29170000
*     3 S84_%%NMFMW FIXED(31),    /* COUNT FOR MULTI-FUNCTION           29180000
*                                    MONITOR IN-OS-WAIT IN IATNUC    */ 29190000
*     3 S84_%%AMFMA FIXED(31),    /* COUNT FOR MULTI-FUNCTION           29200000
*                                    MONITOR ACTIVE IN IATAUX        */ 29210000
*     3 S84_%%AMFMS FIXED(31),    /* COUNT FOR MULTI-FUNCTION           29220000
*                                    MONITOR SUSPENDED IN IATAUX     */ 29230000
*     3 S84_%%AMFMW FIXED(31),    /* COUNT FOR MULTI-FUNCTION           29240000
*                                    MONITOR IN-OS-WAIT IN IATAUX    */ 29250000
*     3 S84_%%FCTN  FIXED(16),    /* TOTAL NUMBER OF FCT ENTRIES     */ 29260000
*     3 *           CHAR(2),      /* RESERVED FOR DEVELOPMENT        */ 29270000
*     3 S84_%%FCTOF FIXED(31);    /* OFFSET OF THE FIRST FCT ENTRY   */ 29280000
* DCL S84_%%FASZ1 FIXED(31) CONSTANT(Length(SMF84FAW));  /*             29290000
*                                           Len of FCT and AWAIT        29300000
*                                           section                  */ 29310000
* @SPACE (1);                                                           29320000
*/********************************************************************/ 29330000
*/*   THE FOLLOWING IS A MAPPING FOR EACH FCT ENTRY                  */ 29340000
*/********************************************************************/ 29350000
* DCL 1 S84_%%FCT   BASED,                                              29360000
*     3 S84_%%FSEQN FIXED(16),    /* FCT SEQUENCE NUMBER             */ 29370000
*     3 *           FIXED(16),    /* RESERVED                        */ 29380000
*     3 S84_%%FNEXT FIXED(31),    /* LENGTH OF THIS FCT ENTRY        */ 29390000
*     3 S84_%%FNAM  CHAR(8),      /* DSP NAME                        */ 29400000
*     3 S84_%%FDEV  CHAR(8),      /* DEVICE NAME                     */ 29410000
*     3 S84_%%FPRTY FIXED(16),    /* FCT PRIORITY                    */ 29420000
*     3 S84_%%FCXOF FIXED(16),    /* Offset of FCT entry extension      29430000
*                                    from the start of the this FCT     29440000
*                                    entry                           */ 29450000
*     3 S84_%%FFCT  FIXED(31),    /* FCT ON FCT CHAIN COUNT          */ 29460000
*     3 S84_%%FNUC  FIXED(31),    /* FCT IN IATNUC MODE COUNT        */ 29470000
*     3 S84_%%FAUX  FIXED(31),    /* FCT IN IATAUX MODE COUNT        */ 29480000
*/********************************************************************/ 29490000
*/*   ACTIVITY UNDER IATNUC MODE                                     */ 29500000
*/********************************************************************/ 29510000
*     3 S84_%%FNFPA FIXED(31),    /* COUNT FOR FCT POSTED-ACTIVE IN     29520000
*                                    IATNUC                          */ 29530000
*     3 S84_%%FNFNA FIXED(31),    /* COUNT FOR FCT POSTED-NOT ACTIVE    29540000
*                                    IN IATNUC                       */ 29550000
*     3 S84_%%FNFNP FIXED(31),    /* COUNT FOR FCT NOT POSTED IN        29560000
*                                    IATNUC                          */ 29570000
*     3 S84_%%FNFW  FIXED(31),    /* COUNT FOR FCT IN-OS-WAIT IN        29580000
*                                    IATNUC                          */ 29590000
*     3 S84_%%FNFS  FIXED(31),    /* COUNT FOR FCT SUSPENDED--LOCAL     29600000
*                                    LOCK REQUEST IN IATNUC          */ 29610000
*     3 S84_%%FNFSO FIXED(31),    /* COUNT FOR FCT SUSPENDED--OTHER     29620000
*                                    IN IATNUC                       */ 29630000
*     3 S84_%%FNENT FIXED(16),    /* TOTAL NUMBER OF FCT AWAIT          29640000
*                                    ENTRIES IN IATNUC               */ 29650000
*     3 *           FIXED(16),    /* RESERVED FOR DEVELOPMENT        */ 29660000
*     3 S84_%%FNOFF FIXED(31),    /* OFFSET OF THE 1ST AWAIT ENTRY      29670000
*                                    IN IATNUC                       */ 29680000
*/********************************************************************/ 29690000
*/*   ACTIVITY UNDER IATAUX MODE                                     */ 29700000
*/********************************************************************/ 29710000
*     3 S84_%%FAFPA FIXED(31),    /* COUNT FOR FCT POSTED-ACTIVE IN     29720000
*                                    IATAUX                          */ 29730000
*     3 S84_%%FAFNA FIXED(31),    /* COUNT FOR FCT POSTED-NOT ACTIVE    29740000
*                                    IN IATAUX                       */ 29750000
*     3 S84_%%FAFNP FIXED(31),    /* COUNT FOR FCT NOT POSTED IN        29760000
*                                    IATAUX                          */ 29770000
*     3 S84_%%FAFW  FIXED(31),    /* COUNT FOR FCT IN-OS-WAIT IN        29780000
*                                    IATAUX                          */ 29790000
*     3 S84_%%FAFS  FIXED(31),    /* COUNT FOR FCT SUSPENDED--LOCAL     29800000
*                                    LOCK REQUEST IN IATAUX          */ 29810000
*     3 S84_%%FAFSO FIXED(31),    /* COUNT FOR FCT SUSPENDED--OTHER     29820000
*                                    IN IATAUX                       */ 29830000
*     3 S84_%%FAENT FIXED(16),    /* TOTAL NUMBER OF FCT AWAIT          29840000
*                                    ENTRIES IN IATAUX               */ 29850000
*     3 *           FIXED(16),    /* RESERVED FOR DEVELOPMENT        */ 29860000
*     3 S84_%%FAOFF FIXED(31);    /* OFFSET OF THE 1ST AWAIT ENTRY      29870000
*                                    IN IATAUX                       */ 29880000
* DCL S84_%%FCSZ1 FIXED(31) CONSTANT(Length(S84_%%FCT));    /*          29890000
*                                           Len of FCT entry         */ 29900000
* @SPACE (1);                                                           29910000
*/********************************************************************/ 29920000
*/*                                                                  */ 29930000
*/*   FCT Entry Extension.                                           */ 29940000
*/*                                                                  */ 29950000
*/********************************************************************/ 29960000
* DCL 1 S84_%%FCTX  BASED(Addr(S84_%%FCT)+S84_%%FCXOF),                 29970000
*     3 S84_%%FCXLN FIXED(16),    /* Length of extension.  Use this     29980000
*                                    field to determine what data is    29990000
*                                    present in extension.           */ 30000000
*     3 S84_%%FCXRS FIXED(16),    /* Reserved for development        */ 30010000
*     3 S84_%%MRFRI FIXED(31),    /* Number of multi-record file        30020000
*                                      read I/O's                    */ 30030000
*     3 S84_%%MRFWI FIXED(31),    /* Number of multi-record file        30040000
*                                      write I/O's                   */ 30050000
*     3 S84_%%SRFRI FIXED(31),    /* Number of single record            30060000
*                                      file read I/O's               */ 30070000
*     3 S84_%%SRFRB FIXED(31),    /* Number of single record            30080000
*                                      file buffers read             */ 30090000
*     3 S84_%%SRFWI FIXED(31),    /* Number of single record            30100000
*                                      file write I/O's              */ 30110000
*     3 S84_%%SRFWB FIXED(31),    /* Number of single record            30120000
*                                      file buffers written          */ 30130000
*     3 S84_%%FCXR2(25) FIXED(31); /* Reserved for development       */ 30140000
* DCL S84_%%FCXSZ FIXED(31) CONSTANT(Length(S84_%%FCTX));   /*          30150000
*                                           Len of FCT entry            30160000
*                                           extension                */ 30170000
* @SPACE (1);                                                           30180000
*/********************************************************************/ 30190000
*/*  THE FOLLOWING IS A MAPPING FOR EACH FCT AWAIT ENTRY             */ 30200000
*/********************************************************************/ 30210000
* DCL 1 S84_%%AWAIT BASED,                                              30220000
*/*------------------------------------------------------------------*/ 30230000
*/*        FCT AWAIT FLAG ONE                                        */ 30240000
*/*------------------------------------------------------------------*/ 30250000
*     3 S84_%%AWFL1 BIT(8),       /* FCT AWAIT FLAG 1                */ 30260000
*       5 S84_%%AWGS  BIT(1),     /*  AWAIT FOR GENERALIZED SUBTASK  */ 30270000
*       5 S84_%%AWRJP BIT(1),     /*  AWAIT FOR RJP I/O              */ 30280000
*       5 S84_%%AWRS  BIT(1),     /*  AWAIT FOR SPECIALIZED             30290000
*                                     RESCHEDULING                   */ 30300000
*       5 S84_%%AWCAT BIT(1),     /*  AWAIT FOR CATALOG LOCATE       */ 30310000
*       5 S84_%%AWGAV BIT(1),     /*  AWAIT FOR GENERALIZED SUBTASK     30320000
*                                     TO BECOME AVAILABLE            */ 30330000
*       5 S84_%%AWMVC BIT(1),     /*  AWAIT IS FOR MVS/CI            */ 30340000
*       5 S84_%%AWRCD BIT(1),     /*  AWAIT is described by a reason    30350000
*                                     code (see IATYAWR)             */ 30360000
*       5 *           BIT(1),     /*  Reserved                       */ 30370000
*/*------------------------------------------------------------------*/ 30380000
*/*        FCT AWAIT FLAG TWO                                        */ 30390000
*/*------------------------------------------------------------------*/ 30400000
*     3 S84_%%AWFL2 BIT(8),       /* FCT AWAIT FLAG 2                */ 30410000
*       5 S84_%%AWSTD BIT(1),     /*  AWAIT IS STANDARD AWAIT        */ 30420000
*       5 S84_%%AWALD BIT(1),     /*  AWAIT FOR ALOAD OF A MODULE    */ 30430000
*       5 S84_%%AWFDB BIT(1),     /*  AWAIT FOR FDB I/O              */ 30440000
*       5 S84_%%AWSDM BIT(1),     /*  AWAIT FOR SDM                  */ 30450000
*       5 S84_%%AWENQ BIT(1),     /*  AWAIT FOR AENQ ON A RESOURCE   */ 30460000
*       5 S84_%%AWCNB BIT(1),     /*  AWAIT FOR CONSOLE BUFFERS      */ 30470000
*       5 S84_%%AWUNK BIT(1),     /*  AWAIT IS UNKNOWN               */ 30480000
*       5 *           BIT(1),     /*  Reserved                       */ 30490000
*/*------------------------------------------------------------------*/ 30500000
*/*        FCT AWAIT FLAG THREE                                      */ 30510000
*/*------------------------------------------------------------------*/ 30520000
*     3 S84_%%AWFL3 BIT(8),       /* FCT AWAIT FLAG 3                */ 30530000
*       5 *           BIT(6),     /*  Reserved                       */ 30540000
*       5 S84_%%AWCTS BIT(1),     /*  AWAIT FOR CATALOG SETUP        */ 30550000
*       5 S84_%%AWLCS BIT(1),     /*  AWAIT FOR LOCATE SCHEDULE      */ 30560000
*     3 *           FIXED(8),     /* Reserved                        */ 30570000
*                                                                       30580000
*     3 S84_%%AWUSE FIXED(31),    /* AWAIT IN USE COUNT              */ 30590000
*     3 S84_%%AWPA  FIXED(31),    /* COUNT FOR AWAIT POSTED-ACTIVE   */ 30600000
*     3 S84_%%AWPNA FIXED(31),    /* COUNT FOR AWAIT POSTED-NOT         30610000
*                                    ACTIVE                          */ 30620000
*     3 S84_%%AWNP  FIXED(31),    /* COUNT FOR AWAIT NOT POSTED      */ 30630000
*     3 S84_%%AWAVG FIXED(31),    /* AVERAGE AWAIT DURATION TIME     */ 30640000
*     3 S84_%%AWTOT FIXED(31),    /* TOTAL AWAIT DURATION TIME       */ 30650000
*     3 S84_%%AWMAX FIXED(31),    /* MAXIMUM AWAIT DURATION TIME     */ 30660000
*     3 S84_%%AWMOD CHAR(8),      /* MODULE NAME FOR MAXIMUM AWAIT   */ 30670000
*     3 S84_%%AWDIS FIXED(31),    /* MODULE DISPLACEMENT TO MAXIMUM     30680000
*                                    AWAIT                           */ 30690000
*     3 *           CHAR(8),      /* RESERVED FOR DEVELOPMENT        */ 30700000
*/********************************************************************/ 30710000
*/*  Union point for FCT AWAIT entries                               */ 30720000
*/********************************************************************/ 30730000
*     3 *           UNION,        /* Union point for AWAIT entries   */ 30740000
*/*------------------------------------------------------------------*/ 30750000
*/*        FOR STANDARD AWAIT (WHEN R84AWFL2 = X'80')                */ 30760000
*/*------------------------------------------------------------------*/ 30770000
*      4 * ,                      /* Standard AWAIT entry            */ 30780000
*       5 S84_%%STDAW CHAR(8),    /* STANDARD AWAIT NAME             */ 30790000
*       5 S84_%%STDRS CHAR(12),   /* RESERVED FOR DEVELOPMENT        */ 30800000
*/*------------------------------------------------------------------*/ 30810000
*/*        FOR ALOAD AWAIT (WHEN R84AWFL2 = X'40')                   */ 30820000
*/*------------------------------------------------------------------*/ 30830000
*      4 * ,                      /* ALOAD entry                     */ 30840000
*       5 S84_%%MODNM CHAR(8),    /* MODULE NAME                     */ 30850000
*       5 S84_%%MODRS CHAR(12),   /* RESERVED FOR DEVELOPMENT        */ 30860000
*/*------------------------------------------------------------------*/ 30870000
*/*        FOR FDB AWAIT (WHEN R84AWFL2 = X'20')                     */ 30880000
*/*------------------------------------------------------------------*/ 30890000
*      4 * ,                      /* FDB AWAIT entry                 */ 30900000
*       5 S84_%%FDBIO CHAR(6),    /* INPUT/OUTPUT FDB                */ 30910000
*       5 S84_%%FDBRF CHAR(3),    /* MRF OR SRF                      */ 30920000
*       5 *           CHAR(1),    /* UNUSED                          */ 30930000
*       5 S84_%%FDBTY CHAR(3),    /* I/O OR BLANKS                   */ 30940000
*       5 S84_%%FDBRS CHAR(7),    /* RESERVED FOR DEVELOPMENT        */ 30950000
*/*------------------------------------------------------------------*/ 30960000
*/*        FOR SDM AWAIT (WHEN R84AWFL2 = X'10')                     */ 30970000
*/*------------------------------------------------------------------*/ 30980000
*      4 * ,                      /* SDM entry                       */ 30990000
*       5 S84_%%SDMTY CHAR(20),   /* SDM AWAIT TYPE, BUFFERS OR FILE    31000000
*                                    DIRECTORY                       */ 31010000
*/*------------------------------------------------------------------*/ 31020000
*/*        FOR AENQ AWAIT (WHEN R84AWFL2 = X'08')                    */ 31030000
*/*------------------------------------------------------------------*/ 31040000
*      4 * ,                      /* AENQ entry                      */ 31050000
*       5 S84_%%ENQRN CHAR(8),    /* AENQ RESOURCE NAME              */ 31060000
*       5 S84_%%ENQRS CHAR(12),   /* RESERVED FOR DEVELOPMENT        */ 31070000
*/*------------------------------------------------------------------*/ 31080000
*/*        FOR CONSOLE BUFFERS AWAIT (WHEN R84AWFL2 = X'04')         */ 31090000
*/*------------------------------------------------------------------*/ 31100000
*      4 * ,                      /* Console buffers AWAIT entry     */ 31110000
*       5 S84_%%CNBTY CHAR(8),    /* CONSOLE BUFFERS AWAIT TYPE      */ 31120000
*       5 S84_%%CNBRS CHAR(12),   /* RESERVED FOR DEVELOPMENT        */ 31130000
*/*------------------------------------------------------------------*/ 31140000
*/*        For AWAITs when an AWAIT reason code is used to describe  */ 31150000
*/*        the AWAIT (when R84AWFL1 = R84AWRCD).                     */ 31160000
*/*------------------------------------------------------------------*/ 31170000
*      4 * ,                      /* Console buffers AWAIT entry     */ 31180000
*       5 S84_%%AWRSN FIXED(16),  /* AWAIT reason code               */ 31190000
*       5 S84_%%AWRSV FIXED(8),   /* Reserved for development        */ 31200000
*       5 S84_%%AWDLN FIXED(8),   /* AWAIT data length or zero       */ 31210000
*       5 S84_%%AWDAT CHAR(16),   /* Up to 16 bytes of AWAIT            31220000
*                                      related data or zeroes        */ 31230000
*/*------------------------------------------------------------------*/ 31240000
*/*        FOR UNKNOWN AWAIT (WHEN R84AWFL2 = X'02')                 */ 31250000
*/*------------------------------------------------------------------*/ 31260000
*      4 * ,                      /* Console buffers AWAIT entry     */ 31270000
*       5 S84_%%AWMSK FIXED(8),   /* AWAIT MASK                      */ 31280000
*       5 *           CHAR(3),    /* UNUSED                          */ 31290000
*       5 S84_%%AWADR FIXED(31),  /* AWAIT ADDRESS                   */ 31300000
*       5 S84_%%AWARS CHAR(12);   /* RESERVED FOR DEVELOPMENT        */ 31310000
*/*------------------------------------------------------------------*/ 31320000
*/*  Length of various FCT AWAIT entries                             */ 31330000
*/*------------------------------------------------------------------*/ 31340000
* DCL S84_%%STDSZ FIXED(31) CONSTANT(Offset(S84_%%STDRS)+               31350000
*                                    Length(S84_%%STDRS));              31360000
* DCL S84_%%MODSZ FIXED(31) CONSTANT(Offset(S84_%%MODRS)+               31370000
*                                    Length(S84_%%MODRS));              31380000
* DCL S84_%%FDBSZ FIXED(31) CONSTANT(Offset(S84_%%FDBRS)+               31390000
*                                    Length(S84_%%FDBRS));              31400000
* DCL S84_%%SDMSZ FIXED(31) CONSTANT(Offset(S84_%%SDMTY)+               31410000
*                                    Length(S84_%%SDMTY));              31420000
* DCL S84_%%ENQSZ FIXED(31) CONSTANT(Offset(S84_%%ENQRS)+               31430000
*                                    Length(S84_%%ENQRS));              31440000
* DCL S84_%%CNBSZ FIXED(31) CONSTANT(Offset(S84_%%CNBRS)+               31450000
*                                    Length(S84_%%CNBRS));              31460000
* DCL S84_%%AWCSZ FIXED(31) CONSTANT(Offset(S84_%%AWDAT)+               31470000
*                                    Length(S84_%%AWDAT));              31480000
* DCL S84_%%AWSZ1 FIXED(31) CONSTANT(Offset(S84_%%AWARS)+               31490000
*                                    Length(S84_%%AWARS));              31500000
*                                                                       31510000
*% IF IAZSMF84_SUBTYPE='ALL'    %THEN %GOTO SUBTYP2;                    31520000
*% IF IAZSMF84_SUBTYPE='ALLJ3'  %THEN %GOTO SUBTYP2;                    31530000
*% IF IAZSMF84_SUBTYPE='ALLJES' %THEN %GOTO SUBTYP2;                    31540000
*% IF IAZSMF84_SUBTYPE=''       %THEN %GOTO SUBTYP2;                    31550000
*% GOTO SUBDONE;                                                        31560000
*%SUBTYP2:;                                                             31570000
* @EJECT;                                                               31580000
*/********************************************************************/ 31590000
*/*                                                                  */ 31600000
*/*   RELOCATE BLOCK FOR SUBTYPE 2 - FCT SUMMARY AND HIGHLIGHT DATA  */ 31610000
*/*                                                                  */ 31620000
*/*   THERE ARE 3 DATA SECTION:  1) FCT SUMMARY, 2) FCT AWAIT AND    */ 31630000
*/*   HIGHLIGHT, 3) JES3 WAIT ANALYSIS                               */ 31640000
*/*                                                                  */ 31650000
*/********************************************************************/ 31660000
* @SPACE (1);                                                           31670000
*/********************************************************************/ 31680000
*/*                                                                  */ 31690000
*/*        SUBTYPE 2  --  HEADER                                     */ 31700000
*/*                                                                  */ 31710000
*/********************************************************************/ 31720000
*                                                                       31730000
*   DCL 1 SMF84HR2 BASED(Addr(SMF84HDR)+SMF84J1O),                      31740000
*     3 S84_%%FCTNM FIXED(31),    /* NUMBER OF FCT ENTRIES           */ 31750000
*     3 S84_%%FSMLN FIXED(31),    /* LENGTH OF THE FCT SUMMARY          31760000
*                                    SECTION                         */ 31770000
*     3 S84_%%FSMOF FIXED(31),    /* OFFSET TO THE FIRST FCT SUMMARY    31780000
*                                    ENTRY                           */ 31790000
*     3 S84_%%FAHOF FIXED(31),    /* OFFSET OF THE FCT AWAIT AND        31800000
*                                    HIGHLIGHT SECTION               */ 31810000
*     3 S84_%%WAITO FIXED(31),    /* OFFSET OF THE JES3 WAIT ANALYSIS   31820000
*                                    SECTION                         */ 31830000
*     3 S84_%%S2FLG BIT(8),       /* SUBTYPE-2 HEADER FLAG           */ 31840000
*       5 S84_%%SFCT  BIT(1),     /*  FCT SUMMARY AND HIGHLIGHT         31850000
*                                     SEGMENT                        */ 31860000
*       5 S84_%%WAIT  BIT(1),     /*  WAIT ANALYSIS SEGMENT          */ 31870000
*       5 *           BIT(6),     /*  Reserved                       */ 31880000
*     3 *           CHAR(3);      /* RESERVED FOR DEVELOPMENT        */ 31890000
* DCL S84_%%FSSZ1 FIXED(31) CONSTANT(Length(SMF84HR2));  /*             31900000
*                                           Len of subtype 2 header  */ 31910000
* @SPACE (1);                                                           31920000
*/********************************************************************/ 31930000
*/*        SUBTYPE 2  --  FCT SUMMARY SECTION                        */ 31940000
*/*                                                                  */ 31950000
*/*   THE FOLLOWING IS A MAPPING FOR EACH FCT SUMMARY ENTRY          */ 31960000
*/********************************************************************/ 31970000
* DCL 1 S84_%%FCTSM BASED,                                              31980000
*     3 S84_%%FSNUM FIXED(31),    /* FCT SEQUENCE NUMBER             */ 31990000
*     3 S84_%%FSNAM CHAR(8),      /* DSP NAME                        */ 32000000
*     3 S84_%%DEV   CHAR(8),      /* DEVICE                          */ 32010000
*     3 S84_%%FSPRT FIXED(16),    /* FCT PRIORITY                    */ 32020000
*     3 *           FIXED(16),    /* RESERVED FOR DEVELOPMENT        */ 32030000
*     3 S84_%%FCHN  FIXED(31),    /* FCT ON FCT CHAIN COUNT          */ 32040000
*     3 S84_%%FSNUC FIXED(31),    /* FCT IN IATNUC MODE COUNT        */ 32050000
*     3 S84_%%FSAUX FIXED(31),    /* FCT IN IATAUX MODE COUNT        */ 32060000
*     3 S84_%%FNPA  FIXED(31),    /* COUNT FOR FCT POSTED-ACTIVE IN     32070000
*                                    IATNUC                          */ 32080000
*     3 S84_%%FAPA  FIXED(31),    /* COUNT FOR FCT POSTED-ACTIVE IN     32090000
*                                    IATAUX                          */ 32100000
*     3 S84_%%FNPNA FIXED(31),    /* COUNT FOR FCT POSTED-NOT-ACTIVE    32110000
*                                    IN IATNUC                       */ 32120000
*     3 S84_%%FAPNA FIXED(31),    /* COUNT FOR FCT POSTED-NOT-ACTIVE    32130000
*                                    IN IATAUX                       */ 32140000
*     3 S84_%%FNNP  FIXED(31),    /* COUNT FOR FCT NOT-POSTED IN        32150000
*                                    IATNUC                          */ 32160000
*     3 S84_%%FANP  FIXED(31),    /* COUNT FOR FCT NOT-POSTED IN        32170000
*                                    IATAUX                          */ 32180000
*     3 S84_%%FNSOS FIXED(31),    /* COUNT FOR FCT IN-OS-WAIT IN        32190000
*                                    IATNUC                          */ 32200000
*     3 S84_%%FASOS FIXED(31);    /* COUNT FOR FCT IN-OS-WAIT IN        32210000
*                                    IATAUX                          */ 32220000
* DCL S84_%%FESZ1 FIXED(31) CONSTANT(Length(S84_%%FCTSM));  /*          32230000
*                                           Len of FCT summary entry */ 32240000
* @SPACE (1);                                                           32250000
*/********************************************************************/ 32260000
*/*                                                                  */ 32270000
*/*        SUBTYPE 2  --  FCT AND AWAIT HIGHLIGHT SECTION            */ 32280000
*/*                                                                  */ 32290000
*/********************************************************************/ 32300000
*   DCL 1 SMF84FAH BASED(Addr(SMF84HR2)+S84_%%FAHOF),                   32310000
*     3 S84_%%FHLNG FIXED(31),    /* LENGTH OF THE FCT AND AWAIT        32320000
*                                    HIGHLIGHT SECTION               */ 32330000
*/********************************************************************/ 32340000
*/*   THE 5 MOST ACTIVE FCT S IN IATNUC.                             */ 32350000
*/*   EACH ENTRY IS MAPPED BY R845MOST.                              */ 32360000
*/********************************************************************/ 32370000
*     3 S84_%%N1MA(5)  FIXED(31), /* 1ST MOST ACTIVE FCT IN IATNUC   */ 32380000
*     3 S84_%%N2MA(5)  FIXED(31), /* 2ND MOST ACTIVE FCT IN IATNUC   */ 32390000
*     3 S84_%%N3MA(5)  FIXED(31), /* 3RD MOST ACTIVE FCT IN IATNUC   */ 32400000
*     3 S84_%%N4MA(5)  FIXED(31), /* 4TH MOST ACTIVE FCT IN IATNUC   */ 32410000
*     3 S84_%%N5MA(5)  FIXED(31), /* 5TH MOST ACTIVE FCT IN IATNUC   */ 32420000
*/********************************************************************/ 32430000
*/*   THE 5 MOST ACTIVE FCT S IN IATAUX.                             */ 32440000
*/*   EACH ENTRY IS MAPPED BY R845MOST.                              */ 32450000
*/********************************************************************/ 32460000
*     3 S84_%%A1MA(5)  FIXED(31), /* 1ST MOST ACTIVE FCT IN IATAUX   */ 32470000
*     3 S84_%%A2MA(5)  FIXED(31), /* 2ND MOST ACTIVE FCT IN IATAUX   */ 32480000
*     3 S84_%%A3MA(5)  FIXED(31), /* 3RD MOST ACTIVE FCT IN IATAUX   */ 32490000
*     3 S84_%%A4MA(5)  FIXED(31), /* 4TH MOST ACTIVE FCT IN IATAUX   */ 32500000
*     3 S84_%%A5MA(5)  FIXED(31), /* 5TH MOST ACTIVE FCT IN IATAUX   */ 32510000
*/********************************************************************/ 32520000
*/*   THE 5 MOST POSTED-NOT ACTIVE FCT S IN IATNUC.                  */ 32530000
*/*   EACH ENTRY IS MAPPED BY R845MOST.                              */ 32540000
*/********************************************************************/ 32550000
*     3 S84_%%N1PNA(5) FIXED(31), /* 1ST MOST POSTED-NOT-ACTIVE FCT  */ 32560000
*     3 S84_%%N2PNA(5) FIXED(31), /* 2ND MOST POSTED-NOT-ACTIVE FCT  */ 32570000
*     3 S84_%%N3PNA(5) FIXED(31), /* 3RD MOST POSTED-NOT-ACTIVE FCT  */ 32580000
*     3 S84_%%N4PNA(5) FIXED(31), /* 4TH MOST POSTED-NOT-ACTIVE FCT  */ 32590000
*     3 S84_%%N5PNA(5) FIXED(31), /* 5TH MOST POSTED-NOT-ACTIVE FCT  */ 32600000
*/********************************************************************/ 32610000
*/*   THE 5 MOST POSTED-NOT ACTIVE FCT S IN IATAUX.                  */ 32620000
*/*   EACH ENTRY IS MAPPED BY R845MOST.                              */ 32630000
*/********************************************************************/ 32640000
*     3 S84_%%A1PNA(5) FIXED(31), /* 1ST MOST POSTED-NOT-ACTIVE FCT  */ 32650000
*     3 S84_%%A2PNA(5) FIXED(31), /* 2ND MOST POSTED-NOT-ACTIVE FCT  */ 32660000
*     3 S84_%%A3PNA(5) FIXED(31), /* 3RD MOST POSTED-NOT-ACTIVE FCT  */ 32670000
*     3 S84_%%A4PNA(5) FIXED(31), /* 4TH MOST POSTED-NOT-ACTIVE FCT  */ 32680000
*     3 S84_%%A5PNA(5) FIXED(31), /* 5TH MOST POSTED-NOT-ACTIVE FCT  */ 32690000
*/********************************************************************/ 32700000
*/*   THE 5 MOST IN-OS-WAIT FCT S IN IATNUC                          */ 32710000
*/*   EACH ENTRY IS MAPPED BY R845MOST.                              */ 32720000
*/********************************************************************/ 32730000
*     3 S84_%%N1OSW(5) FIXED(31), /* 1ST MOST IN-OS-WAIT FCT IN NUC  */ 32740000
*     3 S84_%%N2OSW(5) FIXED(31), /* 2ND MOST IN-OS-WAIT FCT IN NUC  */ 32750000
*     3 S84_%%N3OSW(5) FIXED(31), /* 3RD MOST IN-OS-WAIT FCT IN NUC  */ 32760000
*     3 S84_%%N4OSW(5) FIXED(31), /* 4TH MOST IN-OS-WAIT FCT IN NUC  */ 32770000
*     3 S84_%%N5OSW(5) FIXED(31), /* 5TH MOST IN-OS-WAIT FCT IN NUC  */ 32780000
*/********************************************************************/ 32790000
*/*   THE 5 MOST IN-OS-WAIT FCT S IN IATAUX                          */ 32800000
*/*   EACH ENTRY IS MAPPED BY R845MOST.                              */ 32810000
*/********************************************************************/ 32820000
*     3 S84_%%A1OSW(5) FIXED(31), /* 1ST MOST IN-OS-WAIT FCT IN AUX  */ 32830000
*     3 S84_%%A2OSW(5) FIXED(31), /* 2ND MOST IN-OS-WAIT FCT IN AUX  */ 32840000
*     3 S84_%%A3OSW(5) FIXED(31), /* 3RD MOST IN-OS-WAIT FCT IN AUX  */ 32850000
*     3 S84_%%A4OSW(5) FIXED(31), /* 4TH MOST IN-OS-WAIT FCT IN AUX  */ 32860000
*     3 S84_%%A5OSW(5) FIXED(31), /* 5TH MOST IN-OS-WAIT FCT IN AUX  */ 32870000
*/********************************************************************/ 32880000
*/*   THE 10 BIGGEST JES3 AWAIT BOTTLENECKS                          */ 32890000
*/*   EACH ENTRY IS MAPPED BY R84BNECK.                              */ 32900000
*/********************************************************************/ 32910000
*     3 S84_%%AW1BN(12) FIXED(31), /* 1ST BIGGEST AWAIT BOTTLENECK   */ 32920000
*     3 S84_%%AW2BN(12) FIXED(31), /* 2ND BIGGEST AWAIT BOTTLENECK   */ 32930000
*     3 S84_%%AW3BN(12) FIXED(31), /* 3RD BIGGEST AWAIT BOTTLENECK   */ 32940000
*     3 S84_%%AW4BN(12) FIXED(31), /* 4TH BIGGEST AWAIT BOTTLENECK   */ 32950000
*     3 S84_%%AW5BN(12) FIXED(31), /* 5TH BIGGEST AWAIT BOTTLENECK   */ 32960000
*     3 S84_%%AW6BN(12) FIXED(31), /* 6TH BIGGEST AWAIT BOTTLENECK   */ 32970000
*     3 S84_%%AW7BN(12) FIXED(31), /* 7TH BIGGEST AWAIT BOTTLENECK   */ 32980000
*     3 S84_%%AW8BN(12) FIXED(31), /* 8TH BIGGEST AWAIT BOTTLENECK   */ 32990000
*     3 S84_%%AW9BN(12) FIXED(31), /* 9TH BIGGEST AWAIT BOTTLENECK   */ 33000000
*     3 S84_%%AWABN(12) FIXED(31), /* 10TH BIGGEST AWAIT BOTTLENECK  */ 33010000
*/********************************************************************/ 33020000
*/*   DMJA FCT SUMMARY SECTION                                       */ 33030000
*/********************************************************************/ 33040000
*     3 S84_%%DMMXA FIXED(31),    /* MAXIMUM ACTIVE DMJA FCTS           33050000
*                                    ALLOWED                         */ 33060000
*     3 S84_%%DMMN  FIXED(31),    /* MINIMUM NUMBER OF ACTIVE DMJA      33070000
*                                    FCTS                            */ 33080000
*     3 S84_%%DMMX  FIXED(31),    /* MAXIMUM NUMBER OF ACTIVE DMJA      33090000
*                                    FCTS                            */ 33100000
*     3 S84_%%DMAV  FIXED(31);    /* AVERAGE NUMBER OF ACTIVE DMJA      33110000
*                                    FCTS                            */ 33120000
* DCL S84_%%FHSZ1 FIXED(31) CONSTANT(Length(SMF84FAH));  /*             33130000
*                                           Len of FCT AWAIT            33140000
*                                           highlight entry          */ 33150000
*/********************************************************************/ 33160000
*/*   EACH OF THE 5 MOST ACTIVE, 5 MOST POSTED-NOT-ACTIVE AND 5 MOST */ 33170000
*/*   IN-OS-WAIT ENTRIES CAN BE MAPPED BY THE FOLLOWING FORMAT.      */ 33180000
*/*                                                                  */ 33190000
*/*   NOTE:  R84TPA IS NOT USED FOR IN-OS-WAIT AND POSTED-NOT-       */ 33200000
*/*          ACTIVE                                                  */ 33210000
*/********************************************************************/ 33220000
* DCL 1 S84_%%5MOST BASED,                                              33230000
*     3 S84_%%FSQNM FIXED(31),    /* FCT SEQUENCE NUMBER             */ 33240000
*     3 S84_%%FNAME CHAR(8),      /* DSP NAME                        */ 33250000
*     3 S84_%%TPA   FIXED(31),    /* TASK COUNT                      */ 33260000
*     3 S84_%%FPA   FIXED(31);    /* FCT COUNT                       */ 33270000
* DCL S84_%%MOSZ1 FIXED(31) CONSTANT(Length(S84_%%5MOST));  /*          33280000
*                                           Len of "5 most ..."         33290000
*                                           entry                    */ 33300000
*/********************************************************************/ 33310000
*/*   EACH OF THE 10 BIGGEST JES3 AWAIT BOTTLENECK ENTRY CAN BE      */ 33320000
*/*   MAPPED BY THE FOLLOWING FORMAT.                                */ 33330000
*/********************************************************************/ 33340000
* DCL 1 S84_%%BNECK BASED,                                              33350000
*     3 S84_%%BSEQN FIXED(31),    /* FCT SEQUENCE NUMBER             */ 33360000
*     3 S84_%%BNAME CHAR(8),      /* DSP NAME                        */ 33370000
*     3 S84_%%BTSK  CHAR(8),      /* TASK NAME                       */ 33380000
*     3 S84_%%BADAT CHAR(8),      /* Up to 8 bytes of AWAIT data     */ 33390000
*     3 S84_%%BRSN  BIT(8),       /* REASON FOR AWAITING             */ 33400000
*       5 S84_%%BENQ  BIT(1),     /*  AENQ                           */ 33410000
*       5 S84_%%BSDMF BIT(1),     /*  SDM - WAITING FOR FILE            33420000
*                                     DIRECTORY                      */ 33430000
*       5 S84_%%BSDMB BIT(1),     /*  SDM - WAITING FOR JSAM BUFFERS */ 33440000
*       5 S84_%%BCNB  BIT(1),     /*  CONSOLE BUFFERS                */ 33450000
*       5 S84_%%BCAT  BIT(1),     /*  CATALOG LOCATE                 */ 33460000
*       5 S84_%%BLOCS BIT(1),     /*  LOCATE SCHEDULE                */ 33470000
*       5 S84_%%BAWRC BIT(1),     /*  AWAIT reason code describes       33480000
*                                     the AWAIT bottleneck           */ 33490000
*       5 *           BIT(1),     /*  Reserved                       */ 33500000
*     3 S84_%%BARSN FIXED(16)     /* AWAIT reason code               */ 33510000
*                   BDY(BYTE),                                          33520000
*     3 S84_%%BADLN FIXED(8),     /* AWAIT data length or zero       */ 33530000
*     3 S84_%%BCNNM CHAR(8),      /* Old field name no longer used   */ 33540000
*     3 S84_%%BTOTD FIXED(31),    /* TOTAL AWAIT DURATION TIME       */ 33550000
*     3 S84_%%BMAXD FIXED(31);    /* MAXIMUM AWAIT DURATION TIME     */ 33560000
* DCL S84_%%BNSZ1 FIXED(31) CONSTANT(Length(S84_%%BNECK));  /*          33570000
*                                           Len of AWAIT bottleneck     33580000
*                                           entry                    */ 33590000
*/********************************************************************/ 33600000
*/*                                                                  */ 33610000
*/*        SUBTYPE 2  --  JES3 WAIT ANALYSIS SECTON                  */ 33620000
*/*                                                                  */ 33630000
*/********************************************************************/ 33640000
*   DCL 1 SMF84WT  BASED(Addr(SMF84HR2)+S84_%%WAITO),                   33650000
*     3 S84_%%WTLNG FIXED(31),    /* LENGTH OF THE JES3 WAIT            33660000
*                                    ANALYSIS SECTION                */ 33670000
*     3 S84_%%WTNUM FIXED(31),    /* TOTAL NUMBER OF WAIT ANALYSIS      33680000
*                                    ENTRIES                         */ 33690000
*     3 S84_%%WTOFF FIXED(31);    /* OFFSET OF THE 1ST ENTRY         */ 33700000
* DCL S84_%%WTSZ1 FIXED(31) CONSTANT(Length(SMF84WT));  /*              33710000
*                                           Len of AWAIT WAIT           33720000
*                                           analysis section         */ 33730000
*/********************************************************************/ 33740000
*/*   EACH IATNUC AND IATAUX WAIT ANALYSIS ENTRY CAN BE MAPPED BY    */ 33750000
*/*   THE FOLLOWING FORMAT.                                          */ 33760000
*/********************************************************************/ 33770000
* DCL 1 S84_%%WTNUC BASED,                                              33780000
*     3 S84_%%WTNAM CHAR(8),      /* DSP NAME                        */ 33790000
*     3 S84_%%WTFSN FIXED(31),    /* FCT SEQUENCE NUMBER             */ 33800000
*     3 S84_%%WTTSK CHAR(8),      /* TASK NAME                       */ 33810000
*     3 S84_%%WTFOS FIXED(31),    /* COUNT FOR FCT IN OS WAIT        */ 33820000
*     3 S84_%%WTFLG BIT(8),       /* TYPE OF A WAIT                  */ 33830000
*       5 S84_%%WTPAG BIT(1),     /*  PAGE FAULT                     */ 33840000
*       5 S84_%%WTSVC BIT(1),     /*  SVC WAIT                       */ 33850000
*       5 S84_%%WTLOD BIT(1),     /*  LOAD WAIT                      */ 33860000
*       5 *           BIT(5),     /*  Reserved                       */ 33870000
*     3 *           CHAR(3),      /* RESERVED                        */ 33880000
*     3 * UNION,                                                        33890000
*/********************************************************************/ 33900000
*/*   THE FOLLOWING FIELDS ARE APPLICABLE ONLY TO PAGE FAULT         */ 33910000
*/********************************************************************/ 33920000
*      4 * ,                      /* Page fault entry                */ 33930000
*       5 S84_%%PADR  FIXED(31),  /* ADDRESS OF WHERE THE PAGE FAULT    33940000
*                                    OCCURED                         */ 33950000
*       5 S84_%%PNAM  CHAR(8),    /* MODULE NAME                     */ 33960000
*       5 S84_%%PMOF  FIXED(31),  /* OFFSET INTO THE MODULE          */ 33970000
*       5 S84_%%PCNT  FIXED(31),  /* PAGE FAULT COUNT                */ 33980000
*       5 *(3)        FIXED(31),  /* RESERVED                        */ 33990000
*/********************************************************************/ 34000000
*/*   THE FOLLOWING FIELDS ARE APPLICABLE ONLY TO SVC WAIT           */ 34010000
*/********************************************************************/ 34020000
*      4 * ,                      /* SVC WAIT entry                  */ 34030000
*       5 S84_%%SNUM  FIXED(31),  /* SVC NUMBER                      */ 34040000
*       5 S84_%%SNAM  CHAR(8),    /* SVC NAME                        */ 34050000
*       5 S84_%%SADR  FIXED(31),  /* ADDRESS OF WHERE THE SVC WAIT      34060000
*                                    OCCURED                         */ 34070000
*       5 S84_%%SMNAM CHAR(8),    /* MODULE NAME                     */ 34080000
*       5 S84_%%SMOFS FIXED(31),  /* OFFSET INTO THE MODULE          */ 34090000
*       5 S84_%%SCNT  FIXED(31),  /* SVC COUNT                       */ 34100000
*/********************************************************************/ 34110000
*/*   THE FOLLOWING FIELDS ARE APPLICABLE ONLY TO LOAD WAIT          */ 34120000
*/********************************************************************/ 34130000
*      4 * ,                      /* LOAD WAIT entry                 */ 34140000
*       5 S84_%%LMNAM CHAR(8),    /* LOADING MODULE NAME             */ 34150000
*       5 S84_%%LCNT  FIXED(31),  /* LOAD COUNT                      */ 34160000
*       5 *(5)        FIXED(31);  /* RESERVED                        */ 34170000
* DCL S84_%%WTPS1 FIXED(31) CONSTANT(Offset(S84_%%PCNT)+                34180000
*                                    Length(S84_%%PCNT)+12);            34190000
* DCL S84_%%WTSS1 FIXED(31) CONSTANT(Offset(S84_%%SCNT)+                34200000
*                                    Length(S84_%%SCNT)+0);             34210000
* DCL S84_%%WTLS1 FIXED(31) CONSTANT(Offset(S84_%%LCNT)+                34220000
*                                    Length(S84_%%LCNT)+20);            34230000
*                                                                       34240000
*% IF IAZSMF84_SUBTYPE='ALL'    %THEN %GOTO SUBTYP3;                    34250000
*% IF IAZSMF84_SUBTYPE='ALLJ3'  %THEN %GOTO SUBTYP3;                    34260000
*% IF IAZSMF84_SUBTYPE='ALLJES' %THEN %GOTO SUBTYP3;                    34270000
*% IF IAZSMF84_SUBTYPE=''       %THEN %GOTO SUBTYP3;                    34280000
*% GOTO SUBDONE;                                                        34290000
*%SUBTYP3:;                                                             34300000
* @EJECT;                                                               34310000
*/********************************************************************/ 34320000
*/*                                                                  */ 34330000
*/*   RELOCATE BLOCK FOR SUBTYPE 3 - SPOOL DATA MANAGEMENT SECTION   */ 34340000
*/*                                                                  */ 34350000
*/*   THERE ARE 8 DATA SECTIONS:  1) GENERAL SDM DATA SECTION,       */ 34360000
*/*   2) SPOOL DATA DESCRIBTION SECTION, 3) SPOOL PARTITION DESCRIP- */ 34370000
*/*   TION SECTION, 4) SPOOL SPACE UTILIZATION SNAPSHOT SECTION,     */ 34380000
*/*   5) SINGLE TRACK TABLE SPACE ALLOCATION SNAPSHOT SECTION,       */ 34390000
*/*   6) SPOOL I/O ACTIVITY -- BUFFERS READ AND WRITTEN,             */ 34400000
*/*   7) BUFFERS CHAINING BY SPOOL DATASET SECTION AND 8) MINIMAL/   */ 34410000
*/*   MARGINAL TRACK CONDITION SECTION.                              */ 34420000
*/*                                                                  */ 34430000
*/********************************************************************/ 34440000
* @SPACE (1);                                                           34450000
*/********************************************************************/ 34460000
*/*                                                                  */ 34470000
*/*        SUBTYPE 3  --  GENERAL SDM DATA SECTION                   */ 34480000
*/*                                                                  */ 34490000
*/********************************************************************/ 34500000
*                                                                       34510000
*   DCL 1 SMF84SDM BASED(Addr(SMF84HDR)+SMF84J1O),                      34520000
*     3 S84_%%SDMLN FIXED(31),    /* LENGTH OF THE SDM SECTION       */ 34530000
*     3 S84_%%BUFSZ FIXED(31),    /* SPOOL BUFFER SIZE               */ 34540000
*     3 S84_%%NBFPG FIXED(31),    /* NUMBER OF BUFFERS PER 4K PAGE   */ 34550000
*     3 S84_%%FDENT FIXED(31),    /* FILE DIRECTORY ENTRIES          */ 34560000
*     3 S84_%%SPDSU FIXED(31),    /* NUMBER OF SPOOL DATASETS IN USE */ 34570000
*     3 S84_%%JSAMB FIXED(31),    /* NUMBER OF JSAM BUFFERS          */ 34580000
*     3 S84_%%JSAMT FIXED(31),    /* JSAM THRESHOLD FOR JSAM MINBUF     34590000
*                                    CONDITION                       */ 34600000
*     3 S84_%%PBUFC FIXED(31),    /* NUMBER OF PROTECTED USAM BUFFERS   34610000
*                                    IN CSA                          */ 34620000
*     3 S84_%%PBUFA FIXED(31),    /* NUMBER OF PROTECTED USAM BUFFERS   34630000
*                                    IN AUX                          */ 34640000
*     3 S84_%%UPBUF FIXED(31),    /* NUMBER OF UNPROTECTED USAM         34650000
*                                    BUFFERS PER OPEN USAM DATASET   */ 34660000
*     3 S84_%%MAXB  FIXED(31),    /* MAXIMUM DATA BYTES IN A USAM       34670000
*                                    BUFFERS                         */ 34680000
*     3 S84_%%DSENT FIXED(31),    /* TOTAL NUMBER OF SPOOL DATASET      34690000
*                                    DESCRIPTION ENTRIES             */ 34700000
*     3 S84_%%DSOFF FIXED(31),    /* OFFSET OF THE 1ST SPOOL DATASET    34710000
*                                    DESCRIPTION ENTRY               */ 34720000
*     3 S84_%%PRENT FIXED(31),    /* TOTAL NUMBER OF SPOOL PARTITION    34730000
*                                    DESCRIPTION ENTRIES             */ 34740000
*     3 S84_%%PROFF FIXED(31),    /* OFFSET OF THE 1ST SPOOL PARTITION  34750000
*                                    DESCRIPTION ENTRY               */ 34760000
*     3 S84_%%SUENT FIXED(31),    /* TOTAL NUMBER OF SPOOL SPACE        34770000
*                                    UTILIZATION SNAPSHOT ENTRIES    */ 34780000
*     3 S84_%%SUOFF FIXED(31),    /* ADDRESS OF THE 1ST SPOOL SPACE     34790000
*                                    UTILIZATION SNAPSHOT ENTRY      */ 34800000
*     3 S84_%%STENT FIXED(31),    /* TOTAL NUMBER OF SINGLE TRACK       34810000
*                                    TABLE SPACE ALLOCATION SNAPSHOT    34820000
*                                    ENTRIES                         */ 34830000
*     3 S84_%%STOFF FIXED(31),    /* OFFSET OF THE 1ST SINGLE TRACK     34840000
*                                    TABLE SPACE ALLOCATION SNAPSHOT    34850000
*                                    ENTRY                           */ 34860000
*     3 S84_%%IOENT FIXED(31),    /* TOTAL NUMBER OF SPOOL I/O          34870000
*                                    ACTIVITY -- BUFFER READ AND        34880000
*                                    WRITTEN -- ENTRIES              */ 34890000
*     3 S84_%%IOOFF FIXED(31),    /* OFFSET OF THE 1ST SPOOL I/O        34900000
*                                    ACTIVITY -- BUFFER READ AND        34910000
*                                    WRITTEN ENTRY                   */ 34920000
*     3 S84_%%BCENT FIXED(31),    /* TOTAL NUMBER OF BUFFER CHAINING    34930000
*                                    BY SPOOL DATASET ENTRIES        */ 34940000
*     3 S84_%%BCOFF FIXED(31),    /* OFFSET OF THE 1ST BUFFER CHAINING  34950000
*                                    BY SPOOL DATASET ENTRY          */ 34960000
*/********************************************************************/ 34970000
*/*   SDM EXCEPTIONAL CONDITIONS                                     */ 34980000
*/********************************************************************/ 34990000
*     3 S84_%%JSAMU FIXED(31),    /* COUNT FOR JSAM UNAVAILABLE         35000000
*                                    BUFFERS                         */ 35010000
*     3 S84_%%USAMU FIXED(31),    /* COUNT FOR USAM UNAVAILABLE         35020000
*                                    BUFFERS                         */ 35030000
*     3 S84_%%MMENT FIXED(31),    /* TOTAL NUMBER OF MINIMAL/MARGINAL   35040000
*                                    TRACK CONDITION ENTRIES         */ 35050000
*     3 S84_%%MMOFF FIXED(31),    /* OFFSET OF THE 1ST MINIMAL/MARGINAL 35060000
*                                    TRACK CONDITION ENTRY           */ 35070000
*     3 S84_%%AWBUF FIXED(31),    /* AWAITS OF BUFFERS DURING           35080000
*                                    MONITORING                      */ 35090000
*     3 S84_%%AWEVR FIXED(31);    /* AWAITS OF BUFFERS EVER          */ 35100000
* DCL S84_%%SDSZ1 FIXED(31) CONSTANT(Length(SMF84SDM)); /*              35110000
*                                           Len of general SDM data     35120000
*                                           section                  */ 35130000
*/********************************************************************/ 35140000
*/*                                                                  */ 35150000
*/*        SUBTYPE 3  --  SPOOL DATASET DESCRIPTION SECTION          */ 35160000
*/*                                                                  */ 35170000
*/********************************************************************/ 35180000
*                                                                       35190000
* DCL 1 S84_%%SDMDS BASED,                                              35200000
*     3 S84_%%DSDSN FIXED(16),    /* DATASET NUMBER                  */ 35210000
*     3 S84_%%DSDDN CHAR(8),      /* DDNAME                          */ 35220000
*     3 S84_%%DSPRT CHAR(8),      /* PARTITION NAME                  */ 35230000
*     3 S84_%%DSFLG BIT(8),       /* EXTENT STATUS FLAG              */ 35240000
*       5 S84_%%DSUNV BIT(1),     /*  EXTENT UNAVAILABLE             */ 35250000
*       5 S84_%%DSDRN BIT(1),     /*  EXTENT MOVED TO DRAINING          35260000
*                                     PARTITION                      */ 35270000
*       5 S84_%%DSHLD BIT(1),     /*  EXTENT HELD                    */ 35280000
*       5 S84_%%DSUSE BIT(1),     /*  EXTENT IN USE                  */ 35290000
*       5 *           BIT(4),     /*  Reserved                       */ 35300000
*     3 S84_%%DSDVA CHAR(3),      /* DEVICE ADDRESS                  */ 35310000
*     3 S84_%%DSVLS CHAR(6),      /* VOLSER                          */ 35320000
*     3 S84_%%DSDVT CHAR(7),      /* DEVICE TYPE                     */ 35330000
*     3 *           FIXED(8),     /* UNUSED                          */ 35340000
*     3 S84_%%DSLWA FIXED(31),    /* Low address                     */ 35350000
*       5 S84_%%DSLWC FIXED(16),  /* Low cylinder, lower portion     */ 35360000
*       5 S84_%%DSLWH FIXED(16),  /* Low head and low cyl, upper        35370000
*                                    portion                         */ 35380000
*     3 S84_%%DSHIA FIXED(31),    /* High address                    */ 35390000
*       5 S84_%%DSHIC FIXED(16),  /* High cylinder, lower portion    */ 35400000
*       5 S84_%%DSHIH FIXED(16),  /* High head and high cyl, upper      35410000
*                                    portion                         */ 35420000
*     3 S84_%%DSRT  FIXED(16),    /* RECORDS PER TRACKS              */ 35430000
*     3 S84_%%DSRTG FIXED(16),    /* RECORDS PER TRACK GROUP         */ 35440000
*     3 S84_%%DSBUF FIXED(31),    /* BUFFER SIZE IN BYTES            */ 35450000
*     3 S84_%%DSDV4 CHAR(4);      /* 4-Digit Device Address          */ 35460000
* DCL S84_%%DSSZ1 FIXED(31) CONSTANT(Length(S84_%%SDMDS)); /*           35470000
*                                           Len of spool data set       35480000
*                                           description entry        */ 35490000
*/********************************************************************/ 35500000
*/*                                                                  */ 35510000
*/*        SUBTYPE 3  --  SPOOL PARTITION DESCRIPTION SECTION        */ 35520000
*/*                                                                  */ 35530000
*/********************************************************************/ 35540000
*/********************************************************************/ 35550000
*/*   THE FOLLOWING IS A MAPPING FOR SPOOL PARTITION DESCRIPTION     */ 35560000
*/*   ENTRY                                                          */ 35570000
*/********************************************************************/ 35580000
*                                                                       35590000
* DCL 1 S84_%%SDMPR BASED,                                              35600000
*     3 S84_%%PRPRT CHAR(8),      /* PARTITION NAME                  */ 35610000
*     3 S84_%%PRMIN FIXED(8),     /* MINIMAL SPOOL THRESHOLD %       */ 35620000
*     3 S84_%%PRMRG FIXED(8),     /* MARGINAL SPOOL THRESHOLD %      */ 35630000
*     3 S84_%%PROVP CHAR(8),      /* OVERFLOW PARTITION NAME         */ 35640000
*     3 S84_%%PRFLG BIT(8),       /* SPART ENTRY FLAG FIELD          */ 35650000
*       5 S84_%%PRDEF BIT(1),     /*  DEFAULT PARTITION INDICATOR    */ 35660000
*       5 *           BIT(7),     /*  Reserved                       */ 35670000
*     3 *           FIXED(8);     /* RESERVED FOR DEVELOPMENT        */ 35680000
* DCL S84_%%PRSZ1 FIXED(31) CONSTANT(Length(S84_%%SDMPR)); /*           35690000
*                                           Len of spool partition      35700000
*                                           description entry        */ 35710000
*/********************************************************************/ 35720000
*/*                                                                  */ 35730000
*/*        SUBTYPE 3  --  SPOOL SPACE UTILIZATION SNAPSHOT SECTION   */ 35740000
*/*                                                                  */ 35750000
*/********************************************************************/ 35760000
*/********************************************************************/ 35770000
*/*   THE FOLLOWING IS A MAPPING FOR SPOOL SPACE UTILIZATION         */ 35780000
*/*   SNAPSHOT ENTRY                                                 */ 35790000
*/********************************************************************/ 35800000
*                                                                       35810000
* DCL 1 S84_%%SDMSU BASED,                                              35820000
*     3 S84_%%SUPRT CHAR(8),      /* PARTITION NAME                  */ 35830000
*     3 S84_%%SUDDN CHAR(8),      /* DDNAME                          */ 35840000
*     3 S84_%%SUDEF FIXED(31),    /* TRACK GROUPS DEFINED            */ 35850000
*     3 S84_%%SUALO FIXED(31);    /* TRACK GROUPS ALLOCATED          */ 35860000
* DCL S84_%%SUSZ1 FIXED(31) CONSTANT(Length(S84_%%SDMSU)); /*           35870000
*                                           Len of spool space          35880000
*                                           utilization snapshot     */ 35890000
*/********************************************************************/ 35900000
*/*                                                                  */ 35910000
*/*        SUBTYPE 3  --  SINGLE TRACK TABLE SPACE UTILIZATION       */ 35920000
*/*                       SECTION                                    */ 35930000
*/*                                                                  */ 35940000
*/********************************************************************/ 35950000
*/********************************************************************/ 35960000
*/*   THE FOLLOWING IS A MAPPING FOR SINGLE TRACK TABLE SPACE        */ 35970000
*/*   UTILIZATION ENTRY                                              */ 35980000
*/********************************************************************/ 35990000
*                                                                       36000000
* DCL 1 S84_%%SDMST BASED,                                              36010000
*     3 S84_%%STDSN FIXED(16),    /* DATASET NUMBER                  */ 36020000
*     3 *           FIXED(16),    /* RESERVED FOR DEVELOPMENT        */ 36030000
*     3 S84_%%STDDN CHAR(8),      /* DDNAME                          */ 36040000
*     3 S84_%%STLWA FIXED(31),    /* Low address                     */ 36050000
*       5 S84_%%STLWC FIXED(16),  /* Low cylinder, lower portion     */ 36060000
*       5 S84_%%STLWH FIXED(16),  /* Low head and low cyl, upper        36070000
*                                    portion                         */ 36080000
*     3 S84_%%STHIA FIXED(31),    /* High address                    */ 36090000
*       5 S84_%%STHIC FIXED(16),  /* High cylinder, lower portion    */ 36100000
*       5 S84_%%STHIH FIXED(16),  /* High head and high cyl, upper      36110000
*                                    portion                         */ 36120000
*     3 S84_%%STDEF FIXED(31),    /* RECORDS DEFINED                 */ 36130000
*     3 S84_%%STALO FIXED(31),    /* RECORDS ALLOCATED               */ 36140000
*     3 S84_%%STFLG BIT(8),       /* SINGLE TRACK TABLE FLAG         */ 36150000
*       5 S84_%%STEXP BIT(1),     /*  EXPANSION INDICATOR FOR ANY OR    36160000
*                                     ALL SUBSEQUENT                 */ 36170000
*       5 *           BIT(7),     /*  Reserved                       */ 36180000
*     3 *           CHAR(3);      /* RESERVED FOR DEVELOPMENT        */ 36190000
* DCL S84_%%STSZ1 FIXED(31) CONSTANT(Length(S84_%%SDMST)); /*           36200000
*                                           Len of single track space   36210000
*                                           utilization              */ 36220000
*/********************************************************************/ 36230000
*/*                                                                  */ 36240000
*/*        SUBTYPE 3  --  SPOOL I/O ACTIVITY SECTION                 */ 36250000
*/*                                                                  */ 36260000
*/* NOTE: TO CALCULATE BUFFERS READ AND WRITTEN PER SECOND, USE      */ 36270000
*/*       THE FOLLOWING FORMULA:                                     */ 36280000
*/*             NUMBER OF BUFFERS READ/WRITTEN PER SECOND = I/O      */ 36290000
*/*             COUNT / JMF REPORT INTERVAL LENGTH IN SECONDS        */ 36300000
*/********************************************************************/ 36310000
*/********************************************************************/ 36320000
*/*   THE FOLLOWING IS A MAPPING FOR SPOOL I/O ACTIVITY ENTRY        */ 36330000
*/********************************************************************/ 36340000
*                                                                       36350000
* DCL 1 S84_%%SDMIO BASED,                                              36360000
*     3 S84_%%IOVLS CHAR(6),      /* VOLSER                          */ 36370000
*     3 S84_%%IODDN CHAR(8),      /* DDNAME                          */ 36380000
*     3 *           FIXED(16),    /* UNUSED                          */ 36390000
*     3 S84_%%IOTOT FIXED(31),    /* TOTAL I/O COUNTS                */ 36400000
*     3 S84_%%IOLOC FIXED(31),    /* I/O COUNTS FOR LOW NUMBER CYL   */ 36410000
*     3 S84_%%IO2CY FIXED(31),    /* I/O COUNTS FOR 2 CYLINDERS      */ 36420000
*     3 S84_%%IO3CY FIXED(31),    /* I/O COUNTS FOR 3 CYLINDERS      */ 36430000
*     3 S84_%%IO4CY FIXED(31),    /* I/O COUNTS FOR 4 CYLINDERS      */ 36440000
*     3 S84_%%IO5CY FIXED(31),    /* I/O COUNTS FOR 5 CYLINDERS      */ 36450000
*     3 S84_%%IO6CY FIXED(31),    /* I/O COUNTS FOR 6 CYLINDERS      */ 36460000
*     3 S84_%%IO7CY FIXED(31),    /* I/O COUNTS FOR 7 CYLINDERS      */ 36470000
*     3 S84_%%IO8CY FIXED(31),    /* I/O COUNTS FOR 8 CYLINDERS      */ 36480000
*     3 S84_%%IO9CY FIXED(31),    /* I/O COUNTS FOR 9 CYLINDERS      */ 36490000
*     3 S84_%%IOHIC FIXED(31);    /* I/O COUNTS FOR HIGH NUMBER CYL  */ 36500000
* DCL S84_%%IOSZ1 FIXED(31) CONSTANT(Length(S84_%%SDMIO)); /*           36510000
*                                           Len of spool I/O activity   36520000
*                                           entry                    */ 36530000
*/********************************************************************/ 36540000
*/*                                                                  */ 36550000
*/*        SUBTYPE 3  --  BUFFERS CHAINING BY SPOOL DATASET          */ 36560000
*/*                                                                  */ 36570000
*/********************************************************************/ 36580000
*/********************************************************************/ 36590000
*/*   THE FOLLOWING IS A MAPPING FOR BUFFERS CHAINING BY SPOOL       */ 36600000
*/*   DATA SET ENTRY                                                 */ 36610000
*/********************************************************************/ 36620000
*                                                                       36630000
* DCL 1 S84_%%SDMBC BASED,                                              36640000
*     3 S84_%%BCDSN FIXED(16),    /* DATASET NUMBER                  */ 36650000
*     3 *           FIXED(16),    /* RESERVED FOR DEVELOPMENT        */ 36660000
*     3 S84_%%BCTOT FIXED(31),    /* TOTAL I/O BUFFER COUNT          */ 36670000
*     3 S84_%%BC1B  FIXED(31),    /* COUNT FOR 1 CHAINED BUFFER      */ 36680000
*     3 S84_%%BC2B  FIXED(31),    /* COUNT FOR 2 CHAINED BUFFERS     */ 36690000
*     3 S84_%%BC3B  FIXED(31),    /* COUNT FOR 3 CHAINED BUFFERS     */ 36700000
*     3 S84_%%BC4B  FIXED(31),    /* COUNT FOR 4 CHAINED BUFFERS     */ 36710000
*     3 S84_%%BC5B  FIXED(31),    /* COUNT FOR 5 CHAINED BUFFERS     */ 36720000
*     3 S84_%%BC6B  FIXED(31),    /* COUNT FOR 6 CHAINED BUFFERS     */ 36730000
*     3 S84_%%BC7B  FIXED(31),    /* COUNT FOR 7 CHAINED BUFFERS     */ 36740000
*     3 S84_%%BC8B  FIXED(31),    /* COUNT FOR 8 CHAINED BUFFERS     */ 36750000
*     3 S84_%%BC9B  FIXED(31),    /* COUNT FOR 9 CHAINED BUFFERS     */ 36760000
*     3 S84_%%BC10B FIXED(31),    /* COUNT FOR 10 CHAINED BUFFERS    */ 36770000
*     3 S84_%%BC11B FIXED(31);    /* COUNT FOR 11 OR MORE CHAINED       36780000
*                                    BUFFERS                         */ 36790000
* DCL S84_%%BCSZ1 FIXED(31) CONSTANT(Length(S84_%%SDMBC)); /*           36800000
*                                           Len of buffers by spool     36810000
*                                           data set entry           */ 36820000
*/********************************************************************/ 36830000
*/*                                                                  */ 36840000
*/*        SUBTYPE 3  --  MINIMAL/MARGINAL TRACK CONDITION           */ 36850000
*/*                                                                  */ 36860000
*/********************************************************************/ 36870000
*/********************************************************************/ 36880000
*/*   THE FOLLOWING IS A MAPPING FOR MINIMAL/MARGINAL TRACK          */ 36890000
*/*   CONDITION ENTRY                                                */ 36900000
*/********************************************************************/ 36910000
*                                                                       36920000
* DCL 1 S84_%%SDMMM BASED,                                              36930000
*     3 S84_%%MMPRT CHAR(8),      /* PARTITION NAME                  */ 36940000
*     3 S84_%%MMMIN FIXED(31),    /* COUNT OF SAMPLES PARTITION IN      36950000
*                                    MINIMAL TRACK CONDITION         */ 36960000
*     3 S84_%%MMMRG FIXED(31);    /* COUNT OF SAMPLES PARTITION IN      36970000
*                                    MARGINAL TRACK CONDITION        */ 36980000
* DCL S84_%%MMSZ1 FIXED(31) CONSTANT(Length(S84_%%SDMMM)); /*           36990000
*                                           Len of min/marg. track      37000000
*                                           condition entry          */ 37010000
*                                                                       37020000
*% IF IAZSMF84_SUBTYPE='ALL'    %THEN %GOTO SUBTYP4;                    37030000
*% IF IAZSMF84_SUBTYPE='ALLJ3'  %THEN %GOTO SUBTYP4;                    37040000
*% IF IAZSMF84_SUBTYPE='ALLJES' %THEN %GOTO SUBTYP4;                    37050000
*% IF IAZSMF84_SUBTYPE=''       %THEN %GOTO SUBTYP4;                    37060000
*% GOTO SUBDONE;                                                        37070000
*%SUBTYP4:;                                                             37080000
* @EJECT;                                                               37090000
*/********************************************************************/ 37100000
*/*                                                                  */ 37110000
*/*   RELOCATE BLOCK FOR SUBTYPE 4 - RESQUEUE CELL POOL              */ 37120000
*/*   STATISTICS, JCT ACCESS METHOD STATISTICS AND CONTROL           */ 37130000
*/*   BLOCK UTILIZATION.                                             */ 37140000
*/*                                                                  */ 37150000
*/*    THERE ARE 3 DATA SECTIONS:                                    */ 37160000
*/*                                                                  */ 37170000
*/*    1) RESQUEUE CELL POOL STATISTICS                              */ 37180000
*/*    2) JCT ACCESS METHOD STATISTICS                               */ 37190000
*/*    3) CONTROL BLOCK UTILIZATION.                                 */ 37200000
*/*                                                                  */ 37210000
*/********************************************************************/ 37220000
* @SPACE (1);                                                           37230000
*/********************************************************************/ 37240000
*/*                                                                  */ 37250000
*/*        SUBTYPE 4  --  RESQUEUE CELL POOL STATISTICS SECTION      */ 37260000
*/*                                                                  */ 37270000
*/********************************************************************/ 37280000
*                                                                       37290000
*   DCL 1 SMF84RSQ BASED(Addr(SMF84HDR)+SMF84J1O),                      37300000
*     3 S84_%%JCOFF FIXED(31),    /* OFFSET TO JCT ACCESS METHOD        37310000
*                                    SECTION                         */ 37320000
*     3 S84_%%CBOFF FIXED(31),    /* OFFSET TO JES3 CONTROL BLOCK       37330000
*                                    UTILIZATION                     */ 37340000
*     3 S84_%%CIEXT FIXED(16),    /* TOTAL NUMBER OF CI SECONDARY       37350000
*                                    EXTENTS IN POOL                 */ 37360000
*     3 *           FIXED(16),    /* RESERVED FOR DEVELOPMENT        */ 37370000
*     3 S84_%%CICEL FIXED(31),    /* TOTAL NUMBER OF CI RESQUEUES       37380000
*                                    IN POOL                         */ 37390000
*     3 S84_%%CIUSE FIXED(31),    /* TOTAL NUMBER OF CI RESQUEUES       37400000
*                                    USED IN POOL                    */ 37410000
*     3 S84_%%CIRQP FIXED(31),    /* NUMBER OF CI RESQUEUES IN          37420000
*                                    PRIMARY EXTENT                  */ 37430000
*     3 S84_%%NCISX FIXED(31),    /* NUMBER OF CI RSQ 2NDARY EXTENT     37440000
*                                    ENTRIES                         */ 37450000
*     3 S84_%%CISXO FIXED(31),    /* OFFSET TO 1ST CI RSQ 2NDARY        37460000
*                                    EXTENT ENTRY                    */ 37470000
*     3 S84_%%MNEXT FIXED(16),    /* TOTAL NUMBER OF MAIN SECONDARY     37480000
*                                    EXTENTS IN POOL                 */ 37490000
*     3 *           FIXED(16),    /* RESERVED FOR DEVELOPMENT        */ 37500000
*     3 S84_%%MNCEL FIXED(31),    /* TOTAL NUMBER OF MAIN RESQUEUES     37510000
*                                    IN POOL                         */ 37520000
*     3 S84_%%MNUSE FIXED(31),    /* TOTAL NUMBER OF MAIN RESQUEUE      37530000
*                                    USED IN POOL                    */ 37540000
*     3 S84_%%MNRQP FIXED(31),    /* TOTAL NUMBER OF MAIN RESQUEUES     37550000
*                                    IN PRIMARY EXTENT               */ 37560000
*     3 S84_%%NMNSX FIXED(31),    /* NUMBER OF MAIN RSQ 2NDARY          37570000
*                                    EXTENT ENTRIES                  */ 37580000
*     3 S84_%%MNSXO FIXED(31),    /* OFFSET TO 1ST MAIN RSQ 2NDARY      37590000
*                                    EXTENT ENTRY                    */ 37600000
*     3 S84_%%OSEXT FIXED(16),    /* TOTAL NUMBER OF OUTSERV            37610000
*                                    SECONDARY EXTENTS IN POOL       */ 37620000
*     3 *           FIXED(16),    /* RESERVED FOR DEVELOPMENT        */ 37630000
*     3 S84_%%OSCEL FIXED(31),    /* TOTAL NUMBER OF OUTSERV            37640000
*                                    RESQUEUES IN POOL               */ 37650000
*     3 S84_%%OSUSE FIXED(31),    /* TOTAL NUMBER OF OUTSERV            37660000
*                                    RESQUEUES USED IN POOL          */ 37670000
*     3 S84_%%OSRQP FIXED(31),    /* NUMBER OF OUTSERV RESQUEUES IN     37680000
*                                    PRIMARY EXTENT                  */ 37690000
*     3 S84_%%NOSSX FIXED(31),    /* NUMBER OF OS RSQ 2NDARY EXTENT     37700000
*                                    ENTRIES                         */ 37710000
*     3 S84_%%OSSXO FIXED(31),    /* OFFSET TO 1ST OS RSQ 2NDARY        37720000
*                                    EXTENT ENTRY                    */ 37730000
*     3 S84_%%CMEXT FIXED(16),    /* TOTAL NUMBER OF COMMON             37740000
*                                    SECONDARY EXTENTS IN POOL       */ 37750000
*     3 *           FIXED(16),    /* RESERVED FOR DEVELOPMENT        */ 37760000
*     3 S84_%%CMCEL FIXED(31),    /* TOTAL NUMBER OF COMMON RESQUEUE    37770000
*                                    IN POOL                         */ 37780000
*     3 S84_%%CMUSE FIXED(31),    /* TOTAL NUMBER OF COMMON RESQUEUE    37790000
*                                    USED IN POOL                    */ 37800000
*     3 S84_%%CMRQP FIXED(31),    /* TOTAL NUMBER OF COMMON RESQUEUE    37810000
*                                    IN PRIMARY EXTENT               */ 37820000
*     3 S84_%%NCMSX FIXED(31),    /* NUMBER OF COMMON RSQ 2NDARY        37830000
*                                    EXTENT ENTRIES                  */ 37840000
*     3 S84_%%CMSXO FIXED(31);    /* OFFSET TO 1ST COMMON RSQ 2NDARY    37850000
*                                    EXTENT ENTRY                    */ 37860000
* DCL S84_%%RQSZ1 FIXED(31) CONSTANT(Length(SMF84RSQ)); /*              37870000
*                                           Len of RESQ cell pool       37880000
*                                           stat section             */ 37890000
*/********************************************************************/ 37900000
*/*   EACH RESQUEUE SECONDARY EXTENT WILL BE MAPPED BY THIS          */ 37910000
*/*   FIELD                                                          */ 37920000
*/********************************************************************/ 37930000
*                                                                       37940000
* DCL 1 S84_%%RQEXT BASED,                                              37950000
*     3 S84_%%RQSXT FIXED(31);    /* NUMBER OF CI, MAIN, OUTSERV, OR    37960000
*                                    COMMON RESQUEUES FOR SECONDARY     37970000
*                                    EXTENT                          */ 37980000
* DCL S84_%%RQXSZ FIXED(31) CONSTANT(Length(S84_%%RQEXT)); /*           37990000
*                                           Len of RESQ 2ndary extent   38000000
*                                           entry                    */ 38010000
*/********************************************************************/ 38020000
*/*                                                                  */ 38030000
*/*        SUBTYPE 4  --  JCT ACCESS METHOD STATISTICS SECTION       */ 38040000
*/*                                                                  */ 38050000
*/********************************************************************/ 38060000
*                                                                       38070000
*   DCL 1 SMF84JCT BASED,                                               38080000
*/********************************************************************/ 38090000
*/*   JCT DATA SET INFORMATION                                       */ 38100000
*/********************************************************************/ 38110000
*     3 S84_%%SZJCT FIXED(31),    /* SIZE OF A JCT (IN BYTES)        */ 38120000
*     3 S84_%%REDIO FIXED(31),    /* NUMBER OF JCT READ I/O'S        */ 38130000
*     3 S84_%%WRTIO FIXED(31),    /* NUMBER OF JCT WRITE I/O'S       */ 38140000
*     3 S84_%%JBADD FIXED(31),    /* NUMBER OF JOBS ADDED TO JOB        38150000
*                                    QUEUE                           */ 38160000
*     3 S84_%%JBDEL FIXED(31),    /* NUMBER OF JOBS DELETED FROM JOB    38170000
*                                    QUEUE                           */ 38180000
*/********************************************************************/ 38190000
*/*   JCT DATA SPACE INFORMATION                                     */ 38200000
*/********************************************************************/ 38210000
*     3 S84_%%DSPFL BIT(8),       /* JCT DATA SPACE FLAG ONE         */ 38220000
*       5 S84_%%DSDIS BIT(1),     /*  THE JCT DATA SPACE WAS            38230000
*                                     DISABLED DURING SOME PORTION      38240000
*                                     OF THE INTERVAL.  THE             38250000
*                                     REMAINDER OF THE JCT DATA         38260000
*                                     SPACE INFORMATION IS ZERO      */ 38270000
*       5 *           BIT(7),     /*  Reserved                       */ 38280000
*     3 S84_%%JRSVD CHAR(3),      /* RESERVED FOR DEVELOPMENT        */ 38290000
*     3 S84_%%DSPSZ FIXED(31),    /* MAXIMUM JCT DATA SPACE SIZE        38300000
*                                    (IN HUNDRETHS OF A MEGABYTE)    */ 38310000
*/*------------------------------------------------------------------*/ 38320000
*/*   JCT DATA SPACE PAGE FAULT INFORMATION                          */ 38330000
*/*------------------------------------------------------------------*/ 38340000
*     3 S84_%%RDINS FIXED(31),    /* NUMBER OF JCT READ REQUESTS        38350000
*                                    WHERE THE CORRESPONDING JCT        38360000
*                                    DATA SPACE PAGE(S) WERE IN REAL    38370000
*                                    STORAGE                         */ 38380000
*                                                                       38390000
*     3 S84_%%PRINS FIXED(31),    /* PERCENT OF JCT READ REQUESTS       38400000
*                                    WHERE THE CORRESPONDING JCT        38410000
*                                    DATA SPACE PAGE(S) WERE IN REAL    38420000
*                                    STORAGE (IN HUNDRETHS OF A         38430000
*                                    PERCENT)                        */ 38440000
*                                                                       38450000
*     3 S84_%%RDNIS FIXED(31),    /* NUMBER OF JCT READ REQUESTS        38460000
*                                    WHERE THE CORRESPONDING JCT        38470000
*                                    DATA SPACE PAGE(S) WERE            38480000
*                                    ---NOT--- IN REAL STORAGE       */ 38490000
*                                                                       38500000
*     3 S84_%%PRNIS FIXED(31),    /* PERCENT OF JCT READ REQUESTS       38510000
*                                    WHERE THE CORRESPONDING JCT        38520000
*                                    DATA SPACE PAGE(S) WERE            38530000
*                                    ---NOT--- IN REAL STORAGE (IN      38540000
*                                    HUNDRETHS OF A PERCENT)         */ 38550000
*                                                                       38560000
*     3 S84_%%WTINS FIXED(31),    /* NUMBER OF JCT WRITE REQUESTS       38570000
*                                    WHERE THE CORRESPONDING JCT        38580000
*                                    DATA SPACE PAGE(S) WERE IN REAL    38590000
*                                    STORAGE                         */ 38600000
*                                                                       38610000
*     3 S84_%%PWINS FIXED(31),    /* PERCENT OF JCT WRITE REQUESTS      38620000
*                                    WHERE THE CORRESPONDING JCT        38630000
*                                    DATA SPACE PAGE(S) WERE IN REAL    38640000
*                                    STORAGE (IN HUNDRETHS OF A         38650000
*                                    PERCENT)                        */ 38660000
*                                                                       38670000
*     3 S84_%%WTNIS FIXED(31),    /* NUMBER OF JCT WRITE REQUESTS       38680000
*                                    WHERE THE CORRESPONDING JCT        38690000
*                                    DATA SPACE PAGE(S) WERE            38700000
*                                    ---NOT--- IN REAL STORAGE       */ 38710000
*                                                                       38720000
*     3 S84_%%PWNIS FIXED(31),    /* PERCENT OF JCT WRITE REQUESTS      38730000
*                                    WHERE THE CORRESPONDING JCT        38740000
*                                    DATA SPACE PAGE(S) WERE            38750000
*                                    ---NOT--- IN REAL STORAGE (IN      38760000
*                                    HUNDRETHS OF A PERCENT)         */ 38770000
*                                                                       38780000
*/*------------------------------------------------------------------*/ 38790000
*/*   JCT DATA SPACE PAGE USAGE INFORMATION                          */ 38800000
*/*------------------------------------------------------------------*/ 38810000
*     3 S84_%%DUSMN FIXED(31),    /* MINIMUM NUMBER OF JCT DATA SPACE   38820000
*          *                         PAGES IN USE                    */ 38830000
*     3 S84_%%DUSAV FIXED(31),    /* AVERAGE NUMBER OF JCT DATA SPACE   38840000
*          *                         PAGES IN USE                    */ 38850000
*     3 S84_%%DUSMX FIXED(31),    /* MAXIMUM NUMBER OF JCT DATA SPACE   38860000
*                                    PAGES IN USE                    */ 38870000
*/*------------------------------------------------------------------*/ 38880000
*/*   JCT DATA SPACE PAGE UTILIZATION.  THESE VALUES SHOW            */ 38890000
*/*   THE PERCENTAGE OF THE TOTAL JCT DATA SPACE PAGES               */ 38900000
*/*   THAT CONTAIN ALLOCATED JCTS.                                   */ 38910000
*/*------------------------------------------------------------------*/ 38920000
*     3 S84_%%DUTMN FIXED(31),    /* MINIMUM JCT DATA SPACE PAGE        38930000
*                                    UTILIZATION IN 1/100 OF PERCENT */ 38940000
*     3 S84_%%DUTAV FIXED(31),    /* AVERAGE JCT DATA SPACE PAGE        38950000
*                                    UTILIZATION IN 1/100 OF PERCENT */ 38960000
*     3 S84_%%DUTMX FIXED(31),    /* MAXIMUM JCT DATA SPACE PAGE        38970000
*                                    UTILIZATION IN 1/100 OF PERCENT */ 38980000
*/*------------------------------------------------------------------*/ 38990000
*/*   JCT DATA SPACE PAGE RELEASE INFORMATION                        */ 39000000
*/*------------------------------------------------------------------*/ 39010000
*     3 S84_%%PGSRL FIXED(31),    /* NUMBER OF JCT DATA SPACE PAGES     39020000
*                                    RELEASED                        */ 39030000
*/********************************************************************/ 39040000
*/*   JQE INFORMATION                                                */ 39050000
*/********************************************************************/ 39060000
*                                                                       39070000
*/*------------------------------------------------------------------*/ 39080000
*/*   JCT DATA SPACE PAGE RELEASE INFORMATION                        */ 39090000
*/*------------------------------------------------------------------*/ 39100000
*     3 S84_%%JQ0SZ FIXED(31),    /* JQE0 TABLE SIZE IN HUNDRETHS OF    39110000
*                                    A KILOBYTE)                     */ 39120000
*     3 S84_%%JQ1SZ FIXED(31),    /* JQE1 TABLE SIZE IN HUNDRETHS OF    39130000
*                                    A KILOBYTE)                     */ 39140000
*     3 S84_%%JQ2SZ FIXED(31),    /* JQE2 TABLE SIZE IN HUNDRETHS OF    39150000
*                                    A KILOBYTE)                     */ 39160000
*     3 S84_%%JQ3SZ FIXED(31),    /* JQE3 TABLE SIZE IN HUNDRETHS OF    39170000
*                                    A KILOBYTE)                     */ 39180000
*     3 S84_%%JQ4SZ FIXED(31),    /* JQE4 TABLE SIZE IN HUNDRETHS OF    39190000
*                                    A KILOBYTE)                     */ 39200000
*                                                                       39210000
*/*------------------------------------------------------------------*/ 39220000
*/*   JQE4 STORAGE USAGE INFORMATION                                 */ 39230000
*/*------------------------------------------------------------------*/ 39240000
*     3 S84_%%JUSMN FIXED(31),    /* MINIMUM NUMBER OF JQE4'S IN USE */ 39250000
*     3 S84_%%JUSAV FIXED(31),    /* AVERAGE NUMBER OF JQE4'S IN USE */ 39260000
*     3 S84_%%JUSMX FIXED(31),    /* MAXIMUM NUMBER OF JQE4'S IN USE */ 39270000
*                                                                       39280000
*/*------------------------------------------------------------------*/ 39290000
*/*   JQE4 STORAGE UTILIZATION.  THESE VALUES SHOW THE               */ 39300000
*/*   PERCENTAGE OF THE TOTAL JQE4 PAGES THAT CONTAIN                */ 39310000
*/*   ALLOCATED JQE4'S.                                              */ 39320000
*/*------------------------------------------------------------------*/ 39330000
*     3 S84_%%JUTMN FIXED(31),    /* MINIMUM JQE4 STOR UTILIZATION      39340000
*                                    (IN HUNDRETHS OF A PERCENT)     */ 39350000
*     3 S84_%%JUTAV FIXED(31),    /* AVERAGE JQE4 STOR UTILIZATION      39360000
*                                    (IN HUNDRETHS OF A PERCENT)     */ 39370000
*     3 S84_%%JUTMX FIXED(31);    /* MAXIMUM JQE4 STOR UTILIZATION      39380000
*                                    (IN HUNDRETHS OF A PERCENT)     */ 39390000
* DCL S84_%%JCTSZ FIXED(31) CONSTANT(Length(SMF84JCT)); /*              39400000
*                                           Len of JCT access method    39410000
*                                           statistics section       */ 39420000
*/********************************************************************/ 39430000
*/*                                                                  */ 39440000
*/*        SUBTYPE 4  --  JES3 CONTROL BLOCK UTILIZATION SECTION     */ 39450000
*/*                                                                  */ 39460000
*/********************************************************************/ 39470000
*                                                                       39480000
* DCL 1 S84_%%J3CB  BASED,                                              39490000
*/********************************************************************/ 39500000
*/*   FCT ENTRY USAGE                                                */ 39510000
*/********************************************************************/ 39520000
*     3 S84_%%FCTPR FIXED(31),    /* TOTAL NUMBER OF PREALLOCATED       39530000
*                                    FCTS                            */ 39540000
*     3 S84_%%FCTPM FIXED(31),    /* TOTAL NUMBER OF PERMANENT FCTS  */ 39550000
*     3 S84_%%FCTMN FIXED(31),    /* MINIMUM NUMBER OF FCT ENTRIES      39560000
*                                    USED                            */ 39570000
*     3 S84_%%FCTMX FIXED(31),    /* MAXIMUM NUMBER OF FCT ENTRIES      39580000
*                                    USED                            */ 39590000
*     3 S84_%%FCTAV FIXED(31),    /* AVERAGE NUMBER OF FCT ENTRIES      39600000
*                                    USED                            */ 39610000
*/********************************************************************/ 39620000
*/*   CONSOLE BUFFER USAGE                                           */ 39630000
*/********************************************************************/ 39640000
*     3 S84_%%PCNBF FIXED(31),    /* TOTAL NUMBER OF PREALLOCATED       39650000
*                                    CONSOLE BUFFERS                 */ 39660000
*     3 S84_%%PCBPT FIXED(31),    /* TOTAL NUMBER OF PREALLOCATED       39670000
*                                    CONSOLE BUFFER POINTERS         */ 39680000
*     3 S84_%%PDDBL FIXED(31),    /* TOTAL NUMBER OF PREALLOCATED       39690000
*                                    DOM DATA BLOCKS                 */ 39700000
*     3 S84_%%MNCBU FIXED(31),    /* MINIMUM NUMBER OF CONSOLE          39710000
*                                    BUFFERS USED                    */ 39720000
*     3 S84_%%MNBPU FIXED(31),    /* MINIMUM NUMBER OF CONSOLE          39730000
*                                    BUFFER POINTERS USED            */ 39740000
*     3 S84_%%MNDBU FIXED(31),    /* MINIMUN NUMBER OF DOM DATA         39750000
*                                    BLOCKS USED                     */ 39760000
*     3 S84_%%MXCBU FIXED(31),    /* MAXIMUM NUMBER OF CONSOLE          39770000
*                                    BUFFERS USED                    */ 39780000
*     3 S84_%%MXBPU FIXED(31),    /* MAXIMUM NUMBER OF CONSOLE          39790000
*                                    BUFFER POINTERS USED            */ 39800000
*     3 S84_%%MXDBU FIXED(31),    /* MAXIMUM NUMBER OF DOM DATA         39810000
*                                    BLOCKS USED                     */ 39820000
*     3 S84_%%AVCBU FIXED(31),    /* AVERAGE NUMBER OF CONSOLE          39830000
*                                    BUFFERS USED                    */ 39840000
*     3 S84_%%AVBPU FIXED(31),    /* AVERAGE NUMBER OF CONSOLE          39850000
*                                    BUFFER POINTERS USED            */ 39860000
*     3 S84_%%AVDBU FIXED(31),    /* AVERAGE NUMBER OF DOM DATA         39870000
*                                    BLOCKS USED                     */ 39880000
*     3 S84_%%SZCPE FIXED(31),    /* SIZE OF CONSOLE BUFFER PRIMARY     39890000
*                                    EXTENT                          */ 39900000
*     3 S84_%%SCBSE FIXED(31),    /* SIZE OF CONSOLE BUFFER SECONDARY   39910000
*                                    EXTENT                          */ 39920000
*     3 S84_%%CBSEL FIXED(16),    /* SIZE OF CONSOLE BUFFER SECONDARY   39930000
*                                    EXTENT LIMIT                    */ 39940000
*     3 *           FIXED(16),    /* RESERVED FOR DEVELOPMENT        */ 39950000
*     3 S84_%%TNRCB FIXED(31),    /* TOTAL NUMBER OF RESERVED CONSOLE   39960000
*                                    BUFFERS                         */ 39970000
*     3 S84_%%CBSEU FIXED(16),    /* NUMBER OF CONSOLE BUFFER           39980000
*                                    SECONDARY EXTENTS IN USE        */ 39990000
*     3 S84_%%BPSEU FIXED(16),    /* NUMBER OF BUFFER POINTER           40000000
*                                    SECONDARY EXTENTS IN USE        */ 40010000
*     3 S84_%%DBSEU FIXED(16),    /* NUMBER OF DOM DATA BLOCK           40020000
*                                    SECONDARY EXTENTS IN USE        */ 40030000
*     3 S84_%%SEMAX FIXED(16),    /* MAXIMUM NUMBER OF SECONDARY        40040000
*                                    EXTENTS EVER USED               */ 40050000
*     3 S84_%%RBMAX FIXED(31),    /* MAXIMUM NUMBER OF RESERVED         40060000
*                                    BUFFERS EVER USED               */ 40070000
*     3 S84_%%SCBEE FIXED(31),    /* COUNT FOR SECONDARY CONSOLE        40080000
*                                    BUFFER EXTENTS EXCEEDED         */ 40090000
*     3 S84_%%SCBPE FIXED(31),    /* COUNT FOR SECONDARY CONSOLE        40100000
*                                    BUFFER POINTER EXTENTS EXCEEDED */ 40110000
*     3 S84_%%SAQPE FIXED(31),    /* COUNT FOR SECONDARY ACTION         40120000
*                                    QUEUE POINTER EXTENTS EXCEEDED  */ 40130000
*/********************************************************************/ 40140000
*/*   JSAM BUFFER USAGE                                              */ 40150000
*/********************************************************************/ 40160000
*     3 S84_%%TOTJB FIXED(16),    /* TOTAL DEFINED JSAM BUFFERS      */ 40170000
*     3 *           FIXED(16),    /* RESERVED FOR DEVELOPMENT        */ 40180000
*     3 S84_%%MNJBU FIXED(31),    /* MINIMUM JSAM BUFFERS USED       */ 40190000
*     3 S84_%%MXJBU FIXED(31),    /* MAXIMUM JSAM BUFFERS USED       */ 40200000
*     3 S84_%%AVJBU FIXED(31),    /* AVERAGE JSAM BUFFERS USED       */ 40210000
*/********************************************************************/ 40220000
*/*   USAM (PROTECTED) BUFFER USAGE                                  */ 40230000
*/********************************************************************/ 40240000
*     3 S84_%%TOTUB FIXED(16),    /* TOTAL DEFINED USAM BUFFERS      */ 40250000
*     3 *           FIXED(16),    /* RESERVED FOR DEVELOPMENT        */ 40260000
*     3 S84_%%MNUBU FIXED(31),    /* MINIMUM USAM BUFFERS USED       */ 40270000
*     3 S84_%%MXUBU FIXED(31),    /* MAXIMUM USAM BUFFERS USED       */ 40280000
*     3 S84_%%AVUBU FIXED(31),    /* AVERAGE USAM BUFFERS USED       */ 40290000
*/********************************************************************/ 40300000
*/*   STAGING AREA USAGE                                             */ 40310000
*/********************************************************************/ 40320000
*     3 S84_%%SSAPE FIXED(16),    /* SIZE OF STAGING AREA PRIMARY       40330000
*                                    EXTENT IN 'K' BYTES             */ 40340000
*     3 *           FIXED(16),    /* RESERVED FOR DEVELOPMENT        */ 40350000
*     3 S84_%%TNPSA FIXED(31),    /* TOTAL NUMBER OF PRIMARY STAGING    40360000
*                                    AREAS                           */ 40370000
*     3 S84_%%SSASE FIXED(16),    /* SIZE OF STAGING AREA SECONDARY     40380000
*                                    EXTENT                          */ 40390000
*     3 *           FIXED(16),    /* RESERVED FOR DEVELOPMENT        */ 40400000
*     3 S84_%%TNSSA FIXED(31),    /* TOTAL NUMBER OF SECONDARY          40410000
*                                    STAGING AREAS                   */ 40420000
*     3 S84_%%SASEL FIXED(16),    /* STAGING AREA SECONDARY EXTENT      40430000
*                                    LIMIT                           */ 40440000
*     3 S84_%%MNSAL FIXED(16),    /* MINIMAL STAGING AREA LIMIT      */ 40450000
*     3 S84_%%SASIZ FIXED(31),    /* STAGING AREA SIZE               */ 40460000
*     3 S84_%%TNSAD FIXED(31),    /* TOTAL NUMBER OF STAGING AREAS      40470000
*                                    DEFINED                         */ 40480000
*     3 S84_%%MCSAI FIXED(31),    /* MAXIMUM CSA STAGING AREAS FOR      40490000
*                                    INTERVAL                        */ 40500000
*     3 S84_%%MASAI FIXED(31),    /* MAXIMUM AUXILIARY STAGING AREAS    40510000
*                                    DURING THIS INTERVAL            */ 40520000
*     3 S84_%%ASACS FIXED(31),    /* ACTIVE STAGING AREA COUNT FROM     40530000
*                                    FROM SVT (SVTSACNT)             */ 40540000
*     3 S84_%%ACSCS FIXED(31),    /* ACTIVE CSA STAGING AREA COUNT      40550000
*                                    FROM SVT (SVTCSACT)             */ 40560000
*     3 S84_%%AASCS FIXED(31),    /* ACTIVE AUXILIARY STAGING AREA      40570000
*                                    COUNT FROM SVT (SVTXSACT)       */ 40580000
*     3 S84_%%MCSAU FIXED(31),    /* MAXIMUM CSA STAGING AREAS EVER     40590000
*                                    USED                            */ 40600000
*     3 S84_%%MASAU FIXED(31),    /* MAXIMUM AUXILIARY STAGING AREAS    40610000
*                                    EVER USED                       */ 40620000
*     3 S84_%%PUSAE FIXED(31),    /* COUNT FOR USER MEMORY STAGING      40630000
*                                    AREA LIMIT EXCEEDED             */ 40640000
*     3 S84_%%PMSAE FIXED(31),    /* COUNT FOR MINIMAL STAGING AREA     40650000
*                                    LIMIT EXCEEDED                  */ 40660000
*/********************************************************************/ 40670000
*/*   TOTAL ACTIVE STAGING AREAS                                     */ 40680000
*/********************************************************************/ 40690000
*     3 S84_%%MNTSA FIXED(31),    /* MINIMUM NUMBER OF ACTIVE           40700000
*                                    STAGING AREAS                   */ 40710000
*     3 S84_%%MXTSA FIXED(31),    /* MAXIMUM NUMBER OF ACTIVE           40720000
*                                    STAGING AREAS                   */ 40730000
*     3 S84_%%AVTSA FIXED(31),    /* AVERAGE NUMBER OF ACTIVE           40740000
*                                    STAGING AREAS                   */ 40750000
*/********************************************************************/ 40760000
*/*   CSA ACTIVE STAGING AREAS                                       */ 40770000
*/********************************************************************/ 40780000
*     3 S84_%%MNCSA FIXED(31),    /* MINIMUM OF CSA ACTIVE STAGING      40790000
*                                    AREAS                           */ 40800000
*     3 S84_%%MXCSA FIXED(31),    /* MAXIMUM OF CSA ACTIVE STAGING      40810000
*                                    AREAS                           */ 40820000
*     3 S84_%%AVCSA FIXED(31),    /* AVERAGE OF CSA ACTIVE STAGING      40830000
*                                    AREAS                           */ 40840000
*/********************************************************************/ 40850000
*/*   AUXILIARY ACTIVE STAGING AREAS                                 */ 40860000
*/********************************************************************/ 40870000
*     3 S84_%%MNASA FIXED(31),    /* MINIMUM OF AUXILIARY ACTIVE        40880000
*                                    STAGING AREAS                   */ 40890000
*     3 S84_%%MXASA FIXED(31),    /* MAXIMUM OF AUXILIARY ACTIVE        40900000
*                                    STAGING AREAS                   */ 40910000
*     3 S84_%%AVASA FIXED(31),    /* AVERAGE OF AUXILIARY ACTIVE        40920000
*                                    STAGING AREAS                   */ 40930000
*/********************************************************************/ 40940000
*/*   JSAM BUFFER EXTENT AREAS                                       */ 40950000
*/********************************************************************/ 40960000
*     3 S84_%%JBPSZ FIXED(31),    /* SIZE OF PRIMARY EXTENT          */ 40970000
*     3 S84_%%JBSSZ FIXED(31),    /* SIZE OF SECONDARY EXTENT        */ 40980000
*     3 S84_%%JBLIM FIXED(31);    /* NUMBER OF SECONDARY EXTENTS ALL    40990000
*                                    ALLOWED                         */ 41000000
* DCL S84_%%J3SZ1 FIXED(31) CONSTANT(Length(S84_%%J3CB)); /*            41010000
*                                           Len of control block        41020000
*                                           utilization section      */ 41030000
*                                                                       41040000
*% IF IAZSMF84_SUBTYPE='ALL'    %THEN %GOTO SUBTYP5;                    41050000
*% IF IAZSMF84_SUBTYPE='ALLJ3'  %THEN %GOTO SUBTYP5;                    41060000
*% IF IAZSMF84_SUBTYPE='ALLJES' %THEN %GOTO SUBTYP5;                    41070000
*% IF IAZSMF84_SUBTYPE=''       %THEN %GOTO SUBTYP5;                    41080000
*% GOTO SUBDONE;                                                        41090000
*%SUBTYP5:;                                                             41100000
* @EJECT;                                                               41110000
*/********************************************************************/ 41120000
*/*                                                                  */ 41130000
*/*   RELOCATE BLOCK FOR SUBTYPE 5 - JOB SECTION                     */ 41140000
*/*                                                                  */ 41150000
*/*    THERE ARE 3 DATA SECTIONS:  1) JES3 WORK-TO-DO QUEUE,         */ 41160000
*/*     2) JOB ANALYSIS AND  3) JES3 FUNCTION SUMMARY SECTION        */ 41170000
*/*                                                                  */ 41180000
*/********************************************************************/ 41190000
* @SPACE (1);                                                           41200000
*/********************************************************************/ 41210000
*/*                                                                  */ 41220000
*/*        SUBTYPE 5   HEADER                                        */ 41230000
*/*                                                                  */ 41240000
*/********************************************************************/ 41250000
*                                                                       41260000
*   DCL 1 SMF84JOB BASED(Addr(SMF84HDR)+SMF84J1O),                      41270000
*     3 S84_%%JBLNG FIXED(31),    /* LENGTH OF THE JOB ANALYSIS         41280000
*                                    SECTION                         */ 41290000
*     3 S84_%%JBNUM FIXED(31),    /* TOTAL NUMBER OF JES3 JOB           41300000
*                                    ANALYSIS ENTRIES                */ 41310000
*     3 S84_%%WTDO  FIXED(31),    /* OFFSET OF WORK-TO-DO ANALYSIS      41320000
*                                    SECTION                         */ 41330000
*     3 S84_%%JBOF  FIXED(31),    /* OFFSET TO THE JOB ANALYSIS         41340000
*                                    SECTION                         */ 41350000
*     3 S84_%%FSUMO FIXED(31),    /* OFFSET OF JES3 FUNCTION SUMMARY    41360000
*                                    SECTION                         */ 41370000
*     3 S84_%%PLOTO FIXED(31),    /* OFFSET OF PLOT SECTION          */ 41380000
*     3 S84_%%S5FLG BIT(8),       /* JOB ENTRY HEADER FLAG           */ 41390000
*       5 S84_%%JAS   BIT(1),     /*  JOB ANALYSIS SEGMENT INDICATOR */ 41400000
*       5 S84_%%FSS   BIT(1),     /*  FUNCTION SUMMARY SEGMENT          41410000
*                                     INDICATOR                      */ 41420000
*       5 S84_%%PLT1  BIT(1),     /*  INITIATOR PLOT SECTION            41430000
*                                     INDICATOR                      */ 41440000
*       5 S84_%%PLT2  BIT(1),     /*  RQINDEX PLOT SECTION SEGMENT   */ 41450000
*       5 S84_%%PLT3  BIT(1),     /*  DEVICE CLASS PLOT SECTION         41460000
*                                     SEGMENT                        */ 41470000
*       5 S84_%%PLT4  BIT(1),     /*  SETNAME PLOT SECTION SEGMENT   */ 41480000
*       5 S84_%%PLT5  BIT(1),     /*  JOB CLASS PLOT SECTION SEGMENT */ 41490000
*       5 *           BIT(1),     /*  Reserved                       */ 41500000
*     3 *           CHAR(3);      /* RESERVED FOR DEVELOPMENT        */ 41510000
* DCL S84_%%JBSZ1 FIXED(31) CONSTANT(Length(SMF84JOB));  /*             41520000
*                                           Len of job header        */ 41530000
* @SPACE (1);                                                           41540000
*/********************************************************************/ 41550000
*/*                                                                  */ 41560000
*/*        SUBTYPE 5  --  JES3 WORK-TO-DO SECTION                    */ 41570000
*/*                                                                  */ 41580000
*/********************************************************************/ 41590000
*                                                                       41600000
*   DCL 1 SMF84WTD BASED,                                               41610000
*     3 S84_%%WKLNG FIXED(31),    /* LEN OF JSS WORK-TO-DO QUEUE        41620000
*                                    SECTION                         */ 41630000
*     3 S84_%%RDYMN FIXED(31),    /* MIN QUEUE LEN FOR THE JSS-READY    41640000
*                                    QUEUE                           */ 41650000
*     3 S84_%%RDYMX FIXED(31),    /* MAX QUEUE LEN FOR THE JSS-READY    41660000
*                                    QUEUE                           */ 41670000
*     3 S84_%%RDYAV FIXED(31),    /* AV QUEUE LEN FOR THE JSS-READY     41680000
*                                    QUEUE                           */ 41690000
*     3 S84_%%CATMN FIXED(31),    /* MIN QUEUE LEN FOR THE              41700000
*                                    CATLG-WAIT QUEUE                */ 41710000
*     3 S84_%%CATMX FIXED(31),    /* MAX QUEUE LEN FOR THE              41720000
*                                    CATLG-WAIT QUEUE                */ 41730000
*     3 S84_%%CATAV FIXED(31),    /* AV QUEUE LEN FOR THE CATLG-WAIT    41740000
*                                    QUEUE                           */ 41750000
*     3 S84_%%RSQMN FIXED(31),    /* MIN QUEUE LEN FOR THE RQ-WAIT      41760000
*                                    QUEUE                           */ 41770000
*     3 S84_%%RSQMX FIXED(31),    /* MAX QUEUE LEN FOR THE RQ-WAIT      41780000
*                                    QUEUE                           */ 41790000
*     3 S84_%%RSQAV FIXED(31),    /* AV QUEUE LEN FOR THE RQ-WAIT       41800000
*                                    QUEUE                           */ 41810000
*     3 S84_%%PLBMN FIXED(31),    /* MIN QUEUE LEN FOR THE              41820000
*                                    PROCLIB-WAIT QUEUE              */ 41830000
*     3 S84_%%PLBMX FIXED(31),    /* MAX QUEUE LEN FOR THE              41840000
*                                    PROCLIB-WAIT QUEUE              */ 41850000
*     3 S84_%%PLBAV FIXED(31),    /* AV QUEUE LEN FOR THE               41860000
*                                    PROCLIB-WAIT QUEUE              */ 41870000
*     3 S84_%%MCGMN FIXED(31),    /* MIN QUEUE LEN FOR THE MAIN-WAIT    41880000
*                                    QUEUE                           */ 41890000
*     3 S84_%%MCGMX FIXED(31),    /* MAX QUEUE LEN FOR THE MAIN-WAIT    41900000
*                                    QUEUE                           */ 41910000
*     3 S84_%%MCGAV FIXED(31),    /* AV QUEUE LEN FOR THE MAIN-WAIT     41920000
*                                    QUEUE                           */ 41930000
*     3 S84_%%DSPMN FIXED(31),    /* MIN QUEUE LEN FOR THE DSP-WAIT     41940000
*                                    QUEUE                           */ 41950000
*     3 S84_%%DSPMX FIXED(31),    /* MAX QUEUE LEN FOR THE DSP-WAIT     41960000
*                                    QUEUE                           */ 41970000
*     3 S84_%%DSPAV FIXED(31),    /* AV QUEUE LEN FOR THE DSP-WAIT      41980000
*                                    QUEUE                           */ 41990000
*     3 S84_%%MPLMN FIXED(31),    /* MIN QUEUE LEN FOR THE              42000000
*                                    MPLOC-WAIT QUEUE                */ 42010000
*     3 S84_%%MPLMX FIXED(31),    /* MAX QUEUE LEN FOR THE              42020000
*                                    MPLOC-WAIT QUEUE                */ 42030000
*     3 S84_%%MPLAV FIXED(31),    /* AV QUEUE LEN FOR THE MPLOC-WAIT    42040000
*                                    QUEUE                           */ 42050000
*     3 S84_%%DUPMN FIXED(31),    /* MIN QUEUE LEN FOR THE DUP          42060000
*                                    JOBNAME QUEUE                   */ 42070000
*     3 S84_%%DUPMX FIXED(31),    /* MAX QUEUE LEN FOR THE DUP          42080000
*                                    JOBNAME QUEUE                   */ 42090000
*     3 S84_%%DUPAV FIXED(31),    /* AV QUEUE LEN FOR THE DUP           42100000
*                                    JOBNAME QUEUE                   */ 42110000
*     3 S84_%%CIJMN FIXED(31),    /* Min queue len for C/I JSAM         42120000
*                                    buffer queue                    */ 42130000
*     3 S84_%%CIJMX FIXED(31),    /* Max queue len for C/I JSAM         42140000
*                                    buffer queue                    */ 42150000
*     3 S84_%%CIJAV FIXED(31);    /* Avg queue len for C/I JSAM         42160000
*                                    buffer queue                    */ 42170000
* DCL S84_%%JBSZ4 FIXED(31) CONSTANT(Length(SMF84WTD)); /*              42180000
*                                           Len of job header        */ 42190000
* @SPACE (1);                                                           42200000
*/********************************************************************/ 42210000
*/*                                                                  */ 42220000
*/*        SUBTYPE 5  --  JES3 WORK-TO-DO SECTION                    */ 42230000
*/*                                                                  */ 42240000
*/*                                                                  */ 42250000
*/*                R84JOB                 R84STAT                    */ 42260000
*/*               +-------+   R84JBGOF  +-----------+                */ 42270000
*/*    R84NXTJB   !///////!---------->  !  GMS/MDS  !                */ 42280000
*/*        +------!///////!             +-----------+                */ 42290000
*/*        !      !///////!------+      !///////////!                */ 42300000
*/*        !      +-------+      !      +-----------+                */ 42310000
*/*        !                     +--->  !  JSTAT    !                */ 42320000
*/*        !                  R84JSTOF  +-----------+                */ 42330000
*/*        !                                                         */ 42340000
*/*        !       R84JOB                                            */ 42350000
*/*        !      +-------+                                          */ 42360000
*/*        +----->!///////!                                          */ 42370000
*/*               !///////!                                          */ 42380000
*/*               !///////!                                          */ 42390000
*/*               +-------+                                          */ 42400000
*/*                                                                  */ 42410000
*/*   EACH JOB ANALYSIS ENTRY CAN BE MAPPED BY THE FOLLOWING FORM    */ 42420000
*/*                                                                  */ 42430000
*/********************************************************************/ 42440000
*                                                                       42450000
* DCL 1 S84_%%JOB   BASED,                                              42460000
*     3 S84_%%JBNAM CHAR(8),      /* JOB NAME                        */ 42470000
*     3 S84_%%JBID  CHAR(8),      /* JOB ID                          */ 42480000
*     3 *           CHAR(3),      /* UNUSED                          */ 42490000
*     3 S84_%%JBRQP FIXED(8),     /* JOB RESQUEUE PRIORITY           */ 42500000
*     3 S84_%%JBCLS CHAR(8),      /* JOB CLASS                       */ 42510000
*     3 S84_%%JSGRP CHAR(8),      /* GROUP NAME                      */ 42520000
*     3 S84_%%NXTJB FIXED(31),    /* OFFSET TO NEXT JOB ANALYSIS        42530000
*                                    ENTRY                           */ 42540000
*     3 S84_%%JSTAT FIXED(31),    /* TOTAL NUMBER OF JOBSTAT ENTRIES */ 42550000
*     3 S84_%%JSTOF FIXED(31),    /* OFFSET OF THE 1ST JOBSTAT ENTRY */ 42560000
*     3 S84_%%JBGMS FIXED(31),    /* TOTAL NUMBER OF GMS/MDS            42570000
*                                    ENTRIES                         */ 42580000
*     3 S84_%%JBGOF FIXED(31);    /* OFFSET OF THE 1ST GMS/MDS ENTRY */ 42590000
* DCL S84_%%JBSZ2 FIXED(31) CONSTANT(Length(S84_%%JOB));   /*           42600000
*                                           Len of each job analysis    42610000
*                                           entry                    */ 42620000
*/********************************************************************/ 42630000
*/*   EACH JOB STAT ENTRY AND GMS/MDS ENTRY CAN BE MAPPED BY         */ 42640000
*/*   THE FOLLOWING FORMAT.                                          */ 42650000
*/********************************************************************/ 42660000
*                                                                       42670000
* DCL 1 S84_%%STAT  BASED,                                              42680000
*     3 S84_%%JBFNM CHAR(33),     /* ACTIVE FUNCTION, DSP, OR PROC      42690000
*                                    NAME                            */ 42700000
*     3 *           CHAR(3),      /* RESERVED FOR DEVELOPMENT        */ 42710000
*     3 S84_%%JBJSR FIXED(8),     /* JSTAT REASON (USED FOR MDS/GMS     42720000
*                                    ONLY)                           */ 42730000
*     3 *           CHAR(3),      /* RESERVED FOR DEVELOPMENT        */ 42740000
*     3 S84_%%JBFTM FIXED(31);    /* ACTIVE FUNCTION TIME IN SECONDS */ 42750000
* DCL S84_%%JBSZ3 FIXED(31) CONSTANT(Length(S84_%%STAT));  /*           42760000
*                                           Len of each job stat        42770000
*                                           entry                    */ 42780000
*/********************************************************************/ 42790000
*/*                                                                  */ 42800000
*/*          SUBTYPE 5  --  JES3 FUNCTION SUMMARY SECTION            */ 42810000
*/*                                                                  */ 42820000
*/********************************************************************/ 42830000
*                                                                       42840000
*   DCL 1 SMF84FSM BASED,                                               42850000
*     3 S84_%%JSLNG FIXED(31),    /* LENGTH OF THE FUNCTION SUMMARY     42860000
*                                    SECTION                         */ 42870000
*     3 S84_%%JSNUM FIXED(31),    /* TOTAL NUMBER OF JES3 FUNCTION      42880000
*                                    SUMMARY ENTRIES                 */ 42890000
*     3 S84_%%JSOF  FIXED(31),    /* OFFSET OF THE 1ST JES3 FUNCTION    42900000
*                                    SUMMARY ENTRY                   */ 42910000
*     3 S84_%%GSNUM FIXED(31),    /* TOTAL NUMBER OF GMS/MDS SUMMARY    42920000
*                                    ENTRIES                         */ 42930000
*     3 S84_%%GSOF  FIXED(31),    /* OFFSET OF THE 1ST GMS/MDS          42940000
*                                    SUMMARY ENTRY                   */ 42950000
*/********************************************************************/ 42960000
*/*   MDS AND GMS SCHEDULING ANALYSIS SUMMARY INFORMATION            */ 42970000
*/********************************************************************/ 42980000
*     3 S84_%%ALRET FIXED(31),    /* ALLOCATION ATTEMPT RETRIES         42990000
*                                    DURING JMF INTERVAL             */ 43000000
*     3 S84_%%ARLSK FIXED(31),    /* ALLOCATION ATTEMPTS REJECTED       43010000
*                                    WITHOUT READING JST DURING JMF     43020000
*                                    INTERVAL                        */ 43030000
*     3 S84_%%ATMPT FIXED(31),    /* ALLOCATION ATTEMPTS ALLOWED TO     43040000
*                                    READ JST DURING JMF INTERVAL    */ 43050000
*     3 S84_%%ARLF  FIXED(31),    /* ALLOCATION ATTEMPTS REJECTED       43060000
*                                    AFTER READING JST DURING JMF       43070000
*                                    INTERVAL                        */ 43080000
*     3 S84_%%SUCCS FIXED(31);    /* SUCCESSFUL ALLOCATIONS DURING      43090000
*                                    JMF INTERVAL                    */ 43100000
* DCL S84_%%JBSZ5 FIXED(31) CONSTANT(Length(SMF84FSM)); /*              43110000
*                                           Len of JES3 function        43120000
*                                           summary section header   */ 43130000
*/********************************************************************/ 43140000
*/*   EACH JES3 FUNCTION SUMMARY AND GMS/MDS SUMMARY ENTRY CAN       */ 43150000
*/*   BE MAPPED BY THE FOLLOWING ENTRY.                              */ 43160000
*/********************************************************************/ 43170000
* DCL 1 S84_%%JFSUM BASED,                                              43180000
*     3 S84_%%JSNAM CHAR(33),     /* JES3 FUNCTION NAME OR DSP NAME  */ 43190000
*     3 *           CHAR(3),      /* RESERVED FOR DEVELOPMENT        */ 43200000
*     3 S84_%%JSJSR FIXED(8),     /* RQJSTAT SCHEDULING BYPASS CODE  */ 43210000
*/*                          X'01' - INSUFFICIENT STORAGE            */ 43220000
*/*                          X'02' - TLIMIT EXCEEDED                 */ 43230000
*/*                          X'03' - I/O RATE INAPPROPRIATE          */ 43240000
*/*                          X'04' - NO MATCH ON RQMAINS             */ 43250000
*/*                          X'05' - CHOICE INAPPROPRIATE            */ 43260000
*/*                          X'06' - NO MATCH ON CONTROL PROG. TYPE  */ 43270000
*/*                          X'07' - JOB CLASS NOT ENABLED           */ 43280000
*/*                          X'08' - LSTOR UPDATE PENDING            */ 43290000
*/*                          X'09' - CLASS CAN'T RUN ON THIS MAIN    */ 43300000
*/*                          X'0A' - MIX INAPPROPRIATE (1)           */ 43310000
*/*                          X'0B' - FIT INAPPROPRIATE (1)           */ 43320000
*/*                          X'0C' - FIT INAPPROPRIATE (2)           */ 43330000
*/*                          X'0D' - MIX INAPPROPRIATE (2)           */ 43340000
*/*                          X'0E' - JOB IN HOLD OR ACTIVE           */ 43350000
*/*                          X'0F' - RQINDEX NOT IN SELECT           */ 43360000
*/*                          X'10' - JOB IS IN DJC HOLD              */ 43370000
*/*                          X'11' - MINPART NOT AVAILABLE           */ 43380000
*/*                          X'12' - GROUP DISABLED ON THIS MAIN     */ 43390000
*/*                          X'13' - MAIN IS OFFLINE                 */ 43400000
*/*                          X'14' - TDEPTH EXCEEDED                 */ 43410000
*/*      THE REMAINING GMS BYPASS CODES ARE SET BY JMF               */ 43420000
*/*                          X'7E' - NO GROUP INITIATORS STARTED     */ 43430000
*/*                          X'7F' - ALL GROUP INITIATORS IN USE     */ 43440000
*/*      STORAGE DECLARATIONS FOR THE 'MDS SCHEDULING BYPASS REASONS'*/ 43450000
*/*                          X'80' - RESOURCE UPDATE ONLY            */ 43460000
*/*                          X'81' - JOB HOLD STATUS                 */ 43470000
*/*                          X'82' - MAX REGION SIZE EXCEEDED        */ 43480000
*/*                          X'83' - RESTART JOB PASS ONLY           */ 43490000
*/*                          X'84' - ELIGIBLE MAIN NOT ONLINE OR     */ 43500000
*/*                                  IPLED                           */ 43510000
*/*                          X'85' - INCORRECT CONTROL PROGRAM TYPE  */ 43520000
*/*                          X'86' - GMS GROUP OR CLASS NOT ENABLED  */ 43530000
*/*                          X'87' - REQUIRED RESOURCE NOT AVAILABLE */ 43540000
*/*                          X'88' - DEVICE POOL FENCE NOT BUILT     */ 43550000
*/*                          X'89' - MAIN SETUP DEPTH EXCEEDED       */ 43560000
*/*                          X'8A' - JOB CLASS SETUP DEPTH EXCEEDED  */ 43570000
*/*                          X'8B' - FAILED PREALLOCATION SCAN       */ 43580000
*/*                          X'FF' - JOB SELECTED FOR A MAIN         */ 43590000
*     3 *           CHAR(3),      /* RESERVED FOR DEVELOPMENT        */ 43600000
*     3 S84_%%JSAV  FIXED(31),    /* AVERAGE FUNCTION TIME IN SECONDS*/ 43610000
*     3 S84_%%JSCNT FIXED(31),    /* ACTIVE JOB COUNT                */ 43620000
*     3 S84_%%JSMIN FIXED(31),    /* MINIMUM FUNCTION TIME IN SECONDS*/ 43630000
*     3 S84_%%JSMAX FIXED(31),    /* MAXIMUM FUNCTION TIME IN SECONDS*/ 43640000
*     3 S84_%%JSMNJ CHAR(8),      /* JOB ID FOR THE MINIMUM FUNCTION    43650000
*                                    TIME                            */ 43660000
*     3 S84_%%JSMXJ CHAR(8);      /* JOB ID FOR THE MAXIMUM FUNCTION    43670000
*                                    TIME                            */ 43680000
* DCL S84_%%JBSZ6 FIXED(31) CONSTANT(Length(S84_%%JFSUM)); /*           43690000
*                                           Len of JES3 function        43700000
*                                           summary entry            */ 43710000
*/********************************************************************/ 43720000
*/*                                                                  */ 43730000
*/*          SUBTYPE 5  --  PLOT SECTION                             */ 43740000
*/*                                                                  */ 43750000
*/*   NOTE: EACH PLOT COUNTER ENTRY CONTAINS TWO FIELDS: SCALE       */ 43760000
*/*         AND COUNT. THE SCALE FIELD REFERS TO THE VALUE ALONG     */ 43770000
*/*         THE VERTICAL LINE.  THE COUNT FIELD CAN BE USED TO       */ 43780000
*/*         CALCULATE THE POINTS ON THE HORIZONTAL LINE. YOU CAN     */ 43790000
*/*         CALCULATE THE PERCENTAGE OF JMF INTERVAL TIME SPENT      */ 43800000
*/*         AT THE GIVEN SCALE (RECORDED BY THE PREVIOUS FIELD)      */ 43810000
*/*         BY THE FOLLOWING FORMULA:                                */ 43820000
*/*         % OF JMF INTERVAL TIME = COUNT / JOB SAMPLE COUNT        */ 43830000
*/*                                  (R84JOBCG) * 100                */ 43840000
*/*                                                                  */ 43850000
*/********************************************************************/ 43860000
*   DCL 1 SMF84PLT BASED,                                               43870000
*     3 S84_%%PLTLN FIXED(31),    /* LENGTH OF PLOT SECTION          */ 43880000
*     3 S84_%%JOBCG FIXED(31),    /* NUMBER OF JOB SAMPLE COUNTS     */ 43890000
*     3 S84_%%INITN FIXED(31),    /* NUMBER OF PLOTS FOR "JOBS IN       43900000
*                                    EXECUTION BY MAIN PROCESSOR"    */ 43910000
*     3 S84_%%INITO FIXED(31),    /* OFFSET TO THE 1ST ENTRY OF "JOB    43920000
*                                    IN EXECUTION BY MAIN PROCESSOR" */ 43930000
*     3 S84_%%RQNXN FIXED(31),    /* NUMBER OF PLOTS FOR "JOB Q         43940000
*                                    LENGTH BY JES3 FUNCTION"        */ 43950000
*     3 S84_%%RQNXO FIXED(31),    /* OFFSET TO 1ST ENTRY OF "JOB Q      43960000
*                                    LENGTH BY JES3 FUNCTION"        */ 43970000
*     3 S84_%%DCLSN FIXED(31),    /* NUMBER OF PLOTS FOR "ALLOCATED     43980000
*                                    JES3 DEVICES BY DEVICE CLASS"   */ 43990000
*     3 S84_%%DCLSO FIXED(31),    /* OFFSET TO THE 1ST ENTRY OF         44000000
*                                    "ALLOCATED JES3 DEVICES BY         44010000
*                                    DEVICE CLASS"                   */ 44020000
*     3 S84_%%SETNN FIXED(31),    /* NUMBER OF PLOTS FOR "ALLOCATED     44030000
*                                    JES3 DEVICES BY SETNAME"        */ 44040000
*     3 S84_%%SETNO FIXED(31),    /* OFFSET TO THE 1ST ENTRY OF         44050000
*                                    "ALLOCATED JES3 DEVICES BY         44060000
*                                    SETNAME"                        */ 44070000
*     3 S84_%%JCLSN FIXED(31),    /* NUMBER OF PLOTS FOR "JOBS IN       44080000
*                                    EXECUTION BY JOB CLASS GROUP"   */ 44090000
*     3 S84_%%JCLSO FIXED(31);    /* OFFSET TO THE 1ST ENTRY OF "JOBS   44100000
*                                    IN EXECUTION BY JOB CLASS          44110000
*                                    GROUPS"                         */ 44120000
* DCL S84_%%PLTSZ FIXED(31) CONSTANT(Length(SMF84PLT)); /*              44130000
*                                           Len of plot section      */ 44140000
*/********************************************************************/ 44150000
*/*   THE FOLLOWING DSECT WILL MAP EACH "JOBS IN EXECUTION BY MAIN   */ 44160000
*/*   PROCESSOR (I.E. INITIATOR PLOT)"  ENTRY                        */ 44170000
*/********************************************************************/ 44180000
* DCL 1 S84_%%IPLOT BASED,                                              44190000
*     3 S84_%%INEXT FIXED(31),    /* OFFSET TO NEXT INITIATOR PLOT      44200000
*                                    ENTRY                           */ 44210000
*     3 S84_%%INAME CHAR(8),      /* PROCESSOR NAME                  */ 44220000
*     3 S84_%%IFLG  BIT(8),       /* FLAG BYTE 1                     */ 44230000
*       5 S84_%%IGBL  BIT(1),     /*  JES3 GLOBAL                    */ 44240000
*       5 S84_%%ILCL  BIT(1),     /*  JES3 LOCAL                     */ 44250000
*       5 *           BIT(6),     /*  Reserved                       */ 44260000
*     3 *           CHAR(3),      /* RESERVED                        */ 44270000
*     3 S84_%%IINIT FIXED(31),    /* COUNT FOR STARTED INITIATORS    */ 44280000
*     3 S84_%%IPLLO FIXED(31),    /* SMALLEST SCALE FOR INITIATOR       44290000
*                                    PLOT                            */ 44300000
*     3 S84_%%IPLHI FIXED(31),    /* LARGEST SCALE FOR INITIATOR        44310000
*                                    PLOT                            */ 44320000
*     3 S84_%%IPLIN FIXED(31),    /* INCREMENT FOR PLOTTING             44330000
*                                    INITIATOR PLOT                  */ 44340000
*     3 S84_%%IPTMN FIXED(31),    /* MINIMUM PLOT VALUE FOR             44350000
*                                    INITIATOR PLOT                  */ 44360000
*     3 S84_%%IPTMX FIXED(31),    /* MAXIMUM PLOT VALUE FOR             44370000
*                                    INITIATOR PLOT                  */ 44380000
*     3 S84_%%IPTAV FIXED(31),    /* AVERAGE PLOT VALUE FOR             44390000
*                                    INITIATOR PLOT                  */ 44400000
*     3 S84_%%IPTN  FIXED(31),    /* NUMBER OF INITIATOR PLOT COUNTER   44410000
*                                    ENTRIES                         */ 44420000
*     3 S84_%%IPTO  FIXED(31);    /* OFFSET TO 1ST INITIATOR PLOT       44430000
*                                    COUNTER ENTRY                   */ 44440000
* DCL S84_%%ISZ1  FIXED(31) CONSTANT(Length(S84_%%IPLOT)); /*           44450000
*                                           Len of initiator plot       44460000
*                                           entry                    */ 44470000
*/********************************************************************/ 44480000
*/*   THE FOLLOWING DSECT WILL MAP EACH INITIATOR PLOT COUNTER ENTRY */ 44490000
*/********************************************************************/ 44500000
* DCL 1 S84_%%IPT   BASED,                                              44510000
*     3 S84_%%IPTS  FIXED(31),    /* INITIATOR PLOT SCALE            */ 44520000
*     3 S84_%%IPTC  FIXED(31);    /* COUNT FOR INITIATOR PLOT SCALE  */ 44530000
* DCL S84_%%IPSZ1 FIXED(31) CONSTANT(Length(S84_%%IPT));   /*           44540000
*                                           Len of initiator plot       44550000
*                                           entry                    */ 44560000
*/********************************************************************/ 44570000
*/*   THE FOLLOWING DSECT WILL MAP EACH "JOBS IN EXECUTION BY JOB    */ 44580000
*/*   CLASS GROUP" ENTRY                                             */ 44590000
*/********************************************************************/ 44600000
* DCL 1 S84_%%JPLOT BASED,                                              44610000
*     3 S84_%%JNEXT FIXED(31),    /* OFFSET TO NEXT ENTRY FOR "JOBS IN  44620000
*                                    EXECUTION BY JOB CLASS GROUP"   */ 44630000
*     3 S84_%%JNAME CHAR(8),      /* PROCESSOR NAME                  */ 44640000
*     3 S84_%%JCGRP CHAR(8),      /* JOB CLASS GROUP NAME            */ 44650000
*     3 S84_%%JCSIN FIXED(31),    /* COUNT FOR STARTED INITIATORS    */ 44660000
*     3 S84_%%JPLLO FIXED(31),    /* SMALLEST SCALE FOR JOB CLASS       44670000
*                                    PLOT                            */ 44680000
*     3 S84_%%JPLHI FIXED(31),    /* LARGEST SCALE FOR JOB CLASS        44690000
*                                    PLOT                            */ 44700000
*     3 S84_%%JPLIN FIXED(31),    /* INCREMENT FOR PLOTTING JOB CLASS   44710000
*                                    PLOT                            */ 44720000
*     3 S84_%%JPTMN FIXED(31),    /* MINIMUM PLOT VALUE FOR JOB CLASS   44730000
*                                    PLOT                            */ 44740000
*     3 S84_%%JPTMX FIXED(31),    /* MAXIMUM PLOT VALUE FOR JOB CLASS   44750000
*                                    PLOT                            */ 44760000
*     3 S84_%%JPTAV FIXED(31),    /* AVERAGE PLOT VALUE FOR JOB CLASS   44770000
*                                    PLOT                            */ 44780000
*     3 S84_%%JPTN  FIXED(31),    /* NUMBER OF PLOT COUNTER ENTRIES     44790000
*                                    FOR JOB CLASS PLOT              */ 44800000
*     3 S84_%%JPTO  FIXED(31);    /* OFFSET TO 1ST PLOT COUNTER ENTRY   44810000
*                                    FOR JOB CLASS PLOT              */ 44820000
* DCL S84_%%JSZ1  FIXED(31) CONSTANT(Length(S84_%%JPLOT)); /*           44830000
*                                           Len of job class group      44840000
*                                           entry                    */ 44850000
*/********************************************************************/ 44860000
*/*   THE FOLLOWING DSECT WILL MAP EACH JOB CLASS GROUP PLOT COUNTER */ 44870000
*/*   ENTRY                                                          */ 44880000
*/********************************************************************/ 44890000
* DCL 1 S84_%%JCPT  BASED,                                              44900000
*     3 S84_%%JPTS  FIXED(31),    /* JOB CLASS GROUP PLOT SCALE      */ 44910000
*     3 S84_%%JPTC  FIXED(31);    /* COUNT FOR JOB CLASS GROUP PLOT     44920000
*                                    SCALE                           */ 44930000
* DCL S84_%%JPSZ1 FIXED(31) CONSTANT(Length(S84_%%JCPT));  /*           44940000
*                                           Len of job class group      44950000
*                                           plot scale               */ 44960000
*/********************************************************************/ 44970000
*/*   THE FOLLOWING DSECT WILL MAP EACH "ALLOCATED JES3 DEVICES BY   */ 44980000
*/*   DEVICE CLASS (I.E. DEVICE PLOT)" ENTRY                         */ 44990000
*/********************************************************************/ 45000000
* DCL 1 S84_%%DPLOT BASED,                                              45010000
*     3 S84_%%DNEXT FIXED(31),    /* OFFSET TO NEXT DEVICE PLOT      */ 45020000
*     3 S84_%%DFLG  BIT(8),       /* FLAG BYTE 1                     */ 45030000
*       5 S84_%%DTA   BIT(1),     /*  TAPE DEVICE                    */ 45040000
*       5 S84_%%DDA   BIT(1),     /*  DIRECT ACCESS DEVICE           */ 45050000
*       5 S84_%%DUR   BIT(1),     /*  UNIT RECORD DEVICE             */ 45060000
*       5 S84_%%DGR   BIT(1),     /*  GRAPHICS DEVICE                */ 45070000
*       5 *           BIT(4),     /*  Reserved                       */ 45080000
*     3 *           FIXED(8) ,    /* RESERVED                        */ 45090000
*     3 S84_%%DNAME CHAR(2),      /* DEVICE NAME                     */ 45100000
*     3 S84_%%DCNT  FIXED(31),    /* COUNT FOR TOTAL NUMBER OF          45110000
*                                    DEVICES                         */ 45120000
*     3 S84_%%DPLLO FIXED(31),    /* SMALLEST SCALE FOR DEVICE PLOT  */ 45130000
*     3 S84_%%DPLHI FIXED(31),    /* LARGEST SCALE FOR DEVICE PLOT   */ 45140000
*     3 S84_%%DPLIN FIXED(31),    /* INCREMENT FOR PLOTTING DEVICE      45150000
*                                    PLOT                            */ 45160000
*     3 S84_%%DPTMN FIXED(31),    /* MINIMUM PLOT VALUE FOR DEVICE      45170000
*                                    PLOT                            */ 45180000
*     3 S84_%%DPTMX FIXED(31),    /* MAXIMUM PLOT VALUE FOR DEVICE      45190000
*                                    PLOT                            */ 45200000
*     3 S84_%%DPTAV FIXED(31),    /* AVERAGE PLOT VALUE FOR DEVICE      45210000
*                                    PLOT                            */ 45220000
*     3 S84_%%DPTN  FIXED(31),    /* NUMBER OF PLOT COUNTER ENTRIES     45230000
*                                    FOR DEVICE PLOT                 */ 45240000
*     3 S84_%%DPTO  FIXED(31);    /* OFFSET TO 1ST PLOT COUNTER ENTRY   45250000
*                                    FOR DEVICE PLOT                 */ 45260000
* DCL S84_%%DSZ1  FIXED(31) CONSTANT(Length(S84_%%DPLOT)); /*           45270000
*                                           Len of device plot entry */ 45280000
*/********************************************************************/ 45290000
*/*   THE FOLLOWING DSECT WILL MAP EACH DEVICE PLOT COUNTER ENTRY    */ 45300000
*/********************************************************************/ 45310000
* DCL 1 S84_%%DPT   BASED,                                              45320000
*     3 S84_%%DPTS  FIXED(31),    /* DEVICE PLOT SCALE               */ 45330000
*     3 S84_%%DPTC  FIXED(31);    /* COUNT FOR DEVICE PLOT SCALE     */ 45340000
* DCL S84_%%DPSZ1 FIXED(31) CONSTANT(Length(S84_%%DPT));   /*           45350000
*                                           Len of device plot          45360000
*                                           counter entry            */ 45370000
*/********************************************************************/ 45380000
*/*   THE FOLLOWING DSECT WILL MAP EACH "ALLOCATED JES3 DEVICES BY   */ 45390000
*/*   SETNAME (I.E. SETNAME PLOT)" ENTRY                             */ 45400000
*/********************************************************************/ 45410000
* DCL 1 S84_%%SPLOT BASED,                                              45420000
*     3 S84_%%SNEXT FIXED(31),    /* OFFSET TO NEXT SETNAME PLOT     */ 45430000
*     3 S84_%%SMPCN CHAR(8),      /* PROCESSOR NAME                  */ 45440000
*     3 S84_%%SFLG  BIT(8),       /* FLAG BYTE 1                     */ 45450000
*       5 S84_%%SGBL  BIT(1),     /*  JES3 GLOBAL                    */ 45460000
*       5 S84_%%SLCL  BIT(1),     /*  JES3 LOCAL                     */ 45470000
*       5 *           BIT(6),     /*  Reserved                       */ 45480000
*     3 *           CHAR(3),      /* RESERVED                        */ 45490000
*     3 S84_%%SXTYP CHAR(8),      /* SETNAME DEVICE NAME             */ 45500000
*     3 S84_%%SXTOT FIXED(31),    /* TOTAL SETNAME DEVICES           */ 45510000
*     3 S84_%%SPLLO FIXED(31),    /* SMALLEST SCALE FOR SETNAME PLOT */ 45520000
*     3 S84_%%SPLHI FIXED(31),    /* LARGEST SCALE FOR SETNAME PLOT  */ 45530000
*     3 S84_%%SPLIN FIXED(31),    /* INCREMENT FOR PLOTTING SETNAME     45540000
*                                    PLOT                            */ 45550000
*     3 * UNION,                                                        45560000
*                                                                       45570000
*      4 * ,                      /* SETNAME PLOT ENTRY              */ 45580000
*       5 S84_%%SPTMN FIXED(31),  /* MINIMUM PLOT VALUE FOR SETNAME     45590000
*                                    PLOT                            */ 45600000
*       5 S84_%%SPTMX FIXED(31),  /* MAXIMUM PLOT VALUE FOR SETNAME     45610000
*                                    PLOT                            */ 45620000
*       5 S84_%%SPTAV FIXED(31),  /* AVERAGE PLOT VALUE FOR SETNAME     45630000
*                                    PLOT                            */ 45640000
*       5 S84_%%SPTN  FIXED(31),  /* NUMBER OF SETNAME PLOT COUNTER     45650000
*                                    ENTRIES                         */ 45660000
*       5 S84_%%SPTO  FIXED(31),  /* OFFSET TO 1ST SETNAME PLOT         45670000
*                                    COUNTER ENTRY                   */ 45680000
*                                                                       45690000
*      4 * ,                      /* XTYPE PLOT ENTRY                */ 45700000
*       5 S84_%%XJMIN FIXED(31),  /* MINIMUM PLOT VALUE FOR J TYPE      45710000
*                                    DEVICES.  J TYPE DEVICES ARE       45720000
*                                    SETUP DEVICES THAT ARE ALLOCATED   45730000
*                                    BY JES3.                        */ 45740000
*       5 S84_%%XJMAX FIXED(31),  /* MAXIMUM PLOT VALUE FOR J TYPE      45750000
*                                    DEVICES                         */ 45760000
*       5 S84_%%XJAVG FIXED(31),  /* AVERAGE PLOT VALUE FOR J TYPE      45770000
*                                    DEVICES                         */ 45780000
*       5 S84_%%XJPTN FIXED(31),  /* NUMBER OF PLOT COUNTER ENTRIES     45790000
*                                    FOR J TYPE DEVICES              */ 45800000
*       5 S84_%%XJPTO FIXED(31),  /* OFFSET TO 1ST PLOT COUNTER ENTRY   45810000
*                                    FOR J TYPE DEVICES.             */ 45820000
*       5 S84_%%XXMIN FIXED(31),  /* MINIMUM PLOT VALUE FOR X TYPE      45830000
*                                    DEVICES: X TYPE DEVICES ARE        45840000
*                                    SETUP DEVICES THAT IN EXECUTION    45850000
*                                    ON MAIN (CLASS 1 DEVICES ONLY). */ 45860000
*       5 S84_%%XXMAX FIXED(31),  /* MAXIMUM PLOT VALUE FOR X TYPE      45870000
*                                    DEVICES                         */ 45880000
*       5 S84_%%XXAVG FIXED(31),  /* AVERAGE PLOT VALUE FOR X TYPE      45890000
*                                    DEVICES                         */ 45900000
*       5 S84_%%XXPTN FIXED(31),  /* NUMBER OF PLOT COUNTER ENTRIES     45910000
*                                    FOR X TYPE DEVICES              */ 45920000
*       5 S84_%%XXPTO FIXED(31),  /* OFFSET TO 1ST PLOT COUNTER ENTRY   45930000
*                                    FOR X TYPE DEVICES              */ 45940000
*       5 S84_%%XMMIN FIXED(31),  /* MINIMUM PLOT VALUE FOR M TYPE      45950000
*                                    DEVICES: M TYPE DEVICES ARE        45960000
*                                    SETUP DEVICES THAT ARE ALLOCATED   45970000
*                                    BY MVS.                         */ 45980000
*       5 S84_%%XMMAX FIXED(31),  /* MAXIMUM PLOT VALUE FOR M TYPE      45990000
*                                    DEVICES                         */ 46000000
*       5 S84_%%XMAVG FIXED(31),  /* AVERAGE PLOT VALUE FOR M TYPE      46010000
*                                    DEVICES                         */ 46020000
*       5 S84_%%XMPTN FIXED(31),  /* NUMBER OF PLOT COUNTER ENTRIES     46030000
*                                    FOR M TYPE DEVICES              */ 46040000
*       5 S84_%%XMPTO FIXED(31);  /* OFFSET TO 1ST PLOT COUNTER ENTRY   46050000
*                                    FOR M TYPE DEVICES              */ 46060000
*/*------------------------------------------------------------------*/ 46070000
*/*  Length of SETNAME/XTYPE plot entries                            */ 46080000
*/*------------------------------------------------------------------*/ 46090000
* DCL S84_%%SSZ1  FIXED(31) CONSTANT(Offset(S84_%%SPTO)+                46100000
*                                    Length(S84_%%SPTO));               46110000
* DCL S84_%%SSZ2  FIXED(31) CONSTANT(Offset(S84_%%XMPTO)+               46120000
*                                    Length(S84_%%XMPTO));              46130000
*                                                                       46140000
*/********************************************************************/ 46150000
*/*   THE FOLLOWING DSECT WILL MAP EACH SETNAME, X TYPE, J TYPE,     */ 46160000
*/*   OR M TYPE PLOT COUNTER ENTRY                                   */ 46170000
*/********************************************************************/ 46180000
* DCL 1 S84_%%XPT   BASED,                                              46190000
*     3 S84_%%XPTS  FIXED(31),    /* XTYPE PLOT SCALE                */ 46200000
*     3 S84_%%XPTC  FIXED(31);    /* COUNT FOR XTYPE PLOT SCALE      */ 46210000
* DCL S84_%%XPSZ1 FIXED(31) CONSTANT(Length(S84_%%XPT));   /*           46220000
*                                           Len of XTYPE plot           46230000
*                                           counter entry            */ 46240000
*                                                                       46250000
*/********************************************************************/ 46260000
*/*   THE FOLLOWING DSECT WILL MAP EACH "JES3 Q LENGTH BY JES3       */ 46270000
*/*   FUNCTIOIN (I.E. RQINDEX PLOT)" ENTRY                           */ 46280000
*/********************************************************************/ 46290000
* DCL 1 S84_%%RPLOT BASED,                                              46300000
*     3 S84_%%RNEXT FIXED(31),    /* OFFSET TO NEXT RQINDEX PLOT     */ 46310000
*     3 S84_%%RQNAM CHAR(33),     /* NAME OF RQINDEX                 */ 46320000
*     3 *           CHAR(3),      /* RESERVED                        */ 46330000
*     3 S84_%%RPLLO FIXED(31),    /* SMALLEST SCALE FOR RQINDEX PLOT */ 46340000
*     3 S84_%%RPLHI FIXED(31),    /* LARGEST SCALE FOR RQINDEX PLOT  */ 46350000
*     3 S84_%%RPLIN FIXED(31),    /* INCREMENT FOR PLOTTING RQINDEX     46360000
*                                    PLOT                            */ 46370000
*     3 S84_%%RPTMN FIXED(31),    /* MINIMUM PLOT VALUE FOR RQINDEX     46380000
*                                    PLOT                            */ 46390000
*     3 S84_%%RPTMX FIXED(31),    /* MAXIMUM PLOT VALUE FOR RQINDEX     46400000
*                                    PLOT                            */ 46410000
*     3 S84_%%RPTAV FIXED(31),    /* AVERAGE PLOT VALUE FOR RQINDEX     46420000
*                                    PLOT                            */ 46430000
*     3 S84_%%RPTN  FIXED(31),    /* NUMBER OF PLOT COUNTER ENTRIES     46440000
*                                    FOR RQINDEX PLOT                */ 46450000
*     3 S84_%%RPTO  FIXED(31);    /* OFFSET TO 1ST PLOT COUNTER         46460000
*                                    ENTRY FOR RQINDEX PLOT          */ 46470000
* DCL S84_%%RSZ1  FIXED(31) CONSTANT(Length(S84_%%RPLOT)); /*           46480000
*                                           Len of RQINDEX plot         46490000
*                                           entry                    */ 46500000
*/********************************************************************/ 46510000
*/*   THE FOLLOWING DSECT WILL MAP EACH RQINDEX PLOT COUNTER ENTRY   */ 46520000
*/********************************************************************/ 46530000
* DCL 1 S84_%%RPT   BASED,                                              46540000
*     3 S84_%%RQPTS FIXED(31),    /* RQINDEX PLOT SCALE              */ 46550000
*     3 S84_%%RQPTC FIXED(31);    /* COUNT FOR RQINDEX PLOT SCALE    */ 46560000
* DCL S84_%%RQPS1 FIXED(31) CONSTANT(Length(S84_%%RPT));   /*           46570000
*                                           Len of RQINDEX plot         46580000
*                                           counter entry            */ 46590000
*                                                                       46600000
*% IF IAZSMF84_SUBTYPE='ALL'    %THEN %GOTO SUBTYP6;                    46610000
*% IF IAZSMF84_SUBTYPE='ALLJ3'  %THEN %GOTO SUBTYP6;                    46620000
*% IF IAZSMF84_SUBTYPE='ALLJES' %THEN %GOTO SUBTYP6;                    46630000
*% IF IAZSMF84_SUBTYPE=''       %THEN %GOTO SUBTYP6;                    46640000
*% GOTO SUBDONE;                                                        46650000
*%SUBTYP6:;                                                             46660000
* @EJECT;                                                               46670000
*/********************************************************************/ 46680000
*/*                                                                  */ 46690000
*/*        SUBTYPE 6  --  HOT SPOT ANALYSIS SECTION                  */ 46700000
*/*                                                                  */ 46710000
*/********************************************************************/ 46720000
*                                                                       46730000
*   DCL 1 SMF84HSP BASED(Addr(SMF84HDR)+SMF84J1O),                      46740000
*     3 S84_%%SPLNG FIXED(31),    /* LENGTH OF THE JES3 HOT SPOT        46750000
*                                    ANALYSIS SECTION                */ 46760000
*     3 S84_%%SPNUM FIXED(31),    /* TOTAL NUMBER OF HOT SPOT           46770000
*                                    ENTRIES                         */ 46780000
*     3 S84_%%SPOF  FIXED(31),    /* OFFSET OF THE 1ST HOT SPOT         46790000
*                                    ENTRY                           */ 46800000
*     3 S84_%%SPOT  CHAR(8),      /* SPOT = VALUE                    */ 46810000
*     3 S84_%%WIDTH CHAR(8),      /* WIDTH = VALUE                   */ 46820000
*     3 S84_%%NAME  CHAR(8),      /* NAME = VALUE                    */ 46830000
*     3 S84_%%HFCT  CHAR(8),      /* HFCT = VALUE                    */ 46840000
*     3 S84_%%HSPFL BIT(8),       /* HOT SPOT FLAG                   */ 46850000
*       5 S84_%%HSPOV BIT(1),     /*  HOT SPOT TABLE EXCEEDED FLAG   */ 46860000
*       5 *           BIT(7),     /*  Reserved                       */ 46870000
*     3 *           CHAR(3);      /* RESERVED FOR DEVELOPMENT        */ 46880000
* DCL S84_%%SPSZ1 FIXED(31) CONSTANT(Length(SMF84HSP)); /*              46890000
*                                           Len of JES3 hot spot        46900000
*                                           analysis header          */ 46910000
*/********************************************************************/ 46920000
*/*   EACH HOT SPOT ENTRY CAN BE MAPPED BY THE FOLLOWING FORMAT.     */ 46930000
*/********************************************************************/ 46940000
* DCL 1 S84_%%HSP   BASED,                                              46950000
*     3 S84_%%SCSCT CHAR(8),      /* CSECT NAME                      */ 46960000
*     3 S84_%%STYPE CHAR(2),      /* CSECT TYPE                      */ 46970000
*     3 *           CHAR(2),      /* RESERVED FOR DEVELOPMENT        */ 46980000
*     3 S84_%%SSTRT FIXED(31),    /* STARTING ADDRESS OR DISPLACEMENT*/ 46990000
*     3 S84_%%SEND  FIXED(31),    /* ENDING ADDRESS OR DISPLACEMENT  */ 47000000
*     3 S84_%%SPCNT FIXED(31),    /* CSECT REFERENCE COUNT           */ 47010000
*     3 S84_%%SPNRF FIXED(31),    /* CSECT REFERENCE COUNT IN IATNUC */ 47020000
*     3 S84_%%SPARF FIXED(31);    /* CSECT REFERENCE COUNT IN IATAUX */ 47030000
* DCL S84_%%SPSZ2 FIXED(31) CONSTANT(Length(S84_%%HSP));   /*           47040000
*                                           Len of JES3 hot spot        47050000
*                                           entry                    */ 47060000
*                                                                       47070000
*% IF IAZSMF84_SUBTYPE='ALL'    %THEN %GOTO SUBTYP7;                    47080000
*% IF IAZSMF84_SUBTYPE='ALLJ3'  %THEN %GOTO SUBTYP7;                    47090000
*% IF IAZSMF84_SUBTYPE='ALLJES' %THEN %GOTO SUBTYP7;                    47100000
*% IF IAZSMF84_SUBTYPE=''       %THEN %GOTO SUBTYP7;                    47110000
*% GOTO SUBDONE;                                                        47120000
*%SUBTYP7:;                                                             47130000
* @EJECT;                                                               47140000
*/********************************************************************/ 47150000
*/*                                                                  */ 47160000
*/*        SUBTYPE 7  --  JES3 INTERNAL READER DSP ANALYSIS          */ 47170000
*/*                                                                  */ 47180000
*/********************************************************************/ 47190000
*                                                                       47200000
*   DCL 1 SMF84IR  BASED(Addr(SMF84HDR)+SMF84J1O),                      47210000
*     3 S84_%%IRLNG FIXED(31),    /* LENGTH OF THE JES3 INTERNAL        47220000
*                                    READER DSPS ANALYSIS SECTION    */ 47230000
*     3 S84_%%IRMN  FIXED(31),    /* MINIMUM NUMBER OF ACTIVE           47240000
*                                    INTERNAL READER DSPS            */ 47250000
*     3 S84_%%IRMX  FIXED(31),    /* MAXIMUM NUMBER OF ACTIVE           47260000
*                                    INTERNAL READER DSPS            */ 47270000
*     3 S84_%%IRAV  FIXED(31),    /* AVERAGE NUMBER OF ACTIVE           47280000
*                                    INTERNAL READER DSPS            */ 47290000
*     3 S84_%%IRIR  FIXED(31),    /* AVERAGE NUMBER OF IDLE INTERNAL    47300000
*                                    READER DSPS                     */ 47310000
*     3 S84_%%IRHWM FIXED(31),    /* INTERNAL READER DSP HIGH WATER     47320000
*                                    MARK                            */ 47330000
*     3 S84_%%IRATM FIXED(31),    /* ACTIVE-INTRDR-AT-MAX COUNT      */ 47340000
*     3 S84_%%IRAT0 FIXED(31),    /* NO-INTRDR-ACTIVE COUNT          */ 47350000
*     3 S84_%%IRAVL FIXED(31),    /* AVERAGE LENGTH OF THE INTRDR       47360000
*                                    QUEUE                           */ 47370000
*     3 S84_%%IRMXA FIXED(31);    /* MAXIMUM INTERNAL READER DSPS       47380000
*                                    ALLOWED                         */ 47390000
* DCL S84_%%IRSZ1 FIXED(31) CONSTANT(Length(SMF84IR));  /*              47400000
*                                           Len of INTRDR DSP           47410000
*                                           analysis section         */ 47420000
*                                                                       47430000
*% IF IAZSMF84_SUBTYPE='ALL'    %THEN %GOTO SUBTYP8;                    47440000
*% IF IAZSMF84_SUBTYPE='ALLJ3'  %THEN %GOTO SUBTYP8;                    47450000
*% IF IAZSMF84_SUBTYPE='ALLJES' %THEN %GOTO SUBTYP8;                    47460000
*% IF IAZSMF84_SUBTYPE=''       %THEN %GOTO SUBTYP8;                    47470000
*% GOTO SUBDONE;                                                        47480000
*%SUBTYP8:;                                                             47490000
* @EJECT;                                                               47500000
*/********************************************************************/ 47510000
*/*                                                                  */ 47520000
*/*        SUBTYPE 8  --  JES3 SSI RESPONSE TIME ANALYSIS            */ 47530000
*/*                                                                  */ 47540000
*/********************************************************************/ 47550000
*                                                                       47560000
*   DCL 1 SMF84SSI BASED(Addr(SMF84HDR)+SMF84J1O),                      47570000
*     3 S84_%%SILNG FIXED(31),    /* LENGTH OF THE SSI RESPONSE TIME    47580000
*                                    SECTION                         */ 47590000
*     3 S84_%%SSIN  FIXED(31),    /* TOTAL NUMBER OF SSI ENTRIES     */ 47600000
*     3 S84_%%SSIO  FIXED(31);    /* OFFSET OF THE 1ST SSI ENTRY     */ 47610000
* DCL S84_%%SISZ1 FIXED(31) CONSTANT(Length(SMF84SSI)); /*              47620000
*                                           Len of SSI response time    47630000
*                                           analysis header          */ 47640000
*/********************************************************************/ 47650000
*/*   EACH SSI ENTRY CAN BE MAPPED BY THE FOLLOWING FORMAT           */ 47660000
*/********************************************************************/ 47670000
* DCL 1 S84_%%SSI   BASED,                                              47680000
*     3 S84_%%SIFN  CHAR(12),     /* SSI FUNCTION CODE NAME          */ 47690000
*     3 S84_%%SIREQ FIXED(31),    /* NUMBER OF REQUESTS RECEIVED     */ 47700000
*     3 S84_%%SIRSP FIXED(31),    /* NUMBER OF RESPONSES RECEIVED    */ 47710000
*     3 S84_%%SIMIN FIXED(31),    /* MINIMUM RESPONSE TIME IN           47720000
*                                    MICROSECONDS                    */ 47730000
*     3 S84_%%SIMAX FIXED(31),    /* MAXIMUM RESPONSE TIME IN           47740000
*                                    MICROSECONDS                    */ 47750000
*     3 S84_%%SIAVG FIXED(31);    /* AVERAGE RESPONSE TIME IN           47760000
*                                    MICROSECONDS                    */ 47770000
* DCL S84_%%SISZ2 FIXED(31) CONSTANT(Length(S84_%%SSI));   /*           47780000
*                                           Len of SSI response time    47790000
*                                           analysis header          */ 47800000
*                                                                       47810000
*% IF IAZSMF84_SUBTYPE='ALL'    %THEN %GOTO SUBTYP9;                    47820000
*% IF IAZSMF84_SUBTYPE='ALLJ3'  %THEN %GOTO SUBTYP9;                    47830000
*% IF IAZSMF84_SUBTYPE='ALLJES' %THEN %GOTO SUBTYP9;                    47840000
*% IF IAZSMF84_SUBTYPE=''       %THEN %GOTO SUBTYP9;                    47850000
*% GOTO SUBDONE;                                                        47860000
*%SUBTYP9:;                                                             47870000
* @EJECT;                                                               47880000
*/********************************************************************/ 47890000
*/*                                                                  */ 47900000
*/*        SUBTYPE 9  --  JES3 SSI DESTINATION QUEUE ANALYSIS        */ 47910000
*/*                                                                  */ 47920000
*/********************************************************************/ 47930000
*                                                                       47940000
*   DCL 1 SMF84DSQ BASED(Addr(SMF84HDR)+SMF84J1O),                      47950000
*     3 S84_%%DQLNG FIXED(31),    /* LENGTH OF THE SSI DESTINATION      47960000
*                                    QUEUE SECTION                   */ 47970000
*     3 S84_%%DQNUM FIXED(31),    /* TOTAL NUMBER OF SSI DESTINATION    47980000
*                                    ENTRIES                         */ 47990000
*     3 S84_%%DQOF  FIXED(31);    /* OFFSET OF THE 1ST SSI DESTINATION  48000000
*                                    QUEUE ENTRY                     */ 48010000
* DCL S84_%%DQSZ1 FIXED(31) CONSTANT(Length(SMF84DSQ)); /*              48020000
*                                           Len of SSI dest queue       48030000
*                                           analysis header          */ 48040000
*/********************************************************************/ 48050000
*/*   EACH SSI DESTINATION ENTRY CAN BE MAPPED BY THE FOLLOWING      */ 48060000
*/*   FORMAT.                                                        */ 48070000
*/********************************************************************/ 48080000
* DCL 1 S84_%%DSQ   BASED,                                              48090000
*     3 S84_%%DQNAM CHAR(30),     /* SSI DESTINATION QUEUE NAME      */ 48100000
*     3 S84_%%DQFLG BIT(8),       /* DYNAMIC DESTQ FLAG BYTE         */ 48110000
*       5 S84_%%DGFSS BIT(1),     /*  DYN DESTQ / GLOBAL / FSS ONLY  */ 48120000
*       5 S84_%%DGFSA BIT(1),     /*  DYN DESTQ / GLOBAL / FSS/FSA   */ 48130000
*       5 S84_%%DLFSS BIT(1),     /*  DYN DESTQ / LOCAL / FSS ONLY   */ 48140000
*       5 S84_%%DLFSA BIT(1),     /*  DYN DESTQ / LOCAL / FSS/FSA    */ 48150000
*       5 *           BIT(4),     /* Reserved                        */ 48160000
*     3 *           CHAR(1),      /* RESERVED FOR DEVELOPMENT        */ 48170000
*                                                                       48180000
*     3 * UNION,                  /* FSS name or FSS id              */ 48190000
*      4 * ,                                                            48200000
*       5 S84_%%FSSNM CHAR(8),    /* FSS NAME (GLOBAL/DYN DESTQ         48210000
*                                    HEX ZEROS IF GLOBAL/NOT DYN        48220000
*                                    DESTQ)                          */ 48230000
*      4 * ,                                                            48240000
*       5 S84_%%FSSID FIXED(16),  /* FSS ID ( LOCAL/DYN DESTQ)       */ 48250000
*                                                                       48260000
*     3 * UNION,                  /* FSA name or FSA id              */ 48270000
*      4 * ,                                                            48280000
*       5 S84_%%FSANM CHAR(8),    /* FSA NAME (GLOBAL/DYN DESTQ AND     48290000
*                                    FSS/FSA ENTRY.  HEX ZEROS IF       48300000
*                                    GLOBAL/NOT DYN DESTQ, OR IF        48310000
*                                    GLOBAL/DYN DESTQ AND FSS ONLY      48320000
*                                    ENTRY).                         */ 48330000
*      4 * ,                                                            48340000
*       5 S84_%%FSAID CHAR(8),    /* FSA ID (LOCAL/DYN DESTQ) (HEX      48350000
*                                    ZEROS IF LOCAL/DYN DESTQ AND FSS   48360000
*                                    ONLY ENTRY).                    */ 48370000
*                                                                       48380000
*/********************************************************************/ 48390000
*/*                                                                  */ 48400000
*/*   THE FOLLOWING TABLE SHOWS THE CONTENTS OF R84DQFLG,            */ 48410000
*/*   R84FSSNM/R84FSSID, AND R84FSANM/R84FSAID FOR THE VARIOUS       */ 48420000
*/*   TYPES OF RECORDS MAPPED HERE. (A = ALPHANUMERIC CHARACTER,     */ 48430000
*/*   X = HEXADECIMAL BYTE, AND Z = HEX ZEROS BYTE).                 */ 48440000
*/*                                                                  */ 48450000
*/*   TYPE                 R84DQFLG  R84FSSNM    R84FSANM            */ 48460000
*/*                                  /R84FSSID   /R84FSAID           */ 48470000
*/*   NON-DYN.             X'00'     ZZZZZZZZ    ZZZZZZZZ            */ 48480000
*/*   DYN. GLOBAL FSS ONLY X'80'     AAAAAAAA    ZZZZZZZZ            */ 48490000
*/*   DYN. GLOBAL FSS/FSA  X'40'     AAAAAAAA    AAAAAAAA            */ 48500000
*/*   DYN. LOCAL  FSS ONLY X'20'     XXZZZZZZ    ZZZZZZZZ            */ 48510000
*/*   DYN. LOCAL  FSS/FSA  X'10'     XXZZZZZZ    XXZZZZZZ            */ 48520000
*/*                                                                  */ 48530000
*/********************************************************************/ 48540000
*     3 S84_%%DQMAX FIXED(31),    /* MAXIMUM DESTINATION QUEUE LENG  */ 48550000
*     3 S84_%%DQMIN FIXED(31),    /* MINIMUM DESTINATION QUEUE LENG  */ 48560000
*     3 S84_%%DQAVG FIXED(31);    /* AVERAGE DESTINATION QUEUE LENG  */ 48570000
* DCL S84_%%DQSZ2 FIXED(31) CONSTANT(Length(S84_%%DSQ));   /*           48580000
*                                           Len of SSI dest queue       48590000
*                                           analysis entry           */ 48600000
*                                                                       48610000
*% IF IAZSMF84_SUBTYPE='ALL'    %THEN %GOTO SUBTYP10;                   48620000
*% IF IAZSMF84_SUBTYPE='ALLJ3'  %THEN %GOTO SUBTYP10;                   48630000
*% IF IAZSMF84_SUBTYPE='ALLJES' %THEN %GOTO SUBTYP10;                   48640000
*% IF IAZSMF84_SUBTYPE=''       %THEN %GOTO SUBTYP10;                   48650000
*% GOTO SUBDONE;                                                        48660000
*%SUBTYP10:;                                                            48670000
* @EJECT;                                                               48680000
*/********************************************************************/ 48690000
*/*                                                                  */ 48700000
*/*      The following maps the subtype 10 - Workload Manager        */ 48710000
*/*      (WLM) information.                                          */ 48720000
*/*                                                                  */ 48730000
*/*      The WLM information consists of the following data          */ 48740000
*/*      sections:                                                   */ 48750000
*/*                                                                  */ 48760000
*/*      (1) WLM General section - contains offsets to the           */ 48770000
*/*          other sections.                                         */ 48780000
*/*                                                                  */ 48790000
*/*      (2) Service class section - Information is collected        */ 48800000
*/*          for each service class that had activity during         */ 48810000
*/*          the sampling interval.  The following sections          */ 48820000
*/*          are created for each service class:                     */ 48830000
*/*                                                                  */ 48840000
*/*          -- Service class fixed section - Contains the           */ 48850000
*/*             service class name and offsets to the other          */ 48860000
*/*             sections.                                            */ 48870000
*/*                                                                  */ 48880000
*/*          -- Service class non-system information -               */ 48890000
*/*             Contains non-system related information such         */ 48900000
*/*             as the number of jobs in MDS, GMS etc.               */ 48910000
*/*                                                                  */ 48920000
*/*          -- Service class system information - one entry         */ 48930000
*/*             for every system that had activity during            */ 48940000
*/*             the sampling interval.                               */ 48950000
*/*                                                                  */ 48960000
*/*-----------------------------------------------------------       */ 48970000
*/*                                                                  */ 48980000
*/*      The SMF 84 record for WLM has the following format.         */ 48990000
*/*      If all of the information fits into a single SMF            */ 49000000
*/*      buffer, the SMF record looks like this:                     */ 49010000
*/*                                                                  */ 49020000
*/*      -- SMF 84 header                                            */ 49030000
*/*      -- SMF 84 product section                                   */ 49040000
*/*      -- SMF 84 general section                                   */ 49050000
*/*                                                                  */ 49060000
*/*      -- WLM General/subtype 10 section                           */ 49070000
*/*                                                                  */ 49080000
*/*         -- Service Class Fixed Section - Srvclass #1             */ 49090000
*/*            -- Service Class - Non-system info                    */ 49100000
*/*            -- Service Class - System info #1                     */ 49110000
*/*                  .                                               */ 49120000
*/*                  .                                               */ 49130000
*/*                  .                                               */ 49140000
*/*            -- Service Class - System info #n                     */ 49150000
*/*                                                                  */ 49160000
*/*         -- Service Class Fixed Section - Srvclass #2             */ 49170000
*/*                  .                                               */ 49180000
*/*                  .                                               */ 49190000
*/*                  .                                               */ 49200000
*/*                                                                  */ 49210000
*/*-----------------------------------------------------------       */ 49220000
*/*                                                                  */ 49230000
*/*      If one or more service classes will not fit into            */ 49240000
*/*      a single buffer, the first buffer will look like            */ 49250000
*/*      the first example, but the second through nth               */ 49260000
*/*      buffers will look like this:                                */ 49270000
*/*                                                                  */ 49280000
*/*      -- SMF 84 header                                            */ 49290000
*/*                                                                  */ 49300000
*/*      -- WLM General/subtype 10 section                           */ 49310000
*/*                                                                  */ 49320000
*/*         -- Service Class Fixed Section - Srvclass #n             */ 49330000
*/*            -- Service Class - Non-system info                    */ 49340000
*/*            -- Service Class - System info #1                     */ 49350000
*/*                  .                                               */ 49360000
*/*                  .                                               */ 49370000
*/*                  .                                               */ 49380000
*/*            -- Service Class - System info #n                     */ 49390000
*/*                                                                  */ 49400000
*/*         -- Service Class Fixed Section - Srvclass #n+1           */ 49410000
*/*                  .                                               */ 49420000
*/*                  .                                               */ 49430000
*/*                  .                                               */ 49440000
*/*                                                                  */ 49450000
*/*-----------------------------------------------------------       */ 49460000
*/*                                                                  */ 49470000
*/*      It is also possible that the system specific                */ 49480000
*/*      information for a service class will not fit into           */ 49490000
*/*      a single buffer.  In this case, the information             */ 49500000
*/*      will be continued in the next buffer.  When this            */ 49510000
*/*      happens, the offset in the next buffer to the               */ 49520000
*/*      non-system specific information will be zero because        */ 49530000
*/*      the non-system information exists in the previous           */ 49540000
*/*      buffer.                                                     */ 49550000
*/*                                                                  */ 49560000
*/*      The continuation buffer will look like this:                */ 49570000
*/*                                                                  */ 49580000
*/*                                                                  */ 49590000
*/*      -- SMF 84 header                                            */ 49600000
*/*                                                                  */ 49610000
*/*      -- WLM General/subtype 10 section                           */ 49620000
*/*                                                                  */ 49630000
*/*         -- Service Class Fixed Section                           */ 49640000
*/*            -- Service Class - System info #m                     */ 49650000
*/*                  .                                               */ 49660000
*/*                  .                                               */ 49670000
*/*                  .                                               */ 49680000
*/*            -- Service Class - System info #n                     */ 49690000
*/*                                                                  */ 49700000
*/*         -- Service Class Fixed Section                           */ 49710000
*/*                  .                                               */ 49720000
*/*                  .                                               */ 49730000
*/*                  .                                               */ 49740000
*/*                                                                  */ 49750000
*/********************************************************************/ 49760000
* @SPACE (1);                                                           49770000
*/********************************************************************/ 49780000
*/*                                                                  */ 49790000
*/*        Subtype 10 - WLM General Section                          */ 49800000
*/*                                                                  */ 49810000
*/********************************************************************/ 49820000
*                                                                       49830000
*   DCL 1 SMF84WLM BASED(Addr(SMF84HDR)+SMF84J1O),                      49840000
*     3 S84_%%WLMLN FIXED(31),    /* Length of the WLM general          49850000
*                                    section                         */ 49860000
*     3 S84_%%SRVOF FIXED(31),    /* Offset to from this section to     49870000
*                                    the first service class section    49880000
*                                    or zero                         */ 49890000
*     3 S84_%%WLMGR(20) FIXED(31); /* Reserved for IBM               */ 49900000
* DCL S84_%%WLMSZ FIXED(31) CONSTANT(Length(SMF84WLM)); /*              49910000
*                                           Len of WLM general          49920000
*                                           section                  */ 49930000
*/********************************************************************/ 49940000
*/*                                                                  */ 49950000
*/*        Subtype 10 - Service Class Fixed Section                  */ 49960000
*/*                                                                  */ 49970000
*/********************************************************************/ 49980000
* DCL                                                                   49990000
*1 S84U_%%SRVCLASS BASED,         /* Service Class Fixed Section     */ 50000000
* 3 S84U_%%SRVCLEN  FIXED(31),    /* Length of this section          */ 50010000
* 3 S84U_%%SRVCNAME CHAR(8),      /* Service class name              */ 50020000
* 3 S84U_%%SRVCSMPC FIXED(31),    /* Number of samples this service     50030000
*                                    class was found                 */ 50040000
* 3 S84U_%%SRVCNXOF FIXED(31),    /* Offset from this section to the    50050000
*                                    next service class fixed section   50060000
*                                    in this buffer                  */ 50070000
* 3 S84U_%%SRVNSYOF FIXED(31),    /* Offset from this section to the    50080000
*                                    non-system specific information    50090000
*                                    for this service class.  This      50100000
*                                    will be zero if this is a          50110000
*                                    continuation buffer for system     50120000
*                                    specific information.           */ 50130000
* 3 S84U_%%SRVSYSOF FIXED(31),    /* Offset from this section to the    50140000
*                                    system specific information for    50150000
*                                    this service class in this         50160000
*                                    buffer                          */ 50170000
* 3 S84U_%%SRVCRSV1(4) FIXED(31); /* Reserved for IBM                */ 50180000
* DCL S84U_%%SRVCFSIZ FIXED(31) CONSTANT(Length(S84U_%%SRVCLASS));  /*  50190000
*                                           Len of fixed WLM section    50200000
*                                           section                  */ 50210000
*/********************************************************************/ 50220000
*/*                                                                  */ 50230000
*/*        Subtype 10 - Service Class Non-System Specific            */ 50240000
*/*                     Section                                      */ 50250000
*/*                                                                  */ 50260000
*/********************************************************************/ 50270000
* DCL                                                                   50280000
*1 S84U_%%SRVCNSYS BASED,         /* Non-System Specific Section     */ 50290000
* 3 S84U_%%NSYSLEN  FIXED(31),    /* Length of this section          */ 50300000
*/*------------------------------------------------------------------*/ 50310000
*/*   Start of sampling counts where we track the minimum,           */ 50320000
*/*   maximum, and average number of jobs.                           */ 50330000
*/*------------------------------------------------------------------*/ 50340000
* 3 S84U_%%NSYCCNTS ,             /* Start of sampling counts        */ 50350000
*                                                                       50360000
*/*------------------------------------------------------------------*/ 50370000
*/*   Main service wait and MDS sampling counts.                     */ 50380000
*/*------------------------------------------------------------------*/ 50390000
*                                                                       50400000
*  4 S84U_%%MAINW ,               /* Main service wait counts        */ 50410000
*   5 S84U_%%MAINWMIN  FIXED(31), /* Minimum count                   */ 50420000
*   5 S84U_%%MAINWMAX  FIXED(31), /* Maximum count                   */ 50430000
*   5 S84U_%%MAINWAVG  FIXED(31), /* Average count                   */ 50440000
*                                                                       50450000
*  4 S84U_%%MDS ,                 /* MDS counts                      */ 50460000
*   5 S84U_%%MDSMIN    FIXED(31), /* Minimum count                   */ 50470000
*   5 S84U_%%MDSMAX    FIXED(31), /* Maximum count                   */ 50480000
*   5 S84U_%%MDSAVG    FIXED(31), /* Average count                   */ 50490000
*                                                                       50500000
*/*------------------------------------------------------------------*/ 50510000
*/*   GMS sampling counts.                                           */ 50520000
*/*------------------------------------------------------------------*/ 50530000
*                                                                       50540000
*  4 S84U_%%GMS ,                 /* GMS total counts                */ 50550000
*   5 S84U_%%GMSMIN    FIXED(31), /* Minimum count                   */ 50560000
*   5 S84U_%%GMSMAX    FIXED(31), /* Maximum count                   */ 50570000
*   5 S84U_%%GMSAVG    FIXED(31), /* Average count                   */ 50580000
*                                                                       50590000
*  4 S84U_%%MOFNC ,               /* Main offline/not connected      */ 50600000
*   5 S84U_%%MOFNCMIN  FIXED(31), /* Minimum count                   */ 50610000
*   5 S84U_%%MOFNCMAX  FIXED(31), /* Maximum count                   */ 50620000
*   5 S84U_%%MOFNCAVG  FIXED(31), /* Average count                   */ 50630000
*                                                                       50640000
*  4 S84U_%%GRPDS ,               /* Group disabled                  */ 50650000
*   5 S84U_%%GRPDSMIN  FIXED(31), /* Minimum count                   */ 50660000
*   5 S84U_%%GRPDSMAX  FIXED(31), /* Maximum count                   */ 50670000
*   5 S84U_%%GRPDSAVG  FIXED(31), /* Average count                   */ 50680000
*                                                                       50690000
*  4 S84U_%%JBHLD ,               /* Job held                        */ 50700000
*   5 S84U_%%JBHLDMIN  FIXED(31), /* Minimum count                   */ 50710000
*   5 S84U_%%JBHLDMAX  FIXED(31), /* Maximum count                   */ 50720000
*   5 S84U_%%JBHLDAVG  FIXED(31), /* Average count                   */ 50730000
*                                                                       50740000
*  4 S84U_%%CLSDS ,               /* Class disabled                  */ 50750000
*   5 S84U_%%CLSDSMIN  FIXED(31), /* Minimum count                   */ 50760000
*   5 S84U_%%CLSDSMAX  FIXED(31), /* Maximum count                   */ 50770000
*   5 S84U_%%CLSDSAVG  FIXED(31), /* Average count                   */ 50780000
*                                                                       50790000
*  4 S84U_%%SCHEN ,               /* Scheduling environment is          50800000
*                                      not available                 */ 50810000
*   5 S84U_%%SCHENMIN  FIXED(31), /* Minimum count                   */ 50820000
*   5 S84U_%%SCHENMAX  FIXED(31), /* Maximum count                   */ 50830000
*   5 S84U_%%SCHENAVG  FIXED(31), /* Average count                   */ 50840000
*                                                                       50850000
*  4 S84U_%%SPOOL ,               /* Spool space shortage            */ 50860000
*   5 S84U_%%SPOOLMIN  FIXED(31), /* Minimum count                   */ 50870000
*   5 S84U_%%SPOOLMAX  FIXED(31), /* Maximum count                   */ 50880000
*   5 S84U_%%SPOOLAVG  FIXED(31), /* Average count                   */ 50890000
*                                                                       50900000
*  4 S84U_%%TDEPT ,               /* TDEPTH reached                  */ 50910000
*   5 S84U_%%TDEPTMIN  FIXED(31), /* Minimum count                   */ 50920000
*   5 S84U_%%TDEPTMAX  FIXED(31), /* Maximum count                   */ 50930000
*   5 S84U_%%TDEPTAVG  FIXED(31), /* Average count                   */ 50940000
*                                                                       50950000
*  4 S84U_%%TLIMT ,               /* TLIMIT exceeded                 */ 50960000
*   5 S84U_%%TLIMTMIN  FIXED(31), /* Minimum count                   */ 50970000
*   5 S84U_%%TLIMTMAX  FIXED(31), /* Maximum count                   */ 50980000
*   5 S84U_%%TLIMTAVG  FIXED(31), /* Average count                   */ 50990000
*                                                                       51000000
*  4 S84U_%%MDEPT ,               /* MDEPTH reached                  */ 51010000
*   5 S84U_%%MDEPTMIN  FIXED(31), /* Minimum count                   */ 51020000
*   5 S84U_%%MDEPTMAX  FIXED(31), /* Maximum count                   */ 51030000
*   5 S84U_%%MDEPTAVG  FIXED(31), /* Average count                   */ 51040000
*                                                                       51050000
*  4 S84U_%%MLIMT ,               /* MLIMIT exceeded                 */ 51060000
*   5 S84U_%%MLIMTMIN  FIXED(31), /* Minimum count                   */ 51070000
*   5 S84U_%%MLIMTMAX  FIXED(31), /* Maximum count                   */ 51080000
*   5 S84U_%%MLIMTAVG  FIXED(31), /* Average count                   */ 51090000
*                                                                       51100000
*/*------------------------------------------------------------------*/ 51110000
*/*   SYSPLEX sampling counts.                                       */ 51120000
*/*------------------------------------------------------------------*/ 51130000
*                                                                       51140000
*  4 S84U_%%PLELG ,               /* Number of jobs eligible to         51150000
*                                      run anywhere in the              51160000
*                                      SYSPLEX                       */ 51170000
*   5 S84U_%%PLELGMIN  FIXED(31), /* Minimum count                   */ 51180000
*   5 S84U_%%PLELGMAX  FIXED(31), /* Maximum count                   */ 51190000
*   5 S84U_%%PLELGAVG  FIXED(31), /* Average count                   */ 51200000
*                                                                       51210000
*  4 S84U_%%PLINE ,               /* Number of jobs ineligible          51220000
*                                      to run anywhere in the           51230000
*                                      SYSPLEX for reasons              51240000
*                                      other than class limits       */ 51250000
*   5 S84U_%%PLINEMIN  FIXED(31), /* Minimum count                   */ 51260000
*   5 S84U_%%PLINEMAX  FIXED(31), /* Maximum count                   */ 51270000
*   5 S84U_%%PLINEAVG  FIXED(31), /* Average count                   */ 51280000
*                                                                       51290000
*  4 S84U_%%PLLMT ,               /* Number of jobs ineligible          51300000
*                                      to run anywhere in the           51310000
*                                      SYSPLEX because of               51320000
*                                      class limits                  */ 51330000
*   5 S84U_%%PLLMTMIN  FIXED(31), /* Minimum count                   */ 51340000
*   5 S84U_%%PLLMTMAX  FIXED(31), /* Maximum count                   */ 51350000
*   5 S84U_%%PLLMTAVG  FIXED(31), /* Average count                   */ 51360000
*                                                                       51370000
*  4 S84U_%%PLEXE ,               /* Number of jobs in execution        51380000
*                                      somewhere in the SYSPLEX      */ 51390000
*   5 S84U_%%PLEXEMIN  FIXED(31), /* Minimum count                   */ 51400000
*   5 S84U_%%PLEXEMAX  FIXED(31), /* Maximum count                   */ 51410000
*   5 S84U_%%PLEXEAVG  FIXED(31), /* Average count                   */ 51420000
*                                                                       51430000
* 3 S84U_%%NSYSRSV1(6) FIXED(31); /* Reserved for IBM                */ 51440000
*                                                                       51450000
*/*------------------------------------------------------------------*/ 51460000
*/*   End of non-system service class section.                       */ 51470000
*/*------------------------------------------------------------------*/ 51480000
*                                                                       51490000
* DCL S84U_%%NSYSSIZE FIXED(31) CONSTANT(Length(S84U_%%SRVCNSYS)); /*   51500000
*                                           Len of non-system specific  51510000
*                                           section                  */ 51520000
*                                                                       51530000
*/********************************************************************/ 51540000
*/*                                                                  */ 51550000
*/*        Subtype 10 - Service Class System Specific Section        */ 51560000
*/*                                                                  */ 51570000
*/********************************************************************/ 51580000
* DCL                                                                   51590000
* 1 S84U_%%SRVCSYS  BASED,        /* System Specific Service class      51600000
*                                    section                         */ 51610000
*  3 S84U_%%SYSLEN   FIXED(31),   /* Length of this section          */ 51620000
*                                                                       51630000
*  3 S84U_%%SYSNXOF  FIXED(31),   /* Offset of next system              51640000
*                                      specific information for         51650000
*                                      this service class in            51660000
*                                      this buffer                   */ 51670000
*                                                                       51680000
*  3 S84U_%%SYSNAME  CHAR(8),     /* System name                     */ 51690000
*                                                                       51700000
*  3 S84U_%%SYELG ,               /* Number of jobs eligible to         51710000
*                                      run on this system            */ 51720000
*   4 S84U_%%SYELGMIN FIXED(31),  /* Minimum count                   */ 51730000
*   4 S84U_%%SYELGMAX FIXED(31),  /* Maximum count                   */ 51740000
*   4 S84U_%%SYELGAVG FIXED(31),  /* Average count                   */ 51750000
*                                                                       51760000
*  3 S84U_%%SYINE ,               /* Number of jobs ineligible          51770000
*                                      to run on this system         */ 51780000
*   4 S84U_%%SYINEMIN FIXED(31),  /* Minimum count                   */ 51790000
*   4 S84U_%%SYINEMAX FIXED(31),  /* Maximum count                   */ 51800000
*   4 S84U_%%SYINEAVG FIXED(31),  /* Average count                   */ 51810000
*                                                                       51820000
*  3 S84U_%%SYEXE ,               /* Number of jobs in execution        51830000
*                                      on this system                */ 51840000
*   4 S84U_%%SYEXEMIN FIXED(31),  /* Minimum count                   */ 51850000
*   4 S84U_%%SYEXEMAX FIXED(31),  /* Maximum count                   */ 51860000
*   4 S84U_%%SYEXEAVG FIXED(31),  /* Average count                   */ 51870000
*                                                                       51880000
*  3 S84U_%%SYCON ,               /* Number of jobs that can            51890000
*                                      execute only                     51900000
*                                        on this system              */ 51910000
*   4 S84U_%%SYCONMIN FIXED(31),  /* Minimum count                   */ 51920000
*   4 S84U_%%SYCONMAX FIXED(31),  /* Maximum count                   */ 51930000
*   4 S84U_%%SYCONAVG FIXED(31),  /* Average count                   */ 51940000
*                                                                       51950000
*  3 S84U_%%SYSRSVD1(3) FIXED(31);/* Reserved for IBM                */ 51960000
* DCL S84U_%%SYSSIZE FIXED(31) CONSTANT(Length(S84U_%%SRVCSYS)); /*     51970000
*                                           Len of system specific      51980000
*                                           section                  */ 51990000
*                                                                       52000000
*% IF IAZSMF84_SUBTYPE='ALLJ2'  %THEN %GOTO SUBTYP21;                   52010000
*% IF IAZSMF84_SUBTYPE='ALLJES' %THEN %GOTO SUBTYP21;                   52020000
*% IF IAZSMF84_SUBTYPE=''       %THEN %GOTO SUBTYP21;                   52030000
*% GOTO SUBDONE;                                                        52040000
*%SUBTYP21:;                                                            52050000
* @EJECT;                                                               52060000
*/********************************************************************/ 52070000
*/*                                                                  */ 52080000
*/*        Subtype 21 - JES2 resource usage section                  */ 52090000
*/*                                                                  */ 52100000
*/********************************************************************/ 52110000
* DCL                                                                   52120000
* 1 SMF84JRU BASED(Addr(SMF84HDR)+SMF84J1O),                            52130000
*     3 S84_%%J2RUL FIXED(31),    /* Length of the JES2 resource        52140000
*                                      usage section                 */ 52150000
*     3 *           CHAR(26),     /* Reserved                        */ 52160000
*/*------------------------------------------------------------------*/ 52170000
*/*   Triplets to describe data areas being returned.  All offsets   */ 52180000
*/*   in the section are from SMF84JRU.                              */ 52190000
*/*------------------------------------------------------------------*/ 52200000
*     3 S84_%%J2RTR FIXED(16),    /* Number of triplets              */ 52210000
*/*------------------------------------------------------------------*/ 52220000
*/*   Memory usage section (R84MEMJ2 DSECTs)                         */ 52230000
*/*------------------------------------------------------------------*/ 52240000
*     3 S84_%%J2RMO FIXED(31),    /* Offset to 1st R84MEMJ2          */ 52250000
*     3 S84_%%J2RML FIXED(16),    /* Length of a R84MEMJ2 entry      */ 52260000
*     3 S84_%%J2RMN FIXED(16),    /* Number of R84MEMJ2 entries      */ 52270000
*/*------------------------------------------------------------------*/ 52280000
*/*   Resource usage section (R84RSUJ2 DSECTs)                       */ 52290000
*/*------------------------------------------------------------------*/ 52300000
*     3 S84_%%J2RRO FIXED(31),    /* Offset to 1st R84RSUJ2          */ 52310000
*     3 S84_%%J2RRL FIXED(16),    /* Length of a R84RSUJ2 entry      */ 52320000
*     3 S84_%%J2RRN FIXED(16),    /* Number of R84RSUJ2 entries      */ 52330000
*     3 *  Char(0) Bdy(DWORD);    /* Align                           */ 52340000
* DCL S84_%%J2RZ1 FIXED(31) CONSTANT(Length(SMF84JRU));  /*             52350000
*                                           Len of JES2 resource        52360000
*                                           usage section            */ 52370000
*                                                                       52380000
*/*------------------------------------------------------------------*/ 52390000
*/*   R84MEMJ2 maps each storage element (corresponds to a storage   */ 52400000
*/*   area tracked)                                                  */ 52410000
*/*------------------------------------------------------------------*/ 52420000
* DCL                                                                   52430000
* 1 S84_%%MEMJ2 BASED ,           /* Memory usage data entry         */ 52440000
*  3 S84_%%MEM_NAME    CHAR(12),  /* Area name                       */ 52450000
*  3 *                 FIXED(31), /* Reserved                        */ 52460000
*                                                                       52470000
*  3 S84_%%MEM_REGION  FIXED(64), /* Region size in bytes            */ 52480000
*  3 S84_%%MEM_USE     FIXED(64), /* Current area usage in bytes     */ 52490000
*  3 S84_%%MEM_LOW     FIXED(64), /* Low usage value in bytes        */ 52500000
*  3 S84_%%MEM_HIGH    FIXED(64), /* High usage value in bytes       */ 52510000
*  3 S84_%%MEM_AVERAGE FIXED(64), /* Average in use in bytes         */ 52520000
*  3 * Char(0) Bdy(DWORD);        /* Align                           */ 52530000
* DCL S84_%%MEM_LEN FIXED(31) CONSTANT(Length(S84_%%MEMJ2));   /*       52540000
*                                           Len of JES2 memory data     52550000
*                                           entry                    */ 52560000
*                                                                       52570000
*/*------------------------------------------------------------------*/ 52580000
*/*   R84RSUJ2 maps each resource element (corresponds to an         */ 52590000
*/*   individual resource)                                           */ 52600000
*/*------------------------------------------------------------------*/ 52610000
* DCL                                                                   52620000
* 1 S84_%%RSUJ2 BASED ,           /* Memory usage data entry         */ 52630000
*  3 S84_%%RSU_NAME    CHAR(8),   /* Resource name                   */ 52640000
*  3 S84_%%RSU_LIMIT   FIXED(31), /* Current upper limit             */ 52650000
*  3 S84_%%RSU_INUSE   FIXED(31), /* Current number in use           */ 52660000
*  3 S84_%%RSU_LOW     FIXED(31), /* Low usage value                 */ 52670000
*  3 S84_%%RSU_HIGH    FIXED(31), /* High usage value                */ 52680000
*  3 S84_%%RSU_WARN    FIXED(16), /* WARN= value for resource           52690000
*                                      (zero if none)                */ 52700000
*  3 S84_%%RSU_FLG1    BIT(8),    /* Flag bytes                      */ 52710000
*    5 S84_%%RSU_F1OVER  Bit(1),  /*  Usage over warn level          */ 52720000
*    5 *                 Bit(7),  /*  Reserved                       */ 52730000
*  3 *                 FIXED(8),  /* Reserved                        */ 52740000
*  3 S84_%%RSU_OVER    FIXED(31), /* Count of samples over warn         52750000
*                                      level (HASP050 needed)        */ 52760000
*  3 S84_%%RSU_AVERAGE FIXED(31), /* Average in use value            */ 52770000
*  3 *                 FIXED(31), /* Reserved                        */ 52780000
*  3 * Char(0) Bdy(DWORD);        /* Align                           */ 52790000
* DCL S84_%%RSU_LEN FIXED(31) CONSTANT(Length(S84_%%RSUJ2));   /*       52800000
*                                           Len of JES2 resource data   52810000
*                                           entry                    */ 52820000
*                                                                       52830000
*% IF IAZSMF84_SUBTYPE='ALLJ2'  %THEN %GOTO SUBTYP22;                   52840000
*% IF IAZSMF84_SUBTYPE='ALLJES' %THEN %GOTO SUBTYP22;                   52850000
*% IF IAZSMF84_SUBTYPE=''       %THEN %GOTO SUBTYP22;                   52860000
*% GOTO SUBDONE;                                                        52870000
*%SUBTYP22:;                                                            52880000
*                                                                       52890000
*%SUBDONE:;                                                             52900000
*/*    Equate for SMF84RTY                                           */ 52910000
* DCL   SMFJ84   FIXED(8)  CONSTANT(84), /* JMF (JES performance)    */ 52920000
*/*    Equates for SMF84SBS                                          */ 52930000
*       SMF84HAS FIXED(16) CONSTANT(2),  /* JES2 ID                  */ 52940000
*       SMF84ASP FIXED(16) CONSTANT(5),  /* JES3 ID                  */ 52950000
*/*    Equates for SMF84VER                                          */ 52960000
*       SMF84V2  FIXED(8)  CONSTANT(2),  /* TEMPORARY FIX INDICATOR  */ 52970000
*       SMF84V3  FIXED(8)  CONSTANT(3);  /* OS390 2.4.0              */ 52980000
*                                                                       52990000
* @Logic;                                                               53000000
* #PRAGMA TOOL=PADI.                                                    53010000
* #LINE.Dcl SMF84PTR Pointer(31);                                       53020000
* #PADIDELETE.SMF84PTR                                                  53030000
* #PADIDELETE.R84BEQNM                                                  53040000
* #PADIDELETE.R84WLMEN                                                  53050000
* #PADIDELETE.R84_SRVCFEND                                              53060000
* #PADIDELETE.R84_NSYSEND                                               53070000
* #PADIDELETE.R84_SYSEND                                                53080000
* #EPRAGMA                                                              53090000
* @ENDLOGIC;                                                            99999999
