*%GOTO IAZPRO53;         /*                                             00020000
         MACRO                                                          00030000
         IAZSMF53 ,                                                  */ 00040000
*%IAZPRO53: ;                                                           00050000
*/* START OF SPECIFICATIONS **********************************          00060000
.****PROPRIETARY-STATEMENT************************************          00070000
.*01* PROPRIETARY STATEMENT:                                 *          00080000
.*                                                           *          00090000
.*    LICENSED MATERIALS-PROPERTY OF IBM                     *          00100000
.*    5650-ZOS Copyright IBM Corp. 1983, 2019                *          00110000
.*                                                           *          00120000
.*    STATUS:  HBB77C0                                       *          00130000
.*                                                           *          00140000
.****END-OF-PROPRIETARY-STATEMENT*****************************          00200000
*                                                            *          00300000
*01* DESCRIPTIVE NAME:  JES SMF SNA stop event record        *          00400000
*02*  ACRONYM:  IAZSMF53                                     *          00500000
*                                                            *          00600000
*01* MACRO NAME:  IAZSMF53                                   *          00700000
*                                                            *          01300000
*01* DSECT NAME:  N/A                                        *          01310000
*01* LABEL PREFIX:  SMF53                                    *          01330000
*                                                            *          01340000
*01* COMPONENT ID:  JES Common (SC141)                       *          01400000
*                                                            *          01500000
*01* EXTERNAL CLASSIFICATION: PI                             *          01510000
*01* END OF EXTERNAL CLASSIFICATION:                         *          01511000
*                                                            *          01520000
*** END OF SPECIFICATIONS   **********************************       */ 01530000
*%GOTO IAZ53;                                                        /* 01600000
.*                                                                   *  01700000
.* INVOCATION =                                                      *  01800000
.*               BAL  - IAZSMF53 (NO DSECT CREATED - START OF RECORD *  01900000
.*                       IS AT SMFRCD53 )                            *  02000000
.*               PL/S - %INCLUDE SYSLIB(IAZSMF53)                    *  02010000
.*                      DCL SMF53PTR PTR                             *  02100000
.*                                                                   *  02110000
.* CHANGE ACTIVITY:                                                  *  02200000
.*                                                                   *  02300000
.*                MVS/SP RELEASE 3 LEVEL 3 (SP1.3.3,JBB1329,JBB2125) *  02400000
.*                THIS MACRO ADDED TO SC141 VIA OZ81648              *  02410000
.* $Z07LTCP=NJETCP   HBB7720 030922 CLW:  Misc. signon changes       *  02420000
.*                                                                   *  02430000
.* $S202710=CHEADERS HBB77C0 190212 TJW:  Updates for C headers      *  02440000
.*                                        S202710                    *  02450000
.*                                                                   *  02500000
.* A000000-999999    CREATED FOR MVS 1.3.3                         @133 02520000
.*********************************************************************  02600000
         SPACE 2                                                        02700000
* SWITCH TO DETERMINE WHETHER TO GENERATE EQUATES FOR WRITING REC       02800000
         GBLB  &EQUSW                                                   02900000
         SPACE 1                                                        03000000
SMFRCD53 EQU   *                   START OF RECORD                      03100000
SMF53PTR EQU   *                   HEADER SEGMENT              @OZ82688 03200000
SMF53LEN DS    CL2                 RECORD LENGTH                        03300000
SMF53SEG DS    CL2                 SEGMENT DESCRIPTOR                   03400000
         SPACE 2                                                        03500000
*  BEGINNING OF JMR OR HASP SMF RECORD                                  03600000
         SPACE 1                                                        03700000
SMF53FLG DC    BL1'0'              HEADER FLAG BYTE                     03800000
SMF53RTY DC    BL1'0'              RECORD TYPE                          03900000
SMF53TME DC    BL4'0'              TOD, USING FORMAT FROM TIME MACRO    04000000
SMF53DTE DC    PL4'0000'           DATE IN PACKD DECIMAL FORM  00YYDDDF 04100000
SMF53SID DC    CL4' '              SYSTEM IDENTIFICATION                04200000
         SPACE 2                                                        04300000
* HEADER FOR HASP SUBSYSTEM RECORD TYPE 53                              04400000
SMFJ53   EQU   53                  RECORD TYPE SNA STOP EVENT  @OZ82688 04500000
         SPACE 1                                                        04600000
SMF53PRO DC    BL2'0'              OFFSET TO PRODUCT SECTION            04700000
SMF53PRL DC    BL2'0'              LENGTH OF PRODUCT SECTION            04800000
SMF53PRN DC    BL2'0'              NUMBER OF PRODUCT SECTION            04900000
SMF53IDO DC    BL2'0'              OFFSET TO ID SECTION                 05000000
SMF53IDL DC    BL2'0'              LENGTH OF ID SECTION                 05100000
SMF53IDN DC    BL2'0'              NUMBER OF ID SECTION                 05200000
         SPACE 1                                                        05300000
* PRODUCT SECTION HASP SUBSYSTEM RECORD TYPE 53                         05400000
         SPACE 1                                                        05500000
SMF53OPS DS    0C                  Define start of product section      05510000
SMF53SUB DC    BL2'0'              SUBTYPE ID NUMBER                    05600000
* THE FOLLOWING EQUATES APPLY TO RECORD TYPE 53                         05700000
SMF53LOF EQU   1                      LOGOFF EVENT                      05800000
SMF53PLN EQU   2                      STOP LINE EVENT                   05900000
SMF53VER DC    CL2'01'             RECORD VERSION NUMBER                06000000
SMF53SYS DC    CL4'JES2'           SUBSYSTEM NAME                       06100000
         SPACE 2                                                        06300000
* ID SECTION OF HASP TYPE 53 (SNA) STOP EVENT AFTER TWO HDRS            06400000
         SPACE 1                                                        06500000
SMF53IDS DS    0C                  Define start of id section           06510000
SMF53RMT DC    CL8' '              REMOTE NAME                          06600000
SMF53LIN DC    CL8' '              LINE NAME                            06700000
SMF53PSW DC    CL8' '              LINE PASSWORD                        06800000
SMF53CTR DC    XL(5*4)'00'         LINE EVENT COUNTERS                  06900000
SMF53ADP DC    CL3'SNA'            LINE IDENTIFIER                      07000000
SMF53END DS    0C                  END OF TYPE 53 RECORD                07100000
         AIF (NOT &EQUSW).SKIP                                          07200000
SMF53OFP EQU SMF53IDN+L'SMF53IDN-SMFRCD53  OFFSET TO PROD SECT @Z07LTCP 07210000
SMF53LPR EQU SMF53SYS+L'SMF53SYS-SMF53SUB  LENGTH OF PROD SECT @Z07LTCP 07220000
SMF53OFI EQU SMF53SYS+L'SMF53SYS-SMFRCD53  OFFSET TO ID SECT   @Z07LTCP 07230000
SMF53LID EQU SMF53END-SMF53IDS             LENGTH OF ID SECT   @Z07LTCP 07300000
.SKIP    ANOP                                                           07400000
         MEND       */                                                  07410000
*%IAZ53:;                                                               07420000
*%  DCL  EQUSW FIXED EXTERNAL; /*SWITCH TO DETERMINE WHETHER TO         07430000
*                                GENERATE EQUATES FOR WRITING REC    */ 07440000
*   DCL 1 SMFRCD53 BASED(SMF53PTR) BDY(WORD),                           07450000
*        3 SMF53LEN FIXED(15),    /* RECORD LENGTH                   */ 07460000
*        3 SMF53SEG FIXED(15),    /* SEGMENT DESCRIPTOR              */ 07470000
*                                                                       07480000
*/* Beginning of JMR or HASP SMF record                              */ 07490000
*        3 SMF53FLG BIT(8),       /* HEADER FLAG BYTE                */ 07500000
*        3 SMF53RTY FIXED(8),     /* RECORD TYPE                     */ 07510000
*        3 SMF53TME FIXED(32)     /* TOD, USING TIME MACRO FORMAT    */ 07520000
*                   BDY(BYTE),                                          07530000
*        3 SMF53DTE FIXED(32)     /* DATE PACKD DECIMAL FORM 00YYDDD */ 07540000
*                   BDY(BYTE),                                          07550000
*        3 SMF53SID CHAR(4),      /* SYSTEM IDENTIFICATION           */ 07560000
*                                                                       07570000
*/* Header for HASP subsystem record type 53                         */ 07580000
*        3 SMF53PRO FIXED(15),    /* OFFSET TO PRODUCT SECTION       */ 07590000
*        3 SMF53PRL FIXED(15),    /* LENGTH OF PRODUCT SECTION       */ 07600000
*        3 SMF53PRN FIXED(15),    /* NUMBER OF PRODUCT SECTION       */ 07610000
*        3 SMF53IDO FIXED(15),    /* OFFSET TO ID SECTION            */ 07620000
*        3 SMF53IDL FIXED(15),    /* LENGTH OF ID SECTION            */ 07630000
*        3 SMF53IDN FIXED(15);    /* NUMBER OF ID SECTION            */ 07640000
*                                                                       07650000
*/* Product section HASP subsystem record type 53                    */ 07660000
*   DCL 1 SMF53OPS BASED(ADDR(SMFRCD53)+SMF53PRO) BDY(WORD),            07670000
*        3 SMF53SUB FIXED(15),    /* SUBTYPE ID NUMBER               */ 07680000
*        3 SMF53VER CHAR(2),      /* RECORD VERSION NUMBER           */ 07690000
*        3 SMF53SYS CHAR(4);      /* SUBSYSTEM NAME                  */ 07700000
*                                                                       07710000
*/* Id section of HASP type 53 (SNA) stop event after two hdrs       */ 07720000
*   DCL 1 SMF53IDS BASED(ADDR(SMFRCD53)+SMF53IDO) BDY(WORD),            07730000
*        3 SMF53RMT CHAR(8),      /* REMOTE NAME                     */ 07740000
*        3 SMF53LIN CHAR(8),      /* LINE NAME                       */ 07750000
*        3 SMF53PSW CHAR(8),      /* LINE PASSWORD                   */ 07760000
*        3 SMF53CTR(5) FIXED(31)  /* LINE EVENT COUNTERS             */ 07770000
*                   BDY(BYTE),                                          07780000
*        3 SMF53ADP CHAR(3);      /* LINE IDENTIFIER                 */ 07790000
*                                                                       07800000
*%IF EQUSW=0 %THEN %GOTO SKIP53;                                        07810000
*/*    Length equates for writing this SMF record                    */ 07820000
* DCL   SMF53LPR FIXED(31) CONSTANT(LENGTH(SMF53OPS)), /*               07830000
*                                           Len of product section   */ 07840000
*       SMF53LID FIXED(31) CONSTANT(LENGTH(SMF53IDS)), /*               07850000
*                                           Length of id section     */ 07860000
*/*    Equate for SMF53RTY                                           */ 07870000
*       SMFJ53   FIXED(8)  CONSTANT(53), /* SNA stop event record    */ 07880000
*/*    Equate for SMF53SUB                                           */ 07890000
*       SMF53LOF FIXED(16) CONSTANT(1),  /* Logoff event             */ 07900000
*       SMF53PLN FIXED(16) CONSTANT(2);  /* Stop line event          */ 07910000
*%SKIP53:  ;                                                            07920000
* @Logic;                                                               07930000
* #PRAGMA TOOL=PADI.                                                    07940000
* #ASMLINE.         GBLB  &EQUSW                                        07950000
* #ASMLINE.&EQUSW   SETB  1                                             07960000
* #ASMLINE.         IAZSMF53                                            07970000
* #LINE.Dcl SMF53PTR Pointer(31);                                       07980000
* #LINE.% DCL   EQUSW FIXED EXTERNAL;                                   07990000
* #LINE.% EQUSW = 1;                                                    08000000
* #PADIDELETE.SMF53PTR                                                  08010000
* #PADIDELETE.SMF53IDS                                                  08020000
* #PADIDELETE.SMF53END                                                  08030000
* #PADIDELETE.SMF53OFP                                                  08040000
* #PADIDELETE.SMF53OFI                                                  08050000
* #EPRAGMA                                                              08060000
* @ENDLOGIC;                                                            99999999
