*        %GOTO SSNUCMTS;          /* Bilingual Mapping Macro            00100000
         MACRO                                                          00200000
         IAZSSNU &DSECT=NO                                              00300000
.*/      %SSNUCMTS: ;                                             /* */ 00310000
*/**** START OF SPECIFICATIONS *******************************          00400000
.****PROPRIETARY-STATEMENT************************************          00405000
.*01* PROPRIETARY STATEMENT:                                 *          00408000
.*                                                           *          00414000
.*    LICENSED MATERIALS-PROPERTY OF IBM                     *          00423000
.*    5650-ZOS Copyright IBM Corp. 1990, 2021                *          00441000
.*                                                           *          00459000
.*    STATUS = HBB77D0                                       *          00468000
.*                                                           *          00477000
.****END-OF-PROPRIETARY-STATEMENT*****************************          00486000
*                                                            *          00700000
*01* DESCRIPTIVE NAME:  JES Notify User Message Service      *          00710000
*                       SSOB Extension                       *          00720000
*02*  ACRONYM:  SSNU                                         *          00800000
*                                                            *          00900000
*01* MACRO NAME:  IAZSSNU                                    * @Z23D013 00910000
*                                                            *          00920000
*01* DSECT NAME:  SSNU                                       *          00930000
*01* LABEL PREFIX:  SSNU                                     *          00940000
*                                                            *          00950000
*01* COMPONENT ID:  JES COMMON (SC141)                       *          00960000
*                                                            *          00970000
*01* EXTERNAL CLASSIFICATION:  GUPI                          *          00980000
*01* END OF EXTERNAL CLASSIFICATION:                         *          00990000
*                                                            *          01000000
*01* EYE-CATCHER:  None                                      *          01010000
*02*  OFFSET:      N/A                                       *          01020000
*02*  LENGTH:      N/A                                       *          01030000
*                                                            *          01100000
*01* STORAGE ATTRIBUTES:                                     *          01110000
*02*  SUBPOOL:  any                                          *          01120000
*02*  KEY:  any                                              *          02200000
*02*  RESIDENCY:                                             *          02300000
*      Virtual and real storage above or below 16M, in       *          02400000
*      private storage.                                      *          02500000
*                                                            *          02600000
*01* SIZE:                                                   *          02700000
*                                                            *          02800000
*     See SSNUSIZE                                           *          02900000
*                                                            *          03000000
*01* CREATED BY:                                             *          03100000
*                                                            *          03200000
*     caller of SSI function 'SSOBSSNU' = 75                 *          03300000
*                                                            *          03400000
*01* POINTED TO BY:                                          *          03500000
*                                                            *          03600000
*     SSOBINDV field of the SSOB     data area               *          03700000
*                                                            *          03800000
*01* SERIALIZATION:                                          *          03900000
*                                                            *          04000000
*     None required                                          *          04100000
*                                                            *          04200000
*01* FUNCTION:                                               *          04300000
*                                                            *          04400000
*     This macro provides the mapping of the SSOB            *          04500000
*     extension used to request service of the               *          04600000
*     Notify User SSI to send messages to other system       *          04700000
*     destinations.                                          *          04800000
*                                                            *          04900000
*01* METHOD OF ACCESS:                                       *          04910000
*                                                            *          04920000
*02*  PL/X:                                                  *          04930000
*      Specify the following:                                *          05000000
*                                                            *          05100000
*           %DCL SSNU_ATRB CHAR                              *          05200000
*           %SSNU_ATRB = 'value'                             *          05300000
*           %INCLUDE SYSLIB(IAZSSNU)                         *          05400000
*                                                            *          05500000
*      where value is valid control block attributes, such   *          05600000
*      as 'BASED(SSOBINDV)'.                                 *          05700000
*                                                            *          05800000
*      In addition, the SSOB header field SSOBINDV should    *          05900000
*      always be initialized by the caller to point          *          06000000
*      to the functional extension.                          *          06100000
*                                                            *          06200000
*02*  ASM:                                                   *          06300000
*      IAZSSNU DSECT=YES!NO                                  *          06310000
*                                                            *          06320000
*        DSECT=YES  - Provided DSECT for SSNU                *          06330000
*                                                            *          06340000
*        DSECT=NO   - Provides storage definition for SSNU   *          06350000
*                                                            *          06400000
*      If DSECT=NO is specified, then you must ensure        *          06600000
*      that label SSOBGN is defined.  This can be            *          06700000
*      accomplished by either using the IEFJSSOB macro       *          06800000
*      to define the SSOB header along with at least one     *          06900000
*      extension.  Otherwise, you must define label          *          07000000
*      SSOBGN immediately following the SSOB header.         *          07100000
*                                                            *          07110000
*      In addition, the SSOB header field SSOBINDV should    *          07200000
*      always be initialized by the caller to point          *          07300000
*      to the functional extension.                          *          07400000
*                                                            *          07500000
*01* USED BY:                                                *          07600000
*                                                            *          07700000
*      SSI 75 (NOTIFY) processing                            *          07800000
*                                                            *          08200000
*01* DELETED BY:                                             *          08300000
*                                                            *          08400000
*     caller of SSI function 'SSOBSSNU' = 75                 *          08500000
*                                                            *          08600000
*01* FREQUENCY:                                              *          08700000
*                                                            *          08800000
*     1 per SSI call                                         *          08900000
*                                                            *          09000000
*01* RESTRICTIONS:                                           *          09100000
*                                                            *          09200000
*     None                                                   *          09300000
*                                                            *          09400000
**** END OF SPECIFICATIONS ***********************************       */ 09410000
*/********************************************************************* 09500000
*01* CHANGE ACTIVITY:                                                 * 09600000
*                                                                     * 10100000
*  $VC1PB36=PTM      HBB6603 951109 VLC:  BCP Ext.Classifications     * 10110000
*  $VC1P036=PTM      HBB6603 951208 VLC:  BCP PR20036 Ext.Class       * 10120000
*                                                                     * 10130000
*  $Z07LTCP=NJETCP   HBB7720 040517 CLW:  SYSOUT Receiver             * 10140000
* $ME02156=NJETCP   HBB7720 041111 CLW:  SHOWHDR IAZSSNU              * 10150000
*                                        ME02156                      * 10160000
*                                                                     * 10170000
* $Z09LAPF=APFMITG  HBB7740 060829 MJM5: SSI 75 Notify user           * 10180000
* $ME08400=APFMITG  HBB7740 061107 NAW:  Length error reason code     * 10182000
*                                        ME08400                      * 10188000
*                                                                     * 10192000
* $Z23LNFY=EMNOTIFY HBB77B0 160302 ALP:  EDS infrastructure           * 10196000
* $Z23LNFY=EMNOTIFY HBB77B0 161130 ALP:  Misc EDS fixes               * 10198000
*                                                                     * 10198500
* $S202710=CHEADERS HBB77C0 190212 TJW:  Updates for C headers        * 10199000
*                                        S202710                      * 10199500
*                                                                     * 10200000
* A000000-999999          Created for MVS 4.1.0                @410D010 10210000
*********************************************************************** 10300000
*                                                                    */ 10700000
* % GOTO END_OF_ASM_SSNU; /*                                            10800000
*                                                                       10900000
**************************************************************          11000000
*                                                            *          11100000
*   Constants for Notify User Message Router SSI Extension   *          11200000
*                                                            *          11300000
**************************************************************          11400000
*                                                                       11500000
*        FUNCTION VALUE FOR SSOBFUNC                                    11600000
SSOBSSNU EQU   75               JES Notify User Function ID             11700000
*                                                                       11800000
*        RETURN CODE VALUES FOR SSOBRETN                                11900000
SSNUOK   EQU   0                  Notify Request Successful             12000000
SSNUOKB  EQU   4                  Notify Request Success BUT            12100000
SSNUERR  EQU   8                  Notify Request Error see             C12200000
                                    SSNUERCD for reason code            12210000
SSNUNEX  EQU   12                 Notify no extension found             12220000
*                                                                       12300000
*        REASON CODE VALUES FOR SSNUERCD                                12400000
SSNURQOK EQU   0                  Notify Request Successful             12500000
SSNUMSGT EQU   4                  Notify Successful BUT msg             12600000
*                                   truncated                           12700000
SSNUEXC  EQU   8                  Exit cancelled notify                 12710000
SSNUNUSR EQU   12                 No destination specified     @Z23LNFY 12800000
SSNUINVD EQU   16                 Notify Invalid destination            12900000
SSNUIVID EQU   20                 Invalid SSNU extension id             13000000
SSNUIVER EQU   24                 Invalid SSNU version                  13100000
SSNUNOST EQU   28                 No storage to process req             13200000
SSNUNOAU EQU   32                 No authorization                      13300000
SSNUMSGE EQU   36                 Error in msg specification   @410P362 13310000
SSNUUNTK EQU   40                 Notify successful BUT user   @Z09LAPFC13320000
                                    token not allowed for      @Z09LAPFC13330000
                                    unauthorized caller        @Z09LAPF 13340000
SSNUINVE EQU   44                 Invalid SSNU extension       @Z23D103 13350000
SSNUMEME EQU   48                 Invalid member name            @Z09DL 13360000
SSNUEMNA EQU   52                 Email services not available @Z23LNFYC13362000
                                   in JESPLEX                  @Z23LNFY 13364000
SSNUEMNM EQU   56                 Email services not available @Z23LNFYC13366000
                                   on this member              @Z23LNFY 13368000
SSNUIVAD EQU   60                 Invalid email address        @Z23LNFY 13370000
SSNUIVFR EQU   64                 Invalid "from" string        @Z23LNFY 13372000
SSNUPRER EQU   68                 Parameters changed while     @Z23LNFYC13374000
                                   being processed                      13376000
SSNUXLNG EQU   72                 Message is too long          @Z23LNFY 13378000
SSNUIVBD EQU   76                 Error in message body        @Z23LNFY 13380000
SSNUIVSJ EQU   80                 Invalid subject string       @Z23LNFY 13382000
SSNUIVCD EQU   84                 Unsupported character        @Z23LNFYC13384000
                                   encoding                    @Z23LNFY 13386000
*                                                                       13400000
**************************************************************          13500000
*                                                            *          13600000
*   SSI SSOB Extension for Notify User Message Router-SSNU   *          13700000
*                                                            *          13800000
**************************************************************          13900000
*                                                                       14000000
         AIF   ('&DSECT' EQ 'YES').SSNU010                              14010000
         AIF   ('&DSECT' EQ 'NO').SSNU020                               14020000
         MNOTE 8,'IAZSSNU:  DSECT MUST BE EITHER YES OR NO'             14030000
         AGO   .END                                                     14040000
.SSNU010 ANOP                                                           14050000
SSNUBGN  DSECT ,                   SSNU extension mapping - SSNUBGN     14060000
         AGO   .SSNU030                                                 14070000
.SSNU020 ANOP                                                           14080000
         ORG   SSOBGN                                                   14100000
SSNUBGN  EQU   *                                                        14200000
.SSNU030 ANOP                                                           14210000
SSNUID   DC    CL4'SSNU'          Extension Identifier                  14300000
SSNULEN  DC    AL2(SSNUSIZE)      Length of SSOB Extensn area           14400000
SSNUVER  DS    BL1                Service Version Number                14500000
SSNUCVER EQU   1                  Service Version Number                14600000
*                                 of IAZSSNU - Version 4.1.0            14700000
SSNUVER2 EQU   2                  Service Version Number       @Z23LNFYC14710000
                                   of IAZSSNU - z/OS 2.3                14800000
SSNURSV1 DS    BL1                Reserved                              14900000
*                                                                       15000000
SSNUERCD DS    H                  Reason code for Error RC              15100000
SSNUFLG1 DS    BL1                Flag Byte 1                           15200000
SSNU1MLO EQU   X'80'               Send msg IFF user log'd on           15300000
SSNU1CON EQU   X'40'               Send to console if uid null          15310000
*                                                                       15312000
*------------------------------------------------------------* @Z23LNFY 15316000
*        Email delivery flags:                               * @Z23LNFY 15320000
*        - Normally, copy of an email message is saved on    * @Z23LNFY 15324000
*          SPOOL to ensure message delivery.                 * @Z23LNFY 15328000
*          Caller can request to wait for confirmation from  * @Z23LNFY 15332000
*          Email delivery service that message was saved on  * @Z23LNFY 15336000
*          SPOOL.                                            * @Z23LNFY 15340000
*        - Alternatively, caller can indicate that message   * @Z23LNFY 15344000
*          does not need to be saved ("light weight          * @Z23LNFY 15348000
*          message"). Such message requires less overhead,   * @Z23LNFY 15352000
*          but can be lost if email server is not active or  * @Z23LNFY 15356000
*          in case of a system failure.                      * @Z23LNFY 15360000
*------------------------------------------------------------* @Z23LNFY 15364000
*                                                                       15368000
SSNU1WT  EQU   X'20'               Wait until message is saved @Z23LNFY 15372000
SSNU1LWM EQU   X'10'               Light weight message        @Z23LNFY 15376000
*                                                                       15380000
SSNURSV2 DS    BL1                Reserved                              15400000
*                                                                       15500000
SSNUTKNA DS    A                  Address of user token(opt)            15600000
*                                                                       15700000
SSNUNODE DS    CL8                Receiving NODE name                   15800000
SSNUUSER DS    CL8                Receiving USERID                      15900000
SSNUMLEN DS    H                  Length of msg to be sent              16000000
SSNURSV4 DS    H                  Reserved                              16100000
SSNUMSG  DS    A                  Address of msg to be sent             16200000
*                                                                       16300000
SSNUMEMB DS    CL4                Member name for send           @Z09DLC16310000
                                   (JES2 only - JES3 always      @Z09DLC16311000
                                   issues SEND from GLOBAL).     @Z09DL 16314000
         DS    F                  Reserved for future use               16320000
*                                                                       16400000
*------------------------------------------------------------* @Z23LNFY 16410000
*        End of SSNU version 1                               * @Z23LNFY 16420000
*------------------------------------------------------------* @Z23LNFY 16430000
*                                                                       16440000
SSNUSIZE EQU   *-SSNUBGN          SSOB Extension length                 16500000
SSNULEN8 EQU   SSOBHSIZ+SSNUSIZE  Total SSOB Length w/NU Ext            16600000
*                                                                       16601000
*------------------------------------------------------------* @Z23LNFY 16602000
*        If SSI encounters an error that affects only one    * @Z23LNFY 16603000
*        delivery method, SSI will return an error code but  * @Z23LNFY 16604000
*        will still attempt another method.                  * @Z23LNFY 16605000
*        To check if any messages have been successfully     * @Z23LNFY 16606000
*        sent, examine result flags field SSNURESF.          * @Z23LNFY 16607000
*------------------------------------------------------------* @Z23LNFY 16608000
*                                                                       16609000
SSNURESF DS    B                  O.Result flags:              @Z23LNFY 16610000
SSNURFTS EQU   X'80'               TSO message was sent        @Z23LNFY 16611000
SSNURFEM EQU   X'40'               Email message was sent      @Z23LNFY 16612000
*                                                                       16613000
         DS    XL7                Reserved                     @Z23LNFY 16614000
*                                                                       16615000
*------------------------------------------------------------* @Z23LNFY 16616000
*        List of email addresses.                            * @Z23LNFY 16617000
*        SSNUADDR points to a list of entries mapped         * @Z23LNFY 16618000
*        by SSNUTXEN.                                        * @Z23LNFY 16619000
*------------------------------------------------------------* @Z23LNFY 16620000
*                                                                       16621000
SSNUADDR DS    AD                 I.Ptr to email address chain @Z23LNFY 16622000
*                                                                       16623000
*------------------------------------------------------------* @Z23LNFY 16624000
*        Optional "from" string for email message.           * @Z23LNFY 16625000
*        SSNUFROM points to a structure mapped by SSNUTXEN.  * @Z23LNFY 16626000
*------------------------------------------------------------* @Z23LNFY 16627000
*                                                                       16628000
SSNUFROM DS    AD                 I.Ptr to "from" string       @Z23LNFY 16629000
*                                                                       16630000
*------------------------------------------------------------* @Z23LNFY 16631000
*        Body of the message.                                * @Z23LNFY 16632000
*        SSNUBODY points to a list of entries mapped         * @Z23LNFY 16633000
*        by SSNUTXEN.                                        * @Z23LNFY 16634000
*------------------------------------------------------------* @Z23LNFY 16635000
*                                                                       16636000
SSNUBODY DS    AD                 I.Ptr to email body chain    @Z23LNFY 16637000
*                                                                       16638000
*------------------------------------------------------------* @Z23LNFY 16639000
*        Optional subject string for email message.          * @Z23LNFY 16640000
*        SSNUSUBJ points to a structure mapped by SSNUTXEN.  * @Z23LNFY 16641000
*------------------------------------------------------------* @Z23LNFY 16642000
*                                                                       16643000
SSNUSUBJ DS    AD                 I.Ptr to subject string      @Z23LNFY 16644000
*                                                                       16645000
         DS    4F                 Reserved                     @Z23LNFY 16646000
*                                                                       16647000
*------------------------------------------------------------* @Z23LNFY 16648000
*        End of SSNU version 2                               * @Z23LNFY 16649000
*------------------------------------------------------------* @Z23LNFY 16650000
*                                                                       16651000
SSNUSIZ2 EQU   *-SSNUBGN          SSOB Extension length ver 2  @Z23LNFY 16652000
SSNULN28 EQU   SSOBHSIZ+SSNUSIZ2  Total SSOB Length with       @Z23LNFYC16653000
                                   SSOB extension (version 2)  @Z23LNFY 16654000
         EJECT ,                                                        16655000
************************************************************** @Z23LNFY 16656000
*                                                            * @Z23LNFY 16700000
*        Mapping of the text entry.                          * @Z23LNFY 16704000
*        Used by:                                            * @Z23LNFY 16708000
*         - list of email addresses (see SSNUADDR)           * @Z23LNFY 16712000
*         - body of the message     (see SSNUBODY)           * @Z23LNFY 16716000
*         - "from" string           (see SSNUFROM)           * @Z23LNFY 16720000
*         - subject string          (see SSNUSUBJ)           * @Z23LNFY 16722000
*                                                            * @Z23LNFY 16724000
*        Supported CCSIDs:                                   * @Z23LNFY 16728000
*         - 0     - same as 1047                             * @Z23LNFY 16732000
*         - 1047  - EBCDIC                                   * @Z23LNFY 16736000
*         - 1208  - UTF-8                                    * @Z23LNFY 16740000
*                                                            * @Z23LNFY 16744000
************************************************************** @Z23LNFY 16748000
*                                                                       16752000
SSNUTXEN DSECT ,                  Text entry                   @Z23LNFY 16756000
SSNUTXNX DS    AD                 Ptr to next text entry       @Z23LNFY 16760000
SSNUTXTA DS    AD                 Ptr to text string           @Z23LNFY 16764000
SSNUTXCD DS    F                  CCSID of the string          @Z23LNFY 16768000
SSNUTXTL DS    AL2                Length of the string         @Z23LNFY 16772000
         DS    XL2                Reserved                     @Z23LNFY 16776000
SSNUTXSZ EQU   *-SSNUTXEN         Length of text entry         @Z23LNFY 16780000
*                                                                       16784000
&SYSECT  &SYSSTYP ,               Return to current xSECT      @Z23LNFY 16788000
         MEND  ,                                                        16800000
.*                                                                      16900000
**/                                                                     17000000
* % END_OF_ASM_SSNU: ;                                                  17100000
*/*                                                                  */ 17200000
*/********************************************************************/ 17300000
*/*                                                                  */ 17400000
*/*    Constants for Notify User Message Router--SSNU                */ 17500000
*/*                                                                  */ 17600000
*/********************************************************************/ 17700000
*/*                                                                  */ 17800000
*/*     FUNCTION VALUE FOR SSOBFUNC                                  */ 17900000
* DCL SSOBSSNU  FIXED(15)  CONSTANT(75); /*Notify User Msg Routr ID  */ 18000000
*/*                                                                  */ 18100000
*/*     RETURN CODE VALUES FOR SSOBRETN                              */ 18200000
* DCL SSNUOK   FIXED(31) CONSTANT(0); /* Notify Request Successful   */ 18300000
* DCL SSNUOKB  FIXED(31) CONSTANT(4); /* Notify Successful BUT       */ 18400000
* DCL SSNUERR  FIXED(31) CONSTANT(8); /* Notify Request Error           18500000
*                                          see SSNUERCD for reason   */ 18510000
* DCL SSNUNEX  FIXED(31) CONSTANT(12); /*Notify no extension found   */ 18520000
*/*                                                                  */ 18600000
*/*     REASON CODE VALUES FOR SSNUERCD                              */ 18700000
* DCL SSNURQOK FIXED(31) CONSTANT(0); /* Notify Request successful   */ 18800000
* DCL SSNUMSGT FIXED(31) CONSTANT(4); /* Message truncated           */ 18900000
* DCL SSNUEXC  FIXED(31) CONSTANT(8); /* Exit cancelled notify       */ 18910000
* DCL SSNUNUSR FIXED(31) CONSTANT(12); /*No destination specified    */ 19000000
* DCL SSNUINVD FIXED(31) CONSTANT(16); /*Notify Invalid destination  */ 19100000
* DCL SSNUIVID FIXED(31) CONSTANT(20); /*Invalid SSNU extension id   */ 19200000
* DCL SSNUIVER FIXED(31) CONSTANT(24); /* Invalid SSNU version       */ 19300000
* DCL SSNUNOST FIXED(31) CONSTANT(28); /* No storage for request     */ 19400000
* DCL SSNUNOAU FIXED(31) CONSTANT(32); /* No authorization           */ 19500000
* DCL SSNUMSGE FIXED(31) CONSTANT(36); /* Error in msg specification    19510000
*                                                            @410P362*/ 19520000
* DCL SSNUUNTK FIXED(31) CONSTANT(40); /*Notify successful BUT user     19530000
*                                         token not allowed for un-     19540000
*                                         authorized callers @Z09LAPF*/ 19550000
* DCL SSNUINVE FIXED(31) CONSTANT(44); /*Invalid SSNU extension         19560000
*                                                            @Z23D103*/ 19570000
* DCL SSNUMEME FIXED(31) CONSTANT(48); /*Member name error     @Z09DL*/ 19580000
* DCL SSNUEMNA FIXED(31) CONSTANT(52); /*Email services not available   19581000
*                                        in JESPLEX          @Z23LNFY*/ 19582000
* DCL SSNUEMNM FIXED(31) CONSTANT(56); /*Email services not available   19583000
*                                        on this member      @Z23LNFY*/ 19584000
* DCL SSNUIVAD FIXED(31) CONSTANT(60); /*Invalid email address          19585000
*                                                            @Z23LNFY*/ 19586000
* DCL SSNUIVFR FIXED(31) CONSTANT(64); /*Invalid "from" string          19587000
*                                                            @Z23LNFY*/ 19588000
* DCL SSNUPRER FIXED(31) CONSTANT(68); /*Parameters changed while       19589000
*                                        being processed     @Z23LNFY*/ 19590000
* DCL SSNUXLNG FIXED(31) CONSTANT(72); /*Message is too long            19591000
*                                                            @Z23LNFY*/ 19592000
* DCL SSNUIVBD FIXED(31) CONSTANT(76); /*Error in message body          19593000
*                                                            @Z23LNFY*/ 19594000
* DCL SSNUIVSJ FIXED(31) CONSTANT(80); /*Invalid subject string         19595000
*                                                            @Z23LNFY*/ 19596000
* DCL SSNUIVCD FIXED(31) CONSTANT(84); /*Unsupported character          19597000
*                                         encoding           @Z23LNFY*/ 19598000
*/*                                                                  */ 19600000
*/*     ID VALUE FOR SSNUID                                          */ 19700000
* DCL SSNUCID   CHAR(4) CONSTANT('SSNU'); /* Notify User Msg Router     19800000
*                                              SSOB Extension ID     */ 19900000
*/*                                                                  */ 20000000
*/*     SERVICE VERSION NUMBER VALUE FOR SSNUSVRN                    */ 20100000
* DCL SSNUCVER  FIXED(8)  CONSTANT(1); /* Version 4.1.0              */ 20200000
* DCL SSNUVER2  FIXED(8)  CONSTANT(2); /* z/OS 2.3           @Z23LNFY*/ 20210000
*/*                                                                  */ 20300000
*/********************************************************************/ 20400000
*/*                                                                  */ 20500000
*/*    SSI SSOB Extension for Notify User Message Router-SSNU        */ 20600000
*/*                                                                  */ 20700000
*/********************************************************************/ 20800000
* @SPACE;                                                               20810000
* %IF SSNU_ATRB = '' %THEN            /*If attribute not set then   */  20820000
*     %SSNU_ATRB = 'BASED';           /* establish default  @Z23D103*/  20830000
* @SPACE;                                                               20840000
*/*                                                                  */ 20900000
*DECLARE                                                                21000000
*   1   SSNUBGN   SSNU_ATRB,                                            21100000
*     3  SSNUID    CHAR(4),        /* Extension Identifier           */ 21200000
*     3  SSNULEN   FIXED(15),      /* Length of SSOB Extension area  */ 21300000
*     3  SSNUVER   FIXED(8),       /* Service Version Number         */ 21400000
*     3  SSNURSV1  FIXED(8),       /*   Reserved                     */ 21500000
*     3  SSNUERCD  FIXED(16),      /* Reason code for Error RC       */ 21600000
*     3  SSNUFLG1  BIT(8),         /* Flag Byte 1                    */ 21700000
*        5 SSNU1MLO BIT(1),        /*  Send msg IFF user log'd on ind*/ 21800000
*        5 SSNU1CON BIT(1),        /*  Send to console if uid null      21810000
*                                                            @Z23D103*/ 21820000
*        5 SSNU1WT  BIT(1),        /*  Wait until message is saved      21830000
*                                                            @Z23LNFY*/ 21840000
*        5 SSNU1LWM BIT(1),        /*  Light weight message  @Z23LNFY*/ 21850000
*        5 *        BIT(4),        /*   Reserved             @Z23D103*/ 21900000
*     3  SSNURSV2  FIXED(8),       /*   Reserved                     */ 22000000
*     3  SSNUTKNA  PTR(31),        /* Address of user token (opt)    */ 22100000
*     3  SSNUNODE  CHAR(8),        /* Receiving NODE name            */ 22200000
*     3  SSNUUSER  CHAR(8),        /* Receiving USERID               */ 22300000
*     3  SSNUMLEN  FIXED(16),      /* Length of msg to be sent       */ 22400000
*     3  SSNURSV4  FIXED(16),      /*   Reserved                     */ 22500000
*     3  SSNUMSG   POINTER(31),    /* Address of msg to be sent      */ 22600000
*     3  SSNUMEMB  CHAR(4),        /* Member name for SEND     @Z09DL*/ 22610000
*     3  *         FIXED(31),      /* Reserved for future use        */ 22620000
*                                                                       22623000
*/*----------------------------------------------------------@Z23LNFY*/ 22626000
*/*      End of SSNU version 1                               @Z23LNFY*/ 22629000
*/*----------------------------------------------------------@Z23LNFY*/ 22632000
*                                                                       22635000
*     3  SSNURESF  BIT(8),         /* O.Result flags:        @Z23LNFY*/ 22638000
*        5 SSNURFTS BIT(1),        /*   TSO message was sent @Z23LNFY*/ 22641000
*        5 SSNURFEM BIT(1),        /*   Email message was sent          22644000
*                                                            @Z23LNFY*/ 22647000
*     3  *         CHAR(7),        /* Reserved               @Z23LNFY*/ 22650000
*                                                                       22653000
*     3  SSNUADDR  PTR(64),        /* I.Ptr to chain of                 22656000
*                                       email addresses      @Z23LNFY*/ 22659000
*     3  SSNUFROM  PTR(64),        /* I.Ptr to "from" string @Z23LNFY*/ 22662000
*     3  SSNUBODY  PTR(64),        /* I.Ptr to message body  @Z23LNFY*/ 22665000
*     3  SSNUSUBJ  PTR(64),        /* I.Ptr to subject string           22668000
*                                                            @Z23LNFY*/ 22671000
*                                                                       22674000
*     3  *         CHAR(16);       /* Reserved               @Z23LNFY*/ 22677000
*                                                                       22680000
*/*----------------------------------------------------------@Z23LNFY*/ 22683000
*/*      End of SSNU version 2                               @Z23LNFY*/ 22686000
*/*----------------------------------------------------------@Z23LNFY*/ 22689000
*/*                                                                  */ 22700000
*/*      To allow for compatibility between versions, add            */ 22710000
*/*      new areas here.                                             */ 22720000
*/*                                                                  */ 22800000
*/*                                                                  */ 22805000
*/********************************************************** @Z23LNFY*/ 22810000
*/*                                                          @Z23LNFY*/ 22815000
*/*      Mapping of the text entry.                          @Z23LNFY*/ 22820000
*/*      Used by:                                            @Z23LNFY*/ 22825000
*/*       - list of email addresses (see SSNUADDR)           @Z23LNFY*/ 22830000
*/*       - body of the messagea    (see SSNUBODY)           @Z23LNFY*/ 22835000
*/*       - "from" string           (see SSNUFROM)           @Z23LNFY*/ 22840000
*/*       - subject string          (see SSNUSUBJ)           @Z23LNFY*/ 22842000
*/*                                                          @Z23LNFY*/ 22845000
*/********************************************************** @Z23LNFY*/ 22850000
*/*                                                                  */ 22855000
*DECLARE                                                                22860000
*   1   SSNUTXEN  BASED,           /* Text entry             @Z23LNFY*/ 22865000
*     3  SSNUTXNX  PTR(64),        /* Ptr to next text entry @Z23LNFY*/ 22870000
*     3  SSNUTXTA  PTR(64),        /* Ptr to text string     @Z23LNFY*/ 22875000
*     3  SSNUTXCD  FIXED(32),      /* CCSID of the string    @Z23LNFY*/ 22880000
*     3  SSNUTXTL  FIXED(16),      /* Length of the string   @Z23LNFY*/ 22885000
*     3  *         CHAR(2);        /* Reserved               @Z23LNFY*/ 22890000
* DCL SSNUTXSZ FIXED(32) CONSTANT(LENGTH(SSNUTXEN));                    22895000
* % IAZSSNUEND: ;                                                       22900000
*/*                          END OF MACRO                            */ 22910000
* @Logic;                                                               22920000
* #PRAGMA TOOL=PADI.                                                    22930000
* #ASMLINE.        IEFSSOBH                                             22940000
* #ASMLINE.        IAZSSNU  DSECT=YES                                   22950000
* #PADIDELETE.SSNUCID                                                   22960000
* #PADIDELETE.SSNUSIZE                                                  22970000
* #PADIDELETE.SSNULEN8                                                  22980000
* #PADIDELETE.SSNUSIZ2                                                  22990000
* #PADIDELETE.SSNULN28                                                  23000000
* #PADIDELETE.SSOB                                                      23010000
* #EPRAGMA                                                              23020000
* @ENDLOGIC;                                                            99999999
