*%Goto Prog1153; /*                                                     00010000
         MACRO -- IAZS1153 - SMF 1153 record mapping                    00020000
         IAZS1153 &SUBTYPE=                                             00030000
**/%Prog1153:;                                                          00040000
*/* START OF SPECIFICATIONS **********************************          00050000
.****PROPRIETARY-STATEMENT************************************          00060000
.*01* PROPRIETARY STATEMENT:                                 *          00070000
.*                                                           *          00080000
.*    LICENSED MATERIALS-PROPERTY OF IBM                     *          00090000
.*    5650-ZOS Copyright IBM Corp. 2021                      *          00100000
.*                                                           *          00110000
.*    STATUS:  HBB77D0                                       *          00120000
.*                                                           *          00130000
.****END-OF-PROPRIETARY-STATEMENT*****************************          00140000
*                                                            *          00150000
*01* DESCRIPTIVE NAME: JES2 Performance Information          *          00160000
*                                                            *          00170000
*02* ACRONYM:     IAZS1153                                   *          00180000
*                                                            *          00190000
*01* MACRO NAME:  IAZS1153                                   *          00200000
*                                                            *          00210000
*01* DSECT NAME:  SMF1153_HDR                                *          00220000
*                                                            *          00230000
*01* LABEL PREFIX:  SMF1153                                  *          00240000
*                                                            *          00250000
*01* COMPONENT ID:  JES Common (SC141)                       *          00260000
*                                                            *          00270000
*01* EXTERNAL CLASSIFICATION: PI                             *          00280000
*01* END OF EXTERNAL CLASSIFICATION:                         *          00290000
*                                                            *          00300000
*01* METHOD OF ACCESS:                                       *          00310000
*                                                            *          00320000
*02* ASM:                                                    *          00330000
*      IAZS1153 SUBTYPE=value                                *          00340000
*                                                            *          00350000
*      SUBTYPE= specifies which subtypes of SMF1153 should   *          00360000
*      be generated.  The default if not specified is ALL.   *          00370000
*                                                            *          00380000
*02* PL/X:                                                   *          00390000
*      %DCL IAZS1153_SUBTYPE CHAR EXTERNAL                   *          00400000
*      %IAZS1153_SUBTYPE = 'value'                           *          00410000
*      %INCLUDE SYSLIB(IAZS1153)                             *          00420000
*                                                            *          00430000
*      IAZS1153_SUBTYPE is a global variable that determines *          00440000
*      which subtype of SMF1153 should be generated. The     *          00450000
*      default if not specified (or specified as '') is      *          00460000
*      'ALL'.                                                *          00470000
*                                                            *          00480000
*02* PARAMETER = SUBTYPE                                     *          00490000
*                                                            *          00500000
*      TYPE = KEYWORD                                        *          00510000
*                                                            *          00520000
*      value = SUBTYPE indicator, accepted values are:       *          00530000
*           0  -  No subtypes, just maps for common sections *          00540000
*           1  -  Generate mapping for all common sections   *          00550000
*                 and subtype 1                              *          00560000
*         ALL  -  Generate mapping for all common sections   *          00570000
*                 and all subtypes                           *          00580000
*                                                            *          00590000
*01* USED BY:                                                *          00600000
*      Applications interested in examining JES2 performance *          00610000
*      information reported in SMF1153 records.              *          00620000
*                                                            *          00630000
*01* RESTRICTIONS:  None                                     *          00640000
*                                                            *          00650000
*01* NOTES:  None                                            *          00660000
*                                                            *          00670000
****** END OF SPECIFICATIONS ********************************/          00680000
*%Goto Hdr1153; /*                                                      00690000
                    EJECT ,                                             00700000
*********************************************************************** 00710000
*01* CHANGE ACTIVITY:                                                 * 00720000
* $NB5LSMF=SMF84    HBB77D0 210210 NAB:  C header probs               * 00730000
* $Z25LBLD=BUILD    HBB77D0 210210 BWT:  Run IAZS1153 through GITISPF * 00740000
* $Z25LSMF=SMF84    HBB77D0 210226 NAB:  Write SMF1153                * 00750000
*                                                                     * 00760000
* A000000-999999    Created for JES2 z/OS V2R5                 @Z25LSMF 00770000
*********************************************************************** 00780000
                    EJECT ,                                             00790000
**************************************************************          00800000
*                                                            *          00810000
*        SMF1153 - Header Section                            *          00820000
*                                                            *          00830000
*        Note: This section must be compatible with the      *          00840000
*        version 1 extended SMF header (DSECT SMFHDR1) in    *          00850000
*        IFASMFH.                                            *          00860000
*                                                            *          00870000
**************************************************************          00880000
                    SPACE 1                                             00890000
SMF1153_HDR         DSECT ,        SMF1153 record header                00900000
SMF1153_PTR         EQU   *        Alternative symbol                   00910000
SMF1153_HDR_SHD     DS    XL24     Start of SMF standard header         00920000
                    ORG   SMF1153_HDR_SHD                               00930000
SMF1153_HDR_LEN     DS    H        RDW record length                    00940000
SMF1153_HDR_SEG     DS    H        RDW segment descriptor               00950000
SMF1153_HDR_FLG     DS    B        Flag byte                            00960000
SMF1153_HDR_STV     EQU   B'01000000'  Record has a subtype             00970000
SMF1153_HDR_EXT     EQU   B'00100000'  Extended header present          00980000
SMF1153_HDR_RTY     DS    X        Record type - always 126             00990000
SMF1153_HDR_TME     DS    FL4      Record write time - hundredths      C01000000
                                     of seconds since midnight          01010000
SMF1153_HDR_DTE     DS    PL4      Record write date - in packed       C01020000
                                     decimal format 0CYYDDDF            01030000
SMF1153_HDR_SID     DS    CL4      System identification                01040000
SMF1153_HDR_WID     DS    CL4      Subsystem identification             01050000
SMF1153_HDR_STP     DS    H        Record subtype                       01060000
                    SPACE 1                                             01070000
SMF1153_HDR_SHSIZE  EQU   *-SMF1153_HDR_SHD                            C01080000
                                   Length of standard header            01090000
                    SPACE 1                                             01100000
*------------------------------------------------------------*          01110000
*        End of SMF standard header                          *          01120000
*------------------------------------------------------------*          01130000
                    SPACE 1                                             01140000
                    ORG   ,                                             01150000
                    EJECT ,                                             01160000
*------------------------------------------------------------*          01170000
*        Start of V1 extension                               *          01180000
*------------------------------------------------------------*          01190000
                    SPACE 1                                             01200000
SMF1153_HDR_EV1     DS    XL32     Start of V1 extension                01210000
                    ORG   SMF1153_HDR_EV1                               01220000
SMF1153_HDR_ELN     DS    H        Length of extension                  01230000
SMF1153_HDR_VER     DS    X        SMF header version                   01240000
SMF1153_HDR_HV1     EQU   1          SMF header extension V1            01250000
SMF1153_HDR_FLG1    DS    B        Additional flag byte                 01260000
SMF1153_HDR_F1U86   EQU   B'10000000'  IEFU86 exit was called           01270000
SMF1153_HDR_STCKE   DS    XL16     TODE clock when record was          C01280000
                                     written                            01290000
SMF1153_HDR_TZO     DS    XL8      Timezone offset (CVTLDTO)            01300000
SMF1153_HDR_ETY     DS    H        Extended record type                 01310000
SMF1153_EQU         EQU   1153       Type 1153 SMF record               01320000
                    SPACE 1                                             01330000
                    DS    H        Reserved                             01340000
                    SPACE 1                                             01350000
SMF1153_HDR_EXSIZE  EQU   *-SMF1153_HDR_EV1                            C01360000
                                   Length of V1 extension               01370000
                    SPACE 1                                             01380000
*------------------------------------------------------------*          01390000
*        End of SMF version 1 header extension               *          01400000
*------------------------------------------------------------*          01410000
                    SPACE 1                                             01420000
                    ORG   ,                                             01430000
                    EJECT ,                                             01440000
*------------------------------------------------------------*          01450000
*        Triplets to describe data areas being returned.     *          01460000
*        All offsets are from SMF1153_HDR.                   *          01470000
*------------------------------------------------------------*          01480000
                    SPACE 1                                             01490000
SMF1153_HDR_TLN     DS    H        Length of self-defining             C01491000
                                     section                   @OA61336 01494000
                    DS    XL4      Reserved                    @OA61336 01500000
SMF1153_HDR_TRN     DS    H        Number of triplets in this          C01510000
                                     record                             01520000
                    SPACE 1                                             01530000
*------------------------------------------------------------*          01540000
*        The Product and General sections are always         *          01550000
*        present. The remaining sections are returned based  *          01560000
*        on the SMF1153 record subtype (SMF1153_HDR_STP).    *          01570000
*------------------------------------------------------------*          01580000
                    SPACE 1                                             01590000
*                                  JES2 Product Section Triplet        C01600000
                                     (DSECT SMF1153_PRO)                01610000
SMF1153_HDR_PRS     DS    F        Offset to section                    01620000
SMF1153_HDR_PRL     DS    H        Length of section                    01630000
SMF1153_HDR_PRN     DS    H        Number of sections                   01640000
                    SPACE 1                                             01650000
*                                  JES2 General Section Triplet        C01660000
                                     (DSECT SMF1153_GEN)                01670000
SMF1153_HDR_GNS     DS    F        Offset to section                    01680000
SMF1153_HDR_GNL     DS    H        Length of section                    01690000
SMF1153_HDR_GNN     DS    H        Number of sections                   01700000
                    SPACE 1                                             01710000
*                                  JES2 Usage Section Triplet          C01720000
                                     (DSECT SMF1153_JRU)                01730000
SMF1153_HDR_RUS     DS    F        Offset to section                    01740000
SMF1153_HDR_RUL     DS    H        Length of section                    01750000
SMF1153_HDR_RUN     DS    H        Number of sections                   01760000
                    SPACE 1                                             01770000
SMF1153_HDR_STSIZE  EQU   *-SMF1153_HDR_TLN                            C01772000
                                   Length of self-defining             C01774000
                                     section                   @OA61336 01776000
                    SPACE 1                                             01778000
SMF1153_HDR_SIZE    EQU   *-SMF1153_HDR                                C01780000
                                   Length of Header Section             01790000
                    SPACE 1                                             01800000
                    AIF   ('&SUBTYPE' EQ '').Pro1153                    01810000
                    AIF   ('&SUBTYPE' EQ 'ALL').Pro1153                 01820000
                    AIF   ('&SUBTYPE' EQ '0').Pro1153                   01830000
                    AIF   ('&SUBTYPE' EQ '1').Pro1153                   01840000
                    SPACE 1                                             01850000
.Err1153            MNOTE 8,'IAZS1153 - Invalid record subtype specifieC01860000
               d - &SUBTYPE'                                            01870000
                    MEXIT ,                                             01880000
                    SPACE 1                                             01890000
.Pro1153            ANOP  ,                                             01900000
                    EJECT ,                                             01910000
**************************************************************          01920000
*                                                            *          01930000
*        SMF1153 - JES2 Product Section                      *          01940000
*                                                            *          01950000
**************************************************************          01960000
                    SPACE 1                                             01970000
SMF1153_PRO         DSECT ,        JES2 Product Section                 01980000
SMF1153_PRO_PRDNM   DS    CL8      Product name                         01990000
SMF1153_PRO_MFVER   DS    CL8      Product version (FMID)               02000000
SMF1153_PRO_MVSRL   DS    CL8      OS software level                    02010000
SMF1153_PRO_JESRL   DS    CL8      JES2 release level                   02020000
SMF1153_PRO_JXCFNM  DS    CL8      JES2 JESXCF group name               02030000
SMF1153_PRO_NODENM  DS    CL8      JES2 node name                       02040000
SMF1153_PRO_MEMBNM  DS    CL4      JES2 member name                     02050000
                    SPACE 1                                             02060000
SMF1153_PRO_SRVCLS  DS    CL8      WLM service class                    02070000
SMF1153_PRO_SLEVEL  DS    FL1      JES2 service level                   02080000
SMF1153_PRO_PLEVEL  DS    FL1      JES2 product level                   02090000
SMF1153_PRO_PRTY    DS    0H       Dispatching priority                 02100000
SMF1153_PRO_PRTYH   DS    FL1        High order byte                    02110000
SMF1153_PRO_PRTYL   DS    FL1        Low order byte                     02120000
SMF1153_PRO_FLG1    DS    B        Status indicator byte                02130000
SMF1153_PRO_F1APG   EQU   B'01000000'  JES2 is in APG group             02140000
SMF1153_PRO_F1SWP   EQU   B'00100000'  JES2 is non-swappable            02150000
                    DS    XL3      Reserved                             02160000
                    SPACE 1                                             02170000
SMF1153_PRO_CPUM    DS    CL4      CPU model number                     02180000
SMF1153_PRO_RST4K   DS    FD       Real storage size at IPL in         C02190000
                                     4K pages                           02200000
                    SPACE 1                                             02210000
SMF1153_PRO_INTER   DS    PL4      Interval length in seconds           02220000
SMF1153_PRO_MFCYC   DS    PL4      Sampling cycle length in            C02230000
                                     the form 00SSSTTF, e.g.           C02240000
                                     0000005C = 0.05 seconds            02250000
SMF1153_PRO_SAMPL   DS    F        Number of samples                    02260000
                    DS    XL4      Reserved                             02270000
                    SPACE 1                                             02280000
SMF1153_PRO_STODE   DS    XL16     Interval start time and             C02290000
                                     date in TODE format                02300000
SMF1153_PRO_STIME   DS    PL4      Interval start time in the          C02310000
                                     form HHMMSSTF                      02320000
SMF1153_PRO_SDATE   DS    PL4      Interval start date in the          C02330000
                                     form 0CYYDDDF                      02340000
SMF1153_PRO_ETODE   DS    XL16     Interval end time and               C02350000
                                     date in TODE format                02360000
SMF1153_PRO_ETIME   DS    PL4      Interval end time in the            C02370000
                                     form HHMMSSTF                      02380000
SMF1153_PRO_EDATE   DS    PL4      Interval end date in the            C02390000
                                     form 0CYYDDDF                      02400000
                    SPACE 1                                             02410000
SMF1153_PRO_RMOCPMN DS    FD       Min JES2 monitor CPU                C02420000
                                     overhead in microseconds           02430000
SMF1153_PRO_RMOCPMX DS    FD       Max JES2 monitor CPU                C02440000
                                     overhead in microseconds           02450000
SMF1153_PRO_RMOCPAV DS    FD       Avg JES2 monitor CPU                C02460000
                                     overhead in microseconds           02470000
                    SPACE 1                                             02480000
SMF1153_PRO_RMOTIMN DS    FD       Min JES2 monitor time               C02490000
                                     overhead in microseconds           02500000
SMF1153_PRO_RMOTIMX DS    FD       Max JES2 monitor time               C02510000
                                     overhead in microseconds           02520000
SMF1153_PRO_RMOTIAV DS    FD       Avg JES2 monitor time               C02530000
                                     overhead in microseconds           02540000
                    SPACE 1                                             02550000
                    DS    0D       Alignment                            02560000
                    SPACE 1                                             02570000
SMF1153_PRO_SIZE    EQU   *-SMF1153_PRO                                C02580000
                                   Length of Product Section            02590000
                    EJECT ,                                             02600000
**************************************************************          02610000
*                                                            *          02620000
*        SMF1153 - JES2 General Section                      *          02630000
*                                                            *          02640000
**************************************************************          02650000
                    SPACE 1                                             02660000
SMF1153_GEN         DSECT ,        JES2 General Section                 02670000
SMF1153_GEN_CPUSC   DS    F        CPU busy sample count                02680000
                    SPACE 1                                             02690000
*------------------------------------------------------------*          02700000
*        The percentages below are scaled by 10,000 for      *          02710000
*        two digits of precision past the decimal point,     *          02720000
*        e.g. SMF1153_GEN_PACT = 6712 should be interpreted  *          02730000
*        as 67.12 percent.                                   *          02740000
*------------------------------------------------------------*          02750000
                    SPACE 1                                             02760000
SMF1153_GEN_NACT    DS    F        Main task active count               02770000
SMF1153_GEN_PACT    DS    F        Main task active percent             02780000
SMF1153_GEN_NDMVS   DS    F        Awaiting dispatch count              02790000
SMF1153_GEN_PDMVS   DS    F        Awaiting dispatch percent            02800000
SMF1153_GEN_NIDLE   DS    F        Idle sample count                    02810000
SMF1153_GEN_PIDLE   DS    F        Idle sample percent                  02820000
SMF1153_GEN_NWAIT   DS    F        Other MVS wait count                 02830000
SMF1153_GEN_PWAIT   DS    F        Other MVS wait percent               02840000
SMF1153_GEN_NLLOK   DS    F        Awaiting local lock count            02850000
SMF1153_GEN_PLLOK   DS    F        Awaiting local lock percent          02860000
SMF1153_GEN_NNDSP   DS    F        Non-dispatchable count               02870000
SMF1153_GEN_PNDSP   DS    F        Non-dispatchable percent             02880000
SMF1153_GEN_NPAGE   DS    F        Page wait count                      02890000
SMF1153_GEN_PPAGE   DS    F        Page wait percent                    02900000
                    SPACE 1                                             02910000
                    DS    XL4      Reserved                             02920000
                    DS    0D       Alignment                            02930000
                    SPACE 1                                             02940000
SMF1153_GEN_SIZE    EQU   *-SMF1153_GEN                                C02950000
                                   Length of General Section            02960000
                    SPACE 1                                             02970000
                    AIF   ('&SUBTYPE' EQ '').Subtype01                  02980000
                    AIF   ('&SUBTYPE' EQ 'ALL').Subtype01               02990000
                    AIF   ('&SUBTYPE' EQ '1').Subtype01                 03000000
                    MEXIT ,                                             03010000
.Subtype01          ANOP  ,                                             03020000
                    EJECT ,                                             03030000
**************************************************************          03040000
*                                                            *          03050000
*        SMF1153 - JES2 Resource Usage Section               *          03060000
*                                                            *          03070000
**************************************************************          03080000
                    SPACE 1                                             03090000
SMF1153_JRU         DSECT ,        JES2 resource usage section          03100000
SMF1153_JRU_LEN     DS    F        Length of JES2 resource             C03110000
                                     usage section                      03120000
                    DS    XL(6*4+2)  Reserved                           03130000
                    SPACE 1                                             03140000
*------------------------------------------------------------*          03150000
*        Triplets to describe data areas being returned.     *          03160000
*        All offsets in the section are from SMF1153_JRU.    *          03170000
*------------------------------------------------------------*          03180000
                    SPACE 1                                             03190000
SMF1153_JRU_RTR     DS    H        Number of triplets                   03200000
                    SPACE 1                                             03210000
*------------------------------------------------------------*          03220000
*        Memory usage entries (SMF1153_MEM DSECTs)           *          03230000
*------------------------------------------------------------*          03240000
                    SPACE 1                                             03250000
SMF1153_JRU_RMO     DS    F        Offset to 1st entry                  03260000
SMF1153_JRU_RML     DS    H        Length of an entry                   03270000
SMF1153_JRU_RMN     DS    H        Number of entries                    03280000
                    SPACE 1                                             03290000
*------------------------------------------------------------*          03300000
*        Resource usage entries (SMF1153_RSU DSECTs)         *          03310000
*------------------------------------------------------------*          03320000
                    SPACE 1                                             03330000
SMF1153_JRU_RRO     DS    F        Offset to 1st entry                  03340000
SMF1153_JRU_RRL     DS    H        Length of an entry                   03350000
SMF1153_JRU_RRN     DS    H        Number of entries                    03360000
                    SPACE 1                                             03370000
                    DS    0D       Alignment                            03380000
                    SPACE 1                                             03390000
SMF1153_JRU_SIZE    EQU   *-SMF1153_JRU                                C03400000
                                   Length of Usage Section              03410000
                    EJECT ,                                             03420000
*------------------------------------------------------------*          03430000
*        SMF1153_MEM maps each storage element (corresponds  *          03440000
*        to a storage area tracked)                          *          03450000
*------------------------------------------------------------*          03460000
                    SPACE 1                                             03470000
SMF1153_MEM         DSECT ,        Memory usage data entry              03480000
SMF1153_MEM_NAME    DS    CL12     Area name                            03490000
                    SPACE 1                                             03500000
                    DS    F        Reserved                             03510000
SMF1153_MEM_REGION  DS    FD       Region size in bytes                 03520000
SMF1153_MEM_USE     DS    FD       Current area usage in bytes          03530000
SMF1153_MEM_LOW     DS    FD       Low usage value in bytes             03540000
SMF1153_MEM_HIGH    DS    FD       High usage value in bytes            03550000
SMF1153_MEM_AVERAGE DS    FD       Average in use in bytes              03560000
                    SPACE 1                                             03570000
                    DS    0D       Alignment                            03580000
                    SPACE 1                                             03590000
SMF1153_MEM_SIZE    EQU   *-SMF1153_MEM                                C03600000
                                   Length of Memory Section             03610000
                    EJECT ,                                             03620000
*------------------------------------------------------------*          03630000
*        SMF1153_RSU maps each resource element (corresponds *          03640000
*        to an individual resource)                          *          03650000
*------------------------------------------------------------*          03660000
                    SPACE 1                                             03670000
SMF1153_RSU         DSECT ,        Resource usage data entry            03680000
SMF1153_RSU_NAME    DS    CL8      Resource name                        03690000
SMF1153_RSU_LIMIT   DS    F        Current upper limit                  03700000
SMF1153_RSU_INUSE   DS    F        Current number in use                03710000
SMF1153_RSU_LOW     DS    F        Low usage value                      03720000
SMF1153_RSU_HIGH    DS    F        High usage value                     03730000
SMF1153_RSU_WARN    DS    FL2      WARN= value for resource            C03740000
                                     (zero if none)                     03750000
SMF1153_RSU_FLG1    DS    B        Flag byte                            03760000
SMF1153_RSU_F1OVER  EQU   B'10000000'  Usage over warn level            03770000
SMF1153_RSU_F1JPLX  EQU   B'01000000'  JESPLEX-wide resource            03780000
                    DS    FL1      Reserved                             03790000
SMF1153_RSU_OVER    DS    F        Count of samples over warn          C03800000
                                     level (HASP050 needed)             03810000
SMF1153_RSU_AVERAGE DS    F        Average in use value                 03820000
                    DS    XL4      Reserved                             03830000
                    SPACE 1                                             03840000
                    DS    0D       Alignment                            03850000
                    SPACE 1                                             03860000
SMF1153_RSU_SIZE    EQU   *-SMF1153_RSU                                C03870000
                                   Length of Resource Section           03880000
                    SPACE 1                                             03890000
                    AIF   ('&SUBTYPE' EQ '').Subtype02                  03900000
                    AIF   ('&SUBTYPE' EQ 'ALL').Subtype02               03910000
                    MEXIT ,                                             03920000
.Subtype02          ANOP  ,                                             03930000
                    MEND  ,                                             03940000
**/%Hdr1153:;                                                           03950000
*                                                                       03960000
*%If IAZS1153_SUBTYPE = '' %Then  /* If unspecified, then            */ 03970000
*  %IAZS1153_SUBTYPE = 'ALL';     /*   set the default subtype       */ 03980000
*                                                                       03990000
*@Eject;                                                                04000000
*/********************************************************************/ 04010000
*/*                                                                  */ 04020000
*/*    SMF1153 - Header Section                                      */ 04030000
*/*                                                                  */ 04040000
*/*    Note: This section must be compatible with the                */ 04050000
*/*    version 1 extended SMF header (structure SMFHDR1)             */ 04060000
*/*    in IFASMFH.                                                   */ 04070000
*/*                                                                  */ 04080000
*/********************************************************************/ 04090000
*                                                                       04100000
*Dcl 1 SMF1153_HDR Based(SMF1153_PTR) Bdy(Word),                        04110000
*      3 SMF1153_HDR_SHD     Char(24) Bdy(Word),                        04120000
*                                       /* Start of SMF standard        04130000
*                                          header                    */ 04140000
*        5 SMF1153_HDR_LEN   Fixed(15), /* RDW record length         */ 04150000
*        5 SMF1153_HDR_SEG   Fixed(15), /* RDW segment descriptor    */ 04160000
*        5 SMF1153_HDR_FLG   Bit(8),    /* Flag byte                 */ 04170000
*          7 *                 Bit(1),  /*   Reserved                */ 04180000
*          7 SMF1153_HDR_STV   Bit(1),  /*   Record has a subtype    */ 04190000
*          7 SMF1153_HDR_EXT   Bit(1),  /*   Extended header present */ 04200000
*          7 *                 Bit(5),  /*   Reserved                */ 04210000
*        5 SMF1153_HDR_RTY   Fixed(8),  /* Record type - always 126  */ 04220000
*        5 SMF1153_HDR_TME   Fixed(32) Bdy(HWord),                      04230000
*                                       /* Record write time -          04240000
*                                          hundredths of seconds        04250000
*                                          since midnight            */ 04260000
*        5 SMF1153_HDR_DTE   Char(4),   /* Record write date -          04270000
*                                          packed decimal format        04280000
*                                          0CYYDDDF                  */ 04290000
*        5 SMF1153_HDR_SID   Char(4),   /* System identification     */ 04300000
*        5 SMF1153_HDR_WID   Char(4),   /* Subsystem identification  */ 04310000
*        5 SMF1153_HDR_STP   Fixed(15), /* Record subtype            */ 04320000
*@Space(1);                                                             04330000
*/*------------------------------------------------------------------*/ 04340000
*/*    End of SMF standard header                                    */ 04350000
*/*------------------------------------------------------------------*/ 04360000
*@Eject;                                                                04370000
*/*------------------------------------------------------------------*/ 04380000
*/*    Start of V1 extension                                         */ 04390000
*/*------------------------------------------------------------------*/ 04400000
*@Space(1);                                                             04410000
*      3 SMF1153_HDR_EV1     Char(32) Bdy(Word),                        04420000
*                                       /* Start of V1 extension     */ 04430000
*        5 SMF1153_HDR_ELN   Fixed(16), /* Length of extension       */ 04440000
*        5 SMF1153_HDR_VER   Fixed(8),  /* SMF header version        */ 04450000
*        5 SMF1153_HDR_FLG1  Bit(8),    /* Additional flag byte      */ 04460000
*          7 SMF1153_HDR_F1U86  Bit(1), /*   IEFU86 exit was called  */ 04470000
*          7 *                  Bit(7), /*   Reserved                */ 04480000
*        5 SMF1153_HDR_STCKE Char(16),  /* TODE clock when record       04490000
*                                          was written               */ 04500000
*        5 SMF1153_HDR_TZO   Char(8),   /* Timezone offset (CVTLDTO) */ 04510000
*        5 SMF1153_HDR_ETY   Fixed(16), /* Extended record type      */ 04520000
*        5 *                 Fixed(16), /* Reserved                  */ 04530000
*@Space(1);                                                             04540000
*/*------------------------------------------------------------------*/ 04550000
*/*    End of SMF version 1 header extension                         */ 04560000
*/*------------------------------------------------------------------*/ 04570000
*@Eject;                                                                04580000
*/*------------------------------------------------------------------*/ 04590000
*/*    Triplets to describe data areas being returned.               */ 04600000
*/*    All offsets are from SMF1153_HDR.                             */ 04610000
*/*------------------------------------------------------------------*/ 04620000
*@Space(1);                                                             04630000
*      3 SMF1153_HDR_TLN     Fixed(16), /* Length of self-defining      04632000
*                                            section         @OA61336*/ 04635000
*      3 *                   Char(4),   /* Reserved          @OA61336*/ 04640000
*      3 SMF1153_HDR_TRN     Fixed(16), /* Number of triplets in        04650000
*                                          this record               */ 04660000
*@Space(1);                                                             04670000
*/*------------------------------------------------------------------*/ 04680000
*/*    The Product and General sections are always                   */ 04690000
*/*    present. The remaining sections are returned based            */ 04700000
*/*    on the SMF1153 record subtype (SMF1153_HDR_STP).              */ 04710000
*/*------------------------------------------------------------------*/ 04720000
*@Space(1);                                                             04730000
*                                       /* JES2 Product Section Triplet 04740000
*                                          (struct SMF1153_PRO)      */ 04750000
*      3 SMF1153_HDR_PRS     Fixed(31), /* Offset to section         */ 04760000
*      3 SMF1153_HDR_PRL     Fixed(16), /* Length of section         */ 04770000
*      3 SMF1153_HDR_PRN     Fixed(16), /* Number of sections        */ 04780000
*@Space(1);                                                             04790000
*                                       /* JES2 General Section Triplet 04800000
*                                          (struct SMF1153_GEN)      */ 04810000
*      3 SMF1153_HDR_GNS     Fixed(31), /* Offset to section         */ 04820000
*      3 SMF1153_HDR_GNL     Fixed(16), /* Length of section         */ 04830000
*      3 SMF1153_HDR_GNN     Fixed(16), /* Number of sections        */ 04840000
*@Space(1);                                                             04850000
*                                       /* JES2 Usage Section Triplet   04860000
*                                          (struct SMF1153_JRU)      */ 04870000
*      3 SMF1153_HDR_RUS     Fixed(31), /* Offset to section         */ 04880000
*      3 SMF1153_HDR_RUL     Fixed(16), /* Length of section         */ 04890000
*      3 SMF1153_HDR_RUN     Fixed(16); /* Number of sections        */ 04900000
*                                                                       04910000
*Dcl SMF1153_EQU Fixed(16) Constant(1153);                              04920000
*                                       /* Type 1153 SMF record      */ 04930000
*Dcl SMF1153_HDR_HV1 Fixed(8) Constant(1);                              04940000
*                                       /* SMF header extension V1   */ 04950000
*                                                                       04960000
*Dcl SMF1153_HDR_SHSIZE Fixed(16) Constant(Length(SMF1153_HDR_SHD));    04970000
*                                       /* Length of standard header */ 04980000
*Dcl SMF1153_HDR_EXSIZE Fixed(16) Constant(Length(SMF1153_HDR_EV1));    04990000
*                                       /* Length of extension       */ 05000000
*Dcl SMF1153_HDR_STSIZE Fixed(16) Constant(Length(SMF1153_HDR)-         05002000
*                                          Offset(SMF1153_HDR_TLN));    05004000
*                                       /* Length of self-defining      05006000
*                                            section         @OA61336*/ 05008000
*Dcl SMF1153_HDR_SIZE Fixed(16) Constant(Length(SMF1153_HDR));          05010000
*                                       /* Length of Header Section  */ 05020000
*                                                                       05030000
*%If IAZS1153_SUBTYPE=''    %Then %Goto Pro1153;                        05040000
*%If IAZS1153_SUBTYPE='ALL' %Then %Goto Pro1153;                        05050000
*%If IAZS1153_SUBTYPE='0'   %Then %Goto Pro1153;                        05060000
*%If IAZS1153_SUBTYPE='1'   %Then %Goto Pro1153;                        05070000
*                                                                       05080000
*%Note("IAZS1153 - Invalid record subtype specified - " !!              05090000
*   IAZS1153_SUBTYPE) MsgLevel(8);                                      05100000
*                                                                       05110000
*%Pro1153:;                                                             05120000
*                                                                       05130000
*@Eject;                                                                05140000
*/********************************************************************/ 05150000
*/*                                                                  */ 05160000
*/*    SMF1153 - JES2 Product Section                                */ 05170000
*/*                                                                  */ 05180000
*/********************************************************************/ 05190000
*                                                                       05200000
*Dcl 1 SMF1153_PRO Based(Addr(SMF1153_HDR)+SMF1153_HDR_PRS),            05210000
*      3 SMF1153_PRO_PRDNM   Char(8),   /* Product name              */ 05220000
*      3 SMF1153_PRO_MFVER   Char(8),   /* Product version (FMID)    */ 05230000
*      3 SMF1153_PRO_MVSRL   Char(8),   /* OS software level         */ 05240000
*      3 SMF1153_PRO_JESRL   Char(8),   /* JES2 release level        */ 05250000
*      3 SMF1153_PRO_JXCFNM  Char(8),   /* JES2 JESXCF group name    */ 05260000
*      3 SMF1153_PRO_NODENM  Char(8),   /* JES2 node name            */ 05270000
*      3 SMF1153_PRO_MEMBNM  Char(4),   /* JES2 member name          */ 05280000
*@Space(1);                                                             05290000
*      3 SMF1153_PRO_SRVCLS  Char(8),   /* WLM service class         */ 05300000
*      3 SMF1153_PRO_SLEVEL  Fixed(8),  /* JES2 service level        */ 05310000
*      3 SMF1153_PRO_PLEVEL  Fixed(8),  /* JES2 product level        */ 05320000
*      3 SMF1153_PRO_PRTY    Fixed(16), /* JES2 dispatching priority */ 05330000
*        5 SMF1153_PRO_PRTYH   Fixed(8),/*   High order byte         */ 05340000
*        5 SMF1153_PRO_PRTYL   Fixed(8),/*   Low order byte          */ 05350000
*      3 SMF1153_PRO_FLG1    Bit(8),    /* Status indicator byte     */ 05360000
*        5 *                   Bit(1),  /*   Reserved                */ 05370000
*        5 SMF1153_PRO_F1APG   Bit(1),  /*   JES2 is in APG group    */ 05380000
*        5 SMF1153_PRO_F1SWP   Bit(1),  /*   JES2 is non-swappable   */ 05390000
*        5 *                   Bit(5),  /*   Reserved                */ 05400000
*      3 *                   Char(3),   /* Reserved                  */ 05410000
*@Space(1);                                                             05420000
*      3 SMF1153_PRO_CPUM    Char(4),   /* CPU model number          */ 05430000
*      3 SMF1153_PRO_RST4K   Fixed(64), /* Real storage size at IPL     05440000
*                                          in 4K pages               */ 05450000
*@Space(1);                                                             05460000
*      3 SMF1153_PRO_INTER   Char(4),   /* Interval length in seconds*/ 05470000
*      3 SMF1153_PRO_MFCYC   Char(4),   /* Sampling cycle length in     05480000
*                                          the form 00SSSTTF, e.g.      05490000
*                                          0000005C = 0.05 seconds   */ 05500000
*      3 SMF1153_PRO_SAMPL   Fixed(32), /* Number of samples         */ 05510000
*      3 *                   Char(4),   /* Reserved                  */ 05520000
*@Space(1);                                                             05530000
*      3 SMF1153_PRO_STODE   Char(16),  /* Interval start time and      05540000
*                                          date in TODE format       */ 05550000
*      3 SMF1153_PRO_STIME   Char(4),   /* Interval start time in the   05560000
*                                          form HHMMSSTF             */ 05570000
*      3 SMF1153_PRO_SDATE   Char(4),   /* Interval start date in the   05580000
*                                          form 00YYDDDF             */ 05590000
*      3 SMF1153_PRO_ETODE   Char(16),  /* Interval end time and        05600000
*                                          date in TODE format       */ 05610000
*      3 SMF1153_PRO_ETIME   Char(4),   /* Interval end time in the     05620000
*                                          form HHMMSSTF             */ 05630000
*      3 SMF1153_PRO_EDATE   Char(4),   /* Interval end date in the     05640000
*                                          form 00YYDDDF             */ 05650000
*@Space(1);                                                             05660000
*      3 SMF1153_PRO_RMOCPMN Fixed(64), /* Min JES2 monitor CPU         05670000
*                                          overhead in microseconds  */ 05680000
*      3 SMF1153_PRO_RMOCPMX Fixed(64), /* Max JES2 monitor CPU         05690000
*                                          overhead in microseconds  */ 05700000
*      3 SMF1153_PRO_RMOCPAV Fixed(64), /* Avg JES2 monitor CPU         05710000
*                                          overhead in microseconds  */ 05720000
*@Space(1);                                                             05730000
*      3 SMF1153_PRO_RMOTIMN Fixed(64), /* Min JES2 monitor time        05740000
*                                          overhead in microseconds  */ 05750000
*      3 SMF1153_PRO_RMOTIMX Fixed(64), /* Max JES2 monitor time        05760000
*                                          overhead in microseconds  */ 05770000
*      3 SMF1153_PRO_RMOTIAV Fixed(64), /* Avg JES2 monitor time        05780000
*                                          overhead in microseconds  */ 05790000
*@Space(1);                                                             05800000
*      3 *                   Char(0) Bdy(DWord); /* Alignment        */ 05810000
*                                                                       05820000
*Dcl SMF1153_PRO_SIZE Fixed(16) Constant(Length(SMF1153_PRO));          05830000
*                                       /* Length of section         */ 05840000
*                                                                       05850000
*@Eject;                                                                05860000
*/********************************************************************/ 05870000
*/*                                                                  */ 05880000
*/*    SMF1153 - JES2 General Section                                */ 05890000
*/*                                                                  */ 05900000
*/********************************************************************/ 05910000
*                                                                       05920000
*Dcl 1 SMF1153_GEN Based(Addr(SMF1153_HDR)+SMF1153_HDR_GNS),            05930000
*      3 SMF1153_GEN_CPUSC   Fixed(32), /* CPU busy sample count     */ 05940000
*@Space(1);                                                             05950000
*      3 SMF1153_GEN_NACT    Fixed(32), /* Main task active count    */ 05960000
*      3 SMF1153_GEN_PACT    Fixed(32), /* Main task active percent  */ 05970000
*      3 SMF1153_GEN_NDMVS   Fixed(32), /* Awaiting dispatch count   */ 05980000
*      3 SMF1153_GEN_PDMVS   Fixed(32), /* Awaiting dispatch percent */ 05990000
*      3 SMF1153_GEN_NIDLE   Fixed(32), /* Idle sample count         */ 06000000
*      3 SMF1153_GEN_PIDLE   Fixed(32), /* Idle sample percent       */ 06010000
*      3 SMF1153_GEN_NWAIT   Fixed(32), /* Other MVS wait count      */ 06020000
*      3 SMF1153_GEN_PWAIT   Fixed(32), /* Other MVS wait percent    */ 06030000
*      3 SMF1153_GEN_NLLOK   Fixed(32), /* Awaiting local lock count */ 06040000
*      3 SMF1153_GEN_PLLOK   Fixed(32), /* Awaiting local lock perc  */ 06050000
*      3 SMF1153_GEN_NNDSP   Fixed(32), /* Non-dispatchable count    */ 06060000
*      3 SMF1153_GEN_PNDSP   Fixed(32), /* Non-dispatchable percent  */ 06070000
*      3 SMF1153_GEN_NPAGE   Fixed(32), /* Page wait count           */ 06080000
*      3 SMF1153_GEN_PPAGE   Fixed(32), /* Page wait percent         */ 06090000
*@Space(1);                                                             06100000
*      3 *                   Char(4),   /* Reserved                  */ 06110000
*      3 *                   Char(0) Bdy(DWord); /* Alignment        */ 06120000
*                                                                       06130000
*Dcl SMF1153_GEN_SIZE Fixed(16) Constant(Length(SMF1153_GEN));          06140000
*                                       /* Length of section         */ 06150000
*                                                                       06160000
*%If IAZS1153_SUBTYPE=''    %Then %Goto Subtype01;                      06170000
*%If IAZS1153_SUBTYPE='ALL' %Then %Goto Subtype01;                      06180000
*%If IAZS1153_SUBTYPE='1'   %Then %Goto Subtype01;                      06190000
*%Goto Exit1153;                                                        06200000
*                                                                       06210000
*%Subtype01:;                                                           06220000
*@Eject;                                                                06230000
*/********************************************************************/ 06240000
*/*                                                                  */ 06250000
*/*    SMF1153 - JES2 Resource Usage Section                         */ 06260000
*/*                                                                  */ 06270000
*/********************************************************************/ 06280000
*                                                                       06290000
*Dcl 1 SMF1153_JRU Based(Addr(SMF1153_HDR)+SMF1153_HDR_RUS),            06300000
*      3 SMF1153_JRU_LEN     Fixed(32), /* Length of JES2 resource      06310000
*                                           section                  */ 06320000
*      3 *                   Char(6*4+2), /* Reserved                */ 06330000
*@Space(1);                                                             06340000
*/*------------------------------------------------------------------*/ 06350000
*/*    Triplets to describe data areas being returned.               */ 06360000
*/*    All offsets in the section are from SMF1153_JRU.              */ 06370000
*/*------------------------------------------------------------------*/ 06380000
*@Space(1);                                                             06390000
*      3 SMF1153_JRU_RTR     Fixed(16), /* Number of triplets        */ 06400000
*@Space(1);                                                             06410000
*/*------------------------------------------------------------------*/ 06420000
*/*    Memory usage entries (SMF1153_MEM structures)                 */ 06430000
*/*------------------------------------------------------------------*/ 06440000
*@Space(1);                                                             06450000
*      3 SMF1153_JRU_RMO     Fixed(31), /* Offset to 1st entry       */ 06460000
*      3 SMF1153_JRU_RML     Fixed(16), /* Length of an entry        */ 06470000
*      3 SMF1153_JRU_RMN     Fixed(16), /* Number of entries         */ 06480000
*@Space(1);                                                             06490000
*/*------------------------------------------------------------------*/ 06500000
*/*    Resource usage entries (SMF1153_RSU structures)               */ 06510000
*/*------------------------------------------------------------------*/ 06520000
*@Space(1);                                                             06530000
*      3 SMF1153_JRU_RRO     Fixed(31), /* Offset to 1st entry       */ 06540000
*      3 SMF1153_JRU_RRL     Fixed(16), /* Length of an entry        */ 06550000
*      3 SMF1153_JRU_RRN     Fixed(16), /* Number of entries         */ 06560000
*@Space(1);                                                             06570000
*      3 *                   Char(0) Bdy(DWord);  /* Alignment       */ 06580000
*                                                                       06590000
*Dcl SMF1153_JRU_SIZE Fixed(16) Constant(Length(SMF1153_JRU));          06600000
*                                       /* Length of section         */ 06610000
*                                                                       06620000
*@Eject;                                                                06630000
*/*------------------------------------------------------------------*/ 06640000
*/*    SMF1153MEM maps each storage element (corresponds to a        */ 06650000
*/*    storage area tracked)                                         */ 06660000
*/*------------------------------------------------------------------*/ 06670000
*                                                                       06680000
*Dcl 1 SMF1153_MEM Based(Addr(SMF1153_JRU)+SMF1153_JRU_RMO),            06690000
*      3 SMF1153_MEM_NAME    Char(12),  /* Area name                 */ 06700000
*@Space(1);                                                             06710000
*      3 *                   Char(4),   /* Reserved                  */ 06720000
*      3 SMF1153_MEM_REGION  Fixed(64), /* Region size in bytes      */ 06730000
*      3 SMF1153_MEM_USE     Fixed(64), /* Current usage in bytes    */ 06740000
*      3 SMF1153_MEM_LOW     Fixed(64), /* Low usage value in bytes  */ 06750000
*      3 SMF1153_MEM_HIGH    Fixed(64), /* High usage value in bytes */ 06760000
*      3 SMF1153_MEM_AVERAGE Fixed(64), /* Average in use in bytes   */ 06770000
*@Space(1);                                                             06780000
*      3 *                   Char(0) Bdy(DWord);  /* Alignment       */ 06790000
*                                                                       06800000
*Dcl SMF1153_MEM_SIZE Fixed(16) Constant(Length(SMF1153_MEM));          06810000
*                                       /* Length of section         */ 06820000
*                                                                       06830000
*@Eject;                                                                06840000
*/*------------------------------------------------------------------*/ 06850000
*/*    SMF153_RSU maps each resource element (corresponds to         */ 06860000
*/*    an individual JES2 resource)                                  */ 06870000
*/*------------------------------------------------------------------*/ 06880000
*                                                                       06890000
*Dcl 1 SMF1153_RSU Based(Addr(SMF1153_JRU)+SMF1153_JRU_RRO),            06900000
*      3 SMF1153_RSU_NAME    Char(8),   /* Resource name             */ 06910000
*      3 SMF1153_RSU_LIMIT   Fixed(32), /* Current upper limit       */ 06920000
*      3 SMF1153_RSU_INUSE   Fixed(32), /* Current number in use     */ 06930000
*      3 SMF1153_RSU_LOW     Fixed(32), /* Low usage value           */ 06940000
*      3 SMF1153_RSU_HIGH    Fixed(32), /* High usage value          */ 06950000
*      3 SMF1153_RSU_WARN    Fixed(16), /* WARN= value for resource     06960000
*                                          (zero if none)            */ 06970000
*      3 SMF1153_RSU_FLG1    Bit(8),    /* Flag byte                 */ 06980000
*        5 SMF1153_RSU_F1OVER  Bit(1),  /*   Usage over warn level   */ 06990000
*        5 SMF1153_RSU_F1JPLX  Bit(1),  /*   JESPLEX-wide resource   */ 07000000
*        5 *                 Bit(6),    /*   Reserved                */ 07010000
*      3 *                   Char(1),   /* Reserved                  */ 07020000
*      3 SMF1153_RSU_OVER    Fixed(32), /* Count of samples over warn   07030000
*                                          level (HASP050 needed)    */ 07040000
*      3 SMF1153_RSU_AVERAGE Fixed(32), /* Number of entries         */ 07050000
*@Space(1);                                                             07060000
*      3 *                   Char(4),   /* Reserved                  */ 07070000
*@Space(1);                                                             07080000
*      3 *                   Char(0) Bdy(DWord);  /* Alignment       */ 07090000
*                                                                       07100000
*Dcl SMF1153_RSU_SIZE Fixed(16) Constant(Length(SMF1153_RSU));          07110000
*                                       /* Length of section         */ 07120000
*                                                                       07130000
*%Subtype02:;                                                           07140000
*%Exit1153:;                                                            07150000
*                                                                       07160000
*@Logic;                                                                07170000
*#Pragma Tool=PADI.                                                     07180000
*#Line.Dcl SMF1153_PTR Ptr(31);                                         07190000
*#Line.%Dcl IAZS1153_SUBTYPE Char External;                             07200000
*#Line.%IAZS1153_SUBTYPE = '';                                          07210000
*#PadiDelete.SMF1153_PTR                                                07220000
*#EPragma                                                               07230000
*@EndLogic;                                                             99999999
