*%GOTO IAZPRO56;         /*                                             00020000
         MACRO                                                          00030000
         IAZSMF56 ,                                                  */ 00040000
*%IAZPRO56: ;                                                           00050000
*/* START OF SPECIFICATIONS **********************************          00060000
.****PROPRIETARY-STATEMENT************************************          00070000
.*01* PROPRIETARY STATEMENT:                                 *          00080000
.*                                                           *          00090000
.*    LICENSED MATERIALS-PROPERTY OF IBM                     *          00100000
.*    5650-ZOS Copyright IBM Corp. 1983, 2019                *          00110000
.*                                                           *          00120000
.*    STATUS:  HBB77C0                                       *          00130000
.*                                                           *          00140000
.****END-OF-PROPRIETARY-STATEMENT*****************************          00200000
*                                                            *          00300000
*01* DESCRIPTIVE NAME:  JES SMF Network integrity record     *          00400000
*02*  ACRONYM:  IAZSMF56                                     *          00500000
*                                                            *          00600000
*01* MACRO NAME:  IAZSMF56                                   *          00700000
*                                                            *          01300000
*01* DSECT NAME:  N/A                                        *          01310000
*01* LABEL PREFIX:  SMF56                                    *          01330000
*                                                            *          01340000
*01* COMPONENT ID:  JES Common (SC141)                       *          01400000
*                                                            *          01500000
*01* EXTERNAL CLASSIFICATION: PI                             *          01510000
*01* END OF EXTERNAL CLASSIFICATION:                         *          01511000
*                                                            *          01520000
*** END OF SPECIFICATIONS   **********************************       */ 01530000
*%GOTO IAZ56;                                                        /* 01600000
.*                                                                   *  01700000
.* INVOCATION =                                                      *  01800000
.*               BAL  - IAZSMF56 (NO DSECT CREATED - START OF RECORD *  01900000
.*                       IS AT SMFRCD56 )                            *  02000000
.*               PL/S - %INCLUDE SYSLIB(IAZSMF56)                    *  02010000
.*                      DCL SMF56PTR PTR                             *  02100000
.*                                                                   *  02110000
.* CHANGE ACTIVITY:                                                  *  02200000
.*                                                                   *  02300000
.*                MVS/SP RELEASE 3 LEVEL 3 (SP1.3.3,JBB1329,JBB2125) *  02400000
.*                THIS MACRO ADDED TO SC141 VIA OZ81648              *  02410000
.* $Z07LTCP=NJETCP   HBB7720 030922 CLW:  Misc. signon changes       *  02420000
.* $Z07LSSO=NJETCP   HBB7720 031027 CLW:  Secure Signon Protocol     *  02430000
.* $CW2LTCP=NJETCP   HBB7720 040217 CLW:  Add bufsize to SMF 56      *  02450000
.*                                                                   *  02460000
.* $S202710=CHEADERS HBB77C0 190212 TJW:  Updates for C headers      *  02470000
.*                                        S202710                    *  02480000
.*                                                                   *  02500000
.* A000000-999999    CREATED FOR MVS 1.3.3                         @133 02520000
.*********************************************************************  02600000
         SPACE 2                                                        02700000
SMFRCD56 EQU   *                   START OF RECORD                      02800000
SMF56PTR EQU   *                   HEADER SEGMENT              @OZ82688 02900000
SMF56LEN DS    CL2                 RECORD LENGTH                        03000000
SMF56SEG DS    CL2                 SEGMENT DESCRIPTOR                   03100000
         SPACE 2                                                        03200000
*  BEGINNING OF JMR OR HASP SMF RECORD                                  03300000
         SPACE 1                                                        03400000
SMF56FLG DC    BL1'0'              HEADER FLAG BYTE                     03500000
SMF56RTY DC    BL1'0'              RECORD TYPE                          03600000
SMF56TME DC    BL4'0'              TOD, USING FORMAT FROM TIME MACRO    03700000
SMF56DTE DC    PL4'0000'           DATE IN PACKD DECIMAL FORM  00YYDDDF 03800000
SMF56SID DC    CL4' '              SYSTEM IDENTIFICATION                03900000
         SPACE 2                                                        04000000
* HEADER FOR HASP SUBSYS RECORD TYPE 56                                 04100000
SMFJ56   EQU   56                  NETWORK INTEGRITY REC TYPE  @OZ82688 04200000
         SPACE 1                                                        04300000
SMF56SBS DC    XL2'0002'           HASP SUBSYSTEM ID                    04400000
SMF56HSP EQU   X'0002'                JES2 ID                           04500000
SMF56SUB DC    BL2'0'              RECORD SUBTYPE                       04600000
SMF56LRR DC    BL2'0'              LENGTH OF REST OF RECORD             04700000
* BEGINNING OF HASP TYPE 56 NETWORKING SIGNON RECORD AFTER 2 HDRS       04800000
         SPACE 1                                                        04900000
SMF56NNM DC    CL8' '              NODE NAME                            05000000
SMF56MEM DC    BL1'0'              MEMBER NUMBER                        05100000
SMF56FG1 DC    BL1'0'              SIGNON STATUS FLAGS                  05200000
SMF56RSO EQU   B'10000000'             RESPONSE SIGNON                  05300000
SMF56CON EQU   B'01000000'             Reset/concur signon     @Z07LSSO 05310000
SMF56SEC EQU   B'00100000'             Secure signon protocol  @Z07LSSOC05320000
                                        (SMF56LPW and SMF56NPW @Z07LSSOC05330000
                                        are not set with this  @Z07LSSOC05340000
                                        protocol)              @Z07LSSO 05350000
SMF56LPW DC    CL8' '              LINE PASSWORD                        05400000
SMF56NPW DC    CL8' '              NODE PASSWORD                        05500000
SMF56LNM DC    CL8' '              LINE NAME                            05600000
SMF56BSZ DC    XL4'00'             Negotiated buffer size      @Z07LTCP 05610000
SMF56END DS    0C                  END OF TYPE 56 RECORD (SHORT)        05700000
*        OPTIONAL INFORMATION ABOUT ADJACENT NODE              @Z07LTCP 05710000
SMF56IPA DC    XL16'00'            BINARY IP ADDRESS, IPv6 FORMAT       05720000
SMF56PRT DC    XL2'00'             PORT NUMBER                 @Z07LTCP 05730000
SMF56HNM DC    CL127' '            TCP/IP HOST NAME            @Z07LTCP 05740000
SMF56EN2 DS    0C                  END OF TYPE 56 RECORD (LONG)         05750000
         MEND       */                                                  05760000
*%IAZ56:;                                                               05770000
*   DCL 1 SMFRCD56 BASED(SMF56PTR) BDY(WORD),                           05780000
*        3 SMF56LEN FIXED(15),    /* RECORD LENGTH                   */ 05790000
*        3 SMF56SEG FIXED(15),    /* SEGMENT DESCRIPTOR              */ 05800000
*                                                                       05810000
*/* Beginning of JMR or HASP SMF record                              */ 05820000
*        3 SMF56FLG BIT(8),       /* HEADER FLAG BYTE                */ 05830000
*        3 SMF56RTY FIXED(8),     /* RECORD TYPE                     */ 05840000
*        3 SMF56TME FIXED(32)     /* TOD, USING TIME MACRO FORMAT    */ 05850000
*                   BDY(BYTE),                                          05860000
*        3 SMF56DTE FIXED(32)     /* DATE PACKD DECIMAL FORM 00YYDDD */ 05870000
*                   BDY(BYTE),                                          05880000
*        3 SMF56SID CHAR(4),      /* SYSTEM IDENTIFICATION           */ 05890000
*                                                                       05900000
*/* Header for HASP SUBSYS record type 56                            */ 05910000
*        3 SMF56SBS FIXED(16),    /* HASP SUBSYSTEM ID               */ 05920000
*        3 SMF56SUB FIXED(16),    /* RECORD SUBTYPE                  */ 05930000
*        3 SMF56LRR FIXED(16),    /* LENGTH OF REST OF RECORD        */ 05940000
*                                                                       05950000
*/* Beginning of HASP type 56 networking signon record after 2 hdrs  */ 05960000
*        3 SMF56NNM CHAR(8),      /* NODE NAME                       */ 05970000
*        3 SMF56MEM FIXED(8),     /* MEMBER NUMBER                   */ 05980000
*        3 SMF56FG1 BIT(8),       /* SIGNON STATUS FLAGS             */ 05990000
*          5 SMF56RSO BIT(1),     /*   RESPONSE SIGNON               */ 06000000
*          5 SMF56CON BIT(1),     /*   Reset/concur signon           */ 06010000
*          5 SMF56SEC BIT(1),     /*   Secure signon protocol           06020000
*                                       (SMF56LPW and SMF56NPW are      06030000
*                                       not set with this protocol)  */ 06040000
*          5 *        BIT(5),     /*   Reserved                      */ 06050000
*        3 SMF56LPW CHAR(8),      /* LINE PASSWORD                   */ 06060000
*        3 SMF56NPW CHAR(8),      /* NODE PASSWORD                   */ 06070000
*        3 SMF56LNM CHAR(8),      /* LINE NAME                       */ 06080000
*        3 SMF56BSZ FIXED(32)     /* Negotiated buffer size          */ 06090000
*                   BDY(BYTE),                                          06100000
*                                                                       06110000
*/*  Optional information about adjacent node                        */ 06120000
*        3 SMF56IPA CHAR(16),     /* BINARY IP ADDRESS, IPv6 FORMAT  */ 06130000
*        3 SMF56PRT FIXED(16),    /* PORT NUMBER                     */ 06140000
*        3 SMF56HNM CHAR(127);    /* TCP/IP HOST NAME                */ 06150000
*                                                                       06160000
*/*    Equate for SMF56RTY                                           */ 06170000
* DCL   SMFJ56   FIXED(8)  CONSTANT(56), /* Network integrity record */ 06180000
*/*    Equates for SMF56SBS                                          */ 06190000
*       SMF56HSP FIXED(16) CONSTANT(2);  /* JES2 ID                  */ 06200000
*                                                                       06210000
* @Logic;                                                               06220000
* #PRAGMA TOOL=PADI.                                                    06230000
* #LINE.Dcl SMF56PTR Pointer(31);                                       06240000
* #PADIDELETE.SMF56PTR                                                  06250000
* #PADIDELETE.SMF56END                                                  06260000
* #PADIDELETE.SMF56EN2                                                  06270000
* #EPRAGMA                                                              06280000
* @ENDLOGIC;                                                            99999999
