*%GOTO IAZPRO24;         /*                                             00020000
      MACRO                                                             00100000
      IAZSMF24 ,                                                     */ 00200000
*%IAZPRO24: ;                                                           00207000
*/* START OF SPECIFICATIONS **********************************          00208000
.****PROPRIETARY-STATEMENT************************************          00216000
.*01* PROPRIETARY STATEMENT:                                 *          00220000
.*                                                           *          00225000
.*    LICENSED MATERIALS-PROPERTY OF IBM                     *          00228000
.*    5650-ZOS Copyright IBM Corp. 1983, 2019                *          00234000
.*                                                           *          00243000
.*    STATUS:  HBB77C0                                       *          00246000
.*                                                           *          00252000
.****END-OF-PROPRIETARY-STATEMENT*****************************          00261000
*                                                            *          00270000
*01* DESCRIPTIVE NAME:  JES SMF SPOOL offload record         *          00279000
*02*  ACRONYM:  IAZSMF24                                     *          00280000
*                                                            *          00282000
*01* MACRO NAME:  IAZSMF24                                   *          00284000
*                                                            *          00288000
*01* DSECT NAME:  N/A                                        *          00294000
*01* LABEL PREFIX:  SMF24                                    *          00300000
*                                                            *          00310000
*01* COMPONENT ID:  JES Common (SC141)                       *          00400000
*                                                            *          00500000
*01* EXTERNAL CLASSIFICATION: PI                             *          00600000
*01* END OF EXTERNAL CLASSIFICATION:                         *          00610000
*                                                            *          00700000
*** END OF SPECIFICATIONS   **********************************       */ 01300000
*%GOTO IAZ24;                                                        /* 01600000
.*                                                                   *  01700000
.*  INVOCATION =                                                     *  01800000
.*               BAL  - IAZSMF24 (NO DSECT CREATED - START OF RECORD *  01900000
.*                       IS AT SMFRCD24 )                            *  02000000
.*               PL/S - %INCLUDE SYSLIB(IAZSMF24)                    *  02100000
.*                      DCL SMF24PTR PTR                             *  02105000
.*                                                                   *  02110000
.*  CHANGE ACTIVITY:                                                 *  02200000
.*                                                                   *  02300000
.*                MVS/SP RELEASE 3 LEVEL 3 (SP1.3.3, JBB1329)        *  02400000
.*                                                                   *  02405000
.* $410LSMF=ENT_II   HBB4410 890210 TYT:  SMF RECORD UPDATE          *  02410000
.* $410LD09=ENT_II   HBB4410 890215 RMJ:  SMF record updates         *  02420000
.*                                                                   *  02430000
.* $510LAFF=HPCS     HJE5510 910926 MAA:  Support 32-Way MAS         *  02440000
.*                                                                   *  02450000
.* $Z21LCLS=JOBCLS   HBB7790 120224 KJK:  SMF24 - Add 8Char class fl  * 02460000
.*                                                                   *  02470000
.* $S202710=CHEADERS HBB77C0 190212 TJW:  Updates for C headers      *  02480000
.*                                        S202710                    *  02490000
.*                                                                   *  02500000
.* A000000-999999    CREATED FOR MVS 1.3.3                        @133  02520000
.*********************************************************************  02600000
         SPACE 2                                                        02700000
*SWITCH TO DECIDE WHETHER TO GENERATE EQUATES FOR WRITING SMF RECORDS   02800000
         SPACE 1                                                        02900000
         GBLB  &EQUSW                                                   03000000
         SPACE 1                                                        03100000
SMFRCD24 EQU   *                   START OF RECORD                      03200000
SMF24PTR EQU   *                   HEADER LENGTH                        03210000
SMF24BHD DS    0X                  BEGINING BASE+HDR                    03220000
SMF24LEN DS    CL2                 RECORD LENGTH                        03300000
SMF24SEG DS    CL2                 SEGMENT DESCRIPTOR                   03400000
         SPACE 2                                                        03500000
*  BEGINNING OF JMR OR HASP SMF RECORD                                  03600000
         SPACE 1                                                        03700000
SMF24FLG DC    BL1'0'              HEADER FLAG BYTE                     03800000
SMF24STS EQU   B'01000000'           SUBTYPES USED                      03810000
SMF24RTY DC    BL1'0'              RECORD TYPE                          03900000
SMF24TME DC    BL4'0'              TOD, USING FORMAT FROM TIME MACRO    04000000
SMF24DTE DC    PL4'0000'           DATE IN PACKD DECIMAL FORM  00YYDDDF 04100000
SMF24SID DC    CL4' '              SYSTEM IDENTIFICATION                04200000
         SPACE 2                                                        04300000
* HEADER FOR HASP SUBSYS RECORD TYPE 24                                 04400000
SMFJ24   EQU   24                  SPOOL OFFLOAD RECORD TYPE       @220 04500000
         SPACE 1                                                        04600000
SMF24SSI DS    XL4                 SUBSYSTEM ID                         04700000
SMF24SUB DC    BL2'0'              RECORD SUBTYPE                       04800000
SMF24JT  EQU   1                      JOB TRANSMITTER                   04900000
SMF24JR  EQU   2                      JOB RECEIVER                      05000000
SMF24ST  EQU   3                      SYSOUT TRANSMITTER                05100000
SMF24SR  EQU   4                      SYSOUT RECEIVER                   05200000
SMF24NTR DS    XL2                 NUMBER OF TRIPLETS                   05300000
SMF24RSV DS    XL2                 RESERVED                             05400000
         AIF (NOT &EQUSW).SKIP1                                @410LD09 05410000
SMF24LHD EQU   *-SMFRCD24          LEN OF HEADER SECTION       @410LSMF 05420000
.SKIP1   ANOP                                                  @410LD09 05430000
         SPACE 1                                                        05500000
SMF24TPS EQU   *                   BEGINNING OF TRIPLETS       @410LD09 05510000
SMF24OPS DS    XL4                   OFFSET TO PRODUCT SECTION          05600000
SMF24LPS DS    XL2                   LENGTH OF PRODUCT SECTION          05700000
SMF24NPS DS    XL2                   NUMBER OF PRODUCT SECTIONS         05800000
SMF24OGN DS    XL4                   OFFSET TO GENERAL SECTION          05900000
SMF24LGN DS    XL2                   LENGTH OF GENERAL SECTION          06000000
SMF24NGN DS    XL2                   NUMBER OF GENERAL SECTIONS         06100000
SMF24OSP DS    XL4                   OFFSET TO SPOF SECTION             06200000
SMF24LSP DS    XL2                   LENGTH OF SPOF SECTION             06300000
SMF24NSP DS    XL2                   NUMBER OF SPOF SECTIONS            06400000
SMF24OSW DS    XL4                   OFFSET TO ESS SECTION     @410LSMF 06410000
SMF24LSW DS    XL2                   LENGTH OF ESS SECTION     @410LSMF 06420000
SMF24NSW DS    XL2                   NUMBER OF ESS SECTIONS    @410LSMF 06430000
SMF24OSA DS    XL4                   Offset to sysaff section  @510LAFF 06432000
SMF24LSA DS    XL2                   Length of sysaff section  @510LAFF 06434000
SMF24NSA DS    XL2                   Number of sysaff sections @510LAFF 06436000
         AIF (NOT &EQUSW).SKIP2                                @410LSMF 06440000
         SPACE 1                                               @410LD09 06445000
SMF24TRP EQU   *-SMF24TPS          LENGTH OF TRIPLETS          @410LSMF 06450000
SMF24NTP EQU   SMF24TRP/8          NUMBER OF TRIPLETS          @410LSMF 06460000
.SKIP2   ANOP                                                  @410LSMF 06470000
         SPACE 5                                                        06600000
* BEGINNING OF JES2 PRODUCT SECTION                                     06700000
         SPACE 1                                                        06800000
SMF24PRO DS    0X                  Start of product section             06810000
SMF24PVR DS    CL2                 RECORD VERSION                       06900000
SMF24PNM DS    CL8                 PRODUCT NAME                         07000000
SMF24RS2 DS    XL2                 RESERVED                    @ZA96844 07010000
         SPACE 2                                                        07100000
* GENERAL SECTION FOR SPOOL OFFLOAD DEVICES                             07200000
         SPACE 2                                                        07300000
SMF24GEN DS    0X                  Start of general section             07310000
SMF24GLN DC    BL2'0'              LENGTH OF GENERAL SECTION            07400000
SMF24BCF DC    BL1'0'              BUFFER CONTINUATION FLAG             07500000
SMF24FST EQU   B'10000000'            FIRST SMF BUFFER FOR JOB          07600000
SMF24CON EQU   B'01000000'            SMF BUFFER CONTINUED              07700000
SMF24LST EQU   B'00100000'            LAST SMF BUFFER - END OF JOB      07800000
SMF24EOJ DC    BL1'0'              END OF JOB FLAG                      07900000
SMF24COM EQU   B'10000000'            JOB COMPLETELY OFFLOADED          08000000
SMF24SDS EQU   B'01000000'            JOB COMPLETED WITH SKIPPED       C08100000
                                          DATA SETS                     08200000
SMF24INJ EQU   B'00100000'            INCOMPLETE JOB OFFLOADED          08300000
SMF24OPR EQU   B'00010000'            OPERATOR CANCELED JOB             08400000
SMF24JBN DC    CL8' '              JOB NAME                             08600000
SMF24JID DC    CL8' '              ORIGINAL JOB IDENTIFICATION          08700000
SMF24CJD DC    CL8' '              CURRENT JOB IDENTIFICATION           08800000
SMF24SYS DC    CL4' '              SYSTEM ID                            08900000
SMF24DSN DC    CL44' '             OFFLOAD DATA SET NAME                09000000
SMF24CNT DC    BL4'0'              NUMBER OF RECORDS DUMPED/LOADED      09100000
SMF24TDS DC    BL4'0'              TIME OFFLOAD DATA SET ALLOCATED      09200000
SMF24DDS DC    BL4'0'              DATE OFFLOAD DATA SET ALLOCATED      09300000
SMF24ORG DC    CL8' '              ORIGIN NODE                          09400000
SMF24TRD DC    BL4'0'              TIME ON READER                       09500000
SMF24DRD DC    BL4'0'              DATE ON READER                       09600000
         SPACE 2                                                        09800000
*********************************************************************   09900000
*                                                                   *   10000000
*   EITHER THE JOB SECTION   OR  THE SYSOUT SECTION IS WRITTEN,     *   10100000
*   NOT BOTH.  THE SPOF TRIPLET REFERS TO WHICHEVER ONE IS WRITTEN  *   10200000
*   IN THE CURRENT RECORD.                                          *   10300000
*                                                                   *   10400000
*********************************************************************   10500000
         SPACE 2                                                        10600000
*        JOB SELECTION CRITERIA SECTION                                 10700000
SMF24JBS DS    0X                  Start of job selection section       10710000
SMF24LN1 DC    BL2'0'              LENGTH OF JOB SECTION                10800000
SMF24JFG DC    BL1'0'              JOB FLAGS                            10900000
SMF24JHL EQU   B'10000000'            HELD JOB                          11000000
SMF24AFF EQU   B'01000000'            AFFINITY = ANY                    11100000
SMF24JCL DC    CL1' '              JOB CLASS                            11200000
SMF24JRT DS    0F                  ROUTE CODE                           11300000
SMF24JND DC    CL8' '                 NODE NAME                         11400000
SMF24JAF DC    CL28' '             AFFINITY SYSTEM ID'S        @ZA96844 11500000
SMF248CL DC    CL8' '              8 CHAR JOB CLASS            @Z21LCLS 11505000
SMF24EJS DS    0C                  End of job selection        @510LAFF 11510000
         SPACE 1                                                        11700000
*        SYSOUT SELECTION CRITERIA SECTION                              11800000
         ORG   SMF24LN1                                                 11900000
SMF24SOS DS    0X                  Start of SYSOUT selection section    11910000
SMF24LN2 DC    BL2'0'              LENGTH OF SYSOUT SECTION             12000000
SMF24SFG DC    BL1'0'              SYSOUT FLAGS                         12100000
SMF24SHL EQU   B'10000000'            HELD SYSOUT                       12200000
SMF24SBT EQU   B'01000000'            BURSTED SYSOUT                    12300000
SMF24SJH EQU   B'00100000'            HELD JOB                          12400000
SMF24INC EQU   B'00010000'            INCOMPLETE DATA SET               12500000
SMF24MUL EQU   B'00001000'            MULTI-DEST DATA SET               12600000
SMF24SCL DC    CL1' '              SYSOUT CLASS                         12700000
SMF24SRT DS    0F                  ROUTE CODE                           12800000
SMF24SND DC    CL8' '                 NODE NAME                         12900000
SMF24SRN DC    CL8' '                 REMOTE NAME                       13000000
SMF24FCB DC    CL4' '              FCB                                  13100000
SMF24FOR DC    CL8' '              FORMS                                13200000
SMF24FLS DC    CL4' '              FLASH                                13300000
SMF24PRM DC    CL8' '              PR MODE                              13400000
SMF24UCS DC    CL4' '              UCS                                  13500000
SMF24WID DC    CL8' '              WRITER                               13600000
SMF24REC DC    BL4'0'              DATA SET RECORD COUNT                13700000
SMF24PRY DC    XL1'0'              PRIORITY                             13800000
         SPACE 2                                                        14000000
         AIF (NOT &EQUSW).SKIP3                                @410LD09 14100000
SMF24PRD EQU   SMF24RS2+L'SMF24RS2-SMF24PVR LEN OF PRODUCT SEC @ZA96844 14500000
SMF24LN  EQU   SMF24DRD+L'SMF24DRD-SMF24GLN LEN OF GENERAL SEC @ZA96844 14600000
SMF24L1  EQU   SMF248CL+L'SMF248CL-SMF24LN1 LEN OF JOB SEL SEC @Z21LCLS 14700000
SMF24L2  EQU   SMF24PRY+L'SMF24PRY-SMF24LN2 LEN OF SYSOUT SEC  @ZA96844 14800000
SMF24POF EQU   SMF24LHD+SMF24TRP         OFFSET TO PRODUCT SECTION      15100000
SMF24GOF EQU   SMF24POF+SMF24PRD         OFFSET TO GENERAL SECTION      15200000
SMF24SOF EQU   SMF24GOF+SMF24LN          OFFSET TO SPOF SECTION         15300000
SMF24AOF EQU   SMF24SOF+SMF24L1          Offset to aff section @510LAFF 15310000
.SKIP3   ANOP                                                  @410LD09 15400000
         SPACE 1                                               @410LSMF 15410000
*********************************************************************** 15420000
*                                                                     * 15430000
*        Enhanced SYSOUT Support (ESS) Ssection                       * 15440000
*                                                                     * 15450000
*        This section contains the OUTPUT descriptor (if any)         * 15460000
*        in SWBTU format (IEFSJPFX plus text units) for the           * 15470000
*        first offloaded data set included in this SMF record.        * 15480000
*        The SWBTU may be processed using the SWBTUREC macro          * 15490000
*        or other Scheduler JCL Facility (SJF) services.              * 15500000
*                                                                     * 15510000
*********************************************************************** 15515000
         SPACE 1                                               @410LSMF 15520000
SMF24ESS DS    0X                  Start of ESS section                 15525000
SMF24LN3 DC    BL2'0'              LENGTH OF ESS SECTION       @410LSMF 15530000
SMF24SGT DS    BL4                 SEGMENT IDENTIFIER          @410LSMF 15540000
SMF24IND DS    BL1                 ESS SECTION INDICATOR       @410LSMF 15550000
SMF24SJF EQU   B'10000000'         ERROR OBTAINING SWBTU               C15560000
                                     (SWBTU DATA NOT PRESENT)  @410LD09 15570000
         DS    BL1                 RESERVED                    @410LD09 15580000
SMF24JDT DS    CL8                 JDVT NAME                   @410LSMF 15590000
SMF24TUL DS    BL2                 SWBTU DATA AREA LENGTH      @410LSMF 15600000
SMF24TU  DS    0C                  SWBTU DATA AREA             @410LSMF 15610000
         AIF (NOT &EQUSW).SKIP4                                @410LD09 15620000
         SPACE 1                                               @410LD09 15625000
SMF24ESL EQU   *-SMF24LN3          Length of the fixed portion         C15630000
                                     of the ESS section        @410LD09 15635000
.SKIP4   ANOP                                                  @410LD09 15640000
         SPACE 1                                               @510LAFF 15650000
*************************************************************  @510LAFF 15660000
*                                                           *  @510LAFF 15670000
*        Enhanced SYSTEM AFFINITY suport section.           *  @510LAFF 15680000
*                                                           *  @510LAFF 15690000
*        This section contains the system names for all the *  @510LAFF 15700000
*        systems for which this job has affinity.  The one  *  @510LAFF 15710000
*        exception is if it has an affinity of ANY in which *  @510LAFF 15720000
*        case the flag bit SMF24AFF is on.                  *  @510LAFF 15730000
*                                                           *  @510LAFF 15740000
*************************************************************  @510LAFF 15750000
         SPACE 1                                               @510LAFF 15760000
         ORG   SMF24EJS            Follow job selection        @510LAFF 15770000
SMF24ESA DS    0X                  Start of Enhanced aff sect           15775000
SMF24LS4 DC    BL2'0'              Length of sysaff section    @510LAFF 15780000
         DS    BL2                 Reserved for future IBM use @510LAFF 15790000
SMF24SAN DS    XL4                 Number of system affinities @510LAFF 15800000
SMF24LN4 DS    XL4                 Length of system name       @510LAFF 15810000
SMF24SAC DS    0C                  Start of system aff. names  @510LAFF 15820000
         AIF (NOT &EQUSW).SKIP5                                @510LAFF 15830000
         SPACE 1                                               @510LAFF 15840000
SMF24SAL EQU   *-SMF24LS4          Length of the fixed portion @510LAFFC15850000
                                     of the SYS. AFF SECTION   @510LAFF 15860000
.SKIP5   ANOP                                                  @510LAFF 15870000
         MEND       */                                                  15880000
*%IAZ24:;                                                               15890000
*%  DCL  EQUSW FIXED EXTERNAL; /*SWITCH TO DETERMINE WHETHER TO         15900000
*                                GENERATE EQUATES FOR WRITING REC    */ 15910000
*   DCL 1 SMFRCD24 BASED(SMF24PTR) BDY(WORD),                           15920000
*       2 SMF24BHD,               /* BEGINING BASE+HDR               */ 15930000
*        3 SMF24LEN FIXED(15),    /* RDW RECORD LENGTH               */ 15940000
*        3 SMF24SEG FIXED(15),    /* RDW SEGMENT DESCRIPTOR          */ 15950000
*        3 SMF24FLG BIT(8),       /* HEADER FLAG BYTE                */ 15960000
*          5 *        BIT(1),     /*   RESERVED                      */ 15970000
*          5 SMF24STS BIT(1),     /*   SUBTYPES USED                 */ 15980000
*          5 *        BIT(6),     /*   RESERVED                      */ 15990000
*        3 SMF24RTY FIXED(8),     /* RECORD TYPE                     */ 16000000
*        3 SMF24TME FIXED(32)     /* TOD, USING TIME MACRO FORMAT    */ 16010000
*                   BDY(BYTE),                                          16020000
*        3 SMF24DTE FIXED(32)     /* DATE PACKD DECIMAL FORM 00YYDDD */ 16030000
*                   BDY(BYTE),                                          16040000
*        3 SMF24SID CHAR(4),      /* SYSTEM IDENTIFICATION           */ 16050000
*        3 SMF24SSI CHAR(4),      /* SUBSYSTEM ID                    */ 16060000
*        3 SMF24SUB FIXED(16),    /* RECORD SUBTYPE                  */ 16070000
*        3 SMF24NTR FIXED(16),    /* NUMBER OF TRIPLETS              */ 16080000
*        3 SMF24RSV FIXED(16),    /* RESERVED                        */ 16090000
*       2 SMF24TPS,               /* BEGINNING OF TRIPLETS           */ 16100000
*        3 SMF24OPS FIXED(32)     /* OFFSET TO PRODUCT SECTION       */ 16110000
*                   BDY(BYTE),                                          16120000
*        3 SMF24LPS FIXED(16),    /* LENGTH OF PRODUCT SECTION       */ 16130000
*        3 SMF24NPS FIXED(16),    /* NUMBER OF PRODUCT SECTIONS      */ 16140000
*        3 SMF24OGN FIXED(32)     /* OFFSET TO GENERAL SECTION       */ 16150000
*                   BDY(BYTE),                                          16160000
*        3 SMF24LGN FIXED(16),    /* LENGTH OF GENERAL SECTION       */ 16170000
*        3 SMF24NGN FIXED(16),    /* NUMBER OF GENERAL SECTIONS      */ 16180000
*        3 SMF24OSP FIXED(32)     /* OFFSET TO SPOF SECTION          */ 16190000
*                   BDY(BYTE),                                          16200000
*        3 SMF24LSP FIXED(16),    /* LENGTH OF SPOF SECTION          */ 16210000
*        3 SMF24NSP FIXED(16),    /* NUMBER OF SPOF SECTIONS         */ 16220000
*        3 SMF24OSW FIXED(32)     /* OFFSET TO ESS SECTION           */ 16230000
*                   BDY(BYTE),                                          16240000
*        3 SMF24LSW FIXED(16),    /* LENGTH OF ESS SECTION           */ 16250000
*        3 SMF24NSW FIXED(16),    /* NUMBER OF ESS SECTIONS          */ 16260000
*        3 SMF24OSA FIXED(32)     /* Offset to sysaff section        */ 16270000
*                   BDY(BYTE),                                          16280000
*        3 SMF24LSA FIXED(16),    /* Length of sysaff section        */ 16290000
*        3 SMF24NSA FIXED(16);    /* Number of sysaff sections       */ 16300000
*/* JES2 product section                                             */ 16310000
*   DCL 1 SMF24PRO BASED(ADDR(SMFRCD24)+SMF24OPS),                      16320000
*        3 SMF24PVR CHAR(2),      /* RECORD VERSION                  */ 16330000
*        3 SMF24PNM CHAR(8),      /* PRODUCT NAME                    */ 16340000
*        3 SMF24RS2 FIXED(16);    /* RESERVED                        */ 16350000
*/* General section for SPOOL offload devices                        */ 16360000
*   DCL 1 SMF24GEN BASED(ADDR(SMFRCD24)+SMF24OGN),                      16370000
*        3 SMF24GLN FIXED(16),    /* LENGTH OF GENERAL SECTION       */ 16380000
*        3 SMF24BCF BIT(8),       /* BUFFER CONTINUATION FLAG        */ 16390000
*          5 SMF24FST BIT(1),     /*   FIRST SMF BUFFER FOR JOB      */ 16400000
*          5 SMF24CON BIT(1),     /*   SMF BUFFER CONTINUED          */ 16410000
*          5 SMF24LST BIT(1),     /*   LAST SMF BUFFER - END OF JOB  */ 16420000
*          5 *        BIT(5),     /*   Reserved                      */ 16430000
*        3 SMF24EOJ BIT(8),       /* END OF JOB FLAG                 */ 16440000
*          5 SMF24COM BIT(1),     /*   JOB COMPLETELY OFFLOADED      */ 16450000
*          5 SMF24SDS BIT(1),     /*   JOB COMPLETED WITH SKIPPED       16460000
*                                        DATA SETS                   */ 16470000
*          5 SMF24INJ BIT(1),     /*   INCOMPLETE JOB OFFLOADED      */ 16480000
*          5 SMF24OPR BIT(1),     /*   OPERATOR CANCELED JOB         */ 16490000
*          5 *        BIT(4),     /*   Reserved                      */ 16500000
*        3 SMF24JBN CHAR(8),      /* JOB NAME                        */ 16510000
*        3 SMF24JID CHAR(8),      /* ORIGINAL JOB IDENTIFICATION     */ 16520000
*        3 SMF24CJD CHAR(8),      /* CURRENT JOB IDENTIFICATION      */ 16530000
*        3 SMF24SYS CHAR(4),      /* SYSTEM ID                       */ 16540000
*        3 SMF24DSN CHAR(44),     /* OFFLOAD DATA SET NAME           */ 16550000
*        3 SMF24CNT FIXED(32),    /* NUMBER OF RECORDS DUMPED/LOADED */ 16560000
*        3 SMF24TDS FIXED(32),    /* TIME OFFLOAD DATA SET ALLOCATED */ 16570000
*        3 SMF24DDS FIXED(32),    /* DATE OFFLOAD DATA SET ALLOCATED */ 16580000
*        3 SMF24ORG CHAR(8),      /* ORIGIN NODE                     */ 16590000
*        3 SMF24TRD FIXED(32),    /* TIME ON READER                  */ 16600000
*        3 SMF24DRD FIXED(32);    /* DATE ON READER                  */ 16610000
*/* Job selection criteria section                                   */ 16620000
*   DCL 1 SMF24JBS BASED(ADDR(SMFRCD24)+SMF24OSP),                      16630000
*        3 SMF24LN1 FIXED(16),    /* LENGTH OF JOB SECTION           */ 16640000
*        3 SMF24JFG BIT(8),       /* JOB FLAGS                       */ 16650000
*          5 SMF24JHL BIT(1),     /*   HELD JOB                      */ 16660000
*          5 SMF24AFF BIT(1),     /*   AFFINITY = ANY                */ 16670000
*          5 *        BIT(6),     /*   RESERVED                      */ 16680000
*        3 SMF24JCL CHAR(1),      /* JOB CLASS                       */ 16690000
*        3 SMF24JND CHAR(8),      /* NODE NAME                       */ 16700000
*          5 SMF24JRT FIXED(32) BDY(BYTE),  /*   ROUTE CODE          */ 16710000
*        3 SMF24JAF CHAR(28),     /* AFFINITY SYSTEM ID'S            */ 16720000
*        3 SMF248CL CHAR(8),      /* 8 CHAR JOB CLASS                */ 16730000
*        3 SMF24EJS CHAR(*);      /* End of job selection            */ 16740000
*/* SYSOUT selection criteria section                                */ 16750000
*   DCL 1 SMF24SOS BASED(ADDR(SMFRCD24)+SMF24OSP),                      16760000
*        3 SMF24LN2 FIXED(16),    /* LENGTH OF SYSOUT SECTION        */ 16770000
*        3 SMF24SFG BIT(8),       /* SYSOUT FLAGS                    */ 16780000
*          5 SMF24SHL BIT(1),     /*   HELD SYSOUT                   */ 16790000
*          5 SMF24SBT BIT(1),     /*   BURSTED SYSOUT                */ 16800000
*          5 SMF24SJH BIT(1),     /*   HELD JOB                      */ 16810000
*          5 SMF24INC BIT(1),     /*   INCOMPLETE DATA SET           */ 16820000
*          5 SMF24MUL BIT(1),     /*   MULTI-DEST DATA SET           */ 16830000
*          5 *        BIT(3),     /*   RESERVED                      */ 16840000
*        3 SMF24SCL CHAR(1),      /* SYSOUT CLASS                    */ 16850000
*        3 SMF24SND CHAR(8),      /* NODE NAME                       */ 16860000
*          5 SMF24SRT FIXED(32) BDY(BYTE),  /*   ROUTE CODE          */ 16870000
*        3 SMF24SRN CHAR(8),      /* REMOTE NAME                     */ 16880000
*        3 SMF24FCB CHAR(4),      /* FCB                             */ 16890000
*        3 SMF24FOR CHAR(8),      /* FORMS                           */ 16900000
*        3 SMF24FLS CHAR(4),      /* FLASH                           */ 16910000
*        3 SMF24PRM CHAR(8),      /* PR MODE                         */ 16920000
*        3 SMF24UCS CHAR(4),      /* UCS                             */ 16930000
*        3 SMF24WID CHAR(8),      /* WRITER                          */ 16940000
*        3 SMF24REC FIXED(32),    /* DATA SET RECORD COUNT           */ 16950000
*        3 SMF24PRY FIXED(8);     /* PRIORITY                        */ 16960000
*/* Enhanced SYSOUT Support (ESS) Section                            */ 16970000
*   DCL 1 SMF24ESS BASED(ADDR(SMFRCD24)+SMF24OSW),                      16980000
*        3 SMF24LN3 FIXED(16),    /* LENGTH OF ESS SECTION           */ 16990000
*        3 SMF24SGT FIXED(32)     /* SEGMENT IDENTIFIER              */ 17000000
*                   BDY(BYTE),                                          17010000
*        3 SMF24IND BIT(8),       /* ESS SECTION INDICATOR           */ 17020000
*          5 SMF24SJF BIT(1),     /*   ERROR OBTAINING SWBTU            17030000
*                                        (SWBTU DATA NOT PRESENT)    */ 17040000
*          5 *        BIT(7),     /*   RESERVED                      */ 17050000
*        3 *        CHAR(1),      /* RESERVED                        */ 17060000
*        3 SMF24JDT CHAR(8),      /* JDVT NAME                       */ 17070000
*        3 SMF24TUL FIXED(16),    /* SWBTU DATA AREA LENGTH          */ 17080000
*        3 SMF24TU  CHAR(*);      /* SWBTU DATA AREA                 */ 17090000
*/* Enhanced SYSTEM AFFINITY suport section.                         */ 17100000
*   DCL 1 SMF24ESA BASED(ADDR(SMFRCD24)+SMF24OSA),                      17110000
*        3 SMF24LS4 FIXED(16),    /* Length of sysaff section        */ 17120000
*        3 *        FIXED(16),    /* Reserved for future IBM use     */ 17130000
*        3 SMF24SAN FIXED(31),    /* Number of system affinities     */ 17140000
*        3 SMF24LN4 FIXED(31),    /* Length of system name           */ 17150000
*        3 SMF24SAC CHAR(*);      /* Start of system aff. names      */ 17160000
*                                                                       17170000
*%IF EQUSW=0 %THEN %GOTO SKIP24;                                        17180000
*/*    LENGTH EQUATES FOR WRITING THIS SMF RECORD                    */ 17190000
* DCL   SMF24LHD FIXED(31) CONSTANT(LENGTH(SMF24BHD)), /*               17200000
*                                           LEN OF HEADER SECTION    */ 17210000
*       SMF24TRP FIXED(31) CONSTANT(LENGTH(SMF24TPS)), /*               17220000
*                                           LENGTH OF TRIPLETS       */ 17230000
*       SMF24NTP FIXED(31) CONSTANT(SMF24TRP/8),       /*               17240000
*                                           NUMBER OF TRIPLETS       */ 17250000
*       SMF24PRD FIXED(31) CONSTANT(LENGTH(SMF24PRO)), /*               17260000
*                                           LENGTH OF PRODUCT SEC    */ 17270000
*       SMF24LN  FIXED(31) CONSTANT(LENGTH(SMF24GEN)), /*               17280000
*                                           LENGTH OF GENERAL SEC    */ 17290000
*       SMF24L1  FIXED(31) CONSTANT(OFFSET(SMF248CL)+                   17300000
*                                   LENGTH(SMF248CL)), /*               17310000
*                                           LENGTH OF JOB SEL SEC    */ 17320000
*       SMF24L2  FIXED(31) CONSTANT(LENGTH(SMF24SOS)), /*               17330000
*                                           LENGTH OF SYSOUT SEC     */ 17340000
*       SMF24ESL FIXED(31) CONSTANT(OFFSET(SMF24TUL)+                   17350000
*                                   LENGTH(SMF24TUL)), /*               17360000
*                                           Length of the fixed portion 17370000
*                                             of the ESS section     */ 17380000
*       SMF24SAL FIXED(31) CONSTANT(OFFSET(SMF24LN4)+                   17390000
*                                   LENGTH(SMF24LN4)), /*               17400000
*                                           Length of the fixed portion 17410000
*                                             of the SYS. AFF SECTION*/ 17420000
*/*    Equate for SMF24RTY                                           */ 17430000
*       SMFJ24   FIXED(8)  CONSTANT(24), /* SPOOL OFFLOAD RECORD TYPE*/ 17440000
*/*    Equate for SMF24SUB                                           */ 17450000
*       SMF24JT  FIXED(16) CONSTANT(1),  /* JOB TRANSMITTER          */ 17460000
*       SMF24JR  FIXED(16) CONSTANT(2),  /* JOB RECEIVER             */ 17470000
*       SMF24ST  FIXED(16) CONSTANT(3),  /* SYSOUT TRANSMITTER       */ 17480000
*       SMF24SR  FIXED(16) CONSTANT(4);  /* SYSOUT RECEIVER          */ 17490000
*%SKIP24:  ;                                                            17500000
* @Logic;                                                               17510000
* #PRAGMA TOOL=PADI.                                                    17520000
* #ASMLINE.         GBLB  &EQUSW                                        17530000
* #ASMLINE.&EQUSW   SETB  1                                             17540000
* #ASMLINE.         IAZSMF24                                            17550000
* #LINE.Dcl SMF24PTR Pointer(31);                                       17560000
* #LINE.% DCL   EQUSW FIXED EXTERNAL;                                   17570000
* #LINE.% EQUSW = 1;                                                    17580000
* #PADIDELETE.SMF24PTR                                                  17590000
* #PADIDELETE.SMF24POF                                                  17600000
* #PADIDELETE.SMF24GOF                                                  17610000
* #PADIDELETE.SMF24SOF                                                  17620000
* #PADIDELETE.SMF24AOF                                                  17630000
* #EPRAGMA                                                              17640000
* @ENDLOGIC;                                                            99999999
