*%GOTO IAZPRO52;         /*                                             00020000
         MACRO                                                          00030000
         IAZSMF52 ,                                                  */ 00040000
*%IAZPRO52: ;                                                           00050000
*/* START OF SPECIFICATIONS **********************************          00060000
.****PROPRIETARY-STATEMENT************************************          00070000
.*01* PROPRIETARY STATEMENT:                                 *          00080000
.*                                                           *          00090000
.*    LICENSED MATERIALS-PROPERTY OF IBM                     *          00100000
.*    5650-ZOS Copyright IBM Corp. 1983, 2019                *          00110000
.*                                                           *          00120000
.*    STATUS:  HBB77C0                                       *          00130000
.*                                                           *          00140000
.****END-OF-PROPRIETARY-STATEMENT*****************************          00200000
*                                                            *          00300000
*01* DESCRIPTIVE NAME:  JES SMF SNA start event record       *          00400000
*02*  ACRONYM:  IAZSMF52                                     *          00500000
*                                                            *          00600000
*01* MACRO NAME:  IAZSMF52                                   *          00700000
*                                                            *          01300000
*01* DSECT NAME:  N/A                                        *          01310000
*01* LABEL PREFIX:  SMF52                                    *          01330000
*                                                            *          01340000
*01* COMPONENT ID:  JES Common (SC141)                       *          01400000
*                                                            *          01500000
*01* EXTERNAL CLASSIFICATION: PI                             *          01510000
*01* END OF EXTERNAL CLASSIFICATION:                         *          01511000
*                                                            *          01520000
*** END OF SPECIFICATIONS   **********************************       */ 01530000
*%GOTO IAZ52;                                                        /* 01600000
.*                                                                   *  01700000
.* INVOCATION =                                                      *  01800000
.*               BAL  - IAZSMF52 (NO DSECT CREATED - START OF RECORD *  01900000
.*                       IS AT SMFRCD52 )                            *  02000000
.*               PL/S - %INCLUDE SYSLIB(IAZSMF52)                    *  02100000
.*                      DCL SMF52PTR PTR                             *  02105000
.*                                                                   *  02110000
.* CHANGE ACTIVITY:                                                  *  02200000
.*                                                                   *  02300000
.*                MVS/SP RELEASE 3 LEVEL 3 (SP1.3.3,JBB1329,JBB2125) *  02400000
.*                THIS MACRO ADDED TO SC141 VIA OZ81648              *  02410000
.* $S202710=CHEADERS HBB77C0 190212 TJW:  Updates for C headers      *  02420000
.*                                        S202710                    *  02430000
.*                                                                   *  02500000
.* A000000-999999    CREATED FOR MVS  1.3.3                        @133 02520000
.*********************************************************************  02600000
         SPACE 2                                                        02700000
* SWITCH TO DETERMINE WHETHER TO GENERATE EQUATES FOR WRITING REC       02800000
         GBLB  &EQUSW                                                   02900000
         SPACE 1                                                        03000000
SMFRCD52 EQU   *                   START OF RECORD                      03100000
SMF52PTR EQU   *                   HEADER SEGMENT              @OZ82688 03200000
SMF52LEN DS    CL2                 RECORD LENGTH                        03300000
SMF52SEG DS    CL2                 SEGMENT DESCRIPTOR                   03400000
         SPACE 2                                                        03500000
*  BEGINNING OF JMR OR HASP SMF RECORD                                  03600000
         SPACE 1                                                        03700000
SMF52FLG DC    BL1'0'              HEADER FLAG BYTE                     03800000
SMF52RTY DC    BL1'0'              RECORD TYPE                          03900000
SMF52TME DC    BL4'0'              TOD, USING FORMAT FROM TIME MACRO    04000000
SMF52DTE DC    PL4'0000'           DATE IN PACKD DECIMAL FORM  00YYDDDF 04100000
SMF52SID DC    CL4' '              SYSTEM IDENTIFICATION                04200000
         SPACE 2                                                        04300000
* HEADER FOR HASP SUBSYSTEM RECORD TYPE 52                              04400000
SMFJ52   EQU   52                  RECORD TYPE SNA START EVENT @OZ82688 04500000
         SPACE 1                                                        04600000
SMF52POF DC    BL2'0'              OFFSET TO PRODUCT SECTION            04700000
SMF52PRL DC    BL2'0'              LENGTH OF PRODUCT SECTION            04800000
SMF52PRN DC    BL2'0'              NUMBER OF PRODUCT SECTION            04900000
SMF52IDO DC    BL2'0'              OFFSET TO ID SECTION                 05000000
SMF52IDL DC    BL2'0'              LENGTH OF ID SECTION                 05100000
SMF52IDN DC    BL2'0'              NUMBER OF ID SECTION                 05200000
         SPACE 1                                                        05300000
* PRODUCT SECTION HASP SUBSYSTEM RECORD TYPES 52                        05400000
         SPACE 1                                                        05500000
SMF52OPS DS    0C                  Define start of product section      05510000
SMF52SUB DC    BL2'0'              SUBTYPE ID NUMBER                    05600000
SMF52LON EQU   1                      LOGON EVENT                       05700000
SMF52SLN EQU   2                      START LINE EVENT                  05800000
SMF52VER DC    CL2'01'             RECORD VERSION NUMBER                05900000
SMF52SYS DC    CL4'JES2'           SUBSYSTEM NAME                       06000000
* ID SECTION OF HASP TYPE 52 (SNA) START EVENT AFTER TWO HDRS           06200000
         SPACE 1                                                        06300000
SMF52IDS DS    0C                  Define start of id section           06310000
SMF52RMT DC    CL8' '              REMOTE NAME                          06400000
SMF52LIN DC    CL8' '              LINE NAME                            06500000
SMF52PSW DC    CL8' '              LINE PASSWORD                        06600000
SMF52END DS    0C                  END OF TYPE 52 RECORD                06700000
         SPACE 1                                                        06800000
         AIF (NOT &EQUSW).SKIP                                          06900000
*   LENGTH EQUATES                                                      07000000
SMF52OFP EQU SMF52IDN+L'SMF52IDN-SMFRCD52  OFFSET TO PROD SECT @YA06451 07100000
SMF52LPR EQU SMF52SYS+L'SMF52SYS-SMF52SUB  LENGTH OF PROD SECT @YA06451 07200000
SMF52OFI EQU SMF52SYS+L'SMF52SYS-SMFRCD52  OFFSET TO ID SECT   @YA06451 07300000
SMF52LID EQU SMF52PSW+L'SMF52PSW-SMF52IDS  LENGTH OF ID SECT   @YA06451 07400000
.SKIP    ANOP                                                           07500000
         MEND       */                                                  07510000
*%IAZ52:;                                                               07520000
*%  DCL  EQUSW FIXED EXTERNAL; /*SWITCH TO DETERMINE WHETHER TO         07530000
*                                GENERATE EQUATES FOR WRITING REC    */ 07540000
*   DCL 1 SMFRCD52 BASED(SMF52PTR) BDY(WORD),                           07550000
*        3 SMF52LEN FIXED(15),    /* RDW RECORD LENGTH               */ 07560000
*        3 SMF52SEG FIXED(15),    /* RDW SEGMENT DESCRIPTOR          */ 07570000
*                                                                       07580000
*/*  Beginning of JMR or HASP SMF record                             */ 07590000
*        3 SMF52FLG BIT(8),       /* HEADER FLAG BYTE                */ 07600000
*        3 SMF52RTY FIXED(8),     /* RECORD TYPE                     */ 07610000
*        3 SMF52TME FIXED(32)     /* TOD, USING TIME MACRO FORMAT    */ 07620000
*                   BDY(BYTE),                                          07630000
*        3 SMF52DTE FIXED(32)     /* DATE PACKD DECIMAL FORM 00YYDDD */ 07640000
*                   BDY(BYTE),                                          07650000
*        3 SMF52SID CHAR(4),      /* SYSTEM IDENTIFICATION           */ 07660000
*                                                                       07670000
*/*  Header for HASP subsystem record type 52                        */ 07680000
*        3 SMF52POF FIXED(15),    /* OFFSET TO PRODUCT SECTION       */ 07690000
*        3 SMF52PRL FIXED(15),    /* LENGTH OF PRODUCT SECTION       */ 07700000
*        3 SMF52PRN FIXED(15),    /* NUMBER OF PRODUCT SECTION       */ 07710000
*        3 SMF52IDO FIXED(15),    /* OFFSET TO ID SECTION            */ 07720000
*        3 SMF52IDL FIXED(15),    /* LENGTH OF ID SECTION            */ 07730000
*        3 SMF52IDN FIXED(15);    /* NUMBER OF ID SECTION            */ 07740000
*                                                                       07750000
*/*  Product section HASP subsystem record types 52                  */ 07760000
*   DCL 1 SMF52OPS BASED(ADDR(SMFRCD52)+SMF52POF) BDY(WORD),            07770000
*        3 SMF52SUB FIXED(15),    /* SUBTYPE ID NUMBER               */ 07780000
*        3 SMF52VER CHAR(2),      /* RECORD VERSION NUMBER           */ 07790000
*        3 SMF52SYS CHAR(4);      /* SUBSYSTEM NAME                  */ 07800000
*                                                                       07810000
*/*  Id section of HASP type 52 (SNA) start event after two hdrs     */ 07820000
*   DCL 1 SMF52IDS BASED(ADDR(SMFRCD52)+SMF52IDO) BDY(WORD),            07830000
*        3 SMF52RMT CHAR(8),      /* REMOTE NAME                     */ 07840000
*        3 SMF52LIN CHAR(8),      /* LINE NAME                       */ 07850000
*        3 SMF52PSW CHAR(8);      /* LINE PASSWORD                   */ 07860000
*                                                                       07870000
*%IF EQUSW=0 %THEN %GOTO SKIP52;                                        07880000
*/*    Length equates for writing this SMF record                    */ 07890000
* DCL   SMF52LPR FIXED(31) CONSTANT(LENGTH(SMF52OPS)), /*               07900000
*                                           Len of product section   */ 07910000
*       SMF52LID FIXED(31) CONSTANT(LENGTH(SMF52IDS)), /*               07920000
*                                           Length of id section     */ 07930000
*/*    Equate for SMF52RTY                                           */ 07940000
*       SMFJ52   FIXED(8)  CONSTANT(52), /* SNA start event record   */ 07950000
*/*    Equate for SMF52SUB                                           */ 07960000
*       SMF52LON FIXED(16) CONSTANT(1),  /* LOGON event              */ 07970000
*       SMF52SLN FIXED(16) CONSTANT(2);  /* START line event         */ 07980000
*%SKIP52:  ;                                                            07990000
* @Logic;                                                               08000000
* #PRAGMA TOOL=PADI.                                                    08010000
* #ASMLINE.         GBLB  &EQUSW                                        08020000
* #ASMLINE.&EQUSW   SETB  1                                             08030000
* #ASMLINE.         IAZSMF52                                            08040000
* #LINE.Dcl SMF52PTR Pointer(31);                                       08050000
* #LINE.% DCL   EQUSW FIXED EXTERNAL;                                   08060000
* #LINE.% EQUSW = 1;                                                    08070000
* #PADIDELETE.SMF52PTR                                                  08080000
* #PADIDELETE.SMF52IDS                                                  08090000
* #PADIDELETE.SMF52END                                                  08100000
* #PADIDELETE.SMF52OFP                                                  08110000
* #PADIDELETE.SMF52OFI                                                  08120000
* #EPRAGMA                                                              08130000
* @ENDLOGIC;                                                            99999999
