*%GOTO  IAZPRO45 ;     /*                                               00100000
         MACRO                                                          00200000
         IAZSMF45 ,                                                  */ 00300000
*%IAZPRO45: ;                                                           00400000
*/* START OF SPECIFICATIONS **********************************          00410000
.****PROPRIETARY-STATEMENT************************************          00420000
.*01* PROPRIETARY STATEMENT:                                 *          00430000
.*                                                           *          00440000
.*    LICENSED MATERIALS-PROPERTY OF IBM                     *          00450000
.*    5650-ZOS Copyright IBM Corp. 1983, 2019                *          00460000
.*                                                           *          00470000
.*    STATUS:  HBB77C0                                       *          00480000
.*                                                           *          00490000
.****END-OF-PROPRIETARY-STATEMENT*****************************          00500000
*                                                            *          00600000
*01* DESCRIPTIVE NAME:  JES SMF subsystem stop record        *          00700000
*02*  ACRONYM:  IAZSMF45                                     *          00800000
*                                                            *          00900000
*01* MACRO NAME:  IAZSMF45                                   *          01000000
*                                                            *          01600000
*01* DSECT NAME:  N/A                                        *          01610000
*01* LABEL PREFIX:  SMF45                                    *          01630000
*                                                            *          01640000
*01* COMPONENT ID:  JES Common (SC141)                       *          01700000
*                                                            *          01800000
*01* EXTERNAL CLASSIFICATION: PI                             *          01810000
*01* END OF EXTERNAL CLASSIFICATION:                         *          01811000
*                                                            *          01820000
*** END OF SPECIFICATIONS   **********************************       */ 01830000
*%GOTO IAZ45;                                                        /* 01900000
.*                                                                   *  02000000
.* INVOCATION =                                                      *  02100000
.*               BAL  - IAZSMF45 (NO DSECT CREATED _ START OF RECORD *  02200000
.*                       IS AT SMFRCD45 )                            *  02300000
.*               PL/S - %INCLUDE SYSLIB(IAZSMF45)                    *  02400000
.*                      DCL SMF45PTR PTR                             *  02500000
.*                                                                   *  02510000
.* CHANGE ACTIVITY:                                                  *  02600000
.*                                                                   *  02700000
.*                MVS/SP RELEASE 3 LEVEL 3 (SP1.3.3,JBB1329,JBB2125) *  02800000
.*                THIS MACRO ADDED TO SC141 VIA OZ81648              *  02810000
.* $S202710=CHEADERS HBB77C0 190212 TJW:  Updates for C headers      *  02820000
.*                                        S202710                    *  02830000
.*                                                                   *  02900000
.* A000000-999999    CREATED FOR MVS 1.3.3                        @133  02910000
.*********************************************************************  03000000
         SPACE 2                                                        03100000
* SWITCH TO DETERMINE WHETHER TO GENERATE EQUATES FOR WRITING REC       03200000
         GBLB  &EQUSW                                                   03300000
         SPACE 1                                                        03400000
* SUBSYSTEM STOP RECORD TYPE 45                                         03500000
         DS    0F       ALIGN TO FULL WORD BOUNDRY                      03600000
SMFRCD45 EQU   *        START OF RECORD                                 03700000
SMF45PTR EQU   *        HEADER SEGMENT                         @OZ82688 03800000
SMF45J2  DS    0X       BEGINING OF JES2 REC                            03810000
SMF45LEN DS    BL2      RECORD LENGTH                                   03900000
SMF45SEG DS    BL2      SEGMENT DESCRIPTOR                              04000000
SMF45FLG DS    BL1      HEADER FLAG BYTE                                04100000
SMF45RTY DS    BL1      RECORD TYPE 45                                  04200000
SMFJ45   EQU   45        STOP SUBSYSTEM RECORD TYPE            @OZ82688 04300000
SMF45TME DS    BL4      TOD FROM TIME MACRO BINARY                      04400000
SMF45DTE DS    PL4      DATE FROM TIME MACRO                            04500000
SMF45SID DS    CL4      SYSTEM IDENTIFICATION                           04600000
* SUBSYSTEM IDENTIFICATION SECTION                                      04700000
SMF45SBS DS    BL2      SUBSYSTEM IDENTIFIER                            04800000
SMF45HSP EQU   X'0002'      JES2 ID                                     04900000
SMF45ASP EQU   X'0005'      JES3 ID                                     05000000
*                       X'0006' SS06                                    05100000
SMF45RSV DS    BL2      RESV                                            05200000
SMF45LRR DS    BL2      LGTH OF REMAINDER OF RECORD                     05300000
*                       (NOT INCLUDING THIS FIELD)                      05400000
SMF45SBG EQU   *        SUBSYSTEM SECTION BEGINNING                     05500000
* JES2 SECTION                                                          05600000
SMF45IND DS    BL2      INDICATORS                                      05700000
SMF45ATM EQU   X'80'    BIT 0 ABNORMAL TERMINATION                      05800000
*                       1-15 RESERVED                                   05900000
SMF45JCC DS    BL2      JES2 COMPLETION CODE                            06000000
         ORG   SMF45SBG                                                 06100000
* JES3 SECTION                                                          06200000
SMF45JS3 DS    0X       BEGINING OF JES2 SECTION                        06210000
SMF45FG1 DS    BL1      STOP RECORD FLAGS                               06300000
SMF45ABN EQU   X'80'    SUBSYSTEM ENDED DUE TO ABEND                    06400000
SMF45DSI EQU   X'40'    DSI HAS BEEN INVOKED                            06500000
SMF45J3C DS    XL3      COMPLETION CODE(SYS/USER)                       06600000
SMF45RV1 DS    BL1      RESERVED                                        06700000
SMF45US1 DS    BL1      USER FLAG                                       06800000
SMF45RVJ DS    CL8      RESERVED FOR JES3                               06900000
SMF45RVU DS    CL4      RESERVED FOR USER                               07000000
SMF45END DS    0X       END OF JES3 RECORD                              07100000
SMF45SIZ DS    0XL(SMF45END-SMFRCD45) SIZE OF JES3 45 RECORD            07200000
         ORG   SMF45SBG                                                 07300000
* SS06 SECTION                                                          07400000
SMF45PCO DS    0X       BEGINING OF SS06 SECTION                        07410000
SMF45PRC DC    CL8' '   SS06 PROCNAME                                   07500000
SMF45STF DS    BL1      SYSTEM TERMINATION FLAGS                        07600000
SMF45HLT EQU   128      HALT ISSUED                                     07700000
SMF45OPS EQU   64       OPERATOR STOP                                   07800000
SMF45ABT EQU   32       ABNORMAL TERMINATION                            07900000
SMF45NOS EQU   16       NOSAVE SPECIFIED IN HALT                        08000000
SMF45UID DS    BL3      USER ID FOR HALT                                08100000
SMF45NUL DS    BL2      NO. USERS LOGGED ON AT TERMINATION              08200000
         SPACE 2                                                        08300000
         AIF (NOT &EQUSW).SKIP                                          08400000
*      LENGTH EQUATES                                                   08500000
SMF45L1  EQU   SMF45JCC+L'SMF45JCC-SMF45LEN  LEN OF TYPE 45 RECORD      08600000
SMF45L2  EQU   SMF45JCC+L'SMF45JCC-SMF45IND  LEN OF JES2 SECTION        08700000
.SKIP    ANOP                                                           08800000
         MEND           */                                              08900000
*%IAZ45: ;                                                              09000000
*%  DCL   EQUSW FIXED EXTERNAL; /* SWITCH TO DETERMINE WHETHER TO       09100000
*                                  GENERATE EQUATES FOR WRITING REC */  09200000
*   DCL 1 SMFRCD45 BASED(SMF45PTR) BDY(WORD),                           09300000
*/* RECORD TYPE 45 - SUBSYSTEM STOP                                  */ 09400000
*       2 SMF45J2,                /* BEGINING OF JES2 REC            */ 09500000
*        3 SMF45LEN FIXED(15),    /* RDW RECORD LENGTH               */ 09600000
*        3 SMF45SEG FIXED(15),    /* RDW SEGMENT DESCRIPTOR          */ 09700000
*        3 SMF45FLG BIT(8),       /* OPERATING ENVIRONMENT           */ 09800000
*        3 SMF45RTY FIXED(8),     /* RECORD TYPE 45                  */ 09900000
*        3 SMF45TME FIXED(31) BDY(BYTE), /* TOD RECORD WRITTEN       */ 10000000
*        3 SMF45DTE CHAR(4),      /* DATE RECORD WRITTEN             */ 10100000
*        3 SMF45SID CHAR(4),      /* SYSTEM ID FROM INSTALLATION     */ 10200000
*                                 /* SUBSYSTEM IDENTIFICATION SECTION*/ 10300000
*        3 SMF45SBS FIXED(15),    /* SUBSYSTEM IDENTIFIER            */ 10400000
*                                 /* 2-JES2,                         */ 10500000
*                                 /* 5-JES3,                         */ 10600000
*                                 /* 6-SS06                          */ 10700000
*        3 SMF45RSV CHAR(2),      /* RESV                            */ 10800000
*        3 SMF45LRR PTR(15),      /* LGTH OF REMAINDER OF RECORD        10900000
*                                    (NOT INCLUDING THIS FIELD)      */ 11000000
*        3 SMF45SBG CHAR(4),      /* SUBSYSTEM SECTION               */ 11100000
*/* JES2 SUBSYSTEM DATA                                              */ 11200000
*         5 SMF45IND BIT(16),     /* INDICATORS                      */ 11300000
*          6 SMF45IN1 BIT(8),     /* First byte of indicators        */ 11310000
*           7 SMF45ATM BIT(1),    /* SUBSYSTEM ENDED DUE                11400000
*                                    TO ABEND                        */ 11500000
*           7 *  BIT(7),          /* RESERVED                        */ 11600000
*          6 *  BIT(8),           /* RESERVED                        */ 11610000
*         5 SMF45JCC FIXED(16) BDY(BYTE); /* JES2 COMP CODE          */ 11700000
*/* JES3 SUBSYSTEM DATA                                              */ 11800000
*DCL 1 SMF45JS3 BASED(ADDR(SMF45SBG)),                                  11900000
*      3 SMF45FG1 BIT(8),         /* STOP RECORD FLAGS               */ 12000000
*        5 SMF45ABN BIT(1),       /* SUBSYSTEM ENDED DUE                12100000
*                                    TO ABEND                        */ 12200000
*        5 SMF45DSI BIT(1),       /* DSI HAS BEEN INVOKED            */ 12300000
*      3 SMF45J3C CHAR(3),        /* COMPLETION CODE                 */ 12400000
*      3 SMF45RV1 BIT(8),         /* RESERVED                        */ 12500000
*      3 SMF45US1 BIT(8),         /* USER FLAG                       */ 12600000
*      3 SMF45RVJ CHAR(8),        /* RESERVED FOR JES3               */ 12700000
*      3 SMF45RVU CHAR(4),        /* RESERVED FOR USER               */ 12800000
*      3 SMF45END CHAR(0);        /* END OF JES3 RECORD              */ 12900000
*/* SS06 SUBSYSTEM DATA                                              */ 13000000
*   DCL 1 SMF45PCO BASED(ADDR(SMF45SBG)),                               13100000
*        3 SMF45PRC CHAR(8),       /* SS06 PROC NAME                 */ 13200000
*        3 SMF45STF BIT(8),        /* SYSTEM TERMINATION FLAGS          13300000
*                                                                    */ 13400000
*          5 SMF45HLT BIT(1),      /* HALT ISSUED                    */ 13500000
*          5 SMF45OPS BIT(1),      /* OPERATOR STOP                  */ 13600000
*          5 SMF45ABT BIT(1),      /* ABNORMAL TERMINATION           */ 13700000
*          5 SMF45NOS BIT(1),      /* NOSAVE SPECIFIED IN HALT          13800000
*                                                                    */ 13900000
*        3 SMF45UID CHAR(3),       /* USER ID FOR HALT               */ 14000000
*        3 SMF45NUL FIXED(15);     /* NO. USERS LOGGED ON               14100000
*                                     AT TERMINATION                 */ 14200000
*%IF EQUSW=0 %THEN %GOTO SKIP45;                                        14300000
*/*  EQUATES USED FOR WRITING RECORD                                 */ 14400000
*   DCL   SMFJ45 FIXED(8) CONSTANT(45), /* STOP SUBSYS REC TYPE      */ 14500000
*         SMF45L1 FIXED(32) CONSTANT(LENGTH(SMF45J2)),                  14600000
*                                      /* LEN JES2 TYPE 45           */ 14700000
*         SMF45L2 FIXED(32) CONSTANT(LENGTH(SMF45SBG)),                 14800000
*                                      /* LEN OF JES2 SECT           */ 14900000
*         SMF45HSP FIXED(32) CONSTANT(2), /* JES2 ID                 */ 15000000
*         SMF45ASP FIXED(32) CONSTANT(5); /* JES3 ID                 */ 15010000
*%SKIP45: ;                                                             15020000
* @Logic;                                                               15030000
* #PRAGMA TOOL=PADI.                                                    15040000
* #ASMLINE.         GBLB  &EQUSW                                        15050000
* #ASMLINE.&EQUSW   SETB  1                                             15060000
* #ASMLINE.         IAZSMF45                                            15070000
* #LINE.Dcl SMF45PTR Pointer(31);                                       15080000
* #LINE.% DCL   EQUSW FIXED EXTERNAL;                                   15090000
* #LINE.% EQUSW = 1;                                                    15100000
* #PADIDELETE.SMF45PTR                                                  15110000
* #PADIDELETE.SMF45SIZ                                                  15120000
* #PADIDELETE.SMF45IN1                                                  15130000
* #EPRAGMA                                                              15140000
* @ENDLOGIC;                                                            99999999
