*        %GOTO SYDFCMT;            /* Bilingual mapping macro           00010000
         MACRO                                                          00020000
         IAZSYMDF &DSECT=YES                                            00030000
.*/      %SYDFCMT: ;                                                    00040000
*                                                                       00050000
*/**** START OF SPECIFICATIONS ***************************************  00060000
.****PROPRIETARY-STATEMENT********************************************  00070000
.*01* PROPRIETARY STATEMENT:                                         *  00080000
.*                                                                   *  00090000
.*   LICENSED MATERIALS-PROPERTY OF IBM                              *  00100000
.*   5650-ZOS Copyright IBM Corp. 2013, 2019                         *  00110000
.*                                                                   *  00120000
.*   STATUS:  HBB77C0                                                *  00130000
.*                                                                   *  00140000
.****END-OF-PROPRIETARY-STATEMENT*************************************  00150000
*                                                                    *  00160000
*01* DESCRIPTIVE NAME: Parameter list and data areas used            *  00170000
*                      by the JES symbol service IAZSYMBL.           *  00180000
*                                                                    *  00190000
*02* ACRONYM:     IAZSYMDF                                           *  00200000
*                                                                    *  00210000
*01* MACRO NAME:  IAZSYMDF                                           *  00220000
*                                                                    *  00230000
*01* DSECT NAME:  Parameter list DSECT is JSYMPARM.                  *  00240000
*                 See below for DSECT names of other data            *  00250000
*                 structures used by the service.                    *  00260000
*01* LABEL PREFIX: Parameter list prefix is JSYM.                    *  00270000
*                  See individual DSECTs for the label               *  00280000
*                  prefixes used.                                    *  00290000
*                                                                    *  00300000
*01* COMPONENT ID:  JES Common (SC141)                               *  00310000
*                                                                    *  00320000
*01* EXTERNAL CLASSIFICATION:                                        *  00330000
*      GUPI:  base                                                   *  00340000
*      DMTI:  fields                                                 *  00350000
*             JSYTSIZE JSYESIZE JSYMOUTF JSYTSIZ1 JSYESIZ1           *  00360000
*                                                                    *  00370000
*01* END OF EXTERNAL CLASSIFICATION:                                 *  00380000
*                                                                    *  00390000
*01* EYE-CATCHER:  Parameter list - 'JSYM'                           *  00400000
*                  See individual DSECTs for                         *  00410000
*                  the eye-catchers they use.                        *  00420000
*02*  OFFSET:      JSYMEYE                                           *  00430000
*02*  LENGTH:      L'JSYMEYE                                         *  00440000
*                                                                    *  00450000
*01* STORAGE ATTRIBUTES:                                             *  00460000
*02*  SUBPOOL:  Determined by the caller of the service.             *  00470000
*                                                                    *  00480000
*02*  KEY:  Determined by the caller of the service.                 *  00490000
*                                                                    *  00500000
*02*  RESIDENCY:                                                     *  00510000
*      Virtual - anywhere in 31-bit storage                          *  00520000
*      Real    - anywhere in 64 bit storage                          *  00530000
*                                                                    *  00540000
*01* SIZE:                                                           *  00550000
*     See below for sizes of individual DSECTs                       *  00560000
*                                                                    *  00570000
*01* CREATED BY:                                                     *  00580000
*     Parameters - by the caller of the service.                     *  00590000
*     Data structures returned by the service - created              *  00600000
*     by the service in a storage provided by the caller.            *  00610000
*                                                                    *  00620000
*01* POINTED TO BY:                                                  *  00630000
*     Parameter list - register 1 during the call.                   *  00640000
*     Other data structures - pointed to from the parameter          *  00650000
*     list.                                                          *  00660000
*                                                                    *  00670000
*01* SERIALIZATION:                                                  *  00680000
*                                                                    *  00690000
*     None required                                                  *  00700000
*                                                                    *  00710000
*01* FUNCTION:                                                       *  00720000
*                                                                    *  00730000
*     This macro provides the mapping of the data structures         *  00740000
*     used by the JES symbol service (see macro IAZSYMBL):           *  00750000
*      - Parameters passed to the service                            *  00760000
*      - Data structures returned by the service                     *  00770000
*                                                                    *  00780000
*     IAZSYMBL service performs operations on JES symbols            *  00790000
*     defined for the current task or job step:                      *  00800000
*      - Create symbols (names and values)                           *  00810000
*      - Update symbol values given symbol names                     *  00820000
*      - Delete symbols                                              *  00830000
*      - Clear  symbols                                              *  00840000
*      - Extract symbol values given symbol names                    *  00850000
*                                                                    *  00860000
*01* METHOD OF ACCESS:                                               *  00870000
*                                                                    *  00880000
*02*  ASM:                                                           *  00890000
*      IAZSYMDF DSECT=YES!NO                                         *  00900000
*                                                                    *  00910000
*        DSECT=YES  - Generate DSECT statement for                   *  00920000
*                     the parameter list structure                   *  00930000
*                                                                    *  00940000
*        DSECT=NO   - Do not generate DSECT statement.               *  00950000
*                     Could be used to reserve space for             *  00960000
*                     the parameter list in the current              *  00970000
*                     CSECT or DSECT                                 *  00980000
*                                                                    *  00990000
*02*  PL/X:                                                          *  01000000
*      %DCL JSYM_ATRB CHAR                                           *  01010000
*      %JSYM_ATRB = 'value'                                          *  01020000
*      %INCLUDE SYSLIB(IAZSYMDF)                                     *  01030000
*                                                                    *  01040000
*      where 'value' is a valid variable storage attribute,          *  01050000
*      e.g. 'BASED(JSYMPTR@)'. If %JSYM_ATRB was not set,            *  01060000
*      it defaults to '' (null).                                     *  01070000
*                                                                    *  01080000
*      This applies only to the parameter list structure.            *  01090000
*      All other structures are always generated as BASED.           *  01100000
*                                                                    *  01110000
*01* USED BY:                                                        *  01120000
*     Applications which desire to use JES symbol service            *  01130000
*     to manage task or job level JES symbols.                       *  01140000
*                                                                    *  01150000
*01* DELETED BY:                                                     *  01160000
*     Disposition of all data structures used by the JES             *  01170000
*     SYMBOL service is responsibility of the caller.                *  01180000
*                                                                    *  01190000
*01* FREQUENCY:                                                      *  01200000
*     Parameter list - one per call to service.                      *  01210000
*     Optional input symbol name list or symbol table                *  01220000
*     pointed to from the parameter list - zero or one               *  01230000
*     per call to service.                                           *  01240000
*     Output symbol table - zero or one per call to service          *  01250000
*     depending on the success of the call.                          *  01260000
*     Note that output symbol table is returned in the               *  01270000
*     data area, provided by the caller and pointed to               *  01280000
*     from the parameter list.                                       *  01290000
*                                                                    *  01300000
*01* RESTRICTIONS:                                                   *  01310000
*     Access to JCL symbols requires that caller does not hold       *  01320000
*     any locks and is in task mode (see Extract function).          *  01330000
*     Specifying JSYMLVNJ option removes these restrictions but      *  01340000
*     prevents access to the JCL symbols.                            *  01350000
*                                                                    *  01360000
*01* NOTES:                                                          *  01370000
*                                                                    *  01380000
*   1.In the description of fields in the parameter list,            *  01390000
*     the following notation is used:                                *  01400000
*                                                                    *  01410000
*     I     Input (caller supplies information)                      *  01420000
*     IS    Input (used for data selection/filtering)                *  01430000
*     IS*   Same as IS, but field supports wild cards:               *  01440000
*               '?' matches any single character                     *  01450000
*               '*' matches any zero or more characters              *  01460000
*     O     Output (Service returns information)                     *  01470000
*                                                                    *  01480000
*   2.Dependencies:                                                  *  01490000
*     PL/X Version - macro variable JSYM_ATRB must be                *  01500000
*     declared and set to valid storage attributes before            *  01510000
*     the macro is invoked.                                          *  01520000
*                                                                    *  01530000
*                                                                    *  01540000
****** END OF SPECIFICATIONS ****************************************/  01550000
*/********************************************************************  01560000
*01* CHANGE ACTIVITY:                                                *  01570000
* $Z21LSYM=BASEQ    HBB7790 110829 ALP:  JES symbol service           * 01575000
*                                                                    *  01576000
* $S202710=CHEADERS HBB77C0 190212 TJW:  Updates for C headers       *  01577000
*                                        S202710                     *  01578000
*                                                                    *  01580000
*01* A000000-999999    Created for z/OS rel 2.1               @Z21LSYM  01590000
*********************************************************************/  01600000
*/*                                                                 */  01610000
* % GOTO END_OF_ASM_SYDF; /*                                            01620000
*                                                                       01630000
         SPACE 1                                                        01640000
**************************************************************          01650000
*                                                            *          01660000
*        Return codes from the service (JSYMRETN)            *          01670000
*                                                            *          01680000
**************************************************************          01690000
         SPACE 1                                                        01700000
JSYMOK   EQU   0                   Request successful                   01710000
JSYMERRW EQU   4                   Request completed with possible     C01720000
                                   errors, see JSYMREAS for reason     C01730000
                                   code                                 01740000
JSYMERRU EQU   8                   Request not completed due to        C01750000
                                   user error, see JSYMREAS for        C01760000
                                   reason code                          01770000
JSYMERRJ EQU   12                  Request not completed due to        C01780000
                                   an internal (JES) error,            C01790000
                                   JSYMREAS contains internal JES      C01800000
                                   reason code                          01810000
         SPACE 1                                                        01820000
**************************************************************          01830000
*                                                            *          01840000
*        Reason codes for non-zero return codes (JSYMREAS)   *          01850000
*                                                            *          01860000
**************************************************************          01870000
         SPACE 1                                                        01880000
JSYMNOTF EQU   4                   Some or all of the symbols were     C01890000
                                    not found                           01900000
JSYMSTRE EQU   8                   Not enough storage provided by      C01910000
                                    the caller (see JSYMSRCM)           01920000
JSYMOPER EQU   12                  Invalid operation requested          01930000
         SPACE 1                                                        01940000
JSYMSLEV EQU   16                  Invalid symbol level/scope           01950000
JSYMINTB EQU   20                  Invalid input symbol table, e.g.    C01960000
                                    - wrong eyecatcher/version         C01962000
                                    - wrong table length               C01964000
                                    - offsets to table elements        C01966000
                                      beyond table length               01968000
JSYMTRNC EQU   24                  Some values were truncated           01970000
JSYMDUP  EQU   28                  Duplicate symbols                    01980000
JSYMAUTH EQU   32                  Caller not authorized to perform    C01990000
                                    this operation or                  C01992000
                                   Caller not authorized to manage     C01995000
                                    system symbols                      02000000
JSYMNMER EQU   36                  Invalid symbol name                  02010000
JSYMNSTG EQU   40                  Not enough storage for internal     C02020000
                                    symbol table                        02025000
JSYMSSVE EQU   44                  Invalid value for a system symbol    02030000
JSYMISTG EQU   48                  Extract not complete due to storage C02040000
                                    shortage for internal processing    02050000
JSYMISNE EQU   52                  Incorrect length of symbol name     C02060000
                                    in the input symbol list            02070000
JSYMSPSY EQU   56                  Special symbols can be extracted    C02080000
                                    by name but cannot be managed as   C02090000
                                    symbols                             02100000
JSYMENVE EQU   60                  Environment error - function not    C02110000
                                    available in SRB mode               02120000
         EJECT                                                          02130000
**************************************************************          02140000
*                                                            *          02150000
*        The following data structure is a parameter list    *          02160000
*        of the JES symbol service IAZSYMBL.                 *          02170000
*        Pointer to parameter list is passed in register 1   *          02180000
*        when calling the service (see IAZSYMBL macro).      *          02190000
*                                                            *          02200000
**************************************************************          02210000
         SPACE 1                                                        02220000
         AIF   ('&DSECT' EQ 'YES').JSYM010,                            C02230000
               ('&DSECT' EQ 'NO').JSYM020                               02240000
         MNOTE 8,'IAZSYMDF:  DSECT= must be either YES or NO'           02250000
         AGO   .JSYMEND                                                 02260000
.JSYM010 ANOP                                                           02270000
JSYMPARM DSECT ,                   IAZSYMBL parameter list              02280000
         AGO   .JSYM030                                                 02290000
.JSYM020 ANOP                                                           02300000
JSYMPARM DS    0D                  IAZSYMBL parameter list              02310000
.JSYM030 ANOP                                                           02320000
         SPACE 1                                                        02330000
JSYMEYE  DC    CL4'JSYM'           I.Eye catcher                        02340000
JSYMLNG  DC    AL2(JSYMSIZE)       I.Length of parameter list           02350000
         SPACE 1                                                        02360000
JSYMVRM  DC    AL2(JSYMVRMC)       I.Parameter ver/mod:                 02370000
JSYMVER  EQU   JSYMVRM,1,C'A'         - version                         02380000
JSYMMOD  EQU   JSYMVRM+1,1,C'A'       - modification                    02390000
         SPACE 1                   Valid ver/mod:                       02400000
JSYMVRM1 EQU   X'0100'              - original ver/mod                  02410000
JSYMVRMC EQU   X'0100'              - latest   ver/mod                  02420000
         SPACE 1                                                        02430000
JSYMSVRM DC    AL2(0)              O.Service ver/mod                    02440000
JSYMSVER EQU   JSYMSVRM,1,C'A'       - version                          02450000
JSYMSMOD EQU   JSYMSVRM+1,1,C'A'     - modification                     02460000
         SPACE 1                   Supported versions:                  02470000
JSYMSVM1 EQU   X'0100'              - original ver/mod                  02480000
JSYMSVMC EQU   X'0100'              - latest   ver/mod                  02490000
         SPACE 1                                                        02500000
*------------------------------------------------------------*          02510000
*                                                            *          02520000
*        Requested operation:                                *          02530000
*                                                            *          02540000
*        - Create                                            *          02550000
*          Given input symbol table provided by the caller   *          02560000
*          in JSYMISYT, the service will create specified    *          02570000
*          symbols with specified values.                    *          02580000
*                                                            *          02590000
*        - Update                                            *          02600000
*          Given input symbol table provided by the caller   *          02610000
*          in JSYMISYT, the service will update specified    *          02620000
*          symbols with new specified values.                *          02630000
*                                                            *          02640000
*        - Delete                                            *          02650000
*          Given symbol filter specified by the caller in    *          02660000
*          JSYMSNMA/JSYMSNMN, the service will delete        *          02670000
*          the specified symbols.                            *          02680000
*                                                            *          02690000
*        - Extract                                           *          02700000
*          Given symbol filter specified by the caller in    *          02710000
*          JSYMSNMA/JSYMSNMN, the service will return        *          02720000
*          output symbol table with names and values of      *          02730000
*          requested symbols.                                *          02740000
*          Extract subfunction provides access to both JES   *          02750000
*          and JCL symbols, unless JSYMLVNJ option is used.  *          02760000
*                                                            *          02770000
*        - Clear                                             *          02780000
*          Delete all defined symbols at specified levels.   *          02790000
*          This operation is only available for authorized   *          02793000
*          callers.                                          *          02796000
*                                                            *          02800000
*------------------------------------------------------------*          02810000
         SPACE 1                                                        02820000
JSYMRQOP DC    AL1(0)              I.Requested operation:               02830000
JSYMCRT  EQU   4                     create symbols with values         02840000
JSYMUPDT EQU   8                     update symbol values               02850000
JSYMDELE EQU   12                    delete symbols                     02860000
JSYMEXTR EQU   16                    extract values for symbols         02870000
JSYMCLR  EQU   20                    clear all symbols                  02880000
         SPACE 1                                                        02890000
*------------------------------------------------------------*          02900000
*                                                            *          02910000
*        JES symbols can be defined at two levels:           *          02920000
*                                                            *          02930000
*         - task level                                       *          02940000
*           Symbols at the task level are only visible to    *          02950000
*           the code running in the same task (TCB)          *          02960000
*         - job step level                                   *          02970000
*           Symbols at the job step level are visible to     *          02980000
*           the code running in all tasks in the same        *          02990000
*           job step.                                        *          03000000
*                                                            *          03010000
*        Symbol at the task level overrides the symbol with  *          03020000
*        the same name at the job step level.                *          03030000
*                                                            *          03040000
*        Create operation requires symbol level to be        *          03050000
*        selected - JSYMLVLT or JSYMLVLJ must be set, but    *          03060000
*        not both.                                           *          03070000
*                                                            *          03080000
*        Clear operation requires symbol level to be         *          03090000
*        selected - JSYMLVLT or JSYMLVLJ or both must be     *          03100000
*        set.                                                *          03110000
*                                                            *          03120000
*        Update, Delete and Extract ignore level selection.  *          03130000
*        Processing always starts at the task level and      *          03140000
*        only moves to the job step level if requested       *          03150000
*        symbol was not found at the task level.             *          03160000
*                                                            *          03170000
*        JES Symbol service manages JES symbols (Create,     *          03180000
*        Update, Delete, Clear).                             *          03190000
*        In addition, Extract function provides access to    *          03200000
*        JCL Symbols, unless JSYMLVNJ option is specified.   *          03210000
*        Note that when access to JCL symbols is required    *          03220000
*        caller must be in the task mode and cannot hold     *          03230000
*        any locks.                                          *          03240000
*                                                            *          03250000
*        JSYMLVUD option modifies the behaviour of CREATE    *          03250200
*        request when duplicate symbols are encountered.     *          03250800
*        Without JSYMLVUD option, duplicate symbols are not  *          03251400
*        processed and duplicate symbol warning is returned. *          03252000
*        If this option is specified, duplicate symbols      *          03252600
*        are updated instead.                                *          03253200
*                                                            *          03253800
*        JSYMLVJC option applies JCL constraints during      *          03254400
*        EXTRACT processing.                                 *          03255000
*        If JSYMLVJC option is specified, only symbols which *          03255600
*        can be used for JCL substitution are returned.      *          03256200
*        JCL constraints:                                    *          03256800
*         - maximum length of symbol name is 8               *          03257400
*         - maximum length of symbol value is 255            *          03258000
*                                                            *          03258600
*------------------------------------------------------------*          03260000
         SPACE 1                                                        03270000
JSYMLVL  DC    B'00000000'         I.Symbol options:                    03280000
JSYMLVLT EQU   B'10000000'           access symbols at the task level   03290000
JSYMLVLJ EQU   B'01000000'           access symbols at the job step    C03300000
                                      level                             03310000
JSYMLVNJ EQU   B'00100000'           do not access JCL symbols          03320000
JSYMLVUD EQU   B'00010000'           CREATE updates duplicates          03321000
JSYMLVJC EQU   B'00001000'           check JCL constraints              03324000
         SPACE 1                                                        03330000
*------------------------------------------------------------*          03340000
*                                                            *          03350000
*        JSYMISYT points to an input symbol table.           *          03360000
*        Caller passes this table to Create and Update       *          03370000
*        operations to define names and values of the        *          03380000
*        symbols to create or update.                        *          03390000
*                                                            *          03400000
*        The layout of the symbol table is defined by        *          03410000
*        the JSYTABLE DSECT.                                 *          03420000
*                                                            *          03430000
*------------------------------------------------------------*          03440000
         SPACE 1                                                        03450000
JSYMISYT DC    A(*-*)              I. Pointer to an input symbol table  03460000
         SPACE 1                                                        03470000
*------------------------------------------------------------*          03480000
*                                                            *          03490000
*        The following three fields (JSYMSNMA, JSYMSNMN,     *          03500000
*        JSYMSNML) are used by the caller to specify the     *          03510000
*        symbol selection for Delete and Extract operations. *          03520000
*        JSYMSNMA points to a list, JSYMSNMN is a number of  *          03530000
*        elements in the list and JSYMSNML is the length of  *          03540000
*        each element in the list. If JSYMSNML is zero,      *          03550000
*        default length is used (16 characters).             *          03560000
*        Each element in the list specifies name of symbol   *          03561000
*        to be selected (blank-padded if necessary).         *          03564000
*        Wildcards can be used in any element.               *          03570000
*                                                            *          03580000
*------------------------------------------------------------*          03590000
         SPACE 1                                                        03600000
JSYMSNMA DC    A(*-*)              IS*. Pointer to selection list       03610000
JSYMSNMN DC    F'0'                IS.  Number of elements in          C03620000
                                        selection list.                 03630000
JSYMSNM# EQU   JSYMSNMN,L'JSYMSNMN,T'JSYMSNMN  Alias of JSYMSNMN        03635000
JSYMSNML DC    F'0'                IS.  Length of each element in      C03640000
                                        selection list.                C03650000
                                        Valid values 0-16.             C03660000
                                        0 means use 16.                 03670000
         SPACE 1                                                        03680000
*------------------------------------------------------------*          03690000
*                                                            *          03700000
*        Extract operation returns symbol table with         *          03710000
*        symbol names and values of the found symbols in     *          03720000
*        the output area provided by the caller.             *          03730000
*                                                            *          03740000
*        The layout of the symbol table is defined by        *          03750000
*        the JSYTABLE DSECT.                                 *          03760000
*        Total size of the output symbol table is in the     *          03770000
*        JSYTLEN field of the table header.                  *          03780000
*        However, it does not mean that all this space is    *          03790000
*        necessary to hold the data, because symbol table    *          03800000
*        is not necessarily contiguous.                      *          03810000
*        Total space occupied by the actual data is returned *          03820000
*        in JSYMSRCM field. If space provided by the caller  *          03830000
*        is not sufficient for the output, JSYMSRCM shows    *          03840000
*        the recommended size of the output area.            *          03850000
*                                                            *          03860000
*------------------------------------------------------------*          03870000
         SPACE 1                                                        03880000
JSYMOUTA DC    A(*-*)              I. Pointer to caller provided       C03890000
                                      output area                       03900000
JSYMOUTS DC    F'0'                I. Size of caller provided          C03910000
                                      output area                       03920000
         SPACE 1                                                        03930000
JSYMRETN DC    F'0'                O. Service return code               03940000
JSYMREAS DC    F'0'                O. Service reason code               03950000
         SPACE 1                                                        03960000
JSYMSRCM DC    F'0'                O. Recommended size of the output   C03970000
                                      area                              03980000
JSYMERAD DC    A(0)                O. If service returns an error this C03982000
                                      points to approximate location   C03984000
                                      where error was detected          03986000
JSYMOUTF EQU   JSYMRETN,*-JSYMRETN Service output fields                03990000
         SPACE 1                                                        04000000
         DC    9F'0'               Reserved                             04010000
         SPACE 1                                                        04020000
JSYMSZE1 EQU   *-JSYMPARM          Version 1 length                     04030000
JSYMSIZE EQU   *-JSYMPARM          Current version length               04040000
         EJECT ,                                                        04050000
**************************************************************          04060000
*                                                            *          04070000
*        Symbol table                                        *          04080000
*                                                            *          04090000
*        This structure defines a header of the table which  *          04100000
*        contains symbol name/value pairs.                   *          04110000
*                                                            *          04120000
*        Entries in the table are mapped by JSYENTRY DSECT.  *          04130000
*                                                            *          04140000
**************************************************************          04150000
         SPACE 1                                                        04160000
JSYTABLE DSECT ,                   Symbol table                         04170000
         SPACE 1                                                        04180000
JSYTEYE  DS    CL4'JSYT'           Eyecatcher                           04190000
JSYTLEN  DS    F                   Total size of the table              04200000
         SPACE 1                                                        04210000
JSYTVER  DS    AL1                 Version of the table                 04220000
JSYTVER1 EQU   1                    Version 1                           04230000
         DS    XL3                 Reserved                             04240000
         SPACE 1                                                        04250000
JSYTENT1 DS    F                   Offset from the beginning of        C04260000
                                    the table to the first entry        04270000
JSYTENTN DS    F                   Number of entries in the table       04280000
JSYTENT# EQU   JSYTENTN,L'JSYTENTN,T'JSYTENTN  Alias of JSYTENTN        04285000
JSYTENTS DS    F                   Size of each entry                   04290000
         SPACE 1                                                        04300000
         DS    2F                  Reserved                             04310000
         SPACE 1                                                        04320000
JSYTSIZ1 EQU   *-JSYTABLE          Size of version 1                    04330000
JSYTSIZE EQU   *-JSYTABLE          Size of the table header             04340000
         EJECT ,                                                        04350000
**************************************************************          04360000
*                                                            *          04370000
*        Entry in a symbol table                             *          04380000
*                                                            *          04390000
**************************************************************          04400000
         SPACE 1                                                        04410000
JSYENTRY DSECT ,                   Symbol table entry                   04420000
         SPACE 1                                                        04430000
JSYENAME DS    CL16                Symbol name                          04440000
JSYEVALO DS    F                   Offset from the beginning of table  C04450000
                                    header (JSYTABLE) to the symbol    C04460000
                                    value                               04470000
JSYEVALS DS    AL2                 Size of the symbol value             04480000
         DS    XL2                 Reserved                             04490000
         SPACE 1                                                        04500000
JSYESIZ1 EQU   *-JSYENTRY          Size of the table entry              04510000
JSYESIZE EQU   *-JSYENTRY          Size of the table entry              04520000
         SPACE 2                                                        04530000
.JSYMEND MEND                                                           04540000
.*                                                                      04550000
**/                                                                     04560000
* %END_OF_ASM_SYDF: ;                                                   04570000
*  %IF IBM_CBGENC = 'YES' %THEN                                         04572000
*    %JSYM_ATRB = 'Based Bdy(Dword)';                                   04575000
*  %IF JSYM_ATRB = '' %THEN                                             04580000
*    %JSYM_ATRB = 'BDY(DWORD)';                                         04590000
*                                                                       04600000
*/********************************************************************/ 04610000
*/*                                                                  */ 04620000
*/*      Return codes from the service (JSYMRETN)                    */ 04630000
*/*                                                                  */ 04640000
*/********************************************************************/ 04650000
*                                                                       04660000
* DCL JSYMOK   FIXED(31) CONSTANT(0);  /* Request successful         */ 04670000
* DCL JSYMERRW FIXED(31) CONSTANT(4);  /* Request completed with        04680000
*                                         possible errors, see          04690000
*                                         JSYMREAS for reason code   */ 04700000
* DCL JSYMERRU FIXED(31) CONSTANT(8);  /* Request not completed due     04710000
*                                         to user error, see            04720000
*                                         JSYMREAS for reason code   */ 04730000
* DCL JSYMERRJ FIXED(31) CONSTANT(12); /* Request not completed due     04740000
*                                         to an internal (JES) error,   04750000
*                                         JSYMREAS contains internal    04760000
*                                         JES reason code            */ 04770000
*                                                                       04780000
*/********************************************************************/ 04790000
*/*                                                                  */ 04800000
*/*      Reason codes for non-zero return codes (JSYMREAS)           */ 04810000
*/*                                                                  */ 04820000
*/********************************************************************/ 04830000
*                                                                       04840000
* DCL JSYMNOTF FIXED(31) CONSTANT(4);  /* Some or all of the symbols    04850000
*                                          were not found            */ 04860000
* DCL JSYMSTRE FIXED(31) CONSTANT(8);  /* Not enough storage            04870000
*                                         provided by the caller        04880000
*                                         (see JSYMSRCM)             */ 04890000
* DCL JSYMOPER FIXED(31) CONSTANT(12); /* Invalid operation             04900000
*                                         requested                  */ 04910000
*                                                                       04920000
* DCL JSYMSLEV FIXED(31) CONSTANT(16); /* Invalid symbol level/scope */ 04930000
* DCL JSYMINTB FIXED(31) CONSTANT(20); /* Invalid input symbol table,   04940000
*                                         e.g                           04941000
*                                         - wrong eyecatcher/version    04942000
*                                         - wrong table length          04943000
*                                         - offsets to table elements   04944000
*                                           beyond table length      */ 04945000
* DCL JSYMTRNC FIXED(31) CONSTANT(24); /* Some value were truncated  */ 04950000
* DCL JSYMDUP  FIXED(31) CONSTANT(28); /* Duplicate symbols          */ 04960000
* DCL JSYMAUTH FIXED(31) CONSTANT(32); /* Caller not authorized to      04970000
*                                         perform this operation or     04980000
*                                         Caller not authorized to      04983000
*                                         manage system symbols      */ 04986000
* DCL JSYMNMER FIXED(31) CONSTANT(36); /* Invalid symbol name        */ 04990000
* DCL JSYMNSTG FIXED(31) CONSTANT(40); /* Not enough storage for        05000000
*                                          internal symbol table     */ 05010000
* DCL JSYMSSVE FIXED(31) CONSTANT(44); /* Invalid value for a system    05020000
*                                          symbol                    */ 05030000
* DCl JSYMISTG FIXED(31) CONSTANT(48); /* Extract not complete due      05040000
*                                          to storage shortage for      05050000
*                                          internal processing       */ 05060000
* DCL JSYMISNE FIXED(31) CONSTANT(52); /* Incorrect length of symbol    05070000
*                                         name in the input symbol      05080000
*                                         list                       */ 05090000
* DCL JSYMSPSY FIXED(31) CONSTANT(56); /* Special symbols can be        05100000
*                                         extracted by name but         05110000
*                                         cannot be managed as          05120000
*                                         symbols                    */ 05130000
* DCL JSYMENVE FIXED(31) CONSTANT(60); /* Environment error -           05140000
*                                         function not available        05150000
*                                         in SRB mode                */ 05160000
*                                                                       05170000
*/********************************************************************/ 05180000
*/*                                                                  */ 05190000
*/*      The following data structure is a parameter list            */ 05200000
*/*      of the JES symbol service IAZSYMBL.                         */ 05210000
*/*      Pointer to parameter list is passed in register 1           */ 05220000
*/*      when calling the service (see IAZSYMBL macro).              */ 05230000
*/*                                                                  */ 05240000
*/********************************************************************/ 05250000
*                                                                       05260000
* DCL                                                                   05270000
*   1   JSYMPARM JSYM_ATRB,                                             05280000
*     3   JSYMEYE  CHAR(4),        /* I.Eye catcher                  */ 05290000
*     3   JSYMLNG  FIXED(16),      /* I.Length of parameter list     */ 05300000
*                                                                       05310000
*     3   JSYMVRM  FIXED(16),      /* I.Parameter ver/mod:           */ 05320000
*       5   JSYMVER  FIXED(8),     /*   - version                    */ 05330000
*       5   JSYMMOD  FIXED(8),     /*   - modification               */ 05340000
*     3   JSYMSVRM FIXED(16),      /* O.Service ver/mod              */ 05350000
*       5   JSYMSVER FIXED(8),     /*   - version                    */ 05360000
*       5   JSYMSMOD FIXED(8),     /*   - modification               */ 05370000
*                                                                       05380000
*/*------------------------------------------------------------------*/ 05390000
*/*                                                                  */ 05400000
*/*      Requested operation:                                        */ 05410000
*/*                                                                  */ 05420000
*/*      - Create                                                    */ 05430000
*/*        Given input symbol table provided by the caller           */ 05440000
*/*        in JSYMISYT, the service will create specified            */ 05450000
*/*        symbols with specified values.                            */ 05460000
*/*                                                                  */ 05470000
*/*      - Update                                                    */ 05480000
*/*        Given input symbol table provided by the caller           */ 05490000
*/*        in JSYMISYT, the service will update specified            */ 05500000
*/*        symbols with new specified values.                        */ 05510000
*/*                                                                  */ 05520000
*/*      - Delete                                                    */ 05530000
*/*        Given symbol filter specified by the caller in            */ 05540000
*/*        JSYMSNMA/JSYMSNMN, the service will delete                */ 05550000
*/*        the specified symbols.                                    */ 05560000
*/*                                                                  */ 05570000
*/*      - Extract                                                   */ 05580000
*/*        Given symbol filter specified by the caller in            */ 05590000
*/*        JSYMSNMA/JSYMSNMN, the service will return                */ 05600000
*/*        output symbol table with name and values of               */ 05610000
*/*        requested symbols.                                        */ 05620000
*/*        Extract subfunction provides access to both JES           */ 05630000
*/*        and JCL symbols, unless JSYMLVNJ option is used.          */ 05640000
*/*                                                                  */ 05650000
*/*      - Clear                                                     */ 05660000
*/*        Delete all defined symbols at specified levels.           */ 05670000
*/*        This operation is only available for authorized           */ 05673000
*/*        callers.                                                  */ 05676000
*/*                                                                  */ 05680000
*/*------------------------------------------------------------------*/ 05690000
*                                                                       05700000
*     3   JSYMRQOP FIXED(8),       /* I.Requested operation          */ 05710000
*                                                                       05720000
*/*------------------------------------------------------------------*/ 05730000
*/*                                                                  */ 05740000
*/*      JES symbols can be defined at two levels:                   */ 05750000
*/*                                                                  */ 05760000
*/*       - task level                                               */ 05770000
*/*         Symbols at the task level are only visible to            */ 05780000
*/*         the code running in the same task (TCB)                  */ 05790000
*/*       - job step level                                           */ 05800000
*/*         Symbols at the job step level are visible to             */ 05810000
*/*         the code running in all tasks in the same                */ 05820000
*/*         job step.                                                */ 05830000
*/*                                                                  */ 05840000
*/*      Symbol at the task level overrides the symbol with          */ 05850000
*/*      the same name at the job step level.                        */ 05860000
*/*                                                                  */ 05870000
*/*      Create operation requires symbol level to be                */ 05880000
*/*      selected - JSYMLVLT or JSYMLVLJ must be set, but            */ 05890000
*/*      not both.                                                   */ 05900000
*/*                                                                  */ 05910000
*/*      Clear operation requires symbol level to be                 */ 05920000
*/*      selected - JSYMLVLT or JSYMLVLJ or both must be             */ 05930000
*/*      set.                                                        */ 05940000
*/*                                                                  */ 05950000
*/*      Update, Delete and Extract ignore level selection.          */ 05960000
*/*      Processing always starts at the task level and              */ 05970000
*/*      only moves to the job step level if requested               */ 05980000
*/*      symbol was not found at the task level.                     */ 05990000
*/*                                                                  */ 06000000
*/*      JES Symbol service manages JES symbols (Create,             */ 06010000
*/*      Update, Delete, Clear).                                     */ 06020000
*/*      In addition, Extract function provides access to            */ 06030000
*/*      JCL Symbols, unless JSYMLVNJ option is specified.           */ 06040000
*/*      Note that when access to JCL symbols is required            */ 06050000
*/*      caller must be in the task mode and cannot hold             */ 06060000
*/*      any locks.                                                  */ 06070000
*/*                                                                  */ 06080000
*/*      JSYMLVUD option modifies the behaviour of CREATE            */ 06080400
*/*      request when duplicate symbols are encountered.             */ 06081000
*/*      Without JSYMLVUD option, duplicate symbols are not          */ 06081600
*/*      processed and duplicate symbol warning is returned.         */ 06082200
*/*      If this option is specified, duplicate symbols              */ 06082800
*/*      are updated instead.                                        */ 06083400
*/*                                                                  */ 06084000
*/*      JSYMLVJC option applies JCL constraints during              */ 06084600
*/*      EXTRACT processing.                                         */ 06085200
*/*      If JSYMLVJC option is specified, only symbols which         */ 06085800
*/*      can be used for JCL substitution are returned.              */ 06086400
*/*      JCl constraints:                                            */ 06087000
*/*       - maximum length of symbol name is 8                       */ 06087600
*/*       - maximum length of symbol value is 255                    */ 06088200
*/*                                                                  */ 06088800
*/*------------------------------------------------------------------*/ 06090000
*                                                                       06100000
*     3   JSYMLVL  BIT(8),         /* I.Symbol options:              */ 06110000
*       5   JSYMLVLT BIT(1),       /*   access symbols at               06120000
*                                       the task level               */ 06130000
*       5   JSYMLVLJ BIT(1),       /*   access symbols at               06140000
*                                       the job step level           */ 06150000
*       5   JSYMLVNJ BIT(1),       /*   do not access JCL symbols    */ 06160000
*       5   JSYMLVUD BIT(1),       /*   CREATE updates duplicates    */ 06162000
*       5   JSYMLVJC BIT(1),       /*   check JCL constraints        */ 06165000
*       5   *        BIT(3),       /*   reserved bits                */ 06170000
*                                                                       06180000
*/*------------------------------------------------------------------*/ 06190000
*/*                                                                  */ 06200000
*/*      JSYMISYT points to an input symbol table.                   */ 06210000
*/*      Caller passes this table to Create and Update               */ 06220000
*/*      operations to define names and values of the                */ 06230000
*/*      symbols to create or update.                                */ 06240000
*/*                                                                  */ 06250000
*/*      The layout of the symbol table is defined by                */ 06260000
*/*      the JSYTABLE.                                               */ 06270000
*/*                                                                  */ 06280000
*/*------------------------------------------------------------------*/ 06290000
*                                                                       06300000
*     3   JSYMISYT PTR(31),        /* I. Pointer to an input            06310000
*                                        symbol table                */ 06320000
*                                                                       06330000
*/*------------------------------------------------------------------*/ 06340000
*/*                                                                  */ 06350000
*/*      The following three fields (JSYMSNMA, JSYMSNMN,             */ 06360000
*/*      JSYMSNML) are used by the caller to specify the             */ 06370000
*/*      symbol selection for Delete and Extract operations.         */ 06380000
*/*      JSYMSNMA points to a list, JSYMSNMN is a number of          */ 06390000
*/*      elements in the list and JSYMSNML is the length of          */ 06400000
*/*      each element in the list. If JSYMSNML is zero,              */ 06410000
*/*      default length is used (16 characters).                     */ 06420000
*/*      Each element in the list specifies name of symbol           */ 06423000
*/*      to be selected (blank-padded if necessary).                 */ 06426000
*/*      Wildcards can be used in any element.                       */ 06430000
*/*                                                                  */ 06440000
*/*------------------------------------------------------------------*/ 06450000
*                                                                       06460000
*     3   JSYMSNMA PTR(31),        /* IS*. Pointer to selection list */ 06470000
*     3   * UNION,                                                      06480000
*       4   JSYMSNMN FIXED(32),    /* IS.  Number of elements in        06490000
*                                          selection list.           */ 06500000
*       4   JSYMSNM# FIXED(32),    /*      Alias of JSYMSNMN         */ 06505000
*     3   JSYMSNML FIXED(32),      /* IS.  Length of each element in    06510000
*                                          selection list.              06520000
*                                          Valid values 0-16.           06530000
*                                          0 means use 16.           */ 06540000
*                                                                       06550000
*/*------------------------------------------------------------------*/ 06560000
*/*                                                                  */ 06570000
*/*      Extract operation returns symbol table with                 */ 06580000
*/*      symbols and names of the found symbols in the               */ 06590000
*/*      output area provided by the caller.                         */ 06600000
*/*                                                                  */ 06610000
*/*      The layout of the symbol table is defined by                */ 06620000
*/*      the JSYTABLE structure.                                     */ 06630000
*/*      However, it does not mean that all this space is            */ 06640000
*/*      necessary to hold the data, because symbol table            */ 06650000
*/*      is not necessarily contiguous.                              */ 06660000
*/*      Total space occupied by the actual data is returned         */ 06670000
*/*      in JSYMSRCM field. If space provided by the caller          */ 06680000
*/*      is not sufficient for the output, JSYMSRCM shows            */ 06690000
*/*      the recommended size of the output area.                    */ 06700000
*/*                                                                  */ 06710000
*/*------------------------------------------------------------------*/ 06720000
*                                                                       06730000
*     3   JSYMOUTA PTR(31),        /* I. Pointer to caller provided     06740000
*                                        output area                 */ 06750000
*     3   JSYMOUTS FIXED(32),      /* I. Size of caller provided        06760000
*                                        output area                 */ 06770000
*                                                                       06780000
*     3   JSYMRETN FIXED(32),      /* O. Service return code         */ 06790000
*     3   JSYMREAS FIXED(32),      /* O. Service reason code         */ 06800000
*     3   JSYMSRCM FIXED(32),      /* O. Recommended size of            06810000
*                                        the output area             */ 06820000
*     3   JSYMERAD PTR(31),        /* O. If service returns an error    06822000
*                                        this points to approximate     06824000
*                                        location where error was       06826000
*                                        detected                    */ 06828000
*                                                                       06830000
*     3   *        CHAR(36);       /* Reserved                       */ 06840000
*                                                                       06850000
*/********************************************************************/ 06860000
*/*   Eyecatcher for JSYMPARM (value of JSYMEYE field)               */ 06870000
*/********************************************************************/ 06880000
* DCL JSYMCID  CHAR(4)  CONSTANT('JSYM');                               06890000
*                                                                       06900000
*/********************************************************************/ 06910000
*/*   Values for JSYMVER                                             */ 06920000
*/********************************************************************/ 06930000
*                                                                       06940000
* DCL JSYMVRM1 FIXED(16) CONSTANT('0100'X); /* Original ver/mod      */ 06950000
* DCL JSYMVRMC FIXED(16) CONSTANT('0100'X); /* Latest ver/mod        */ 06960000
*                                                                       06970000
*/********************************************************************/ 06980000
*/*   Values for JSYMSVER                                            */ 06990000
*/********************************************************************/ 07000000
*                                                                       07010000
* DCL JSYMSVM1 FIXED(16) CONSTANT('0100'X); /* Original ver/mod      */ 07020000
* DCL JSYMSVMC FIXED(16) CONSTANT('0100'X); /* Latest ver/mod        */ 07030000
*                                                                       07040000
*/********************************************************************/ 07050000
*/*   Values for JSYMRQOP                                            */ 07060000
*/********************************************************************/ 07070000
*                                                                       07080000
* DCL JSYMCRT  FIXED(8) CONSTANT(4);  /* Create symbols with values  */ 07090000
* DCL JSYMUPDT FIXED(8) CONSTANT(8);  /* Update symbol values        */ 07100000
* DCL JSYMDELE FIXED(8) CONSTANT(12); /* Delete symbols              */ 07110000
* DCL JSYMEXTR FIXED(8) CONSTANT(16); /* Extract values for symbols  */ 07120000
* DCL JSYMCLR  FIXED(8) CONSTANT(20); /* Clear all symbols           */ 07130000
*                                                                       07140000
*/********************************************************************/ 07150000
*/*                                                                  */ 07160000
*/*      Symbol table                                                */ 07170000
*/*                                                                  */ 07180000
*/*      This structure defines a header of the table which          */ 07190000
*/*      contains symbol name/value pairs.                           */ 07200000
*/*                                                                  */ 07210000
*/*      Entries in the table are mapped by JSYENTRY DSECT.          */ 07220000
*/*                                                                  */ 07230000
*/********************************************************************/ 07240000
*                                                                       07250000
* DCL                                                                   07260000
*   1   JSYTABLE BASED,            /* Symbol table                   */ 07270000
*                                                                       07280000
*     3   JSYTEYE  CHAR(4),        /* Eyecatcher                     */ 07290000
*     3   JSYTLEN  FIXED(32),      /* Total size of the table        */ 07300000
*                                                                       07310000
*     3   JSYTVER  FIXED(8),       /* Version of the table           */ 07320000
*     3   *        CHAR(3),        /* Reserved                       */ 07330000
*                                                                       07340000
*     3   JSYTENT1 FIXED(32),      /* Offset from the beginning of      07350000
*                                     the table to the first entry   */ 07360000
*     3   * UNION,                                                      07365000
*       4   JSYTENTN FIXED(32),    /* Number of entries in the table */ 07370000
*       4   JSYTENT# FIXED(32),    /*  Alias of JSYTENTN             */ 07375000
*     3   JSYTENTS FIXED(32),      /* Size of each entry             */ 07380000
*                                                                       07390000
*     3   *        CHAR(8);        /* Reserved                       */ 07400000
*                                                                       07410000
*/********************************************************************/ 07420000
*/*   Eyecatcher for JSYTABLE                                        */ 07430000
*/********************************************************************/ 07440000
* DCL JSYTCID  CHAR(4)  CONSTANT('JSYT');                               07450000
*                                                                       07460000
*/********************************************************************/ 07470000
*/*   Values for JSYTVER                                             */ 07480000
*/********************************************************************/ 07490000
*                                                                       07500000
* DCL JSYTVER1 FIXED(8) CONSTANT(1);  /* Version 1                   */ 07510000
*                                                                       07520000
*/********************************************************************/ 07530000
*/*                                                                  */ 07540000
*/*      Entry in a symbol table                                     */ 07550000
*/*                                                                  */ 07560000
*/********************************************************************/ 07570000
*                                                                       07580000
* DCL                                                                   07590000
*   1   JSYENTRY BASED,            /* Symbol table entry             */ 07600000
*                                                                       07610000
*     3   JSYENAME CHAR(16),       /* Symbol name                    */ 07620000
*     3   JSYEVALO FIXED(32),      /* Offset from the beginning of      07630000
*                                     table header (JSYTABLE) to        07640000
*                                     the symbol value               */ 07650000
*     3   JSYEVALS FIXED(16),      /* Size of the symbol value       */ 07660000
*     3   *        CHAR(2);        /* Reserved                       */ 07670000
*                                                                       07680000
*/*                                  End of macro                    */ 07690000
* @Logic;                                                               07700000
* #PRAGMA TOOL=PADI.                                                    07710000
* #PADIDELETE.JSYMCID                                                   07720000
* #PADIDELETE.JSYTCID                                                   07730000
* #PADIDELETE.JSYMOUTF                                                  07740000
* #PADIDELETE.JSYMSZE1                                                  07750000
* #PADIDELETE.JSYMSIZE                                                  07760000
* #PADIDELETE.JSYTSIZ1                                                  07770000
* #PADIDELETE.JSYTSIZE                                                  07780000
* #PADIDELETE.JSYESIZ1                                                  07790000
* #PADIDELETE.JSYESIZE                                                  07800000
* #EPRAGMA                                                              07810000
* @ENDLOGIC;                                                            99999999
