*        %GOTO SPLIOCMT;          /* Bilingual Mapping Macro            00010000
         MACRO                                                          00020000
         IAZSPLIO                                                       00030000
.*/      %SPLIOCMT: ;                                             /* */ 00040000
*                                                                       00050000
*/**** START OF SPECIFICATIONS *******************************          00060000
.****PROPRIETARY-STATEMENT************************************          00070000
.*01* PROPRIETARY STATEMENT:                                 *          00080000
.*                                                           *          00090000
.*   LICENSED MATERIALS-PROPERTY OF IBM                      *          00100000
.*   5650-ZOS Copyright IBM Corp. 2001, 2019                 *          00120000
.*                                                           *          00130000
.*   STATUS:  HBB77C0                                        *          00140000
.*                                                           *          00150000
.****END-OF-PROPRIETARY-STATEMENT*****************************          00160000
*                                                            *          00170000
*01* DESCRIPTIVE NAME: JES2 Spool Input/Output Parameter List*          00180000
*02*  ACRONYM:  IAZSPLIO                                     *          00190000
*                                                            *          00200000
*01* MACRO NAME:  IAZSPLIO                                   *          00210000
*                                                            *          00220000
*01* DSECT NAME:  SPLIO                                      *          00230000
*01* LABEL PREFIX:  SPIO                                     *          00240000
*                                                            *          00250000
*01* COMPONENT ID:  JES Common (SC141)                       *          00260000
*                                                            *          00270000
*01* EXTERNAL CLASSIFICATION:  PSPI                          *          00280000
*01* END OF EXTERNAL CLASSIFICATION:                         *          00290000
*                                                            *          00300000
*01* EYE-CATCHER:  SPIO                                      *          00310000
*02*  OFFSET:      SPIOSSID                                  *          00320000
*02*  LENGTH:      L'SPIOSSID                                *          00330000
*                                                            *          00340000
*01* STORAGE ATTRIBUTES:                                     *          00350000
*02*  SUBPOOL:  caller                                       *          00360000
*02*  KEY:  Any                                              *          00370000
*02*  RESIDENCY:                                             *          00380000
*      Virtual = any                                         *          00390000
*      real    = any                                         *          00400000
*02*  FREQUENCY = 1 per call to function code 71 with        *          00410000
*                 function request byte of SSJISIOM          *          00420000
*                 or SSJISIRS                                *          00430000
*                                                            *          00440000
*01* SIZE:                                                   *          00450000
*                                                            *          00460000
*     See SPIOSZE                                            *          00470000
*                                                            *          00480000
*01* CREATED BY:                                             *          00490000
*                                                            *          00500000
*     caller of SSI function 'SSOBSSJI' = 71                 *          00510000
*                                                            *          00520000
*01* POINTED TO BY:                                          *          00530000
*                                                            *          00540000
*     SSJIUSER in the SSOB extension                         *          00550000
*                                                            *          00560000
*01* SERIALIZATION:                                          *          00570000
*                                                            *          00580000
*     None                                                   *          00590000
*                                                            *          00600000
*01* FUNCTION:                                               *          00610000
*                                                            *          00620000
*     This macro provides the mapping of the parameter       *          00630000
*     list used by authorized programs to request the        *          00640000
*     Spool Input/Output format.                             *          00650000
*                                                            *          00660000
*01* METHOD OF ACCESS:                                       *          00670000
*                                                            *          00680000
*02*  ASM:                                                   *          00690000
*      IAZSPLIO                                              *          00700000
*                                                            *          00710000
*02*  PL/X:                                                  *          00720000
*      %DCL SPLIO_ATRB CHAR                                  *          00730000
*      %SPLIO_ATRB = 'value'                                 *          00740000
*      %INCLUDE SYSLIB(IAZSPLIO)                             *          00750000
*                                                            *          00760000
*      where value is a valid control block attribute,       *          00770000
*      such as 'BASED(SSJIUSER)'.  If SPLIO_ATRB='',         *          00780000
*      then 'BASED' will be used.                            *          00790000
*                                                            *          00800000
*01* USED BY:                                                *          00810000
*                                                            *          00820000
*     This is used by authorized programs to request Spool   *          00830000
*     control blocks.                                        *          00840000
*                                                            *          00850000
*01* DELETED BY:                                             *          00860000
*                                                            *          00870000
*     caller                                                 *          00880000
*                                                            *          00890000
*01* FREQUENCY:                                              *          00900000
*                                                            *          00910000
*     1 per call to function code 71 with function request   *          00920000
*     byte of SSJISIOM or SSJISIRS                           *          00930000
*                                                            *          00940000
*01* RESTRICTIONS:                                           *          00950000
*                                                            *          00960000
*     None                                                   *          00970000
*                                                            *          00980000
****** END OF SPECIFICATIONS ********************************/          00990000
*/********************************************************************/ 01000000
*/*01* CHANGE ACTIVITY:                                              */ 01010000
*/* $Z02P699=PSPL     HBB7705 001026 E_S7: IAZSPLIO dsect changes    */ 01015000
*/*                                                                  */ 01016000
*/* $Z04LHIO=HAMIO    HBB7707 010914 TJW:  HAM I/O performance       */ 01017000
*/*                                                                  */ 01018000
*/* $Z07LMSS=MONSSI   HBB7720 030824 TJW:  Monitor SSI support       */ 01019000
*/*                                                                  */ 01019100
*/* $Z09LAMS=APFMITG  HBB7740 061017 TJW:  SPOOL read RACF checks    */ 01019400
*/*                                                                  */ 01019600
*/* $Z11LTJN=APIAPPC  HBB7760 081022 TJW:  Trans job name select     */ 01019800
*/*                                                                  */ 01019850
*/* $S202710=CHEADERS HBB77C0 190212 TJW:  Updates for C headers     */ 01019900
*/*                                        S202710                   */ 01019950
*/*                                                                  */ 01020000
*/* A000000-999999    Created for z/OS 1.2                   @Z02LSIO*/ 01030000
*/********************************************************************/ 01040000
*/************************************************************          01050000
*01* NOTES:                                                  *          01060000
*                                                            *          01070000
*          Bilingual Mapping Macro (PL/AS and BAL)           *          01080000
*                                                            *          01090000
*        Dependencies =                                      *          01100000
*                                                            *          01110000
*          PL/AS Version = This macro uses the macro         *          01120000
*            variable SPLIO_ATRB. SPLIO_ATRB must be         *          01130000
*            declared and set to valid control block         *          01140000
*            attributes before the macro is invoked.         *          01150000
*                                                            *          01160000
*          BAL Version = None                                *          01170000
*                                                            *          01180000
*************************************************************/          01190000
*/*                                                                  */ 01200000
* % GOTO END_OF_ASM_SPIO; /*                                            01210000
*                                                                       01220000
SPLIO    DSECT                                                          01230000
SPIOSSID DS    C'SPIO'             I.Eyecatcher                         01240000
SPIOLEN  DS    AL2(SPIOSZE)        I.Length of SPLIO parameter         C01250000
                                     list                               01260000
SPLIOVRN DS    H                   I.Parm list version number           01270000
SPLIOVR1 EQU   1                   Service version number of           C01280000
                                      IAZSPLIO                          01290000
SPLIOVR# EQU   1                   Service version--the        @Z02P699C01293000
                                     latest value              @Z02P699 01296000
SPIOVERO DS    H                   O.Subsystem version number           01300000
         DS    H                   Reserved                             01310000
SPIOUSER DS    0H                                                       01320000
         SPACE 1                                                        01330000
**************************************************************          01340000
*                                                            *          01350000
*        SPIOSTRP is an anchor for use by the subsystem      *          01360000
*        that responds to this request.  It is expected that *          01370000
*        the caller will set this to zero the FIRST time an  *          01380000
*        SSOB extension is used and from that point on it    *          01390000
*        will be managed by the subsystem.                   *          01400000
*                                                            *          01410000
**************************************************************          01420000
         SPACE 1                                                        01430000
SPIOSTRP DS    A                   Storage management anchor            01440000
         DS    F                   Reserved                             01450000
         DS    F                   Reserved                             01460000
         SPACE 1                                                        01470000
**************************************************************          01480000
*                                                            *          01490000
*        Spool Input/Output info section                     *          01500000
*        Field SPIOSPAD is the only required field.          *          01510000
*        It should have the requested spool control          *          01520000
*        block address. The subsequent input fields          *          01530000
*        are optional and are used for verification          *          01540000
*        purposes.                                           *          01550000
*                                                            *          01560000
*        The supported control block types for JES2 are:     *          01570000
*            CHK        HDB       IOT                        *          01580000
*            JCT        NHSB      OCT                        *          01590000
*            SIG        SWBI                                 *          01600000
*                                                            *          01610000
**************************************************************          01620000
         SPACE 1                                                        01630000
SPIOSPAD DS    XL8                 I.Spool address to be found         C01640000
                                       This field is required           01650000
         SPACE 1                                                        01660000
**************************************************************          01670000
*                                                            *          01680000
*        The following input fields are optional.            *          01690000
*        If they have a null value, they will be             *          01700000
*        considered as not present for verification          *          01710000
*        purposes. Especially, if the control block          *          01720000
*        ID type is null, the other fields are not           *          01730000
*        considered.                                         *          01740000
*                                                            *          01750000
**************************************************************          01760000
         SPACE 1                                                        01770000
SPIOCTYP DS    CL4                 I.Control block ID type              01780000
SPIOJNAM DS    CL8                 I.Job name                           01790000
SPIOJID  DS    CL8                 I.Job ID (J9999999, etc.)            01800000
SPIOJKEY DS    XL4                 I.Job key                            01810000
SPIODSKY DS    F                   I.Dataset key                        01820000
         SPACE 1                                               @Z04LHIO 01821000
*------------------------------------------------------------* @Z04LHIO 01822000
*        If instorage buffers are needed, then SPIOJKEY and  * @Z04LHIO 01823000
*        SPIODSKY must be specified as well as SPIOASID.  If * @Z04LHIO 01824000
*        instorage buffers are requested, then no SPOOL read * @Z04LHIO 01825000
*        is attempted.  SPIOSSNM is the MVS system or JES2   *          01826000
*        member name the job is running on.  If SPIOASID is  * @Z04LHIO 01827000
*        not specified, then SPIOSSNM is not examined.       * @Z04LHIO 01828000
*                                                            * @Z04LHIO 01829000
*        For JES2, instorage buffers are only obtained when  * @Z04LHIO 01830000
*        SPIOCTYP is set to 'HDB '.  Otherwise the data is   * @Z04LHIO 01831000
*        read from SPOOL.  SPIOSSNM must be blank or the     * @Z04LHIO 01832000
*        name of the system/member where the SPOOL read      *          01833000
*        request originated.                                 * @Z04LHIO 01834000
*------------------------------------------------------------* @Z04LHIO 01835000
SPIOSSNM DS    CL8                 I.If instorage data buffers @Z04LHIOC01836000
                                     are needed, the system    @Z04LHIOC01837000
                                     or JES2 member name       @Z11LTJNC01837500
                                     where the job is running  @Z04LHIO 01838000
SPIOASID DS    H                   I.If instorage data buffers @Z04LHIOC01839000
                                     are needed, the ASID      @Z04LHIOC01840000
                                     where the job is running  @Z04LHIO 01841000
SPIOOPT  DS    B                   I.Processing options        @Z09LAMS 01842000
SPIORACF EQU   B'10000000'           Perform RACF checks even  @Z09LAMSC01844000
                                     if caller is authorized   @Z09LAMS 01846000
         DS    XL1                 Reserved                    @Z09LAMS 01850000
         DS    5F                  Reserved for future use and must    C01860000
                                     be zero                            01870000
         SPACE 1                                                        01880000
SPIOOUTA DS    A                   O.Address of control block           01890000
SPIOOLEN DS    F                   O.Number of bytes in buffer          01900000
         DS    F                   Reserved                             01910000
         DS    F                   Reserved                             01920000
SPIOIND1 DS    BL1                 O.Indicator field                    01930000
SPIONSTG EQU   B'10000000'           The control block was retrieved   C01940000
                                       from an instorage buffer         01950000
         DS    XL3                 Reserved                             01960000
         SPACE 1                                                        01970000
SPIOSZE1 EQU   *-SPLIO             Parameter end-version 1     @Z02P699C01971000
                                     size                      @Z02P699 01974000
SPIOSZE  EQU   *-SPLIO             Size of SPLIO                        01980000
         SPACE 1                                                        01990000
**************************************************************          02000000
*                                                            *          02010000
*        Reason codes                                        *          02020000
*        Values of SSJIRETN when SSOBRETN is zero for        *          02022000
*        function (values of SSJIFREQ) SSJISIOM and          *          02028000
*        SSJISIRS.                                           *          02030000
*                                                            *          02040000
**************************************************************          02050000
         SPACE 1                                                        02060000
SPIOOK   EQU   0                   Success                              02070000
SPIONTVF EQU   4                   The VERIFY was not successful        02080000
SPIOCBIO EQU   8                   Spool control block I/O error        02090000
SPIOCBTK EQU   12                  Spool control block invalid track    02100000
SPIOCBNG EQU   16                  General control block problem        02110000
SPIOSTRG EQU   20                  Error obtaining storage              02120000
SPIOSJER EQU   24                  Error obtaining below the line      C02130000
                                     storage                            02140000
SPIOILOG EQU   28                  A logic error has occurred           02150000
SPIONSPL EQU   32                  SPIOSTRP not initialized correctly   02160000
SPIONBUF EQU   36                  Could not locate instorage  @Z04LHIOC02163000
                                     buffer                    @Z04LHIO 02166000
SPIONSAF EQU   40                  RACF failure accessing data @Z09LAMS 02168000
         SPACE 2                                                        02170000
         MEND  ,                                                        02180000
.*                                                                      02190000
**/                                                                     02200000
* % END_OF_ASM_SPIO: ;                                                  02210000
*                                                                       02220000
* %IF SPLIO_ATRB = ''               /* If no attribute is specified     02230000
*                                                            @Z02P699*/ 02235000
*   %THEN                                                               02240000
*     %SPLIO_ATRB = 'BASED';        /* establish default attribute   */ 02250000
*                                                                       02260000
*DECLARE                                                                02270000
*   1 SPLIO   SPLIO_ATRB,                                               02280000
*     3 SPIOSSID CHAR(4),           /* I.Eyecatcher                  */ 02290000
*     3 SPIOLEN  FIXED(16),         /* I.Length of SPLIO                02300000
*                                          parameter list            */ 02310000
*     3 SPLIOVRN FIXED(15),         /* I.Parm list version number    */ 02320000
*     3 SPIOVERO FIXED(15),         /* O.Subsystem version number    */ 02330000
*     3 *        FIXED(16),         /* Reserved                      */ 02340000
*     3 SPIOUSER ,                  /* User area                     */ 02350000
*/********************************************************************/ 02360000
*/*      SPIOSTRP is an anchor for use by the subsystem              */ 02370000
*/*      that responds to this request.  It is expected that         */ 02380000
*/*      the caller will set this to zero the FIRST time an          */ 02390000
*/*      SSOB extension is used and from that point on it            */ 02400000
*/*      will be managed by the subsystem.                           */ 02410000
*/********************************************************************/ 02420000
*       5 SPIOSTRP PTR(31),         /* Storage management anchor     */ 02430000
*       5 *        FIXED(32),       /* Reserved                      */ 02440000
*       5 *        FIXED(32),       /* Reserved                      */ 02450000
*/********************************************************************/ 02460000
*/*                                                                  */ 02470000
*/*      Spool Input/Output section                                  */ 02480000
*/*      Field SPIOSPAD is the only required field.                  */ 02490000
*/*      It should have the requested spool control                  */ 02500000
*/*      block address. The subsequent input fields                  */ 02510000
*/*      are optional and are used for verification                  */ 02520000
*/*      purposes.                                                   */ 02530000
*/*                                                                  */ 02540000
*/*      The supported control block types for JES2 are:             */ 02550000
*/*          CHK        HDB      IOT                                 */ 02560000
*/*          JCT        NHSB     OCT                                 */ 02570000
*/*          SIG        SWBI                                         */ 02580000
*/*                                                                  */ 02590000
*/********************************************************************/ 02600000
*       5 SPIOSPAD CHAR(8),           /* I.Spool address to be          02610000
*                                            found -- this field        02620000
*                                            is required             */ 02630000
*       5 SPIOCTYP CHAR(4),           /* I.Control block ID type     */ 02640000
*       5 SPIOJNAM CHAR(8),           /* I.Job name                  */ 02650000
*       5 SPIOJID  CHAR(8),           /* I.Job ID (J9999999, etc.)   */ 02660000
*       5 SPIOJKEY FIXED(32),         /* I.Job key                   */ 02670000
*       5 SPIODSKY FIXED(32),         /* I.Dataset key               */ 02680000
*/*------------------------------------------------------------------*/ 02682000
*/*      If instorage buffers are needed, then SPIOJKEY and          */ 02684000
*/*      SPIODSKY must be specified as well as SPIOASID.  If         */ 02686000
*/*      instorage buffers are requested, then no SPOOL read         */ 02688000
*/*      is attempted.  SPIOSSNM is the MVS system or JES2           */ 02690000
*/*      member name the job is running on.  If SPIOASID is          */ 02692000
*/*      not specified, then SPIOSSNM is not examined.               */ 02694000
*/*                                                                  */ 02696000
*/*      For JES2, instorage buffers are only obtained when          */ 02698000
*/*      SPIOCTYP is set to 'HDB '.  Otherwise the data is           */ 02700000
*/*      read from SPOOL.  SPIOSSNM must be blank or the             */ 02702000
*/*      name of the system/member where the SPOOL read              */ 02704000
*/*      request originated.                                 @Z04LHIO*/ 02706000
*/*------------------------------------------------------------------*/ 02708000
*       5 SPIOSSNM CHAR(8),           /* I.MVS system or member name    02710000
*                                          for the ASID      @Z11LTJN*/ 02712000
*       5 SPIOASID FIXED(15),         /* I.Reserved for ASID if         02714000
*                                          instorage buffers are        02716000
*                                          needed            @Z04LHIO*/ 02718000
*       5 SPIOOPT  BIT(8),            /* I.Processing option @Z09LAMS*/ 02718500
*         7 SPIORACF BIT(1),          /*   Perform RACF checks even     02719000
*                                          if caller is authorized   */ 02719500
*         7 *        BIT(7),          /*   Reserved                  */ 02719600
*       5 *        FIXED(8),          /* Reserved            @Z09LAMS*/ 02720000
*       5 *(5)     FIXED(32),         /* Reserved for future use and    02730000
*                                          must be zero      @Z02P699*/ 02740000
*       5 SPIOOUTA PTR(31),           /* O.Address of control block     02830000
*                                                            @Z02P699*/ 02835000
*       5 SPIOOLEN FIXED(32),         /* O.Number of bytes in buffer */ 02840000
*       5 *        FIXED(32),         /* Reserved                    */ 02850000
*       5 *        FIXED(32),         /* Reserved                    */ 02860000
*       5 SPIOIND1 BIT(8),            /* O.Indicator field           */ 02870000
*         7 SPIONSTG BIT(1),          /* The control block was re-      02880000
*                                          trieved from an instorage    02890000
*                                          buffer                    */ 02900000
*         7 *        BIT(7),          /* Reserved for future use     */ 02910000
*       5 *        FIXED(24);         /* Reserved                    */ 02920000
*   DCL SPIOSZE  FIXED(15) CONSTANT(LENGTH(SPLIO)); /* Size of SPLIO */ 02930000
*   DCL SPIOSZE1 FIXED(15) CONSTANT(LENGTH(SPLIO)); /* Parameter end-   02931000
*                                        version 1 size      @Z02P699*/ 02934000
*   DCL SPLIOVR1 FIXED(15) CONSTANT(1); /* OS/390                    */ 02940000
*   DCL SPLIOVR# FIXED(15) CONSTANT(1); /* Service version--            02943000
*                                          the latest value  @Z02P699*/ 02946000
*   DCL SPIOEYEC  CHAR(4) CONSTANT('SPIO'); /* JES2 Spool I/O ID     */ 02950000
*/********************************************************************/ 02960000
*/*                                                                  */ 02970000
*/*      Reason codes                                                */ 02980000
*/*      Values of SSJIRETN when SSOBRETN is zero for                */ 02990000
*/*      function (values of SSJIFREQ) SSJISIOM and                  */ 02991000
*/*      SSJISIRS.                                                   */ 02994000
*/*                                                                  */ 03000000
*/********************************************************************/ 03010000
*   DCL SPIOOK   FIXED(15) CONSTANT(0);  /* Success                  */ 03020000
*   DCL SPIONTVF FIXED(15) CONSTANT(4);  /* The VERIFY was not          03030000
*                                             successful             */ 03040000
*   DCL SPIOCBIO FIXED(15) CONSTANT(8);  /* Spool control block         03050000
*                                             I/O error              */ 03060000
*   DCL SPIOCBTK FIXED(15) CONSTANT(12); /* Spool control block         03070000
*                                             invalid track          */ 03080000
*   DCL SPIOCBNG FIXED(15) CONSTANT(16); /* General control block       03090000
*                                             problem                */ 03100000
*   DCL SPIOSTRG FIXED(15) CONSTANT(20); /* Error obtaining storage  */ 03110000
*   DCL SPIOSJER FIXED(15) CONSTANT(24); /* Error obtaining below       03120000
*                                             the line storage       */ 03130000
*   DCL SPIOILOG FIXED(15) CONSTANT(28); /* A logic error has           03140000
*                                             occurred               */ 03150000
*   DCL SPIONSPL FIXED(15) CONSTANT(32); /* SPIOSTRP not initialized    03160000
*                                             correctly              */ 03170000
*   DCL SPIONBUF FIXED(15) CONSTANT(36); /* Could not locate instorage  03171000
*                                             buffer         @Z04LHIO*/ 03174000
*   DCL SPIONSAF FIXED(15) CONSTANT(40); /* RACF failure accessing data 03176000
*                                                            @Z09LAMS*/ 03178000
* % IAZSPLIOEND: ;                                                      03180000
*/*                          END OF MACRO                            */ 03190000
* @Logic;                                                               03200000
* #PRAGMA TOOL=PADI.                                                    03210000
* #PADIDELETE.SPIOEYEC                                                  03220000
*#EPRAGMA                                                               03230000
*@ENDLOGIC;                                                             99999999
