         MACRO -- IAZYNCC-- NETWORK CONNECTION CONTROL RECORD           00010000
         IAZYNCC ,                                                      00020000
****** START OF SPECIFICATIONS *******************************          00030000
.* **PROPRIETARY-STATEMENT********************************************* 00040000
.*01* PROPRIETARY STATEMENT                                           * 00045000
.*                                                                    * 00050000
.*   LICENSED MATERIALS-PROPERTY OF IBM                               * 00060000
.*   5650-ZOS Copyright IBM Corp. 2005, 2015                          * 00070000
.*                                                                    * 00080000
.*   STATUS = HBB77A0                                                 * 00090000
.*                                                                    * 00100000
.* **END-OF-PROPRIETARY-STATEMENT************************************** 00110000
*                                                            *          00120000
*01* DESCRIPTIVE NAME:  Network Connection Control Record    *          00130000
*02*  ACRONYM:  NCC                                          *          00140000
*                                                            *          00150000
*01* MACRO NAME:  IAZYNCC                                    *          00160000
*                                                            *          00170000
*01* DSECT NAME:  NCC                                        *          00180000
*01* LABEL PREFIX:  NCC                                      *          00190000
*                                                            *          00200000
*01* COMPONENT ID:  JES COMMON (SC141)                       *          00210000
*                                                            *          00220000
*01* EXTERNAL CLASSIFICATION:  PSPI                          *          00230000
*01* END OF EXTERNAL CLASSIFICATION:                         *          00240000
*                                                            *          00250000
*01* EYE-CATCHER:  None                                      *          00260000
*02*  OFFSET:      N/A                                       *          00270000
*02*  LENGTH:      N/A                                       *          00280000
*                                                            *          00290000
*01* STORAGE ATTRIBUTES:                                     *          00300000
*02*  SUBPOOL:  n/a                                          *          00310000
*02*  KEY:  n/a                                              *          00320000
*02*  RESIDENCY:                                             *          00330000
*      NCC records reside in various TP communication        *          00340000
*      buffers (SNA, BSC, TCP/IP, and JESXCF).               *          00350000
*                                                            *          00360000
*01* SIZE:                                                   *          00370000
*                                                            *          00380000
*     NCCIL for 'I' and 'J' type records                     *          00390000
*     NCCCL for 'K' and 'L' type records                     *          00400000
*     NCCCL2 for 'K' and 'L' type records (secure signon)    *          00410000
*     NCCAL for 'M' and 'N' type records                     *          00420000
*                                                            *          00430000
*01* CREATED BY:                                             *          00440000
*                                                            *          00450000
*     JES2 and JES3                                          *          00460000
*                                                            *          00470000
*01* POINTED TO BY:                                          *          00480000
*                                                            *          00490000
*     n/a                                                    *          00500000
*                                                            *          00510000
*01* SERIALIZATION:                                          *          00520000
*                                                            *          00530000
*     n/a                                                    *          00540000
*                                                            *          00550000
*01* FUNCTION:                                               *          00560000
*                                                            *          00570000
*     NCC records reside in various TP communication         *          00580000
*     buffers, and are used to communicate connectivity      *          00590000
*     information between nodes and MAS members.             *          00600000
*                                                            *          00610000
*01* METHOD OF ACCESS:                                       *          00620000
*                                                            *          00630000
*02*  ASM:                                                   *          00640000
*      IAZYNCC ,                                             *          00650000
*                                                            *          00660000
*02*  PL/X:                                                  *          00670000
*      This mapping is not available for compilations.       *          00680000
*                                                            *          00690000
*01* USED BY:                                                *          00700000
*                                                            *          00710000
*     JES2 and JES3                                          *          00720000
*                                                            *          00730000
*01* DELETED BY:                                             *          00740000
*                                                            *          00750000
*     JES2 and JES3                                          *          00760000
*                                                            *          00770000
*01* FREQUENCY:                                              *          00780000
*                                                            *          00790000
*     N/A                                                    *          00800000
*                                                            *          00810000
*01* RESTRICTIONS:                                           *          00820000
*                                                            *          00830000
*02*  The mappings in this DSECT must match those            *          00840000
*     described in "NJE Formats and Protocols" as they       *          00850000
*     are used for communication between JES2, JES3,  and    *          00860000
*     other NJE-capable components.                          *          00870000
*                                                            *          00880000
****** END OF SPECIFICATIONS *********************************          00890000
         EJECT ,                                                        00900000
*********************************************************************** 00910000
*                                                                     * 00920000
* CHANGE ACTIVITY:                                                    * 00930000
*                                                                     * 00940000
* $Z07LTCP=NJETCP   HBB7720 040517 CLW:  SYSOUT Receiver              * 00945000
* $Z07LINR=NJETCP   HBB7720 041129 TJW:  NJT/RDR long SYSIN support   * 00946000
*                                                                     * 00947000
* $Z22LEVT=EVENTLOG HBB77A0 140410 BWT:  EVENTLOG data set support ph * 00948000
*                                                                     * 00950000
* A000000-999999    CREATED FOR z/OS 1.7                       @Z07LTCP 00960000
*********************************************************************** 00970000
         SPACE 1                                                        00980000
**************************************************************          00990000
*                                                            *          01000000
*01* NOTES:                                                  *          01010000
*02*  Any fields or sections added to this macro, either     *          01020000
*     via APAR or via development line items, must be        *          01030000
*     approved by the NJE Protocols Review Board prior to    *          01040000
*     inclusion.                                             *          01050000
*                                                            *          01060000
**************************************************************          01070000
         SPACE 1                                                        01080000
*                                                                       01090000
NCC      DSECT                     Network Connection Control           01100000
NCCRID   DS    0XL3                Record Identifier                    01110000
NCCRCBF0 EQU   X'F0'               Record control byte value           C01120000
                                    for NCC records                     01130000
NCCRCB   DC    AL1(NCCRCBF0)       Record control byte                  01140000
NCCSRCB  DS    X                   Sub-record control byte              01150000
         SPACE 3                                                        01160000
**************************************************************          01170000
*                                                            *          01180000
*        Initial Signon Control Record                       *          01190000
*        Response Signon Control Record                      *          01200000
*                                                            *          01210000
**************************************************************          01220000
         SPACE 2                                                        01230000
NCCISRCB EQU   C'I'                Initial Signon character             01240000
NCCRSRCB EQU   C'J'                Response Signon character            01250000
NCCIDL   DC    AL1(NCCIL)          Length of logical record             01260000
NCCINODE DC    CL8' '              Node identification                  01270000
NCCIQUAL DC    X'0'                Qualifier if shared SPOOL            01280000
NCCIEVNT DC    FL4'0'              Event sequence number                01290000
NCCIREST DC    HL2'0'              Partial node to node resistance      01300000
NCCIBFSZ DC    HL2'0'              Maximum transmission block size      01310000
NCCILPAS DC    CL8' '              Line password                        01320000
NCCINPAS DC    CL8' '              Node password                        01330000
NCCIFLG  DC    X'0'                Flag byte                            01340000
NCCIFLGM EQU   B'10000000'         Multiple trunk                      C01350000
                                    (set in response signon            C01360000
                                    only)                               01370000
NCCIFLGS EQU   B'01000000'         Secure signon protocol used         C01380000
                                    (set in initial signon             C01390000
                                    only)                               01400000
         SPACE 1                                                        01410000
NCCIFEAT DS    BL4                 Feature flags                        01420000
NCCIPREP EQU   B'10000000'         BSC/CTCA quiesce options             01430000
NCCITRM  EQU   B'01000000'         SNA termination options              01440000
*        EQU   B'00100000'         Reserved for future use              01450000
NCCIPACK EQU   B'00010000'         Multiple header records/buffer      C01460000
                                     allowed                            01470000
NCCIMHDR EQU   NCCIPACK            (NCCIPACK is name in FAP)            01480000
NCCIRIF  EQU   B'00001000'         Request to exchange records         C01490000
                                     may be omitted after              C01500000
                                     first object sent in              C01510000
                                     a stream                           01520000
NCCIMRCB EQU   B'00000100'         Mixed RCBs may be sent in           C01530000
                                    a single buffer                     01540000
NCCINOS  EQU   B'00000010'         Non-printable SYSOUT data   @Z22LEVTC01541000
                                    sets may be sent           @Z22LEVTC01541100
                                    (EVENTLOG)                 @Z22LEVT 01541400
NCCISSIN EQU   B'00000001'         This system supports        @Z07LINRC01542000
                                   spanned SYSIN data.  The    @Z07LINRC01543000
                                   valid range for NDHCLREC    @Z07LINRC01544000
                                   is 0-32767 when this is     @Z07LINRC01545000
                                   used.                       @Z07LINR 01546000
         SPACE 1                                                        01550000
NCCIPRAW EQU   NCCILPAS,L'NCCILPAS,C'X'  Random string                  01560000
NCCIPENC EQU   NCCINPAS,L'NCCINPAS,C'X'  Encrypted random string        01570000
         SPACE 1                                                        01580000
NCCIL    EQU   *-NCCRCB            Length of Initial/Response signon    01590000
NCCIEND  DC    X'0'                End RCB                              01600000
         EJECT                                                          01610000
**************************************************************          01620000
*                                                            *          01630000
*        Concur Signon Control Record                        *          01640000
*        Reset Signon Control Record                         *          01650000
*                                                            *          01660000
**************************************************************          01670000
         SPACE 2                                                        01680000
         ORG   NCCSRCB+1                                                01690000
NCCESRCB EQU   C'K'                Reset Signon character               01700000
NCCCSRCB EQU   C'L'                Concur Signon character              01710000
NCCCDL   DC    AL1(NCCCL)          Length of logical record             01720000
NCCCEVNT DC    FL4'0'              Event sequence number                01730000
NCCCREST DC    0HL2'0'             Total node to node resistance        01740000
NCCEREST DC    HL2'0'              Partial node to node resistance      01750000
NCCCL    EQU   *-NCCRCB            Length of Concur/Reset               01760000
NCCCEND  DC    X'0'                End RCB                              01770000
         SPACE 1                                                        01780000
         ORG   NCC+NCCCL                                                01790000
NCCCPENC DC    XL8'00'             Encrypted random string              01800000
NCCCL2   EQU   *-NCCRCB            Length of secure Concur/Reset        01810000
NCCCEND2 DC    X'0'                End RCB                              01820000
         EJECT                                                          01830000
**************************************************************          01840000
*                                                            *          01850000
*        Add Connection Control Record                       *          01860000
*        Subtract Connection Control Record                  *          01870000
*                                                            *          01880000
**************************************************************          01890000
         SPACE 2                                                        01900000
         ORG   NCCSRCB+1                                                01910000
NCCASRCB EQU   C'M'                Add Connection character             01920000
NCCSSRCB EQU   C'N'                Subtract Connection character        01930000
NCCADL   DC    AL1(NCCAL)          Length of logical record             01940000
NCCANODA DC    CL8' '              Lower node identification            01950000
NCCAQULA DC    X'0'                Lower node qualifier                 01960000
NCCANODB DC    CL8' '              Higher node identification           01970000
NCCAQULB DC    X'0'                Higher node qualifier                01980000
NCCAEVNT DC    FL4'0'              Event sequence number                01990000
NCCAREST DC    HL2'0'              Node to node resistance (TOTAL)      02000000
NCCAL    EQU   *-NCCRCB            Length of Add/Subtract record        02010000
NCCAEND  DC    X'0'                End RCB                              02020000
         SPACE 1                                                        02030000
         ORG   ,                   Go to highest displacement           02040000
NCCMXLEN EQU   (*-NCC)-L'NCCIEND   Maximum length NCC record            02050000
         MEND                                                           99999999
