*/*                                                                  */ 00010000
*/* START OF SPECIFICATIONS ******************************************/ 00020000
*/*                                                                  */ 00030000
*/*   $MAC(ICHPRCVT) COMP(SC1BN) PROD(RACF):                         */ 00040000
*/*                                                                  */ 00050000
*/*01* PROPRIETARY STATEMENT=                                        */ 00060000
*/***PROPRIETARY_STATEMENT********************************************/ 00070000
*/*                                                                  */ 00080000
*/* LICENSED MATERIALS - PROPERTY OF IBM                             */ 00090000
*/* 5650-ZOS COPYRIGHT IBM CORP. 1977, 2021                          */ 00100000
*/*                                                                  */ 00110000
*/* STATUS= HBB77D0                                                  */ 00120000
*/*                                                                  */ 00130000
*/***END_OF_PROPRIETARY_STATEMENT*************************************/ 00140000
*/*                                                                  */ 00150000
*/*01* EXTERNAL CLASSIFICATION:                                      */ 00160000
*/*02* PI: FIELDS    RCVTAPTR   RCVTPNL0                             */ 00170000
*/*                  RCVTCDTL   RCVTPTGN                             */ 00180000
*/*                  RCVTFLGS   RCVTRELS                             */ 00190000
*/*                  RCVTFLG1   RCVTREXP                             */ 00200000
*/*                  RCVTFLG3   RCVTENVP                         @0AA*/ 00210000
*/*                  RCVTFRCP   RCVTROFF                             */ 00220000
*/*                  RCVTGLBL   RCVTRNA                              */ 00230000
*/*                  RCVTID     RCVTRVOK                             */ 00240000
*/*                  RCVTINAC   RCVTSTAT                             */ 00250000
*/*                  RCVTISTL   RCVTSTA1                             */ 00260000
*/*                  RCVTJALL   RCVTTAPE                             */ 00270000
*/*                  RCVTJCHK   RCVTTDSN                             */ 00280000
*/*                  RCVTJSYS   RCVTVERS                             */ 00290000
*/*                  RCVTJUND                                    @0AC*/ 00300000
*/*                  RCVTJXAL   RCVTVRN                              */ 00310000
*/*                  RCVTMFLG   RCVTVRMN                             */ 00320000
*/*                  RCVTPINV   RCVTWARN                             */ 00330000
*/*                  RCVTWUID   RCVTML2F                         @0AC*/ 00340000
*/*                  RCVTDATP   RCVTLNOD                         @MUC*/ 00350000
*/*                  RCVTMFL1   RCVTFLG4                         @N6C*/ 00360000
*/*                  RCVTPALG                                    @0AC*/ 00370000
*/*                  RCVTRCVI                                    @LQA*/ 00380000
*/*                  RCVTDNL    RCVTRL                           @LVA*/ 00390000
*/*                  RCVTGENT                                    @LWA*/ 00400000
*/*                  RCVTIDPV                                    @LZA*/ 00410000
*/*                  RCVTPHIN                                    @NBA*/ 00420000
*/*                                                                  */ 00420001
*/*                                                                  */ 00430000
*/*01* END OF EXTERNAL CLASSIFICATION:                               */ 00440000
*/*                                                                  */ 00450000
*/*01* MACRO NAME: ICHPRCVT                                          */ 00450100
*/*                                                                  */ 00450200
*/*   DESCRIPTIVE NAME = RACF CVT                                    */ 00460000
*/*                                                                  */ 00470000
*/*   FUNCTION = THIS PROVIDES A COMMUNICATION AREA FOR INFORMATION  */ 00480000
*/*              GLOBAL TO THE VARIOUS RACF FUNCTIONS                */ 00490000
*/*                                                                  */ 00500000
*/*   CONTROL BLOCK STRUCTURE = THIS COMMUNICATION AREA IS BASED     */ 00510000
*/*                             ON 'CVTRAC' IN THE CVT               */ 00520000
*/*                                                                  */ 00530000
*/*   CREATED BY = ICHSEC00                                          */ 00540000
*/*                                                                  */ 00550000
*/*   CHANGE ACTIVITY :                                              */ 00560000
*/*     A-0000000-9999999                                    @PC0012B*/ 00570000
*/*     RACF VERSION 1 RELEASE 2                             @PC0022B*/ 00580000
*/*     @PM44287                                             @PC002HT*/ 00590000
*/*     @ZA20369                                             @PC0029T*/ 00600000
*/*     @ZA25267                                             @PC002PY*/ 00610000
*/*     C-RCVTNCX,RCVTNCDX                                   @ZA25840*/ 00620000
*/*     RACF VERSION 1, RELEASE 3                            @PC003PY*/ 00630000
*/*     $L1=UZ90071,RACF/130,790323,PDPD:                        @L1A*/ 00640000
*/*     $L4=HRF1402,RACF/140,810701,SJRDSD:                      @L4A*/ 00650000
*/*     $L5=HRF1502,RACF/150,820310,CNTDSD:                      @L5A*/ 00660000
*/*     $L6=HRF1602,RACF/160,830429,CNTDSD:                      @L6A*/ 00670000
*/*     UZ90283                                              @ZA90283*/ 00680000
*/*     UZ90284                                              @ZA90284*/ 00690000
*/*     UZ90285                                              @ZA90285*/ 00700000
*/*     $L7=HRF1702,RACF/170,840720,CNTDSD:                      @L7A*/ 00710000
*/*     $L8=HRF1802,RACF/180,860825,CNTDSD:                      @L8A*/ 00720000
*/*     $P1=HRF1802,RACF/180,870520,PDGTM1: PTM PEQ0066          @P1A*/ 00730000
*/*     $P2=HRF1802,RACF/180,870529,PDGTM1: PTM PEQ0078          @P2A*/ 00740000
*/*     $P3=HRF1802,RACF/180,870722,PDGTM1: PTM PEQ0170          @P3A*/ 00750000
*/*     OZ96638                                              @ZA96638*/ 00760000
*/*     OY11000                                              @YA11000*/ 00770000
*/*     OY13514                                              @YA13514*/ 00780000
*/*     $M1=JRF1812,RACF/181,870918,PDGTM1: EGN                  @M1A*/ 00790000
*/*     $P4=JRF1812,RACF/181,870924,PDGTM1: PTM PFG0016          @P4A*/ 00800000
*/*     $M2=HRF1822,RACF/182,880112,JCD1:                        @M2A*/ 00810000
*/*     $M3=SP313   RACF/190 880328 PDGTM1: MVS/SP 3.1.3         @M3A*/ 00820000
*/*     $M4=SP313   RACF/190 880328 PDSHL1: MVS/SP 3.1.3         @M4A*/ 00830000
*/*     $M5=SP313   RACF/190 880328 PDGTM1: MVS/SP 3.1.3         @M5A*/ 00840000
*/*     $M6=SP313   RACF/190 880328 PDTGB1: MVS/SP 3.1.3         @M6A*/ 00850000
*/*     $M7=SP313   RACF/190 880615 PDPWB1: MVS/SP 3.1.3         @M7A*/ 00860000
*/*     $M8=SP313   RACF/190 880615 PDJ_D1: MVS/SP 3.1.3         @M8A*/ 00870000
*/*     $M9=SP313   RACF/190 880615 PDLCL1: MVS/SP 3.1.3         @M9A*/ 00880000
*/*     $N1=SP313   RACF/190 880615 PDA_S1: MVS/SP 3.1.3         @N1A*/ 00890000
*/*     $N2=SP313   RACF/190 880615 PDGTM1: MVS/SP 3.1.3         @N2A*/ 00900000
*/*     $N3=SP313   RACF/190 880803 PDPWB1: MVS/SP 3.1.3         @N3A*/ 00910000
*/*     $N4=SP313   RACF/190 880926 PDGTM1: VTAM SLS Support     @N4A*/ 00920000
*/*     $D1=DGU0050 RACF/190 881102 PDGTM1: DCRR # DGU0050       @D1A*/ 00930000
*/*     $D2=DGU0061 RACF/190 890201 PDGTM1: DCRR # DGU0061       @D2A*/ 00940000
*/*     $D3=DGU0062 RACF/190 890201 PDGTM1: DCRR # DGU0062       @D3A*/ 00950000
*/*     $D4=DGU0068 RACF/190 890201 PDGTM1: DCRR # DGU0068       @D4A*/ 00960000
*/*     $D5=DGU0091 RACF/190 890517 PDGTM1: DCRR # DGU0091       @D5A*/ 00970000
*/*     $D6=DGU0099 RACF/190 890614 PDGTM1: DCRR # DGU0099       @D6A*/ 00980000
*/*     @OY32826    ADD RACF 1.9 WORK UNIT IDENTITY FUNCTION @YA32826*/ 00990000
*/*                 INDICATOR.                               @YA32826*/ 01000000
*/*     $MA=RELID   RACF/192 900904 PDM_J1: RELEASE ID CHANGES   @MAA*/ 01010000
*/*     $MB=APPC    RACF/192 910419 PDCCM1: SETROPTS APPLAUDIT   @MBA*/ 01020000
*/*     $P5=PJA0029 RACF/192 910524 PDPSB1: PJA0029              @P5A*/ 01030000
*/*     $MC=HPCS    RACF/210 930426 PDMAS1: 2.1 racglist support @MCA*/ 01040000
*/*     $MD=RELID   RACF/210 930504 PDKAF1: RELEASE ID CHANGES   @MDA*/ 01050000
*/*     $P6=PIG2536 RACF/210 930813 PDKAF1: individual constants @P6A*/ 01060000
*/*     $01=OY65283 RACF/192 930628 PDRHG1: OY65283              @01A*/ 01070000
*/*     $02=OW00942 RACF/210 931213 PDM_O1: OW00942 (PIG3891)    @02A*/ 01080000
*/*     $D7=OW03465 RACF/210 940305 KDRB:   OW03465 (DCR 40)     @D7A*/ 01090000
*/*     $ME=OW10709 RACF/220 940509 PDJMV1: RELEASE ID CHANGES   @MEA*/ 01100000
*/*     $MF=OW10709 RACF/220 940729 PDAHW1: POSIT Support 2.2    @MFA*/ 01110000
*/*     $D8=OW10709 RACF/220 940826 PDSWD1: POSIT DCR 11 DO80011 @D8A*/ 01120000
*/*     $03=OW10709 RACF/220 940907 PDDRL1: OW06492 (PP20003)    @03A*/ 01130000
*/*     $MG=OW10709 RACF/220 941205 PDSWD1: POSIT RCVT Cleanup   @MGA*/ 01140000
*/*     $P7=PQC0201 RACF/220 950601 PDCGK1: PTM PQC0201          @P7A*/ 01150000
*/*     $P8=PSD0821 RACF/220 960216 PDAWC1: PTM PSD0821          @P8A*/ 01160000
*/*     $04=OW20548 RACF/220 960601 PDBEC1: OW20548              @04A*/ 01170000
*/*     $P9=PSD1021 RACF/220 960403 PDAWC1: PTM PSD1021          @P9A*/ 01180000
*/*     $MH=RELID   RACF/230 960422 PDJMV1: RELEASE ID CHANGES   @MHA*/ 01190000
*/*     $MI=CMDEXIT RACF/230 960527 PDBCC1: COMMAND EXIT         @MIA*/ 01200000
*/*     $MJ=CREATOR RACF/230 960527 PDRNH1: ADDCREATOR Support   @MJA*/ 01210000
*/*     $PA=PQC1727 RACF/230 960801 PDBCC1: PTM PQC1727          @PAA*/ 01220000
*/*     $05=OW23446 RACF/230 960822 PDSGW1: SESSION KEY GENERATOR@05A*/ 01230000
*/*     $MK=RELID   RACF/240 960904 PDJMV1: Release ID Support   @MKA*/ 01240000
*/*     $ML=RELID   RACF/260 970728 PDCAM1: Release ID -HRF2260  @MLA*/ 01250000
*/*     $D9=PVT0134 RACF/260 971030 PDR_B1: RACF 2.6 DCR 0001    @D9A*/ 01260000
*/*     $06=OW24641 RACF/240 970831 PDAWC1: OW24640              @06A*/ 01270000
*/*     $07=OW33161 RACF/260 980511 PDAJB1: OW31161              @07A*/ 01280000
*/*     $09=OW32598 RACF/260 980610 PDMKL1: FASTAUTH Extensions  @09A*/ 01290000
*/*     $MM=RELID   HBB6608  980624 PDRDS2: Release ID  HRF2608  @MMA*/ 01300000
*/*     $L9=DCERT   HBB7703  990524 PDCLC:  Digital Cert Ext.    @L9A*/ 01310000
*/*     $LA=IDMAP2  HBB7703  990414 PDISR1: X SEC MOD ID INTEROP @LAA*/ 01320000
*/*     $MN=RELID   HBB7703  990429 PDRDS2: Release ID  HRF7703  @MNA*/ 01330000
*/*     $LB=IDMAP2  HBB7703  990511 PDRNH1: X SEC MOD ID PXD0097 @LBA*/ 01340000
*/*     $LC=PADS1   HBB7703  990706 PDBEC1: Environment service  @LCA*/ 01350000
*/*     $LD=RELID   HBB7705  000404 PDIFS2: Release ID  HRF7705  @LDA*/ 01360000
*/*     $PB=PX01160 HBB7705  010124 PDPFW:  PTM PX01160          @PBA*/ 01370000
*/*     $LE=RELID   HBB7706  010509 PDRDC1: Release ID  HRF7706  @LEA*/ 01380000
*/*     $LF=UNIXUID HBB7707  010711 PDBRW1: Unix UID Usability   @LFA*/ 01390000
*/*     $LG=PADS2   HBB7707  010706 PDBEC1: PADS2 support        @LGA*/ 01400000
*/*     $LH=EIM     HBB7707  011012 PDER1:  EIM support          @LHA*/ 01410000
*/*     $DA=MG00266 HBB7707  011022 PDBRW1: Unix Usability DCR 1 @DAA*/ 01420000
*/*     $LI=RELID   HBB7707  020104 PDMSF1: Release ID  HRF7707  @LIA*/ 01430000
*/*     $LJ=MLS2    HBB7708  011128 PDGTM1: z/OS MLS Support     @LJA*/ 01440000
*/*     $PC=PYN0190 HBB7708  020204 PDGTM1: z/OS MLS Support     @PCA*/ 01450000
*/*     $LK=RELID   HBB7708  020118 PDMSF1: Release ID  HRF7708  @LKA*/ 01460000
*/*     $LL=DYNCDT  HBB7709  021122 PDLAW1: Dynamic CDT          @LLA*/ 01470000
*/*     $LM=USRX1   HBB7720  031010 PDER1:  User Extensions      @LMA*/ 01480000
*/*     $LN=PTCS    HBB7720  031112 PDM_O1: Passticket extension @LNA*/ 01490000
*/*     $LO=RELID   HBB7720  040224 PDRIV1: Support SAF HBB7720  @LOA*/ 01500000
*/*     $LP=PHRS    HBB7730  040929 PDCCM1: Pass phrase + RELID  @LPA*/ 01510000
*/*     $LQ=SAFID   HBB7730  050728 PDISR1: SAF Identity         @LQA*/ 01520000
*/*     $LR=RELID   HBB7740  060330 PDRIV1: Support SAF HBB7740  @LRA*/ 01530000
*/*     $LS=RACFIPCS,HRF7750,061122 PDDFA1: IPCS SUPPORT         @LSA*/ 01540000
*/*     $LT=RELID   HBB7750  070302 PDRIV1: Support SAF HBB7750  @LTA*/ 01550000
*/*     $LU=CFIELD2 HBB7750  070219 PDCCM1: CFIELD2              @LUA*/ 01560000
*/*     $LV=IDPROP  HBB7760  080402 PDDFM1: IDPROP + RELID       @LVA*/ 01570000
*/*     $LW=AUTHPRF HBB7760  081120 PDLAW1: Authorization profile@LWA*/ 01580000
*/*     $LX=GENLOAD HBB7770  090302 PDAWS1: Generic Performance  @LXA*/ 01590000
*/*     $LY=RELID   HBB7770  090831 PDJLW1: Support SAF HBB7770  @LYA*/ 01600000
*/*     $LZ=IDPROP2 HBB7780  100628 PDGTM1: ID Propagation 2     @LZA*/ 01610000
*/*     $MO=RELID   HBB7780  100730 PDJLW1: Support SAF HBB7780  @MOA*/ 01620000
*/*     $MP=AUTHUSE HBB7780  110315 PDLAW1: Authorization Used   @MPA*/ 01630000
*/*     $MQ=RELID   HBB7790  110601 PDJLW1: Support SAF HBB7790  @MQA*/ 01640000
*/*     $MR=RELID   HBB77A0  130107 PDAWS1: Support SAF HBB77A0  @MRA*/ 01650000
*/*     $MS=PWDSPEC HBB77A0  130430 PDBRW1: Password special chrs@MSA*/ 01660000
*/*     $MT=PWDHASH HBB77A0  130923 PDBRW1: Password algorithm   @MTA*/ 01670000
*/*     $MU=NEWMAIN HBB77A0  131210 PDBRW1: Local node in RCVT   @MUA*/ 01680000
*/*     $MV=PWDHASH HBB77A0  140115 PDSGW1: PWDHASH support      @MVA*/ 01690000
*/*     $MW=PWDHASH HBB77A0  140730 PDBRW1: Feature ME27893      @MWA*/ 01700000
*/*     $0A=OA47957 HBB77A0  150626 PDBRW1: APAR OA47957         @0AA*/ 01710000
*/*     $MX=RELID   HBB77B0  150508 PDPGP1: Support SAF HBB77B0  @MXA*/ 01720000
*/*     $MY=EMAIL1  HBB77B0  151102 PDALF1: FP0501               @MYA*/ 01730000
*/*     $PD=ZD003D0P HBB77B0 151208 PDALF1: Defect ZD003D0P      @PDA*/ 01740000
*/*     $PE=ZD003DHM HBB77B0 151215 PDALF1: Defect ZD003DHM      @PEA*/ 01750000
*/*     $MZ=ZD003XBD HBB7790 150625 PDRDC1: MFA SPE OA48650      @MZA*/ 01760000
*/*     $N5=CLOUD1  HBB77B0  160519 PDGRP1: FP0644. 120741       @N5A*/ 01770000
*/*     $N6=MFA3     HBB77B0 160829 PDBRW1: MFA 3                @N6A*/ 01780000
*/*     $0B=OA50749 HBB7790  160620 PDBRW1: R_Password fast-fail @0BA*/ 01790000
*/*     $N7=RELID   HBB77C0  180424 PDPGP1: Support SAF HBB77C0  @N7A*/ 01800000
*/*     $N8=JWTAUTH HBB77B0  181016 PDRDC1: IDT                  @N8A*/ 01810000
*/*     $N9=RELID   HBB77D0  200106 PDPGP1: Support SAF HBB77D0  @N9A*/ 01811000
*/*     $NA=PASSTK4 HBB77D0  200727 PDRDC1: Enhanced PassTickets @NAA*/ 01820000
*/*     $NB=PHRINT  HBB77D0  210405 PDRDC1: Phrase interval      @NBA*/ 01821000
*/*     $Nx=VALBOOT HBB77D0  230208 PDTCG1: Validate Boot        @NCA*/ 01821001
*/*     $NC=IDT2    HBB77D0  220518 PDRDC1: IDT 2                @NDA*/ 01821003
*/*                                                                  */ 01821004
*/*                                                                  */ 01830000
*/*                                                                  */ 01840000
*/*   NOTES = There is IPCS support to format this macro.            */ 01850000
*/*           When adding fields, please add to the end or in        */ 01860000
*/*           reserved space.  Do not change offsets of existing     */ 01870000
*/*           fields.  Update the IPCS support in module: ICHIRCVT   */ 01880000
*/*                                                              @LSA*/ 01890000
*/*                                                                  */ 01900000
*/*   CHANGE DESCRIPTIONS:                                           */ 01910000
*/*     A000000-999999                                       @PC0012B*/ 01920000
*/*     A - Added flags for SETROPTS use, in support                 */ 01930000
*/*         of MVS B1 Security                                   @M3A*/ 01940000
*/*     A - Add flag for Group Tree in Storage support, and      @M4A*/ 01950000
*/*         pointer to IRRRCK02                                  @M4A*/ 01960000
*/*     A - Add pointers to IRRRCK04, and the RDS Templates      @M5A*/ 01970000
*/*     A - Add pointer to IRRDAC00                              @M6A*/ 01980000
*/*     A - Add pointers to IRRFRX00, ICHAUD00, ICHDEX11         @M7A*/ 01990000
*/*     A - Add pointer to IRRXLATE                              @M8A*/ 02000000
*/*     A - Add pointer to IRRRXT10 and IRRRXT11                 @M9A*/ 02010000
*/*     A - Add pointer to ICHGLS06                              @N1A*/ 02020000
*/*     A - Add pointer to Dynamic Parse Table                   @N2A*/ 02030000
*/*     C - Remove pointers to ICHAUD00, IRRDAC00, IRRFRX00 and  @N3A*/ 02040000
*/*         add a pointer to ICHSVC00                            @N3A*/ 02050000
*/*     A - VTAM SLS (Security Level Session) support            @N4A*/ 02060000
*/*     A - Added flags and Class MASKs for the MVS B1 Security      */ 02070000
*/*         support - DCRR # 0050                                    */ 02080000
*/*         (Global Auditing Enhancements - LOGOPTIONS)          @D1A*/ 02090000
*/*     A - Added two USER-Id fields for the MVS B1 Security         */ 02100000
*/*         support - DCRR # 0061                                    */ 02110000
*/*         (JES SYSOUT Name - JES(SYSOUTNAME(USERID), and           */ 02120000
*/*          JES Undefined User - JES(UNDEFINEDUSER(USERID))     @D2A*/ 02130000
*/*     A - Added flags for the MVS B1 Security                      */ 02140000
*/*         support - DCRR # 0062                                    */ 02150000
*/*         (Compatibility Mode - COMPATMODE)                    @D3A*/ 02160000
*/*     A - Added flags for the MVS B1 Security                      */ 02170000
*/*         support - DCRR # 0068                                    */ 02180000
*/*         (Allow WARNING or FAILURE Mode for                       */ 02190000
*/*          CATDSNS, MLS, and MLACTIVE)                         @D4A*/ 02200000
*/*     A - Added flag for the MVS B1 Security                       */ 02210000
*/*         support - DCRR # 0091                                @D5A*/ 02220000
*/*     C - MVS B1 Security support - DCRR # 0099                    */ 02230000
*/*         Change                                                   */ 02240000
*/*         (JES SYSOUT Name - JES(SYSOUTNAME(USERID), to            */ 02250000
*/*          JES NJE User-Id - JES(NJEUSERID(USERID))            @D6A*/ 02260000
*/*     C - RACF Release and Modification Number                 @MAA*/ 02270000
*/*     A - Added bit for SETROPTS APPLAUDIT support             @MBA*/ 02280000
*/*     C - Status to correctly correspond to MVS level, and     @P5A*/ 02290000
*/*         change Product I.D. to RACF/192                      @P5A*/ 02300000
*/*     A - GLOBAL=YES for HPCS Support for RACGLIST             @MCA*/ 02310000
*/*     C - RACF Version, Release, and Modification Number       @MDA*/ 02320000
*/*     A - Add individual constants for the various RACF        @P6A*/ 02330000
*/*         release values                                       @P6A*/ 02340000
*/*     A - Secure Signon Activation: Add ptr to Secure Signon   @01A*/ 02350000
*/*         PassTicket generation routine R23PTGEN, in IRRRIN23, @01A*/ 02360000
*/*         and change Status to correctly correspond to MVS     @01A*/ 02370000
*/*         level.                                               @01A*/ 02380000
*/*     A - Add support for ICHRFX04 FASTAUTH dataspace exit     @02A*/ 02390000
*/*     A - Added flag for extended FASTAUTH available           @D7A*/ 02400000
*/*     C - RACF Version, Release, and Modification Number       @MEA*/ 02410000
*/*     A - Add new class masks to support the new POSIT values. @MFA*/ 02420000
*/*     A - Add new RCVTCDTL field for CDT entry length.         @D8A*/ 02430000
*/*     C - Correct description for RCVTVERS field               @03A*/ 02440000
*/*     C - Make old unused POSIT mask fields reserved:          @MGA*/ 02450000
*/*           RCVTCSTA RCVTCAUD RCVTCPRO RCVTCGEN RCVTCGCM           */ 02460000
*/*           RCVTFPTH RCVTLRCL RCVTLGNL RCVTLCST RCVTLCAU           */ 02470000
*/*           RCVTLCPR RCVTLCGE RCVTLCGC RCVTLFPT RCVTLGAL           */ 02480000
*/*           RCVTLNVR RCVTLGSU RCVTLGFL                             */ 02490000
*/*     A - Add new bit flag(RCVTDYNL) for Dynamic Linklist      @P7A*/ 02500000
*/*         support.                                             @P7A*/ 02510000
*/*     A - Add new RCVTDATP field to hold address of date       @P8A*/ 02520000
*/*         conversion routine for Year 2000 support             @P8A*/ 02530000
*/*     A - Add new bit flag (RCVTXRCO) for Extended Envrin      @04A*/ 02540000
*/*     C - Update PROPRIETARY STATEMENT                         @P9A*/ 02550000
*/*     C - Release ID Changes                                   @MHA*/ 02560000
*/*     A - Add anchor for IRREVX01 exit                         @MIA*/ 02570000
*/*     A - Add new flag bit - RCVTNADC '0'b when ADDCREATOR,    @MJA*/ 02580000
*/*         '1'b when NOADDCREATOR specified                     @MJA*/ 02590000
*/*     A - Add RCVTDATP to GUPI listing                         @PAA*/ 02600000
*/*         & reserve unused field                               @PAA*/ 02610000
*/*     A - Add session key generator routine                    @05A*/ 02620000
*/*     C - Release ID Support                                   @MKA*/ 02630000
*/*     C - Release ID Support for HRF2260 on JBB6605            @MLA*/ 02640000
*/*     A - Added RCVTTLPS to indicate task level ACEE support   @D9A*/ 02650000
*/*         for callable services.                               @D9A*/ 02660000
*/*     A - Add new flag bit - RCVT4INF to indicate that support @06A*/ 02670000
*/*         for 4 byte dates on programming interfaces is        @06A*/ 02680000
*/*         available                                            @06A*/ 02690000
*/*     A - Add new flag bit RCVTXUSP to indicate that RACF      @07A*/ 02700000
*/*         support for OS/390 UNIX Apar OW32119 is present.     @07A*/ 02710000
*/*     A - Add new flag bit RCVTXFAR to indicate that RACF      @09A*/ 02720000
*/*         support for OS/390 Apar OW32598 is present.          @09A*/ 02730000
*/*     C - Release ID Support for HRF2608 on HBB6608            @MMA*/ 02740000
*/*     A - Added bit to indicate X500NAME support available     @L9A*/ 02750000
*/*     A - byte for X Security Model Identity Operability       @LAA*/ 02760000
*/*     C - Release ID Support for HRF7703 on HBB7703            @MNA*/ 02770000
*/*     A - add missing comment delimiters for X SEC ID Mapping  @LBA*/ 02780000
*/*         changes made in assembler mapping section            @LBA*/ 02790000
*/*     A - add IRRENS00 module pointer and service indicator    @LCA*/ 02800000
*/*     A - Release ID Support for HRF7705 on HBB7705            @LDA*/ 02810000
*/*     C - change comment on RCVTVRMN description to reflect    @PBA*/ 02820000
*/*         that it contains the last 4 characters of the RACF   @PBA*/ 02830000
*/*         FMID and not the VRRM (version, release, mod level)  @PBA*/ 02840000
*/*     A - Release ID Support for HRF7706 on HBB7706            @LEA*/ 02850000
*/*     A - Add indicator for existence of UNIXPRIV profile      @LFA*/ 02860000
*/*         named FILE.GROUPOWNER.PROCESS                        @LFA*/ 02870000
*/*     A - Add PADS2 fields RCVTLPAP RCVTPSEN and RCVTPSWR      @LGA*/ 02880000
*/*     A - Add EIM registry name ptr field RCVTEIMR             @LHA*/ 02890000
*/*     C - Rename profile from FILE.GROUPOWNER.PROCESS to       @DAA*/ 02900000
*/*         FILE.GROUPOWNER.SETGID and rename RCVT bit used      @DAA*/ 02910000
*/*     A - Release ID Support for HRF7707 on HBB7707            @LIA*/ 02920000
*/*     A - Support for z/OS Multi Level Security                @LJA*/ 02930000
*/*     C - Support for z/OS Multi Level Security                    */ 02940000
*/*         - Correct the value assigned to the field                */ 02950000
*/*           RCVTMLNM (from x'40' to x'20') in the                  */ 02960000
*/*           Assembler portion of the RCVT                      @PCA*/ 02970000
*/*     A - Release ID Support for HRF7708 on HBB7708            @LKA*/ 02980000
*/*     A - Byte RCVTFLG3 and bit RCVTDCDT for Dynamic CDT       @LLA*/ 02990000
*/*     A - Release ID Support                                   @LLA*/ 03000000
*/*     A - Add RCVTPLC for lower case passwords and RCVTPMIN        */ 03010000
*/*         for minimum time between password changes            @LMA*/ 03020000
*/*     A - Add address of passticket evaluation routine         @LNA*/ 03030000
*/*         This is set by IRRRIN23 during RACF initialization   @LNA*/ 03040000
*/*     A - Add support for SAF Release FMID HBB7720             @LOA*/ 03050000
*/*     A - Add support for new Pass phrase exit and new RELID   @LPA*/ 03060000
*/*         for HBB7730                                          @LPA*/ 03070000
*/*     A - Add support for SAF Identity configuration support.  @LQA*/ 03080000
*/*     A - Add support for SAF Release FMID HBB7740             @LRA*/ 03090000
*/*     A - Add support for SAF Release FMID HBB7750             @LTA*/ 03100000
*/*     A - Add a bit indicating at least one custom field is    @LUA*/ 03110000
*/*         defined in the Dynamic Parse Table                   @LUA*/ 03120000
*/*     A - Add maximum acceptable lengths for distributed       @LVA*/ 03130000
*/*         user ID and registry name                            @LVA*/ 03140000
*/*       - Add support for SAF Release FMID HBB7760             @LVA*/ 03150000
*/*     A - RCVTGENT - address of generic name translate routine @LWA*/ 03160000
*/*     A - RCVTGANC - address of GENERICANCHOR keyword settings @LXA*/ 03170000
*/*     A - Add support for SAF Release FMID HBB7770             @LYA*/ 03180000
*/*     A - Add a field to indicate that Identity Propagation 2      */ 03190000
*/*         services are available on the system                 @LZA*/ 03200000
*/*     A - Add support for SAF Release FMID HBB7780             @MOA*/ 03210000
*/*     A - Bit RCVTAUTU to show that authorization used         @MPA*/ 03220000
*/*         info is available to authorization exits ICHRCX02,   @MPA*/ 03230000
*/*         ICHRFX02, ICHRFX04 and ICHRDX02.                     @MPA*/ 03240000
*/*     A - Add support for SAF Release FMID HBB7790             @MQA*/ 03250000
*/*     A - Add support for SAF Release FMID HBB77A0             @MRA*/ 03260000
*/*     A - Add flag for SETROPTS PASSWORD(SPECIALCHARS)         @MSA*/ 03270000
*/*     A - Add fields for new password algorithm                @MTA*/ 03280000
*/*     A - Add RCVTLNOD field for RRSF local node name          @MUA*/ 03290000
*/*     A - Add RCVTMXPW field for address of IRRMXPW0           @MVA*/ 03300000
*/*     A - Add RCVTXPWD bit to indicate extended password       @MWA*/ 03310000
*/*         support is available. This is for the rollback SPE   @MWA*/ 03320000
*/*         via OA43998/OA43999.                                 @MWA*/ 03330000
*/*     C - Change description of RCVTVRMN field                 @0AA*/ 03340000
*/*     A - Add support for SAF Release FMID HBB77B0             @MXA*/ 03350000
*/*     A - Add RCVTMAIL bit to indicate e-mail support is       @MYA*/ 03360000
*/*         available                                            @MYA*/ 03370000
*/*     C - Correct ASM failure caused by the addition of the    @PDA*/ 03380000
*/*         RCVTVRB0 constant                                    @PDA*/ 03390000
*/*     C - Use correct bit for e-mail support is available      @PEA*/ 03400000
*/*     A - Add RCVTMFA bit to indicate MFA support is               */ 03410000
*/*         available                                            @MZA*/ 03420000
*/*     A - Add bit RCVTGNOE for ENHANCEDGENERICOWNER            @N5A*/ 03430000
*/*     A - Add RCVTMFA3 bit to indicate MFA 3 support is            */ 03440000
*/*         available                                            @N5A*/ 03450000
*/*     A - Add RCVTRPFF bit to indicate R_Password fast-fail    @0BA*/ 03460000
*/*         option, introduced by OA50748, is available.         @0BA*/ 03470000
*/*     A - Add support for SAF Release FMID HBB77C0             @N7A*/ 03480000
*/*     A - Add RCVTIDT bit to indicate IDT support is               */ 03490000
*/*         available.                                           @N8A*/ 03500000
*/*     A - Add support for SAF Release FMID HBB77D0             @N9A*/ 03501000
*/*     A - Add RCVTEPT bit to indicate Enhanced PassTicket          */ 03510000
*/*         support is available.                                @NAA*/ 03510100
*/*     A - Add RCVTPHIN field for password phrase interval.     @NBA*/ 03510200
*/*         Add RCVTPHIA bit to indicate phrase interval         @NBA*/ 03510201
*/*         support is available.                                @NBA*/ 03510202
*/*     A - Add RCVTVABT bit to indicate Validated Boot support      */ 03510203
*/*         is available.                                        @NCA*/ 03510206
*/*     A - Add RCVTIDT2 bit to indicate IDT 2 support is        @NDA*/ 03510207
*/*         available.                                           @NDA*/ 03510208
*/*                                                                  */ 03510209
*/*                                                                  */ 03520000
*/*                                                                  */ 03530000
*/* END OF SPECIFICATIONS ********************************************/ 03540000
*/*                                                                  */ 03550000
*        %GOTO RCVTPLS  ;   /*  BILINGUAL HEADER                        03560000
         MACRO                                                          03570000
         ICHPRCVT                                                       03580000
RCVT     DSECT     ,CVTRAC                                              03590000
RCVTID   DS    CL4                   EBCDIC ID                          03600000
RCVTDCB  DS    A                     PTR DCB OF RACF DATA SET           03610000
RCVTDEB  DS    A                     PTR DEB OF RACF DATA SET           03620000
RCVTINDX DS    A                     PTR RACF RESIDENT INDEX TABLE      03630000
*                                    OR ZERO IF NO INDEX BLOCKS         03640000
*                                    RESIDENT                           03650000
RCVTTEMP DS    A                     PTR RACF INCORE TEMPLATE TABLE     03660000
RCVTHDR  DS    A                     PTR RACF INCORE DS HEADER RECORD   03670000
*                                    OR ZERO IF RACF DATA SET IS ON     03680000
*                                    A SHARED DEVICE                    03690000
RCVTRIX  DS    A                     PTR RACINIT INSTALL. EXIT RTN      03700000
RCVTRCX  DS    A                     PTR RACCHK  INSTALL. EXIT RTN      03710000
RCVTRDX  DS    A                     PTR RACDEF  INSTALL. EXIT RTN      03720000
RCVTRUCB DS    A                     PTR UCB OF RACF DATA SET           03730000
RCVTXLEN DS    F                     LENGTH OF INCORE INDEX RELATED     03740000
*                                    CONTROL BLOCKS @PM43143            03750000
RCVTBAM  DS    A                     LOCATES INCORE BAM INFORMATION     03760000
RCVTISTL DS    A                     RESERVED FOR INSTALLATION          03770000
RCVTDSNL DS    XL1                   LENGTH OF RACF DATA SET NAME       03780000
RCVTSTAT DS    B                     STATUS                             03790000
RCVTRNA  EQU   X'80'                 RACF NOT ACTIVE                    03800000
RCVTNLS  EQU   X'40'                 BYPASS RACINIT STATISTICS          03810000
RCVTNDSS EQU   X'20'                 BYPASS DATA SET STATISTICS         03820000
*                                                              @PC0022B 03830000
RCVTNTVS EQU   X'10'                 NO TAPE VOLUME STATISTICS @PC0022B 03840000
RCVTNDVS EQU   X'08'                 NO DIRECT ACCESS VOLUME            03850000
*                                    STATISTICS                @PC0022B 03860000
RCVTNTMS EQU   X'04'                 NO TERMINAL STATISTICS    @PC0022B 03870000
RCVTNADS EQU   X'02'                 NO ADSP PROTECTION            @L5A 03880000
RCVTEGN  EQU   X'01'                 EGN SUPPORT IN EFFECT         @M1A 03890000
RCVTNREC DS    H                     # RECORDS PER TRACK  -RACF DS      03900000
RCVTDSN  DS    CL44                  DSN OF RACF DATA SET               03910000
RCVTUADS DS    CL44                  DSN OF UADS DATA SET OR ZERO       03920000
RCVTUVOL DS    CL6                   VOLID OF UADS DATA SET OR ZERO     03930000
RCVTSTA1 DS    B                     STATUS                    @PC0022B 03940000
RCVTTAPE EQU   X'80'                 TAPE VOLUME PROTECTION             03950000
*                                    IN EFFECT                 @PC0022B 03960000
RCVTDASD EQU   X'40'                 DASD VOLME PROTECTION              03970000
*                                    IN EFFECT                 @ZA25267 03980000
RCVTDGEN EQU   X'20'                 GENERIC PROFILE CHECKING FOR       03990000
*                                    DATASET CLASS IN EFFECT       @L5A 04000000
RCVTDGCM EQU   X'10'                 GENERIC COMMAND PROCESSING FOR     04010000
*                                    DATASET CLASS IN EFFECT       @L5A 04020000
RCVTRDSN EQU   X'08'                 INPUT DATA SET NAME WILL BE USED   04030000
*                                    FOR LOGGING AND MESSAGES      @L6A 04040000
RCVTJXAL EQU   X'04'                 JES-XBMALLRACF IS IN EFFECT   @L6A 04050000
RCVTJCHK EQU   X'02'                 JES-EARLYVERIFY IS IN EFFECT  @L6A 04060000
RCVTJALL EQU   X'01'                 JES-BATCHALLRACF IS IN EFFECT @L6A 04070000
RCVTAUOP DS    XL1                   AUDIT    OPTIONS          @PC0022B 04080000
RCVTAGRO EQU   X'40'                 AUDIT GROUP CLASS         @PC0022B 04090000
RCVTAUSE EQU   X'20'                 AUDIT USER CLASS          @PC0022B 04100000
RCVTADAT EQU   X'10'                 AUDIT DATASET CLASS       @PC0022B 04110000
RCVTADAS EQU   X'08'                 AUDIT DASDVOL CLASS       @PC0022B 04120000
RCVTATAP EQU   X'04'                 AUDIT TAPEVOL CLASS       @PC0022B 04130000
RCVTATER EQU   X'02'                 AUDIT TERMINAL CLASS      @PC0022B 04140000
RCVTAOPR EQU   X'01'                 AUDIT OPERATIONS ATTRIBUTE    @L7A 04150000
RCVTAXTA DS    XL1                   RESERVED                  @PC0022B 04160000
RCVTFLGS DS    XL1                   STATUS FLAGS              @PC0022B 04170000
RCVTROFF EQU   X'80'                 RACF HAS BEEN DEACTIVATED BY THE   04180000
*                                    RVARY COMMAND             @PC0022B 04190000
RCVTRDHD EQU   X'40'                 RACF HAS BEEN RE-ACTIVATED BY      04200000
*                                    RVARY AND REFRESH OF THE RESIDENT  04210000
*                                    ICB IS NECESSARY          @PC0022B 04220000
RCVTSHR  EQU   X'20'                 THE RACF DATA SET AT SOME POINT    04230000
*                                    DURING THIS IPL, WAS ON A SHARED   04240000
*                                    DASD DEVICE               @PC0022B 04250000
RCVTNDUP EQU   X'10'                 NO DUPLICATE DATA SET NAMES        04260000
*                                    TO BE DEFINED             @ZA20369 04270000
RCVT24MD EQU   X'08'                 AT LEAST ONE INSTALLATION EXIT     04280000
*                                    HAS AMODE=24                  @L7A 04290000
RCVTRMSG EQU   X'04'                 RACF MESSAGE ICH412I WAS           04300000
*                                    ISSUED                        @L7A 04310000
RCVTWUID EQU   X'02'                 RACF WORK UNIT IDENTITY SUPPORT    04320000
*                                    EXISTS                    @YA32826 04330000
RCVTGLBL EQU   X'01'                 GLOBAL=YES SUPPORT EXISTS     @MCA 04340000
RCVTEROP DS    B                     TERMINAL VERIFICATION              04350000
*                                    OPTIONS                   @PC0022B 04360000
RCVTTERP EQU   X'80'                 TERMINAL AUTHORIZATION             04370000
*                                    CHECKING                  @PC0022B 04380000
RCVTTUAC EQU   X'40'                 DEFAULT UACC FOR TERMINALS         04390000
*                                    NOT DEFINED TO RACF                04400000
*                                    IF ON - UACC = NONE                04410000
*                                    IF OFF- UACC = READ       @PC0022B 04420000
RCVTAVIO EQU   X'20'                 DO NOT CREATE LOG RECORD FOR       04430000
*                                    COMMAND VIOLATIONS ONLY   @PC0022B 04440000
RCVTSAUD EQU   X'10'                 DO NOT AUDIT SPECIAL USER @PC0022B 04450000
RCVTPINV DS    B                     GLOBAL MAX PASSWORD                04460000
*                                    INTERNAL VALUE                     04470000
*                                    VALID RANGE 1 - 254       @PC0022B 04480000
RCVTRAU0 DS    A                     PTR TO AUDITING MODULE    @PC0022B 04490000
RCVTRIXP DS    A                     PTR TO RACINIT POST PROCESSING     04500000
*                                    INSTALLATION EXIT RTN     @PC0022B 04510000
RCVTRCXP DS    A                     PTR TO RACCHK POST PROCESSING      04520000
*                                    INSTALLATION EXIT RTN     @PC0022B 04530000
RCVTRID0 DS    A                     PTR TO MSC VERIFY RTN     @PC0022B 04540000
RCVTVERS DS    XL1                   VERSION INDICATOR                  04550000
*                                    HIGH NIBBLE IS THE VERSION NUMBER, 04560000
*                                    (0=VERSION 1), AND THE LOW NIBBLE  04570000
*                                    IS THE RELEASE NUMBER         @L8A 04580000
RCVTVRN  EQU   X'F0'                 VERSION NUMBER IN HIGH NIBBLE @L8A 04590000
RCVTRELS EQU   X'0F'                 RELEASE NUMBER IN LOW NIBBLE  @L8A 04600000
*                                    0 - VERSION 1, RELEASE 1  @PC003PY 04610000
*                                    1 - VERSION 1, RELEASE 2  @PC003PY 04620000
*                                    2 - VERSION 1, RELEASE 3  @PC003PY 04630000
*                                    4 - VERSION 1, RELEASE 4      @L4A 04640000
*                                    5 - VERSION 1, RELEASE 5      @L5A 04650000
*                                    6 - VERSION 1, RELEASE 6      @L6A 04660000
*                                    7 - VERSION 1, RELEASE 7      @L7A 04670000
*                                    8 - VERSION 1, RELEASE 8      @L8A 04680000
*                                    OR HIGHER (SEE FIELD RCVTVRMN)@0AC 04690000
RCVTEXTA DS    CL3                   RESERVED                  @ZA25840 04700000
RCVTAPTR DS    A                     ADDRESS FIELD RESERVED FOR         04710000
*                                    APPLICATION USE           @PC003PY 04720000
RCVTNCX  DS    A                     PTR NAMING CONVENTION EXIT         04730000
*                                                              @ZA25840 04740000
RCVTNCDX DS    A                     PTR NAMING CONVENTION EXIT FOR     04750000
*                                    DELETE FUNCTION           @ZA25840 04760000
RCVTCDTP DS    A                     PTR TO CLASS DESC TABLE (Static   *04770000
                                     classes only)                 @LLC 04780000
RCVTREXP DS    A                     PTR TO RACSTAT MODULE     @PC003PY 04790000
RCVTFRCP DS    A                     PTR TO FRACHECK MODULE    @PC003PY 04800000
RCVTFRXP DS    A                     PTR TO FRACHECK EXIT RTN  @PC003PY 04810000
RCVTRLX  DS    A                     PTR TO RACLIST PRE-EXIT   @PC003PY 04820000
RCVTRLXP DS    A                     PTR TO RACLIST SELECTION EXIT     *04830000
                                                               @PC003PY 04840000
RCVTDATP DS    A                     PTR TO 4 BYTE DATE CONVERSION     *04850000
                                     ROUTINE                       @P8A 04860000
RCVTENVP DS    A                     PTR TO ENVIRONMENT SERVICE        *04870000
                                     ROUTINE (IRRENS00)            @LCA 04880000
RCVTEIMR DS    A                     PTR to EIM Registry name      @LHC 04890000
RCVTDSDT DS    A                     PTR TO DS DESCIPTOR TAB   @PC0036U 04900000
RCVTRNGP DS    A                     PTR TO RANGE TABLE        @PC0036U 04910000
RCVTAUTP DS    A                     PTR TO RACF AUTHORIZED CALLER      04920000
*                                      TABLE ICHAUTAB              @LA1 04930000
RCVTPWDX DS    A                     PTR TO RACF PASSWORD EXIT.   @L4A  04940000
RCVTHIST DS    AL1                   NUMBER OF PASSWORD GENERATIONS     04950000
*                                     TO MAINTAIN AND CHECK AGAINST.    04960000
RCVTRVOK DS    AL1                   NUMBER OF CONSECUTIVE              04970000
*                                     UNSUCCESSFUL ATTEMPTS BEFORE      04980000
*                                     REVOKING A USERID.           @L4A 04990000
RCVTWARN DS    AL1                   NUMBER OF DAYS REMAINING IN        05000000
*                                     A PASSWORD INTERVAL AFTER         05010000
*                                     WHICH WARNING MESSAGES WILL       05020000
*                                     BE ISSUED.                   @L4A 05030000
RCVTINAC DS    AL1                   INACTIVATE INTERVAL.          @L4A 05040000
RCVTSNTX DS    80X                   NEW PASSWORD SYNTAX RULES.    @L4A 05050000
*                                                                  @L4A 05060000
* FOLLOWING DSECT DESCRIBES AN INDIVIDUAL PASSWORD SYNTAX RULE.    @L4A 05070000
*  THERE CAN BE A MAXIMUM OF EIGHT RULES.                          @L4A 05080000
*                                                                  @L4A 05090000
RCVTSNTD DSECT ,                                                   @L4A 05100000
RCVTSLEN DS    AL1                   STARTING LENGTH VALUE.        @L4A 05110000
RCVTELEN DS    AL1                   ENDING LENGTH VALUE.          @L4A 05120000
RCVTRUL1 DS    AL1                   CONTENT RULE.                 @L4A 05130000
RCVTRUL2 DS    AL1                   CONTENT RULE.                 @L4A 05140000
RCVTRUL3 DS    AL1                   CONTENT RULE.                 @L4A 05150000
RCVTRUL4 DS    AL1                   CONTENT RULE.                 @L4A 05160000
RCVTRUL5 DS    AL1                   CONTENT RULE.                 @L4A 05170000
RCVTRUL6 DS    AL1                   CONTENT RULE.                 @L4A 05180000
RCVTRUL7 DS    AL1                   CONTENT RULE.                 @L4A 05190000
RCVTRUL8 DS    AL1                   CONTENT RULE.                 @L4A 05200000
RCVT     DSECT ,                                                   @L4A 05210000
RCVTMDEL DS    AL4                   MODEL OPTIONS.                @L4A 05220000
         ORG   RCVTMDEL                                            @L4A 05230000
RCVTMGDG EQU   X'80'                 MODEL-GDG IN EFFECT.          @L4A 05240000
RCVTMUSR EQU   X'40'                 MODEL-USER IN EFFECT.         @L4A 05250000
RCVTMGRP EQU   X'20'                 MODEL-GROUP IN EFFECT.        @L4A 05260000
         ORG   RCVTMDEL+1                                          @L4A 05270000
         DS    AL3                   RESERVED.                     @L4A 05280000
RCVTWCNT DS    AL1                   NUMBER OF VSL ENTRIES     @YA13514 05290000
RCVTOPTX DS    AL1                   OPTIONS.                      @L4A 05300000
RCVTLGRP EQU   X'80'                 LIST OF GROUP CHKING ACTIVE.  @L4A 05310000
RCVTALIS DS    BL1                   IDMAP2 enablement byte        @LAA 05320000
*                                    X Sec Model Ident Interoperability 05330000
RCVTSTG0 EQU   X'00'                 0=stage0, not active, only         05340000
*                                      alias mapping profiles      @LAA 05350000
RCVTSTG1 EQU   X'01'                 1=stage1, active, maintain alias   05360000
*                                      index, but also maintain and     05370000
*                                      USE the mapping profiles    @LAA 05380000
RCVTSTG2 EQU   X'02'                 2=stage2, active, maintain and     05390000
*                                      USE alias index, but still  @LBA 05400000
*                                      maintain mapping profiles   @LAA 05410000
RCVTSTG3 EQU   X'03'                 3=stage3, active, maintain and     05420000
*                                      USE alias index (mapping    @LBA 05430000
*                                      profiles have been removed) @LAA 05440000
         DS    CL1                   RESERVED.                     @LAC 05450000
RCVTFRX3 DS    A                     ADDRESS OF EXIT ICHRFX03      @D7A 05460000
RCVTVSL  DS    4D                    VSL ENTRIES               @YA13514 05470000
RCVTCGSN DS    F                     NUMBER OF CONNECT-REMOVE           05480000
*                                     COMMANDS ISSUED THAT ALTERED      05490000
*                                     A USERS AUTHORITY.           @L4A 05500000
RCVTDNL  DS    AL2                   Maximum acceptable length          05510000
*                                    for distributed user ID       @LVA 05520000
RCVTRL   DS    AL2                   Maximum acceptable length for      05530000
*                                    registry name                 @LVA 05540000
RCVTIDPV DS    AL1                   1=Identity Propagation 2           05550000
*                                      services are available           05560000
*                                      on the system               @LZA 05570000
         DS    CL3                   Reserved.                     @LZC 05580000
RCVTRDXP DS    A                     PTR TO RACDEF POST PROCESSING      05590000
*                                     INSTALLATION EXIT- ICHRDX02  @L5A 05600000
RCVTFPB  DS    A                     BASE FOR FASTPATH TABLE.      @L5A 05610000
RCVTRCVI DS    A                     Address of RCVI               @LQC 05620000
RCVTFLG1 DS    BL4                   MISC. OPTIONS.                @L5A 05630000
RCVTFPDS EQU   X'80'                 FASTPATH FOR DATASET CLASS.   @L5A 05640000
RCVTTDSN EQU   X'40'                 TAPE DATA SET PROTECTION IN        05650000
*                                    EFFECT                        @L7A 05660000
         ORG   RCVTFLG1+1                                          @L7A 05670000
RCVTPRO  EQU   X'80'                 PROTECT-ALL IS IN EFFECT      @L7A 05680000
RCVTPROF EQU   X'40'                 1 - PROTECT-ALL WARNING IN EFFECT  05690000
*                                    0 - PROTECT-ALL FAILURE IN EFFECT  05700000
*                                    (THIS FLAG IS IGNORED IF           05710000
*                                    RCVTPRO HAS A VALUE OF '0'B)  @L7A 05720000
RCVTEOS  EQU   X'20'                 ERASE-ON-SCRATCH IN EFFECT    @L7A 05730000
RCVTEOSL EQU   X'10'                 ERASE-ON-SCRATCH BY SECLEVEL       05740000
*                                    IN EFFECT                     @L7A 05750000
*                                    (THIS FLAG IS IGNORED IF           05760000
*                                    RCVTEOS HAS A VALUE OF '0'B)  @L7A 05770000
RCVTEOSA EQU   X'08'                 ERASE-ON-SCRATCH FOR ALL DATA      05780000
*                                    SETS IN EFFECT                @L7A 05790000
         ORG   RCVTFLG1+2                                          @L7A 05800000
RCVTPROG EQU   X'80'                 ACCESS CONTROL BY PROGRAM IN       05810000
*                                    EFFECT                        @L7A 05820000
         ORG   ,                                                   @L7A 05830000
RCVTRTPD DS    BL2                   SYSTEM SECURITY RETENTION          05840000
*                                    PERIOD                        @L7A 05850000
RCVTSLVL DS    BL1                   SECURITY LEVEL FOR ERASE-ON-       05860000
*                                    SCRATCH                       @L7A 05870000
RCVTQLLN DS    AL1                   LENGTH OF SINGLE LEVEL DATASET     05880000
*                                    NAME PREFIX                   @L5A 05890000
RCVTQUAL DS    CL9                   INSTALLATION CONTROLLED PREFIX     05900000
*                                    FOR SINGLE LEVEL DATASET NAMES,    05910000
*                                    PLUS PERIOD FOR LEVEL         @L5A 05920000
RCVTSLAU DS    X                     SECLEVEL TO AUDIT             @L8A 05930000
RCVTMFLG DS    B                     MISCELLANEOUS FLAGS           @P4A 05940000
RCVTVRMF EQU   X'80'                 RACF VERSION, RELEASE, AND         05950000
*                                    MODIFICATION FLAG FOR THE ICQ      05960000
*                                    (TSO) SUPPORT IN 1.8.1        @P4A 05970000
RCVT310U EQU   X'40'                 RUNNING MVS/SP 3.1.0 OR UP    @M4A 05980000
RCVTXMFR EQU   X'20'                 Extended FASTAUTH available   @D7A 05990000
RCVTDYNL EQU   X'10'                 Support for Dynamic LNKLST is      06000000
*                                    provided by this security          06010000
*                                    product.                      @P7A 06020000
RCVTD4OK EQU   X'08'                 DATE CONVERSION ROUTINE IS         06030000
*                                    AVAILABLE                     @P8A 06040000
RCVTXRCO EQU   X'04'                 EXTENDED ENVRIN AVAILABLE     @04A 06050000
RCVT4INF EQU   X'02'                 SUPPORT FOR FOUR BYTE DATES ON     06060000
*                                    PROGRAMMING INTERFACES IS          06070000
*                                    AVAILABLE                     @06A 06080000
RCVTTLPS EQU   X'01'                 Task level ACEE support       @D9A 06090000
*                                    available for callable        @D9A 06100000
*                                    services.                     @D9A 06110000
RCVTMFL1 DS    CL1                   MORE MISCELLANEOUS FLAGS      @07C 06120000
RCVTXUSP EQU   X'80'                 Extended INITUSP support      @07A 06130000
*                                    available                     @07A 06140000
RCVTXFAR EQU   X'40'                 FASTAUTH ENVRIN/SETROPTS      @09A 06150000
*                                    RACLIST support available     @09A 06160000
RCVTENVS EQU   X'20'                 Environment service (IRRENS00)     06170000
*                                    available                     @LCA 06180000
RCVTX500 EQU   X'10'                 X500NAME Support Available    @L9A 06190000
*                                                                       06200000
RCVTPSEN EQU   X'08'                 PGMSECURITY OPTION                 06210000
*                                    0 - BASIC    1 - ENHANCED     @LGA 06220000
RCVTPSWR EQU   X'04'                 PGMSECURITY ENHANCED               06230000
*                                    0 - FAILURE  1 - WARNING      @LGA 06240000
RCVTLPAP EQU   X'02'                 RACF REQ=FAE ATTCH1ST required     06250000
*                                    for LPA                            06260000
*                                    0 - no       1 - YES          @LGA 06270000
RCVTFGSG EQU   X'01'                 FILE.GROUPOWNER.SETGID exists @DAC 06280000
*                                                                       06290000
RCVTSPT  DS    A                     POINTER TO THE STARTED PROCEDURES  06300000
*                                    TABLE (ICHRIN03)              @L6A 06310000
RCVTDESX DS    A                     POINTER TO THE PASSWORD ENCRYP-    06320000
*                                    TION INSTALLATION EXIT (ICHDEX01)  06330000
*                                                                  @L6A 06340000
RCVTNTAB DS    A                     POINTER TO THE NAMING CONVENTION   06350000
*                                    TABLE (ICHNCV00)              @L6A 06360000
RCVTNRTN DS    A                     POINTER TO THE NAMING CONVENTION   06370000
*                                    ROUTINE (ICHNRT00)            @L6A 06380000
RCVTFRX2 DS    A                     ADDRESS OF FRACHECK                06390000
*                                    POST-PROCESSING INSTALLATION       06400000
*                                    EXIT (ICHRFX02)               @L6A 06410000
RCVTPROB DS   0D                     ADDRESSES OF CONTROLLED PROGRAMS   06420000
*                                    LIST ANCHORS                  @L7A 06430000
RCVTCISP DS    A                     ADDRESS OF CURRENT ANCHOR FOR      06440000
*                                    CONTROLLED PROGRAMS LIST      @L7A 06450000
RCVTOISP DS    A                     ADDRESS OF OLD ANCHOR FOR          06460000
*                                    CONTROLLED PROGRAMS LIST      @L7A 06470000
RCVTSWPW DS    CL8                   PASSWORD FOR RVARY SWITCH          06480000
*                                    COMMAND                       @L7A 06490000
RCVTINPW DS    CL8                   PASSWORD FOR RVARY INACTIVE        06500000
*                                    COMMAND                       @L7A 06510000
RCVTLARP DS    A                     PTR TO LINKAGE ASSIST ROUTINE      06520000
*                                    FOR INSTAL EXITS (ICHLAR00)   @L7A 06530000
RCVTCTV0 DS    A                     ADDRESS OF TVTOC UTILITY           06540000
*                                    (ICHCTV00)                    @L7A 06550000
RCVTPNL0 DS    A                     POINTER TO PROFILE NAME LIST      +06560000
                                     ROUTINE                       @L8A 06570000
RCVTSKGN DS    A                     Pointer to session key routine@05A 06580000
RCVTPTEV DS    A                     Pointer to Passticket eval         06590000
*                                     Routine                      @LNA 06600000
RCVTPHRX DS    A                     Address of new pass phrase exit    06610000
*                                    ICHPWX11                      @LPA 06620000
RCVTGENT DS    A                     Address of generic name translate  06630000
*                                    routine IRRGNT00              @LWA 06640000
RCVTGANC DS    A                     Address of GENERICANCHOR keyword   06650000
*                                    settings                      @LXA 06660000
RCVTLNOD DS    CL8                   RRSF local node name. Binary  @MUA 06670000
*                                    zeros if never set. Name      @MUA 06680000
*                                    persists even if node deleted.@MUA 06690000
RCVTMXPW DS    A                     Address of IRRMXPW0 routine   @MVA 06700000
*                                                                  @MVA 06710000
RCVTPHIN DS    AL2                   Password phrase interval      @NBA 06720000
*                                                                  @NBA 06720001
         DS    CL94                  Reserved.                     @NBC 06720002
RCVTGLS1 DS    A                     ADDRESS OF GENLIST DELETE ROUTINE +06730000
                                     (ICHGLS01)                    @L8A 06740000
RCVTRCVX DS    A                     ADDRESS OF RCVT EXTENSION AREA    +06750000
                                                                   @P1A 06760000
RCVTLAR2 DS    A                     ADDRESS OF ICHLAR02           @L8A 06770000
RCVTFLT0 DS    A                     ADDRESS OF IRRFLT00           @P2A 06780000
RCVTFLT1 DS    A                     ADDRESS OF IRRFLT01           @P2A 06790000
RCVTVRMN DS    CL4                   Contains "7791" starting with @0AC 06800000
*                                    z/OS V2R2. To determine the   @0AC 06810000
*                                    release level, use fields in  @0AC 06820000
*                                    the MVS CVT.                  @0AC 06830000
RCVTVMSP DS    F                     ICB SYNC COUNT VM 380         @M2A 06840000
RCVTVMXA DS    F                     ICB SYNCH COUNT VM XA         @M2A 06850000
RCVTFLG2 DS    B                     RACF 1.9.0  SETROPTS  OPTIONS @M3A 06860000
RCVTSLCL EQU   X'80'                 SETROPTS SECLABELCONTROL - ON @M3A 06870000
RCVTCATD EQU   X'40'                 SETROPTS CATDSNS         - ON @M3A 06880000
RCVTMLQT EQU   X'20'                 SETROPTS MLQUIET         - ON @M3A 06890000
RCVTMLST EQU   X'10'                 SETROPTS MLSTABLE        - ON @M3A 06900000
RCVTMLS  EQU   X'08'                 SETROPTS MLS             - ON @M3A 06910000
RCVTMLAC EQU   X'04'                 SETROPTS MLACTIVE        - ON @M3A 06920000
RCVTGNOW EQU   X'02'                 SETROPTS GENERICOWNER    - ON @M3A 06930000
RCVTAUSL EQU   X'01'                 SETROPTS SECLABELAUDIT   - ON @M3A 06940000
RCVTLOGD DS    B                     LOGOPTIONS FOR DATASET             06950000
RCVTDLGA EQU   X'80'                 LOGOPTIONS "ALWAYS" FOR THE       +06960000
                                     DATASET CLASS                 @D1A 06970000
RCVTDLGN EQU   X'40'                 LOGOPTIONS "NEVER" FOR THE        +06980000
                                     DATASET CLASS                 @D1A 06990000
RCVTDLGS EQU   X'20'                 LOGOPTIONS "SUCCESSES" FOR THE    +07000000
                                     DATASET CLASS                 @D1A 07010000
RCVTDLGF EQU   X'10'                 LOGOPTIONS "FAILURES" FOR THE     +07020000
                                     DATASET CLASS                 @D1A 07030000
RCVTSINT DS    H                     LU Session Interval           @N4A 07040000
RCVTML2F DS    B                     SETROPTS options for RACF         +07050000
                                     z/OS Multi Level Security         +07060000
                                     support                       @LJA 07070000
RCVTMLFS EQU   X'80'                 Seclabels required for            +07080000
                                     File System Objects           @LJA 07090000
RCVTMLIP EQU   X'40'                 Seclabels required for            +07100000
                                     IPC Objects                   @LJA 07110000
RCVTMLNM EQU   X'20'                 Display of Names Restricted       +07120000
                                     by Seclabel                   @PCC 07130000
RCVTSBYS EQU   X'10'                 Seclabel By System requested  @LJA 07140000
RCVTFLG3 DS    B                     Miscellaneous flags           @LLA 07150000
RCVTDCDT EQU   X'80'                 Dynamic CDT is active         @LLA 07160000
RCVTPLC  EQU   X'40'                 Allow lower case passwords    @LMA 07170000
RCVTCFLD EQU   X'20'                 Custom Fields are in effect   @LUA 07180000
RCVTAUTU EQU   X'10'                 Authority used is available to    +07190000
                                     authorization exits           @MPA 07200000
RCVTPSC  EQU   X'08'                 Allow special chars in pwds   @MSA 07210000
RCVTXPWD EQU   X'04'                 Extended password support is      +07220000
                                     available                     @MWA 07230000
RCVTMFA  EQU   X'02'                 MFA support is available      @MZA 07240000
RCVTMAIL EQU   X'01'                 E-mail support is available   @PEC 07250000
RCVTPMIN DS    AL1                   Minimum days between password     +07260000
                                     changes                       @LMA 07270000
RCVTPALG DS    AL1                   Password/Phrase algorithm     @MTA 07280000
*                                    0 = LEGACY (DES or ICHDEX01)  @MTA 07290000
*                                    1 = KDFAES                    @MTA 07300000
RCVTPMEM DS    AL2                   Pwd algorithm memory factor   @MTA 07310000
RCVTPREP DS    AL2                   Pwd algorithm repetitions     @MTA 07320000
RCVTFLG4 DS    B                     Function availability bits    @N6A 07330000
RCVTRPFF EQU   X'80'                 R_Password fast-fail option   @0BA 07340000
*                                    (OA50748) is available        @0BA 07350000
RCVTMFA3 EQU   X'40'                 MFA 3 support                 @N6A 07360000
RCVTIDT  EQU   X'20'                 IDT support                   @N8A 07370000
RCVTEPT  EQU   X'10'                 Enhanced PassTicket support   @NAA 07380000
RCVTPHIA EQU   X'08'                 Phrase interval support       @NBA 07381000
RCVTIDT2 EQU   X'04'                 IDT 2 support                 @NDA 07381001
RCVTVABT EQU   X'02'                 Validated Boot support avail. @NCA 07381002
         DS    CL55                  Reserved                      @N6C 07381004
RCVTJSYS DS    CL8                   USER-ID from the SETROPTS command +07390000
                                     JES(NJEUSERID(user-id))       @D6C 07400000
RCVTJUND DS    CL8                   USER-ID from the SETROPTS command +07410000
                                     JES(UNDEFINEDUSER(user-id))   @D2A 07420000
RCVTTMP2 DS    A                     ADDRESS OF RDS TEMPLATES      @M5A 07430000
RCVTRCK4 DS    A                     ADDRESS OF IRRRCK04           @M5A 07440000
RCVTSVC0 DS    A                     ADDRESS OF ICHSVC00           @N3C 07450000
RCVTPTGN DS    A                     Address of PassTicket Rtn     @01C 07460000
RCVTFRX4 DS    A                     ADDRESS OF FASTAUTH POST-          07470000
*                                    PROCESSING INSTALLATION EXIT       07480000
*                                    FOR DATASPACE  (ICHRFX04)     @02A 07490000
RCVTDX11 DS    A                     ADDRESS OF ICHDEX11           @M7A 07500000
RCVTXLT0 DS    A                     ADDRESS OF IRRRXT02           @M8A 07510000
RCVTGLS6 DS    A                     ADDRESS OF ICHGLS06           @N1A 07520000
RCVTDPTB DS    A                     ADDRESS OF DYNAMIC PARSE TABLE    +07530000
                                                                   @N2A 07540000
RCVTRCK2 DS    A                     ADDRESS OF IRRRCK02           @M4A 07550000
RCVTRX10 DS    A                     Address of IRRRXT10           @M9A 07560000
RCVTRX11 DS    A                     Address of IRRRXT11           @M9A 07570000
RCVTDSPC DS    A                     Address of IRRDSP00           @M9A 07580000
RCVTFL2X DS    B                     RACF                              +07590000
                                     SETROPTS  options             @MBC 07600000
RCVTCMPM EQU   X'80'                 SETROPTS COMPATMODE      - ON @D3A 07610000
RCVTMLSF EQU   X'40'                 SETROPTS MLS FAILURES/WARNING     +07620000
                                       FAILURES if "ON"  - (1)     @D4A+07630000
                                       WARNING  if "OFF" - (0)     @D4A 07640000
RCVTMLAF EQU   X'20'                 SETROP MLACTIVE FAILURES/WARNING  +07650000
                                       FAILURES if "ON"  - (1)     @D4A+07660000
                                       WARNING  if "OFF" - (0)     @D4A 07670000
RCVTCATF EQU   X'10'                 SETROPT CATDSNS FAILURES/WARNING  +07680000
                                       FAILURES if "ON"  - (1)     @D4A+07690000
                                       WARNING  if "OFF" - (0)     @D4A 07700000
RCVTAAPL EQU   X'08'                 SETROPTS APPLAUDIT  - (1)     @MBA 07710000
RCVTNADC EQU   X'04'                 SETROPTS NOADDCREATOR             +07720000
                                     ON if NOADDCREATOR in effect  @MJA 07730000
RCVTGNOE EQU   X'02'                 SETROPTS ENHANCEDGENERICOWNER     +07740000
                                     ON if active. RCVTGNOW also ON    +07750000
                                     if RCVTGNOE is ON.            @N5A 07760000
RCVTNJEF DS    B                     NJE Flags                     @D5A 07770000
RCVTJWTO EQU   X'80'                 Flag indicating WTO has been      +07780000
                                     issued for NJE, if "ON"  - (1)    +07790000
                                                                   @D5A 07800000
RCVTVCPR DS    BL128                 Class protection option mask  @MFA 07810000
RCVTVCGE DS    BL128                 Generic profile checking mask @MFA 07820000
RCVTVCGC DS    BL128                 Generic command checking mask @MFA 07830000
RCVTVRCL DS    BL128                 CDT-anchored RACLISTed profile    +07840000
                                     mask                          @MFA 07850000
RCVTVGNL DS    BL128                 CDT-anchored GENLISTed profile    +07860000
                                     mask                          @MFA 07870000
RCVTVFPT DS    BL128                 Fastpath option mask          @MFA 07880000
RCVTVCAU DS    BL128                 Auditing option mask          @MFA 07890000
RCVTVCST DS    BL128                 Statistics option mask        @MFA 07900000
RCVTVLGA DS    BL128                 SETROPTS LOGOPTIONS ALWAYS        +07910000
                                     mask                          @MFA 07920000
RCVTVLNV DS    BL128                 SETROPTS LOGOPTIONS NEVER         +07930000
                                     mask                          @MFA 07940000
RCVTVLGS DS    BL128                 SETROPTS LOGOPTIONS SUCCESSES     +07950000
                                     mask                          @MFA 07960000
RCVTVLGF DS    BL128                 SETROPTS LOGOPTIONS FAILURES      +07970000
                                     mask                          @MFA 07980000
         DS    CL2                   Reserved                      @D5C 07990000
RCVTCDTL DS    F                     Length of a CDT entry         @D8A 08000000
RCVTIDP2 EQU   X'01'                 Identity Propagation 2             08010000
*                                    services are available        @LZA 08020000
RCVTVERN EQU   X'08'                 VERSION NUMBER VALUE:              08030000
*                                    HIGH NIBBLE IS THE VERSION NUMBER, 08040000
*                                    (0=VERSION 1), AND THE LOW NIBBLE  08050000
*                                    IS THE RELEASE NUMBER         @L8A 08060000
* TERMINATE PLS COMMENT                                              */ 08070000
         MEND                                                           08080000
*        %RCVTPLS : ;                                                   08090000
*DCL                                                                    08100000
* 1 RCVT     BASED(CVTRAC),       /* LOCATED THROUGH CVT             */ 08110000
*  2 RCVTID    CHAR(4),           /* EBCDIC ID                       */ 08120000
*  2 RCVTDCB   PTR(31),           /* PTR DCB OF RACF DATA SET        */ 08130000
*  2 RCVTDEB   PTR(31),           /* PTR DEB OF RACF DATA SET        */ 08140000
*  2 RCVTINDX  PTR(31),           /* PTR RACF RESIDENT INDEX TABLE      08150000
*                                    OR ZERO IF NO INDEX BLOCKS         08160000
*                                    RESIDENT                        */ 08170000
*  2 RCVTTEMP  PTR(31),           /* PTR RACF INCORE TEMPLATE TABLE  */ 08180000
*  2 RCVTHDR   PTR(31),           /* PTR RACF INCORE DS HEADER RECORD   08190000
*                                    OR ZERO IF RACF DATA SET IS ON     08200000
*                                    A SHARED DEVICE                 */ 08210000
*  2 RCVTRIX   PTR(31),           /* PTR RACINIT INSTALL. EXIT RTN   */ 08220000
*  2 RCVTRCX   PTR(31),           /* PTR RACCHK  INSTALL. EXIT RTN   */ 08230000
*  2 RCVTRDX   PTR(31),           /* PTR RACDEF  INSTALL. EXIT RTN   */ 08240000
*  2 RCVTRUCB  PTR(31),           /* PTR UCB OF RACF DATA SET        */ 08250000
*  2 RCVTXLEN  FIXED(31),         /* LENGTH OF INCORE INDEX RELATED     08260000
*                                    CONTROL BLOCKS                  */ 08270000
*  2 RCVTBAM   PTR(31),           /* LOCATES INCORE BAM INFORMATION  */ 08280000
*  2 RCVTISTL  PTR(31),           /* RESERVED FOR INSTALLATION       */ 08290000
*  2 RCVTDSNL  PTR(8),            /* LENGTH OF RAC DATA SET NAME     */ 08300000
*  2 RCVTSTAT  BIT(8),            /* STATUS                          */ 08310000
*   3 RCVTRNA  BIT(1),            /* RACF NOT ACTIVE                 */ 08320000
*   3 RCVTNLS  BIT(1),            /* BYPASS RACINIT STATISTICS       */ 08330000
*   3 RCVTNDSS BIT(1),            /* BYPASS DATA SET STATISTICS      */ 08340000
*   3 RCVTNTVS BIT(1),            /* NO TAPE VOLUME                     08350000
*                                    STATISTICS              @PC0022B*/ 08360000
*   3 RCVTNDVS BIT(1),            /* NO DIRECT ACCESS VOLUME            08370000
*                                    STATISTICS              @PC0022B*/ 08380000
*   3 RCVTNTMS BIT(1),            /* NO TERMINAL STATISTICS  @PC0022B*/ 08390000
*   3 RCVTNADS BIT(1),            /* NO ADSP PROTECTION          @L5A*/ 08400000
*   3 RCVTEGN  BIT(1),            /* EGN SUPPORT IN EFFECT       @M1A*/ 08410000
*  2 RCVTNREC  FIXED(15),         /* # RECORDS PER TRACK  -RACF DS   */ 08420000
*  2 RCVTDSN   CHAR(44),          /* DSN OF RACF DATA SET            */ 08430000
*  2 RCVTUADS  CHAR(44),          /* DSN OF UADS DATA SET OR ZERO    */ 08440000
*  2 RCVTUVOL  CHAR(6),           /* VOLID OF UADS DATA SET OR ZERO  */ 08450000
*  2 RCVTSTA1  BIT(8),            /*                         @PC0022B*/ 08460000
*   3 RCVTTAPE BIT(1),            /* TAPE VOLUME PROTECTION IN          08470000
*                                    EFFECT                  @PC0022B*/ 08480000
*   3 RCVTDASD BIT(1),            /* DASD VOLUME PROTECTION IN          08490000
*                                    EFFECT                  @ZA25267*/ 08500000
*   3 RCVTDGEN BIT(1),            /* GENERIC PROFILE CHECKING IN        08510000
*                                    EFFECT FOR DATASET CLASS    @L5A*/ 08520000
*   3 RCVTDGCM BIT(1),            /* GENERIC COMMAND PROCESSING IN      08530000
*                                    EFFECT FOR DATASET CLASS    @L5A*/ 08540000
*   3 RCVTRDSN BIT(1),            /* INPUT DATA SET NAME WILL BE USED   08550000
*                                    FOR LOGGING AND MESSAGES    @L6A*/ 08560000
*   3 RCVTJXAL BIT(1),            /* JES-XBMALLRACF IN EFFECT    @L6A*/ 08570000
*   3 RCVTJCHK BIT(1),            /* JES-EARLYVERIFY IN EFFECT   @L6A*/ 08580000
*   3 RCVTJALL BIT(1),            /* JES-BATCHALLRACF IN EFFECT  @L6A*/ 08590000
*  2 RCVTAUOP  BIT(8),            /* RACF AUDIT OPTIONS      @PC0022B*/ 08600000
*   3 *        BIT(1),            /* RESERVED                @PC0022B*/ 08610000
*   3 RCVTAGRO BIT(1),            /* AUDIT GROUP CLASS       @PC0022B*/ 08620000
*   3 RCVTAUSE BIT(1),            /* AUDIT USER CLASS        @PC0022B*/ 08630000
*   3 RCVTADAT BIT(1),            /* AUDIT DATASET CLASS     @PC0022B*/ 08640000
*   3 RCVTADAS BIT(1),            /* AUDIT DASDVOL CLASS     @PC0022B*/ 08650000
*   3 RCVTATAP BIT(1),            /* AUDIT TAPEVOL CLASS     @PC0022B*/ 08660000
*   3 RCVTATER BIT(1),            /* AUDIT TERMINAL CLASS    @PC0022B*/ 08670000
*   3 RCVTAOPR BIT(1),            /* AUDIT OPERATIONS ATTRIBUTE  @L7A*/ 08680000
*  2 RCVTAXTA  BIT(8),            /* RESERVED                @PC0022B*/ 08690000
*  2 RCVTFLGS  BIT(8),            /* STATUS FLAGS            @PC0022B*/ 08700000
*   3 RCVTROFF BIT(1),            /* RACF HAS BEEN DEACTIVATED BY THE   08710000
*                                    RVARY COMMAND           @PC0022B*/ 08720000
*   3 RCVTRDHD BIT(1),            /* RACF HAS BEEN RE-ACTIVATED         08730000
*                                    BY RVARY AND REFRESH OF THE        08740000
*                                    RESIDENT ICB IS NECESSARY          08750000
*                                                            @PC0022B*/ 08760000
*   3 RCVTSHR  BIT(1),            /* THE RACF DATA SET AT SOME POINT    08770000
*                                    DURING THIS IPL, WAS ON A SHARED   08780000
*                                    DASD DEVICE             @PC0022B*/ 08790000
*   3 RCVTNDUP BIT(1),            /* NO DUPLICATE DATA SET NAMES        08800000
*                                    TO BE DEFINED           @PM44287*/ 08810000
*   3 RCVT24MD BIT(1),            /* AT LEAST ONE INSTALLATION EXIT     08820000
*                                    HAS AMODE=24                @L7A*/ 08830000
*   3 RCVTRMSG BIT(1),            /* RACF MESSAGE ICH412I WAS           08840000
*                                    ISSUED                      @L7A*/ 08850000
*   3 RCVTWUID BIT(1),            /* RACF WORK UNIT IDENTITY SUPPORT    08860000
*                                    EXISTS.                 @YA32826*/ 08870000
*   3 RCVTGLBL BIT(1),            /* GLOBAL=YES SUPPORT EXISTS   @MCC*/ 08880000
*  2 RCVTEROP  BIT(8),            /* RACF TERMINAL OPTIONS   @PC0022B*/ 08890000
*   3 RCVTTERP BIT(1),            /* TERMINAL AUTHORIZATION             08900000
*                                    CHECKING                @PC0022B*/ 08910000
*   3 RCVTTUAC BIT(1),            /* DEFAULT UACC FOR TERMINALS NOT     08920000
*                                    DEFINED TO RACF.                   08930000
*                                    IF ON  - UACC = NONE,              08940000
*                                    IF OFF - UACC = READ    @PC0022B*/ 08950000
*   3 RCVTAVIO BIT(1),            /* DO NOT CREATE LOG RECORD FOR       08960000
*                                    COMMAND VIOLATIONS ONLY            08970000
*                                                            @PC0022B*/ 08980000
*   3 RCVTSAUD BIT(1),            /* DO NOT AUDIT SPECIAL USER          08990000
*                                                            @PC0022B*/ 09000000
*   3 *        BIT(4),            /* RESERVED                @PC0022B*/ 09010000
*  2 RCVTPINV  PTR(8),            /* GLOBAL MAX PASSWORD INTERVAL       09020000
*                                    VALUE - VALID RANGE 1-254          09030000
*                                                            @PC0022B*/ 09040000
*  2 RCVTRAU0  PTR(31),           /* PTR TO AUDITING MODULE  @PC0022B*/ 09050000
*  2 RCVTRIXP  PTR(31),           /* PTR TO RACINIT POST PROCESSING     09060000
*                                    INSTALLATION EXIT       @PC0022B*/ 09070000
*  2 RCVTRCXP  PTR(31),           /* PTR TO RACCHK POST PROCESSING      09080000
*                                    INSTALLATION EXIT       @PC0022B*/ 09090000
*  2 RCVTRID0  PTR(31),           /* PTR TO MSC VERIFY RTN   @PC0022B*/ 09100000
*  2 RCVTVERS  PTR(8),            /* VERSION INDICATOR:                 09110000
*                                    HIGH NIBBLE IS THE VERSION NUMBER, 09120000
*                                    (0=VERSION 1), AND THE LOW NIBBLE  09130000
*                                    IS THE RELEASE NUMBER              09140000
*                                    0 - VERSION 1 RELEASE 1,           09150000
*                                    1 - VERSION 1 RELEASE 2,           09160000
*                                    2 - VERSION 1 RELEASE 3,           09170000
*                                    4 - VERSION 1 RELEASE 4,           09180000
*                                    5 - VERSION 1 RELEASE 5            09190000
*                                    6 - VERSION 1 RELEASE 6            09200000
*                                    7 - VERSION 1 RELEASE 7            09210000
*                                    8 - VERSION 1 RELEASE 8            09220000
*                                    OR HIGHER (SEE FIELD RCVTVRMN      09230000
*                                    FOR ACTUAL VERSION AND             09240000
*                                    RELEASE NUMBER)             @03A*/ 09250000
*   3 RCVTVRN  BIT(4),            /* VERSION NUMBER IN HIGH NIBBLE      09260000
*                                                                @L8A*/ 09270000
*   3 RCVTRELS BIT(4),            /* RELEASE NUMBER IN LOW NIBBLE       09280000
*                                                                @L8A*/ 09290000
*  2 RCVTEXTA  CHAR(3),           /* RESERVED                @ZA25840*/ 09300000
*  2 RCVTAPTR  PTR(31),           /* ADDRESS FIELD RESERVED FOR         09310000
*                                    APPLICATION USE         @PC003PY*/ 09320000
*  2 RCVTNCX   PTR(31),           /* PTR NAMING CONVENTION EXIT         09330000
*                                                            @ZA25840*/ 09340000
*  2 RCVTNCDX  PTR(31),           /* PTR NAMING CONVENTION EXIT FOR     09350000
*                                    DELETE FUNCTION         @ZA25840*/ 09360000
*  2 RCVTCDTP  PTR(31),           /* PTR TO CLASS DESC TABLE (Static    09370000
*                                    classes only                @LLC*/ 09380000
*  2 RCVTREXP  PTR(31),           /* PTR TO RACSTAT MODULE   @PC003PY*/ 09390000
*  2 RCVTFRCP  PTR(31),           /* PTR TO FRACHECK MODULE  @PC003PY*/ 09400000
*  2 RCVTFRXP  PTR(31),           /* PTR TO FRACHECK EXIT    @PC003PY*/ 09410000
*  2 RCVTRLX   PTR(31),           /* PTR TO RACLIST PRE-EXIT @PC003PY*/ 09420000
*  2 RCVTRLXP  PTR(31),           /* PTR TO RACLIST SELECTION EXIT      09430000
*                                                            @PC003PY*/ 09440000
*  2 RCVTDATP  PTR(31),           /* PTR TO 4 BYTE DATE CONVERSION      09450000
*                                    ROUTINE                     @P8A*/ 09460000
*  2 RCVTENVP  PTR(31),           /* PTR TO ENVIRONMENT SERVICE         09470000
*                                    ROUTINE (IRRENS00)          @LCA*/ 09480000
*  2 RCVTEIMR  PTR(31),           /* PTR to EIM Registry name    @LHC*/ 09490000
*  2 RCVTDSDT  PTR(31),           /* PTR TO DATA SET DESCRIPTOR         09500000
*                                    TABLE                   @PC0036U*/ 09510000
*  2 RCVTRNGP  PTR(31),           /* PTR TO RANGE TABLE      @PC0036U*/ 09520000
*  2 RCVTAUTP  PTR(31),           /* PTR TO RACF AUTHORIZED CALLER      09530000
*                                    TABLE ICHAUTAB              @L1A*/ 09540000
*  2 RCVTPWDX  PTR(31),           /* PTR TO RACF PASSWORD EXIT.  @L4A*/ 09550000
*  2 RCVTHIST  FIXED(8),          /* NUMBER OF PASSWORD GENERATIONS     09560000
*                                    TO MAINTAIN AND CHECK AGAINST.     09570000
*                                                                @L4A*/ 09580000
*  2 RCVTRVOK  FIXED(8),          /* NUMBER OF CONSECUTIVE              09590000
*                                    UNSUCCESSFUL ATTEMPTS BEFORE       09600000
*                                    REVOKING A USERID.          @L4A*/ 09610000
*  2 RCVTWARN  FIXED(8),          /* PASSWORD WARNING VALUE.     @L4A*/ 09620000
*  2 RCVTINAC  FIXED(8),          /* INACTIVATE INTERVAL.        @L4A*/ 09630000
*  2 RCVTSNTX(8),                 /* PASSWORD SYNTAX RULES.      @L4A*/ 09640000
*    3 RCVTSLEN FIXED(8),         /* STARTING LENGTH VALUE.      @L4A*/ 09650000
*    3 RCVTELEN FIXED(8),         /* ENDING LENGTH VALUE.        @L4A*/ 09660000
*    3 RCVTRULS,                  /* CONTENT RULES.              @L4A*/ 09670000
*      4 RCVTRUL1 CHAR(1),        /* CONTENT RULE.               @L4A*/ 09680000
*      4 RCVTRUL2 CHAR(1),        /* CONTENT RULE.               @L4A*/ 09690000
*      4 RCVTRUL3 CHAR(1),        /* CONTENT RULE.               @L4A*/ 09700000
*      4 RCVTRUL4 CHAR(1),        /* CONTENT RULE.               @L4A*/ 09710000
*      4 RCVTRUL5 CHAR(1),        /* CONTENT RULE.               @L4A*/ 09720000
*      4 RCVTRUL6 CHAR(1),        /* CONTENT RULE.               @L4A*/ 09730000
*      4 RCVTRUL7 CHAR(1),        /* CONTENT RULE.               @L4A*/ 09740000
*      4 RCVTRUL8 CHAR(1),        /* CONTENT RULE.               @L4A*/ 09750000
*  2 RCVTMDEL,                    /* MODEL OPTIONS.              @L4A*/ 09760000
*   3 * BIT(8),                   /* OPTIONS.                    @L4A*/ 09770000
*    4 RCVTMGDG BIT(1),           /* MODEL-GDG IN EFFECT.        @L4A*/ 09780000
*    4 RCVTMUSR BIT(1),           /* MODEL-USER IN EFFECT.       @L4A*/ 09790000
*    4 RCVTMGRP BIT(1),           /* MODEL-GROUP IN EFFECT.      @L4A*/ 09800000
*    4 *        BIT(5),           /* RESERVED.                   @P4A*/ 09810000
*   3 * BIT(8),                   /* RESERVED.                   @L4A*/ 09820000
*   3 * BIT(8),                   /* RESERVED.                   @L4A*/ 09830000
*   3 * BIT(8),                   /* RESERVED.                   @L4A*/ 09840000
*  2 RCVTWCNT BIT(8),             /* NUMBER OF VSL ENTRIES   @YA13514*/ 09850000
*  2 RCVTOPTX  BIT(8),            /* OPTIONS.                    @L4A*/ 09860000
*   3 RCVTLGRP BIT(1),            /* LIST-OF-GRPS CHKING ACTIVE. @L4A*/ 09870000
*   3 *        BIT(7),            /* RESERVED                    @P4A*/ 09880000
*  2 RCVTALIS FIXED(8),           /* IDMAP2 staging byte, X SECURITY    09890000
*                                    Model Identity Interoperability */ 09900000
*                                 /* 0=stage0, not active, only         09910000
*                                      alias mapping profiles        */ 09920000
*                                 /* 1=stage1, active, maintain alias   09930000
*                                      index, but also maintain and     09940000
*                                      USE the mapping profiles      */ 09950000
*                                 /* 2=stage2, active, maintain and     09960000
*                                      USE alias index, but still       09970000
*                                      maintain mapping profiles     */ 09980000
*                                 /* 3=stage3, active, maintain and     09990000
*                                      USE alias index (mapping         10000000
*                                    profiles have been removed) @LAA*/ 10010000
*  2 *        CHAR(1),            /* RESERVED.                   @LAC*/ 10020000
*  2 RCVTFRX3 PTR(31),            /* EXTENDED FRACHECK EXIT ADDR @D7A*/ 10030000
*  2 RCVTVSL(4) CHAR(8) BDY(DWORD), /* VSL ENTRIES           @YA13514*/ 10040000
*  2 RCVTCGSN  FIXED(31),         /* NUMBER OF CONNECT-REMOVE           10050000
*                                    COMMANDS ISSUED THAT               10060000
*                                    ALTERED A USER'S AUTHORITY. @L4A*/ 10070000
*  2 RCVTDNL   FIXED(16),         /* Maximum length of distributed      10080000
*                                    user ID                     @LVA*/ 10090000
*  2 RCVTRL    FIXED(16),         /* Maximum length of registry         10100000
*                                    name                        @LVA*/ 10110000
*  2 RCVTIDPV  FIXED(8),          /* 1=Identity Propagation 2           10120000
*                                      services are available           10130000
*                                      on the system             @LZA*/ 10140000
*  2 *         CHAR(3),           /* Reserved.                   @LZC*/ 10150000
*  2 RCVTRDXP  PTR(31),           /* PTR TO RACDEF POST PROCESSING      10160000
*                                    INSTALLATION EXIT- ICHRDX02 @L5A*/ 10170000
*  2 RCVTFPB   PTR(31),           /* BASE FOR FASTPATH TABLE.    @L5A*/ 10180000
*  2 RCVTRCVI  PTR(31),           /* Address of RCVI             @LQC*/ 10190000
*  2 RCVTFLG1  BIT(32),           /* MISC. OPTIONS.              @L5A*/ 10200000
*    3 RCVTFPDS BIT(1),           /* FASTPATH FOR DATASET CLASS  @L5A*/ 10210000
*    3 RCVTTDSN BIT(1),           /* TAPE DATA SET PROTECTION IN        10220000
*                                    EFFECT                      @L7A*/ 10230000
*    3 *        BIT(6),           /* RESERVED.                   @L7A*/ 10240000
*    3 RCVTPRO  BIT(1),           /* PROTECT-ALL IN EFFECT              10250000
*                                                                @L7A*/ 10260000
*    3 RCVTPROF BIT(1),           /* 1 - PROTECT-ALL WARNING IN EFFECT  10270000
*                                    0 - PROTECT-ALL FAILURE IN EFFECT  10280000
*                                    (THIS FLAG IS IGNORED IF           10290000
*                                     RCVTPRO HAS A VALUE OF'0'B)       10300000
*                                                                @L7A*/ 10310000
*    3 RCVTEOS  BIT(1),           /* ERASE-ON-SCRATCH IN EFFECT  @L7A*/ 10320000
*    3 RCVTEOSL BIT(1),           /* ERASE-ON-SCRATCH BY SECLEVEL       10330000
*                                    IN EFFECT                          10340000
*                                    (THIS FLAG IS IGNORED IF           10350000
*                                     RCVTEOS HAS A VALUE OF'0'B)       10360000
*                                                                @L7A*/ 10370000
*    3 RCVTEOSA BIT(1),           /* ERASE-ON-SCRATCH FOR ALL DATASETS  10380000
*                                    IN EFFECT (THIS FLAG IGNORED IF    10390000
*                                    RCVTEOS HAS A VALUE OF '0'B)       10400000
*                                                                @L7A*/ 10410000
*    3 *        BIT(3),           /* RESERVED.                   @L7A*/ 10420000
*    3 RCVTPROG BIT(1),           /* ACCESS CONTROL BY PROGRAM IN       10430000
*                                    EFFECT                      @L7A*/ 10440000
*    3 *        BIT(15),          /* RESERVED.                   @L7A*/ 10450000
*  2 RCVTRTPD  FIXED(16),         /* SYSTEM SECURITY RETENTION          10460000
*                                    PERIOD                      @L8A*/ 10470000
*  2 RCVTSLVL  FIXED(8),          /* SECURITY LEVEL FOR ERASE-ON-       10480000
*                                    SCRATCH                     @L7A*/ 10490000
*  2 RCVTQLLN  FIXED(8),          /* LENGTH OF SINGLE LEVEL DATASET     10500000
*                                    NAME PREFIX                 @L5A*/ 10510000
*  2 RCVTQUAL  CHAR(9),           /* INSTALLATION CONTROLLED PREFIX     10520000
*                                    FOR SINGLE LEVEL DATASET NAMES,    10530000
*                                    PLUS PERIOD FOR LEVEL       @L5A*/ 10540000
*  2 RCVTSLAU  FIXED(8),          /* SECLEVEL TO AUDIT           @L8A*/ 10550000
*  2 RCVTMFLG  BIT(8),            /* MISCELLANEOUS FLAGS         @P4A*/ 10560000
*    3 RCVTVRMF BIT(1),           /* RACF VERSION, RELEASE, AND         10570000
*                                    MODIFICATION FLAG FOR THE ICQ      10580000
*                                    (TSO) SUPPORT IN 1.8.1      @P4A*/ 10590000
*    3 RCVT310U BIT(1),           /* RUNNING MVS/SP 3.1.0 OR UP  @M4A*/ 10600000
*    3 RCVTXMFR BIT(1),           /* EXTENDED FASTAUTH AVAILABLE @D7A*/ 10610000
*    3 RCVTDYNL BIT(1),           /* SUPPORT FOR DYNAMIC LNKLST IS      10620000
*                                    PROVIDED BY THIS SECURITY          10630000
*                                    PRODUCT.                    @P7A*/ 10640000
*    3 RCVTD4OK BIT(1),           /* DATE CONVERSION ROUTINE IS         10650000
*                                    AVAILABLE                   @P8A*/ 10660000
*    3 RCVTXRCO BIT(1),           /* EXTENDED ENVRIN AVAILABLE   @04A*/ 10670000
*    3 RCVT4INF BIT(1),           /* SUPPORT FOR FOUR BYTE DATES        10680000
*                                    ON PROGRAMMING INTERFACES          10690000
*                                    IS AVAILABLE                @06A*/ 10700000
*    3 RCVTTLPS BIT(1),           /* Task level ACEE support available  10710000
*                                    for callable services.      @D9A*/ 10720000
*  2 RCVTMFL1  BIT(8),            /* MORE MISCELLANEOUS FLAGS    @07C*/ 10730000
*    3 RCVTXUSP BIT(1),           /* Extended INITUSP support           10740000
*                                    available                   @07A*/ 10750000
*    3 RCVTXFAR BIT(1),           /* FASTAUTH ENVRIN/SETROPTS           10760000
*                                    RACLIST support available   @09A*/ 10770000
*    3 RCVTENVS BIT(1),           /* Environment service (IRRENS00)     10780000
*                                    available                   @LCA*/ 10790000
*    3 RCVTX500 BIT(1),           /* X500NAME support available  @L9C*/ 10800000
*    3 RCVTPSEN BIT(1),           /* PGMSECURITY OPTION                 10810000
*                                    0 - BASIC    1 - ENHANCED   @LGC*/ 10820000
*    3 RCVTPSWR BIT(1),           /* PGMSECURITY ENHANCED               10830000
*                                    0 - FAILURE  1 - WARNING    @LGA*/ 10840000
*    3 RCVTLPAP BIT(1),           /* RACF REQ=FAE ATTCH1ST required     10850000
*                                    for LPA                            10860000
*                                    0 - no       1 - YES        @LGA*/ 10870000
*    3 RCVTFGSG BIT(1),           /* FILE.GROUPOWNER.SETGID exists      10880000
*                                                                @DAC*/ 10890000
*  2 RCVTSPT   PTR(31),           /* POINTER TO THE STARTED PROCEDURES  10900000
*                                    TABLE (ICHRIN03)            @L6A*/ 10910000
*  2 RCVTDESX  PTR(31),           /* POINTER TO THE PASSWORD            10920000
*                                    ENCRYPTION INSTALLATION EXIT       10930000
*                                    (ICHDEX01)                  @L6A*/ 10940000
*  2 RCVTNTAB  PTR(31),           /* POINTER TO THE NAMING CONVENTION   10950000
*                                    TABLE (ICHNCV00)            @L6A*/ 10960000
*  2 RCVTNRTN  PTR(31),           /* POINTER TO THE NAMING CONVENTION   10970000
*                                    ROUTINE (ICHNRT00)          @L6A*/ 10980000
*  2 RCVTFRX2  PTR(31),           /* ADDRESS OF THE FRACHECK POST-      10990000
*                                    PROCESSING INSTALLATION EXIT       11000000
*                                    (ICHRFX02)                  @L6A*/ 11010000
*  2 RCVTPROB,                    /* ADDRESSES OF CONTROLLED PROGRAMS   11020000
*                                    LIST  ANCHOR BLOCKS         @L7A*/ 11030000
*    3 RCVTCISP PTR(31),          /* ADDRESS OF CURRENT ANCHOR FOR      11040000
*                                    CONTROLLED PROGRAMS LIST    @L7A*/ 11050000
*    3 RCVTOISP PTR(31),          /* ADDRESS OF OLD ANCHOR FOR          11060000
*                                    CONTROLLED PROGRAMS LIST    @L7A*/ 11070000
*  2 RCVTSWPW  CHAR(8),           /* PASSWORD FOR RVARY SWITCH          11080000
*                                                                @L7A*/ 11090000
*  2 RCVTINPW  CHAR(8),           /* PASSWORD FOR RVARY STATUS          11100000
*                                                                @L7A*/ 11110000
*  2 RCVTLARP  PTR(31),           /* PTR TO LINKAGE ASSIST ROUTINE      11120000
*                                    FOR INSTAL EXITS (ICHLAR00) @L7A*/ 11130000
*  2 RCVTCTV0  PTR(31),           /* ADDRESS OF TVTOC UTILITY           11140000
*                                    (ICHCTV00)                  @L7A*/ 11150000
*  2 RCVTPNL0  PTR(31),           /* POINTER TO PROFILE NAME LIST       11160000
*                                    ROUTINE                     @L8A*/ 11170000
*  2 RCVTSKGN  PTR(31),           /* Pointer to session key rtn  @05A*/ 11180000
*  2 RCVTPTEV  PTR(31),           /* Pointer to Passticket evaluation   11190000
*                                     routine                    @LNA*/ 11200000
*  2 RCVTPHRX  PTR(31),           /* Address of new pass phrase exit    11210000
*                                    ICHPWX11                    @LPA*/ 11220000
*  2 RCVTGENT  PTR(31),           /* Address of generic name translate  11230000
*                                    routine IRRGNT00            @LWA*/ 11240000
*  2 RCVTGANC  PTR(31),           /* Address of GENERICANCHOR keyword   11250000
*                                    settings                    @LXA*/ 11260000
*  2 RCVTLNOD  CHAR(8),           /* RRSF local node name. Binary       11270000
*                                    zeros if never set. Name persists  11280000
*                                    if node is deleted.         @MUA*/ 11290000
*  2 RCVTMXPW  PTR(31),           /* Address of enhanced password       11300000
*                                    routine IRRMXPW0            @MVA*/ 11310000
*  2 RCVTPHIN  FIXED(16),         /* Password phrase interval    @NBA*/ 11320000
*  2 *         CHAR(94),          /* Reserved.                   @NBC*/ 11320001
*  2 RCVTGLS1  PTR(31),           /* ADDRESS OF GENLIST DELETE          11330000
*                                    ROUTINE (ICHGLS01)          @L8A*/ 11340000
*  2 RCVTRCVX  PTR(31),           /* ADDRESS OF RCVT EXTENSION AREA     11350000
*                                                                @L8A*/ 11360000
*  2 RCVTLAR2  PTR(31),           /* ADDRESS OF ICHLAR02         @L8A*/ 11370000
*  2 RCVTFLT0  PTR(31),           /* ADDRESS OF IRRFLT00         @P2A*/ 11380000
*  2 RCVTFLT1  PTR(31),           /* ADDRESS OF IRRFLT01         @P2A*/ 11390000
*  2 RCVTVRMN  CHAR(4),           /* Contains "7791" starting with      11400000
*                                    z/OS V2R2. To determine the        11410000
*                                    release level, use fields in       11420000
*                                    the MVS CVT.                @0AC*/ 11430000
*  2 RCVTVMSP FIXED(31),          /* ICB SYNC COUNT VM 370       @M2A*/ 11440000
*  2 RCVTVMXA FIXED(31),          /* ICB SYNC COUNT VM XA        @M2A*/ 11450000
*  2 RCVTFLG2  BIT(8),            /* RACF 1.9.0  SETROPTS  OPTIONS      11460000
*                                                                @M3A*/ 11470000
*    3 RCVTSLCL BIT(1),           /* SETROPTS SECLABELCONTROL -         11480000
*                                    ON if active                @M3A*/ 11490000
*    3 RCVTCATD BIT(1),           /* SETROPTS CATDSNS         -         11500000
*                                    ON if active                @M3A*/ 11510000
*    3 RCVTMLQT BIT(1),           /* SETROPTS MLQUIET         -         11520000
*                                    ON if active                @M3A*/ 11530000
*    3 RCVTMLST BIT(1),           /* SETROPTS MLSTABLE        -         11540000
*                                    ON if active                @M3A*/ 11550000
*    3 RCVTMLS  BIT(1),           /* SETROPTS MLS             -         11560000
*                                    ON if active                @M3A*/ 11570000
*    3 RCVTMLAC BIT(1),           /* SETROPTS MLACTIVE        -         11580000
*                                    ON if active                @M3A*/ 11590000
*    3 RCVTGNOW BIT(1),           /* SETROPTS GENERICOWNER    -         11600000
*                                    ON if active                @M3A*/ 11610000
*    3 RCVTAUSL BIT(1),           /* SETROPTS SECLABELAUDIT   -         11620000
*                                    ON if active                @M3A*/ 11630000
*  2 RCVTLOGD BIT(8),             /* LOGOPTIONS FOR DATASET      @D1A*/ 11640000
*    3 RCVTDLGA BIT(1),           /* LOGOPTIONS "ALWAYS" FOR THE        11650000
*                                    DATASET CLASS               @D1A*/ 11660000
*    3 RCVTDLGN BIT(1),           /* LOGOPTIONS "NEVER" FOR THE         11670000
*                                    DATASET CLASS               @D1A*/ 11680000
*    3 RCVTDLGS BIT(1),           /* LOGOPTIONS "SUCCESSES" FOR THE     11690000
*                                    DATASET CLASS               @D1A*/ 11700000
*    3 RCVTDLGF BIT(1),           /* LOGOPTIONS "FAILURES" FOR THE      11710000
*                                    DATASET CLASS               @D1A*/ 11720000
*   3 *        BIT(4),            /* RESERVED                    @D1C*/ 11730000
*  2 RCVTSINT  FIXED(15),         /* LU Session Interval         @N4A*/ 11740000
*  2 RCVTML2F  BIT(8),            /* SETROPTS options for RACF          11750000
*                                    z/OS Multi Level Security          11760000
*                                    support                     @LJA*/ 11770000
*    3 RCVTMLFS BIT(1),           /* Seclabels required for             11780000
*                                    File System Objects         @LJA*/ 11790000
*    3 RCVTMLIP BIT(1),           /* Seclabels required for             11800000
*                                    IPC Objects                 @LJA*/ 11810000
*    3 RCVTMLNM BIT(1),           /* Display of Names Restricted        11820000
*                                    by Seclabel                 @LJA*/ 11830000
*    3 RCVTSBYS BIT(1),           /* Seclabel By System requested       11840000
*                                                                @LJA*/ 11850000
*    3 *        BIT(4),           /* Reserved                    @LJA*/ 11860000
*  2 RCVTFLG3  BIT(8),            /* Miscellaneous flags         @LLA*/ 11870000
*    3 RCVTDCDT BIT(1),           /* Dynamic CDT is active       @LLA*/ 11880000
*    3 RCVTPLC  BIT(1),           /* Allow lower case passwords  @LMA*/ 11890000
*    3 RCVTCFLD BIT(1),           /* Custom Fields are in effect @LUA*/ 11900000
*    3 RCVTAUTU BIT(1),           /* Authority used is available to     11910000
*                                    authorization exits         @MPA*/ 11920000
*    3 RCVTPSC  BIT(1),           /* Allow special chars in pwds @MSA*/ 11930000
*    3 RCVTXPWD BIT(1),           /* Extended password support is       11940000
*                                    available                   @MWA*/ 11950000
*    3 RCVTMFA  BIT(1),           /* MFA support is available    @MZA*/ 11960000
*    3 RCVTMAIL BIT(1),           /* E-mail support is available @PEA*/ 11970000
*  2 RCVTPMIN  FIXED(8),          /* Minimum days between password      11980000
*                                    Changes                     @LMA*/ 11990000
*  2 RCVTPALG  FIXED(8),          /* Password/Phrase algorithm   @MTA*/ 12000000
*                                 /* 0 = LEGACY (DES or ICHDEX01)@MTA*/ 12010000
*                                 /* 1 = KDFAES                  @MTA*/ 12020000
*  2 RCVTPMEM  FIXED(16),         /* Pwd algorithm memory factor @MTA*/ 12030000
*  2 RCVTPREP  FIXED(16),         /* Pwd algorithm repetitions   @MTA*/ 12040000
*  2 RCVTFLG4  BIT(8),            /* Function availability bits  @N6A*/ 12050000
*    3 RCVTRPFF BIT(1),           /* R_Password fast-fail option        12060000
*                                    (OA50748) is available      @0BA*/ 12070000
*    3 RCVTMFA3 BIT(1),           /* MFA 3                       @N6A*/ 12080000
*    3 RCVTIDT  BIT(1),           /* IDT                         @N8A*/ 12090000
*    3 RCVTEPT  BIT(1),           /* Enhanced PassTicket         @NAA*/ 12100000
*    3 RCVTPHIA BIT(1),           /* Phrase interval             @NBA*/ 12101000
*    3 RCVTIDT2 BIT(1),           /* IDT 2                       @NDA*/ 12101001
*    3 RCVTVABT BIT(1),           /* Validated Boot support available   12101002
*                                                                @NCA*/ 12101003
*  2 *         CHAR(55),          /* Reserved                    @N6C*/ 12101004
*  2 RCVTJSYS  CHAR(8),           /* USER-ID from the SETROPTS command  12110000
*                                    JES(NJEUSERID(user-id))     @D6C*/ 12120000
*  2 RCVTJUND  CHAR(8),           /* USER-ID from the SETROPTS command  12130000
*                                    JES(UNDEFINEDUSER(user-id)) @D2A*/ 12140000
*  2 RCVTTMP2  PTR(31),           /* ADDRESS OF RDS TEMPLATES    @M5A*/ 12150000
*  2 RCVTRCK4  PTR(31),           /* ADDRESS OF IRRRCK04         @M5A*/ 12160000
*  2 RCVTSVC0  PTR(31),           /* ADDRESS OF ICHSVC00         @N3C*/ 12170000
*  2 RCVTPTGN  PTR(31),           /* Address of PassTicket Rtn   @01C*/ 12180000
*  2 RCVTFRX4  PTR(31),           /* ADDRESS OF THE FASTAUTH POST-      12190000
*                                    PROCESSING INSTALLATION EXIT       12200000
*                                    FOR DATASPACE  (ICHRFX04)   @02A*/ 12210000
*  2 RCVTDX11  PTR(31),           /* ADDRESS OF ICHDEX11         @M7A*/ 12220000
*  2 RCVTXLT0  PTR(31),           /* ADDRESS OF IRRRXT02         @M8C*/ 12230000
*  2 RCVTGLS6  PTR(31),           /* ADDRESS OF ICHGLS06         @N1A*/ 12240000
*  2 RCVTDPTB  PTR(31),           /* ADDRESS OF DYNAMIC PARSE TABLE     12250000
*                                                                @N2A*/ 12260000
*  2 RCVTRCK2  PTR(31),           /* ADDRESS OF IRRRCK02         @M4A*/ 12270000
*  2 RCVTRX10  PTR(31),           /* Address of IRRRXT10         @M9A*/ 12280000
*  2 RCVTRX11  PTR(31),           /* Address of IRRRXT11         @M9A*/ 12290000
*  2 RCVTDSPC  PTR(31),           /* Address of IRRDSP00         @M9A*/ 12300000
*  2 RCVTFL2X  BIT(8),            /* RACF                               12310000
*                                    SETROPTS  options           @MBC*/ 12320000
*    3 RCVTCMPM BIT(1),           /* SETROPTS COMPATMODE      -         12330000
*                                    ON if active                @D3A*/ 12340000
*    3 RCVTMLSF BIT(1),           /* SETROPTS MLS FAILURES/WARNING      12350000
*                                    - FAILURES if "ON"  - (1)          12360000
*                                    - WARNING  if "OFF" - (0)   @D4A*/ 12370000
*    3 RCVTMLAF BIT(1),           /* SETROP MLACTIVE FAILURES/WARNING   12380000
*                                    - FAILURES if "ON"  - (1)          12390000
*                                    - WARNING  if "OFF" - (0)   @D4A*/ 12400000
*    3 RCVTCATF BIT(1),           /* SETROPT CATDSNS FAILURES/WARNING   12410000
*                                    - FAILURES if "ON"  - (1)          12420000
*                                    - WARNING  if "OFF" - (0)   @D4A*/ 12430000
*    3 RCVTAAPL BIT(1),           /*SETROPTS APPLAUDIT                  12440000
*                                    ON if active                @MBA*/ 12450000
*    3 RCVTNADC BIT(1),           /* SETROPTS NOADDCREATOR - ON         12460000
*                                    if NOADDCREATOR in effect   @MJA*/ 12470000
*    3 RCVTGNOE BIT(1),           /* SETROPTS ENHANCEDGENERICOWNER - ON 12480000
*                                    if active. RCVTGNOW also ON        12490000
*                                    if RCVTGNOE is ON.          @N5A*/ 12500000
*    3 * BIT(1),                  /* Reserved                    @N5C*/ 12510000
*  2 RCVTNJEF  BIT(8),            /* NJE Flags                   @D5A*/ 12520000
*    3 RCVTJWTO BIT(1),           /* Flag indicating WTO has been       12530000
*                                    issued for NJE, if "ON"  - (1)     12540000
*                                                                @D5A*/ 12550000
*    3 * BIT(7),                  /* Reserved                    @D5A*/ 12560000
*  2 RCVTVCPR BIT(1024),          /* Class protection mask       @MFA*/ 12570000
*  2 RCVTVCGE BIT(1024),          /* Generic profile checking mask      12580000
*                                                                @MFA*/ 12590000
*  2 RCVTVCGC BIT(1024),          /* Generic command checking mask      12600000
*                                                                @MFA*/ 12610000
*  2 RCVTVRCL BIT(1024),          /* CDT-anchored RACLISTed profile     12620000
*                                    mask                        @MFA*/ 12630000
*  2 RCVTVGNL BIT(1024),          /* CDT-anchored GENLISTed profile     12640000
*                                    mask                        @MFA*/ 12650000
*  2 RCVTVFPT BIT(1024),          /* Fastpath option mask        @MFA*/ 12660000
*  2 RCVTVCAU BIT(1024),          /* Auditing option mask        @MFA*/ 12670000
*  2 RCVTVCST BIT(1024),          /* Statistics option mask      @MFA*/ 12680000
*  2 RCVTVLGA BIT(1024),          /* SETROPTS LOGOPTIONS ALWAYS         12690000
*                                    mask                        @MFA*/ 12700000
*  2 RCVTVLNV BIT(1024),          /* SETROPTS LOGOPTIONS NEVER          12710000
*                                    mask                        @MFA*/ 12720000
*  2 RCVTVLGS BIT(1024),          /* SETROPTS LOGOPTIONS SUCCESSES      12730000
*                                    mask                        @MFA*/ 12740000
*  2 RCVTVLGF BIT(1024),          /* SETROPTS LOGOPTIONS FAILURES       12750000
*                                    mask                        @MFA*/ 12760000
*  2 * CHAR(2),                   /* Reserved                    @D5C*/ 12770000
*  2 RCVTCDTL FIXED(32),          /* Length of a CDT entry       @D8A*/ 12780000
*  2 *         CHAR(0);           /* END OF RCVT             @PC0036U*/ 12790000
*                                                                       12800000
*DCL                                                                    12810000
*  RCVTVERN CONSTANT(8) PTR(8);   /* VERSION NUMBER VALUE:              12820000
*                                    HIGH NIBBLE IS THE VERSION NUMBER, 12830000
*                                    (0=VERSION 1), AND THE LOW NIBBLE  12840000
*                                    IS THE RELEASE NUMBER       @L8A*/ 12850000
*DCL                                                                    12860000
*  RCVTVRMC CHAR(4)               /* RACF VERSION, RELEASE,      @M3C*/ 12870000
*           CONSTANT('77D0');     /* AND MODIFICATION NUMBER     @N9C*/ 12880000
*                                                                       12890000
*DCL                                                                    12900000
*  RCVTVR81 CHAR(4)                                                     12910000
*           CONSTANT('1081'),     /* indicates RACF 1.8.1        @P6A*/ 12920000
*  RCVTVR19 CHAR(4)                                                     12930000
*           CONSTANT('1090'),     /* indicates RACF 1.9.0        @P6A*/ 12940000
*  RCVTVR92 CHAR(4)                                                     12950000
*           CONSTANT('1092'),     /* indicates RACF 1.9.2        @P6A*/ 12960000
*  RCVTVR21 CHAR(4)                                                     12970000
*           CONSTANT('2010'),     /* indicates RACF 2.1.0        @MEC*/ 12980000
*  RCVTVR22 CHAR(4)                                                     12990000
*           CONSTANT('2020'),     /* indicates ver/mod level     @MEA*/ 13000000
*  RCVTVR23 CHAR(4)                                                     13010000
*           CONSTANT('2030'),     /* indicates ver/mod level     @MHA*/ 13020000
*  RCVTVR24 CHAR(4)                                                     13030000
*           CONSTANT('2040'),     /* indicates ver/mod level     @MKA*/ 13040000
*  RCVTVR26 CHAR(4)                                                     13050000
*           CONSTANT('2060'),     /* indicates ver/mod level     @MMA*/ 13060000
*  RCVTVR28 CHAR(4)                                                     13070000
*           CONSTANT('2608'),     /* indicates ver/mod level     @MMA*/ 13080000
*  RCVTVR73 CHAR(4)                                                     13090000
*           CONSTANT('7703'),     /* indicates ver/mod level     @MNA*/ 13100000
*  RCVTVR75 CHAR(4)                                                     13110000
*           CONSTANT('7705'),     /* indicates ver/mod level     @LDA*/ 13120000
*  RCVTVR76 CHAR(4)                                                     13130000
*           CONSTANT('7706'),     /* indicates ver/mod level     @LEA*/ 13140000
*  RCVTVR77 CHAR(4)                                                     13150000
*           CONSTANT('7707'),     /* indicates ver/mod level     @LIA*/ 13160000
*  RCVTVR78 CHAR(4)                                                     13170000
*           CONSTANT('7708'),     /* indicates ver/mod level     @LKA*/ 13180000
*  RCVTVR79 CHAR(4)                                                     13190000
*           CONSTANT('7709'),     /* indicates ver/mod level     @LLA*/ 13200000
*  RCVTVR70 CHAR(4)                                                     13210000
*           CONSTANT('7720'),     /* indicates ver/mod level     @LOA*/ 13220000
*  RCVTVR30 CHAR(4)                                                     13230000
*           CONSTANT('7730'),     /* indicates ver/mod level     @LPA*/ 13240000
*  RCVTVR40 CHAR(4)                                                     13250000
*           CONSTANT('7740'),     /* indicates ver/mod level     @LRA*/ 13260000
*  RCVTVR50 CHAR(4)                                                     13270000
*           CONSTANT('7750'),     /* indicates ver/mod level     @LTA*/ 13280000
*  RCVTVR60 CHAR(4)                                                     13290000
*           CONSTANT('7760'),     /* indicates ver/mod level     @LVA*/ 13300000
*  RCVTVR71 CHAR(4)                                                     13310000
*           CONSTANT('7770'),     /* indicates ver/mod level     @LYA*/ 13320000
*  RCVTVR72 CHAR(4)                                                     13330000
*           CONSTANT('7780'),     /* indicates ver/mod level     @MOA*/ 13340000
*  RCVTVR90 CHAR(4)                                                     13350000
*           CONSTANT('7790'),     /* indicates ver/mod level     @MQA*/ 13360000
*  RCVTVRA0 CHAR(4)                                                     13370000
*           CONSTANT('77A0'),     /* indicates ver/mod level     @MRA*/ 13380000
*  RCVTVRB0 CHAR(4)                                                     13390000
*           CONSTANT('77B0'),     /* indicates ver/mod level     @PDC*/ 13400000
*  RCVTVRC0 CHAR(4)                                                     13410000
*           CONSTANT('77C0'),     /* indicates ver/mod level     @N7A*/ 13420000
*  RCVTVRD0 CHAR(4)                                                     13420100
*           CONSTANT('77D0'),     /* indicates ver/mod level     @N9A*/ 13420200
*  RCVTV110 CHAR(4)                                                     13430000
*           CONSTANT('1100');     /* indicates VM only           @MHA*/ 13440000
*                                                                       13450000
*DCL                                                                    13460000
*  RCVTSTG0 FIXED(8) CONSTANT(0), /* X Sec Id Interop, Stage 0   @LAA*/ 13470000
*  RCVTSTG1 FIXED(8) CONSTANT(1), /* X Sec Id Interop, Stage 1   @LAA*/ 13480000
*  RCVTSTG2 FIXED(8) CONSTANT(2), /* X Sec Id Interop, Stage 2   @LAA*/ 13490000
*  RCVTSTG3 FIXED(8) CONSTANT(3); /* X Sec Id Interop, Stage 3   @LAA*/ 13500000
*                                                                       13510000
*DCL RCVTIDP2 FIXED(8) CONSTANT(1); /* Identity Propagation 2           13520000
*                                      services are available    @LZA*/ 13530000
*                                                                       13540000
*DCL                                                                    13550000
*  RCVTIDC  CHAR(4)               /* EBCDIC RCVT ID, FOR THE     @M5A*/ 13560000
*           CONSTANT('RCVT');     /* RCVT CONTROL BLOCK          @M5A*/ 13570000
*                                                                       13580000
                                                                        13590000
                                                                        13600000
