*/********************************************************************/ 00050000
*/*                                                                  */ 00100000
*/* $MAC(IDALKADD) COMP(DF122):                                      */ 00150000
*/*                                                                  */ 00200000
*/* MACRO NAME: IDALKADD                                             */ 00250000
*/*                                                                  */ 00300000
*/* DESCRIPTION: LOCK-FOR-ADD VSAM FUNCTION                          */ 00350000
*/*                                                                  */ 00400000
*/* STATUS: Z/OS 1.13 DFSMS                                      @L1C*/ 00450000
*/*                                                                  */ 00500000
*/* COPYRIGHT =                                                      */ 00550000
*/*                                                                  */ 00600000
*/*PROPRIETARY V3 STATEMENT                                          */ 00650000
*/*LICENSED MATERIALS - PROPERTY OF IBM                              */ 00700000
*/*"RESTRICTED MATERIALS OF IBM"                                     */ 00750000
*/*5695-DF1                                                          */ 00800000
*/*COPYRIGHT 1995, 2011 IBM CORP.                                @L1C*/ 00850000
*/*END PROPRIETARY V3 STATEMENT                                      */ 00900000
*/*                                                                  */ 01000000
*/*   CHANGE ACTIVITY =                                              */ 01050000
*/* $L0=DFSMS,HDZ11C0,930326,SJPLRG: VSAM RLS                        */ 01100000
*/* $L1=64BIT,HDZ1D10,20101116,SVLWER: 64 bit message            @L1A*/ 01125000
*/********************************************************************/ 01150000
         MACRO                                                          01200000
&NAME    IDALKADD  &RPL=                                                01250000
         GBLC  &SYSAM64    AMODE64=YES set by SYSSTATE macro       @L1A 01258300
         GBLC  &SYSASCE    ASCENV=AR or ANY set by SYSSTATE macro  @L1A 01266600
         SYSSTATE TEST     Test how macros are to expand           @L1A 01274900
         AIF   ('&SYSAM64' EQ 'YES').E0    GO IF AMODE64=YES       @L1A 01283200
         AIF   (('&SYSASCE' NE '') AND ('&SYSASCE' NE 'P')).E1     @L1A 01291500
         AIF   ('&RPL' NE '').OKAY                                      01300000
         IDAERMAC 2,RPL                                                 01350000
         MEXIT                                                          01400000
.OKAY    AIF   ('&NAME' EQ '').LoadRPL                             @L1C 01450000
&NAME    DS    0H                                                       01500000
.LoadRPL AIF   ('&RPL'(1,1) EQ '(').RPLREG                         @L1C 01550000
         LA    1,&RPL                   LOAD RPL ADDR                   01600000
         AGO   .AREG                                                    01650000
.RPLREG  AIF   ('&RPL' EQ '(1)').AREG   IF RPL=(1),SKIP LR INSTRUCTION  01700000
         LR    1,&RPL(1)           LOAD RPL ADDRESS IN REGISTER 1       01727200
.AREG    LA    0,21                INDICATE LKADD IN REGISTER           01754400
         L     15,24(1)            LOAD ACB ADDRESS FROM RPL            01781600
         L     15,8(15)            LOAD VSAM INTERFACE ROUTINE ADDR     01808800
         BASR  14,15               LINK TO INTERFACE ROUTINE            01836000
         MEXIT                                                     @L1A 01863200
.E0      IGGERMAC 203,IDALKADD THE IDALKADD MACRO DOES NOT SUPPORT @L1A 01890400
         MEXIT                   SYSSTATE AMODE64=YES              @L1A 01917600
.E1      IGGERMAC 204,IDALKADD THE IDALKADD MACRO DOES NOT SUPPORT @L1A 01944800
         MEXIT                   SYSSTATE ASCENV=AR OR ANY         @L1A 01972000
         MEND                                                           02000000
