*        %GOTO SMF62PL1;                                                00050000
         MACRO                                                          00100000
&NAME    IDASMF62                                                       00150000
* %SMF62PL1:;                                                           00200000
*/* START OF SPECIFICATIONS  *****************************************/ 00250000
*/*                                                                  */ 00300000
*/* $MAC(IDASMF62):                                                  */ 00350000
*/*                                                                  */ 00400000
*/*                                                                  */ 00450000
*/*  MACRO NAME = IDASMF62                                           */ 00500000
*/*                                                                  */ 00550000
*/*  DESCRIPTION: MAPS SMF RECORD TYPE 62                            */ 00600000
*/*                                                                  */ 00650000
*/* PROPRIETARY V3 STATEMENT                                         */ 00700000
*/* LICENSED MATERIALS - PROPERTY OF IBM                             */ 00750000
*/* 5650-ZOS                                                         */ 00850000
*/* COPYRIGHT IBM CORP. 1995, 2019                                   */ 00900000
*/* END PROPRIETARY V3 STATEMENT                                     */ 00990000
*/*                                                                  */ 01050000
*/*  This is the macro that includes the declarations for the        */ 01100000
*/*  SMF Type 62 record.                                             */ 01150000
*/*                                                                  */ 01200000
*/*01* SIZE =                                                    @01A*/ 01210000
*/*                                                              @01A*/ 01220000
*/*01*                                                               */ 01230000
*/*                                                                  */ 01240000
*/*  Method   of Access:                                             */ 01250000
*/*    ASM - User includes Record Type on IFASMFR macro invocation   */ 01300000
*/*          Examples:                                               */ 01350000
*/*          - IFASMFR 62                                            */ 01400000
*/*          - IFASMFR (...,62,...)                                  */ 01450000
*/*                                                                     01500000
.*    PL/S - User defines a macro variable IFAR62 where 62=Record    *  01550000
.*         type being requested, INCLUDEs the IFASMFR macro and      *  01600000
.*         declares the basing pointer for the record mapping.       *  01650000
.*                                                                   *  01700000
.*         Example:                                                  *  01750000
.*                                                                   *  01800000
.*         - %IFAR62 = 'YES'                                         *  01850000
.*           DCL SMF62PTR PTR(31)                                    *  01900000
.*           %INCLUDE SYSLIB(IFASMFR)                                *  01950000
*                                                                    */ 02000000
*/* STATUS =  Z/OS DFSMS VERSION 1 RELEASE 3                         */ 02050000
*/*                                                                  */ 02100000
*/* CHANGE ACTIVITY =                                                */ 02150000
*/*                                                                  *  02200000
.*  NOTE: All record mapping changes must be forwarded to the SMF    *  02250000
.*        writer for inclusion in the SMF Manual                     *  02300000
*                                                                    */ 02350000
*/*A - Define new macro for record mapping                       @00A*/ 02400000
*/*                                                                  */ 02450000
*/*$00=DFSMS/MVS,JDZ1110,,SJPCJRB : DFP Record Mappings Transfer @00A*/ 02500000
*/*$L0=DFSMS,HDZ11C0,930325,SJPCJRB : RLS                        @L0A*/ 02550000
*/* SMF62/SMF42 SUPPORT FOR STRATIS                          @WA04839*/ 02575000
*/*$SM=DFSMS,HDZ11F0,09/09/99,SJPLVM: SMF RECORDING ENHANCEMENT  @SMA*/ 02587500
*/*REMOVE SMF62SLN FIELD IN ASSEMBLER PORTION                @WA49910*/ 02593700
*/*MAKE IT REAL BIGINGUAL MACRO FOR ASSEMBER AND PLX         @WA52697*/ 02596800
*/*$F1=104920,HDZ2230,06/15/2015,RPRIETO: VSAM/RLS encryption    @F1A*/ 02596900
*/*$01=297765,HDZ2240,01/30/2019,PMEJIAM: C header compatibility.    */ 02597000
*/*    1. Add "01 SIZE =" that will get filled in by the C header    */ 02600000
*/*    2. Remove "Restricted materials of IBM".                  @01A*/ 02610000
*/*$02=OA57105,HDZ2240,03/11/2019,PMEJIAM:                           */ 02620000
*/*    1. Add the Job ID and sysplex name to smf62/64 records.       */ 02630000
*/*    2. Make the Assembler and PLX versions of the macro consistent*/ 02640000
*/*       with eachother. Note that the tool PADI sees a difference  */ 02650000
*/*       in the variable offsets of the Assembler version of the    */ 02660000
*/*       macro when comparing it to the offsets of the PLX version  */ 02670000
*/*       of the macro. The correct way to fix this is by adding a   */ 02680000
*/*       DSECT statement at each declared structure. However we     */ 02690000
*/*       can't add a DSECT statement to this macro since it was not */ 02700000
*/*       declared as a DSECT when the macro was first created.  @02A*/ 02710000
*/*$03=OA61207,HDZ2250,05/07/2021,CHANC: Support for archived        */ 02710102
*/*    Keylabel.                                                 @03A*/ 02710202
*/*                                                                  */ 02710300
*/* END OF SPECIFICATIONS   ******************************************/ 02710400
*        %GOTO SMF62PLS;                                                02710500
*                                                                       02750000
* THIS DSECT DEFINES THE FORMAT FOR RECORD TYPE 62 (VSAM DATA SET       02800000
* OPEN RECORD). RECORD LENGTH IS VARIABLE. MINIMUM OF 148 BYTES.        02850000
*                                                                       02900000
         DS    0F                  ALIGN TO FULL WORD BOUNDRY           02950000
SMFRCD62 EQU   *                   HEADER SEGMENT                       03000000
SMF62FIX EQU   *                   NON-VARIABLE PART OF STRUCTURE   @2A 03010000
SMF62LEN DS    BL2'0'              RECORD LENGTH                        03050000
SMF62SEG DS    BL2'0'              SEGMENT DESCRIPTOR                   03100000
SMF62FLG DC    BL1'0'              HEADER FLAG BYTE                     03150000
SMF62RTY DC    BL1'0'              RECORD TYPE 62                       03200000
SMF62TME DC    BL4'0'              TOD, USING FORMAT FROM TIME          03250000
*                                  MACRO WITH BIN INTERVAL              03300000
SMF62DTE DC    PL4'0000'           DATE IN PACKED DECIMAL FORM          03350000
*                                  00YYDDDF (F IS THE SIGN)             03400000
SMF62SID DC    CL4' '              SYSTEM IDENTIFICATION                03450000
SMF62JBN DC    CL8' '              JOBNAME                              03500000
SMF62RST DC    BL4'0'              READER START TIMER (.01 SEC)         03550000
SMF62RSD DC    PL4'0000'           READER START DATE                    03600000
SMF62UIF DC    CL8' '              USER IDENTIFICATION FIELD            03650000
SMF62IND DC    BL4'0'              OPEN STATUS INDICATOR                03700000
*                                  BIT MEANING WHEN SET                 03750000
SMF62OOK EQU   X'80'               BIT 0 - OPEN SUCCESSFUL         @02C 03800000
SMF62SVL EQU   X'40'               BIT 1 - SECURITY VIOLATION           03850000
*                                          (INVALID PASSWORD)      @02C 03900000
SMF62CRA EQU   X'20'               BIT 2 - CATALOG OR CRA RECORD   @02C 03920000
SMF62ICF EQU   X'10'               BIT 3 - VVDS OR ICF CATALOG     @02C 03940000
SMF62SMS EQU   X'08'               BIT 4 -SMS CLASS FIELDS INCLUDED@02C 03960000
SMF62DSENC EQU   X'04'             BIT 5 - DASD data set encrypted @02A 03970000
SMF62DSEB  EQU   X'02'             BIT 6 - User requested access method 03980000
*                                    to bypass decryption on reads and  03990000
*                                    encryption on writes and the       04000000
*                                    system honored the request.   @02A 04000100
SMF62ARCKEY EQU   X'01'            BIT 7 - Archived Keylabel and user   04000206
*                                    specified decrypt facility class   04000307
*                                  BITS 8-31 - RESERVED            @03C 04000402
SMF62CNM DC    CL44' '             CATALOG DATA SET NAME                04000500
SMF62CVS DC    CL6' '              CATALOG VOLUME SERIAL NUMBER         04050000
SMF62DNM DC    CL44' '             DATA SET NAME                        04100000
SMF62VCT DC    BL2'0'              VOLUME COUNT                         04150000
SMF62VLT EQU   *                   VOLUME LIST                          04200000
* THE FOLLOWING ENTRY IS CREATED FOR EACH VOLUME                        04250000
SMF62VSR DC    CL6' '              VOLUME SERIAL                        04300000
SMF62DTY DC    BL4'0'              DEVICE TYPE                          04350000
         ORG   SMF62VLT                                                 04400000
*  THE SMS ENTRY FOLLOWS THE LAST VOLUME ENTRY                          04408300
SMF62CLS EQU   *                   SMS CLASSES                          04416600
SMF62MGT DC    CL8' '              SMS MANAGEMENT CLASS                 04424900
SMF62STR DC    CL8' '              SMS STORAGE CLASS                    04433200
SMF62DAT DC    CL8' '              SMS DATA CLASS                       04441500
SMF62STS EQU   *                   DATA SET STATISTICS                  04446800
*  STATISTIC SECTION FOR RECORD 62                                      04452100
*                                                            1D@WA52697 04457400
SMF62DOT DS    0CL8                                                @SMA 04462700
SMF62TIM DC    CL4' '              DATASET OPEN TIME               @SMA 04468000
SMF62DT  DC    CL4' '              DATASET OPEN DATE               @SMA 04473300
SMF62MC1 DC    CL1' '              ACBMACR1 MACR FIELD             @SMA 04478600
SMF62MC2 DC    CL1' '              ACBMACR2 MACR FIELD             @SMA 04483900
SMF62MC3 DC    CL1' '              ACBMACR3 MACR FIELD             @SMA 04489200
SMF62MC4 DC    CL1' '              ACBMACR4 MACR FIELD             @SMA 04494500
*                                                                       04494600
SMF62ENC DS    0CL66               Encryption Record               @02A 04494700
SMF62DET DC    BL2'0'              Encryption Type                 @02A 04494800
SMF62DKL DC    CL64' '             DASD Data Set Key Label         @02A 04494900
*                                                                       04495000
SMF62JOBID       DC    CL8' '              Job ID                  @02A 04496000
SMF62SysplexName DC    CL8' '              Sysplex name            @02A 04497000
         MEND                                                           04500000
         AGO   .END                                            @WA52697 04550000
 %SMF62PLS:;                                                            04600000
                                                                        04650000
    DCL 1 SMFRCD62 BASED(SMF62PTR) BDY(WORD),                           04700000
                                                                        04750000
         2 SMF62FIX,              /* NON-VARIABLE PART OF STRUCTURE     04766600
                                                             @WA04839*/ 04783200
 /* RECORD TYPE 62 - VSAM DATA SET OPENED                            */ 04800000
 /* WRITTEN AFTER THE SUCCESSFUL OR UNSUCCESSFUL OPENING OF A VSAM DS*/ 04850000
 /* OR INDEX                                                         */ 04900000
                                                                        04950000
         3 SMF62LEN FIXED(15),    /* RDW RECORD LENGTH               */ 05000000
         3 SMF62SEG FIXED(15),    /* RDW SEGMENT DESCRIPTOR          */ 05050000
         3 SMF62FLG BIT(8),       /* OPERATING ENVIRONMENT           */ 05100000
         3 SMF62RTY FIXED(8),     /* RECORD TYPE 62                  */ 05150000
         3 SMF62TME FIXED(31) BDY(HWORD), /* TOD RECORD WRITTEN      */ 05200000
         3 SMF62DTE CHAR(4),      /* DATE RECORD WRITTEN             */ 05250000
         3 SMF62SID CHAR(4),      /* SYSTEM ID FROM INSTALLATION     */ 05300000
         3 SMF62JBN CHAR(8),      /* JOB NAME                        */ 05350000
         3 SMF62RST FIXED(31) BDY(HWORD), /* TOD READER START(.01 SEC)*/05400000
         3 SMF62RSD CHAR(4),      /* READER START DATE               */ 05450000
         3 SMF62UIF CHAR(8),      /* USER IDENTIFICATION FIELD       */ 05500000
         3 SMF62IND BIT(32),      /* INDICATORS                      */ 05550000
          4 SMF62IND0 BIT(8),     /* INDICATORS                  @03A*/ 05560003
           5 SMF62OOK BIT(1),     /* OPEN WAS SUCCESSFUL             */ 05600003
           5 SMF62SVL BIT(1),     /* SECURITY VIOLATION              */ 05650003
           5 SMF62CRA BIT(1),     /* CATALOG OR CRA RECORD   @WA04839*/ 05670003
           5 SMF62ICF BIT(1),     /* VVDS OR ICF CATALOG     @WA04839*/ 05690003
           5 SMF62SMS BIT(1),     /* SMS CLASS FLDS INCLUDED @WA04839*/ 05710003
           5 SMF62DSENC BIT(1),   /* DASD data set encrypted     @F1A*/ 05720003
           5 SMF62DSEB BIT(1),    /* User requested access method to    05721003
                                    bypass decryption on reads and      05722003
                                    encryption on writes and the        05723003
                                    system honored the request. @F1A*/  05724003
           5 SMF62ARCKEY BIT(1),  /* Archived Keylabel and user speci-  05725007
                                    fied decrypt facility class  @03C*/ 05726007
          4 *        BIT(24),     /* RESV                        @03C*/ 05730004
         3 SMF62CNM CHAR(44),     /* CATALOG DATA SET NAME           */ 05750000
         3 SMF62CVS CHAR(6),      /* CATALOG VOLUME SERIAL NUMBER    */ 05800000
         3 SMF62DNM CHAR(44),     /* DATA SET NAME                   */ 05850000
         3 SMF62VCT FIXED(15);    /* # OF VOLUMES                    */ 05900000
                                                                        05950000
       /* VOLUME LIST, ENTRY FOR EACH VOLUME OF DATA SET     @WA04839*/ 06000000
    DCL 1 SMF62VLT BASED (ADDR(SMF62FIX)+LENGTH(SMF62FIX)) BDY(BYTE),   06050000
         3 SMF62VSR CHAR(6),      /* VOLUME SERIAL NUMBER            */ 06100000
         3 SMF62DTY CHAR(4);      /* DEVICE TYPE CODE                */ 06150000
     /*  SMS CLASSES ARE LOCATED AFTER THE VOLUME LIST       @WA04839*/ 06200000
   DCL 1 SMF62CLS BASED (ADDR(SMF62FIX)+LENGTH(SMF62FIX)+               06250000
                            (SMF62VCT*LENGTH(SMF62VLT))),  /*@WA04839*/ 06300000
         3 SMF62MGT CHAR(8),      /* SMS MANAGEMENT CLASS    @WA04839*/ 06350000
         3 SMF62STR CHAR(8),      /* SMS STORAGE CLASS       @WA04839*/ 06400000
         3 SMF62DAT CHAR(8);      /* SMS DATA CLASS          @WA04839*/ 06450000
   DCL 1 SMF62STS BASED (ADDR(SMF62FIX)+LENGTH(SMF62FIX)+               06500000
                            (SMF62VCT*LENGTH(SMF62VLT))+                06550000
                             LENGTH(SMF62CLS)),            /*    @SMA*/ 06600000
         3 SMF62DOT CHAR(8),      /* DATA SET OPEN TIME          @SMA*/ 06650000
           4 SMF62TIM CHAR(4),    /* TIME                        @SMA*/ 06700000
           4 SMF62DT  CHAR(4),    /* DATE                        @SMA*/ 06750000
                                                                        06800000
     /* ACB MACRF INFORMATION                                    @SMA*/ 06850000
         3 SMF62MC1 CHAR(1),      /* ACBMACR1 MACRF FIELD        @SMA*/ 06900000
         3 SMF62MC2 CHAR(1),      /* ACBMACR2 MACRF FIELD        @SMA*/ 06950000
         3 SMF62MC3 CHAR(1),      /* ACBMACR3 MACRF FIELD        @SMA*/ 07000000
         3 SMF62MC4 CHAR(1),      /* ACBMACR4 MACRF FIELD        @F1C*/ 07050000
                                                                        07051000
     /* Encryption information. Encryption type and Label        @F1A*/ 07060000
         3 SMF62ENC CHAR(66),     /* Encryption Record           @F1A*/ 07070000
           5 SMF62DET BIT(16),    /* Encryption Type             @F1A*/ 07097000
           5 SMF62DKL CHAR(64),   /* DASD Data Set Key Label     @F1A*/ 07098000
     /* Additional Job Information                               @02A*/ 07099000
         3 SMF62JobID CHAR(8),       /* Job ID                   @02A*/ 07100000
         3 SMF62SysplexName CHAR(8); /* SysPlex Name             @02A*/ 07100100
*        %GOTO SMF62PL3;          /* SKIP NEXT ASM LABEL     @WA52697*/ 07100200
.END     ANOP                        TELL ASM ENDS HERE      @WA52697   07150000
*%SMF62PL3:;                      /*                         @WA52697*/ 07200000
                                                                        07210000
                                                                        07220000
                                                                        07230000
                                                                        07240000
                                                                        07250000
                                                                        07260000
                                                                        07270000
                                                                        07280000
                                                                        07290000
                                                                        07300000
                                                                        07310000
                                                                        07320000
                                                                        07330000
                                                                        07340000
                                                                        07350000
                                                                        07360000
                                                                        07370000
                                                                        07380000
                                                                        07390000
