*                                                                       00010001
* %DCL IDCDF70_INCLUDED CHAR EXT;                                       00020001
* %DEACTIVATE IDCDF70_INCLUDED;                                         00030001
* %IF IDCDF70_INCLUDED = '' %THEN                                       00040001
* %DO;                                                                  00050001
*/* Macro made bi-lingual on 95135. CBGEN compile date 94279         */ 00060001
*% /*                                                                   00070001
         MACRO                                                          00080001
         IDCDF70 &DSECT=YES,&LIST=YES,&SSGARGL=YES,&SSGBUFR=COND,      *00090001
               &SSGBUFL=COND,&SSGBUFS=COND,&SSGBFRK=COND,              *00100001
               &SSGSEBUF=COND,&SSGEPBUF=COND,&SSGEPDAT=COND,           *00110001
               &SSGDPBUF=COND,&SSGBFSL=COND,&SSGBFSD=COND         1@SIC 00120001
         GBLC  &IDCDF70_INCLUDED                                        00130001
         GBLC  &ZCBPRINT                                                00140001
&IDCDF70_INCLUDED SETC 'YES'                                            00150001
 TITLE   'IDCDF70  - EXTERNALIZATION OF SSGARGL                     '   00160001
**/ IDCDF70_1:;                                                         00170001
*/*START OF SPECIFICATIONS********************************************/ 00180001
*/*                                                                  */ 00190001
*/* $MAC(IDCDF70) COMP(DF113) PROD(DFSMS): HDZ2240               @SGC*/ 00200001
*/* MACRO-NAME: IDCDF70                                              */ 00210001
*/* DESCRIPTIVE-NAME: EXTERNALIZATION OF SSGARGL                     */ 00220001
*/*                                                                  */ 00230001
*/*PROPRIETARY V3 STATEMENT                                          */ 00240001
*/*Licensed Materials - Property of IBM                              */ 00250001
*/*"Restricted Materials of IBM"                                     */ 00260001
*/*5650-ZOS                                                          */ 00270001
*/*Copyright IBM Corp. 1983,2019                                     */ 00280001
*/*END PROPRIETARY V3 STATEMENT                                      */ 00290001
*/*                                                                  */ 00300001
*/*                                                                  */ 00310001
*/*    MAPPING FOR THE SUBSYSTEM GET ARGUMENT LIST                   */ 00320001
*/*                                                                  */ 00330001
*/*01*CHANGE ACTIVITY = NEW                                          */ 00340001
*/*   $H7=H3880,JDP1111,T840097,TUCSTL: SUPPORT 2 SD'S-STATUS    @H7A*/ 00350001
*/*   $H12=3880,HDP2210,840163,TUCSLT,COPYRIGHT MACRO:          @H12A*/ 00360001
*/*   $H14=H3880,JDP1111,T840237,TUCREN: IOS RC MSG IDC2375     @H14N*/ 00370001
*/*   $H17=H3880,JDP2230,T860176,TUCCWL: NEW DEVICE SUPPORT     @H17A*/ 00380001
*/*   $H18=H3880,JDP2230,T860143,TUCCWL: ACCESSCODE             @H18A*/ 00390001
*/*   $H19=H3880,JDP2232,T860192,TUCCWL: NEW FUNCTION           @H19A*/ 00400001
*/*   DCR 36 RACF AUTHORIZATION BY FACILITY CLASS            @OY19972*/ 00410001
*/*  $L1=UCBFD,HDZ11B0,930324,SJPLPVG: FOUR DIGIT UCB            @L1A*/ 00420001
*/*   $H20=H3990,JDZ1110,T921130,SJPLPVG: DEVICE SUPPORT        @H20A*/ 00430001
*/*   READSTAT PROC MISUSED SSGDASS, CREATED SSGDASS_40      @OW01528*/ 00440001
*/*   EXTERNALIZE FOR SSGARGL AND ADD COMMENTS FOR SUBSYS    @K130173*/ 00450001
*/*   $01=OW37611,HDZ11D0,SJPLRDB:       I/O timing support      @01A*/ 00460001
*/*                                                                  */ 00470001
*/*  $H1=SHARK  ,HDZ11E0,,sjpljbc: shark support                 @H1A*/ 00480001
*/*  $H2=SHRKLSA,HDZ11F0,,sjpljbc: Reserved                      @H2A*/ 00490001
*/*   $02=OW39010,HDZ11E0,SJPLJBC: Real CUID Support emul CUs    @02A*/ 00500001
*/*   $03=OW42864,HDZ11E0,SJPLJBC: Binary device number          @03A*/ 00510001
*/*   $H3=OW44954,HDZ11F0,SJPLJBC: Comment cleanup               @H3A*/ 00520001
*/*   $04=OW47647,HDZ11F0,SJPLJBC: Externalize macro             @04A*/ 00530001
*/*   $L2=OA04717,HDZ11H0,SJPLJBC: New ESS counters              @L2A*/ 00540001
*/*   $L3=OA06100,HDZ11J0,SJPLJBC: New ESS counters for 2107     @L3A*/ 00550001
*/*                                RANK and EXTENT pool stats    @L3A*/ 00560001
*/*                                Map link counters             @L3A*/ 00570001
*/*   $L4=OA20802,HDZ1190,SJPLTKS: SE Volume and Extent Pool     @L4A*/ 00580001
*/*                                Config statistics support     @L4A*/ 00590001
*/*   $L5=OA20802,HDZ1190,SJPLTKS: New bits assignnment for SE   @L5A*/ 00600001
*/*                                volume and Ext Pool Config.   @L5A*/ 00610001
*/*                                Update SFI ID feild for SEFLC @L5A*/ 00620001
*/*                                Assign SS01CC70 to IOSCDR Err @L5A*/ 00630001
*/*   $L6=OA20802,HDZ1190,SJPLTKS: Post DCR 008 updates for CTRC @L6A*/ 00640001
*/*   $L7=OA20802,HDZ1190,SJPLTKS: Review update                 @L7A*/ 00650001
*/*   $05=OA23390,HDZ1190,SJPLTKS: Post OA20802 updates.         @05A*/ 00660001
*/*                               Publish Device Perf output(SDI)@05A*/ 00670001
*/*   $06=OA27547,HDZ1180,SJPLTKS: 1. Restore ASM lable .L0005   @06A*/ 00680001
*/*                                   to the postion before      @06A*/ 00690001
*/*                                   OA20802.                   @06A*/ 00700001
*/*                                2. Fix incorrect information  @06A*/ 00710001
*/*                                   in $L5 change history.     @06A*/ 00720001
*/*                                   Replace SS01CC64 with      @06A*/ 00730001
*/*                                   SS01CC70.                  @06A*/ 00740001
*/*                                3. Replace L0027 with L0026   @06A*/ 00750001
*/*                                   for AIF SSGDPBUF NE YES    @06A*/ 00760001
*/*   $H4=OA29397,HDZ1180,SJPLTKS:Add flexible size Link Perf    @H4A*/ 00770001
*/*     statistics. Add detail explanation to counters.  Add     @H4A*/ 00780001
*/*     HPF R/W counters.   Add SSD and Encryption infor.        @H4A*/ 00790001
*/*   $07=OA36282,HDZ1D10,SJPLREG: Increase size of Device       @07A*/ 00800001
*/*                                Performance Stats data area   @07A*/ 00810001
*/*                                from 192 bytes to 240 bytes.  @07A*/ 00820001
*/*                                Add HPF List Pre-fetch I/O    @07A*/ 00830001
*/*                                Requests and HPF List         @07A*/ 00840001
*/*                                Pre-fetch I/O Requests Hits   @07A*/ 00850001
*/*                                counters.                     @07A*/ 00860001
*/*   $08=OA38119,HDZ1D10,SJPLREG: Recompile all parts using     @08A*/ 00870001
*/*                                macro due to OA36282 change   @08A*/ 00880001
*/*   $09=OA39695,HDZ2210,SJPLREG: Add Global Mirror Collisions  @09A*/ 00890001
*/*                                Sidefile Count and Global     @09A*/ 00900001
*/*                                Mirror Collisions Send        @09A*/ 00910001
*/*                                Synchronous Count counters.   @09A*/ 00920001
*/*   $10=OA46109,HDZ2220,ARCREG:  Alternate Subchannel Support  @10A*/ 00930001
*/*   $11=WI102608,HDZ2230,ARCREG: SDI for OA47696.              @11A*/ 00940001
*/*      =OA47696                  Add Adapter Pair ID to Rank   @11A*/ 00950001
*/*                                Statistics                    @11A*/ 00960001
*/*   $12=WI102390,HDZ2230,ARCREG: Offline device support for    @12A*/ 00970001
*/*                                BR Entry CNTS request.        @12A*/ 00980001
*/*   $TP=WI126739,HDZ2230,ARCREG: SDI for OA48711.              @TPA*/ 00990001
*/*      =OA48711                  Thin Provisioning Toleration  @TPA*/ 01000001
*/*                                Support                       @TPA*/ 01010001
*/*   $13=WI138634,HDZ2230,ARCREG: SDI                           @13A*/ 01020001
*/*      =OA50878                  FCRs 778-N, 837-N             @13A*/ 01030001
*/*                                 220 byte Link Statistics     @13A*/ 01040001
*/*                                 Add Link Statistic Counters  @13A*/ 01050001
*/*                                FCRs 826-N, 857-N             @13A*/ 01060001
*/*                                 64/128 byte Rank Statistics  @13A*/ 01070001
*/*                                 Add Rank Statistic Counters  @13A*/ 01080001
*/*   $14=WI146681,HDZ2230,ARCREG: SDI                           @14A*/ 01090001
*/*      =OA51624                  Remove asterik (continuation  @14A*/ 01100001
*/*                                character) from end of comment@14A*/ 01110001
*/*                                section in assembler portion  @14A*/ 01120001
*/*                                of code for SSGLFARC.         @14A*/ 01130001
*/*   $SI=OA52329,HDZ2230,SJPLREG: FCR 858-N                     @SIA*/ 01140001
*/*      =WI168617                  Add mapping for Synch I/O    @SIA*/ 01150001
*/*                                 Link Statistics              @SIA*/ 01160001
*/*                                 Add mapping for Synch I/O   1@SIA*/ 01170001
*/*                                 Link Diagnostic Parameters  1@SIA*/ 01180001
*/*   $SG=OA55460,HDZ2240,SJPLREG: FCR 895-N                     @SGA*/ 01190001
*/*      =WI251039                  Add mapping for Safeguarded  @SGA*/ 01200001
*/*                                 Copies support               @SGA*/ 01210001
*/*                                FCR 858-N (missed updates)   1@SGA*/ 01220001
*/*                                 Add mapping for Delayed I/O 1@SGA*/ 01230001
*/*                                 Processing Counts in Synch  1@SGA*/ 01240001
*/*                                 I/O Link Statistics         1@SGA*/ 01250001
*/*                                FCR 898-N                    2@SGA*/ 01260001
*/*                                 Add mapping for Storage     2@SGA*/ 01270001
*/*                                 Array Utilization Stats     2@SGA*/ 01280001
*/*   $15=OA59144,HDZ2240,SJPLREG: FCR 844-N                     @15A*/ 01290001
*/*      =WI361776                  Add mapping for Extent Sizes @15A*/ 01300001
*/*                                 in Extent Pool to Device and @15A*/ 01310001
*/*                                 Extent Pool Performance Stats@15A*/ 01320001
*/*                                FCR 900-N                    1@15A*/ 01330001
*/*                                 Add mapping for Port        1@15A*/ 01340001
*/*                                 Security Statistics to Link 1@15A*/ 01350001
*/*                                 Performance Stats           1@15A*/ 01360001
*/*                                Miscellaneous updates        2@15A*/ 01370001
*/*   $16=OA59629,HDZ2230,SJPLREG: FCR 916-N                     @16A*/ 01380001
*/*      =WI373682                  Add mapping for Dynamically  @16A*/ 01390001
*/*                                 Expand SGC Backup Capacity   @16A*/ 01400001
*/*                                FCR 912-N                    1@16A*/ 01410001
*/*                                 Add mapping for Disconnect  1@16A*/ 01420001
*/*                                 Time to Device Performance  1@16A*/ 01430001
*/*                                 Stats                       1@16A*/ 01440001
*/*                                FCR 914-N                    2@16A*/ 01450001
*/*                                 Add mapping for updates to  2@16A*/ 01460001
*/*                                 Extent Pool Performance     2@16A*/ 01470001
*/*                                 Stats                       2@16A*/ 01480001
*/*   $17=OA62260,HDZ2250,SJPLREG: Update SSGSCHST description   @17A*/ 01490001
*/*      =WI424366                 and type.                     @17A*/ 01500001
*/*   $18=OA62423,HDZ2250,SJPLREG: FCR 941-N                     @18A*/ 01510002
*/*      =WI426743                  Update mapping for Device    @18A*/ 01520002
*/*                                 Performance and Synch I/O    @18A*/ 01530002
*/*                                 Link Statistics              @18A*/ 01540002
*/*END OF SPECIFICATIONS**********************************************/ 01550001
*% /*                                                                   01560001
         AIF   ('&ZCBPRINT' EQ 'NO').P1                                 01570001
         AIF   ('&LIST' EQ 'YES').P2                                    01580001
.P1      ANOP                                                           01590001
         PUSH  PRINT                                                    01600001
         PRINT OFF                                                      01610001
.P2      ANOP                                                           01620001
*                                                                       01630001
* ********************************************************************  01640001
* *VALID VALUES FOR THE SSGAVOL FIELD WHEN A SUBSYSTEM IS DESIRED ARE*  01650001
* *'FFFFFFFFFFXX'X WHERE XX IS X'0C' FOR AN IBM 3990 MODEL 03        *  01660001
* *'FFFFFFFFFFXX'X WHERE XX IS X'E9' FOR AN IBM 3990 MODEL 09        *  01670001
* *'FFFFFFFFFFXX'X WHERE XX IS X'E8' FOR AN IBM 2105,2107,1750       *  01680001
* ********************************************************************  01690001
*                                                                       01700001
*                                                                       01710001
         AIF   ('&SSGARGL' EQ 'NO').L0002                               01720001
         AIF   ('&DSECT' EQ 'YES').L0003                                01730001
         AIF   ('&SSGARGL' NE 'YES').L0002                              01740001
SSGARGL  DS    0D                                                       01750001
         AGO   .L0004                                                   01760001
.L0003   ANOP                                                           01770001
SSGARGL  DSECT                                                          01780001
.L0004   ANOP                                                           01790001
SSGHEAD  DS    1CL0008   SSGARGL IDENTIFIER                             01800001
SSGADDN  DS    1AL4      DDNAME ADDRESS                                 01810001
SSGAVOL  DS    1AL4      VOLUME ADDRESS                                 01820001
SSGUNIT  DS    1BL4      DEVICE TYPE                                    01830001
         ORG   SSGUNIT                                                  01840001
SSGUNIT1 DS    1BL1      GENERAL FLAGS                                  01850001
SSGUNIT2 DS    1BL1      GENERAL FLAGS                                  01860001
SSGUNIT3 DS    1BL1      DEVICE CLASS                                   01870001
SSGUNIT4 DS    1BL1      DEVICE TYPE WITHIN THE CLASS                   01880001
SSGOLN   DS    1FL4      LENGTH OF OUTPUT BUFFER                        01890001
SSGOADR  DS    1AL4      ADDRESS OF OUTPUT BUFFER                       01900001
SSGOPT   DS    1BL2      OPTIONS BYTE                                   01910001
         ORG   SSGOPT                                                   01920001
SSGRPD   EQU   X'80'     SENSE SUBSYSTEM COUNTS                         01930001
SSGRSS   EQU   X'40'     SENSE SUBSYSTEM STATUS                         01940001
SSGCACHE EQU   X'20'     ON=CACHING,OFF=PAGING                          01950001
SSGSDS   EQU   X'10'     ON=1 SD, OFF=2 SD'S                            01960001
SSGALL   EQU   X'08'     SENSE FOR ALL SUBSYSTEMS                       01970001
SSG1SS   EQU   X'04'     SENSE FOR SPECIFIED SUBSYSTEM                  01980001
SSGDEV   EQU   X'02'     SENSE FOR SPECIFIED DEVICE                     01990001
SSGAMD   EQU   X'01'     PTR TO 3880 MODEL PASSED INSTEAD OF PTR TO    *02000001
                         VOLUME                                         02010001
SSG2SD   EQU   X'80'     PRINT 2 SD - H7A                               02020001
SSGACD   EQU   X'40'     ACCESSCODE                                     02030001
SSGOFFL  EQU   X'20'     SSGAVOL POINTS TO DEVICE ID OF AN OFFLINE     *02040001
                         DEVICE                                         02050001
SSGARGL2 EQU   X'10'     SSGARGLX contains valid data. This flag   @01A*02060001
                         indicates that the parameter list is      @01A*02070001
                         extended by 16 bytes defined as SSGARGLX  @01A 02080001
SSGLINKP EQU   X'08'     Link performance statistics               @L2A*02090001
                         supported by caller and request           @L2A*02100001
                         return of statistics when request         @L2A*02110001
                         for Subsystem counts are made             @L2A*02120001
                         (SSGRPD=ON) for one or more               @L2A*02130001
                         Subsystems (SSG1SS=ON or                  @L2A*02140001
                         SSGALL=ON). Results passed back           @L2A*02150001
                         in area pointed to by SSGLPOAR.           @H4C*02160001
                         Extended size statistics are              @H4A*02170001
                         provided if SSGEXRQ is specified.         @H4A*02180001
                         The returned field , SSGLLSET,            @H4A*02190001
                         will be set to the size for               @H4A*02200001
                         each set of link statistics.              @H4A 02210001
SSGARGL3 EQU   X'04'     This flag indicates that the              @L3A*02220001
                         parameter list is extended with           @SIC*02230001
                         area defined as SSGARLGY.                 @SIC 02240001
         ORG   SSGOPT+X'00000002'                                       02250001
SSGMDLID DS    1BL1      CU MODEL IDENTIFIER                            02260001
SSGRCIOS DS    1CL0001   RETURN CODE FROM FAILING FUNCTION - ESTAE OR  *02270001
                         IOS                                            02280001
SSGARGLX DS    1CL0016   SSGARGL Parameter list extension          @01A*02290001
                         Note: IDCSS01 will not reference fields   @01A*02300001
                         contained in SSGARGLX unless the SSGARGL2 @01A*02310001
                         is set to '1'.                            @01A 02320001
         ORG   SSGARGLX                                            @01A 02330001
SSGATIME DS    1BL1      I/O timeout value in seconds. When        @01A*02340001
                         SSGATIME is not zero, it will be stored   @01A*02350001
                         in the IOSB. If the I/O is active or      @01A*02360001
                         queued longer that SSGATIME, the I/O will @01A*02370001
                         be terminated and IDCSS01 will return a   @01A*02380001
                         return code of 60. Hex values for SSGATIME@01A*02390001
                         support seconds from 1 to 255.            @01A 02400001
SSGADEVN DS    1BL2      Binary device number that                 @L2C*02410001
                         received an IO (RC8) or                   @03A*02420001
                         timeout (RC60) from IDCSS01               @03A 02430001
SSGLPRET DS    1FL1      Reason code from link performance        2@15C*02440001
                         statistics processing                     @L2A 02450001
SS01LP01 EQU   X'01'     Stats requested, all stats returned       @L3C*02460001
                         on supporting subsystem boxes             @L2A 02470001
SS01LP02 EQU   X'02'     Stats not requested by the caller         @L3C 02480001
SS01LP03 EQU   X'03'     Stats requested, but no supporting        @L3C*02490001
                         subsystem boxes found to support them     @L2A 02500001
SS01LP04 EQU   X'04'     Stats requested, but stats from one       @L3C*02510001
                         or more supporting subsystem boxes could  @L2A*02520001
                         could not be read                         @L2A 02530001
SSGLPOAR DS    1AL4      Address of link performance               @L2A*02540001
                         Statistics output buffer queue.           @L2A*02550001
                         When zero on return, statistics not       @L2A*02560001
                         available for devices found on            @L2A*02570001
                         counts request or statistics not          @L2A*02580001
                         requested by the caller.                 2@15C 02590001
SSGSCHST DS    1FL1      SUBCHANNEL SET ID + 1                         *02600001
                         Note: Set SSGSCHST to subchannel set id + 1   *02610001
                               if using branch entry interface to      *02620001
                               issue STATUS command to an offline      *02630001
                               device in an alternate subchannel       *02640001
                               set.                                @17C 02650001
         DS    1CL007    Reserved for future use                   @10C 02660001
*********************************************************************** 02670001
** Parameter List Extension number 3                                  * 02680001
** Note: IDCSS01 will not reference fields contained in SSGARGLY      * 02690001
**       unless the bit defined as SSGARGL3 is set to '1'.            * 02700001
**                                        Entire section added    @L3A* 02710001
*********************************************************************** 02720001
SSGARGLY DS    1CL0048   Parameter list extension number 3              02730001
         ORG   SSGARGLY                                                 02740001
SSGOPTY  DS    1BL4      Extended option flags                          02750001
         ORG   SSGOPTY                                                  02760001
SSGRANKP EQU   X'80'     RANK performance statistics are               *02770001
                         supported by caller and request               *02780001
                         return of statistics when request             *02790001
                         for Subsystem counts are made                 *02800001
                         (SSGRPD=ON) for one or more                   *02810001
                         Subsystems (SSG1SS=ON or                      *02820001
                         SSGALL=ON). Results passed back               *02830001
                         in area pointed to by SSGRSOAR.           @SIC 02840001
SSGSEGMP EQU   X'40'     Extent pool statistics are                    *02850001
                         supported by caller and request               *02860001
                         return of statistics when request             *02870001
                         for Subsystem counts are made                 *02880001
                         (SSGRPD=ON) for one or more                   *02890001
                         Subsystems (SSG1SS=ON or                      *02900001
                         SSGALL=ON). Results passed back               *02910001
                         in area pointed to by SSGSPOAR.           @SIC 02920001
SSGSEV   EQU   X'20'     Space Efficient Volume (SEVOL)            @L6C*02930001
                         status is supported by caller and         @L6C*02940001
                         request return of status in               @L6C*02950001
                         SSGSEBUF pointed by SSGSEOAR              @L6A*02960001
                         when request for SEVOL are made           @L6A*02970001
                         (SSGSEV=ON) for the scope of              @L6A*02980001
                         single device (SSGDEV=ON), online         @L6A*02990001
                         SEVOL devices in the subsystem            @L6A*03000001
                         (SSG1SS=ON), or all online SEVOL          @L6A*03010001
                         devices (SSGALL=ON).   For single         @L6A*03020001
                         offline SEVOL status, caller set          @L6A*03030001
                         address of the MVS addr character         @L6A*03040001
                         in SSGAVOL and set offline                @L6A*03050001
                         (SSGOFFL=ON).   The Fix Block (FB)        @L6A*03060001
                         SEVOL device status is returned           @L6A*03070001
                         when the reporting scope is single        @L6A*03080001
                         (SSGDEV=ON), the FB user request          @L6A*03090001
                         is active (SSGURFBD=ON) with FB           @L6A*03100001
                         LSS number in SSGFBLSS and FB             @L6A*03110001
                         device number in SSGFBDEV.                @L6A*03120001
                         FB SEVOL status is available              @L6A*03130001
                         through CKD I/O device that               @L6A*03140001
                         resides in the same Storage               @L6A*03150001
                         Facility Image as FB SEVOL and            @L6A*03160001
                         resides in the same Even or Odd           @L6A*03170001
                         number LSS as even or odd FB LSS.         @L6A*03180001
                         SEVOL status is not supported             @L6A*03190001
                         when other statistics or status           @L6A*03200001
                         is requested by caller.                   @L6A 03210001
SSGEPC   EQU   X'10'     Extent Pool Config (EPC) status           @L6C*03220001
                         is supported by caller and request        @L6C*03230001
                         return of status in SSGEPBUF              @L6C*03240001
                         pointed by SSGEPOAR when request          @L6A*03250001
                         for EPC of Storage Facility Image         @L6A*03260001
                         oriented by I/O device in                 @L6A*03270001
                         SSGADDN or SSGAVOL are made               @L6A*03280001
                         (SSGEPC=ON).  When Extent Pool ID         @L6A*03290001
                         (SSGEPID) is set as 'FFFF'X               @L6A*03300001
                         by caller, EPC summary status             @L6A*03310001
                         is returned.  When even numbered          @L6A*03320001
                         Extent Pool ID is specified               @L6A*03330001
                         in SSGEPID with the I/O device            @L6A*03340001
                         in the even LSS, detail status            @L6A*03350001
                         of EPC for the specified Extent           @L6A*03360001
                         Pool is returned.  When odd               @L6A*03370001
                         numbered Extent Pool ID is                @L6A*03380001
                         specified with the I/O device             @L6A*03390001
                         in the odd LSS, detail status             @L6A*03400001
                         of EPC for the specified Extent           @L6A*03410001
                         Pool is returned.                         @L6A*03420001
                         SSGURBMP is internal use only.            @L6A*03430001
                         When Extent Pool ID (SSGEPID) is          @L6A*03440001
                         set as 'FFFF'X with SSGURBMP is           @L6A*03450001
                         ON, branch entry caller receives          @L6A*03460001
                         error.  ON or OFF of SSGURBMP             @L6A*03470001
                         don't make difference in EPC detail       @L6A*03480001
                         status for branch entry caller.           @L6A*03490001
                         EPC status report is not supported        @L6A*03500001
                         when other statistics or status           @L6A*03510001
                         is requested by caller.                   @L6A 03520001
SSGURFBD EQU   X'08'     User requested Fix Block SEVOL            @L6C*03530001
                         status when SSGURFBD is ON.               @L6C 03540001
SSGURBMP EQU   X'04'     IDCAMS internal use.  Refer.              @L6C*03550001
                         SSGEPC bit description.                   @L6A 03560001
SSGEXRQ  EQU   X'02'     By setting this attribute bit along with  @H4A*03570001
                         other request(s), caller supports and     @H4A*03580001
                         requests the return of extended length    @H4A*03590001
                         statistics.   The extended length is any  @H4A*03600001
                         set of statistics that is larger than the @H4A*03610001
                         standard length of statistics. The        @H4A*03620001
                         extended length statistics will be        @H4A*03630001
                         returned if target storage facility       @H4A*03640001
                         supports it, otherwise the standard size  @H4A*03650001
                         statistics will be returned. Ignored this @H4A*03660001
                         attribute bit for requests where the      @H4A*03670001
                         statistics do not support the extended    @H4A*03680001
                         length and where caller does not make any @H4A*03690001
                         request.                                  @H4A*03700001
                         Current request that supports             @H4A*03710001
                         the extended length is:                   @H4A*03720001
                         - Link performance statistics             @H4A 03730001
SSGVOL   EQU   X'01'     Volume status is supported by caller and  @TPA*03740001
                         request return of status in SSGSEBUF      @TPA*03750001
                         pointed by SSGSEOAR when request for      @TPA*03760001
                         volume status is made (SSGVOL=ON) for     @TPA*03770001
                         the scope of single device (SSGDEV=ON),   @TPA*03780001
                         online devices in the subsystem           @TPA*03790001
                         (SSG1SS=ON), or all online devices        @TPA*03800001
                         (SSGALL=ON). For single offline volume    @TPA*03810001
                         status, caller sets address of the MVS    @TPA*03820001
                         addr character in SSGAVOL and set offline @TPA*03830001
                         (SSGOFFL=ON). Volume status is not        @TPA*03840001
                         supported when other statistics or status @TPA*03850001
                         is requested by caller.                   @TPA 03860001
SSGSIOLP EQU   X'80'     Synch I/O Link statistics are             @SIA*03870001
                         supported by caller and request           @SIA*03880001
                         return of statistics when request         @SIA*03890001
                         for Subsystem counts are made             @SIA*03900001
                         (SSGRPD=ON) for one or more               @SIA*03910001
                         Subsystems (SSG1SS=ON or                  @SIA*03920001
                         SSGALL=ON). Results passed back           @SIA*03930001
                         in area pointed to by SSGSLOAR.           @SIA 03940001
SSGSILDP EQU   X'40'     Synch I/O Link Diagnostic Parameters     1@SIA*03950001
                         are supported by caller and request      1@SIA*03960001
                         return of statistics when request        1@SIA*03970001
                         for Subsystem counts are made            1@SIA*03980001
                         (SSGRPD=ON) for one or more              1@SIA*03990001
                         Subsystems (SSG1SS=ON or                 1@SIA*04000001
                         SSGALL=ON). Results passed back          1@SIA*04010001
                         in area pointed to by SSGSDOAR.          1@SIA 04020001
SSGEPCV  EQU   X'30'     Extent Pool Detailed Information Version  @SGA*04030001
                         Version 1 - 00                            @SGA*04040001
                         Version 2 - 10                            @SGA*04050001
                         Version 3 - 01                            @SGA 04060001
         ORG   SSGOPTY+X'00000004'                                      04070001
SSGRETY  DS    1CL8      Extended return codes                          04080001
         ORG   SSGRETY                                                  04090001
SSGRSRET DS    1BL1      Reason code from Rank Performance             *04100001
                         Statistics processing                          04110001
SSGSGRET DS    1BL1      Reason code from Segm Performance             *04120001
                         Statistics processing                          04130001
SSGSLRET DS    1BL1      Reason code from Synch I/O Link           @SIA*04140001
                         Statistics processing                     @SIA 04150001
SSGSDRET DS    1BL1      Reason code from Synch I/O Link          1@SIA*04160001
                         Diagnostic Parameters processing         1@SIA 04170001
* See SSGLPRET for possible reason code values                          04180001
         ORG   SSGRETY+X'00000008'                                      04190001
SSGRSOAR DS    1AL4      Address of Rank performance                   *04200001
                         Statistics output buffer queue.               *04210001
                         When zero on return, statistics not           *04220001
                         available for devices found on                *04230001
                         counts request or statistics not              *04240001
                         requested by the caller.                 2@15C 04250001
SSGSPOAR DS    1AL4      Address of Extent pool performance            *04260001
                         Statistics output buffer queue.               *04270001
                         When zero on return, statistics not           *04280001
                         available for devices found on                *04290001
                         counts request or statistics not              *04300001
                         requested by the caller.                 2@15C 04310001
SSGSEOAR DS    1AL4      Address of SE Volume status output        @L6C*04320001
                         buffer queue.  When zero on return,       @L6C*04330001
                         status not available for devices          @L6A*04340001
                         found on SEVOL status request or          @L6A*04350001
                         status not requested.                     @L6A 04360001
SSGEPOAR DS    1AL4      Address of Extent Pool Config (EPC)       @L6C*04370001
                         status output buffer. When zero on        @L6C*04380001
                         return, status not available for          @L6C*04390001
                         Storage Facility Image found on           @L6C*04400001
                         EPC status request or status not          @L6A*04410001
                         requested by the caller.                  @L6A 04420001
SSGEPID  DS    1BL2      Extent Pool ID.                           @L6C*04430001
                         'FFFF'X indicates no EP ID is             @L6A*04440001
                         provided by caller.                       @L6A 04450001
SSGFBLSS DS    1CL2      Fix Block LSS number                     2@15C 04460001
SSGFBDEV DS    1CL2      Fix Block device number                  2@15C 04470001
         DS    1CL0002   Reserved for future use                   @SIC 04480001
SSGSLOAR DS    1AL4      Address of Synch I/O Link                 @SIA*04490001
                         Statistics output buffer queue.           @SIA*04500001
                         When zero on return, statistics not       @SIA*04510001
                         available for devices found on            @SIA*04520001
                         counts request or statistics not          @SIA*04530001
                         requested by the caller.                 2@15C 04540001
SSGSDOAR DS    1AL4      Address of Synch I/O Link Diagnostic     1@SIA*04550001
                         Parameters output buffer queue.          1@SIA*04560001
                         When zero on return, statistics not      1@SIA*04570001
                         available for devices found on           1@SIA*04580001
                         counts request or statistics not         1@SIA*04590001
                         requested by the caller.                 2@15C 04600001
         DS    1CL0004   Reserved for future use                  1@SIC 04610001
*                                                                       04620001
SSGARGL_LEN EQU *-SSGARGL                                               04630001
*                                                                       04640001
.L0002   ANOP                                                           04650001
*                                                                       04660001
* ****************************************************************** *  04670001
* *                                                                  *  04680001
* *    MAPPING FOR THE SUBSYSTEM GET OUTPUT BUFFER                   *  04690001
* *                                                                  *  04700001
* ****************************************************************** *  04710001
*                                                                       04720001
*                                                                       04730001
         AIF   ('&SSGBUFR' EQ 'NO').L0005                               04740001
         AIF   ('&DSECT' EQ 'YES').L0006                                04750001
         AIF   ('&SSGBUFR' NE 'YES').L0005                              04760001
SSGBUFR  DS    0F                                                       04770001
         AGO   .L0007                                                   04780001
.L0006   ANOP                                                           04790001
SSGBUFR  DSECT                                                          04800001
.L0007   ANOP                                                           04810001
SSGDAVOL DS    1CL0006   VOLUME SERIAL                                  04820001
SSGDAFLG DS    1BL1                                                     04830001
         ORG   SSGDAFLG                                                 04840001
SSG_UA_FLAG EQU X'80'    'ONE' UNIT ADDR FORMAT                         04850001
SSG_FND_STG2 EQU X'40'   2ND STG DIR PATH FND SS01 TO LA01 IDCSS01     *04860001
                         PASSED TO IDCLA01                              04870001
SSG_SCHST EQU X'30'      SUBCHANNEL SET NUMBER                     @12A*04880001
                         SCHSET NUMBER 0 - 00                      @12A*04890001
                         SCHSET NUMBER 1 - 01                      @12A*04900001
                         SCHSET NUMBER 2 - 10                      @12A*04910001
                         SCHSET NUMBER 3 - 11                      @12A 04920001
         ORG   SSGDAFLG+X'00000001'                                     04930001
SSGDCUID DS    1CL0001   Real cuid for data in ssgdada             @02A 04940001
SSGDAUA1 DS    1CL0004   FIRST UNIT ADDRESS                             04950001
SSGDAUB1 DS    1CL0002   FIRST UNIT ADDRESS (BINARY)                    04960001
SSGDALN  DS    1FL2      DATA LENGTH                                    04970001
SSGDADA  DS    0CL0240   DATA AREA - LONGEST CHILD IS 240          @07C 04980001
SSGDAXPF DS    1CL0240   CACHING SUBSYSTEM PERFORMANCE STATISTICS  @07C 04990001
         ORG   SSGDAXPF                                            @H1C 05000001
SSGDASPF DS    1CL0160   CACHING SUBSYSTEM COUNTS                       05010001
         ORG   SSGDASPF                                                 05020001
SSGDA2SD DS    1CL0080   STATUS FOR 2 SD                                05030001
         ORG   SSGDA2SD                                                 05040001
SSGDAIPF DS    1CL0080   PAGING SUBSYSTEM COUNTS                        05050001
         ORG   SSGDAIPF                                                 05060001
SSGDASS  DS    1CL0044   SUBSYSTEM STATUS (LNGTHND)                     05070001
         ORG   SSGDASS                                                  05080001
SSGDASS_40 DS  1CL0040   STATUS FOR 3380                                05090001
         ORG   SSGDASS_40                                               05100001
SSGDAACD DS    1CL0024   ACCESSCODES                                    05110001
         ORG   SSGDAACD                                                 05120001
SSGDAAC0 DS    1CL0012   STORAGE CLUSTER 0 WORD                         05130001
SSGDAAC1 DS    1CL0012   STORAGE CLUSTER 1 WORD                         05140001
*                        ADJUST WITH LONGEST DATA IN SSGDADA       @L4A 05150001
         ORG   SSGDADA+X'000000F0'                                 @07C 05160001
SSGBUFR_LEN EQU *-SSGBUFR                                               05170001
*                                                                       05180001
* ****************************************************************** *  05190001
* *                                                                  *  05200001
* *    RETURN CODES FROM IDCSS01                                     *  05210001
* *                                                                  *  05220001
* ****************************************************************** *  05230001
*                                                                       05240001
*                                                                       05250001
SS01CC00 EQU   0         SUCCESSFUL COMPLETION                          05260001
SS01CC04 EQU   4         GETMAIN FAILED                                 05270001
SS01CC08 EQU   8         I/O ERROR OCCURRED                             05280001
SS01CC12 EQU   12        VOLUME NOT FOUND                               05290001
SS01CC16 EQU   16        ESTAE FAILED                                   05300001
SS01CC20 EQU   20        LRA INSTRUCTION FAILED                         05310001
SS01CC24 EQU   24        BUFFER NOT LARGE ENOUGH                        05320001
SS01CC28 EQU   28        FILE NOT IN TIOT                               05330001
SS01CC32 EQU   32        VOLUME NOT FOUND ALL                           05340001
SS01CC36 EQU   36        NO PATH(S) TO SD(S)                            05350001
SS01CC40 EQU   40        NO ONLINE PATH FROM IOS                        05360001
SS01CC44 EQU   44        REQUEST NOT SUPPORTED                          05370001
SS01CC48 EQU   48        WARNING MSG ISSUED                             05380001
SS01CC52 EQU   52        ERROR MSG ISSUED                               05390001
SS01CC56 EQU   56        SERIOUS ERROR MSG                              05400001
SS01CC60 EQU   60        I/O TIMEOUT OCCURED                       @01A 05410001
SS01CC64 EQU   64        RESERVED                                  @H2C 05420001
SS01CC68 EQU   68        RESERVED                                       05430001
SS01CC70 EQU   70        IOSCDR Error                              @L6A 05440001
SS01CC71 EQU   71        UCBINFO Error                             @L6A 05450001
SS01CC72 EQU   72        Reserved                                  @L6A 05460001
SS01CC73 EQU   73        Missing CDR infor                         @L6A 05470001
SS01CC74 EQU   74        Err during CDR infor                      @L6A 05480001
SS01CC99 EQU   99        RESERVED                                  @L4A 05490001
.L0005   ANOP                                                      @06C 05500001
*                                                                       05510001
* ****************************************************************** *  05520001
* *                                                                  *  05530001
* *    MAPPING FOR THE SUBSYSTEM LINK STATISTIC BUFFER           @L2A*  05540001
* *                                                                  *  05550001
* ****************************************************************** *  05560001
*                                                                       05570001
         AIF   ('&SSGBUFL' EQ 'NO').L0008                               05580001
         AIF   ('&DSECT' EQ 'YES').L0009                                05590001
         AIF   ('&SSGBUFL' NE 'YES').L0008                              05600001
SSGLBUFR DS    0D        Link Statistics output buffer             @L2A 05610001
         AGO   .L0010                                                   05620001
.L0009   ANOP                                                           05630001
SSGLBUFR DSECT           Link Statistics output buffer             @L2A 05640001
.L0010   ANOP                                                           05650001
SSGLHDR  DS    0CL56     Header info for link statistics           @L2A 05660001
SSGLQDAL DS    1AL4      Len of this queue element, header & data  @L2A 05670001
SSGLQDAO DS    1AL4      Offset to the start of the statistics sets@L2A 05680001
SSGLFWDP DS    1AL4      Pointer to next queue element, zero is end@L2A 05690001
SSGLVOL  DS    1CL6      Volume serial of device that stats where  @L2A*05700001
                         read from                                 @L2A 05710001
SSGLDEVN DS    1CL2      Device number of device that stats where  @L2A*05720001
                         read from                                 @L2A 05730001
SSGLFLG DS     1BL1                                                @12A 05740001
         ORG   SSGLFLG                                             @12A 05750001
SSGL_SCHST EQU X'30'     Subchannel Set Number                     @12A*05760001
                         SCHSET NUMBER 0 - 00                      @12A*05770001
                         SCHSET NUMBER 1 - 01                      @12A*05780001
                         SCHSET NUMBER 2 - 10                      @12A*05790001
                         SCHSET NUMBER 3 - 11                      @12A 05800001
         ORG   SSGLFLG+X'00000001'                                 @12A 05810001
         DS    1CL7      Reserved                                  @12C 05820001
SSGLLHDR DS    0CL28                                               @L4A 05830001
SSGLNSET DS    1FL2      Number of link statistics sets            @L2A 05840001
SSGLLSET DS    1FL2      Size of each statistics set.              @H4C*05850001
                         The extended size would be set            @H4A*05860001
                         if the target storage facility            @H4A*05870001
                         supports it and SSGEXRQ is set,           @H4A*05880001
                         otherwise the standard 96-bytes           @H4A*05890001
                         entry size for each interface             @H4A*05900001
                         ID will be set.                           @H4A 05910001
SSGLCUT  DS    1CL6      Control unit type                         @L2A 05920001
SSGLCUM  DS    1CL3      Control unit model                        @L2A 05930001
SSGLSEQ  DS    1CL10     Control unit sequence number              @L2A 05940001
SSGLVER  DS    1CL1      Version of link statistics.               @H4C*05950001
                         When value of version is X'00',           @H4A*05960001
                         it indicates the link statistics          @13C*05970001
                         are defined in the 96 byte format.        @H4A*05980001
                         When value of version is X'01',           @H4A*05990001
                         it indicates the link statistics          @13C*06000001
                         are defined in the 156 byte               @H4A*06010001
                         format.                                   @H4A*06020001
                         When value of version is X'02',           @13A*06030001
                         it indicates the link statistics          @13A*06040001
                         are defined in the 220 byte               @13A*06050001
                         format.                                   @13A 06060001
         DS    1CL4      Not used                                 2@15C 06070001
SSGLDADA DS    0C        Link performance stats read               @L2A 06080001
*                        Added mapping of link statistics          @L3A 06090001
*                                                                       06100001
* ****************************************************************** *  06110001
* * SSGLDADA consists of link statistics sets with Interface ID      *  06120001
* * containing one or more table information entries.  Each          *  06130001
* * entry can be 96 bytes defined in SSGLLSTA or 156 bytes           *  06140001
* * defined in SSGLXSTA or 220 bytes defined in SSGLXST2        @13C *  06150001
* * depending on version number in SSGLVER.                     @13C *  06160001
* **************************************************************@13C *  06170001
*                                                                       06180001
SSGLLSTA DS    0CL96     Stats entry, repeated for number of link      *06190001
                         statistics sets (SSGLNSET)                    *06200001
                         Use this mapping when SSGLLSET has        @H4A*06210001
                         the standard 96-bytes entry size.         @H4A 06220001
SSGLLTYP DS    1FL1      Link type                                     *06230001
                          00 - Link Not Operational                @13A*06240001
                          01 - ESCON                                   *06250001
                          02 - Fibre Channel 1 Gb/s                    *06260001
                          03 - Fibre Channel 2 Gb/s                    *06270001
                          04 - Fibre Channel 4 Gb/s                    *06280001
                          05 - Fibre Channel 8 Gb/s                @H4C*06290001
                          06 - Fibre Channel 16 Gb/s               @H4A*06300001
                          07 - Fibre Channel 32 Gb/s               @SIA*06310001
                          08-0F - Reserved                         @SIA*06320001
                          10 - Fibre Channel Over                  @13A*06330001
                               Ethernet 10 Gb/s                    @13A*06340001
                          11 - Fibre Channel Over                  @13A*06350001
                               Ethernet 40 Gb/s                    @13A 06360001
         DS    1FL1      Unused                                         06370001
SSGLLBYI DS    1FL1      Byte increment                           2@15C*06380001
                          Value Description                       2@15C*06390001
                          01    Low order bit represents          2@15C*06400001
                                128K bytes                        2@15C 06410001
SSGLLTMI DS    1FL1      Time increment                           2@15C*06420001
                          Value Description                       2@15C*06430001
                          01    Low order bit represents          2@15C*06440001
                                16 milliseconds                   2@15C 06450001
SSGLLFLG DS    1BL1      Flags                                     @13A 06460001
         ORG   SSGLLFLG                                           2@15A 06470001
SSGLCPBS EQU   X'80'     CPU Percent Busy Scope                    @13A 06480001
SSGLPSSV EQU   X'40'     Port Security Statistics Valid           1@15A*06490001
                         When set to one, SSGLPSCG, SSGLRMLG,     1@15A*06500001
                         SSGLRLSC, SSGLRLLA, and SSGLRLEF are     1@15A*06510001
                         valid.                                   1@15A 06520001
         ORG   SSGLLFLG+X'00000001'                               2@15A 06530001
         DS    1CL1      Unused                                   2@15C 06540001
SSGLLIID DS    1CL2      Interface id                                   06550001
SSGLLSAT DS    0CL88     Link statistics                                06560001
SSGLERDB DS    1F        Eckd read bytes in byte increments             06570001
SSGLEWRB DS    1F        Eckd write bytes in byte increments            06580001
SSGLERDO DS    1F        Eckd read operations. for escon               *06590001
                         ports, one count per chain which              *06600001
                         transfers data to the host. for               *06610001
                         ficon ports, one count per                    *06620001
                         command which transfer data to the host        06630001
SSGLEWRO DS    1F        Eckd write operations. for escon              *06640001
                         ports, one count per chain which              *06650001
                         transfers data to the host. for               *06660001
                         ficon ports, one count per                    *06670001
                         command which transfer data to the host        06680001
SSGLERDT DS    1F        Eckd read accumulated time on                 *06690001
                         channel.  the active processing               *06700001
                         time for each command is                      *06710001
                         accumulated based on increment value           06720001
SSGLEWRT DS    1F        Eckd write accumulated time on                *06730001
                         channel.  the active processing               *06740001
                         time for each command is                      *06750001
                         accumulated based on increment value           06760001
SSGLPRDB DS    1F        Pprc send bytes in byte increment              06770001
SSGLPWRB DS    1F        Pprc received bytes in byte increment          06780001
SSGLPRDO DS    1F        Pprc send operations. each                    *06790001
                         pprc write command sent by the                *06800001
                         pprc primary                                   06810001
SSGLPWRO DS    1F        Pprc received operations. each                *06820001
                         pprc write command received by                *06830001
                         the pprc secondary.                            06840001
SSGLPRDT DS    1F        Pprc send accumulated time                    *06850001
                         based on incremant value                       06860001
SSGLPWRT DS    1F        Pprc received accumulated time                *06870001
                         based on increment value                       06880001
SSGLSRDB DS    1F        Scsi read bytes in byte increment              06890001
SSGLSWRB DS    1F        Scsi write bytes in byte increment             06900001
SSGLSRDO DS    1F        Scsi read operations. each                    *06910001
                         scsi read is counted                           06920001
SSGLSWRO DS    1F        Scsi write operations. each                   *06930001
                         scsi write is counted                          06940001
SSGLSRDT DS    1F        Scsi read accumulated time                    *06950001
                         based on increment value                       06960001
SSGLSWRT DS    1F        Scsi write accumulated time                   *06970001
                         based on increment value                       06980001
SSGLPSCG DS    1BL1      Port Security Configuration              1@15A 06990001
         ORG SSGLPSCG                                             1@15A 07000001
SSGLPCSE EQU   X'80'     Port is Configured for Security Enabled  1@15A 07010001
SSGLPCSF EQU   X'40'     Port is Configured for Security Enforced 1@15A 07020001
         ORG SSGLPSCG+X'00000001'                                 1@15A 07030001
         DS    1FL1      Not Used                                 1@15A 07040001
SSGLRMLG DS    1FL2      Remote Logins                            1@15A 07050001
SSGLRLSC DS    1FL2      Remote Logins - Security Capable         1@15A 07060001
SSGLRLLA DS    1FL2      Remote Logins - Link Authenticated       1@15A 07070001
SSGLRLEF DS    1FL2      Remote Logins - Encryption of Data In    1@15A*07080001
                         Flight (EDIF)                            1@15A 07090001
         DS    CL5       Not Used                                 1@15C 07100001
SSGLPBHA DS    1FL1      Percent Busy for Host Adapter             @13A*07110001
                         or Host Port.                             @13A 07120001
*                        End adding mapping of link statistics     @L3A 07130001
*                                                                       07140001
* ****************************************************************** *  07150001
* * SSGLDADA consists of table entries defined by SSGLXSTA shown @13C*  07160001
* * below when SSGLVER is decimal value of 1.                        *  07170001
* *                        Entire 156 bytes section is added by @H4A *  07180001
* ****************************************************************** *  07190001
*                                                                       07200001
         ORG  SSGLDADA                                                  07210001
SSGLXSTA DS   0CL156     Stats entry, repeated for number of link      *07220001
                         statistics sets (SSGLNSET)                    *07230001
                         Use this mapping when SSGLLSET has            *07240001
                         the standard 156-bytes entry size.             07250001
         DS   CL96       Mapped in SSGLLSTA                             07260001
*                                                                       07270001
SSGLFLKF DS   1F         Fibre Channel Link Failure                    *07280001
                         Error Count.                                  *07290001
                         This count is the number of                   *07300001
                         miscellaneous fibre channel link              *07310001
                         errors, such as unexpected NOS                *07320001
                         received or a link state machine              *07330001
                         failure detected.                              07340001
SSGLFLSY DS   1F         Fibre Channel Loss of                         *07350001
                         Synchronization Error Count.                  *07360001
                         This count is the number of loss              *07370001
                         of synchronization errors where it            *07380001
                         is a confirmed and a persistent               *07390001
                         synchronization loss on the fibre             *07400001
                         channel link.                                  07410001
SSGLFLSG DS   1F         Fibre Channel Loss of Signal                  *07420001
                         Error Count.                                  *07430001
                         This count is the number of times             *07440001
                         that a loss of signal was detected            *07450001
                         on the fibre channel link when a              *07460001
                         signal was previously                         *07470001
                         detected.                                      07480001
SSGLFPSQ DS   1F         Fibre Channel Primitive Sequence              *07490001
                         Error Count.                                  *07500001
                         This count is the number of                   *07510001
                         primitive sequence protocol error             *07520001
                         counts where an unexpected                    *07530001
                         primitive sequence was received.               07540001
SSGLFITW DS   1F         Fibre Channel Invalid Transmission            *07550001
                         Word Error Count.                             *07560001
                         This count is the number of times             *07570001
                         a "bit" error was detected.                   *07580001
                         Examples of a "bit" errors are a              *07590001
                         code violation, invalid special               *07600001
                         code alignment, or disparity                  *07610001
                         errors.                                        07620001
SSGLFCRC DS   1F         Fibre Channel CRC Error Count.                *07630001
                         This count is the number of                   *07640001
                         times a received frame's CRC                  *07650001
                         is in error.                                   07660001
SSGLFLR1 DS   1F         Fibre Channel Link Recovery                   *07670001
                         (LR) Sent Count Count.                        *07680001
                         This count is the number of times             *07690001
                         the port has transitioned from                *07700001
                         an active (AC) state to a Link                *07710001
                         Recovery (LR1) state.                          07720001
SSGLFLR2 DS   1F         Fibre Channel Link Recovery                   *07730001
                         (LR) Received Count Recovery                  *07740001
                         Count.                                        *07750001
                         This count is the number of times             *07760001
                         the port has transitioned from                *07770001
                         an active (AC) state to a Link                *07780001
                         Recovery (LR2) state.                          07790001
SSGLFILF DS   1F         Fibre Channel Illegal Frame                   *07800001
                         Count.                                        *07810001
                         This count is the number of frames            *07820001
                         that violated Fibre Channel                   *07830001
                         protocol.   One example is an                 *07840001
                         invalid frame header. One common              *07850001
                         reason is when the first frame of             *07860001
                         data sequence is missing and a                *07870001
                         subsequent data frame is detected             *07880001
                         as illegal.                                    07890001
SSGLFOOD DS   1F         Fibre Channel Missing Frame Count.        @13C*07900001
                         This count is the number of times             *07910001
                         that a missing frame is detected.             *07920001
                         The frame is either missing from a            *07930001
                         data sequence or it is received               *07940001
                         beyond the port's sequence reassembly         *07950001
                         threshold.                                     07960001
SSGLFOOA DS   1F         Fibre Channel Out of Order                    *07970001
                         ACK Count.                                    *07980001
                         This count is the number of times             *07990001
                         that a out of order ACK frame is              *08000001
                         detected. The frame is either                 *08010001
                         missing from a data sequence                  *08020001
                         or it is received beyond the                  *08030001
                         port's sequence reassembly                    *08040001
                         threshold.                                     08050001
SSGLFDPF DS   1F         Fibre Channel Duplicate                       *08060001
                         Frame Count.                                  *08070001
                         This count is the number of                   *08080001
                         times a frame was received                    *08090001
                         that has been detected as                     *08100001
                         previously processed.                          08110001
SSGLFIRO DS   1F         Fibre Channel Invalid                         *08120001
                         Relative Offset Count.                        *08130001
                         This count is the number of                   *08140001
                         times that a frame was received               *08150001
                         with bad relative offset in the               *08160001
                         frame header.                                  08170001
SSGLFSQT DS   1F         Fibre Channel Sequence                        *08180001
                         Timeout Count.                                *08190001
                         This count is the number of               @13C*08200001
                         times the port has detected a                 *08210001
                         timeout on receiving the next                 *08220001
                         frame in a fibre channel sequence.             08230001
SSGLFBER DS   1F         Fibre Channel Bit Error                       *08240001
                         Rate Count.                                   *08250001
                         This count is the number of the               *08260001
                         bit error (invalid transmission               *08270001
                         word) bursts for the previous 5               *08280001
                         minute counting window.                        08290001
*                                                                       08300001
* ****************************************************************** *  08310001
* * SSGLDADA consists of table entries defined by SSGLXST2 shown     *  08320001
* * below when SSGLVER is decimal value of 2.                        *  08330001
* *                        Entire 220 bytes section is added by @13A *  08340001
* ****************************************************************** *  08350001
*                                                                       08360001
         ORG  SSGLDADA                                                  08370001
SSGLXST2 DS   0CL220     Stats entry, repeated for number of link      *08380001
                         statistics sets (SSGLNSET)                    *08390001
                         Use this mapping when SSGLLSET has            *08400001
                         the standard 156-bytes entry size.             08410001
         DS   CL156      Mapped in SSGLXSTA                             08420001
*                                                                       08430001
SSGLFRBZ DS   1F         Fibre Channel Receive Buffer Zero Credit.     *08440001
                         This count is the number of one second        *08450001
                         intervals where the receive buffer credit     *08460001
                         was zero.                                      08470001
SSGLFSBZ DS   1F         Fibre Channel Send Buffer Zero Credit.        *08480001
                         This count is the number of one second        *08490001
                         intervals where the send buffer credit        *08500001
                         was zero.                                      08510001
SSGLFEHC DS   1F         Fibre Channel Exchange High Count.            *08520001
                         This count is the number of times the         *08530001
                         Fibre Channel exchange count crossed          *08540001
                         the High Threshold.                            08550001
SSGLFQFB DS   1F         Fibre Channel Queue Full or Busy Status.      *08560001
                         This count is the number of times the         *08570001
                         FCP port returned QUEUE FULL or BUSY          *08580001
                         status.                                        08590001
SSGLFEOC DS   1F         Fibre Channel Exchange Overrun Count.         *08600001
                         This count is the number of Fibre Channel     *08610001
                         exchanges that were lost due to               *08620001
                         overdriving the host adapter.                  08630001
SSGLFARC DS   1F         Fibre Channel Abort Received Count.           *08640001
                         This count is the number of times a           *08650001
                         port received an abort.                   @14C 08660001
SSGLRDRP DS   1F         Read Diagnostic Parameter: Rx Power.          *08670001
                         This value contains the measured              *08680001
                         received optical power in units of            *08690001
                         0.1uW (Range 0-6.5mW). If the value           *08700001
                         is 0, the function is not supported           *08710001
                         by the current level of microcode.             08720001
SSGLRDTP DS   1F         Read Diagnostic Parameter: Tx Power.          *08730001
                         This value contains the measured              *08740001
                         coupled Tx output power in units of           *08750001
                         0.1uW (Range 0-6.5mW). If the value           *08760001
                         is 0, the function is not supported           *08770001
                         by the current level of microcode.             08780001
SSGLRDTT DS   1FL2       Read Diagnostic Parameter: Internally         *08790001
                         Measured Transceiver Temperature.             *08800001
                         This value is reported in units of            *08810001
                         1/256 C (Range -128C to +128C). If the        *08820001
                         value is 0, the function is not supported     *08830001
                         by the current level of microcode.             08840001
SSGLRDSV DS   1FL2       Read Diagnostic Parameter: Internally         *08850001
                         Measured Supply Voltage.                      *08860001
                         This value is reported in units of            *08870001
                         100uV (Range 0-6.55V). If the value           *08880001
                         is 0, the function is not supported           *08890001
                         by the current level of microcode.             08900001
SSGLRDTC DS   1FL2       Read Diagnostic Parameter: Measured           *08910001
                         Transmitter Laser Bias Current.               *08920001
                         This value is reported in units of            *08930001
                         2uA (Range 0-131mA). If the value is          *08940001
                         0, the function is not supported              *08950001
                         by the current level of microcode.             08960001
SSGLRDFG DS   1FL2       Read Diagnostic Parameter: Flags              *08970001
                          0     Forward Error Correction           @SIA*08980001
                                0     Forward Error Correction is  @SIA*08990001
                                      not active on link.          @SIA*09000001
                                1     Forward Error Correction is  @SIA*09010001
                                      active on link.              @SIA*09020001
                          1-7   Reserved. Set to zero.             @SIC*09030001
                          8-9   Connector Type                         *09040001
                                00    Unknown                          *09050001
                                01    SFP+                             *09060001
                                10-11 Reserved                         *09070001
                          10    SFP Diagnostic Parameters Validity     *09080001
                                0     Diagnostic Parameters are Valid  *09090001
                                1     Diagnostic Parameters are NOT    *09100001
                                      Valid. The response does not     *09110001
                                      include valid values for         *09120001
                                      Temperature, Vcc, Tx Bias, Tx    *09130001
                                      Power, and Rx Power.             *09140001
                          11    Optical Port                           *09150001
                                0     Not an Optical Port              *09160001
                                1     Optical Port                     *09170001
                          12-15 Port Tx Type                           *09180001
                                0000      Not Optical or Other Type    *09190001
                                0001      Short Wave Laser             *09200001
                                0010      Long Wave Laser LC 1310nm    *09210001
                                0011      Long Wave Laser LL 1550nm    *09220001
                                0100-1111 Reserved                      09230001
SSGLUFEC DS   1F         Number of Bad Blocks that were Uncorrectable  *09240001
                         by Forward Error Correction (FEC)              09250001
SSGLCFEC DS   1F         Number of Bad Blocks that were Correctable    *09260001
                         by Forward Error Correction (FEC)              09270001
SSGLTMCR DS   1F         Transport Mode Command Retries.               *09280001
                         This value is the total number of retries     *09290001
                         requested for Transport Mode write operations *09300001
                         due to not enough buffers to receive          *09310001
                         unsolicited data.                              09320001
SSGLTMTR DS   1F         Transport Mode Transfer Readies.              *09330001
                         This value is the total number of Transfer    *09340001
                         Mode operations from channels that require    *09350001
                         transfer ready and were received from         *09360001
                         channels that support Transfer Mode Command   *09370001
                         Retry.                                         09380001
         DS   CL8        Reserved                                       09390001
*                                                                       09400001
.L0008   ANOP                                                           09410001
*                                                                       09420001
* ****************************************************************** *  09430001
* *                                                                  *  09440001
* *    MAPPING FOR THE SUBSYSTEM RANK STATISTIC BUFFER               *  09450001
* *                                       Entire section added   @L3A*  09460001
* ****************************************************************** *  09470001
*                                                                       09480001
         AIF   ('&SSGBFRK' EQ 'NO').L0011                               09490001
         AIF   ('&DSECT' EQ 'YES').L0012                                09500001
         AIF   ('&SSGBFRK' NE 'YES').L0011                              09510001
* *******************************************************************   09520001
* *    Output buffer is a queue, anchored by SSGRSOAR, of rank      *   09530001
* *    performance statistics.  Each queue element represents data  *   09540001
* *    read from a single storage subsystem box that describes sets *   09550001
* *    of statistics.  The queue is a single threaded queue.  Each  *   09560001
* *    queue element needs to be freed by the caller of this        *   09570001
* *    interface.  Output buffer built for storage subsystem boxes  *   09580001
* *    that support rank performance statistics and are returned    *   09590001
* *    only if requested by caller (SSGRANKP) on a request for      *   09600001
* *    performance data (SSGRPD) for requests with scope of         *   09610001
* *    of subsystem (SSG1SS) or all subsystems (SSGALL).            *   09620001
*********************************************************************   09630001
SSGRBUFR DS    0D        Rank Statistics output buffer                  09640001
         AGO   .L0013                                                   09650001
.L0012   ANOP                                                           09660001
SSGRBUFR DSECT           Rank Statistics output buffer                  09670001
.L0013   ANOP                                                           09680001
SSGRHDR  DS    0CL56     Header info for rank statistics                09690001
SSGRQDAL DS    1AL4      Len of this queue element, header & data       09700001
SSGRQDAO DS    1AL4      Offset to the start of the statistics sets     09710001
SSGRFWDP DS    1AL4      Pointer to next queue element, zero is end     09720001
SSGRVOL  DS    1CL6      Volume serial of device that stats where      *09730001
                         read from                                      09740001
SSGRDEVN DS    1CL2      Device number of device that stats where      *09750001
                         read from                                      09760001
SSGRFLG  DS    1BL1                                                @12A 09770001
         ORG   SSGRFLG                                             @12A 09780001
SSGR_SCHST EQU X'30'     Subchannel Set Number                     @12A*09790001
                         SCHSET NUMBER 0 - 00                      @12A*09800001
                         SCHSET NUMBER 1 - 01                      @12A*09810001
                         SCHSET NUMBER 2 - 10                      @12A*09820001
                         SCHSET NUMBER 3 - 11                      @12A 09830001
         ORG   SSGRFLG+X'00000001'                                 @12A 09840001
         DS    1CL7      Reserved                                  @12C 09850001
SSGRRHDR DS    0CL28                                               @L4A 09860001
SSGRNSET DS    1FL2      Number of rank statistics sets available      *09870001
                         to be returned on the ESS starting from       *09880001
                         the first rank ID SSGRRID.                     09890001
SSGRLSET DS    1FL2      Size of each statistics set excluding size    *09900001
                         of array info SSGRRAR                          09910001
SSGRCUT  DS    1CL6      Control unit type                              09920001
SSGRCUM  DS    1CL3      Control unit model                             09930001
SSGRSEQ  DS    1CL10     Control unit sequence number                   09940001
SSGRVER  DS    1CL1      Version of rank statistics                @13C 09950001
SSGRARNM DS    1FL2      Num of array info sets avail to be returned   *09960001
                         on the ESS starting from first rank id SSGRRID 09970001
SSGRARSZ DS    1FL2      Size of each array information set SSGRRAR     09980001
*                        End of SSGRHDR header                          09990001
SSGRDADA DS    0C        Rank performance stats read                    10000001
SSGRRSTA DS    0CL56     Rank statistics array entry                    10010001
SSGRRKID DS    1FL2      Rank Identifier                                10020001
*     ***************************************************************   10030001
*     * The returned data consists of rank sets with each rank      *   10040001
*     * set containing one or more array information entries.       *   10050001
*     ***************************************************************   10060001
         ORG   SSGRRSTA                                                 10070001
SSGRRSTT DS    0CL56     Rank stats set entry mapping                   10080001
SSGRRID  DS    1FL2      Rank identifier                                10090001
SSGRRPNM DS    1FL2      Extent pool number                             10100001
SSGRRCNT DS    1FL1      Count of arrays in rank                        10110001
SSGRRRTQ DS    1BL1      Rank Type Qualifier                       @H4A 10120001
         ORG   SSGRRRTQ                                            @H4A 10130001
SSGRRDER EQU   X'80'     Data Encrypted Rank. When '1' bit position@H4A*10140001
                         is in X'80', the data stored on the       @H4A*10150001
                         physical media (i.e disk) is encrypted.   @H4A 10160001
SSGRRAPV EQU   X'01'     Adapter Pair ID Valid. When '1' bit       @11A*10170001
                         is in X'01', the Adapter Pair ID in Bytes @11A*10180001
                         6-7 is valid.                             @11A 10190001
         ORG   SSGRRRTQ+X'00000001'                                @H4A 10200001
SSGRRAPI DS    1FL2      Adapter Pair ID                           @11C 10210001
* *******************************************************************   10220001
* * In the statistics below bytes are accumulated in units of       *   10230001
* * 128 KB, and time is accumulated in units of 16 milliseconds     *   10240001
* *******************************************************************   10250001
SSGRRBYR DS    1F        Rank bytes read                                10260001
SSGRRBYW DS    1F        Rank bytes written                             10270001
SSGRRROP DS    1F        Rank read operations                           10280001
SSGRRWOP DS    1F        Rank write operations                          10290001
SSGRRKRT DS    1F        Rank read repsonse time                        10300001
SSGRRKWT DS    1F        Rank write response time                       10310001
SSGRRAR  DS    0CL24     Array information repeated, SSGRRCNT times     10320001
SSGRRAID DS    1FL2      Rank array id                                  10330001
SSGRREBC DS    1CL16     Array type in ebcdic                           10340001
SSGRRTYP DS    1FL1      Array type                                    *10350001
                          01 = RAID-5                                  *10360001
                          02 = RAID-10                                 *10370001
                          03 = RAID-6                                  *10380001
                          04-FF NOT USED                                10390001
SSGRRAWD DS    1FL1      Array width                                    10400001
SSGRRASP DS    1FL1      Array speed (1000 RPM)                         10410001
SSGRRACS DS    1BL1      Array Device Class and Array Status       @H4C 10420001
         ORG   SSGRRACS                                            @H4A 10430001
SSGRRADC EQU   X'C0'     Bit mask for Array Device Class           @H4A*10440001
                         Device Class                              @H4A*10450001
                         '00'b Enterprise                          @H4A*10460001
                         '01'b Near-line (An Advanced Technology   @H4A*10470001
                               Attachment (ATA) drive)             @H4A*10480001
                         '10'b SATA (Serial Advanced Technology    @H4A*10490001
                               Attachment (ATA) Drive)             @H4A*10500001
                         '11'b Solid State Drive (SSD)             @H4A 10510001
SSGRRAS1 EQU   X'20'     Raid Degraded.  One or more array         @H4A*10520001
                         members need rebuilding                   @H4A 10530001
SSGRRAS2 EQU   X'10'     DDM Throttling.  A Near-line DDM          @H4A*10540001
                         in the array is throttling                @H4A*10550001
                         performance due to temperature            @H4A*10560001
                         or workload.                              @H4A 10570001
SSGRRAS3 EQU   X'08'     RPM Exception.  A DDM with an             @H4A*10580001
                         slower RPM than the normal                @H4A*10590001
                         array DDMs is a member of                 @H4A*10600001
                         the array as a result of                  @H4A*10610001
                         a sparing action.                         @H4A 10620001
         ORG   SSGRRACS+X'00000001'                                @H4A 10630001
SSGRRACP DS    1FL2      Array capacity (GB)                            10640001
*                                                                       10650001
* ****************************************************************** *  10660001
* * SSGRDADA consists of table entries defined by SSGRDADA1          *  10670001
* * shown below when SSGRVER is decimal value of 1.                  *  10680001
* *                         Entire 88 bytes section is added by @13C *  10690001
* ****************************************************************** *  10700001
*                                                                       10710001
         ORG  SSGRDADA                                                  10720001
SSGRDADA1 DS   0CL88     Rank performance stats read                    10730001
SSGRRKID1 DS   1FL2      Rank Identifier                                10740001
*     ***************************************************************   10750001
*     * The returned data consists of rank sets with each rank      *   10760001
*     * set containing one or more array information entries.       *   10770001
*     ***************************************************************   10780001
         ORG   SSGRDADA1                                                10790001
SSGRRSTT1 DS   0CL88     Rank stats set entry mapping                   10800001
          DS   CL32      Mapped in SSGRRSTT                             10810001
SSGRARLT  DS   1F        Accumulated Rank Loading Time                  10820001
SSGRDTQC  DS   1F        Number of Times Destages were Queued due      *10830001
                         to Internal Processing                         10840001
SSGRDTQT  DS   1F        Accumulated Time Destages were Queued due     *10850001
                         to Internal Processing                         10860001
SSGRFCBR  DS   1F        Ver 01: Not used. Set to zero.                *10870001
                         Ver 02: Flash Copy Rank Bytes Read             10880001
SSGRFCBW  DS   1F        Ver 01: Not used. Set to zero.                *10890001
                         Ver 02: Flash Copy Rank Bytes Written          10900001
SSGRFCRO  DS   1F        Ver 01: Not used. Set to zero.                *10910001
                         Ver 02: Flash Copy Rank Read Operations        10920001
SSGRFCWO  DS   1F        Ver 01: Not used. Set to zero.                *10930001
                         Ver 02: Flash Copy Rank Write Operations       10940001
SSGRFCRR  DS   1F        Ver 01: Not used. Set to zero.                *10950001
                         Ver 02: Flash Copy Rank Read Response Time     10960001
SSGRRAR1  DS   0CL24     Array information repeated, SSGRRCNT times     10970001
SSGRRAID1 DS   1FL2      Rank array id                                  10980001
SSGRREBC1 DS   1CL16     Array type in ebcdic                           10990001
SSGRRTYP1 DS   1FL1      Array type                                    *11000001
                          01 = RAID-5                                  *11010001
                          02 = RAID-10                                 *11020001
                          03 = RAID-6                                  *11030001
                          04-FF NOT USED                                11040001
SSGRRAWD1 DS   1FL1      Array width                                    11050001
SSGRRASP1 DS   1FL1      Array speed (1000 RPM)                         11060001
SSGRRACS1 DS   1BL1      Array Device Class and Array Status            11070001
          ORG   SSGRRACS1                                               11080001
SSGRRADC1  EQU   X'C0'   Bit mask for Array Device Class               *11090001
                         Device Class                                  *11100001
                         '00'b Enterprise                              *11110001
                         '01'b Near-line (An Advanced Technology       *11120001
                               Attachment (ATA) drive)                 *11130001
                         '10'b SATA (Serial Advanced Technology        *11140001
                               Attachment (ATA) Drive)                 *11150001
                         '11'b Solid State Drive (SSD)                  11160001
SSGRRAS1S1 EQU  X'20'    Raid Degraded.  One or more array             *11170001
                         members need rebuilding                        11180001
SSGRRAS1S2 EQU  X'10'    DDM Throttling.  A Near-line DDM              *11190001
                         in the array is throttling                    *11200001
                         performance due to temperature                *11210001
                         or workload.                                   11220001
SSGRRAS1S3 EQU  X'08'    RPM Exception.  A DDM with an                 *11230001
                         slower RPM than the normal                    *11240001
                         array DDMs is a member of                     *11250001
                         the array as a result of                      *11260001
                         a sparing action.                              11270001
          ORG  SSGRRACS1+X'00000001'                                    11280001
SSGRRACP1 DS   1FL2      Array capacity (GB)                            11290001
*                                                                       11300001
* ****************************************************************** *  11310001
* * SSGRDADA consists of table entries defined by SSGRDADA2          *  11320001
* * shown below when SSGRVER is decimal value of 2.                  *  11330001
* *                        Entire 152 bytes section is added by @13C *  11340001
* ****************************************************************** *  11350001
*                                                                       11360001
         ORG  SSGRDADA                                                  11370001
SSGRDADA2 DS   0CL152    Rank performance stats read                    11380001
SSGRRKID2 DS   1FL2      Rank Identifier                                11390001
*     ***************************************************************   11400001
*     * The returned data consists of rank sets with each rank      *   11410001
*     * set containing one or more array information entries.       *   11420001
*     ***************************************************************   11430001
         ORG   SSGRDADA2                                                11440001
SSGRRSTT2 DS   0CL152    Rank stats set entry mapping                   11450001
          DS   CL64      Mapped in SSGRRSTT1                            11460001
SSGRFCRW  DS   1F        Flash Copy Rank Write Response Time            11470001
SSGRETBR  DS   1F        Easy Tier Rank Bytes Read                      11480001
SSGRETBW  DS   1F        Easy Tier Rank Bytes Written                   11490001
SSGRETRO  DS   1F        Easy Tier Rank Read Operations                 11500001
SSGRETWO  DS   1F        Easy Tier Rank Write Operations                11510001
SSGRETRR  DS   1F        Easy Tier Rank Read Response Time              11520001
SSGRETRW  DS   1F        Easy Tier Rank Write Response Time             11530001
SSGRCRBR  DS   1F        Cloud Rank Bytes Read                          11540001
SSGRCRBW  DS   1F        Cloud Rank Bytes Written                       11550001
SSGRCRRO  DS   1F        Cloud Rank Read Operations                     11560001
SSGRCRWO  DS   1F        Cloud Rank Write Operations                    11570001
SSGRCRRR  DS   1F        Cloud Rank Read Response Time                  11580001
SSGRCRRW  DS   1F        Cloud Rank Write Response Time                 11590001
SSGRRUPC  DS   1FL1      Rank Utilization Percentage              2@SGA 11600001
          DS   CL11      Reserved                                 2@SGC 11610001
SSGRRAR2  DS   0CL24     Array information repeated, SSGRRCNT times     11620001
SSGRRAID2 DS   1FL2      Rank array id                                  11630001
SSGRREBC2 DS   1CL16     Array type in ebcdic                           11640001
SSGRRTYP2 DS   1FL1      Array type                                    *11650001
                          01 = RAID-5                                  *11660001
                          02 = RAID-10                                 *11670001
                          03 = RAID-6                                  *11680001
                          04-FF NOT USED                                11690001
SSGRRAWD2 DS   1FL1      Array width                                    11700001
SSGRRASP2 DS   1FL1      Array speed (1000 RPM)                         11710001
SSGRRACS2 DS   1BL1      Array Device Class and Array Status            11720001
          ORG   SSGRRACS2                                               11730001
SSGRRADC2  EQU   X'C0'   Bit mask for Array Device Class               *11740001
                         Device Class                                  *11750001
                         '00'b Enterprise                              *11760001
                         '01'b Near-line (An Advanced Technology       *11770001
                               Attachment (ATA) drive)                 *11780001
                         '10'b SATA (Serial Advanced Technology        *11790001
                               Attachment (ATA) Drive)                 *11800001
                         '11'b Solid State Drive (SSD)                  11810001
SSGRRAS2S1 EQU  X'20'    Raid Degraded.  One or more array             *11820001
                         members need rebuilding                        11830001
SSGRRAS2S2 EQU  X'10'    DDM Throttling.  A Near-line DDM              *11840001
                         in the array is throttling                    *11850001
                         performance due to temperature                *11860001
                         or workload.                                   11870001
SSGRRAS2S3 EQU  X'08'    RPM Exception.  A DDM with an                 *11880001
                         slower RPM than the normal                    *11890001
                         array DDMs is a member of                     *11900001
                         the array as a result of                      *11910001
                         a sparing action.                              11920001
          ORG  SSGRRACS2+X'00000001'                                    11930001
SSGRRACP2 DS   1FL2      Array capacity (GB)                            11940001
*                                                                       11950001
.L0011   ANOP                                                           11960001
*                                                                       11970001
* ****************************************************************** *  11980001
* *                                                                  *  11990001
* *    MAPPING FOR THE SUBSYSTEM EXTENT POOL STATISTIC BUFFER        *  12000001
* *                                       Entire section added   @L3A*  12010001
* ****************************************************************** *  12020001
*                                                                       12030001
         AIF   ('&SSGBUFS' EQ 'NO').L0014                               12040001
         AIF   ('&DSECT' EQ 'YES').L0015                                12050001
         AIF   ('&SSGBUFS' NE 'YES').L0014                              12060001
* *******************************************************************   12070001
* *                                                                 *   12080001
* *    Output buffer is a queue, anchored by SSGSPOAR, of Extent    *   12090001
* *    pool perf statistics.  Each queue element represents data    *   12100001
* *    read from a single storage subsystem box that describes sets *   12110001
* *    of statistics.  The queue is a single threaded queue.  Each  *   12120001
* *    queue element needs to be freed by the caller of this        *   12130001
* *    interface.  Output buffer built for storage subsystem boxes  *   12140001
* *    that support rank performance statistics and are returned    *   12150001
* *    only if requested by caller (SSGSEGMP) on a request for      *   12160001
* *    performance data (SSGRPD) for requests with scope of         *   12170001
* *    of subsystem (SSG1SS) or all subsystems (SSGALL).            *   12180001
* *                                        Entire section added @L3A*   12190001
* *******************************************************************   12200001
SSGSBUFR DS    0D        Extent Pool Statistics output buffer           12210001
         AGO   .L0016                                                   12220001
.L0015   ANOP                                                           12230001
SSGSBUFR DSECT           Extent Pool Statistics output buffer           12240001
.L0016   ANOP                                                           12250001
SSGSHDR  DS    0CL56     Header info for Extent Pool statistics         12260001
SSGSQDAL DS    1AL4      Len of this queue element, header & data       12270001
SSGSQDAO DS    1AL4      Offset to the start of the statistics sets     12280001
SSGSFWDP DS    1AL4      Pointer to next queue element, zero is end     12290001
SSGSVOL  DS    1CL6      Volume serial of device that stats where      *12300001
                         read from                                      12310001
SSGSDEVN DS    1CL2      Device number of device that stats where      *12320001
                         read from                                      12330001
SSGSSFLG  DS   1BL1                                                @12A 12340001
         ORG   SSGSSFLG                                            @12A 12350001
SSGSS_SCHST EQU X'30'    Subchannel Set Number                     @12A*12360001
                         SCHSET NUMBER 0 - 00                      @12A*12370001
                         SCHSET NUMBER 1 - 01                      @12A*12380001
                         SCHSET NUMBER 2 - 10                      @12A*12390001
                         SCHSET NUMBER 3 - 11                      @12A 12400001
         ORG   SSGSSFLG+X'00000001'                                @12A 12410001
         DS    1CL7      Reserved                                  @12C 12420001
SSGSSHDR DS    0CL28                                               @L4A 12430001
SSGSNSET DS    1FL2      Number of extent pool statistic sets     2@15C 12440001
SSGSLSET DS    1FL2      Size of each statistics set                    12450001
SSGSCUT  DS    1CL6      Control unit type                              12460001
SSGSCUM  DS    1CL3      Control unit model                             12470001
SSGSSEQ  DS    1CL10     Control unit sequence number                   12480001
SSGSVER  DS    1CL1      Version of link statistics                     12490001
SSGSFLG  DS    1BL1      Flags                                          12500001
         ORG   SSGSFLG                                            2@15A 12510001
SSGSVLD  EQU   X'80'     Extent pool statistics valid             2@15C*12520001
                         When set to one, SSGSSRSC, SSGSSVCP,     2@15C*12530001
                         SSGSSNMV, SSGSSVSC, SSGSSSDY, and        2@15C*12540001
                         SSGSSTDY are valid.                      2@15C 12550001
SSGSVLD2 EQU   X'40'     Extent pool statistics valid 2           2@16A*12560001
                         When set to one, SSGSSEPS, SSGSSBCE,     2@16A*12570001
                         and SSGSSBAE are valid.                  2@16A 12580001
         ORG   SSGSFLG+X'00000001'                                2@15A 12590001
         DS    1CL3      Not used                                 2@15C 12600001
*                        End of SSGSHDR information                     12610001
SSGSDADA DS    0C        Extent pool performance stats read             12620001
SSGSSSTA DS    0CL52     Extent pool stats array entry                  12630001
SSGSSGID DS    1FL2      Extent pool identifier                         12640001
         ORG   SSGSSSTA                                                 12650001
SSGSSSTT DS    0CL52     Extent pool statistics entry includes         *12660001
                         one or more entry                              12670001
SSGSSPID DS    1FL2      Extent pool identifier                         12680001
SSGSSPLT DS    1FL1      Extent pool type                              *12690001
                          Hex  Description                         @15C*12700001
                          04   FB 1 GB                                 *12710001
                          84   CKD 1 GB (1113 cylinders)          2@16C 12720001
SSGSSPTQ DS    1BL1      Extent Pool Type Qualifier                @H4C 12730001
         ORG SSGSSPTQ                                              @H4A 12740001
SSGSSDEP EQU   X'80'     Data Encrypted Extent Pool.               @H4A*12750001
                         When '1', the data stored on              @H4A*12760001
                         the physical media (i.e disk)             @H4A*12770001
                         is encrypted.                             @H4A 12780001
SSGSSETS EQU   X'40'     Tiered Storage.                          2@15A*12790001
                         When '1', the Extent Pool contains       2@15A*12800001
                         multiple disk storage classes.           2@15A 12810001
SSGSSESV EQU   X'01'     Extent Sizes Valid                        @15A*12820001
                         When '1', SSGSSEPS contains the           @15A*12830001
                         extent sizes in the Extent Pool.          @15A 12840001
         ORG SSGSSPTQ+X'00000001'                                  @H4A 12850001
SSGSSCAP DS    1F        Real extent pool capacity (GB)                 12860001
SSGSSNMS DS    1F        Num real extents in extent pool                12870001
SSGSSNMA DS    1F        Num real allocated extents in extent pool      12880001
SSGSSRSC DS    1F        Number of Extents Allocated              2@16C*12890001
                         (Real Extent Conversions)                2@16C 12900001
SSGSSVCP DS    1F        Virtual extent pool capacity (GB)              12910001
SSGSSNMV DS    1F        Number of virtual extents in extent pool       12920001
SSGSSVSC DS    1F        Number of Extents Freed                  2@16C*12930001
                         (Virtual Extent Conversions)             2@16C 12940001
SSGSSSDY DS    1F        Number of extents that were                   *12950001
                         sources of a dynamic extent relocation    @15C 12960001
SSGSSTDY DS    1F        Number of extents that were                   *12970001
                         targets of a dynamic extent relocation    @15C 12980001
SSGSSEPS DS    1BL1      Extent Sizes in Extent Pool               @15A 12990001
         ORG SSGSSEPS                                              @15A 13000001
SSGS01GB EQU   X'40'     1 GB Extents (CKD 1113 cylinders)        2@16C 13010001
SSGS16MB EQU   X'01'     16 MB Extents (CKD 21 cylinders)         2@16C 13020001
         ORG SSGSSEPS+X'00000001'                                  @15A 13030001
         DS    1CL3      Not used                                 2@16C 13040001
SSGSSBCE DS    1F        Safeguarded Copy Virtual Backup          2@16A*13050001
                         Capacity Extents                         2@16A 13060001
SSGSSBAE DS    1F        Safeguarded Copy Backup Allocated Extents2@16A 13070001
*                                                                       13080001
.L0014   ANOP                                                           13090001
*                                                                       13100001
* ****************************************************************** *  13110001
* *                                                                  *  13120001
* *    MAPPING FOR THE SPACE EFFICIENT VOLUME STATISTICS             *  13130001
* *                                       Entire section added   @L4A*  13140001
* ****************************************************************** *  13150001
*                                                                       13160001
         AIF   ('&SSGSEBUF' EQ 'NO').L0017                              13170001
         AIF   ('&DSECT' EQ 'YES').L0018                                13180001
         AIF   ('&SSGSEBUF' NE 'YES').L0017                             13190001
* *******************************************************************   13200001
* *                                                                 *   13210001
* *  MAPPING FOR THE SPACE EFFICIENT VOLUME STATUS                  *   13220001
* *    OUTPUT BUFFER                                                *   13230001
* *                                                                 *   13240001
* *    Output buffer is a queue, anchored by SSGSEOAR, of Space     *   13250001
* *  Efficient Volume (SEVOL) status. Each queue element represents *   13260001
* *  status of the space efficient volume specified in the header.  *   13270001
* *    The queue is a single threaded queue.  Each queue element    *   13280001
* *    needs to be freed by the caller of this interface.           *   13290001
* *  Output buffer is built for SEVOL(s) when SEVOL status is       *   13300001
* *  requested  (SSGSEV=ON).                                        *   13310001
* *   Caller sets the scope of SEVOL(s) by turning one of flag bit  *   13320001
* *  that is the single device (SSGDEV), subsystem (SSG1SS),        *   13330001
* *  or all subsystems (SSGALL).  For a single SEVOL status request,*   13340001
* *  the SEVOL status can be obtain when the path of SEVOL is       *   13350001
* *  available.   For a subsystem and all systems scope,            *   13360001
* *  the SEVOL status is available when SEVOL is ONLINE.            *   13370001
* *   When the scope is the single device (SSGDEV=ON) and           *   13380001
* *  the Fix Block SEVOL is requested (SSGURFBD=ON),  the status    *   13390001
* *  of FB SEVOL oriented by LSS (SSGFBLSS) and Device              *   13400001
* *  (SSGFBDEV) is reported.  FB SEVOL status is not available      *   13410001
* *  with the scope of the subsystem (SSG1SS=ON) and                *   13420001
* *  the all subsystems (SSGALL=ON).   FB SEVOL status is available *   13430001
* *  when LSS number of both the I/O device (SSGAVOL or SSGDDN) and *   13440001
* *  FB SEVOL are numbered in the same even or odd number.          *   13450001
* *                                                                 *   13460001
* *  Flag and variable combinations of SEVOL status request         *   13470001
* *  are shown as below railroad chart.                             *   13480001
* *                                                                 *   13490001
* *  >>_SSGSEV_ _SSGALL________ ________________> (A)               *   13500001
* *            !_SSG1SS________!                                    *   13510001
* *            !                                                    *   13520001
* *            !_SSGDEV_ ____________________ __> (B)               *   13530001
* *                     !_SSGFBLSS__SSGFBDEV_!                      *   13540001
* *                                                                 *   13550001
* *                                                                 *   13560001
* *       (A)>__ _SSGAVOL__SSGUNIT__ __ __________________><        *   13570001
* *             !_SSGADDN___________!  !                            *   13580001
* *                                    !                            *   13590001
* *                                    !                            *   13600001
* *       (B)>__ _SSGAVOL__SSGUNIT__ __!                            *   13610001
* *             !_SSGADDN___________!                               *   13620001
* *             !_SSGAVOL__SSGOFFL__!                               *   13630001
* *                                                                 *   13640001
* *                                        Entire section added @L4A*   13650001
* *******************************************************************   13660001
SSGSEBUF DS    0D        Space Efficient Volume status output buffer    13670001
         AGO   .L0019                                                   13680001
.L0018   ANOP                                                           13690001
SSGSEBUF DSECT           Space Efficient Volume status output buffer    13700001
.L0019   ANOP                                                           13710001
SSGSEHDR DS    0CL68     Queue element header                      @TPC 13720001
SSGSEQAL DS    1F        Length of this queue element header plus data  13730001
SSGSEQAO DS    1F        Offset to the start of the statistics sets     13740001
SSGSEFWP DS    1AL4      Pointer to next queue element,                *13750001
                         when zero end of queue                         13760001
SSGSEVOL DS    1CL0006   Volume serial of device where read from        13770001
SSGSEDEV DS    1CL0002   Device number of device where read from        13780001
SSGSESCX DS    1CL0002   Subsystem ID                                   13790001
         DS    1CL2      Not used                                       13800001
SSGSETTL DS    1F        Total SE VOL Count, only valid for head of    *13810001
                         buffer chain                                   13820001
SSGSVHDR DS    0CL0028   SE VOL header                                  13830001
SSGSESZ  DS    1FL2      Size of data                                   13840001
SSGSECUT DS    1CL0006   Control unit type                              13850001
SSGSECUM DS    1CL0003   Control unit model                             13860001
SSGSECUC DS    1CL0003   Control unit maker/company                @L5A 13870001
SSGSECUP DS    1CL0002   Control unit plant                        @L5A 13880001
SSGSESEQ DS    1CL0012   Control unit sequence number              @L5C 13890001
*                                                                       13900001
SSGSEETL DS    1F        Total ESE VOL Count, only valid for head of   *13910001
                         buffer chain                              @TPA 13920001
SSGSESTL DS    1F        Total STD VOL Count, only valid for head of   *13930001
                         buffer chain                              @TPA 13940001
SSGSALCM DS    1CL0003   Allocation Method                         @TPA 13950001
SSGSGFLG DS    1BL1      Flag byte 1                               @SGC 13960001
         ORG   SSGSGFLG                                            @SGC 13970001
SSGSGCBI EQU   X'80'     Report SGC Backup Vol Info                @SGC 13980001
         ORG   SSGSGFLG+X'00000001'                                @SGC 13990001
SSGSEDAD DS    0CL0060   SE Vol statistics                         @16C 14000001
********************************************************************    14010001
*  Specified Volume                                            @SGA*    14020001
********************************************************************    14030001
SSGSEFLG DS    1BL1      Flag byte 1                                    14040001
         ORG   SSGSEFLG                                                 14050001
SSGSEVF  EQU   X'80'     ON=TSE Volume                             @16C 14060001
SSGSEAN  EQU   X'40'     Space currently allocated is not available@L5A 14070001
SSGSEEV  EQU   X'20'     ON=ESE Volume                             @16C 14080001
SSGSEBV  EQU   X'10'     ON=Info reported is for Backup Volume     @16A 14090001
SSGSEBE  EQU   X'08'     ON=Backup Volume Expanding                @16A 14100001
         ORG   SSGSEFLG+X'00000001'                                     14110001
         DS    1CL0001   not used                                       14120001
SSGSEEP  DS    1CL0002   Extent Pool ID                                 14130001
********************************************************************    14140001
*  The following two fields are a remaining percentage of usable   *    14150001
*  space that will initiate a notification to the host             *    14160001
********************************************************************    14170001
SSGSECWW DS    1FL1      Capacity Limit Warning Watermark          @SGC 14180001
SSGSEGWW DS    1FL1      Guaranteed Capacity Warning Watermark     @SGC 14190001
         DS    1CL0002   not used                                       14200001
********************************************************************    14210001
*  The following fields are expressed in number of cylinders for   *    14220001
*  CKD device.   The following fields are expressed in TENTH of    *    14230001
*  binary Gigabytes for Fix Block device.                          *    14240001
********************************************************************    14250001
SSGSEC   DS    1F        SE Volume Capacity Limit                  @SGC 14260001
SSGSEG   DS    1F        SE Volume Guaranteed Capacity             @SGC 14270001
SSGSESCA DS    1F        Space Currently Allocated in this Volumes @SGC*14280001
                         Extent Pool                               @SGC 14290001
SSGSEEPR DS    1F        Size of Space to Configure Volumes        @SGC 14300001
SSGSECAP DS    1F        SE Volume Capacity                        @SGC 14310001
********************************************************************    14320001
*  Backup Volume                                                   *    14330001
*                                         Entire section added @SGA*    14340001
********************************************************************    14350001
SSGSEFLGB DS    1BL1     Flag byte 1                                    14360001
          ORG   SSGSEFLGB                                          @16C 14370001
SSGSEVFB EQU   X'80'     ON=TSE Volume                             @16A 14380001
SSGSEANB EQU   X'40'     Space currently allocated is not available@16A 14390001
SSGSEEVB EQU   X'20'     ON=ESE Volume                             @16A 14400001
SSGSEBVB EQU   X'10'     ON=Info reported is for Backup Volume     @16C 14410001
SSGSEBEB EQU   X'08'     ON=Backup Volume Expanding                @16A 14420001
          ORG   SSGSEFLGB+X'00000001'                                   14430001
          DS    1CL0001  not used                                       14440001
SSGSEEPB  DS    1CL0002  Extent Pool ID                                 14450001
********************************************************************    14460001
*  The following two fields are a remaining percentage of usable   *    14470001
*  space that will initiate a notification to the host             *    14480001
********************************************************************    14490001
SSGSECWWB DS    1FL1     Capacity Limit Warning Watermark               14500001
SSGSEGWWB DS    1FL1     Guaranteed Capacity Warning Watermark          14510001
          DS    1CL0002  not used                                       14520001
********************************************************************    14530001
*  The following fields are expressed in number of cylinders for   *    14540001
*  CKD device.   The following fields are expressed in TENTH of    *    14550001
*  binary Gigabytes for Fix Block device.                          *    14560001
********************************************************************    14570001
SSGSECB   DS    1F       SE Volume Capacity Limit                       14580001
SSGSEGB   DS    1F       SE Volume Guaranteed Capacity                  14590001
SSGSESCAB DS    1F       Space Currently Allocated in this Volumes     *14600001
                         Extent Pool                                    14610001
SSGSEEPRB DS    1F       Size of Space to Configure Volumes             14620001
SSGSECAPB DS    1F       SE Volume Capacity                             14630001
SSGSESEQB DS    1F       Sequence Number of the last Consistency   @16A*14640001
                         Group in the prior SGC Backup Capacity    @16A*14650001
                         Volume Size                               @16A 14660001
*                                                                       14670001
.L0017  ANOP                                                            14680001
*                                                                       14690001
* ****************************************************************** *  14700001
* *                                                                  *  14710001
* *    MAPPING FOR THE EXTENT POOL CONFIGURATION STATUS              *  14720001
* *    OUTPUT BUFFER                                                 *  14730001
* *                                       Entire section added   @L4A*  14740001
* ****************************************************************** *  14750001
*                                                                       14760001
         AIF   ('&SSGEPBUF' EQ 'NO').L0020                              14770001
         AIF   ('&DSECT' EQ 'YES').L0021                                14780001
         AIF   ('&SSGEPBUF' NE 'YES').L0020                             14790001
* *******************************************************************   14800001
* *                                                                 *   14810001
* *    MAPPING FOR THE EXTENT POOL CONFIGURATION STATUS             *   14820001
* *    OUTPUT BUFFER                                                *   14830001
* *                                                                 *   14840001
* *    Output buffer is a queue, anchored by SSGEPOAR, of Extent    *   14850001
* *    Pool Configuration status.  Each queue element represents    *   14860001
* *    the status of the Extent Pools defined in Storage Facility   *   14870001
* *    image. If the caller provide a Extent Pool ID ( SSGEPID      *   14880001
* *    has value between '0'X and 'FFFE'X ), then in addition to    *   14890001
* *    the summary status of Extent Pools,  the detail status of    *   14900001
* *    that Extent Pool identified by Extent Pool ID is presented.  *   14910001
* *    caller is responsible for freeing the output buffer.         *   14920001
* *                                                                 *   14930001
* *    The flag and variable combinations for EPC status is         *   14940001
* *    shown as below railroad chart.                               *   14950001
* *                                                                 *   14960001
* *                Below variable defines scope                     *   14970001
* *                                                                 *   14980001
* *   >>__SSGEPC__ _SSGEPID=('FFFF'X)________________________>(A)   *   14990001
* *               !_SSGEPID=('0'X to 'FFFE'X of even number)_>(B)   *   15000001
* *               !_SSGEPID=('1'X to 'FFFD'X of odd number)__>(C)   *   15010001
* *                                                                 *   15020001
* *                                                                 *   15030001
* *    (A)>_____________________________________________ _______>   *   15040001
* *    (B)>_(Even LSS I/O dev follows)_ _ ___________ __!           *   15050001
* *    (C)>_(Odd LSS I/O dev follows)__! !_SSGURBMP__!              *   15060001
* *                                                                 *   15070001
* *       Following variable and flag represent I/O device          *   15080001
* *                                                                 *   15090001
* *    >______ _SSGAVOL__SSGUNIT__ ______________________________>< *   15100001
* *           !_SSGADDN___________!                                 *   15110001
* *           !_SSGAVOL__SSGOFFL__!                                 *   15120001
* *                                                                 *   15130001
* *                                        Entire section added @L4A*   15140001
* *******************************************************************   15150001
SSGEPBUF DS    0D        EPC status output buffer                       15160001
         AGO   .L0022                                                   15170001
.L0021   ANOP                                                           15180001
SSGEPBUF DSECT           EPC status output buffer                       15190001
.L0022   ANOP                                                           15200001
*                                                                       15210001
SSGEHDR  DS    0CL0044   Queue element header                      @SGC 15220001
SSGEPQAL DS    1F        Length of this queue element, header plus data 15230001
SSGEPQAO DS    1F        Offset to the start of the statistics sets     15240001
SSGEPFWD DS    1AL4      Pointer to next queue element,            @L6C*15250001
                         when zero end of queue                    @L6A 15260001
*                                                                       15270001
*        Orientation to device that status pertain                      15280001
SSGEPVOL DS    1CL0006   Volume serial of device where read from        15290001
SSGEPDEV DS    1CL0002   Device number of device where read from        15300001
SSGEPIDC DS    1XL2      EP ID provided by caller                       15310001
         DS    1CL0006   Reserved                                       15320001
*                                                                       15330001
SSGEPSIP DS    1AL4      Internal code use only.                   @L6C*15340001
                         Branch Entry caller shall set zero.       @L6C 15350001
SSGEPSI1P DS   1AL4      Internal code use only.                   @SGA*15360001
                         Branch Entry caller shall set zero.       @SGA 15370001
SSGEPSI2P DS   1AL4      Internal code use only.                   @SGA*15380001
                         Branch Entry caller shall set zero.       @SGA 15390001
SSGEPSDO DS    1FL2      Offset to Summary data                    @L6A 15400001
SSGEPDDO DS    1FL2      Offset to Detail data                     @L6A 15410001
*                                                                       15420001
SSGEPDAD DS    0C        Ext Pool Config status                         15430001
SSGEPDHL DS    0CL0032   FIXED LENGTH OF EPC DATA HDR                   15440001
SSGEPLEN DS    1FL2      Length of data returned                        15450001
SSGEPCNT DS    1FL2      Count of Extent Pools                          15460001
SSGEPFL1 DS    1BL2      HEADER FLAGS                                   15470001
         ORG   SSGEPFL1                                                 15480001
SSGEPIDV EQU   X'8000'   EXT POOL DETAILED DATA VALID                   15490001
SSGEPLSS EQU   X'4000'   Bitmap represents even LSS's when set    2@15C*15500001
                         to zero and odd LSS's when set to one.   2@15C 15510001
SSGEPCC  EQU   X'2000'   Specified Extent Pool ID owned by        2@15C*15520001
                         Partner CEC, no data reported in Extent  2@15C*15530001
                         Pool Detailed Information                2@15C 15540001
         ORG   SSGEPFL1+X'00000002'                                     15550001
SSGEPCUT DS    1CL0006   Control unit type                              15560001
SSGEPCUM DS    1CL0003   Control unit model                             15570001
SSGEPCUC DS    1CL0003   Control unit maker/company                     15580001
SSGEPCUP DS    1CL0002   Control unit plant                             15590001
SSGEPSEQ DS    1CL0012   Control unit sequence number                   15600001
* *******************************************************************   15610001
* * The format of the next eight bytes is repeated the number       *   15620001
* * times as indicated by SSGEPCNT.                                 *   15630001
* *******************************************************************   15640001
SSGEPSUM DS    0C        Ext Pool summary data                          15650001
SSGEPIDS DS    1CL0002   Extent Pool ID                                 15660001
SSGEPRWP DS    1FL1      SE Repository Capacity Available Warning      *15670001
                         Percentage                                @SGC 15680001
SSGEPFWP DS    1FL1      Real Extent Threshold Percentage          @SGC 15690001
SSGEPFLG DS    1BL2      Extent Pool Summary Flags                 @SGC 15700001
         ORG   SSGEPFLG                                                 15710001
SSGEPFB  EQU   X'8000'   Extent Pool Type                          @SGC 15720001
SSGEPRC  EQU   X'4000'   TSE Volumes Repository Configured         @SGC 15730001
SSGEOPV  EQU   X'2000'   ESE Volumes Configured                    @SGC 15740001
SSGESTD  EQU   X'1000'   STD (FP) Volumes Configured               @SGA 15750001
SSGEESV  EQU   X'0800'   Extent Sizes Valid                       2@15C*15760001
                         When set to one, SSGEESZ contains the    2@15C*15770001
                         extent sizes in the Extent Pool.         2@15C 15780001
SSGEPWP  EQU   X'0400'   Real Capacity at or below Warning         @SGC*15790001
                         Percentage                                @SGC 15800001
SSGEPF   EQU   X'0200'   No Available Real Capacity (i.e. Full)    @SGC 15810001
SSGESGC  EQU   X'0100'   SGC Backup Volumes Configured             @SGA 15820001
         ORG   SSGEPFLG+X'00000002'                                     15830001
SSGEESZ  DS    1BL1      Extent Sizes in Extent Pool              2@15C 15840001
         ORG SSGEESZ                                              2@15A 15850001
SSGES01GB EQU  X'40'     1 GB Extents                             2@15C 15860001
SSGES16MB EQU  X'01'     16 MB Extents                            2@15C 15870001
         ORG SSGEESZ+X'00000001'                                  2@15A 15880001
         DS    1CL0001   Not Used                                  @SGC 15890001
*                                                                       15900001
         ORG   SSGEPSUM                                                 15910001
*                                                                       15920001
.L0020   ANOP                                                           15930001
*                                                                       15940001
* *******************************************************************   15950001
* *                                                                 *   15960001
* *    MAPPING FOR THE DETAIL STATUS OUTPUT BUFFER FOR              *   15970001
* *    EXTENT POOL CONFIGURATION                                    *   15980001
* *                                       Entire section added  @L4A*   15990001
* *******************************************************************   16000001
*                                                                       16010001
         AIF   ('&SSGEPDAT' EQ 'NO').L0023                              16020001
         AIF   ('&DSECT' EQ 'YES').L0024                                16030001
         AIF   ('&SSGEPDAT' NE 'YES').L0023                             16040001
SSGEPDAT DS    0D        EPC detail output buffer                       16050001
         AGO   .L0025                                                   16060001
.L0024   ANOP                                                           16070001
SSGEPDAT DSECT           EPC detail output buffer (Version 1)      @SGC 16080001
.L0025   ANOP                                                           16090001
*                                                                       16100001
SSGEPIDD DS    1XL2      Ext Pool ID for detailed data                  16110001
SSGEPDFG DS    1BL1      Extent Pool Detailed Flags                     16120001
         ORG   SSGEPDFG                                            @L5A 16130001
SSGEPARN EQU   X'80'     SE Repository Capacity is Not Available   @SGC 16140001
SSGEPRAW EQU   X'40'     SE Repository at or below Warning         @SGC*16150001
                         Percentage                                @SGC 16160001
SSGEPRF  EQU   X'20'     No Available SE Repository Capacity       @SGC*16170001
                         (i.e. full)                               @SGC 16180001
SSGEPESV EQU   X'10'     Extent Sizes Valid                       2@15C*16190001
                         When set to one, SSGEPESZ contains the   2@15C*16200001
                         extent sizes in the Extent Pool.         2@15C 16210001
         ORG   SSGEPDFG+X'00000001'                                @L5C 16220001
SSGEPESZ DS    1BL1      Extent Sizes in Extent Pool              2@15C 16230001
         ORG SSGEPESZ                                             2@15A 16240001
SSGED01GB EQU  X'40'     1 GB Extents                             2@15C 16250001
SSGED16MB EQU  X'01'     16 MB Extents                            2@15C 16260001
         ORG SSGEPESZ+X'00000001'                                 2@15A 16270001
* *******************************************************************   16280001
* * The following fields are expressed in number of cylinders for   *   16290001
* * CKD device.   The following fields are expressed in TENTH of    *   16300001
* * binary Gigabytes for Fix Block device.                          *   16310001
* *******************************************************************   16320001
SSGEPSZ  DS    1F        Sizes of Extent Pool                      @SGC 16330001
SSGEALOC DS    1F        Space Currently Allocated in Extent Pool  @SGC 16340001
SSGEPRSZ DS    1F        Size of TSE Extent Pool Repository        @SGC 16350001
SSGEPRAL DS    1F        Space Currently Allocated in TSE Extent   @SGC*16360001
                         Pool Repository                           @SGC 16370001
SSGEPGSZ DS    1F        Amount of Guaranteed Space in Repository       16380001
SSGEPGAL DS    1F        Allocated Guaranteed Capacity             @SGC 16390001
* *******************************************************************   16400001
* * The next three fields are 32k bitmaps                           *   16410001
* *******************************************************************   16420001
SSGENORM DS    1CL4096   Standard (Fully Provisioned) Volumes      @SGC 16430001
SSGEPOPV DS    1CL4096   Extent Space Efficient Volumes            @SGC 16440001
SSGEPSEV DS    1CL4096   Track Space Efficient Volumes             @SGC 16450001
*                                                                       16460001
* *******************************************************************   16470001
* * EPC detail output buffer (Version 2)                            *   16480001
* *                                        Entire section added @SGA*   16490001
* *******************************************************************   16500001
*                                                                       16510001
          ORG  SSGEPDAT                                                 16520001
SSGEPDV2  DS   0CL16512  EPC Detail Data                                16530001
SSGEPIDD2 DS   1XL2      Ext Pool ID for detailed data                  16540001
SSGEPDFG2 DS   1BL1      Extent Pool Detailed Flags                     16550001
          ORG  SSGEPDFG2                                                16560001
SSGEPARN2 EQU  X'80'     SE Repository Capacity is Not Available        16570001
SSGEPRAW2 EQU  X'40'     SE Repository at or below Warning             *16580001
                         Percentage                                     16590001
SSGEPRF2  EQU  X'20'     No Available SE Repository Capacity            16600001
SSGEPESV2 EQU  X'10'     Extent Sizes Valid                       2@15C*16610001
                         When set to one, SSGEPESZ2 contains the  2@15C*16620001
                         extent sizes in the Extent Pool.         2@15C 16630001
         ORG   SSGEPDFG2+X'00000001'                                    16640001
SSGEPESZ2 DS   1BL1      Extent Sizes in Extent Pool              2@15C 16650001
         ORG SSGEPESZ2                                            2@15A 16660001
SSGED01GB2 EQU X'40'     1 GB Extents                             2@15C 16670001
SSGED16MB2 EQU X'01'     16 MB Extents                            2@15C 16680001
         ORG SSGEPESZ2+X'00000001'                                2@15A 16690001
* *******************************************************************   16700001
* * The following fields are expressed in number of cylinders for   *   16710001
* * CKD device.   The following fields are expressed in TENTH of    *   16720001
* * binary Gigabytes for Fix Block device.                          *   16730001
* *******************************************************************   16740001
SSGEPSZ2  DS   1F        Physical Size of Extent Pool                   16750001
SSGEALOC2 DS   1F        Space Currently Allocated in Extent Pool       16760001
SSGEPRSZ2 DS   1F        Size of TSE Extent Pool Repository             16770001
SSGEPRAL2 DS   1F        Space Currently Allocated in TSE Extent       *16780001
                         Pool Repository                                16790001
SSGEPGSZ2 DS   1F        Amount of Guaranteed Space in Repository       16800001
SSGEPGAL2 DS   1F        Allocated Guaranteed Capacity                  16810001
SSGEPECC2 DS   1F        ESE Volumes Capacity Configured                16820001
SSGEPTCC2 DS   1F        TSE Volumes Capacity Configured                16830001
SSGEPFCC2 DS   1F        STD (FP) Volumes Capacity Configured           16840001
SSGEPRMC2 DS   1F        Amount of Real Capacity consumed in           *16850001
                         provisioning Metadata Virtual Capacity         16860001
SSGEPECU2 DS   1F        ESE Volumes Capacity Consumed                  16870001
SSGEPSVC2 DS   1F        Size of Customer Virtual Capacity Configured  *16880001
                         in Extent Pool                                 16890001
          DS   1CL0004   Not Used                                       16900001
SSGEPVCP2 DS   1F        Customer Virtual Capacity in Preparation      *16910001
                         Phase                                          16920001
SSGEPPCP2 DS   1F        Amount of Physical Capacity in Preparation    *16930001
                         Phase                                          16940001
SSGEPCPI2 DS   1F        Amount of Capacity Performing Initialization   16950001
SSGEPSCC2 DS   1F        SGC Backup Volumes Capacity Configured         16960001
SSGEPSCU2 DS   1F        SGC Backup Volumes Capacity Consumed           16970001
          DS   1CL0052   Reserved                                       16980001
* *******************************************************************   16990001
* * The next four fields are 32k bitmaps                            *   17000001
* *******************************************************************   17010001
SSGENORM2 DS   1CL4096   Standard (Fully Provisioned) Volumes           17020001
SSGEPOPV2 DS   1CL4096   Extent Space Efficient Volumes                 17030001
SSGEPSEV2 DS   1CL4096   Track Space Efficient Volumes                  17040001
SSGEPSGC2 DS   1CL4096   Safeguarded Copy Backup Volumes                17050001
*                                                                       17060001
* *******************************************************************   17070001
* * EPC detail output buffer (Version 3)                            *   17080001
* *                                        Entire section added @SGA*   17090001
* *******************************************************************   17100001
*                                                                       17110001
          ORG  SSGEPDAT                                                 17120001
SSGEPDV3  DS   0CL16896  EPC Detail Data                                17130001
SSGEPIDD3 DS   1XL2      Ext Pool ID for detailed data                  17140001
SSGEPDFG3 DS   1BL2      Extent Pool Detailed Flags                     17150001
          ORG  SSGEPDFG3                                                17160001
SSGEPFB3  EQU  X'8000'   Extent Pool Type                               17170001
SSGEPRC3  EQU  X'4000'   TSE Volumes Repository Configured              17180001
SSGEOPV3  EQU  X'2000'   ESE Volumes Configured                         17190001
SSGESTD3  EQU  X'1000'   STD (FP) Volumes Configured                    17200001
SSGEESV3  EQU  X'0800'   Extent Sizes Valid                       2@15C*17210001
                         When set to one, SSGEPESZ3 contains the  2@15C*17220001
                         extent sizes in the Extent Pool.         2@15C 17230001
SSGRCWP3  EQU  X'0400'   Real Capacity at or below Warning Percentage   17240001
SSGRCF3   EQU  X'0200'   No Available Real Capacity (i.e. full)         17250001
SSGEPRAW3 EQU  X'0100'   SE Repository at or below Warning Percentage   17260001
SSGEPRF3  EQU  X'0080'   No Available SE Repository Capacity           *17270001
                         (i.e. full)                                    17280001
SSGESGC3  EQU  X'0040'   SGC Backup Volumes Configured                  17290001
SSGEPARN3 EQU  X'0002'   SE Repository Capacity is Not Available        17300001
SSGEPRIS3 EQU  X'0001'   SE Repository contains Inaccessible Space      17310001
         ORG   SSGEPDFG3+X'00000002'                                    17320001
SSGEPETP3 DS   1CL0001   Extent Type                                    17330001
SSGEPESZ3 DS   1BL1      Extent Sizes in Extent Pool              2@15C 17340001
         ORG SSGEPESZ3                                            2@15A 17350001
SSGED01GB3 EQU X'40'     1 GB Extents                             2@15C 17360001
SSGED16MB3 EQU X'01'     16 MB Extents                            2@15C 17370001
         ORG SSGEPESZ3+X'00000001'                                2@15A 17380001
          DS   1CL0002   Reserved                                       17390001
SSGEPNCM3 DS   1F        Number of Cylinders per Extent or Number of   *17400001
                         Megabytes per Extent                           17410001
          DS   1CL0004   Reserved                                       17420001
SSGEPRLP3 DS   1FL1      Real Extent Limit Percentage                   17430001
SSGEPFWP3 DS   1FL1      Real Extent Threshold Percentage               17440001
SSGEPRES3 DS   1CL0001   Real Extent Status                             17450001
SSGRCPAL3 DS   1FL1      Allocated Real Capacity Percentage             17460001
SSGRCPAV3 DS   1FL1      Available Real Capacity Percentage             17470001
SSGMNERP3 DS   1FL1      Minimum ESE Region Percentage                  17480001
SSGMXERP3 DS   1FL1      Maximum ESE Region Percentage                  17490001
SSGESETP3 DS   1FL1      ESE Threshold Percentage                       17500001
SSGESESP3 DS   1FL1      ESE Status Percentage                          17510001
SSGALECP3 DS   1FL1      Allocated ESE Real Capacity Percentage         17520001
SSGAVECP3 DS   1FL1      Available ESE Real Capacity Percentage         17530001
SSGISRCP3 DS   1FL1      Percentage of Inaccessible SE Repository      *17540001
                         Capacity                                       17550001
          DS   1CL0036   Reserved                                       17560001
* *******************************************************************   17570001
* * The following fields are expressed in number of cylinders for   *   17580001
* * CKD device.   The following fields are expressed in TENTH of    *   17590001
* * binary Gigabytes for Fix Block device.                          *   17600001
* *******************************************************************   17610001
SSGREPCP3 DS   1CL0008   Real Extent Pool Capacity                      17620001
SSGPVRCP3 DS   1CL0008   Preserved Real Capacity                        17630001
SSGRTRCP3 DS   1CL0008   Restricted Real Capacity                       17640001
SSGRVRCP3 DS   1CL0008   Reserved Real Capacity                         17650001
SSGABRCP3 DS   1CL0008   Allocatable Real Capacity                      17660001
SSGALRCP3 DS   1CL0008   Allocated Real Capacity                        17670001
SSGFPARC3 DS   1CL0008   STD (FP) Logical Volumes Allocated Real       *17680001
                         Capacity                                       17690001
SSGESARC3 DS   1CL0008   ESE Logical Volumes Allocated Real Capacity    17700001
SSGMVARC3 DS   1CL0008   Allocated Real Capacity used to Provision     *17710001
                         Metadata Virtual Capacity                      17720001
SSGTSARC3 DS   1CL0008   Allocated Real Capacity used to Provision     *17730001
                         TSE Repository                                 17740001
SSGSDARC3 DS   1CL0008   Allocated Real Capacity used for Source       *17750001
                         Dynamic Extent Relocation                      17760001
SSGTDARC3 DS   1CL0008   Allocated Real Capacity used for Target       *17770001
                         Dynamic Extent Relocation                      17780001
SSGRETRC3 DS   1CL0008   Easy Tier Real Capacity                        17790001
SSGRCPRP3 DS   1CL0008   Real Capacity in Preparation Phase             17800001
SSGAVRCP3 DS   1CL0008   Available Real Capacity                        17810001
SSGRCPIN3 DS   1CL0008   Real Capacity Performing Initialization        17820001
SSGMVCEP3 DS   1CL0008   Metadata Virtual Capacity in Extent Pool       17830001
SSGPVCAP3 DS   1CL0008   Preserved Capacity                             17840001
SSGRTCAP3 DS   1CL0008   Restricted Capacity                            17850001
SSGMVCAP3 DS   1CL0008   Metadata Virtual Capacity                      17860001
SSGABMVC3 DS   1CL0008   Allocatable Metadata Virtual Capacity          17870001
SSGCCVVC3 DS   1CL0008   Configured Customer Volume Virtual Capacity    17880001
SSGCESVC3 DS   1CL0008   Configured ESE Volumes Virtual Capacity        17890001
SSGCTSVC3 DS   1CL0008   Configured TSE Volumes Virtual Capacity        17900001
SSGSDERC3 DS   1CL0008   Source Dynamic Extent Relocation Capacity      17910001
SSGTDERC3 DS   1CL0008   Target Dynamic Extent Relocation Capacity      17920001
          DS   1CL0008   Reserved                                       17930001
SSGMVCPP3 DS   1CL0008   Metadata Virtual Capacity in Preparation      *17940001
                         Phase                                          17950001
SSGAVMVC3 DS   1CL0008   Available Metadata Virtual Capacity            17960001
          DS   1CL0032   Reserved                                       17970001
SSGTSERC3 DS   1CL0008   TSE Repository Capacity                        17980001
SSGALTSC3 DS   1CL0008   Allocated TSE Repository Capacity              17990001
SSGAVTSC3 DS   1CL0008   Available TSE Repository Capacity              18000001
SSGIATSC3 DS   1CL0008   Inaccessible TSE Repository Capacity           18010001
SSGGTSRC3 DS   1CL0008   Guaranteed TSE Repository Capacity             18020001
SSGPTSRC3 DS   1CL0008   Preserved TSE Repository Capacity              18030001
          DS   1CL0032   Reserved                                       18040001
SSGMNERC3 DS   1CL0008   Minimum ESE Region Real Capacity               18050001
SSGMXERC3 DS   1CL0008   Maximum ESE Region Real Capacity               18060001
SSGABERC3 DS   1CL0008   Allocatable ESE Region Real Capacity           18070001
SSGAVERC3 DS   1CL0008   Available ESE Region Real Capacity             18080001
SSGSGARC3 DS   1F        SGC Backup Volumes Allocated Real Capacity     18090001
SSGCSGVC3 DS   1F        Configured SGC Backup Volumes Virtual         *18100001
                         Capacity                                       18110001
          DS   1CL0064   Reserved                                       18120001
* *******************************************************************   18130001
* * The next four fields are 32k bitmaps                            *   18140001
* *******************************************************************   18150001
SSGENORM3 DS   1CL4096   Standard (Fully Provisioned) Volumes           18160001
SSGEPOPV3 DS   1CL4096   Extent Space Efficient Volumes                 18170001
SSGEPSEV3 DS   1CL4096   Track Space Efficient Volumes                  18180001
SSGEPSGC3 DS   1CL4096   Safeguarded Copy Backup Volumes                18190001
*                                                                       18200001
.L0023   ANOP                                                           18210001
*                                                                       18220001
* *******************************************************************   18230001
* *                                                                 *   18240001
* *    MAPPING FOR THE DEVICE PERFORMANCE STATISTICS                *   18250001
* *    OUTPUT BUFFER                                                *   18260001
* *                                        Entire section added @05A*   18270001
* *******************************************************************   18280001
*                                                                       18290001
         AIF   ('&SSGDPBUF' EQ 'NO').L0026                              18300001
         AIF   ('&DSECT' EQ 'YES').L0027                                18310001
         AIF   ('&SSGDPBUF' NE 'YES').L0026                        @06C 18320001
SSGDPBUF DS    0D        DEV PERFORMANCE STATISTICS OUTPUT BUFFER       18330001
         AGO   .L0028                                                   18340001
.L0027   ANOP                                                           18350001
SSGDPBUF DSECT           DEV PERFORMANCE STATISTICS OUTPUT BUFFER       18360001
.L0028   ANOP                                                           18370001
*                                                                       18380001
SSGDPVOL DS    1CL0006   VOLUME SERIAL                                  18390001
SSGDPFLG DS    1BL1                                                     18400001
         ORG   SSGDPFLG                                                 18410001
SSGDP_UA_FLAG EQU X'80'  'ONE' UNIT ADDR FORMAT                         18420001
SSGDP_FND_STG2 EQU X'40' 2ND STG DIR PATH FND SS01 TO LA01 IDCSS01     *18430001
                         PASSED TO IDCLA01                              18440001
SSGDP_SCHST EQU X'30'    SUBCHANNEL SET NUMBER                     @12A*18450001
                         SCHSET NUMBER 0 - 00                      @12A*18460001
                         SCHSET NUMBER 1 - 01                      @12A*18470001
                         SCHSET NUMBER 2 - 10                      @12A*18480001
                         SCHSET NUMBER 3 - 11                      @12A 18490001
         ORG   SSGDPFLG+X'00000001'                                     18500001
SSGDPCUI DS    1CL0001   Real CUID for data in SSGDPDA                  18510001
SSGDPUA1 DS    1CL0004   FIRST UNIT ADDRESS                             18520001
SSGDPUB1 DS    1CL0002   FIRST UNIT ADDRESS (BINARY)                    18530001
SSGDPLN  DS    1FL2      DATA LENGTH                                    18540001
SSGDPDA  DS    0CL0240   DEV PERFORMANCE STATISTICS DATA AREA      @07C 18550001
SSGDPFTF DS    1BL1      Flag byte 1                                    18560001
         ORG   SSGDPFTF                                                 18570001
SSGDPNAV EQU   X'80'     Bit =1 : Cache Stor unavailable               *18580001
                         (Set to zero for 2107/1750)                    18590001
SSGDPPDR EQU   X'70'     Mask bits for Format of Perf Data Returned    *18600001
                         Value after masking ( SSGDPFTF & SSGDPPDR )   *18610001
                         X'00' 3990 Format                             *18620001
                         X'10' 2107/1750 Format                         18630001
SSGDPFDR EQU   X'0F'     Mask bits for Format of data returned.        *18640001
                         The same definition and values of bit 4-7 of  *18650001
                         byte 0 from Sense Subsystem status.            18660001
         ORG   SSGDPFTF+X'00000001'                                     18670001
SSGDPDUA DS    1BL1      Device Unit Address of the device             *18680001
                         to which the statistics pertain                18690001
SSGDPDST DS    1BL2      Device Status. The same as Sense Subsystem    *18700001
                         Status in bytes 26-27                          18710001
SSGDPRNI DS    1F        Search/Read Normal I/O Requests.  The     @H4C*18720001
                         number of command chains which meet the   @H4A*18730001
                         following requirements.                   @H4A*18740001
                         - The chain is not part of a sequential   @H4A*18750001
                           operation.                              @H4A*18760001
                         - The chain did not include a Define      @H4A*18770001
                           Extent command which specified Cache    @H4A*18780001
                           Fast Write Data.                        @H4A*18790001
                         - The chain contained at least one search @H4A*18800001
                           or read command but no write commands.  @H4A 18810001
SSGDPRNH DS    1F        Search/Read Normal I/O Request Hits.  The @H4C*18820001
                         number of command chains which meet the   @H4A*18830001
                         following requirements.                   @H4A*18840001
                         - The chain is not part of a sequential   @H4A*18850001
                           operation.                              @H4A*18860001
                         - The chain did not include a Define      @H4A*18870001
                           Extent command which specified Cache    @H4A*18880001
                           Fast Write Data.                        @H4A*18890001
                         - The chain contained at least one search @H4A*18900001
                           or read command but no write commands.  @H4A*18910001
                         - The chain was completed without         @H4A*18920001
                           requiring access to any DDM.            @H4A 18930001
SSGDPWNI DS    1F        Write Normal I/O Requests. The number of  @H4C*18940001
                         command chains which meet the following   @H4A*18950001
                         requirements.                             @H4A*18960001
                         - The chain is not part of a sequential   @H4A*18970001
                           operation.                              @H4A*18980001
                         - The chain did not include a Define      @H4A*18990001
                           Extent command which specified Cache    @H4A*19000001
                           Fast Write Data.                        @H4A*19010001
                         - The chain contained at least one write  @H4A*19020001
                           command.                                @H4A 19030001
SSGDPFWH DS    1F        DASD Fast Write I/O Request Hits.  The    @H4C*19040001
                         number of command chains which meet the   @H4A*19050001
                         following requirements.                   @H4A*19060001
                         - The chain is not part of a sequential   @H4A*19070001
                           operation.                              @H4A*19080001
                         - The chain did not include a Define      @H4A*19090001
                           Extent command which specified Cache    @H4A*19100001
                           Fast Write Data.                        @H4A*19110001
                         - The chain contained at least one write  @H4A*19120001
                           command.                                @H4A*19130001
                         - The chain was completed without         @H4A*19140001
                           requiring access to any DDM.            @H4A 19150001
SSGDPRSI DS    1F        Search/Read Sequential I/O Requests.  The @H4C*19160001
                         number of sequential mode command chains  @H4A*19170001
                         which meet the following requirements.    @H4A*19180001
                         - The chain contained at least one search @H4A*19190001
                           or read command but no write commands.  @H4A 19200001
SSGDPRSH DS    1F        Search/Read Sequential I/O Request Hits.  @H4C*19210001
                         The number of sequential mode command     @H4A*19220001
                         chains which meet the following           @H4A*19230001
                         requirements.                             @H4A*19240001
                         - The chain contained at least one search @H4A*19250001
                           or read command but no write commands.  @H4A*19260001
                         - The chain was completed without         @H4A*19270001
                           requiring access to any DDM.            @H4A 19280001
SSGDPWSI DS    1F        Write Sequential I/O Requests.  The number@H4C*19290001
                         of sequential mode command chains which   @H4A*19300001
                         meet the following requirements.          @H4A*19310001
                         - The chain contained at least one write  @H4A*19320001
                           command.                                @H4A 19330001
SSGDPWSH DS    1F        Fast Write Sequential I/O Request Hits.   @H4C*19340001
                         The number sequential write operations    @H4A*19350001
                         that did not require movement of data to  @H4A*19360001
                         or from a storage device before completion@H4A*19370001
                         of the I/O operation.                     @H4A 19380001
SSGDPRCF DS    1F        Search/Read Cache Fast Write I/O Requests.@H4C*19390001
                         The number of command chains which meet   @H4A*19400001
                         the following requirements.               @H4A*19410001
                         - The chain included a Define Extent      @H4A*19420001
                           command which specified the Cache Fast  @H4A*19430001
                           Write Data attribute.                   @H4A*19440001
                         - The chain contained at least one search @H4A*19450001
                           or read command but no write commands.  @H4A*19460001
                         - Cache Fast Write Data must be activated @H4A*19470001
                           for the subsystem.                      @H4A 19480001
SSGDPRCH DS    1F        Search/Read Cache Fast Write I/O Request  @H4C*19490001
                         Hits.  The number of command chains which @H4A*19500001
                         meet the following requirements.          @H4A*19510001
                         - The chain included a Define Extent      @H4A*19520001
                           command which specified the Cache Fast  @H4A*19530001
                           Write Data attribute.                   @H4A*19540001
                         - The chain contained at least one search @H4A*19550001
                           or read command but no write commands.  @H4A*19560001
                         - Cache Fast Write Data must be actuated  @H4A*19570001
                           for the subsystem.                      @H4A*19580001
                         - The chain was completed without         @H4A*19590001
                           requiring access to any DDM.            @H4A 19600001
SSGDPCFW DS    1F        Cache Fast Write I/O Requests.  The number@H4C*19610001
                         of command chains which meet the following@H4A*19620001
                         requirements.                             @H4A*19630001
                         - The chain included a Define Extent      @H4A*19640001
                           command which specified the Cache Fast  @H4A*19650001
                           Write Data attribute.                   @H4A*19660001
                         - The chain contained at least one write  @H4A*19670001
                           command.                                @H4A*19680001
                         - Cache Fast Write Data must be actuated  @H4A*19690001
                           for the subsystem.                      @H4A 19700001
SSGDPCFH DS    1F        Cache Fast Write I/O Request Hits.  The   @H4C*19710001
                         number of command chains which meet the   @H4A*19720001
                         following requirements.                   @H4A*19730001
                         - The chain included a Define Extent      @H4A*19740001
                           command which specified the Cache Fast  @H4A*19750001
                           Write Data attribute.                   @H4A*19760001
                         - The chain contained at least one write  @H4A*19770001
                           command.                                @H4A*19780001
                         - Cache Fast Write Data must be actuated  @H4A*19790001
                           for the subsystem.                      @H4A*19800001
                         - The chain was completed without         @H4A*19810001
                           requiring access to any DDM.            @H4A 19820001
SSGDPICL DS    1F        Inhibit Cache Loading I/O Req                 *19830001
                         that operate with DASD                        *19840001
                         (Set to zeros for 2107/1750)                   19850001
SSGDPBCI DS    1F        Bypass Cache I/O Requests                     *19860001
                         (Set to zeros for 2107/1750)                   19870001
SSGDPSDC DS    1F        Seq DASD to Cache Transfer Operations          19880001
SSGDPDCC DS    1F        DASD to Cache Transfer Operation Count         19890001
SSGDPCDC DS    1F        Cache to DASD Transfer Operation Count         19900001
SSGDPFWD DS    1F        DASD Fast Write Operation Delayed             *19910001
                         Due to non-volatile storage Space constraints  19920001
SSGDPNFW DS    1F        Normal 'DASD Fast Write' Write Operation  @H4C*19930001
                         Counts. The number of command chains which@H4C*19940001
                         meet the following requirements.          @H4A*19950001
                         - The chain is not part of a sequential   @H4A*19960001
                           operation.                              @H4A*19970001
                         - The chain did not include a Define      @H4A*19980001
                           Extent command which specified Cache    @H4A*19990001
                           Fast Write Data.                        @H4A*20000001
                         - The chain contained at least one write  @H4A*20010001
                           command.                                @H4A*20020001
                         - The chain was completed without         @H4A*20030001
                           requiring access to any DDM.            @H4A 20040001
SSGDPSFW DS    1F        Sequential Access 'DASD Fast                  *20050001
                         Write' Write Operation Counts                  20060001
SSGDPNRM DS    1F        Number of record cache Read misses             20070001
SSGDPDS2 DS    1BL1      Device Status - Group 2                       *20080001
                         The device status, SSGDPDS2, is identical to  *20090001
                         the data returned by the Sense Subsystem      *20100001
                         Status in Byte 36.                            *20110001
                         Note: The format of the data in SSGDPDS2 is   *20120001
                         determined by the value in SSGDPFDR.           20130001
SSGDPQWP DS    1BL4      Quick Write Promotes                           20140001
SSGDPDVD DS    1BL1      Flag byte                                     *20150001
                         SSGDPDVD describes the validity of data       *20160001
                         returned and the increment values used        *20170001
                         for certain counters.                          20180001
         ORG   SSGDPDVD                                                 20190001
SSGDPCDT EQU   X'80'     Flag bit. SSGDPRDT, SSGDPWDT, SSGDPRDC,  1@16A*20200001
                         and SSGDPWDC are valid when set on.      1@16A 20210001
SSGDPRVA EQU   X'60'     Mask for unused bits                     1@16C 20220001
SSGDPSIV EQU   X'10'     Flag bit. SSGDPSRR, SSGDPSRH, SSGDPSWR,   @SIA*20230001
                         and SSGDPSWH are valid when set on.       @SIA 20240001
SSGDPZHV EQU   X'08'     Flag bit. SSGDPZHR and SSGDPZHW are valid @H4A*20250001
                         when set on.                                   20260001
SSGDPUNI EQU   X'06'     Mask bits for Units                           *20270001
                         Value after masking ( SSGDPDVD & SSGDPUNI )   *20280001
                         X'00'  Unit of SSGDPRRT,SSGDPWRT,SSGDPBRD,    *20290001
                                SSGDPBWR,SSGDPRAT, and SSGDPWAT is     *20300001
                                16 milliseconds.  Unit of SSGDPPBR     *20310001
                                SSGDPPBW is 128 KB.                    *20320001
                         X'02'  Reserved                               *20330001
                         X'04'  Reserved                               *20340001
                         X'06'  Reserved                                20350001
SSGDPBYV EQU   X'01'     1 indicates SSGDPBRD, SSGDPBWR, SSGDPRAT, and *20360001
                         SSGDPWAT are valid.                            20370001
         ORG   SSGDPDVD+X'00000001'                                     20380001
SSGDPSID DS    1FL2      SSID                                           20390001
SSGDPITA DS    1F        Irregular Track Accesses                       20400001
SSGDPITH DS    1F        Irregular Track Access Hits                    20410001
SSGDPODC DS    1F        Operation Delayed Due To Cache                *20420001
                         Space Constraints                              20430001
SSGDPMSL DS    1F        Milliseconds of lower interface               *20440001
                         I/O activity for the indicated                *20450001
                         device                                        *20460001
                         (Set to zeros for 2107/1750)                   20470001
SSGDPNVI DS    1FL1      Non-volume information contained in the  2@15C*20480001
                         record                                   2@15C*20490001
                         Value Definition                              *20500001
                         0     No Additional Information               *20510001
                         1     RAID Rank Information                   *20520001
                         2     Extent Pool and Physical           2@15C*20530001
                               Storage Counter information             *20540001
                         3-FF  Not Defined                        2@15C 20550001
SSGDPRVB DS    1CL0001   not used                                  @H4C 20560001
SSGDPSPI DS    1FL2      Extent Pool ID                           2@15C 20570001
SSGDPSTY DS    1FL1      Extent Pool Type                          @15C*20580001
                          Hex  Description                         @15C*20590001
                          04   FB 1 GB                             @15C*20600001
                          84   CKD 1 GB                            @15C 20610001
SSGDPSFL DS    1BL1      Extent Pool Flags                         @15C 20620001
         ORG   SSGDPSFL                                                 20630001
SSGDPSF0 EQU   X'80'     Dynamic Segment Allocation                     20640001
SSGDPSF1 EQU   X'40'     Data Sharing                                   20650001
SSGDPSF2 EQU   X'20'     Migrating/Migration Error State                20660001
SSGDPSF7 EQU   X'01'     Extent Sizes Valid                        @15A*20670001
                         When set to one, SSGDPSSZ contains the    @15A*20680001
                         extent sizes in the Extent Pool.          @15A 20690001
         ORG   SSGDPSFL+X'00000001'                                     20700001
SSGDPSSZ DS    1BL1      Extent Sizes in Extent Pool               @15A 20710001
         ORG SSGDPSSZ                                              @15A 20720001
SSGDP01GB EQU  X'40'     1 GB Extents                              @15A 20730001
SSGDP16MB EQU  X'01'     16 MB Extents                             @15A 20740001
         ORG SSGDPSSZ+X'00000001'                                  @15A 20750001
         DS    1CL0001   Not used                                  @15C 20760001
SSGDPPRO DS    1F        Physical Storage Read Operations               20770001
SSGDPPWO DS    1F        Physical Storage Write Operations              20780001
SSGDPPBR DS    1F        Physical Storage Bytes Read.                  *20790001
                         See Increment Value in SSGDPDVD                20800001
SSGDPPBW DS    1F        Physical Storage Bytes Written.               *20810001
                         See Increment Value in SSGDPDVD                20820001
SSGDPRMR DS    1F        Record Mode Read Operations                    20830001
SSGDPNTR DS    1F        Number of tracks read from the                *20840001
                         concurrent Copy or XRC Sidefile                20850001
SSGDPNCW DS    1F        Number of Contaminating writes for a      @H4C*20860001
                         Concurrent Copy or XRC volume as a result @H4C*20870001
                         of:                                       @H4A*20880001
                         - Update to a Concurrent Copy protected   @H4A*20890001
                           track.                                  @H4A*20900001
                         - Update to an XRC monitored track.       @H4A 20910001
SSGDPTTS DS    1F        Number of tracks or portion of                *20920001
                         tracks that were transferred to               *20930001
                         the secondary device of a PPRC pair            20940001
SSGDPNSA DS    1F        NVS Space Allocations                          20950001
SSGDPRRT DS    1F        Physical Storage Read Response                *20960001
                         Time. See Increment Value in SSGDPDVD          20970001
SSGDPWRT DS    1F        Physical Storage Write Response               *20980001
                         Time. See Increment Value in SSGDPDVD          20990001
SSGDPBRD DS    1F        Bytes Read. See Increment Value in SSGDPDVD    21000001
SSGDPBWR DS    1F        Bytes Written. See Increment Value in SSGDPDVD 21010001
SSGDPRAT DS    1F        Read Accumulated Time.                        *21020001
                         The accumulated response time                 *21030001
                         for all read operations.                      *21040001
                         See Increment Value in SSGDPDVD                21050001
SSGDPWAT DS    1F        Write Accumulated Time.                       *21060001
                         The accumulated response time                 *21070001
                         for all write operations.                     *21080001
                         See Increment Value in SSGDPDVD                21090001
SSGDPZHR DS    1F        zHPF Read I/O Requests. This count is     @H4A*21100001
                         the number of Transport Mode read command @H4A*21110001
                         chains. The Read I/O Request will also be @H4A*21120001
                         counted in one of the following counters: @H4A*21130001
                         - SSGDPRNI,                               @H4A*21140001
                           Search/Read Normal I/O Requests         @H4A*21150001
                         - SSGDPRSI,                               @H4A*21160001
                           Search/Read Sequential I/O Requests     @H4A*21170001
                         - SSGDPRCF,                               @H4A*21180001
                           Search/Read Cache Fast Write I/O        @H4A*21190001
                           Requests                                @H4A 21200001
SSGDPZHW DS    1F        zHPF Write I/O Requests.  This count is   @H4A*21210001
                         the number of Transport Mode write command@H4A*21220001
                         chains. The Write I/O Request will also be@H4A*21230001
                         counted in one of the following counters: @H4A*21240001
                         - SSGDPWNI, Write Normal I/O Requests     @H4A*21250001
                         - SSGDPWSI, Write Sequential I/O Requests @H4A*21260001
                         - SSGDPCFW, Cache Fast Write I/O Requests @H4A 21270001
SSGDPRRP DS    1F        zHyperLink Read Pre-fetch I/O Requests.   @18C*21280002
                         The number of zHyperLink chains which meet@18C*21290002
                         the following requirements:               @18C*21300002
                         - The zHyperLink Read Operation failed due@18C*21310002
                           to Read Data Not Immediately Available  @18C*21320002
                           (RC 0211) and a Pre-fetch request was   @18C*21330002
                           made to obtain resources prior to a     @18C*21340002
                           retry attempt.                          @18C 21350002
SSGDPZHL DS    1F        zHPF List Pre-fetch I/O Requests. This    @07A*21360001
                         count is the number of command chains     @07A*21370001
                         which meet the following requirements:    @07A*21380001
                         - The Transport Mode operation specified  @07A*21390001
                           a non-zero Imbedded Locate Record Count.@07A 21400001
SSGDPZHH DS    1F        zHPF List Pre-fetch I/O Request Hits.     @07A*21410001
                         This count is the number of command       @07A*21420001
                         chains which meet the following           @07A*21430001
                         requirements:                             @07A*21440001
                         - The Transport Mode operation specified  @07A*21450001
                           a non-zero Imbedded Locate Record Count.@07A*21460001
                         - The chain was completed without         @07A*21470001
                           requiring access to any DDM.            @07A 21480001
SSGDPGSF DS    1F        Global Mirror Collisions Sidefile Count.  @09A*21490001
                         A GM Collision occurs when, during the    @09A*21500001
                         sending of data to the secondary to create@09A*21510001
                         a consistency group, a subsequent host    @09A*21520001
                         update is attempted before the modified   @09A*21530001
                         track has been transmitted to the         @09A*21540001
                         secondary volume. The modified track will @09A*21550001
                         be moved to the sidefile before allowing  @09A*21560001
                         a new host write. This counter will be    @09A*21570001
                         incremented by one when a track is added  @09A*21580001
                         to the sidefile.                          @09A 21590001
SSGDPGSS DS    1F        Global Mirror Collisions Send Synchronous @09A*21600001
                         Count. When a write collision occurs, the @09A*21610001
                         modified track data which belongs to the  @09A*21620001
                         current consistency group may be sent to  @09A*21630001
                         the remote control unit before allowing   @09A*21640001
                         the write. The data may come from the     @09A*21650001
                         sidefile if it is full or from cache if   @09A*21660001
                         the collision sidefile is not being       @09A*21670001
                         utilized.                                 @09A 21680001
SSGDPSRR DS    1F        Synch I/O Read Requests                   @SIA 21690001
SSGDPSRH DS    1F        Synch I/O Read Request Hits               @SIA 21700001
SSGDPSWR DS    1F        Synch I/O Write Requests                  @SIA 21710001
SSGDPSWH DS    1F        Synch I/O Write Request Hits              @SIA 21720001
SSGDPRDT DS    1F        Read Channel Disconnect Time             1@16A 21730001
SSGDPWDT DS    1F        Write Channel Disconnect Time            1@16A 21740001
SSGDPRDC DS    1F        Read Channel Disconnect Count            1@16A 21750001
SSGDPWDC DS    1F        Write Channel Disconnect Count           1@16A 21760001
*                                                                       21770001
.L0026   ANOP                                                           21780001
*                                                                       21790001
* ****************************************************************** *  21800001
* *                                                                  *  21810001
* *    MAPPING FOR THE SUBSYSTEM SYNC I/O LINK STATISTIC BUFFER      *  21820001
* *                                       Entire section added   @SIA*  21830001
* ****************************************************************** *  21840001
*                                                                       21850001
         AIF   ('&SSGBFSL' EQ 'NO').L0029                               21860001
         AIF   ('&DSECT' EQ 'YES').L0030                                21870001
         AIF   ('&SSGBFSL' NE 'YES').L0029                              21880001
* *******************************************************************   21890001
* *    Output buffer is a queue, anchored by SSGSLOAR, of Synch     *   21900001
* *    I/O Link statistics. Each queue element represents data      *   21910001
* *    read from a single storage subsystem box that describes sets *   21920001
* *    of statistics.  The queue is a single threaded queue.  Each  *   21930001
* *    queue element needs to be freed by the caller of this        *   21940001
* *    interface. Output buffer built for storage subsystem boxes   *   21950001
* *    that support Synch I/O Link statistics and are returned      *   21960001
* *    only if requested by caller (SSGSIOLP) on a request for      *   21970001
* *    performance data (SSGRPD) for requests with scope of         *   21980001
* *    of subsystem (SSG1SS) or all subsystems (SSGALL).            *   21990001
*********************************************************************   22000001
SSGSLBFR DS    0D        Synch I/O Link Statistics output buffer        22010001
         AGO   .L0031                                                   22020001
.L0030   ANOP                                                           22030001
SSGSLBFR DSECT           Synch I/O Link Statistics output buffer        22040001
.L0031   ANOP                                                           22050001
SSGSLHDR  DS   0CL60     Header info for Synch I/O Link statistics      22060001
SSGSLQDAL DS   1AL4      Len of this queue element, header & data       22070001
SSGSLQDAO DS   1AL4      Offset to the start of the statistics sets     22080001
SSGSLFWDP DS   1AL4      Pointer to next queue element, zero is end     22090001
SSGSLVOL  DS   1CL6      Volume serial of device that stats where      *22100001
                         read from                                      22110001
SSGSLDEVN DS   1CL2      Device number of device that stats where      *22120001
                         read from                                      22130001
SSGSLFLG DS    1BL1                                                     22140001
         ORG   SSGSLFLG                                                 22150001
SSGSL_SCHST EQU X'30'    Subchannel Set Number                         *22160001
                         SCHSET NUMBER 0 - 00                          *22170001
                         SCHSET NUMBER 1 - 01                          *22180001
                         SCHSET NUMBER 2 - 10                          *22190001
                         SCHSET NUMBER 3 - 11                           22200001
         ORG   SSGSLFLG+X'00000001'                                     22210001
          DS   1CL7      Reserved                                       22220001
SSGSILHDR DS   0CL32                                                    22230001
SSGSLNSET DS   1FL2      Number of Synch I/O Link statistic sets        22240001
SSGSLLSET DS   1FL2      Size of each statistics set                    22250001
SSGSLCUT  DS   1CL6      Control unit type                              22260001
SSGSLCUM  DS   1CL3      Control unit model                             22270001
SSGSLSEQ  DS   1CL10     Control unit sequence number                   22280001
SSGSLVER  DS   1CL1      Version of Synch I/O Link statistics           22290001
SSGSLBRF  DS   1CL1      Byte Reporting Factor                         *22300001
                          Value Description                            *22310001
                          01    Low order bit represents 128K bytes     22320001
SSGSLTRF  DS   1CL1      Time Reporting Factor                         *22330001
                          Value Description                            *22340001
                          01    Low order bit represents 16 millisecs   22350001
          DS   1CL6      Reserved                                       22360001
SSGSLDADA DS   0C        Synch I/O Link stats read                      22370001
*                        Added mapping of Synch I/O Link statistics     22380001
*                                                                       22390001
* ****************************************************************** *  22400001
* * SSGSLDADA consists of Synch I/O Link statistics sets containing  *  22410001
* * one or more table information entries for each Synch I/O         *  22420001
* * interface. Each entry is 128 bytes defined in SSGSLSTA based on  *  22430001
* * version number (X'01') in SSGSLVER.                              *  22440001
* ****************************************************************** *  22450001
*                                                                       22460001
SSGSLSTA  DS   0CL128    Stats entry, repeated for number of Synch     *22470001
                         I/O Link statistics sets.                      22480001
SSGSLTYP  DS   1FL1      Synch I/O Link Type                           *22490001
                          Hex  Description                             *22500001
                          00   Not Used                                *22510001
                          01   Optical PCIe                             22520001
SSGSLSPD  DS   1FL1      Synch I/O Link Speed                          *22530001
                          Hex  Description                             *22540001
                          00   Not Used                                *22550001
                          01   PCIe Gen 1                              *22560001
                          02   PCIe Gen 2                              *22570001
                          03   PCIe Gen 3                              *22580001
                          04   PCIe Gen 4                               22590001
SSGSLWDH  DS   1FL1      Synch I/O Link Width                          *22600001
                         This value is the number of PCIe lanes        *22610001
                         (1, 2, 4, 8 or 16).                            22620001
SSGSLSTE  DS   1FL1      Synch I/O Link State                          *22630001
                          Value Definition                             *22640001
                          00    Not Used                               *22650001
                          01    Link Not Trained                       *22660001
                          02    Link Handshake Incomplete              *22670001
                          03    Link Handshake Complete and Link       *22680001
                                Operational                            *22690001
                          04    Link in Service Mode                   *22700001
                                (i.e. Link Quiesced)                    22710001
SSGSLIID  DS   1FL2      Interface id                                  *22720001
                          Bits  Definition                             *22730001
                          0     Port type (set to zero)                *22740001
                          1-2   Reserved                               *22750001
                          3-7   Enclosure                              *22760001
                          8-11  Adapter. Set to '1000'b.               *22770001
                          12-15 Port. Set to '0000'b for Link 0 and    *22780001
                                to '0001'b for Link 1.                  22790001
          DS   1CL2      Not Used. Set to zero.                         22800001
SSGSLCBR  DS   1F        Cache Bytes Read                              *22810001
                         SSGSLBRF specifies reporting factor.           22820001
SSGSLCRO  DS   1F        Total Cache Read Operations                    22830001
SSGSLCRS  DS   1F        Successful Cache Read Operations               22840001
SSGSLCRT  DS   1F        Cache Read Accumulated Time                   *22850001
                         SSGSLTRF specifies reporting factor.           22860001
SSGSLCBW  DS   1F        Cache Bytes Written                           *22870001
                         SSGSLBRF specifies reporting factor.           22880001
SSGSLCWO  DS   1F        Total Cache Write Operations                   22890001
SSGSLCWS  DS   1F        Successful Cache Write Operations              22900001
SSGSLCWT  DS   1F        Cache Write Accumulated Time                  *22910001
                         SSGSLTRF specifies reporting factor.           22920001
SSGSLNBW  DS   1F        NVS Bytes Written                             *22930001
                         SSGSLBRF specifies reporting factor.           22940001
SSGSLNWO  DS   1F        Total NVS Write Operations                     22950001
SSGSLNWS  DS   1F        Successful NVS Write Operations          1@SGC 22960001
SSGSLNWT  DS   1F        NVS Write Accumulated Time                    *22970001
                         SSGSLTRF specifies reporting factor.           22980001
SSGSLDDR  DS   1F        I/O Mail Dispatch Delay, I/O Rejected    1@SGA 22990001
SSGSLDDD  DS   1F        I/O Mail Dispatch Delay, I/O Dropped     1@SGA 23000001
SSGSLSDR  DS   1F        I/O Mail Scan Delay, I/O Rejected        1@SGA 23010001
SSGSLSDD  DS   1F        I/O Mail Scan Delay, I/O Dropped         1@SGA 23020001
SSGSLCRSAT DS  1F        Cache Read Success Accumulated Time       @18C 23030002
SSGSLCWSAT DS  1F        Cache Write Success Accumulated Time      @18C 23040002
SSGSLNWSAT DS  1F        NVS Write Success Accumulated Time        @18C 23050002
          DS   1CL44     Not Used. Set to zero.                    @18C 23060002
*                                                                       23070001
.L0029   ANOP                                                           23080001
*                                                                       23090001
* ****************************************************************** *  23100001
* *                                                                  *  23110001
* *    MAPPING FOR THE SUBSYSTEM SYNC I/O LINK DIAGNOSTIC PARAMETERS *  23120001
* *                                       Entire section added  1@SIA*  23130001
* ****************************************************************** *  23140001
*                                                                       23150001
         AIF   ('&SSGBFSD' EQ 'NO').L0032                               23160001
         AIF   ('&DSECT' EQ 'YES').L0033                                23170001
         AIF   ('&SSGBFSD' NE 'YES').L0032                              23180001
* *******************************************************************   23190001
* *    Output buffer is a queue, anchored by SSGSDOAR, of Synch     *   23200001
* *    I/O Diagnostic Parameters.  Each queue element represents    *   23210001
* *    data read from a single storage subsystem box that describes *   23220001
* *    sets of statistics.  The queue is a single threaded queue.   *   23230001
* *    Each queue element needs to be freed by the caller of this   *   23240001
* *    interface. Output buffer built for storage subsystem boxes   *   23250001
* *    that support Synch I/O Link Diagnostic Parameters and are    *   23260001
* *    returned only if requested by caller (SSGSILDP) on a request *   23270001
* *    or performance data (SSGRPD) for requests with scope of      *   23280001
* *    subsystem (SSG1SS) or all subsystems (SSGALL).               *   23290001
*********************************************************************   23300001
SSGSDBFR DS    0D        Synch I/O Link Diag Parameters output buffer   23310001
         AGO   .L0034                                                   23320001
.L0033   ANOP                                                           23330001
SSGSDBFR DSECT           Synch I/O Link Diag Param output buffer        23340001
.L0034   ANOP                                                           23350001
SSGSDHDR  DS   0CL60     Header info for Synch I/O Diag Parameters      23360001
SSGSDQDAL DS   1AL4      Len of this queue element, header & data       23370001
SSGSDQDAO DS   1AL4      Offset to the start of the statistics sets     23380001
SSGSDFWDP DS   1AL4      Pointer to next queue element, zero is end     23390001
SSGSDVOL  DS   1CL6      Volume serial of device that stats where      *23400001
                         read from                                      23410001
SSGSDDEVN DS   1CL2      Device number of device that stats where      *23420001
                         read from                                      23430001
SSGSDFLG DS    1BL1                                                     23440001
         ORG   SSGSDFLG                                                 23450001
SSGSD_SCHST EQU X'30'    Subchannel Set Number                         *23460001
                         SCHSET NUMBER 0 - 00                          *23470001
                         SCHSET NUMBER 1 - 01                          *23480001
                         SCHSET NUMBER 2 - 10                          *23490001
                         SCHSET NUMBER 3 - 11                           23500001
         ORG   SSGSDFLG+X'00000001'                                     23510001
          DS   1CL7      Reserved                                       23520001
SSGSIDHDR DS   0CL32                                                    23530001
SSGSDNSET DS   1FL2      Number of Synch I/O Link Diag Parameters sets  23540001
SSGSDLSET DS   1FL2      Size of each statistics set                    23550001
SSGSDCUT  DS   1CL6      Control unit type                              23560001
SSGSDCUM  DS   1CL3      Control unit model                             23570001
SSGSDSEQ  DS   1CL10     Control unit sequence number                   23580001
SSGSDVER  DS   1CL1      Version of Synch I/O Link Diag Parameters      23590001
          DS   1CL8      Reserved                                       23600001
SSGSDDADA DS   0C        Synch I/O Link Diag Parms read                 23610001
*                        Added mapping of Synch I/O Link Diag Parms     23620001
*                                                                       23630001
* ****************************************************************** *  23640001
* * SSGSDDADA consists of Synch I/O Link Diagnostic Parameter sets   *  23650001
* * containing one or more table information entries for each Synch  *  23660001
* * I/O interface. Each entry is 192 bytes defined in SSGSDSTA       *  23670001
* * based on version number (X'01') in SSGSDVER.                     *  23680001
* ****************************************************************** *  23690001
*                                                                       23700001
SSGSDSTA  DS   0CL196    Stats entry, repeated for number of Synch     *23710001
                         I/O Link Diag Parameters sets.                 23720001
SSGSDTYP  DS   1FL1      Synch I/O Link Type                           *23730001
                          Hex  Description                             *23740001
                          00   Not Used                                *23750001
                          01   Optical PCIe                             23760001
SSGSDSPD  DS   1FL1      Synch I/O Link Speed                          *23770001
                          Hex  Description                             *23780001
                          00   Not Used                                *23790001
                          01   PCIe Gen 1                              *23800001
                          02   PCIe Gen 2                              *23810001
                          03   PCIe Gen 3                              *23820001
                          04   PCIe Gen 4                               23830001
SSGSDWDH  DS   1FL1      Synch I/O Link Width                          *23840001
                         This value is the number of PCIe lanes        *23850001
                         (1, 2, 4, 8 or 16).                            23860001
SSGSDSTE  DS   1FL1      Synch I/O Link State                          *23870001
                          Value Definition                             *23880001
                          00    Not Used                               *23890001
                          01    Link Not Trained                       *23900001
                          02    Link Handshake Incomplete              *23910001
                          03    Link Handshake Complete and Link       *23920001
                                Operational                            *23930001
                          04    Link in Service Mode                   *23940001
                                (i.e. Link Quiesced)                    23950001
SSGSDIID  DS   1FL2      Interface id                                  *23960001
                          Bits  Definition                             *23970001
                          0     Port type (set to zero)                *23980001
                          1-2   Reserved                               *23990001
                          3-7   Enclosure                              *24000001
                          8-11  Adapter. Set to '1000'b.               *24010001
                          12-15 Port. Set to '0000'b for Link 0 and    *24020001
                                to '0001'b for Link 1.                  24030001
          DS   1CL2      Not Used. Set to zero.                         24040001
SSGSDPRE  DS   1F        Port Receiver Error Count                      24050001
SSGSDDLLP DS   1F        Port Bad Data Link Layer Packet (DLLP) Count   24060001
SSGSDTLP  DS   1F        Port Bad Transaction Layer Packet (TLP) Count  24070001
SSGSDPLL  DS   1CL4      Power Levels for lanes                         24080001
         ORG   SSGSDPLL                                                 24090001
SSGSDTXP  DS   1FL2      Tx Power: Lane 1, 2, 4, 8, or 16              *24100001
                         This value contains the measured coupled TX   *24110001
                         output power in units of 0.1 uW               *24120001
                         (range 0-6.5mW).                               24130001
SSGSDRXP  DS   1FL2      Rx Power: Lane 1, 2, 4, 8, or 16              *24140001
                         This value contains the measured coupled RX   *24150001
                         output power in units of 0.1 uW               *24160001
                         (range 0-6.5mW).                               24170001
         ORG   SSGSDPLL+X'00000040'                                     24180001
SSGSDCSE  DS   1CL64     Chip Specific Error Counts                     24190001
          DS   1CL44     Not Used. Set to zero.                         24200001
*                                                                       24210001
.L0032   ANOP                                                           24220001
*                                                                       24230001
         AIF   ('&ZCBPRINT' EQ 'NO').P3                                 24240001
         AIF   ('&LIST' EQ 'YES').P4                                    24250001
.P3      ANOP                                                           24260001
         POP   PRINT                                                    24270001
.P4      ANOP                                                           24280001
.P_EXIT  ANOP                                                           24290001
         MEND                                                           24300001
**/ IDCDF70_2:;                                                         24310001
* %IDCDF70_INCLUDED = 'YES';                                            24320001
* %DCL ZCBPRINT CHAR EXT;                                               24330001
* %DEACTIVATE ZCBPRINT;                                                 24340001
* %DCL IDCDF70_LIST CHAR EXT;                                           24350001
* %DEACTIVATE IDCDF70_LIST;                                             24360001
* %IF IDCDF70_LIST ^= 'NO' &                                            24370001
*    ZCBPRINT ^= 'NO' %THEN                                             24380001
*   %GOTO IDCDF70_3;                                                    24390001
*   @LIST PUSH NOECHO;                                                  24400001
*   @LIST NOASSEMBLE NOECHO;                                            24410001
*   @LIST OFF C NOECHO;                                                 24420001
* %IDCDF70_3:;                                                          24430001
*/* Start of PL/X Source                                             */ 24440001
*/********************************************************************/ 24450001
*/*VALID VALUES FOR THE SSGAVOL FIELD WHEN A SUBSYSTEM IS DESIRED ARE*/ 24460001
*/*'FFFFFFFFFFXX'X WHERE XX IS X'02' FOR AN EMULATED 3990 SUBSYSTEM  */ 24470001
*/*'FFFFFFFFFFXX'X WHERE XX IS X'0B' FOR AN IBM 3880 MODEL 23        */ 24480001
*/*'FFFFFFFFFFXX'X WHERE XX IS X'0C' FOR AN IBM 3990 MODEL 03        */ 24490001
*/*'FFFFFFFFFFXX'X WHERE XX IS X'E9' FOR AN IBM 3990 MODEL 09        */ 24500001
*/*'FFFFFFFFFFXX'X WHERE XX IS X'E8' FOR AN IBM 2105,2107,1750       */ 24510001
*/********************************************************************/ 24520001
*DCL 1 SSGARGL BDY(DWORD) BASED,                                        24530001
*      2 SSGHEAD CHAR(8),       /* SSGARGL IDENTIFIER               */  24540001
*      2 SSGADDN PTR(31),       /* DDNAME ADDRESS                   */  24550001
*      2 SSGAVOL PTR(31),       /* VOLUME ADDRESS                   */  24560001
*      2 SSGUNIT BIT(32),       /* DEVICE TYPE                      */  24570001
*        3 SSGUNIT1 BIT(8),     /* GENERAL FLAGS                    */  24580001
*        3 SSGUNIT2 BIT(8),     /* GENERAL FLAGS                    */  24590001
*        3 SSGUNIT3 BIT(8),     /* DEVICE CLASS                     */  24600001
*        3 SSGUNIT4 BIT(8),     /* DEVICE TYPE WITHIN THE CLASS     */  24610001
*      2 SSGOLN FIXED(31),      /* LENGTH OF OUTPUT BUFFER          */  24620001
*      2 SSGOADR PTR(31),       /* ADDRESS OF OUTPUT BUFFER         */  24630001
*      2 SSGOPT BIT(16),        /* OPTIONS BYTE                @H17C*/  24640001
*        3 SSGRPD BIT(1),       /* SENSE SUBSYSTEM COUNTS           */  24650001
*        3 SSGRSS BIT(1),       /* SENSE SUBSYSTEM STATUS           */  24660001
*        3 SSGCACHE BIT(1),     /* ON=CACHING,OFF=PAGING        @H4A*/  24670001
*        3 SSGSDS   BIT(1),     /* ON=1 SD, OFF=2 SD'S          @H5A*/  24680001
*        3 SSGALL BIT(1),       /* SENSE FOR ALL SUBSYSTEMS         */  24690001
*        3 SSG1SS BIT(1),       /* SENSE FOR SPECIFIED SUBSYSTEM    */  24700001
*        3 SSGDEV BIT(1),       /* SENSE FOR SPECIFIED DEVICE   @H4C*/  24710001
*        3 SSGAMD BIT(1),       /* PTR TO 3880 MODEL PASSED             24720001
*                                      INSTEAD OF PTR TO VOLUME @H7C*/  24730001
*        3 SSG2SD BIT(1),       /* PRINT 2 SD - H7A            @H14N*/  24740001
*        3 SSGACD BIT(1),       /* ACCESSCODE                  @H18A*/  24750001
*        3 SSGOFFL BIT(1),      /* SSGAVOL POINTS TO DEVICE ID          24760001
*                                  OF AN OFFLINE DEVICE        @H19A*/  24770001
*        3 SSGARGL2 BIT(1),     /* This flag indicates that the @01A    24780001
*                                  parameter list is extended by the    24790001
*                                  16 bytes defined as SSGARGLX.    */  24800001
*        3 SSGLINKP BIT(1),     /* Link performance statistics          24810001
*                                  supported by caller and request      24820001
*                                  return of statistics when request    24830001
*                                  for Subsystem counts are made        24840001
*                                  (SSGRPD=ON) for one or more          24850001
*                                  Subsystems (SSG1SS=ON or             24860001
*                                  SSGALL=ON). Results passed back      24870001
*                                  in area pointed to by SSGLPOAR.      24880001
*                                  Extended size statistics are         24890001
*                                  provided if SSGEXRQ is specified.    24900001
*                                  The returned field, SSGLLSET,        24910001
*                                  will be set to the size for          24920001
*                                  each set of link statistics. @H4C*/  24930001
*        3 SSGARGL3 BIT(1),     /* This flag indicates that the         24940001
*                                  parameter list is extended with      24950001
*                                  area defined as SSGARLGY.    @SIC*/  24960001
*      2 SSGMDLID BIT(8),       /* CU MODEL IDENTIFIER         @H17A*/  24970001
*      2 SSGRCIOS CHAR(1),      /* RETURN CODE FROM FAILING             24980001
*                                  FUNCTION - ESTAE OR IOS     2@15C*/  24990001
*/*******************************************************************/  25000001
*/* Parameter List Extension                                    @01A*/  25010001
*/* Note: IDCSS01 will not reference fields contained in SSGARGLX   */  25020001
*/*       unless the bit defined as SSGARGL2 is set to '1'.         */  25030001
*/*******************************************************************/  25040001
*      2 SSGARGLX CHAR(16) BDY(WORD), /* parm list extension    @L2C*/  25050001
*        3 SSGATIME FIXED(8),   /* I/O timeout value in seconds.@01A    25060001
*                                  When SSGATIME is not zero, it will   25070001
*                                  be stored into IOSXTIME in the       25080001
*                                  IOSB. If the I/O is active or        25090001
*                                  queued longer that SSGATIME, the     25100001
*                                  I/O will be terminated and IDCSS01   25110001
*                                  will return a return code of 60.     25120001
*                                  Hex values for SSGATIME support      25130001
*                                  seconds from 1 to 255.       @01A*/  25140001
*        3 SSGADEVN CHAR(2),    /* Binary device number that            25150001
*                                  received an IO (RC8) or              25160001
*                                  timeout (RC60) from IDCSS01  @03A*/  25170001
*        3 SSGLPRET FIXED(8),   /* Reason code from link performance    25180001
*                                  statistics processing        @L2A*/  25190001
*        3 SSGLPOAR PTR(31),    /* Address of link performance          25200001
*                                  Statistics output buffer queue.      25210001
*                                  When zero on return, statistics not  25220001
*                                  available for devices found on       25230001
*                                  counts request or statistics not     25240001
*                                  requested by the caller.    2@15C*/  25250001
*        3 SSGSCHST FIXED(8),   /* SUBCHANNEL SET ID + 1                25260001
*                                  Note: Set SSGSCHST to subchannel     25270001
*                                        set id + 1 if using branch     25280001
*                                        entry interface to issue       25290001
*                                        STATUS command to an           25300001
*                                        offline device in an           25310001
*                                        alternate subchannel set.      25320001
*                                                               @17C*/  25330001
*        3 *        CHAR(7),    /* reserved for future use      @10C*/  25340001
*/*******************************************************************/  25350001
*/* Parameter List Extension number 3                               */  25360001
*/* Note: IDCSS01 will not reference fields contained in SSGARGLY   */  25370001
*/*       unless the bit defined as SSGARGL3 is set to '1'.         */  25380001
*/*                                        Entire section added @L3A*/  25390001
*/*******************************************************************/  25400001
*      2 SSGARGLY CHAR(48) BDY(WORD), /* Parm list extension 3      */  25410001
*       3 SSGOPTY BIT(32),      /* Extended options                 */  25420001
*        4 SSGRANKP BIT(1),     /* RANK performance statistics are      25430001
*                                  supported by caller and request      25440001
*                                  return of statistics when request    25450001
*                                  for Subsystem counts are made        25460001
*                                  (SSGRPD=ON) for one or more          25470001
*                                  Subsystems (SSG1SS=ON or             25480001
*                                  SSGALL=ON). Results passed back      25490001
*                                  in area pointed to by SSGRSOAR.      25500001
*                                                               @SIC*/  25510001
*        4 SSGSEGMP BIT(1),     /* Extent pool statistics are           25520001
*                                  supported by caller and request      25530001
*                                  return of statistics when request    25540001
*                                  for Subsystem counts are made        25550001
*                                  (SSGRPD=ON) for one or more          25560001
*                                  Subsystems (SSG1SS=ON or             25570001
*                                  SSGALL=ON). Results passed back      25580001
*                                  in area pointed to by SSGSPOAR.      25590001
*                                                               @SIC*/  25600001
*        4 SSGSEV   BIT(1),     /* Space Efficient Volume (SEVOL)       25610001
*                                  status is supported by caller and    25620001
*                                  request return of status in          25630001
*                                  SSGSEBUF pointed by SSGSEOAR         25640001
*                                  when request for SEVOL are made      25650001
*                                  (SSGSEV=ON) for the scope of         25660001
*                                  single device (SSGDEV=ON), online    25670001
*                                  SEVOL devices in the subsystem       25680001
*                                  (SSG1SS=ON), or all online SEVOL     25690001
*                                  devices (SSGALL=ON).   For single    25700001
*                                  offline SEVOL status, caller set     25710001
*                                  address of the MVS addr character    25720001
*                                  in SSGAVOL and set offline           25730001
*                                  (SSGOFFL=ON).   The Fix Block (FB)   25740001
*                                  SEVOL device status is returned      25750001
*                                  when the reporting scope is single   25760001
*                                  (SSGDEV=ON), the FB user request     25770001
*                                  is active (SSGURFBD=ON) with FB      25780001
*                                  LSS number in SSGFBLSS and FB        25790001
*                                  device number in SSGFBDEV.           25800001
*                                  FB SEVOL status is available         25810001
*                                  through CKD I/O device that          25820001
*                                  resides in the same Storage          25830001
*                                  Facility Image as FB SEVOL and       25840001
*                                  resides in the same Even or Odd      25850001
*                                  number LSS as even or odd FB LSS.    25860001
*                                  SEVOL status is not supported        25870001
*                                  when other statistics or status      25880001
*                                  is requested by caller.      @L6C*/  25890001
*        4 SSGEPC   BIT(1),     /* Extent Pool Config (EPC) status      25900001
*                                  is supported by caller and request   25910001
*                                  return of status in SSGEPBUF         25920001
*                                  pointed by SSGEPOAR when request     25930001
*                                  for EPC of Storage Facility Image    25940001
*                                  oriented by I/O device in            25950001
*                                  SSGADDN or SSGAVOL are made          25960001
*                                  (SSGEPC=ON).  When Extent Pool ID    25970001
*                                  (SSGEPID) is set as 'FFFF'X          25980001
*                                  by caller, EPC summary status        25990001
*                                  is returned.  When even numbered     26000001
*                                  Extent Pool ID is specified          26010001
*                                  in SSGEPID with the I/O device       26020001
*                                  in the even LSS, detail status       26030001
*                                  of EPC for the specified Extent      26040001
*                                  Pool is returned.  When odd          26050001
*                                  numbered Extent Pool ID is           26060001
*                                  specified with the I/O device        26070001
*                                  in the odd LSS, detail status        26080001
*                                  of EPC for the specified Extent      26090001
*                                  Pool is returned.                    26100001
*                                  SSGURBMP is internal use only.       26110001
*                                  When Extent Pool ID (SSGEPID) is     26120001
*                                  set as 'FFFF'X with SSGURBMP is      26130001
*                                  ON, branch entry caller receives     26140001
*                                  error.  ON or OFF of SSGURBMP        26150001
*                                  don't make difference in EPC detail  26160001
*                                  status for branch entry caller.      26170001
*                                  EPC status report is not supported   26180001
*                                  when other statistics or status      26190001
*                                  is requested by caller.      @L6C*/  26200001
*        4 SSGURFBD BIT(1),     /* User requested Fix Block SEVOL       26210001
*                                  status when SSGURFBD is ON.          26220001
*                                                               @L6C*/  26230001
*        4 SSGURBMP BIT(1),     /* IDCAMS internal use.  Refer          26240001
*                                  SSGEPC bit description.      @L6C*/  26250001
*        4 SSGEXRQ  BIT(1),     /* By setting this attribute bit        26260001
*                                  along with other request(s),         26270001
*                                  caller supports and requests the     26280001
*                                  return of extended length            26290001
*                                  statistics.   The extended length    26300001
*                                  is any set of statistics that is     26310001
*                                  larger than the standard length      26320001
*                                  of statistics. The extended          26330001
*                                  length statistics will be            26340001
*                                  returned if the target storage       26350001
*                                  facility supports it, otherwise      26360001
*                                  the standard size statistics will    26370001
*                                  be returned. Ignored this            26380001
*                                  attribute bit for requests where     26390001
*                                  the statistics do not support the    26400001
*                                  extended length and where caller     26410001
*                                  does not make any request.           26420001
*                                  Current request that supports        26430001
*                                  the extended length is:              26440001
*                                  - Link performance statistics        26450001
*                                                               @H4A*/  26460001
*        4 SSGVOL   BIT(1),     /* Volume status is supported by        26470001
*                                  caller and request return of         26480001
*                                  status in SSGSEBUF pointed by        26490001
*                                  SSGSEOAR when request for volume     26500001
*                                  status are made (SSGVOL=ON) for      26510001
*                                  the scope of single device           26520001
*                                  (SSGDEV=ON), online devices in       26530001
*                                  the subsystem (SSG1SS=ON), or        26540001
*                                  all online devices (SSGALL=ON).      26550001
*                                  For single offline volume status,    26560001
*                                  caller sets address of the MVS       26570001
*                                  addr character in SSGAVOL and set    26580001
*                                  offline (SSGOFFL=ON). Volume         26590001
*                                  status is not supported when         26600001
*                                  other statistics or status is        26610001
*                                  requested by caller.         @TPA*/  26620001
*        4 SSGSIOLP BIT(1),     /* Synch I/O Link statistics are        26630001
*                                  supported by caller and request      26640001
*                                  return of statistics when request    26650001
*                                  for Subsystem counts are made        26660001
*                                  (SSGRPD=ON) for one or more          26670001
*                                  Subsystems (SSG1SS=ON or             26680001
*                                  SSGALL=ON). Results passed back      26690001
*                                  in area pointed to by SSGSLOAR.      26700001
*                                                               @SIA*/  26710001
*        4 SSGSILDP BIT(1),     /* Synch I/O Link Diagnostic            26720001
*                                  Parameters are supported by caller   26730001
*                                  and request return of statistics     26740001
*                                  when request for Subsystem counts    26750001
*                                  are made (SSGRPD=ON) for one or      26760001
*                                  more Subsystems (SSG1SS=ON or        26770001
*                                  SSGALL=ON). Results passed back      26780001
*                                  in area pointed to by SSGSDOAR.      26790001
*                                                              1@SIA*/  26800001
*        4 SSGEPCV  BIT(2),     /* Extent Pool Detailed Info Version    26810001
*                                  Version 1 - 00                       26820001
*                                  Version 2 - 10                       26830001
*                                  Version 3 - 01                       26840001
*                                                               @SGA*/  26850001
*       3 SSGRETY CHAR(8),      /* Extended return codes            */  26860001
*        4 SSGRSRET FIXED(8),   /* Reason code from Rank Performance    26870001
*                                  Statistics processing            */  26880001
*        4 SSGSGRET FIXED(8),   /* Reason code from Segm Performance    26890001
*                                  Statistics processing            */  26900001
*        4 SSGSLRET FIXED(8),   /* Reason code from Synch I/O Link      26910001
*                                  Statistics processing        @SIA*/  26920001
*        4 SSGSDRET FIXED(8),   /* Reason code from Synch I/O Link      26930001
*                                  Diagnostic Parameters                26940001
*                                  processing                  1@SIA*/  26950001
*       3 SSGRSOAR PTR(31),     /* Address of Rank performance          26960001
*                                  Statistics output buffer queue.      26970001
*                                  When zero on return, statistics not  26980001
*                                  available for devices found on       26990001
*                                  counts request or statistics         27000001
*                                  not requested by the caller.         27010001
*                                                                   */  27020001
*       3 SSGSPOAR PTR(31),     /* Address of extent pool performance   27030001
*                                  Statistics output buffer queue.      27040001
*                                  When zero on return, statistics not  27050001
*                                  available for devices found on       27060001
*                                  counts request or statistics         27070001
*                                  not requested by the caller.         27080001
*                                                                   */  27090001
*       3 SSGSEOAR PTR(31),     /* Address of SE Volume status output   27100001
*                                  buffer queue.  When zero on return,  27110001
*                                  status not available for devices     27120001
*                                  found on SEVOL status request or     27130001
*                                  status not requested.                27140001
*                                                               @L4A*/  27150001
*       3 SSGEPOAR PTR(31),     /* Address of Extent Pool Config (EPC)  27160001
*                                  status output buffer. When zero on   27170001
*                                  return, status not available for     27180001
*                                  Storage Facility Image found on      27190001
*                                  EPC status request or status not     27200001
*                                  requested by the caller.             27210001
*                                                               @L4A*/  27220001
*       3 SSGEPID  CHAR(2),     /* Extent Pool ID.                      27230001
*                                  'FFFF'X indicates no EP ID is        27240001
*                                  provided by caller.          @L4A*/  27250001
*       3 SSGFBLSS CHAR(2),     /* Fix Block LSS number         @L4A*/  27260001
*       3 SSGFBDEV CHAR(2),     /* Fix Block device number      @L4A*/  27270001
*       3 *        CHAR(2),     /* reserved for future use      @SIC*/  27280001
*       3 SSGSLOAR PTR(31),     /* Address of Synch I/O Link            27290001
*                                  statistics output buffer queue.      27300001
*                                  When zero on return, statistics not  27310001
*                                  available for devices found on       27320001
*                                  counts request or statistics         27330001
*                                  not requested by the caller. @SIA*/  27340001
*       3 SSGSDOAR PTR(31),     /* Address of Synch I/O Link            27350001
*                                  Diagnostic Parameters output         27360001
*                                  buffer queue. When zero on           27370001
*                                  return, statistics not available     27380001
*                                  for devices found on counts          27390001
*                                  request or statistics not            27400001
*                                  requested by the caller.    1@SIA*/  27410001
*       3 *        CHAR(4);     /* reserved for future use     1@SIC*/  27420001
*                                                                       27430001
*DCL SSGARGL_LEN FIXED(32) CONSTANT(LENGTH(SSGARGL));         /*@L4A*/  27440001
*                                                                       27450001
*/*******************************************************************/  27460001
*/*                                                                 */  27470001
*/*    MAPPING FOR THE SUBSYSTEM GET OUTPUT BUFFER                  */  27480001
*/*                                                                 */  27490001
*/*******************************************************************/  27500001
*DCL 1 SSGBUFR BASED(SSGOADR) BDY(WORD),                                27510001
*      2 SSGDAVOL CHAR(6),      /* VOLUME SERIAL                    */  27520001
*      2 SSGDAFLG BIT(8),       /*                              @L4C*/  27530001
*        3 SSG_UA_FLAG BIT(1),  /* 'ONE' UNIT ADDR FORMAT       @L1A*/  27540001
*        3 SSG_FND_STG2 BIT(1), /* 2ND STG DIR PATH FND SS01 TO LA01    27550001
*                                IDCSS01 PASSED TO IDCLA01      @L1A*/  27560001
*        3 SSG_SCHST BIT(2),    /* SUBCHANNEL SET NUMBER        @12A*/  27570001
*                               /*  SCHSET NUMBER 0 - 00        @12A*/  27580001
*                               /*  SCHSET NUMBER 1 - 01        @12A*/  27590001
*                               /*  SCHSET NUMBER 2 - 10        @12A*/  27600001
*                               /*  SCHSET NUMBER 3 - 11        @12A*/  27610001
*        3 * BIT(4),            /* RESERVED                     @12C*/  27620001
*      2 SSGDCUID CHAR(1),      /* Real CUID for data in SSGDADA@02C*/  27630001
*      2 SSGDAUA1 CHAR(4),      /* FIRST UNIT ADDRESS           @L1A*/  27640001
*      2 SSGDAUB1 CHAR(2),      /* FIRST UNIT ADDRESS (BINARY)  @L1A*/  27650001
*      2 SSGDALN FIXED(15),     /* DATA LENGTH                      */  27660001
*      2 SSGDADA CHAR(240),     /* DATA AREA                    @07C    27670001
*                                  FOR LENGTH CALC, NEED CHAR   @L4C    27680001
*                                  LENGTH. ASM SIDE DEFINES LEN @L4C*/  27690001
*        3 SSGDAXPF CHAR(240),  /* CACHING SUBSYSTEM PERFORMANCE        27700001
*                                  STATISTICS                   @07C*/  27710001
*         4 SSGDASPF CHAR(160), /* CACHING SUBSYSTEM COUNTS     @H1C*/  27720001
*          5 SSGDA2SD CHAR(80), /* STATUS FOR 2 SD             @H20C*/  27730001
*           6 SSGDAIPF CHAR(80),/* PAGING SUBSYSTEM COUNTS     @H20C*/  27740001
*            7 SSGDASS CHAR(44), /* SUBSYSTEM STATUS (LNGTHND) @H20C*/  27750001
*             8 SSGDASS_40 CHAR(40),    /* STATUS FOR 3380  @OW01528*/  27760001
*              9 SSGDAACD CHAR(24),     /* ACCESSCODES      @OW01528*/  27770001
*               10 SSGDAAC0 CHAR(12),   /* STORAGE CLUSTER 0 WORD       27780001
*                                                           @OW01528*/  27790001
*               10 SSGDAAC1 CHAR(12);   /* STORAGE CLUSTER 1 WORD       27800001
*                                                           @OW01528*/  27810001
*                                                                       27820001
*DCL SSGBUFR_LEN FIXED(32) CONSTANT(LENGTH(SSGBUFR));         /*@L4A*/  27830001
*                                                                       27840001
*/*******************************************************************/  27850001
*/*                                                                 */  27860001
*/*    MAPPING FOR THE SUBSYSTEM GET OUTPUT BUFFER                  */  27870001
*/*    FOR LINK PERFORMANCE STATISTICS                              */  27880001
*/*                                                                 */  27890001
*/*    Output buffer is a chain, anchored by SSGLPOAR, of link      */  27900001
*/*    performance statistics tables. Each table entry represents   */  27910001
*/*    data read from a single storage subsystem box.  The          */  27920001
*/*    statistics from a single box may be described with more than */  27930001
*/*    table entry.  The chain is a single threaded queue. Each     */  27940001
*/*    chain element needs to be freed by the caller of this        */  27950001
*/*    interface.  Output buffer is built for storage boxes         */  27960001
*/*    that support link performance statistics and are returned    */  27970001
*/*    only if requested by caller (SSGLINKP) on a request for      */  27980001
*/*    performance data (SSGRPD) for requests with scope of         */  27990001
*/*    subsystem (SSG1SS) or all subsystems (SSGALL).           @SIC*/  28000001
*/*    The parameter list extension must also be passed as          */  28010001
*/*    indicated with SSGARLG2.                                     */  28020001
*/*                                      Entire structure added @L2A*/  28030001
*/*                                                                 */  28040001
*/*******************************************************************/  28050001
*/*    Notes added by OA29397 ( @H4 flagged )                       */  28060001
*/*                                                                 */  28070001
*/*    With change made by OA29397, Link Performance statistics     */  28080001
*/*    can be longer than standard 96 bytes when SSGEXRQ is         */  28090001
*/*    is set.                                                      */  28100001
*/*    In order to map this flexible size of Link Performance       */  28110001
*/*    Statistics, check SSGLVER to determine which mapping         */  28120001
*/*    macro sturcture should be used. SSGLLSET is the length       */  28130001
*/*    of the each table entry of Link Performance Statistics       */  28140001
*/*    sets.                                                        */  28150001
*/*                                                                 */  28160001
*/*    - When SSGLVER is 0, each table entry of Link Performance    */  28170001
*/*      Statistics sets can be mapped by SSGLLSTA.                 */  28180001
*/*                                                                 */  28190001
*/*    - When SSGLVER is 1, each table entry of Link Performance    */  28200001
*/*      Statistics sets can be mapped by SSGLXSTA.                 */  28210001
*/*                                                                 */  28220001
*/*    - When SSGLVER is 2, each table entry of Link Performance@13A*/  28230001
*/*      Statistics sets can be mapped by SSGLXST2.             @13A*/  28240001
*/*                                                                 */  28250001
*/*    Sample to support both SSGLVER version 0 and 1               */  28260001
*/*                                                                 */  28270001
*/*      1. Save away information in SSGLHDR before re-map          */  28280001
*/*         SSGLBUFR.                                               */  28290001
*/*                                                                 */  28300001
*/*      2. For 96 bytes of SSGLLSTA mapping,                       */  28310001
*/*         re-map SSGLBUFR by the pointer calclated from the       */  28320001
*/*         address of SSGLBUFR plus the saved away SSGLLSET        */  28330001
*/*         value multiplied by the index number for the            */  28340001
*/*         SSGLLSTA table entry.  SSGLLSET becomes invalid         */  28350001
*/*         after SSGLBUFR is re-mapped.                            */  28360001
*/*                                                                 */  28370001
*/*      3. For 97 to 156 bytes of SSGLXSTA mapping,                */  28380001
*/*         re-map SSGLXSTA by the pointer calclated from the       */  28390001
*/*         address of SSGLDADA plus the saved away SSGLLSET        */  28400001
*/*         value multiplied by the index number for SSGLXSTA       */  28410001
*/*         table entry.                                            */  28420001
*/*                                                                 */  28430001
*/*      ** Establish mapping for SSGLHDR **                        */  28440001
*/*      RFY SSGLBUFR Based(QueueElementPonitr)                     */  28450001
*/*                                                                 */  28460001
*/*      ** Save away SSGLHDR data **                               */  28470001
*/*      OffsetToSets = SSGLQDAO                                    */  28480001
*/*      NumOfSet = SSGLNSET                                        */  28490001
*/*      SetSize  = SSGLLSET                                        */  28500001
*/*      VerOfSet = SSGLVER                                         */  28510001
*/*                                                                 */  28520001
*/*      ** Process table entries **                                */  28530001
*/*      Do Idx=0 To (NumOfSet-1)                                   */  28540001
*/*                                                                 */  28550001
*/*        RFY SSGLBUFR                                             */  28560001
*/*              Based( QueueElementPonitr + SetSize * Idx )        */  28570001
*/*        RFY SSGLXSTA                                             */  28580001
*/*              Based( QueueElementPonitr + OffsetToSets           */  28590001
*/*                     + SetSize * Idx )                           */  28600001
*/*                                                                 */  28610001
*/*        Process content of SSGLLSTA                              */  28620001
*/*        Byte 1 to 96                                             */  28630001
*/*                                                                 */  28640001
*/*        If ( 1 = VerOfSet ) Then                                 */  28650001
*/*          Do                                                     */  28660001
*/*                                                                 */  28670001
*/*            Process content of SSGLXSTA                          */  28680001
*/*            Byte 97 to 156                                       */  28690001
*/*                                                                 */  28700001
*/*          End                                                    */  28710001
*/*      End                                                        */  28720001
*/*      ** Remove mapping for SSGLBUFR and SSGLXSTA **             */  28730001
*/*      RFY SSGLBUFR Based                                         */  28740001
*/*      RFY SSGLXSTA Based                                         */  28750001
*/*                                                                 */  28760001
*/*******************************************************************/  28770001
*DCL 1 SSGLBUFR BASED(SSGLPOAR) BDY(WORD),                              28780001
*     2 SSGLHDR CHAR(56) BDY(WORD),/* Queue element header          */  28790001
*      3 SSGLQDAL FIXED(32),    /* Length of this queue element,        28800001
*                                  header plus data                 */  28810001
*      3 SSGLQDAO FIXED(32),    /* Offset to the start of the           28820001
*                                  statistics sets                  */  28830001
*      3 SSGLFWDP PTR(31),      /* Pointer to next queue element,       28840001
*                                  when zero end of queue           */  28850001
*/*      Orientation to subsystem that stats pertain                */  28860001
*      3 SSGLVOL CHAR(6),       /* Volume serial of device that stats   28870001
*                                  where read from                  */  28880001
*      3 SSGLDEVN CHAR(2),      /* Device number of device that         28890001
*                                  Stats where read from            */  28900001
*      3 SSGLFLG      BIT(8),   /*                              @12A*/  28910001
*       4 *           BIT(2),   /* Reserved                     @12A*/  28920001
*       4 SSGL_SCHST  BIT(2),   /* Subchannel Set Number        @12A*/  28930001
*                               /*  SCHSET NUMBER 0 - 00        @12A*/  28940001
*                               /*  SCHSET NUMBER 1 - 01        @12A*/  28950001
*                               /*  SCHSET NUMBER 2 - 10        @12A*/  28960001
*                               /*  SCHSET NUMBER 3 - 11        @12A*/  28970001
*       4 *           BIT(4),   /* Reserved                     @12A*/  28980001
*      3 *            CHAR(7),  /* Reserved                     @12C*/  28990001
*      3 SSGLLHDR CHAR(28) BDY(WORD),/* Link stats info             */  29000001
*       4 SSGLNSET FIXED(16),   /* Num of link stats sets read      */  29010001
*       4 SSGLLSET FIXED(16),   /* Size of each set.                    29020001
*                                  The extended size would be set       29030001
*                                  if the target storage facility       29040001
*                                  supports it and SSGEXRQ is set,      29050001
*                                  otherwise the standard 96-bytes      29060001
*                                  entry size for each interface        29070001
*                                  ID will be set.              @H4C*/  29080001
*       4 SSGLCUT CHAR(6),      /* Control unit type                */  29090001
*       4 SSGLCUM CHAR(3),      /* Control unit model               */  29100001
*       4 SSGLSEQ CHAR(10),     /* Control unit sequence number     */  29110001
*       4 SSGLVER CHAR(1),      /* Version of link statistics.          29120001
*                                  When value of version is X'00',      29130001
*                                  it indicates the link statistics     29140001
*                                  are defined in the 96 byte format.   29150001
*                                  When value of version is X'01',      29160001
*                                  it indicates the link statistics     29170001
*                                  are defined in the 156 byte          29180001
*                                  format.                              29190001
*                                  When value of version is X'02',      29200001
*                                  it indicates the link statistics     29210001
*                                  are defined in the 220 byte          29220001
*                                  format.                      @13C*/  29230001
*       4 *        CHAR(4),     /* Not used                         */  29240001
*     2 SSGLDADA CHAR(*) BDY(WORD), /* Link performance stats read  */  29250001
*                                                                       29260001
*/*******************************************************************/  29270001
*/* SSGLDADA consists of link statistics sets with Interface ID     */  29280001
*/* containing one or more table information entries.  Each         */  29290001
*/* entry can be 96 bytes defined in SSGLLSTA or 156 bytes          */  29300001
*/* defined in SSGLXSTA or 220 bytes defined in SSGLXST2        @13C*/  29310001
*/* depending on version number in SSGLVER.                     @13C*/  29320001
*/**************************************************************@13C*/  29330001
*                                                                       29340001
*      /* Added mapping of link statistics                      @L3A*/  29350001
*      3 SSGLLSTA (*) CHAR(96) BDY(WORD), /* Stats entry            */  29360001
*       4 SSGLLTYP FIXED(8),    /* Link type                            29370001
*                                   00 - Link Not Operational   @13A    29380001
*                                   01 - ESCON                          29390001
*                                   02 - Fibre Channel 1 Gb/s           29400001
*                                   03 - Fibre Channel 2 Gb/s           29410001
*                                   04 - Fibre Channel 4 Gb/s           29420001
*                                   05 - Fibre Channel 8 Gb/s   @H4C    29430001
*                                   06 - Fibre Channel 16 Gb/s  @13C    29440001
*                                   07 - Fibre Channel 32 Gb/s  @SIA    29450001
*                                   08-0F - Reserved            @SIA    29460001
*                                   10 - Fibre Channel Over     @13A    29470001
*                                        Ethernet 10 Gb/s       @13A    29480001
*                                   11 - Fibre Channel Over     @13A    29490001
*                                        Ethernet 40 Gb/s       @13A*/  29500001
*       4 *        FIXED(8),    /* Unused                           */  29510001
*       4 SSGLLBYI FIXED(8),    /* Byte increment                       29520001
*                                   Value Description                   29530001
*                                   01    Low order bit represents      29540001
*                                         128K bytes.          1@15C*/  29550001
*       4 SSGLLTMI FIXED(8),    /* Time increment                       29560001
*                                   Value Description                   29570001
*                                   01    Low order bit represents      29580001
*                                         16 milliseconds.     1@15C*/  29590001
*       4 SSGLLFLG BIT(8),      /* Flags                        @13A*/  29600001
*        5 SSGLCPBS BIT(1),     /* CPU Percent Busy Scope       @13A*/  29610001
*        5 SSGLPSSV BIT(1),     /* Port Security Statistics Valid       29620001
*                                  When set to one, SSGLPSCG,           29630001
*                                  SSGLRMLG, SSGLRLSC, SSGLRLLA,        29640001
*                                  and SSGLRLEF are valid.     1@15A*/  29650001
*        5 *        BIT(6),     /* Unused                      1@15A*/  29660001
*       4 *        CHAR(1),     /* Unused                       @13C*/  29670001
*       4 SSGLLIID CHAR(2),     /* Interface id                     */  29680001
*       4 SSGLLSAT CHAR(88) BDY(WORD), /* Link statistics           */  29690001
*        5 SSGLERDB FIXED(32),  /* Eckd read bytes in byte              29700001
*                                  increment                        */  29710001
*        5 SSGLEWRB FIXED(32),  /* Eckd write bytes in byte             29720001
*                                  increment                        */  29730001
*        5 SSGLERDO FIXED(32),  /* Eckd read operations. for escon      29740001
*                                  ports, one count per chain which     29750001
*                                  transfers data to the host. for      29760001
*                                  ficon ports, one count per           29770001
*                                  command which transfer data to       29780001
*                                  the host                         */  29790001
*        5 SSGLEWRO FIXED(32),  /* Eckd write operations. for escon     29800001
*                                  ports, one count per chain which     29810001
*                                  transfers data to the host. for      29820001
*                                  ficon ports, one count per           29830001
*                                  command which transfer data to       29840001
*                                  the host                         */  29850001
*        5 SSGLERDT FIXED(32),  /* Eckd read accumulated time on        29860001
*                                  channel.  the active processing      29870001
*                                  time for each command is             29880001
*                                  accumulated based on increment       29890001
*                                  value.                           */  29900001
*        5 SSGLEWRT FIXED(32),  /* Eckd write accumulated time on       29910001
*                                  channel.  the active processing      29920001
*                                  time for each command is             29930001
*                                  accumulated based on increment       29940001
*                                  value.                           */  29950001
*        5 SSGLPRDB FIXED(32),  /* Pprc send bytes in byte              29960001
*                                  increment                        */  29970001
*        5 SSGLPWRB FIXED(32),  /* Pprc received bytes in byte          29980001
*                                  increment                        */  29990001
*        5 SSGLPRDO FIXED(32),  /* Pprc send operations. each           30000001
*                                  pprc write command sent by the       30010001
*                                  pprc primary                     */  30020001
*        5 SSGLPWRO FIXED(32),  /* Pprc received operations. each       30030001
*                                  pprc write command received by       30040001
*                                  the pprc secondary.              */  30050001
*        5 SSGLPRDT FIXED(32),  /* Pprc send accumulated time           30060001
*                                  based on incremant value         */  30070001
*        5 SSGLPWRT FIXED(32),  /* Pprc received accumulated time       30080001
*                                  based on increment value         */  30090001
*        5 SSGLSRDB FIXED(32),  /* Scsi read bytes in byte              30100001
*                                  increment                        */  30110001
*        5 SSGLSWRB FIXED(32),  /* Scsi write bytes in byte             30120001
*                                  increment                        */  30130001
*        5 SSGLSRDO FIXED(32),  /* Scsi read operations. each           30140001
*                                  scsi read is counted             */  30150001
*        5 SSGLSWRO FIXED(32),  /* Scsi write operations. each          30160001
*                                  scsi write is counted            */  30170001
*        5 SSGLSRDT FIXED(32),  /* Scsi read accumulated time           30180001
*                                  based on increment value         */  30190001
*        5 SSGLSWRT FIXED(32),  /* Scsi write accumulated time          30200001
*                                  based on increment value         */  30210001
*        5 SSGLPSCG BIT(8),     /* Port Security Configuration 1@15A*/  30220001
*         6 SSGLPCSE BIT(1),    /* Port is Configured for               30230001
*                                  Security Enabled            1@15A*/  30240001
*         6 SSGLPCSF BIT(1),    /* Port is Configured for               30250001
*                                  Security Enforced           1@15A*/  30260001
*         6 *        BIT(6),    /* Not Used. Set to zero.      1@15A*/  30270001
*        5 *        FIXED(8),   /* Not Used                    1@15C*/  30280001
*        5 SSGLRMLG FIXED(16),  /* Remote Logins               1@15A*/  30290001
*        5 SSGLRLSC FIXED(16),  /* Remote Logins - Security             30300001
*                                  Capable                     1@15A*/  30310001
*        5 SSGLRLLA FIXED(16),  /* Remote Logins - Link                 30320001
*                                  Authenticated               1@15A*/  30330001
*        5 SSGLRLEF FIXED(16),  /* Remote Logins - Encryption           30340001
*                                  of Data In Flight (EDIF)    1@15A*/  30350001
*        5 *        CHAR(5),    /* Not Used                    1@15C*/  30360001
*        5 SSGLPBHA FIXED(8);   /* Percent Busy for Host Adapter        30370001
*                                  or Host Port.                @13A*/  30380001
*      /* End added mapping of link statistics                  @L3A*/  30390001
*                                                                       30400001
*/*******************************************************************/  30410001
*/* SSGLDADA consists of table entries defined by SSGLXSTA      @13C*/  30420001
*/* shown below when SSGLVER is decimal value of 1.             @13C*/  30430001
*/*                        Entire 156 bytes section is added by @H4A*/  30440001
*/*******************************************************************/  30450001
*DCL 1 SSGLXSTA (*) CHAR(156)   /*                                  */  30460001
*        BASED( SSGLPOAR+OFFSET(SSGLDADA)) BDY(WORD), /*            */  30470001
*     2 *          CHAR(96),    /* Mapped in SSGLLSTA               */  30480001
*     2 SSGLFLKF FIXED(32),     /* Fibre Channel Link Failure           30490001
*                                  Error Count.                         30500001
*                                  This count is the number of          30510001
*                                  miscellaneous fibre channel link     30520001
*                                  errors, such as unexpected NOS       30530001
*                                  received or a link state machine     30540001
*                                  failure detected.                */  30550001
*     2 SSGLFLSY FIXED(32),     /* Fibre Channel Loss of                30560001
*                                  Synchronization Error Count.         30570001
*                                  This count is the number of loss     30580001
*                                  of synchronization errors where it   30590001
*                                  is a confirmed and a persistent      30600001
*                                  synchronization loss on the fibre    30610001
*                                  channel link.                    */  30620001
*     2 SSGLFLSG FIXED(32),     /* Fibre Channel Loss of Signal         30630001
*                                  Error Count.                         30640001
*                                  This count is the number of times    30650001
*                                  that a loss of signal was detected   30660001
*                                  on the fibre channel link when a     30670001
*                                  signal was previously                30680001
*                                  detected.                        */  30690001
*     2 SSGLFPSQ FIXED(32),     /* Fibre Channel Primitive Sequence     30700001
*                                  Error Count.                         30710001
*                                  This count is the number of          30720001
*                                  primitive sequence protocol error    30730001
*                                  counts where an unexpected           30740001
*                                  primitive sequence was received.     30750001
*                                                                   */  30760001
*     2 SSGLFITW FIXED(32),     /* Fibre Channel Invalid Transmission   30770001
*                                  Word Error Count.                    30780001
*                                  This count is the number of times    30790001
*                                  a "bit" error was detected.          30800001
*                                  Examples of a "bit" errors are a     30810001
*                                  code violation, invalid special      30820001
*                                  code alignment, or disparity         30830001
*                                  errors.                          */  30840001
*     2 SSGLFCRC FIXED(32),     /* Fibre Channel CRC Error Count.       30850001
*                                  This count is the number of          30860001
*                                  times a received frame's CRC         30870001
*                                  is in error.                     */  30880001
*     2 SSGLFLR1 FIXED(32),     /* Fibre Channel Link Recovery          30890001
*                                  (LR) Sent Count Count.               30900001
*                                  This count is the number of times    30910001
*                                  the port has transitioned from       30920001
*                                  an active (AC) state to a Link       30930001
*                                  Recovery (LR1) state.            */  30940001
*     2 SSGLFLR2 FIXED(32),     /* Fibre Channel Link Recovery          30950001
*                                  (LR) Received Count Recovery         30960001
*                                  Count.                               30970001
*                                  This count is the number of times    30980001
*                                  the port has transitioned from       30990001
*                                  an active (AC) state to a Link       31000001
*                                  Recovery (LR2) state.            */  31010001
*     2 SSGLFILF FIXED(32),     /* Fibre Channel Illegal Frame          31020001
*                                  Count.                               31030001
*                                  This count is the number of frames   31040001
*                                  that violated Fibre Channel          31050001
*                                  protocol.   One example is an        31060001
*                                  invalid frame header. One common     31070001
*                                  reason is when the first frame of    31080001
*                                  data sequence is missing and a       31090001
*                                  subsequent data frame is detected    31100001
*                                  as illegal.                      */  31110001
*     2 SSGLFOOD FIXED(32),     /* Fibre Channel Missing Frame  @13C    31120001
*                                  Count.                               31130001
*                                  This count is the number of          31140001
*                                  times that a missing frame is        31150001
*                                  detected. The frame is either        31160001
*                                  missing from a data sequence or      31170001
*                                  it is received beyond the port's     31180001
*                                  sequence reassembly threshold.   */  31190001
*     2 SSGLFOOA FIXED(32),     /* Fibre Channel Out of Order           31200001
*                                  ACK Count.                           31210001
*                                  This count is the number of times    31220001
*                                  that a out of order ACK frame is     31230001
*                                  detected. The frame is either        31240001
*                                  missing from a data sequence         31250001
*                                  or it is received beyond the         31260001
*                                  port's sequence reassembly           31270001
*                                  threshold.                       */  31280001
*     2 SSGLFDPF FIXED(32),     /* Fibre Channel Duplicate              31290001
*                                  Frame Count.                         31300001
*                                  This count is the number of          31310001
*                                  times a frame was received           31320001
*                                  that has been detected as            31330001
*                                  previously processed.            */  31340001
*     2 SSGLFIRO FIXED(32),     /* Fibre Channel Invalid                31350001
*                                  Relative Offset Count.               31360001
*                                  This count is the number of          31370001
*                                  times that a frame was received      31380001
*                                  with bad relative offset in the      31390001
*                                  frame header.                    */  31400001
*     2 SSGLFSQT FIXED(32),     /* Fibre Channel Sequence               31410001
*                                  Timeout Count.                       31420001
*                                  This count is the number of  @13C    31430001
*                                  times the port has detected          31440001
*                                  a timeout on receiving the           31450001
*                                  next frame in a fibre channel        31460001
*                                  sequence.                        */  31470001
*     2 SSGLFBER FIXED(32);     /* Fibre Channel Bit Error              31480001
*                                  Rate Count.                          31490001
*                                  This count is the number of the      31500001
*                                  bit error (invalid transmission      31510001
*                                  word) bursts for the previous 5      31520001
*                                  minute counting window.          */  31530001
*                                                                       31540001
*/*******************************************************************/  31550001
*/* SSGLDADA consists of table entries defined by SSGLXST2 shown    */  31560001
*/* below when SSGLVER is decimal value of 2.                       */  31570001
*/*                        Entire 220 bytes section is added by @13A*/  31580001
*/*******************************************************************/  31590001
*DCL 1 SSGLXST2 (*) CHAR(220)   /*                                  */  31600001
*        BASED( SSGLPOAR+OFFSET(SSGLDADA)) BDY(WORD), /*            */  31610001
*     2 *          CHAR(156),   /* Mapped in SSGLXSTA               */  31620001
*     2 SSGLFRBZ FIXED(32),     /* Fibre Channel Receive Buffer Zero    31630001
*                                  Credit.                              31640001
*                                  This count is the number of          31650001
*                                  one second intervals where the       31660001
*                                  receive buffer credit was zero.  */  31670001
*     2 SSGLFSBZ FIXED(32),     /* Fibre Channel Send Buffer Zero       31680001
*                                  Credit.                              31690001
*                                  This count is the number of          31700001
*                                  one second intervals where the       31710001
*                                  send buffer credit was zero.     */  31720001
*     2 SSGLFEHC FIXED(32),     /* Fibre Channel Exchange High          31730001
*                                  Count.                               31740001
*                                  This count is the number of          31750001
*                                  times the Fibre Channel exchange     31760001
*                                  count crossed the High Threshold.*/  31770001
*     2 SSGLFQFB FIXED(32),     /* Fibre Channel Queue Full or          31780001
*                                  Busy Status.                         31790001
*                                  This count is the number of          31800001
*                                  times the FCP port returned          31810001
*                                  QUEUE FULL or BUSY status.       */  31820001
*     2 SSGLFEOC FIXED(32),     /* Fibre Channel Exchange Overrun       31830001
*                                  Count.                               31840001
*                                  This count is the number of          31850001
*                                  Fibre Channel exchanges that         31860001
*                                  were lost due to overdriving         31870001
*                                  the host adapter port.           */  31880001
*     2 SSGLFARC FIXED(32),     /* Fibre Channel Abort Received         31890001
*                                  Count.                               31900001
*                                  This count is the number of          31910001
*                                  times a port received an abort.  */  31920001
*     2 SSGLRDRP FIXED(32),     /* Read Diagnostic Parameter: Rx        31930001
*                                  Power.                               31940001
*                                  This value contains the measured     31950001
*                                  received optical power in units      31960001
*                                  of 0.1uW (Range 0-6.5mW). If the     31970001
*                                  value is 0, the function is not      31980001
*                                  supported by the current level       31990001
*                                  of microcode.                    */  32000001
*     2 SSGLRDTP FIXED(32),     /* Read Diagnostic Parameter: Tx        32010001
*                                  Power.                               32020001
*                                  This value contains the measured     32030001
*                                  coupled Tx output power in units     32040001
*                                  of 0.1uW (Range 0-6.5mW). If the     32050001
*                                  value is 0, the function is not      32060001
*                                  supported by the current level       32070001
*                                  of microcode.                    */  32080001
*     2 SSGLRDTT FIXED(16),     /* Read Diagnostic Parameter:           32090001
*                                  Internally Measured Transceiver      32100001
*                                  Temperature.                         32110001
*                                  This value is reported in units      32120001
*                                  of 1/256 C (Range -128C to +128C).   32130001
*                                  If the value is 0, the function      32140001
*                                  is not supported by the current      32150001
*                                  level of microcode.              */  32160001
*     2 SSGLRDSV FIXED(16),     /* Read Diagnostic Parameter:           32170001
*                                  Internally Measured Supply           32180001
*                                  Voltage.                             32190001
*                                  This value is reported in units      32200001
*                                  of 100uV (Range 0-6.55V). If the     32210001
*                                  value is 0, the function is not      32220001
*                                  supported by the current level       32230001
*                                  of microcode.                    */  32240001
*     2 SSGLRDTC FIXED(16),     /* Read Diagnostic Parameter:           32250001
*                                  Measured Transmitter Laser           32260001
*                                  Bias Current.                        32270001
*                                  This value is reported in units      32280001
*                                  of 2uA (Range 0-131mA). If the       32290001
*                                  value is 0, the function is not      32300001
*                                  supported by the current level       32310001
*                                  of microcode.                    */  32320001
*     2 SSGLRDFG FIXED(16),     /* Read Diagnostic Parameter: Flags     32330001
*                                  0     Forward Error                  32340001
*                                        Correction                     32350001
*                                        0     Forward Error            32360001
*                                              Correction is not        32370001
*                                              active on the link.      32380001
*                                        1     Forward Error            32390001
*                                              Correction is active     32400001
*                                              on the link.     @SIA    32410001
*                                  1-7   Reserved. Set to zero. @SIC    32420001
*                                  8-9   Connector Type                 32430001
*                                        00    Unknown                  32440001
*                                        01    SFP+             @SIA    32450001
*                                        10-11 Reserved                 32460001
*                                  10    SFP Diagnostic Parameters      32470001
*                                        Validity                       32480001
*                                        0     Diagnostic Parameters    32490001
*                                              are Valid                32500001
*                                        1     Diagnostic Parameters    32510001
*                                              are NOT Valid. The       32520001
*                                              response does not        32530001
*                                              include valid values     32540001
*                                              for Temperature, Vcc,    32550001
*                                              Tx Bias, Tx Power,       32560001
*                                              and Rx Power.            32570001
*                                  11    Optical Port                   32580001
*                                        0     Not an Optical Port      32590001
*                                        1     Optical Port             32600001
*                                  12-15 Port Tx Type                   32610001
*                                        0000      Not Optical or       32620001
*                                                  Other Type           32630001
*                                        0001      Short Wave Laser     32640001
*                                        0010      Long Wave Laser      32650001
*                                                  LC 1310nm            32660001
*                                        0011      Long Wave Laser      32670001
*                                                  LL 1550nm            32680001
*                                        0100-1111 Reserved         */  32690001
*     2 SSGLUFEC FIXED(32),     /* Number of Bad Blocks that were       32700001
*                                  Uncorrectable by Forward Error       32710001
*                                  Correction (FEC)                 */  32720001
*     2 SSGLCFEC FIXED(32),     /* Number of Bad Blocks that were       32730001
*                                  Correctable by Forward Error         32740001
*                                  Correction (FEC)                 */  32750001
*     2 SSGLTMCR FIXED(32),     /* Transport Mode Command Retries.      32760001
*                                  This value is the total number       32770001
*                                  of retries requested for             32780001
*                                  Transport Mode write operations      32790001
*                                  due to not enough buffers to         32800001
*                                  receive unsolicited data.        */  32810001
*     2 SSGLTMTR FIXED(32),     /* Transport Mode Transfer Readies.     32820001
*                                  This value is the total number       32830001
*                                  of Transfer Mode operations from     32840001
*                                  channels that require transfer       32850001
*                                  ready and were received from         32860001
*                                  channels that support Transfer       32870001
*                                  Mode Command Retry.              */  32880001
*     2 *        CHAR(8);       /* Reserved                         */  32890001
*                                                                       32900001
*/*******************************************************************/  32910001
*/*                                                                 */  32920001
*/*    MAPPING FOR THE SUBSYSTEM GET OUTPUT BUFFER                  */  32930001
*/*    FOR RANK PERFORMANCE STATISTICS                              */  32940001
*/*                                                                 */  32950001
*/*    Output buffer is a queue, anchored by SSGRSOAR, of rank      */  32960001
*/*    performance statistics.  Each queue element represents data  */  32970001
*/*    read from a single storage subsystem box that describes sets */  32980001
*/*    of statistics.  The queue is a single threaded queue.  Each  */  32990001
*/*    queue element needs to be freed by the caller of this        */  33000001
*/*    interface.  Output buffer built for storage subsystem boxes  */  33010001
*/*    that support rank performance statistics and are returned    */  33020001
*/*    only if requested by caller (SSGRANKP) on a request for      */  33030001
*/*    performance data (SSGRPD) for requests with scope of         */  33040001
*/*    subsystem (SSG1SS) or all subsystems (SSGALL).           @SIC*/  33050001
*/*                                        Entire section added @L3A*/  33060001
*/*******************************************************************/  33070001
*DCL 1 SSGRBUFR BASED(SSGRSOAR) BDY(WORD),                              33080001
*     2 SSGRHDR CHAR(56) BDY(WORD),/* Queue element header          */  33090001
*      3 SSGRQDAL FIXED(32),    /* Length of this queue element,        33100001
*                                  header plus data                 */  33110001
*      3 SSGRQDAO FIXED(32),    /* Offset to the start of the           33120001
*                                  statistics sets                  */  33130001
*      3 SSGRFWDP PTR(31),      /* Pointer to next queue element,       33140001
*                                  when zero end of queue           */  33150001
*/*      Orientation to subsystem that stats pertain                */  33160001
*      3 SSGRVOL CHAR(6),       /* Volume serial of device that stats   33170001
*                                  where read from                  */  33180001
*      3 SSGRDEVN CHAR(2),      /* Device number of device that         33190001
*                                  Stats where read from            */  33200001
*      3 SSGRFLG     BIT(8),    /*                              @12A*/  33210001
*       4 *          BIT(2),    /* Reserved                     @12A*/  33220001
*       4 SSGR_SCHST BIT(2),    /* Subchannel Set Number        @12A*/  33230001
*                               /*  SCHSET NUMBER 0 - 00        @12A*/  33240001
*                               /*  SCHSET NUMBER 1 - 01        @12A*/  33250001
*                               /*  SCHSET NUMBER 2 - 10        @12A*/  33260001
*                               /*  SCHSET NUMBER 3 - 11        @12A*/  33270001
*       4 *           BIT(4),   /* Reserved                     @12A*/  33280001
*      3 *            CHAR(7),  /* Reserved                     @12C*/  33290001
*      3 SSGRRHDR CHAR(28) BDY(WORD),/* Rank stats info             */  33300001
*       4 SSGRNSET FIXED(16),   /* Num of rank stat sets available      33310001
*                                  to be returned on the ESS            33320001
*                                  starting from first rank ID          33330001
*                                  SSGRRID. Can be used to determine    33340001
*                                  buffer requirements              */  33350001
*       4 SSGRLSET FIXED(16),   /* Size of each rank stats set          33360001
*                                   excluding size of array info        33370001
*                                   SSGRRAR                         */  33380001
*       4 SSGRCUT CHAR(6),      /* Control unit type                */  33390001
*       4 SSGRCUM CHAR(3),      /* Control unit model               */  33400001
*       4 SSGRSEQ CHAR(10),     /* Control unit sequence number     */  33410001
*       4 SSGRVER CHAR(1),      /* Version of rank statistics       */  33420001
*       4 SSGRARNM FIXED(16),   /* Num of array info sets avail         33430001
*                                   to be returned on the ESS           33440001
*                                   starting from first rank id         33450001
*                                   SSGRRID. Can be used to determine   33460001
*                                   buffer requirements             */  33470001
*       4 SSGRARSZ FIXED(16),   /* Size of each array information       33480001
*                                   set SSGRRAR                     */  33490001
*     2 SSGRDADA CHAR(*),       /* Rank performance stats read      */  33500001
*      3 SSGRRSTA (*) CHAR(56), /* Rank statistics entry            */  33510001
*       4 SSGRRKID FIXED(16) BDY(BYTE), /* Rank Identifier          */  33520001
*    /***************************************************************/  33530001
*    /* The returned data consists of rank sets with each rank      */  33540001
*    /* set containing one or more array information entries.       */  33550001
*    /***************************************************************/  33560001
*    1 SSGRRSTT CHAR(*)         /*                                  */  33570001
*          BASED BDY(WORD),     /* Rank stats entry mapping             33580001
*                                   includes one or more entries        33590001
*                                   for array information           */  33600001
*     2 SSGRRID  FIXED(16),     /* Rank identifier                  */  33610001
*     2 SSGRRPNM FIXED(16),     /* Extent pool number               */  33620001
*     2 SSGRRCNT FIXED(8),      /* Count of arrays in rank          */  33630001
*     2 SSGRRRTQ BIT(8),        /* Rank Type Qualifier          @H4A*/  33640001
*      3 SSGRRDER BIT(1),       /* Data Encrypted Rank. When '1',       33650001
*                                  the data stored on the physical      33660001
*                                  media (i.e disk) is                  33670001
*                                  encrypted.                   @H4A*/  33680001
*      3 *        BIT(6),       /* Reserved, set to zero        @11C*/  33690001
*      3 SSGRRAPV BIT(1),       /* Adapter Pair ID Valid. When '1',     33700001
*                                  the Adapter Pair ID in Bytes         33710001
*                                  6-7 is valid.                @11A*/  33720001
*     2 SSGRRAPI  FIXED(16),    /* Adapter Pair ID              @11C*/  33730001
*/*******************************************************************/  33740001
*/* In the statistics below bytes are accumulated in units of       */  33750001
*/* 128 KB, and time is accumulated in units of 16 milliseconds     */  33760001
*/*******************************************************************/  33770001
*     2 SSGRRBYR FIXED(32),     /* Rank bytes read                  */  33780001
*     2 SSGRRBYW FIXED(32),     /* Rank bytes written               */  33790001
*     2 SSGRRROP FIXED(32),     /* Rank read operations             */  33800001
*     2 SSGRRWOP FIXED(32),     /* Rank write operations            */  33810001
*     2 SSGRRKRT FIXED(32),     /* Rank read response time      @13C*/  33820001
*     2 SSGRRKWT FIXED(32),     /* Rank write response time     @13C*/  33830001
*     2 SSGRRAR (*) CHAR(24)    /* Array information            @13C*/  33840001
*                  BDY(WORD),   /*  mapping                         */  33850001
*       3 SSGRRAID FIXED(16),   /* Rank array id                    */  33860001
*       3 SSGRREBC CHAR(16),    /* Array type in ebcdic             */  33870001
*       3 SSGRRTYP FIXED(8),    /* Array type                       */  33880001
*                               /* 01 = RAID-5                      */  33890001
*                               /* 02 = RAID-10                     */  33900001
*                               /* 03 = RAID-6                      */  33910001
*                               /* 04-FF NOT USED                   */  33920001
*       3 SSGRRAWD FIXED(8),    /* Array width                      */  33930001
*       3 SSGRRASP FIXED(8),    /* Array speed (1000 RPM)           */  33940001
*       3 SSGRRACS BIT(8),      /* Array Device Class and Array @H4C    33950001
*                                  Status                       @H4A*/  33960001
*         4 SSGRRADC BIT(2),    /* Array Device Class               */  33970001
*           /********************************************************/  33980001
*           /* Device Class                                         */  33990001
*           /* '00'b Enterprise                                     */  34000001
*           /* '01'b Near-line (An Advanced Technology Attachment   */  34010001
*           /*       (ATA) Drive)                                   */  34020001
*           /* '10'b SATA (Serial Advanced Technology Attachment    */  34030001
*           /*       (ATA) Drive)                                   */  34040001
*           /* '11'b Solid State Drive (SSD)                        */  34050001
*           /**************************************************@H4A**/  34060001
*         4 SSGRRAS1 BIT(1),    /* Raid Degraded.  One or more array    34070001
*                                  members need rebuilding      @H4A*/  34080001
*         4 SSGRRAS2 BIT(1),    /* DDM Throttling.  A Near-line DDM     34090001
*                                  in the array is throttling           34100001
*                                  performance due to temperature       34110001
*                                  or workload.                 @H4A*/  34120001
*         4 SSGRRAS3 BIT(1),    /* RPM Exception.  A DDM with an        34130001
*                                  slower RPM than the normal           34140001
*                                  array DDMs is a member of            34150001
*                                  the array as a result of             34160001
*                                  a sparing action.            @H4A*/  34170001
*         4 *        BIT(3),    /* Not used                     @H4A*/  34180001
*       3 SSGRRACP CHAR(2);     /* Array capacity (GB)              */  34190001
*                                                                       34200001
*/**************************************************************@13A*/  34210001
*/* SSGRDADA consists of table entries defined by SSGRDADA1         */  34220001
*/* shown below when SSGLVER is decimal value of 1.                 */  34230001
*/*                                                                 */  34240001
*/* In the statistics below bytes are accumulated in units of       */  34250001
*/* 128 KB, and time is accumulated in units of 16 milliseconds     */  34260001
*/*                         Entire 88 bytes section is added by @13A*/  34270001
*/*******************************************************************/  34280001
*DCL 1 SSGRDADA1 (*) CHAR(88)    /*                                 */  34290001
*        BASED( SSGRSOAR+OFFSET(SSGRDADA)) BDY(WORD), /*            */  34300001
*     2 SSGRRKID1 FIXED(16) BDY(BYTE), /* Rank Identifier           */  34310001
*    /***************************************************************/  34320001
*    /* The returned data consists of rank sets with each rank      */  34330001
*    /* set containing one or more array information entries.       */  34340001
*    /***************************************************************/  34350001
*    1 SSGRRSTT1 CHAR(*)        /*                                  */  34360001
*          BASED BDY(WORD),     /* Rank stats entry mapping         */  34370001
*     2 *         CHAR(32),     /* Rank Info Enty mapped in SSGRRSTT*/  34380001
*     2 SSGRARLT FIXED(32),     /* Accumulated Rank Loading Time.   */  34390001
*     2 SSGRDTQC FIXED(32),     /* Number of Times Destages were        34400001
*                                  Queued due to Internal Processing*/  34410001
*     2 SSGRDTQT FIXED(32),     /* Accumulated Time Destages were       34420001
*                                  Queued due to Internal Processing*/  34430001
*     2 SSGRFCBR FIXED(32),     /* Ver 01: Not used. Set to zero.       34440001
*                                  Ver 02: Flash Copy Rank Bytes        34450001
*                                          Read                     */  34460001
*     2 SSGRFCBW FIXED(32),     /* Ver 01: Not used. Set to zero.       34470001
*                                  Ver 02: Flash Copy Rank Bytes        34480001
*                                          Written                  */  34490001
*     2 SSGRFCRO FIXED(32),     /* Ver 01: Not used. Set to zero.       34500001
*                                  Ver 02: Flash Copy Rank Read         34510001
*                                          Operations               */  34520001
*     2 SSGRFCWO FIXED(32),     /* Ver 01: Not used. Set to zero.       34530001
*                                  Ver 02: Flash Copy Rank Write        34540001
*                                          Operations               */  34550001
*     2 SSGRFCRR FIXED(32),     /* Ver 01: Not used. Set to zero.       34560001
*                                  Ver 02: Flash Copy Rank Read         34570001
*                                          Response Time            */  34580001
*     2 SSGRRAR1 (*) CHAR(24)   /* Array information                */  34590001
*                  BDY(WORD),   /* mapping (Mapped in SSGRRAR)      */  34600001
*       3 SSGRRAID1 FIXED(16),  /* Rank array id                    */  34610001
*       3 SSGRREBC1 CHAR(16),   /* Array type in ebcdic             */  34620001
*       3 SSGRRTYP1 FIXED(8),   /* Array type                       */  34630001
*                               /* 01 = RAID-5                      */  34640001
*                               /* 02 = RAID-10                     */  34650001
*                               /* 03 = RAID-6                      */  34660001
*                               /* 04-FF NOT USED                   */  34670001
*       3 SSGRRAWD1 FIXED(8),   /* Array width                      */  34680001
*       3 SSGRRASP1 FIXED(8),   /* Array speed (1000 RPM)           */  34690001
*       3 SSGRRACS1 BIT(8),     /* Array Device Class and Array         34700001
*                                  Status                           */  34710001
*         4 SSGRRADC1 BIT(2),   /* Array Device Class               */  34720001
*           /********************************************************/  34730001
*           /* Device Class                                         */  34740001
*           /* '00'b Enterprise                                     */  34750001
*           /* '01'b Near-line (An Advanced Technology Attachment   */  34760001
*           /*       (ATA) Drive)                                   */  34770001
*           /* '10'b SATA (Serial Advanced Technology Attachment    */  34780001
*           /*       (ATA) Drive)                                   */  34790001
*           /* '11'b Solid State Drive (SSD)                        */  34800001
*           /********************************************************/  34810001
*         4 SSGRRAS1S1 BIT(1),  /* Raid Degraded.  One or more array    34820001
*                                  members need rebuilding          */  34830001
*         4 SSGRRAS1S2 BIT(1),   /* DDM Throttling.  A Near-line DDM    34840001
*                                  in the array is throttling           34850001
*                                  performance due to temperature       34860001
*                                  or workload.                     */  34870001
*         4 SSGRRAS1S3 BIT(1),   /* RPM Exception.  A DDM with an       34880001
*                                  slower RPM than the normal           34890001
*                                  array DDMs is a member of            34900001
*                                  the array as a result of             34910001
*                                  a sparing action.                */  34920001
*         4 *        BIT(3),    /* Not used                         */  34930001
*       3 SSGRRACP1 CHAR(2);    /* Array capacity (GB)              */  34940001
*                                                                       34950001
*/**************************************************************@13A*/  34960001
*/* SSGRDADA consists of table entries defined by SSGRDADA2         */  34970001
*/* shown below when SSGLVER is decimal value of 2.                 */  34980001
*/*                                                                 */  34990001
*/* In the statistics below bytes are accumulated in units of       */  35000001
*/* 128 KB, and time is accumulated in units of 16 milliseconds     */  35010001
*/*                        Entire 152 bytes section is added by @13A*/  35020001
*/*******************************************************************/  35030001
*DCL 1 SSGRDADA2 (*) CHAR(152)   /*                                 */  35040001
*        BASED( SSGRSOAR+OFFSET(SSGRDADA)) BDY(WORD), /*            */  35050001
*     2 SSGRRKID2 FIXED(16) BDY(BYTE), /* Rank Identifier           */  35060001
*    /***************************************************************/  35070001
*    /* The returned data consists of rank sets with each rank      */  35080001
*    /* set containing one or more array information entries.       */  35090001
*    /***************************************************************/  35100001
*    1 SSGRRSTT2 CHAR(*)        /*                                  */  35110001
*          BASED BDY(WORD),     /* Rank stats entry mapping         */  35120001
*     2 *         CHAR(64),     /* Rnk Info Enty mapped in SSGRRSTT1*/  35130001
*     2 SSGRFCRW FIXED(32),     /* Flash Copy Rank Write Response       35140001
*                                  Time                             */  35150001
*     2 SSGRETBR FIXED(32),     /* Easy Tier Rank Bytes Read        */  35160001
*     2 SSGRETBW FIXED(32),     /* Easy Tier Rank Bytes Written     */  35170001
*     2 SSGRETRO FIXED(32),     /* Easy Tier Rank Read Operations   */  35180001
*     2 SSGRETWO FIXED(32),     /* Easy Tier Rank Write Operations  */  35190001
*     2 SSGRETRR FIXED(32),     /* Easy Tier Rank Read Response         35200001
*                                  Time                             */  35210001
*     2 SSGRETRW FIXED(32),     /* Easy Tier Rank Write Response        35220001
*                                  Time                             */  35230001
*     2 SSGRCRBR FIXED(32),     /* Cloud Rank Bytes Read            */  35240001
*     2 SSGRCRBW FIXED(32),     /* Cloud Rank Bytes Written         */  35250001
*     2 SSGRCRRO FIXED(32),     /* Cloud Rank Read Operations       */  35260001
*     2 SSGRCRWO FIXED(32),     /* Cloud Rank Write Operations      */  35270001
*     2 SSGRCRRR FIXED(32),     /* Cloud Rank Read Response Time    */  35280001
*     2 SSGRCRRW FIXED(32),     /* Cloud Rank Write Response Time   */  35290001
*     2 SSGRRUPC FIXED(8),      /* Rank Utilization Percentage 2@SGA*/  35300001
*     2 *        CHAR(11),      /* Reserved                    2@SGC*/  35310001
*     2 SSGRRAR2 (*) CHAR(24)   /* Array information                */  35320001
*                  BDY(WORD),   /* mapping (Mapped in SSGRRAR)      */  35330001
*       3 SSGRRAID2 FIXED(16),  /* Rank array id                    */  35340001
*       3 SSGRREBC2 CHAR(16),   /* Array type in ebcdic             */  35350001
*       3 SSGRRTYP2 FIXED(8),   /* Array type                       */  35360001
*                               /* 01 = RAID-5                      */  35370001
*                               /* 02 = RAID-10                     */  35380001
*                               /* 03 = RAID-6                      */  35390001
*                               /* 04-FF NOT USED                   */  35400001
*       3 SSGRRAWD2 FIXED(8),   /* Array width                      */  35410001
*       3 SSGRRASP2 FIXED(8),   /* Array speed (1000 RPM)           */  35420001
*       3 SSGRRACS2 BIT(8),     /* Array Device Class and Array         35430001
*                                  Status                           */  35440001
*         4 SSGRRADC2 BIT(2),   /* Array Device Class               */  35450001
*           /********************************************************/  35460001
*           /* Device Class                                         */  35470001
*           /* '00'b Enterprise                                     */  35480001
*           /* '01'b Near-line (An Advanced Technology Attachment   */  35490001
*           /*       (ATA) Drive)                                   */  35500001
*           /* '10'b SATA (Serial Advanced Technology Attachment    */  35510001
*           /*       (ATA) Drive)                                   */  35520001
*           /* '11'b Solid State Drive (SSD)                        */  35530001
*           /********************************************************/  35540001
*         4 SSGRRAS2S1 BIT(1),  /* Raid Degraded.  One or more array    35550001
*                                  members need rebuilding          */  35560001
*         4 SSGRRAS2S2 BIT(1),   /* DDM Throttling.  A Near-line DDM    35570001
*                                  in the array is throttling           35580001
*                                  performance due to temperature       35590001
*                                  or workload.                     */  35600001
*         4 SSGRRAS2S3 BIT(1),   /* RPM Exception.  A DDM with an       35610001
*                                  slower RPM than the normal           35620001
*                                  array DDMs is a member of            35630001
*                                  the array as a result of             35640001
*                                  a sparing action.                */  35650001
*         4 *        BIT(3),    /* Not used                         */  35660001
*       3 SSGRRACP2 CHAR(2);    /* Array capacity (GB)              */  35670001
*                                                                       35680001
*/*******************************************************************/  35690001
*/*                                                                 */  35700001
*/*    MAPPING FOR THE SUBSYSTEM GET OUTPUT BUFFER                  */  35710001
*/*    FOR EXTENT POOL PERFORMANCE STATISTICS                       */  35720001
*/*                                                                 */  35730001
*/*    Output buffer is a queue, anchored by SSGSPOAR, of extent    */  35740001
*/*    pool perf statistics.  Each queue element represents data    */  35750001
*/*    read from a single storage subsystem box that describes sets */  35760001
*/*    of statistics.  The queue is a single threaded queue.  Each  */  35770001
*/*    queue element needs to be freed by the caller of this        */  35780001
*/*    interface.  Output buffer built for storage subsystem boxes  */  35790001
*/*    that support rank performance statistics and are returned    */  35800001
*/*    only if requested by caller (SSGSEGMP) on a request for      */  35810001
*/*    performance data (SSGRPD) for requests with scope of         */  35820001
*/*    subsystem (SSG1SS) or all subsystems (SSGALL).           @SIC*/  35830001
*/*                                        Entire section added @L3A*/  35840001
*/*******************************************************************/  35850001
*DCL 1 SSGSBUFR BASED(SSGSPOAR) BDY(WORD),                              35860001
*     2 SSGSHDR CHAR(56) BDY(WORD),/* Queue element header          */  35870001
*      3 SSGSQDAL FIXED(32),    /* Length of this queue element,        35880001
*                                  header plus data                 */  35890001
*      3 SSGSQDAO FIXED(32),    /* Offset to the start of the           35900001
*                                  statistics sets                  */  35910001
*      3 SSGSFWDP PTR(31),      /* Pointer to next queue element,       35920001
*                                  when zero end of queue           */  35930001
*/*      Orientation to subsystem that stats pertain                */  35940001
*      3 SSGSVOL CHAR(6),       /* Volume serial of device that stats   35950001
*                                  where read from                  */  35960001
*      3 SSGSDEVN CHAR(2),      /* Device number of device that         35970001
*                                  Stats where read from            */  35980001
*      3 SSGSSFLG    BIT(8),    /*                              @12A*/  35990001
*       4 *          BIT(2),    /* Reserved                     @12A*/  36000001
*       4 SSGSS_SCHST BIT(2),   /* Subchannel Set Number        @12A*/  36010001
*                               /*  SCHSET NUMBER 0 - 00        @12A*/  36020001
*                               /*  SCHSET NUMBER 1 - 01        @12A*/  36030001
*                               /*  SCHSET NUMBER 2 - 10        @12A*/  36040001
*                               /*  SCHSET NUMBER 3 - 11        @12A*/  36050001
*       4 *           BIT(4),   /* Reserved                     @12A*/  36060001
*      3 *            CHAR(7),  /* Reserved                     @12C*/  36070001
*      3 SSGSSHDR CHAR(28) BDY(WORD),/* Extent pool stats info      */  36080001
*       4 SSGSNSET FIXED(16),   /* Num of pool stats sets read      */  36090001
*       4 SSGSLSET FIXED(16),   /* Size of each set                 */  36100001
*       4 SSGSCUT CHAR(6),      /* Control unit type                */  36110001
*       4 SSGSCUM CHAR(3),      /* Control unit model               */  36120001
*       4 SSGSSEQ CHAR(10),     /* Control unit sequence number     */  36130001
*       4 SSGSVER CHAR(1),      /* Version of pool statistics       */  36140001
*       4 SSGSFLG BIT(8),       /* Flags                            */  36150001
*        5 SSGSVLD BIT(1),      /* Extent pool statistics valid         36160001
*                                  When set to one, SSGSSRSC,           36170001
*                                  SSGSSVCP, SSGSSNMV, SSGSSVSC,        36180001
*                                  SSGSSSDY, and SSGSSTDY are           36190001
*                                  valid.                      2@15C*/  36200001
*        5 SSGSVLD2 BIT(1),     /* Extent pool statistics valid 2       36210001
*                                  When set to one, SSGSSEPS,           36220001
*                                  SSGSSBCE, and SSGSSBAE are           36230001
*                                  valid.                      2@16A*/  36240001
*        5 *       BIT(6),      /* Not used. Set to zero.      2@16C*/  36250001
*       4 *        CHAR(3),     /* Not used                         */  36260001
*     2 SSGSDADA CHAR(*),       /* Extent pool perf stats read      */  36270001
*      3 SSGSSSTA (*) CHAR(52), /* Extent pool stats entry          */  36280001
*       4 SSGSSGID FIXED(16) BDY(BYTE), /* Extent pool identifier   */  36290001
*    1 SSGSSSTT CHAR(52)        /*                                  */  36300001
*          BASED BDY(WORD),     /* Extent pool stats entry includes     36310001
*                                  one or more entry                */  36320001
*     2 SSGSSPID FIXED(16),     /* Extent pool identifier           */  36330001
*     2 SSGSSPLT FIXED(8),      /* Extent pool type                     36340001
*                                    Hex  Description                   36350001
*                                    04   FB 1 GB                       36360001
*                                    84   CKD 1 GB (1113 cylinders)     36370001
*                                                              2@16C*/  36380001
*     2 SSGSSPTQ BIT(8),        /* Extent Pool Type Qualifier   @H4C*/  36390001
*      3 SSGSSDEP BIT(1),       /* Data Encrypted Extent Pool.          36400001
*                                  When '1', the data stored on         36410001
*                                  the physical media (i.e disk)        36420001
*                                  is encrypted.                @H4A*/  36430001
*      3 SSGSSETS BIT(1),       /* Tiered Storage.                      36440001
*                                  When '1', the Extent Pool            36450001
*                                  contains multiple disk               36460001
*                                  storage classes.            2@15C*/  36470001
*      3 *        BIT(5),       /* Reserved, set to zero        @15C*/  36480001
*      3 SSGSSESV BIT(1),       /* Extent Sizes Valid                   36490001
*                                  When '1', SSGSSEPS contains          36500001
*                                  the extent sizes in the              36510001
*                                  Extent Pool.                 @15C*/  36520001
*     2 SSGSSCAP FIXED(32),     /* Real extent pool capacity (GB)   */  36530001
*     2 SSGSSNMS FIXED(32),     /* Num real extents in extent pool  */  36540001
*     2 SSGSSNMA FIXED(32),     /* Num real allocated extents in        36550001
*                                  extent pool                 2@15C*/  36560001
*     2 SSGSSRSC FIXED(32),     /* Number of Extents Allocated          36570001
*                                  (Real Extent Conversions)   2@16C*/  36580001
*     2 SSGSSVCP FIXED(32),     /* Virtual extent pool capacity (GB)*/  36590001
*     2 SSGSSNMV FIXED(32),     /* Number of virtual extents in         36600001
*                                  extent pool                      */  36610001
*     2 SSGSSVSC FIXED(32),     /* Number of Extents Freed              36620001
*                                  (Virtual Extent Conversions)2@16C*/  36630001
*     2 SSGSSSDY FIXED(32),     /* Number of extents that were          36640001
*                                  sources of a dynamic extent          36650001
*                                  relocation                   @15C*/  36660001
*     2 SSGSSTDY FIXED(32),     /* Number of extents that were          36670001
*                                  targets of a dynamic extent          36680001
*                                  relocation                   @15C*/  36690001
*     2 SSGSSEPS BIT(8),        /* Extent Sizes in Extent Pool  @15A*/  36700001
*      3 *        BIT(1),       /* Reserved                     @15A*/  36710001
*      3 SSGS01GB BIT(1),       /* 1 GB Extents                         36720001
*                                  (CKD 1113 cylinders)        2@16A*/  36730001
*      3 *        BIT(5),       /* Reserved                    2@16A*/  36740001
*      3 SSGS16MB BIT(1),       /* 16 MB Extents                        36750001
*                                  (CKD 21 cylinders)          2@16A*/  36760001
*     2 *        CHAR(3),       /* Not used                    2@16C*/  36770001
*     2 SSGSSBCE FIXED(32),     /* Safeguarded Copy Virtual             36780001
*                                  Backup Capacity Extents     2@16A*/  36790001
*     2 SSGSSBAE FIXED(32);     /* Safeguarded Copy Backup              36800001
*                                  Allocated Extents           2@16A*/  36810001
*                                                                       36820001
*/*******************************************************************/  36830001
*/*                                                                 */  36840001
*/*  MAPPING FOR THE SPACE EFFICIENT VOLUME STATUS                  */  36850001
*/*    OUTPUT BUFFER                                                */  36860001
*/*                                                                 */  36870001
*/*    Output buffer is a queue, anchored by SSGSEOAR, of Space     */  36880001
*/*  Efficient Volume (SEVOL) status. Each queue element represents */  36890001
*/*  status of the space efficient volume specified in the header.  */  36900001
*/*    The queue is a single threaded queue.  Each queue element    */  36910001
*/*    needs to be freed by the caller of this interface.           */  36920001
*/*  Output buffer is built for SEVOL(s) when SEVOL status is       */  36930001
*/*  requested  (SSGSEV=ON).                                        */  36940001
*/*   Caller sets the scope of SEVOL(s) by turning one of flag bit  */  36950001
*/*  that is the single device (SSGDEV), subsystem (SSG1SS),        */  36960001
*/*  or all subsystems (SSGALL).  For a single SEVOL status request,*/  36970001
*/*  the SEVOL status can be obtain when the path of SEVOL is       */  36980001
*/*  available.   For a subsystem and all systems scope,            */  36990001
*/*  the SEVOL status is available when SEVOL is ONLINE.            */  37000001
*/*   When the scope is the single device (SSGDEV=ON) and           */  37010001
*/*  the Fix Block SEVOL is requested (SSGURFBD=ON),  the status    */  37020001
*/*  of FB SEVOL oriented by LSS (SSGFBLSS) and Device              */  37030001
*/*  (SSGFBDEV) is reported.  FB SEVOL status is not available      */  37040001
*/*  with the scope of the subsystem (SSG1SS=ON) and                */  37050001
*/*  the all subsystems (SSGALL=ON).   FB SEVOL status is available */  37060001
*/*  when LSS number of both the I/O device (SSGAVOL or SSGDDN) and */  37070001
*/*  FB SEVOL are numbered in the same even or odd number.          */  37080001
*/*                                                                 */  37090001
*/*  Flag and variable combinations of SEVOL status request         */  37100001
*/*  are shown as below railroad chart.                             */  37110001
*/*                                                                 */  37120001
*/*  >>_SSGSEV_ _SSGALL________ ________________> (A)               */  37130001
*/*            !_SSG1SS________!                                    */  37140001
*/*            !                                                    */  37150001
*/*            !_SSGDEV_ ____________________ __> (B)               */  37160001
*/*                     !_SSGFBLSS__SSGFBDEV_!                      */  37170001
*/*                                                                 */  37180001
*/*                                                                 */  37190001
*/*       (A)>__ _SSGAVOL__SSGUNIT__ __ __________________><        */  37200001
*/*             !_SSGADDN___________!  !                            */  37210001
*/*                                    !                            */  37220001
*/*                                    !                            */  37230001
*/*       (B)>__ _SSGAVOL__SSGUNIT__ __!                            */  37240001
*/*             !_SSGADDN___________!                               */  37250001
*/*             !_SSGAVOL__SSGOFFL__!                               */  37260001
*/*                                                                 */  37270001
*/*                                        Entire section added @L4A*/  37280001
*/*******************************************************************/  37290001
*DCL 1 SSGSEBUF BASED(SSGSEOAR) BDY(WORD),                              37300001
*     2 SSGSEHDR CHAR(68) BDY(WORD),/* Queue element header     @TPC*/  37310001
*      3 SSGSEQAL FIXED(32),    /* Length of this queue element,        37320001
*                                  header plus data                 */  37330001
*      3 SSGSEQAO FIXED(32),    /* Offset to the start of the           37340001
*                                  statistics sets                  */  37350001
*      3 SSGSEFWP PTR(31),      /* Pointer to next queue element,       37360001
*                                  when zero end of queue           */  37370001
*/*      Orientation to device that status pertain                  */  37380001
*      3 SSGSEVOL CHAR(6),      /* Volume serial of device that stats   37390001
*                                  where read from                  */  37400001
*      3 SSGSEDEV CHAR(2),      /* Device number of device that         37410001
*                                  Stats where read from            */  37420001
*      3 SSGSESCX CHAR(2),      /* Subsystem ID                     */  37430001
*      3 *        CHAR(2),      /* not used                         */  37440001
*      3 SSGSETTL FIXED(32),    /* Total SE VOL Count, only valid   */  37450001
*                               /* for head of buffer chain         */  37460001
*      3 SSGSVHDR CHAR(28) BDY(WORD), /* SE VOL header              */  37470001
*        4 SSGSESZ FIXED(16),   /* Size of data                     */  37480001
*        4 SSGSECUT CHAR(6),    /* Control unit type                */  37490001
*        4 SSGSECUM CHAR(3),    /* Control unit model               */  37500001
*        4 SSGSECUC CHAR(3),    /* Control unit maker/company   @L5A*/  37510001
*        4 SSGSECUP CHAR(2),    /* Control unit plant           @L5A*/  37520001
*        4 SSGSESEQ CHAR(12),   /* Control unit sequence number @L5C*/  37530001
*      3 SSGSEETL FIXED(32),    /* Total ESE VOL Count, only valid  */  37540001
*                               /* for head of buffer chain     @TPA*/  37550001
*      3 SSGSESTL FIXED(32),    /* Total STD VOL Count, only valid  */  37560001
*                               /* for head of buffer chain     @TPA*/  37570001
*      3 SSGSALCM CHAR(3),      /* Allocation Method            @TPA*/  37580001
*      3 SSGSGFLG BIT(8),       /* SGC Flag Byte                @SGC*/  37590001
*       4 SSGSGCBI BIT(1),      /* Report SGC Backup Vol Info   @SGC*/  37600001
*       4 *        BIT(7),      /* not used                     @SGC*/  37610001
*     2 SSGSEDAD CHAR(60) BDY(WORD), /* SE Vol statistics       @16C*/  37620001
*/*******************************************************************/  37630001
*/* Specified Volume                                            @SGA*/  37640001
*/*******************************************************************/  37650001
*      3 SSGSEFLG BIT(8),       /* Flag byte 1                      */  37660001
*       4 SSGSEVF BIT(1),       /* ON=TSE Volume                @16C*/  37670001
*       4 SSGSEAN BIT(1),       /* Space Currently allocated is @L5A*/  37680001
*                               /* not available                @L5A*/  37690001
*       4 SSGSEEV BIT(1),       /* ON=ESE Volume                @16C*/  37700001
*       4 SSGSEBV BIT(1),       /* ON=Info Reprted for Bckup Vol@16A*/  37710001
*       4 SSGSEBE BIT(1),       /* ON=Backup Volume Expanding   @16A*/  37720001
*       4 *       BIT(3),       /* not used                     @16C*/  37730001
*      3 *       CHAR(1),       /* not used                         */  37740001
*      3 SSGSEEP CHAR(2),       /* Extent Pool ID                   */  37750001
*/*******************************************************************/  37760001
*/* The following two fields are a remaining percentage of usable   */  37770001
*/* space that will initiate a notification to the host             */  37780001
*/*******************************************************************/  37790001
*      3 SSGSECWW FIXED(8),     /* Capacity Limit Warning Watermark     37800001
*                                                               @SGC*/  37810001
*      3 SSGSEGWW FIXED(8),     /* Guaranteed Capacity Warning          37820001
*                                  Watermark                    @SGC*/  37830001
*      3 *        CHAR(2),      /* not used                         */  37840001
*/*******************************************************************/  37850001
*/* The following fields are expressed in number of cylinders for   */  37860001
*/* CKD device.   The following fields are expressed in TENTH of    */  37870001
*/* binary Gigabytes for Fix Block device.                          */  37880001
*/*******************************************************************/  37890001
*      3 SSGSEC   FIXED(32),    /* SE Volume Capacity Limit     @SGC*/  37900001
*      3 SSGSEG   FIXED(32),    /* SE Volume Guaranteed Capacity@SGC*/  37910001
*      3 SSGSESCA FIXED(32),    /* Space Currently Allocated in         37920001
*                                  this Volumes Extent Pool     @SGC*/  37930001
*      3 SSGSEEPR FIXED(32),    /* Size of Space to Configure           37940001
*                                  Volumes                      @SGC*/  37950001
*      3 SSGSECAP FIXED(32),    /* SE Volume Capacity           @SGC*/  37960001
*/*******************************************************************/  37970001
*/* Backup Volume                                                   */  37980001
*/*                                        Entire section added @SGA*/  37990001
*/*******************************************************************/  38000001
*      3 SSGSEFLGB BIT(8),      /* Flag byte 1                      */  38010001
*       4 SSGSEVFB BIT(1),      /* ON=TSE Volume                @16C*/  38020001
*       4 SSGSEANB BIT(1),      /* Space Currently allocated is @16A*/  38030001
*                               /* not available                @16A*/  38040001
*       4 SSGSEEVB BIT(1),      /* ON=ESE Volume                @16A*/  38050001
*       4 SSGSEBVB BIT(1),      /* ON=Info Reprted for Bckup Vol@16C*/  38060001
*       4 SSGSEBEB BIT(1),      /* ON=Backup Volume Expanding   @16A*/  38070001
*       4 *        BIT(3),      /* not used                     @16C*/  38080001
*      3 *        CHAR(1),      /* not used                         */  38090001
*      3 SSGSEEPB CHAR(2),      /* Extent Pool ID                   */  38100001
*/*******************************************************************/  38110001
*/* The following two fields are a remaining percentage of usable   */  38120001
*/* space that will initiate a notification to the host             */  38130001
*/*******************************************************************/  38140001
*      3 SSGSECWWB FIXED(8),    /* Capacity Limit Warning Watermark */  38150001
*      3 SSGSEGWWB FIXED(8),    /* Guaranteed Capacity Warning          38160001
*                                  Watermark                        */  38170001
*      3 *         CHAR(2),     /* not used                         */  38180001
*/*******************************************************************/  38190001
*/* The following fields are expressed in number of cylinders for   */  38200001
*/* CKD device.   The following fields are expressed in TENTH of    */  38210001
*/* binary Gigabytes for Fix Block device.                          */  38220001
*/*******************************************************************/  38230001
*      3 SSGSECB   FIXED(32),   /* SE Volume Capacity Limit         */  38240001
*      3 SSGSEGB   FIXED(32),   /* SE Volume Guaranteed Capacity    */  38250001
*      3 SSGSESCAB FIXED(32),   /* Space Currently Allocated in         38260001
*                                  this Volumes Extent Pool         */  38270001
*      3 SSGSEEPRB FIXED(32),   /* Size of Space to Configure           38280001
*                                  Volumes                          */  38290001
*      3 SSGSECAPB FIXED(32),   /* SE Volume Capacity           @16C*/  38300001
*      3 SSGSESEQB FIXED(32);   /* Sequence Number of the last          38310001
*                                  Consistency Group in the prior       38320001
*                                  SGC Backup Capacity Volume           38330001
*                                  Size                         @16A*/  38340001
*                                                                       38350001
*/*******************************************************************/  38360001
*/*                                                                 */  38370001
*/*    MAPPING FOR THE EXTENT POOL CONFIGURATION STATUS             */  38380001
*/*    OUTPUT BUFFER                                                */  38390001
*/*                                                                 */  38400001
*/*    Output buffer is a queue, anchored by SSGEPOAR, of Extent    */  38410001
*/*    Pool Configuration status.  Each queue element represents    */  38420001
*/*    the status of the Extent Pools defined in Storage Facility   */  38430001
*/*    image. If the caller provide a Extent Pool ID ( SSGEPID      */  38440001
*/*    has value between '0'X and 'FFFE'X ), then in addition to    */  38450001
*/*    the summary status of Extent Pools,  the detail status of    */  38460001
*/*    that Extent Pool identified by Extent Pool ID is presented.  */  38470001
*/*    caller is responsible for freeing the output buffer.         */  38480001
*/*                                                                 */  38490001
*/*    The flag and variable combinations for EPC status is         */  38500001
*/*    shown as below railroad chart.                               */  38510001
*/*                                                                 */  38520001
*/*                Below variable defines scope                     */  38530001
*/*                                                                 */  38540001
*/*   >>__SSGEPC__ _SSGEPID=('FFFF'X)________________________>(A)   */  38550001
*/*               !_SSGEPID=('0'X to 'FFFE'X of even number)_>(B)   */  38560001
*/*               !_SSGEPID=('1'X to 'FFFD'X of odd number)__>(C)   */  38570001
*/*                                                                 */  38580001
*/*                                                                 */  38590001
*/*    (A)>_____________________________________________ _______>   */  38600001
*/*    (B)>_(Even LSS I/O dev follows)_ _ ___________ __!           */  38610001
*/*    (C)>_(Odd LSS I/O dev follows)__! !_SSGURBMP__!              */  38620001
*/*                                                                 */  38630001
*/*       Following variable and flag represent I/O device          */  38640001
*/*                                                                 */  38650001
*/*    >______ _SSGAVOL__SSGUNIT__ ______________________________>< */  38660001
*/*           !_SSGADDN___________!                                 */  38670001
*/*           !_SSGAVOL__SSGOFFL__!                                 */  38680001
*/*                                                                 */  38690001
*/*                                        Entire section added @L4A*/  38700001
*/*******************************************************************/  38710001
*DCL 1 SSGEPBUF BASED(SSGEPOAR) BDY(WORD),                              38720001
*     2 SSGEHDR CHAR(44) BDY(WORD),/* Queue element header      @SGC*/  38730001
*      3 SSGEPQAL FIXED(32),    /* Length of this queue element,        38740001
*                                  header plus data                 */  38750001
*      3 SSGEPQAO FIXED(32),    /* Offset to the start of the           38760001
*                                  statistics sets                  */  38770001
*      3 SSGEPFWD FIXED(32),    /* Pointer to next queue element,       38780001
*                                  when zero end of queue       @L6C*/  38790001
*/*      Orientation to device that stats pertain                   */  38800001
*      3 SSGEPVOL CHAR(6),      /* Volume serial of device that stats   38810001
*                                  where read from                  */  38820001
*      3 SSGEPDEV CHAR(2),      /* Device number of device that         38830001
*                                  Stats where read from            */  38840001
*      3 SSGEPIDC FIXED(16),    /* EP ID provided by caller         */  38850001
*      3 *            CHAR(6),  /* Reserved                         */  38860001
*      3 SSGEPSIP PTR(31),      /* Internal code use only.              38870001
*                                  Branch Entry caller shall            38880001
*                                  set zero.                    @L6C*/  38890001
*      3 SSGEPSI1P PTR(31),     /* Internal code use only.              38900001
*                                  Branch Entry caller shall            38910001
*                                  set zero.                    @SGA*/  38920001
*      3 SSGEPSI2P PTR(31),     /* Internal code use only.              38930001
*                                  Branch Entry caller shall            38940001
*                                  set zero.                    @SGA*/  38950001
*      3 SSGEPSDO FIXED(16),    /* Offset to Summary data       @L6A*/  38960001
*      3 SSGEPDDO FIXED(16),    /* Offset to Detail data        @L6A*/  38970001
*     2 SSGEPDAD CHAR(*) BDY(WORD),/* Ext Pool Config status        */  38980001
*      3 SSGEPDHL CHAR(32) BDY(WORD),/* FIXED LENGTH OF EPC DATA HDR*/  38990001
*       4 SSGEPLEN FIXED(16),   /* Length of data returned          */  39000001
*       4 SSGEPCNT FIXED(16),   /* Count of Extent Pools            */  39010001
*       4 SSGEPFL1 BIT(16),     /* HEADER FLAGS                     */  39020001
*        5 SSGEPIDV BIT(1),     /* EXT POOL DETAILED DATA VALID     */  39030001
*        5 SSGEPLSS BIT(1),     /* Bitmap represents even LSS's         39040001
*                                  when set to zero and odd LSS's       39050001
*                                  when set to one.            2@15C*/  39060001
*        5 SSGEPCC  BIT(1),     /* Specified Extent Pool ID owned by    39070001
*                                  Partner CEC, no data reported in     39080001
*                                  Extent Pool Detailed Information     39090001
*                                                              2@15C*/  39100001
*        5 *        BIT(13),    /* Not Used                    2@15C*/  39110001
*       4 SSGEPCUT CHAR(6),     /* Control unit type                */  39120001
*       4 SSGEPCUM CHAR(3),     /* Control unit model               */  39130001
*       4 SSGEPCUC CHAR(3),     /* Control unit maker/campany   @L5A*/  39140001
*       4 SSGEPCUP CHAR(2),     /* Control unit plant           @L5A*/  39150001
*       4 SSGEPSEQ CHAR(12),    /* Control unit sequence number @L5C*/  39160001
*/*******************************************************************/  39170001
*/* The format of the next eight bytes is repeated the number       */  39180001
*/* times as indicated by SSGEPCNT.                                 */  39190001
*/*******************************************************************/  39200001
*      3 SSGEPSUM (*) CHAR(8) BDY(WORD),/* Ext Pool summary data    */  39210001
*       4 SSGEPIDS CHAR(2),     /* Extent Pool ID                   */  39220001
*/*******************************************************************/  39230001
*/* The following two fields are a remaining percentage of usable   */  39240001
*/* space that will initiate a notification to the host             */  39250001
*/*******************************************************************/  39260001
*       4 SSGEPRWP FIXED(8),    /* SE Repository Capacity               39270001
*                                  Available Warning Percentage @SGC*/  39280001
*       4 SSGEPFWP FIXED(8),    /* Real Ext Threshold Percentage@SGC*/  39290001
*       4 SSGEPFLG BIT(16),     /* Extent Pool Summary Flags    @SGC*/  39300001
*        5 SSGEPFB  BIT(1),     /* Extent Pool Type             @SGC*/  39310001
*                               /* 0=CKD Ext Pool, 1=FB Ext Pool@SGC*/  39320001
*        5 SSGEPRC  BIT(1),     /* TSE Volumes Repository               39330001
*                                  Configured                   @SGC*/  39340001
*        5 SSGEOPV  BIT(1),     /* ESE Volumes Configured       @SGC*/  39350001
*        5 SSGESTD  BIT(1),     /* STD (FP) Volumes Configured  @SGA*/  39360001
*        5 SSGEESV  BIT(1),     /* Extent Sizes Valid                   39370001
*                                  When set to one, SSGEESZ             39380001
*                                  contains the extent sizes            39390001
*                                  in the Extent Pool.         2@15C*/  39400001
*        5 SSGEPWP  BIT(1),     /* Real Capacity at or below            39410001
*                                  Warning Percentage           @SGC*/  39420001
*        5 SSGEPF   BIT(1),     /* No Available Real Capacity           39430001
*                                  (i.e. Full)                  @SGC*/  39440001
*        5 SSGESGC  BIT(1),     /* SGC Backup Volumes Configured@SGA*/  39450001
*        5 *        BIT(8),     /* not used                     @SGC*/  39460001
*       4 SSGEESZ BIT(8),       /* Extent Sizes in Extent Pool 2@15C*/  39470001
*        5 *         BIT(1),    /* Reserved                    2@15C*/  39480001
*        5 SSGES01GB BIT(1),    /* 1 GB Extents                2@15C*/  39490001
*        5 *         BIT(5),    /* Reserved                    2@15C*/  39500001
*        5 SSGES16MB BIT(1),    /* 16 MB Extents               2@15C*/  39510001
*       4 *       CHAR(1),      /* not used                     @SGC*/  39520001
*/*******************************************************************/  39530001
*/* The following fields contain detailed information of the Extent */  39540001
*/* Pool provided by the caller (Ver 1).                        @SGC*/  39550001
*/*******************************************************************/  39560001
*    1 SSGEPDAT CHAR(12316) BASED BDY(WORD),  /*                @05C*/  39570001
*      2 SSGEPIDD CHAR(2),      /* Ext Pool ID for detailed data    */  39580001
*      2 SSGEPDFG BIT(8),       /* Extent Pool Detailed Flags   @L5A*/  39590001
*        3 SSGEPARN BIT(1),     /* SE Repository Capacity is            39600001
*                                  Not Available                @SGC*/  39610001
*        3 SSGEPRAW BIT(1),     /* SE Repository at or below            39620001
*                                  Warning Percentage           @SGC*/  39630001
*        3 SSGEPRF  BIT(1),     /* No Available SE Repository           39640001
*                                  Capacity (i.e. full)         @SGC*/  39650001
*        3 SSGEPESV BIT(1),     /* Extent Sizes Valid                   39660001
*                                  When set to one, SSGEPESZ            39670001
*                                  contains the extent sizes            39680001
*                                  in the Extent Pool.         2@15C*/  39690001
*        3 *        BIT(4),     /* Not Used. Set to zero.       @SGC*/  39700001
*      2 SSGEPESZ BIT(8),       /* Extent Sizes in Extent Pool 2@15C*/  39710001
*        3 *         BIT(1),    /* Reserved                    2@15C*/  39720001
*        3 SSGED01GB BIT(1),    /* 1 GB Extents                2@15C*/  39730001
*        3 *         BIT(5),    /* Reserved                    2@15C*/  39740001
*        3 SSGED16MB BIT(1),    /* 16 MB Extents               2@15C*/  39750001
*/*******************************************************************/  39760001
*/* The following fields are expressed in number of cylinders for   */  39770001
*/* CKD device.   The following fields are expressed in TENTH of    */  39780001
*/* binary Gigabytes for Fix Block device.                          */  39790001
*/*******************************************************************/  39800001
*      2 SSGEPSZ  FIXED(32),    /* Sizes of Extent Pool         @SGC*/  39810001
*      2 SSGEALOC FIXED(32),    /* Space Currently Allocated in         39820001
*                                  Extent Pool                  @SGC*/  39830001
*      2 SSGEPRSZ FIXED(32),    /* Size of TSE Extent Pool              39840001
*                                  Repository                   @SGC*/  39850001
*      2 SSGEPRAL FIXED(32),    /* Space Currently Allocated in         39860001
*                                  TSE Extent Pool Repository   @SGC*/  39870001
*      2 SSGEPGSZ FIXED(32),    /* Amount of Guaranteed Space in        39880001
*                                  Repository                   @SGC*/  39890001
*      2 SSGEPGAL FIXED(32),    /* Allocated Guaranteed Capacity@SGC*/  39900001
*/*******************************************************************/  39910001
*/* The next three fields are 32k bitmaps                           */  39920001
*/*******************************************************************/  39930001
*      2 SSGENORM BIT(32768),   /* Standard (FP) Vols           @SGC*/  39940001
*      2 SSGEPOPV BIT(32768),   /* Extent Space Efficient Vols  @SGC*/  39950001
*      2 SSGEPSEV BIT(32768);   /* Track Space Efficient Vols   @SGC*/  39960001
*                                                                       39970001
*/*******************************************************************/  39980001
*/* The following fields contain detailed information of the Extent */  39990001
*/* Pool provided by the caller (Ver2)     Entire section added @SGA*/  40000001
*/*******************************************************************/  40010001
*DCL 1 SSGEPDV2 CHAR(16512)      /*                                 */  40020001
*       BASED(SSGEPOAR+OFFSET(SSGEPDAT)) BDY(WORD), /*              */  40030001
*      2 SSGEPIDD2 CHAR(2),     /* Ext Pool ID for detailed data    */  40040001
*      2 SSGEPDFG2 BIT(8),      /* Extent Pool Detailed Flags       */  40050001
*        3 SSGEPARN2 BIT(1),    /* SE Repository Capacity is            40060001
*                                  Not Available                    */  40070001
*        3 SSGEPRAW2 BIT(1),    /* SE Repository at or below            40080001
*                                  Warning Percentage               */  40090001
*        3 SSGEPRF2  BIT(1),    /* No Available SE Repository           40100001
*                                  Capacity                         */  40110001
*        3 SSGEPESV2 BIT(1),    /* Extent Sizes Valid                   40120001
*                                  When set to one, SSGEPESZ2           40130001
*                                  contains the extent sizes            40140001
*                                  in the Extent Pool.         2@15C*/  40150001
*        3 *        BIT(4),     /* Not Used. Set to zero.           */  40160001
*      2 SSGEPESZ2 BIT(8),      /* Extent Sizes in Extent Pool 2@15C*/  40170001
*        3 *          BIT(1),   /* Reserved                    2@15C*/  40180001
*        3 SSGED01GB2 BIT(1),   /* 1 GB Extents                2@15C*/  40190001
*        3 *          BIT(5),   /* Reserved                    2@15C*/  40200001
*        3 SSGED16MB2 BIT(1),   /* 16 MB Extents               2@15C*/  40210001
*/*******************************************************************/  40220001
*/* The following fields are expressed in number of cylinders for   */  40230001
*/* CKD device.   The following fields are expressed in TENTH of    */  40240001
*/* binary Gigabytes for Fix Block device.                          */  40250001
*/*******************************************************************/  40260001
*      2 SSGEPSZ2  FIXED(32),   /* Physical Size of Extent Pool     */  40270001
*      2 SSGEALOC2 FIXED(32),   /* Space Currently Allocated in EP  */  40280001
*      2 SSGEPRSZ2 FIXED(32),   /* Size of TSE Extent Pool              40290001
*                                  Repository                       */  40300001
*      2 SSGEPRAL2 FIXED(32),   /* Space Currently Allocated in TSE     40310001
*                                  Extent Pool Repository           */  40320001
*      2 SSGEPGSZ2 FIXED(32),   /* Amount of Guaranteed Space in        40330001
*                                  Repository                       */  40340001
*      2 SSGEPGAL2 FIXED(32),   /* Allocated Guaranteed Capacity    */  40350001
*      2 SSGEPECC2 FIXED(32),   /* ESE Volumes Capacity Configured  */  40360001
*      2 SSGEPTCC2 FIXED(32),   /* TSE Volumes Capacity Configured  */  40370001
*      2 SSGEPFCC2 FIXED(32),   /* STD (FP) Volumes Capacity            40380001
*                                  Configured                       */  40390001
*      2 SSGEPRMC2 FIXED(32),   /* Amount of Real Capacity consumed     40400001
*                                  in provisioning Metadata Virtual     40410001
*                                  Capacity                         */  40420001
*      2 SSGEPECU2 FIXED(32),   /* ESE Volumes Capacity Consumed    */  40430001
*      2 SSGEPSVC2 FIXED(32),   /* Size of Customer Virtual Capacity    40440001
*                                  Configured in Extent Pool        */  40450001
*      2 *         CHAR(4),     /* Not Used                         */  40460001
*      2 SSGEPVCP2 FIXED(32),   /* Customer Virtual Capacity in         40470001
*                                  Preparation Phase                */  40480001
*      2 SSGEPPCP2 FIXED(32),   /* Amount of Physical Capacity in       40490001
*                                  Preparation Phase                */  40500001
*      2 SSGEPCPI2 FIXED(32),   /* Amount of Capacity Performing        40510001
*                                  Initialization                   */  40520001
*      2 SSGEPSCC2 FIXED(32),   /* SGC Backup Volumes Capacity          40530001
*                                  Configured                       */  40540001
*      2 SSGEPSCU2 FIXED(32),   /* SGC Backup Volumes Capacity          40550001
*                                  Consumed                         */  40560001
*      2 *         CHAR(52),    /* Reserved                         */  40570001
*/*******************************************************************/  40580001
*/* The next four fields are 32k bitmaps                            */  40590001
*/*******************************************************************/  40600001
*      2 SSGENORM2 BIT(32768),   /* Standard (FP) Vols              */  40610001
*      2 SSGEPOPV2 BIT(32768),   /* Extent Space Efficient Vols     */  40620001
*      2 SSGEPSEV2 BIT(32768),   /* Track Space Efficient Vols      */  40630001
*      2 SSGEPSGC2 BIT(32768);   /* Safeguarded Copy Backup Vols    */  40640001
*                                                                       40650001
*/*******************************************************************/  40660001
*/* The following fields contain detailed information of the Extent */  40670001
*/* Pool provided by the caller (Ver3)     Entire section added @SGA*/  40680001
*/*******************************************************************/  40690001
*DCL 1 SSGEPDV3 CHAR(16896)      /*                                 */  40700001
*       BASED(SSGEPOAR+OFFSET(SSGEPDAT)) BDY(WORD), /*              */  40710001
*      2 SSGEPIDD3 CHAR(2),     /* Ext Pool ID for detailed data    */  40720001
*      2 SSGEPDFG3 BIT(16),     /* Extent Pool Detailed Flags       */  40730001
*        3 SSGEPFB3 BIT(1),     /* Extent Pool Type                 */  40740001
*                               /* 0=CKD Ext Pool, 1=FB Ext Pool    */  40750001
*        3 SSGEPRC3 BIT(1),     /* TSE Volumes Repository               40760001
*                                  Configured                       */  40770001
*        3 SSGEOPV3 BIT(1),     /* ESE Volumes Configured           */  40780001
*        3 SSGESTD3 BIT(1),     /* STD (FP) Volumes Configured      */  40790001
*        3 SSGEESV3 BIT(1),     /* Extent Sizes Valid                   40800001
*                                  When set to one, SSGEPESZ3           40810001
*                                  contains the extent sizes            40820001
*                                  in the Extent Pool.         2@15C*/  40830001
*        3 SSGRCWP3 BIT(1),     /* Real Capacity at or below            40840001
*                                  Warning Percentage               */  40850001
*        3 SSGRCF3  BIT(1),     /* No Available Real Capacity           40860001
*                                  (i.e. full)                      */  40870001
*        3 SSGEPRAW3 BIT(1),    /* SE Repository at or below            40880001
*                                  Warning Percentage               */  40890001
*        3 SSGEPRF3 BIT(1),     /* No Available SE Repository           40900001
*                                  Capacity (i.e. full)             */  40910001
*        3 SSGESGC3 BIT(1),     /* SGC Backup Volumes Configured    */  40920001
*        3 *        BIT(4),     /* Not Used                         */  40930001
*        3 SSGEPARN3 BIT(1),    /* SE Repository Capacity is Not        40940001
*                                  Available                        */  40950001
*        3 SSGEPRIS3 BIT(1),    /* SE Repository contains               40960001
*                                  Inaccessible Space               */  40970001
*      2 SSGEPETP3 CHAR(1),     /* Extent Type                      */  40980001
*                               /*  Hex   Description               */  40990001
*                               /*  04    FB 1 GB                   */  41000001
*                               /*  84    CKD 1 GB                  */  41010001
*      2 SSGEPESZ3 BIT(8),      /* Extent Sizes in Extent Pool 2@15C*/  41020001
*        3 *          BIT(1),   /* Reserved                    2@15C*/  41030001
*        3 SSGED01GB3 BIT(1),   /* 1 GB Extents                2@15C*/  41040001
*        3 *          BIT(5),   /* Reserved                    2@15C*/  41050001
*        3 SSGED16MB3 BIT(1),   /* 16 MB Extents               2@15C*/  41060001
*      2 *         CHAR(2),     /* Reserved                         */  41070001
*      2 SSGEPNCM3 FIXED(32),   /* Number of Cylinders per Extent       41080001
*                                  or Number of Megabytes per Extent*/  41090001
*      2 *         CHAR(4),     /* Reserved                         */  41100001
*      2 SSGEPRLP3 FIXED(8),    /* Real Extent Limit Percentage     */  41110001
*      2 SSGEPFWP3 FIXED(8),    /* Real Extent Threshold Percentage */  41120001
*      2 SSGEPRES3 CHAR(1),     /* Real Extent Status               */  41130001
*                               /*  Value Description               */  41140001
*                               /*  00    Percentage of Available   */  41150001
*                               /*        Real Extents > 0 and is   */  41160001
*                               /*        > extent threshold        */  41170001
*                               /*  01    Percentage of Available   */  41180001
*                               /*        Real Extents > 0 and is   */  41190001
*                               /*        < extent threshold        */  41200001
*                               /*  10    Percentage of Available   */  41210001
*                               /*        Real Extents is 0         */  41220001
*      2 SSGRCPAL3 FIXED(8),    /* Allocated Real Capacity              41230001
*                                  Percentage                       */  41240001
*      2 SSGRCPAV3 FIXED(8),    /* Available Real Capacity              41250001
*                                  Percentage                       */  41260001
*      2 SSGMNERP3 FIXED(8),    /* Minimum ESE Region Percentage    */  41270001
*      2 SSGMXERP3 FIXED(8),    /* Maximum ESE Region Percentage    */  41280001
*      2 SSGESETP3 FIXED(8),    /* ESE Threshold Percentage         */  41290001
*      2 SSGESESP3 FIXED(8),    /* ESE Status Percentage            */  41300001
*      2 SSGALECP3 FIXED(8),    /* Allocated ESE Real Capacity          41310001
*                                  Percentage                       */  41320001
*      2 SSGAVECP3 FIXED(8),    /* Available ESE Real Capacity          41330001
*                                  Percentage                       */  41340001
*      2 SSGISRCP3 FIXED(8),    /* Percentage of Inaccessible SE        41350001
*                                  Repository Capacity              */  41360001
*      2 *         CHAR(36),    /* Reserved                         */  41370001
*/*******************************************************************/  41380001
*/* The following fields are expressed in number of cylinders for   */  41390001
*/* CKD device.   The following fields are expressed in TENTH of    */  41400001
*/* binary Gigabytes for Fix Block device.                          */  41410001
*/*******************************************************************/  41420001
*      2 SSGREPCP3 CHAR(8),     /* Real Extent Pool Capacity        */  41430001
*      2 SSGPVRCP3 CHAR(8),     /* Preserved Real Capacity          */  41440001
*      2 SSGRTRCP3 CHAR(8),     /* Restricted Real Capacity         */  41450001
*      2 SSGRVRCP3 CHAR(8),     /* Reserved Real Capacity           */  41460001
*      2 SSGABRCP3 CHAR(8),     /* Allocatable Real Capacity        */  41470001
*      2 SSGALRCP3 CHAR(8),     /* Allocated Real Capacity          */  41480001
*      2 SSGFPARC3 CHAR(8),     /* STD (FP) Logical Volumes             41490001
*                                  Allocated Real Capacity          */  41500001
*      2 SSGESARC3 CHAR(8),     /* ESE Logical Volumes Allocated        41510001
*                                  Real Capacity                    */  41520001
*      2 SSGMVARC3 CHAR(8),     /* Allocated Real Capacity used to      41530001
*                                  Provision Metadata Virtual           41540001
*                                  Capacity                         */  41550001
*      2 SSGTSARC3 CHAR(8),     /* Allocated Real Capacity used to      41560001
*                                  Provision TSE Repository         */  41570001
*      2 SSGSDARC3 CHAR(8),     /* Allocated Real Capacity used for     41580001
*                                  Source Dynamic Extent Relocation */  41590001
*      2 SSGTDARC3 CHAR(8),     /* Allocated Real Capacity used for     41600001
*                                  Target Dynamic Extent Relocation */  41610001
*      2 SSGRETRC3 CHAR(8),     /* Easy Tier Real Capacity          */  41620001
*      2 SSGRCPRP3 CHAR(8),     /* Real Capacity in Preparation         41630001
*                                  Phase                            */  41640001
*      2 SSGAVRCP3 CHAR(8),     /* Available Real Capacity          */  41650001
*      2 SSGRCPIN3 CHAR(8),     /* Real Capacity Performing             41660001
*                                  Initialization                   */  41670001
*      2 SSGMVCEP3 CHAR(8),     /* Metadata Virtual Capacity in         41680001
*                                  Extent Pool                      */  41690001
*      2 SSGPVCAP3 CHAR(8),     /* Preserved Capacity               */  41700001
*      2 SSGRTCAP3 CHAR(8),     /* Restricted Capacity              */  41710001
*      2 SSGMVCAP3 CHAR(8),     /* Metadata Virtual Capacity        */  41720001
*      2 SSGABMVC3 CHAR(8),     /* Allocatable Metadata Virtual         41730001
*                                  Capacity                         */  41740001
*      2 SSGCCVVC3 CHAR(8),     /* Configured Customer Volume           41750001
*                                  Virtual Capacity                 */  41760001
*      2 SSGCESVC3 CHAR(8),     /* Configured ESE Volumes Virtual       41770001
*                                  Capacity                         */  41780001
*      2 SSGCTSVC3 CHAR(8),     /* Configured TSE Volumes Virtual       41790001
*                                  Capacity                         */  41800001
*      2 SSGSDERC3 CHAR(8),     /* Source Dynamic Extent Relocation     41810001
*                                  Capacity                         */  41820001
*      2 SSGTDERC3 CHAR(8),     /* Target Dynamic Extent Relocation     41830001
*                                  Capacity                         */  41840001
*      2 *         CHAR(8),     /* Reserved                         */  41850001
*      2 SSGMVCPP3 CHAR(8),     /* Metadata Virtual Capacity in         41860001
*                                  Preparation Phase                */  41870001
*      2 SSGAVMVC3 CHAR(8),     /* Available Metadata Virtual           41880001
*                                  Capacity                         */  41890001
*      2 *         CHAR(32),    /* Reserved                         */  41900001
*      2 SSGTSERC3 CHAR(8),     /* TSE Repository Capacity          */  41910001
*      2 SSGALTSC3 CHAR(8),     /* Allocated TSE Repository             41920001
*                                  Capacity                         */  41930001
*      2 SSGAVTSC3 CHAR(8),     /* Available TSE Repository             41940001
*                                  Capacity                         */  41950001
*      2 SSGIATSC3 CHAR(8),     /* Inaccessible TSE Repository          41960001
*                                  Capacity                         */  41970001
*      2 SSGGTSRC3 CHAR(8),     /* Guaranteed TSE Repository            41980001
*                                  Capacity                         */  41990001
*      2 SSGPTSRC3 CHAR(8),     /* Preserved TSE Repository             42000001
*                                  Capacity                         */  42010001
*      2 *         CHAR(32),    /* Reserved                         */  42020001
*      2 SSGMNERC3 CHAR(8),     /* Minimum ESE Region Real Capacity */  42030001
*      2 SSGMXERC3 CHAR(8),     /* Maximum ESE Region Real Capacity */  42040001
*      2 SSGABERC3 CHAR(8),     /* Allocatable ESE Region Real          42050001
*                                  Capacity                         */  42060001
*      2 SSGAVERC3 CHAR(8),     /* Available ESE Region Real            42070001
*                                  Capacity                         */  42080001
*      2 SSGSGARC3 FIXED(32),   /* SGC Backup Volumes Allocated         42090001
*                                  Real Capacity                    */  42100001
*      2 SSGCSGVC3 FIXED(32),   /* Configured SGC Backup Volumes        42110001
*                                  Virtual Capacity                 */  42120001
*      2 *         CHAR(64),    /* Reserved                         */  42130001
*/*******************************************************************/  42140001
*/* The next four fields are 32k bitmaps                            */  42150001
*/*******************************************************************/  42160001
*      2 SSGENORM3 BIT(32768),   /* Standard (FP) Vols              */  42170001
*      2 SSGEPOPV3 BIT(32768),   /* Extent Space Efficient Vols     */  42180001
*      2 SSGEPSEV3 BIT(32768),   /* Track Space Efficient Vols      */  42190001
*      2 SSGEPSGC3 BIT(32768);   /* Safeguarded Copy Backup Vols    */  42200001
*                                                                       42210001
*/*******************************************************************/  42220001
*/*                                                                 */  42230001
*/*    MAPPING FOR THE DEVICE PERFORMANCE STATISTICS                */  42240001
*/*    OUTPUT BUFFER                                                */  42250001
*/*                                        Entire section added @05A*/  42260001
*/*******************************************************************/  42270001
*DCL 1 SSGDPBUF BASED(SSGOADR) BDY(WORD),                               42280001
*      2 SSGDPVOL CHAR(6),      /* VOLUME SERIAL                    */  42290001
*      2 SSGDPFLG BIT(8),       /*                                  */  42300001
*        3 SSGDP_UA_FLAG BIT(1), /* 'ONE' UNIT ADDR FORMAT          */  42310001
*        3 SSGDP_FND_STG2 BIT(1),/* 2ND STG DIR PATH FND SS01 TO LA01   42320001
*                                IDCSS01 PASSED TO IDCLA01          */  42330001
*        3 SSGDP_SCHST BIT(2),  /* SUBCHANNEL SET NUMBER        @12A*/  42340001
*                               /*  SCHSET NUMBER 0 - 00        @12A*/  42350001
*                               /*  SCHSET NUMBER 1 - 01        @12A*/  42360001
*                               /*  SCHSET NUMBER 2 - 10        @12A*/  42370001
*                               /*  SCHSET NUMBER 3 - 11        @12A*/  42380001
*        3 * BIT(4),            /* RESERVED                     @12C*/  42390001
*      2 SSGDPCUI CHAR(1),      /* Real CUID for data in SSGDPDA    */  42400001
*      2 SSGDPUA1 CHAR(4),      /* FIRST UNIT ADDRESS               */  42410001
*      2 SSGDPUB1 CHAR(2),      /* FIRST UNIT ADDRESS (BINARY)      */  42420001
*      2 SSGDPLN FIXED(15),     /* DATA LENGTH                      */  42430001
*      2 SSGDPDA CHAR(240) BDY(WORD),/* DEV PERF STAT DATA      @07C*/  42440001
*        3 SSGDPFTF BIT(8),     /* Flags                            */  42450001
*          4 SSGDPNAV BIT(1),   /* Bit =1 : Cache Stor unavailable      42460001
*                                  (Set to zero for 2107/1750)      */  42470001
*          4 SSGDPPDR BIT(3),   /* Format of Perf Data Returned         42480001
*                                  '000'b 3990 Format                   42490001
*                                  '001'b 2107/1750 Format          */  42500001
*          4 SSGDPFDR BIT(4),   /* Format of data returned. The same    42510001
*                                  definition and values of bit 4-7     42520001
*                                  of byte 0 from Sense Subsystem       42530001
*                                  status.                          */  42540001
*        3 SSGDPDUA FIXED(8),   /* Device Unit Address of the device    42550001
*                                  to which the statistics pertain  */  42560001
*        3 SSGDPDST CHAR(2),    /* Device Status. The same as Sense     42570001
*                                  Subsystem Status in bytes 26-27  */  42580001
*        3 SSGDPRNI FIXED(32),  /* Search/Read Normal I/O               42590001
*                                  Requests.  The number of             42600001
*                                  command chains which meet            42610001
*                                  the following requirements.          42620001
*                                  - The chain is not part of           42630001
*                                    a sequential operation.            42640001
*                                  - The chain did not include          42650001
*                                    a Define Extent command            42660001
*                                    which specified Cache              42670001
*                                    Fast Write Data.                   42680001
*                                  - The chain contained at             42690001
*                                    least one search or read           42700001
*                                    command but no write               42710001
*                                    commands.                  @H4C*/  42720001
*        3 SSGDPRNH FIXED(32),  /* Search/Read Normal I/O               42730001
*                                  Request Hits.  The number of         42740001
*                                  command chains which meet            42750001
*                                  the following requirements.          42760001
*                                  - The chain is not part of           42770001
*                                    a sequential operation.            42780001
*                                  - The chain did not include          42790001
*                                    a Define Extent command            42800001
*                                    which specified Cache Fast         42810001
*                                    Write Data.                        42820001
*                                  - The chain contained at             42830001
*                                    least one search or read           42840001
*                                    command but no write               42850001
*                                    commands.                          42860001
*                                  - The chain was completed            42870001
*                                    without requiring access           42880001
*                                    to any DDM.                @H4C*/  42890001
*        3 SSGDPWNI FIXED(32),  /* Write Normal I/O Requests.           42900001
*                                  The number of command chains         42910001
*                                  which meet the following             42920001
*                                  requirements.                        42930001
*                                  - The chain is not part of           42940001
*                                    a sequential operation.            42950001
*                                  - The chain did not include          42960001
*                                    a Define Extent command            42970001
*                                    which specified Cache              42980001
*                                    Fast Write Data.                   42990001
*                                  - The chain contained at             43000001
*                                    least one write command.   @H4C*/  43010001
*        3 SSGDPFWH FIXED(32),  /* DASD Fast Write I/O Request          43020001
*                                  Hits.  The number of command         43030001
*                                  chains which meet the                43040001
*                                  following requirements.              43050001
*                                  - The chain is not part of           43060001
*                                    a sequential operation.            43070001
*                                  - The chain did not include          43080001
*                                    a Define Extent command            43090001
*                                    which specified Cache Fast         43100001
*                                    Write Data.                        43110001
*                                  - The chain contained at             43120001
*                                    least one write command.           43130001
*                                  - The chain was completed            43140001
*                                    without requiring access           43150001
*                                    to any DDM.                @H4C*/  43160001
*        3 SSGDPRSI FIXED(32),  /* Search/Read Sequential I/O           43170001
*                                  Requests.  The number of             43180001
*                                  sequential mode command              43190001
*                                  chains which meet the                43200001
*                                  following requirements.              43210001
*                                  - The chain contained at             43220001
*                                  least one search or read             43230001
*                                  command but no write                 43240001
*                                  commands.                    @H4C*/  43250001
*        3 SSGDPRSH FIXED(32),  /* Search/Read Sequential I/O           43260001
*                                  Request Hits.  The number of         43270001
*                                  sequential mode command              43280001
*                                  chains which meet the                43290001
*                                  following requirements.              43300001
*                                  - The chain contained at             43310001
*                                    least one search or read           43320001
*                                    command but no write               43330001
*                                    commands.                          43340001
*                                  - The chain was completed            43350001
*                                    without requiring access           43360001
*                                    to any DDM.                @H4C*/  43370001
*        3 SSGDPWSI FIXED(32),  /* Write Sequential I/O                 43380001
*                                  Requests.  The number of             43390001
*                                  sequential mode command              43400001
*                                  chains which meet the                43410001
*                                  following requirements.              43420001
*                                  - The chain contained at             43430001
*                                    least one write command.   @H4C*/  43440001
*        3 SSGDPWSH FIXED(32),  /* Fast Write Sequential I/O            43450001
*                                  Request Hits.  The number            43460001
*                                  sequential write operations          43470001
*                                  that did not require movement        43480001
*                                  of data to or from a storage         43490001
*                                  device before completion of          43500001
*                                  the I/O operation.           @H4C*/  43510001
*        3 SSGDPRCF FIXED(32),  /* Search/Read Cache Fast Write         43520001
*                                  I/O Requests.  The number of         43530001
*                                  command chains which meet            43540001
*                                  the following requirements.          43550001
*                                  - The chain included a Define        43560001
*                                    Extent command which               43570001
*                                    specified the Cache Fast           43580001
*                                    Write Data attribute.              43590001
*                                  - The chain contained at             43600001
*                                    least one search or read           43610001
*                                    command but no write               43620001
*                                    commands.                          43630001
*                                  - Cache Fast Write Data must         43640001
*                                    be activated for the               43650001
*                                    subsystem.                 @H4C*/  43660001
*        3 SSGDPRCH FIXED(32),  /* Search/Read Cache Fast Write         43670001
*                                  I/O Request Hits.  The number        43680001
*                                  of command chains which meet         43690001
*                                  the following requirements.          43700001
*                                  - The chain included a               43710001
*                                    Define Extent command              43720001
*                                    which specified the Cache          43730001
*                                    Fast Write Data attribute.         43740001
*                                  - The chain contained at             43750001
*                                    least one search or read           43760001
*                                    command but no write               43770001
*                                    commands.                          43780001
*                                  - Cache Fast Write Data must         43790001
*                                    be actuated for the                43800001
*                                    subsystem.                         43810001
*                                  - The chain was completed            43820001
*                                    without requiring access           43830001
*                                    to any DDM.                @H4C*/  43840001
*        3 SSGDPCFW FIXED(32),  /* Cache Fast Write I/O                 43850001
*                                  Requests.  The number of             43860001
*                                  command chains which meet            43870001
*                                  the following requirements.          43880001
*                                  - The chain included a Define        43890001
*                                    Extent command which               43900001
*                                    specified the Cache Fast           43910001
*                                    Write Data attribute.              43920001
*                                  - The chain contained at             43930001
*                                    least one write command.           43940001
*                                  - Cache Fast Write Data must         43950001
*                                    be actuated for the                43960001
*                                    subsystem.                 @H4C*/  43970001
*        3 SSGDPCFH FIXED(32),  /* Cache Fast Write I/O Request         43980001
*                                  Hits.  The number of command         43990001
*                                  chains which meet the                44000001
*                                  following requirements.              44010001
*                                  - The chain included a Define        44020001
*                                    Extent command which               44030001
*                                    specified the Cache Fast           44040001
*                                    Write Data attribute.              44050001
*                                  - The chain contained at             44060001
*                                    least one write command.           44070001
*                                  - Cache Fast Write Data must         44080001
*                                    be actuated for the                44090001
*                                    subsystem.                         44100001
*                                  - The chain was completed            44110001
*                                    without requiring access           44120001
*                                    to any DDM.                @H4C*/  44130001
*        3 SSGDPICL FIXED(32),  /* Inhibit Cache Loading I/O Req        44140001
*                                  that operate with DASD               44150001
*                                  (Set to zeros for 2107/1750)     */  44160001
*        3 SSGDPBCI FIXED(32),  /* Bypass Cache I/O Requests            44170001
*                                  (Set to zeros for 2107/1750)     */  44180001
*        3 SSGDPSDC FIXED(32),  /* Seq DASD to Cache Transfer           44190001
*                                  Operations                       */  44200001
*        3 SSGDPDCC FIXED(32),  /* DASD to Cache Transfer Operation     44210001
*                                  Count                            */  44220001
*        3 SSGDPCDC FIXED(32),  /* Cache to DASD Transfer Operation     44230001
*                                  Count                            */  44240001
*        3 SSGDPFWD FIXED(32),  /* DASD Fast Write Operation Delayed    44250001
*                                  Due to non-volatile storage Space    44260001
*                                  constraints                      */  44270001
*        3 SSGDPNFW FIXED(32),  /* Normal 'DASD Fast Write'             44280001
*                                  Write Operation Counts.              44290001
*                                  The number of command chains         44300001
*                                  which meet the following             44310001
*                                  requirements.                        44320001
*                                  - The chain is not part of           44330001
*                                    a sequential operation.            44340001
*                                  - The chain did not include          44350001
*                                    a Define Extent command            44360001
*                                    which specified Cache Fast         44370001
*                                    Write Data.                        44380001
*                                  - The chain contained at             44390001
*                                    least one write command.           44400001
*                                  - The chain was completed            44410001
*                                    without requiring access           44420001
*                                    to any DDM.                @H4C*/  44430001
*        3 SSGDPSFW FIXED(32),  /* Sequential Access 'DASD Fast         44440001
*                                  Write' Write Operation Counts    */  44450001
*        3 SSGDPNRM FIXED(32),  /* Number of record cache Read          44460001
*                                  misses                           */  44470001
*        3 SSGDPDS2 CHAR(1),    /* Device Status - Group 2          */  44480001
*          /*********************************************************/  44490001
*          /* The device status, SSGDPDS2, is identical to the data */  44500001
*          /* returned by the Sense Subsystem Status in Byte 36.    */  44510001
*          /* Note: The format of the data in SSGDPDS2 is           */  44520001
*          /* determined by the value in SSGDPFDR.                  */  44530001
*          /*********************************************************/  44540001
*        3 SSGDPQWP CHAR(4),    /* Quick Write Promotes             */  44550001
*        3 SSGDPDVD BIT(8),     /*                                  */  44560001
*          /*********************************************************/  44570001
*          /* SSGDPDVD describes the validity of data returned and  */  44580001
*          /* the increment values used for certain counters.       */  44590001
*          /*********************************************************/  44600001
*          4 SSGDPCDT BIT(1),   /* When set on, SSGDPRDT, SSGDPWDT,     44610001
*                                  SSGDPRDC, and SSGDPWDC are           44620001
*                                  valid.                      1@16A*/  44630001
*          4 SSGDPRVA BIT(2),   /* Not Used. Set to zero.      1@16C*/  44640001
*          4 SSGDPSIV BIT(1),   /* When set on, SSGDPSRR, SSGDPSRH,     44650001
*                                  SSGDPSWR, and SSGDPSWH are           44660001
*                                  valid.                       @SIA*/  44670001
*          4 SSGDPZHV BIT(1),   /* When set on, SSGDPZHR and            44680001
*                                  SSGDPZHW are valid.          @H4A*/  44690001
*          4 SSGDPUNI BIT(2),   /* Units                            */  44700001
*            /*******************************************************/  44710001
*            /* SSGDPUNI value and definitions                      */  44720001
*            /* '00'b  Unit of SSGDPRRT,SSGDPWRT,SSGDPBRD,SSGDPBWR, */  44730001
*            /*        SSGDPRAT, and SSGDPWAT is 16 milliseconds.   */  44740001
*            /*        Unit of SSGDPPBR SSGDPPBW is 128 KB.         */  44750001
*            /* '01'b  Reserved                                     */  44760001
*            /* '10'b  Reserved                                     */  44770001
*            /* '11'b  Reserved                                     */  44780001
*            /*******************************************************/  44790001
*          4 SSGDPBYV BIT(1),   /* Set to one indicates SSGDPBRD,       44800001
*                                  SSGDPBWR,SSGDPRAT, and SSGDPWAT      44810001
*                                  are valid.                       */  44820001
*        3 SSGDPSID FIXED(16),  /* SSID                             */  44830001
*        3 SSGDPITA FIXED(32),  /* Irregular Track Accesses         */  44840001
*        3 SSGDPITH FIXED(32),  /* Irregular Track Access Hits      */  44850001
*        3 SSGDPODC FIXED(32),  /* Operation Delayed Due To Cache       44860001
*                                  Space Constraints                */  44870001
*        3 SSGDPMSL FIXED(32),  /* Milliseconds of lower interface      44880001
*                                  I/O activity for the indicated       44890001
*                                  device                               44900001
*                                  (Set to zeros for 2107/1750)     */  44910001
*        3 SSGDPNVI FIXED(8),   /* Non-volume information contained     44920001
*                                  in the record.                       44930001
*                                  Value Definition                     44940001
*                                  0     No Additional Information      44950001
*                                  1     RAID Rank Information          44960001
*                                  2     Extent Pool and Physical       44970001
*                                        Storage Counter information    44980001
*                                  3-FF  Not Defined           2@15C*/  44990001
*        3 SSGDPRVB CHAR(1),    /* Not used                     @H4C*/  45000001
*        3 SSGDPSPI FIXED(16),  /* Extent Pool ID              2@15C*/  45010001
*        3 SSGDPSTY FIXED(8),   /* Extent Pool Type                     45020001
*                                    Hex  Description                   45030001
*                                    04   FB 1 GB                       45040001
*                                    84   CKD 1 GB              @15C*/  45050001
*        3 SSGDPSFL BIT(8),     /* Extent Pool Flags            @15C*/  45060001
*          4 SSGDPSF0 BIT(1),   /* Dynamic Segment Allocation       */  45070001
*          4 SSGDPSF1 BIT(1),   /* Data Sharing                     */  45080001
*          4 SSGDPSF2 BIT(1),   /* Migrating/Migration Error State  */  45090001
*          4 *        BIT(4),   /* Not used                     @15C*/  45100001
*          4 SSGDPSF7 BIT(1),   /* Extent Sizes Valid                   45110001
*                                  When set to one, SSGDPSSZ            45120001
*                                  contains the extent sizes            45130001
*                                  in the Extent Pool.          @15A*/  45140001
*        3 SSGDPSSZ BIT(8),     /* Extent Sizes in Extent Pool  @15A*/  45150001
*          4 *         BIT(1),  /* Reserved                     @15A*/  45160001
*          4 SSGDP01GB BIT(1),  /* 1 GB Extents                 @15A*/  45170001
*          4 *         BIT(5),  /* Reserved                     @15A*/  45180001
*          4 SSGDP16MB BIT(1),  /* 16 MB Extents                @15A*/  45190001
*        3 *        CHAR(1),    /* Not used                     @15A*/  45200001
*        3 SSGDPPRO FIXED(32),  /* Physical Storage Read Operations */  45210001
*        3 SSGDPPWO FIXED(32),  /* Physical Storage Write Operations*/  45220001
*        3 SSGDPPBR FIXED(32),  /* Physical Storage Bytes Read.         45230001
*                                  See Increment Value in SSGDPDVD  */  45240001
*        3 SSGDPPBW FIXED(32),  /* Physical Storage Bytes Written.      45250001
*                                  See Increment Value in SSGDPDVD  */  45260001
*        3 SSGDPRMR FIXED(32),  /* Record Mode Read Operations      */  45270001
*        3 SSGDPNTR FIXED(32),  /* Number of tracks read from the       45280001
*                                  concurrent Copy or XRC Sidefile  */  45290001
*        3 SSGDPNCW FIXED(32),  /* Number of Contaminating              45300001
*                                  writes for a Concurrent Copy         45310001
*                                  or XRC volume as a result of:        45320001
*                                  - Update to a Concurrent Copy        45330001
*                                    protected track.                   45340001
*                                  - Update to an XRC monitored         45350001
*                                    track.                     @H4C*/  45360001
*        3 SSGDPTTS FIXED(32),  /* Number of tracks or portion of       45370001
*                                  tracks that were transferred to      45380001
*                                  the secondary device of a PPRC       45390001
*                                  pair                             */  45400001
*        3 SSGDPNSA FIXED(32),  /* NVS Space Allocations            */  45410001
*        3 SSGDPRRT FIXED(32),  /* Physical Storage Read Response       45420001
*                                  Time. See Increment Value in         45430001
*                                  SSGDPDVD                         */  45440001
*        3 SSGDPWRT FIXED(32),  /* Physical Storage Write Response      45450001
*                                  Time. See Increment Value in         45460001
*                                  SSGDPDVD                         */  45470001
*        3 SSGDPBRD FIXED(32),  /* Bytes Read. See Increment Value      45480001
*                                  in SSGDPDVD                      */  45490001
*        3 SSGDPBWR FIXED(32),  /* Bytes Written. See Increment         45500001
*                                  Value in SSGDPDVD                */  45510001
*        3 SSGDPRAT FIXED(32),  /* Read Accumulated Time.               45520001
*                                  The accumulated response time        45530001
*                                  for all read operations.             45540001
*                                  See Increment Value in SSGDPDVD  */  45550001
*        3 SSGDPWAT FIXED(32),  /* Write Accumulated Time.              45560001
*                                  The accumulated response time        45570001
*                                  for all write operations.            45580001
*                                  See Increment Value in SSGDPDVD  */  45590001
*        3 SSGDPZHR FIXED(32),  /* zHPF Read I/O Requests. This         45600001
*                                  count is the number of Transport     45610001
*                                  Mode read command chains. The        45620001
*                                  Read I/O Request will also be        45630001
*                                  counted in one of the following      45640001
*                                  counters:                            45650001
*                                  - SSGDPRNI, Search/Read Normal       45660001
*                                    I/O Requests                       45670001
*                                  - SSGDPRSI, Search/Read              45680001
*                                    Sequential I/O Requests            45690001
*                                  - SSGDPRCF, Search/Read Cache        45700001
*                                    Fast Write I/O Requests    @H4A*/  45710001
*        3 SSGDPZHW FIXED(32),  /* zHPF Write I/O Requests.  This       45720001
*                                  count is the number of Transport     45730001
*                                  Mode write command chains. The       45740001
*                                  Write I/O Request will also be       45750001
*                                  counted in one of the following      45760001
*                                  counters:                            45770001
*                                  - SSGDPWNI, Write Normal I/O         45780001
*                                    Requests                           45790001
*                                  - SSGDPWSI, Write Sequential I/O     45800001
*                                    Requests                           45810001
*                                  - SSGDPCFW, Cache Fast Write I/O     45820001
*                                    Requests                   @H4A*/  45830001
*        3 SSGDPRRP FIXED(32),  /* zHyperLink Read Pre-fetch I/O        45840001
*                                  Requests. The number of zHyperLink   45850003
*                                  chains which meet the following      45860003
*                                  requirements:                        45870003
*                                  - The zHyperLink Read Operation      45880003
*                                    failed due to Read Data Not        45890003
*                                    Immediately Available (RC 0211)    45900003
*                                    and a Pre-fetch request was made   45910003
*                                    to obtain resources prior to a     45920003
*                                    retry attempt.             @18C*/  45920103
*        3 SSGDPZHL FIXED(32),  /* zHPF List Pre-fetch I/O Requests.    45920201
*                                  This count is the number of          45920301
*                                  command chains which meet the        45920401
*                                  following requirements:              45920501
*                                  - The Transport Mode operation       45920601
*                                    specified a non-zero Imbedded      45920701
*                                    Locate Record Count.       @07A*/  45920801
*        3 SSGDPZHH FIXED(32),  /* zHPF List Pre-fetch I/O Requests     45920901
*                                  Hits. This count is the number of    45930001
*                                  command chains which meet the        45940001
*                                  following requirements:              45950001
*                                  - The Transport Mode operation       45960001
*                                    specified a non-zero Imbedded      45970001
*                                    Locate Record Count.               45980001
*                                  - The chain was completed without    45990001
*                                    requiring access to any DDM@07A*/  46000001
*        3 SSGDPGSF FIXED(32),  /* Global Mirror Collisions Sidefile    46010001
*                                  Count. A GM collision occurs when,   46020001
*                                  during the sending of data to the    46030001
*                                  secondary to create a consistency    46040001
*                                  group, a subsequent host update is   46050001
*                                  attempted before the modified track  46060001
*                                  has been transmitted to the          46070001
*                                  secondary volume. The modified       46080001
*                                  track will be moved to the sidefile  46090001
*                                  before allowing a new host write.    46100001
*                                  The counter will be incremented by   46110001
*                                  one when a track is added to the     46120001
*                                  sidefile.                    @09A*/  46130001
*        3 SSGDPGSS FIXED(32),  /* Global Mirror Collisions Send        46140001
*                                  Synchronous Count. When a write      46150001
*                                  collision occurs, the modified       46160001
*                                  track data which belongs to the      46170001
*                                  current consistency group may be     46180001
*                                  sent to the remote control unit      46190001
*                                  before allowing the write. The       46200001
*                                  data may come from the sidefile if   46210001
*                                  out is full or from cache if the     46220001
*                                  collision sidefile is not being      46230001
*                                  utilized.                    @09A*/  46240001
*        3 SSGDPSRR FIXED(32),  /* Synch I/O Read Requests      @SIA*/  46250001
*        3 SSGDPSRH FIXED(32),  /* Synch I/O Read Request Hits  @SIA*/  46260001
*        3 SSGDPSWR FIXED(32),  /* Synch I/O Write Requests     @SIA*/  46270001
*        3 SSGDPSWH FIXED(32),  /* Synch I/O Write Request Hits @SIA*/  46280001
*        3 SSGDPRDT FIXED(32),  /* Read Channel Disconnect              46290001
*                                  Time                        1@16A*/  46300001
*        3 SSGDPWDT FIXED(32),  /* Write Channel Disconnect             46310001
*                                  Time                        1@16A*/  46320001
*        3 SSGDPRDC FIXED(32),  /* Read Channel Disconnect              46330001
*                                  Count                       1@16A*/  46340001
*        3 SSGDPWDC FIXED(32);  /* Write Channel Disconnect             46350001
*                                  Count                       1@16A*/  46360001
*                                                                       46370001
*/*******************************************************************/  46380001
*/*                                                                 */  46390001
*/*    MAPPING FOR THE SUBSYSTEM GET OUTPUT BUFFER                  */  46400001
*/*    FOR SYNCH I/O LINK STATISTICS                                */  46410001
*/*                                                                 */  46420001
*/*    Output buffer is a queue, anchored by SSGSLOAR, of Synch     */  46430001
*/*    I/O Link statistics.  Each queue element represents data     */  46440001
*/*    read from a single storage subsystem box that describes sets */  46450001
*/*    of statistics.  The queue is a single threaded queue.  Each  */  46460001
*/*    queue element needs to be freed by the caller of this        */  46470001
*/*    interface.  Output buffer built for storage subsystem boxes  */  46480001
*/*    that support Synch I/O Link statistics and are returned      */  46490001
*/*    only if requested by caller (SSGSIOLP) on a request for      */  46500001
*/*    performance data (SSGRPD) for requests with scope of         */  46510001
*/*    subsystem (SSG1SS) or all subsystems (SSGALL).               */  46520001
*/*                                        Entire section added @SIA*/  46530001
*/*******************************************************************/  46540001
*DCL 1 SSGSLBFR BASED(SSGSLOAR) BDY(WORD),                              46550001
*     2 SSGSLHDR CHAR(60) BDY(WORD),/* Queue element header         */  46560001
*      3 SSGSLQDAL FIXED(32),   /* Length of this queue element,        46570001
*                                  header plus data                 */  46580001
*      3 SSGSLQDAO FIXED(32),   /* Offset to the start of the           46590001
*                                  statistics sets                  */  46600001
*      3 SSGSLFWDP PTR(31),     /* Pointer to next queue element,       46610001
*                                  when zero end of queue           */  46620001
*/*      Orientation to subsystem that stats pertain                */  46630001
*      3 SSGSLVOL CHAR(6),      /* Volume serial of device that stats   46640001
*                                  where read from                  */  46650001
*      3 SSGSLDEVN CHAR(2),     /* Device number of device that         46660001
*                                  Stats where read from            */  46670001
*      3 SSGSLFLG     BIT(8),   /*                                  */  46680001
*       4 *           BIT(2),   /* Reserved                         */  46690001
*       4 SSGSL_SCHST BIT(2),   /* Subchannel Set Number            */  46700001
*                               /*  SCHSET NUMBER 0 - 00            */  46710001
*                               /*  SCHSET NUMBER 1 - 01            */  46720001
*                               /*  SCHSET NUMBER 2 - 10            */  46730001
*                               /*  SCHSET NUMBER 3 - 11            */  46740001
*       4 *           BIT(4),   /* Reserved                         */  46750001
*      3 *            CHAR(7),  /* Reserved                         */  46760001
*      3 SSGSILHDR CHAR(32) BDY(WORD),/* Synch I/O Link stats info  */  46770001
*       4 SSGSLNSET FIXED(16),  /* Number of synch I/O link             46780001
*                                  statistic sets returned on the       46790001
*                                  ESS starting from first interface    46800001
*                                  ID SSGSLIID.                     */  46810001
*       4 SSGSLLSET FIXED(16),  /* Size of each set.                */  46820001
*       4 SSGSLCUT CHAR(6),     /* Control unit type                */  46830001
*       4 SSGSLCUM CHAR(3),     /* Control unit model               */  46840001
*       4 SSGSLSEQ CHAR(10),    /* Control unit sequence number     */  46850001
*       4 SSGSLVER CHAR(1),     /* Version of Synch I/O Link stats  */  46860001
*       4 SSGSLBRF CHAR(1),     /* Byte Reporting Factor                46870001
*                                   Value Description                   46880001
*                                   01    Low order bit represents      46890001
*                                         128K bytes.               */  46900001
*       4 SSGSLTRF CHAR(1),     /* Time Reporting Factor                46910001
*                                   Value Description                   46920001
*                                   01    Low order bit represents      46930001
*                                         16 milliseconds.          */  46940001
*       4 *        CHAR(6),     /* Not used                         */  46950001
*     2 SSGSLDADA CHAR(*) BDY(WORD), /* Synch I/O Link stats read   */  46960001
*                                                                       46970001
*/*******************************************************************/  46980001
*/* SSGSLDADA consists of Synch I/O Link statistics sets containing */  46990001
*/* one or more table information entries for each Synch I/O        */  47000001
*/* interface. Each entry is 128 bytes defined in SSGSLSTA based on */  47010001
*/* version number (X'01') in SSGSLVER.                             */  47020001
*/*******************************************************************/  47030001
*                                                                       47040001
*      /* Added mapping of Synch I/O Link statistics                */  47050001
*      3 SSGSLSTA (*) CHAR(128) BDY(WORD), /* Stats entry           */  47060001
*       4 SSGSLTYP  FIXED(8),    /* Synch I/O Link Type                 47070001
*                                    Hex  Description                   47080001
*                                    00   Not Used                      47090001
*                                    01   Optical PCIe              */  47100001
*       4 SSGSLSPD  FIXED(8),    /* Synch I/O Link Speed                47110001
*                                    Hex  Description                   47120001
*                                    00   Not Used                      47130001
*                                    01   PCIe Gen 1                    47140001
*                                    02   PCIe Gen 2                    47150001
*                                    03   PCIe Gen 3                    47160001
*                                    04   PCIe Gen 4                */  47170001
*       4 SSGSLWDH  FIXED(8),    /* Synch I/O Link Width                47180001
*                                   This value is the number of         47190001
*                                   PCIe lanes (1, 2, 4, 8 or 16).  */  47200001
*       4 SSGSLSTE  FIXED(8),    /* Synch I/O Link State                47210001
*                                    Value Definition                   47220001
*                                    00    Not Used                     47230001
*                                    01    Link Not Trained             47240001
*                                    02    Link Handshake Incomplete    47250001
*                                    03    Link Handshake Complete      47260001
*                                          and Link Operational         47270001
*                                    04    Link in Service Mode         47280001
*                                          (i.e. Link Quiesced)      */ 47290001
*       4 SSGSLIID FIXED(16),   /* Interface id                         47300001
*                                   Bits  Definition                    47310001
*                                   0     Port type (set to zero)       47320001
*                                   1-2   Reserved                      47330001
*                                   3-7   Enclosure                     47340001
*                                   8-11  Adapter. Set to '1000'b.      47350001
*                                   12-15 Port. Set to '0000'b for      47360001
*                                         Link 0 and to '0001'b for     47370001
*                                         Link 1.                   */  47380001
*       4 *        CHAR(2),     /* Not Used. Set to zero.           */  47390001
*       4 SSGSLCBR FIXED(32),   /* Cache Bytes Read                     47400001
*                                  SSGSLBRF specifies reporting         47410001
*                                  factor.                          */  47420001
*       4 SSGSLCRO FIXED(32),   /* Total Cache Read Operations      */  47430001
*       4 SSGSLCRS FIXED(32),   /* Successful Cache Read Operations */  47440001
*       4 SSGSLCRT FIXED(32),   /* Cache Read Accumulated Time          47450001
*                                  SSGSLTRF specifies reporting         47460001
*                                  factor.                          */  47470001
*       4 SSGSLCBW FIXED(32),   /* Cache Bytes Written                  47480001
*                                  SSGSLBRF specifies reporting         47490001
*                                  factor.                          */  47500001
*       4 SSGSLCWO FIXED(32),   /* Total Cache Write Operations     */  47510001
*       4 SSGSLCWS FIXED(32),   /* Successful Cache Write Operations*/  47520001
*       4 SSGSLCWT FIXED(32),   /* Cache Write Accumulated Time         47530001
*                                  SSGSLTRF specifies reporting         47540001
*                                  factor.                          */  47550001
*       4 SSGSLNBW FIXED(32),   /* NVS Bytes Written                    47560001
*                                  SSGSLBRF specifies reporting         47570001
*                                  factor.                          */  47580001
*       4 SSGSLNWO FIXED(32),   /* Total NVS Write Operations       */  47590001
*       4 SSGSLNWS FIXED(32),   /* Successful NVS Write Ops    1@SGC*/  47600001
*       4 SSGSLNWT FIXED(32),   /* NVS Write Accumulated Time           47610001
*                                  SSGSLTRF specifies reporting         47620001
*                                  factor.                          */  47630001
*       4 SSGSLDDR FIXED(32),   /* I/O Mail Dispatch Delay, I/O         47640001
*                                  Rejected.                   1@SGA*/  47650001
*       4 SSGSLDDD FIXED(32),   /* I/O Mail Dispatch Delay, I/O         47660001
*                                  Dropped.                    1@SGA*/  47670001
*       4 SSGSLSDR FIXED(32),   /* I/O Mail Scan Delay, I/O             47680001
*                                  Rejected.                   1@SGA*/  47690001
*       4 SSGSLSDD FIXED(32),   /* I/O Mail Scan Delay, I/O             47700001
*                                  Dropped.                    1@SGA*/  47710001
*       4 SSGSLCRSAT FIXED(32), /* Cache Read Success                   47720001
*                                  Accumulated Time             @18C*/  47730003
*       4 SSGSLCWSAT FIXED(32), /* Cache Write Success                  47740003
*                                  Accumulated Time             @18C*/  47750003
*       4 SSGSLNWSAT FIXED(32), /* NVS Write Success                    47760003
*                                  Accumulated Time             @18C*/  47770003
*       4 *        CHAR(44);    /* Not Used. Set to zero.       @18C*/  47770103
*                               /*                                  */  47770201
*                                                                       47770301
*/*******************************************************************/  47770401
*/*                                                                 */  47770501
*/*    MAPPING FOR THE SUBSYSTEM GET OUTPUT BUFFER                  */  47770601
*/*    FOR SYNCH I/O LINK DIAGNOSTIC PARAMETERS                     */  47780001
*/*                                                                 */  47790001
*/*    Output buffer is a queue, anchored by SSGSDOAR, of Synch     */  47800001
*/*    I/O Link Diagnostic Parameters.  Each queue element          */  47810001
*/*    represents data read from a single storage subsystem box     */  47820001
*/*    that describes sets of statistics.  The queue is a single    */  47830001
*/*    threaded queue.  Each queue element needs to be freed by the */  47840001
*/*    caller of this interface.  Output buffer built for storage   */  47850001
*/*    subsystem boxes that support Synch I/O Link Diagnostic       */  47860001
*/*    Parameters and are returned only if requested by caller      */  47870001
*/*    (SSGSILDP) on a request for performance data (SSGRPD) for    */  47880001
*/*    requests with scope of subsystem (SSG1SS) or all subsystems  */  47890001
*/*    (SSGALL).                                                    */  47900001
*/*                                       Entire section added 1@SIA*/  47910001
*/*******************************************************************/  47920001
*DCL 1 SSGSDBFR BASED(SSGSDOAR) BDY(WORD),                              47930001
*     2 SSGSDHDR CHAR(60) BDY(WORD),/* Queue element header         */  47940001
*      3 SSGSDQDAL FIXED(32),   /* Length of this queue element,        47950001
*                                  header plus data                 */  47960001
*      3 SSGSDQDAO FIXED(32),   /* Offset to the start of the           47970001
*                                  statistics sets                  */  47980001
*      3 SSGSDFWDP PTR(31),     /* Pointer to next queue element,       47990001
*                                  when zero end of queue           */  48000001
*/*      Orientation to subsystem that stats pertain                */  48010001
*      3 SSGSDVOL CHAR(6),      /* Volume serial of device that stats   48020001
*                                  where read from                  */  48030001
*      3 SSGSDDEVN CHAR(2),     /* Device number of device that         48040001
*                                  Stats where read from            */  48050001
*      3 SSGSDFLG     BIT(8),   /*                                  */  48060001
*       4 *           BIT(2),   /* Reserved                         */  48070001
*       4 SSGSD_SCHST BIT(2),   /* Subchannel Set Number            */  48080001
*                               /*  SCHSET NUMBER 0 - 00            */  48090001
*                               /*  SCHSET NUMBER 1 - 01            */  48100001
*                               /*  SCHSET NUMBER 2 - 10            */  48110001
*                               /*  SCHSET NUMBER 3 - 11            */  48120001
*       4 *           BIT(4),   /* Reserved                         */  48130001
*      3 *            CHAR(7),  /* Reserved                         */  48140001
*      3 SSGSIDHDR CHAR(32) BDY(WORD),/* Synch I/O Lnk Diag Prm info*/  48150001
*       4 SSGSDNSET FIXED(16),  /* Number of Synch I/O Link Diag        48160001
*                                  Parameters sets returned on the      48170001
*                                  ESS starting from first interface    48180001
*                                  ID SSGSDIID.                     */  48190001
*       4 SSGSDLSET FIXED(16),  /* Size of each set.                */  48200001
*       4 SSGSDCUT CHAR(6),     /* Control unit type                */  48210001
*       4 SSGSDCUM CHAR(3),     /* Control unit model               */  48220001
*       4 SSGSDSEQ CHAR(10),    /* Control unit sequence number     */  48230001
*       4 SSGSDVER CHAR(1),     /* Version of Synch I/O Lnk Diag Prm*/  48240001
*       4 *        CHAR(8),     /* Not used                         */  48250001
*     2 SSGSDDADA CHAR(*) BDY(WORD), /* Synch I/O Lnk Diag Prms read*/  48260001
*                                                                       48270001
*/*******************************************************************/  48280001
*/* SSGSDDADA consists of Synch I/O Link Diagnostic Parameters sets */  48290001
*/* containing one or more table information entries for each Synch */  48300001
*/* I/O interface. Each entry is 192 bytes defined in SSGSDSTA      */  48310001
*/* based on version number (X'01') in SSGSDVER.                    */  48320001
*/*******************************************************************/  48330001
*                                                                       48340001
*      /* Added mapping of Synch I/O Link Diagnostic Parameters     */  48350001
*      3 SSGSDSTA (*) CHAR(192) BDY(WORD), /* Stats entry           */  48360001
*       4 SSGSDTYP  FIXED(8),    /* Synch I/O Link Type                 48370001
*                                    Hex Description                    48380001
*                                    00  Not Used                       48390001
*                                    01  Optical PCIe               */  48400001
*       4 SSGSDSPD  FIXED(8),    /* Synch I/O Link Speed                48410001
*                                    Hex Description                    48420001
*                                    00  Not Used                       48430001
*                                    01  PCIe Gen 1                     48440001
*                                    02  PCIe Gen 2                     48450001
*                                    03  PCIe Gen 3                     48460001
*                                    04  PCIe Gen 4                 */  48470001
*       4 SSGSDWDH  FIXED(8),    /* Synch I/O Link Width                48480001
*                                   This value is the number of         48490001
*                                   PCIe lanes (1, 2, 4, 8 or 16).  */  48500001
*       4 SSGSDSTE  FIXED(8),    /* Synch I/O Link State                48510001
*                                    Value Definition                   48520001
*                                    00    Not Used                     48530001
*                                    01    Link Not Trained             48540001
*                                    02    Link Handshake Incomplete    48550001
*                                    03    Link Handshake Complete      48560001
*                                          and Link Operational         48570001
*                                    04    Link in Service Mode         48580001
*                                          (i.e. Link Quiesced)     */  48590001
*       4 SSGSDIID FIXED(16),   /* Interface id                         48600001
*                                  Bits  Definition                     48610001
*                                  0     Port type (set to zero)        48620001
*                                  1-2   Reserved                       48630001
*                                  3-7   Enclosure                      48640001
*                                  8-11  Adapter. Set to '1000'b.       48650001
*                                  12-15 Port. Set to '0000'b for       48660001
*                                        Link 0 and to '0001'b for      48670001
*                                        Link 1.                    */  48680001
*       4 *        CHAR(2),     /* Not Used. Set to zero.           */  48690001
*       4 SSGSDPRE FIXED(32),   /* Port Receiver Error Count        */  48700001
*       4 SSGSDDLLP FIXED(32),  /* Port Bad Data Link Layer Packet      48710001
*                                  (DLLP) Count                     */  48720001
*       4 SSGSDTLP FIXED(32),   /* Port Bad Transaction Layer           48730001
*                                  Packet (TLP) Count               */  48740001
*/*******************************************************************/  48750001
*/* The format of the next four bytes is repeated the number of     */  48760001
*/* lanes reported in SSGSDWDH (Synch I/O Link Width) minus 1. The  */  48770001
*/* unused bytes are set to zero.                                   */  48780001
*/*******************************************************************/  48790001
*       4 SSGSDPLL(16),         /* Power Levels for Lane 1, 2, 4,       48800001
*                                  8, or 16.                        */  48810001
*        5 SSGSDTXP FIXED(16),  /* Tx Power: Lane 1, 2, 4, 8, or 16     48820001
*                                  This value contains the measured     48830001
*                                  coupled TX output power in units     48840001
*                                  of 0.1 uW (range 0-6.5mW).       */  48850001
*        5 SSGSDRXP FIXED(16),  /* Rx Power: Lane 1, 2, 4, 8, or 16     48860001
*                                  This value contains the measured     48870001
*                                  coupled Rx output power in units     48880001
*                                  of 0.1 uW (range 0-6.5mW).       */  48890001
*       4 SSGSDCSE CHAR(64),    /* Chip Specific Error Counts           48900001
*                                  These 64 bytes are used by           48910001
*                                  engineering only. The counts are     48920001
*                                  specific to the chip.            */  48930001
*       4 *        CHAR(44);    /* Not Used. Set to zero.           */  48940001
*                               /*                                  */  48950001
*/*******************************************************************/  48960001
*/*                                                                 */  48970001
*/*    RETURN CODES FROM IDCSS01                                    */  48980001
*/*                                                                 */  48990001
*/*******************************************************************/  49000001
*DCL SS01CC00 FIXED(15) CONSTANT(0);  /* SUCCESSFUL COMPLETION      */  49010001
*DCL SS01CC04 FIXED(15) CONSTANT(4);  /* GETMAIN FAILED             */  49020001
*DCL SS01CC08 FIXED(15) CONSTANT(8);  /* I/O ERROR OCCURRED         */  49030001
*DCL SS01CC12 FIXED(15) CONSTANT(12); /* VOLUME NOT FOUND           */  49040001
*DCL SS01CC16 FIXED(15) CONSTANT(16); /* ESTAE FAILED               */  49050001
*DCL SS01CC20 FIXED(15) CONSTANT(20); /* LRA INSTRUCTION FAILED     */  49060001
*DCL SS01CC24 FIXED(15) CONSTANT(24); /* BUFFER NOT LARGE ENOUGH    */  49070001
*DCL SS01CC28 FIXED(15) CONSTANT(28); /* FILE NOT IN TIOT      @H19A*/  49080001
*DCL SS01CC32 FIXED(15) CONSTANT(32); /* VOLUME NOT FOUND ALL  @H19A*/  49090001
*DCL SS01CC36 FIXED(15) CONSTANT(36); /* NO PATH(S) TO SD(S)    @H7A*/  49100001
*DCL SS01CC40 FIXED(15) CONSTANT(40); /* NO ONLINE PATH FROM IOS@H7A*/  49110001
*DCL SS01CC44 FIXED(15) CONSTANT(44); /* REQUEST NOT SUPPORTED @H18A*/  49120001
*DCL SS01CC48 FIXED(15) CONSTANT(48); /* WARNING MSG ISSUED    @H19A*/  49130001
*DCL SS01CC52 FIXED(15) CONSTANT(52); /* ERROR MSG ISSUED      @H19A*/  49140001
*DCL SS01CC56 FIXED(15) CONSTANT(56); /* SERIOUS ERROR MSG     @H19A*/  49150001
*DCL SS01CC60 FIXED(15) CONSTANT(60); /* I/O timeout occured    @01C*/  49160001
*DCL SS01CC64 FIXED(15) CONSTANT(64); /* Reserved               @H2C*/  49170001
*DCL SS01CC68 FIXED(15) CONSTANT(68); /* RESERVED           @K130173*/  49180001
*DCL SS01CC70 FIXED(15) CONSTANT(70); /* IOSCDR Error           @L6A*/  49190001
*DCL SS01CC71 FIXED(15) CONSTANT(71); /* UCBINFO Error          @L6A*/  49200001
*DCL SS01CC72 FIXED(15) CONSTANT(72); /* Reserved               @L6A*/  49210001
*DCL SS01CC73 FIXED(15) CONSTANT(73); /* Missing CDR infor      @L6A*/  49220001
*DCL SS01CC74 FIXED(15) CONSTANT(74); /* Err during CDR infor   @L6A*/  49230001
*                                     /* Gathering.             @L6A*/  49240001
*DCL SS01CC99 FIXED(15) CONSTANT(99); /* RESERVED               @H2A*/  49250001
*                                                                       49260001
*/*******************************************************************/  49270001
*/*                                                                 */  49280001
*/*    REASON CODES FROM ESS (BOX) PERFORMANCE STATISTICS           */  49290001
*/*     (SSGLPRET, SSGRSRET, SSGSGRET, SSGSLRET, SSGSDRET).         */  49300001
*/*                                                            1@SIC*/  49310001
*/*******************************************************************/  49320001
*DECLARE                                                                49330001
*       (SS01LP01  CONSTANT(1),     /* Stats requested, all stats       49340001
*                                      returned on supporting           49350001
*                                      subsystem boxes               */ 49360001
*        SS01LP02  CONSTANT(2),     /* Stats not requested              49370001
*                                      by the caller                 */ 49380001
*        SS01LP03  CONSTANT(3),     /* Stats requested, but no          49390001
*                                      supporting subsystem boxes       49400001
*                                      found to support them         */ 49410001
*        SS01LP04  CONSTANT(4)      /* Stats requested, but stats       49420001
*                                      from one or more supporting      49430001
*                                      subsystem boxes could not        49440001
*                                      be read                      */  49450001
*       ) FIXED(8);                                                     49460001
*/* End of PL/X Source                                              */  49470001
* %IF IDCDF70_LIST ^= 'NO' &                                            49480001
*    ZCBPRINT ^= 'NO' %THEN                                             49490001
*   %GOTO IDCDF70_4;                                                    49500001
*   @LIST POP NOECHO;                                                   49510001
* %IDCDF70_4:;                                                          49520001
* %END;                                                                 49530001
