*                                                                               
* %DCL IDCDOUT_INCLUDED CHAR EXT;                                               
* %DEACTIVATE IDCDOUT_INCLUDED;                                                 
* %IF IDCDOUT_INCLUDED = '' %THEN                                               
* %DO;                                                                          
*%/* Start of PL/X PreProlog Code */;                                           
* %                                                                             
* IF DCU_HDR = 'YES'             /* INCLUDE HEADER DECLARE ONLY?     */         
*  ! IDCDOUT_CBGEN = 'YES' %THEN /* INCLUDE EVERYTHING?              */         
*    %DO;                                                                       
*%/* End of PL/X PreProlog Code */;                                             
*/* Macro made bi-lingual on 96309. CBGEN compile date 95348         */         
*% /*                                                                           
         MACRO                                                                  
         IDCDOUT &DSECT=YES,&LIST=YES,&DCUOUTH=YES,&TYPE=ALL,&RDW=NO            
         GBLC  &IDCDOUT_INCLUDED                                                
         GBLC  &ZCBPRINT                                                        
&IDCDOUT_INCLUDED SETC 'YES'                                                    
 TITLE   'IDCDOUT  - AMS DCOLLECT FUNCTION OUTPUT RECORD FORMATS    '           
**/ IDCDOUT_1:;                                                                 
*/*START OF SPECIFICATIONS********************************************/         
*/*                                                                  */         
*/* $MAC(IDCDOUT):                                                   */         
*/*                                                                  */         
*/* MACRO-NAME: IDCDOUT                                              */         
*/*                                                                  */         
*/* DESCRIPTIVE-NAME: AMS DCOLLECT FUNCTION OUTPUT RECORD FORMATS    */         
*/*                                                                  */         
*/*PROPRIETARY V3 STATEMENT                                          */         
*/*LICENSED MATERIALS - PROPERTY OF IBM                              */         
*/*"RESTRICTED MATERIALS OF IBM"                                     */         
*/*5650-ZOS                                                      @PJC*/         
*/*COPYRIGHT IBM CORP. 1993,2017                                 @LYC*/         
*/*END PROPRIETARY V3 STATEMENT                                      */         
*/*                                                                  */         
*/* STATUS = SEE CHANGE ACTIVITY                                     */         
*/*                                                                  */         
*/* FUNCTION -                                                       */         
*/* THIS MACRO IS INCLUDED (%INCLUDE SYSLIB(IDCDOUT)) BY ANY         */         
*/* MODULES THAT NEED TO MAP THE OUTPUT DATA RECORDS FROM THE        */         
*/* DCOLLECT FUNCTION.                                           @L8C*/         
*/*                                                              @L8A*/         
*/* A MAPING EXISTS FOR                                          @L8M*/         
*/*     HEADER OF ALL RECORDS              DCUOUTH                   */         
*/*     ACTIVE DATA RECORD                 DCDADSI                   */         
*/*     VSAM BASE CLUSTER ASSOCIATION      DCASSOC                   */         
*/*     VOLUME INFORMATION                 DCVVOLI                   */         
*/*     DATA CLASS DEFINITION              DDCDATA           @OY59794*/         
*/*     STORAGE CLASS DEFINITION           DSCDATA           @OY59794*/         
*/*     MANAGEMENT CLASS DEFINITION        DMCDATA           @OY59794*/         
*/*     BASE CONFIGURATION DEFINITION      DBCDATA           @OY59794*/         
*/*     STORAGE GROUP DEFINITION           DSGDATA           @OY59794*/         
*/*     SMS VOLUME DEFINITION              DVLDATA           @OY59794*/         
*/*     AGGREGATE GROUP DEFINITION         DAGDATA           @OY59794*/         
*/*     OPTICAL DRIVE DEFINITION           DDRDATA           @OY59794*/         
*/*     OPTICAL LIBRARY DEFINITION         DLBDATA           @OY59794*/         
*/*     Cache Names Definition             DCCNAME               @LHA*/         
*/*                                                                  */         
*/* PLX MACRO LANGUAGE:                                          @L8A*/         
*/*                                                              @L8A*/         
*/* TO INCLUDE THE HEADER ONLY, THE MACRO VARIABLE DCU_HDR MUST BE   */         
*/* INITIALIZED TO 'YES'. THE ENTIRE MACRO IS INCLUDED AS THE        */         
*/* DEFAULT.                                                         */         
*/*                                                                  */         
*/* TO INCLUDE THE SMS CONSTRUCT INFORMATION ONLY, DCU_SMS MUST BE   */         
*/* INITIALIZED TO 'YES'. THE ENTIRE MACRO IS INCLUDED AS THE        */         
*/* DEFAULT.                                                         */         
*/*                                                                  */         
*/* TO BASE THE HEADER ON A SPECIFIC POINTER, THE BASING MACRO       */         
*/* VARIABLE, DCU_BASE, MUST BE INITIALIZED TO 'BASED(PTR_NAME)'. IF */         
*/* DCU_BASE IS NOT USED, THE VALUE DEFAULTS TO 'BASED BDY(WORD)'.   */         
*/* IT CAN ALSO BE INITIALIZED TO 'BDY(WORD)' IF THE RECORD IS TO BE */         
*/* DECLARED IN AUTOMATIC STORAGE.                                   */         
*/*                                                                  */         
*/*           **************************************                 */         
*/*           * FOR EXAMPLE, TO INCLUDE THE HEADER *                 */         
*/*           * ONLY, AND BASE THE DECLARATION ON  *                 */         
*/*           * A POINTER VARIABLE CALLED DCURPTR: *                 */         
*/*           *     %DCL DCU_HDR CHAR              *                 */         
*/*           *     %DCU_HDR = 'YES'               *                 */         
*/*           *     %DCL DCU_BASE CHAR             *                 */         
*/*           *     %DCU_BASE = 'BASED(DCURPTR)'   *                 */         
*/*           *     %INCLUDE SYSLIB(IDCDOUT)       *                 */         
*/*           **************************************                 */         
*/*                                                                  */         
*/* ASM PARAMETERS:                                              @L8A*/         
*/*                                                              @L8A*/         
*/* TO INCLUDE A SINGLE RECORD TYPE FOLLOWING THE HEADER, THE    @L8A*/         
*/* MACRO PARAMETER TYPE MAY BE SET TO ONE OF THE FOLLOWING      @L8A*/         
*/* VALUES.  THE ENTIRE MACRO IS INCLUDED AS THE DEFAULT.        @L8A*/         
*/*                                                              @L8A*/         
*/*           ALL,D,A,V,DC,SC,MC,BC,SG,VL,AG,DR,LB,CN,AI,NONE    @L8A*/         
*/*                                                              @L8A*/         
*/* NOTES =                                                          */         
*/*                                                                  */         
*/*  PROCESSOR = PL/AS                                               */         
*/*  MODULE-SIZE = N/A                                               */         
*/*  ATTRIBUTES = N/A - COMPILE TIME MACRO.                          */         
*/*                                                                  */         
*/*                                                                  */         
*/* CHANGE-ACTIVITY =                                                */         
*/* $LA=COLL,HDP3320,OY26061,STLDPD: DCOLLECT FSR - IMPLICIT FLG @LAA*/         
*/* DASDCALC RETURNED VALUES NOT BEING COPIED TO OUTPUT      @OY32626*/         
*/* NEW SUPPORT FOR VRRDS DATA SETS                          @KC11064*/         
*/* SHIP MACRO FOR HDP3330                                   @OY48365*/         
*/* $LB=COLL,JDZ1110,,SJPLDPD: DFSMS 1.1.0 ENHANCEMENTS          @LBA*/         
*/* $LC=COLL,JDZ1110,,SJPLDPD: ENHANCEMENT FOR VSAM STATS        @LCA*/         
*/* $LX=SMS,HDP3330,,SJPLDPD: SMS CONTROL INFO IN DCOLLECT   @OY59794*/         
*/* $O1=SMS,JDZ1110,,SJPLDPD: SMS CONTROL INFO FOR JDZ1110   @OY60048*/         
*/* MEND STATEMENT MISSING                                   @OY64089*/         
*/* $LD=COLL,HDZ11B0,,SJPLAKC: DFSMS 1.2.0 ENHANCEMENTS          @LDA*/         
*/* $DC=COLL,HDZ11B0,,SJPLAKC: EXTENDED FLAGS               @XS_AM101*/         
*/* $L2=COLL,HDZ11B0,,SJPLAKC: DFSMS 1.2.0 PARTIAL RELEASE  @OW01826A*/         
*/* $L3=COLL,HDZ11B0,,SJPLAKC: DFSMS 1.2.0 SYSTEM GROUP     @OW02196A*/         
*/* $LM=SMS32,HDZ11C0,,SJPLMWM: SMS 32-Name support              @LMA*/         
*/* $LI=COLL,HDZ11C0,,SJPLAKC: Extended Addressability Support   @LEA*/         
*/* $LG=COLL,HDZ11C0,,SJPLAKC: Migrated Info Cell Support        @LGA*/         
*/* $LH=CSAT,HDZ11C0,,SJPLPVG: Cust Sat Misc Changes line item   @LHA*/         
*/* code dropped from daidata replaced. use LHA fiche        @K131635*/         
*/* Add DBCSNMTY in Base Configuration.                      @K131753*/         
*/* change typo  DCDCAMT to DDCCAMT                          @K131799*/         
*/* change typo  DBCDATAE to DDCDATAE                        @K131951*/         
*/* ADD DCAHARBC AND DCAHARBC                                @OW14204*/         
*/* Add DSGFPSM to DSGFLGS, move ...32NAM flds,DBCSYSFT cnst @OW20434*/         
*/* $LJ=VSAM,HDZ11D0,SJPLPVG: VSAM(DCOLLECT) line item           @LJA*/         
*/* change typo in comment DCDRABS to DDCRABS                @K140275*/         
*/* Add COMMENTS TO VARIOUS CONSTANTS TO REFLECT 32NAME      @OW24697*/         
*/* Provide DS1CPOIT information in DCOLLECT D-record        @K170027*/         
*/* $L4=SMSR13,HDZ11G0,000410,SJPLAKC: SMS DataSet Separation    @L4A*/         
*/* $01=OW48529,HDZ11E0,010308,SJPLMET: Add DSCAVLPR for         @01A*/         
*/*             PREFERRED storage class specification            @01A*/         
*/* $02=K170619,HDZ11G0,010813,SJPLMET: Move data set sep info   @02A*/         
*/*             at end of record                                 @02A*/         
*/* $L5=SMS   ,HDZ11H0,020326,SJPLMET: Add multi-tier SG support @L5A*/         
*/* $LH=BLYTHE3,HDZ11G0,020321,SJPLPPD: ADD 384 TRK INFO OW53991 @LHA*/         
*/* $LH=VENTANA,HDZ11F0,030303,SJPLPPD: ADD VENTANA INFO OA02236 @LHB*/         
*/* $LH=GT64K,HDZ11H0,031130,SJPLPPD:  ADD GT 64K TRK FLAG       @LHD*/         
*/* $LH=VENTANA,HDZ11H0,030908,SJPLPPD: ADD EFMT1 INFO   OA02236 @LHB*/         
*/* $03=OA06422,HDZ11H0,040202,SJPLPPD: NULL CHANGE APAR OA06422 @03C*/         
*/* $04=OA07106,HDZ11J0,040422,SJPLPPD: ADD VENTANA2 SUPPORT     @04A*/         
*/*        ADD MEDIA6, MEDIA7, & MEDIA8 MEDIATYPES PER SUPPORT.  @04A*/         
*/* $05=OA11452,HDZ11G0,050502,SJPLPPD: ADD DDCDVC FIELD TO      @05A*/         
*/*             CORRESPOND WITH DCDMVC FIELD IN DATACLASS IN     @05A*/         
*/*             SMS.                                             @05A*/         
*/* $06=OA13104,HDZ11K0,050907,SJPLPPD: ADD EFMT2 INFO AND       @06A*/         
*/*             MEDIA9 & MEDIA10 INFO PER VENTANA3 SUPPORT.      @06A*/         
*/* $L6=EAVSUPPT,HDZ1A10,061015,SJPLPPD: ADD IN NEW FIELDS FOR   @L6A*/         
*/*             DRIVER2 FOR TYPE 'V', TYPE 'VL', AND TYPE 'SG'   @L6A*/         
*/*             RECORDS                                          @L6A*/         
*/* $L7=K1A0279,HDZ1A10,061218,SJPLPPD: CHANGE DCVTRRSP TO       @L7C*/         
*/*             DCVTRFSP PER SPECIFIATIONS.                      @L7C*/         
*/* $L1=AMSMPO,HDZ1A10,070330,SJPLELA:  SMPO support, DATACLAS   @L1A*/         
*/*     overrides the specified space parameters in command      @L1A*/         
*/*     DEFINE CLUSTER when space override flag in DCD is ON.    @L1A*/         
*/* $L8=RMMSMPO,HDZ1A10,070101,SJPLSCA: New TYPE= keyword        @L8A*/         
*/* $07=OA17566,HDZ1180,060803,SJPLPPD: ADD EEFMT2 INFO PER      @07A*/         
*/*             NEW TAPE ENCRYPTION SUPPORT.                     @07A*/         
*/* $P1=K1A0993,HDZ1A10,070717,SJPLELA: Fix spelling errors      @P1A*/         
*/* $P2=K1A1228,HDZ1A10,070813,SJPLELA: Mismatching field in     @P2A*/         
*/*     assember part                                            @P2A*/         
*/* $P3=K1A1165,HDZ1A10,070817,SJPLPPD: FIXED(31) field should   @P3C*/         
*/*     should be FIXED(32) instead.                             @P3C*/         
*/* $08=OA22593,HDZ11K0,070919,SJPLELA: Fix multi-tiered fields  @08A*/         
*/*     Add support of DSSEP, STK, PAV, OSL                      @08A*/         
*/* $P4=K1A1463,HDZ1A10,071001,SJPLPPD: Add in flags for L6A     @P4A*/         
*/*     fields.                                                  @P4A*/         
*/* $P5=K1A1642,HDZ1A10,071016,SJPLPPD: Add in changes to make   @P5A*/         
*/*     sure displacements match up between ASM and PLX.         @P5A*/         
*/*     plus change or remove misspelled field names.            @P5A*/         
*/* $09=OA22832,HDZ11K0,071108,SJPLPPD: Null change required.    @09A*/         
*/* $P6=K1A1966,HDZ1A10,071220,SJPLPPD: Add in DCVCYLMG change   @P6A*/         
*/*     to make clear this bit is ON when megabyte calcs.        @P6A*/         
*/* $P7=K1A2115,HDZ1A10,080201,SJPLPPD: Make changes to macro to @P7A*/         
*/*     add or correct comments.                                 @P7A*/         
*/* $L9=EAVR2,HDZ1B10,070707,SJPLSCA: R11 EAVR2 Support          @L9A*/         
*/* $10=OA22124,HDZ11K0,070930,SJPLPPD: Add in Jaguar 3 EFMT3    @10A*/         
*/*     & EEFMT3 RECORDING TECHNOLOGIES.                         @10A*/         
*/* $11=OA24445,HDZ11K0,080423,SJPLSCA: Add data class VSAM attrs@11A*/         
*/* $12=K1B0523,HDZ1B10,081001,SJPLELA: Space ID group name is   @12A*/         
*/*     one byte shorter in length. (OA26554)                    @12A*/         
*/* $13=K1B0550,HDZ1B10,081024,SJPLELA: FIX EXTRA BIT defined in @13A*/         
*/*     DDCVSAM.                                                 @13A*/         
*/* $14=K1B0559,HDZ1B10,081028,SJPLELA: double declare of fields @14A*/         
*/* $P8=K1B0931,HDZ1B10,000212,SJPLELA: DDCSPECB has flags in    @P8A*/         
*/*     position that are not match between PLX and ASM versions @P8A*/         
*/* $L3=KFI0553,HDZ11K0,010809,SJPLELA: Fix real RDW field in    @L3A*/         
*/*     assember code                                            @L3A*/         
*/* $P9=K1B0976,HDZ1B10,020227,SJPLELA: Relocate DDCEATTR and    @P9A*/         
*/*     the reserve bytes to the end for compatibity to lower rl @P9A*/         
*/* $PA=K1B0959,HDZ1B10,022002,SPLELA: Remove double define of   @PAA*/         
*/*     Vsam Extention field                                     @PAA*/         
*/* $L2=RASDC12,HDZ1C10,030509,SJPLELA: DCOLLECT Currency SPRT#1 @L2A*/         
*/* $LF=RASDC12,HDZ1C10,031709,SJPLELA: DCOLLECT Currency SPRT#2 @LFA*/         
*/* $LK=RASDC12,HDZ1C10,062309,SJPLELA: DCOLLECT Currency SPRT#3 @LKA*/         
*/* $PB=KFI0586,HDZ1C10,061609,SJPLELA: Define fields DCDCREDT,  @PBA*/         
*/*     DCDEXPDT and DCDLSTRF as Packed Data Type for IECTOOL    @PBA*/         
*/*     able to use the fields (Assember verson only, Plas       @PBA*/         
*/*     version are kept as CHAR(4)  (OA29466)                   @PBA*/         
*/* $15=OA30006,HDZ1B10,090806,SJPLSCA: IDCDOUT COEXISTANCE      @15A*/         
*/* $LL=SMSRET,HDZ1D10,021010,SJPLELA: Increase data set         @LLA*/         
*/*     retention period > 9999                                  @LLA*/         
*/* $LN=BMFENH,HDZ1D10,012710,SJPLELA: Add SC Disconnect Sphere  @LNA*/         
*/*     at Close attribute for BMF Enhancement support           @LNA*/         
*/* $LO=SMAAS,HDZ1D10,041510,SJPLELA: Add new storage group      @LOA*/         
*/*     attributes for SMA Add Storage Simplification            @LOA*/         
*/* $PC=K1D0614,HDZ1D10,100610,SJPLELA: Fix the byte skipping    @PCA*/         
*/*     that causes mismatching the offset in the pub            @PCA*/         
*/* $LP=SAMEF,HDZ2210,021011,SJPLELA: SAM Extended Format support@LPA*/         
*/*     add new field for PS extended Format Version Number      @LPA*/         
*/* $LQ=STRTIER,HDZ2210,062411,SJPLELA: Storage Tier support     @LQA*/         
*/* $PD=KFI0680,HDZ1D10,020211,SJPLELA: The Confirmed SMS status @PDA*/         
*/*     bit VLDCNSMS is for SMS internal used only, DCOLLECT     @PDA*/         
*/*     should not report it externally.                         @PDA*/         
*/* $16=OA33950,HDZ1A10,100921,SJPLPPD: Add in Jaguar 4 EFMT4    @16A*/         
*/*     & EEFMT4 RECORDING TECHNOLOGIES PLUS MEDIA11, 12, & 13.  @16A*/         
*/* $17=SMSRET,HDZ1D10,082610,SJPLELA: Increase data set         @17A*/         
*/*     retention period > 9999 (OA33023)                        @17A*/         
*/* $18=OA38181,HDZ1D10,120111,SJPLELA: Change length of fields  @18A*/         
*/*     DSGSHTHR and DSGSLTHR to be compactible to lower releases@18A*/         
*/* $PE=K211027,HDZ2210,013012,SJPLELA: Fix the SDI for OA38181  @PEA*/         
*/* $P0=K211128,HDZ2210,02Mar12,SJLELA: Modify Copyright year    @P0A*/         
*/* $19=OA38980,HDZ1C10,08Mar2012,SMBranch: Add zFS Flag         @19A*/         
*/*     and Freespace fields                                     @19A*/         
*/* $20=OA38681,HDZ1D10,030112,SJPLELA: Remove SMA support       @20A*/         
*/* $LS=LI3465,HDZ2210,050212,SJPLELA: VSAM SMB Enhancement      @LSA*/         
*/*     (SM00291)                                                @LSA*/         
*/* $LT=SM00563,HDZ2210,18JULY2012,SJPLELA: DCR SMS21VSAM003     @LTA*/         
*/*     1. Remove the new field DCDABIAS, DCDFABIA, and the      @LTA*/         
*/*       constant values for DCDABIAS added by @LZ.             @LTA*/         
*/*     2. Add 4 new constant values for DCDRBIAS.               @LTA*/         
*/* $LR=ACTIVEA,HDZ1D10,120611,SJPLELA: Active Active Support    @LRA*/         
*/*     Include LOGREPLICATE attributes in DC record             @LRA*/         
*/* $PF=SM00951,HDZ2210,100411,SJPLELA: DDCRMODE location does   @PFA*/         
*/*     not match the doc (code offset 470 and Spec 469)         @PFA*/         
*/* $PG=SM01356,HDZ2210,012913,SJPLELA: DDCFRMOD location does   @PGA*/         
*/*     not match the doc (code offset 302 '20'X Spec 302 '10'X) @PGA*/         
*/* $PH=SM01373,HDZ2210,020813,SJPLELA: DDCFRMOD back to offset  @PHA*/         
*/*     302 '20'X to match the DCR specification.                @PHA*/         
*/* $PJ=OA42976,HDZ2210,01AUG2013,ELAI: change product number    @PJA*/         
*/* $LU=FP0012,HDZ2220,032513,ELAI: SMS Space Constraint Relief  @LUA*/         
*/*     Enhancement - Add Guaranteed Space reduction field.      @LUA*/         
*/* $LX=ALRTMSG,HDZ2220,27JAN2014,ELAI: Add two fields for       @LXA*/         
*/*    users to specify an alert percentage for total space of   @LXA*/         
*/*    the entire storage group and for total track-managed space@LXA*/         
*/* $LY=FP1423,HDZ2230,26JAN2016,ELAI: ReadOnly Volume access    @LYA*/         
*/*    support, add a constant field for DVLMVSS (113974)        @LYA*/         
*/* $O1=FP1240,HDZ2230,10MOV2015,ELAI: Multiple OAM address      @O1A*/         
*/*    spaces support  (118920)                                  @O1A*/         
*/* $X1=OA47228,HDZ2220,04MAY2015,ELAI: RPFC for XRC, missing    @X1A*/         
*/*     STORAGE TIER support for 2 new MC fields (SDI 119012)    @X1A*/         
*/* $E1=FP0454,HDZ2230,23NOV2015,ELAI: DFSMS VSAM encription     @E1A*/         
*/* $E2=FP0454,HDZ2210,12Jun2017,ELAI: Fix DCDATYPE typo         @E2A*/         
*/*     (OA51067)                                                @E2A*/         
*/* $M1=FP2096,HDZ2210,12JUN2017,ELAI: MC Store Automigration to @M1A*/         
*/*     cloud support.                                           @M1A*/         
*/* $PI=OA54546,HDZ2210,14DEC2017,ELAI: Fix mismatching of the   @PIA*/         
*/*     PLX and Assember versions when useing PADI tool          @PIA*/         
*/* $PJ=OA54767,HDZ2210,01MAR2018,ELAI: Add missing constant     @PJA*/         
*/*     Copy Target for DSGFTYPE                                 @PJA*/         
*/* $H1=OA54872,HDZ2210,20FEB2018,ELAI: zHyperLink Storage Class @H1A*/         
*/*     Granularity support                                      @H1A*/         
*/* $21=OA55574,HDZ2210,22Aug2018,SMBranch: Add compression      @21A*/         
*/*     types and compression validity flag in DCDFLAG3          @21A*/         
*/* $PK=243035,HDZ2240,15FEB2019,ELAI: put DVLCNSMS back to      @PKA*/         
*/*     the field for NaviQuest to use (FIN OA54800)             @PKA*/         
*/* $PL=OA64133,HDZ2240,09JAN2023,ELAI: Add DSGFLAG2 field       @PLA*/         
*/*END OF SPECIFICATIONS**********************************************/         
*% /*                                                                           
         AIF   ('&ZCBPRINT' EQ 'NO').P1                                         
         AIF   ('&LIST' EQ 'YES').P2                                            
.P1      ANOP                                                                   
         PUSH  PRINT                                                            
         PRINT OFF                                                              
.P2      ANOP                                                                   
*                                                                @L8A           
* *************************************************************  @L8A           
* * VERIFY PARAMETERS                                            @L8A           
* *************************************************************  @L8A           
*                                                                @L8A           
         AIF   ('&TYPE' EQ 'ALL' ).TYPE1     ALL OF THE BELOW    @L8A           
         AIF   ('&TYPE' EQ 'D'   ).TYPE1     ACTIVE D.S. INFO    @L8A           
         AIF   ('&TYPE' EQ 'A'   ).TYPE1     CLUSTER ASSOCIATE   @L8A           
         AIF   ('&TYPE' EQ 'V'   ).TYPE1     VOLUME INFO         @L8A           
         AIF   ('&TYPE' EQ 'DC'  ).TYPE1     SMS DATACLAS        @L8A           
         AIF   ('&TYPE' EQ 'SC'  ).TYPE1     SMS STORCLAS        @L8A           
         AIF   ('&TYPE' EQ 'MC'  ).TYPE1     SMS MGMTCLAS        @L8A           
         AIF   ('&TYPE' EQ 'BC'  ).TYPE1     SMS BASE CONFIG     @L8A           
         AIF   ('&TYPE' EQ 'SG'  ).TYPE1     SMS STORGRP         @L8A           
         AIF   ('&TYPE' EQ 'VL'  ).TYPE1     SMS VOLUME          @L8A           
         AIF   ('&TYPE' EQ 'AG'  ).TYPE1     SMS AGRIGATE GRP    @L8A           
         AIF   ('&TYPE' EQ 'DR'  ).TYPE1     SMS OPTICAL DRIVE   @L8A           
         AIF   ('&TYPE' EQ 'LB'  ).TYPE1     SMS TAPE LIBRARY    @L8A           
         AIF   ('&TYPE' EQ 'CN'  ).TYPE1     SMS CACHE NAMES     @L8A           
         AIF   ('&TYPE' EQ 'AI'  ).TYPE1     SMS ACCOUNTING      @L8A           
         AIF   ('&TYPE' EQ 'NONE').TYPE1     NONE OF THE ABOVE   @L8A           
         MNOTE 'IDCDOUT - #### ERROR IN VALIDATION ####'         @L8A           
         MNOTE 8,'IDCDOUT - UNKNOWN VALUE SPECIFIED FOR TYPE='   @L8A           
*                                                                @L8A           
* *********************** IDCDOUT MACRO END ******************** @L8A           
* *********************** IDCDOUT MACRO END ******************** @L8A           
*                                                                @L8A           
         MEXIT                                                   @L8A           
*                                                                @L8A           
.TYPE1   ANOP                                                    @L8A           
         AIF   ('&TYPE' EQ 'ALL'   ).OKPARM     DEFAULT TYPE     @L8A           
         AIF   ('&DCUOUTH' NE 'NO' ).TYPE2                       @L8A           
         MNOTE '###                                          '   @L8A           
         MNOTE '### TYPE= VALUE WAS IGNORED FOR DCUOUTH=NO   '   @L8A           
         MNOTE '###                                          '   @L8A           
         AGO   .OKDCUOU                                          @L8A           
.TYPE2   ANOP                                                    @L8A           
         AIF   ('&DCUOUTH' EQ 'YES').OKPARM                      @L8A           
         MNOTE '###                                          '   @L8A           
         MNOTE '### DCUOUTH= VALUE WAS IGNORED FOR TYPE= VALUE'  @L8A           
         MNOTE '###                                          '   @L8A           
.OKDCUOU ANOP                                                    @L8A           
*        SINCE NO PRIOR VALIDATION OF PARAMETERS WERE PERFORMED, @P1C           
*        NO CHECKS OF PRIOR VALUES WERE ADDED WHICH MAY ALTER    @L8A           
*        SUCCESSFUL COMPILES AND OPERATION.PROCESSING CONTINUES  @L8A           
.OKPARM  ANOP                                                    @L8A           
*                                                                               
* ********************************************************************          
* * HEADER PORTION OF DATA COLLECTION UTILITY OUTPUT RECORD. EACH    *          
* * DATA SECTION IS PRECEDED BY THIS HEADER.                         *          
* ********************************************************************          
*                                                                               
*                                                                               
         AIF   ('&DCUOUTH' EQ 'NO').L0002                                       
         AIF   ('&DSECT' EQ 'YES').L0003                                        
         AIF   ('&TYPE' NE 'ALL'   ).L0005     OVERRIDE DCUOUTH  @L8A           
         AIF   ('&DCUOUTH' NE 'YES').L0002                                      
.L0005   ANOP                                                    @L8A           
DCUOUTH  DS    0D        DATA COLLECTION OUTPUT RECORD           @15C           
         AIF   ('&RDW'   EQ 'YES').L0006        return real RDW  @L3A           
         AGO   .L0004                                            @L3A           
.L0006   ANOP                                                    @L3A           
         DS    1FL4      THE REAL VALUE OF RDW                   @L3A           
         AGO   .L0004                                                           
.L0003   ANOP                                                                   
DCUOUTH  DSECT           DATA COLLECTION OUTPUT RECORD                          
         AIF   ('&RDW'   EQ 'YES').L0007        return real RDW  @L3A           
         AGO   .L0004                                            @L3A           
.L0007   ANOP                                                    @L3A           
         DS    1FL4      THE REAL VALUE OF RDW                   @L3A           
.L0004   ANOP                                                                   
DCURDW   DS    1FL4      RECORD DESCRIPTOR WORD                                 
         ORG   DCURDW                                                           
DCULENG  DS    1FL2      LENGTH OF THIS RECORD                                  
         DS    1CL0002   RESERVED                                               
DCURCTYP DS    1CL0002   RECORD TYPE FOR THIS RECORD                            
DCUVERS  DS    1FL2      VERSION                                                
DCUVERS1 EQU   1         INITIAL VERSION OF IDCDOUT              @15A           
DCUVERS2 EQU   2         DFSMS V1R10 VERSION OF IDCDOUT          @15A           
DCUVERSC EQU   2         LATEST VERSION OF IDCDOUT               @15A           
*                                                                               
DCUSYSID DS    1CL0004   SYSTEM ID FOR THIS OPERATION                           
DCUTMSTP DS    1CL0008   TIMESTAMP FIELD                                        
         ORG   DCUTMSTP                                                         
DCUTIME  DS    1FL4      TIME IN SMF HEADER FORMAT                              
DCUDATE  DS    1CL0004   DATE IN SMF FORMAT (CCYYDDDF)                          
         DS    1CL0004   RESERVED                                               
DCUDATA  DS    0C        END OF HEADER SECTION                                  
DCUOUTH_LEN EQU *-DCUOUTH                                                       
*                                                                @L8A           
         AIF ('&TYPE' EQ 'ALL' OR '&TYPE' EQ 'D'  ).DCD          @L8A           
         AGO .DCDSKP                                             @L8A           
.DCD     ANOP                                                    @L8A           
*                                                                               
* ********************************************************************          
* * ACTIVE DATA SET INFORMATION (RECORD TYPE 'D')                    *          
* ********************************************************************          
*                                                                               
*                                                                               
         ORG   DCUDATA                                                          
DCDADSI  DS    0X                                                               
DCDDSNAM DS    1CL0044   DATA SET NAME                                          
DCDERROR DS    1BL1      ERROR INFORMATION FLAGS                                
         ORG   DCDERROR                                                         
DCDEMNGD EQU   X'80'     SMS MANAGED INCONSISTENCY                              
DCDEDVVR EQU   X'40'     DUPLICATE VVR FOUND                                    
DCDNOSPC EQU   X'20'     NO SPACE INFORMATION PROVIDED                          
DCDVSAMI EQU   X'10'     VSAM INDICATORS INCONSISTENT                           
DCDNOFM1 EQU   X'08'     NO FMT 1 DSCB FOR THIS DATA SET                        
         ORG   DCDERROR+X'00000001'                                             
DCDFLAG1 DS    1BL1      INFORMATION FLAG #1                                    
         ORG   DCDFLAG1                                                         
DCDRACFD EQU   X'80'     DATA SET IS RACF DEFINED                               
DCDSMSM  EQU   X'40'     SMS MANAGED DATA SET                                   
DCDTEMP  EQU   X'20'     TEMPORARY DATA SET                                     
DCDPDSE  EQU   X'10'     PARTITIONED DATA SET (EXTENDED)                        
DCDGDS   EQU   X'08'     GENERATION DATA GROUP DATA SET                         
DCDREBLK EQU   X'04'     DATA SET MAY BE REBLOCKED                              
DCDCHIND EQU   X'02'     CHANGE INDICATOR                                       
DCDCKDSI EQU   X'01'     CHECKPOINT DATA SET INDICATOR                          
         ORG   DCDFLAG1+X'00000001'                                             
DCDFLAG2 DS    1BL1      INFORMATION FLAG #2                                    
         ORG   DCDFLAG2                                                         
DCDNOVVR EQU   X'80'     NO VVR FOR THIS DATA SET                               
DCDINTCG EQU   X'40'     DATA SET IS AN ICF CATALOG                             
DCDINICF EQU   X'20'     DATA SET IS CATALOGED IN ICF CAT                       
DCDALLFG EQU   X'08'     31BIT ALLOCATED SPACE AVAILABLE         @L9C           
DCDUSEFG EQU   X'04'     31BIT USED SPACE AVAILABLE              @L9C           
DCDSECFG EQU   X'02'     31BIT SECONDARY SPACE AVAILABLE         @L9C           
DCDNMBFG EQU   X'01'     31BIT UNUSEABLE SPACE AVAILABLE         @L9C           
         ORG   DCDFLAG2+X'00000001'                                             
DCDFLAG3 DS    1BL1      INFORMATION FLAG #3                                    
         ORG   DCDFLAG3                                                         
DCDPDSEX EQU   X'80'     POSIX FILE SYSTEM FILE                                 
DCDSTRP  EQU   X'40'     EXTENDED FORMAT                                        
DCDDDMEX EQU   X'20'     DDM INFO EXIST FOR THIS DS                             
DCDCPOIT EQU   X'10'     CHECKPOINTED DATASETS                                  
DCDGT64K EQU   X'08'     GT 64K TRK FLAG                 @LHD                   
DCDCMPTV EQU   X'04'     COMPRESSION TYPE IS VALID       @21A                   
         ORG   DCDFLAG3+X'00000001'                                             
         DS    1CL0002   reserved                                               
DCDDSORG DS    1BL2      DATA SET ORGANIZATION                                  
         ORG   DCDDSORG                                                         
DCDDSOR0 DS    1BL1      DATA SET ORGANIZATION BYTE 0                           
         ORG   DCDDSOR0                                                         
DCDDSGIS EQU   X'80'     IS - INDEXED SEQUENTIAL ORG                            
DCDDSGPS EQU   X'40'     PS - PHYSICAL SEQUENTIAL ORG                           
DCDDSGDA EQU   X'20'     DA - DIRECT ORGANIZATION                               
DCDDSGPO EQU   X'02'     PO - PARTITIONED ORGANIZATION                          
DCDDSGU  EQU   X'01'     U - UNMOVEABLE DATA SET                                
         ORG   DCDDSOR0+X'00000001'                                             
DCDDSOR1 DS    1BL1      DATA SET ORGANIZATION BYTE 1                           
         ORG   DCDDSOR1                                                         
DCDDSGGS EQU   X'80'     GS - GRAPHICS ORGANIZATION                             
DCDDSGVS EQU   X'08'     VS - VSAM DATA SET                                     
         ORG   DCDDSORG+X'00000002'                                             
DCDRECRD DS    1BL1      RECORD FORMAT BYTE                                     
         ORG   DCDRECRD                                                         
DCDRECFM EQU   X'C0'     RECORD FORMAT BITS                                     
DCDRECFT EQU   X'20'     TRACK OVERFLOW                                         
DCDRECFB EQU   X'10'     BLOCKED RECORDS                                        
DCDRECFS EQU   X'08'     STANDARD BLOCKS(F) OR SPANNED(V)                       
DCDRECFA EQU   X'04'     ANSI CONTROL CHARACTER                                 
DCDRECFC EQU   X'02'     MACHINE CONTROL CHARACTER                              
         ORG   DCDRECRD+X'00000001'                                             
DCDNMEXT DS    1FL1      NUMBER OF EXTENTS USED                                 
DCDVOLSR DS    1CL0006   VOLUME SERIAL NUMBER                                   
DCDBKLNG DS    1FL2      BLOCK LENGTH                                           
DCDLRECL DS    1FL2      RECORD LENGTH                                          
* --------------------------------------------------------------- @15A          
* Extended Address Volume EAV support has introduced new fields   @15A          
* to contain the following data set sizes in 63 bit format. New   @15A          
* and migrating applications should be changed to reference the   @15A          
* 63 bit values: DCDALLSX DCDUSESX DCDSCALX DCDNMBLX              @15A          
*                                                                 @15A          
DCDALLSP DS    1FL4      DATA SET ALLOCATED SPACE IN KBs (1024)   @15C          
*                         WHEN DCDALLFG IS ON                     @15C          
DCDUSESP DS    1FL4      DATA SET USED SPACE IN KBs (1024)        @15C          
*                         WHEN DCDUSEFG IS ON                     @15C          
DCDSCALL DS    1FL4      DATA SET SECONDARY SPACE IN KBs (1024)   @15C          
*                         WHEN DCDSECFG IS ON                     @15C          
DCDNMBLK DS    1FL4      DATA SET UNUSABLE SPACE IN KBs (1024)    @15C          
*                         WHEN DCDNMBFG IS ON                     @15C          
* --------------------------------------------------------------- @15A          
DCDCREDT DS    1PL0004   CREATION DATE (YYYYDDDF)                @PBC           
DCDEXPDT DS    1PL0004   EXPIRATION DATE (YYYYDDDF)              @PBC           
DCDLSTRF DS    1PL0004   DATE LAST REFERENCED (YYYYDDDF)         @PBC           
DCDDSSER DS    1CL0006   DATA SET SERIAL NUMBER                                 
DCDVOLSQ DS    1CL0002   VOLUME SEQUENCE NUMBER                                 
DCDLBKDT DS    1CL0008   LAST BACKUP TIME & DATE                                
DCDDCLAS DS    1CL0032                                                          
         ORG   DCDDCLAS                                                         
DCDDCLNG DS    1FL2      DATA CLASS NAME LENGTH                                 
DCDDATCL DS    1CL0030   DATA CLASS NAME                                        
DCDSCLAS DS    1CL0032                                                          
         ORG   DCDSCLAS                                                         
DCDSCLNG DS    1FL2      STORAGE CLASS NAME LENGTH                              
DCDSTGCL DS    1CL0030   STORAGE CLASS NAME                                     
DCDMCLAS DS    1CL0032                                                          
         ORG   DCDMCLAS                                                         
DCDMCLNG DS    1FL2      MANAGEMENT CLASS NAME LENGTH                           
DCDMGTCL DS    1CL0030   MANAGEMENT CLASS NAME                                  
DCDSTOGP DS    1CL0032                                                          
         ORG   DCDSTOGP                                                         
DCDSGLNG DS    1FL2      STORAGE GROUP NAME LENGTH                              
DCDSTGRP DS    1CL0030   STORAGE GROUP NAME                                     
DCDCCSID DS    1CL0002   CODED CHAR SET IDENTIFIER                              
*                                                                               
DCDCATF  DS    1BL1      CATALOG FLAGS                    ] @15C@L9C            
*        EQU   X'F4'     RESERVED                               @15A            
DCDEATRC EQU   X'03'     EATTR IN CATALOG BITS                  @15A            
*        EQU   X'03'     RESERVED                               @L9A            
*        EQU   X'02'     EAS OPTIONAL      - OPT - DDCEATOP @15C@L9A            
*        EQU   X'01'     EAS NOT ELIGIBLE  - NO  - DDCEATNO @15C@L9A            
*        EQU   X'00'     EAS NOT DEFINED   - n/a - DDCEANUL @15C@L9A            
*                                                                               
DCDDSCBF DS    1BL1      VTOC FLAGS                       ]     @L9A            
*        EQU   X'F4'     RESERVED                               @15A            
DCDEATRV EQU   X'03'     EATTR IN VTOC BITS                     @15A            
*        EQU   X'03'     RESERVED                               @L9A            
*        EQU   X'02'     EAS OPTIONAL      - OPT - DDCEATOP @15C@L9A            
*        EQU   X'01'     EAS NOT ELIGIBLE  - NO  - DDCEATNO @15C@L9A            
*        EQU   X'00'     EAS NOT DEFINED   - n/a - DDCEANUL @15C@L9A            
DCDUDSIZ DS    1CL0008   USER DATA SIZE                                         
DCDCUDSZ DS    1CL0008   COMPRESSED USER DATA SIZE                              
DCDEXFLG DS    1BL2      COMPRESSION FLAGS                                      
DCDBDSZ  EQU   X'80'     INVALID DATA SIZES                                     
*                                                               @L9D            
DCDSCNT  DS    1FL2      Stripe Count                                           
DCDOVERA DS    1FL4      OVER-ALLOCATED SPACE                                   
DCDACCT  DS    1CL0032   Account Information                                    
DCDFLAG5 DS    1CL1      INFORMATION FLAG # 5                    @15A           
DCDALLFX EQU   X'80'     63BIT ALLOCATED SPACE IN DCDALLSX       @15A           
DCDUSEFX EQU   X'40'     63BIT USED SPACE AVAILABLE IN DCDUSESX  @15A           
DCDSCAFX EQU   X'20'     63BIT SECONDARY SPACE IN DCDSCALX       @15A           
DCDNMBFX EQU   X'10'     63BIT UNUSABLE SPACE IN DCDNMBLX        @15A           
         DS    1CL3      INFORMATION FLAG # 6-7-8 RESERVED       @15A           
         DS    1CL3      RESERVED                                @15A           
DCDDS9F1 DS    1CL0001   FORMAT 9 DSCB FLAG1                @LKM @LFA           
DCDDS9CR EQU   X'80'     FORMAT 9 DSCB BUILT BY CREATE      @LKM @LFA           
*                                                                               
DCDJBNMC DS    1CL0008   Jobname used to create the data set@LKM @LFA           
DCDSTNMC DS    1CL0008   Stepname used to create the dataset@LKM @LFA           
DCDTIMEC DS    1CL0006   micro sec since midnight the ds created @LFA           
         DS    1CL2      RESERVED                           @LKM @15A           
DCDALLSX DS    1FL8      DATA SET ALLOCATED SPACE IN KB(1024)@15M@L9A           
*                         WHEN DCDALLFX IS ON                    @15C           
DCDUSESX DS    1FL8      DATA SET USED SPACE IN KB(1024)     @15M@L9A           
*                         WHEN DCDUSEFX IS ON                    @15C           
DCDSCALX DS    1FL8      DATA SET SECONDARY SPACE IN KB(1024)@15M@L9A           
*                         WHEN DCDSCAFX IS ON                    @15C           
DCDNMBLX DS    1FL8      DATA SET UNUSABLE SPACE IN KB       @15M@L9A           
*                         WHEN DCDNMBFX IS ON                    @15C           
DCDXPSEV DS    1FL1      DATA SET Extended Format version number @LPA           
DCDCTYPE DS    1FL1      DATA SET Compression type               @21C           
DCDCNCMP EQU   0         NOT COMPRESSED FORMAT                   @21A           
DCDCGENC EQU   1         GENERIC COMPRESSION                     @21A           
DCDCTLRD EQU   2         TAILORED COMPRESSION                    @21A           
DCDCZEDC EQU   3         ZEDC COMPRESSION                        @21A           
DCDAENCR DS    1CL0066   Encryption Type                         @E1A           
         ORG   DCDAENCR                                          @E1A           
DCDATYPE DS    1CL2      ENCRYPTION TYPE                         @E2C           
DCDAKLBL DS    1CL0064   ENCRYPTION KEY LABEL                    @E1A           
         DS    1CL16     RESERVED                                @E1C           
DCDADSIE DS    0C        END OF DCUDSET                                         
         DS    1CL16     RESERVED                                               
DCDADSI_LEN EQU *-DCDADSI                                                       
         ORG   ,                                                                
*                                                                @L8A           
.DCDSKP  ANOP                                                    @L8A           
         AIF ('&TYPE' EQ 'ALL' OR '&TYPE' EQ 'A'  ).DCA          @L8A           
         AGO .DCASKP                                             @L8A           
.DCA     ANOP                                                    @L8A           
*                                                                               
* ********************************************************************          
* * VSAM BASE CLUSTER ASSOCIATION NAME (RECORD TYPE 'A')             *          
* ********************************************************************          
*                                                                               
*                                                                               
         ORG   DCUDATA                                                          
DCASSOC  DS    0X                                                               
DCADSNAM DS    1CL0044   DATA SET NAME                                          
DCAASSOC DS    1CL0044   BASE CLUSTER NAME                                      
DCAFLAG1 DS    1BL1      VSAM INFORMATION FLAG #1                               
         ORG   DCAFLAG1                                                         
DCAKSDS  EQU   X'80'     KEY SEQUENCED DATA SET                                 
DCAESDS  EQU   X'40'     ENTRY SEQUENCED DATA SET                               
DCARRDS  EQU   X'20'     RELATIVE RECORD DATA SET                               
DCALDS   EQU   X'10'     LINEAR DATA SET                                        
DCAKRDS  EQU   X'08'     KEY RANGE DATA SET                                     
DCAAIX   EQU   X'04'     ALTERNATE INDEX DATA SET                               
DCADATA  EQU   X'02'     VSAM DATA COMPONENT                                    
DCAINDEX EQU   X'01'     VSAM INDEX COMPONENT                                   
         ORG   DCAFLAG1+X'00000001'                                             
DCAFLAG2 DS    1BL1      VSAM INFORMATION FLAG #2                               
         ORG   DCAFLAG2                                                         
DCAKR1ST EQU   X'80'     1ST SEGMENT OF KR DATA SET                             
DCAIXUPG EQU   X'40'     ALTERNATE INDEX W/ UPGRADE                             
DCAVRRDS EQU   X'20'     VARIABLE RRDS                                          
DCANSTAT EQU   X'10'     NO VSAM STATS IN RECORD                                
DCASRCI  EQU   X'08'     RBA is CI number                                       
DCAG4G   EQU   X'04'     Extended Addressability Data Set                       
DCAZFS   EQU   X'02'     zFS Data Set                            @19A           
         ORG   DCAFLAG2+X'00000001'                                             
         DS    1CL0002   RESERVED                                               
DCAHURBA DS    1FL4      HIGH USED RBA / CI                                     
DCAHARBA DS    1FL4      HIGH ALLOCATED RBA / CI                                
DCANLR   DS    1FL4      NUMBER OF LOGICAL RECORDS                              
DCADLR   DS    1FL4      NUMBER OF DELETED RECORDS                              
DCAINR   DS    1FL4      NUMBER OF INSERTED RECORDS                             
DCAUPR   DS    1FL4      NUMBER OF UPDATED RECORDS                              
DCARTR   DS    1FL4      NUMBER OF RETRIEVED RECORDS                            
DCAASP   DS    1FL4      BYTES OF FREESPACE IN DS                               
DCACIS   DS    1FL4      NUMBER OF CI SPLITS                                    
DCACAS   DS    1FL4      NUMBER OF CA SPLITS                                    
DCAEXC   DS    1FL4      NUMBER OF EXCPS                                        
DCARKP   DS    1FL2      RELATIVE KEY POSITION                                  
DCAKLN   DS    1FL2      KEY LENGTH                                             
DCAHURBC DS    1CL0008   HIGH USED RBA CALC FRM CI                              
DCAHARBC DS    1CL0008   HI ALLOC RBA CALC FRM CI                               
DCACISZ  DS    1FL4      NUMBER BYTES IN A CI                                   
DCACACI  DS    1FL4      NUMBER CI'S IN A CA                                    
DCATRDT  DS    1CL0004   HSM CLASS TRANSITION DATE               @LQA           
         DS    1CL0012   RESERVED                                @LQC           
DCASSOCE DS    0C        END OF DCASSOC                                         
DCASSOC_LEN EQU *-DCASSOC                                                       
         ORG   ,                                                                
*                                                                @L8A           
.DCASKP  ANOP                                                    @L8A           
         AIF ('&TYPE' EQ 'ALL' OR '&TYPE' EQ 'V'  ).DCV          @L8A           
         AGO .DCVSKP                                             @L8A           
.DCV     ANOP                                                    @L8A           
*                                                                               
* ********************************************************************          
* * VOLUME INFORMATION (RECORD TYPE 'V')                             *          
* ********************************************************************          
*                                                                               
*                                                                               
         ORG   DCUDATA                                                          
DCVVOLI  DS    0X                                                               
DCVVOLSR DS    1CL0006   VOLUME SERIAL NUMBER                                   
DCVFLAG1 DS    1BL1      INFORMATION FLAG #1                                    
         ORG   DCVFLAG1                                                         
DCVINXST EQU   X'C0'     INDEX STATUS                                           
DCVINXEX EQU   X'80'     INDEXED VTOC EXISTS                                    
DCVINXEN EQU   X'40'     INDEXED VTOC IS ENABLED                                
DCVUSATR EQU   X'38'     USE ATTRIBUTE                                          
DCVUSPVT EQU   X'20'     PRIVATE                                                
DCVUSPUB EQU   X'10'     PUBLIC                                                 
DCVUSSTO EQU   X'08'     STORAGE                                                
DCVSHRDS EQU   X'04'     DEVICE IS SHAREABLE                                    
DCVPHYST EQU   X'03'     PHYSICAL STATUS                                        
         ORG   DCVFLAG1+X'00000001'                                             
DCVERROR DS    1BL1      ERROR INFORMATION FLAG                                 
         ORG   DCVERROR                                                         
DCVEVLCP EQU   X'80'     ERROR CALCULATING VOL CAPACITY                         
DCVEBYTK EQU   X'40'     ERROR CALCULATING BYTES/TRK                            
DCVELSPC EQU   X'20'     ERROR DURING LSPACE PROCESSING                         
         ORG   DCVERROR+X'00000001'                                             
         DS    1CL0003   RESERVED                                               
DCVPERCT DS    1FL1      PERCENT FREESPACE ON VOLUME                            
DCVFRESP DS    1FL4      FREESPACE ON VOLUME (IN KB)                            
DCVALLOC DS    1FL4      ALLOCATED SPACE ON VOL (IN KB)                         
DCVVLCAP DS    1FL4      TOTAL CAPACITY OF VOL (IN KB)                          
DCVFRAGI DS    1FL4      FRAGMENTATION INDEX                                    
DCVLGEXT DS    1FL4      LARGEST FREE EXTENT ON VOLUME                          
DCVFREXT DS    1FL4      NUMBER OF FREE EXTENTS                                 
DCVFDSCB DS    1FL4      FREE DSCBS IN VTOC                                     
DCVFVIRS DS    1FL4      FREE VIRS                                              
DCVDVTYP DS    1CL0008   DEVICE TYPE                                            
DCVDVNUM DS    1FL2      DEVICE NUMBER                                          
         DS    1CL0002   RESERVED                                               
DCVSTGGP DS    1CL0032                                                          
         ORG   DCVSTGGP                                                         
DCVSGLNG DS    1FL2      STORAGE GROUP NAME LENGTH                              
DCVSGTCL DS    1CL0030   STORAGE GROUP NAME                                     
DCVDPTYP DS    1CL0008   PHYSICAL DEVICE TYPE                                   
DCVTRPCT DS    1FL1      PERCENT FREESP ON TRK MANAGED PART EAV @L6A            
DCVEAVOL DS    1BL1      EAV INDICATOR FLAG                     @L6A            
         ORG   DCVEAVOL                                                         
DCVCYLMG EQU   X'80'     VOLUME CONTAINS GT 65,520 CYL          @P5C            
         DS    1CL0002   RESERVED                               @P5C            
         ORG   DCVEAVOL+X'00000003'                             @P5A            
DCVTRFSP DS    1FL4      FREE SPACE IN MEGABYTES OF TRK MGD EAV @L7C            
DCVTRALC DS    1FL4      ALLOCATED SPACE IN MB OF TRK MGD EAV   @L6A            
DCVTRVLC DS    1FL4      TOTAL CAPACITY OF TRK MGD PART OF EAV  @L6A            
DCVTRFRG DS    1FL4      FRAG INDEX FOR TRK MGD PART OF EAV     @L6A            
DCVTRLGE DS    1FL4      LARGEST EXT FOR TRK MGD PART OF EAV    @L6A            
DCVTRFRX DS    1FL4      NO OF FREE EXTENTS FOR TRK MGD PART EAV@L6A            
DCVFCYLS DS    1FL4      FREE CYLINDERS ON VOLUME               @19A            
DCVFTRKS DS    1FL4      FREE TRACKS ON VOLUME                  @19A            
         DS    1CL4      RESERVED                               @19A            
DCVVOLIE DS    0C        END IF DCVVOLI                                         
DCVVOLI_LEN EQU *-DCVVOLI                                                       
         ORG   ,                                                                
*                                                                @L8A           
.DCVSKP  ANOP                                                    @L8A           
         AIF ('&TYPE' EQ 'ALL' OR '&TYPE' EQ 'DC' ).DCDC         @L8A           
         AGO .DCDCSKP                                            @L8A           
.DCDC    ANOP                                                    @L8A           
*                                                                               
* ********************************************************************          
* * DATA CLASS CONSTRUCT INFORMATION (RECORD TYPE 'DC')              *          
* ********************************************************************          
*                                                                               
*                                                                               
         ORG   DCUDATA                                                          
DDCDATA  DS    0X                                                               
DDCNMFLD DS    1CL0032   SPACE FOR NAME AND LENGTH                              
         ORG   DDCNMFLD                                                         
DDCNMLEN DS    1FL2      LENGTH OF NAME                                         
DDCNAME  DS    1CL0030   NAME OF DATA CLASS                                     
DDCUSER  DS    1CL0008   USERID OF LAST UPDATER                                 
DDCDATE  DS    1CL0010   DATE OF LAST UPDATE                                    
         DS    1CL0002   RESERVED                                               
DDCTIME  DS    1CL0008   TIME OF LAST UPDATE                                    
DDCDESC  DS    1CL0120   DESCRIPTION                                            
*                                                                               
*      ***************************************************************          
*      *                                                             *          
*      * DATA CLASS PARAMETERS SPECIFICATION BITS                               
*      *                                                             *          
*      ***************************************************************          
*                                                                               
*                                                                               
DDCSPEC  DS    1CL0004                                                          
         ORG   DDCSPEC                                                          
DDCSPEC1 DS    1BL1                                                             
         ORG   DDCSPEC1                                                         
DDCFRORG EQU   X'80'     RECORG SPECIFIED FLAG                                  
DDCFLREC EQU   X'40'     LRECL SPECIFIED FLAG                                   
DDCFRFM  EQU   X'20'     RECFM SPECIFIED FLAG                                   
DDCFKLEN EQU   X'10'     KEYLEN SPECIFIED FLAG                                  
DDCFKOFF EQU   X'08'     KEYOFF SPECIFIED FLAG                                  
DDCFEXP  EQU   X'04'     EXPIRATION ATTRIB SPEC'D FLAG                          
DDCFRET  EQU   X'02'     RETENTION ATTRIB SPEC'D FLAG                           
DDCFPSP  EQU   X'01'     PRIMARY SPACE SPECIFIED FLAG                           
         ORG   DDCSPEC1+X'00000001'                                             
DDCSPEC2 DS    1BL1                                                             
         ORG   DDCSPEC2                                                         
DDCFSSP  EQU   X'80'     SECONDARY SPACE SPEC'D FLAG                            
DDCFDIR  EQU   X'40'     DIRECTORY BLOCKS SPEC'D FLAG                           
DDCFAUN  EQU   X'20'     ALLOCATION UNIT SPEC'D FLAG                            
DDCFAVR  EQU   X'10'     AVGREC SPECIFIED FLAG                                  
DDCFVOL  EQU   X'08'     VOLUME CNT SPECIFIED FLAG                              
DDCFCIS  EQU   X'04'     DATA CI SIZE SPECIFIED FLAG                            
DDCFCIF  EQU   X'02'     FREE CI % SPECIFIED FLAG                               
DDCFCAF  EQU   X'01'     FREE CA % SPECIFIED FLAG                               
         ORG   DDCSPEC2+X'00000001'                                             
DDCSPEC3 DS    1BL1                                                             
         ORG   DDCSPEC3                                                         
DDCFXREG EQU   X'80'     SHAREOPT XREGION SPEC'D FLAG                           
DDCFXSYS EQU   X'40'     SHAREOPT XSYSTEM SPEC'D FLAG                           
DDCFIMBD EQU   X'20'     VSAM IMBED SPECIFIED FLAG                              
DDCFRPLC EQU   X'10'     VSAM REPLICATE SPECIFIED FLAG                          
DDCFCOMP EQU   X'08'     COMPACTION SPECIFIED FLAG                              
DDCFMEDI EQU   X'04'     MEDIA TYPE SPECIFIED FLAG                              
DDCFRECT EQU   X'02'     RECORDING TECHNOLOGY FLAG                              
DDCFVEA  EQU   X'01'     VSAM extended addressability            @15C           
*                                                                               
*      ***************************************************************          
*      *                                                             *          
*      * on = ext addr allowed                                                  
*      *                                                             *          
*      ***************************************************************          
*                                                                               
*                                                                               
         ORG   DDCSPEC3+X'00000001'                                             
DDCSPEC4 DS    1BL1                                                             
         ORG   DDCSPEC4                                                         
DDCSPRLF EQU   X'80'     Space Constraint Relief                                
DDCREDUS EQU   X'40'     Reduce Space by% specified                             
DDCRABS  EQU   X'20'     Rec Access Bias specified                              
DDCFCT   EQU   X'10'     Compression Type specified              @L2A           
DDCBLMT  EQU   X'08'     Block Size Limit specified              @L2A           
DDCCFS   EQU   X'04'     RLS CF Cache specified                  @L2A           
DDCDVCS  EQU   X'02'     Dynamic Volume Count specified          @LFA           
DDCFSCAL EQU   X'01'     Performance Scaling specified           @LFA           
*                                                                               
*      ***************************************************************          
*      *                                                             *          
*      * DATA SET ATTRIBUTES                                                    
*      *                                                             *          
*      ***************************************************************          
*                                                                               
*                                                                               
         ORG   DDCSPEC+X'00000004'                                              
DDCRCORG DS    1FL1      DATA SET RECORG -- SEE CONST                           
DDCRECFM DS    1FL1      DATA SET RECFM -- SEE CONST                            
DDCDSFLG DS    1BL1                                                             
         ORG   DDCDSFLG                                                         
DDCBLK   EQU   X'80'     1 = BLOCKED, 0 = UNBLKED/NULL                          
DDCSTSP  EQU   X'40'     1 = STANDARD OR SPANNED                                
         ORG   DDCDSFLG+X'00000001'                                             
DDCCNTL  DS    1FL1      CARRIAGE CONTROL - SEE CONST                           
DDCRETPD DS    1FL4      RETENTION PERIOD                                       
         ORG   DDCRETPD                                                         
DDCEXPYR DS    1FL2      EXPDT - YEAR                                           
DDCEXPDY DS    1FL2      EXPDT - ABSOLUTE DAY OF YEAR                           
DDCVOLCT DS    1FL2      MAXIMUM VOL COUNT FOR EXTEND                           
DDCDSNTY DS    1FL2      DSN TYPE -- SEE CONSTANTS                              
*                                                                               
*      ***************************************************************          
*      *                                                             *          
*      * DATA SET SPACE ATTRIBUTES                                   *          
*      *                                                             *          
*      ***************************************************************          
*                                                                               
*                                                                               
DDCSPPRI DS    1FL4      PRIMARY SPACE AMOUNT                                   
DDCSPSEC DS    1FL4      SECONDARY SPACE AMOUNT                                 
DDCDIBLK DS    1FL4      DIRECTORY BLOCKS                                       
DDCAVREC DS    1FL1      AVGREC - M, K, U: SEE CONST                            
DDCREDUC DS    1FL1      Reduce primary or secondary                            
*                                                                               
*      ***************************************************************          
*      *                                                             *          
*      * space by 0-99%. DDCSPRLF                                    *          
*      * and DDCREDUS must be on                                     *          
*      *                                                             *          
*      ***************************************************************          
*                                                                               
*                                                                               
DDCRBIAS DS    1FL1      VSAM Record Access Bias                                
*                                                                               
*      ***************************************************************          
*      *                                                             *          
*      * Dynamic volume count                         @05A                      
*      *                                                             *          
*      ***************************************************************          
*                                                                               
*                                                                               
DDCDVC   DS    1FL1      Dynamic volume count         @05A                      
*                                                                               
*      ***************************************************************          
*      *                                                             *          
*      * REQUIRES DDCRABS                                                       
*      * SEE CONSTANTS                                                          
*      *                                                             *          
*      ***************************************************************          
*                                                                               
*        RESERVE CHARACTER REMOVED                    @05C                      
*                                                                               
*                                                                               
DDCAUNIT DS    1FL4      ALLOCATION UNIT AMOUNT                                 
         DS    1CL04     reserve                                 @L2C           
DDCLRECL DS    1FL4      RECORD LENGTH                                          
*                                                                               
*      ***************************************************************          
*      *                                                             *          
*      * VSAM ATTRIBUTES                                                        
*      *                                                             *          
*      ***************************************************************          
*                                                                               
*                                                                               
DDCCISZ  DS    1FL4      CISIZE FOR KS, ES OR RR                                
DDCFRSP  DS    1CL0004   FREESPACE                                              
         ORG   DDCFRSP                                                          
DDCCIPCT DS    1FL2      CI FREESPACE %                                         
DDCCAPCT DS    1FL2      CA FREESPACE %                                         
DDCSHROP DS    1FL2      VSAM SHARE OPTIONS                                     
         ORG   DDCSHROP                                                         
DDCXREG  DS    1FL1      VSAM XREGION SHARE OPTIONS                             
DDCXSYS  DS    1FL1      VSAM XSYSTEM SHARE OPTIONS                             
DDCVINDX DS    1BL1      VSAM SHARE OPTIONS                                     
         ORG   DDCVINDX                                                         
DDCIMBED EQU   X'80'     1 = IMBED, 0 = NO                                      
DDCREPLC EQU   X'40'     1 = REPLICATE, 0 = NO                                  
         ORG   DDCVINDX+X'00000001'                                             
DDCKLEN  DS    1FL1      VSAM KEY LENGTH                                        
DDCKOFF  DS    1FL2      VSAM KEY OFFSET                                        
DDCCAMT  DS    1FL1      VSAM candidate amount                                  
         DS    1FL1      RESERVED                               @PAC            
*                                                                               
*      ***************************************************************          
*      *                                                             *          
*      * MOUNTABLE DEVICE ATTRIBUTES                                            
*      *                                                             *          
*      ***************************************************************          
*                                                                               
*                                                                               
DDCCOMP  DS    1FL1      COMPACTION TYPE - SEE CONSTANTS                        
DDCMEDIA DS    1FL1      MEDIA TYPE -- SEE CONSTANTS                            
DDCRECTE DS    1FL1      RECORDING TECHNOLOGY --SEE CONSTANTS BELOW             
         DS    1CL0001   RESERVED                                               
*      ***************************************************************          
*      *                                                             *          
*      * RLS SUPPORT                                                            
*      *                                                             *          
*      ***************************************************************          
*                                                                               
*                                                                               
DDCRLS1  DS    1CL0004   RLS SUPPORT                                            
         ORG   DDCRLS1                                                          
DDCBWOTP DS    1FL1      BWO TYPE REQUIRES DDCBWOS                              
*                                                                               
*      ***************************************************************          
*      *                                                             *          
*      * REQUIRES DDCLOGRS                                       @11M           
*      * SEE CONSTANTS                                                          
*      *                                                             *          
*      ***************************************************************          
*                                                                               
*                                                                               
DDCLOGRC DS    1FL1      SPHERE RECOVERABILITY                                  
*                                                                               
*      ***************************************************************          
*      *                                                             *          
*      * REQUIRES DDCSPANS                                       @11M           
*      * SEE CONSTANTS                                                          
*      *                                                             *          
*      ***************************************************************          
*                                                                               
*                                                                               
DDCSPAND DS    1FL1      RECORD SPANS CI ABILITY                                
*                                                                               
*      ***************************************************************          
*      *                                                             *          
*      * REQUIRES DDCLSIDS                                       @11M           
*      *                                                             *          
*      ***************************************************************          
*                                                                               
*                                                                               
DDCFRLOG DS    1FL1      CICSVR FRLOG TYPE                       @L2A           
*                                                                               
*      ***************************************************************          
*      *                                                             *          
*      * REQUIRES DDCFRLGS                                       @L2A           
*      *                                                             *          
*      ***************************************************************          
*                                                                               
*                                                                               
DDCLOGNM DS    1CL0028   LOG STREAM ID                                          
         ORG   DDCLOGNM                                                         
*                                                               6@11D           
DDCLOGLN DS    1FL2      ID LENGTH                                              
DDCLOGID DS    1CL0026   ID                                                     
*                                                                               
*      ***************************************************************          
*      *                                                             *          
*      * DATA CLASS PARAMETERS SPECIFICATION BITS ADDITIONAL                    
*      *                                                             *          
*      ***************************************************************          
*                                                                               
*                                                                               
DDCSPECX DS    0CL0001                                                          
*                                                                               
DDCSPECA DS    1BL1      ADDITIONAL SPECIFICATION FLAGS         @P1C            
*                                                          @11D                 
DDCBWOS  EQU   X'80'     BWO SPECIFIED                                          
DDCLOGRS EQU   X'40'     SPHERE RECOVERABILITY SPEC'D                           
DDCSPANS EQU   X'20'     CI SPAN SPECIFIED                                      
DDCLSIDS EQU   X'10'     LOGSTREAMID SPECIFIED                                  
DDCFRLGS EQU   X'08'     FRLOG SPECIFIED                        @L2A            
DDCFEXTC EQU   X'04'     VSAM EXTENT CONSTRAINT SPEC'D          @10A            
DDCFA2GB EQU   X'02'     RLS above 2GB spcified                 @LFA            
DDCFPSEG EQU   X'01'     Perforname Segmentation specified      @LFA            
*                                                          @11D @P5A            
DDCSPECB DS    1BL1      ADDITIONAL SPECIFICATION FLAGS         @P1C            
*                                                          @11D @L1A            
DDCFKYL1 EQU   X'80'     KEY Label 1                       @PIC @LKA            
DDCFKYC1 EQU   X'40'     KEY Code 1                        @PIC @LKA            
DDCFKYL2 EQU   X'20'     KEY Label 2                       @PIC @LKA            
DDCFKYC2 EQU   X'10'     KEY Code 2                        @PIC @LKA            
DDCFVSP  EQU   X'08'     SMBVSP SPECIFIED                       @LKA            
DDCFSDB  EQU   X'04'     SBD SPECIFIED                     @P9C @L1A            
DDCFOVRD EQU   X'02'     Override JCL specified            @P9C @L1A            
DCDFCAR  EQU   X'01'     CA Reclaim specified                   @LKA            
*                                                          @11D @P5A            
DDCSPECC DS    1BL1      ADDITIONAL SPECIFICATION FLAGS         @L9C            
DDCFATTR EQU   X'80'     EATTR Specifed in DDCEATTR             @L9A            
DDCFLOGR EQU   X'40'     LOGREPLICATE specified                 @LRA            
DDCFRMOD EQU   X'20'     VSAM SMB RMODE31 specified in Dataclas @PHC            
DDCGSRDU EQU   X'10'     Guaranteed Space Reduction             @LUA            
DDCFKLBL EQU   X'08'     DASD Data set key label                @E1A            
*                                                                               
DDCSPECD DS    1BL1      RESERVED                               @L9C            
*                                                          @11D @P5A            
DDCSFLG  DS    1BL1      Space Flag                             @L1A            
*                                                          @11D @L1A            
DDCOVRD  EQU   X'80'     1 = Space Override                     @P2C            
DDCSDB   EQU   X'40'     1 = Force Sys Determined Blocksize     @L1A            
*                                                          @11D @P5A            
*      *********************************************************@11A            
*      *                                                        @11A            
*      * VSAM ATTRIBUTS                                         @11A            
*      *                                                        @11A            
*      *********************************************************@11A            
*                                                               @11A            
DDCVSAM1 DS    0CL0004   VSAM EXTENTION                         @11A            
DDCVBYT1 DS    1CL0001   VSAM BYTE 1                            @11A            
DDCREUSE EQU   X'80'     SPECIFY VSAM CLUSTER IS REUSABLE       @L2A            
DDCSPEED EQU   X'40'     SPECIFY HOW DATA SET TO BE LOADED      @L2A            
DDCEX255 EQU   X'20'     MORE THAN 255 EXTENTS ALLOWED          @11A            
DDCLOGRP EQU   X'10'     0=NOLOGREPLICATE  1=LOGREPLICATE       @LRA            
         DS    1CL0003   Reserved                               @11A            
*                                                                               
*                                                          @P9M @L9A            
DDCEATTR DS    1CL0001   EAS EATTR IN DATACLASS          ] @P9M @L9A            
*                        REQUIRES DDCFATTR, SEE CONSTANTS  @P9M @L9A            
DDCCT    DS    1CL0001   COMPRESSION TYPE                       @L2A            
*                        0 = GENERIC    1 = TAILORED            @L2A            
*                                                               @L2A            
DDCDSCF  DS    1CL0001   Data Set CF Cache value                @L2A            
*                        0 = ALL  2 = UPDATEONLY  3 = NONE      @L2A            
DDCRBYTE DS    1CL0001   RLS BYTE                               @LFC            
DDCA2GB  EQU   X'80'     RLS above 2GB Bar 0 = NO  1 = YES      @LFA            
DDCRECLM EQU   X'40'     CA RECLAIM 0 = Enable(D) 1 = Disable   @LKA            
*                                                               @LKA            
DDCBLKLM DS    1CL8      BLKSILMT-32760 OR HIGER                @L2A            
         ORG   DDCBLKLM                                         @L2A            
         DS    1CL4      Reserve for future expansion           @L2A            
DDCBSZLM DS    1CL4      32760 or higher                        @L2A            
*                                                                               
DDCTAPE1 DS    0CL4      Tape Support Use                       @LFA            
DDCPSCA  DS    1CL0001   Scaling option value YES NO or BLANK   @LFA            
DDCPSEG  DS    1CL0001   Segmentation value YES NO or BLANK     @LFA            
         DS    1CL0002   RESERVED                               @LFA            
*                                                                               
         DS    1CL0003   RESERVED                               @LFA            
DDCVSP   DS    0XL0004   SMB VSP fields                         @LKA            
DDCVSPU  DS    1XL0001   Unit for VSP value in CHAR             @LKA            
DDCVSPUK EQU   X'80'     Unit in KB                             @LKA            
DDCVSPUM EQU   X'40'     Unit in MB                             @LKA            
DDCVSPV  DS    1XL0003   VSP value                              @LKA            
*                                                               @PID            
DDCKYLB1 DS    0C        Key Label 1 definitions                @LKA            
DDCKLBL1 DS    XL2       Key Label 1 length field               @LKA            
DDCKLBN1 DS    CL64      Key Label 1 name field                 @LKA            
DDCKYCD1 DS    XL1       Key Label 1 encoding code              @LKA            
         DS    XL1       filler for byte skipping               @LKA            
DDCKYLB2 DS    0C        Key Label 2 definitions                @LKA            
DDCKLBL2 DS    XL2       Key Label 2 length field               @LKA            
DDCKLBN2 DS    CL64      Key Label 2 name field                 @LKA            
DDCKYCD2 DS    XL1       Key Label 2 encoding code              @LKA            
         DS    XL2       filler for byte skipping               @LSC            
DDCRMODE DS    1FL1      VSAM SMB RMODE31 for DCDRMODE          @LSA            
DDCDKYLB DS    0C        DASD Data set Key label                @E1A            
DDCDKLBL DS    XL2       Data Set Key Label length              @E1A            
DDCDKLBN DS    CL64      Name of the DASD Data Set Key Label    @E1A            
*                                                                               
         DS    1CL0028   RESERVED                               @E1C            
DDCDATAE DS    0C        END OF DDCDATA                                         
DDCDATA_LEN EQU *-DDCDATA                                                       
         ORG   ,                                                                
*                                                               @L8A            
.DCDCSKP ANOP                                                   @L8A            
         AIF ('&TYPE' EQ 'ALL' OR '&TYPE' EQ 'SC' ).DCSC        @L8A            
         AGO .DCSCSKP                                           @L8A            
.DCSC    ANOP                                                   @L8A            
* ********************************************************************          
* * STORAGE CLASS CONSTRUCT INFORMATION (RECORD TYPE 'SC')                      
* ********************************************************************          
*                                                                               
*                                                                               
         ORG   DCUDATA                                                          
DSCDATA  DS    0X                                                               
DSCNMFLD DS    1CL0032   SPACE FOR NAME AND LENGTH                              
         ORG   DSCNMFLD                                                         
DSCNMLEN DS    1FL2      LENGTH OF NAME                                         
DSCNAME  DS    1CL0030   NAME OF STORAGE CLASS                                  
DSCUSER  DS    1CL0008   USERID OF LAST UPDATER                                 
DSCDATE  DS    1CL0010   DATE OF LAST UPDATE                                    
         DS    1CL0002   RESERVED                                               
DSCTIME  DS    1CL0008   TIME OF LAST UPDATE                                    
DSCDESC  DS    1CL0120   DESCRIPTION                                            
*                                                                               
*      ***************************************************************          
*      *                                                             *          
*      * STORAGE CLASS FLAGS                                                    
*      *                                                             *          
*      ***************************************************************          
*                                                                               
*                                                                               
DSCFLAGS DS    1BL1                                                             
         ORG   DSCFLAGS                                                         
DSCDFGSP EQU   X'80'     GUARANTEED SPACE 1=YES,0=NO                            
DSCDFAVL EQU   X'40'     AVAILABILITY, 1=SEE DSCAVAIL 0=STANDARD       *        
                         (DEFAULT)                                              
DSCFDIRR EQU   X'20'     DIRECT RESPONSE TIME OBJECT, 0=DON'T CARE,    *        
                         1=SEE DSCDIRR                                          
DSCFDIRB EQU   X'10'     DIRECT BIAS, 0= DON'T CARE 1= SEE DSCDIRB              
DSCFSEQR EQU   X'08'     SEQ. RESPONSE TIME OBJECTIVE, 0=DON'T CARE,   *        
                         1=SEE DSCSEQR                                          
DSCFSEQB EQU   X'04'     SEQ. BIAS, 0= DON'T CARE 1= SEE DSCSEQB                
DSCSYNCD EQU   X'02'     SYNCDEV, 1 = YES, 0 = NO                               
DSCFIAD  EQU   X'01'     1 = INITIAL ACCESS RESPONSE                            
         ORG   DSCFLAGS+X'00000001'                                             
DSCFLAG2 DS    1BL1                                                             
         ORG   DSCFLAG2                                                         
DSCDFACC EQU   X'80'     ACCESSIBILITY,1=SEE DSCACCES                  *        
                         0=DEFAULT=CONTINUOUS PREFERRED                         
DSCDFSDR EQU   X'40'     STRIPING SUSTAINED DATA RATE 0=NOT            *        
                         SPECD,1=SEE DSCSTSDR                                   
DSCFDCFW EQU   X'20'     Direct CF weight specified: 1 = YES 0 = NO             
DSCFSCFW EQU   X'10'     Sequential weight specified: 1 = YES 0 = NO            
DSCVERSP EQU   X'08'     ACC Specified 0=default 1=see DSCVERSN   @08A          
DSCBUSP  EQU   X'04'     ACC backup 0=default 1=see DSCBAKUP      @08A          
DSCDSSEP EQU   X'02'     Data set Separation 0=perform 1=bypass   @08A          
DSCTIERS EQU   X'01'     Muti-tier specified - see DSCTIER        @08A          
         ORG   DSCFLAG2+X'00000001'                                             
DSCVERSN DS    1FL1      ACC Version Parm see constants YES NO BLK@08A          
DSCBAKUP DS    1FL1      ACC Backup Parm see constants YES NO BLK @08C          
*                                                                               
*      ***************************************************************          
*      *                                                             *          
*      * STORAGE CLASS ATTRIBUTES                                               
*      *                                                             *          
*      ***************************************************************          
*                                                                               
*                                                                               
DSCAVAIL DS    1FL1      AVAILABILITY OPTIONS                                   
DSCDIRB  DS    1FL1      DIRECT BIAS - SEE CONSTANTS                            
DSCSEQB  DS    1FL1      SEQ. BIAS - SEE CONSTANTS                              
DSCACCES DS    1FL1      ACCESSIBILITY - SEE CONSTS.                            
DSCIACDL DS    1FL4      INITIAL ACCESS RESPONSE SEC                            
DSCDIRR  DS    1FL4      MICROSECOND RESPONSE TIME OBJECTIVE -- DIRECT          
DSCSEQR  DS    1FL4      MICROSECOND RESPONSE TIME OBJECTIVE --        *        
                         SEQUENTIAL                                             
DSCSTSDR DS    1FL4      STRIPING SUSTAINED DATA RATE                           
DSCCCHST DS    1CL0032   Cache Set Name                                         
         ORG   DSCCCHST                                                         
DSCCSLEN DS    1FL2      Cache Set Name Length                                  
DSCCSNAM DS    1CL0030   Cache Set Name value                                   
DSCDIRCW DS    1FL2      Direct CF weight                                       
DSCSEQCW DS    1FL2      Sequential CF weight                                   
DSCFLAG3 DS    1CL1      Additional flags                        @L5A           
DSCTIER  EQU   X'80'     MULTI-TIER SC (1) or not (0)            @L5A           
DSCPAVS  EQU   X'40'     PAV specified 1=see DSCPAV 0=default    @08A           
DSCFOLS  EQU   X'20'     OAM Sublevel  1=see DSCSTOSL 0=default  @08A           
DSCFDCLS EQU   X'08'     Disconnect Sphere at CLOSE specified    @LNA           
DSCPAV   DS    1FL1      Parallel Access Volume value            @08A           
DSCSTOSL DS    1FL1      OAM Sublevel value                      @08A           
DSCVFLG2 DS    CL1       VSAM Flag2                              @LNA           
DSCDCLS  EQU   X'80'     Disconnect Sphere @ CLOSE 1=YES 0=NO    @LNA           
DSCCMMFT DS    1FL1      CMM Flags                               @H1A           
DSCHLERD EQU   X'80'     Eligible for zHyperLink reads           @H1A           
DSCHLEWR EQU   X'40'     Eligible for zHyperLink writes          @H1A           
         DS    1CL0011   RESERVED                                @H1C           
DSCDATAE DS    0C        END OF DSCDATA                                         
DSCDATA_LEN EQU *-DSCDATA                                                       
         ORG   ,                                                                
*                                                                @L8A           
.DCSCSKP ANOP                                                    @L8A           
         AIF ('&TYPE' EQ 'ALL' OR '&TYPE' EQ 'MC' ).DCMC         @L8A           
         AGO .DCMCSKP                                            @L8A           
.DCMC    ANOP                                                    @L8A           
*                                                                               
* ********************************************************************          
* * MANAGEMENT CLASS CONSTRUCT INFORMATION (RECORD TYPE 'MC')                   
* ********************************************************************          
*                                                                               
*                                                                               
         ORG   DCUDATA                                                          
DMCDATA  DS    0X                                                               
DMCNMFLD DS    1CL0032   SPACE FOR NAME AND LENGTH                              
         ORG   DMCNMFLD                                                         
DMCNMLEN DS    1FL2      LENGTH OF NAME                                         
DMCNAME  DS    1CL0030   NAME OF MANAGEMENT CLASS                               
DMCUSER  DS    1CL0008   USERID OF LAST UPDATER                                 
DMCDATE  DS    1CL0010   DATE OF LAST UPDATE                                    
         DS    1CL0002   RESERVED                                               
DMCTIME  DS    1CL0008   TIME OF LAST UPDATE                                    
DMCDESC  DS    1CL0120   DESCRIPTION                                            
*                                                                               
*      ***************************************************************          
*      *                                                             *          
*      * GENERAL SPECIFICATION FLAGS                                            
*      *                                                             *          
*      ***************************************************************          
*                                                                               
*                                                                               
DMCSPEC1 DS    1BL1      ATTRIBUTE SPECIFIED FLAGS: 1= SPECIFIED                
         ORG   DMCSPEC1                                                         
DMCFBVER EQU   X'80'     DMCBKVS SPECIFIED FLAG                                 
DMCFBVRD EQU   X'40'     DMCBVRD SPECIFIED FLAG                                 
DMCFRBK  EQU   X'20'     DMCBKDY SPECIFIED FLAG                                 
DMCFRNP  EQU   X'10'     DMCBKNP SPECIFIED FLAG                                 
DMCFEXDT EQU   X'08'     DMCEXDAT SPECIFIED FLAG                                
DMCFEXDY EQU   X'04'     DMCEXPDY SPECIFIED FLAG                                
DMCFPRDY EQU   X'02'     DMCPRDY SPECIFIED FLAG                                 
         ORG   DMCSPEC1+X'00000001'                                             
DMCSPEC2 DS    1BL1      ATTRIBUTE SPECIFIED FLAGS: 1= SPECIFIED                
         ORG   DMCSPEC2                                                         
DMCFL1DY EQU   X'80'     DMCL1DY SPECIFIED FLAG                                 
DMCFRLMG EQU   X'40'     DMCRLOMG SPECIFIED FLAG                                
DMCFPELE EQU   X'20'     DMCPELEM SPECIFIED FLAG                                
DMCFBKFQ EQU   X'10'     DMCBKFQ SPECIFIED FLAG                                 
DMCFCTSR EQU   X'08'     DMCCTSRL PECIFIED FLAG                 @X1A            
DMCFCTCP EQU   X'04'     DMCCTCPY PECIFIED FLAG                 @X1A            
*                                                                               
*      ***************************************************************          
*      *                                                             *          
*      * PARTIAL RELEASE CRITERIA                                               
*      *                                                             *          
*      ***************************************************************          
*                                                                               
*                                                                               
         ORG   DMCSPEC2+X'00000001'                                             
DMCRLF   DS    1BL1                                                             
         ORG   DMCRLF                                                           
DMCPREL  EQU   X'80'     RELEASE 1 = YES, 0 = NO                                
DMCPRCN  EQU   X'40'     CONDITIONAL PARTREL                                    
DMCPRIM  EQU   X'20'     IMMEDIATE VALUE FOR REL                                
         ORG   DMCRLF+X'00000001'                                               
         DS    1CL0001   RESERVED                                               
*                                                                               
*      ***************************************************************          
*      *                                                             *          
*      * GENERATION DATA GROUP CRITERIA                                         
*      *                                                             *          
*      ***************************************************************          
*                                                                               
*                                                                               
DMCGDGFL DS    1BL1      GDG ATTRIBUTE FLAGS                                    
         ORG   DMCGDGFL                                                         
DMCRLOMG EQU   X'80'     MIGRATE OR EXPIRE ROLLED OFF GDS, 1=MIGRATE,  *        
                         0=EXPIRE                                               
         ORG   DMCGDGFL+X'00000001'                                             
         DS    1CL0001   RESERVED                                               
DMCPELEM DS    1FL2      NUM GDG ELEMENTS ON PRIMARY                            
*                                                                               
*      ***************************************************************          
*      *                                                             *          
*      * DATA SET EXPIRATION CRITERIA                                           
*      *                                                             *          
*      ***************************************************************          
*                                                                               
*                                                                               
DMCEXPF  DS    1BL1      FLAGS                                                  
         ORG   DMCEXPF                                                          
DMCARNOL EQU   X'80'     DMCRDARC IS NOLIMIT = 1                                
         ORG   DMCEXPF+X'00000001'                                              
DMCEXPAC DS    1FL1      EXPIRE ACTION: SEE CONST                               
DMCRDARC DS    1FL2      RETAIN DAYS ARCHIVE COPY                               
*                                                                               
*      ***************************************************************          
*      *                                                             *          
*      * DATA SET RETENTION CRITERIA                                            
*      *                                                             *          
*      ***************************************************************          
*                                                                               
*                                                                               
DMCRETF  DS    1BL1      DATA SET RETENTION FLAGS                               
         ORG   DMCRETF                                                          
DMCDYNOL EQU   X'80'     1=EXPIRE AFTER DAYS= NOLIMIT ELSE 0 AND SEE   *        
                         DMCEXPDY                                               
DMCDTNOL EQU   X'40'     1=EXPIRE AFTER DATE= NOLIMIT ELSE 0 AND SEE   *        
                         DMCEXDAT                                               
         ORG   DMCRETF+X'00000001'                                              
DMCRFMT  DS    1FL1      Format used for DMCEXDAT -- DATE OR DAYS: SEE *        
                         CONSTANTS                                              
         DS    1CL0002   RESERVED                                               
DMCEXPDY DS    1FL4      EXPIRE AFTER DAYS NO USE                               
DMCEXDAT DS    1FL4      EXPIRE DAYS SINCE CREATE                               
         ORG   DMCEXDAT                                                         
DMCEYEAR DS    1FL2      EXPIRE DATE SINCE CREATE                               
DMCEDAY  DS    1FL2      SEE DMCRFMT FOR FORMAT                                 
*                                                                               
*      ***************************************************************          
*      *                                                             *          
*      * DATA SET MIGRATION CRITERIA                                            
*      *                                                             *          
*      ***************************************************************          
*                                                                               
*                                                                               
DMCMIGF  DS    1BL1      DATA SET MIGRATION FLAGS                               
         ORG   DMCMIGF                                                          
DMCL2LIM EQU   X'80'     MIN DAYS for Cloud migration 0=NOLIMIT ELSE   *        
                         SEE DMCL2DY                            @M1A            
DMCL1NOL EQU   X'20'     MIN DAYS ON LEVEL 1/LAST USE, 1=NOLIMIT ELSE  *        
                         SEE DMCL1DY                                            
         ORG   DMCMIGF+X'00000001'                                              
         DS    1CL0001   RESERVED                                               
DMCPRDY  DS    1FL2      MIN DAYS ON PRIM/LAST USE                              
DMCL1DY  DS    1FL2      MIN DAYS ON LVL 1/LAST USE                             
DMCCMAU  DS    1FL1      COMMAND OR AUTO MIGRATE -- SEE CONSTANTS      *        
                         BELOW                                                  
         DS    1CL0001   RESERVED                                               
*                                                                               
*      ***************************************************************          
*      *                                                             *          
*      * DATA SET BACKUP CRITERIA                                               
*      *                                                             *          
*      ***************************************************************          
*                                                                               
*                                                                               
DMCBKFLG DS    1BL1      BACKUP FLAGS                                           
         ORG   DMCBKFLG                                                         
DMCRBNOL EQU   X'80'     1=>RETAIN DAYS ONLY BACKUP VERS= NOLIMIT.     *        
                         0=>SEE DMCBKNP FOR DAYS TO KEEP ONLY BACKUP            
DMCNPNOL EQU   X'40'     1=>RETAIN DAYS EXTRA BACKUP VERS = NOLIMIT.   *        
                         0=>SEE DMCBKDY FOR DAYS TO KEEP EXTRA BACKUP           
DMCAUTBK EQU   X'10'     1=AUTO BACKUP ALLOWED                                  
DMCCPYTF EQU   X'08'     COPY TECHNIQUE, 1=SEE DMCCPYTC                *        
                         0=DEFAULT=STANDARD                                     
         ORG   DMCBKFLG+X'00000001'                                             
         DS    1CL0003   RESERVED                                               
DMCBKFQ  DS    1FL2      BACKUP FREQUENCY                                       
DMCBKVS  DS    1FL2      NUMBER OF BACKUP VERSIONS                              
DMCBVRD  DS    1FL2      NUM OF VERSIONS: DS DELETED                            
DMCBKDY  DS    1FL2      DAYS TO KEEP BACKUP VERSION                            
DMCBKNP  DS    1FL2      DAYS TO KEEP ONLY BACKUP                               
DMCBADU  DS    1FL1      ALLOW ADMIN OR USER BACKUP -- SEE CONSTANTS   *        
                         BELOW                                                  
DMCCPYTC DS    1FL1      COPY TECHNIQUE - SEE CONSTANTS                         
DMCBKUDC DS    1CL0008   BACKUP DESTINATION CLASS                               
*                                                                               
*      ***************************************************************          
*      *                                                             *          
*      * MAXIMUM RETENTION CRITERIA                                             
*      *                                                             *          
*      ***************************************************************          
*                                                                               
*                                                                               
DMCMRETF DS    1BL1      MAXIMUM RETENTION FLAGS                                
         ORG   DMCMRETF                                                         
DMCRPNOL EQU   X'80'     RETPD (RETAIN PD) 1=NOLIMIT ELSE SEE DMCMRTDY          
         ORG   DMCMRETF+X'00000001'                                             
*                                                               @LLD            
DMCMRTDY DS    1FL3      MAXIMUM DAYS TO RETAIN                 @LLC            
*                                                                               
*      ***************************************************************          
*      *                                                             *          
*      * CLASS TRANSITION CRITERIA                                              
*      *                                                             *          
*      ***************************************************************          
*                                                                               
*                                                                               
DMCTSCR  DS    1BL1      TIME SINCE CREATION FLAGS.                             
         ORG   DMCTSCR                                                          
DMCTCYR  EQU   X'80'     YEARS SPECIFIED.                                       
DMCTCMN  EQU   X'40'     MONTHS SPECIFIED.                                      
DMCTCDY  EQU   X'20'     DAYS SPECIFIED.                                        
         ORG   DMCTSCR+X'00000001'                                              
DMCTSLU  DS    1BL1      TIME SINCE LAST USED FLAGS.                            
         ORG   DMCTSLU                                                          
DMCTSYR  EQU   X'80'     YEARS SPECIFIED.                                       
DMCTSMN  EQU   X'40'     MONTHS SPECIFIED.                                      
DMCTSDY  EQU   X'20'     DAYS SPECIFIED.                                        
         ORG   DMCTSLU+X'00000001'                                              
DMCPERD  DS    1BL1      PERIODIC FLAGS.                                        
         ORG   DMCPERD                                                          
DMCPEMN  EQU   X'80'     MONTHLY SPECIFIED.                                     
DMCPEQD  EQU   X'40'     QUARTERLY ON DAY SPEC.                                 
DMCPEQM  EQU   X'20'     QUARTERLY ON MONTH SPEC.                               
DMCPEYD  EQU   X'10'     YEARLY ON DAY SPEC.                                    
DMCPEYM  EQU   X'08'     YEARLY IN MONTH SPEC.                                  
DMCFIRST EQU   X'04'     FIRST DAY OF PERIOD SPEC.                              
DMCLAST  EQU   X'02'     LAST DAY OF PERIOD SPEC.                               
         ORG   DMCPERD+X'00000001'                                              
         DS    1CL0001   RESERVED.                                              
DMCVSCR  DS    1CL0006   TIME SINCE CREATION VALUES                             
         ORG   DMCVSCR                                                          
DMCVSCY  DS    1FL2      TIME SINCE CREATION YEARS                              
DMCVSCM  DS    1FL2      TIME SINCE CREATION MONTHS                             
DMCVSCD  DS    1FL2      TIME SINCE CREATION DAYS                               
DMCVSLU  DS    1CL0006   TIME SINCE LAST USED                                   
         ORG   DMCVSLU                                                          
DMCVSUY  DS    1FL2      TIME SINCE LAST USED YEARS                             
DMCVSUM  DS    1FL2      TIME SINCE LAST USED MONTHS                            
DMCVSUD  DS    1FL2      TIME SINCE LAST USED DAYS                              
DMCVPRD  DS    1FL2      PERIODIC VALUES                                        
DMCVPMD  DS    1FL2      PERIODIC MONTHLY ON DAY                                
DMCVPQT  DS    1CL0004   PERIODIC QUARTERLY VALUES.                             
         ORG   DMCVPQT                                                          
DMCVPQD  DS    1FL2      PERIODIC QUARTERLY ON DAY                              
DMCVPQM  DS    1FL2      PERIODIC QUARTERLY IN MONTH                            
DMCVPYR  DS    1CL0004   PERIODIC YEARLY VALUES.                                
         ORG   DMCVPYR                                                          
DMCVPYD  DS    1FL2      PERIODIC YEARLY ON DAY                                 
DMCVPYM  DS    1FL2      PERIODIC YEARLY IN MONTH                               
         DS    1CL0016   RESERVED                                               
DMCCTSRL DS    1FL2      HSM Class Transition Serialization Error @X1A          
DMCCTCPY DS    1FL2      HSM Class Transition Copy Technique      @X1A          
DMCCL2DY DS    1FL2      Min days or last to move to cloud        @M1A          
DMCCLOUD DS    1CL0032   Cloud name                               @M1A          
         ORG   DMCCLOUD                                           @M1A          
DMCCLLEN DS    1FL2      Length of cloud name                     @M1A          
DMCCLNAM DS    1CL30     Cloud name for migration                 @M1A          
         DS    1CL0002   For alignment                            @M1A          
DMCSZLTE DS    F         Data size threshold less than or equal   @PIC          
DMCSZGT  DS    F         Data size threshold greater than         @PIC          
DMCACLTE DS    AL1       Action taken after DMCSZLTE threshold met@PIC          
DMCACGT  DS    AL1       Action taken after DMCSZGT threshold met @PIC          
         DS    1CL0402   Reserved                                 @M1A          
DMCDATAE DS    0C        END OF DMCDATA                                         
DMCDATA_LEN EQU *-DMCDATA                                                       
         ORG   ,                                                                
*                                                                @L8A           
.DCMCSKP ANOP                                                    @L8A           
         AIF ('&TYPE' EQ 'ALL' OR '&TYPE' EQ 'BC' ).DCBC         @L8A           
         AGO .DCBCSKP                                            @L8A           
.DCBC    ANOP                                                    @L8A           
*                                                                               
* ********************************************************************          
* * BASE CONFIGURATION INFORMATION (RECORD TYPE 'BC')                           
* ********************************************************************          
*                                                                               
*                                                                               
DCUBCVER EQU   2         Current BC record version                @L4A          
         ORG   DCUDATA                                                          
DBCDATA  DS    0X                                                               
         DS    1CL0032   RESERVED                                               
DBCUSER  DS    1CL0008   USERID OF LAST UPDATER                                 
DBCDATE  DS    1CL0010   DATE OF LAST UPDATE                                    
         DS    1CL0002   RESERVED                                               
DBCTIME  DS    1CL0008   TIME OF LAST UPDATE                                    
DBCDESC  DS    1CL0120   DESCRIPTION                                            
*                                                                               
*      ***************************************************************          
*      *                                                             *          
*      * BASE CONFIGURATION FLAGS                                               
*      *                                                             *          
*      ***************************************************************          
*                                                                               
*                                                                               
DBCFLAGS DS    1BL1      Reserved                                               
DBCFLGDC DS    1BL1      DCOLLECT flags                                         
         ORG   DBCFLGDC                                                         
DBC32NAM EQU   X'80'     0 = use DBCFSYSN                                       
*                                                                               
*      ***************************************************************          
*      *                                                             *          
*      * 1 = use DBCSYSDT                                                       
*      *                                                             *          
*      ***************************************************************          
*                                                                               
*                                                                               
         ORG   DBCFLGDC+X'00000001'                                             
         DS    1CL0002   RESERVED                                               
*                                                                               
*      ***************************************************************          
*      *                                                             *          
*      * BASE CONFIGURATION DEFAULTS                                            
*      *                                                             *          
*      ***************************************************************          
*                                                                               
*                                                                               
DBCDEFMC DS    1CL0032   DEFAULT MANAGEMENT CLASS                               
         ORG   DBCDEFMC                                                         
DBCMCLEN DS    1FL2      DEFAULT MC LENGTH OF NAME                              
DBCMCNAM DS    1CL0030   DEFAULT MANAGEMENT CLASS NAME                          
DBCDGEOM DS    1CL0008   DEFAULT DEVICE GEOMETRY                                
         ORG   DBCDGEOM                                                         
DBCTRKSZ DS    1FL4      TRACK SIZE IN BYTES                                    
DBCCYLCP DS    1FL4      CYL CAPACITY (TRK/CYL)                                 
DBCDUNIT DS    1CL0008   DEFAULT UNIT                                           
*                                                                               
*      ***************************************************************          
*      *                                                             *          
*      * BASE CONFIGURATION INFORMATION                                         
*      *                                                             *          
*      ***************************************************************          
*                                                                               
*                                                                               
DBCSRST  DS    1CL0008   SMS RESOURCE STATUS TOKEN                              
DBCSTAT  DS    1FL1      DATA SET STATUS -- SEE CONST                           
         DS    1CL0003   RESERVED                                               
DBCFSYSN DS    1CL0008   SYSTEM NAMES                                           
         ORG   DBCFSYSN+X'00000040'                                             
DBCSCDSN DS    1CL0044   FOR ACDS ONLY: NAME OF SCDS FROM WHICH IT WAS *        
                         ACTIVATED                                              
*                                                                               
*      ***************************************************************          
*      *                                                             *          
*      * SYSTEM FEATURES                                                        
*      *                                                             *          
*      ***************************************************************          
*                                                                               
*                                                                               
DBCSFEAT DS    1CL0002   SUPPORTED SYSTEM FEATURES                              
         ORG   DBCSFEAT+X'00000010'                                             
DBCSYSNT DS    1FL1      TYPE OF SYSTEM NAMES - SEE CONSTANTS                   
         ORG   DBCSYSNT+X'00000008'                                             
DBCSYSDT DS    1CL0016   System related data                                    
         ORG   DBCSYSDT                                                         
DBCSYSNM DS    1CL0008   System/group name                                      
DBCSYSFT DS    1CL0002   Supported system features                              
         DS    1CL0002   Reserved                                               
DBCSNMTY DS    1FL1      System name type for this entry see constants          
         DS    1CL0003   Reserved                                               
         ORG   DBCSYSDT+X'00000200'                                             
         DS    1CL0016   RESERVED                                               
DBCSEPNL DS    1FL2      DS Sep Profile Name(Member) length      @L@A           
DBCSEPNM DS    1CL0054   DS Sep Profile Name(Member)             @L@A           
DBCDATAE DS    0C        END OF DBCDATA                                         
DBCDATA_LEN EQU *-DBCDATA                                                       
         ORG   ,                                                                
*                                                                @L8A           
.DCBCSKP ANOP                                                    @L8A           
         AIF ('&TYPE' EQ 'ALL' OR '&TYPE' EQ 'SG' ).DCSG         @L8A           
         AGO .DCSGSKP                                            @L8A           
.DCSG    ANOP                                                    @L8A           
*                                                                               
* ********************************************************************          
* * STORAGE GROUP CONSTRUCT INFORMATION (RECORD TYPE 'SG')                      
* ********************************************************************          
*                                                                               
*                                                                               
DCUSGVER EQU   2         Current SG version                      @02C           
         ORG   DCUDATA                                                          
DSGDATA  DS    0X                                                               
DSGNMFLD DS    1CL0032   SPACE FOR NAME AND LENGTH                              
         ORG   DSGNMFLD                                                         
DSGNMLEN DS    1FL2      LENGTH OF NAME                                         
DSGNAME  DS    1CL0030   NAME OF DATA CLASS                                     
DSGUSER  DS    1CL0008   USERID OF LAST UPDATER                                 
DSGDATE  DS    1CL0010   DATE OF LAST UPDATE                                    
         DS    1CL0002   RESERVED                                               
DSGTIME  DS    1CL0008   TIME OF LAST UPDATE                                    
DSGDESC  DS    1CL0120   DESCRIPTION                                            
*                                                                               
*      ***************************************************************          
*      *                                                             *          
*      * STORAGE GROUP FLAG INFORMATION                                         
*      *                                                             *          
*      ***************************************************************          
*                                                                               
*                                                                               
DSGFLAGS DS    1CL0001   FLAGS AND RESERVED                                     
         ORG   DSGFLAGS                                                         
DSGFABUP EQU   X'80'     HSM AUTO BACKUP, 1=YES,0=NO                            
DSGFAMIG EQU   X'40'     AUTO MIGRATION, 1=YES, 0=NO                            
DSGFADMP EQU   X'20'     AUTO DUMP, 1 = YES, 0 = NO                             
DSGFTHRS EQU   X'10'     THRESHOLDS SPECIFIED: 1 = YES, 0 = NO                  
DSGFGBKU EQU   X'08'     GUARANTEED BACKUP FREQ. SPECIFIED, 1=YES,     *        
                         0=NO                                                   
DSGGBNOL EQU   X'04'     GUARANTEED BACKUP FREQ. 1=NOLIMIT, 0=SEE      *        
                         DSGGBKUF                                               
DSGFIMIG EQU   X'02'     INTERVAL MIGRATION 1 = YES 0 = NO                      
DSGFPSM  EQU   X'01'     PRIMARY SPACE MGMT                                     
*                                                                               
*      ***************************************************************          
*      *                                                             *          
*      * 1 = YES 0 = NO                                                         
*      *                                                             *          
*      ***************************************************************          
*                                                                               
*                                                                               
         ORG   DSGFLAGS+X'00000001'                                             
DSGFLGDC DS    1BL1      RESERVED                                               
         ORG   DSGFLGDC                                                         
DSG32NAM EQU   X'80'     0 = Use DSGFPRST, DSGCNFRM                             
*                                                                               
*      ***************************************************************          
*      *                                                             *          
*      * 1 = Use DSGSSTAT                                                       
*      *                                                             *          
*      ***************************************************************          
*                                                                               
*                                                                               
         ORG   DSGFLGDC+X'00000001'                                             
*                                                                               
         DS    1CL0002   RESERVED                          2@20D @20C           
*                                                                               
*      ***************************************************************          
*      *                                                             *          
*      * STORAGE GROUP ATTRIBUTES                                               
*      *                                                             *          
*      ***************************************************************          
*                                                                               
*                                                                               
DSGFTYPE DS    1FL1      STORAGE GROUP TYPE -- SEE CONSTANTS BELOW              
DSGFHTHR DS    1FL1      HIGH THRESHOLD - 0 TO 99 %                             
DSGFLTHR DS    1FL1      LOW THRESHOLD - 0 TO 99 %                              
         DS    1CL0001   RESERVED                                               
DSGFVMAX DS    1FL4      VIO MAX DATA SET SIZE                                  
DSGFVUNT DS    1CL0004   VIO UNIT TYPE                                          
DSGDMPCL DS    1CL0008   DUMP CLASSES FOR AUTODUMP                              
         ORG   DSGDMPCL+X'00000028'                                             
DSGFPRST DS    1CL0001   STATUS BY PROCESSOR                                    
         ORG   DSGFPRST                                                         
DSGSTAT  DS    1FL1      STATUS                                                 
         ORG   DSGFPRST+X'00000008'                                             
DSGABSYS DS    1CL0008   AUTO BACKUP SYSTEM                                     
DSGADSYS DS    1CL0008   AUTO DUMP SYSTEM                                       
DSGAMSYS DS    1CL0008   AUTO MIGRATE SYSTEM                                    
DSGCNFRM DS    1CL0001   CONFIRMED SMS STATUS FOR THIS STORAGE GROUP   *        
                         -- SEE CONSTANT                                        
         ORG   DSGCNFRM                                                         
DSGCSMSS DS    1FL1      CONFIRMED SMS STATUS                                   
         ORG   DSGCNFRM+X'00000008'                                             
DSGGBKUF DS    1FL4      GUARANTEED BACKUP FREQ.                                
*                                                                               
*      ***************************************************************          
*      *                                                             *          
*      * STORAGE GROUP OAM ATTRIBUTES                                           
*      *                                                             *          
*      ***************************************************************          
*                                                                               
*                                                                               
DSGTBLGR DS    1CL0008   OAM TABLE SPACE ID GROUPNN              @12C           
DSGOAMFL DS    1BL1      OAM FLAGS                                              
         ORG   DSGOAMFL                                                         
DSGFCYS  EQU   X'80'     OAM CYCLE START/END GIVEN                              
DSGFVLFT EQU   X'40'     VOLUME FULL THRESHOLD BIT                              
DSGFDRST EQU   X'20'     DRIVE START THRESHOLD BIT                              
DSGVFFER EQU   X'10'     VOLUME FULL@WRITE ERR GIVEN                            
DSGVFERR EQU   X'08'     VOLUME FULL@WRITE ERROR BIT                            
DSGFRETP EQU   X'04'     Retention protection                    @LFA           
DSGFDELP EQU   X'02'     Deletion protection                     @LFA           
         ORG   DSGOAMFL+X'00000001'                                             
         DS    1CL0001   RESERVED                                               
DSGCYLST DS    1FL1      OAM CYCLE START TIME (HRS)                             
DSGCYLED DS    1FL1      OAM CYCLE END TIME (HRS)                               
DSGVOLFT DS    1FL2      VOLUME FULL THRESHOLD BIT                              
DSGDRVST DS    1FL2      DRIVE START THRESHOLD BIT                              
DSGOLIBS DS    1CL0032   OPTICAL LIBRARIES.                                     
         ORG   DSGOLIBS                                                         
DSGOLBNL DS    1FL2      OPTICAL LIBRARY NAME LENGTH                            
DSGOLBNM DS    1CL0008   OPTICAL LIBRARY NAME                                   
         DS    1CL0022   RESERVED                                               
         ORG   DSGOLIBS+X'00000100'                                             
DSGSSTAT DS    1CL0008   Status by processor                                    
         ORG   DSGSSTAT                                                         
DSGSYSST DS    1FL1      Requested system status                                
DSGCNSMS DS    1FL1      Confirmed SMS status                                   
         DS    1CL0006   Reserved                                               
         ORG   DSGSSTAT+X'00000100'                                             
         DS    1CL0016   RESERVED                                               
DSGOFLOW DS    1FL1      Overflow                                @L4A           
DSGEXNLN DS    1FL2      Length of extend name                   @L4A           
DSGEXNM  DS    1CL0030   Extend SG Name                          @L4A           
         DS    1CL0002   Reserved                                @PLC           
DSGFLAG2 DS    1BL1      SG INFORMATION FLAG #2                  @PLA           
         ORG   DSGFLAG2                                          @PLA           
DSGFLOWF EQU   X'80'     Overflow SG specified ?                 @PLA           
DSGEXNMF EQU   X'40'     EXTENDED SG speicfied ?                 @PLA           
DSGEAVBP EQU   X'10'     BreakPointValue specified ?             @PLA           
         ORG   DSGFLAG2+X'00000001'                              @PLA           
DSGSBKPT DS    1FL4      EAV BREAKPOINT VALUE                    @L6A           
DSGSHTHR DS    1FL2      EAV High Threshold Percent              @18C           
DSGSLTHR DS    1FL2      EAV Low Threshold Percent               @18C           
DSGRERV  DS    1CL0024   Reserved                                @LXA           
DSGTOTAP DS    1FL1      Total Space Alert Threshold %           @LXA           
DSGTMSAP DS    1FL1      Track Managed Space Alert Threshold %   @LXA           
DSGOAMID DS    1CL0004   DB2 Identifier for OAM                  @O1C           
DSGDATAE DS    0C        END OF DDSGATA                                         
DSGDATA_LEN EQU *-DSGDATA                                                       
         ORG   ,                                                                
*                                                                @L8A           
.DCSGSKP ANOP                                                    @L8A           
         AIF ('&TYPE' EQ 'ALL' OR '&TYPE' EQ 'VL' ).DCVL         @L8A           
         AGO .DCVLSKP                                            @L8A           
.DCVL    ANOP                                                    @L8A           
*                                                                               
* ********************************************************************          
* * SMS VOLUME DEFINITION (RECORD TYPE 'VL')                                    
* ********************************************************************          
*                                                                               
*                                                                               
         ORG   DCUDATA                                                          
DVLDATA  DS    0X                                                               
DVLNMFLD DS    1CL0032   SPACE FOR NAME AND LENGTH                              
         ORG   DVLNMFLD                                                         
DVLNMLEN DS    1FL2      LENGTH OF NAME -- SHOULD BE                            
DVLVSER  DS    1CL0006   VOLUME SERIAL NUMBER                                   
         DS    1CL0024   RESERVED FOR CONSISTENCY                               
DVLUSER  DS    1CL0008   USERID OF LAST UPDATER                                 
DVLDATE  DS    1CL0010   DATE OF LAST UPDATE                                    
         DS    1CL0002   RESERVED                                               
DVLTIME  DS    1CL0008   TIME OF LAST UPDATE                                    
*                                                                               
*      ***************************************************************          
*      *                                                             *          
*      * NO DESC FOR VOLUME RECORD                                              
*      * VOLUME RECORD FLAG INFORMATION                                         
*      *                                                             *          
*      ***************************************************************          
*                                                                               
*                                                                               
DVLFLAGS DS    1CL0001   FLAGS AND RESERVED                                     
         ORG   DVLFLAGS                                                         
DVLCONV  EQU   X'80'     1 = VOL IS IN CONVERSION                               
         ORG   DVLFLAGS+X'00000001'                                             
DVLFLGDC DS    1BL1      DCOLLECT FLGS                                          
         ORG   DVLFLGDC                                                         
DVL32NAM EQU   X'80'     0 = Use DVLNSTAT, DVLCSMSS                             
*                                                                               
*      ***************************************************************          
*      *                                                             *          
*      * 1 = Use DVLSSTAT                                                       
*      *                                                             *          
*      ***************************************************************          
*                                                                               
*                                                                               
         ORG   DVLFLGDC+X'00000001'                                             
         DS    1CL0002   RESERVED                                               
*                                                                               
*      ***************************************************************          
*      *                                                             *          
*      * STORAGE GROUP ASSOCIATION AND STATUS INFORMATION                       
*      *                                                             *          
*      ***************************************************************          
*                                                                               
*                                                                               
DVLSG    DS    1CL0032   LENGTH AND NAME OF STORGRP                             
         ORG   DVLSG                                                            
DVLSGLEN DS    1FL2      LENGTH OF STORGRP NAME                                 
DVLSTGRP DS    1CL0030   STORAGE GROUP OF THIS VOLUME                           
DVLNSTAT DS    1CL0002   STATUS BY SYSTEM                                       
         ORG   DVLNSTAT                                                         
DVLSMSS  DS    1FL1      SMS STATUS                                             
DVLMVSS  DS    1FL1      MVS STATUS                                             
         ORG   DVLNSTAT+X'00000010'                                             
DVLCSMSS DS    1FL1      CONFIRMED SMS STATUS FOR VOL                           
*                                                                               
*      ***************************************************************          
*      *                                                             *          
*      * VOLUME ATTRIBUTES                                                      
*      *                                                             *          
*      ***************************************************************          
*                                                                               
*                                                                               
         ORG   DVLCSMSS+X'00000008'                                             
DVLNUCBA DS    1AL4      ADDRESS OF UCB IF KNOWN                                
DVLNTCPY DS    1FL4      TOTAL CAPACITY IN MB                                   
DVLNFREE DS    1FL4      AMOUNT FREE SPACE IN MB                                
DVLNLEXT DS    1FL4      LARGEST FREE EXTENT IN MB                              
DVLN0CNT DS    1FL2      VOLUME LEVEL RESET COUNT                               
DVLTRKSZ DS    1FL2      VOLUME R1 TRACK CAPACITY                               
DVLNLEVL DS    1FL4      UPDATE LEVEL FOR VOLUME                                
DVLSSTAT DS    1CL0008   System status array                                    
         ORG   DVLSSTAT                                                         
DVLSTSMS DS    1FL1      SMS system status                                      
DVLSTMVS DS    1FL1      MVS system status                      @PDD            
DVLCNSMS DS    1FL1      Confirmed SMS status                   @PKA            
         DS    1CL0005   Reserved                               @PKC            
         ORG   DVLSSTAT+X'00000100'                                             
DVLTRKCP DS    1FL4      TOTAL CAP OF TRK MGD SPC ON EAV IN MB  @L6A            
DVLTRKFR DS    1FL4      TOTAL FR SP IN TRK MGD SPC ON EAV IN MB@L6A            
DVLTRKEX DS    1FL4      LRG FR SPC IN TRK MGD SPC EAV IN MB    @L6A            
         DS    1CL0004   RESERVED                                               
DVLDATAE DS    0C        ROUND TO DWORD BOUNDARY                                
DVLDATA_LEN EQU *-DVLDATA                                                       
         ORG   ,                                                                
*                                                                @L8A           
.DCVLSKP ANOP                                                    @L8A           
         AIF ('&TYPE' EQ 'ALL' OR '&TYPE' EQ 'AG' ).DCAG         @L8A           
         AGO .DCAGSKP                                            @L8A           
.DCAG    ANOP                                                    @L8A           
*                                                                               
* ********************************************************************          
* * AGGREGATE GROUP DEFINITION (RECORD TYPE 'AG')                               
* ********************************************************************          
*                                                                               
*                                                                               
         ORG   DCUDATA                                                          
DAGDATA  DS    0X                                                               
DAGNMFLD DS    1CL0032   SPACE FOR NAME AND LENGTH                              
         ORG   DAGNMFLD                                                         
DAGNMLEN DS    1FL2      LENGTH OF NAME                                         
DAGNAME  DS    1CL0030   NAME OF DATA CLASS                                     
DAGUSER  DS    1CL0008   USERID OF LAST UPDATER                                 
DAGDATE  DS    1CL0010   DATE OF LAST UPDATE                                    
         DS    1CL0002   RESERVED                                               
DAGTIME  DS    1CL0008   TIME OF LAST UPDATE                                    
DAGDESC  DS    1CL0120   DESCRIPTION                                            
*                                                                               
*      ***************************************************************          
*      *                                                             *          
*      * AGGREGATE GROUP FLAG INFORMATION                                       
*      *                                                             *          
*      ***************************************************************          
*                                                                               
*                                                                               
DAGFLAGS DS    1BL1                                                             
         ORG   DAGFLAGS                                                         
DAGTENQ  EQU   X'80'     TOLERATE ENQ FAILURE, 1 = YES, 0 = NO                  
DAGFRET  EQU   X'40'     RETENTION PERIOD SPECIFIED, 1 = YES, 0 = NO            
DAGFNCPY EQU   X'20'     NUMBER OF COPIES SPECIFIED, 1 = YES, 0 = NO            
         ORG   DAGFLAGS+X'00000001'                                             
         DS    1CL0003   RESERVED                                               
*                                                                               
*      ***************************************************************          
*      *                                                             *          
*      * AGGREGATE GROUP ATTRIBUTES                                             
*      *                                                             *          
*      ***************************************************************          
*                                                                               
*                                                                               
DAGRETPD DS    1FL4      RETENTION PERIOD                                       
         ORG   DAGRETPD                                                         
DAGEXPYR DS    1FL2      EXPIRATION YEAR                                        
DAGEXPDY DS    1FL2      ABSOLUTE DAY OF YEAR                                   
DAGDEST  DS    1CL0030   DESTINATION                                            
DAGPREFX DS    1CL0033   OUTPUT DATA SET PREFIX                                 
         DS    1CL0001   RESERVED                                               
DAGIDSNM DS    1CL0052   INSTRUCTION DATA SET NAME                              
         ORG   DAGIDSNM                                                         
DAGINDSN DS    1CL0044   DATA SET NAME                                          
DAGINMEM DS    1CL0008   MEMBER NAME, IF ANY, OR BLANK                          
DAGDSNMS DS    1CL0052   ARRAY OF DATA SET NAMES                                
         ORG   DAGDSNMS                                                         
DAGDSN   DS    1CL0044   DATA SET NAME                                          
DAGMEM   DS    1CL0008   MEMBER NAME, IF ANY, OR BLANK                          
         ORG   DAGDSNMS+X'00000104'                                             
DAGMGMTC DS    1CL0032   MANAGEMENT CLASS                                       
         ORG   DAGMGMTC                                                         
DAGMCLEN DS    1FL2      MANAGEMENT CLASS LENGTH                                
DAGMCNAM DS    1CL0030   MANAGEMENT CLASS NAME                                  
DAGNCOPY DS    1FL4      NUMBER OF COPIES                                       
         DS    1CL0016   RESERVED                                               
DAGDATAE DS    0C        END OF DAGDATA                                         
DAGDATA_LEN EQU *-DAGDATA                                                       
         ORG   ,                                                                
*                                                                @L8A           
.DCAGSKP ANOP                                                    @L8A           
         AIF ('&TYPE' EQ 'ALL' OR '&TYPE' EQ 'DR' ).DCDR         @L8A           
         AGO .DCDRSKP                                            @L8A           
.DCDR    ANOP                                                    @L8A           
*                                                                               
* ********************************************************************          
* * SMS OPTICAL DRIVE DEFINITION (RECORD TYPE 'DR')                             
* ********************************************************************          
*                                                                               
*                                                                               
         ORG   DCUDATA                                                          
DDRDATA  DS    0X                                                               
DDRNMFLD DS    1CL0032   EXTENDED FOR CONSISTENCY                               
         ORG   DDRNMFLD                                                         
DDRDVLEN DS    1FL2      LENGTH OF NAME -- SHOULD BE                            
DDRNAME  DS    1CL0030                                                          
         ORG   DDRNAME                                                          
DDRDNAME DS    1CL0008   DRIVE NAME                                             
         DS    1CL0022   RESERVED FOR CONSISTENCY                               
DDRDUSER DS    1CL0008   USERID OF LAST UPDATER                                 
DDRDDATE DS    1CL0010   DATE OF LAST UPDATE                                    
DDRFLAGS DS    1CL0001   Flags and reserved                                     
         ORG   DDRFLAGS                                                         
DDR32NAM EQU   X'80'     0 = Use DDRNSTAT                                       
*                                                                               
*      ***************************************************************          
*      *                                                             *          
*      * 1 = Use DDRSTAT                                                        
*      *                                                             *          
*      ***************************************************************          
*                                                                               
*                                                                               
         ORG   DDRFLAGS+X'00000001'                                             
         DS    1CL0001   RESERVED                                               
DDRDTIME DS    1CL0008   TIME OF LAST UPDATE                                    
*                                                                               
*      ***************************************************************          
*      *                                                             *          
*      * LIBRARY NAME FIELDS                                                    
*      *                                                             *          
*      ***************************************************************          
*                                                                               
*                                                                               
DDRLB    DS    1CL0032   LENGTH AND NAME OF LIBRARY                             
         ORG   DDRLB                                                            
DDRLBLEN DS    1FL2      LENGTH OF LIBRARY NAME                                 
DDRLIBRY DS    1CL0030   LIBRARY FOR THIS DRIVE                                 
         ORG   DDRLIBRY                                                         
DDRLBNM  DS    1CL0008   LIBRARY NAME                                           
         DS    1CL0022   RESERVED                                               
*                                                                               
*      ***************************************************************          
*      *                                                             *          
*      * DRIVE STATUS BY SYSTEM                                                 
*      *                                                             *          
*      ***************************************************************          
*                                                                               
*                                                                               
DDRNSTAT DS    1CL0004   STATUS BY SYSTEM                                       
         ORG   DDRNSTAT                                                         
DDROMST  DS    1CL0004   STATUS OF EACH DRIVE                                   
         ORG   DDROMST                                                          
DDRSOUT  DS    1FL1      REQUESTED OAM STATUS                                   
DDRCFCS  DS    1FL1      CURRENT OAM STATUS                                     
         DS    1CL0002   RESERVED                                               
         ORG   DDRNSTAT+X'00000020'                                             
DDRDCONS DS    1FL4      CONSOLE ID                                             
DDRSTAT  DS    1CL0008   System related data                                    
         ORG   DDRSTAT                                                          
DDRSYSST DS    1CL0004   Status for this system                                 
         ORG   DDRSYSST                                                         
DDRREQST DS    1FL1      Requested system status                                
DDRCURST DS    1FL1      Current system status                                  
         DS    1CL0002   Reserved                                               
         DS    1CL0004   Reserved                                               
         ORG   DDRSTAT+X'00000100'                                              
         DS    1CL0016   RESERVED                                               
DDRDATAE DS    0C        END OF DDDRATA                                         
DDRDATA_LEN EQU *-DDRDATA                                                       
         ORG   ,                                                                
*                                                                @L8A           
.DCDRSKP ANOP                                                    @L8A           
         AIF ('&TYPE' EQ 'ALL' OR '&TYPE' EQ 'LB' ).DCLB         @L8A           
         AGO .DCLBSKP                                            @L8A           
.DCLB    ANOP                                                    @L8A           
*                                                                               
* ********************************************************************          
* * SMS OPTICAL LIBRARY DEFINITION (RECORD TYPE 'LB')                           
* ********************************************************************          
*                                                                               
*                                                                               
         ORG   DCUDATA                                                          
DLBDATA  DS    0X                                                               
DLBNMFLD DS    1CL0032   EXTENDED FOR CONSISTENCY                               
         ORG   DLBNMFLD                                                         
DLBNMLEN DS    1FL2      LENGTH OF LIBRARY NAME                                 
DLBLNAME DS    1CL0030   LIBRARY NAME - LONG VERSION                            
         ORG   DLBLNAME                                                         
DLBNAME  DS    1CL0008   NAME OF OPTICAL LIBRARY                                
         DS    1CL0022   RESERVED FOR CONSISTENCY                               
DLBDUSER DS    1CL0008   USERID OF LAST UPDATER                                 
DLBDDATE DS    1CL0010   DATE OF LAST UPDATE                                    
DLBFLAGS DS    1CL0001   Reserved                                               
         ORG   DLBFLAGS                                                         
DLB32NAM EQU   X'80'     0 = Use DLBNSTAT                                       
*                                                                               
*      ***************************************************************          
*      *                                                             *          
*      * 1 = Use DLBSTAT                                                        
*      *                                                             *          
*      ***************************************************************          
*                                                                               
*                                                                               
         ORG   DLBFLAGS+X'00000001'                                             
         DS    1CL0005   Reserved                                               
DLBDTIME DS    1CL0008   TIME OF LAST UPDATE                                    
*                                                                               
*      ***************************************************************          
*      *                                                             *          
*      * OPTICAL LIBRARY STATUS BY SYSTEM                                       
*      *                                                             *          
*      ***************************************************************          
*                                                                               
*                                                                               
DLBNSTAT DS    1CL0004   STATUS BY SYSTEM                                       
         ORG   DLBNSTAT                                                         
DLBOMST  DS    1CL0004   STATUS FOR EACH LIBRARY                                
         ORG   DLBOMST                                                          
DLBSOUT  DS    1FL1      REQUESTED OAM STATUS                                   
DLBCFCS  DS    1FL1      CURRENT OAM STATUS                                     
         DS    1CL0002   RESERVED                                               
*                                                                               
*      ***************************************************************          
*      *                                                             *          
*      * OPTICAL LIBRARY ATTRIBUTES                                             
*      *                                                             *          
*      ***************************************************************          
*                                                                               
*                                                                               
         ORG   DLBNSTAT+X'00000020'                                             
DLBTYPE  DS    1FL1      REAL OR PSEUDO LIBRARY                                 
         DS    1CL0002   RESERVED                                               
DLBDTYPE DS    1FL1      LIBRARY DEVICE TYPE                                    
DLBDCONS DS    1FL4      CONSOLE ID                                             
DLBEDVT  DS    1FL1      ENTRY DEFAULT USE ATTRIBUTE (TAPE ONLY)                
DLBEJD   DS    1FL1      EJECT DEFAULT (TAPE ONLY)                              
DLBLCBID DS    1CL0005   LIBRARY ID IN LIB.CONF.DB (TAPE ONLY)                  
         DS    1CL0001   RESERVED                                               
DLBEDUNM DS    1CL0008   ENTRY DEFAULT UNIT NAME (TAPE ONLY)                    
DLBDEFDC DS    1CL0032   ENTRY DEFAULT DATA CLASS (TAPE ONLY)                   
         ORG   DLBDEFDC                                                         
DLBDCLEN DS    1FL2      LENGTH OF ENTRY DEFAULT DC                             
DLBDCLNM DS    1CL0030   DEFAULT DC LONG VERSION                                
         ORG   DLBDCLNM                                                         
DLBDCNAM DS    1CL0008   NAME OF ENTRY DEFAULT DC                               
         DS    1CL0022   RESERVED FOR CONSISTENCY                               
DLBSTAT  DS    1CL0008   System related data                                    
         ORG   DLBSTAT                                                          
DLBSYSST DS    1CL0004   Status for this system                                 
         ORG   DLBSYSST                                                         
DLBREQST DS    1FL1      Requested system status                                
DLBCURST DS    1FL1      Current system status                                  
         DS    1CL0002   Reserved                                               
         DS    1CL0004   Reserved                                               
         ORG   DLBSTAT+X'00000100'                                              
         DS    1CL0016   RESERVED                                               
DLBDATAE DS    0C        END OF DLBDATA                                         
DLBDATA_LEN EQU *-DLBDATA                                                       
         ORG   ,                                                                
*                                                                @L8A           
.DCLBSKP ANOP                                                    @L8A           
         AIF ('&TYPE' EQ 'ALL' OR '&TYPE' EQ 'CN' ).DCCN         @L8A           
         AGO .DCCNSKP                                            @L8A           
.DCCN    ANOP                                                    @L8A           
*                                                                               
* ********************************************************************          
* * SMS Cache Names Definition (Record Type 'CN')                               
* ********************************************************************          
*                                                                               
*                                                                               
         ORG   DCUDATA                                                          
DCNDATA  DS    0X                                                               
DCNCSNAM DS    1CL0008   Cache Set Name                                         
DCNSESNM DS    1CL0016   SES Cache name                                         
         ORG   DCNSESNM+X'00000080'                                             
         DS    1CL0016   RESERVED                                               
DCNDATAE DS    0C        END OF DCNDATA                                         
DCNDATA_LEN EQU *-DCNDATA                                                       
         ORG   ,                                                                
*                                                                @L8A           
.DCCNSKP ANOP                                                    @L8A           
         AIF ('&TYPE' EQ 'ALL' OR '&TYPE' EQ 'AI' ).DCAI         @L8A           
         AGO .DCAISKP                                            @L8A           
.DCAI    ANOP                                                    @L8A           
*                                                                               
* ********************************************************************          
* * SMS Accounting Information Definition  (Record Type 'AI')                   
* ********************************************************************          
*                                                                               
*                                                                               
         ORG   DCUDATA                                                          
DAIDATA  DS    0X                                                               
DAIDRTN  DS    1CL0078   Data Class Routine                                     
         ORG   DAIDRTN                                                          
DAIDDATE DS    1CL0010   Date last updated                                      
DAIDDSNM DS    1CL0044   Data set name where stored                             
DAIDDSMR DS    1CL0008   Member name in data set                                
DAIDSRID DS    1CL0008   Userid of last updater                                 
DAIDTIME DS    1CL0008   Time last updated                                      
DAIMRTN  DS    1CL0078   Management Class Routine                @P1C           
         ORG   DAIMRTN                                                          
DAIMDATE DS    1CL0010   Date last updated                                      
DAIMDSNM DS    1CL0044   Data set name where stored                             
DAIMDSMR DS    1CL0008   Member name in data set                                
DAIMSRID DS    1CL0008   Userid of last updater                                 
DAIMTIME DS    1CL0008   Time last updated                                      
DAISRTN  DS    1CL0078   Storage Class Routine                                  
         ORG   DAISRTN                                                          
DAISDATE DS    1CL0010   Date last updated                                      
DAISDSNM DS    1CL0044   Data set name where stored                             
DAISDSMR DS    1CL0008   Member name in data set                                
DAISSRID DS    1CL0008   Userid of last updater                                 
DAISTIME DS    1CL0008   Time last updated                                      
DAIGRTN  DS    1CL0078   Storage Group Routine                                  
         ORG   DAIGRTN                                                          
DAIGDATE DS    1CL0010   Date last updated                                      
DAIGDSNM DS    1CL0044   Data set name where stored                             
DAIGDSMR DS    1CL0008   Member name in data set                                
DAIGSRID DS    1CL0008   Userid of last updater                                 
DAIGTIME DS    1CL0008   Time last updated                                      
         DS    1CL0016   Reserved                                               
DAIDATAE DS    0C        end of DAIDATA                                         
DAIDATA_LEN EQU *-DAIDATA                                        @L8M           
.DCAISKP ANOP                                                    @L8A           
*                                                                               
* ********************************************************************          
* * VALUES FOR DCVPHYST - PHYSICAL STATUS OF VOLUME                  *          
* ********************************************************************          
*                                                                               
*                                                                               
DCVMANGD EQU   B'00000011' Volume is SMS managed                                
DCVINITL EQU   B'00000001' In conversion to SMS                                 
DCVNMNGD EQU   B'00000000' Non SMS managed volume                               
*                                                                               
* ********************************************************************          
* * VALUES FOR DCDRECFM - RECORD FORMAT                              *          
* ********************************************************************          
*                                                                               
*                                                                               
DCDRECFF EQU   B'10000000' Fixed length records                                 
DCDRECFV EQU   B'01000000' Variable length records                              
DCDRECFU EQU   B'11000000' Undefined length records                             
*                                                                               
* ********************************************************************          
* * CONSTANTS FOR DDCRBIAS RECORD ACCESS BIAS                                   
* ********************************************************************          
*                                                                               
*                                                                               
DDCRABUS EQU   0         USER                                                   
DDCRABSY EQU   1         SYSTEM                                                 
DDCRADO  EQU   2         DO                                      @LTA           
DDCRADW  EQU   3         DW                                      @LTA           
DDCRASO  EQU   4         SO                                      @LTA           
DDCRASW  EQU   5         SW                                      @LTA           
*                                                                               
* ********************************************************************          
* * CONSTANTS FOR DDCRCORG                                                      
* ********************************************************************          
*                                                                               
*                                                                               
DDCORGNL EQU   0         RECORG IS NULL - SAM                                   
DDCORGKS EQU   1         RECORG IS VSAM KSDS                                    
DDCORGES EQU   2         RECORG IS VSAM ESDS                                    
DDCORGRR EQU   3         RECORG IS VSAM RRDS                                    
DDCORGLS EQU   4         RECORG IS VSAM LDS                                     
*                                                                               
* ********************************************************************          
* * CONSTANTS FOR DDCRECFM                                                      
* ********************************************************************          
*                                                                               
*                                                                               
DDCFMNUL EQU   0         RECFM IS NULL                                          
DDCFMU   EQU   1         RECFM IS UNDEFINED                                     
DDCFMV   EQU   2         RECFM IS VARIABLE                                      
DDCFMVS  EQU   3         RECFM IS VARIABLE SPANNED                              
DDCFMVB  EQU   4         RECFM IS VARIABLE BLOCKED                              
DDCFMVBS EQU   5         RECFM IS VAR BLK SPANNED                               
DDCFMF   EQU   6         RECFM IS FIXED                                         
DDCFMFS  EQU   7         RECFM IS FIXED STANDARD                                
DDCFMFB  EQU   8         RECFM IS FIXED BLOCKED                                 
DDCFMFBS EQU   9         RECFM IS FIXED BLK SPANND                              
*                                                                               
* ********************************************************************          
* * CONSTANTS FOR DDCCNTL                                                       
* ********************************************************************          
*                                                                               
*                                                                               
DDCCNTLA EQU   1         CARRIAGE CONTROL IS ANSI                               
DDCCNTLM EQU   2         CARRIAGE CONTROL IS MACH                               
DDCCNTLN EQU   3         CARRIAGE CONTROL IS NULL                               
*                                                                               
* ********************************************************************          
* * CONSTANTS FOR DDCAVREC                                                      
* ********************************************************************          
*                                                                               
*                                                                               
DDCBYTES EQU   1         AVGREC IS BYTES                                        
DDCKB    EQU   2         AVGREC IS KB                                           
DDCMB    EQU   3         AVGREC IS MB                                           
*                                                                               
* ********************************************************************          
* * CONSTANTS FOR DDCDSNTY                                                      
* ********************************************************************          
*                                                                               
*                                                                               
DDCDSNUL EQU   0         DSN TYPE IS NULL                                       
DDCDSPDS EQU   1         DSN TYPE IS PDS                                        
DDCDSLIB EQU   2         DSN TYPE IS LIBRARY                                    
DDCDSHFS EQU   3         DSN TYPE IS HFS                                        
DDCDSEXR EQU   4         DSN TYP - EXTENDED(R)                                  
DDCDSEXC EQU   5         DSN TYP - EXTENDED(C)                                  
DDCDSLRG EQU   6         DSN TYP - LARGE               @LHD                     
DDCDSNXT EQU   7         DSN TYP - NEXT                @LHD                     
*                                                                               
* ********************************************************************          
* * CONSTANTS FOR DDCCOMP                                                       
* ********************************************************************          
*                                                                               
*                                                                               
DDCCNUL  EQU   0         NULL COMPACTION TYPE                                   
DDCNOCMP EQU   1         NO COMPACTION                                          
DDCIDRC  EQU   2         IMPROVED DATA RECORDING CAPABILITY,           *        
                         COMPACTION.                                            
*                                                                               
* ********************************************************************          
* * CONSTANTS FOR DDCMEDIA                                                      
* ********************************************************************          
*                                                                               
*                                                                               
DDCMENUL EQU   0         MEDIA TYPE IS NULL                                     
DDCMEDA1 EQU   1         MEDIA1 - CART. SYSTEM                                  
DDCMEDA2 EQU   2         MEDIA2 - ENHANCED CAPACITY CARTRIDGE SYSTEM   *        
                         TAPE                                                   
DDCMEDA3 EQU   3         MEDIA3 - ENHANCED CAPACITY CARTRIDGE SYSTEM   *        
                         TAPE                                                   
DDCMEDA4 EQU   4         MEDIA4 - ENHANCED CAPACITY CARTRIDGE SYSTEM   *        
                         TAPE                                                   
DDCMEDA5 EQU   5         MEDIA5 - ENHANCED CAPACITY CARTRIDGE SYSTEM   *        
                         TAPE                                @LHB               
DDCMEDA6 EQU   6         MEDIA6 - ENHANCED CAPACITY CARTRIDGE SYSTEM   *        
                         TAPE                                @04A               
DDCMEDA7 EQU   7         MEDIA7 - ENHANCED CAPACITY CARTRIDGE SYSTEM   *        
                         TAPE                                @04A               
DDCMEDA8 EQU   8         MEDIA8 - ENHANCED CAPACITY CARTRIDGE SYSTEM   *        
                         TAPE                                @04A               
DDCMEDA9 EQU   9         MEDIA9 - ENHANCED CAPACITY CARTRIDGE SYSTEM   *        
                         TAPE                                @06A               
DDCMED10 EQU  10         MEDIA10 - ENHANCED CAPACITY CARTRIDGE SYSTEM  *        
                         TAPE                                @06A               
DDCMED11 EQU  11         MEDIA11 - ENHANCED CAPACITY CARTRIDGE SYSTEM  *        
                         TAPE                                @16A               
DDCMED12 EQU  12         MEDIA12 - ENHANCED CAPACITY CARTRIDGE SYSTEM  *        
                         TAPE                                @16A               
DDCMED13 EQU  13         MEDIA13 - ENHANCED CAPACITY CARTRIDGE SYSTEM  *        
                         TAPE                                @16A               
*                                                                               
* ********************************************************************          
* * CONSTANTS FOR DDCRECTE                                                      
* ********************************************************************          
*                                                                               
*                                                                               
DDCRTNUL EQU   0         DDCRECTE IS NULL                                       
DDC18TRK EQU   1         DDCRECTE IS 18 TRACK                                   
DDC36TRK EQU   2         DDCRECTE IS 36 TRACK                                   
DDC128TK EQU   3         DDCRECTE IS 128 TRACK                                  
DDC256TK EQU   4         DDCRECTE IS 256 TRACK                                  
DDC384TK EQU   5         DDCRECTE IS 384 TRACK                @LHA              
DDCEFMT1 EQU   6         DDCRECTE IS EFMT1                    @LHB              
DDCEFMT2 EQU   7         DDCRECTE IS EFMT2                    @06A              
DDCEEFM2 EQU   8         DDCRECTE IS EEFMT2                   @07A              
DDCEFMT3 EQU   9         DDCRECTE IS EFMT3                    @10A              
DDCEEFM3 EQU  10         DDCRECTE IS EEFMT3                   @10A              
DDCEFMT4 EQU  11         DDCRECTE IS EFMT4                    @16A              
DDCEEFM4 EQU  12         DDCRECTE IS EEFMT4                   @16A              
*                                                                               
* ********************************************************************          
* *                                                                  *          
* * Constants for DDCBWOTP                                                      
* *                                                                  *          
* ********************************************************************          
*                                                                               
*                                                                               
DDCBWOCI EQU   1         BWO type CICS                                          
DDCBWONO EQU   2         BWO type none                                          
DDCBWOIM EQU   3         BWO type IMS                                           
*                                                                               
* ********************************************************************          
* *                                                                  *          
* * Constants for DDCLOGRC                                                      
* *                                                                  *          
* ********************************************************************          
*                                                                               
*                                                                               
DDCLOGNO EQU   1         non Recoverable sphere                                 
DDCLOGUN EQU   2         UNDO - use external log                                
DDCLOGAL EQU   3         ALL - (UNDO) & forward                                 
*                                                                               
* ********************************************************************          
* *                                                                  *          
* * Constants for DDCSPAND                                                      
* *                                                                  *          
* ********************************************************************          
*                                                                               
*                                                                               
DDCSPANN EQU   0         Record can not span CI                                 
DDCSPANY EQU   1         Record may span CI                                     
*                                                                               
*                                                                               
* ********************************************************************          
* *                                                                  *          
* * Constants for DDCEATTR DCDEATRC DCDEATRV  (EAS Eligible)   @L9A             
* *                                                                  *          
* ********************************************************************          
*                                                                               
*                                                                               
DDCEANUL EQU   0         EATTR not specified                   @L9A             
DDCEATNO EQU   1         EATTR NO  not eligible for CYL manage @L9A             
DDCEATOP EQU   2         EATTR OPT eligible for CYL manage     @L9A             
*                                                                               
* ********************************************************************          
* * CONSTANTS FOR DSCDIRB and DSCSEQB                                           
* ********************************************************************          
*                                                                               
*                                                                               
DSCBIADC EQU   0         BIAS = DON'T CARE                                      
DSCBIARD EQU   1         BIAS = READ                                            
DSCBIAWR EQU   2         BIAS = WRITE                                           
*                                                                               
* ********************************************************************          
* * CONSTANTS FOR DSCAVAIL                                                      
* ********************************************************************          
*                                                                               
*                                                                               
DSCAVLDC EQU   0         AVAILABILITY = DON'T CARE (NO PREF)      @01C          
DSCAVLST EQU   1         AVAILABILITY = STANDARD                                
DSCAVLCN EQU   2         AVAILABILITY = CONTINUOUS                              
DSCAVLPR EQU   3         AVAILABILITY = PREFERRED                 @01A          
*                                                                               
* ********************************************************************          
* * CONSTANTS FOR DSCACCES                                                      
* ********************************************************************          
*                                                                               
*                                                                               
DSCACCPR EQU   0         ACCESSIBILITY = CONTINUOUS PREFERRED                   
DSCACCRQ EQU   1         ACCESSIBILITY = CONTINUOUS                             
DSCACCST EQU   2         ACCESSIBILITY = STANDARD                               
DSCACCNP EQU   3         ACCESSIBILITY = NOPREF                                 
*                                                                               
* ********************************************************************          
* *  CONSTANTS FOR DMCRFMT                                                      
* ********************************************************************          
*                                                                               
*                                                                               
DMCNULL  EQU   0         FIELD WAS NOT USED                                     
DMCFDATE EQU   1         EXPIRE FORM: DATE/CREATE                               
DMCFDAYS EQU   2         EXPIRE FORM: DAYS/CREATE                               
*                                                                               
* ********************************************************************          
* *  CONSTANTS FOR DMCCMAU                                                      
* ********************************************************************          
*                                                                               
*                                                                               
DMCMNONE EQU   0         NO MIGRATION ALLOWED                                   
DMCMCMD  EQU   1         MIGR ON COMMAND ONLY                                   
DMCMBOTH EQU   2         AUTO MIGRAT OR ON CMD                                  
*                                                                               
* ********************************************************************          
* *  CONSTANTS FOR DMCBADU                                                      
* ********************************************************************          
*                                                                               
*                                                                               
DMCBNONE EQU   0         NO USR OR ADMN BACKUP                                  
DMCBADM  EQU   1         ALLOW ADMIN CMD BACKUP                                 
DMCBBOTH EQU   2         ALLOW ADMN OR USR CMD                                  
*                                                                               
* ********************************************************************          
* *  CONSTANTS FOR DMCEXPAC                                                     
* ********************************************************************          
*                                                                               
*                                                                               
DMCEANUL EQU   0         EXPIRE ACTION IS NULL                                  
DMCEADEL EQU   1         EXPIRE ACTION IS DEL                                   
DMCEAARC EQU   2         EXPIRE ACTION IS ARC                                   
*                                                                               
* ********************************************************************          
* *  CONSTANTS FOR DMCRLF                                                       
* ********************************************************************          
*                                                                               
*                                                                               
DMCRLFYE EQU   B'10000000' PARTIAL RELEASE = YES, IMMEDIATE REL = NO            
DMCRLFCN EQU   B'01000000' CONDITION PARTREL = YES, IMMEDIATE REL = NO          
DMCRLFNO EQU   B'00000000' PARTIAL RELEASE = NO, IMMEDIATE REL = NO             
DMCRLFYI EQU   B'10100000' PARTIAL RELEASE = YES, IMMEDIATE REL = YES           
DMCRLFCI EQU   B'01100000' CONDITION PARTREL = YES, IMMED CON REL =    *        
                         YES                                                    
*                                                                               
* ********************************************************************          
* *  CONSTANTS FOR DMCCPYTC                                                     
* ********************************************************************          
*                                                                               
*                                                                               
DMCCPYST EQU   0         STANDARD                                               
DMCCPYPR EQU   1         CONCURRENT PREFERRED                                   
DMCCPYRQ EQU   2         CONCURRENT REQUIRED                                    
*                                                                               
* ********************************************************************          
* * CONSTANTS FOR DBCSTAT                                                       
* ********************************************************************          
*                                                                               
*                                                                               
DBCVALID EQU   1         DATA SET IS VALID                                      
DBCINVAL EQU   2         DATA SET IS INVALID                                    
DBCUNKWN EQU   3         DATA SET STAT IS UNK.                                  
*                                                                               
* ********************************************************************          
* * CONSTANTS FOR DBCSYSNT AND DBCSNMTY                                         
* ********************************************************************          
*                                                                               
*                                                                               
DBCSYSNS EQU   0         NAME TYPE NOT SPECIFIED                                
DBCSYSTM EQU   1         NAME TYPE IS SYSTEM NAME                               
DBCSYSPL EQU   2         NAME TYPE IS SYSTEM GROUP NAME                         
*                                                                               
* ********************************************************************          
* * CONSTANTS FOR DBCSYSFT                                                      
* ********************************************************************          
*                                                                               
*                                                                               
DBCASMS  EQU   X'8000'   ACTIVE SMS                                             
DBCPDSE  EQU   X'4000'   PDSE FEATURE                                           
DBCCDMP  EQU   X'2000'   SAM COMPRESSION                                        
DBCSESC  EQU   X'1000'   SES CACHE FEATURE                                      
*                                                                               
* ********************************************************************          
* * CONSTANTS FOR DSGFTYPE                                                      
* ********************************************************************          
*                                                                               
*                                                                               
DSGPOOL  EQU   0         STG GRP TYPE IS POOL                                   
DSGVIO   EQU   1         STG GRP TYPE IS VIO                                    
DSGDUMMY EQU   2         STG GRP TYPE IS DUMMY                                  
DSGOBJ   EQU   3         SG TYPE IS OBJECT                                      
DSGOBJBK EQU   4         SG TYPE IS OBJ BACKUP                                  
DSGTAPE  EQU   5         SG TYPE IS TAPE                                        
DSGTARGT EQU   6         SG TYPE IS Copy Target                 @PJA            
*                                                                               
* ********************************************************************          
* * CONSTANTS FOR DSGSTAT AND DSGSYSST                               *          
* ********************************************************************          
*                                                                               
*                                                                               
DSG0     EQU   0         NO STATUS SPECIFIED                                    
DSGENBL  EQU   1         STOR GRP IS ENABLED                                    
DSGQUI   EQU   2         STOR GRP QUIESCED/ALL                                  
DSGQUIN  EQU   3         STOR GRP QUIESCED/NEW                                  
DSGDIS   EQU   4         STOR GRP DISABLED/ALL                                  
DSGDISN  EQU   5         STOR GRP DISABLED/NEW                                  
*                                                                               
* ********************************************************************          
* * SMS STATUS - DVLSMSS AND DVLSTSMS                                           
* ********************************************************************          
*                                                                               
*                                                                               
DVL0     EQU   0         NO STATUS GIVEN                                        
DVLENBL  EQU   1         SMS STATUS IS ENABLED                                  
DVLQUI   EQU   2         SMS STAT QUIESCED/ALL                                  
DVLQUIN  EQU   3         SMS STAT QUIESCED/NEW                                  
DVLDIS   EQU   4         SMS STAT DISABLED/ALL                                  
DVLDISN  EQU   5         SMS STAT DISABLED/NEW                                  
*                                                                               
* ********************************************************************          
* * MVS STATUS - DVLMVSS AND DVLSTMVS                                           
* ********************************************************************          
*                                                                               
*                                                                               
DVLONLN  EQU   1         MVS STATUS IS ONLINE                                   
DVLOFFLN EQU   2         MVS STATUS IS OFFLINE                                  
DVLPOFF  EQU   3         MVS STATUS IS PENDING OFFLINE                          
DVLBOXED EQU   4         MVS STATUS IS BOXED                                    
DVLNRDY  EQU   5         MVS STATUS IS NOT READY                                
DVLROA   EQU   6         MVS STATUS is ONLINE AND READONLY       @LYA           
*                                                                               
* ********************************************************************          
* * MVS STATUS - DDRSOUT, DDRCFCS, DDRREQST AND DDRCURST                        
* ********************************************************************          
*                                                                               
*                                                                               
DDRNOCON EQU   0         OAM STATUS IS NO CONNECTIVITY                          
DDRONLN  EQU   1         OAM STATUS IS ONLINE                                   
DDROFFLN EQU   2         OAM STATUS IS OFFLINE                                  
DDRNORST EQU   3         NO OUTSTANDING REQUEST                                 
*                                                                               
* ********************************************************************          
* * MVS STATUS - DLBSOUT, DLBCFCS, DLBREQST, AND DLBCURST                       
* ********************************************************************          
*                                                                               
*                                                                               
DLBNOCON EQU   0         OAM STATUS IS NO CONNECT                               
DLBONLN  EQU   1         OAM STATUS IS ONLINE                                   
DLBOFFLN EQU   2         OAM STATUS IS OFFLINE                                  
DLBNORST EQU   3         NO OUTSTANDING REQUEST                                 
DLBLPENO EQU   4         LIBRARY PENDING OFFLINE                 @P1C           
*                                                                               
* ********************************************************************          
* * TYPE OF LIBRARY - DLBTYPE                                                   
* ********************************************************************          
*                                                                               
*                                                                               
DLBNOOPT EQU   0         NOT OPTICAL LIBRARY                                    
DLBREAL  EQU   1         REAL LIBRARY                                           
DLBPSEUD EQU   2         PSEUDO LIBRARY                                         
*                                                                               
* ********************************************************************          
* * TYPE OF LIBRARY DEVICE - DLBDTYPE                                           
* ********************************************************************          
*                                                                               
*                                                                               
DLBD9246 EQU   0         IBM 9246 LIBRARY                                       
DLBD3995 EQU   1         IBM 3995 LIBRARY                                       
DLBDTAPE EQU   2         TAPE LIBRARY                                           
*                                                                               
* ********************************************************************          
* * ENTRY DEFAULT USE ATTRIBUTE- DLBEDVT(TAPE LIBRARY ONLY)                     
* ********************************************************************          
*                                                                               
*                                                                               
DLBPRVT  EQU   1         PRIVATE VOLUME                                         
DLBSCRT  EQU   2         SCRATCH VOLUME                                         
*                                                                               
* ********************************************************************          
* * EJECT DEFAULT - DLBEJD                                                      
* ********************************************************************          
*                                                                               
*                                                                               
DLBPURGE EQU   1         PURGE TCDB VOL RECORD                                  
DLBKEEP  EQU   2         KEEP TCDB VOL RECORD                                   
*                                                                               
* ********************************************************************          
* * VALUES FOR DCURCTYP - RECORD TYPE                                *          
* ********************************************************************          
*                                                                               
*                                                                               
DCUDATAT EQU   C'D '     DATA TYPE RECORD                                       
DCUASSOC EQU   C'A '     VSAM ASSOCIATION RECORD                                
DCUVULUT EQU   C'V '     VOLUME TYPE RECORD                                     
DCUDCDEF EQU   C'DC'     DATA CLASS                                             
DCUSCDEF EQU   C'SC'     STORAGE CLASS                                          
DCUMCDEF EQU   C'MC'     MANAGEMENT CLASS                        @P1C           
DCUBCDEF EQU   C'BC'     BASE CONFIG.                                           
DCUSGDEF EQU   C'SG'     STORAGE GROUP                                          
DCUVLDEF EQU   C'VL'     SMS VOLUME DEF                                         
DCUAGDEF EQU   C'AG'     AGGREGATE GROUP                                        
DCUDRDEF EQU   C'DR'     OPTICAL DRIVE                                          
DCULBDEF EQU   C'LB'     OPTICAL LIBRARY                                        
DCUCNDEF EQU   C'CN'     CACHE NAMES                                            
DCUAIDEF EQU   C'AI'     ACS INFORMATION                         @P1C           
         ORG   ,                                                                
.L0002   ANOP                                                                   
*                                                                @L8A           
* *********************** IDCDOUT MACRO END ******************** @L8A           
* *********************** IDCDOUT MACRO END ******************** @L8A           
*                                                                @L8A           
         AIF   ('&ZCBPRINT' EQ 'NO').P3                                         
         AIF   ('&LIST' EQ 'YES').P4                                            
.P3      ANOP                                                                   
         POP   PRINT                                                            
.P4      ANOP                                                                   
.P_EXIT  ANOP                                                                   
         MEND                                                                   
**/ IDCDOUT_2:;                                                                 
* %IDCDOUT_INCLUDED = 'YES';                                                    
* %DCL ZCBPRINT CHAR EXT;                                                       
* %DEACTIVATE ZCBPRINT;                                                         
* %DCL IDCDOUT_LIST CHAR EXT;                                                   
* %DEACTIVATE IDCDOUT_LIST;                                                     
* %IF IDCDOUT_LIST ^= 'NO' &                                                    
*    ZCBPRINT ^= 'NO' %THEN                                                     
*   %GOTO IDCDOUT_3;                                                            
*   @LIST PUSH NOECHO;                                                          
*   @LIST NOASSEMBLE NOECHO;                                                    
*   @LIST OFF C NOECHO;                                                         
* %IDCDOUT_3:;                                                                  
*/* Start of PL/X Source                                             */         
*                                                                               
* %END;                                                                         
* %GOTO DCU_HDR1;          /*                                                   
*                          */                                                   
* %DCU_HDR1:                                                                    
* IF DCU_BASE = '' %THEN               /* CHECK & SET BASING ARGUMENT*/         
*    %DCU_BASE = 'BASED BDY(DWORD)';   /* DBL WORD ALIGNMENT     @15C*/         
*                                                                               
*/********************************************************************/         
*/* HEADER PORTION OF DATA COLLECTION UTILITY OUTPUT RECORD. EACH    */         
*/* DATA SECTION IS PRECEDED BY THIS HEADER.                         */         
*/********************************************************************/         
*DECLARE                                                                        
* 1 DCUOUTH DCU_BASE,            /* DATA COLLECTION OUTPUT RECORD    */         
*   2 DCURDW     FIXED(31),      /* RECORD DESCRIPTOR WORD           */         
*     3 DCULENG    FIXED(15),    /* LENGTH OF THIS RECORD            */         
*     3 *          CHAR(2),      /* RESERVED                         */         
*   2 DCURCTYP   CHAR(2),        /* RECORD TYPE FOR THIS RECORD      */         
*   2 DCUVERS    FIXED(15),      /* VERSION OF IDCDOUT               */         
*   2 DCUSYSID   CHAR(4),        /* SYSTEM ID FOR THIS OPERATION     */         
*   2 DCUTMSTP,                  /* TIMESTAMP FIELD                  */         
*     3 DCUTIME  FIXED(32),      /* TIME IN SMF HEADER FORMAT        */         
*     3 DCUDATE  CHAR(4),        /* DATE IN SMF FORMAT (CCYYDDDF)    */         
*   2 *          CHAR(4),        /* RESERVED                         */         
*   2 DCUDATA    CHAR(0);        /* END OF HEADER SECTION            */         
*                                                                               
* %DCL DCU_HEAD CHAR;            /* DCU_HEAD IS USED BY ARCUTILP TO  */         
* %DCU_HEAD = 'OMIT';            /* EXCLUDE HEADER IN THEIR MACRO    */         
* %                                                                             
* IF DCU_HDR = 'YES'             /* INCLUDE HEADER DECLARE ONLY?     */         
*  & IDCDOUT_CBGEN ^= 'YES' %THEN  /* INCLUDE EVERYTHING?            */         
*    %GOTO DCU_OMIT;                                                            
* %                                                                             
* IF DCU_SMS = 'YES' %THEN       /* INCLUDE SMS RECORDS ONLY?@OY59794*/         
*    %GOTO DCU_SMSA;                                                            
*/********************************************************************/         
*/* ACTIVE DATA SET INFORMATION (RECORD TYPE 'D')                    */         
*/********************************************************************/         
*DECLARE                                                                        
* 1 DCDADSI DEFINED(DCUDATA),    /* ACTIVE DATA SET INFORMATION                 
*                                   (DEFINED ON DCUDATA)             */         
*   2 DCDDSNAM CHAR(44),         /* DATA SET NAME                    */         
*   2 DCDERROR BIT(8),           /* ERROR INFORMATION FLAGS          */         
*     3 DCDEMNGD BIT(1),         /* SMS MANAGED INCONSISTENCY        */         
*     3 DCDEDVVR BIT(1),         /* DUPLICATE VVR FOUND              */         
*     3 DCDNOSPC BIT(1),         /* NO SPACE INFORMATION PROVIDED    */         
*     3 DCDVSAMI BIT(1),         /* VSAM INDICATORS INCONSISTENT     */         
*     3 DCDNOFM1 BIT(1),         /* NO FMT 1 DSCB FOR THIS DATA SET  */         
*     3 *        BIT(3),         /* RESERVED                         */         
*   2 DCDFLAG1 BIT(8),           /* INFORMATION FLAG #1              */         
*     3 DCDRACFD BIT(1),         /* DATA SET IS RACF DEFINED         */         
*     3 DCDSMSM  BIT(1),         /* SMS MANAGED DATA SET             */         
*     3 DCDTEMP  BIT(1),         /* TEMPORARY DATA SET               */         
*     3 DCDPDSE  BIT(1),         /* PARTITIONED DATA SET (EXTENDED)  */         
*     3 DCDGDS   BIT(1),         /* GENERATION DATA GROUP DATA SET   */         
*     3 DCDREBLK BIT(1),         /* DATA SET MAY BE REBLOCKED        */         
*     3 DCDCHIND BIT(1),         /* CHANGE INDICATOR                 */         
*     3 DCDCKDSI BIT(1),         /* CHECKPOINT DATA SET INDICATOR    */         
*   2 DCDFLAG2 BIT(8),           /* INFORMATION FLAG #2              */         
*     3 DCDNOVVR BIT(1),         /* NO VVR FOR THIS DATA SET         */         
*     3 DCDINTCG BIT(1),         /* DATA SET IS AN ICF CATALOG       */         
*     3 DCDINICF BIT(1),         /* DATA SET IS CATALOGED IN ICF CAT */         
*     3 *        BIT(1),         /* RESERVED                 @OY32626*/         
*     3 DCDALLFG BIT(1),         /* ALLOCATED SPACE 31BIT RET'D  @L9C*/         
*     3 DCDUSEFG BIT(1),         /* USED SPACE INFO 31BIT RET'D  @L9C*/         
*     3 DCDSECFG BIT(1),         /* SEC. SPACE INFO 31BIT RET'D  @L9C*/         
*     3 DCDNMBFG BIT(1),         /* UNUSEABLE SPACE 31BIT RET'D  @L9C*/         
*   2 DCDFLAG3 BIT(8),           /* INFORMATION FLAG #3          @LBA*/         
*     3 DCDPDSEX BIT(1),         /* POSIX FILE SYSTEM FILE       @LBA*/         
*     3 DCDSTRP  BIT(1),         /* EXTENDED FORMAT              @LBA*/         
*     3 DCDDDMEX BIT(1),         /* DDM INFO EXIST FOR THIS DS   @LDA*/         
*     3 DCDCPOIT BIT(1),         /* CHECKPOINTED Datasets   @K170027A*/         
*     3 DCDGT64K BIT(1),         /* GT 64K TRACKS SUPPORT ADDED  @LHD*/         
*     3 DCDCMPTV BIT(1),         /* COMPRESSION TYPE IS VALID    @21A*/         
*     3 *        BIT(2),         /* RESERVED                     @21C*/         
*   2 *        CHAR(2),          /* reserved                     @LBC*/         
*   2 DCDDSORG BIT(16),          /* DATA SET ORGANIZATION            */         
*    3 DCDDSOR0 BIT(8),          /* DATA SET ORGANIZATION BYTE 0     */         
*     4 DCDDSGIS BIT(1),         /* IS - INDEXED SEQUENTIAL ORG      */         
*     4 DCDDSGPS BIT(1),         /* PS - PHYSICAL SEQUENTIAL ORG     */         
*     4 DCDDSGDA BIT(1),         /* DA - DIRECT ORGANIZATION         */         
*     4 *        BIT(3),         /* RESERVED                         */         
*     4 DCDDSGPO BIT(1),         /* PO - PARTITIONED ORGANIZATION    */         
*     4 DCDDSGU  BIT(1),         /* U  - UNMOVEABLE DATA SET         */         
*    3 DCDDSOR1 BIT(8),          /* DATA SET ORGANIZATION BYTE 1     */         
*     4 DCDDSGGS BIT(1),         /* GS - GRAPHICS ORGANIZATION       */         
*     4 *        BIT(3),         /* RESERVED                         */         
*     4 DCDDSGVS BIT(1),         /* VS - VSAM DATA SET               */         
*     4 *        BIT(3),         /* RESERVED                         */         
*   2 DCDRECRD BIT(8),           /* RECORD FORMAT BYTE               */         
*     3 DCDRECFM BIT(2),         /* RECORD FORMAT BITS               */         
*     3 DCDRECFT BIT(1),         /* TRACK OVERFLOW                   */         
*     3 DCDRECFB BIT(1),         /* BLOCKED RECORDS                  */         
*     3 DCDRECFS BIT(1),         /* STANDARD BLOCKS(F) OR SPANNED(V) */         
*     3 DCDRECFA BIT(1),         /* ANSI CONTROL CHARACTER           */         
*     3 DCDRECFC BIT(1),         /* MACHINE CONTROL CHARACTER        */         
*     3 *        BIT(1),         /* RESERVED                         */         
*   2 DCDNMEXT FIXED(8),         /* NUMBER OF EXTENTS USED           */         
*   2 DCDVOLSR CHAR(6),          /* VOLUME SERIAL NUMBER             */         
*   2 DCDBKLNG FIXED(15),        /* BLOCK LENGTH                     */         
*   2 DCDLRECL FIXED(15),        /* RECORD LENGTH                    */         
*   /* Extended Address Volume EAV support has introduced new    @15A*/         
*   /* fields to contain the following data set sizes in 63 bit  @15A*/         
*   /* format.  New and migrating applications should change to  @15A*/         
*   /* reference the 63 bit values: DCDALLSX DCDUSESX            @15A*/         
*   /*                              DCDSCALX DCDNMBLX            @15A*/         
*   2 DCDALLSP FIXED(31),     /* DATA SET ALLOCATED SPACE IN KBs @15A*/         
*                             /* (1024) WHEN DCDALLFG IS ON      @15A*/         
*   2 DCDUSESP FIXED(31),     /* DATA SET USED SPACE IN KBs      @15A*/         
*                             /* (1024) WHEN DCDUSEFG IS ON      @15A*/         
*   2 DCDSCALL FIXED(31),     /* DATA SET SECONDARY SPACE IN KBs @15A*/         
*                             /* (1024) WHEN DCDSECFG IS ON      @15A*/         
*   2 DCDNMBLK FIXED(31),     /* DATA SET UNUSABLE SPACE IN KBs  @15A*/         
*                             /* (1024) WHEN DCDNMBFG IS ON      @15A*/         
*   2 DCDCREDT CHAR(4),          /* CREATION DATE (YYYYDDDF)         */         
*   2 DCDEXPDT CHAR(4),          /* EXPIRATION DATE (YYYYDDDF)       */         
*   2 DCDLSTRF CHAR(4),          /* DATE LAST REFERENCED (YYYYDDDF)  */         
*   2 DCDDSSER CHAR(6),          /* DATA SET SERIAL NUMBER           */         
*   2 DCDVOLSQ CHAR(2),          /* VOLUME SEQUENCE NUMBER           */         
*   2 DCDLBKDT CHAR(8),          /* LAST BACKUP TIME & DATE          */         
*   2 DCDDCLAS,                                                                 
*     3 DCDDCLNG FIXED(15),      /* DATA CLASS NAME LENGTH           */         
*     3 DCDDATCL CHAR(30),       /* DATA CLASS NAME                  */         
*   2 DCDSCLAS,                                                                 
*     3 DCDSCLNG FIXED(15),      /* STORAGE CLASS NAME LENGTH        */         
*     3 DCDSTGCL CHAR(30),       /* STORAGE CLASS NAME               */         
*   2 DCDMCLAS,                                                                 
*     3 DCDMCLNG FIXED(15),      /* MANAGEMENT CLASS NAME LENGTH     */         
*     3 DCDMGTCL CHAR(30),       /* MANAGEMENT CLASS NAME            */         
*   2 DCDSTOGP,                                                                 
*     3 DCDSGLNG FIXED(15),      /* STORAGE GROUP NAME LENGTH        */         
*     3 DCDSTGRP CHAR(30),       /* STORAGE GROUP NAME               */         
*   2 DCDCCSID CHAR(2),          /* CODED CHAR SET IDENTIFIER    @LDA*/         
*   2 DCDCATF  BIT(8),           /* Cataog Flags                ]@L9A*/         
*     3 *        BIT(6),         /* RESERVED                     @L9A*/         
*     3 DCDEATRC BIT(2),         /* EATTR IN CATALOG            ]@L9A*/         
*   2 DCDDSCBF BIT(8),           /* DSCB FLAGS                   @L9A*/         
*     3 *        BIT(6),         /* RESERVED                     @L9A*/         
*     3 DCDEATRV BIT(2),         /* EATTR in VTOC               ]@L9A*/         
*   2 DCDUDSIZ CHAR(8),          /* USER DATA SIZE               @LDA*/         
*   2 DCDCUDSZ CHAR(8),          /* COMPRESSED USER DATA SIZE    @LDA*/         
*   2 DCDEXFLG BIT(16),          /* COMPRESSION FLAGS       @XS_AM101*/         
*     3 DCDBDSZ  BIT(1),         /* INVALID DATA SIZES      @XS_AM101*/         
*   2 DCDSCNT  FIXED(16),        /* Stripe Count                 @LHC*/         
*   2 DCDOVERA FIXED(32),        /* OVER-ALLOCATED SPACE         @P3C*/         
*   2 DCDACCT  CHAR(32),         /* Account Information          @LGA*/         
*   2 DCDFLAG5 BIT(8),           /*                              @15A*/         
*                                /* 63BIT SPACE VALUES RETURNED  @15A*/         
*     3 DCDALLFX BIT(1),         /* ALLOCATED SPACE IN DCDALLSX  @15A*/         
*     3 DCDUSEFX BIT(1),         /* USED SPACE IN DCDUSESX       @15A*/         
*     3 DCDSCAFX BIT(1),         /* SECONDARY SPACE IN DCDSCALX  @15A*/         
*     3 DCDNMBFX BIT(1),         /* UNUSABLE SPACE IN DCDNMBLX   @15A*/         
*     3 *        BIT(4),         /* RESERVED                     @15A*/         
*   2 *        BIT(24),          /* RESERVED FOR DCDFLAG6-8      @15A*/         
*   2 *        CHAR(3),          /* RESERVED                     @15C*/         
*   2 DCDDS9F1 BIT(8),           /* FORMAT 9 DSCB FLAG      @LKM @LFA*/         
*     3 DCDDS9CR BIT(1),         /* FORMAT 9 DSCB BUILT BY CREATE@LFA*/         
*     3 *        BIT(7),         /* RESERVED                @LKM @LFA*/         
*   2 DCDJBNMC CHAR(8),          /* Jobname used to create the   @LFA*/         
*                                /* date set described by its    @LFA*/         
*                                /* format 8 DSCB           @LKM @LFA*/         
*   2 DCDSTNMC CHAR(8),          /* Stepname used to create the  @LFA*/         
*                                /* date set described by its    @LFA*/         
*                                /* format 8 DSCB           @LKM @LFA*/         
*   2 DCDTIMEC CHAR(6),          /* Microseconds since midnight, @LFA*/         
*                                /* local time, that the dataset @LFA*/         
*                                /* described by its format 8    @LFA*/         
*                                /* DSCB was created,  See field @LFA*/         
*                                /* DCDCREDT for the date   @LKM @LFA*/         
*   2 *        CHAR(2),          /* RESERVED                     @15C*/         
*                                /*       63bit size values      @15A*/         
*   2 DCDALLSX FIXED(63),        /* DATA SET ALLOCATED IN KBs@15M@L9A*/         
*                                /*   (1024) WHEN DCDALLFX IS ON @15A*/         
*   2 DCDUSESX FIXED(63),        /* SPACE USED IN KBs        @15M@L9A*/         
*                                /*   (1024) WHEN DCDUSEFX IS ON @15A*/         
*   2 DCDSCALX FIXED(63),        /* SECONDARY SPACE IN KBs   @15M@L9A*/         
*                                /*   (1024) WHEN DCDSCAFX IS ON @15A*/         
*   2 DCDNMBLX FIXED(63),        /* UNUSEABLE SPACE IN KBs   @15M@L9A*/         
*                                /*   (1024) WHEN DCDNMBFX IS ON @LPA*/         
*   2 DCDXPSEV FIXED(8),         /* PS Extended Format version   @LPC*/         
*   2 DCDCTYPE FIXED(8),         /* Compression type             @21A*/         
*   2 DCDAENCR,                  /* ENCRYPTION INFORMATION       @E1A*/         
*     3 DCDATYPE  FIXED(16),     /* ENCRYPTION TYPE              @E1A*/         
*     3 DCDAKLBL  CHAR(64),      /* ENCRYPTION KEY LABEL         @E1A*/         
*   2 *        CHAR(16),         /* RESERVED                     @E1C*/         
*   2 DCDADSIE CHAR(0);          /* END OF DCUDSET                   */         
*                                                                               
*/********************************************************************/         
*/* VSAM BASE CLUSTER ASSOCIATION NAME (RECORD TYPE 'A')             */         
*/********************************************************************/         
*DECLARE                                                                        
* 1 DCASSOC DEFINED(DCUDATA),    /* VSAM BASE CLUSTER ASSOCIATIONS              
*                                   (DEFINED ON DCUDATA)             */         
*   2 DCADSNAM CHAR(44),         /* DATA SET NAME                    */         
*   2 DCAASSOC CHAR(44),         /* BASE CLUSTER NAME                */         
*   2 DCAFLAG1 BIT(8),           /* VSAM INFORMATION FLAG #1         */         
*     3 DCAKSDS  BIT(1),         /* KEY SEQUENCED DATA SET           */         
*     3 DCAESDS  BIT(1),         /* ENTRY SEQUENCED DATA SET         */         
*     3 DCARRDS  BIT(1),         /* RELATIVE RECORD DATA SET         */         
*     3 DCALDS   BIT(1),         /* LINEAR DATA SET                  */         
*     3 DCAKRDS  BIT(1),         /* KEY RANGE DATA SET               */         
*     3 DCAAIX   BIT(1),         /* ALTERNATE INDEX DATA SET         */         
*     3 DCADATA  BIT(1),         /* VSAM DATA COMPONENT              */         
*     3 DCAINDEX BIT(1),         /* VSAM INDEX COMPONENT             */         
*   2 DCAFLAG2 BIT(8),           /* VSAM INFORMATION FLAG #2         */         
*     3 DCAKR1ST BIT(1),         /* 1ST SEGMENT OF KR DATA SET       */         
*     3 DCAIXUPG BIT(1),         /* ALTERNATE INDEX W/ UPGRADE       */         
*     3 DCAVRRDS BIT(1),         /* VARIABLE RRDS            @KC11064*/         
*     3 DCANSTAT BIT(1),         /* NO VSAM STATS IN RECORD      @LCA*/         
*     3 DCASRCI  BIT(1),         /* RBA is CI number             @LEA*/         
*     3 DCAG4G   BIT(1),         /* Extended Addressability      @LEA*/         
*     3 DCAZFS   BIT(1),         /* zFS data set                 @19A*/         
*     3 *        BIT(1),         /* RESERVED                     @19C*/         
*   2 *        CHAR(2),          /* RESERVED                         */         
*   2 DCAHURBA FIXED(32),        /* HIGH USED RBA / CI           @LEC*/         
*   2 DCAHARBA FIXED(32),        /* HIGH ALLOCATED RBA / CI      @LEC*/         
*   2 DCANLR   FIXED(31),        /* NUMBER OF LOGICAL RECORDS    @LCA*/         
*   2 DCADLR   FIXED(31),        /* NUMBER OF DELETED RECORDS    @LCA*/         
*   2 DCAINR   FIXED(31),        /* NUMBER OF INSERTED RECORDS   @LCA*/         
*   2 DCAUPR   FIXED(31),        /* NUMBER OF UPDATED RECORDS    @LCA*/         
*   2 DCARTR   FIXED(31),        /* NUMBER OF RETRIEVED RECORDS  @LCA*/         
*   2 DCAASP   FIXED(31),        /* BYTES OF FREESPACE IN DS     @LCA*/         
*   2 DCACIS   FIXED(31),        /* NUMBER OF CI SPLITS          @LCA*/         
*   2 DCACAS   FIXED(31),        /* NUMBER OF CA SPLITS          @LCA*/         
*   2 DCAEXC   FIXED(31),        /* NUMBER OF EXCPS              @LCA*/         
*   2 DCARKP   FIXED(15),        /* RELATIVE KEY POSITION        @LCA*/         
*   2 DCAKLN   FIXED(15),        /* KEY LENGTH                   @LCA*/         
*   2 DCAHURBC CHAR(8),          /* HIGH USED RBA CALC FRM CI@OWXXXXX*/         
*   2 DCAHARBC CHAR(8),          /* HI ALLOC RBA CALC FRM CI @OWXXXXX*/         
*   2 DCACISZ  FIXED(31),        /* NUMBER BYTES IN A CI         @LJA*/         
*   2 DCACACI  FIXED(31),        /* NUMBER CI'S IN A CA          @LJA*/         
*   2 DCATRDT  CHAR(4),          /* HSM CLASS TRANSITION DATE    @LQA*/         
*   2 *        CHAR(12),         /* RESERVED                     @LQC*/         
*   2 DCASSOCE CHAR(0);          /* END OF DCASSOC                   */         
*                                                                               
*/********************************************************************/         
*/* VOLUME INFORMATION (RECORD TYPE 'V')                             */         
*/********************************************************************/         
*DECLARE                                                                        
* 1 DCVVOLI DEFINED(DCUDATA),    /* VOLUME INFORMATION (DEFINED                 
*                                             ON DCUDATA)            */         
*   2 DCVVOLSR CHAR(6),          /* VOLUME SERIAL NUMBER             */         
*   2 DCVFLAG1 BIT(8),           /* INFORMATION FLAG #1              */         
*     3 DCVINXST BIT(2),         /* INDEX STATUS                     */         
*       4 DCVINXEX BIT(1),       /* INDEXED VTOC EXISTS              */         
*       4 DCVINXEN BIT(1),       /* INDEXED VTOC IS ENABLED          */         
*     3 DCVUSATR BIT(3),         /* USE ATTRIBUTE                    */         
*       4 DCVUSPVT BIT(1),       /*   PRIVATE                        */         
*       4 DCVUSPUB BIT(1),       /*   PUBLIC                         */         
*       4 DCVUSSTO BIT(1),       /*   STORAGE                        */         
*     3 DCVSHRDS BIT(1),         /* DEVICE IS SHAREABLE              */         
*     3 DCVPHYST BIT(2),         /* PHYSICAL STATUS                  */         
*   2 DCVERROR BIT(8),           /* ERROR INFORMATION FLAG           */         
*     3 DCVEVLCP BIT(1),         /* ERROR CALCULATING VOL CAPACITY   */         
*     3 DCVEBYTK BIT(1),         /* ERROR CALCULATING BYTES/TRK      */         
*     3 DCVELSPC BIT(1),         /* ERROR DURING LSPACE PROCESSING   */         
*     3 *        BIT(5),         /* RESERVED                         */         
*   2 *        CHAR(3),          /* RESERVED                         */         
*   2 DCVPERCT FIXED(8),         /* PERCENT FREESPACE ON VOLUME      */         
*   2 DCVFRESP FIXED(32),        /* FREESPACE ON VOLUME (IN KB)      */         
*   2 DCVALLOC FIXED(32),        /* ALLOCATED SPACE ON VOL (IN KB)   */         
*   2 DCVVLCAP FIXED(32),        /* TOTAL CAPACITY OF VOL (IN KB)    */         
*   2 DCVFRAGI FIXED(31),        /* FRAGMENTATION INDEX              */         
*   2 DCVLGEXT FIXED(32),        /* LARGEST FREE EXTENT ON VOLUME    */         
*   2 DCVFREXT FIXED(31),        /* NUMBER OF FREE EXTENTS           */         
*   2 DCVFDSCB FIXED(31),        /* FREE DSCBS IN VTOC               */         
*   2 DCVFVIRS FIXED(31),        /* FREE VIRS                        */         
*   2 DCVDVTYP CHAR(8),          /* DEVICE TYPE                      */         
*   2 DCVDVNUM FIXED(16),        /* DEVICE NUMBER                    */         
*   2 *        CHAR(2),          /* RESERVED                     @LJC*/         
*   2 DCVSTGGP,                                                                 
*     3 DCVSGLNG FIXED(15),      /* STORAGE GROUP NAME LENGTH        */         
*     3 DCVSGTCL CHAR(30),       /* STORAGE GROUP NAME               */         
*   2 DCVDPTYP CHAR(8),          /* PHYSICAL DEVICE TYPE         @LJA*/         
*   2 DCVTRPCT FIXED(8),         /* PCT FREESPACE ON TR MGD EAV  @L6A*/         
*   2 DCVEAVOL BIT(8),           /* BINARY INDICATOR FOR EAV     @L6A*/         
*     3 DCVCYLMG BIT(1),         /* CYL MGD INDIDCATOR          @L12C*/         
*     3 *        BIT(7),         /* RESERVED                     @L6A*/         
*   2 *        CHAR(2),          /* RESERVED                     @L6A*/         
*   2 DCVTRFSP FIXED(32),        /* FREE SPACE IN MB, TRK MGD    @L7C*/         
*   2 DCVTRALC FIXED(32),        /* ALLOC SPACE IN MB, TRK MGD   @L6A*/         
*   2 DCVTRVLC FIXED(32),        /* TOTAL CAPACITY IN MB, TRK MGD@L6A*/         
*   2 DCVTRFRG FIXED(32),        /* FRAG. INDEX, TRK MGD PART    @L6A*/         
*   2 DCVTRLGE FIXED(32),        /* LARGEST EXT, TRK MGD PART    @L6A*/         
*   2 DCVTRFRX FIXED(32),        /* NO. OF FREE EXT, TRK MGD PART@L6A*/         
*   2 DCVFCYLS FIXED(32),        /* FREE CYLINDERS ON VOLUME     @19A*/         
*   2 DCVFTRKS FIXED(32),        /* FREE TRACKS ON VOLUME        @19A*/         
*   2 *        CHAR(4),          /* RESERVED                     @19C*/         
*   2 DCVVOLIE CHAR(0);          /* END OF DCVVOLI               @P7C*/         
*                                                                               
*%DCU_SMSA: ;                                                                   
*/********************************************************************/         
*/* DATA CLASS CONSTRUCT INFORMATION (RECORD TYPE 'DC')              */         
*/********************************************************************/         
*DECLARE                                                   /*@OY59794*/         
* 1 DDCDATA DEFINED(DCUDATA),/* DATA CLASS DEFINITION (DEFINED ON               
*                                DCUDATA)                    @OY59794*/         
*   2 DDCNMFLD,              /* SPACE FOR NAME AND LENGTH    @OY59794*/         
*     3 DDCNMLEN FIXED(15),  /* LENGTH OF NAME               @OY59794*/         
*     3 DDCNAME  CHAR(30),   /* NAME OF DATA CLASS           @OY59794*/         
*   2 DDCUSER  CHAR(8),      /* USERID OF LAST UPDATER       @OY59794*/         
*   2 DDCDATE  CHAR(10),     /* DATE OF LAST UPDATE          @OY59794*/         
*   2 *        CHAR(2),      /* RESERVED                     @OY59794*/         
*   2 DDCTIME  CHAR(8),      /* TIME OF LAST UPDATE          @OY59794*/         
*   2 DDCDESC  CHAR(120),    /* DESCRIPTION                  @OY59794*/         
*                                                                               
*   /*****************************************************************/         
*   /* DATA CLASS PARAMETERS SPECIFICATION BITS              @OY59794*/         
*   /*****************************************************************/         
*   2 DDCSPEC,                                             /*@OY59794*/         
*     3 DDCSPEC1 BIT(8),                                   /*@OY59794*/         
*       4 DDCFRORG BIT(1),   /* RECORG SPECIFIED FLAG        @OY59794*/         
*       4 DDCFLREC BIT(1),   /* LRECL SPECIFIED FLAG         @OY59794*/         
*       4 DDCFRFM  BIT(1),   /* RECFM SPECIFIED FLAG         @OY59794*/         
*       4 DDCFKLEN BIT(1),   /* KEYLEN SPECIFIED FLAG        @OY59794*/         
*       4 DDCFKOFF BIT(1),   /* KEYOFF SPECIFIED FLAG        @OY59794*/         
*       4 DDCFEXP  BIT(1),   /* EXPIRATION ATTRIB SPEC'D FLAG@OY59794*/         
*       4 DDCFRET  BIT(1),   /* RETENTION  ATTRIB SPEC'D FLAG@OY59794*/         
*       4 DDCFPSP  BIT(1),   /* PRIMARY SPACE SPECIFIED FLAG @OY59794*/         
*     3 DDCSPEC2 BIT(8),                                   /*@OY59794*/         
*       4 DDCFSSP  BIT(1),   /* SECONDARY SPACE SPEC'D FLAG  @OY59794*/         
*       4 DDCFDIR  BIT(1),   /* DIRECTORY BLOCKS SPEC'D FLAG @OY59794*/         
*       4 DDCFAUN  BIT(1),   /* ALLOCATION UNIT SPEC'D FLAG  @OY59794*/         
*       4 DDCFAVR  BIT(1),   /* AVGREC SPECIFIED FLAG        @OY59794*/         
*       4 DDCFVOL  BIT(1),   /* VOLUME CNT SPECIFIED FLAG    @OY59794*/         
*       4 DDCFCIS  BIT(1),   /* DATA CI SIZE SPECIFIED FLAG  @OY59794*/         
*       4 DDCFCIF  BIT(1),   /* FREE CI % SPECIFIED FLAG     @OY59794*/         
*       4 DDCFCAF  BIT(1),   /* FREE CA % SPECIFIED FLAG     @OY59794*/         
*     3 DDCSPEC3 BIT(8),                                   /*@OY59794*/         
*       4 DDCFXREG BIT(1),   /* SHAREOPT XREGION SPEC'D FLAG @OY59794*/         
*       4 DDCFXSYS BIT(1),   /* SHAREOPT XSYSTEM SPEC'D FLAG @OY59794*/         
*       4 DDCFIMBD BIT(1),   /* VSAM IMBED SPECIFIED FLAG    @OY59794*/         
*       4 DDCFRPLC BIT(1),   /* VSAM REPLICATE SPECIFIED FLAG@OY59794*/         
*       4 DDCFCOMP BIT(1),   /* COMPACTION SPECIFIED FLAG    @OY60048*/         
*       4 DDCFMEDI BIT(1),   /* MEDIA TYPE SPECIFIED FLAG    @OY60048*/         
*       4 DDCFRECT BIT(1),   /* RECORDING TECHNOLOGY FLAG    @OY60048*/         
*       4 DDCFVEA  BIT(1),   /* VSAM extended addressing         @LJC*/         
*                            /*   on = ext addr allowed          @LJA*/         
*     3 DDCSPEC4 BIT(8),        /*                               @LJC*/         
*       4 DDCSPRLF BIT(1),      /* Space Constraint Relief       @LJA*/         
*       4 DDCREDUS BIT(1),      /* Reduce Space by% specified    @LJA*/         
*       4 DDCRABS  BIT(1),      /* Rec Access Bias specified     @LJA*/         
*       4 DDCFCT   BIT(1),      /* Compression type specified    @L2A*/         
*       4 DDCBLMT  BIT(1),      /* Block Size Limit specified    @L2A*/         
*       4 DDCCFS   BIT(1),      /* Data Set CF Cache specified   @L2A*/         
*       4 DDCDVCS  BIT(1),      /* Dynamic Volume Count specified@LFA*/         
*       4 DDCFSCAL BIT(1),      /* Performance Scaling specified @LFC*/         
*                                                                               
*   /*****************************************************************/         
*   /* DATA SET ATTRIBUTES                                   @OY59794*/         
*   /*****************************************************************/         
*   2 DDCRCORG FIXED(8),     /* DATA SET RECORG -- SEE CONST @OY59794*/         
*   2 DDCRECFM FIXED(8),     /* DATA SET RECFM -- SEE CONST  @OY59794*/         
*   2 DDCDSFLG BIT(8),                                     /*@OY59794*/         
*     3 DDCBLK   BIT(1),     /* 1 = BLOCKED, 0 = UNBLKED/NULL@OY59794*/         
*     3 DDCSTSP  BIT(1),     /* 1 = STANDARD OR SPANNED      @OY59794*/         
*     3 *        BIT(6),     /* RESERVED                     @OY59794*/         
*   2 DDCCNTL  FIXED(8),     /* CARRIAGE CONTROL - SEE CONST @OY59794*/         
*   2 DDCRETPD FIXED(31),    /* RETENTION PERIOD             @OY59794*/         
*     3 DDCEXPYR FIXED(15),  /* EXPDT - YEAR                 @OY59794*/         
*     3 DDCEXPDY FIXED(15),  /* EXPDT - ABSOLUTE DAY OF YEAR @OY59794*/         
*   2 DDCVOLCT FIXED(15),    /* MAXIMUM VOL COUNT FOR EXTEND @OY59794*/         
*   2 DDCDSNTY FIXED(16),    /* DSN TYPE -- SEE CONSTANTS    @OY59794*/         
*                                                                               
*   /*****************************************************************/         
*   /* DATA SET SPACE ATTRIBUTES                             @OY59794*/         
*   /*****************************************************************/         
*   2 DDCSPPRI FIXED(31),    /* PRIMARY SPACE AMOUNT         @OY59794*/         
*   2 DDCSPSEC FIXED(31),    /* SECONDARY SPACE AMOUNT       @OY59794*/         
*   2 DDCDIBLK FIXED(31),    /* DIRECTORY BLOCKS             @OY59794*/         
*   2 DDCAVREC FIXED(8),     /* AVGREC - M, K, U: SEE CONST  @OY59794*/         
*   2 DDCREDUC FIXED(8),     /* Reduce primary or secondary      @LJA*/         
*                            /* space by 0-99%. DDCSPRLF         @LJA*/         
*                            /* and DDCREDUS must be on          @LJA*/         
*   2 DDCRBIAS FIXED(8),     /* VSAM Record Access Bias          @LJA*/         
*                            /* REQUIRES DDCRABS             @K140275*/         
*                            /* SEE CONSTANTS                    @LJA*/         
*   2 DDCDVC   FIXED(8),     /* DYNAMIC VOLUME COUNT ADDED       @05A*/         
*   2 DDCAUNIT FIXED(31),    /* ALLOCATION UNIT AMOUNT       @OY59794*/         
*   2 *        CHAR(4),      /* Reserved                         @L2C*/         
*   2 DDCLRECL FIXED(31),    /* RECORD LENGTH                @OY59794*/         
*                                                                               
*   /*****************************************************************/         
*   /* VSAM ATTRIBUTES                                       @OY59794*/         
*   /*****************************************************************/         
*   2 DDCCISZ  FIXED(31),    /* CISIZE FOR KS, ES OR RR      @OY59794*/         
*   2 DDCFRSP,               /* FREESPACE                    @OY59794*/         
*     3 DDCCIPCT FIXED(15),  /* CI FREESPACE %               @OY59794*/         
*     3 DDCCAPCT FIXED(15),  /* CA FREESPACE %               @OY59794*/         
*   2 DDCSHROP FIXED(15),    /* VSAM SHARE OPTIONS           @OY59794*/         
*     3 DDCXREG  FIXED(8),   /* VSAM XREGION SHARE OPTIONS   @OY59794*/         
*     3 DDCXSYS  FIXED(8),   /* VSAM XSYSTEM SHARE OPTIONS   @OY59794*/         
*   2 DDCVINDX BIT(8),       /* VSAM SHARE OPTIONS           @OY59794*/         
*     3 DDCIMBED BIT(1),     /* 1 = IMBED, 0 = NO            @OY59794*/         
*     3 DDCREPLC BIT(1),     /* 1 = REPLICATE, 0 = NO        @OY59794*/         
*     3 *        BIT(6),     /* RESERVED                     @OY59794*/         
*   2 DDCKLEN  FIXED(8),     /* VSAM KEY LENGTH              @OY59794*/         
*   2 DDCKOFF  FIXED(15),    /* VSAM KEY OFFSET              @OY59794*/         
*   2 DDCCAMT  FIXED(8),     /* VSAM candidate amount        @K131799*/         
*   2 *        FIXED(8),     /* RESERVED                         @PAA*/         
*                                                                               
*   /*****************************************************************/         
*   /* MOUNTABLE DEVICE ATTRIBUTES                           @OY60048*/         
*   /*****************************************************************/         
*   2 DDCCOMP  FIXED(8),     /* COMPACTION TYPE - SEE                           
*                                CONSTANTS                   @OY60048*/         
*   2 DDCMEDIA FIXED(8),     /* MEDIA TYPE -- SEE CONSTANTS  @OY60048*/         
*   2 DDCRECTE FIXED(8),     /* RECORDING TECHNOLOGY --SEE                      
*                                CONSTANTS BELOW             @OY60048*/         
*   2 *        CHAR(1),      /* RESERVED                     @OY60048*/         
*                                                                               
*   /*****************************************************************/         
*   /* RLS SUPPORT                                               @LJA*/         
*   /*****************************************************************/         
*   2 DDCRLS1,               /* RLS SUPPORT                      @LJA*/         
*    3 DDCBWOTP FIXED(8),    /* BWO TYPE REQUIRES DDCBWOS        @LJA*/         
*                            /* SEE CONSTANTS                    @LJA*/         
*    3 DDCLOGRC FIXED(8),    /* SPHERE RECOVERABILITY            @LJA*/         
*                            /* REQUIRES DDCLOGRS                @LJA*/         
*                            /* SEE CONSTANTS                    @LJA*/         
*    3 DDCSPAND FIXED(8),    /* RECORD SPANS CI ABILITY          @LJA*/         
*                            /* REQUIRES DDCSPANS                @LJA*/         
*                            /* SEE CONSTANTS                    @LJA*/         
*    3 DDCFRLOG FIXED(8),    /* CICSVR FRLOG TYPE                @L2A*/         
*                            /* REQUIRED DDCFRLGS                @L2A*/         
*                            /* SEE CONSTANTS                    @L2A*/         
*   2 DDCLOGNM,              /* LOG STREAM ID                    @LJA*/         
*                            /* REQUIRES DDCLSIDS            @K140275*/         
*    3  DDCLOGLN FIXED(15),  /* ID LENGTH                        @LJA*/         
*    3  DDCLOGID CHAR(26),   /* ID                               @LJA*/         
*   /*****************************************************************/         
*   /* DATA CLASS PARAMETERS SPECIFICATION BITS ADDITIONAL   @K140275*/         
*   /*****************************************************************/         
*   2 DDCSPECX,              /*                              @K140275*/         
*    3 DDCSPECA BIT(8),      /* ADDITIONAL SPECIFICATION FLAGS   @P1C*/         
*     4 DDCBWOS  BIT(1),     /* BWO SPECIFIED                @K140275*/         
*     4 DDCLOGRS BIT(1),     /* SPHERE RECOVERABILITY SPEC'D @K140275*/         
*     4 DDCSPANS BIT(1),     /* CI SPAN SPECIFIED            @K140275*/         
*     4 DDCLSIDS BIT(1),     /* LOGSTREAMID SPECIFIED        @K140275*/         
*     4 DDCFRLGS BIT(1),     /* FRLOG SPECIFIED                  @L2A*/         
*     4 DDCFEXTC BIT(1),     /* VSAM EXTENT CONSTRAINT SPEC'D    @11A*/         
*                            /*  See DDCEX255                    @11A*/         
*     4 DDCFA2GB BIT(1),     /* RLS above 2GB bar specified      @LFA*/         
*     4 DDCFPSEG BIT(1),     /* Performance Segmentaton specified@LFA*/         
*    3 DDCSPECB BIT(8),      /* Position mapped with that in DCD @L1A*/         
*     4 DDCFKYL1 BIT(1),     /* KEY Label 1                      @LKA*/         
*     4 DDCFKYC1 BIT(1),     /* KEY Code 1                       @LKA*/         
*     4 DDCFKYL2 BIT(1),     /* KEY Label 2                      @LKA*/         
*     4 DDCFKYC2 BIT(1),     /* KEY Code 2                       @LKA*/         
*     4 DDCFVSP  BIT(1),     /* SMBVSP specified                 @LKA*/         
*     4 DDCFSDB  BIT(1),     /* SDB is specified             @L9M@L1A*/         
*     4 DDCFOVRD BIT(1),     /* Override JCL is specified    @L9M@L1A*/         
*     4 DCDFCAR  BIT(1),     /* CA Reclaim specified      @      @LKA*/         
*    3 DDCSPECC BIT(8),      /* Position mapped with that in DCD @L1A*/         
*     4 DDCFATTR BIT(1),     /* EATTR specified              @L9M@L1A*/         
*     4 DDCFLOGR BIT(1),     /* LOGREPLICATE specified           @LRA*/         
*     4 DDCFRMOD BIT(1),     /* VSAM SMB RMODE31 spec in dataclas@LSA*/         
*     4 DDCGSRDU BIT(1),     /* Guaranteed Space Reduction       @LUA*/         
*     4 DDCFKLBL BIT(1),     /* DASD Data set Key label          @E1A*/         
*     4 *        BIT(3),     /* RESERVED                         @E1C*/         
*    3 DDCSPECD BIT(8),      /* Position mapped with that in DCD @L1A*/         
*     4 *        BIT(8),     /* RESERVED                     @L9C@L1A*/         
*   2 DDCSFLG  BIT(8),       /* Space Flags                      @L1A*/         
*    3 DDCOVRD  BIT(1),      /* 1 = Space Override               @L1A*/         
*    3 DDCSDB   BIT(1),      /* 1 =Force Sys Determined Blocksize@L1A*/         
*    3 *        BIT(6),      /* RESERVED                         @L1A*/         
*   /************************************************************@11A*/         
*   /* DATA CLASS VSAM ATTRIBUTES                                @11A*/         
*   /************************************************************@11A*/         
*   2 DDCVSAM1 CHAR(4),      /* RESERVED                         @11A*/         
*     4 DDCVBYT1 CHAR(1),      /* RESERVED                       @11A*/         
*       5 DDCREUSE BIT(1),   /* 0=Reaccess ds in vsam cluster    @L2A*/         
*                            /* 1=Access ds as new data set      @L2A*/         
*       5 DDCSPEED BIT(1),   /* 0=Recovery Mode, reformat on load@L2A*/         
*                            /* 1=Speed Mode, not reformat on ld @L2A*/         
*       5 DDCEX255 BIT(1),     /* OVER 255 EXTENTS ALLOWED       @11A*/         
*       5 DDCLOGRP BIT(1),   /* 0=NOLOGREPLICATE 1=LOGREPLICATE  @LRA*/         
*       5 *        BIT(4),   /* RESERVED                         @LRC*/         
*     4 *        CHAR(3),      /* RESERVED                       @11A*/         
*   2 DDCEATTR CHAR(1),      /* EXTENDED ATTR IN DATACLASS      ]@P9M*/         
*   2 DDCCT    FIXED(8),     /* COMPRESSION TYPE                 @L2A*/         
*                            /* 0 = GENERIC     1 = TAILORED     @L2A*/         
*   2 DDCDSCF  FIXED(8),     /* Data Set CF cache value          @L2A*/         
*                            /* 0 = ALL  1 = UPDATEONLY  2 = NONE@L2A*/         
*   2 DDCRBYTE CHAR(1),      /* RLS byte                         @LFC*/         
*     4 DDCA2GB  BIT(1),     /* RLS Above 2GB Bar                @LFC*/         
*                            /* 0 = NO (defualt)  1 = YES        @LFA*/         
*     4 DDCRECLM BIT(1),     /* CA Reclaim                       @LKA*/         
*                            /* 0-Enable (default)               @LKA*/         
*                            /* 1-Disable                        @LKA*/         
*     4 *        BIT(6),     /* Reserved                         @LKC*/         
*   2 DDCBLKLM CHAR(8),      /* BLKSZLMT-32760 and higher        @L2A*/         
*     4 *        CHAR(4),    /* Reserve for future expansion     @L2A*/         
*     4 DDCBSZLM CHAR(4),    /* Value 32760 or higher            @L2A*/         
*   2 DDCTAPE1,              /* Tape support use                 @LFA*/         
*     4 DDCPSCA  FIXED(8),   /* scaling option:Yes NO or Blanks  @LFA*/         
*     4 DDCPSEG  FIXED(8),   /* Segmentation: Yes NO or Blanks   @LFA*/         
*     4 *        CHAR(2),    /* Reserved                         @LFA*/         
*   2 *          CHAR(3),    /* reserved                         @LKC*/         
*   2 DDCVSP,                /* SMB VSP field                    @LKA*/         
*     4 DDCVSPU   FIXED(8),  /* Unit for VSP value in CHAR       @LKA*/         
*       5 DDCVSPUK BIT(1),   /* Unit in KB                       @LKA*/         
*       5 DDCVSPUM BIT(1),   /* Unit in MB                       @LKA*/         
*     4 DDCVSPV   FIXED(24), /* VSP value                        @LKA*/         
*   2 DDCKYLB1 ,             /* KEYLABEL 1                       @LKC*/         
*     4 DDCKLBL1 FIXED(15),  /* Length of KEYLABEL 1             @LKA*/         
*     4 DDCKLBN1 CHAR(64),   /* KEYLABEL 1 name field            @LKA*/         
*   2 DDCKYCD1 FIXED(8),     /* KEYCODE  1                       @LKA*/         
*   2 *        FIXED(8),     /* filler for byte skipping         @LKA*/         
*   2 DDCKYLB2 ,             /* KEYLABEL 2                       @LKA*/         
*     4 DDCKLBL2 FIXED(15),  /* Length of KEYLABEL 2             @LKA*/         
*     4 DDCKLBN2 CHAR(64),   /* KEYLABEL 2 name field            @LKA*/         
*   2 DDCKYCD2 FIXED(8),     /* KEYCODE  2                       @LKA*/         
*   2 *        FIXED(8),     /* filler for byte skipping         @PFC*/         
*   2 *        CHAR(1),      /* Reserved                         @PFA*/         
*   2 DDCRMODE FIXED(8),     /* VSAM SMB RMODE31 for DCDRMODE    @LSA*/         
*                            /* 0=NONE 1=ALL 2=BUFF 3=CB         @LSA*/         
*   2 DDCDKYLB ,             /* DASD Data set Key Label          @E1A*/         
*     4 DDCDKLBL FIXED(15),  /* Data Set Key Label length        @E1A*/         
*     4 DDCDKLBN CHAR(64),   /* Data Set Key Label name          @E1A*/         
*   2 *        CHAR(28),     /* RESERVED                         @E1C*/         
*   2 DDCDATAE CHAR(0);      /* END OF DDCDATA               @K131951*/         
*                                                                               
*/********************************************************************/         
*/* STORAGE CLASS CONSTRUCT INFORMATION (RECORD TYPE 'SC')   @OY59794*/         
*/********************************************************************/         
*DECLARE                                                   /*@OY59794*/         
* 1 DSCDATA DEFINED(DCUDATA), /* STORAGE CLASS DEFINITION                       
*                                (DEFINED ON DCUDATA)        @OY59794*/         
*   2 DSCNMFLD,               /* SPACE FOR NAME AND LENGTH   @OY59794*/         
*     3 DSCNMLEN FIXED(15),   /* LENGTH OF NAME              @OY59794*/         
*     3 DSCNAME CHAR(30),     /* NAME OF STORAGE CLASS       @OY59794*/         
*   2 DSCUSER CHAR(8),        /* USERID OF LAST UPDATER      @OY59794*/         
*   2 DSCDATE CHAR(10),       /* DATE OF LAST UPDATE         @OY59794*/         
*   2 *       CHAR(2),        /* RESERVED                    @OY59794*/         
*   2 DSCTIME CHAR(8),        /* TIME OF LAST UPDATE         @OY59794*/         
*   2 DSCDESC CHAR(120),      /* DESCRIPTION                 @OY59794*/         
*                                                                               
*   /*****************************************************************/         
*   /* STORAGE CLASS FLAGS                                   @OY59794*/         
*   /*****************************************************************/         
*   2 DSCFLAGS BIT(8),                                     /*@OY59794*/         
*     3 DSCDFGSP BIT(1),      /* GUARANTEED SPACE 1=YES,0=NO @OY59794*/         
*     3 DSCDFAVL BIT(1),      /* AVAILABILITY, 1=SEE DSCAVAIL                   
*                                0=STANDARD (DEFAULT)        @OY59794*/         
*     3 DSCFDIRR BIT(1),      /* DIRECT RESPONSE TIME OBJECT,                   
*                                0=DON'T CARE, 1=SEE DSCDIRR @OY59794*/         
*     3 DSCFDIRB BIT(1),      /* DIRECT BIAS, 0= DON'T CARE                     
*                                1= SEE DSCDIRB              @OY59794*/         
*     3 DSCFSEQR BIT(1),      /* SEQ. RESPONSE TIME OBJECTIVE,                  
*                                0=DON'T CARE, 1=SEE DSCSEQR @OY59794*/         
*     3 DSCFSEQB BIT(1),      /* SEQ. BIAS, 0= DON'T CARE                       
*                                1= SEE DSCSEQB              @OY59794*/         
*     3 DSCSYNCD BIT(1),      /* SYNCDEV, 1 = YES, 0 = NO    @OY59794*/         
*     3 DSCFIAD  BIT(1),      /* 1 = INITIAL ACCESS RESPONSE @OY59794*/         
*   2 DSCFLAG2 BIT(8),                                     /*@OY60048*/         
*     3 DSCDFACC BIT(1),      /* ACCESSIBILITY,1=SEE DSCACCES                   
*                             0=DEFAULT=CONTINUOUS PREFERRED @OY60048*/         
*     3 DSCDFSDR BIT(1),      /* STRIPING SUSTAINED DATA RATE                   
*                                 0=NOT SPECD,1=SEE DSCSTSDR @OY60048*/         
*     3 DSCFDCFW BIT(1),      /* Direct CF weight specified:                    
*                                1 = YES 0 = NO                  @LHA*/         
*     3 DSCFSCFW BIT(1),      /* Sequential weight specified:                   
*                                1 = YES 0 = NO                  @LHA*/         
*     3 DSCVERSP BIT(1),      /* ACC Specified                   @08A*/         
*                             /* 1 = see DSCVERSN  0 = default   @08A*/         
*     3 DSCBUSP BIT(1),       /* ACC backup specified            @08A*/         
*                             /* 1 = see DSCBAKUP  0 = default   @08A*/         
*     3 DSCDSSEP BIT(1),      /* Data set Separation             @08A*/         
*                             /* 0=perform 1=bypass              @08A*/         
*     3 DSCTIERS BIT(1),      /* Multi-tiered specified          @08A*/         
*                             /* see DSCTIER for value           @08A*/         
*   2 DSCVERSN FIXED(8),      /* ACC Version parm yes,no,blank   @08A*/         
*   2 DSCBAKUP FIXED(8),      /* ACC backup parm yes,no,blank    @08C*/         
*                                                                               
*   /*****************************************************************/         
*   /* STORAGE CLASS ATTRIBUTES                              @OY59794*/         
*   /*****************************************************************/         
*   2 DSCAVAIL FIXED(8),      /* AVAILABILITY OPTIONS        @OY59794*/         
*   2 DSCDIRB  FIXED(8),      /* DIRECT BIAS - SEE CONSTANTS @OY59794*/         
*   2 DSCSEQB  FIXED(8),      /* SEQ. BIAS - SEE CONSTANTS   @OY59794*/         
*   2 DSCACCES FIXED(8),      /* ACCESSIBILITY - SEE CONSTS. @OY60048*/         
*   2 DSCIACDL FIXED(31),     /* INITIAL ACCESS RESPONSE SEC @OY59794*/         
*   2 DSCDIRR  FIXED(31),     /* MICROSECOND RESPONSE TIME                      
*                                OBJECTIVE -- DIRECT         @OY59794*/         
*   2 DSCSEQR  FIXED(31),     /* MICROSECOND RESPONSE TIME                      
*                                OBJECTIVE -- SEQUENTIAL     @OY59794*/         
*   2 DSCSTSDR FIXED(31),     /* STRIPING SUSTAINED DATA RATE    @P1C*/         
*                                                                               
*   2 DSCCCHST CHAR(32) BDY(HWORD),  /* Cache Set Name           @LHA*/         
*    3 DSCCSLEN FIXED(15),    /* Cache Set Name Length           @LHA*/         
*    3 DSCCSNAM CHAR(30),     /* Cache Set Name value            @LHA*/         
*   2 DSCDIRCW FIXED(15),     /* Direct CF weight                @LHA*/         
*   2 DSCSEQCW FIXED(15),     /* Sequential CF weight            @LHA*/         
*   2 DSCFLAG3 BIT(8),        /* RESERVED                    @OY60048*/         
*     4 DSCTIER BIT(1),       /* 1=multi-tier SG, 0 = no         @L5A*/         
*     4 DSCPAVS BIT(1),       /* PAV specified 1 = see DSCPAV    @08A*/         
*     4 DSCFOLS BIT(1),       /* OAM Sublevel  1 = see DSCSTOSL  @P5C*/         
*     4 *       BIT(1),       /* RESERVED                        @LNA*/         
*     4 DSCFDCLS BIT(1),      /* Disconnect Sphere at CLOSE      @LNA*/         
*                             /* specified.                      @LNA*/         
*     4 *       BIT(3),       /* Reserved                        @LNC*/         
*   2 DSCPAV   FIXED(8),      /* Parallel Access Volume value    @08A*/         
*   2 DSCSTOSL FIXED(8),      /* OAM Sublevel value              @08A*/         
*   2 DSCVFLG2 CHAR(1),       /* VSAM Flag2                      @LNA*/         
*     4 DSCDCLS  BIT(1),      /* Disconnect Sphere at CLOSE      @LNA*/         
*                             /* value - 0 = No (default)        @LNA*/         
*                             /*       - 1 = Yes                 @LNA*/         
*     4 *       BIT(7),       /* Reserved                        @H1A*/         
*   2 DSCCMMFT FIXED(8),      /* CMM Flags                       @H1A*/         
*     4 DSCHLERD BIT(1),      /* Eligible for zHyperLink reads   @H1A*/         
*     4 DSCHLEWR BIT(1),      /* Eligible for zHyperLink write   @H1A*/         
*     4 *        BIT(6),      /* Reserved                        @H1C*/         
*   2 *        CHAR(11),      /* RESERVED                        @H1C*/         
*   2 DSCDATAE CHAR(0);       /* END OF DSCDATA              @OY59794*/         
*                                                                               
*/********************************************************************/         
*/* MANAGEMENT CLASS CONSTRUCT INFORMATION (RECORD TYPE 'MC')@OY59794*/         
*/********************************************************************/         
*DECLARE                                                   /*@OY59794*/         
* 1 DMCDATA  DEFINED(DCUDATA), /* MANAGEMENT CLASS DEFINITION                   
*                                 (DEFINED ON DCUDATA)       @OY59794*/         
*   2 DMCNMFLD,                /* SPACE FOR NAME AND LENGTH  @OY59794*/         
*     3 DMCNMLEN FIXED(15),    /* LENGTH OF NAME             @OY59794*/         
*     3 DMCNAME  CHAR(30),     /* NAME OF MANAGEMENT CLASS   @OY59794*/         
*   2 DMCUSER  CHAR(8),        /* USERID OF LAST UPDATER     @OY59794*/         
*   2 DMCDATE  CHAR(10),       /* DATE OF LAST UPDATE        @OY59794*/         
*   2 *        CHAR(2),        /* RESERVED                   @OY59794*/         
*   2 DMCTIME  CHAR(8),        /* TIME OF LAST UPDATE        @OY59794*/         
*   2 DMCDESC  CHAR(120),      /* DESCRIPTION                @OY59794*/         
*   /*****************************************************************/         
*   /* GENERAL SPECIFICATION FLAGS                           @OY59794*/         
*   /*****************************************************************/         
*   2 DMCSPEC1 BIT(8),         /* ATTRIBUTE SPECIFIED FLAGS:                    
*                                  1= SPECIFIED              @OY59794*/         
*     3 DMCFBVER BIT(1),       /* DMCBKVS SPECIFIED FLAG     @OY59794*/         
*     3 DMCFBVRD BIT(1),       /* DMCBVRD SPECIFIED FLAG     @OY59794*/         
*     3 DMCFRBK  BIT(1),       /* DMCBKDY SPECIFIED FLAG     @OY59794*/         
*     3 DMCFRNP  BIT(1),       /* DMCBKNP SPECIFIED FLAG     @OY59794*/         
*     3 DMCFEXDT BIT(1),       /* DMCEXDAT SPECIFIED FLAG    @OY59794*/         
*     3 DMCFEXDY BIT(1),       /* DMCEXPDY SPECIFIED FLAG    @OY59794*/         
*     3 DMCFPRDY BIT(1),       /* DMCPRDY SPECIFIED FLAG     @OY59794*/         
*     3 *        BIT(1),       /* RESERVED                   @OY59794*/         
*   2 DMCSPEC2 BIT(8),         /* ATTRIBUTE SPECIFIED FLAGS:                    
*                                  1= SPECIFIED              @OY59794*/         
*     3 DMCFL1DY BIT(1),       /* DMCL1DY SPECIFIED FLAG     @OY59794*/         
*     3 DMCFRLMG BIT(1),       /* DMCRLOMG SPECIFIED FLAG    @OY59794*/         
*     3 DMCFPELE BIT(1),       /* DMCPELEM SPECIFIED FLAG    @OY59794*/         
*     3 DMCFBKFQ BIT(1),       /* DMCBKFQ SPECIFIED FLAG     @OY59794*/         
*     3 DMCFCTSR BIT(1),       /* DMCCTSRL SPECIFIED FLAG        @X1A*/         
*     3 DMCFCTCP BIT(1),       /* DMCCTCPY SPECIFIED FLAG        @X1A*/         
*     3 *        BIT(2),       /* RESERVED                       @X1C*/         
*                                                                               
*   /*****************************************************************/         
*   /* PARTIAL RELEASE CRITERIA                              @OY59794*/         
*   /*****************************************************************/         
*   2 DMCRLF   BIT(8),                                     /*@OY59794*/         
*     3 DMCPREL  BIT(1),       /* RELEASE 1 = YES, 0 = NO    @OY59794*/         
*     3 DMCPRCN  BIT(1),       /* CONDITIONAL PARTREL        @OY59794*/         
*     3 DMCPRIM  BIT(1),       /* IMMEDIATE VALUE FOR REL    @OY59794*/         
*     3 *        BIT(5),       /* RESERVED                   @OY59794*/         
*   2 *        CHAR(1),        /* RESERVED                   @OY59794*/         
*                                                                               
*   /*****************************************************************/         
*   /* GENERATION DATA GROUP CRITERIA                        @OY59794*/         
*   /*****************************************************************/         
*   2 DMCGDGFL BIT(8),         /* GDG ATTRIBUTE FLAGS        @OY59794*/         
*     3 DMCRLOMG BIT(1),       /* MIGRATE OR EXPIRE ROLLED OFF                  
*                                 GDS, 1=MIGRATE, 0=EXPIRE   @OY59794*/         
*     3 *        BIT(7),       /* RESERVED                   @OY59794*/         
*   2 *        CHAR(1),        /* RESERVED                   @OY59794*/         
*   2 DMCPELEM FIXED(15),      /* NUM GDG ELEMENTS ON PRIMARY@OY59794*/         
*                                                                               
*   /*****************************************************************/         
*   /* DATA SET EXPIRATION CRITERIA                          @OY59794*/         
*   /*****************************************************************/         
*   2 DMCEXPF  BIT(8),         /* FLAGS                      @OY59794*/         
*     3 DMCARNOL BIT(1),       /* DMCRDARC IS NOLIMIT = 1    @OY59794*/         
*     3 *        BIT(7),       /* RESERVED                   @OY59794*/         
*   2 DMCEXPAC FIXED(8),       /* EXPIRE ACTION: SEE CONST   @OY59794*/         
*   2 DMCRDARC FIXED(15),      /* RETAIN DAYS ARCHIVE COPY   @OY59794*/         
*                                                                               
*   /*****************************************************************/         
*   /* DATA SET RETENTION CRITERIA                           @OY59794*/         
*   /*****************************************************************/         
*   2 DMCRETF  BIT(8),         /* DATA SET RETENTION FLAGS   @OY59794*/         
*     3 DMCDYNOL BIT(1),       /* 1=EXPIRE AFTER DAYS= NOLIMIT                  
*                                  ELSE 0 AND SEE DMCEXPDY   @OY59794*/         
*     3 DMCDTNOL BIT(1),       /* 1=EXPIRE AFTER DATE= NOLIMIT                  
*                                  ELSE 0 AND SEE DMCEXDAT   @OY59794*/         
*     3 *        BIT(6),       /* RESERVED                   @OY59794*/         
*   2 DMCRFMT  FIXED(8),       /* Format used for DMCEXDAT --                   
*                                 DATE OR DAYS: SEE CONSTANTS@OY59794*/         
*   2 *        CHAR(2),        /* RESERVED                   @OY59794*/         
*   2 DMCEXPDY FIXED(31),      /* EXPIRE AFTER DAYS NO USE   @OY59794*/         
*   2 DMCEXDAT FIXED(31),      /* EXPIRE DAYS SINCE CREATE   @OY59794*/         
*     3 DMCEYEAR FIXED(16),    /* EXPIRE DATE SINCE CREATE   @OY59794*/         
*     3 DMCEDAY  FIXED(16),    /* SEE DMCRFMT FOR FORMAT     @OY59794*/         
*                                                                               
*   /*****************************************************************/         
*   /* DATA SET MIGRATION CRITERIA                           @OY59794*/         
*   /*****************************************************************/         
*   2 DMCMIGF  BIT(8),         /* DATA SET MIGRATION FLAGS   @OY59794*/         
*     3 DMCL2LIM BIT(1),       /* MIN DAYS for Cloud migration   @M1C*/         
*                              /* 0=NOLIMIT ELSE SEE DMCL2DY     @M1A*/         
*     3 *        BIT(1),       /* RESERVED                   @OY59794*/         
*     3 DMCL1NOL BIT(1),       /* MIN DAYS ON LEVEL 1/LAST USE,                 
*                                 1=NOLIMIT ELSE SEE DMCL1DY @OY59794*/         
*     3 *        BIT(5),       /* RESERVED                   @OY59794*/         
*   2 *        CHAR(1),        /* RESERVED                   @OY59794*/         
*   2 DMCPRDY  FIXED(15),      /* MIN DAYS ON PRIM/LAST USE  @OY59794*/         
*   2 DMCL1DY  FIXED(15),      /* MIN DAYS ON LVL 1/LAST USE @OY59794*/         
*   2 DMCCMAU  FIXED(8),       /* COMMAND OR AUTO MIGRATE --                    
*                                  SEE CONSTANTS BELOW       @OY59794*/         
*   2 *        CHAR(1),        /* RESERVED                   @OY59794*/         
*                                                                               
*   /*****************************************************************/         
*   /* DATA SET BACKUP CRITERIA                              @OY59794*/         
*   /*****************************************************************/         
*   2 DMCBKFLG BIT(8),         /* BACKUP FLAGS               @OY59794*/         
*     3 DMCRBNOL BIT(1),       /*1=>RETAIN DAYS ONLY BACKUP VERS=               
*                                   NOLIMIT. 0=>SEE DMCBKNP FOR                 
*                                   DAYS TO KEEP ONLY BACKUP @OY59794*/         
*     3 DMCNPNOL BIT(1),       /*1=>RETAIN DAYS EXTRA BACKUP VERS               
*                                  = NOLIMIT. 0=>SEE DMCBKDY FOR                
*                                  DAYS TO KEEP EXTRA BACKUP @OY59794*/         
*     3 *        BIT(1),       /* RESERVED                   @OY59794*/         
*     3 DMCAUTBK BIT(1),       /* 1=AUTO BACKUP ALLOWED      @OY59794*/         
*     3 DMCCPYTF BIT(1),       /* COPY TECHNIQUE, 1=SEE DMCCPYTC                
*                                  0=DEFAULT=STANDARD        @OY60048*/         
*     3 *        BIT(3),       /* RESERVED                   @OY60048*/         
*   2 *        CHAR(3),        /* RESERVED                   @OY59794*/         
*   2 DMCBKFQ  FIXED(15),      /* BACKUP FREQUENCY           @OY59794*/         
*   2 DMCBKVS  FIXED(15),      /* NUMBER OF BACKUP VERSIONS  @OY59794*/         
*   2 DMCBVRD  FIXED(15),      /* NUM OF VERSIONS: DS DELETED@OY59794*/         
*   2 DMCBKDY  FIXED(15),      /* DAYS TO KEEP BACKUP VERSION@OY59794*/         
*   2 DMCBKNP  FIXED(15),      /* DAYS TO KEEP ONLY BACKUP   @OY59794*/         
*   2 DMCBADU  FIXED(8),       /* ALLOW ADMIN OR USER BACKUP --                 
*                                 SEE CONSTANTS BELOW        @OY59794*/         
*   2 DMCCPYTC FIXED(8),       /* COPY TECHNIQUE - SEE CONSTANTS                
*                                                            @OY60048*/         
*   2 DMCBKUDC CHAR(8),        /* BACKUP DESTINATION CLASS   @OY59794*/         
*                                                                               
*   /*****************************************************************/         
*   /* MAXIMUM RETENTION CRITERIA                            @OY59794*/         
*   /*****************************************************************/         
*   2 DMCMRETF BIT(8),         /* MAXIMUM RETENTION FLAGS    @OY59794*/         
*     3 DMCRPNOL BIT(1),       /* RETPD (RETAIN PD) 1=NOLIMIT                   
*                                 ELSE SEE DMCMRTDY          @OY59794*/         
*     3 *        BIT(7),       /* RESERVED                   @OY59794*/         
*                                                        /*      @LLD*/         
*   2 DMCMRTDY FIXED(24),      /* MAXIMUM DAYS TO RETAIN         @LLC*/         
*                                                                               
*   /*****************************************************************/         
*   /* CLASS TRANSITION CRITERIA                             @OY59794*/         
*   /*****************************************************************/         
*   2 DMCTSCR  BIT(8),         /*TIME SINCE CREATION FLAGS.  @OY59794*/         
*     3 DMCTCYR  BIT(1),       /* YEARS SPECIFIED.           @OY59794*/         
*     3 DMCTCMN  BIT(1),       /* MONTHS SPECIFIED.          @OY59794*/         
*     3 DMCTCDY  BIT(1),       /* DAYS SPECIFIED.            @OY59794*/         
*     3 *        BIT(5),       /* RESERVED.                  @OY59794*/         
*   2 DMCTSLU  BIT(8),         /*TIME SINCE LAST USED FLAGS. @OY59794*/         
*     3 DMCTSYR  BIT(1),       /* YEARS SPECIFIED.           @OY59794*/         
*     3 DMCTSMN  BIT(1),       /* MONTHS SPECIFIED.          @OY59794*/         
*     3 DMCTSDY  BIT(1),       /* DAYS SPECIFIED.            @OY59794*/         
*     3 *        BIT(5),       /* RESERVED.                  @OY59794*/         
*   2 DMCPERD  BIT(8),         /* PERIODIC FLAGS.            @OY59794*/         
*     3 DMCPEMN  BIT(1),       /* MONTHLY SPECIFIED.         @OY59794*/         
*     3 DMCPEQD  BIT(1),       /* QUARTERLY ON DAY SPEC.     @OY59794*/         
*     3 DMCPEQM  BIT(1),       /* QUARTERLY ON MONTH SPEC.   @OY59794*/         
*     3 DMCPEYD  BIT(1),       /* YEARLY ON DAY SPEC.        @OY59794*/         
*     3 DMCPEYM  BIT(1),       /* YEARLY IN MONTH SPEC.      @OY59794*/         
*     3 DMCFIRST BIT(1),       /* FIRST DAY OF PERIOD SPEC.  @OY59794*/         
*     3 DMCLAST  BIT(1),       /* LAST DAY OF PERIOD SPEC.   @OY59794*/         
*     3 *        BIT(1),       /* RESERVED.                  @OY59794*/         
*   2 *          CHAR(1),      /* RESERVED.                  @OY59794*/         
*   2 DMCVSCR,                 /* TIME SINCE CREATION VALUES @OY59794*/         
*     3 DMCVSCY  FIXED(15),    /* TIME SINCE CREATION YEARS  @OY59794*/         
*     3 DMCVSCM  FIXED(15),    /* TIME SINCE CREATION MONTHS @OY59794*/         
*     3 DMCVSCD  FIXED(15),    /* TIME SINCE CREATION DAYS   @OY59794*/         
*   2 DMCVSLU,                 /* TIME SINCE LAST USED       @OY59794*/         
*     3 DMCVSUY  FIXED(15),    /* TIME SINCE LAST USED YEARS @OY59794*/         
*     3 DMCVSUM  FIXED(15),    /* TIME SINCE LAST USED MONTHS@OY59794*/         
*     3 DMCVSUD  FIXED(15),    /* TIME SINCE LAST USED DAYS  @OY59794*/         
*   2 DMCVPRD  FIXED(15),      /* PERIODIC VALUES            @OY59794*/         
*   2 DMCVPMD  FIXED(15),      /* PERIODIC MONTHLY ON DAY    @OY59794*/         
*   2 DMCVPQT,                 /* PERIODIC QUARTERLY VALUES. @OY59794*/         
*     3 DMCVPQD  FIXED(15),    /* PERIODIC QUARTERLY ON DAY  @OY59794*/         
*     3 DMCVPQM  FIXED(15),    /* PERIODIC QUARTERLY IN MONTH@OY59794*/         
*   2 DMCVPYR,                 /* PERIODIC YEARLY VALUES.    @OY59794*/         
*     3 DMCVPYD  FIXED(15),    /* PERIODIC YEARLY ON DAY     @OY59794*/         
*     3 DMCVPYM  FIXED(15),    /* PERIODIC YEARLY IN MONTH   @OY59794*/         
*                                                                               
*   2 *        CHAR(16),     /* RESERVED                     @OY60048*/         
*   2 DMCCTSRL FIXED(15),      /* HSM Class Transition           @X1A*/         
*                              /* Serialization Error Action     @X1A*/         
*   2 DMCCTCPY FIXED(15),      /* HSM Class Transition Copy      @X1A*/         
*                              /* Technique                      @X1A*/         
*   2 DMCCL2DY FIXED(15),      /* Min days/last to move to cloud @M1A*/         
*   2 DMCCLOUD CHAR(32) BDY(HWORD),  /* Cloud name               @M1A*/         
*     3 DMCCLLEN FIXED(15),    /* The length of the cloud name   @M1A*/         
*     3 DMCCLNAM CHAR(30),     /* The cloud name                 @M1A*/         
*   2 *        CHAR(2),        /* for alignment                  @M1A*/         
*   2 DMCSZLTE FIXED(32),      /* Data size threshold less or =  @M1A*/         
*   2 DMCSZGT  FIXED(32),      /* Data size threshold greater    @M1A*/         
*   2 DMCACLTE FIXED(8),       /* Action taken after DMCSZLTE    @M1A*/         
*                              /* threshold met                  @M1A*/         
*   2 DMCACGT  FIXED(8),       /* Action taken after DMCSZGT     @M1A*/         
*                              /* threshold met                  @M1A*/         
*   2 *        CHAR(402),      /* RESERVED                       @M1A*/         
*   2 DMCDATAE CHAR(0);        /* END OF DMCDATA             @OY59794*/         
*                                                                               
*/********************************************************************/         
*/* BASE CONFIGURATION INFORMATION (RECORD TYPE 'BC')        @OY59794*/         
*/********************************************************************/         
*DECLARE                                                   /*@OY59794*/         
* 1 DBCDATA DEFINED(DCUDATA),/* BASE CONFIGURATION INFORMATION                  
*                                (DEFINED ON DCUDATA)        @OY59794*/         
*   2 *        CHAR(32),     /* RESERVED                     @OY59794*/         
*   2 DBCUSER  CHAR(8),      /* USERID OF LAST UPDATER       @OY59794*/         
*   2 DBCDATE  CHAR(10),     /* DATE OF LAST UPDATE          @OY59794*/         
*   2 *        CHAR(2),      /* RESERVED                     @OY59794*/         
*   2 DBCTIME  CHAR(8),      /* TIME OF LAST UPDATE          @OY59794*/         
*   2 DBCDESC  CHAR(120),    /* DESCRIPTION                  @OY59794*/         
*                                                                               
*   /*****************************************************************/         
*   /* BASE CONFIGURATION FLAGS                              @OY59794*/         
*   /*****************************************************************/         
*   2 DBCFLAGS BIT(8),       /* Reserved                     @OW20434*/         
*   2 DBCFLGDC   BIT(8),     /* DCOLLECT flags               @OW20434*/         
*     3 DBC32NAM BIT(1),     /* 0 = use DBCFSYSN             @OW20434*/         
*                            /* 1 = use DBCSYSDT             @OW20434*/         
*     3 *        BIT(7),     /* Reserved                     @OW20434*/         
*   2 *        CHAR(2),      /* RESERVED                     @OW20434*/         
*                                                                               
*   /*****************************************************************/         
*   /* BASE CONFIGURATION DEFAULTS                           @OY59794*/         
*   /*****************************************************************/         
*   2 DBCDEFMC,              /* DEFAULT MANAGEMENT CLASS     @OY59794*/         
*     3 DBCMCLEN FIXED(15),  /* DEFAULT MC LENGTH OF NAME    @OY59794*/         
*     3 DBCMCNAM CHAR(30),   /* DEFAULT MANAGEMENT CLASS NAME@OY59794*/         
*   2 DBCDGEOM BDY(WORD),    /* DEFAULT DEVICE GEOMETRY      @OY59794*/         
*     3 DBCTRKSZ FIXED(31),  /* TRACK SIZE IN BYTES          @OY59794*/         
*     3 DBCCYLCP FIXED(31),  /* CYL CAPACITY (TRK/CYL)       @OY59794*/         
*   2 DBCDUNIT CHAR(8),      /* DEFAULT UNIT                 @OY59794*/         
*                                                                               
*   /*****************************************************************/         
*   /* BASE CONFIGURATION INFORMATION                        @OY59794*/         
*   /*****************************************************************/         
*   2 DBCSRST CHAR(8),       /* SMS RESOURCE STATUS TOKEN    @OY59794*/         
*   2 DBCSTAT FIXED(8),      /* DATA SET STATUS -- SEE CONST @OY59794*/         
*   2 *      CHAR(3),        /* RESERVED                     @OY59794*/         
*   2 DBCFSYSN(8) CHAR(8),   /* SYSTEM NAMES                 @OY59794*/         
*   2 DBCSCDSN  CHAR(44),    /* FOR ACDS ONLY: NAME OF SCDS                     
*                               FROM WHICH IT WAS ACTIVATED  @OY59794*/         
*                                                                               
*   /*****************************************************************/         
*   /* SYSTEM FEATURES                                       @OY59794*/         
*   /*****************************************************************/         
*   2 DBCSFEAT(8) CHAR(2),   /* SUPPORTED SYSTEM FEATURES    @OY59794*/         
*   2 DBCSYSNT(8) FIXED(8),  /* TYPE OF SYSTEM NAMES -                          
*                                 SEE CONSTANTS              @OW02196*/         
*   2 DBCSYSDT(32),          /* System related data              @LMA*/         
*     3 DBCSYSNM CHAR(8),    /* System/group name                @LMA*/         
*     3 DBCSYSFT CHAR(2),    /* Supported system features        @LMA*/         
*     3 *        CHAR(2),    /* Reserved                     @K131753*/         
*     3 DBCSNMTY FIXED(8),   /* System name type for this entry                 
*                               see constants                @K131753*/         
*     3 *        CHAR(3),    /* Reserved                     @K131753*/         
*   2 *        CHAR(16),     /* RESERVED                     @OY60048*/         
*   2 DBCSEPNL FIXED(15),    /* DS Sep Profile name length       @L4A*/         
*   2 DBCSEPNM CHAR(54),     /* DS Sep Profile Name(Membr)       @L4A*/         
*   2 DBCDATAE CHAR(0);      /* END OF DBCDATA               @OY59794*/         
*                                                                               
*/********************************************************************/         
*/* STORAGE GROUP CONSTRUCT INFORMATION (RECORD TYPE 'SG')   @OY59794*/         
*/********************************************************************/         
*DECLARE                                                   /*@OY59794*/         
* 1 DSGDATA DEFINED(DCUDATA),/* STORAGE GROUP DEFINITION                        
*                                (DEFINED ON DCUDATA)        @OY59794*/         
*   2 DSGNMFLD,              /* SPACE FOR NAME AND LENGTH    @OY59794*/         
*     3 DSGNMLEN FIXED(15),  /* LENGTH OF NAME               @OY59794*/         
*     3 DSGNAME  CHAR(30),   /* NAME OF DATA CLASS           @OY59794*/         
*   2 DSGUSER  CHAR(8),      /* USERID OF LAST UPDATER       @OY59794*/         
*   2 DSGDATE  CHAR(10),     /* DATE OF LAST UPDATE          @OY59794*/         
*   2 *        CHAR(2),      /* RESERVED                     @OY59794*/         
*   2 DSGTIME  CHAR(8),      /* TIME OF LAST UPDATE          @OY59794*/         
*   2 DSGDESC  CHAR(120),    /* DESCRIPTION                  @OY59794*/         
*                                                                               
*   /*****************************************************************/         
*   /* STORAGE GROUP FLAG INFORMATION                        @OY59794*/         
*   /*****************************************************************/         
*   2 DSGFLAGS CHAR(1),      /* FLAGS AND RESERVED           @OY59794*/         
*     3 DSGFABUP BIT(1),     /* HSM AUTO BACKUP, 1=YES,0=NO  @OY59794*/         
*     3 DSGFAMIG BIT(1),     /* AUTO MIGRATION, 1=YES, 0=NO  @OY59794*/         
*     3 DSGFADMP BIT(1),     /* AUTO DUMP, 1 = YES, 0 = NO   @OY59794*/         
*     3 DSGFTHRS BIT(1),     /* THRESHOLDS SPECIFIED:                           
*                               1 = YES, 0 = NO              @OY59794*/         
*     3 DSGFGBKU BIT(1),     /* GUARANTEED BACKUP FREQ.                         
*                               SPECIFIED, 1=YES, 0=NO       @OY59794*/         
*     3 DSGGBNOL BIT(1),     /* GUARANTEED BACKUP FREQ.                         
*                               1=NOLIMIT, 0=SEE DSGGBKUF    @OY59794*/         
*     3 DSGFIMIG BIT(1),     /* INTERVAL MIGRATION                              
*                                 1 = YES 0 = NO             @OY59794*/         
*     3 DSGFPSM  BIT(1),     /* PRIMARY SPACE MGMT           @OW20434*/         
*                            /* 1 = YES 0 = NO               @OW20434*/         
*   2 DSGFLGDC BIT(8),       /* RESERVED                     @OW20434*/         
*     3 DSG32NAM BIT(1),     /* 0 = Use DSGFPRST, DSGCNFRM   @OW20434*/         
*                            /* 1 = Use DSGSSTAT             @OW20434*/         
*   2 *        CHAR(2),      /* RESERVED                   4@20D @20C*/         
*                                                                               
*   /*****************************************************************/         
*   /* STORAGE GROUP ATTRIBUTES                              @OY59794*/         
*   /*****************************************************************/         
*   2 DSGFTYPE FIXED(8),     /* STORAGE GROUP TYPE -- SEE                       
*                               CONSTANTS BELOW              @OY59794*/         
*   2 DSGFHTHR FIXED(8),     /* HIGH THRESHOLD - 0 TO 99 %   @OY59794*/         
*   2 DSGFLTHR FIXED(8),     /* LOW THRESHOLD - 0 TO 99 %    @OY59794*/         
*   2 *        CHAR(1),      /* RESERVED                     @OY59794*/         
*   2 DSGFVMAX FIXED(31),    /* VIO MAX DATA SET SIZE        @OY59794*/         
*   2 DSGFVUNT CHAR(4),      /* VIO UNIT TYPE                @OY59794*/         
*   2 DSGDMPCL(5) CHAR(8),   /* DUMP CLASSES FOR AUTODUMP    @OY59794*/         
*   2 DSGFPRST(8),           /* STATUS BY PROCESSOR          @OY59794*/         
*     3 DSGSTAT FIXED(8),    /* STATUS                       @OY59794*/         
*   2 DSGABSYS CHAR(8),      /* AUTO BACKUP SYSTEM           @OY59794*/         
*   2 DSGADSYS CHAR(8),      /* AUTO DUMP SYSTEM             @OY59794*/         
*   2 DSGAMSYS CHAR(8),      /* AUTO MIGRATE SYSTEM          @OY59794*/         
*   2 DSGCNFRM(8),           /* CONFIRMED SMS STATUS FOR THIS                   
*                               STORAGE GROUP -- SEE CONSTANT@OY59794*/         
*     3 DSGCSMSS FIXED(8),   /* CONFIRMED SMS STATUS         @OY59794*/         
*   2 DSGGBKUF FIXED(31),    /* GUARANTEED BACKUP FREQ.      @OY59794*/         
*                                                                               
*   /*****************************************************************/         
*   /* STORAGE GROUP OAM ATTRIBUTES                          @OY59794*/         
*   /*****************************************************************/         
*   2 DSGTBLGR CHAR(8),      /*OAM TABLE SPACE ID GROUPNN        @12C*/         
*                            /*                                  @12D*/         
*   2 DSGOAMFL BIT(8),       /* OAM FLAGS                    @OY59794*/         
*     3 DSGFCYS  BIT(1),     /* OAM CYCLE START/END  GIVEN   @OY59794*/         
*     3 DSGFVLFT BIT(1),     /* VOLUME FULL THRESHOLD BIT    @OY59794*/         
*     3 DSGFDRST BIT(1),     /* DRIVE START THRESHOLD BIT    @OY59794*/         
*     3 DSGVFFER BIT(1),     /* VOLUME FULL@WRITE ERR GIVEN  @OY59794*/         
*     3 DSGVFERR BIT(1),     /* VOLUME FULL@WRITE ERROR BIT  @OY59794*/         
*     3 DSGFRETP BIT(1),     /* Retention Protection             @LFA*/         
*     3 DSGFDELP BIT(1),     /* Deletion Protection              @LFA*/         
*     3 *        BIT(1),     /* RESERVED                         @LFC*/         
*   2 *        CHAR(1),      /* RESERVED                     @OY59794*/         
*   2 DSGCYLST FIXED(8),     /* OAM CYCLE START TIME (HRS)   @OY59794*/         
*   2 DSGCYLED FIXED(8),     /* OAM CYCLE END TIME (HRS)     @OY59794*/         
*   2 DSGVOLFT FIXED(15),    /* VOLUME FULL THRESHOLD BIT    @OY59794*/         
*   2 DSGDRVST FIXED(15),    /* DRIVE START THRESHOLD BIT    @OY59794*/         
*   2 DSGOLIBS (8),          /* OPTICAL LIBRARIES.           @OY59794*/         
*     3 DSGOLBNL FIXED(15),  /* OPTICAL LIBRARY NAME LENGTH  @OY59794*/         
*     3 DSGOLBNM CHAR(8),    /* OPTICAL LIBRARY NAME         @OY59794*/         
*     3 *        CHAR(22),   /* RESERVED                     @OY59794*/         
*   2 DSGSSTAT(32),          /* Status by processor              @LMA*/         
*     3 DSGSYSST FIXED(8),   /* Requested system status          @LMA*/         
*     3 DSGCNSMS FIXED(8),   /* Confirmed SMS status             @LMA*/         
*     3 *        CHAR(6),    /* Reserved                         @LMA*/         
*                                                                               
*   2 *        CHAR(16),     /* RESERVED                     @OY60048*/         
*   2 DSGOFLOW FIXED(8),     /* Overflow                         @L4A*/         
*   2 DSGEXNLN FIXED(15) BDY(BYTE), /* Length of extend name     @L4A*/         
*   2 DSGEXNM  CHAR(30),     /* Extend SG Name                   @L4A*/         
*   2 *        CHAR(2),      /* RESERVED                         @PLC*/         
*   2 DSGFLAG2 BIT(8),       /* SG INFORMATION FLAG #2           @PLA*/         
*     3 DSGFLOWF  BIT(1),    /* Overflow SG specified ?          @PLA*/         
*     3 DSGEXNMF  BIT(1),    /* EXTENDED SG speicfied ?          @PLA*/         
*     3 *         BIT(1),    /* reserved                         @PLA*/         
*     3 DSGEAVBP  BIT(1),    /* BreakPointValue specified ?      @PLA*/         
*     3 *         BIT(4),    /* Reserved                         @PLA*/         
*   2 DSGSBKPT FIXED(31),    /* EAV BREAKPOINT VALUE             @L6A*/         
*   2 DSGSHTHR FIXED(16),    /* EAV High Threshold Per Cent for  @18C*/         
*                            /* the track-managed portion of @PIC@P7A*/         
*                            /* volume                       @PIC@P7A*/         
*   2 DSGSLTHR FIXED(16),    /* EAV Low Threshold Per Cent for   @18C*/         
*                            /* the track-managed portion of @PIC@P7A*/         
*                            /* volume                       @PIC@P7A*/         
*   2 DSGRERV  CHAR(24),     /* Reserved                         @LXA*/         
*   2 DSGTOTAP FIXED(8),     /* Total Space Alert Threshold %    @LXA*/         
*                            /* value 1-99                       @LXA*/         
*   2 DSGTMSAP FIXED(8),     /* Track Managed Space Alert        @LXA*/         
*                            /* Threshold % value 1-99           @LXA*/         
*   2 DSGOAMID CHAR(4),      /* DB2 Identifier for OAM           @O1C*/         
*   2 DSGDATAE CHAR(0);      /* END OF DDSGATA               @OY59794*/         
*                                                                               
*/********************************************************************/         
*/* SMS VOLUME DEFINITION (RECORD TYPE 'VL')                 @OY59794*/         
*/********************************************************************/         
*DECLARE                                                   /*@OY59794*/         
* 1 DVLDATA DEFINED(DCUDATA),/* SMS VOLUME DEFINITION (DEFINED                  
*                                ON DCUDATA)                 @OY59794*/         
*   2 DVLNMFLD,              /* SPACE FOR NAME AND LENGTH    @OY59794*/         
*     3 DVLNMLEN FIXED(15),  /* LENGTH OF NAME -- SHOULD BE 6@OY59794*/         
*     3 DVLVSER  CHAR(6),    /* VOLUME SERIAL NUMBER         @OY59794*/         
*     3 *        CHAR(24),   /* RESERVED FOR CONSISTENCY     @OY59794*/         
*   2 DVLUSER  CHAR(8),      /* USERID OF LAST UPDATER       @OY59794*/         
*   2 DVLDATE  CHAR(10),     /* DATE OF LAST UPDATE          @OY59794*/         
*   2 *        CHAR(2),      /* RESERVED                     @OY59794*/         
*   2 DVLTIME  CHAR(8),      /* TIME OF LAST UPDATE          @OY59794*/         
*                            /* NO DESC FOR VOLUME RECORD    @OY59794*/         
*                                                                               
*   /*****************************************************************/         
*   /* VOLUME RECORD FLAG INFORMATION                        @OY59794*/         
*   /*****************************************************************/         
*   2 DVLFLAGS CHAR(1),      /* FLAGS AND RESERVED           @OY59794*/         
*     3 DVLCONV BIT(1),      /* 1 = VOL IS IN CONVERSION     @OY59794*/         
*     3 *       BIT(7),      /* RESERVED                     @OW20434*/         
*   2 DVLFLGDC BIT(8),       /*          DCOLLECT FLGS       @OW20434*/         
*     3 DVL32NAM BIT(1),     /* 0 = Use DVLNSTAT, DVLCSMSS   @OW20434*/         
*                            /* 1 = Use DVLSSTAT             @OW20434*/         
*     3 *       BIT(7),      /* RESERVED                     @OW20434*/         
*   2 * CHAR(2),             /* RESERVED                     @OW20434*/         
*                                                                               
*   /*****************************************************************/         
*   /* STORAGE GROUP ASSOCIATION AND STATUS INFORMATION      @OY59794*/         
*   /*****************************************************************/         
*   2 DVLSG,                 /* LENGTH AND NAME OF STORGRP   @OY59794*/         
*     3 DVLSGLEN FIXED(15),  /* LENGTH OF STORGRP NAME       @OY59794*/         
*     3 DVLSTGRP CHAR(30),   /* STORAGE GROUP OF THIS VOLUME @OY59794*/         
*   2 DVLNSTAT(8),           /* STATUS BY SYSTEM             @OY59794*/         
*     3 DVLSMSS FIXED(8),    /* SMS STATUS                   @OY59794*/         
*     3 DVLMVSS FIXED(8),    /* MVS STATUS                   @OY59794*/         
*   2 DVLCSMSS(8) FIXED(8),  /* CONFIRMED SMS STATUS FOR VOL @OY59794*/         
*                                                                               
*   /*****************************************************************/         
*   /* VOLUME ATTRIBUTES                                     @OY59794*/         
*   /*****************************************************************/         
*   2 DVLNUCBA PTR(31),      /* ADDRESS OF UCB IF KNOWN      @OY59794*/         
*   2 DVLNTCPY FIXED(32),    /* TOTAL CAPACITY IN MB         @OY59794*/         
*   2 DVLNFREE FIXED(32),    /* AMOUNT FREE SPACE IN MB      @OY59794*/         
*   2 DVLNLEXT FIXED(32),    /* LARGEST FREE EXTENT IN MB    @OY59794*/         
*   2 DVLN0CNT FIXED(15),    /* VOLUME LEVEL RESET COUNT     @OY59794*/         
*   2 DVLTRKSZ FIXED(16),    /* VOLUME R1 TRACK CAPACITY     @OY59794*/         
*   2 DVLNLEVL FIXED(31),    /* UPDATE LEVEL FOR VOLUME      @OY59794*/         
*   2 DVLSSTAT(32),          /* System status array              @LMA*/         
*     3 DVLSTSMS FIXED(8),   /* SMS system status                @LMA*/         
*     3 DVLSTMVS FIXED(8),   /* MVS system status                @LMA*/         
*                            /* do not externalize VLDCNSMS      @PDD*/         
*     3 DVLCNSMS FIXED(8),   /* Confirmed SMS status             @PKA*/         
*     3 *        CHAR(5),    /* Reserved                         @PKC*/         
*                                                                               
*   2 DVLTRKCP FIXED(32),    /* Total capacity of trk mgd spc    @L6A*/         
*   2 DVLTRKFR FIXED(32),    /* Total free spc in trk mgd spc    @L6A*/         
*   2 DVLTRKEX FIXED(32),    /* Largest free space in trk mgd spc@L6A*/         
*   2 *        CHAR(4),      /* RESERVED                     @OY60048*/         
*   2 DVLDATAE CHAR(0);      /* ROUND TO DWORD BOUNDARY      @OY59794*/         
*                                                                               
*/********************************************************************/         
*/* AGGREGATE GROUP DEFINITION (RECORD TYPE 'AG')            @OY59794*/         
*/********************************************************************/         
*DECLARE                                                   /*@OY59794*/         
* 1 DAGDATA DEFINED(DCUDATA),/* AGGREGATE GROUP DEFINITION                      
*                                (DEFINED ON DCUDATA)        @OY59794*/         
*   2 DAGNMFLD,              /* SPACE FOR NAME AND LENGTH    @OY59794*/         
*     3 DAGNMLEN FIXED(15),  /* LENGTH OF NAME               @OY59794*/         
*     3 DAGNAME  CHAR(30),   /* NAME OF DATA CLASS           @OY59794*/         
*   2 DAGUSER  CHAR(8),      /* USERID OF LAST UPDATER       @OY59794*/         
*   2 DAGDATE  CHAR(10),     /* DATE OF LAST UPDATE          @OY59794*/         
*   2 *        CHAR(2),      /* RESERVED                     @OY59794*/         
*   2 DAGTIME  CHAR(8),      /* TIME OF LAST UPDATE          @OY59794*/         
*   2 DAGDESC  CHAR(120),    /* DESCRIPTION                  @OY59794*/         
*                                                                               
*   /*****************************************************************/         
*   /* AGGREGATE GROUP FLAG INFORMATION                      @OY59794*/         
*   /*****************************************************************/         
*   2 DAGFLAGS   BIT(8),                                   /*@OY59794*/         
*     3 DAGTENQ  BIT(1),     /* TOLERATE ENQ FAILURE, 1 = YES,                  
*                               0 = NO                       @OY59794*/         
*     3 DAGFRET  BIT(1),     /* RETENTION PERIOD SPECIFIED,                     
*                               1 = YES, 0 = NO              @OY59794*/         
*     3 DAGFNCPY BIT(1),     /* NUMBER OF COPIES SPECIFIED,                     
*                               1 = YES, 0 = NO              @OY60048*/         
*     3 *        BIT(5),     /* RESERVED                     @OY59794*/         
*   2 *          CHAR(3),    /* RESERVED                     @OY59794*/         
*                                                                               
*   /*****************************************************************/         
*   /* AGGREGATE GROUP ATTRIBUTES                            @OY59794*/         
*   /*****************************************************************/         
*   2 DAGRETPD   FIXED(31),  /* RETENTION PERIOD             @OY59794*/         
*     3 DAGEXPYR FIXED(15),  /* EXPIRATION YEAR              @OY59794*/         
*     3 DAGEXPDY FIXED(15),  /* ABSOLUTE DAY OF YEAR         @OY59794*/         
*   2 DAGDEST    CHAR(30),   /* DESTINATION                  @OY59794*/         
*   2 DAGPREFX   CHAR(33),   /* OUTPUT DATA SET PREFIX       @OY59794*/         
*   2 *          CHAR(1),    /* RESERVED                     @OY59794*/         
*   2 DAGIDSNM,              /* INSTRUCTION DATA SET NAME    @OY59794*/         
*     3 DAGINDSN CHAR(44),   /* DATA SET NAME                @OY59794*/         
*     3 DAGINMEM CHAR(8),    /* MEMBER NAME, IF ANY, OR BLANK@OY59794*/         
*   2 DAGDSNMS(5),           /* ARRAY OF DATA SET NAMES      @OY59794*/         
*     3 DAGDSN CHAR(44),     /* DATA SET NAME                @OY59794*/         
*     3 DAGMEM CHAR(8),      /* MEMBER NAME, IF ANY, OR BLANK@OY59794*/         
*   2 DAGMGMTC,              /* MANAGEMENT CLASS             @OY60048*/         
*     3 DAGMCLEN FIXED(15),  /* MANAGEMENT CLASS LENGTH      @OY60048*/         
*     3 DAGMCNAM CHAR(30),   /* MANAGEMENT CLASS NAME        @OY60048*/         
*   2 DAGNCOPY   FIXED(31),  /* NUMBER OF COPIES             @OY60048*/         
*                                                                               
*   2 *        CHAR(16),     /* RESERVED                     @OY60048*/         
*   2 DAGDATAE CHAR(0);      /* END OF DAGDATA               @OY59794*/         
*                                                                               
*/********************************************************************/         
*/* SMS OPTICAL DRIVE DEFINITION (RECORD TYPE 'DR')          @OY59794*/         
*/********************************************************************/         
*DECLARE                                                   /*@OY59794*/         
* 1 DDRDATA DEFINED(DCUDATA),/* SMS OPTICAL DRIVE DEFINITION                    
*                                (DEFINED ON DCUDATA)        @OY59794*/         
*   2 DDRNMFLD,              /* EXTENDED FOR CONSISTENCY     @OY59794*/         
*     3 DDRDVLEN FIXED(15),  /* LENGTH OF NAME -- SHOULD BE 8@OY59794*/         
*     3 DDRNAME,                                           /*@OY59794*/         
*       4 DDRDNAME CHAR(8),  /* DRIVE NAME                   @OY59794*/         
*       4 *        CHAR(22), /* RESERVED FOR CONSISTENCY     @OY59794*/         
*   2 DDRDUSER CHAR(8),      /* USERID OF LAST UPDATER       @OY59794*/         
*   2 DDRDDATE CHAR(10),     /* DATE OF LAST UPDATE          @OY59794*/         
*   2 DDRFLAGS CHAR(1),      /* Flags and reserved               @LMC*/         
*     3 DDR32NAM BIT(1),     /* 0 = Use DDRNSTAT                 @LMA*/         
*                            /* 1 = Use DDRSTAT                  @LMA*/         
*     3 *        BIT(7),     /* Reserved                         @LMA*/         
*   2 *        CHAR(1),      /* RESERVED                         @LMC*/         
*   2 DDRDTIME CHAR(8),      /* TIME OF LAST UPDATE          @OY59794*/         
*                                                                               
*   /*****************************************************************/         
*   /* LIBRARY NAME FIELDS                                   @OY59794*/         
*   /*****************************************************************/         
*   2 DDRLB,                 /* LENGTH AND NAME OF LIBRARY   @OY59794*/         
*     3 DDRLBLEN FIXED(15),  /* LENGTH OF LIBRARY NAME       @OY59794*/         
*     3 DDRLIBRY CHAR(30),   /* LIBRARY FOR THIS DRIVE       @OY59794*/         
*       4 DDRLBNM  CHAR(8),  /* LIBRARY NAME                 @OY59794*/         
*       4 *        CHAR(22), /* RESERVED                     @OY59794*/         
*                                                                               
*   /*****************************************************************/         
*   /* DRIVE STATUS BY SYSTEM                                @OY59794*/         
*   /*****************************************************************/         
*   2 DDRNSTAT(8),           /* STATUS BY SYSTEM             @OY59794*/         
*     3 DDROMST,             /* STATUS OF EACH DRIVE         @OY59794*/         
*       4 DDRSOUT  FIXED(8), /* REQUESTED OAM STATUS         @OY59794*/         
*       4 DDRCFCS  FIXED(8), /* CURRENT OAM STATUS           @OY59794*/         
*       4 *        CHAR(2),  /* RESERVED                     @OY59794*/         
*                                                                               
*   2 DDRDCONS FIXED(32),    /* CONSOLE ID                   @OY60048*/         
*   2 DDRSTAT(32),           /* System related data              @LMA*/         
*     3 DDRSYSST,            /* Status for this system           @LMA*/         
*       4 DDRREQST FIXED(8), /* Requested system status          @LMA*/         
*       4 DDRCURST FIXED(8), /* Current system status            @LMA*/         
*       4 *        CHAR(2),  /* Reserved                         @LMA*/         
*     3 *        CHAR(4),    /* Reserved                         @LMA*/         
*                                                                               
*   2 *        CHAR(16),     /* RESERVED                     @OY60048*/         
*   2 DDRDATAE CHAR(0);      /* END OF DDDRATA               @OY59794*/         
*                                                                               
*/********************************************************************/         
*/* SMS OPTICAL LIBRARY DEFINITION (RECORD TYPE 'LB')        @OY59794*/         
*/********************************************************************/         
*DECLARE                                                   /*@OY59794*/         
* 1 DLBDATA DEFINED(DCUDATA),/* SMS OPTICAL LIBRARY DEFINITION                  
*                                (DEFINED ON DCUDATA)        @OY59794*/         
*   2 DLBNMFLD,              /* EXTENDED FOR CONSISTENCY     @OY59794*/         
*     3 DLBNMLEN FIXED(15),  /* LENGTH OF LIBRARY NAME       @OY59794*/         
*     3 DLBLNAME CHAR(30),   /* LIBRARY NAME - LONG VERSION  @OY59794*/         
*       4 DLBNAME  CHAR(8),  /* NAME OF OPTICAL LIBRARY      @OY59794*/         
*       4 *        CHAR(22), /* RESERVED FOR CONSISTENCY     @OY59794*/         
*   2 DLBDUSER CHAR(8),      /* USERID OF LAST UPDATER       @OY59794*/         
*   2 DLBDDATE CHAR(10),     /* DATE OF LAST UPDATE          @OY59794*/         
*   2 DLBFLAGS CHAR(1),      /* Reserved                         @LMC*/         
*     3 DLB32NAM BIT(1),     /* 0 = Use DLBNSTAT                 @LMA*/         
*                            /* 1 = Use DLBSTAT                  @LMA*/         
*     3 *        BIT(7),     /* Reserved                         @LMA*/         
*   2 *        CHAR(5),      /* Reserved                         @LMC*/         
*   2 DLBDTIME CHAR(8),      /* TIME OF LAST UPDATE          @OY59794*/         
*                                                                               
*   /*****************************************************************/         
*   /* OPTICAL LIBRARY STATUS BY SYSTEM                      @OY59794*/         
*   /*****************************************************************/         
*   2 DLBNSTAT(8),           /* STATUS BY SYSTEM             @OY59794*/         
*     3 DLBOMST,             /* STATUS FOR EACH LIBRARY      @OY59794*/         
*       4 DLBSOUT  FIXED(8), /* REQUESTED OAM STATUS         @OY59794*/         
*       4 DLBCFCS  FIXED(8), /* CURRENT OAM STATUS           @OY59794*/         
*       4 *        CHAR(2),  /* RESERVED                     @OY59794*/         
*                                                                               
*   /*****************************************************************/         
*   /* OPTICAL LIBRARY ATTRIBUTES                            @OY59794*/         
*   /*****************************************************************/         
*   2 DLBTYPE  FIXED(8),     /* REAL OR PSEUDO LIBRARY       @OY59794*/         
*   2 *        CHAR(2),      /* RESERVED                     @OY59794*/         
*   2 DLBDTYPE FIXED(8),     /* LIBRARY DEVICE TYPE          @OY59794*/         
*   2 DLBDCONS FIXED(32),    /* CONSOLE ID                   @OY60048*/         
*   2 DLBEDVT  FIXED(8),     /* ENTRY DEFAULT USE ATTRIBUTE                     
*                                                (TAPE ONLY) @OY60048*/         
*   2 DLBEJD   FIXED(8),     /* EJECT DEFAULT (TAPE ONLY)    @OY60048*/         
*   2 DLBLCBID CHAR(5),      /* LIBRARY ID IN LIB.CONF.DB                       
*                                                (TAPE ONLY) @OY60048*/         
*   2 *        CHAR(1),      /* RESERVED                     @OY60048*/         
*   2 DLBEDUNM CHAR(8),      /* ENTRY DEFAULT UNIT NAME                         
*                                                (TAPE ONLY) @OY60048*/         
*   2 DLBDEFDC,              /* ENTRY DEFAULT DATA CLASS                        
*                                                (TAPE ONLY) @OY60048*/         
*     3 DLBDCLEN FIXED(15),  /* LENGTH OF ENTRY DEFAULT DC   @OY60048*/         
*     3 DLBDCLNM  CHAR(30),  /* DEFAULT DC LONG VERSION      @OY60048*/         
*       4 DLBDCNAM CHAR(8),  /* NAME OF ENTRY DEFAULT DC     @OY60048*/         
*       4 * CHAR(22),        /* RESERVED FOR CONSISTENCY     @OY60048*/         
*   2 DLBSTAT(32),           /* System related data              @LMA*/         
*     3 DLBSYSST,            /* Status for this system           @LMA*/         
*       4 DLBREQST FIXED(8), /* Requested system status          @LMA*/         
*       4 DLBCURST FIXED(8), /* Current system status            @LMA*/         
*       4 *        CHAR(2),  /* Reserved                         @LMA*/         
*     3 *        CHAR(4),    /* Reserved                         @LMA*/         
*                                                                               
*   2 *        CHAR(16),     /* RESERVED                     @OY60048*/         
*   2 DLBDATAE CHAR(0);      /* END OF DLBDATA               @OY59794*/         
*                                                                               
*/********************************************************************/         
*/* SMS Cache Names Definition (Record Type 'CN')                @LHA*/         
*/********************************************************************/         
*DECLARE                                                       /*@LHA*/         
* 1 DCNDATA DEFINED(DCUDATA),/* SMS Cache Set and SES cache names               
*                                (DEFINED ON DCUDATA)            @LHA*/         
*   2 DCNCSNAM CHAR(8),      /* Cache Set Name                   @LHA*/         
*   2 DCNSESNM(8) CHAR(16),  /* SES Cache name                   @LHA*/         
*   2 *        CHAR(16),     /* RESERVED                         @LHA*/         
*   2 DCNDATAE CHAR(0);      /* END OF DCNDATA                   @LHA*/         
*/********************************************************************/         
*/* SMS Accounting Information Definition  (Record Type 'AI')    @LHA*/         
*/********************************************************************/         
*DECLARE                                                       /*@LHA*/         
* 1 DAIDATA DEFINED(DCUDATA),/* Accounting Information                          
*                                 (DEFINED on DCUDATA)           @LHA*/         
*   2 DAIDRTN,               /* Data Class Routine               @LHA*/         
*    3 DAIDDATE CHAR(10),    /* Date last updated                @LHA*/         
*    3 DAIDDSNM CHAR(44),    /* Data set name where stored       @LHA*/         
*    3 DAIDDSMR CHAR(8),     /* Member name in data set          @LHA*/         
*    3 DAIDSRID CHAR(8),     /* Userid of last updater           @LHA*/         
*    3 DAIDTIME CHAR(8),     /* Time last updated                @LHA*/         
*   2 DAIMRTN,               /* Management Class Routine         @P1C*/         
*    3 DAIMDATE CHAR(10),    /* Date last updated                @LHA*/         
*    3 DAIMDSNM CHAR(44),    /* Data set name where stored       @LHA*/         
*    3 DAIMDSMR CHAR(8),     /* Member name in data set          @LHA*/         
*    3 DAIMSRID CHAR(8),     /* Userid of last updater           @LHA*/         
*    3 DAIMTIME CHAR(8),     /* Time last updated                @LHA*/         
*   2 DAISRTN,               /* Storage Class Routine            @LHA*/         
*    3 DAISDATE CHAR(10),    /* Date last updated                @LHA*/         
*    3 DAISDSNM CHAR(44),    /* Data set name where stored       @LHA*/         
*    3 DAISDSMR CHAR(8),     /* Member name in data set          @LHA*/         
*    3 DAISSRID CHAR(8),     /* Userid of last updater           @LHA*/         
*    3 DAISTIME CHAR(8),     /* Time last updated                @LHA*/         
*   2 DAIGRTN,               /* Storage Group Routine            @LHA*/         
*    3 DAIGDATE CHAR(10),    /* Date last updated                @LHA*/         
*    3 DAIGDSNM CHAR(44),    /* Data set name where stored       @LHA*/         
*    3 DAIGDSMR CHAR(8),     /* Member name in data set          @LHA*/         
*    3 DAIGSRID CHAR(8),     /* Userid of last updater           @LHA*/         
*    3 DAIGTIME CHAR(8),     /* Time last updated                @LHA*/         
*   2 *        CHAR(16),     /* Reserved                         @LHA*/         
*   2 DAIDATAE CHAR(0);      /* end of DAIDATA                   @LHA*/         
* %                                                                             
* IF DCU_SMS = 'YES' %THEN       /* INCLUDE SMS RECORDS ONLY?@OY59794*/         
*    %GOTO DCU_SMSB;                                                            
*/********************************************************************/         
*/* VALUES FOR DCVPHYST - PHYSICAL STATUS OF VOLUME                  */         
*/********************************************************************/         
*DECLARE DCVMANGD BIT(8) CONSTANT('00000011'B);  /* Volume is                   
*                                                   SMS managed  @LHC*/         
*DECLARE DCVINITL BIT(8) CONSTANT('00000001'B);  /* In conversion               
*                                                   to SMS       @LHC*/         
*DECLARE DCVNMNGD BIT(8) CONSTANT('00000000'B);  /* Non SMS managed             
*                                                   volume       @LHC*/         
*                                                                               
*/********************************************************************/         
*/* VALUES FOR DCDRECFM - RECORD FORMAT                              */         
*/********************************************************************/         
*DECLARE DCDRECFF BIT(8) CONSTANT('10000000'B); /* Fixed length                 
*                                                  records       @LHC*/         
*DECLARE DCDRECFV BIT(8) CONSTANT('01000000'B); /* Variable length              
*                                                  records       @LHC*/         
*DECLARE DCDRECFU BIT(8) CONSTANT('11000000'B); /* Undefined length             
*                                                  records       @LHC*/         
*                                                                               
*%DCU_SMSB: ;                                                                   
*/********************************************************************/         
*/* CONSTANTS FOR DDCRBIAS RECORD ACCESS BIAS                    @LJA*/         
*/********************************************************************/         
* DECLARE                                                                       
*  DDCRABUS  CONSTANT(0),          /* USER                       @LJA*/         
*  DDCRABSY  CONSTANT(1),          /* SYSTEM                     @LTC*/         
*  DDCRADO   CONSTANT(2),          /* DCDRBIAS is DO             @LTA*/         
*  DDCRADW   CONSTANT(3),          /* DCDRBIAS is DW             @LTA*/         
*  DDCRASO   CONSTANT(4),          /* DCDRBIAS is SO             @LTA*/         
*  DDCRASW   CONSTANT(5);          /* DCDRBIAS is SW             @LTA*/         
*/********************************************************************/         
*/* CONSTANTS FOR DDCRCORG                                   @OY59794*/         
*/********************************************************************/         
* DECLARE                                                  /*@OY59794*/         
*   DDCORGNL  CONSTANT(0),      /* RECORG IS NULL - SAM      @OY59794*/         
*   DDCORGKS  CONSTANT(1),      /* RECORG IS VSAM KSDS       @OY59794*/         
*   DDCORGES  CONSTANT(2),      /* RECORG IS VSAM ESDS       @OY59794*/         
*   DDCORGRR  CONSTANT(3),      /* RECORG IS VSAM RRDS       @OY59794*/         
*   DDCORGLS  CONSTANT(4);      /* RECORG IS VSAM LDS        @OY59794*/         
*                                                                               
*/********************************************************************/         
*/* CONSTANTS FOR DDCRECFM                                   @OY59794*/         
*/********************************************************************/         
* DECLARE                                                  /*@OY59794*/         
*   DDCFMNUL  CONSTANT(0),      /* RECFM IS NULL             @OY59794*/         
*   DDCFMU    CONSTANT(1),      /* RECFM IS UNDEFINED        @OY59794*/         
*   DDCFMV    CONSTANT(2),      /* RECFM IS VARIABLE         @OY59794*/         
*   DDCFMVS   CONSTANT(3),      /* RECFM IS VARIABLE SPANNED @OY59794*/         
*   DDCFMVB   CONSTANT(4),      /* RECFM IS VARIABLE BLOCKED @OY59794*/         
*   DDCFMVBS  CONSTANT(5),      /* RECFM IS VAR BLK SPANNED  @OY59794*/         
*   DDCFMF    CONSTANT(6),      /* RECFM IS FIXED            @OY59794*/         
*   DDCFMFS   CONSTANT(7),      /* RECFM IS FIXED STANDARD   @OY59794*/         
*   DDCFMFB   CONSTANT(8),      /* RECFM IS FIXED BLOCKED    @OY59794*/         
*   DDCFMFBS  CONSTANT(9);      /* RECFM IS FIXED BLK SPANND @OY59794*/         
*                                                                               
*/********************************************************************/         
*/* CONSTANTS FOR DDCCNTL                                    @OY59794*/         
*/********************************************************************/         
* DECLARE                                                  /*@OY59794*/         
*   DDCCNTLA  CONSTANT(1),      /* CARRIAGE CONTROL IS ANSI  @OY59794*/         
*   DDCCNTLM  CONSTANT(2),      /* CARRIAGE CONTROL IS MACH  @OY59794*/         
*   DDCCNTLN  CONSTANT(3);      /* CARRIAGE CONTROL IS NULL  @OY59794*/         
*                                                                               
*/********************************************************************/         
*/* CONSTANTS FOR DDCAVREC                                   @OY59794*/         
*/********************************************************************/         
* DECLARE                                                  /*@OY59794*/         
*   DDCBYTES FIXED(8) CONSTANT(1),  /* AVGREC IS BYTES       @OY59794*/         
*   DDCKB    FIXED(8) CONSTANT(2),  /* AVGREC IS KB          @OY59794*/         
*   DDCMB    FIXED(8) CONSTANT(3);  /* AVGREC IS MB          @OY59794*/         
*                                                                               
*/********************************************************************/         
*/* CONSTANTS FOR DDCDSNTY                                   @OY59794*/         
*/********************************************************************/         
* DECLARE                                                  /*@OY59794*/         
*   DDCDSNUL FIXED(8) CONSTANT(0),  /* DSN TYPE IS NULL      @OY59794*/         
*   DDCDSPDS FIXED(8) CONSTANT(1),  /* DSN TYPE IS PDS       @OY59794*/         
*   DDCDSLIB FIXED(8) CONSTANT(2),  /* DSN TYPE IS LIBRARY   @OY59794*/         
*   DDCDSHFS FIXED(8) CONSTANT(3),  /* DSN TYPE IS HFS       @OY60048*/         
*   DDCDSEXR FIXED(8) CONSTANT(4),  /* DSN TYP - EXTENDED(R) @OY60048*/         
*   DDCDSEXC FIXED(8) CONSTANT(5),  /* DSN TYP - EXTENDED(C) @OY60048*/         
*   DDCDSLRG FIXED(8) CONSTANT(6),  /* DSN TYP - LARGE       @LHD    */         
*   DDCDSNXT FIXED(8) CONSTANT(7);  /* DSN TYP - NEXT        @LHD    */         
*                                                                               
*/********************************************************************/         
*/* CONSTANTS FOR DDCCOMP                                    @OY60048*/         
* DECLARE                                                  /*@OY60048*/         
*   DDCCNUL   CONSTANT(0),          /* NULL COMPACTION TYPE  @OY60048*/         
*   DDCNOCMP  CONSTANT(1),          /* NO COMPACTION         @OY60048*/         
*   DDCIDRC   CONSTANT(2);          /* IMPROVED DATA RECORDING                  
*                                    CAPABILITY, COMPACTION. @OY60048*/         
*                                                                               
*/********************************************************************/         
*/* CONSTANTS FOR DDCMEDIA                                   @OY60048*/         
*/********************************************************************/         
* DECLARE                                                  /*@OY60048*/         
*   DDCMENUL  CONSTANT(0),          /* MEDIA TYPE IS NULL    @OY60048*/         
*   DDCMEDA1  CONSTANT(1),          /* MEDIA1 - CART. SYSTEM @OY60048*/         
*   DDCMEDA2  CONSTANT(2),          /* MEDIA2 - ENHANCED CAPACITY               
*                                      CARTRIDGE SYSTEM TAPE @OY60048*/         
*   DDCMEDA3  CONSTANT(3),          /* MEDIA3 - ENHANCED CAPACITY               
*                                      CARTRIDGE SYSTEM TAPE @OY60048*/         
*   DDCMEDA4  CONSTANT(4),          /* MEDIA4 - ENHANCED CAPACITY               
*                                      CARTRIDGE SYSTEM TAPE @OY60048*/         
*   DDCMEDA5  CONSTANT(5),          /* MEDIA5 - 3592 ENHANCED CAPACITY          
*                                      CARTRIDGE SYSTEM TAPE @LHB    */         
*   DDCMEDA6  CONSTANT(6),          /* MEDIA6 - 3592 ENHANCED CAPACITY          
*                                      CARTRIDGE SYSTEM TAPE @LHC    */         
*   DDCMEDA7  CONSTANT(7),          /* MEDIA7 - 3592 ENHANCED CAPACITY          
*                                      CARTRIDGE SYSTEM TAPE @LHC    */         
*   DDCMEDA8  CONSTANT(8),          /* MEDIA8 - 3592 ENHANCED CAPACITY          
*                                      CARTRIDGE SYSTEM TAPE @LHC    */         
*   DDCMEDA9  CONSTANT(9),          /* MEDIA9 - 3592 ENHANCED CAPACITY          
*                                      CARTRIDGE SYSTEM TAPE @06A    */         
*   DDCMED10  CONSTANT(10),         /* MEDIA10 - 3592 ENHANCED CAPACITY         
*                                      CARTRIDGE SYSTEM TAPE     @PEC*/         
*   DDCMED11  CONSTANT(11),         /* MEDIA11 - 3592 ENHANCED CAPACITY         
*                                      CARTRIDGE SYSTEM TAPE @16A    */         
*   DDCMED12  CONSTANT(12),         /* MEDIA12 - 3592 ENHANCED CAPACITY         
*                                      CARTRIDGE SYSTEM TAPE @16A    */         
*   DDCMED13  CONSTANT(13);         /* MEDIA13 - 3592 ENHANCED CAPACITY         
*                                      CARTRIDGE SYSTEM TAPE @16A    */         
*                                                                               
*/********************************************************************/         
*/* CONSTANTS FOR DDCRECTE                                   @OY60048*/         
*/********************************************************************/         
* DECLARE                                                  /*@OY60048*/         
*   DDCRTNUL  CONSTANT(0),          /* DDCRECTE IS NULL      @OY60048*/         
*   DDC18TRK  CONSTANT(1),          /* DDCRECTE IS 18 TRACK  @OY60048*/         
*   DDC36TRK  CONSTANT(2),          /* DDCRECTE IS 36 TRACK  @OY60048*/         
*   DDC128TK  CONSTANT(3),          /* DDCRECTE IS 128 TRACK @OY60048*/         
*   DDC256TK  CONSTANT(4),          /* DDCRECTE IS 256 TRACK @OY60048*/         
*   DDC384TK  CONSTANT(5),          /* DDCRECTE IS 384 TRACK     @LHA*/         
*   DDCEFMT1  CONSTANT(6),          /* DDCRECTE IS EFMT1         @LHB*/         
*   DDCEFMT2  CONSTANT(7),          /* DDCRECTE IS EFMT2         @06A*/         
*   DDCEEFM2  CONSTANT(8),          /* DDCRECTE IS EEFM2         @07A*/         
*   DDCEFMT3  CONSTANT(9),          /* DDCRECTE IS EFMT3         @10A*/         
*   DDCEEFM3  CONSTANT(10),         /* DDCRECTE IS EEFM3         @10A*/         
*   DDCEFMT4  CONSTANT(11),         /* DDCRECTE IS EFMT4         @16A*/         
*   DDCEEFM4  CONSTANT(12);         /* DDCRECTE IS EEFM4         @16A*/         
*                                                                               
*/********************************************************************/         
*/*                                                                  */         
*/* Constants for DDCBWOTP                                       @LAA*/         
*/*                                                                  */         
*/********************************************************************/         
* DECLARE                                                                       
*   DDCBWOCI CONSTANT(1),       /* BWO type CICS                 @LJA*/         
*   DDCBWONO CONSTANT(2),       /* BWO type none                 @LJA*/         
*   DDCBWOIM CONSTANT(3);       /* BWO type IMS                  @LJA*/         
*/********************************************************************/         
*/*                                                                  */         
*/* Constants for DDCLOGRC                                       @LJA*/         
*/*                                                                  */         
*/********************************************************************/         
* DECLARE                                                                       
*   DDCLOGNO CONSTANT(1),         /* non Recoverable sphere      @LJA*/         
*   DDCLOGUN CONSTANT(2),         /* UNDO - use external log     @LJA*/         
*   DDCLOGAL CONSTANT(3);         /* ALL - (UNDO) & forward      @LJA*/         
*                                                                               
*/********************************************************************/         
*/*                                                                  */         
*/* Constants for DDCSPAND                                       @LJA*/         
*/*                                                                  */         
*/********************************************************************/         
* DECLARE                                                                       
*   DDCSPANN CONSTANT(0),         /* Record can not span CI      @LJA*/         
*   DDCSPANY CONSTANT(1);         /* Record may span CI          @LJA*/         
*                                                                               
*/********************************************************************/         
*/*                                                                  */         
*/* Constants for DDCEATTR, DCDEATRC, DCDEATRV   EAS Space       @L9A*/         
*/*                                                                  */         
*/********************************************************************/         
* DECLARE                                                                       
*   DDCEANUL CONSTANT(0),         /* EAS not specified           @L9A*/         
*   DDCEATNO CONSTANT(1),         /* Not EAS eligible            @L9A*/         
*   DDCEATOP CONSTANT(2);         /* EAS eligible                @L9A*/         
*                                                                               
*/********************************************************************/         
*/*                                                                  */         
*/* Constants for DCDCTYPE                                       @21A*/         
*/*                                                                  */         
*/********************************************************************/         
* DECLARE                                                      /*@21A*/         
*   DCDCNCMP CONSTANT(0),                  /* NOT COMPRESSED     @21A*/         
*   DCDCGENC CONSTANT(1),                  /* GENERIC            @21A*/         
*   DCDCTLRD CONSTANT(2),                  /* TAILORED           @21A*/         
*   DCDCZEDC CONSTANT(3);                  /* ZEDC               @21A*/         
*                                                                               
*/********************************************************************/         
*/* CONSTANTS FOR DSCDIRB and DSCSEQB                        @OY59794*/         
*/********************************************************************/         
* DECLARE                                                  /*@OY59794*/         
*   DSCBIADC CONSTANT(0),           /* BIAS = DON'T CARE     @OY59794*/         
*   DSCBIARD CONSTANT(1),           /* BIAS = READ           @OY59794*/         
*   DSCBIAWR CONSTANT(2);           /* BIAS = WRITE          @OY59794*/         
*                                                                               
*/********************************************************************/         
*/* CONSTANTS FOR DSCAVAIL                                   @OY59794*/         
*/********************************************************************/         
* DECLARE                                                  /*@OY59794*/         
*   DSCAVLDC CONSTANT(0),   /* AVAILABILITY = DON'T CARE (no                    
*                              preference)                       @01C*/         
*   DSCAVLST CONSTANT(1),   /* AVAILABILITY = STANDARD       @OY59794*/         
*   DSCAVLCN CONSTANT(2),   /* AVAILABILITY = CONTINUOUS     @OY59794*/         
*   DSCAVLPR CONSTANT(3);   /* AVAILABILITY = PREFERRED          @01A*/         
*                                                                               
*/********************************************************************/         
*/* CONSTANTS FOR DSCACCES                                   @OY60048*/         
*/********************************************************************/         
* DECLARE                                                  /*@OY60048*/         
*   DSCACCPR CONSTANT(0),   /* ACCESSIBILITY = CONTINUOUS PREFERRED             
*                                                            @OY60048*/         
*   DSCACCRQ CONSTANT(1),   /* ACCESSIBILITY = CONTINUOUS    @OY60048*/         
*   DSCACCST CONSTANT(2),   /* ACCESSIBILITY = STANDARD      @OY60048*/         
*   DSCACCNP CONSTANT(3);   /* ACCESSIBILITY = NOPREF        @OW01826*/         
*                                                                               
*/********************************************************************/         
*/*  CONSTANTS FOR DMCRFMT                                   @OY59794*/         
*/********************************************************************/         
* DECLARE                                                  /*@OY59794*/         
*   DMCNULL   CONSTANT(0),          /* FIELD WAS NOT USED    @OY59794*/         
*   DMCFDATE  CONSTANT(1),          /* EXPIRE FORM:                             
*                                            DATE/CREATE     @OY59794*/         
*   DMCFDAYS  CONSTANT(2);          /* EXPIRE FORM:                             
*                                            DAYS/CREATE     @OY59794*/         
*                                                                               
*/********************************************************************/         
*/*  CONSTANTS FOR DMCCMAU                                   @OY59794*/         
*/********************************************************************/         
* DECLARE                                                  /*@OY59794*/         
*   DMCMNONE  CONSTANT(0),          /* NO MIGRATION ALLOWED  @OY59794*/         
*   DMCMCMD   CONSTANT(1),          /* MIGR ON COMMAND ONLY  @OY59794*/         
*   DMCMBOTH  CONSTANT(2);          /* AUTO MIGRAT OR ON CMD @OY59794*/         
*                                                                               
*/********************************************************************/         
*/*  CONSTANTS FOR DMCBADU                                   @OY59794*/         
*/********************************************************************/         
* DECLARE                                                  /*@OY59794*/         
*   DMCBNONE  CONSTANT(0),          /* NO USR OR ADMN BACKUP @OY59794*/         
*   DMCBADM   CONSTANT(1),          /* ALLOW ADMIN CMD BACKUP@OY59794*/         
*   DMCBBOTH  CONSTANT(2);          /* ALLOW ADMN OR USR CMD @OY59794*/         
*                                                                               
*/********************************************************************/         
*/*  CONSTANTS FOR DMCEXPAC                                  @OY59794*/         
*/********************************************************************/         
* DECLARE                                                  /*@OY59794*/         
*   DMCEANUL FIXED(8) CONSTANT(0),  /* EXPIRE ACTION IS NULL @OY59794*/         
*   DMCEADEL FIXED(8) CONSTANT(1),  /* EXPIRE ACTION IS DEL  @OY59794*/         
*   DMCEAARC FIXED(8) CONSTANT(2);  /* EXPIRE ACTION IS ARC  @OY59794*/         
*                                                                               
*/********************************************************************/         
*/*  CONSTANTS FOR DMCRLF                                    @OY59794*/         
*/********************************************************************/         
* DECLARE                                                  /*@OY59794*/         
*   DMCRLFYE BIT(8) CONSTANT('10000000'B), /* PARTIAL RELEASE = YES,            
*                                        IMMEDIATE REL = NO      @LHC*/         
*   DMCRLFCN BIT(8) CONSTANT('01000000'B), /* CONDITION PARTREL = YES,          
*                                        IMMEDIATE REL = NO      @LHC*/         
*   DMCRLFNO BIT(8) CONSTANT('00000000'B), /* PARTIAL RELEASE = NO,             
*                                        IMMEDIATE REL = NO      @LHC*/         
*   DMCRLFYI BIT(8) CONSTANT('10100000'B), /* PARTIAL RELEASE = YES,            
*                                        IMMEDIATE REL = YES     @LHC*/         
*   DMCRLFCI BIT(8) CONSTANT('01100000'B); /* CONDITION PARTREL = YES,          
*                                        IMMED CON REL = YES     @LHC*/         
*                                                                               
*/********************************************************************/         
*/*  CONSTANTS FOR DMCCPYTC                                  @OY60048*/         
*/********************************************************************/         
* DECLARE                                                  /*@OY60048*/         
*   DMCCPYST FIXED(8) CONSTANT(0),   /* STANDARD             @OY60048*/         
*   DMCCPYPR FIXED(8) CONSTANT(1),   /* CONCURRENT PREFERRED @OY60048*/         
*   DMCCPYRQ FIXED(8) CONSTANT(2);   /* CONCURRENT REQUIRED  @OY60048*/         
*                                                                               
*/********************************************************************/         
*/* CONSTANTS FOR DB recover version                         @OY59794*/         
*/********************************************************************/         
* DCL DCUBCVER CONSTANT(2);   /* Current version of BC rec       @L4A*/         
*/********************************************************************/         
*/* CONSTANTS FOR DBCSTAT                                    @OY59794*/         
*/********************************************************************/         
* DECLARE                                                  /*@OY59794*/         
*   DBCVALID CONSTANT(1),           /* DATA SET IS VALID     @OY59794*/         
*   DBCINVAL CONSTANT(2),           /* DATA SET IS INVALID   @OY59794*/         
*   DBCUNKWN CONSTANT(3);           /* DATA SET STAT IS UNK. @OY59794*/         
*                                                                               
*/********************************************************************/         
*/* CONSTANTS FOR DBCSYSNT AND DBCSNMTY                     @K131753*/          
*/********************************************************************/         
* DECLARE                                                  /*@OW02196*/         
*   DBCSYSNS CONSTANT(0),  /* NAME TYPE NOT SPECIFIED        @OW02196*/         
*   DBCSYSTM CONSTANT(1),  /* NAME TYPE IS SYSTEM NAME       @OW02196*/         
*   DBCSYSPL CONSTANT(2);  /* NAME TYPE IS SYSTEM GROUP NAME @OW02196*/         
*                                                                               
*/********************************************************************/         
*/* CONSTANTS FOR DBCSYSFT                                   @OW20434*/         
*/********************************************************************/         
* DECLARE                                                  /*@OW20434*/         
*   DBCASMS  BIT(16) CONSTANT('8000'X), /* ACTIVE SMS        @OW20434*/         
*   DBCPDSE  BIT(16) CONSTANT('4000'X), /* PDSE FEATURE      @OW20434*/         
*   DBCCDMP  BIT(16) CONSTANT('2000'X), /* SAM COMPRESSION   @OW20434*/         
*   DBCSESC  BIT(16) CONSTANT('1000'X); /* SES CACHE FEATURE @OW20434*/         
*/********************************************************************/         
*/* CONSTANT  FOR DCU record version                                 */         
*/********************************************************************/         
* DCL DCUSGVER CONSTANT(2);         /* Current version of SG rec @02C*/         
*/********************************************************************/         
*/* CONSTANTS FOR DSGFTYPE                                   @OY59794*/         
*/********************************************************************/         
* DECLARE                                                  /*@OY59794*/         
*   DSGPOOL   CONSTANT(0),          /* STG GRP TYPE IS POOL  @OY59794*/         
*   DSGVIO    CONSTANT(1),          /* STG GRP TYPE IS VIO   @OY59794*/         
*   DSGDUMMY  CONSTANT(2),          /* STG GRP TYPE IS DUMMY @OY59794*/         
*   DSGOBJ    CONSTANT(3),          /* SG TYPE IS OBJECT     @OY59794*/         
*   DSGOBJBK  CONSTANT(4),          /* SG TYPE IS OBJ BACKUP @OY59794*/         
*   DSGTAPE   CONSTANT(5),          /* SG TYPE IS TAPE           @PJC*/         
*   DSGTARGT  CONSTANT(6);          /* SG TYPE IS Copy Target    @PJA*/         
*                                                                               
*/********************************************************************/         
*/* CONSTANTS FOR DSGSTAT and DSGSYSST                       @OW24697*/         
*/********************************************************************/         
* DECLARE                                                  /*@OY59794*/         
*   DSG0    FIXED(8) CONSTANT(0),   /* NO STATUS SPECIFIED   @OY59794*/         
*   DSGENBL FIXED(8) CONSTANT(1),   /* STOR GRP IS ENABLED   @OY59794*/         
*   DSGQUI  FIXED(8) CONSTANT(2),   /* STOR GRP QUIESCED/ALL @OY59794*/         
*   DSGQUIN FIXED(8) CONSTANT(3),   /* STOR GRP QUIESCED/NEW @OY59794*/         
*   DSGDIS  FIXED(8) CONSTANT(4),   /* STOR GRP DISABLED/ALL @OY59794*/         
*   DSGDISN FIXED(8) CONSTANT(5);   /* STOR GRP DISABLED/NEW @OY59794*/         
*                                                                               
*/********************************************************************/         
*/* SMS STATUS - DVLSMSS and DVLSTSMS                        @OW24697*/         
*/********************************************************************/         
* DECLARE                                                  /*@OY59794*/         
*   DVL0      FIXED(8) CONSTANT(0), /* NO STATUS GIVEN       @OY59794*/         
*   DVLENBL   FIXED(8) CONSTANT(1), /* SMS STATUS IS ENABLED @OY59794*/         
*   DVLQUI    FIXED(8) CONSTANT(2), /* SMS STAT QUIESCED/ALL @OY59794*/         
*   DVLQUIN   FIXED(8) CONSTANT(3), /* SMS STAT QUIESCED/NEW @OY59794*/         
*   DVLDIS    FIXED(8) CONSTANT(4), /* SMS STAT DISABLED/ALL @OY59794*/         
*   DVLDISN   FIXED(8) CONSTANT(5); /* SMS STAT DISABLED/NEW @OY59794*/         
*                                                                               
*/********************************************************************/         
*/* MVS STATUS - DVLMVSS and DVLSTMVS                        @OW24697*/         
*/********************************************************************/         
* DECLARE                                                  /*@OY59794*/         
*   DVLONLN   FIXED(8) CONSTANT(1), /* MVS STATUS IS ONLINE  @OY59794*/         
*   DVLOFFLN  FIXED(8) CONSTANT(2), /* MVS STATUS IS OFFLINE @OY59794*/         
*   DVLPOFF   FIXED(8) CONSTANT(3), /* MVS STATUS IS PENDING                    
*                                                OFFLINE     @OY59794*/         
*   DVLBOXED  FIXED(8) CONSTANT(4), /* MVS STATUS IS BOXED   @OY59794*/         
*   DVLNRDY   FIXED(8) CONSTANT(5), /* MVS STATUS IS NOT                        
*                                                READY       @OY59794*/         
*   DVLROA    FIXED(8) CONSTANT(6); /* MVS STATUS IS ONLINE and                 
*                                                 READONLY       @LYA*/         
*                                                                               
*/********************************************************************/         
*/* MVS STATUS - DDRSOUT, DDRCFCS, DDRREQST AND DDRCURST     @OW24697*/         
*/********************************************************************/         
* DECLARE                                                  /*@OY59794*/         
*   DDRNOCON  FIXED(8) CONSTANT(0), /* OAM STATUS IS NO                         
*                                       CONNECTIVITY         @OY59794*/         
*   DDRONLN   FIXED(8) CONSTANT(1), /* OAM STATUS IS ONLINE  @OY59794*/         
*   DDROFFLN  FIXED(8) CONSTANT(2), /* OAM STATUS IS OFFLINE @OY59794*/         
*   DDRNORST  FIXED(8) CONSTANT(3); /* NO OUTSTANDING REQUEST@OY59794*/         
*                                                                               
*/********************************************************************/         
*/* MVS STATUS - DLBSOUT, DLBCFCS, DLBREQST, AND DLBCURST    @OW24697*/         
*/********************************************************************/         
* DECLARE                                                  /*@OY59794*/         
*   DLBNOCON  FIXED(8) CONSTANT(0), /* OAM STATUS IS NO                         
*                                                CONNECT     @OY59794*/         
*   DLBONLN   FIXED(8) CONSTANT(1), /* OAM STATUS IS ONLINE  @OY59794*/         
*   DLBOFFLN  FIXED(8) CONSTANT(2), /* OAM STATUS IS OFFLINE @OY59794*/         
*   DLBNORST  FIXED(8) CONSTANT(3), /* NO OUTSTANDING REQUEST@OY59794*/         
*   DLBLPENO  FIXED(8) CONSTANT(4); /* LIBRARY PENDING OFFLINE   @P1C*/         
*                                                                               
*/********************************************************************/         
*/* TYPE OF LIBRARY - DLBTYPE                                @OY59794*/         
*/********************************************************************/         
* DECLARE                                                  /*@OY59794*/         
*   DLBNOOPT  FIXED(8) CONSTANT(0), /* NOT OPTICAL LIBRARY   @OY60048*/         
*   DLBREAL   FIXED(8) CONSTANT(1), /* REAL LIBRARY          @OY59794*/         
*   DLBPSEUD  FIXED(8) CONSTANT(2); /* PSEUDO LIBRARY        @OY59794*/         
*                                                                               
*/********************************************************************/         
*/* TYPE OF LIBRARY DEVICE - DLBDTYPE                        @OY59794*/         
*/********************************************************************/         
* DECLARE                                                  /*@OY59794*/         
*   DLBD9246  FIXED(8) CONSTANT(0), /* IBM 9246 LIBRARY      @OY59794*/         
*   DLBD3995  FIXED(8) CONSTANT(1), /* IBM 3995 LIBRARY      @OY59794*/         
*   DLBDTAPE  FIXED(8) CONSTANT(2); /* TAPE LIBRARY          @OY60048*/         
*                                                                               
*/********************************************************************/         
*/* ENTRY DEFAULT USE ATTRIBUTE- DLBEDVT(TAPE LIBRARY ONLY)  @OY60048*/         
*/********************************************************************/         
* DECLARE                                                  /*@OY60048*/         
*   DLBPRVT   FIXED(8) CONSTANT(1), /* PRIVATE VOLUME        @OY60048*/         
*   DLBSCRT   FIXED(8) CONSTANT(2); /* SCRATCH VOLUME        @OY60048*/         
*                                                                               
*/********************************************************************/         
*/* EJECT DEFAULT - DLBEJD                                   @OY60048*/         
*/********************************************************************/         
* DECLARE                                                  /*@OY60048*/         
*   DLBPURGE  FIXED(8) CONSTANT(1), /* PURGE TCDB VOL RECORD @OY60048*/         
*   DLBKEEP   FIXED(8) CONSTANT(2); /* KEEP TCDB VOL RECORD  @OY60048*/         
*                                                                               
*%DCU_OMIT: ;                                                                   
*/********************************************************************/         
*/* VALUES FOR DCUVERS  - IDCDOUT VERSION                        @15A*/         
*/********************************************************************/         
*DECLARE DCUVERS1 FIXED(15) CONSTANT(1); /*  INITIAL VERSION     @15A*/         
*DECLARE DCUVERS2 FIXED(15) CONSTANT(2); /*  DFSMS V1R10 VERSION @15A*/         
*DECLARE DCUVERSC FIXED(15) CONSTANT(2); /*  LATEST VERSION      @15A*/         
*/********************************************************************/         
*/* VALUES FOR DCURCTYP - RECORD TYPE                                */         
*/********************************************************************/         
*DECLARE DCUDATAT CHAR(2) CONSTANT('D '); /* DATA TYPE RECORD        */         
*DECLARE DCUASSOC CHAR(2) CONSTANT('A '); /* VSAM ASSOCIATION RECORD */         
*DECLARE DCUVULUT CHAR(2) CONSTANT('V '); /* VOLUME TYPE RECORD      */         
*DECLARE DCUDCDEF CHAR(2) CONSTANT('DC'); /* DATA CLASS      @OY59794*/         
*DECLARE DCUSCDEF CHAR(2) CONSTANT('SC'); /* STORAGE CLASS   @OY59794*/         
*DECLARE DCUMCDEF CHAR(2) CONSTANT('MC'); /* MANAGEMENT CLASS    @P1C*/         
*DECLARE DCUBCDEF CHAR(2) CONSTANT('BC'); /* BASE CONFIG.    @OY59794*/         
*DECLARE DCUSGDEF CHAR(2) CONSTANT('SG'); /* STORAGE GROUP   @OY59794*/         
*DECLARE DCUVLDEF CHAR(2) CONSTANT('VL'); /* SMS VOLUME DEF  @OY59794*/         
*DECLARE DCUAGDEF CHAR(2) CONSTANT('AG'); /* AGGREGATE GROUP @OY59794*/         
*DECLARE DCUDRDEF CHAR(2) CONSTANT('DR'); /* OPTICAL DRIVE   @OY59794*/         
*DECLARE DCULBDEF CHAR(2) CONSTANT('LB'); /* OPTICAL LIBRARY @OY59794*/         
*DECLARE DCUCNDEF CHAR(2) CONSTANT('CN'); /* CACHE NAMES         @LHA*/         
*DECLARE DCUAIDEF CHAR(2) CONSTANT('AI'); /* ACS INFORMATION     @P1C*/         
* %IF DCU_HDR = 'YES'            /* INCLUDE HEADER DECLARE ONLY?     */         
*  & IDCDOUT_CBGEN ^= 'YES' %THEN /* INCLUDE EVERYTHING?             */         
*  %GOTO IDCDOUT_4;              /* Bypass @LIST stuff               */         
*@LOGIC;                                                                        
*#PRAGMA TOOL=CBGEN.                                                            
*#LINE.%IDCDOUT_CBGEN = 'YES';                                                  
*#LINE.%INCLUDE SYSLIB(IDCDOUT);                                                
*#EPRAGMA.                                                                      
*@ENDLOGIC;                                                                     
*/* End of PL/X Source                                               */         
* %IF IDCDOUT_LIST ^= 'NO' &                                                    
*    ZCBPRINT ^= 'NO' %THEN                                                     
*   %GOTO IDCDOUT_4;                                                            
*   @LIST POP NOECHO;                                                           
* %IDCDOUT_4:;                                                                  
* %END;                                                                         
