*        %GOTO MDB1;    /* BILINGUAL MAPPING                            00010000
         MACRO                                                          00020000
         IEAVM105                                                       00030000
*                                                                    */ 00040000
*%MDB1 : ;                                                              00050000
*                                                                       00060000
*/**** START OF SPECIFICATIONS ***************************************/ 00070000
*/*                                                                  */ 00080000
*/*01* MACRO NAME:  IEAVM105                                     @L7C*/ 00090000
*/*                                                                  */ 00100000
*/*01* DESCRIPTIVE NAME:  Message Data Block  (MDB)              @L7C*/ 00110000
*/*                                                                  */ 00120000
*/*01* ACRONYM:     MDB                                          @L7C*/ 00130000
*/*01* EXTERNAL CLASSIFICATION: GUPI                             @L7A*/ 00140000
*/*01*  END OF EXTERNAL CLASSIFICATION:                          @L7A*/ 00150000
*/*                                                                  */ 00160000
*/*01* PROPRIETARY STATEMENT=                                        */ 00170000
*/***PROPRIETARY_STATEMENT********************************************/ 00180000
*/*                                                                  */ 00190000
*/*                                                                  */ 00200000
*/* LICENSED MATERIALS - PROPERTY OF IBM                             */ 00210000
*/* 5694-A01 COPYRIGHT IBM CORP. 1990, 2010                          */ 00220000
*/*                                                                  */ 00230000
*/* STATUS= HBB7770                                                  */ 00240000
*/*                                                                  */ 00250000
*/***END_OF_PROPRIETARY_STATEMENT*************************************/ 00260000
*/*                                                                  */ 00270000
*/*01* DSECT NAME:  MDB, MDBG, MDBSCP, or MDBT                   @L7C*/ 00280000
*/*                                                              @P8A*/ 00290000
*/*01* COMPONENT: Consoles (SC1CK)                               @LFC*/ 00300000
*/*                                                              @P8A*/ 00310000
*/*01* EYE-CATCHER: MDB                                          @L7C*/ 00320000
*/*02*   OFFSET: 4                                               @L7C*/ 00330000
*/*02*   LENGTH: 4                                               @L7C*/ 00340000
*/*                                                              @P8A*/ 00350000
*/*01* STORAGE ATTRIBUTES:                                       @L7C*/ 00360000
*/*02*   MAIN STORAGE:                                           @L7A*/ 00370000
*/*02*   VIRTUAL STORAGE:                                        @L7A*/ 00380000
*/*02*   AUXILIARY STORAGE:                                      @L7A*/ 00390000
*/*02*   DATA SPACE:                                             @L7A*/ 00400000
*/*02*   SUBPOOL:  N/A                                           @L7C*/ 00410000
*/*02*   KEY:  N/A                                               @L7C*/ 00420000
*/*02*   RESIDENCY:  Message data space for the address space    @L7C*/ 00430000
*/*               which owns the Extended MCS Console.           @P7A*/ 00440000
*/*                                                              @P8A*/ 00450000
*/*01* SIZE: 160 bytes                                           @LMC*/ 00460000
*/*                                                              @P8A*/ 00470000
*/*01* FUNCTION:    This is an architected structure consisting  @L7C*/ 00480000
*/*              of a header and a combination of substructures  @L7C*/ 00490000
*/*              known as objects (i.e. general, control program @P7A*/ 00500000
*/*              and text objects).  It is used for message      @P7A*/ 00510000
*/*              text (WTO/R) and DOMs.                          @P7A*/ 00520000
*/*                                                              @L7A*/ 00530000
*/*01* METHOD OF ACCESS:                                         @L7A*/ 00540000
*/*                                                                  */ 00550000
*/*              BAL - SPECIFY IEAVM105                              */ 00560000
*/*                                                                  */ 00570000
*/*              PL/X  - Declare MDBPTR                              */ 00580000
*/*                      %INCLUDE SYSLIB(IEAVM105)                   */ 00590000
*/*                                                                  */ 00600000
*/*              VIA ATTRIBUTE - Specify %MDBVIA = 'YES'             */ 00610000
*/*                           prior to %INCLUDE statement.           */ 00620000
*/*                           Declare MDBALET.                       */ 00630000
*/*                           For VIA(0) specify %GLOBALARMODE='YES' */ 00640000
*/*                                                                  */ 00650000
*/*              PL/X  LISTING - Specify %IHALIST = 'YES'        @PAC*/ 00660000
*/*                              before %INCLUDE                 @PAC*/ 00670000
*/*                                                                  */ 00680000
*/*01* CREATED BY:       Various users                           @L7C*/ 00690000
*/*                                                                  */ 00700000
*/*01* POINTED TO BY:    N/A                                     @L7C*/ 00710000
*/*                                                                  */ 00720000
*/*01* SERIALIZATION:  N/A                                       @L7C*/ 00730000
*/*                                                                  */ 00740000
*/*01* DISTRIBUTION:    AMACLIB                                  @PAC*/ 00750000
*/*                                                              @P7A*/ 00760000
*/*01* OPERATION:   The MDB is constructed of the following:     @P7A*/ 00770000
*/*         The entire block is headed by a headers section      @P7A*/ 00780000
*/*         that identifies the block as an MDB and includes     @P7A*/ 00790000
*/*         the version (MDBVER) and the length of the entire    @P7A*/ 00800000
*/*         MDB block including all the objects (MDBLEN).        @P7A*/ 00810000
*/*           After the header comes one or more objects         @P7A*/ 00820000
*/*         (sub-blocks).  The blocks currently used are:        @P7A*/ 00830000
*/*                OBJECT                           TYPE         @P7A*/ 00840000
*/*          -   General Object (MDBG)             '0001'X       @P7A*/ 00850000
*/*          -   Control Program Object (MDBSCP)   '0002'X       @P7A*/ 00860000
*/*          -   Message Text Object (MDBT)        '0004'X       @P7A*/ 00870000
*/*           The General Object is required.  All others are    @P7A*/ 00880000
*/*         optional.  The objects can be in any order within    @P7A*/ 00890000
*/*         the MDB.                                             @P7A*/ 00900000
*/*           Each object block is architected such that the     @P7A*/ 00910000
*/*         first two bytes contains the length of that          @P7A*/ 00920000
*/*         particular object and the second two bytes contains  @P7A*/ 00930000
*/*         the object type.                                     @P7A*/ 00940000
*/*                                                              @P7A*/ 00950000
*/*  ___     ____________________________________________        @P7A*/ 00960000
*/*   A     ! MDB Header section                         !       @P7A*/ 00970000
*/*   !     !                                            !       @P7A*/ 00980000
*/*   !     !  MDBLEN -------                            !       @P7A*/ 00990000
*/*   !     !____________________________________________!       @P7A*/ 01000000
*/*   !     ! __________________________________________ !       @P7A*/ 01010000
*/*   !     !! General Object (MDBG) - Required         !!       @P7A*/ 01020000
*/*   !     !!                                          !!       @P7A*/ 01030000
*/*   !     !!   One only                               !!       @P7A*/ 01040000
*/*   !     !!__________________________________________!!       @P7A*/ 01050000
*/*   !     ! __________________________________________ !       @P7A*/ 01060000
*/*   !     !! Control Program Object (MDBC) - Optional !!       @P7A*/ 01070000
*/*   M     !!                                          !!       @P7A*/ 01080000
*/*   D     !!   One only                               !!       @P7A*/ 01090000
*/*   B     !!__________________________________________!!       @P7A*/ 01100000
*/*   L     !  __________________________________________!       @P7A*/ 01110000
*/*   E     !! Text Object  (MDBT) - Optional           !!       @P7A*/ 01120000
*/*   N     !!                                          !!       @P7A*/ 01130000
*/*   !     !!   One for each line of message text      !!       @P7A*/ 01140000
*/*   !     !!__________________________________________!!       @P7A*/ 01150000
*/*   !     !                     .                      !       @P7A*/ 01160000
*/*   !     !                     .                      !       @P7A*/ 01170000
*/*   !     !                     .                      !       @P7A*/ 01180000
*/*   !     ! __________________________________________ !       @P7A*/ 01190000
*/*   !     !! Text Object  (MDBT) - Optional           !!       @P7A*/ 01200000
*/*   !     !!                                          !!       @P7A*/ 01210000
*/*   !     !!   One for each line of message text      !!       @P7A*/ 01220000
*/*   !     !!__________________________________________!!       @P7A*/ 01230000
*/*   V__   !____________________________________________!       @P7A*/ 01240000
*/*                                                              @P7A*/ 01250000
*/* CHANGE ACTIVITY -                                                */ 01260000
*/*  $MAC(IEAVM105) COMP(SC1CK): Message data block                  */ 01270000
*/*  $L0=CNITGDHE, HBB4410, 890313,  PDHE: CONSOLE INTEGRATION       */ 01280000
*/*  $L1=CNSL1EHE, HBB4410, 890403,  PDHE: Console Enhancements 1    */ 01290000
*/*  $L2=CNITGECR, HBB4410, 890510,  PDCR: Console Integration       */ 01300000
*/*  $L3=CNITGEHD, HBB4410, 890510,  PDHD: Console Integration       */ 01310000
*/*  $L4=CNITGFHD, HBB4410, 890619,  PDHE: Console Integration       */ 01320000
*/*  $D1=DEO0253,  HBB4410, 891204,  PDBD: Sysplex Reply             */ 01330000
*/*  $P1=PEO3147,  HBB4410, 900105,  PDEF: Fix MDBCRPYB's Boundary   */ 01340000
*/*  $D2=DEO0310,  HBB4410, 900105,  PDCY: Netview required fields   */ 01350000
*/*  $P2=PEO3289,  HBB4410, 900105,  PDBU: Fix MDBCDESC assembler    */ 01360000
*/*                                         mapping                  */ 01370000
*/*  $P3=PEO3675,  HBB4410, 900226,  PDHE: Fix assembler boundaries  */ 01380000
*/*  $P4=PEO3728,  HBB4410, 900330,  PDHE: Fix assembler equates     */ 01390000
*/*  $P5=PEO3938,  HBB4410, 900330,  PDHD: Change version field      */ 01400000
*/*  $P6=PEO3954,  HBB4410, 900330,  PDCY: Change comment on MDBCTCB */ 01410000
*/*  $P7=PEO4207,  HBB4410, 900604,  PDED: Clarify fields            */ 01420000
*/*  $D3=DEO0357,  HBB4410, 900604,  PDED: Increase usability        */ 01430000
*/*  $L5=NETSY6HK, JBB4422, 901112,  PDHK: Netview Sysplex Automation*/ 01440000
*/*  $P8=PKB0806,  HBB4430, 920725,  PDCM: Prolog updates            */ 01450000
*/*  $L6=OSR4HZ,   HBB5510, 921207,  PDHZ: OSR Restructure           */ 01460000
*/*  $L7=SYSOP16,  HBB5510, 930520,  PD3J: SHOWHDR updates           */ 01470000
*/*  $D4=DIG0131,  HBB5510, 930731,  PDHD: Add sysplex name.         */ 01480000
*/*  $P9=PIG2688,  HBB5510, 930831,  PDCI: Add bit to indicate that  */ 01490000
*/*                                        message was suppressed    */ 01500000
*/*  $L8=OPLOG33J, HBB5520, 930923,  PD3J: Add MDBCXMOD, MDBCOCMD,   */ 01510000
*/*                                        MDBCICMD, and MDBCWTL     */ 01520000
*/*  $PA=PN70169,  HBB5520, 940210,  PD3J: SHOWHDR COMPLIANCE        */ 01530000
*/*  $D5=DN70048,  HBB5520, 940603,  PDQ8: Add console name          */ 01540000
*/*  $PB=DN71185,  HBB5520, 941020,  PDHL: Change MDBLEN to fixed 16 */ 01550000
*/*                                                                  */ 01560000
*/*  $01=OW07896,  HBB5510, 941031,  PDHD: Add SPVD bit              */ 01570000
*/*  $02=OW18874,  HBB5510, 960315,  PDHD: Add QNLY bit              */ 01580000
*/*  $03=OW20064,  HBB4430, 960615,  PDED: Add MCSFLAG bits          */ 01590000
*/*  $L9=CSTARFJ,  JBB7727, 011101,  PDFJ: Console Restructure       */ 01600000
*/*  $LA=CSTAR,    JBB7727, 020202,  PDDV: Console Restructure       */ 01610000
*/*  $LB=CSTARMC,  JBB7727, 020507,  PDSS: MCache Support            */ 01620000
*/*  $LC=CSTAR  ,  JBB7727, 020827,  PDDV: Console Restructure       */ 01630000
*/*  $LD=CSTAR  ,  JBB7727, 021025,  PDKK: Remove UD processing      */ 01640000
*/*  $PC=PZO0063,  JBB7727, 030328,  PDTA: Correct request flags     */ 01650000
*/*  $LE=CNZ1B  ,  HBB7720, 040212,  PDD0: TRACK ELIMINATION         */ 01660000
*/*  $PD=ME00837,  HBB7720, 040615,  PDSW: Reversioning              */ 01670000
*/*  $PE=ME01663,  HBB7720, 040901,  PDSW: Reversioning Cancelled    */ 01680000
*/*                                                                  */ 01690000
*/*  $LF=CNZ2A,    HBB7730, 040512,  PDD0: 1-Byte Console Id Removal */ 01700000
*/*                                        Part 2                    */ 01710000
*/*  $LG=CNZ2A,    HBB7730, 040512,  PDD0: Master Console and Switch */ 01720000
*/*                                        Removal                   */ 01730000
*/*  $LH=CNZ2A,    HBB7730, 040512,  PDD0: New Routing Attributes    */ 01740000
*/*  $LI=DCRA990,  HBB7730, 051512,  PDKX: USS Msg Intigration       */ 01750000
*/*                                        support(MDB sent from USS)*/ 01760000
*/*  $LJ=CNZ2A,    HBB7730, 060228,  PDD0: Improve MDBCCNID Comments */ 01770000
*/*  $PF=ME06909,  HBB7730, 060801,  PDA2: Add MDBCTOFF2             */ 01780000
*/*  $LK=JESSDSF,  HBB7750, 070317,  PDSS: Support WTLBlk            */ 01790000
*/*  $LL=MFANOXIT, HBB7760, 080315,  PDSW: MFA Support               */ 01800000
*/*  $LM=AUTOR,    HBB7770, 081225,  PDSS: Auto-reply support        */ 01810000
*/*  $04=OA37957,  HBB7780, 120302,  PDKK: Verbose message support   */ 01820000
*/*  $05=OA38106,  HBB7780, 120330,  PDHB: Defined MDB_No_SYSLOG and */ 01821001
*/*                                        MDB_WQEJ3B1 to support    */ 01822001
*/*                                        JES3 APAR OA37705.    @05A*/ 01823001
*/*                                                                  */ 01824001
*/*                                                                  */ 01830000
*/*<><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><>*/ 01840000
*/* If the MDB size is expanded, USS module BPXBDOPL must be         */ 01850000
*/* recompiled.                                                      */ 01860000
*/*<><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><>*/ 01870000
*/*                                                                  */ 01880000
*/* **** END OF SPECIFICATIONS ***************************************/ 01890000
*                                                                       01900000
*/* **** START OF CHANGE ACTIVITY ************************************/ 01910000
*/*                                                                  */ 01920000
*/*  A - ADD                                                         */ 01930000
*/*  D - DELETE                                                      */ 01940000
*/*  C - CHANGE                                                      */ 01950000
*/*  M - MOVE                                                        */ 01960000
*/* ---------------------------------------------------------------- */ 01970000
*/* (C) Change version number from 5694-A01 to 5637-A01.         @PDA*/ 01980000
*/* (D) - Reserve MDBCRCCN, MDBMCSH, and MDBCRQUN.               @LFA*/ 01990000
*/* (D) - Remove IEAVG138 from the comments because it is being  @LGA*/ 02000000
*/*       deleted.                                               @LGA*/ 02010000
*/* (D) - Reserve MDBCFIDO.                                      @LGA*/ 02020000
*/* (C) - Rename MDBCINSC to MDBCUNKC.                           @LHA*/ 02030000
*/* (C) - Change description of MDBCINTC and MDBCUNKC.           @LHA*/ 02040000
*/* (C) - Change reserve bit in MDBCMSC2 to indicate MDB has     @LIA*/ 02050000
*/*       been sent from USS                                     @LIA*/ 02060000
*/* (C) - Improve the comments for MDBCCNID.                     @LJA*/ 02070000
*/* (C) - Change reserved field MDBCRSV6 to MDBCTOFF2            @PFA*/ 02080000
*/* (A) - Add a STCKE time stamp field                           @LKA*/ 02090000
*/* (A) - Add MDBC_Processed_By_MFA bit.                         @LLA*/ 02100000
*/* (A) - Add auto-reply fields                                  @LMA*/ 02110000
*/* (C) - Change MDBTRSV1 to MDBTOPTT Reserved for IBM use       @04A*/ 02120000
*/* (A) - Defined MDB_No_SYSLOG and MDB_WQEJ3B1 in MDB_Misc_Flags.   */ 02121001
*/*       IEAVG715 will copy WQENSYL and WQEJ3B1, respectively.      */ 02122001
*/*       This will allow JES3 to better manage their DLOG Write-    */ 02123001
*/*       To-Log function.                                       @05A*/ 02124001
*/*                                                                  */ 02125001
*/* **** END OF CHANGE ACTIVITY **************************************/ 02130000
*                                                                       02140000
*   %GOTO MDBPLS;/*                                                     02150000
********************************************************************    02160000
*                                                                       02170000
* Main Header object for the message block                              02180000
*                                                                       02190000
********************************************************************    02200000
MDB            DSECT                 START OF MDB HEADER                02210000
MDBLEN         DS    H               MDB length                         02220000
MDBTYPE        DS    CL2             MDB type                           02230000
MDBTYP1        EQU   X'0001'         Type for MDB Type 1                02240000
MDBMID         DS    CL4             Acronym 'MDB '                     02250000
MDBVER         DS    XL4             Revision code                      02260000
MDBVER1        EQU   X'00000001'     Revision code 1              @L4C  02270000
MDBVID         EQU   MDBVER1         Current revision code              02280000
MDBHLEN        EQU   *-MDB           Length of MDB Header section @P7C  02290000
********************************************************************    02300000
*                                                                       02310000
* General object for the message data block                             02320000
*                                                                       02330000
********************************************************************    02340000
MDBG           DSECT                 General Object Section             02350000
MDBGLEN        DS    H               General object length              02360000
MDBGTYPE       DS    CL2             General object type                02370000
MDBGOBJ        EQU   X'0001'         Type for general object            02380000
MDBGMID        DS    0XL4            Message ID                    @P2C 02390000
MDBGSYID       DS    CL1             System ID                     @L1A 02400000
MDBGSEQ        DS    XL3             Sequence Number               @L1A 02410000
MDBGTIMH       DS    CL8             Time stamp HH.MM.SS format         02420000
MDBGTIMT       DS    CL3             Time stamp .TH format              02430000
MDBGRSV1       DS    CL1             Reserved                           02440000
MDBGDSTP       DS    CL7             Date stamp                         02450000
MDBGRSV2       DS    CL1             Reserved                           02460000
MDBGMFLG       DS    XL2             Message flags                      02470000
MDBGDOM        EQU   X'8000'         DOM bit.  If this bit is on it    +02480000
                                     indicates that this MDB is for a  *02490000
                                     DOM.  The DOM information can be  *02500000
                                     found in the DOM flags in the     *02510000
                                     control program object (MDBDOMFL) *02520000
                                                                   @P7C 02530000
MDBGALRM       EQU   X'4000'         Sound warning alarm (processor    *02540000
                                     controller only)              @P7C 02550000
MDBGHOLD       EQU   X'2000'         Hold bit, Hold message until DOMed+02560000
                                     or deleted via other external     +02570000
                                     means                              02580000
MDBGRSV3       DS    CL2             Reserved                           02590000
********************************************************************    02600000
*                                                                       02610000
* The constants for the following fields can be found in section   @P7A 02620000
* PRESENTATION ATTRIBUTES EQUATES                                  @P7A 02630000
*                                                                       02640000
********************************************************************    02650000
MDBGFGPA       DS    0XL4            Foreground presentation           +02660000
                                     attributes                    @P3C 02670000
MDBGFCON       DS    XL1             Foreground control field      @P3C 02680000
MDBGFCOL       DS    XL1             Foreground color field        @P3C 02690000
MDBGFHIL       DS    XL1             Foreground highlighting       @P3C 02700000
MDBGFINT       DS    XL1             Foreground intensity          @P3C 02710000
MDBGBGPA       DS    0XL4            Background presentation           +02720000
                                     attributes                    @P3C 02730000
MDBGBCON       DS    XL1             Background control field      @P3C 02740000
MDBGBCOL       DS    XL1             Background color field        @P3C 02750000
MDBGBHIL       DS    XL1             Background highlighting       @P3C 02760000
MDBGBINT       DS    XL1             Background intensity          @P3C 02770000
MDBGOSNM       DS    CL8             Originating system name            02780000
MDBGJBNM       DS    CL8             Job name                           02790000
********************************************************************    02800000
*                                                                       02810000
* Control program object for the message data block                     02820000
*                                                                       02830000
********************************************************************    02840000
MDBSCP         DSECT                 Control Program Section            02850000
MDBCLEN        DS    H               Control program object length @P7C 02860000
MDBCTYPE       DS    CL2             Object type                        02870000
MDBCOBJ        EQU   X'0002'         Type for control prog object  @P7C 02880000
MDBCPROD       DS    0CL16           Originating system identifier @P5C 02890000
MDBCVER        DS    XL4             MVS CP object version level   @P5A 02900000
MDBCPNAM       DS    CL4             Control Program name ("MVS")  @P5A 02910000
MDBCFMID       DS    CL8             FMID of originating system    @P5A 02920000
MDBCVER1       EQU   X'00000001'     MVS CP object version 1       @P5A 02930000
MDBCVER2       EQU   X'00000002'     JBB4422 object version 2      @L5A 02940000
MDBCVER3       EQU   X'00000003'     OY65627 object version 3      @P9C 02950000
MDBCVER4       EQU   X'00000004'     HBB5510 object version 4      @P9A 02960000
MDBCVER5       EQU   X'00000005'     HBB5520 object version 5      @L8A 02970000
MDBCV10        EQU   X'00000010'     Structurally equivalent ot HBB5520x02980000
                                     with OW20064 (430)            @03A 02990000
MDBCV20        EQU   X'00000020'     Structurally equivalent ot HBB5520x03000000
                                     with OW20064 (510)            @03A 03010000
MDBCV30        EQU   X'00000030'     HBB5520 object with OW20064   @03A 03020000
MDBCV50        EQU   X'00000050'     HBB7750 level                 @LKA 03030000
MDBCV70        EQU   X'00000070'     HBB7770 level                 @LMA 03040000
MDBCVID        EQU   MDBCV70         Current MVS CP object version @LMC 03050000
MDBCMVS        EQU   C'MVS '         Control Program name          @P5A 03060000
MDBCERC        DS    CL16            Routing codes                 @P7Cx03070000
                                       1st bit = Route Code 1      @P7Ax03080000
                                       2nd bit = Route Code 2      @P7Ax03090000
                                              .  .  .              @P7Ax03100000
                                       128th bit = Route Code 128  @P7A 03110000
MDBCDESC       DS    0CL2            Descriptor codes              @P2C 03120000
MDBDESC1       DS    CL1             Descriptor codes byte 1       @L1A 03130000
MDBDESCA       EQU   X'80'           System failure                @L1A 03140000
MDBDESCB       EQU   X'40'           Immediate action required     @L1A 03150000
MDBDESCC       EQU   X'20'           Eventual action required      @L1A 03160000
MDBDESCD       EQU   X'10'           System status                 @L1A 03170000
MDBDESCE       EQU   X'08'           Immediate command response    @L1A 03180000
MDBDESCF       EQU   X'04'           Job status                    @L1A 03190000
MDBDESCG       EQU   X'02'           Application program/processor @L1A 03200000
MDBDESCH       EQU   X'01'           Out-of-line                   @L1A 03210000
MDBDESC2       DS    CL1             Descriptor codes byte 2       @L1A 03220000
MDBDESCI       EQU   X'80'           Operator's request            @L1A 03230000
MDBDESCJ       EQU   X'40'           Reserved                      @LEC 03240000
MDBDESCK       EQU   X'20'           Critical eventual action      @L1A 03250000
MDBDESCL       EQU   X'10'           Important Information         @P7C 03260000
MDBDESCM       EQU   X'08'           Previously automated          @L5C 03270000
MDBDESCN       EQU   X'04'           Reserved                      @L1A 03280000
MDBDESCO       EQU   X'02'           Reserved                      @L1A 03290000
MDBDESCP       EQU   X'01'           Reserved                      @L1A 03300000
MDBCMLVL       DS    0CL2            Message level                      03310000
MDBMLVL1       DS    CL1             Message level byte 1          @L1A 03320000
MDBMLR         EQU   X'80'           WTOR                          @L1A 03330000
MDBMLIA        EQU   X'40'           Immediate action              @L1A 03340000
MDBMLCE        EQU   X'20'           Critical eventual action      @L1A 03350000
MDBMLE         EQU   X'10'           Eventual action               @L1A 03360000
MDBMLI         EQU   X'08'           Informational                 @L1A 03370000
MDBMLBC        EQU   X'04'           Broadcast                     @L1A 03380000
MDBMLRSG       EQU   X'02'           Reserved                      @L1A 03390000
MDBMLRSH       EQU   X'01'           Reserved                      @L1A 03400000
MDBMLVL2       DS    CL1             Message level byte 2          @L1A 03410000
MDBMLRSI       EQU   X'80'           Reserved                      @L1A 03420000
MDBMLRSJ       EQU   X'40'           Reserved                      @L1A 03430000
MDBMLRSK       EQU   X'20'           Reserved                      @L1A 03440000
MDBMLRSL       EQU   X'10'           Reserved                      @L1A 03450000
MDBMLRSM       EQU   X'08'           Reserved                      @L1A 03460000
MDBMLRSN       EQU   X'04'           Reserved                      @L1A 03470000
MDBMLRSO       EQU   X'02'           Reserved                      @P4C 03480000
MDBMLRSP       EQU   X'01'           Reserved                      @P4C 03490000
MDBCATTR       DS    0CL2            Message Attribute flags            03500000
MDBCATT1       DS    CL1             First byte of attributes           03510000
MDBCSUPP       EQU   X'80'           Message is suppressed         @P9A 03520000
MDBCMCSC       EQU   X'40'           Message is command response        03530000
MDBCAUTH       EQU   X'20'           Message issued by authorized      +03540000
                                     program                       @P4C 03550000
MDBCRETN       EQU   X'10'           Message is retained by AMRF   @P7C 03560000
MDBCSPVD       EQU   X'08'           WQE Backlog Message           @01A 03570000
MDBCQNLY       EQU   X'04'           Console only                  @02A 03580000
MDBCATT2       DS    CL1             Second byte of attributes          03590000
MDBCRSV7       DS    H               Reserved                      @LCC 03600000
MDBCRSV5       DS    H               Reserved                      @D3C 03610000
MDBCASID       DS    H               ASID of issuer                     03620000
MDBCTCB        DS    AL4             Job Step TCB for issuer       @P6C 03630000
MDBCTOKN       DS    XL4             Token (for DOM)               @P3C 03640000
MDBCSYID       DS    XL1             System ID (for DOM)                03650000
MDBDOMFL       DS    XL1             DOM flags                          03660000
MDBDMSGI       EQU   X'80'           DOM by message id (can be found   +03670000
                                     in MDBGMID)                   @P7C 03680000
MDBDSYSI       EQU   X'40'           DOM by system ID                   03690000
MDBDASID       EQU   X'20'           DOM by ASID                        03700000
MDBDJTCB       EQU   X'10'           DOM by job step TCB                03710000
MDBDTOKN       EQU   X'08'           DOM by token                       03720000
MDBDNORM       EQU   X'04'           This is a Normal DOM          @LAA 03730000
MDBCMISC       DS    B               Miscellaneous Routing Info    @P4C 03740000
MDBCRSV2       EQU   X'80'           Reserved. Was MDBCUD          @LDC 03750000
MDBCRSV3       EQU   X'40'           Reserved. Was MDBCFUDO        @LDC 03760000
MDBRSV18       EQU   X'20'           Reserved - was MDBCFIDO (Queue by X03770000
                                     ID only)                      @LGC 03780000
MDBCAUT        EQU   X'10'           Queue by automation           @L5A 03790000
MDBCHC         EQU   X'08'           Queue by hardcopy             @L6A 03800000
MDBCINTC       EQU   X'04'           Receiving INTIDS (Console ID      X03810000
                                     zero)                         @LHC 03820000
MDBCUNKC       EQU   X'02'           Receiving UNKNIDS (Unknown        X03830000
                                     Console IDs)                  @LHC 03840000
MDBCMSC2       DS    B               Miscellaneous OPERLOG info    @L8C 03850000
MDBCOCMD       EQU   X'80'           Echo operator command         @L8A 03860000
MDBCICMD       EQU   X'40'           Echo internal command         @L8A 03870000
MDBCWTL        EQU   X'20'           Result of WTL macro           @L8A 03880000
MDBCOPON       EQU   X'10'           MDB has been sent from USS    @LIA 03890000
MDBCOJID       DS    CL8             Originating Job ID                 03900000
MDBCKEY        DS    CL8             Retrieval key (Source: WTO)   @P7C 03910000
MDBCAUTO       DS    CL8             Automation token                   03920000
MDBCCART       DS    CL8             Command and Response Token        *03930000
                                     (Source: WTO)                 @P7C 03940000
MDBCCNID       DS    CL4             4-Byte Console ID                 X03950000
                                     Note: This console id may not     X03960000
                                     have a console name associated    X03970000
                                     with it. The console id itself    X03980000
                                     may not correspond to a real      X03990000
                                     console. Console ids 00FFFFFFx    X04000000
                                     and 000000FFx are examples of     X04010000
                                     this.                         @LJC 04020000
MDBCMSGT       DS    0CL2            Message type                  @D2C 04030000
MDBCMGT1       DS    B               First byte of message type        +04040000
                                     flags                         @D2A 04050000
MDBMSGTA       EQU   X'80'           Display jobnames              @D2A 04060000
MDBMSGTB       EQU   X'40'           Display status                @D2A 04070000
MDBMSGTC       EQU   X'20'           Monitor active                @D2A 04080000
MDBMSGTD       EQU   X'10'           Indicates existence of QID field  +04090000
                                     in WPL  (AOS/1)               @D2A 04100000
MDBRSV13       EQU   X'08'           Reserved                      @D2A 04110000
MDBMSGTF       EQU   X'04'           Monitor SESS                  @D2A 04120000
MDBRSV14       EQU   X'02'           Reserved                      @D2A 04130000
MDBRSV15       EQU   X'01'           Reserved                      @D2A 04140000
MDBCMGT2       DS    B               Second byte of message type       +04150000
                                     flags                         @D2A 04160000
MDBCRPYL       DS    H               Reply ID Length                    04170000
MDBCRPYI       DS    CL8             Reply ID (EBCDIC representation)  +04180000
                                                                   @D1C 04190000
MDBCTOFF2      DS    CL2             Like MDBCTOFF but allows for      X04200000
                                     non-auth, non-action message  @PFC 04210000
MDBCTOFF       DS    CL2             Offset in the message text field  *04220000
                                     of the beginning of the msg   @P7C 04230000
MDBCRPYB       DS    BL4             Reply ID (Binary representation)  +04240000
                                                                   @P1C 04250000
MDBCAREA       DS    C               Area ID                       @P4C 04260000
MDB_Autor_Reply_Len DS FL1           Reply length for auto-reply   @LMC 04270000
MDBCLCNT       DS    BL4             Number of lines in message    @D3C 04280000
MDBCOJBN       DS    CL8             Originating job name          @D3A 04290000
MDBCSPLX       DS    CL8             Sysplex name                  @D4A 04300000
MDBCXMOD       DS    0CL4            Copy of request flags (CTXTRFLG)  X04310000
                                     from the WTO user exit interface  X04320000
                                                                   @L8A 04330000
MDBCRFLG       DS    0CL3            Comm Task user exit requests  @L8A 04340000
MDBCRFB1       DS    B               Request flags byte one        @L8A 04350000
MDBCRCMT       EQU   X'80'           Message text was changed      @L8A 04360000
MDBCRCRC       EQU   X'40'           Routing code(s) were changed  @L8A 04370000
MDBCRCDC       EQU   X'20'           Descriptor code(s) were changed   X04380000
                                                                   @L8A 04390000
MDBCRQPC       EQU   X'10'           Queued to a particular active     X04400000
                                     console                       @L8A 04410000
MDBRSV17       EQU   X'08'           Reserved - was MDBCRQUN (Queue    X04420000
                                     to a particular console           X04430000
                                     unconditionally)              @LFC 04440000
MDBCRQRC       EQU   X'04'           Queued by routing codes only  @L8A 04450000
MDBRSV16       EQU   X'02'           Reserved - was MDBCRCCN (1-byte   X04460000
                                     console ID was changed)       @LFC 04470000
MDBCRPML       EQU   X'01'           Minor lines were processed    @L8A 04480000
MDBCRFB2       DS    B               Request flags byte two        @L8A 04490000
MDBCRDTM       EQU   X'80'           Message was deleted           @L8A 04500000
MDBCROMS       EQU   X'40'           MPF suppression Overrided     @L8A 04510000
MDBCRFHC       EQU   X'20'           Hardcopy forced               @L8A 04520000
MDBCRNHC       EQU   X'10'           No hardcopy forced            @L8A 04530000
MDBCRHCO       EQU   X'08'           Only hardcopy forced          @L8A 04540000
MDBCRBCA       EQU   X'04'           Broadcasted message to active     X04550000
                                     consoles                      @L8A 04560000
MDBCRBCN       EQU   X'02'           Did not broadcast message         X04570000
                                     to active consoles            @L8A 04580000
MDBCRNRT       EQU   X'01'           AMRF is not to retain this        X04590000
                                     message                       @PCC 04600000
MDBCRFB3       DS    B               Request flags byte three      @L8A 04610000
MDBCRRET       EQU   X'80'           AMRF is to retain this message@PCC 04620000
MDBCRCKY       EQU   X'40'           Changed the retrieval key     @L8A 04630000
MDBCRCFC       EQU   X'20'           Changed the 4-byte console id @L8A 04640000
MDBCRCMF       EQU   X'10'           Changed the message type flags    X04650000
                                                                   @L8A 04660000
MDBCRANO       EQU   X'08'           Automation was not required   @L8A 04670000
MDBCRAYS       EQU   X'04'           Automation was required and/or    X04680000
                                     automation token updated      @L8A 04690000
MDBCQHCO       EQU   X'02'           Message issued hardcopy only  @L8A 04700000
MDBCRSV8       EQU   X'01'           Reserved. Was MDBCHUD         @LDC 04710000
MDBCSUPB       DS    B               Suppression byte              @L8A 04720000
MDBCSNSV       EQU   X'80'           Not serviced by any WTO user exit X04730000
                                     routine                       @L8A 04740000
MDBCSEER       EQU   X'40'           A WTO user exit ABENDed while     X04750000
                                     processing this message       @PCC 04760000
MDBCSNSI       EQU   X'20'           Not serviced because of an        X04770000
                                     incompatible request          @L8A 04780000
MDBCSAUT       EQU   X'10'           Indicate automation specified @L8A 04790000
MDBC_Processed_By_MFA EQU   X'08'    Message Flood Automation          X04800000
                                     processed this message        @LLC 04810000
MDBCSSSI       EQU   X'04'           Suppressed by a subsystem     @L8A 04820000
MDBCSWTO       EQU   X'02'           Suppressed by a WTO user exit     X04830000
                                     routine                       @L8A 04840000
MDBCSMPF       EQU   X'01'           Suppressed by MPF or Message      X04850000
                                     Flood Automation              @LLC 04860000
MDBCCNNM       DS    CL8             Console name                  @D5A 04870000
MDBCMCSF       DS    0CL2            MCS flags from WPL            @D5A 04880000
MDBMCSF1       DS    B               First byte of MCS flags       @D5A 04890000
MDBMCSA        EQU   X'80'           Route/Descriptor code fields      X04900000
                                     present                       @03A 04910000
MDBMCSB        EQU   X'40'           Message queued to console id      X04920000
                                     in MDBCCNID                   @LFC 04930000
MDBMCSC        EQU   X'20'           MCSFLAG=RESP was specified    @03A 04940000
MDBMCSD        EQU   X'10'           Message type field exists     @03A 04950000
MDBMCSE        EQU   X'08'           MCSFLAG=REPLY was specified   @03A 04960000
MDBMCSF        EQU   X'04'           MCSFLAG=BRDCST was specified  @03A 04970000
MDBMCSG        EQU   X'02'           MCSFLAG=HRDCPY was specified  @03A 04980000
MDBMCSHX       EQU   X'01'           Reserved - meant MCSFLAG=QREG0    X04990000
                                     was specified                 @LFC 05000000
MDBMCSF2       DS    B               Second byte of MCS flags      @D5A 05010000
MDBMCSI        EQU   X'80'           MCSFLAG=NOTIME was specified  @D5A 05020000
MDBMCSJ        EQU   X'40'           MLWTO indicator               @03A 05030000
MDBMCSK        EQU   X'20'           Primary subsystem use         @03A 05040000
MDBMCSL        EQU   X'10'           Extended WPL used             @03A 05050000
MDBMCSM        EQU   X'08'           MCSFLAG= CMD was specified    @03A 05060000
MDBMCSN        EQU   X'04'           MCSFLAG=NOCPY was specified   @03A 05070000
MDBMCSO        EQU   X'02'           WQEBLK used                   @03A 05080000
MDB_Autor_Delay DS   FL2             Auto-reply delay time         @LMC 05090000
MDBCETOD       DS    CL16            Time stamp of when message was    X05100000
                                     issued. In STCKE format       @LKA 05110000
MDB_Misc_Flags DS    BL1             Misc. Flags                   @LMA 05120000
MDB_Autor_Data_Valid   EQU X'80'     MDB contains valid auto-reply     X05130000
                                     data                          @LMA 05140000
MDB_Autor_Delay_In_Sec EQU X'40'     Auto-reply delay time is in       X05150000
                                     seconds                       @LMA 05160000
MDB_No_SYSLOG EQU X'20'              Copy of WQENSYL (for JES3).   @05A 05161001
MDB_WQEJ3B1   EQU X'10'              Copy of WQEJ3B1 (for JES3).   @05A 05162001
MDB_Autor_Reply DS CL64              Auto-reply reply              @LMA 05170000
                DS CL23              Reserved                      @LMA 05180000
********************************************************************    05190000
*                                                                       05200000
* Message text object for the message block                             05210000
*                                                                       05220000
********************************************************************    05230000
MDBT           DSECT                 Start of text object               05240000
MDBTLEN        DS    H               Text object length                 05250000
MDBTTYPE       DS    CL2             Text object type                   05260000
MDBTOBJ        EQU   X'0004'         Type for message text object       05270000
MDBTLNTY       DS    0CL2            Line type flags - 2 bytes          05280000
MDBTLNT1       DS    CL1             Line type flags byte 1             05290000
MDBTCONT       EQU   X'80'           Control text                       05300000
MDBTLABT       EQU   X'40'           Label text                         05310000
MDBTDATT       EQU   X'20'           Data text                          05320000
MDBTENDT       EQU   X'10'           End text                           05330000
MDBTPROT       EQU   X'08'           Prompt text                        05340000
MDBTOPTT       EQU   X'04'           Reserved for IBM use          @04C 05350000
MDBTRSV2       EQU   X'02'           Reserved                      @D3C 05360000
MDBTLNT2       DS    CL1             Line type flags byte 2             05370000
MDBTFPAF       EQU   X'01'           Text object presentation attribute+05380000
                                     field overrides general object    +05390000
                                     presentation attribute field  @L4C 05400000
MDBTMTPA       DS    0XL4            Presentation attribute        @P3C 05410000
MDBTPCON       DS    XL1             Presentation control field    @P3C 05420000
MDBTPCOL       DS    XL1             Presentation color field      @P3C 05430000
MDBTPHIL       DS    XL1             Presentation highlighting     @P3C 05440000
MDBTPINT       DS    XL1             Presentation intensity        @P3C 05450000
MDBTMSGT       EQU   *               Message text field            @P7C 05460000
MDBTMBOB       EQU   MDBTMSGT-MDBT   Length of the message text object +05470000
                                     minus the text field.  This can be+05480000
                                     used to compute the text field    +05490000
                                     length (i.e.MDBTLEN-MDBTMBOB) @P7A 05500000
********************************************************************    05510000
*                                                                       05520000
* Presentation Attributes Equates                                       05530000
*                                                                       05540000
********************************************************************    05550000
* CONTROL ATTRIBUTES                                                    05560000
MDBSNALM       EQU   X'80'           Sound note alarm (presentation    *05570000
                                     device's 'beep' alarm)        @P7C 05580000
* COLOR ATTRIBUTES                                                      05590000
MDBBLACK       EQU   X'F0'           Presentation  background-black on +05600000
                                     display, white on printer          05610000
MDBBLUE        EQU   X'F1'           Color is blue                      05620000
MDBRED         EQU   X'F2'           Color is red                       05630000
MDBPINK        EQU   X'F3'           Color is pink (magenta)            05640000
MDBGREEN       EQU   X'F4'           Color is  green                    05650000
MDBTURQ        EQU   X'F5'           Color is turquoise (cyan)          05660000
MDBYELOW       EQU   X'F6'           Color is  yellow                   05670000
MDBWHITE       EQU   X'F7'           Presentation  neutral-white on    +05680000
                                     display, black on a printer   @P4C 05690000
* HIGHLIGHTING ATTRIBUTES                                               05700000
MDBHNONE       EQU   X'00'           No highlighting is in effect       05710000
MDBBLINK       EQU   X'F1'           Blinking highlight                 05720000
MDBRVIDO       EQU   X'F2'           Reverse video highlight            05730000
MDBUNDER       EQU   X'F4'           Underscore highlight               05740000
* INTENSITY ATTRIBUTES                                                  05750000
MDBINORM       EQU   X'E4'           Normal intensity                   05760000
MDBIHIGH       EQU   X'E8'           High (bright) intensity            05770000
          MEND  ,  */                                                   05780000
*                                                                       05790000
* %MDBPLS:;                                                             05800000
* %MDBLPUSH = '@LISTPUSH';          /* Equate for listing control    */ 05810000
* %MDBLPOP = '@LISTPOP';            /* Equate for listing control    */ 05820000
* %MDBLOFF = '@LISTOFF';            /* Equate for listing control    */ 05830000
* MDBLPUSH;                         /* @LISTPUSH                     */ 05840000
* %IF MDBVIA = 'YES' %THEN          /* Check if MDB ALET is specified*/ 05850000
*   %IEAVM105_MDBVIA = 'VIA(MDBALET)'; /* Set VIA to specified value    05860000
*                                                                @LBC*/ 05870000
* %ELSE                                                                 05880000
*   %IF GLOBALARMODE = 'YES' %THEN  /* MDB ALET not specified-check if  05890000
*                                      global default specified  @P4C*/ 05900000
*     %IEAVM105_MDBVIA = 'VIA(0)';  /* If yes then set global    @LBC*/ 05910000
*   %ELSE                                                               05920000
*     %IEAVM105_MDBVIA = '';        /* If no then set to nulls   @LBC*/ 05930000
*                                                                       05940000
* %IF IHALIST = 'YES' %THEN                                             05950000
*   %GOTO MDBZ1;                                                        05960000
* MDBLOFF;                                                              05970000
* %MDBZ1 : ;                                                            05980000
* %Dcl Mdb_InclMdbObjType ext char;                                     05990000
* %If translate(Mdb_InclMdbObjType) = 'YES'                             06000000
* %Then                                                                 06010000
*   %Do;                                                                06020000
*/********************************************************************/ 06030000
*/*                                                                  */ 06040000
*/* MDB Generic Object Type                                          */ 06050000
*/*                                                                  */ 06060000
*/*   Each object in the MDB has a 4 byte structure at offset zero   */ 06070000
*/*   that consists of a 2 byte length and a 2 byte type.            */ 06080000
*/*                                                                  */ 06090000
*/********************************************************************/ 06100000
*  Dcl 1 Mdb_tMdbObject type                                            06110000
*       ,3 ObjectLen fixed(15)      /* Length of object          @LAA*/ 06120000
*       ,3 ObjectType isa(Mdb_tObjType);/* Type of MDB Object    @LAA*/ 06130000
*  Dcl Mdb_tObjType fixed(16) type;                                     06140000
*  Dcl Mdb_kGenObj  isa(Mdb_tObjType) constant(MDBGOBJ);                06150000
*  Dcl Mdb_kScpObj  isa(Mdb_tObjType) constant(MDBCOBJ);                06160000
*  Dcl Mdb_kTxtObj  isa(Mdb_tObjType) constant(MDBTOBJ);                06170000
*   %End;                                                               06180000
*/********************************************************************/ 06190000
*/*                                                                  */ 06200000
*/* MDB (Main header for the block)                                  */ 06210000
*/*                                                                  */ 06220000
*/********************************************************************/ 06230000
* %Dcl IEAVM105_TypeDcl ext char;                             /* @LCA*/ 06240000
* Dcl                                                                   06250000
* %If translate(IEAVM105_TypeDcl) = 'YES' /* If Mdb Type requested      06260000
*                                                                @LCA*/ 06270000
* %Then                                                                 06280000
*   %Do;                            /* Do Mdb Type               @LCA*/ 06290000
*    1 tMdbHeader Bdy(hWord) type,  /* Mdb Header Type           @LCA*/ 06300000
*   %End;                           /* EndDo Mdb Type            @LCA*/ 06310000
* %Else                                                                 06320000
*   %Do;                            /* Do Mdb non-type           @LCA*/ 06330000
*    1 MDB     BDY(HWORD) IEAVM105_MDBVIA BASED(MDBPTR),                06340000
*                                   /* Start of MDB header       @LBC*/ 06350000
*   %End;                           /* EndDo Mdb non-type        @LCA*/ 06360000
*      3 MDBLEN     FIXED(16),      /*  MDB length               @PBC*/ 06370000
*      3 MDBTYPE    CHAR(2),        /*  MDB type                     */ 06380000
*      3 MDBMID     CHAR(4),        /*  Acronym 'MDB'                */ 06390000
*      3 MDBVER     BIT(32);        /*  Revision code                */ 06400000
*/********************************************************************/ 06410000
*/*                                                                  */ 06420000
*/* General object for the message data block                        */ 06430000
*/*                                                                  */ 06440000
*/********************************************************************/ 06450000
* Dcl                                                                   06460000
* %If translate(IEAVM105_TypeDcl) = 'YES' /* If Mdb Type requested      06470000
*                                                                @LCA*/ 06480000
* %Then                                                                 06490000
*   %Do;                            /* Do Mdb Type               @LCA*/ 06500000
*    1  tMdbG Bdy(hWord) type,      /* General Object Section Type      06510000
*                                                                @LCA*/ 06520000
*   %End;                           /* EndDo Mdb Type            @LCA*/ 06530000
* %Else                                                                 06540000
*   %Do;                            /* Do Mdb non-type           @LCA*/ 06550000
*    1  MDBG   BDY(HWORD) IEAVM105_MDBVIA BASED,                        06560000
*   %End;                           /* EndDo Mdb non-type        @LCA*/ 06570000
*                                   /*  General object section   @LBC*/ 06580000
*      3 MDBGLEN     FIXED(15),     /*  General object length        */ 06590000
*      3 MDBGTYPE    CHAR(2),       /*  General object type          */ 06600000
*      3 MDBGMID     BIT(32),       /*  Message ID               @P4C*/ 06610000
*        5 MDBGSYID  CHAR(1),       /*  System ID                @L1A*/ 06620000
*        5 MDBGSEQ   BIT(24),       /*  Sequence number          @L1A*/ 06630000
*      3 MDBGTIMH    CHAR(8),       /*  Time stamp HH.MM.SS format   */ 06640000
*      3 MDBGTIMT    CHAR(3),       /*  Time stamp .TH format        */ 06650000
*      3 MDBGRSV1    CHAR(1),       /*  Reserved                 @P4C*/ 06660000
*      3 MDBGDSTP    CHAR(7),       /*  Date stamp                   */ 06670000
*      3 MDBGRSV2    CHAR(1),       /*  Reserved                 @P4C*/ 06680000
*      3 MDBGMFLG    BIT(16),       /*  Message flags                */ 06690000
*        5 MDBGDOM    BIT(1),       /*  DOM bit.  If this bit is on it  06700000
*                                       indicates that this MDB is for  06710000
*                                       a DOM.  The DOM information     06720000
*                                       can be found in the DOM flags   06730000
*                                       in the control program object   06740000
*                                       (MDBDOMFL)               @P7C*/ 06750000
*        5 MDBGALRM   BIT(1),       /*  Sound warning alarm (processor  06760000
*                                       controller only)         @P7C*/ 06770000
*        5 MDBGHOLD   BIT(1),       /*  Hold bit, Hold message until    06780000
*                                       DOMed or deleted via other      06790000
*                                       external means               */ 06800000
*        5 *          BIT(13),      /*  Reserved                 @L4A*/ 06810000
*      3 MDBGRSV3    CHAR(2),       /*  Reserved                 @P4C*/ 06820000
*/********************************************************************/ 06830000
*/*                                                                  */ 06840000
*/* The constants for the following fields can be found in       @P7A*/ 06850000
*/* section PRESENTATION ATTRIBUTES EQUATES                      @P7A*/ 06860000
*/*                                                                  */ 06870000
*/********************************************************************/ 06880000
*      3 MDBGFGPA    CHAR(4),       /*  Foreground presentation         06890000
*                                       attributes                   */ 06900000
*        5 MDBGFCON    BIT(8),      /*  Foreground control       @L4C*/ 06910000
*        5 MDBGFCOL    BIT(8),      /*  Foreground color         @L4C*/ 06920000
*        5 MDBGFHIL    BIT(8),      /*  Foreground highlighting  @L4C*/ 06930000
*        5 MDBGFINT    BIT(8),      /*  Foreground intensity     @L4C*/ 06940000
*      3 MDBGBGPA    CHAR(4),       /*  Background presentation         06950000
*                                       attributes                   */ 06960000
*        5 MDBGBCON    BIT(8),      /*  Background control       @L4C*/ 06970000
*        5 MDBGBCOL    BIT(8),      /*  Background color         @L4C*/ 06980000
*        5 MDBGBHIL    BIT(8),      /*  Background highlighting  @L4C*/ 06990000
*        5 MDBGBINT    BIT(8),      /*  Background intensity     @L4C*/ 07000000
*      3 MDBGOSNM    CHAR(8),       /*  Originating system name      */ 07010000
*      3 MDBGJBNM    CHAR(8);       /*  Job name                     */ 07020000
*/********************************************************************/ 07030000
*/*                                                                  */ 07040000
*/* Control program object for the message data block                */ 07050000
*/*                                                                  */ 07060000
*/********************************************************************/ 07070000
* Dcl                                                                   07080000
* %If translate(IEAVM105_TypeDcl) = 'YES' /* If Mdb Type requested      07090000
*                                                                @LCA*/ 07100000
* %Then                                                                 07110000
*   %Do;                            /* Do Mdb Type               @LCA*/ 07120000
*    1  tMdbScp Bdy(hWord) type,    /* Control Program Section Type     07130000
*                                                                @LCA*/ 07140000
*   %End;                           /* EndDo Mdb Type            @LCA*/ 07150000
* %Else                                                                 07160000
*   %Do;                            /* Do Mdb non-type           @LCA*/ 07170000
*    1  MDBSCP BDY(HWORD) IEAVM105_MDBVIA BASED,                        07180000
*                                   /*  Control program section  @LBC*/ 07190000
*   %End;                           /* EndDo Mdb non-type        @LCA*/ 07200000
*      3 MDBCLEN       FIXED(15),   /*  Control prog object len  @P7C*/ 07210000
*      3 MDBCTYPE      CHAR(2),     /*  Object type                  */ 07220000
*      3 MDBCPROD      CHAR(16),    /*  Originating system identifier   07230000
*                                                                @P5C*/ 07240000
*          7 MDBCVER   BIT(32),     /*  MVS CP object version level     07250000
*                                                                @P5A*/ 07260000
*          7 MDBCPNAM  CHAR(4),     /*  Control Program name     @P5A*/ 07270000
*          7 MDBCFMID  CHAR(8),     /*  FMID of originating system      07280000
*                                                                @P5A*/ 07290000
*      3 MDBCERC       CHAR(16),    /*  Routing codes                   07300000
*                                      1st bit =Route Code 1            07310000
*                                      2nd bit =Route Code 2            07320000
*                                            .  .  .                    07330000
*                                      128th bit =Route Code 128 @P7C*/ 07340000
*      3 MDBCDESC      CHAR(2),     /*  Descriptor codes             */ 07350000
*        5 MDBDESC1    BIT(8),      /*  Descriptor byte 1        @L1A*/ 07360000
*          7 MDBDESCA  BIT(1),      /*  System failure           @L1A*/ 07370000
*          7 MDBDESCB  BIT(1),      /*  Immediate action required       07380000
*                                                                @L1A*/ 07390000
*          7 MDBDESCC  BIT(1),      /*  Eventual action required @L1A*/ 07400000
*          7 MDBDESCD  BIT(1),      /*  System status            @L1A*/ 07410000
*          7 MDBDESCE  BIT(1),      /*  Immediate command response      07420000
*                                                                @L1A*/ 07430000
*          7 MDBDESCF  BIT(1),      /*  Job status               @L1A*/ 07440000
*          7 MDBDESCG  BIT(1),      /*  Application program/processor   07450000
*                                                                @L1A*/ 07460000
*          7 MDBDESCH  BIT(1),      /*  Out-of-line              @L1A*/ 07470000
*        5 MDBDESC2    BIT(8),      /*  Descriptor byte 2        @L1A*/ 07480000
*          7 MDBDESCI  BIT(1),      /*  Operator's request       @L1A*/ 07490000
*          7 MDBDESCJ  BIT(1),      /*  Reserved                 @LEC*/ 07500000
*          7 MDBDESCK  BIT(1),      /*  Critical eventual action @L1A*/ 07510000
*          7 MDBDESCL  BIT(1),      /*  Important information    @P7C*/ 07520000
*          7 MDBDESCM  BIT(1),      /*  Previously automated     @L5C*/ 07530000
*          7 MDBDESCN  BIT(1),      /*  Reserved                 @L1A*/ 07540000
*          7 MDBDESCO  BIT(1),      /*  Reserved                 @L1A*/ 07550000
*          7 MDBDESCP  BIT(1),      /*  Reserved                 @L1A*/ 07560000
*      3 MDBCMLVL      CHAR(2),     /*  Message level                */ 07570000
*        5 MDBMLVL1    BIT(8),      /*  Message level byte 1     @L1A*/ 07580000
*          7 MDBMLR    BIT(1),      /*  WTOR                     @L1A*/ 07590000
*          7 MDBMLIA   BIT(1),      /*  Immediate action         @L1A*/ 07600000
*          7 MDBMLCE   BIT(1),      /*  Critical eventual action @L1A*/ 07610000
*          7 MDBMLE    BIT(1),      /*  Eventual action          @L1A*/ 07620000
*          7 MDBMLI    BIT(1),      /*  Informational            @L1A*/ 07630000
*          7 MDBMLBC   BIT(1),      /*  Broadcast                @L1A*/ 07640000
*          7 MDBMLRSG  BIT(1),      /*  Reserved                 @L1A*/ 07650000
*          7 MDBMLRSH  BIT(1),      /*  Reserved                 @L1A*/ 07660000
*        5 MDBMLVL2    BIT(8),      /*  Message level byte 2     @L1A*/ 07670000
*          7 MDBMLRSI  BIT(1),      /*  Reserved                 @L1A*/ 07680000
*          7 MDBMLRSJ  BIT(1),      /*  Reserved                 @L1A*/ 07690000
*          7 MDBMLRSK  BIT(1),      /*  Reserved                 @L1A*/ 07700000
*          7 MDBMLRSL  BIT(1),      /*  Reserved                 @L1A*/ 07710000
*          7 MDBMLRSM  BIT(1),      /*  Reserved                 @L1A*/ 07720000
*          7 MDBMLRSN  BIT(1),      /*  Reserved                 @L1A*/ 07730000
*          7 MDBMLRSO  BIT(1),      /*  Reserved                 @L1A*/ 07740000
*          7 MDBMLRSP  BIT(1),      /*  Reserved                 @L1A*/ 07750000
*      3 MDBCATTR      CHAR(2),     /*  Message Attribute flags      */ 07760000
*        5 MDBCATT1    CHAR(1),     /*  First byte of attributes     */ 07770000
*          7 MDBCSUPP  BIT(1),      /*  Message is suppressed    @P9A*/ 07780000
*          7 MDBCMCSC  BIT(1),      /*  Message is command response  */ 07790000
*          7 MDBCAUTH  BIT(1),      /*  Message issued by authorized    07800000
*                                       program                      */ 07810000
*          7 MDBCRETN  BIT(1),      /*  Message is retained by          07820000
*                                       AMRF                     @P7C*/ 07830000
*          7 MDBCSPVD  BIT(1),      /*  WQE Backlog Message      @01A*/ 07840000
*          7 MDBCQNLY  BIT(1),      /*  Console only             @02A*/ 07850000
*          7 *         BIT(2),      /*  Reserved                 @02C*/ 07860000
*        5 MDBCATT2    CHAR(1),     /*  Second byte of attributes    */ 07870000
*      3 MDBCRSV7      FIXED(15),   /*  Reserved                 @LCC*/ 07880000
*      3 MDBCRSV5      FIXED(15),   /*  Reserved                 @D3C*/ 07890000
*      3 MDBCASID      FIXED(15),   /*  ASID of issuer               */ 07900000
*      3 MDBCTCB       BIT(32),     /*  Job Step TCB for issuer  @P6C*/ 07910000
*      3 MDBCTOKN      BIT(32),     /*  Token                        */ 07920000
*      3 MDBCSYID      BIT(8),      /*  System ID                @P4C*/ 07930000
*      3 MDBDOMFL      BIT(8),      /*  DOM flags                    */ 07940000
*        5 MDBDMSGI    BIT(1),      /*  DOM by message ID (can be       07950000
*                                       found in MDBGMID)        @P7C*/ 07960000
*        5 MDBDSYSI    BIT(1),      /*  DOM by system ID             */ 07970000
*        5 MDBDASID    BIT(1),      /*  DOM by ASID                  */ 07980000
*        5 MDBDJTCB    BIT(1),      /*  DOM by job step TCB          */ 07990000
*        5 MDBDTOKN    BIT(1),      /*  DOM by token                 */ 08000000
*        5 MDBDNORM    BIT(1),      /*  This is a Normal DOM     @LAA*/ 08010000
*        5 *           BIT(2),      /*  Reserved                 @LAC*/ 08020000
*/***************************************************************@L9A*/ 08030000
*/* If a change is made to MDBCMISC, that change must be         @L9A*/ 08040000
*/* reflected in the following bytes in the following macros:    @L9A*/ 08050000
*/* RCTBMISC (IEAVG101), MCSPMISC and MCSPPMSC (IEAVG116),       @L9A*/ 08060000
*/* ODTEMISC (IEAVG104), TWRPMISC (IEAVM141),                    @L9A*/ 08070000
*/* UCMEFMSC (IEECUCM), XVMISCRT (IHACTM),                       @LGC*/ 08080000
*/* WQEMISC and WMJMMISC (IHAWQE)                                @L9A*/ 08090000
*/***************************************************************@L9A*/ 08100000
*      3 MDBCMISC      BIT(8),      /*  Miscellaneous Routing Info      08110000
*                                                                @L2A*/ 08120000
*        5 MDBCRSV2    BIT(1),      /*  Reserved. Was MDBCUD     @LDC*/ 08130000
*        5 MDBCRSV3    BIT(1),      /*  Reserved. Was MDBCFUDO   @LDC*/ 08140000
*        5 MDBRSV18    BIT(1),      /*  Reserved - was MDBCFIDO (Queue  08150000
*                                       by id only)              @LGC*/ 08160000
*        5 MDBCAUT     BIT(1),      /*  QUEUE via Automation     @L5A*/ 08170000
*        5 MDBCHC      BIT(1),      /*  QUEUE via Hardcopy       @L6A*/ 08180000
*        5 MDBCINTC    BIT(1),      /*  Receiving INTIDS (Console ID    08190000
*                                       zero)                    @LHC*/ 08200000
*        5 MDBCUNKC    BIT(1),      /*  Receiving UNKNIDS (Unknown      08210000
*                                       Console IDs)             @LHC*/ 08220000
*        5 *           BIT(1),      /*  Reserved                 @L6C*/ 08230000
*      3 MDBCMSC2      BIT(8),      /*  Miscellaneous OPERLOG info      08240000
*                                                                @L8C*/ 08250000
*        5 MDBCOCMD    BIT(1),      /*  Echo operator command    @L8A*/ 08260000
*        5 MDBCICMD    BIT(1),      /*  Echo internal command    @L8A*/ 08270000
*        5 MDBCWTL     BIT(1),      /*  Result of WTL macro      @L8A*/ 08280000
*        5 MDBCOPON    BIT(1),      /*  MDB has been sent from USS      08290000
*                                                                @LIC*/ 08300000
*        5 *           BIT(4),      /*  Reserved                 @LIC*/ 08310000
*      3 MDBCOJID      CHAR(8),     /*  Originating Job ID           */ 08320000
*      3 MDBCKEY       CHAR(8),     /*  Retrieval key (Source: WTO)     08330000
*                                                                @P7C*/ 08340000
*      3 MDBCAUTO      CHAR(8),     /*  Automation token             */ 08350000
*      3 MDBCCART      CHAR(8),     /*  Command and Response token      08360000
*                                       (Source: WTO)            @P7C*/ 08370000
*      3 MDBCCNID      CHAR(4),     /*  4-Byte Console ID               08380000
*                                       Note: This console id may not   08390000
*                                       have a console name associated  08400000
*                                       with it. The console id itself  08410000
*                                       may not correspond to a real    08420000
*                                       console. Console ids 00FFFFFFx  08430000
*                                       and 000000FFx are examples of   08440000
*                                       this.                    @LJC*/ 08450000
*      3 MDBCMSGT      CHAR(2),     /*  Message type                 */ 08460000
*        5 MDBCMGT1  BIT(8),        /*  First byte of message type      08470000
*                                       flags                    @D2A*/ 08480000
*          7 MDBMSGTA BIT(1),       /*  Display jobnames         @D2A*/ 08490000
*          7 MDBMSGTB BIT(1),       /*  Display status           @D2A*/ 08500000
*          7 MDBMSGTC BIT(1),       /*  Monitor active           @D2A*/ 08510000
*          7 MDBMSGTD BIT(1),       /*  Indicates existence of QID      08520000
*                                       field in WPL (AOS/1)     @D2A*/ 08530000
*          7 MDBRSV13 BIT(1),       /*  Reserved                 @D2A*/ 08540000
*          7 MDBMSGTF BIT(1),       /*  Monitor SESS             @D2A*/ 08550000
*          7 MDBRSV14 BIT(1),       /*  Reserved                 @D2A*/ 08560000
*          7 MDBRSV15 BIT(1),       /*  Reserved                 @D2A*/ 08570000
*        5 MDBCMGT2   BIT(8),       /*  Second byte of message type     08580000
*                                       flags                    @D2A*/ 08590000
*      3 MDBCRPYL      FIXED(16),   /*  Reply ID Length              */ 08600000
*      3 MDBCRPYI      CHAR(8),     /*  Reply ID (EBCDIC                08610000
*                                       representation)          @LCC*/ 08620000
*      3 MDBCTOFF2     FIXED(15),   /*  Like MDBCTOFF but allows for    08630000
*                                       non-auth, non-action msg @PFC*/ 08640000
*      3 MDBCTOFF      FIXED(15),   /*  Offset in the message text      08650000
*                                       field of the beginning of the   08660000
*                                       message                  @P7C*/ 08670000
*      3 MDBCRPYB      FIXED(31) BDY(HWORD), /* Reply ID (Binary        08680000
*                                       representation)          @P4C*/ 08690000
*      3 MDBCAREA      CHAR(1),     /*  Area ID                  @D2A*/ 08700000
*      3 MDB_Autor_Reply_Len Fixed(8), /* Reply length for auto-reply   08710000
*                                                                @LMC*/ 08720000
*      3 MDBCLCNT      FIXED(31) BDY(HWORD), /* Number of lines in      08730000
*                                       the message              @D3C*/ 08740000
*      3 MDBCOJBN      CHAR(8),     /*  Originating job name     @D3A*/ 08750000
*      3 MDBCSPLX      CHAR(8),     /*  Sysplex name             @L8C*/ 08760000
*      3 MDBCXMOD CHAR(4),          /*  Copy of request flags           08770000
*                                       (CTXTRFLG) from the WTO         08780000
*                                       user exit interface             08790000
*                                       routine                  @L8A*/ 08800000
*       4 MDBCRFLG,                 /*  Comm Task user exit             08810000
*                                       requests                 @L8A*/ 08820000
*        5 MDBCRFB1 BIT(8),         /*  Request flags byte              08830000
*                                       one                      @L8A*/ 08840000
*         6 MDBCRCMT BIT(1),        /*  Message text was changed        08850000
*                                                                @L8A*/ 08860000
*         6 MDBCRCRC BIT(1),        /*  Routing code(s) were changed    08870000
*                                                                @L8A*/ 08880000
*         6 MDBCRCDC BIT(1),        /*  Descriptor code(s) were         08890000
*                                       changed                  @L8A*/ 08900000
*         6 MDBCRQPC BIT(1),        /*  Queued to a particular          08910000
*                                       active console           @L8A*/ 08920000
*         6 MDBRSV17 BIT(1),        /*  Reserved - was MDBCRQUN (Queue  08930000
*                                       to a particular console         08940000
*                                       unconditionally)         @LFC*/ 08950000
*         6 MDBCRQRC BIT(1),        /*  Queued by routing codes         08960000
*                                       only                     @L8A*/ 08970000
*         6 MDBRSV16 BIT(1),        /*  Reserved - was MDBCRCCN (1-byte 08980000
*                                       Console Id was changed)  @LFC*/ 08990000
*         6 MDBCRPML BIT(1),        /*  Minor lines were processed      09000000
*                                                                @L8A*/ 09010000
*        5 MDBCRFB2 BIT(8),         /*  Request flags byte              09020000
*                                       two                      @L8A*/ 09030000
*         6 MDBCRDTM BIT(1),        /*  Message was deleted      @L8A*/ 09040000
*         6 MDBCROMS BIT(1),        /*  MPF supression overrided        09050000
*                                                                @L8A*/ 09060000
*         6 MDBCRFHC BIT(1),        /*  Hardcopy forced          @L8A*/ 09070000
*         6 MDBCRNHC BIT(1),        /*  No hardcopy forced       @L8A*/ 09080000
*         6 MDBCRHCO BIT(1),        /*  Only hardcopy forced     @L8A*/ 09090000
*         6 MDBCRBCA BIT(1),        /*  Broadcasted message to          09100000
*                                       active consoles          @L8A*/ 09110000
*         6 MDBCRBCN BIT(1),        /*  Did not broadcast message       09120000
*                                       to active consoles       @L8A*/ 09130000
*         6 MDBCRNRT BIT(1),        /*  AMRF is not to retain this      09140000
*                                       message                  @PCC*/ 09150000
*        5 MDBCRFB3 BIT(8),         /*  Request flags byte three        09160000
*                                                                @L8A*/ 09170000
*         6 MDBCRRET BIT(1),        /*  AMRF is to retain this          09180000
*                                       message                  @PCC*/ 09190000
*         6 MDBCRCKY BIT(1),        /*  Changed the retrieval key       09200000
*                                                                @L8A*/ 09210000
*         6 MDBCRCFC BIT(1),        /*  Changed the 4-byte console      09220000
*                                       ID                       @L8A*/ 09230000
*         6 MDBCRCMF BIT(1),        /*  Changed the message type        09240000
*                                       flags                    @L8A*/ 09250000
*         6 MDBCRANO BIT(1),        /*  Automation was not required     09260000
*                                                                @L8A*/ 09270000
*         6 MDBCRAYS BIT(1),        /*  Automation was required         09280000
*                                       and/or automation token         09290000
*                                       updated                  @L8A*/ 09300000
*         6 MDBCQHCO BIT(1),        /*  Message issued as hardcopy      09310000
*                                       only                     @L8A*/ 09320000
*         6 MDBCRSV8 BIT(1),        /*  Reserved. Was MDBCHUD    @LDC*/ 09330000
*       4 MDBCSUPB BIT(8),          /*  Suppression byte         @L8A*/ 09340000
*        5 MDBCSNSV BIT(1),         /*  Not serviced by any WTO         09350000
*                                       user exit routine        @L8A*/ 09360000
*        5 MDBCSEER BIT(1),         /*  A WTO user exit ABENDed while   09370000
*                                       processing this message  @PCC*/ 09380000
*        5 MDBCSNSI BIT(1),         /*  Not serviced because of         09390000
*                                       an incompatible request         09400000
*                                                                @L8A*/ 09410000
*        5 MDBCSAUT BIT(1),         /*  Indicates automation            09420000
*                                       specified                @L8A*/ 09430000
*        5 MDBC_Processed_By_MFA BIT(1), /* Message Flood Automation    09440000
*                                       processed this message   @LLC*/ 09450000
*        5 MDBCSSSI BIT(1),         /*  Suppressed by a subsystem       09460000
*                                                                @L8A*/ 09470000
*        5 MDBCSWTO BIT(1),         /*  Suppressed by a WTO user        09480000
*                                       exit routine             @L8A*/ 09490000
*        5 MDBCSMPF BIT(1),         /*  Suppressed by MPF or Message    09500000
*                                       Flood Automation         @LLC*/ 09510000
*      3 MDBCCNNM      CHAR(8),     /*  Console name             @D5A*/ 09520000
*      3 MDBCMCSF CHAR(2),          /*  MCS flags from WPL       @D5A*/ 09530000
*        5 MDBMCSF1 BIT(8),         /*  First byte of MCS flags  @D5A*/ 09540000
*          7 MDBMCSA  BIT(1),       /*  Route/Descriptor code fields    09550000
*                                       present                  @03A*/ 09560000
*          7 MDBMCSB  BIT(1),       /*  Message queued to console id    09570000
*                                       in MDBCCNID              @LFC*/ 09580000
*          7 MDBMCSC  BIT(1),       /*  MCSFLAG=RESP was specified      09590000
*                                                                @03A*/ 09600000
*          7 MDBMCSD  BIT(1),       /*  Message type field exists       09610000
*                                                                @03A*/ 09620000
*          7 MDBMCSE  BIT(1),       /*  MCSFLAG=REPLY was specified     09630000
*                                                                @03A*/ 09640000
*          7 MDBMCSF  BIT(1),       /*  MCSFLAG=BRDCST was specified    09650000
*                                                                @03A*/ 09660000
*          7 MDBMCSG  BIT(1),       /*  MCSFLAG=HRDCPY was specified    09670000
*                                                                @03A*/ 09680000
*          7 MDBMCSHX BIT(1),       /*  Reserved - meant MCSFLAG=QREG0  09690000
*                                       was specified            @LFC*/ 09700000
*        5 MDBMCSF2 BIT(8),         /*  Second byte of MCS flags @D5A*/ 09710000
*          7 MDBMCSI  BIT(1),       /*  MCSFLAG=NOTIME was specified    09720000
*                                                                @D5A*/ 09730000
*          7 MDBMCSJ  BIT(1),       /*  MLWTO indicator          @03A*/ 09740000
*          7 MDBMCSK  BIT(1),       /*  Primary subsytem use     @03A*/ 09750000
*          7 MDBMCSL  BIT(1),       /*  Extended WPL used        @03A*/ 09760000
*          7 MDBMCSM  BIT(1),       /*  MCSFLAG=CMD was specified       09770000
*                                                                @03A*/ 09780000
*          7 MDBMCSN  BIT(1),       /*  MCSFLAG=NOCPY was specified     09790000
*                                                                @03A*/ 09800000
*          7 MDBMCSO  BIT(1),       /*  WQEBLK used              @03A*/ 09810000
*          7 *        BIT(1),       /*                           @03A*/ 09820000
*      3 MDB_Autor_Delay Fixed(16), /* Auto-reply delay time     @LMC*/ 09830000
* %If translate(IEAVM105_TypeDcl) = 'YES' /* If Mdb Type requested      09840000
*                                                                @LKA*/ 09850000
* %Then                                                                 09860000
*   %Do;                            /* Use Type                  @LKA*/ 09870000
*      3 MDBCETOD Isa(AsaTimeStampE), /* Time stamp of when message was 09880000
*                                       issued. In STCKE format  @LKA*/ 09890000
*   %End;                           /* End of Use Type           @LKA*/ 09900000
* %Else                                                                 09910000
*   %Do;                            /* No type                   @LKA*/ 09920000
*      3 MDBCETOD Char(16),         /*  Time stamp of when message was  09930000
*                                       issued. In STCKE format  @LKA*/ 09940000
*   %End;                           /* End of No Type            @LKA*/ 09950000
*      3  MDB_Misc_Flags Bit(8),    /* Misc. Flags               @LMA*/ 09960000
*        5  MDB_Autor_Data_Valid  Bit(1), /*MDB contains valid          09970000
*                                      auto-reply data           @LMA*/ 09980000
*        5  MDB_Autor_Delay_In_Sec Bit(1), /* Auto-reply delay time     09990000
*                                      is in seconds             @LMA*/ 10000000
*        5  MDB_No_SYSLOG Bit(1),   /* Copy of WQENSYL (for JES3).      10001001
*                                                                @05A*/ 10002001
*        5  MDB_WQEJ3B1 Bit(1),     /* Copy of WQEJ3B1 (for JES3).      10003001
*                                                                @05A*/ 10004001
*      3  MDB_Autor_Reply Char(64), /* Auto-reply reply          @LMA*/ 10010000
*      3  *               Char(23); /* Reserved                  @LMA*/ 10020000
*/********************************************************************/ 10030000
*/*                                                                  */ 10040000
*/* Message text object for the message block                        */ 10050000
*/*                                                                  */ 10060000
*/********************************************************************/ 10070000
* Dcl                                                                   10080000
* %If translate(IEAVM105_TypeDcl) = 'YES' /* If Mdb Type requested      10090000
*                                                                @LCA*/ 10100000
* %Then                                                                 10110000
*   %Do;                            /* Do Mdb Type               @LCA*/ 10120000
*    1  tMdbT Bdy(hWord) type,      /* Text Object Type          @LCA*/ 10130000
*   %End;                           /* EndDo Mdb Type            @LCA*/ 10140000
* %Else                                                                 10150000
*   %Do;                            /* Do Mdb non-type           @LCA*/ 10160000
*    1  MDBT   BDY(HWORD) IEAVM105_MDBVIA BASED,                        10170000
*                                   /*  Start of text object     @LBC*/ 10180000
*   %End;                           /* EndDo Mdb non-type        @LCA*/ 10190000
*     3 MDBTF,                      /*  Start of fixed object        */ 10200000
*      5 MDBTLEN     FIXED(15),     /*  Text object length           */ 10210000
*      5 MDBTTYPE    CHAR(2),       /*  Text object type             */ 10220000
*      5 MDBTLNTY    BIT(16),       /*  Line type flags - 2 bytes    */ 10230000
*         7 MDBTLNT1 BIT(8),        /*  Line type flags, byte 1      */ 10240000
*            9 MDBTCONT BIT(1),     /*  Control text                 */ 10250000
*            9 MDBTLABT BIT(1),     /*  Label text                   */ 10260000
*            9 MDBTDATT BIT(1),     /*  Data text                    */ 10270000
*            9 MDBTENDT BIT(1),     /*  End text                     */ 10280000
*            9 MDBTPROT BIT(1),     /*  Prompt text                  */ 10290000
*            9 MDBTOPTT BIT(1),     /*  Reserved for IBM use     @04C*/ 10300000
*            9 MDBTRSV2 BIT(1),     /*  Reserved                 @D3C*/ 10310000
*            9 *        BIT(1),     /*  Reserved                     */ 10320000
*         7 MDBTLNT2 BIT(8),        /*  Line type flags, byte 2      */ 10330000
*            9 *        BIT(7),     /*  Reserved                     */ 10340000
*            9 MDBTFPAF BIT(1),     /*  Text object presentation        10350000
*                                       attribute field overrides       10360000
*                                       general object presentation     10370000
*                                       attribute field          @L4C*/ 10380000
*      5 MDBTMTPA    CHAR(4),       /*  Presentation attribute   @L1C*/ 10390000
*        7 MDBTPCON    BIT(8),      /*  Presentation control     @L4C*/ 10400000
*        7 MDBTPCOL    BIT(8),      /*  Presentation color       @L4C*/ 10410000
*        7 MDBTPHIL    BIT(8),      /*  Presentation highlighting       10420000
*                                                                @L4C*/ 10430000
*        7 MDBTPINT    BIT(8),      /*  Presentation intensity   @L4C*/ 10440000
*     3 MDBTV,                      /*  Variable portion             */ 10450000
*      5 MDBTMSGT    CHAR(*);       /* Message text field               10460000
*                                   -the length of this field will vary 10470000
*                                   depending on the length of the line 10480000
*                                   of text being passed             */ 10490000
*/********************************************************************/ 10500000
*/*                                                                  */ 10510000
*/*             ACRONYM CONSTANT                                     */ 10520000
*/*                                                                  */ 10530000
*/********************************************************************/ 10540000
* DECLARE                                                               10550000
*  MDBACR   CHAR(4)  CONSTANT('MDB '); /* Eye catcher main header    */ 10560000
*/********************************************************************/ 10570000
*/*                                                                  */ 10580000
*/*             VERSION LEVEL CONSTANTS                              */ 10590000
*/*                                                                  */ 10600000
*/********************************************************************/ 10610000
* DECLARE                                                               10620000
*  MDBVER1   BIT(32)   CONSTANT('00000001'X),  /* Revision code 1    */ 10630000
*  MDBVID    BIT(32)   CONSTANT(MDBVER1); /* Current revision code   */ 10640000
*/********************************************************************/ 10650000
*/*                                                                  */ 10660000
*/*             OBJECT/TYPE CONSTANTS                                */ 10670000
*/*                                                                  */ 10680000
*/********************************************************************/ 10690000
* DECLARE                                                               10700000
*  MDBTYP1   FIXED(16) CONSTANT(1),    /*Type for MDB Type 1         */ 10710000
*  MDBGOBJ   FIXED(16) CONSTANT(1),    /*Type for general object     */ 10720000
*  MDBCOBJ   FIXED(16) CONSTANT(2),    /*Type for control program       10730000
*                                        object                  @P7C*/ 10740000
*  MDBTOBJ   FIXED(16) CONSTANT(4);    /*Type for message text object*/ 10750000
*/********************************************************************/ 10760000
*/*                                                                  */ 10770000
*/*             HEADER LENGTH CONSTANT                               */ 10780000
*/*                                                                  */ 10790000
*/********************************************************************/ 10800000
* DECLARE                                                               10810000
*  MDBHLEN   FIXED(16) CONSTANT(12);  /* Length of MDB Header section   10820000
*                                                                @P4A*/ 10830000
*/********************************************************************/ 10840000
*/*                                                                  */ 10850000
*/*             PRESENTATION ATTRIBUTE CONSTANTS                     */ 10860000
*/*                                                                  */ 10870000
*/********************************************************************/ 10880000
* DECLARE                                                               10890000
*               /* CONTROL ATTRIBUTES         */                        10900000
*  MDBSNALM BIT(8) CONSTANT('80'X),   /*Sound note alarm (presentation  10910000
*                                     device's 'beep' alarm)     @P7C*/ 10920000
*               /* COLOR ATTRIBUTES           */                        10930000
*  MDBBLACK BIT(8) CONSTANT('F0'X),   /*Presentation background-black   10940000
*                                     on display, white on printer   */ 10950000
*  MDBBLUE  BIT(8) CONSTANT('F1'X),   /*Color is blue                */ 10960000
*  MDBRED   BIT(8) CONSTANT('F2'X),   /*Color is red                 */ 10970000
*  MDBPINK  BIT(8) CONSTANT('F3'X),   /*Color is pink (magenta)      */ 10980000
*  MDBGREEN BIT(8) CONSTANT('F4'X),   /*Color is green               */ 10990000
*  MDBTURQ  BIT(8) CONSTANT('F5'X),   /*Color is turquoise (cyan)    */ 11000000
*  MDBYELOW BIT(8) CONSTANT('F6'X),   /*Color is yellow              */ 11010000
*  MDBWHITE BIT(8) CONSTANT('F7'X),   /*Presentation neutral-white on   11020000
*                                     display, black on a printer    */ 11030000
*               /* HIGHLIGHTING ATTRIBUTES    */                        11040000
*  MDBHNONE BIT(8) CONSTANT('00'X),   /*No highlighting is in effect */ 11050000
*  MDBBLINK BIT(8) CONSTANT('F1'X),   /*Blinking highlight           */ 11060000
*  MDBRVIDO BIT(8) CONSTANT('F2'X),   /*Reverse video highlight      */ 11070000
*  MDBUNDER BIT(8) CONSTANT('F4'X),   /*Underscore highlight         */ 11080000
*               /* INTENSITY ATTRIBUTES       */                        11090000
*  MDBINORM BIT(8) CONSTANT('E4'X),   /*Normal intensity        @L3C */ 11100000
*  MDBIHIGH BIT(8) CONSTANT('E8'X);   /*High (bright) intensity @L3C */ 11110000
*                                                                       11120000
*%If translate(Mdb_InclMsgAttrDcls) = 'YES'                   /* @LAA*/ 11130000
*%Then                                                        /* @LAA*/ 11140000
*  %Do;                                                       /* @LAA*/ 11150000
*/********************************************************************/ 11160000
*/* Color message attributes                                     @LAA*/ 11170000
*/********************************************************************/ 11180000
*Dcl Mdb_tColor fixed(8) type;                                /* @LAA*/ 11190000
*Dcl Mdb_kBlack     isa(Mdb_tColor) constant('F0'X); /* Presentation    11200000
*                                      background-black on display,     11210000
*                                      white on printer          @LAA*/ 11220000
*                                                                       11230000
*Dcl Mdb_kBlue      isa(Mdb_tColor) constant('F1'X);/* Color is blue    11240000
*                                                                @LAA*/ 11250000
*Dcl Mdb_kRed       isa(Mdb_tColor) constant('F2'X);/* Color is red     11260000
*                                                                @LAA*/ 11270000
*Dcl Mdb_kPink      isa(Mdb_tColor) constant('F3'X);/* Color is pink    11280000
*                                      (magenta)                 @LAA*/ 11290000
*Dcl Mdb_kGreen     isa(Mdb_tColor) constant('F4'X);/* Color is green   11300000
*                                                                @LAA*/ 11310000
*Dcl Mdb_kTurquoise isa(Mdb_tColor) constant('F5'X); /* color is        11320000
*                                      turquoise (cyan)          @LAA*/ 11330000
*Dcl Mdb_kYellow    isa(Mdb_tColor) constant('F6'X);/* Color is yellow  11340000
*                                                                @LAA*/ 11350000
*Dcl Mdb_kWhite     isa(Mdb_tColor) constant('F7'X);/* Presentation     11360000
*                                      neutral-white on display, black  11370000
*                                      on a printer              @LAA*/ 11380000
*                                                                       11390000
*/********************************************************************/ 11400000
*/* Highlight message attributes                                 @LAA*/ 11410000
*/********************************************************************/ 11420000
*Dcl Mdb_tHighlight fixed(8) type;                            /* @LAA*/ 11430000
*Dcl Mdb_kNoHighlight  isa(Mdb_tHighlight) constant('00'X);/* no        11440000
*                                      highlighting is in effect @LAA*/ 11450000
*Dcl Mdb_kBlinking     isa(Mdb_tHighlight) constant('F1'X);/*Blinking   11460000
*                                      highlight                 @LAA*/ 11470000
*Dcl Mdb_kReverseVideo isa(Mdb_tHighlight) constant('F2'X);/* Reverse   11480000
*                                      video highlight           @LAA*/ 11490000
*Dcl Mdb_kUnderScore   isa(Mdb_tHighlight) constant('F4'X);/*           11500000
*                                      underscore highlight      @LAA*/ 11510000
*/********************************************************************/ 11520000
*/* Intensity message attributes                                 @LAA*/ 11530000
*/********************************************************************/ 11540000
*Dcl Mdb_tIntensity fixed(8) type;                            /* @LAA*/ 11550000
*Dcl Mdb_kNormalIntensity isa(Mdb_tIntensity) constant('E4'X);/*        11560000
*                                      normal intensity          @LAA*/ 11570000
*Dcl Mdb_kHighIntensity   isa(Mdb_tIntensity) constant('E8'X);/*        11580000
*                                      high intensity            @LAA*/ 11590000
*  %End;                                                      /* @LAA*/ 11600000
*/********************************************************************/ 11610000
*/*                                                                  */ 11620000
*/*             CONTROL PROGRAM OBJECT CONSTANTS                 @P5A*/ 11630000
*/*                                                                  */ 11640000
*/********************************************************************/ 11650000
* DECLARE                                                               11660000
*  MDBCVER1  BIT(32)   CONSTANT('00000001'X),  /* MVS CP object         11670000
*                                               version level 1  @P5A*/ 11680000
*  MDBCVER2  BIT(32)   CONSTANT('00000002'X),  /* MVS CP JBB4422        11690000
*                                               version level 2  @L5A*/ 11700000
*  MDBCVER3  BIT(32)   CONSTANT('00000003'X),  /* MVS CP OY65627        11710000
*                                               version level 3  @P9C*/ 11720000
*  MDBCVER4  BIT(32)   CONSTANT('00000004'X),  /* MVS CP HBB5510        11730000
*                                               version level 4  @P9A*/ 11740000
*  MDBCVER5  BIT(32)   CONSTANT('00000005'X),  /* MVS CP HBB5520        11750000
*                                               version level 5  @L8A*/ 11760000
*  MDBCV10   BIT(32)   CONSTANT('00000010'X),  /* Structurally          11770000
*                                               equivalent to HBB5520   11780000
*                                               with OW20064-430 @03A*/ 11790000
*  MDBCV20   BIT(32)   CONSTANT('00000020'X),  /* Structurally          11800000
*                                               equivalent to HBB5520   11810000
*                                               with OW20064-510 @03A*/ 11820000
*  MDBCV30   BIT(32)   CONSTANT('00000030'X),  /* MVS CP HBB5520        11830000
*                                               with OW20064     @03A*/ 11840000
*  MDBCV50   BIT(32)   CONSTANT('00000050'X),  /* MVS CP HBB7750 @LKA*/ 11850000
*  MDBCV70   BIT(32)   CONSTANT('00000070'X),  /* MVS CP HBB7770 @LMA*/ 11860000
*  MDBCVID   BIT(32)   CONSTANT(MDBCV70), /* Current MVS CP object      11870000
*                                               version level    @LMC*/ 11880000
*  MDBCMVS   CHAR(4)   CONSTANT('MVS ');  /* CP name for MVS     @P5A*/ 11890000
*MDBLPOP;                             /*@LISTPOP                     */ 11900000
