*                                                                       00010000
*        %GOTO TPCPLS1;   /*                                            00020000
         MACRO                                                          00030001
&NAME    IEAVVTPC  &DSECT=YES                                           00040000
**/                                                                     00050000
*%TPCPLS1 : ;                                                           00060001
*                                                                       00070000
*/* START OF SPECIFICATIONS **************************************** */ 00080000
*/*                                                                  */ 00090000
*/*01* MACRO NAME = IEAVVTPC                                         */ 00100000
*/*                                                                  */ 00110000
*/*01* DESCRIPTIVE NAME = TIMER SUPERVISION WORK AREA                */ 00120000
*/*                                                                  */ 00130000
*/*01* PROPRIETARY STATEMENT =                                       */ 00140000
*/*     LICENSED MATERIALS - PROPERTY OF IBM                         */ 00150000
*/*     5650-ZOS COPYRIGHT IBM CORP. 1981, 2015                  @LCC*/ 00160002
*/*                                                                  */ 00170000
*/*01* STATUS = HBB77A0                                          @LCC*/ 00180002
*/*                                                                  */ 00190000
*/*01* FUNCTION = PROVIDE DATA MAPPING OF THE TPC.                   */ 00200000
*/*                                                                  */ 00210000
*/*01* METHOD OF ACCESS =                                            */ 00220000
*/*      BAL  - DSECT IS PRODUCED UNLESS DSECT=NO IS SPECIFIED.      */ 00230000
*/*             USING ON TPC GIVES ADDRESSABILITY FOR ALL SYMBOLS.   */ 00240000
*/*      PL/S - DCL TPCPTR PTR                                       */ 00250000
*/*                                                                  */ 00260000
*/*                                                                  */ 00270000
*/*01* DSECT NAME: TPC                                               */ 00280000
*/*                                                                  */ 00290000
*/*01* EYE CATCHER: ' TPC'                                           */ 00300000
*/*02*  OFFSET: 0                                                    */ 00310000
*/*02*  LENGTH: 4                                                    */ 00320000
*/*                                                                  */ 00330000
*/*01* STORAGE ATTRIBUTES:                                           */ 00340000
*/*02*  MAIN STORAGE:                                                */ 00350000
*/*02*  VIRTUAL STORAGE:                                             */ 00360000
*/*02*  AUXILIARY STORAGE:                                           */ 00370000
*/*02*  SUBPOOL: 245                                                 */ 00380000
*/*02*  KEY: 0                                                       */ 00390000
*/*02*  DATA SPACE:                                                  */ 00400000
*/*02*  RESIDENCY: below 16 Meg line                                 */ 00410000
*/*                                                                  */ 00420000
*/*01* CREATED BY: IEATPC                                            */ 00430000
*/*                                                                  */ 00440000
*/*01* POINTED TO BY: CVTTPC                                         */ 00450000
*/*                                                                  */ 00460000
*/*01* SIZE: 424 BYTES (DECIMAL)                                     */ 00470000
*/*                                                                  */ 00480000
*/*01* SERIALIZATION: Dispatcher lock                                */ 00490000
*/*                                                                  */ 00500000
*/*01* EXTERNAL CLASSIFICATION:                                      */ 00510000
*/*                                                                  */ 00520000
*/*02* DMTI: BASE                                                    */ 00530000
*/*                                                                  */ 00540000
*/*02* GUPI: FIELDS                                                  */ 00550000
*/*          TPCSDIE                                                 */ 00560000
*/*                                                                  */ 00570000
*/*01* END OF EXTERNAL CLASSIFICATION:                               */ 00580000
*/*                                                                  */ 00590000
*/*01* NOTES                                                         */ 00600000
*/*                                                                  */ 00610000
*/*01* COMPONENT= TIMER SUPERVISION (SC1CV)                          */ 00620000
*/*                                                                  */ 00630000
*/*01* DISTRIBUTION LIBRARY = AMACLIB                                */ 00640000
*/*                                                                  */ 00650000
*/* END OF SPECIFICATIONS ****************************************** */ 00660000
*%GOTO TPCPLS2;  /*                                                     00670000
.*                                                                      00680000
.*********************************************************************  00690000
.*   CHANGE-ACTIVITY=                                                   00700000
.*                                                                      00710000
.*  $D1=DCR0047  JBB2125  830325  PD162M:  SET TIMER MULTIPLE TQE       00720000
.*                                         SUPPORT                      00730000
.*  $L1=IOGEN    JBB2220  840611  PD162M:  IOGEN RESTRUCTURE            00740000
.*  $L2=IOGEN    JBB2220  840806  PD16Q4:  IOGEN RESTRUCTURE            00750000
.*                                         IEAVBK BREAKUP               00760000
.*  $L3=CLOCK    HBB4410  870622  PD162M:  ETR SUPPORT                  00770000
.*  $L4=CLOCK    HBB4410  871130  PD16CU:  ETR SUPPORT                  00780000
.*  $D2=DHB1009  HBB4410  881203  PD16CU:  IEATTOC VCON FOR NEW         00790000
.*                                         INTERFACE                    00800000
.*  $D3=DEO0222  HBB4410  890918  PD162M:  CLOCKXX SUPPORT              00810000
.*  $P1=PEO4304  HBB4410  900604  PD162M:  IEATESMR VCON                00820000
.*  $01=OW28604  HBB6603  960601  B7HGH5:  Sysplex test datesource      00830000
.*                                         support                      00840000
.*  $L5=STCKE    HBB6608  980530  B7HGH5:  128 bit TOD support          00850000
.*  $L6=STP      HBB7709  030130  B7HGH5:  Remove ETR subset support    00860000
.*  $L7=STSTP    HBB7720  040215  B7HGH5:  STP support                  00870000
.*  $02=OA13343  HBB7720  050930  B7HGH5:  Enable STP code              00880001
.*  $LB=UTCAUDIT HBB7790  110115  B7HGH5:  TOD clock accuracy (ME22117) 00890000
.*  $LC=ME28792  HBB77A0  150208  PD00H6:  STIMER TQE pool              00891002
.*                                                                      00900000
.*********************************************************************  00910000
.*                                                                      00920000
         AIF   ('&DSECT' EQ 'NO').TT                                    00930001
TPC      DSECT ,TPCPTR                                                  00940001
         AGO   .TT2                                                @L2C 00950000
.TT      ANOP                                                           00960001
         AIF ('&SYSECT' NE 'IEATPC').TT2                           @L2A 00970000
         ENTRY IEATSELM                                                 00980001
         ENTRY TPCMFTQE                                                 00990001
         DS    0D                       TIMER SUPERVISION WORK AREA@L2A 01000000
         AGO   .TT3                                                @L2A 01010000
.TT2     ANOP                                                      @L2A 01020000
IEATPC   DS    0D                       TIMER SUPERVISION WORK AREA     01030000
.TT3     ANOP                                                      @L2A 01040000
TPCTPCA  DC    C' TPC'                  TPC IDENTIFICATION              01050001
TPCFLGS1 DC    X'00'                    TPCA FLAG BYTE 1                01060001
TPCABND  EQU   X'80'                    REAL TQES ABENDED               01070001
TPCSOFF  EQU   X'40'                    STP is not supported if    @02C 01080001
*                                       set to 1.                       01090000
TPCUNKWN EQU   X'20'                    IO CLOCK STAT UNKNOWN @G860P2P  01100000
TPCPRMPT EQU   X'10'                    OPERATOR PROMPTING        @L1A  01110000
*                                       REQUIRED DURING TOD CLOCK       01120000
*                                       INITIALIZATION. CONTROLLED BY   01130000
*                                       SYS1.PARMLIB MEMBER CLOCKXX     01140000
*                                       OPERATOR STATEMENT              01150000
TPCIPLSC EQU   X'08'                    TOD SYNC CHECK OCCURRED   @L3A  01160000
*                                       DURING IPL                      01170000
TPCSIM   EQU   X'04'                    SIMETRID SPECIFIED IN     @D3A  01180000
*                                       SYS1.PARMLIB MEMBER CLOCKXX     01190000
         DC    X'0000'                  RESERVED                        01200001
TPCCC    DC    X'00'                    STCK CONDITION CODE             01210001
TPCTZORG DC    F'0'                     IPL TIME ZONE CONSTANT          01220001
TPCHDCCQ DC    A(TPCDMTQE)              HEAD OF REAL TIME QUEUE         01230001
TPCDMTQE DC    C' TQE'                  DUMMY TQE                       01240001
DFD      DC    A(TPCDMTQE)              DUMMY TQE                       01250001
         DC    A(TPCHDCCQ-DFD+TPCDMTQE) DUMMY TQE                       01260001
         DC    H'0'                     DUMMY TQE                       01270001
         DC    X'03'                    DUMMY TQE                       01280001
         DC    X'10'                    DUMMY TQE                       01290001
         DC    X'FFFFFFFFFFFFFFFF'      DUMMY TQE                       01300001
TPCMNTQE DC    C' TQE'                  MIDNIGHT TQE                    01310001
         DC    F'0'                     MIDNIGHT TQE                    01320001
         DC    F'0'                     MIDNIGHT TQE                    01330001
         DC    H'0'                     MIDNIGHT TQE                    01340001
         DC    X'83'                    MIDNIGHT TQE                    01350001
         DC    X'01'                    MIDNIGHT TQE                    01360001
MNIGHT   DC    2F'0'                    MIDNIGHT TQE                    01370001
TPCMFTQE DC    C' TQE'                  RMF TQE                         01380000
         DC    F'0'                     RMF TQE                         01390000
         DC    F'0'                     RMF TQE                         01400000
         DC    H'0'                     RMF TQE                         01410000
         DC    X'83'                    RMF TQE                         01420000
         DC    X'02'                    RMF TQE                         01430000
         DC    2F'0'                    RMF TQE                         01440000
IEATSELM DC    C' TQE'                  SYSTEM RESOURCES MANAGER TQE    01450001
         DC    F'0'                     SYSTEM RESOURCES MANAGER TQE    01460001
         DC    F'0'                     SYSTEM RESOURCES MANAGER TQE    01470001
         DC    H'0'                     SYSTEM RESOURCES MANAGER TQE    01480001
         DC    X'83'                    SYSTEM RESOURCES MANAGER TQE    01490001
         DC    X'04'                    SYSTEM RESOURCES MANAGER TQE    01500001
         DC    2F'0'                    SYSTEM RESOURCES MANAGER TQE    01510001
TPCLMTQE DC    C' TQE'                  TIME LIMIT CHECKING TQE         01520001
         DC    F'0'                     TIME LIMIT CHECKING TQE         01530001
         DC    F'0'                     TIME LIMIT CHECKING TQE         01540001
         DC    H'0'                     TIME LIMIT CHECKING TQE         01550001
         DC    X'83'                    TIME LIMIT CHECKING TQE         01560001
         DC    X'08'                    TIME LIMIT CHECKING TQE         01570001
         DC    2F'0'                    TIME LIMIT CHECKING TQE         01580001
TPCIDCNT DC    F'0'                     COUNT OF LAST STIMERM ID   @D1A 01590000
*                                       ASSIGNED                   @D1A 01600000
TPCSTPC  DC    A(0)                     ADDRESS OF SECONDARY       @L4A 01610000
*                                       TIMER WORK AREA (STPC).         01620000
TPCTATQE DC    C' TQE'                  TOD ACCURACY MONITOR TQE   @LBA 01630001
         DC    F'0'                     TOD ACCURACY MONITOR TQE   @LBA 01640001
         DC    F'0'                     TOD ACCURACY MONITOR TQE   @LBA 01650001
         DC    H'0'                     TOD ACCURACY MONITOR TQE   @LBA 01660001
         DC    X'83'                    TOD ACCURACY MONITOR TQE   @LBA 01670001
         DC    X'20'                    TOD ACCURACY MONITOR TQE   @LBA 01680001
         DC    2F'0'                    TOD ACCURACY MONITOR TQE   @LBA 01690001
         DS    0D                       Boundary for TPCTQEPL      @LCA 01690102
TPCTQEPL DS    XL8                      TQE pool header            @LCA 01691002
TPCRS0B0 DS    XL82                     Reserved                   @LCC 01700002
TPCSYSNM DC    H'0'                     HW copy of CPLXSYSNUM      @L5A 01710000
         AIF ('&DSECT' EQ 'YES').TPC010                            @LBC 01720000
         EXTRN IEATTAMR                                            @LBA 01730001
TPCTAMR  DC    A(X'80000000'+IEATTAMR)  ADDRESS OF IEATTAMR        @LBA 01740001
         AGO   .TPC020                                             @LBA 01750001
.TPC010  ANOP                                                      @LBA 01760001
TPCTAMR  DC    V(IEATTAMR)              ADDRESS OF IEATTAMR        @LBA 01770001
.TPC020  ANOP                                                           01780001
TPCWORK  DC    2F'0'                    WORK AREA                       01790001
TPCMISC  DC    18F'0'                   WORK AREA                       01800001
TPCVPTR  DC    V(IEAVRNEW)              ADDR OF VARY ONLINE ROUTINE     01810001
TPCFRRP  DC    V(IEAVRFRR)              ADDR OF TIMER FRR               01820001
TPCCRSAV DC    F'0'                     SAVE AREA FOR CR 0              01830001
TPCTCWA  DC    F'0'                     ADDR OF TOD WORKAREA            01840001
         AIF   ('&DSECT' EQ 'NO').ZZZ                                   01850001
TPCRSRB  DC    11F'0'                                                   01860001
         AGO   .QQQ                                                     01870001
.ZZZ     ANOP                                                           01880001
SRBSIZE  EQU   44                        SRB SIZE IN BYTES              01890001
SRB      EQU   0                                                        01900001
SRBASCB  EQU   8                                                        01910001
SRBASID  EQU   14                                                       01920001
SRBPTCB  EQU   16                                                       01930001
TPCRSRB  DC    (SRBSIZE/4)F'0'          TIMER HW RECOVERY SRB           01940001
         ORG   TPCRSRB+(SRBASCB-SRB)                                    01950001
         DC    V(IEAMASCB)              PTR TO MASTER ASCB         @L2C 01960000
         ORG   TPCRSRB+(SRBASID-SRB)                                    01970001
         DC    H'1'                     ASID OF MASTER                  01980001
         ORG   TPCRSRB+(SRBPTCB-SRB)                                    01990001
         DC    V(IEAMSTCB)              ADDR OF MASTER TCB         @L2C 02000000
         ORG   TPCRSRB+SRBSIZE                                          02010001
.QQQ     ANOP                                                           02020001
TPCCKQ   DC    V(IEAVRCKQ)              ADDRESS OF IEAVRCKQ             02030001
TPCCLA   DC    AL4(0)                   ADDRESS OF IEAVRCLA             02040001
TPCSDIE  DC    V(IEAVRDIE)              ADDRESS OF SETDIE      @Z40FPYB 02050001
TPCOCL   DC    V(IEAVROCL)              ADDRESS OF IEAVROCL    @Z40FPYB 02060001
TPCTTOC  DC    V(IEATTOC)               ADDRESS OF IEATTOC         @D2A 02070000
         MEND  , */                                                     02080001
*%TPCPLS2 : ;                                                           02090001
*DECLARE                                                                02100000
*  1 TPC       BASED(TPCPTR) BDY(DWORD),                                02110000
*   2 IEATPC,                          /* TIMER SUPERVISION WORKAREA */ 02120000
*     3 TPCTPCA  CHAR(4) BDY(DWORD)                                     02130000
*                      ,               /* TPC IDENTIFICATION         */ 02140000
*     3 TPCFLGS1 CHAR(1),              /* TPCA FLAG BYTE 1           */ 02150000
*       5 TPCABND BIT(1),              /* REAL TQES ABENDED          */ 02160000
*       5 TPCSOFF BIT(1),              /* STP is not supported if set   02170000
*                                         to 1.                  @02C*/ 02180001
*       5 TPCUNKWN BIT(1),             /* IO CLOCK STATUS UNKNOWN       02190000
*                                                            @G860P2P*/ 02200000
*       5 TPCPRMPT BIT(1),             /* OPERATOR PROMPTING REQUIRED   02210000
*                                         DURING TOD CLOCK              02220000
*                                         INITIALIZATION. CONTROLLED    02230000
*                                         BY SYS1.PARMLIB MEMBER        02240000
*                                         CLOCKXX OPERATOR              02250000
*                                         STATEMENT              @L1A*/ 02260000
*       5 TPCIPLSC BIT(1),             /* TOD SYNC CHECK OCCURRED       02270000
*                                         DURING IPL.            @L3A*/ 02280000
*       5 TPCSIM   BIT(1),             /* SIMETRID SPECIFIED IN         02290000
*                                         SYS1.PARMLIB MEMBER           02300000
*                                         CLOCKXX                @D3A*/ 02310000
*       5 *          BIT(2),           /* Reserved               @L7C*/ 02320000
*     3 *   CHAR(2),                   /* RESERVED                   */ 02330000
*     3 TPCCC  CHAR(1),                /* STCK CONDITION CODE        */ 02340000
*     3 TPCTZORG FIXED(31),            /* IPL TIME ZONE CONSTANT     */ 02350000
*     3 TPCHDCCQ POINTER(31)                                            02360000
*       ,                              /* HEAD OF REAL TIME QUEUE    */ 02370000
*     3 TPCDMTQE,                           /* DUMMY TQE             */ 02380000
*       5 *  CHAR(4),                       /* DUMMY TQE             */ 02390000
*       5 DFD POINTER(31),                  /* DUMMY TQE             */ 02400000
*       5 *  POINTER(31),                   /* DUMMY TQE             */ 02410000
*       5 *  FIXED(16) UNSIGNED,            /* DUMMY TQE             */ 02420000
*       5 *  CHAR(1) ,                      /* DUMMY TQE             */ 02430000
*       5 *  CHAR(1) ,                      /* DUMMY TQE             */ 02440000
*       5 *  BIT(64) ,                             /* DUMMY TQE      */ 02450000
*     3 TPCMNTQE,                           /* MIDNIGHT TQE          */ 02460000
*       5 *  CHAR(4) ,                      /* MIDNIGHT TQE          */ 02470000
*       5 *  POINTER(31) ,                  /* MIDNIGHT TQE          */ 02480000
*       5 *  POINTER(31) ,                  /* MIDNIGHT TQE          */ 02490000
*       5 *  FIXED(16) UNSIGNED,            /* MIDNIGHT TQE          */ 02500000
*       5 *  CHAR(1),                       /* MIDNIGHT TQE          */ 02510000
*       5 *  CHAR(1),                       /* MIDNIGHT TQE          */ 02520000
*       5 MNIGHT BIT(64) BDY(DWORD),        /* MIDNIGHT TQE          */ 02530000
*         7 MNIGHTLH  FIXED(32) UNSIGNED,                               02540000
*         7 MNIGHTRH  FIXED(32) UNSIGNED,                               02550000
*     3 TPCMFTQE,                           /* RMF TQE               */ 02560000
*       5 *  CHAR(4),                       /* RMF TQE               */ 02570000
*       5 *  POINTER(31),                   /* RMF TQE               */ 02580000
*       5 *  POINTER(31),                   /* RMF TQE               */ 02590000
*       5 *  FIXED(16) UNSIGNED,            /* RMF TQE               */ 02600000
*       5 *  CHAR(1),                       /* RMF TQE               */ 02610000
*       5 *  CHAR(1),                       /* RMF TQE               */ 02620000
*       5 *  BIT(64),                       /* RMF TQE               */ 02630000
*     3 IEATSELM,                           /* SYS RESOURCES MGR TQE */ 02640000
*       5 *  CHAR(4),                       /* SYS RESOURCES MGR TQE */ 02650000
*       5 *  POINTER(31),                   /* SYS RESOURCES MGR TQE */ 02660000
*       5 *  POINTER(31),                   /* SYS RESOURCES MGR TQE */ 02670000
*       5 *  FIXED(16) UNSIGNED,            /* SYS RESOURCES MGR TQE */ 02680000
*       5 *  CHAR(1),                       /* SYS RESOURCES MGR TQE */ 02690000
*       5 *  CHAR(1),                       /* SYS RESOURCES MGR TQE */ 02700000
*       5 *  BIT(64),                       /* SYS RESOURCES MGR TQE */ 02710000
*     3 TPCLMTQE,                           /* TIME LIMIT CKING TQE  */ 02720000
*       5 *  CHAR(4),                       /* TIME LIMIT CKING TQE  */ 02730000
*       5 *  POINTER(31),                   /* TIME LIMIT CKING TQE  */ 02740000
*       5 *  POINTER(31),                   /* TIME LIMIT CKING TQE  */ 02750000
*       5 *  FIXED(16) UNSIGNED,            /* TIME LIMIT CKING TQE  */ 02760000
*       5 *  CHAR(1),                       /* TIME LIMIT CKING TQE  */ 02770000
*       5 *  CHAR(1),                       /* TIME LIMIT CKING TQE  */ 02780000
*       5 *  BIT(64),                       /* TIME LIMIT CKING TQE  */ 02790001
*     3 TPCIDCNT FIXED(32) UNSIGNED,   /* COUNT OF LAST                 02800000
*                                         STIMERM ID ASSIGNED    @D1A*/ 02810000
*     3 TPCSTPC  POINTER(31),          /* ADDRESS OF SECONDARY          02820000
*                                         TIMER WORK AREA (STPC) @L4A*/ 02830000
*     3 TPCTATQE,                      /* TOD ACCURACY MONITOR TQE      02840001
                                                                 @LBC*/ 02850001
*       5 *  CHAR(4),                  /* TOD ACCURACY MONITOR TQE      02860001
                                                                 @LBA*/ 02870001
*       5 *  POINTER(31),              /* TOD ACCURACY MONITOR TQE      02880001
                                                                 @LBA*/ 02890001
*       5 *  POINTER(31),              /* TOD ACCURACY MONITOR TQE      02900001
                                                                 @LBA*/ 02910001
*       5 *  FIXED(16) UNSIGNED,       /* TOD ACCURACY MONITOR TQE      02920001
                                                                 @LBA*/ 02930001
*       5 *  CHAR(1),                  /* TOD ACCURACY MONITOR TQE      02940001
                                                                 @LBA*/ 02950001
*       5 *  CHAR(1),                  /* TOD ACCURACY MONITOR TQE      02960001
                                                                 @LBA*/ 02970001
*       5 *  BIT(64),                  /* TOD ACCURACY MONITOR TQE      02980001
                                                                 @LBA*/ 02990001
*     3 TPCTQEPL BIT(64) BDY(DWORD),   /* TQE pool header        @LCA*/ 02991002
*     3 TPCRS0B0 CHAR(82),             /* Reserved               @LCC*/ 03000002
*     3 TPCSYSNM CHAR(2),              /* HW copy of CPLXSYSNUM  @L5A*/ 03010000
*     3 TPCTAMR  POINTER(31),          /* ADDR OF IEATTAMR       @LBC*/ 03020000
*     3 TPCWORK  BIT(64) BDY(DWORD),   /* WORKAREA                   */ 03030001
*       5 TPCWORKL  FIXED(32) UNSIGNED,                                 03040001
*       5 TPCWORKR  FIXED(32) UNSIGNED,                                 03050001
*     3 TPCMISC(18) POINTER(31),       /* WORK AREA                 */  03060001
*     3 TPCVPTR  POINTER(31),          /* PTR TO VARY ONLINE ROUTINE*/  03070001
*     3 TPCFRRP  POINTER(31),          /* PTR TO TIMER FRR          */  03080001
*     3 TPCCRSAV FIXED(32) UNSIGNED                                     03090001
*                 ,                    /* SAVE AREA FOR CR0          */ 03100000
*     3 TPCTCWA  POINTER(31),               /* ADDR OF TOD WORKAREA  */ 03110000
*     3 TPCRSRB  (11) FIXED(31),            /* TIMER HW RECVY SRB    */ 03120000
*     3 TPCCKQ   POINTER(31),               /* ADDR OF IEAVRCK       */ 03130000
*     3 TPCCLA   POINTER(31),               /* ADDR OF IEAVRCLA      */ 03140000
*     3 TPCSDIE  POINTER(31),  /* ADDR OF SETDIE  ROUTINE    @Z40FPYB*/ 03150000
*     3 TPCOCL  POINTER(31),  /* ADDR OF OCL ROUTINE         @Z40FPYB*/ 03160000
*     3 TPCTTOC POINTER(31);           /* ADDRESS OF IEATTOC     @D2A*/ 03170000
