*        %GOTO MDBP;    /* BILINGUAL MAPPING                            00000100
         MACRO                                                          00000200
         IEAVG132                                                       00000300
*                                                                    */ 00000400
*%MDBP : ;                                                              00000500
*                                                                       00000600
*/**** START OF SPECIFICATIONS ***************************************/ 00000700
*/*                                                                  */ 00000800
*/*01* MACRO NAME: IEAVG132                                      @P2C*/ 00000900
*/*                                                                  */ 00001000
*/*01* DESCRIPTIVE NAME: Prefix area for Message Data Block      @P2C*/ 00001100
*/*02* ACRONYM:  MDBP                                            @P2C*/ 00001200
*/*                                                              @P2A*/ 00001300
*/*01* PROPRIETARY STATEMENT=                                        */ 00001400
*/***PROPRIETARY_STATEMENT********************************************/ 00001500
*/*                                                                  */ 00001600
*/*                                                                  */ 00001700
*/* LICENSED MATERIALS - PROPERTY OF IBM                             */ 00001800
*/* 5694-A01 (C) COPYRIGHT IBM CORP. 1990, 2005                      */ 00002000
*/*                                                                  */ 00002100
*/* STATUS= HBB7720                                                  */ 00002200
*/*                                                                  */ 00002300
*/***END_OF_PROPRIETARY_STATEMENT*************************************/ 00002400
*/*                                                              @P2A*/ 00002500
*/*01* EXTERNAL CLASSIFICATION:                                      */ 00002600
*/*02* PI: BASE                                                      */ 00002700
*/*02* NOTPI: FIELDS MDBPOEXT                                        */ 00002800
*/*01* END OF EXTERNAL CLASSIFICATION                                */ 00002900
*/*                                                              @P2A*/ 00003000
*/*01* DSECT NAME: MDBPRFX                                       @P3A*/ 00003100
*/*                                                              @P3A*/ 00003200
*/*01* EYE-CATCHER: MDBP                                         @P2A*/ 00003300
*/*      OFFSET: 0                                               @P3A*/ 00003400
*/*      LENGTH: 4                                               @P3A*/ 00003500
*/*                                                              @P2A*/ 00003600
*/*01* COMPONENT: Communications Task (SC1CK)                    @P3C*/ 00003700
*/*                                                              @P2A*/ 00003800
*/*01* STORAGE ATTRIBUTES:                                       @P3A*/ 00003900
*/*      SUBPOOL = N/A                                           @P3A*/ 00004000
*/*      KEY = N/A                                               @P3A*/ 00004100
*/*      RESIDENCY = Message data space for the address space    @P3A*/ 00004200
*/*                  which owns the Extended MCS Console.        @P3A*/ 00004300
*/*                                                              @P3A*/ 00004400
*/*01* SIZE: 28 bytes                                            @P3A*/ 00004500
*/*                                                              @P3A*/ 00004600
*/*01* FUNCTION: This prefix area is used to chain               @P2C*/ 00004700
*/*              all the MDBs for                                @P1A*/ 00004800
*/*              a given message together.  All MDBs in the message  */ 00004900
*/*              data space will be prefixed by this control block.  */ 00005000
*/*                                                                  */ 00005100
*/*                                                                  */ 00005200
*/*              ____________________________________________    @P1A*/ 00005300
*/*             ! MDB Prefix Area                            !   @P1A*/ 00005400
*/*             !                                            !   @P1A*/ 00005500
*/*             !  Next MDB (MDBPNEXT) --------------->      !   @P1A*/ 00005600
*/*             !____________________________________________!   @P1A*/ 00005700
*/* MDBPTR ---->! Message Data Block                         !   @P1A*/ 00005800
*/*             !                                            !   @P1A*/ 00005900
*/*             !  MDB                                       !   @P1A*/ 00006000
*/*             !____________________________________________!   @P1A*/ 00006100
*/*                                                                  */ 00006200
*/*01* METHOD OF ACCESS:                                         @P2C*/ 00006300
*/*              BAL - SPECIFY IEAVG132                              */ 00006400
*/*                                                                  */ 00006500
*/*              PL/AS - %INCLUDE SYSLIB(IEAVM105) to get            */ 00006600
*/*                               addressability to MDB              */ 00006700
*/*                      %INCLUDE SYSLIB(IEAVG132) to get            */ 00006800
*/*                               addressability to MDB prefix       */ 00006900
*/*              VIA ATTRIBUTE - Specify %MDBVIA = 'YES'             */ 00007000
*/*                           prior to %INCLUDE statement.           */ 00007100
*/*                           Declare MDBALET.                       */ 00007200
*/*                           For VIA(0) specify %GLOBALARMODE='YES' */ 00007300
*/*                                                                  */ 00007400
*/*01* CREATED BY:  CNZM1ECI                                     @P4C*/ 00007500
*/*                                                                  */ 00007600
*/*01* POINTED TO BY: MDBPTR-LENGTH(MDBPRFX)                     @P2C*/ 00007700
*/*                 This mapping will always immediately         @P2A*/ 00007800
*/*                 preceed the MDB (IEAVM105)                   @P2A*/ 00007900
*/*                                                                  */ 00008000
*/*01* SERIALIZATION: N/A                                        @P2C*/ 00008100
*/*                                                                  */ 00008200
*/*01* DISTRIBUTION LIBRARY: AMACLIB                             @P2C*/ 00008300
*/*                                                              @P2A*/ 00008400
*/*01* CHANGE ACTIVITY -                                         @P2C*/ 00008500
*/*  $MAC(IEAVG132) COMP(SC1CK): Prefix for Message Data Block       */ 00008600
*/*  $L0=CNSL1DBU, HBB4410, 890130,  PDBU: Console Enhancements I    */ 00008700
*/*  $P1=PEO4207,  HBB4410, 900604,  PDED: Add length for ASM prefix */ 00008800
*/*  $P2=PKB0595,  HBB4430, 920318,  PDHE: Pointed-to-by field       */ 00008900
*/*  $01=OY53924,  HBB4420, 920415,  PDCM: Comment change            */ 00009000
*/*  $P3=PKB0806,  HBB4430, 920725,  PDCM: Prolog updates            */ 00009100
*/*  $L1=CSTARMC,  JBB7727, 020507,  PDSS: MCache Support            */ 00009200
*/*  $L2=CSTAR,    JBB7727, 020822,  PDDV: Console Restucture        */ 00009300
*/*  $P4=PDE0074,  HBB7720, 040403,  PDSS: PTMs: PDE0084 PDE0086     */ 00009400
*/*                                              PDE0132 PDE0317     */ 00009500
*/*                                              PDE0318             */ 00009600
*/*  $P5=ME01663,  HBB7720, 040901,  PDSW: Reversioning Cancelled    */ 00009700
*/*                                                                  */ 00009800
*/* **** END OF SPECIFICATIONS ***************************************/ 00009900
*                                                                       00010000
*   %GOTO MDBPLSP;/*                                                    00010100
*                                                                       00010200
*   Actual MDB prefix to be inserted by Console Enhancements line       00010300
*   item.  MDBPRFX is a mapping of the prefix.                   @01C   00010400
MDBPRFX        DSECT                 Prefix area for MDB                00010500
               DS   0F                                                  00010600
MDBPID         DS   CL4'MDBP'        Acronym MDBP                       00010700
MDBPVER        DS   CL1              Version level                      00010800
MDBPS410       EQU  1                Version level for SP410            00010900
MDBPVID        EQU  MDBPS410         Current version level              00011000
               DS   CL3              Reserved                           00011100
MDBPNEXT       DS   A                Pointer to next MDB for this msg   00011200
               DS   CL12             Reserved                           00011300
MDBPOEXT       DS   A                Pointer to reserved extension @P1C 00011400
MDBPLNNO       EQU  *-MDBPRFX        Length of MDBPRFX             @P1A 00011500
          MEND  ,  */                                                   00011600
*                                                                       00011700
* %MDBPLSP:;                                                            00011800
* %IF MDBVIA = 'YES' %THEN          /* Check if MDB ALET is specified*/ 00011900
*   %IEAVG132_MDBVIA = 'VIA(MDBALET)'; /* Set VIA to specified value    00012000
*                                                                @L1C*/ 00012100
* %ELSE                                                                 00012200
*   %IF GLOBALARMODE = 'YES' %THEN  /*MDB ALET not specified-check if   00012300
*                                   global default specified         */ 00012400
*     %IEAVG132_MDBVIA = 'VIA(0)';  /* If yes then set global    @L1C*/ 00012500
*   %ELSE                                                               00012600
*     %IEAVG132_MDBVIA = '';        /* If no then set to nulls   @L1C*/ 00012700
*/* Actual MDB prefix to be inserted by Console Enhancements line       00012800
*   item.  MDBPRFX is a mapping of the prefix.                  @01C */ 00012900
*%Dcl IEAVG132_TypeDcl char ext;    /*                           @L2A*/ 00013000
*%If translate(IEAVG132_TypeDcl) = 'YES'/* If type DCL requested @L2A*/ 00013100
*%Then                                                                  00013200
*  %Do;                             /* Do MdbPrfx type           @L2A*/ 00013300
*Dcl                                                                    00013400
*  1 tMdbPrfx type Bdy(Word),       /* MDB Non-OCO Prefix Type   @L2A*/ 00013500
*  %End;                            /* EndDo MdbPrfx type        @L2A*/ 00013600
*%Else                                                                  00013700
*  %Do;                             /* Do MdbPrfx nontype        @L2A*/ 00013800
*  DECLARE                                                              00013900
*    1  MDBPRFX BDY(WORD) BASED(MDBPTR-LENGTH(MDBPRFX))                 00014000
*               IEAVG132_MDBVIA,    /*  Prefix area for MDB      @L1C*/ 00014100
*  %End;                            /* EndDo MdbPrfx nontype     @L2A*/ 00014200
*      3 MDBPID        CHAR(4),     /*  Acronym MDBP                 */ 00014300
*      3 MDBPVER       FIXED(8),    /*  Version level                */ 00014400
*      3 *             CHAR(3),     /*  Reserved                     */ 00014500
*      3 MDBPNEXT      PTR(31),     /*  Pointer to next MDB for this    00014600
*                                        message                     */ 00014700
*      3 *             CHAR(12),    /*  Reserved                     */ 00014800
*      3 MDBPOEXT      PTR(31);     /*  Pointer to reserved extension   00014900
*                                                                @P1C*/ 00015000
*                                                                       00015100
*DCL MDBPACRO CHAR(4) CONSTANT('MDBP'); /* Acronym                   */ 00015200
*DCL MDBPS410 FIXED(8) CONSTANT(1); /* Version level for SP410       */ 00015300
*DCL MDBPVID  FIXED(8) CONSTANT(MDBPS410); /* Current version level  */ 00015400
