*/* $MAC(IEBCREAS) COMP(DF114):                                      */ 00010000
*/*                                                                  */ 00020000
*/* MACRO NAME: IEBCREAS                                             */ 00021000
*/*                                                                  */ 00022000
*/* DESCRIPTION: Maps the IEBCOPY reason code that it returns        */ 00023000
*/*      in register 0.                                              */ 00024000
*/*                                                                  */ 00025000
*/* STATUS: z/OS 2.1 DFSMS                                           */ 00026000
*/*                                                                  */ 00027000
*/* PROPRIETARY V3 STATEMENT                                         */ 00028000
*/* LICENSED MATERIALS - PROPERTY OF IBM                             */ 00029000
*/* "RESTRICTED MATERIALS OF IBM"                                    */ 00029100
*/* 5650-ZOS                                                         */ 00029200
*/* COPYRIGHT IBM CORP. 2013                                         */ 00029300
*/* END PROPRIETARY V3 STATEMENT                                     */ 00029400
*/*                                                                  */ 00029500
*/* Function: This maps the content of register 0.  To use this      */ 00029600
*/*      macro you must store the eight bytes of register 0 in       */ 00029700
*/*      storage.                                                    */ 00029800
*/*                                                                  */ 00029900
*/* Method of coding:                                                */ 00030000
*/*      Assembler:                                                  */ 00030100
*/*         DSECT={YES ! NO}                                         */ 00030200
*/*         The default is YES.                                      */ 00030300
*/*         With DSECT=YES code a USING statement for the DSECT      */ 00030400
*/*         name of IEBRsnArea or the symbol IEBRSN.  With DSECT=NO  */ 00030500
*/*         code a USING for IEBRSN.                                 */ 00030600
*/*      PL/X:                                                       */ 00030700
*/*         Rfy IEBRSN based(xxxxxxx);                               */ 00030800
*/*                                                                  */ 00030900
*/* Change activity:                                                 */ 00031000
*/* $L0=REASON,HDZ2210,20121025,RSTLAY: IEBCOPY propagates ABEND @L0A*/ 00031100
*/*     return/reason codes in R0 to the caller.                     */ 00031200
*/* $P0=SM01206,HDZ2210,20121205,RSTLAY: IEBCREAS macro contains @P0A*/ 00031303
*/*     several errors.                                          @P0A*/ 00031403
*%GOTO IEBCREASPLX;                                            /*@P0C*/ 00032005
         MACRO                                                          00040000
         IEBCREAS &DSECT=YES                                            00041000
.* Allow mixed case and lower case such as DSect=Yes.                   00042000
         AIF   ('YES' EQ Upper('&DSECT')).Start                         00043000
         AIF   ('NO'  EQ Upper('&DSECT')).NoDSECT                       00044000
         MNOTE 8,'DSECT parameter must be NO or YES. ''YES'' assumed.'  00045000
.Start   ANOP                   DSECT needed                            00046000
IEBRsnArea DSECT                                                        00047000
.NoDSECT        DS   0D         Double-word alignment                   00048000
IEBRSN          DC   0XL8'0'                                            00049000
IEBRSN_AbndRsn  DC   XL4'0'     ABEND reason code if             @P0C   00049203
*                               IEBRSN_Abended is on.                   00049300
IEBRSN_Flags    DC   X'00'      Flags.                                  00049400
IEBRSN_Abended  EQU  X'80'      ABEND occurred.                         00049500
*                               IEBRSN_AbndRsn is valid &               00049600
*                               IEBRSN_AbndCode contains                00049700
*                               the system or user ABEND.               00049800
*               EQU  X'40'      RESERVED  AVAILABLE                     00049900
*               EQU  X'20'      RESERVED  AVAILABLE                     00050000
*               EQU  X'10'      RESERVED  AVAILABLE                     00050100
*               EQU  X'08'      RESERVED  AVAILABLE                     00050200
*               EQU  X'04'      RESERVED  AVAILABLE                     00050300
*               EQU  X'02'      RESERVED  AVAILABLE                     00050400
*               EQU  X'01'      RESERVED  AVAILABLE                     00050500
IEBRSN_AbndCode DC   XL3'0'     System completion code                  00050600
*                               (first 12 bits) and user                00050700
*                               completion code (second 12              00050800
*                               bits) in hexadecimal if                 00050900
*                               IEBRSN_Abended is on.                   00051000
         MEND                                                           00051100
*%IEBCREASPLX:;                                                /*@P0C*/ 00051204
* DCL 1 IEBRSN BDY(DWORD) BASED(*),                                     00051301
*      5 IEBRSN_AbndRsn    CHAR(4),  /* ABEND reason code if   */       00051400
*                                    /* IEBRSN_Abended is on.  */       00051500
*      5 IEBRSN_Flags      CHAR(1),  /* Flags.                 */       00051600
*        7 IEBRSN_Abended  BIT(1),   /* ABEND occurred.        */       00051700
*                                    /* IEBRSN_AbndRsn is valid*/       00051800
*                                    /* and IEBRSN_AbndCode    */       00052000
*                                    /* contains the system or */       00052100
*                                    /* user ABEND code.       */       00053000
*        7 *               BIT(7),   /* Reserved.              */       00054000
*      5 IEBRSN_AbndCode   CHAR(3);  /* System completion code   @P0C*/ 00055004
*                                    /* (first 12 bits) and    */       00055100
*                                    /* user completion code   */       00056000
*                                    /* (second 12 bits) in    */       00056100
*                                    /* hexadecimal if         */       00057000
*                                    /* IEBRSN_Abended is on.  */       00057100
*/* End of IEBRSN description.                                 */       00298200
