*                                                                       00050000
* %DCL IECDZHPF_INCLUDED CHAR EXT;                                      00100000
* %DEACTIVATE IECDZHPF_INCLUDED;                                        00150000
* %IF IECDZHPF_INCLUDED = '' %THEN                                      00200000
* %DO;                                                                  00250000
*/* Macro made bi-lingual on 11067. CBGEN compile date 11015         */ 00300000
*% /*                                                                   00350000
         MACRO                                                          00400000
         IECDZHPF &DSECT=YES,&LIST=YES,&TITLE=YES,&ZHPFD_INFO=YES       00450000
         GBLC  &IECDZHPF_INCLUDED                                       00500000
         GBLC  &ZCBPRINT                                                00550000
&IECDZHPF_INCLUDED SETC 'YES'                                           00600000
         AIF   ('&LIST' EQ 'NONE').P0                                   00650000
         AIF   ('&TITLE' EQ 'NO').P5                                    00700000
 TITLE   'IECDZHPF  - zHPF DASD Feature Information Area            '   00750000
.P5      ANOP                                                           00800000
**/ IECDZHPF_1:;                                                        00850000
*/* Start of Specifications ******************************************* 00900000
*                                                                     * 00950000
*01* MACRO-NAME: IECDZHPF                                             * 01000000
*                                                                     * 01050000
*01* Descriptive Name: zHPF DASD Feature Information Area             * 01100000
*                                                                     * 01150000
*02*   Acronym: ZHPFD                                                 * 01200000
*                                                                     * 01250000
*02*   Dsect Name: ZHPFD_INFO                                         * 01300000
*                                                                     * 01350000
*PROPRIETARY V3 STATEMENT                                             * 01385700
*Licensed Materials - Property of IBM                                 * 01421400
*"Restricted Materials of IBM"                                        * 01457100
*5650-ZOS                                                             * 01492800
*Copyright IBM Corp. 2011, 2013                                       * 01528500
*END PROPRIETARY V3 STATEMENT                                         * 01564200
*                                                                     * 01600000
*01* Component: DFSMS for z/OS (DF111)                                * 01650000
*                                                                     * 01700000
*01* Function:                                                        * 01750000
*                                                                     * 01800000
*      IECDZHPF maps the DASD portion of the information              * 01850000
*      returned by the IOSZHPF macro and includes the                 * 01900000
*      High Performance FICON features supported by the               * 01950000
*      DASD device.                                                   * 02000000
*                                                                     * 02050000
*      Refer to the Read Features Code section of the zHPF            * 02100000
*      specification for a description of each zHPF feature           * 02150000
*      code supported by a DASD device.                               * 02200000
*                                                                     * 02250000
*02* Notes: None                                                      * 02300000
*                                                                     * 02350000
*01* Eye-Catcher: None                                                * 02400000
*                                                                     * 02450000
*01* Created by: Issuer of IOSZHPF                                    * 02500000
*                                                                     * 02550000
*01* Deleted by: Issuer of IOSZHPF                                    * 02600000
*                                                                     * 02650000
*01* Pointed to by: IOSZHPF parameter list                            * 02700000
*                                                                     * 02750000
*01* Size:  8 bytes                                                   * 02800000
*                                                                     * 02850000
*01* Module Type: Mapping macro                                       * 02900000
*                                                                     * 02950000
*01* Method of Access:                                                * 03000000
*                                                                     * 03050000
*02*   ASM: IECDZHPF                                                  * 03100000
*                                                                     * 03150000
*02*  PL/X: %INCLUDE SYSLIB(IECDZHPF)                                 * 03200000
*                                                                     * 03250000
*           %Dcl ZHPFDDef CHAR                                        * 03300000
*                                                                     * 03350000
*           %ZHPFDDef = 'AUTO'                                        * 03400000
*           %ZHPFDDef = 'DEFINED(field)'                              * 03450000
*           %ZHPFDDef = 'BASED(ptr)'                                  * 03500000
*                                                                     * 03550000
*           If %ZHPFDDef is not specified, the ZHPFD will be declared * 03600000
*           as BASED.                                                 * 03650000
*                                                                     * 03700000
*01* Dependencies: See IOSZHPF macro                                  * 03750000
*                                                                     * 03800000
*01* Restrictions: See IOSZHPF macro                                  * 03850000
*                                                                     * 03900000
*01* Serialization: None                                              * 03950000
*                                                                     * 04000000
*01* Storage Attributes:                                              * 04050000
*02*   Subpool: Any                                                   * 04100000
*02*   Key: Any                                                       * 04150000
*02*   Dataspace: N/A                                                 * 04200000
*02*   Residency: Any                                                 * 04250000
*02*   Frequency: One per invocation of IOSZHPF                       * 04300000
*                                                                     * 04350000
*01* Distribution Library (DLIB): AMACLIB                             * 04400000
*                                                                     * 04450000
*01* External Classification: PI                                      * 04500000
*01* End of External Classification:                                  * 04550000
*                                                                     * 04600000
*01* Change Activity:                                                 * 04650000
*                                                                     * 04700000
* $MAC(IECDZHPF),COMP(DF111): zHPF DASD Feature Information Area      * 04750000
*                                                                     * 04800000
* Change Activity                                                     * 04850000
*                                                                     * 04900000
*  $L0=OA34662  HDZ1B10 110823 JRP:  Define zHPF DASD Capabilities    * 04950000
*  $01=OA38263  HDZ1B10 111205 JRP:  Format and Update writes allowed * 04950100
*                                    in same channel program      @01 * 04950200
*  $02=OA38923  HDZ1B10 120229 JRP:  Format Writes supported      @02 * 05075000
*  $03=OA39251  HDZ1B10 120328 JRP:  TCAX Pad fix                 @03 * 05076000
*                                                                     * 05100000
**** End Of Specifications *******************************************/ 05150000
*% /*                                                                   05200000
.P0      ANOP                                                           05250000
         AIF   ('&ZCBPRINT' EQ 'NO').P1                                 05300000
         AIF   ('&LIST' EQ 'YES').P2                                    05350000
.P1      ANOP                                                           05400000
         PUSH  PRINT                                                    05450000
         PRINT OFF                                                      05500000
.P2      ANOP                                                           05550000
         AIF   ('&ZHPFD_INFO' EQ 'NO').L0002                            05600000
         AIF   ('&DSECT' EQ 'YES').L0003                                05650000
         AIF   ('&ZHPFD_INFO' NE 'YES').L0002                           05700000
.L0003   ANOP                                                           05750000
*                                                                       05800000
* ********************************************************************  05850000
* *                                                                  *  05900000
* * zHPF DASD Feature Information Area                               *  05950000
* *                                                                  *  06000000
* ********************************************************************  06050000
*                                                                       06100000
*                                                                       06150000
         AIF   ('&DSECT' EQ 'YES').L0004                                06200000
ZHPFD_INFO DS   0F           zHPF DASD Feature Information Area         06250000
         AGO   .L0005                                                   06300000
.L0004   ANOP                                                           06350000
ZHPFD_INFO DSECT             zHPF DASD Feature Information Area         06400000
.L0005   ANOP                                                           06450000
ZHPFD_FLAG1 DS  B            Capabilities flag 1                        06500000
ZHPFD_Phase0      EQU X'80'  Phase 0 zHPF features are supported        06550000
ZHPFD_MultiTrack  EQU X'20'  Multi-track operations are supported       06600000
ZHPFD_XferTCAExt  EQU X'08'  Transfer TCA Extension (TTE) DCW supported 06650000
ZHPFD_Phase1      EQU X'04'  Phase 1 zHPF features are supported        06700000
ZHPFD_ImbedLocRec EQU X'02'  Imbedded Locate Records are supported      06750000
ZHPFD_FmtUpdWrite EQU X'01'  Format and Update writes in same chnl pgm  06780000
ZHPFD_FLAG2 DS  B            Capabilities flag 2                        06810000
ZHPFD_FmtWrite    EQU X'80'  zHPF Format Write supported                06840000
ZHPFD_TCAXPadFix  EQU X'40'  zHPF TCAX Pad fix                          06850000
          DS    CL6          Reserved                                   06870000
ZHPFD_END DS    0C           End of ZHPFD                               06900000
*                                                                       06950000
ZHPFD_INFO_LEN EQU *-ZHPFD_INFO                                         07000000
.L0002   ANOP                                                           07050000
         AIF   ('&ZCBPRINT' EQ 'NO').P3                                 07100000
         AIF   ('&LIST' EQ 'YES').P4                                    07150000
.P3      ANOP                                                           07200000
         POP   PRINT                                                    07250000
.P4      ANOP                                                           07300000
.P_EXIT  ANOP                                                           07350000
         MEND                                                           07400000
**/ IECDZHPF_2:;                                                        07450000
* %IECDZHPF_INCLUDED = 'YES';                                           07500000
* %DCL ZCBPRINT CHAR EXT;                                               07550000
* %DEACTIVATE ZCBPRINT;                                                 07600000
* %DCL IECDZHPF_LIST CHAR EXT;                                          07650000
* %DEACTIVATE IECDZHPF_LIST;                                            07700000
* %IF IECDZHPF_LIST ^= 'NO' &                                           07750000
*    ZCBPRINT ^= 'NO' %THEN                                             07800000
*   %GOTO IECDZHPF_3;                                                   07850000
*   @LIST PUSH NOECHO;                                                  07900000
*   @LIST NOASSEMBLE NOECHO;                                            07950000
*   @LIST OFF C NOECHO;                                                 08000000
* %IECDZHPF_3:;                                                         08050000
*/* Start of PL/X Source                                             */ 08100000
*                                                                       08150000
*@SPACE;                                                                08200000
*/********************************************************************/ 08250000
*/*                                                                  */ 08300000
*/* zHPF DASD Feature Information Area                               */ 08350000
*/*                                                                  */ 08400000
*/********************************************************************/ 08450000
*DECLARE                                                                08500000
*%IF ZHPFDDef ^= '' %THEN                                               08550000
*  %DO;                                                                 08600000
*  1 ZHPFD_Info CHAR(8) ZHPFDDef BDY(WORD),                             08650000
*                                   /* zHPF Device Feature Information  08700000
*                                      Area                          */ 08750000
*  %END;                                                                08800000
*%ELSE                                                                  08850000
*  %DO;                                                                 08900000
*  1 ZHPFD_Info CHAR(8) BASED BDY(WORD),                                08950000
*                                   /* zHPF DASD Feature Information    09000000
*                                      Area                          */ 09050000
*  %END;                                                                09100000
*    3 ZHPFD_Flag1 BIT(8),          /* Capabilities flag 1           */ 09150000
*      5 ZHPFD_Phase0 BIT(1),       /* Phase 0 zHPF features are        09200000
*                                      supported by the device       */ 09250000
*      5   *          BIT(1),       /* Reserved                      */ 09300000
*      5 ZHPFD_MultiTrack BIT(1),   /* Multi-track operations           09350000
*                                      are supported                 */ 09400000
*      5   *          BIT(1),       /* Reserved                      */ 09450000
*      5 ZHPFD_XferTCAExt BIT(1),   /* Transfer TCA Extension (TTE)     09500000
*                                      DCW is supported              */ 09550000
*      5 ZHPFD_Phase1 BIT(1),       /* Phase 1 zHPF features are        09600000
*                                      supported by the device       */ 09650000
*      5 ZHPFD_ImbedLocRec BIT(1),  /* Imbedded Locate Records          09700000
*                                      supported by the device       */ 09750000
*      5 ZHPFD_FmtUpdWrite BIT(1),  /* Format and Update writes in      09800000
*                                      same channel program          */ 09850000
*    3 ZHPFD_Flag2 BIT(8),          /* Capabilities flag 2           */ 09875000
*      5 ZHPFD_FmtWrite    BIT(1),  /* zHPF Format Write supported   */ 09900000
*      5 ZHPFD_TCAXPadFix  BIT(1),  /* zHPF TCAX Pad fix             */ 09910000
*    3   *         CHAR(6),         /* Reserved                      */ 09925000
*    3 ZHPFD_End   CHAR(0);         /* End of ZHPFD                  */ 09950000
*                                                                       10000000
*/* End of PL/X Source                                               */ 10050000
* %IF IECDZHPF_LIST ^= 'NO' &                                           10100000
*    ZCBPRINT ^= 'NO' %THEN                                             10150000
*   %GOTO IECDZHPF_4;                                                   10200000
*   @LIST POP NOECHO;                                                   10250000
* %IECDZHPF_4:;                                                         10300000
* %END;                                                                 10350000
