         MACRO                                                          00050000
         IECPDINI &COMP                                                 00100000
.*                                                                      00120000
.* $MAC(IECPDINI): OPEN/CLOSE/EOV ABEND INTERPRETATION TABLE            00140000
.*                                                                      00160000
.*                                                                 @LDD 00180000
         LCLC  &A,&B,&C                 DEFINE LOCAL CHAR VARIABLES     00200000
.*                                                                      00250000
         AIF   ('&COMP' EQ 'OPEN').OPSCT                                00300000
.*                                      IS OPEN EXPANSION REQUIRED      00310000
         AIF   ('&COMP' EQ 'OPENEX').OPEXSCT                            00350000
.*                                      IS OPEN EXECUTOR EXPANSION      00360000
.*                                      REQUIRED                        00370000
         AIF   ('&COMP' EQ 'CLOSE').CLSCT                               00400000
.*                                      IS CLOSE EXPANSION REQUIRED     00410000
         AIF   ('&COMP' EQ 'TCLOSE').TCSCT                              00450000
.*                                      IS TCLOSE EXPANSION REQUIRED    00460000
         AIF   ('&COMP' EQ 'EOV').EOVSCT                                00500000
.*                                      IS EOV EXPANSION REQUIRED       00510000
.*                                      EXPAND                          00530000
.OPSCT   ANOP                                                           00550000
&A       SETC  'IFG0190P'               SET MODULE ID                   00600000
&B       SETC  'X''F13'''               OPEN ABEND CODE                 00650000
&C       SETC  '1'                      OPEN MSG ID                     00700000
IFG0190P CSECT                                                          00750000
         COPY  IEABRC                                             @L17A 00761100
         SYSSTATE ARCHLVL=OSREL,OSREL=SYSSTATE                    @L24C 00772200
190P     TITLE 'IFG0190P - OPEN ABEND INTERPRETATION AND RECOVERY INITIX00783300
               AL ROUTINE'                                         @PWC 00816600
         AGO   .GENMAIN                                                 00850000
.CLSCT   ANOP                                                           00900000
&A       SETC  'IFG0200P'               SET MODULE ID                   01000000
&B       SETC  'X''F14'''               CLOSE ABEND CODE                01050000
&C       SETC  '2'                      CLOSE MSG ID                    01100000
IFG0200P CSECT                                                          01110000
         COPY  IEABRC                                             @L17A 01113300
         SYSSTATE ARCHLVL=OSREL,OSREL=SYSSTATE                    @L24C 01116600
         ENTRY IGG0206M                 ALIAS ENTRY POINT        Y02080 01120000
         ENTRY IFG0231P                 ALIAS ENTRY POINT          @35A 01123300
         ENTRY IFG0552P                 ALIAS ENTRY POINT          @37C 01126600
IGG0206M EQU   IFG0200P                 CLOSE EXECUTOR ENTRY     Y02080 01130000
IFG0231P EQU   IFG0200P                 CLOSE TYPE=T   ENTRY       @35A 01136600
IFG0552P EQU   IFG0200P                 EOV ENTRY                  @37C 01143300
200P     TITLE 'IFG0200P - CLOSE ABEND INTERPRETATION AND RECOVERY INITX01178800
               IAL ROUTINE'                                        @PWC 01214300
         AGO   .GENMAIN                                                 01250000
.EOVSCT  ANOP                                                           01300000
&A       SETC  'IFG0550P'               SET MODULE ID                   01350000
&B       SETC  'X''F37'''               EOV ABEND CODE                  01400000
&C       SETC  '0'                      EOV MSG ID                      01450000
IFG0550P CSECT                                                          01500000
         COPY  IEABRC                                             @L17A 01503300
         SYSSTATE ARCHLVL=OSREL,OSREL=SYSSTATE                    @L24C 01506600
         ENTRY IGG0190P                 ALIAS ENTRY POINT          @PKA 01510000
         ENTRY IGG0200P                 ALIAS ENTRY POINT          @LGA 01520000
IGG0190P EQU   IFG0550P                 EOV ENTRY FROM OPEN EXEC   @PKA 01530000
IGG0200P EQU   IFG0550P                 EOV ENTRY FROM CLOSE EXEC  @LGA 01540000
550P     TITLE 'IFG0550P - EOV ABEND INTERPRETATION AND RECOVERY INITIAX01560000
               L ROUTINE'                                          @PWC 01580000
         AGO   .GENMAIN                                                 01600000
.TCSCT   ANOP                                                           01650000
&A       SETC  'IFG0230P'               SET MODULE ID                   01700000
&B       SETC  'X''F17'''               TCLOSE ABEND CODE               01750000
&C       SETC  '2'                      CLOSE MSG ID                    01800000
IFG0230P CSECT                                                          01850000
         COPY  IEABRC                                             @L17A 01866600
         SYSSTATE ARCHLVL=OSREL,OSREL=SYSSTATE                    @L24C 01883200
230P     TITLE 'IFG0230P - TCLOSE ABEND INTERPRETATION AND RECOVERY INIX01900000
               TIAL ROUTINE'                                       @PWC 01950000
         AGO   .GENMAIN                                                 02000000
.OPEXSCT ANOP                                                           02050000
&A       SETC  'IGG0196M'               SET MODULE ID                   02100000
&B       SETC  'X''F13'''               OPEN ABEND CODE                 02150000
&C       SETC  '1'                      OPEN MSG ID                     02200000
IGG0196M CSECT                                                   YM1447 02250000
         COPY  IEABRC                                             @L17A 02266600
         SYSSTATE ARCHLVL=OSREL,OSREL=SYSSTATE                    @L24C 02283200
196M     TITLE 'IGG0196M - OPEN EXECUTOR ABEND INTERPRETATION AND RECOVX02300000
               ERY INITIAL ROUTINE'                                @PWC 02350000
.GENMAIN ANOP                                                           02400000
*********************************************************************** 02450000
*                                                                     * 02500000
         AIF   ('&COMP' EQ 'OPEN').OPSCT1                               02550000
.*                                      IS OPEN EXPANSION REQUIRED      02600000
         AIF   ('&COMP' EQ 'OPENEX').OPEX1                              02650000
.*                                      IS OPEN EXECUTOR EXPANSION      02660000
.*                                      REQUIRED                        02670000
         AIF   ('&COMP' EQ 'CLOSE').CLSCT1                              02680000
.*                                      IS CLOSE EXPANSION REQUIRED     02690000
         AIF   ('&COMP' EQ 'TCLOSE').TCSCT1                             02692000
.*                                      IS TCLOSE EXPANSION REQUIRED    02694000
         AIF   ('&COMP' EQ 'EOV').EOVSCT1                               02696000
.*                                      IS EOV EXPANSION REQUIRED       02698000
         MEXIT                          INVALID CODE PASSED, DO NOT     02698400
.*                                      EXPAND                          02698800
.OPSCT1  ANOP                                                           02699200
*$MOD(IFG0190P) OPEN ABEND INTERPRETATION AND RECOVERY INITIAL RTN @L3C 02699300
*                                                                       02699400
         AGO   .CONMAIN                                                 02699500
*                                                                       02699600
.CLSCT1  ANOP                                                           02699700
*$MOD(IFG0200P):    CLOSE ABEND INTERPRETATION AND RECOVERY INITIAL   * 02699800
*                    ROUTINE                                          * 02699900
         AGO   .CONMAIN                                                 02716600
*                                                                     * 02730600
.EOVSCT1 ANOP                                                           02733200
*$MOD(IFG0550P):  EOV ABEND INTERPRETATION AND RECOVERY INITIAL RTN   * 02737000
*                                                                     * 02740800
         AGO   .CONMAIN                                                 02743600
*                                                                     * 02744200
.TCSCT1  ANOP                                                           02750200
*$MOD(IFG0230P) TCLOSE ABEND INTERPRETATION AND RECOVERY INITIAL   @L3C 02756200
*               ROUTINE                                            @L3A 02762200
         AGO   .CONMAIN                                                 02768200
*                                                                     * 02768400
.OPEX1   ANOP                                                           02768600
*$MOD(IGG0196M) OPEN EXECUTOR ABEND INTERPRETATION AND RECOVERY    @L3C 02769600
*               INITIAL ROUTINE                                    @L3C 02770600
         AGO   .CONMAIN                                                 02771800
.CONMAIN ANOP                                                           02773800
.*                                                                      02776300
*********************************************************************** 02778800
*                                                                     * 02781500
*PROPRIETARY V3 STATEMENT                                               02784100
*LICENSED MATERIALS - PROPERTY OF IBM                                   02786700
*"RESTRICTED MATERIALS OF IBM"                                          02789300
*5650-ZOS                                                               02792800
*COPYRIGHT IBM CORP. 1982,2019                                          02792900
*END PROPRIETARY V3 STATEMENT                                           02797100
*                                                                     * 02800000
*********************************************************************** 02825000
*                                                                       02850000
* STATUS = Z/OS DFSMS V2R4                                            * 02884900
*                                                                     * 02900000
* FUNCTION = GETS WORK AREA TO BE USED BY REST OF PROBLEM DETERMINA-  * 02950000
*            TION. SEE PDBFRLEN EQUATE FOR SIZE OF WORK AREA.         * 03000000
*            DETERMINES REAL ABEND CODE AND RETURN CODE FROM THE      * 03050000
*            INTERNAL CODE PASSED TO IT AND TABLE IN THIS MODULE.     * 03100000
*            THESE CODES ARE MOVED INTO THE WORK AREA.                * 03150000
*            CONSTRUCTS WRITE-TO-PROGRAMMER MSG IN WORK AREA.         * 03200000
*            MOVES ID OF LAST LOAD OF THE STRING IN CONTROL WHEN      * 03250000
*            ABEND OCCURRED INTO THE CURRENT WTG TABLE ENTRY.         * 03300000
*            PASSES CONTROL TO WRITE-TO-PROGRAMMER ROUTINE.           * 03350000
*                                                                     * 03400000
* NOTES = SEE BELOW                                                   * 03450000
*                                                                     * 03500000
*    DEPENDENCIES =                                                   * 03550000
*            CLASS ONE CHARACTER CODE. THE EBCDIC CHARACTER CODE WAS  * 03600000
*            USED FOR ASSEMBLY.  THE MODULE MUST BE REASSEMBLED IF A  * 03650000
*            DIFFERENT CHARACTER SET IS USED FOR EXECUTION.           * 03700000
*                                                                     * 03750000
*    RESTRICTIONS = NONE                                              * 03800000
*                                                                     * 03802000
*    REGISTER CONVENTIONS =                                           * 03804000
*            R0 = INTERNAL ABEND CODE                                 * 03804400
*            R1 = PT TO PROBLEM DETERMINATION WORK AREA ON OUTPUT     * 03804800
*            R2-R14 = SAME AS CALLING ROUTINE                         * 03805200
*                                                                     * 03805400
*    PATCH LABEL = SEE NEXT TO LAST LABEL IN LTORG TABLE. DC STATEMENT* 03805500
*                                                                     * 03814400
* MODULE TYPE = CONTROL                                               * 03816400
*                                                                     * 03818400
*    PROCESSOR = High Level Assembler                              @PWC 03820400
*                                                                     * 03822400
*    MODULE SIZE = SEE EXTERNAL SYMBOL DICTIONARY OR LOC FIELD ON ORG * 03822800
*                  STATEMENT AT END OF LTORG TABLE. HEX BYSTES        * 03823200
*                                                                     * 03836000
*    ATTRIBUTES = REENTRANT, REFRESHABLE, READ-ONLY, ENABLED,         * 03846000
*                 PRIVILEGED.                                         * 03848000
*                                                                     * 03848400
* ENTRY POINT =                                                       * 03848500
*            IFG0190P - XCTL FROM MAINLINE OPEN                       * 03848600
*            IGG0196M - XCTL FROM OPEN EXECUTORS AND RDJFCB           * 03848700
*            IFG0200P - XCTL FROM MAINLINE CLOSE                      * 03848800
*            IGG0206M - XCTL FROM CLOSE EXECUTORS                     * 03848900
*            IFG0230P - XCTL FROM MAINLINE TCLOSE                     * 03849000
*            IFG0550P - XCTL FROM MAINLINE EOV                        * 03849100
*            IGG0190P - XCTL FROM OPEN EXECUTORS FOR EOV ABENDS   @PKA* 03850000
*                       (ALIAS FOR IFG0550P)                      @PKA* 03850900
*            IGG0200P - XCTL FROM CLOSE EXECUTORS FOR EOV ABENDS  @LGA* 03851800
*                       (ALIAS FOR IFG0550P)                      @LGA* 03852700
*                                                                     * 03853800
* INPUT = ENTERED IN DATA MANAGEMENT KEY                              * 04102000
*         REG 0 CONTAINS AN INTERNAL ABEND CODE.                      * 04110000
*         REGS 2-14 ARE AS THEY WERE IN CALLING ROUTINE.              * 04150000
*         TWO BYTE ID OF CALLING MODULE IS IN DXCALLID.               * 04200000
*         TWO BYTE ID OF MODULE TO WHOM CONTROL IS RETURNED           * 04250000
*         (WHERE APPLICABLE) IN DXRETID.                              * 04300000
*         EIGHT BYTE ID OF MODULE TO BE USED IN THE MESSAGE TEXT  @LNA* 04310000
*         (WHERE APPLICABLE) IS IN WAXMODID- IN CASE THE MODULE   @LNA* 04320000
*         DETECTING THE ERROR IS DIFFERENT THAN THE MODULE        @LNA* 04330000
*         CALLING PROBLEM DETERMINATION.                          @LNA* 04340000
*                                                                     * 04350000
* OUTPUT = EXIT IN DATA MANAGEMENT KEY                                * 04410000
*          REG 1 CONTAINS PTR TO PROBLEM DETERMINATION WORK AREA.     * 04450000
*          ABEND CODE, RETURN CODE, AND TRACE CODE ARE IN             * 04460000
*          PROB DET WORKAREA. 7 BYTE MSG ID OF THE WRITE-TO-          * 04500000
*          PROGRAMMER MSG IS PUT IN THE BUFFER.                       * 04550000
*                                                                     * 04600000
* EXIT- NORMAL =                                                      * 04750000
*          XCTL TO IFG0199B FOR OPEN AND RDJFCB.                      * 04800000
*          XCTL TO IFG0209B FOR CLOSE.                                * 04850000
*          XCTL TO IFG0559B FOR EOV.                                  * 04900000
*          XCTL TO IFG0239B FOR TCLOSE.                               * 04950000
*                                                                     * 05000000
* EXIT- ERROR =                                                       * 05050000
*          ABEND WITH FXX ABEND IF UNABLE TO FIND CODE IN TABLE       * 05150000
*          WHERE XX=13 FOR OPEN AND RDJFCB,                           * 05200000
*                   14 FOR CLOSE,                                     * 05250000
*                   17 FOR TCLOSE,                                    * 05300000
*                   37 FOR EOV.                                       * 05350000
*                                                                     * 05400000
* CHANGE ACTIVITY - SEE BELOW:                                        * 05400200
*                                                                     * 05400400
*$L1=IXVTOC,JDM1134,,STLRJM:   INDEX VTOC SUPPORT.                 @L1A 05400600
*$01=OZ66417,HDP1102,,STLTML:  NO ABEND FOR MAX EXTENTS.           @01A 05400800
*$02=OZ67627,HDP1102,,FEGJG:   ABEND0C4 IF AMP DD PARM FOR A       @02A 05401000
*                              NONVSAM DATA SET.                   @02A 05401200
*$03=OZ75375,HDP1102,,FEGJG:   ABEND013-AC DASD MIGRATION AID      @03A 05401400
*$04=OZ81133,JDP1111,,FEGHA:   INCORRECT MESSAGE ISSUED.           @04A 05401600
*$L2=USEREXIT,JDP1111,,STLLRU: VOLUME SECURITY DCB EXIT.           @L2A 05401800
*$L3=ANSI,JDP1111,,STLLRU:     ANSI-78 TAPE LABEL SUPPORT.         @L3A 05402000
*$H1=3800-3,JDP1111,83102,STLPD: 3800-3 PRINTER SUBSYSTEM SUPPORT. @H1A 05402200
*$L4=OZ86363,JDP1111,,STLRJM:  D/T3480 BLOCK ID SUPPORT            @L4A 05402400
*$06=OZ86008,HDP2210,,STLSJS:  ABEND117-04 BSAM CLOSE TYPE=T       @06A 05402600
*$07=OZ86782,HDP2210,,ISGJBM:  ABENDF37 - EOV DENSITY CONFLICT     @07A 05402800
*                              MSGIEC028I 837-04 ADDED TO EOV      @07A 05403000
*$08=OZ87942,HDP2210,,ISGJBM:  ABEND237-04 CONCAT WITH 'RDBACK'    @08A 05403200
*                              MSGIEC026I 637-20 ADDED TO EOV      @08A 05403400
*$09=OZ94520,HDP2210,,ISGGEC:  MSGIEC141I 013-AC ADDED TO OPEN     @09A 05403600
*$10=OZ90239,RACFSPE,85210,STLPD: RACF 1.7 SUPPORT                 @10A 05403800
*$11=OY01362,HDP2210,,ISGRJV:  MSGIEC036I 002-30 AND 002-38 ADDED. @11A 05404000
*$12=OY01923,HDP2210,,ISGGHA:  002-28 CHANGED FROM IEC129I TO 036I @12A 05404200
*$13=OY02388,HDP2230,,ISGJBM:  MSGIEC150I ABEND913-6C ADDED        @13A 05404400
*$15=OY10145,HDP2230,,NSDGHA: MSGIEC152I ABENDB13-38 ADDED         @15A 05404600
*$14=OY07766,HDP2230,871116,STLCMS: PDS INTEGRITY                  @14A 05404800
*                                                                  @L5A 05405000
*      MVS/XA 3.1.0 SUPPORT                                        @L5A 05405200
*                                                                  @L5A 05405400
*$L5=SMS,HDP3310,860507,STLCMS: UNSUPPORTED DATA TYPES XA 3.1      @L5A 05405600
*$L6=SMS,HDP3310,860623,STLDJP: SYSTEM DETERMINED BLOCKSIZE        @L6A 05405800
*$L7=RACF18,HDP3310,,STLMV:     PROGRAM LIBRARY EXEC ONLY PROTECT  @L7A 05406000
*$L8=SMS,HDP3310,,STLPD:        ADD EOV VERSION OF PASSWORD ERROR  @L8A 05406200
*$P9=KJB4207,HDP3310,,STLSS:    CACHING ATTRIBUTE SELECTION        @P9A 05406400
*$PA=KJB3376,HDP3310,,STLMV:    OPEN A VSAM DATA SET WITH A DCB    @PAA 05406600
*$PB=KJB4767,HDP3310,,STLMV:    ABEND913-6C CONFLICT OY02388/RACF18@PBA 05406800
*$PC=KJB4911,HDP3310,,STLMV:    INTEGRITY PROBLEM WITH EXECUTE ONLY@PCA 05407000
*                                                                  @H2A 05407200
*      MVS/XA 3.1.1 SUPPORT                                        @H2A 05407400
*                                                                  @H2A 05407600
*$H2=3480X,JDP3311,88281,STLFAO: 3480 COMPACTION SUPPORT           @H2A 05407800
*                                                                  @LBA 05408000
*      DFP/XA 3.2.0 SUPPORT                                        @LBA 05408200
*                                                                  @LBA 05408400
*$LB=PDSE,HDP3320,,STLJRM:     PDSE SUPPORT                        @LBA 05408600
*$16=OY26697,HDP3320,,GPDGEC: MSGIEC141I 013-BC ADDED TO OPEN      @16A 05408800
*$PD=KET3596,HDP3320,,STLMV:   MSGIEC036I 002-B8 SETLOCK ERROR     @PDA 05409000
*$17=OY29518,HDP3320,900216,GPDPJS: IEC212I 414-08 ADDED TO CLOSE  @17A 05409200
*$18=OY31819,HDP3320,900430,SJPLCC: IEC036I 002-D4 ADDED, AND      @18A 05409400
*                              IEC141I 213-78 ADDED                @18A 05409600
*$19=OY32594,HDP3320,900524,SJPLCC: IEC141I 213-7C AND 213-80 ADDED@19A 05409800
*$20=OY32580,HDP3320,900608,GPDGEC: ABEND113-38 ADDED TO OPEN IF   @20A 05410000
*                              JFCB SAYS VSAM BUT DSCB DOES NOT    @20A 05410200
*$21=OY34617,HDP3320,900907,GPDCHU: ABEND913-72 ADDED TO OPEN IF   @20A 05410400
*                       RECEIVING UNEXPECTED RETURN CODE FROM RACF @21A 05410600
*                                                                       05416000
*      DFP/XA 3.3.0 SUPPORT                                        @LCA 05417500
*                                                                  @LCA 05419000
*$LC=PDSE,HDP3330,900328,SJPLCC: PDSE SUPPORT                      @LCA 05420500
*                                                                       05422000
*      DFP/XA 4.1.0 SUPPORT                                        @LDA 05445400
*                                                                  @LDA 05468800
*$PE=KC11124,HDP3330,901112,SJPLREB: ABEND002-CC AND B14-1C ADDED  @PEA 05492200
*                       AND REMOVE CHECKPOINT/RESTART SUPPORT      @PEA 05515600
*$22=OY38372,HDP3330,910107,SSPDGEC: ALLOW 213-30 TO BE IGNORED    @22A 05539000
*$23=OY35916,HDP3330,910612,SJPLRCW: ALLOW OPEN 713-10 ABEND       @23A 05562400
*$24=OY46797,HDP3330,911031,SJPLJAL: IEC145I 413-48 ADDED TO OPENJ @24A 05585800
*$25=OY47334,HDP3330,911031,SJPLJAL: AL LBLS MUST CONFORM TO STD   @25A 05609200
*$LE=TAPELIB,HDP3330,,SJPLMV: FLAGSTAFF SUPPORT                    @LEA 05632600
*$26=OY51941,HDP3330,920210,SJPLGEC: IEC142I 113-20,24,28,2C ADDED @26A 05656000
*                                    TO EOV CONCATENATION          @26A 05679400
*                                                                  @LFA 05702800
*      DFSMS/MVS 1.1.0 SUPPORT                                     @LFA 05726200
*$LF=POSIX,JDZ1110,920123,SJPLREB: POSIX SUPPORT                   @LFA 05749600
*$27=OY52641,HDP3330,920304,SJPLRLC: ALLOW IGNORE OF 414-08        @27A 05773000
*$28=OY53760,HDP3330,920505,SJPLRCW: ALLOW EOV 137-3C ABEND        @28A 05796400
*$PF=KMM2105,JDP1110,920330,SJPLMV: DUPLICATE INTERNAL CODE        @PFA 05819800
*$PG=KMM2224,JDP1110,920424,SJPLMV: ABENDS 637-78 & 613-40         @PGA 05843200
*$PH=KMM2494,JDZ1110,920531,SJPLJAL: ABENDF37                      @PHA 05866600
*$LG=STRIPES,JDZ1110,920601,SJPLREB: STRIPING SUPPORT              @LGA 05890000
*$PI=KMM2500,JDZ1110,920603,SJPLMV: CHANGE 637-80 TO 637-74        @PIA 05913400
*$PJ=KMM2683,JDZ1110,920618,SJPLSS: ADD 637-80 AND 613-48 AS CATCH @PJA 05936800
*                                   ALLS FOR UNKNOWN LCS ERRORS    @PJA 05960200
*$30=OY54155,HDP3330,920531,920531,SJPLJAL: SMS BDAM DS WITH       @30A 05983600
*                           OPTCD=A INVALIDLY CREATED. 213-BC      @30A 06007000
*$31=OY55057,HDP3330,920601,SJPLGEC: IEC142I 113-38 ADDED TO EOV   @31A 06030400
*$PK=KMM3111,JDZ1110,920825,SJPLCC: ADD ALIAS IGG0190P FOR IFG0550P@PKA 06053800
*$32=OY58424,JDZ1110,921111,SJPLMV: ADD 637-84 & 88 + 613-4C & 50  @32A 06077200
*$33=OY59942,JDZ1110,921214,SJPLREB: INHIBIT ACCESS TO STRIPE DATA @33A 06100600
*                           ON DFP VERSION 3 SYSTEMS               @33A 06124000
*$34=OY57730,JDZ1110,920929,SJPLGEC: "ATTRIBUTE EXTENSION" SUPPORT @34A 06137000
*$35=OY60493,JDZ1110,921225,SJPLREB: ENTRY POINT IFG0231P IN CLOSE @35A 06137800
*$36=OY60209,JDZ1110,930121,SJPLMV:  ATL PVT TAPE NO INTERNAL LBL  @36A 06139100
*                                    ABENDS 637-8C & 613-54        @36A 06140400
*$37=OY65235,JDZ1110,930625,SJPLREB: PE OY60493                    @37A 06147900
*$38=OY65137,JDZ1110,930630,SJPLJAL: REMOVE 213-BC (OY54155)       @38A 06148900
*                                                                  @LIA 06149000
*      DFSMS/MVS 1.2.0 SUPPORT                                     @LHA 06149100
*$LH=BYPSEXPD,HDZ11B0,,SJPLGC: ADD 413-4C                          @LHA 06149200
*$LI=SAMCOMP,HDZ11B0,930318,SJPLGEC: ADD 213-C8, 213-CC ABENDS     @LIA 06149300
*$LJ=COMPRESS,HDZ11B0,930614,SJPLCC: COMPRESSION SUPPORT           @LJA 06149400
*$PL=K120209,HDZ11B0,930831,SJPLGEC: ADD 013-DC ABEND              @PLA 06149700
*$PM=K120645,HDZ11B0,931007,SJPLGEC: REMOVE K120209                @PMA 06149800
*$39=OW00483,HDZ11B0,931122,SJPLGEC: KZC0215 CHANGE ALL EOV ABENDS @39A 06158100
*                                    TO NOT HAVE DELAY AS AN OPTION@39A 06166400
*                                    ALSO ALLOW ATL ABENDS TO BE   @39A 06174700
*                                    IGNORED.                      @39A 06183000
*$40=OW00735,HDZ11B0,930810,SJPLGEC: ABEND213-BC IF ERROR UPDATING @40A 06185000
*                           FMT1 CHECKPOINTED DATASET FLAG FOR     @40A 06187000
*                           FIRST VOLUME OF MULTI-VOLUME DATASET.  @40A 06189000
*$41=OW01530,HDZ11B0,940113,SJPLMV:  ATL & MTL BLP/NL SUPPORT      @41A 06189300
*$42=OW03748,HDZ11B0,940221,SJPLGEC: NEW ABEND CODES FOR STRIPED   @42A 06189700
*                                    DATA SETS.                    @42A 06190400
*                                                                       06190500
*$43=OW05484,HDZ11B0,940527,SJPLGEC: ABEND002 COMPRESSION ABENDS   @43A 06190800
*                                    ISSUE MSGIEC043I WHEN IT      @43A 06190900
*                                    SHOULD BE MSGIEC036I          @43A 06191000
*$44=OW05412,HDZ11B0,940527,SJPLGEC: ABEND213-F0 IF CVAF ERROR OR  @44A 06192100
*                                    NOT FMT1 DSCB DURING DCBESIZE @44A 06193200
*                                    PROCESSING FOR STRIPED.       @44A 06194300
*                                    ABEND213-F4 IF CVAF ERROR     @44A 06195400
*                                    DURING DCBESIZE PROCESSING FOR@44A 06196500
*                                    COMPRESSED.                   @44A 06197600
*$45=OW06305,HDZ11B0,940613,SJPLMV:  ATL BLP/NL O/P SUPPORT        @45A 06198100
*$46=OW06898,HDZ11B0,940725,SJPLGEC: INCORRECT MSG FOR 237-1C      @46A 06198400
*      DFSMS/MVS 1.3.0 SUPPORT                                          06198500
*$LK=SDSH,HDZ11C0,940329,SJPLGEC: VSAM CONTROL ACB AND SDSH SUPPORT@LKA 06198600
*$47=OW10577,HDZ11B0,950106,SJPLGEC: IEC223I REASON CODE SUPPORT   @47A 06199000
*$48=OW10478,HDZ11B0,950414,SJPLCC:  ADD 002-F8 AND OO2-FC ABENDS  @48A 06199200
*$49=OW17120,HDZ11C0,951127,SJPLCC:  ADD 002-BC                    @49A 06199300
*$LL=XSAM,HDZ11C0,951013,SJPLGEC: ADD 213-F8, 213-FC, 213-44 AND   @LLA 06199400
*                                 002-2C ABENDS FOR XSAM ACCESS    @LLA 06199500
*                                 METHOD SUPPORT                   @LLA 06199600
*$LM=VSAMXSAM,HDZ11C0,960425,SJPLGEC: VSAM HFS/REMOTE FILE SUPPORT @LMA 06199700
*                                                                  @LIA 06206800
*      DFSMS/MVS 1.4.0 SUPPORT                                          06213900
*$LN=SERVICE,HDZ11D0,960919,SJPLGEC: SERVICEABILTY SUPPORT         @LNA 06221000
*$LO=TCOM,HDZ11D0,961023,SJPLCC: Tailored Compression Support      @LOA 06222100
*$PN=K140232,HDZ11D0,961023,SJPLGEC: ENSURE CLEAN HIORDER BYTE IN  @PNA 06223300
*                                     REG4(RCORE)                  @PNA 06225600
*$PO=K140597,HDZ11D0,970203,SJPLMLM: TCOM catalog call support     @POA 06226800
*                                                                       06228100
*$50=RESERVED AS A PLACE HOLDER TO SYNC WITH 1.2.0                 @50A 06230400
*$51=OW21115,HDZ11C0.960626,SJPLMV:  OAKCREEK SUPPORT              @51A 06232700
*$52=OW23434,HDZ11C0,960904,SJPLCC:  ADD 213-34 FOR TCOM TOLERATION@52A 06233500
*                                    SUPPORT                       @52A 06234300
*$PP=K140923,HDZ11D0,970402,SJPLMLM: TCOM ABEND RC SUPPORT         @PPA 06234700
*$53=OW32081,HDZ11D0,980330,SJPLJAL: CORRECT MSGID 713-14/137-22   @53A 06234900
*$LP=ANSIV4,HDZ11E0,980526,SJPLGEC: ADD 513-10 AND 513-14 FOR ANSI @LPA 06235000
*                                   V4 CCSID SUPPORT (PLUS OTHERS  @LPA 06236800
*                                   USED FOR SAM ANSI V4 SUPPORT)  @LPA 06238600
*$PQ=K150003,HDZ11E0,980824,SJPLCC: ADD 213-E9 FOR FIN OW25434     @PQA 06239500
*$LQ=GT32K,HDZ11F0,990818,SJPLRK:  >32K Blocksize support          @LQA 06239600
*$LR=31BIT,HDZ11F0,990305,SJPLGEC: RUN IN 31 BIT MODE              @LRA 06239800
*$PR=K160139,HDZ11F0,990512,SJPLGEC: ABEND0C4 DIRTY REGISTER 4     @PRA 06240000
*                                  ON ENTRY TO IGG0196M            @PRA 06240100
*$54=OW36308,HDZ11E0,981103,SJPLGEC: NON-SMS PDSE SUPPORT          @54A 06240200
*$LS=K161031,HDZ11F0,002001,SJPLJAL: MORE RMM CHANGES              @LSA 06240300
*$PS=K170380,HDZ11G0,010212,SJPLGEC: ALLOW 213-40 TO BE IGNORED    @PSA 06240900
*$56=OW48477,HDZ11E0,010306,SJPLREB: 002-45 BAD CONCAT NUMBER      @56A 06241100
*$LT=OW49828,HDZ11F0,010730,SJPLJAL: CUPE                          @LTA 06241200
*$LU=USSPO,HDZ11H0,010523,SJPLGEC: 013-E2 IF BPAM USS ACB BUT NO   @LUA 06241400
*                                  USS DIRECTORY FOUND             @LUA 06241600
*$PT=K1H0006,HDZ11H0,010525,SJPLGEC: ADD 113-10                    @PTA 06241800
*$PU=K1H0298,HDZ11H0,020318,SJPLGEC: REMOVE 113-10                 @PUA 06241900
*$PV=K1H0350,HDZ11H0,020416,SJPLREB: BPAM USS 002 ABENDS           @PVA 06242000
*$PW=KXP0086,HDZ11H0,020517,SJPLWER: BPAM USS: 913-74 ABEND        @PWA 06242100
*$LV=EDI,HDZ11H0,020515,SJPLMV: 213-FD ENHANCE DATA INTEGRITY      @LVA 06243600
*                               EXCLUSIVE ENQUEUE - ALREADY HELD   @LVA 06245100
*$57=OA05678,HDZ11H0,031119,SJPLGEC: ALLOW IGNORE OF 913-60        @57A 06245400
*$LW=ISAMEOL,HDZ11K0,030908,SJPLGEC: 213-1C IF OPENING ISAM DS     @LWA 06246200
*$LX=GT64KT,HDZ11K0,031118,SJPLGEC: LARGE SEQUENTIAL DS SUPPORT    @LXA 06246400
*$PX=K1K0233,HDZ11K0,040607,SJPLGEC: 913-78 ABEND                  @PBX 06246500
*$LY=OA07099,HDZ11J0,031230,SJPLJAL: WORM TAPE SUPPORT             @LYA 06247000
*$60=OA10833,HDZ11J0,050215,SJPLGEC: 020-0C FOR OA10719            @60A 06247200
*$LZ=BAMRAS,HDZ1190,060308,SJPLGEC: ADD 002-51                     @LZA 06247300
*$L10=BAM2GB,HDZ1190,060517,SJPLGEC: ADD 002-EE                   @L10A 06247400
*$L11=SAM64B,HDZ1190,060614,SJPLGEC: ADD 002-DE                   @L11A 06247600
*$61=OA15575,HDZ1180,060523,SJPLGEC: 002-ED AND 002-EF FOR OA15141 @61A 06247800
*$L12=EAV,HDZ1A10,060726,SJPLGEC: ADD 313-0C, 113-44 AND 113-48   @L12A 06247900
*$LZ=OA17569,HDZ1180,060930,SJPLJAL: TAPE ENCRYPT SUPPORT          @LZA 06248400
*$PY=K190477,HDZ1190,061215,SJPLGEC: CLEANUP                       @PYA 06248600
*$62=OA19780,HDZ1180,070129,SJPLGEC: ADD 614-54 FOR OA19542        @62A 06248700
*$PZ=KFI0486,HDZ1A10,080104,SJPLGEC: FIN APAR OA23503. ADD 413-XX  @PZA 06248800
*$L13=OCERAS,HDZ1B10,080306,SJPLGEC: CLEANUP                      @L13A 06249000
*$MX=BAMXTIOT,HDZ1C10,090430,SJPLJAL:  BAM XTIOT NOCAPT SUPPORT    @MXA 06249200
*$L14=OCERAS,HDZ1B10,090301,SJPLGEC: IEC988I MESSAGE SUPPORT      @L14A 06249300
*$MY=BYPSIEC,HDZ1C10,090430,SJPLJAL: NEW DCB ABEXT IGNORE OPTTION  @MYA 06249400
*$L15=EAVR3,HDZ1A10,060726,SJPLGEC: ADD 237-24 AND 237-28         @L15A 06249600
*$L14=TPRECOP,HDZ1C10,090430,SJPLJAL: ABENDS & REC OPT TP MULTIVOL@L14A 06249700
*$L16=DASD710,hdZ1C10,090501,SJPLJAL: IEC710I DASD RECOVERY/ABEND @L16A 06254700
*                                   ADDED VIA OA28975 TO RB10     @L16A 06259700
*$63=OA29123,HDZ1B10,090520,SJPLGEC: ADD 213-EA FOR OA29068        @63A 06264700
*$L17=OCERAS,HDZ1C10,090821,SJPLGEC: CONVERT TO BRANCH RELATIVE   @L17A 06267200
*$M1=OA28635,HDZ1A10,090530,SJPLJAL: HYDRA1.6 SUPPORT              @M1A 06268400
*$P10=K1C0625,HDZ1C10,091210,SJPLGEC: CLEANUP - ADD 002-C4/413-28 @P10A 06269000
*$L18=EXTOCEA,HDZ1D10,100530,SJPLJAL: EXTERNALIZE ABEND TEXT      @L18A 06269300
*$M4=FREEEOV,HDZ1D10,100330,SJPLJAL: FREE=EOV JCL SUPPORT          @M4A 06269500
*$M5,TMVLREC,HDZ1D10,100601,SJPLJAL: RECOVERY MISSING OUT SEQ TP   @M5A 06269600
*$65=OA33536,HDZ1C10,101001,SJPLJAL: REMOVE DELAY OPTION 637-BC    @65A 06272900
*$66=OA34639,HDZ1C10,101015,SJPLGEC: ADD 002-65                    @66A 06274500
*$L19=OCERAS,HDZ2210,110323,SJPLGEC: ADDITIONAL EXTERNALIZE ABEND @L19A 06274800
*                                     SUPPORT AND RETURN 031-04   @L19A 06275100
*                                     AND 031-08 BECAUSE NO LONGER@L19A 06275400
*                                     NEED-ISAM NOT SUPPORTED     @L19A 06275700
*$P11,SM01073,HDZ2210,121031,SJPLLM: 737-48                       @P11A 06275800
*$67=OA40256,HDZ2210,120912,RSTLAY: AB637-54,613-1C,214-1C         @67A 06275900
*                                   REPLACED BY NEW ABENDS         @67A 06276000
*                                   AB637-C4,613-8C,214-24         @67A 06276100
*$68=OA40400,HDZ1C10,121206,RSTLAY: SAVEAREA IN R13 DOES NOT POINT @68A 06276200
*                                   TO CONTROL PROGRAM WHEN EOV    @68A 06276300
*                                   TRANSFERS CONTROL TO DCB ABEND @68A 06276400
*                                   EXIT                           @68A 06276500
*$69=OA42197,HDZ2210,130528,RSTLAY: ZEDC                           @69A 06276600
*  1. Additional zEDC abend codes                                  @69A 06276700
*$71=OA47514,HDZ2210,150408,RSTLAY: Additional zEDC abend codes    @71A 06276800
*  213-FA (251), 213-FB (253).                                     @71A 06276900
*$72=OA47942,HDZ2220,150625,RSTLAY: SUPPORT BYPASS SAF AUTH        @72A 06277000
*                                   SECURITY CHECK                 @72A 06277100
*$73=OA50143,HDZ2220,160317,RSTLAY: ABEND013-D0 change flags to    @73A 06277200
*                                   allow IGNORE and DELAY ABEND.  @73A 06277300
*$L20=ROAVOLS,HDZ2220,160328,MDCASAD: READ-ONLY VOLUMES           @L20A 06277400
*$L21=ENCRYPT,HDZ2230,160520,RSTLAY:  SAM encryption              @L21A 06277500
*$74=OA53237,HDZ2230,170625,SJPLAPM: Add zEDC abend code 213-F1    @74A 06277600
*                                    (241) in support of OA52343.  @74A 06277700
*$75=OA55148,HDZ2230,180320,SJPLES:  ADD 002-D1,-D2 & -D3          @75A 06278000
*$L22=OA53956,HDZ2230,170915,MDCASAD: DEB Security & Integrity    @L22A 06278100
*                                     AB013-DC,414-0C,414-10 &    @L22A 06278200
*                                     AB237-30                    @L22A 06278300
*$76=OA54758,HDZ2230,180412,EZHOVA: Allow DELAY ABEND for 614-38,  @76A 06278400
*                                   614-3C, 614-40, AND 614-44     @76A 06278500
*$L23=ENCRYPT,HDZ2240,190227,ALBERTM: Basic & large fmt encrypt   @L23A 06278600
*                                     AB213-93,-95,-96,-97 & -99  @L23A 06278700
*                                     AB002-46, & -47             @L23A 06278800
*$77=OA57458,HDZ2240,190528,AWERCH: USE OABD175 FOR 013-DC         @77A 06278900
*                                   (OA55731)                      @77A 06279000
*$L24=RT363374,HDZ2250,20200305,Elatorre: Architecture Level Set  @L24A 06280000
*$78=OA58871,HDZ2240,20200221,MDCASAD: USE CABD135 FOR A 414-14    @78A 06280100
*$79=OA61295,HDZ2250,20210609,TUCJRB: RECOMPILE ONLY - IECPDSCT    @79A         
*$80=OA61209,HDZ2250,20210601,TUCARW: ENCRYPTION ARCHIVED KEY      @80A         
*                                     SUPPORT                      @80A         
*                                     ADD ABEND 213-9B (OABD182)   @80A         
*********************************************************************** 06280200
         EJECT                                                          06280300
R0       EQU   0                        WORK/PARAMETER REG              06289700
R1       EQU   1                        WORK/PARAMETER REG              06300000
RDCB     EQU   2                        PTR TO DCB                      06350000
RBASE    EQU   3                        DATA BASE REG             @L17C 06400000
RCORE    EQU   4                        PTR TO O/C/EOV WKAREA           06450000
RES      EQU   5                        PTR TO RESIDENT RTN             06500000
RWTGC    EQU   8                        PTR TO WTG TABLE CURRENT ENTRY  06550000
RPARC    EQU   7                        PTR TO PARALIST CURRENT ENTRY   06600000
RWTG     EQU   6                        PTR TO WTG TABLE                06650000
RTIOT    EQU   9                        PTR TO TIOT ENTRY               06700000
RUCB     EQU   10                       PTR TO UCB                      06750000
RB       EQU   11                       WORK/PARAMETER REG              06800000
RC       EQU   12                       WORK/PARAMETER REG              06850000
RD       EQU   13                       WORK/PARAMETER REG              06900000
RET      EQU   14                       WORK/PARAMETER REG              06950000
RF       EQU   15                       WORK/PARAMETER REG              07000000
*                                                                  @PWA 07025000
SVRBEXSA EQU   96                       OFFSET OF SVRB EXT S/A IN SVRB  07050000
SIX      EQU   6                        WORK VALUE                      07300000
THREE    EQU   3                        WORK VALUE                      07350000
TWO      EQU   2                        WORK VALUE                      07550000
FOUR     EQU   4                        WORK VALUE                      07600000
EIGHT    EQU   8                        WORK VALUE                      07700000
NINE     EQU   9                        WORK VALUE               YM1447 07710000
ZERO     EQU   0                        WORK VALUE                      07800000
ABENDCOD EQU   &B                       INVALID CODE ABEND              07850000
OPENCODE EQU   X'13'                    OPEN SVC NUMBER          YM3111 07852000
CHARF    EQU   C'F'                     WORK VALUE                      07900000
CHAR1    EQU   C'1'                     OPEN MESSAGE ID          YM3111 07902000
         EJECT                                                          07910000
         USING PSA,0                                               @PWA 07932500
         LARL  RBASE,DATA               ESTABLISH ADDRESSABILITY  @L17C 07982500
         USING DATA,RBASE                                         @L17C 08032500
         USING TABLE,RD                                                 08100000
         USING FORCORE,RCORE                                            08150000
         USING WTG,RWTG                                          Y02080 08160000
*                                                                2@L17D 08162200
         SAM31                    GET INTO 31 BIT MODE            @L17C 08164400
         B CPYRGHTA                 & BRANCH                      @L17A 08166600
         DC    AL1(CPYRGHTB-1-*)                                        08168800
         DC    CL8'IECPDINI'      MODULE DISTRIBUTION NAME              08173200
         DC    CL8'&SYSDATE'      DATE COMPILED                         08177600
         DC    CL8'HDZ2250'       LEVEL OF THIS PRODUCT                 08183900
         DC    CL8'&SYSPARM'      MAINTENANCE - NONE OR PTF NUMBER      08186400
CPYRGHTB DS    0C                                                       08190800
Base31   DC    A(CPYRGHTA+X'80000000')  Base addr & 31-bit mode    @PWA 08193000
CPYRGHTA DS 0H                                                          08195200
         L     R1,PSATOLD               Get TCB address            @PWC 08245200
         L     R1,0(R1)                 SVRB PTR                        08350000
         MODESET EXTKEY=SUPR            SVRB KEY                 Y02082 08360000
         ST    RDCB,SVRBEXSA(R1)        SAVE REG 2 IN SVRB EXT S/A      08400000
         STM   RCORE,RWTGC,SVRBEXSA+FOUR(R1)                            08450000
*                                       SAVE REGS 4-8 IN SVRB EXT S/A   08500000
         MODESET EXTKEY=DATAMGT         DATA MANAGEMENT KEY      Y02082 08510000
         ICM   RCORE,B'1000',CODEMASK   ENSURE CLEAN HI ORDER BYTE @PWC 08530000
         LR    RC,R0                    SAVE CODE                       08550000
         N     RC,CODEMASK              ZERO HI 3 BYTES                 08600000
         LA    RD,CODTABLE              POINT TO TABLE                  08650000
         SR    RET,RET                  ZERO WORK REG                   08700000
PDF01020 IC    RET,CODE                 GET CODE IN TABLE ENTRY         08750000
         CR    RC,RET                   RIGHT TABLE ENTRY        M0035  08800000
         BE    PDF01040                 YES                             08850000
         LTR   RET,RET                  END OF TABLE             M0035  08900000
         BE    PDF01040                 YES, GET CORE FOR WTP           08950000
         LA    RD,TABLLEN(RD)           POINT TO NEXT ENTRY             09000000
         B     PDF01020                 CHECK NEXT ENTRY IN TABLE       09050000
PDF01040 EQU   *                        CONTINUE BUILDING MSG           09100000
         L     RF,DXOCEWAX                                         @MYA 09108300
         LTR   RF,RF                                               @MYA 09116600
         BZ    PDF01041                                            @MYA 09124900
         USING WAXTN,RF                                           @L18A 09127600
         NI    WAXFLG14,X'FF'-WAXIECAB                             @MYA 09130300
         ST    RC,WAXABCOD-WAXTN(RF)    SAVE INTERNAL ABEND CODE  @L18A 09133000
         MVC   WXPDFRST,WTGMODNM                                  @L18A 09135700
         AIF   ('&COMP' EQ 'OPEN').OPEXT                          @L19A 09135800
.*                                      IS OPEN EXPANSION REQUIRED@L19A 09135900
         AIF   ('&COMP' EQ 'OPENEX').XEXT                         @L19A 09136000
.*                                      IS OPEN EXECUTOR EXPANSION@L19A 09136100
.*                                      REQUIRED                  @L19A 09136200
         AIF   ('&COMP' EQ 'CLOSE').CLSEXT                        @L19A 09136300
.*                                      IS CLOSE EXPANSION REQ'D  @L19A 09136400
         AIF   ('&COMP' EQ 'TCLOSE').TCLSEXT                      @L19A 09136500
.*                                      IS TCLOSE EXPANSION REQ'D @L19A 09136600
         AGO   .EOVEXT                  MUST BE EOV               @L19A 09136700
.OPEXT   ANOP                                                     @L19A 09136800
         OI    WAXFLG4,WXEXTOP          INDICATE OPEN/OPENJ       @L19A 09136900
         AGO   .GENMAIN1                                          @L19A 09137000
.XEXT    ANOP                                                     @L19A 09137100
         OI    WAXFLG4,WXEXTEX          INDICATE EXECUTORS        @L19A 09137200
         AGO   .GENMAIN1                                          @L19A 09137300
.CLSEXT ANOP                                                      @L19A 09137400
         OI    WAXFLG4,WXEXTCL          INDICATE CLOSE            @L19A 09137500
         AGO   .GENMAIN1                                          @L19A 09137600
.TCLSEXT ANOP                                                     @L19A 09137700
         OI    WAXFLG4,WXEXTTCL         INDICATE TCLOSE           @L19A 09137800
         AGO   .GENMAIN1                                          @L19A 09137900
.EOVEXT  ANOP                                                     @L19A 09138000
         OI    WAXFLG4,WXEXTEOV         INDICATE EOV              @L19A 09138100
.GENMAIN1 ANOP                                                    @L19A 09138200
         DROP  RF                       DROP WAX                  @L18A 09138400
PDF01041 EQU   *                                                   @MYA 09141500
         LA    R0,PDBFRLEN              LENGTH OF MSG BUFFER     YM3945 09150000
         LM    RTIOT,RB,DXCCW8          SAVE WORKAREA                   09200000
*        IECRES GET,LV=(0),PREFIX=YES,STM=(2,14,WTGPREFX),       Y02080 09410000
*              ID=PDWA                  GET CORE FOR WTP         Y02144 09412000
         IECRES GET,LV=(0),PREFIX=YES,STM=(2,14,WTGPREFX),       Y02080*09420000
               ID=PDWA                                           Y02144 09470000
         USING PDDSECT,R1                                          @PWM 09520000
         STM   RTIOT,RB,DXCCW8          RESTORE WKAREA                  09650000
         L     RF,WTGPREFX              GET BASE PREFIX PTR      YM7883 09650800
         L     RF,IECRRPRM-IECPREFX(,RF) GET RRPLIST PTR         YM7883 09651200
         TM    RRFLAGS2-RRPLIST(RF),RRFFIN1 1ST MODULE COMPLETED YM7883 09651600
         LA    RF,WTGMODNM              PT T0 'IFG' ERROR MODNM  YM7883 09652000
         BO    PDF01044                 YES, GO SET 'IFG' NAME   YM7883 09652400
         LA    RF,IGCNAME               PT T0 'IGC' ERROR MODNM  YM7883 09652800
PDF01044 EQU   *                        SET ERROR MODULE NAME    YM7883 09653200
*                                                                       09653400
*        IF ONE MODULE DETECTED THE ERROR BUT ANOTHER IS CALLING   @LNA 09653600
*        PROBLEM DETERMINATION, THEN WAXMODID WILL BE SET WITH     @LNA 09653800
*        THE MODULE ID THAT ACTUALLY DETECTED THE ERROR. THAT      @LNA 09654000
*        MODULE ID WILL BE USED IN THE DETERMINATE ABEND MESSAGE   @LNA 09654200
*        TEXT, INSTEAD OF THE MISLEADING MODULE ID OF THE MODULE   @LNA 09654400
*        THAT IS CALLING PROBLEM DETERMINATION.                    @LNA 09654600
*                                                                       09654800
         ICM   RCORE,B'1000',CODEMASK   ENSURE CLEAN HIORDER BYTE  @PNA 09654900
         ICM   RET,15,DXOCEWAX          GET WORK AREA EXTENSION    @LNA 09655100
         BZ    PDF01045                 BR IF ZERO                 @LNA 09655200
         USING WAXTN,RET                                           @LNA 09655400
         NC    WAXMODID,WAXMODID        MOD ID SPECIFIED?          @LNA 09655600
         BZ    PDF01045                 NO, USE NORMAL MOD ID      @LNA 09655800
         MVC   PDERRMOD,WAXMODID        YES, USE THAT MOD ID IN MSG@LNA 09656000
         DROP  RET                                                 @LNA 09656200
         B     PDF01046                 BR TO CONTINUE             @LNA 09656600
PDF01045 EQU   *                                                   @LNA 09656800
         MVC   DXWORK(L'WTGMODNM),0(RF) 1ST PART OF ERROR MODNM  YM7883 09657000
         MVC   DXWORK+L'WTGMODNM-L'DXCALLID(L'DXCALLID),DXCALLID YM3111 09658000
         MVC   PDERRMOD,DXWORK          ERROR NAME TO WORK AREA  YM3111 09658400
PDF01046 EQU   *                                                   @LNA 09704200
         CLI   CODE,ZERO                WAS CODE PASSED VALID    M0035  09750000
         BZ    PDF01060                 NO, ISSUE WTP AND ABEND         09800000
*                                       MOVE ID/VCON TO WTG      YM1447 10000000
         MVC   WTGIDTTR-WTGENTRY(TWO,RWTGC),LASTLOAD+SIX MODID   YM1447 10050000
         MVC   WTGIDTTR+TWO-WTGENTRY(THREE,RWTGC),LASTLOAD+NINE  YM1447 10070000
         MVC   PDRETCOD,RETCODE         MOVE RETURN CODE TO WKAREA      10150000
         MVC   PDABCODE,ABCODE          MOVE ABEND CODE TO WKAREA       10200000
         MVC   PDCODE,TRCCODE           MOVE TRACE CODE TO WKAREA       10250000
         MVC   PDMSG(EIGHT),ID          MOVE OPEN/CLOSE/EOV      M0069  10300000
*                                       MSG ID TO PD WKAREA             10350000
         AIF   ('&COMP' NE 'EOV').SKIPEOV EOV ONLY FOLLOWS       YM3111 10352000
         ICM   RF,B'1100',PDABCODE      X37N0000                 YM3111 10354000
         SLL   RF,FOUR                  37N00000                 YM3111 10356000
         SRL   RF,24                    00000037                 YM3111 10358000
         LA    RET,OPENCODE             GET OPEN CODE            YM3111 10360000
         CR    RF,RET                   COMPARE IF FROM COMMON   YM3111 10362000
         BNE   PDF01050                 BRANCH IF NOT COMMON     YM3111 10364000
         MVI   PDMSG+THREE,CHAR1        SET OPEN ID              YM3111 10366000
.SKIPEOV ANOP                                                    YM3111 10368000
PDF01050 MVC   PDMSG+FOUR(TWO),MSGID    MOVE LAST TWO CHARS      YM3111 10400000
*                                       OF ID TO WKAREA                 10450000
         ICM   RDCB,15,DXOCEWAX         GET WORK AREA EXTENSION    @MYA 10460000
         BZ    PDF01059                                            @MYA 10470000
         MVC   WAXMSGID-WAXTN(EIGHT,RDCB),PDMSG                    @MYA 10480000
PDF01059 EQU   *                                                   @MYA 10490000
         L     RDCB,DXPDCBAD            INSURE COPIED DCB PTR    YM3105 10500000
*                                                                YM1447 10510000
*        IECRES LOAD,PREFIX=WTGPREFX,BRANCH=DIRECT,              Y02080 10710000
*              MODNM=NEXTMOD                                     YM1447 10710200
*                                       XCTL TO IFG0199B         Y02080 10710400
         IECRES LOAD,PREFIX=WTGPREFX,BRANCH=DIRECT,              Y02080X10762000
               MODNM=NEXTMOD                                     YM1447 10812000
PDF01060 EQU   *                        ISSUE WTP AND ABEND             11000000
         MVC   PDMSGLNG(ENDMSG+FOUR),NOCODMSG                           11050000
*                                       MOVE MESSAGE TO BUFFER          11100000
         MVC   PDMSGLNG+ENDMSG-L'WTGMODNM(L'WTGMODNM),PDERRMOD   YM3111 11102000
*                                       MOVE ERROR MOD TO BUFFER YM3111 11104000
         LR    RD,R1                    SAVE PTR TO WKAREA              11150000
*        WTO   MF=(E,(1))               ISSUE WRITE-TO-PROGRAMMER       11200000
         WTO   MF=(E,(1))               ISSUE WRITE-TO-PROGRAMMER       11210000
         LA    R1,ABENDCOD              GET FXX ABEND CODE              11400000
         L     RDCB,DXUDCBAD            GET USER DCB ADDRESS     YM5924 11860000
*        ABEND (1),DUMP,,SYSTEM         SYSTEM ABEND WITH A DUMP Y02080 11900000
         ABEND (1),DUMP,,SYSTEM         SYSTEM ABEND WITH A DUMP Y02080 11910000
*                                                                       11915000
*********************************************************************** 11920000
*                                                                       11925000
*        CONSTANTS                                                      11930000
*                                                                       11940000
*********************************************************************** 11943300
*                                                                       11946600
         DS    0F                                                       11950000
DATA     DS    0D                                                 @L17A 11975000
CODEMASK DC    X'000000FF'              MASK TO ZERO HI-3 BYTES OF      12000000
*                                       INTERNAL CODE                   12010000
NOCODMSG DC    AL2(ENDMSG)              LNG OF MSG                      12050000
         DC    X'8000'                  MCSFLAGS                        12100000
         DC    CL8'IEC900I'             MSG ID                          12150000
         DC    C'INVALID ABEND CODE PASSED TO '                         12200000
         DC    C'&A'                    MODULE ID                       12250000
         DC    C' FROM '                MORE MESSAGE             YM3111 12252000
ERRORMOD DC    CL8' '                   MODULE IN ERROR          YM3111 12254000
ENDMSG   EQU   *-NOCODMSG               LNG OF MSG                      12300000
         DC    X'04000020'              ROUT AND DESCRIPTOR CODES       12350000
ID       DC    C'IEC'                   DATA MAN ID                     12500000
         DC    C'&C'                    OPEN/CLOSE/EOV ID               12550000
         DC    C'  I '                                                  12600000
IGCNAME  DC    C'IGC000  '              FIRST MODULE 'IGC' NAME  YM7883 12610000
         EJECT                                                          12650000
*        THE FOLOWING TABLE IS USED TO DETERMINE THE EXTERNAL ABEND     12660000
*        CODE, RETURN CODE, DATA TO BE TRACED, AND ID OF A WRITE-       12670000
*        TO-PROGRAMMER MSG TO BE ISSUED.  THE TABLE CONSISTS OF         12680000
*        SEVEN-BYTE ENTRIES IN THE FOLLOWING FORMAT.                    12690000
*              BYTE 0 - INTERNAL CODE                                   12692000
*              BYTE 1-2 - BITS 0-11 EXTERNAL ABEND CODE                 12694000
*                       BITS 12-15 FLAGS INDICATING VALID OPTIONS THE   12696000
*                                       USER MAY EXERCISE IN HIS ABEND  12698000
*                                       EXIT ROUTINE FOR THE PARTICULAR 12698400
*                                       ABEND.                          12698800
*                                       THE POSSIBLE BIT SETTINGS IN    12698900
*                                       THIS FIELD ARE AS FOLLOWS.      12699100
*                                        X'08' - RECOVERY PERMITTED     12699200
*                                        X'04' - IGNORE PERMITTED       12699300
*                                        X'02' - DELAY ABEND PERMITTED  12699400
*                                        X'01' - DISSALLOW DCB  ZA01291 12699500
*                                         ABEND EXIT - POSSIBLE ZA01291 12701500
*                                         BAD DCB               ZA01291 12703500
*              BYTE 3 - RETURN CODE TO BE PASSED IN REGISTER 15 WHEN    12706000
*                       ABEND IS ISSUED                                 12708000
*              BYTE 4 - CODE INDICATING THE DATA TO BE TRACED FOR       12710000
*                       PARTICULAR ABEND                                12712000
*                                       THE POSSIBLE CODES IN THIS      12714000
*                                       FIELD ARE AS FOLLOWS. (HEX)     12716000
*                                       00 - NO TRACE                   12717000
*                                       04 - IOB AND CCWS               12718000
*                                       08 - TIOT ENTRY AND UCBS        12720000
*                                       0C - JFCBVOLS                   12722000
*                                       10 - TAPE LABEL                 12724000
*                                       14 - JFCBDSNM                   12726000
*                                       18 - VOLUME LABEL               12728000
*                                       1C - DSCB (ALL ASSOCIATED WITH  12730000
*                                            ABEND THAT ARE IN CORE.    12732000
*                                       28 - DCB                        12734000
*                                       34 - DCB, DSCB                  12736000
*                                       38 - JFCBELNM                   12738000
*                                       3C - DCB EXIT LIST ENTRIES      12740000
*                                       40 - DCB, TAPE LABEL            12742000
*                                       44 - DCB, JFCBDSNM              12744000
*                                       48 - JFCBDSNM                   12746000
*                                       4C - JFCBVOLS, DSCB      YM1238 12748000
*                                       80 - TRACING WILL BE DONE  @LBA 12748600
*                                           BY SAM MODULE IFGXXX9C @LBA 12749200
*              BYTE 5-6 - TWO BYTE ID TO BE PUT IN WRITE-TO-PROGRAMMER  12750000
*                       MESSAGE.                                        12752000
*                                                                       12752100
*********************************************************************** 12752200
*********************************************************************** 12752300
*                                                                       12752400
*        NOTE: WHEN ADDING A NEW INTERNAL CODE IECEQU NEEDS TO BE       12752500
*        UPDATED WITH THE NEW ABEND/REASON CODE AND IFG019RS NEEDS      12752600
*        TO BE UPDATED WITH THE ABEND REASON CODE DESCRIPTION.          12752700
*                                                                       12752800
*********************************************************************** 12752900
*********************************************************************** 12753000
CODTABLE EQU   *                                                        12753100
         AIF   ('&COMP' EQ 'OPEN').GENOP                                12754000
.*                                      IS OPEN EXPANSION REQUIRED      12756000
         AIF   ('&COMP' EQ 'OPENEX').GENOPEX                            12758000
.*                                      IS OPEN EXECUTOR EXPANSION      12760000
.*                                      REQUIRED                        12770000
         AIF   ('&COMP' EQ 'CLOSE').GENCL                               12800000
.*                                      IS CLOSE EXPANSION REQUIRED     12810000
         AIF   ('&COMP' EQ 'TCLOSE').GENTC                              12850000
.*                                      IS TCLOSE EXPANSION REQUIRED    12860000
         AIF   ('&COMP' EQ 'EOV').GENEOV                                12900000
.*                                      IS EOV EXPANSION REQUIRED       12910000
         MEXIT                                                          12950000
.GENOP   ANOP **** COMMON OPEN ****                                     12975300
         DC    X'0141360408'    413-04  1                               13000700
         DC    C'45'                                                    13001500
         DC    X'0241360804'    413-08  2                               13002000
         DC    C'45'                                                    13002500
         DC    X'0341360C04'    413-0C  3                               13003000
         DC    C'45'                                                    13003500
         DC    X'0441361004'    413-10  4                               13004000
         DC    C'45'                                                    13004500
         DC    X'0591363410'    913-34  5                          @L2A 13013500
         DC    C'50'                                                    13022500
         DC    X'0651360420'    513-04  6                               13022600
         DC    C'46'                                                    13022700
         DC    X'0791326C0C'    913-6C  7    RACF NOT AUTHORIZED   @13A 13022800
         DC    C'50'                                                    13022900
         DC    X'08413E180C'    413-18  8                               13023000
         DC    C'45'                                                    13023500
         DC    X'096136040C'    613-04  9                               13023600
         DC    C'47'                                                    13023700
         DC    X'0AA136040C'    A13-04  10                              13023800
         DC    C'51'                                                    13023900
         DC    X'0B613E0804'    613-08  11                              13024000
         DC    C'47'                                                    13024100
         DC    X'0C613E0C10'    613-0C  12                              13024200
         DC    C'47'                                                    13024300
         DC    X'0D713E0400'    713-04  13                       XM3491 13024400
         DC    C'48'                                                    13024500
         DC    X'0E813E0414'    813-04  14                              13024600
         DC    C'49'                                                    13024700
         DC    X'0F613E1004'    613-10  15                              13024800
         DC    C'47'                                                    13024900
         DC    X'10613E1404'    613-14  16                              13025000
         DC    C'47'                                                    13025100
         DC    X'1101360400'    013-04  17                              13025200
         DC    C'41'                                                    13025300
         DC    X'1201360800'    013-08  18                              13025400
         DC    C'41'                                                    13025500
         DC    X'1391360410'    913-04  19  NO VOLUME ACCESS WHEN  @L3C 13025600
         DC    C'50'                        USED FOR ANSI TAPES    @L3C 13025700
         DC    X'1491360810'    913-08  20  NO FILE ACCESS WHEN    @L3C 13025800
         DC    C'50'                        USED FOR ANSI TAPES    @L3C 13025900
         DC    X'1521360804'    213-08  21                              13026000
         DC    C'43'                                                    13026100
         DC    X'1691300C00'    913-0C  22                              13026200
         DC    C'50'                                                    13026300
         DC    X'1741362408'    413-24  23                              13026400
         DC    C'45'                                                    13026500
         DC    X'189136100C'    913-10  24                       Y01048 13026600
         DC    C'50'                                             Y01048 13026700
         DC    X'1951360810'    513-08  25  ANSI LABEL STANDARDS   @L3A 13026800
         DC    C'46'                        VIOLATION              @L3A 13026900
         DC    X'1A41360408'    413-04  26                              13027000
         DC    C'45'                                                    13027100
         DC    X'1B41362004'    413-20  27                              13027200
         DC    C'45'                                                    13027500
         DC    X'1C71360800'    713-08  28                       XM3491 13028000
         DC    C'48'                                            SA55580 13028500
         DC    X'1D71360C10'    713-0C  29  OPERATOR REJECT LABEL  @L3A 13029000
         DC    C'48'                        REWRITE                @L3A 13029500
         DC    X'1E213E0448'    213-04  30                              13030000
         DC    C'43'                                                    13030500
         DC    X'1F21361804'    213-18  31                              13031000
         DC    C'43'                                                    13031500
         DC    X'2011360804'    113-08  32                         @M5A 13032000
         DC    C'42'                                                    13032500
         DC    X'2151360C10'    513-0C  33  ANSI INCOMPATIBLE      @L3A 13033000
         DC    C'46'                        VERSION CONFLICT       @L3A 13033500
         DC    X'2211360C3C'    113-0C  34                              13034000
         DC    C'42'                                                    13034500
         DC    X'2391366000'    913-60  35   RACDEF REJECT DSN     @57C 13035000
         DC    C'50'                                               @10A 13035500
         DC    X'2431360404'    313-04  36                              13036000
         DC    C'44'                                                    13036500
         DC    X'2541361C00'    413-1C  37                              13037000
         DC    C'45'                                                    13037500
         DC    X'2641363804'    413-38  38 /* ERROR READING BLKID  @L4A 13038000
         DC    C'45'                                                    13038500
         DC    X'2721363014'    213-30  39  DSCB 'ENQ' HELD BY     @22C 13039000
         DC    C'43'                        ANOTHER USER           @14C 13039500
         DC    X'2800000000'            40                              13040000
         DC    C'  '                                                    13040500
         DC    X'2991301408'    913-14  41                       Y02083 13041000
         DC    C'50'                                             Y02083 13041500
         DC    X'2AC1361008'    C13-10  42                              13042000
         DC    C'53'                                                    13042500
         DC    X'2B01366444'    013-64  43                              13043000
         DC    C'41'                                                    13043500
         DC    X'2C01366828'    013-68  44                              13044000
         DC    C'41'                                                    13044500
         DC    X'2D31300834'    313-08  45   DASD CALCULATION      @L6C 13045000
         DC    C'44'                         SERVICES FAILED       @L6C 13045500
         DC    X'2E01366C08'    013-6C  46                              13046000
         DC    C'41'                                                    13046500
         DC    X'2F01367010'    013-70  47                              13047000
         DC    C'41'                                                    13047500
         DC    X'3011323834'    113-38  48                         @20C 13048000
         DC    C'42'                                               @20C 13048500
         DC    X'3191326400'    913-64  49   RACF REJECT BLP       @10A 13049000
         DC    C'50'                                               @10A 13049500
         DC    X'3211361804'    113-18  50                              13050000
         DC    C'42'                                                    13050500
         DC    X'332136C434'    213-C4  51 INHIBIT OPEN OF STRIPED @33A 13051000
         DC    C'43'                       DATA SETS - DFP V3 ONLY @33A 13051500
         DC    X'346136180C'    613-18  52   AUTOMATED TAPE LIBR.  @39C 13052000
         DC    C'47'                                               @LEC 13052500
         DC    X'3501361430'    013-14  53                       Y02134 13053000
         DC    C'41'                                             Y02134 13053500
         DC    X'3611322030'    113-20  54                         @PAA 13053600
         DC    C'42'                                               @PAA 13053700
         DC    X'371132244C'    113-24  55                         @PAA 13053800
         DC    C'42'                                               @PAA 13053900
         DC    X'3811322808'    113-28  56                         @PAA 13054000
         DC    C'42'                                               @PAA 13054100
         DC    X'3911322C28'    113-2C  57                         @PAA 13054200
         DC    C'42'                                               @PAA 13054300
         DC    X'3A11323000'    113-30  58                         @PAA 13054400
         DC    C'42'                                               @PAA 13054500
         DC    X'3B11323444'    113-34  59                         @PAA 13054600
         DC    C'42'                                               @PAA 13054700
         DC    X'3C61361C0C'    613-1C  60   AUTOMATED TAPE LIBR.  @39A 13054800
         DC    C'47'                                               @LEA 13054900
         DC    X'3D6136200C'    613-20  61   AUTOMATED TAPE LIBR.  @39A 13055000
         DC    C'47'                                               @LEA 13055100
         DC    X'3E6136240C'    613-24  62   AUTOMATED TAPE LIBR.  @39A 13055200
         DC    C'47'                                               @LEA 13055300
         DC    X'3F6136280C'    613-28  63   AUTOMATED TAPE LIBR.  @39A 13055400
         DC    C'47'                                               @LEA 13055500
         DC    X'4061362C0C'    613-2C  64   AUTOMATED TAPE LIBR.  @39A 13055600
         DC    C'47'                                               @LEA 13055700
         DC    X'416136300C'    613-30  65   AUTOMATED TAPE LIBR.  @39A 13055800
         DC    C'47'                                               @LEA 13055900
         DC    X'426136340C'    613-34  66   AUTOMATED TAPE LIBR.  @39A 13056000
         DC    C'47'                                               @LEA 13056100
         DC    X'436136380C'    613-38  67   AUTOMATED TAPE LIBR.  @39C 13056200
         DC    C'47'                                               @LEA 13056300
         DC    X'446136400C'    613-40  68   AUTOMATED TAPE LIBR.  @39C 13056400
         DC    C'47'                                               @PGA 13056500
         DC    X'456136440C'    613-44  69   AUTOMATED TAPE LIBR.  @39C 13056600
         DC    C'47'                                               @PGA 13056700
         DC    X'4621315834'    213-58  70   UNSUPP DS TYPE        @L5A 13056800
         DC    C'43'                                               @L5A 13056900
         DC    X'4741363C44'    413-3C  71   CASF FAILURE          @P9A 13057000
         DC    C'45'                                               @P9A 13057100
         DC    X'4861363C0C'    613-3C  72   AUTOMATED TAPE LIBR.  @39A 13057200
         DC    C'47'                                               @PGA 13057300
         DC    X'496136480C'    613-48  73   AUTOMATED TAPE LIBR.  @39A 13057400
         DC    C'47'                                               @PJA 13057500
         DC    X'4A2136C034'    213-C0  74   STRIPED DATA SET NOT  @LGA 13057600
         DC    C'43'                         ON ESCON CHANNEL OR   @LGA 13057700
         DC    X'4B61364C0C'    613-4C  75   AUTOMATED TAPE LIBR.  @39A 13057800
         DC    C'47'                                               @PJA 13057900
         DC    X'4C6136500C'    613-50  76   AUTOMATED TAPE LIBR.  @39A 13058000
         DC    C'47'                                               @PJA 13058100
         DC    X'4D91366800'    913-68  77   RACDEF REJECT VOL USE @10A 13058200
         DC    C'50'                                               @10A 13058300
         DC    X'4E21364014'    213-40  78   PDSE OPENED FOR EXCP  @PSC 13058400
         DC    C'43'                         BY UNAUTHORIZED CALLER@LBA 13058500
         DC    X'4F0136F034'    013-F0  79   CATALOG ERROR FOR     @34A 13059000
         DC    C'41'                         ATTR XTNSION D/S      @34A 13059500
         DC    X'506136540C'    613-54  80   AUTOMATED TAPE LIB    @39A 13059600
         DC    C'47'                                               @36A 13059700
         DC    X'516136580C'    613-58  81   SMCT SUPPORT          @41A 13059800
         DC    C'47'                                               @41A 13059900
         DC    X'5261365C0C'    613-5C  82   SMCT SUPPORT          @41A 13060000
         DC    C'47'                                               @41A 13060100
         DC    X'536136600C'    613-60  83   SMCT SUPPORT          @45A 13060200
         DC    C'47'                                               @45A 13060300
         DC    X'5411323C28'    113-3C  84   FAIL OPEN FOR VSAM    @LKA 13060400
         DC    C'42'                         CONTROL ACB           @LKA 13060500
         DC    X'5511324034'    113-40  85   VSAM RLS ERROR        @LKA 13060600
         DC    C'42'                         CONTROL ACB           @LKA 13060700
         DC    X'566136640C'    613-64  86   BLYTHE LIB SUPPORT    @51A 13060800
         DC    C'47'                                               @51A 13060900
         DC    X'576136680C'    613-68  87   BLYTHE LIB SUPPORT    @51A 13061000
         DC    C'47'                                               @51A 13061100
         DC    X'5851361010'    513-10  88   DISP=MOD SPECIFIED FOR@LPA 13061200
         DC    C'46'                         NON-IBM V4 TAPE       @LPA 13061300
         DC    X'5951361410'    513-14  89   ANSI V4 CCSID CONFLICT@LPA 13061400
         DC    C'46'                                               @LPA 13061500
         DC    X'5A0136E044'    013-E0  90   DEVTYPE ERROR         @LQA 13061600
         DC    C'41'                                               @LQA 13061700
         DC    X'5B0136E140'    013-E1  91   LBI REQUIRED BUT NOT  @LQA 13061800
         DC    C'41'                         SPECIFIED             @LQA 13061900
         DC    X'5C41325044'    413-50  92   TAPE INSTALL EXIT     @LSA 13062000
         DC    C'45'                         INVALID RETURN CODE   @LSA 13062100
         DC    X'5D21361C34'    213-1C  93 INHIBIT OPEN OF ISAM    @LWC 13062200
         DC    C'43'                       DATA SETS               @LWC 13062300
.*                                                                 @LWD 13062400
         DC    X'5E613E7204'    613-72  94   32BIT BLOCKID MODESET @LTA 13062500
         DC    C'47'                         CCW FAILED            @LTA 13062600
         DC    X'5F21361034'    213-10  95   LARGE DS BUT NOT BSAM,@LXA 13063000
         DC    C'43'                         BPAM,QSAM OR EXCP     @LXA 13063400
         DC    X'6021361434'    213-14  96   LARGE DS VIOLATION    @LXA 13063800
.*                                         BLOCKTOKENSIZE=NOREQUIRE@LXA 13064000
         DC    C'43'                                               @LXA 13064200
         DC    X'6191367834'    913-78  97   PASSWORD D/S CAN'T BE @PXC 13064600
         DC    C'50'                         LARGE OR EXT FORMAT   @LXA 13065000
         DC    X'6261328028'   613-80   98   WORM WRITE VIOLATION  @LYA 13065600
         DC    C'47'                                               @LYA 13066200
         DC    X'6361328428'   613-84   99   WORM PROCESS VIOLATION@LYA 13066800
         DC    C'47'                                               @LYA 13067400
.*                                                                3@LYD 13068000
         DC    X'642136FD14'    213-FD  100  EDI ENQ ALREADY HELD  @LVA 13069500
         DC    C'43'                                               @LVA 13071100
         DC    X'6521361534'    213-15  101  LARGE DS VIOLATION    @LXA 13071600
.*                                         BLOCKTOKENSIZE=REQUIRE  @LXA 13072100
         DC    C'43'                                               @LXA 13072600
         DC    X'6661328828'    613-88  102 TAPE ENCRYPT IO ERROR  @LZA 13073000
         DC    C'47'                                               @LZA 13073400
         DC    X'6711364434'    113-44  103  EAS ELIGIBLE D/S BUT @L12A 13073800
         DC    C'42'                         DCBEEADSCBOK NOT ON  @L12A 13074200
.*                                                                @L14D 13074600
         DC    X'6811364834'    113-48  104  EAS VOLUME VTOC BUT  @L12A 13075000
         DC    C'42'                         DCBEEADSCBOK NOT ON  @L12A 13075400
*                                            WITH EXCP DCB        @L12A 13075800
         DC    X'6931360C1C'    313-0C  105  FORMAT 8 DSCB READ    @PZC 13076000
         DC    C'44'                         BUT NOT EAV ELIGIBLE  @PZC 13076200
         DC    X'6A41365400'    413-54  106 JFCB VOLSEQ NO GT 255  @PZA 13076400
         DC    C'45'                                                    13076600
         DC    X'6B413C580C'    413-58  107  TP RDBK MISSING LAST @L14A 13077100
         DC    C'45'                                              @L14A 13077600
         DC    X'6C413C5C0C'    413-5C  108 TP RD FWD MISSING 1ST @L14A 13078100
         DC    C'45'                                              @L14A 13078600
         DC    X'6D71361000'    713-10  109   IEC510D LOOP         @23A 13079500
         DC    C'48'                                               @23A 13081600
         DC    X'6E413E340C'    413-34  110                    @ZA00615 13083700
         DC    C'45'                                           @ZA00615 13085800
         DC    X'6F41302C00'    413-2C  111                    @Y30LSFY 13088500
         DC    C'45'                                           @Y30LSFY 13113500
         DC    X'7041303000'    413-30  112                    @Y30LSFY 13123500
         DC    C'45'                                           @Y30LSFY 13133500
         DC    X'7141364C00'    413-4C  113   EXP DATE BYPASS NOT  @LHA 13133700
         DC    C'45'                          AUTHORIZED           @LHA 13133900
         DC    X'72713A140C'    713-14  114                        @PHA 13134100
         DC    C'48'                                               @53C 13134400
         DC    X'732136C834'    213-C8  115   COMPRESSED DATASET   @LIA 13134500
         DC    C'43'                          CAN'T OPEN FOR UPDAT @LIA 13134700
         DC    X'742136CC1C'    213-CC  116   DSCB INDICATES       @LIA 13134800
         DC    C'43'                          COMPRESSED DATA SET  @LIA 13134900
.*                                            BUT DSCB DOESN'T     @LIA 13135000
.*                                            INDICATE STRIPED D/S @LIA 13135100
         DC    X'7541364008'    413-40  117 INCOMPATIBLE DEVICE    @H2A 13135300
         DC    C'45'                                       TYPE    @H2A 13135500
         DC    X'7641364408'    413-44  118 INCONSISTENT VOLUME    @H2A 13135800
         DC    C'45'                             RECORDING MODE    @H2A 13136100
         DC    X'7711364C28'    113-4C  119  DCB W/XTIOT NOCAPTURE @MXA 13136200
         DC    C'42'                         BUT WIHTOUT DEVSUP    @MXA 13136300
.*                                           ACTIVATION            @MXA 13136400
         DC    X'784134600C'    413-60  120                        @M4A 13136500
         DC    C'45'                                               @M4A 13136600
.*                                                                 @M4D 13136700
         DC    X'790136D828'    013-D8  121 INVALID XLRI/LRECL=X   @L3A 13136900
         DC    C'41'                                               @L3A 13137100
.*                                                                    * 13137300
.*****           122 THROUGH 138 ARE AVAILABLE - SEE GENOPEX      ***** 13137500
.*                                                                    * 13137700
.*                                                               3@L13D 13138300
         DC    X'8B91361814'    913-18  139                      Y02082 13138900
         DC    C'50'                                             Y02082 13139500
         DC    X'8C91361C14'    913-1C  140                      Y02082 13140000
         DC    C'50'                                             Y02082 13140500
         DC    X'8D91363800'    913-38  141  RACF REJECT       @ZA43856 13141500
         DC    C'50'                                           @Z40RSDS 13142500
         DC    X'8E91363C18'    913-3C  142                    @ZA43856 13143500
         DC    C'50'                                           @Z40RSDS 13144500
         DC    X'8F91364018'    913-40  143                    @ZA43856 13145500
         DC    C'50'                                           @Z40RSDS 13146500
         DC    X'9091367000'    913-70  144                        @PBC 13146600
         DC    C'50'                                               @L7A 13146700
.*                                                                      13146800
         DC    X'9121369834'    213-98  145  STRIPE - VOLUMES NOT  @LGA 13146900
         DC    C'43'                         IN ASCENDING SEQUENCE @LGA 13147000
.*                                                                      13147100
         DC    X'922136AC34'    213-AC  146  STRIPE - LAST VOLUME  @LGA 13147200
         DC    C'43'                         INDICATOR SET ON TOO  @LGA 13147300
*                                            EARLY                 @LGA 13147400
.*                                                                      13147500
         DC    X'932136B034'    213-B0  147  STRIPE - LAST VOLUME  @LGA 13147600
         DC    C'43'                         INDICATOR NOT SET     @LGA 13147700
.*                                                                      13147800
         DC    X'942136B434'    213-B4  148  STRIPE - INVALID      @LGA 13148000
         DC    C'43'                        VOLUME SEQUENCE NUMBER @LGA 13148100
.*                                                                      13148200
         DC    X'952136B834'    213-B8  149  STRIPE - EXCP NOT     @LGA 13148300
         DC    C'43'                         SUPPORTED - EVEN FOR  @LGA 13148400
*                                            AUTHORIZED CALLER     @LGA 13148500
.*                                                                      13148600
         DC    X'9621369434'    213-94  150  STRIPE - DSORG NOT    @LGA 13148700
         DC    C'43'                         PS                    @LGA 13148800
.*                                                                    * 13148900
         DC    X'9721369C34'    213-9C  151  DCBE - DCB POINTER IN @LGA 13149000
         DC    C'43'                         DCBE NOT ZERO         @LGA 13149100
.*                                                                      13149200
         DC    X'98A1360808'    A13-08  152                    @ZA04601 13150800
         DC    C'51'                                           @ZA04601 13152500
         DC    X'99A1360C08'    A13-0C  153                    @ZA04602 13153000
         DC    C'51'                                           @ZA04602 13153500
         DC    X'9AA1361010'    A13-10  154                    @ZA04603 13154000
         DC    C'51'                                           @ZA04603 13154500
         DC    X'9BA1361410'    A13-14  155                    @ZA04604 13155000
         DC    C'51'                                           @ZA04604 13155500
         DC    X'9CA1361810'    A13-18  156                    @ZA04605 13156000
         DC    C'51'                                           @ZA04605 13156500
         DC    X'9D0136F434'    013-F4  157 STRIPE - ERROR FINDING @42A 13160100
         DC    C'41'                        EXT FORMAT CELL        @42A 13163700
         DC    X'9E2136BC4C'    213-BC  158                        @40A 13166800
         DC    C'43'                                               @40A 13170000
         DC    X'9F2136F048'    213-F0  159 STRIPE - CVAF ERROR    @44A 13170900
         DC    C'43'                        DCBESIZE PROCESSING    @44A 13171800
.*                                                                      13172700
.*****           160 THROUGH 174 ARE AVAILABLE - SEE GENOPEX       @77C 13175400
.*                                                                 @LFA 13178100
         DC    X'AF0136DC34'    013-DC  175 DEBCHK issued a        @77C 13178200
         DC    C'41'                        non-zero return code.  @77C 13178300
.*                                                                 @77A 13178400
.*****           176 THROUGH 187 ARE AVAILABLE - SEE GENOPEX       @77A 13178500
.*                                                                 @77A 13178600
         DC    X'BC21368834'    213-88  188  Any OPEN to a USS     @LFA 13181700
         DC    C'43'                         file (PATH= coded)    @LFA 13185300
.*                                                                    * 13188900
.*****           189 THROUGH 192 ARE AVAILABLE - SEE GENOPEX      ***** 13191600
.*                                                                    * 13194300
.*                                                                 @LFA 13197000
         DC    X'C121368C34'    213-8C  193  Any OPEN to a USS     @LFA 13199700
         DC    C'43'                         data set(file system) @LFA 13202400
.*                                                                    * 13205100
.*****           194 THROUGH 213 ARE AVAILABLE - SEE GENOPEX      ***** 13207800
.*                                                                    * 13210500
         DC    X'D603D6044C'    03D-04  214                             13212500
         DC    C'56'                                                    13214500
         DC    X'D703D6084C'    03D-08  215                             13215000
         DC    C'56'                                                    13215500
         DC    X'D821360C04'    213-0C  216                             13216000
         DC    C'43'                                                    13216500
         DC    X'D941364844'    413-48  217                        @24A 13217000
         DC    C'45'                                               @24A 13217500
.*                                                                    * 13218000
.*****           218 THROUGH 219 ARE AVAILABLE - SEE GENOPEX      ***** 13218500
.*                                                                    * 13219000
         DC    X'DCC1361808'    C13-18  220                     OY02814 13219700
         DC    C'53'                                            OY02814 13220500
.*                                                                    * 13221400
.*****           221 THROUGH 225 ARE AVAILABLE - SEE GENOPEX      ***** 13222300
.*                                                                    * 13223200
         DC    X'E20136BC28'    013-BC  226                        @16A 13224100
         DC    C'41'                                               @16A 13225000
.*       DC    X'E300000000'            227  AVAILABLE- SEE GENOPEX@16A 13225900
.*       DC    C'  '                                               @16A 13226800
         DC    X'E491322028'    913-20  228                      Y02082 13227600
         DC    C'50'                                             Y02082 13228500
.*       DC    X'E500000000'            229  AVAILABLE - SEE GENOPEX  * 13229000
.*       DC    C'  '                                                  * 13229500
         DC    X'E62136201C'    213-20  230                      Y02072 13230000
         DC    C'43'                                             Y02072 13230500
         DC    X'E72136241C'    213-24  231                      Y02072 13231000
         DC    C'43'                                             Y02072 13231500
         DC    X'E803D60C34'    03D-0C  232                    @ZA02225 13233500
         DC    C'56'                                           @ZA02225 13235500
.*                                                                    * 13236100
.*****           233 THROUGH 237 ARE AVAILABLE - SEE GENOPEX      ***** 13236700
.*                                                                    * 13237300
         DC    X'EE91302408'    913-24  238                      Y02083 13237900
         DC    C'50'                                             Y02083 13238500
         DC    X'EF91302808'    913-28  239                      Y02083 13239000
         DC    C'50'                                             Y02083 13239500
         DC    X'F091308008'    913-80  240                        @72A 13239600
         DC    C'50'                                               @72A 13239700
.*                                                                    * 13239800
.*****           241 IS AVAILABLE - SEE GENOPEX                   ***** 13239900
.*                                                                    * 13240100
         DC    X'F221362C14'    213-2C  242                    @G60ASRB 13240800
         DC    C'43'                                           @G60ASRB 13241500
         DC    X'F391362C14'    913-2C  243                      Y02082 13242500
         DC    C'50'                                             Y02082 13243500
         DC    X'F491363010'    913-30  244                      Y02082 13244000
         DC    C'50'                                             Y02082 13244500
         DC    X'F591367200'    913-72  245   RACF UNEXPECTED RC   @21C 13251600
         DC    C'50'                                               @21C 13258700
         DC    X'F621362808'    213-28  246                      YM1238 13267300
         DC    C'43'                                             YM1238 13276000
         DC    X'F791324800'    913-48  247                    @G32DSMI 13286000
         DC    C'50'                                           @G32DSMI 13296000
         DC    X'F891324C00'    913-4C  248                    @G32DSMI 13306000
         DC    C'50'                                           @G32DSMI 13316000
         DC    X'F991325000'    913-50  249                    @G32DSMI 13326000
         DC    C'50'                                           @G32DSMI 13336000
         DC    X'FA91325400'    913-54  250                    @G32DSMI 13346000
         DC    C'50'                                           @G32DSMI 13356000
         DC    X'FB91325800'    913-58  251                    @G32DSMI 13366000
         DC    C'50'                                           @G32DSMI 13376000
         DC    X'FC91325C00'    913-5C  252                    @G32DSMI 13386000
         DC    C'50'                                           @G32DSMI 13396000
         DC    X'FD4138284C'    413-28  253                       @P10C 13406000
         DC    C'45'                                           @G18MSBS 13416000
         DC    X'FE'                    254 - INTERNAL ABEND CODE  @H1A 13424300
         DC    X'0136'          013-E8        SYSTEM ABEND 013     @H1A&13432600
                                              ... IGNORE/DELAY OK  @H1A 13440900
         DC    X'E8'                          RET CODE IN REG. 15  @H3A 13449200
         DC    X'3C'                          TRACE CODE-DCB EXLST @H1A 13457500
         DC    C'41'                          MESSAGE IEC141       @H1A 13465800
         DC    X'FF61328C00'    613-8C  255                        @67C 13479000
         DC    C'47'                                               @67C 13484000
         DC    X'00'                    END OF TABLE MARKER        @07A 13490700
         AGO   .GNOPEND                                                 13499900
.GENOPEX ANOP **** OPEN EXECUTORS ****                                  13502500
         DC    X'2E01306C28'    013-6C  46                     XL02942* 13505100
         DC    C'41'                                           XL02942* 13510200
         DC    X'2F01307028'    013-70  47                     XL02942* 13515300
         DC    C'41'                                           XL02942* 13520400
         DC    X'300136AC28'    013-AC  48                        @09A* 13525500
         DC    C'41'                                              @09A* 13530600
         DC    X'310136F828'    013-F8  49                        @LQA* 13533600
         DC    C'41'                                              @LQA* 13536600
         DC    X'320136FC28'    013-FC  50                        @LQA* 13539600
         DC    C'41'                                              @LQA* 13542600
.*                                                                    * 13545900
         DC    X'3301360C28'    013-0C  51                       Y02144 13548700
         DC    C'41'                                                    13551500
         DC    X'340136102C'    013-10  52                       Y02144 13552000
         DC    C'41'                                                    13552500
         DC    X'3501361430'    013-14  53                       Y02144 13553000
         DC    C'41'                                                    13553500
         DC    X'3601361834'    013-18  54                       Y02144 13554000
         DC    C'41'                                                    13554500
         DC    X'3701361C34'    013-1C  55                       Y02144 13555000
         DC    C'41'                                                    13555500
         DC    X'3801362028'    013-20  56                       Y02144 13556000
         DC    C'41'                                                    13556500
         DC    X'3901362428'    013-24  57                       Y02144 13557000
         DC    C'41'                                                    13557500
         DC    X'3A01362828'    013-28  58                       Y02144 13558000
         DC    C'41'                                                    13558500
         DC    X'3B01362C28'    013-2C  59                       Y02144 13559000
         DC    C'41'                                                    13559500
         DC    X'3C01363C28'    013-3C  60                       Y02144 13560000
         DC    C'41'                                                    13560500
         DC    X'3D01363428'    013-34  61                       Y02144 13561000
         DC    C'41'                                                    13561500
         DC    X'3E01363828'    013-38  62                       Y02144 13562000
         DC    C'41'                                                    13562500
         DC    X'3F01363028'    013-30  63                       Y02144 13563000
         DC    C'41'                                                    13563500
         DC    X'4001364028'    013-40  64                       Y02144 13564000
         DC    C'41'                                                    13564500
         DC    X'4101364428'    013-44  65                       Y02144 13565000
         DC    C'41'                                                    13565500
         DC    X'4201364828'    013-48  66                       Y02144 13566000
         DC    C'41'                                                    13566500
         DC    X'43B1361004'    B13-10  67                       Y02144 13567000
         DC    C'52'                                                    13567500
         DC    X'44B1361400'    B13-14  68                       Y02144 13568000
         DC    C'52'                                                    13568500
         DC    X'45B1360C04'    B13-0C  69                       Y02144 13569000
         DC    C'52'                                                    13569500
         DC    X'46B1300800'    B13-08  70                       YM3213 13570000
         DC    C'52'                                             YM3213 13570500
         DC    X'47B1360400'    B13-04  71                       Y02144 13571000
         DC    C'52'                                                    13571500
         DC    X'4801364C28'    013-4C  72                       Y02144 13572000
         DC    C'41'                                                    13572500
         DC    X'4901365024'    013-50  73                       Y02144 13573000
         DC    C'41'                                                    13573500
         DC    X'4A01365424'    013-54  74                       Y02144 13574000
         DC    C'41'                                                    13574500
         DC    X'4B01365808'    013-58  75                       Y02144 13575000
         DC    C'41'                                                    13575500
         DC    X'4C01365C28'    013-5C  76                       Y02144 13576000
         DC    C'41'                                                    13576500
         DC    X'4D01366828'    013-68  77                         @LQA 13576900
         DC    C'41'                                               @LQA 13577300
         DC    X'4E21361634'    213-16  78                         @LXC 13577700
         DC    C'43'                                               @LXC 13578100
.*                                                                 @LXD 13578500
         DC    X'4F24000428'    240-04  79                              13578900
         DC    C'55'                                                    13579500
         DC    X'5024000828'    240-08  80                              13580000
         DC    C'55'                                                    13580500
         DC    X'5124000C38'    240-0C  81                              13581000
         DC    C'55'                                                    13581500
         DC    X'5224001028'    240-10  82                              13582000
         DC    C'55'                                                    13582500
         DC    X'5301366028'    013-60  83                       Y02144 13583000
         DC    C'41'                                                    13583500
         DC    X'5401368428'    013-84  84                       Y02144 13584000
         DC    C'41'                                                    13584500
         DC    X'5501307400'    013-74  85                              13585000
         DC    C'41'                                                    13585500
         DC    X'5601307820'    013-78  86                              13586000
         DC    C'41'                                                    13586500
         DC    X'5701307C20'    013-7C  87                              13587000
         DC    C'41'                                                    13587500
         DC    X'5801308020'    013-80  88                              13588000
         DC    C'41'                                                    13588500
         DC    X'59B1361804'    B13-18  89                       Y02144 13589000
         DC    C'52'                                                    13589500
         DC    X'5AB1301C00'    B13-1C  90                              13590000
         DC    C'52'                                                    13590500
         DC    X'5BC1300400'    C13-04  91                              13591000
         DC    C'57'                                                    13591500
         DC    X'5CD1300400'    D13-04  92                              13592000
         DC    C'58'                                                    13592500
         DC    X'5DE1300400'    E13-04  93                              13593000
         DC    C'59'                                                    13593500
         DC    X'5E01368800'    013-88  94                     @ZM00695 13594000
         DC    C'41'                                                    13594500
         DC    X'5FB1362000'    B13-20  95                       YM3213 13595000
         DC    C'52'                                                    13595500
         DC    X'60B1362400'    B13-24  96                       YM3213 13596000
         DC    C'52'                                                    13596500
         DC    X'61B1362800'    B13-28  97                       YM3213 13597000
         DC    C'52'                                                    13597500
         DC    X'62B1300804'    B13-08  98                      YL03127 13598000
         DC    C'52'                                            YL03127 13598500
         DC    X'63B1301000'    B13-10  99                      YL03127 13599000
         DC    C'52'                                            YL03127 13599500
         DC    X'6400040400'            100                      Y02144 13600000
         DC    C'03'                                             Y02144 13600500
         DC    X'65B1302C04'    B13-2C  101                      YM3213 13601000
         DC    C'52'                                             YM3213 13601500
         DC    X'66B1303004'    B13-30  102                      YM3213 13602000
         DC    C'52'                                             YM3213 13602500
         DC    X'67B1303404'    B13-34  103                      YM3213 13603000
         DC    C'52'                                             YM3213 13603500
         DC    X'6800040800'            104                      Y02144 13604000
         DC    C'03'                                             Y02144 13604500
         DC    X'6901368C28'    013-8C  105  BDAM NO RECFM         @02C 13605000
         DC    C'41'                                           @ZA09124 13605500
         DC    X'6A0130A428'    013-A4  106                     XL02942 13606000
         DC    C'41'                                            XL02942 13606500
         DC    X'6B0130A828'    013-A8  107                     XL02942 13607000
         DC    C'41'                                            XL02942 13607500
         DC    X'6CB1303828'    B13-38  108  B13-38  SETPRT MACRO  @15A 13607800
         DC    C'52'                         FAILURE               @15A 13608100
         DC    X'6D0136FD28'    013-FD  109  Both LBI and Bypass   @LQA 13608300
         DC    C'41'                         DOS checkpoint specd  @LQA 13608500
         DC    X'6E0136FE28'    013-FE  110  Both LBI and Update   @LQA 13608700
         DC    C'41'                         specified             @LQA 13608900
         DC    X'6F41302C00'    413-2C  111                    @Y30LSFY 13610200
         DC    C'45'                                           @Y30LSFY 13611500
         DC    X'700136FF28'    013-FF  112  Both LBI and Exchange @LQA 13612000
         DC    C'41'                         Buffering specified   @LQA 13612500
         DC    X'7101349000'    013-90  113                     YL03123 13613000
         DC    C'41'                                            YL03123 13613500
         DC    X'7201349428'    013-94  114                     YL03123 13614000
         DC    C'41'                                            YL03123 13614500
         DC    X'7301349828'    013-98  115                     YL03123 13615000
         DC    C'41'                                            YL03123 13615500
         DC    X'7401349C28'    013-9C  116                     YL03123 13616000
         DC    C'41'                                            YL03123 13616500
         DC    X'750134A028'    013-A0  117                     YL03123 13617000
         DC    C'41'                                            YL03123 13617500
         DC    X'760130CC00'    013-CC  118  013-CC,3800 PRNTR @Z40MSRZ 13642500
         DC    C'41'                         SETPRT FAILURE    @Z40MSRZ 13667500
         DC    X'770136D028'    013-D0  119                        @73C 13686400
         DC    C'41'                                           @ZA37591 13693500
         DC    X'780136D428'    013-D4  120  NO LRI/XLRI           @L3A 13693700
         DC    C'41'                                               @L3A 13693900
         DC    X'790136E21C'    013-E2  121  BPAM USS ACB but DSAB @LUC 13694100
         DC    C'41'                         not found             @LUC 13694300
         DC    X'7A0136EC34'    013-EC  122  PDSE - LRECL WRONG    @LBA 13694500
         DC    C'41'                                               @LBA 13694700
         DC    X'7B21365434'    213-54  123  PDSE - MAXIMUM NUMBER @LBA 13694900
         DC    C'43'                    OF MEMS CREATED (AT OPEN)  @LBA 13695100
         DC    X'7C0136E434'    013-E4  124  013-E4,MAXIMUM        @01A 13695300
         DC    C'41'                         EXTENTS EXCEEDED      @01A 13695500
         DC    X'7D21365208'    213-52  125  READ-ONLY VOLUME     @L20A 13695700
         DC    C'43'                       INCORRECT D/S TYPE     @L20A 13695800
.*                                                                @L20A 13695900
         DC    X'7E21363834'    213-38  126  PDSE OR STRIPED - OUTPUT   13696100
         DC    C'43'                     AND DCB KEYLEN ^ = 0      @LGC 13696300
         DC    X'7F21363C34'    213-3C  127  PDSE - RECFM WRONG    @LBA 13696500
         DC    C'43'                                               @LBA 13696700
         DC    X'8021368428'    213-84  128  PDSE - SETLOCK FAILED @23A 13696900
         DC    C'43'                                IN IGG0194S    @23A 13697100
         DC    X'8121364828'    213-48  129  PDSE - ERROR RETURNED @LBA 13697300
         DC    C'43'                                FROM CASFE     @LBA 13697500
         DC    X'8221364C28'    213-4C  130  PDSE - PS AND OUTPUT  @LBA 13697700
         DC    C'43'                         TO DIRECTORY)         @LBA 13697900
         DC    X'8321365028'    213-50  131  PDSE - JCDM ERROR     @LBA 13698100
         DC    C'43'                                               @LBA 13698300
         DC    X'8421365C28'    213-5C  132  PDSE - CREATE MEMBER  @LBA 13698500
         DC    C'43'                         ERROR                 @LBA 13698700
         DC    X'8521366028'    213-60  133  PDSE - CONVERT ROUTINE@LBA 13698900
         DC    C'43'                         ERROR                 @LBA 13699100
         DC    X'8621366428'    213-64  134  PDSE - INVALID OPEN   @LBA 13699300
         DC    C'43'                         OPTION SPECIFIED      @LBA 13699500
         DC    X'8721366828'    213-68  135  PDSE - FB SPECIFIED   @LBA 13699700
         DC    C'43'                         AND LRECL=0 WHEN OPEN @LBA 13699900
*                                            FOR OUTPUT OR 'U' SP- @LBA 13700100
*                                            ECIFIED & BLKSIZE=0   @LBA 13700300
         DC    X'8821366C28'    213-6C  136  PDSE - QSAM UPDATE    @LBA 13700500
         DC    C'43'                         AND NOT LOCATE        @LBA 13700700
.*                                                                 @LBA 13700900
         DC    X'8921367028'    213-70  137  PDSE - CROSS SYSTEM   @LBA 13701100
         DC    C'43'                         SHARING CONFLICT      @LBA 13701300
.*                                                                 @LBA 13701500
         DC    X'8A21367428'    213-74  138  PDSE - INVALID MEMBER @LBA 13701700
         DC    C'43'                         SHARE OPTIONS         @LBA 13701900
.*                                                                 @12D 13702100
         DC    X'8B21367834'    213-78  139  PDSE - ZERO PRIMARY   @18A 13702300
         DC    C'43'                         SPACE                 @18A 13702500
.*                                                                 @12D 13702700
         DC    X'8C21367C34'    213-7C  140  PDSE - OUTPUT WHILE   @19A 13702900
         DC    C'43'                         DUMP IN PROGRESS      @19A 13703100
.*                                                                 @19A 13703300
         DC    X'8D21369034'    213-90  141  PDSE - ANY OPEN WHILE @LGC 13703500
         DC    C'43'                         RESTORE IN PROGRESS   @LGC 13703700
.*                                                                 @LGA 13703900
         DC    X'8E2136A034'    213-A0  142  STRIPE - TRKCALC ERROR@LGA 13704100
         DC    C'43'                         (TRKSIZE EXCEEDED)    @LGA 13704300
.*                                                                 @LGA 13704500
         DC    X'8F2136A434'    213-A4  143  STRIPE - BAD RC FROM  @LGA 13704700
         DC    C'43'                         RBNCNVT               @LGA 13704900
.*                                                                 @LGA 13705100
         DC    X'902136A834'    213-A8  144  STRIPE - INCONSISTENT @LGA 13705300
         DC    C'43'                         STRIPES               @LGA 13705500
.*                                                                 @LJA 13705700
         DC    X'912136D034'    213-D0  145  CMP - BAD RC FROM     @LJA 13705900
         DC    C'43'                         IGG019VY              @LJA 13706100
.*                                                                 @LJA 13706300
         DC    X'922136D434'    213-D4  146  CMP - CANNOT CALCULATE@LJA 13706500
         DC    C'43'                         BLOCKSIZE             @LJA 13706700
.*                                                                 @LJA 13706900
         DC    X'932136D834'    213-D8  147  CMP - NO BLKSIZE IN   @LJA 13707100
         DC    C'43'                         EFC IN CATALOG        @LJA 13707300
.*                                                                 @LJA 13707500
         DC    X'942136DC34'    213-DC  148  CMP - BAD RC FROM     @LJA 13707700
         DC    C'43'                         COMPRESSION OPEN      @LJA 13707900
.*                                                                 @LJA 13708100
         DC    X'952136E034'    213-E0  149  CMP - NULL TOKEN IN   @LJA 13708300
         DC    C'43'                         EFC IN CATALOG        @LJA 13708500
         DC    X'962136E434'    213-E4  150  CMP - I/O ERROR       @42A 13708600
         DC    C'43'                         READING LAST BLK      @42A 13708700
         DC    X'972136E834'    213-E8  151  STR - OPEN MULTIVOL   @42A 13708800
         DC    C'43'                         WITH QSAM, VBS, UPDATE@42A 13708900
.*                                           BFTEK=A               @42A 13709000
         DC    X'982136EC34'    213-EC  152  CMP - INVALID REPRO CI@42A 13709100
         DC    C'43'                         REQUEST. INOUT/OUTIN  @42A 13709200
.*                                           DISP=MOD OR PHYSICAL  @42A 13709300
.*                                           SIZE > BUFFER SIZE    @42A 13709400
         DC    X'992136F448'    213-F4  153  CMP - CVAF ERROR      @44A 13709500
         DC    C'43'                         DURING DCBESIZE       @44A 13709600
.*                                           PROCESSING            @44A 13709700
         DC    X'9A2136F844'    213-F8  154  USS - BSAM/QSAM does  @PWC 13709800
         DC    C'43'                         not support file type @LLA 13709900
         DC    X'9B2136FC44'    213-FC  155  USS - file does not   @PWC 13710000
         DC    C'43'                         exist                 @LLA 13710100
         DC    X'9C21364444'    213-44  156  USS - OPEN MOD/EXTEND @PWA 13710200
         DC    C'43'                         file with RECFM=FB    @LLA 13710300
.*                                           but last record in    @LLA 13710400
.*                                           file not multiple of  @LLA 13710500
.*                                           LRECL                 @LLA 13710600
.*                                                                 @12D 13710700
         DC    X'9D51361840'    513-18  157  ANSI V4 - USER KEY    @LPA 13710800
         DC    C'46'                         DOES NOT MATCH TCB KEY@LPA 13710900
.*                                                                 @LPA 13711000
         DC    X'9E51361C40'    513-1C  158  ANSI V4 - AUTHORIZED  @LPA 13711100
         DC    C'46'                         USER ENCOUNTERED      @LPA 13711200
.*                                                                 @LPA 13711300
         DC    X'9F51362040'    513-20  159  ANSI V4 - DATACONV    @LPA 13711400
         DC    C'46'                         OPEN ERROR (INPUT)    @LPA 13711500
.*                                                                 @LPA 13711600
         DC    X'A051362440'    513-24  160  ANSI V4 - DATACONV    @LPA 13711700
         DC    C'46'                         OPEN ERROR (OUTPUT)   @LPA 13711800
.*                                                                 @LPA 13711900
         DC    X'A151362840'    513-28  161  ANSI V4 - CONVERSION  @LPA 13712000
         DC    C'46'                         NOT SUPPORTED ON LEVEL@LPA 13712100
.*                                           OF SYSTEM. REQUIRES   @LPA 13712200
.*                                           OS390 R5 OR HIGHER.   @LPA 13712300
         DC    X'A291367444'    913-74  162  USS - security        @PWA 13712500
         DC    C'50'                         violation             @PWA 13712800
*                                                                  @PWA 13712900
         DC    X'A321361734'    213-17  163  LARGE DS VIOLATION    @LXA 13713000
.*                                         BLOCKTOKENSIZE=REQUIRE  @LXA 13713100
         DC    C'43'                                               @LXA 13713200
.*                                                                      13713300
         DC    X'A42136EA34'    213-EA  164  CMP - DICTONARY VOL   @63A 13713400
.*                                         NOT AVAILABLE           @63A 13713500
         DC    C'43'                                               @63A 13713600
.*                                                                      13713700
         DC    X'A521365634'    213-56  165  READ-ONLY VOLUME -   @L20A 13713800
         DC    C'43'                       DCBETRKLOCK OPTION ON  @L20A 13713900
.*                                         CONCURRENTRW PARAMETER @L20A 13714000
.*                                         NOT SPECIFIED          @L20A 13714100
.*                                                                @L21A 13714200
         DC    X'A621368134'    213-81  166 Bypassing decryption  @L21A 13714300
         DC    C'43'                        or encryption for an  @L21A 13714400
.*                                          encrypted data set    @L21A 13714500
.*                                          is requested via the  @L21A 13714600
.*                                          UDA, however either   @L21A 13714700
.*                                          the data set is open  @L21A 13714800
.*                                          for update or the data@L21A 13714900
.*                                          set is compressed     @L21A 13715000
.*                                          format but UDACI is   @L21A 13715100
.*                                          not specified.        @L21A 13715200
.*                                                                @L21A 13715300
         DC    X'A721368234'    213-82  167 BSAM CI mode          @L21A 13715400
         DC    C'43'                        processing is         @L21A 13715500
.*                                          requested via the UDA,@L21A 13715600
.*                                          however it is not     @L21A 13715700
.*                                          supported for a zEDC  @L21A 13715800
.*                                          compressed data set.  @L21A 13715900
.*                                                                @L21A 13716200
         DC    X'A821368334'    213-83  168 The data set is an    @L21A 13716300
         DC    C'43'                        encrypted data set    @L21A 13716400
.*                                          (DS1ENCRP=on) however @L21A 13716500
.*                                          a key label does not  @L21A 13716600
.*                                          exist for the data set@L21A 13716700
.*                                                                @L21A 13716800
         DC    X'A991368434'    913-84  169 An error encountered  @L21A 13716900
         DC    C'50'                        from a SAF service    @L21A 13717000
.*                                          called to check       @L21A 13717100
.*                                          authority to the data @L21A 13717200
.*                                          set key label.        @L21A 13717300
.*                                                                @L21A 13717400
         DC    X'AA21368534'    213-85  170 An error encountered  @L21A 13717500
         DC    C'43'                        from an ICSF service  @L21A 13717600
.*                                          called to process the @L21A 13717700
.*                                          key label of an       @L21A 13717800
.*                                          encrypted data set.   @L21A 13717900
.*                                                                @L21A 13718000
         DC    X'AB21368634'    213-86  171 During open processing@L21A 13718100
         DC    C'43'                        for an encrypted      @L21A 13718200
.*                                          extended format       @L21A 13718300
.*                                          sequential data set,  @L21A 13718400
.*                                          the system determined @L21A 13718500
.*                                          that the encryption   @L21A 13718600
.*                                          type of the data key  @L21A 13718700
.*                                          in the CKDS associated@L21A 13718800
.*                                          with the key label for@L21A 13718900
.*                                          the data set is not   @L21A 13719000
.*                                          supported. Only data  @L21A 13719100
.*                                          keys of encryption    @L21A 13719200
.*                                          type AES-256 are      @L21A 13719300
.*                                          supported.            @L21A 13719400
         DC    X'AC21368734'    213-87  172 During open processing@L21A 13719500
         DC    C'43'                        for an encrypted      @L21A 13719600
.*                                          extended format data  @L21A 13719700
.*                                          set, an unexpected    @L21A 13719800
.*                                          error was received    @L21A 13719900
.*                                          from the BCFXCRYP     @L21A 13720000
.*                                          service used to       @L21A 13720100
.*                                          prepare for encryption@L21A 13720200
.*                                          processing for this   @L21A 13720300
.*                                          data set.             @L21A 13720400
         DC    X'AD21368934'    213-89  173 An attempt was made to@L21A 13720500
         DC    C'43'                        open a new encrypted  @L21A 13720600
.*                                          non-compressed        @L21A 13720700
.*                                          extended format       @L21A 13720800
.*                                          sequential data set   @L21A 13720900
.*                                          for output with QSAM  @L21A 13721000
.*                                          using a BLKSIZE less  @L21A 13721100
.*                                          than 16 bytes.        @L21A 13721200
.*                                          However, the minimum  @L21A 13721300
.*                                          blocksize supported   @L21A 13721400
.*                                          for encrypted         @L21A 13721500
.*                                          non-compressed        @L21A 13721600
.*                                          extended format       @L21A 13721700
.*                                          sequential data sets  @L21A 13721800
.*                                          is 16 bytes.          @L21A 13721900
.*                                                                    * 13722000
         DC    X'AE21369134'    213-91  174 During open processing@L21A 13722200
         DC    C'43'                        for an encrypted      @L21A 13722300
.*                                          extended format data  @L21A 13722400
.*                                          set, system determined@L21A 13722500
.*                                          that the data key in  @L21A 13722600
.*                                          the CKDS associated   @L21A 13722700
.*                                          with the key label for@L21A 13722800
.*                                          the data set is not   @L21A 13722900
.*                                          the same data key used@L21A 13723000
.*                                          to encrypt the dataset@L21A 13723100
.*                                                                    * 13723200
         DC    X'AE0136DC34'    013-DC  175 DEBCHK issued a       @L22A 13723400
         DC    C'41'                        non-zero return code. @L22A 13724000
.*                                                                    * 13724100
         DC    X'B021369334'    213-93  176 INVALID PARM LIST     @L23A 13724200
         DC    C'43'                        PASSED TO IGGENCAM.   @L23A 13724300
.*                                                                    * 13724400
         DC    X'B121369534'    213-95  177 IGGENCAM DETECTED A   @L23A 13724500
         DC    C'43'                        FAULTY ENCRYPT CELL.  @L23A 13724600
.*                                                                    * 13724700
         DC    X'B221369634'    213-96  178 Error obtaining       @L23A 13724800
         DC    C'43'                        ENCRYPTION STORAGE.   @L23A 13724900
.*                                                                    * 13725000
         DC    X'B321369734'    213-97  179 PAGEFIX ERROR IN      @L23A 13725100
         DC    C'43'                        IARV64 DURING         @L23A 13725200
.*                                          ENCRYPTION PROCESSING @L23A 13725300
.*                                                                    * 13725400
         DC    X'B421369934'    213-99  180 UNSUPPORTED OPERATION @L23A 13725500
         DC    C'43'                        ENCOUNTERED DURING    @L23A 13725600
.*                                          ENCRYPTION PROCESSING @L23A 13725700
         DC    X'B521369A34'    213-9A  181 DCBE DSENCRYPT=OK NOT @L23A 13725800
         DC    C'43'                        SPECIFIED FOR EXCPDCB @L23A 13725900
.*                                          ASSOC W/ ENCRYPTED DS @L23A 13726000
         DC    X'B621369B34'    213-9B  182 AN ARCHIVED KEY WAS    @80A         
         DC    C'43'                        USED FOR AN ENCRYPTED  @80A         
.*                                          DATA SET NOT OPENED    @80A         
.*                                          FOR INPUT              @80A         
.*                                                                    * 13726100
.*****               183 THROUGH 202 ARE AVAILABLE - SEE GENOP     @80C 13726200
.*                                                                    * 13726300
         DC    X'CB2136E934'    213-E9  203  FAIL IF PS DATA SET   @PQA 13726400
         DC    C'43'                         FOUND IN PO CONCAT    @PQA 13726500
.*                                                                    * 13726600
         DC    X'CC2136E234'    213-E2  204  CMP - ERROR READING   @PPA 13726700
         DC    C'43'                         TAILORED DICTIONARY   @PPA 13726800
.*                                           IN IGG019VT (002-E2)  @PPA 13726900
.*                                                                    * 13727000
         DC    X'CD2136E334'    213-E3  205  CMP - INVALID TAILORED@PPA 13727100
         DC    C'43'                         TOKEN DETECTED        @PPA 13727200
.*                                           BY IGG019VT (002-E3)  @PPA 13727300
.*                                                                    * 13727400
         DC    X'CE2136E534'    213-E5  206  CMP - INVALID TAILORED@PPA 13727500
         DC    C'43'                         DICTIONARY DETECTED   @PPA 13727600
.*                                           BY IGG019VT (002-E5)  @PPA 13727700
.*                                                                    * 13727800
         DC    X'CF2136E634'    213-E6  207  CMP - ERROR VALIDATING@PPA 13727900
         DC    C'43'                         TAILORED DICTIONARY   @PPA 13728000
.*                                           IN IGG019VT (002-E6)  @PPA 13728100
.*                                                                    * 13728200
         DC    X'D02136E734'    213-E7  208  CMP - UNEXPECTED ERROR@PPA 13728300
         DC    C'43'                         FROM IGG019VT         @PPA 13728400
.*                                                                    * 13728500
         DC    X'D121363434'    213-34  209  CMP - FAIL OPEN OF DS @52A 13728600
         DC    C'43'                         WITH TAILORED DICT    @52A 13728700
.*                                           OR SKIPPED CIs        @52A 13728800
.*                                           ON DOWN LEVEL SYSTEM  @52A 13728900
.*                                                                    * 13729000
.* DO NOT USE INTERNAL CODE 210 AND 213-80...THEY WILL BE USED     @LFM 13729100
.* FOR PDSE TOLERATION IN EARLIER RELEASES                         @LFM 13729200
.*                                                                    * 13729300
         DC    X'D302060428'    020-04  211                      Y02144 13729400
         DC    C'38'                                             Y02144 13729500
         DC    X'D402060834'    020-08  212                      Y02144 13729600
         DC    C'38'                                             Y02144 13729700
         DC    X'D502060C34'    020-0C  213   GT 255 BDAM EXTENTS  @60A 13729800
         DC    C'38'                                               @60A 13729900
.*                                                                    * 13730000
.*****               214 THROUGH 220 ARE AVAILABLE - SEE GENOP    *@60C 13730100
.*                                                                    * 13730200
         DC    X'DD0136B028'    013-B0  221                     SA49404 13730300
         DC    C'41'                                            SA49404 13730400
         DC    X'DE0136B428'    013-B4  222                     SA51107 13730500
         DC    C'41'                                            SA51107 13730600
         DC    X'DF0134B828'    013-B8  223                     YL03123 13730700
         DC    C'41'                                            YL03123 13730800
.*                                                                    * 13730900
.*****               224 THROUGH 225 ARE AVAILABLE - SEE GENOP    ***** 13731000
.*                                                                    * 13731100
         DC    X'E20136BC00'    013-BC  226                      Y02144 13731200
         DC    C'41'                                             Y02144 13731300
         DC    X'E30134C000'    013-C0  227                      Y02144 13731400
         DC    C'41'                                             Y02144 13731500
.*       DC    X'E400000000'            228  AVAILABLE - SEE GENOP    * 13731600
.*       DC    C'  '                                                  * 13731700
         DC    X'E50136C428'    013-C4  229                      Y02072 13731800
         DC    C'41'                                             Y02072 13731900
.*                                                                    * 13735100
.*****               230 THROUGH 240 ARE AVAILABLE - SEE GENOP    @74A* 13735200
.*                                                                    * 13735300
         DC    X'F12136F134'    213-F1  241 INVALID OPEN OF A     @74A* 13735400
         DC    C'43'                        zEDC COMPRESSED D/S   @74A* 13735500
.*                                          DURING TASK TERMINATE @74A* 13735600
.*                                                                    * 13735700
.*****               242 THROUGH 250 ARE AVAILABLE - SEE GENOP    @74C* 13735800
.*                                                                    * 13746300
         DC    X'FB2136FA34'    213-FA  251 INVAL VVRNCISZ IN CATL@71A* 13746400
         DC    C'43'                                              @71A* 13746500
         DC    X'FC0134C844'    013-C8  252                      YM1195 13749400
         DC    C'41'                                             YM1195 13752500
         DC    X'FD2136FB34'    213-FB  253 INVAL VVRNCISZ DERIVED@71C* 13787400
         DC    C'43'                                              @71C* 13822300
         DC    X'FE2136FE34'    213-FE  254 UNEXP ERROR FROM ZEDC @69C* 13877100
         DC    C'43'                                              @69C* 13897100
         DC    X'FF2136FF34'    213-FF  255 UNEXP ERROR IGG019VA  @69C* 13917100
         DC    C'43'                                              @69C* 13937100
         DC    X'00'                    END OF TABLE MARKER             13997000
.GNOPEND ANOP                                                           13997300
*                                                                     * 13997600
*        XCTLTABL ID=(NEXTMOD,IFG0199B,LASTLOAD,IFG0198N),       YM1447 13998000
*              BRT=YES,LENGTH=                                   Y02080 13998500
         XCTLTABL ID=(NEXTMOD,IFG0199B,LASTLOAD,IFG0198N),       YM1447X13998900
               BRT=YES,LENGTH=                                   Y02080 13999500
         AGO   .GENDSCT                                                 13999900
.GENCL   ANOP **** CLOSE ****                                           14007400
         DC    X'0101410400'    014-04  01                     @ZA30860 14015000
         DC    C'08'                                           @ZA30860 14030000
         DC    X'0221460C04'    214-0C  02 ERROR READING BLKID     @L4A 14033100
         DC    C'10'                                                    14036200
         DC    X'03214E1028'    214-10  03 BLOCKID/DCB MISMATCH    @L4A 14039300
         DC    C'10'                                                    14042400
         DC    X'04214E1428'    214-14  04 AL DS EXCEEDS 1 MILLION @25A 14045500
         DC    C'10'                                                    14048600
.*                                                                    * 14051700
.*****                05 THROUGH 60 ARE AVAILABLE                  @LBC 14054800
.*                                                                    * 14057900
         DC    X'3D71460404'    714-04  61                              14059700
         DC    C'15'                                                    14061500
         DC    X'3E71460C04'    714-0C  62                              14062000
         DC    C'15'                                                    14062500
         DC    X'3F71460804'    714-08  63                              14063000
         DC    C'15'                                                    14063500
         DC    X'4021460404'    214-04  64                              14064000
         DC    C'10'                                                    14064500
         DC    X'4121460804'    214-08  65                              14065000
         DC    C'10'                                                    14065500
         DC    X'4241460C34'    414-0C  66 DEBCHK issued a non-   @L22A 14065600
         DC    C'12'                       zero return code       @L22A 14065700
         DC    X'4341461034'    414-10  67 DEBCHK determined that @L22A 14065800
         DC    C'12'                       a LOCK=EXCL was already@L22A 14065900
.*                                         held; a concurent      @L22A 14066000
.*                                         process was using the  @L22A 14067000
.*                                         DCB/ACB which was being@L22A 14068000
.*                                         closed                 @L22A 14069000
.*                                                                    * 14070600
.*****                68 THROUGH 85 ARE AVAILABLE                 @L22C 14075700
.*                                                                    * 14080800
         DC    X'5631460404'    314-04  86                              14083600
         DC    C'11'                                                    14086500
         DC    X'57A1460404'    A14-04  87                              14087000
         DC    C'16'                                                    14087500
         DC    X'5841460404'    414-04  88                              14088000
         DC    C'12'                                                    14088500
         DC    X'5931460804'    314-08  89                              14089000
         DC    C'11'                                                    14089500
         DC    X'5A61460404'    614-04  90                              14090000
         DC    C'14'                                                    14090500
         DC    X'5B41460804'    414-08  91 QSAM BUFFER FLUSH ERROR @27C 14092000
         DC    C'12'                                               @17A 14093500
.*                                                                    * 14095000
         DC    X'5C61402034'    614-20  92    STRIPE - ERROR FROM  @LGA 14096500
         DC    C'14'                          RBNCNVT DETECTED BY  @LGA 14098000
.*                                            IGG0201V             @LGA 14099500
.*                                                                    * 14103200
         DC    X'5D61402434'    614-24  93    STRIPE - ERROR       @LGA 14103600
         DC    C'14'                          WRITING EOF DETECTED @LGA 14104000
.*                                            BY IGG0201V          @LGA 14105500
         DC    X'5E31460C04'    314-0C  94 FAILURE READING DSCB    @34A 14105800
         DC    C'11'                       FOR ATTR XTNSION D/S    @34A 14106100
         DC    X'5F61402834'    614-28  95 CATALOG FAILURE FOR     @34A 14106400
         DC    C'14'                       ATTR XTNSION D/S        @34A 14106700
         DC    X'606146501C'    614-50  96 BPAM USS ACB BUT NO     @LUD 14106900
         DC    C'14'                       USS DIRECTORY FOUND     @LUD 14107100
.*                                                                3@LUD 14107300
         DC    X'6161403034'    614-30  97 CMP - INVALID STATS IN  @LJA 14107600
         DC    C'14'                       EFC IN CATALOG          @LJA 14107900
.*                                                                 @LJA 14108100
         DC    X'6261403434'    614-34  98 CMP - UNABLE TO UPDATE  @LJA 14108300
         DC    C'14'                       EFC IN CATALOG          @LJA 14108500
.*                                                                 @LJA 14108600
         DC    X'6361423834'    614-38  99 CMP - ERROR PROCESSING  @76C 14108700
         DC    C'14'                       TAILORED TOKEN/DICT WHEN@LOA 14108800
.*                                         19VT CALLED FROM 201V   @LOA 14108900
         DC    X'6461423C34'    614-3C 100 CMP - ERROR COMPRESSING @76C 14109000
         DC    C'14'                       SAMPLING DATA WHEN 19VT @LOA 14109100
.*                                         CALLED FROM 201V        @LOA 14109200
         DC    X'6561424034'    614-40 101 CMP - UNEXPECTED ERROR  @76C 14109300
         DC    C'14'                       FROM 19VT WHEN CALLED   @LOA 14109400
.*                                         FROM 201V               @LOA 14109500
.*                                                                    * 14109600
         DC    X'6661424434'    614-44 102 CMP - EXISTING TOKEN    @76C 14109700
         DC    C'14'                       FOUND IN THE EFC CALLED @POA 14109800
.*                                         FROM 201V               @POA 14109900
.*                                                                 @LPA 14110000
         DC    X'6761444840'    614-48 103 ANSI V4 - DATACONV      @LPA 14110100
         DC    C'14'                       CLOSE ERROR (INPUT)     @LPA 14110200
.*                                                                 @LPA 14110300
         DC    X'6861444C40'    614-4C 104 ANSI V4 - DATACONV      @LPA 14110400
         DC    C'14'                       CLOSE ERROR (OUTPUT)    @LPA 14110500
.*                                                                 @LPA 14110600
         DC    X'6921421844'    214-18 105   TAPE INSTALL EXIT     @LSA 14110700
         DC    C'10'                         INVALID RETURN CODE   @LSA 14110800
         DC    X'6A31421028'    314-10 106 TAPE ENCRYPT IO ERROR   @LZA 14110900
         DC    C'11'                                               @LZA 14111000
         DC    X'6B61465434'    614-54 107                         @62A 14111100
         DC    C'14'                                               @62A 14111200
         DC    X'6C21461C0C'    214-1C 108  AUTOMATED TAPE LIBR.  @L14A 14111300
         DC    C'10'                                              @L14A 14111400
         DC    X'6D21422028'    214-20 109  WORM WRITE VIOLATION   @M1A 14111900
         DC    C'10'                                               @M1A 14112000
         DC    X'6E21422428'    214-24  110                        @67A 14112100
         DC    C'10'                                               @67A 14112200
.*                                                                 @M1A 14112300
.*****               111 IS AVAILABLE                              @67C 14112400
.*                                                                 @M1A 14112500
         DC    X'7000000000'            112 ACB DEB NOT SAME AS DCB@47C 14112600
         DC    C'23'                        DEB FOR SPOOLED D/S    @47C 14112700
         DC    X'7100000400'            113 CLOSE INITIALIZATION   @47A 14112800
         DC    C'23'                        FAILURE                @47A 14112900
         DC    X'7200000800'            114 DEBCHK FAILURE FOR     @47A 14113000
         DC    C'23'                        SPOOLED DCB DEB        @47A 14113100
         DC    X'7300000C00'            115 DEBCHK FAILURE FOR     @47A 14113500
         DC    C'23'                        CHECKPOINT D/S DEB     @47A 14114000
         DC    X'7400001000'            116 CLOSE INITIALIZATION   @47A 14114500
         DC    C'23'                        FAILURE FOR CHKPT D/S  @47A 14115000
         DC    X'7500001400'            117 DCBLOCK, BUSY AND      @47A 14115500
         DC    C'23'                        OPEN FLGS NOT ON       @47A 14116000
         DC    X'7600001800'            118 INVALID ACB            @47A 14116500
         DC    C'23'                                               @47A 14117000
         DC    X'7700001C00'            119 INVALID VTAM ACB       @47A 14117500
         DC    C'23'                                               @47A 14118000
         DC    X'7800002000'            120 DCB/ACB DEB NOT ON     @47A 14118500
         DC    C'23'                        TCB DEB CHAIN          @47A 14119000
         DC    X'79B1400400'    B14-04  121                             14120200
         DC    C'17'                                                    14121500
         DC    X'7AB1400800'    B14-08  122                             14122000
         DC    C'17'                                                    14122500
         DC    X'7BB1400C00'    B14-0C  123                             14123000
         DC    C'17'                                                    14123500
         DC    X'7CB1401000'    B14-10  124                             14124000
         DC    C'17'                                                    14124500
         DC    X'7DB1401400'    B14-14  125                      YM7854 14125000
         DC    C'17'                                             YM7854 14125500
         DC    X'7EB1401800'    B14-18  126                      YM7854 14126000
         DC    C'17'                                             YM7854 14126500
         DC    X'7FB1401C00'    B14-1C  127   STOW FAILED WHEN     @PEA 14131800
         DC    C'17'                          CREATING EMPTY DATA  @PEA 14137100
.*                                            MEMBER SINCE PDSE    @PEA 14142400
.*                                            WAS ALREADY DEFINED  @PEA 14147700
.*                                            AS LOAD MODULE LIB   @PEA 14153000
.*                                                                    * 14158300
.*****             128 RESERVED FOR STOW RC=20                     @PEC 14163600
.*                                                                    * 14168900
         DC    X'81B1402400'    B14-24  129   TRR SUPPLIED--MEMBER @LBA 14174200
         DC    C'17'                          IS NOT A VALID MLT   @LBA 14179500
         DC    X'8200000000'            130   RESERVED FOR STOW    @PEC 14184800
         DC    C'  '                          RC=28                @PEC 14190100
         DC    X'83B1402C00'    B14-2C  131   ERROR OCCURED AS     @LBA 14195400
         DC    C'17'                          RESULT OF JCDM CALL  @LBA 14200700
         DC    X'84B1403000'    B14-30  132   INCONSISTENT INPUT   @LBA 14206000
         DC    C'17'                          PARM PASSED TO STOW  @LBA 14211300
         DC    X'8500002400'            133   SPOOLED DCB DEB      @47A 14222700
         DC    C'23'                          DOESN'T PT TO USER   @47A 14223500
.*                                            DCB                  @47A 14224300
         DC    X'8600002800'            134   DEBCHK FAILURE FOR   @47A 14225100
         DC    C'23'                          USERS DCB DEB        @47A 14225900
.*                                                                    * 14226000
         DC    X'8741401434'    414-14  135   DBCHK UNLOCKDELETE   @78A 14226100
         DC    C'12'                          FAILED.              @78A 14226200
.*                                                                 @78A 14226300
.*****               136 THROUGH 233 ARE AVAILABLE                 @78C 14226400
         DC    X'EA61460828'    614-08  234                      Y02082 14232500
         DC    C'14'                                             Y02082 14234500
.*                                                                    * 14238300
.*****               235 THROUGH 246 ARE AVAILABLE                *@70C 14243200
.*                                                                    * 14243400
         DC    X'F761406034'    614-60  247   zEDC - FPZ4ABC in    @70A 14243600
         DC    C'14'                          progress at close    @70A 14243800
         DC    X'F861406434'    614-64  248   zEDC - Error from    @70A 14244000
         DC    C'14'                          FPZ4DMR              @70A 14244200
         DC    X'F961405834'    614-58  249   ATTEMPT TO GET       @70C 14244400
         DC    C'14'                          SAQ_AUTO19VX_USE FAIL@69A 14244600
         DC    X'FA61405C34'    614-5C  250   UNEXP ERROR FROM     @69A 14244800
         DC    C'14'                          IGG019VX             @69A 14244900
.*                                                                    * 14245900
.*       031-04 DELETED BECAUSE ISAM NO LONGER SUPPORTED         2@L19D 14249100
.*                                                                    * 14250700
         DC    X'FB61401834'    614-18  251   ERROR RETURN FROM    @LCA 14250900
         DC    C'14'                          PGM MGT CLOSE EXIT   @LCA 14251100
*                                             DETECTED BY IGG0201S @LCA 14251300
.*                                                                    * 14251500
         DC    X'FC61401C34'    614-1C  252   ERROR RETURN FROM    @LCA 14251700
         DC    C'14'                          DESERV CLOSE EXIT    @LCA 14251900
*                                             DETECTED BY IGG0201S @LCA 14252100
.*                                                                    * 14252300
         DC    X'FD'                    253 - INTERNAL ABEND CODE  @H1A 14252500
         DC    X'6144'          614-10        SYSTEM ABEND 614     @H1A&14252700
                                              IGNORE OK            @H1A 14252900
         DC    X'10'                          RET CODE IN REG. 15  @H1A 14253100
         DC    X'44'                          TRACE CODE-DCB       @H1A&14253300
                                              ... JFCBDSNM         @H1A 14253500
         DC    C'14'                          MESSAGE IEC214I      @H1A 14253700
         DC    X'FE61440C44'    614-0C  254                      YM1195 14254100
         DC    C'14'                                           @ZA08863 14254500
         DC    X'FF61401434'    614-14  255  CALL TO JCDM FAILED   @LBC 14304500
         DC    C'14'                                               @LBC 14354500
         DC    X'00'                    END OF TABLE MARKER             14997000
*                                                                     * 14997500
*        XCTLTABL ID=(NEXTMOD,IFG0209B,LASTLOAD,IFG0202L),       YM1447 14998000
*              BRT=YES,LENGTH=                                   Y02080 14998500
         XCTLTABL ID=(NEXTMOD,IFG0209B,LASTLOAD,IFG0202L),       YM1447X14998900
               BRT=YES,LENGTH=                                   Y02080 14999500
         AGO   .GENDSCT                                                 14999900
.GENTC   ANOP **** CLOSE TYPE=T ****                                    15049900
         DC    X'7A71760404'    717-04  122                             17050000
         DC    C'22'                                                    17122500
*                                                                2@L12D 17123200
         DC    X'7C71760804'    717-08  124                             17124000
         DC    C'22'                                                    17124500
*                                                                2@L12D 17125200
         DC    X'7E71760C04'    717-0C  126                             17126000
         DC    C'22'                                                    17126500
         DC    X'7F11761004'    117-10  127                             17127000
         DC    C'18'                                                    17127500
*                                                                2@L12D 17128200
         DC    X'8111761804'    117-18  129                             17129000
         DC    C'18'                                                    17129500
         DC    X'8211761C04'    117-1C  130                             17130000
         DC    C'18'                                                    17130500
         DC    X'8311760404'    117-04  131                             17131000
         DC    C'18'                                                    17131500
         DC    X'8431760404'    317-04  132                             17132000
         DC    C'20'                                                    17132500
         DC    X'8541760404'    417-04  133                             17133000
         DC    C'21'                                                    17133500
         DC    X'8611762004'    117-20  134                             17134000
         DC    C'18'                                                    17134500
         DC    X'8711762404'    117-24  135                             17135000
         DC    C'18'                                                    17135500
         DC    X'8811762804'    117-28  136                             17136000
         DC    C'18'                                                    17136500
         DC    X'8911761404'    117-14  137                             17137000
         DC    C'18'                                                    17137500
         DC    X'8A717E1004'    717-10  138                             17138000
         DC    C'22'                                                    17138500
         DC    X'8B11760804'    117-08  139                             17139000
         DC    C'18'                                                    17139500
         DC    X'8C11762C04'    117-2C  140                             17140000
         DC    C'18'                                                    17140500
         DC    X'8D1176300C'    117-30  141                             17141000
         DC    C'18'                                                    17141500
         DC    X'8E00000034'            142                     SA48558 17142000
         DC    C'25'                                            SA48558 17142500
         DC    X'8F00000434'            143                     SA48558 17143000
         DC    C'25'                                            SA48558 17143500
         DC    X'9000000834'            144                     SA48558 17144000
         DC    C'25'                                            SA48558 17144500
         DC    X'9100000C34'            145                     SA48558 17145000
         DC    C'25'                                            SA48558 17145500
         DC    X'9211724844'    117-48  146  TAPE INSTALL EXIT     @LSA 17145900
         DC    C'18'                         INVALID RETURN CODE   @LSA 17146300
.*                                                                    * 17146800
.*****               146 THROUGH 150 ARE AVAILABLE                ***** 17148100
.*                                                                    * 17149400
         DC    X'9700001034'            151                     SA58019 17151000
         DC    C'25'                                            SA58019 17151500
.*                                                                    * 17196000
.*****               152 THROUGH 232 ARE AVAILABLE                ***** 17240500
.*                                                                    * 17285000
         DC    X'E911763428'    117-34  233 DCBFDAD 'M' INVALID  Y02082 17329500
         DC    C'18'                        ABEND117-34          Y02082 17374000
         DC    X'EA11763804'    117-38  234 ERROR READING BLKID    @L4A 17418500
         DC    C'18'                                                    17463000
         DC    X'EB117E3C28'    117-3C  235 BLOCKID/DCB MISMATCH   @L4A 17507500
         DC    C'18'                                                    17552000
         DC    X'EC11764004'    117-40  236 DCBFDAD 'R' INVALID    @06A 17596500
         DC    C'18'                        ABEND117-40            @06A 17641000
         DC    X'ED117E4428'    117-44  237 AL DS EXCEEDS 1 MILLION@25A 17685500
         DC    C'18'                                                    17730000
         DC    X'EE117E4828'    117-48  238 XSAM-SUBSYSTEM NOT     @LMA 17738900
         DC    C'18'                         OPERATING             @LMA 17747800
         DC    X'EF117E4C28'    117-4C  239 XSAM-ERROR DURING      @LMA 17756700
         DC    C'18'                         BUFFER FLUSHING       @LMA 17765600
.*                                                                    * 17774500
.*****               240 THROUGH 254 ARE AVAILABLE                *@LMC 17819000
.*                                                                    * 17863500
         DC    X'FF00000000'            255 AVAILABLE                 * 17908000
         DC    C'  '                                                  * 17952500
         DC    X'00'                    END OF TABLE MARKER             17997000
*                                                                     * 17997500
*        XCTLTABL ID=(NEXTMOD,IFG0239B,LASTLOAD,IFG0232Z),       YM1447 17998000
*              BRT=YES,LENGTH=                                   Y02080 17998500
         XCTLTABL ID=(NEXTMOD,IFG0239B,LASTLOAD,IFG0232Z),       YM1447X17998900
               BRT=YES,LENGTH=                                   Y02080 17999500
         AGO   .GENDSCT                                                 17999900
.GENEOV  ANOP **** EOV ****                                             18049900
         DC    X'0193702800'    937-28  1  RACF REJECT         @Z40RSDS 37001000
         DC    C'29'                                           @Z40RSDS 37002000
         DC    X'0293702C00'    937-2C  2                      @Z40RSDS 37003000
         DC    C'29'                                           @Z40RSDS 37004000
         DC    X'0393703018'    937-30  3                      @Z40RSDS 37005000
         DC    C'29'                                           @Z40RSDS 37006000
         DC    X'0493703418'    937-34  4                      @Z40RSDS 37007000
         DC    C'29'                                           @Z40RSDS 37008000
         DC    X'0593703800'    937-38  5                      @Z40RSDS 37009000
         DC    C'29'                                           @Z40RSDS 37010000
         DC    X'0693703C00'    937-3C  6                      @Z40RSDS 37011000
         DC    C'29'                                           @Z40RSDS 37012000
         DC    X'0793704000'    937-40  7                      @G32DSMI 37013000
         DC    C'29'                                           @G32DSMI 37014000
         DC    X'0893744410'    937-44  8                          @10C 37015700
         DC    C'29'                                               @L2A 37017400
         DC    X'0963729044'    637-90  9    TAPE INSTALL EXIT     @LSA 37017900
         DC    C'26'                         INVALID RETURN CODE   @LSA 37018400
         DC    X'0A637CA404'    637-A4 10    32BIT BLOCKID MODESET @LTA 37018600
         DC    C'26'                         CCW FAILED            @LTA 37018800
         DC    X'0B6372A828'    637-A8 11    WORM WRITE VIOLATION  @LYA 37019300
         DC    C'26'                                               @LYA 37019800
         DC    X'0C6372AC28'    637-AC 12    WORM PROCESS VIOLATION@LYA 37020300
         DC    C'26'                                               @LYA 37020800
         DC    X'0D6372B028'    637-B0 13    TAPE ENCRYPT IO ERROR @LZA 37020900
         DC    C'26'                                               @LZA 37021000
         DC    X'0E637CB40C'    637-B4 14    TP MULTIVL OUT SEQ   @L14A 37021200
         DC    C'26'                                              @L14A 37021400
         DC    X'0F637CB80C'    637-B8 15    TP RD FWD MISS LAST  @L14A 37021600
         DC    C'26'                                              @L14A 37021800
         DC    X'106374BC0C'    637-BC 16    DA RD FWD MISS LAST   @65C 37021900
         DC    C'26'                                              @L16A 37022000
         DC    X'116374C00C'    637-C0 17                          @M4A 37022300
         DC    C'26'                                               @M4A 37022600
         DC    X'126374C40C'    637-C4 18                          @67A 37022700
         DC    C'26'                                               @67A 37022800
.*                                                                    * 37022900
.*****                19 THRU 21 ARE AVAILABLE                    @L22C 37023200
.*                                                                    * 37023500
         DC    X'1693704800'    937-48  22  PASSWORD ERROR         @L8A 37024200
         DC    C'29'                                               @L8A 37025900
         DC    X'1713743804'    137-38  23  ERROR READING BLKID    @39C 37027600
         DC    C'22'                                                    37029300
         DC    X'18237C0C28'    237-0C  24  BLOCKID/DCB MISMATCH   @39C 37031000
         DC    C'23'                                                    37032700
         DC    X'1913743010'    137-30  25  ANSI LABEL STANDARDS   @39C 37034400
         DC    C'22'                        VIOLATION              @L3C 37036100
         DC    X'1A237C1028'    237-10  26  AL DS EXCEEDS 1 MILLION@39C 37037800
         DC    C'23'                                                    37039500
         DC    X'1B137C3C0C'    137-3C  27  ATL ABEND              @39C 37041200
         DC    C'22'                                               @53C 37042900
         DC    X'1C237C2040'    237-20  28  LBI REQUIRED BUT NOT   @LQA 37044600
         DC    C'23'                        SPECIFIED              @LQA 37046300
.*                                                                3@LQD 37048000
         DC    X'1D13742810'    137-28  29  OPERATOR REJECT LABEL  @39C 37049700
         DC    C'22'                        REWRITE                @L3A 37051400
         DC    X'1E73744434'    737-44  30  LARGE DS VIOLATION     @LXA 37051900
.*                                        BLOCKTOKENSIZE=NOREQUIRE @LXA 37052000
         DC    C'27'                                               @LXA 37052100
         DC    X'1F73744534'    737-45  31  LARGE DS VIOLATION     @LXA 37052200
.*                                          BLOCKTOKENSIZE=REQUIRE @LXA 37052300
         DC    C'27'                                               @LXA 37052400
.*                                                                    * 37053200
         DC    X'2073704800'    737-48  32  FEOV COMP V2 OUTPUT   @P11A 37054000
         DC    C'27'                                              @P11A 37055000
.*                                                                    * 37056000
         DC    X'2113742C10'    137-2C  33  ANSI INCOMPATIBLE      @39C 37058200
         DC    C'22'                        VERSION CONFLICT       @L3A 37059900
.*                                                                    * 37061600
.*****                34 THROUGH 47 ARE AVAILABLE                 *@31C 37063300
.*                                                                    * 37065000
         DC    X'3011303834'    113-38  48                         @39C 37066700
         DC    C'42'                                               @31A 37068400
.*                                                                    * 37070100
.*****                49 THROUGH 53 ARE AVAILABLE                 *@31A 37071800
.*                                                                    * 37073500
         DC    X'3611302030'    113-20  54                         @39C 37075200
         DC    C'42'                                               @26A 37076900
         DC    X'371130244C'    113-24  55                         @39C 37078600
         DC    C'42'                                               @26A 37080300
         DC    X'3811302808'    113-28  56                         @39C 37082000
         DC    C'42'                                               @26A 37083700
         DC    X'3911302C28'    113-2C  57                         @39C 37085400
         DC    C'42'                                               @26A 37087100
.*                                                                    * 37088800
         DC    X'3A00204028'    002-40  58   ANSI V4 - INVALID     @LPA 37088900
         DC    C'36'                         SDC PASSED TO 19TQ    @LPA 37089000
.*                                                                 @LPA 37089100
         DC    X'3B00204128'    002-41  59   ANSI V4 - USER KEY    @LPA 37089200
         DC    C'36'                         DOES NOT MATCH TCB KEY@LPA 37089300
.*                                                                 @LPA 37089400
         DC    X'3C00204228'    002-42  60   ANSI V4 - USER RECORD @LPA 37089500
         DC    C'36'                         TOO LARGE             @LPA 37089600
.*                                                                 @LPA 37089700
         DC    X'3D00204328'    002-43  61   ANSI V4 - DATACONV    @LPA 37089800
         DC    C'36'                         CONVERSION ERROR      @LPA 37089900
.*                                                                 @LPA 37090000
         DC    X'3E00204428'    002-44  62   ANSI V4 - DATACONV    @LPA 37090100
         DC    C'36'                         TOKEN IS ZERO         @LPA 37090200
.*                                                                    * 37090300
         DC    X'3F00204528'    002-45  63   INVALID CONCAT NUMBER @56A 37090400
         DC    C'36'                         FOUND WHILE PROCESSING@56A 37090500
*                                            NOTE.                 @56A 37090600
         DC    X'4000205128'    002-51  64   INVALID AUTODATA      @LZA 37090700
         DC    C'36'                         AREA                  @LZA 37090800
         DC    X'410020EE28'    002-EE  65   READ OR WRITE MACRO  @L10A 37090900
         DC    C'36'                         CODED WITH SF64 BUT  @L10A 37091000
*                                            DATASET IS COMPRESSED @PYC 37091100
*                                            FORMAT OR IS NOT      @PYC 37091200
*                                            EXTENDED FORMAT       @PYC 37091300
         DC    X'420020DE28'    002-DE  66   ERROR OCCURRED WHEN  @L11A 37091400
         DC    C'36'                         IARV64 MACRO DID     @L11A 37091500
*                                            PAGE FIXING OR       @L11A 37091600
*                                            UNFIXING             @L11A 37091700
         DC    X'4300204634'    002-46  67   ERROR RETURNED FROM  @L23A 37091800
         DC    C'36'                         ENCRYPTION COMMON    @L23A 37091900
*                                            ROUTINE (IGGENCAM).  @L23A 37092000
         DC    X'4400204734'    002-47  68   ERROR RETURNED FROM  @L23A 37092100
         DC    C'36'                         ENCRYPTION SERVICE   @L23A 37092200
*                                            BCFXCRYP.            @L23A 37092300
.*                                                                    * 37092400
.*****                69 THROUGH 71  ARE AVAILABLE               *@L23C 37092500
.*                                                                    * 37092600
         DC    X'480020F144'    002-F1  72   LBI - Format U WRITE  @LQA 37092700
         DC    C'36'                         not 'S'               @LQA 37092800
         DC    X'490024BC34'    002-BC  73   CMP - DS not usable   @49A 37092900
         DC    C'36'                         with POINT due to     @49A 37093000
*                                            invalid control info  @49A 37093100
*                                            (MMRURBN). User must  @49A 37093200
*                                            copy ds without POINT.@49A 37093300
*                                                                   *   37093400
         DC    X'4A23741C34'    237-1C  74   STRIPED DATA SET NOT  @39C 37093700
         DC    C'23'                         ON ESCON CHANNEL OR   @46C 37095200
*                                            T0 CONTROL UNIT       @LGA 37096300
.*                                                                    * 37097400
         DC    X'4B0024E434'    002-E4  75   CMP - BAD RC FROM     @39C 37097500
         DC    C'36'                         IGG019VY              @43C 37097600
.*                                                                    * 37097700
         DC    X'4C0024E834'    002-E8  76   CMP - BAD RC FROM     @39C 37097800
         DC    C'36'                         COMPRESSION COMPRESS/ @43C 37097900
.*                                           DECOMPRESS            @LJA 37098000
.*                                                                    * 37098100
         DC    X'4D0024EC34'    002-EC  77   CMP - INVALID CI      @42C 37098200
         DC    C'36'                         DETECTED ON OUTPUT    @43C 37098300
.*                                                                    * 37098400
         DC    X'4E0024F034'    002-F0  78   CMP - CMP RCD FOUND   @39C 37099100
         DC    C'36'                         BUT INVALID DICT TKN  @43C 37099800
         DC    X'4F0024F434'    002-F4  79   STR - BAD RETURN CODE @42A 37100600
         DC    C'36'                         FROM RBNCNVT IN       @43C 37101500
*                                            IGG055V1              @42A 37101900
.*                                                                    * 37102400
         DC    X'500024F834'    002-F8  80   CMP - AUTODATA AREA   @48A 37102700
         DC    C'36'                         SSCB_AUTO19VX_ADR     @48A 37103000
*                                            ALREADY IN USE        @48A 37103300
.*                                                                    * 37103600
         DC    X'510024FC34'    002-FC  81   CMP - AUTODATA AREA   @48A 37103900
         DC    C'36'                         SSCB_AUTO19VX_WQ_ADR  @48A 37104200
*                                            ALREADY IN USE        @48A 37104500
         DC    X'5200202C28'    002-2C  82   USS - POINT TO OTHER  @LLA 37104800
         DC    C'36'                         THAN FIRST BLOCK IN   @LLA 37105100
*                                            BINARY USS RECFM=V OR @LLA 37105300
*                                            U FILE NOT ALLOWED    @LLA 37105500
         DC    X'530024E134'    002-E1  83   CMP - ERROR WRITING   @LOA 37105800
         DC    C'36'                         TAILORED DICTIONARY   @LOA 37105900
*                                            IN IGG019VT           @LOA 37106000
         DC    X'540024E234'    002-E2  84   CMP - ERROR READING   @LOA 37106100
         DC    C'36'                         TAILORED DICTIONARY   @LOA 37106200
*                                            IN IGG019VT           @LOA 37106300
         DC    X'550024E334'    002-E3  85   CMP - INVALID TAILORED@LOA 37106400
         DC    C'36'                         TOKEN DETECTED        @LOA 37106500
*                                            BY IGG019VT           @LOA 37106600
         DC    X'560024E534'    002-E5  86   CMP - INVALID TAILORED@LOA 37106700
         DC    C'36'                         DICTIONARY DETECTED   @LOA 37106800
*                                            BY IGG019VT           @LOA 37106900
         DC    X'570024E634'    002-E6  87   CMP - ERROR VALIDATING@LOA 37107000
         DC    C'36'                         TAILORED DICTIONARY   @LOA 37107100
*                                            IN IGG019VT           @LOA 37107200
         DC    X'580024E734'    002-E7  88   CMP - AUTO19VX_WQ IN  @LOA 37107300
         DC    C'36'                         USE WHILE IN IGG019VT @LOA 37107400
         DC    X'590024E934'    002-E9  89   CMP - IGG019VX RETURND@LOA 37107500
         DC    C'36'                         ERROR IOB TO IGG019VT @LOA 37107600
         DC    X'5A0024EA34'    002-EA  90   CMP - IGG019VX RETURND@LOA 37107700
         DC    C'36'                         BAD RC TO IGG019VT    @LOA 37107800
         DC    X'5B0024EB34'    002-EB  91   CMP - EXISTING TOKEN  @POA 37107900
         DC    C'36'                         FOUND IN EFC FOR TLRD @POA 37108000
         DC    X'5C0024F534'    002-F5  92   zEDC - I/O Error      @70A 37108100
         DC    C'36'                                               @70A 37108200
         DC    X'5D0024F634'    002-F6  93   zEDC - Error from     @70A 37108300
         DC    C'36'                         FPZ4RMR/FPZ4DMR       @70A 37108400
         DC    X'5E0024F734'    002-F7  94   zEDC - Error from     @70A 37108500
         DC    C'36'                         FPZ4ABC               @70A 37108600
         DC    X'5F0024F934'    002-F9  95   zEDC - Error flushing @70A 37108700
         DC    C'36'                         ICU                   @70A 37108800
         DC    X'600024FA34'    002-FA  96   zEDC - Error from zEDC@70A 37108900
         DC    C'36'                         Decompress FPZ4ABC    @70A 37109000
.*                                           associated with inval @70A 37109100
.*                                           data                  @70A 37109200
         DC    X'610024FB34'    002-FB  97   zEDC - Error from zEDC@70A 37109300
         DC    C'36'                         Registration FPZ4RMR  @70A 37109400
.*                                           due to insuff DMA     @70A 37109500
.*                                           memory available      @70A 37109600
         DC    X'620024FD34'    002-FD  98   zEDC - Unexpected err @70A 37109700
         DC    C'36'                         encountered in I/O    @70A 37109800
.*                                           completion routine    @70A 37109900
         DC    X'630024F234'    002-F2  99  On the first write    @L21A 37110000
         DC    C'36'                        after opening a new   @L21A 37110100
.*                                          encrypted             @L21A 37110200
.*                                          non-compressed        @L21A 37110300
.*                                          extended format       @L21A 37110400
.*                                          sequential data set   @L21A 37110500
.*                                          for output with BSAM, @L21A 37110600
.*                                          the system detected   @L21A 37110700
.*                                          that the blocksize    @L21A 37110800
.*                                          derived for the data  @L21A 37110900
.*                                          set by taking the     @L21A 37111000
.*                                          maximum of BLKSIZE at @L21A 37111100
.*                                          OPEN and BLKSIZE at   @L21A 37111200
.*                                          first WRITE is less   @L21A 37111300
.*                                          than 16 bytes.        @L21A 37111400
.*                                          However, the minimum  @L21A 37111500
.*                                          blocksize supported   @L21A 37111600
.*                                          for encrypted         @L21A 37111700
.*                                          non-compressed        @L21A 37111800
.*                                          extended format       @L21A 37111900
.*                                          sequential data sets  @L21A 37112000
.*                                          is 16 bytes.          @L21A 37112100
.*                                                                    * 37112200
.*                                                                    * 37112400
         DC    X'640026D134'    002-D1  100  VX decompress length  @75A 37112500
         DC    C'36'                         not what expected     @75A 37112600
         DC    X'650026D234'    002-D2  101  Reserved for VX       @75A 37112700
         DC    C'36'                                               @75A 37112800
         DC    X'660026D334'    002-D3  102  Reserved for VX       @75A 37112900
         DC    C'36'                                               @75A 37113000
.*                                                                    * 37113100
         DC    X'6723742834'    237-28  103  EAS ELIGIBLE D/S BUT @L15A 37113200
         DC    C'23'                         DCBEEADSCBOK NOT ON  @L15A 37113300
         DC    X'6800206580'    002-65  104  DECB OR INTERNAL BAM  @66C 37113400
         DC    C'36'                         CONTROL BLOCK         @66C 37113500
*                                            OVERLAID DUE TO BSAM  @66A 37113600
*                                            NCP VALUE BEING       @66A 37113700
*                                            EXCEEDED BY NUMBER OF @66A 37113800
*                                            READS OR WRITES       @66A 37113900
         DC    X'6923742434'    237-24  105  FORMAT 8 DSCB READ   @L15A 37114000
         DC    C'23'                         DURING CONCATENATION @L15A 37114100
*                                            NOT EAV ELIGIBLE     @L15A 37114200
         DC    X'6A0021ED34'    002-ED  106  CMP - ERROR WRITING   @68A 37114300
         DC    C'36'                         TAILORED DICTIONARY - @61A 37114400
.*                                           DICTIONARY ALLOWED    @61A 37114500
.*                                           ONLY ON FIRST VOLUME  @61A 37114600
         DC    X'6B0024EF34'    002-EF  107  CMP - I/O ERROR WHEN  @61A 37114700
         DC    C'36'                         WRITING SHADOW BUFFERS@61A 37114800
         DC    X'6C137C2410'    137-24  108                      YM5718 37114900
         DC    C'22'                                             YM5718 37115000
         DC    X'6D937C2414'    937-24  109                      YM5718 37115100
         DC    C'29'                                             YM5718 37115200
         DC    X'6E13743C00'    137-3C  110  IEC510D LOOP FOR EOV  @39C 37115300
         DC    C'22'                                               @28A 37115400
         DC    X'6F73703400'    737-34  111                    @Y30LSFY 37115500
         DC    C'27'                                           @Y30LSFY 37115600
         DC    X'7073703800'    737-38  112                    @Y30LSFY 37115700
         DC    C'27'                                           @Y30LSFY 37117500
         DC    X'7173743C14'    737-3C  113                    @G60ASRB 37118000
         DC    C'27'                                           @G60ASRB 37118500
         DC    X'7273744004'    737-40  114                        @54A 37118600
         DC    C'27'                                               @54A 37118700
         DC    X'7300208980'    002-89  115  POINT TO A PDSE MEMBER@PVA 37118800
         DC    C'36'                         OR A USS FILE (IN A   @PVA 37118900
*                                            BPAM CONCATENATION)   @PVA 37119000
*                                            FAILED BECAUSE ONE OF @PVA 37119100
*                                            THE DATA SETS IN THE  @PVA 37119200
*                                            CONCATENATION IS      @PVA 37119300
*                                            PROTECTED WITH EXECUTE@PVA 37119400
*                                            ONLY RACF AUTHORITY.  @PVA 37119500
         DC    X'7400208A80'    002-8A  116  POINT TO A USS FILE   @PVA 37119600
         DC    C'36'                         (IN A BPAM CONCAT)    @PVA 37119700
*                                            FAILED BECAUSE THE    @PVA 37119800
*                                            USER HAD INSUFFICIENT @PVA 37119900
*                                            USS PERMISSIONS TO    @PVA 37120000
*                                            ACCESS THE FILE.      @PVA 37120100
         DC    X'7583741008'    837-10  117 INCOMPATIBLE DEVICE    @H2A 37120200
         DC    C'28'                                       TYPE    @H2A 37120300
.*                                                                    * 37120400
         DC    X'7683741408'    837-14  118 INCONSISTENT VOLUME    @H2A 37120500
         DC    C'28'                             RECORDING MODE    @H2A 37120900
.*                                                                    * 37121200
.*       031-08 DELETED BECAUSE ISAM NO LONGER SUPPORTED         2@L19D 37121500
.*                                                                    * 37121600
         DC    X'7723703028'    237-30  119  DEBCHK ISSUED A      @L22A 37122000
         DC    C'23'                         NON-ZERO RETURN CODE @L22A 37122100
.*                                                                    * 37122400
         DC    X'780020C080'    002-C0  120  INVALID ATTEMPT TO    @LCA 37122500
         DC    C'36'                         READ PDSE LOAD MODULE @LCA 37122700
.*                                           MEMBER                @LCA 37123000
.*                                                                    * 37123300
         DC    X'790020C480'    002-C4  121  INVALID INFO IN SACB @P10C 37123600
         DC    C'36'                         FOLLOWING A RESTART  @P10C 37123900
.*                                                                 @PEC 37124200
.*                                                                    * 37124500
         DC    X'7A0020C880'    002-C8  122  ERROR RETURN CODE FROM@LCA 37124800
         DC    C'36'                         IEWLCNVT WHILE READING@LCA 37125100
*                                            PDSE DIRECTORY        @LCA 37125400
.*                                                                    * 37125700
         DC    X'7B0020D080'    002-D0  123  SAM DOES NOT SUPPORT  @LCA 37126000
         DC    C'36'                         ACCESS TO LINEAR LOAD @LCA 37126300
*                                            MODULES.              @LCA 37126600
.*                                                                    * 37126900
         DC    X'7C0020CC80'    002-CC  124  USER TRIED TO CREATE  @PEA 37127200
         DC    C'36'                         DATA MEMBER IN PDSE   @PEA 37127500
*                                            WITH LOAD MODUELS     @PEA 37127800
         DC    X'7D63747C0C'    637-7C  125  AUTOMATED TAPE LIBR.  @39C 37128100
         DC    C'26'                                               @PGA 37128400
         DC    X'7E6374740C'    637-74  126  AUTOMATED TAPE LIBR.  @39C 37128700
         DC    C'26'                                               @PGA 37129000
         DC    X'7F6374800C'    637-80  127  AUTOMATED TAPE LIBR.  @39C 37129300
         DC    C'26'                                               @PJA 37129600
.*                                                                    * 37129900
         DC    X'800020D880'    002-D8  128  STRIPE - BAD RC FROM  @LGA 37130200
         DC    C'36'                         MMINIT                @LGA 37130500
.*                                                                    * 37130800
         DC    X'810020DC80'    002-DC  129  STRIPE - BAD RC FROM  @LGA 37131100
         DC    C'36'                         MMCALL                @LGA 37131400
.*                                                                    * 37131700
         DC    X'820020E080'    002-E0  130  STRIPE - POINT ISSUED @LGA 37132000
         DC    C'36'                         W/ OUTSTANDING CHECKS @LGA 37132300
.*                                                                    * 37132600
         DC    X'836374840C'    637-84  131  AUTOMATED TAPE LIBR.  @39C 37132900
         DC    C'26'                                               @32A 37133200
.*                                                                    * 37133500
         DC    X'846374880C'    637-88  132  AUTOMATED TAPE LIBR.  @39C 37133800
         DC    C'26'                                               @32A 37134100
.*                                                                    * 37134400
         DC    X'8563748C0C'    637-8C  133  AUTOMATED TAPE LIBR.  @39C 37134500
         DC    C'26'                                               @36A 37134600
         DC    X'866374900C'    637-90  134  SMCT SUPPORT          @41A 37134700
         DC    C'26'                                               @41A 37134800
         DC    X'876374940C'    637-94  135  SMCT SUPPORT          @41A 37134900
         DC    C'26'                                               @41A 37135000
         DC    X'886374980C'    637-98  136  SMCT SUPPORT          @45A 37135100
         DC    C'26'                                               @45A 37135200
         DC    X'8963749C0C'    637-9C  137  SMCT SUPPORT          @51A 37135300
         DC    C'26'                                               @51A 37135400
         DC    X'8A6374A00C'    637-A0  138  SMCT SUPPORT          @51A 37135500
         DC    C'26'                                               @51A 37135600
         DC    X'8B0020D428'    002-D4  139  DCBBLKSI OR DCBLRECL  @18A 37135700
         DC    C'36'                         IS ZERO FOR PDSE WITH @18A 37135800
*                                            RECFM = FB, VB, OR U  @18A 37136000
*                                            WHEN INPUT OR UPDATE  @18A 37136200
         DC    X'8C0020AC80'    002-AC  140  BAD BUFFER FORMAT     @LBA 37136500
         DC    C'36'                         FOR PDSE MEMBER       @LBA 37136800
         DC    X'8D13740404'    137-04  141                             37139100
         DC    C'22'                                                    37141500
         DC    X'8EB3740408'    B37-04  142                             37142000
         DC    C'30'                                                    37142500
         DC    X'8F0020B000'    002-B0  143  FB SPECIFIED FOR AN   @LBC 37142700
         DC    C'36'                         PDSE BUT BLKSIZE NOT  @LBC 37142900
*                                            A MULTIPLE OF LRECL   @LBA 37143100
*                                            OR 'F' AND LRECL NOT  @LBA 37143300
*                                            EQUAL TO BLKSIZE      @LBA 37143500
         DC    X'9063740404'    637-04  144                             37144000
         DC    C'26'                                                    37144500
         DC    X'910020B400'    002-B4  145  ERROR RETURN FROM JCDM@LBC 37145000
         DC    C'36'                         CREATE CONTEXT        @LBC 37145500
         DC    X'9213740804'    137-08  146                             37146000
         DC    C'22'                                                    37146500
         DC    X'9313740C04'    137-0C  147                             37147000
         DC    C'22'                                                    37147500
         DC    X'94237C043C'    237-04  148                             37148000
         DC    C'23'                                                    37148500
         DC    X'9563740804'    637-08  149                             37149000
         DC    C'26'                                                    37149500
         DC    X'9613741004'    137-10  150                             37150000
         DC    C'22'                                                    37150500
         DC    X'9763741404'    637-14  151                             37151000
         DC    C'26'                                                    37151500
         DC    X'9863741804'    637-18  152                             37152000
         DC    C'26'                                                    37152500
         DC    X'9963741C04'    637-1C  153                             37153000
         DC    C'26'                                                    37153500
         DC    X'9A63742004'    637-20  154  CONCAT W 'RDBACK' NOT @08A 37154000
         DC    C'26'                         VALID IEC026I 637-20  @08A 37154500
         DC    X'9B63742404'    637-24  155                             37155000
         DC    C'26'                                                    37155500
         DC    X'9CB3740408'    B37-04  156                             37156000
         DC    C'30'                                                    37156500
         DC    X'9D0020B800'    002-B8  157  SETLOCK ERROR         @PDC 37157000
         DC    C'36'                                               @PDC 37157500
         DC    X'9E63742C08'    637-2C  158                             37158000
         DC    C'26'                                                    37158500
         DC    X'9F6374500C'    637-50  159  AUTOMATED TAPE LIBR.  @39C 37159000
         DC    C'26'                                               @LEC 37159500
         DC    X'A063743404'    637-34  160                             37160000
         DC    C'26'                                                    37160500
         DC    X'A163743804'    637-38  161                             37161000
         DC    C'26'                                                    37161500
         DC    X'A263743C04'    637-3C  162                             37162000
         DC    C'26'                                                    37162500
         DC    X'A363744004'    637-40  163                             37163000
         DC    C'26'                                                    37163500
         DC    X'A413741404'    137-14  164                             37164000
         DC    C'22'                                                    37164500
         DC    X'A523740814'    237-08  165                             37165000
         DC    C'23'                                                    37165500
         DC    X'A66374540C'    637-54  166 AUTOMATED TAPE LIBR.   @39C 37166000
         DC    C'26'                                               @LEC 37166500
         DC    X'A76374580C'    637-58  167 AUTOMATED TAPE LIBR.   @39C 37167000
         DC    C'26'                                               @LEC 37167500
         DC    X'A8B3700408'    B37-04  168                             37168000
         DC    C'30'                                                    37168500
         DC    X'A963745C0C'    637-5C  169 AUTOMATED TAPE LIBR.   @39C 37169000
         DC    C'26'                                               @LEC 37169500
         DC    X'AA6374600C'    637-60  170 AUTOMATED TAPE LIBR.   @39C 37170000
         DC    C'26'                                               @LEC 37170500
         DC    X'AB73700C04'    737-0C  171                             37171000
         DC    C'27'                                                    37171500
         DC    X'AC6374640C'    637-64  172 AUTOMATED TAPE LIBR.   @39C 37172000
         DC    C'26'                                               @LEC 37172500
         DC    X'AD6374680C'    637-68  173 AUTOMATED TAPE LIBR.   @39C 37173000
         DC    C'26'                                               @LEC 37173500
         DC    X'AE33700428'    337-04  174                             37174000
         DC    C'24'                                                    37174500
         DC    X'AF73701404'    737-14  175                             37175000
         DC    C'27'                                                    37175500
         DC    X'B063740C28'    637-0C  176                             37176000
         DC    C'26'                                                    37176500
         DC    X'B1B3740800'    B37-08  177                      M0179  37177000
         DC    C'30'                                             M0179  37177500
         DC    X'B273741C04'    737-1C  178                             37178000
         DC    C'27'                                                    37178500
         DC    X'B363746C0C'    637-6C  179 AUTOMATED TAPE LIBR.   @39C 37179000
         DC    C'26'                                               @LEC 37179500
         DC    X'B413741C10'    137-1C  180                             37180000
         DC    C'22'                                                    37180500
         DC    X'B56374700C'    637-70  181  AUTOMATED TAPE LIBR.  @39C 37181000
         DC    C'26'                                               @LEC 37181500
         DC    X'B643710828'    437-08  182                     ZA01291 37182000
         DC    C'25'                                             A48604 37182500
         DC    X'B7E3740800'    E37-08  183                      A47372 37183000
         DC    C'32'                                             A47372 37183500
         DC    X'B8E3740400'    E37-04  184                             37184000
         DC    C'32'                                                    37184500
         DC    X'B9B3740408'    B37-04  185                             37185000
         DC    C'30'                                                    37185500
         DC    X'BAD374041C'    D37-04  186                             37186000
         DC    C'31'                                                    37186500
         DC    X'BB73741004'    737-10  187                             37187000
         DC    C'27'                                                    37187500
         DC    X'BC23741434'    237-14  188  USS - ANY EOV TO A    @39C 37187800
         DC    C'23'                         USS FILE (I.E. PATH=  @LFA 37188100
*                                            WAS SPECIFIED).       @LFA 37188500
         DC    X'BD73740804'    737-08  189                             37188900
         DC    C'27'                                                    37189500
         DC    X'BE73740404'    737-04  190                             37190000
         DC    C'27'                                                    37190500
         DC    X'BF13741804'    137-18  191                             37191000
         DC    C'22'                                                    37191500
         DC    X'C063744404'    637-44  192                             37192000
         DC    C'26'                                                    37192500
         DC    X'C123741834'    237-18  193  USS - any EOV to USS  @39C 37193000
         DC    C'23'                         data set (file system)@LFA 37193500
         DC    X'C263741010'    637-10  194                             37194000
         DC    C'26'                                                    37194500
         DC    X'C313742010'    137-20  195                             37195000
         DC    C'22'                                                    37195500
         DC    X'C463744C04'    637-4C  196                             37196000
         DC    C'26'                                                    37196500
         DC    X'C583740800'    837-08  197                        @M5A 37197000
         DC    C'28'                                                    37197500
         DC    X'C6A3710444'    A37-04  198                     ZA01291 37198000
         DC    C'15'                                            SA52379 37198500
         DC    X'C743700C28'    437-0C  199                      YM2133 37199000
         DC    C'25'                                             YM2133 37199500
         DC    X'C800500400'    005-04  200                     YL03127 37200000
         DC    C'41'                                            YL03127 37200500
         DC    X'C900500800'    005-08  201                     YL03127 37201000
         DC    C'41'                                            YL03127 37201500
         DC    X'CA00200C80'    002-0C  202                      Y02144 37202000
         DC    C'36'                                             Y02144 37202500
         DC    X'CB00201080'    002-10  203                      Y02144 37203000
         DC    C'36'                                             Y02144 37203500
         DC    X'CC00201480'    002-14  204                      Y02144 37204000
         DC    C'36'                                             Y02144 37204500
         DC    X'CD00201C80'    002-1C  205                      Y02144 37205000
         DC    C'36'                                             Y02144 37205500
         DC    X'CE00202080'    002-20  206                      Y02144 37206000
         DC    C'36'                                             Y02144 37206500
         DC    X'CF00202480'    002-24  207                      Y02144 37207000
         DC    C'36'                                             Y02144 37207500
         DC    X'D0E3740C4C'    E37-0C  208                        @L1A 37208000
         DC    C'32'                                               @L1A 37208500
         DC    X'D100800480'    008-04  209                      Y02144 37209000
         DC    C'37'                                             Y02144 37209500
         DC    X'D200800880'    008-08  210                      Y02144 37210000
         DC    C'37'                                             Y02144 37210500
         DC    X'D300202834'    002-28  211                        @12A 37211000
         DC    C'36'                                               @12A 37211500
         DC    X'D40020A880'    002-A8  212 PDSE MEMBER IS FULL    @LBA 37212000
         DC    C'36'                                               @LBA 37212500
         DC    X'D500201880'    002-18  213                      Y02144 37213000
         DC    C'36'                                             Y02144 37213500
         DC    X'D66370780C'    637-78  214  AUTOMATED TAPE LIBR.  @39C 37213800
         DC    C'26'                                               @PGC 37214100
         DC    X'D70020A080'    002-A0  215                        @LBA 37214400
         DC    C'36'                                               @LBA 37214700
*   002-A0 WAS ISSUED FOR ONE OF 3 REASONS:                        @LBA 37215000
*     - WRITE OR PUT WAS ISSUED WHILE POSITIONED TO A PDSE DIR.    @LBA 37215300
*     - DCBBLKSI IS INCORRECT FOR READING AN PDSE DIRECTORY        @LBA 37215600
*     - DCBRECFM IS INCORRECT FOR READING AN PDSE DIRECTORY        @LBA 37215900
         DC    X'D80020A480'    002-A4  216  UNEXPECTED RETURN CODE@LBA 37216200
         DC    C'36'                         FROM JCDM WHILE       @LBA 37216500
*                                            READING DIRECTORY     @LBA 37216800
*                                            ENTRY RECORDS         @LBA 37217100
         DC    X'D900209C80'    002-9C  217  INVALID ATTEMPT TO    @LBA 37217400
         DC    C'36'                         UPDATE - READS QUEUED @LBA 37217700
         DC    X'DA73702438'    737-24  218                     SA58102 37218100
         DC    C'27'                                            SA58102 37218500
         DC    X'DBA3710828'    A37-08  219                     ZA01291 37219000
         DC    C'15'                                            SA59307 37219500
         DC    X'DC00205080'    002-50  220  SACB IS CURRENTLY IN  @LBA 37220000
         DC    C'36'                         USE                   @LBA 37220500
         DC    X'DD00205480'    002-54  221  BAD RETURN CODE FROM  @LBA 37221000
         DC    C'36'                         DEBCHK                @LBA 37221500
         DC    X'DE00205880'    002-58  222  INVALID SACB DETECTED @LBA 37222000
         DC    C'36'                                               @LBA 37222500
         DC    X'DF00205C80'    002-5C  223  INVALID FRQ DETECTED  @LBA 37223000
         DC    C'36'                                               @LBA 37223500
         DC    X'E000206080'    002-60  224  NON-ZERO KEYLEN SPEC  @LBA 37224000
         DC    C'36'                         FOR PDSE MEMBER       @LBA 37224500
         DC    X'E100206480'    002-64  225  NCP HAS BEEN EXCEEDED @LBA 37225000
         DC    C'36'                                               @LBA 37225500
         DC    X'E200206880'    002-68  226  INVALID BLKSIZE SPEC  @LBA 37226000
         DC    C'36'                                               @LBA 37226500
         DC    X'E300206C80'    002-6C  227  BAD RETURN CODE FROM  @LBA 37227000
         DC    C'36'                         MEMBER CREATE         @LBA 37227500
         DC    X'E400207080'    002-70  228  PACB LOCATE ERROR     @LBA 37228000
         DC    C'36'                                               @LBA 37228500
         DC    X'E500207480'    002-74  229  INVALID PACB DETECTED @LBA 37229000
         DC    C'36'                                               @LBA 37229500
         DC    X'E6C374041C'    C37-04  230                      YM5718 37230000
         DC    C'33'                                             Y02072 37230500
         DC    X'E7C374081C'    C37-08  231                      YM5718 37231000
         DC    C'33'                                             Y02072 37231500
         DC    X'E873742C28'    737-2C  232                      YM5718 37232000
         DC    C'27'                                             Y02082 37232500
         DC    X'E900207C80'    002-7C  233  SACB_MEM_CT NOT FOUND @LBA 37233000
         DC    C'36'                         IN PACB               @LBA 37233500
         DC    X'EA00208080'    002-80  234  JCDM SAVE ERROR IN    @LBA 37234000
         DC    C'36'                         POINT                 @LBA 37234500
         DC    X'EB00208480'    002-84  235  JCDM RECONNECT FOR    @LBA 37235000
         DC    C'36'                         HOLD ERROR IN POINT   @LBA 37235500
         DC    X'EC00208880'    002-88  236  JCDM RECONNECT FOR    @LBA 37236000
         DC    C'36'                         I/O  ERROR IN POINT   @LBA 37236500
         DC    X'ED00208C80'    002-8C  237  JCDM DISCONNECT ERROR @LBA 37237000
         DC    C'36'                         IN POINT              @LBA 37237500
         DC    X'EE00209080'    002-90  238  JCDM CONNECT ERROR    @LBA 37238000
         DC    C'36'                         IN POINT              @LBA 37238500
         DC    X'EF00207880'    002-78  239  PRIVILEGED CALL ERROR @LBA 37239000
         DC    C'36'                                               @LBA 37239500
         DC    X'F093701008'    937-10  240                      Y02083 37240000
         DC    C'29'                                             Y02083 37240500
         DC    X'F193701408'    937-14  241                      Y02083 37241000
         DC    C'29'                                             Y02083 37241500
         DC    X'F293701808'    937-18  242                      Y02083 37242000
         DC    C'29'                                             Y02083 37242500
         DC    X'F300209480'    002-94  243  MAX NO OF MEMBERS     @LBA 37243000
         DC    C'36'                         CREATED ( AT WRITE)   @LBA 37243500
         DC    X'F400209880'    002-98  244  TRUNCATE FILE ERROR   @LBA 37244000
         DC    C'36'                                               @LBA 37244500
         DC    X'F593741C1C'    937-1C  245                      YM5718 37245000
         DC    C'29'                                             Y02082 37245500
         DC    X'F600203028'    002-30  246                        @11C 37246000
         DC    C'36'                                               @11C 37246500
         DC    X'F7B3740C08'    B37-0C  247                      YM5718 37247000
         DC    C'30'                                             YM1238 37247500
         DC    X'F883740C08'    837-0C  248                      YM5718 37248000
         DC    C'28'                                             YM1238 37248500
         DC    X'F993742010'    937-20  249  NO VOL/FILE ACC WHEN  @L3C 37249100
         DC    C'29'                         USED FOR ANSI TAPES   @L3C 37249700
         DC    X'FA7378284C'    737-28  250                    @G18MSBS 37250400
         DC    C'27'                                           @G18MSBS 37251100
         DC    X'FB00203844'    002-38  251                        @11C 37251400
         DC    C'36'                                               @11C 37251700
         DC    X'FC33700828'    337-08  252                      YM3108 37252100
         DC    C'24'                                             YM3108 37252500
         DC    X'FD00200480'    002-04  253                      YM1433 37253000
         DC    C'36'                                             YM1433 37253500
         DC    X'FE00200880'    002-08  254                      YM1433 37254000
         DC    C'36'                                             YM1433 37254500
         DC    X'FF83740408'    837-04  255  DENSITY CONFLICT ON   @07A 37304500
         DC    C'28'                         CONCATENATED TAPE DEV @07A 37354500
         DC    X'00'                    END OF TABLE MARKER             37997000
*                                                                     * 37997400
*****    XCTLTABL ID=(NEXTMOD,IFG0559B,LASTLOAD,IFG0552X),       YM1447 37997800
*****          BRT=YES,LENGTH=                                   Y02080 37998200
         XCTLTABL ID=(NEXTMOD,IFG0559B,LASTLOAD,IFG0552X),       YM1447X37998900
               BRT=YES,LENGTH=                                   Y02080 37999500
.GENDSCT ANOP                                                           40000000
         EJECT                                                          40050000
TABLE    DSECT                                                          40100000
CODE     DS    CL1                                                      40150000
ABCODE   DS    CL2                                                      40200000
RETCODE  DS    CL1                                                      40250000
TRCCODE  DS    CL1                                                      40300000
MSGID    DS    CL2                                                      40350000
TABLLEN  EQU   *-TABLE                  LNG OF CODE TABLE ENTRY  YM3111 40350400
*****    IECPDSCT                                                       40400200
         IECPDSCT                                                       40450000
*****    IECDSECS CVT,MAIN,WTG,PREFX,RRPL,PSA,EXPAND=YES           @PWC 40500000
         IECDSECS CVT,MAIN,WTG,PREFX,RRPL,PSA,EXPAND=YES           @PWC 40550000
         MEND                                                           40600000
