*%GOTO   SMF94P1;                  /* Bilingual mapping                 00050000
         MACRO                                                          00100000
&NAME    IECSMF94                                                       00150000
******                                                               */ 00186300
*%SMF94P1: ;                                                            00222600
*/* START OF SPECIFICATIONS ******************************************/ 00222700
*/*                                                                  */ 00295200
*/*   MACRO NAME = IECSMF94                                          */ 00331500
*/*                                                                  */ 00367800
*/*PROPRIETARY V3 STATEMENT                                          */ 00409200
*/*Licensed Materials - Property of IBM                              */ 00450600
*/*"Restricted Materials of IBM"                                     */ 00450702
*/*5650-ZOS                                                          */ 00533400
*/*Copyright IBM Corp. 1993, 2018                                    */ 00574800
*/*END PROPRIETARY V3 STATEMENT                                      */ 00616200
*/*                                                                  */ 00658200
*/*   STATUS = JDZ1110                                               */ 00694500
*/*                                                                  */ 00730800
*/*   SMF record type 94(5E), SUBTYPE(01), is written approximately  */ 00767100
*/*   every hour when the 34xx tape library data server reports      */ 00803400
*/*   statistics. The 34xx reports statistics via a statistical      */ 00839700
*/*   data message which is read and recorded by the MVS tape error  */ 00876000
*/*   recovery program (module IGE0001E).                            */ 00912300
*/*                                                                  */ 00948600
*/*01* SIZE =                                                        */ 00948700
*/*                                                                  */ 00948800
*/*01*                                                               */ 00948900
*/*                                                                  */ 00949000
*/* CHANGE ACTIVITY =                                                */ 00984900
*/*                                                                  */ 01021200
*/* $01=OY60348,JDZ1110,SJPLLRU: Prevent mult SMF T94 writes     @01A*/ 01057500
*/*                              Related APAR: OY60349           @01A*/ 01093800
*/* $02=OY62249 ,JDZ1110,SJPLLRU: User gets IEV025, IEV041, and  @02A*/ 01130100
*/*                               IEV158 msgs during assembly    @02A*/ 01166400
*/* $03=OY62842,JDZ1110,SJPLLRU: Refresh of OY62249, no changes  @03A*/ 01202700
*/*                              were made for this APAR         @03A*/ 01239000
*/* $04=OW27369,HDZ11B0,TUCKEE:  FCR0252 - added Virtual Tape        */ 01251100
*/*                              Server Statistics               @04A*/ 01263200
*/* $IX=OW36360,HDZ11D0,SJPLRDB: VTS IMPORT/EXPORT SPE           @IXA*/ 01267200
*/*                              FCR 258-03                      @IX2*/ 01271200
*/* $XX=OW42071,HDZ11E0,SJPLRDB: enhanced VTS statistics         @gem*/ 01273200
*/*                              FRC267-02 gemini changes        @ge2*/ 01274200
*/* $05=OW52989,HDZ11F0,SJPLRDB: 8 AX0 support.                  @05a*/ 01274700
*/* $30=OW54059,HDZ11G0,SJPLRDB: Orca2(F/C 4001) statistics.     @30a*/ 01275000
*/* $50=OA08777,HDZ11F0,SJPLRDB: FCR279 support                  @50a*/ 01282300
*/* $51=OA08777,HDZ11F0,SJPLRDB: FCR282 support                  @51a*/ 01289600
*/* $52=OA08777,HDZ11H0,SJPLRDB: FCR0401 VTS release 7.3         @52a*/ 01296900
*/* $53=OA10565,HDZ11G0,SJPLRDB: FCR0406 VTS release 7.4         @53a*/ 01300500
*/* $06=OA23082,HDZ11K0,SJPLREG: Fix offset issue in S94CLDC2-C7 @06a*/ 01302300
*/* $07=SM01433,HDZ2210,SJPLTLB: Add DSECT label                 @07a*/ 01302400
*/* $CH=W299488,HDZ2240,SJPLTLB: C Header File Support           @CHA*/ 01302501
*/* $C2=W304342,HDZ2240,SJPLTLB: C Header File Support (Part 2)  @C2A*/ 01302603
*/*                                Rebuild renamed parts.        @C2A*/ 01302703
*/* END OF SPECIFICATIONS   ******************************************/ 01302803
*%GOTO   SMF94P2;                  /*                                   01311600
SMFRCD94 DSECT                                                          01350000
*********************************************************************** 01400000
*        SMF RECORD HEADER SEGMENT                                      01450000
*********************************************************************** 01500000
SMF94RPS DS    0CL24               Type 94 Record Header                01550000
SMF94LEN DS    H'0'                Record Length                        01600000
SMF94SEG DS    H'0'                Segment Descriptor                   01650000
SMF94FLG DS    BL1'0'              Header Flag Byte                     01702500
SMF94FNM EQU   X'80'               ..Subsystem name follows       @02C  01730000
*                                    standard header              @02C  01760000
SMF94FST EQU   X'40'               ..Subtypes utilized            @02C  01790000
SMF94RTY DS    BL1'0'              Record Type = 94 (hex 5E)            01844000
SMF94C94 EQU   X'5E'               94 (for ease of use)                 01868100
SMF94TME DS    CL4' '              Time since midnight, in hundredths   01904300
*                                  of a second, when the record was     01922400
*                                  moved into the SMF buffer.           01940500
SMF94DTE DS    PL4'0000'           Date when the record was moved       01976700
*                                  into the SMF buffer, in the form     01994800
*                                  cyydddF (where F is the sign).       02012900
SMF94SID DS    CL4' '              System Id (from SMFPRMXX parm)       02053000
SMF94WID DS    CL4' '              Subsystem id, worktype indicator     02100000
*                                                                       02125000
SMF94STP DS    BL2'0'              Record Subtype                       02162500
SMF94_SUBTYPE1 EQU   X'0001'       1 = Tape Library Statistics     @30a 02184300
SMF94_SUBTYPE2 EQU   X'0002'       2 = Volume Pooling Statistics   @30a 02206100
*                                      (see SMF94S2 for mapping)   @30a 02227900
*********************************************************************** 02250000
* NOTE:                                                            @30a 02256200
* When Microcode level F/C 4001 is installed, and Outboard Policy  @30a 02262400
* Management is enabled, a new SMF=94(subtype=2) record will be    @30a 02268600
* recorded. New subtype=2 record contains Volume Pool Statistics.  @30a 02274800
*                                                                  @30a 02281000
* Existing subtype=1 records are also changed. When F/C 4001 is    @30a 02287200
* installed and Outboard Policy Management(OPM) is enabled, some   @30a 02293400
* existing statistics will not be reported. The unreported fields  @30a 02299600
* will contain binary zero. Existing field SMF94HSF in subtype=1   @30a 02305800
* records will contain the value 2 to indicate that F/C 4001 is    @30a 02312000
* installed and OPM is enabled.                                    @30a 02318200
*                                                                  @30a 02324400
*********************************************************************** 02330600
*********************************************************************** 02336800
*        SELF DEFINING SECTION  (for format=1 statistics)          @30a 02343000
*********************************************************************** 02350000
SMF94SDS DS    0CL76' '            Self Defining Section                02400000
SMF94SDL DS    F'0'                Self Defining Section length         02450000
*                                                                       02500000
SMF94POF DS    F'0'                Offset to product Section            02550000
SMF94PLN DS    H'0'                Length of product Section            02600000
SMF94PON DS    H'0'                Number of product Sections           02650000
*                                                                       02700000
SMF94HOF DS    F'0'                Offset to format section             02750000
SMF94HLN DS    H'0'                Length of format section             02800000
SMF94HON DS    H'0'                Number of format sections            02850000
*                                                                       02900000
SMF94SOF DS    F'0'                Offset to self descr info            02950000
SMF94SLN DS    H'0'                Length of self descr info            03000000
SMF94SON DS    H'0'                Number of self descr info            03050000
*                                                                       03100000
SMF94LOF DS    F'0'                Offset to library stats              03150000
SMF94LLN DS    H'0'                Length of library stats              03200000
SMF94LON DS    H'0'                Number of library stats              03250000
*                                                                       03300000
SMF94MOF DS    F'0'                Offset to mount stats                03350000
SMF94MLN DS    H'0'                Length of mount stats                03400000
SMF94MON DS    H'0'                Number of mount stats                03450000
*                                                                       03500000
SMF94DOF DS    F'0'                Offset to demount stats              03550000
SMF94DLN DS    H'0'                Length of demount stats              03600000
SMF94DON DS    H'0'                Number of demount stats              03650000
*                                                                       03700000
SMF94EOF DS    F'0'                Offset to eject stats                03750000
SMF94ELN DS    H'0'                Length of eject stats                03800000
SMF94EON DS    H'0'                Number of eject stats                03850000
*                                                                       03900000
SMF94AOF DS    F'0'                Offset to audit stats                03950000
SMF94ALN DS    H'0'                Length of audit stats                04000000
SMF94AON DS    H'0'                Number of audit stats                04050000
*                                                                       04100000
SMF94IOF DS    F'0'                Offset to insert stats               04150000
SMF94ILN DS    H'0'                Length of insert stats               04186600
SMF94ION DS    H'0'                Number of insert stats               04223200
*                                                                       04260000
SMF94VOF DS    F'0'                Offset to VTS stats           @04A   04270000
SMF94VLN DS    H'0'                Length of VTS stats           @04A   04274200
SMF94VON DS    H'0'                Number of VTS stats           @04A   04278400
*                                                                       04282600
SMF94XOF DS    F'0'                Offset to import/export stats @IXA   04286800
SMF94XLN DS    H'0'                Length of import/export stats @IXA   04291000
SMF94XON DS    H'0'                Number of import/export stats @IXA   04295200
*                                                                       04296100
SMF942OF DS    F'0'                Offset to enhanced VTS stats  @gem   04297000
SMF942LN DS    H'0'                Length of enhanced VTS stats  @gem   04297900
SMF942ON DS    H'0'                Number of enhanced VTS stats  @gem   04298800
*********************************************************************** 04350000
*        PRODUCT SECTION                                                04400000
*********************************************************************** 04450000
SMF94PSS DSECT ,                   Product section                      04500000
SMF94TYP DS    H'0'                Subtype for type 94 record.          04533300
SMF94RVN DS    CL2' '              Record Version Number C'01'          04595800
SMF94PNM DS    CL8' '              FMID, such as JDZ1110                04650000
SMF94MVS DS    CL8' '              MVS Operating System Name            04700000
*********************************************************************** 04750000
*        HEADER SECTION (bytes 9-11 in source record)                   04800000
*********************************************************************** 04900000
SMF94HDR DSECT                                                          04950000
SMF94HSF DS    X'00'               Statistics format. Set to 2   @30a   04971400
*                                  when F/C4001 is enabled.      @30a   04992800
SMF94HHI DS    CL2' '              Hour index in binary, incremented    05014200
*                                  every hour.  Value ranges from       05035600
*                                  0 to 23 (17 hex).                    05057000
*********************************************************************** 05100000
*        SELF DESCRIPTION INFORMATION (bytes 12-37 in source record)    05150000
*********************************************************************** 05250000
SMF94SLF DSECT ,                   Self description information         05264200
SMF94SLT DS    CL6' '              System-managed Tape Library type     05292600
*                                  number.  For example, 003495         05306800
*                                  represents the 3495 Tape Library     05321000
*                                  Dataserver.                          05335200
SMF94SLM DS    CL3' '              System-managed Tape Library model    05363600
*                                  number.  For example, L30            05377800
*                                  represents model L30.                05392000
SMF94SMA DS    CL3' '              System-managed Tape Library          05420400
*                                  manufacturer.  Always equals IBM.    05434600
SMF94SPL DS    CL2' '              System-managed Tape Library plant    05463000
*                                  of manufacture.  For example, 13     05477200
*                                  represents San Jose, California      05491400
*                                  and 77 represents Valencia,          05505600
*                                  Spain.                               05519800
SMF94SNO DS    CL12' '             System-managed Tape Library          05548200
*                                  sequence number.  Uniquely           05562400
*                                  identifies a system-managed tape     05576600
         DS    X'00'               Reserved                             05619200
*********************************************************************** 05650000
*        LIBRARY STATISTICS (bytes 38-53 in source record)              05700000
*********************************************************************** 05800000
SMF94LIB DSECT ,                   Library statistics                   05809600
SMF94LID DS    H'0'                Number of drives currently           05828800
*                                  installed in a system-managed        05838400
*                                  tape library.                        05848000
SMF94LMD DS    H'0'                Number of drives currently mounted   05867200
*                                  in a system-managed tape library.    05876800
SMF94LM1 DS    H'0'                Maximum number of drives mounted     05896000
*                                  during the last hour.                05905600
SMF94LM2 DS    H'0'                Minimum number of drives mounted     05924800
*                                  during the last hour.                05934400
SMF94LM3 DS    H'0'                Average number of drives mounted     05953600
*                                  during the last hour.                05963200
SMF94LT1 DS    H'0'                Maximum amount of time, in seconds,  05982400
*                                  that a tape volume was mounted on    05992000
*                                  a drive during the last hour.        06001600
*                                  The mount time of a volume is the    06011200
*                                  time when the system completed       06020800
*                                  mounting a volume on a drive         06030400
*                                  until the the time when the          06040000
*                                  system-managed tape library          06049600
*                                  receives an order from the host      06059200
*                                  to demount the volume.               06068800
SMF94LT2 DS    H'0'                Minimum amount of time, in seconds,  06088000
*                                  that a tape volume was mounted on    06097600
*                                  a drive during the last hour.        06107200
*                                  The mount time of a volume is the    06116800
*                                  time when the system completed       06126400
*                                  mounting a volume on a drive         06136000
*                                  until the time when the              06145600
*                                  system-managed tape library          06155200
*                                  receives an order from the host      06164800
*                                  to demount the volume.               06174400
SMF94LT3 DS    H'0'                Average amount of time, in seconds,  06193600
*                                  that all tape volumes were           06203200
*                                  mounted on drives during the last    06212800
*                                  hour.  The mount time of a volume    06222400
*                                  is the time when the system          06232000
*                                  completed mounting a volume on a     06241600
*                                  drive until the time when the        06251200
*                                  system-managed tape library          06260800
*                                  receives an order from the host      06270400
*                                  to demount the volume.               06280000
*********************************************************************** 06300000
*        MOUNT STATISTICS (bytes 54-73 in source record)                06350000
*********************************************************************** 06450000
SMF94MNT DSECT ,                   Mount statistics                     06463300
SMF94MPR DS    H'0'                The total number of mount requests   06489900
*                                  currently pending.                   06503200
SMF94MP1 DS    H'0'                Maximum number of mount requests     06529800
*                                  pending during the last hour.        06543100
SMF94MP2 DS    H'0'                Minimum number of mount requests     06569700
*                                  pending during the last hour.        06583000
SMF94MP3 DS    H'0'                Average number of mount requests     06609600
*                                  pending during the last hour.        06622900
SMF94MTO DS    H'0'                Total number of mounts during the    06649500
*                                  last hour.                           06662800
SMF94MIN DS    H'0'                Index mounts during the last hour.   06689400
*                                  An index mount is a mount            06702700
*                                  accomplished using the automatic     06716000
*                                  cartridge loader of a 3490 tape      06729300
*                                  drive.                               06742600
SMF94MPM DS    H'0'                Pre-mounts during last hour.  A      06769200
*                                  single pre-mount operation causes    06782500
*                                  a volume to be added to the          06795800
*                                  automatic cartridge loader of a      06809100
*                                  3490 tape drive.                     06822400
SMF94MT1 DS    H'0'                Maximum amount of time, in seconds,  06849000
*                                  required to perform any single       06862300
*                                  mount operation during the last      06875600
*                                  hour.                                06888900
SMF94MT2 DS    H'0'                Minimum amount of time, in seconds,  06915500
*                                  required to perform any single       06928800
*                                  mount operation during the last      06942100
*                                  hour.                                06955400
SMF94MT3 DS    H'0'                Average amount of time, in seconds,  06982000
*                                  required to perform a single         06995300
*                                  mount operation during the last      07008600
*                                  hour.                                07021900
*********************************************************************** 07050000
*        DEMOUNT STATISTICS (bytes 74-93 in source record)              07100000
*********************************************************************** 07200000
SMF94DMT DSECT ,                   Demount statistics                   07213000
SMF94DPR DS    H'0'                The total number of demount          07239000
*                                  requests currently pending.          07252000
SMF94DP1 DS    H'0'                Maximum number of demount requests   07278000
*                                  pending during the last hour.        07291000
SMF94DP2 DS    H'0'                Minimum number of demount requests   07317000
*                                  pending during the last hour.        07330000
SMF94DP3 DS    H'0'                Average number of demount requests   07356000
*                                  pending during the last hour.        07369000
SMF94DTO DS    H'0'                Total number of demounts during the  07395000
*                                  last hour.                           07408000
SMF94DIN DS    H'0'                Index demounts during the last       07434000
*                                  hour.    An index demount moves a    07447000
*                                  volume from the feed station to      07460000
*                                  the output stack of the automatic    07473000
*                                  cartridge loader of a 3490 tape      07486000
*                                  drive.                               07499000
SMF94DPM DS    H'0'                Post-demounts during the last hour.  07525000
*                                  A post-demount operation moves a     07538000
*                                  volume from the output stack of      07551000
*                                  the automatic cartridge loader of    07564000
*                                  a 3490 tape drive.                   07577000
SMF94DT1 DS    H'0'                Maximum amount of time, in seconds,  07603000
*                                  required to perform any single       07616000
*                                  demount operation during the last    07629000
*                                  hour.                                07642000
SMF94DT2 DS    H'0'                Minimum amount of time, in seconds,  07668000
*                                  required to perform any single       07681000
*                                  demount operation during the last    07694000
*                                  hour.                                07707000
SMF94DT3 DS    H'0'                Average amount of time, in seconds,  07733000
*                                  required to perform any single       07746000
*                                  demount operation during the last    07759000
*                                  hour.                                07772000
*********************************************************************** 07800000
*        EJECT STATISTICS (bytes 94-109 in source record)               07850000
*********************************************************************** 07950000
SMF94EJT DSECT ,                   Eject statistics                     07963500
SMF94EPR DS    H'0'                The total number of eject requests   07990500
*                                  currently pending.    An eject       08004000
*                                  operation moves one volume from      08017500
*                                  the system-managed tape library      08031000
*                                  to an output station for removal     08044500
*                                  by an operator.                      08058000
SMF94EP1 DS    H'0'                Maximum number of eject requests     08085000
*                                  pending during the last hour.        08098500
SMF94EP2 DS    H'0'                Minimum number of eject requests     08125500
*                                  pending during the last hour.        08139000
SMF94EP3 DS    H'0'                Average number of eject requests     08166000
*                                  pending during the last hour.        08179500
SMF94ETO DS    H'0'                Total number of ejects during the    08206500
*                                  last hour.                           08220000
SMF94ET1 DS    H'0'                Maximum amount of time, in seconds,  08247000
*                                  required to perform any single       08260500
*                                  eject operation during the last      08274000
*                                  hour.                                08287500
SMF94ET2 DS    H'0'                Minimum amount of time, in seconds,  08314500
*                                  required to perform any single       08328000
*                                  eject operation during the last      08341500
*                                  hour.                                08355000
SMF94ET3 DS    H'0'                Average amount of time, in seconds,  08382000
*                                  required to perform a single         08395500
*                                  eject operation during the last      08409000
*                                  hour.                                08422500
*********************************************************************** 08450000
*        AUDIT STATISTICS (bytes 110-125 in source record)              08500000
*********************************************************************** 08600000
SMF94AUD DSECT ,                   Audit statistics                     08613500
SMF94APR DS    H'0'                The total number of audit requests   08640500
*                                  currently pending.    When the host  08654000
*                                  requests an audit operation, the     08667500
*                                  accessor moves to a shelf            08681000
*                                  location and ensures that a          08694500
*                                  volume is present.                   08708000
SMF94AP1 DS    H'0'                Maximum number of audit requests     08735000
*                                  pending during the last hour.        08748500
SMF94AP2 DS    H'0'                Minimum number of audit requests     08775500
*                                  pending during the last hour.        08789000
SMF94AP3 DS    H'0'                Average number of audit requests     08816000
*                                  pending during the last hour.        08829500
SMF94ATO DS    H'0'                Total number of audits during the    08856500
*                                  last hour.                           08870000
SMF94AT1 DS    H'0'                Maximum amount of time, in seconds,  08897000
*                                  required to perform any single       08910500
*                                  audit operation during the last      08924000
*                                  hour.                                08937500
SMF94AT2 DS    H'0'                Minimum amount of time, in seconds,  08964500
*                                  required to perform any single       08978000
*                                  audit operation during the last      08991500
*                                  hour.                                09005000
SMF94AT3 DS    H'0'                Average amount of time, in seconds,  09032000
*                                  required to perform a single         09045500
*                                  audit operation during the last      09059000
*                                  hour.                                09072500
*********************************************************************** 09100000
*        INPUT STATISTICS (bytes 126-127 in source record)              09150000
*********************************************************************** 09250000
SMF94INP DSECT ,                   Input statistics                     09295000
SMF94INS DS    H'0'                Number of insert stores during last  09385000
*                                  hour.    This number is the number   09430000
*                                  of volumes moved from an input       09475000
*                                  station to a location inside the     09520000
*                                  system managed tape library.         09565000
*********************************************************************** 09565100
* Virtual Tape Server Statistics (bytes 128-211 of source record) @04A  09565200
*                                                                       09565300
* The VTS statistical record contains information about physical        09565400
* drive usage and physical mount performance of the library.            09565500
* The current record has a length of 256 bytes, of which only           09565600
* the first 128 bytes contain defined values.  When one or more         09565700
* VTS subsystems are installed in the library, the existing             09565800
* statistics continue to reflect all physical movement of               09565900
* cartridges within the physical library including that of the          09566000
* VTS subsystems. The virtual mount statistics and operational          09566100
* information about the VTS are reported in bytes 128:211.              09566200
* Although up to two VTS subsystems can be configured in a              09566300
* library, the statistics reported in bytes 128:211 are only            09566400
* for the specific VTS subsystem the request was issued to.             09566500
* For statistical data requests issued to a non-VTS device,             09566600
* bytes 128:211 contain X'00'.                                          09566700
*                                                                       09566800
*********************************************************************** 09566900
SMF94VTS DSECT ,                   Start of VTS Statistics         @04A 09567000
SMF94VNO DS    X'00'               cluster library number     @ge2      09567200
SMF94VLS DS    CL5' '              Library sequence number for the      09567400
*                                  library segment for which the VTS    09567500
*                                  statistics are being reported.       09567600
SMF94VTI DS    X'00'               Number of underlying physical        09567800
*                                  tape devices currently installed     09567900
*                                  in the VTS subsystem.                09568000
*                                  Contains zero with F/C4001      @30a 09568100
SMF94VTA DS    X'00'               Number of underlying physical        09568200
*                                  tape devices currently available     09568300
*                                  for use by the VTS subsystem.        09568400
*                                  Contains zero with F/C4001      @30a 09568500
SMF94VTX DS    X'00'               Maximum number of underlying         09568600
*                                  physical tape devices mounted        09568700
*                                  concurrently in this VTS during      09568800
*                                  last hour.                           09568900
*                                  Contains zero with F/C4001      @30a 09569000
SMF94VTN DS    X'00'               Minimum number of underlying         09569100
*                                  physical tape devices mounted        09569200
*                                  concurrently in this VTS during      09569300
*                                  last hour.                           09569400
*                                  Contains zero with F/C4001      @30a 09569500
SMF94VTV DS    X'00'               Average number of underlying         09569600
*                                  physical tape devices mounted        09569700
*                                  concurrently in this VTS during      09569800
*                                  last hour. Value is determined by    09569900
*                                  summing number of concurrently       09570000
*                                  mounted physical devices every 10    09570100
*                                  seconds, and dividing resultant sum  09570200
*                                  by 360 during hourly statistics      09570300
*                                  generation.                          09570400
*                                  Contains zero with F/C4001      @30a 09570500
SMF94VR2 DS    X'00'               Reserved, set to X'00'               09570600
SMF94VMX DS    H'0'                Maximum time in seconds used by      09570800
*                                  the library to perform a mount       09570900
*                                  request for a physical drive in      09571000
*                                  the VTS in the last hour. Time is    09571100
*                                  accrued from time mount request      09571200
*                                  is accepted until it is completed.   09571300
*                                  Mount time is accredited to the      09571400
*                                  hour that mount is completed.        09571500
*                                  Contains zero with F/C4001      @30a 09571600
SMF94VMN DS    H'0'                Mimimum time in seconds used by      09571700
*                                  the library to perform a mount       09571800
*                                  request for a physical drive in      09571900
*                                  the VTS in the last hour. Time is    09572000
*                                  accrued from time mount request      09572100
*                                  is accepted until it is completed.   09572200
*                                  Mount time is accredited to the      09572300
*                                  hour that mount is completed.        09572400
*                                  Contains zero with F/C4001      @30a 09572500
SMF94VMV DS    H'0'                Average time in seconds used by      09572600
*                                  the library to perform a mount       09572700
*                                  request for a physical drive in      09572800
*                                  the VTS in the last hour. Time is    09572900
*                                  accrued from time mount request      09573000
*                                  is accepted until it is completed.   09573100
*                                  Mount time is accredited to the      09573200
*                                  hour that mount is completed.        09573300
*                                  Contains zero with F/C4001      @30a 09573400
SMF94VPS DS    H'0'                The number of physical mount         09573500
*                                  requests completed in last hour      09573600
*                                  to satisfy stage mounts.             09573700
*                                  Contains zero with F/C4001      @30a 09573800
SMF94VPM DS    H'0'                The number of physical mount         09573900
*                                  requests completed in last hour      09574000
*                                  to satisfy migrate requests.         09574100
*                                  Contains zero with F/C4001      @30a 09574200
SMF94VPR DS    H'0'                The number of physical mount         09574300
*                                  requests completed in last hour      09574400
*                                  to satisfy reclamation mounts.       09574500
*                                  Contains zero with F/C4001      @30a 09574600
SMF94VDC DS    X'00'               The number of virtual devices        09574700
*                                  configured in this VTS at the        09574800
*                                  time request for statistics was      09574900
*                                  received (current.)                  09575000
*                                  Contains zero with F/C4001      @30a 09575100
SMF94VDX DS    X'00'               The maximum number of virtual        09575200
*                                  drives that were concurrently        09575300
*                                  mounted in this VTS during           09575400
*                                  the last hour.                       09575500
*                                  Contains zero with F/C4001      @30a 09575600
SMF94VDN DS    X'00'               The minimum number of virtual        09575700
*                                  drives that were concurrently        09575800
*                                  mounted in this VTS during           09575900
*                                  the last hour.                       09576000
*                                  Contains zero with F/C4001      @30a 09576100
SMF94VDA DS    X'00'               The average number of virtual        09576200
*                                  drives that were concurrently        09576300
*                                  mounted in this VTS during the       09576400
*                                  last hour. Value is determined by    09576500
*                                  summing number of concurrently       09576600
*                                  mounted virtual devices every 10     09576700
*                                  seconds, and dividing resultant      09576800
*                                  sum by 360 during hourly             09576900
*                                  statistics generation.               09577000
*                                  Contains zero with F/C4001      @30a 09577100
SMF94VVX DS    H'0'                Maximum time in seconds that a       09577200
*                                  virtual drive was mounted in this    09577300
*                                  VTS during the last hour. Time is    09577400
*                                  accrued from completion of mount     09577500
*                                  until a demount is issued.           09577600
*                                  Mount time is accredited to the      09577700
*                                  hour that demount is issued.         09577800
SMF94VVN DS    H'0'                Mimimum time in seconds that a       09578000
*                                  virtual drive was mounted in this    09578100
*                                  VTS during the last hour. Time is    09578200
*                                  accrued from completion of mount     09578300
*                                  until a demount is issued.           09578400
*                                  Mount time is accredited to the      09578500
*                                  hour that demount is issued.         09578600
SMF94VVA DS    H'0'                Average time in seconds that a       09578800
*                                  virtual drive was mounted in this    09578900
*                                  VTS during the last hour. Time is    09579000
*                                  accrued from completion of mount     09579100
*                                  until a demount is issued.           09579200
*                                  Mount time is accredited to the      09579300
*                                  hour that demount is issued.         09579400
SMF94VRX DS    H'0'                Maximum time in seconds used to      09579600
*                                  complete a mount request on a        09579700
*                                  a virtual drive in the last          09579800
*                                  hour. Time is accrued from time      09579900
*                                  mount request is accepted until      09580000
*                                  it is completed.  Mount time is      09580100
*                                  accredited to the hour that the      09580200
*                                  mount is completed.                  09580300
SMF94VRN DS    H'0'                Minimum time in seconds used to      09580500
*                                  complete a mount request on a        09580600
*                                  a virtual drive in the last          09580700
*                                  hour. Time is accrued from time      09580800
*                                  mount request is accepted until      09580900
*                                  it is completed.  Mount time is      09581000
*                                  accredited to the hour that the      09581100
*                                  mount is completed.                  09581200
SMF94VRA DS    H'0'                Average time in seconds used to      09581400
*                                  complete a mount request on a        09581500
*                                  a virtual drive in in the last       09581600
*                                  hour. Time is accrued from time      09581700
*                                  mount request is accepted until      09581800
*                                  it is completed.  Mount time is      09581900
*                                  accredited to the hour that the      09582000
*                                  mount is completed.                  09582100
SMF94VFR DS    H'0'                The number of virtual mounts in      09582300
*                                  last hour using VTS Fast-Ready       09582400
*                                  facility.  Fast-Ready is used for    09582500
*                                  mount-from-category requests for     09582600
*                                  which the specified category has     09582700
*                                  the Fast-Ready attribute set, or     09582800
*                                  for specific volume requests for     09582900
*                                  which the specified volume is, at    09583000
*                                  the time the mount request is        09583100
*                                  received, assigned to a category     09583200
*                                  that has the Fast-Ready attribute    09583300
*                                  set.                                 09583400
SMF94VMH DS    H'0'                The number of virtual mounts in      09583600
*                                  last hour that were completed        09583700
*                                  for specific requested volume        09583800
*                                  found resident in Tape Volume        09583900
*                                  Cache (specific mount hits.)         09584000
SMF94VMS DS    H'0'                The number of virtual mounts in      09584200
*                                  last hour that were completed        09584300
*                                  with specific requested logical      09584400
*                                  volume staged from a physical tape   09584500
*                                  back into Tape Volume Cache.         09584600
SMF94VMP DS    H'0'                The number of virtual volumes for    09584800
*                                  which a premigrate operation was     09584900
*                                  completed in the last hour.          09585000
SMF94VBW DS    F'0'                The total number of bytes written    09585200
*                                  successfully through host channels   09585300
*                                  to virtual volumes in an integral    09585400
*                                  multiple of 4096 bytes during the    09585500
*                                  last hour.  If number of bytes       09585600
*                                  written is not an integer multiple   09585700
*                                  of 4096, the number is rounded up.   09585800
SMF94VBR DS    F'0'                The total number of bytes read       09586000
*                                  successfully through host channels   09586100
*                                  from virtual volumes in an integral  09586200
*                                  multiple of 4096 bytes during the    09586300
*                                  last hour.  If number of bytes       09586400
*                                  read is not an integer multiple      09586500
*                                  of 4096, the number is rounded up.   09586600
SMF94VTW DS    F'0'                The total number of bytes written    09586800
*                                  successfully by VTS to its attached  09586900
*                                  physical drives in an integral       09587000
*                                  multiple of 4096 bytes during the    09587100
*                                  last hour.  If number of bytes       09587200
*                                  written is not an integer multiple   09587300
*                                  of 4096, the number is rounded up.   09587400
*                                  Bytes are accredited to the hour in  09587500
*                                  which the underlying premigrates     09587600
*                                  of virtual volumes complete.         09587700
*                                  Contains zero with F/C4001      @30a 09587800
SMF94VTR DS    F'0'                The total number of bytes read       09587900
*                                  successfully by VTS from its         09588000
*                                  attached physical drives in an       09588100
*                                  integral multiple of 4096 bytes      09588200
*                                  during the last hour. If the         09588300
*                                  number of bytes read is not an       09588400
*                                  integer multiple of 4096, the        09588500
*                                  the number is rounded up. Bytes      09588600
*                                  are accredited to the hour in        09588700
*                                  which the underlying stage           09588800
*                                  requests complete.                   09588900
*                                  Contains zero with F/C4001      @30a 09589000
SMF94VCA DS    H'0'                The average age, in minutes, of      09589100
*                                  the times of last reference of the   09589200
*                                  virtual volumes in the tape volume   09589300
*                                  cache at the end of the reported     09589400
*                                  hour.                                09589500
*                                  Contains zero with F/C4001      @30a 09589600
SMF94VCZ DS    H'0'                The average size (mb) of the virtual 09589700
*                                  volumes in the Tape Volume Cache at  09589800
*                                  the end of the reported hour.        09589900
*                                  Contains zero with F/C4001      @30a 09590200
SMF94VNM DS    H'0'                The number of virtual volumes in     09590400
*                                  Tape Volume Cache at the end of      09590500
*                                  reported hour.                       09590600
SMF94VR3 DS    H'00'               Reserved, set to X'00'               09590800
SMF94VBA DS    F'0'                The number of megabytes of data      09591000
*                                  on the active logical volumes        09591100
*                                  which are on VTS stacked volumes     09591200
*                                  at the end of the reported hour.     09591300
SMF94VLA DS    F'0'                The number of active logical         09591600
*                                  volumes which are on VTS stacked     09591700
*                                  volumes at the end of the reported   09591800
*                                  hour.                                09591900
SMF94VEC DS    F'0'                The total estimated amount of        09592100
*                                  storage capacity provided by the     09592200
*                                  empty 3590 cartridges managed by     09592300
*                                  VTS in an integral multiple of       09592400
*                                  1,048,576 bytes (1 MBytes) at the    09592500
*                                  end of the reported hour.            09592600
*                                  End of VTS Statistics         @04A   09593500
*********************************************************************** 09593700
* VTS Import/Export STATS        (bytes 212-255 of source record) @IXA  09593900
*                                                                 @IXA  09594100
* The VTS import/export record contains information about 1 hours @IXA  09594300
* import/export activity in a VTS Library.                        @IXA  09594500
*********************************************************************** 09594700
SMF94X00 DSECT ,                   Start of import/export stats   @IXA  09594900
SMF94IM1 DS    H'0'                count of physical volumes            09595100
*                                  processed during import oper-        09595300
*                                  ations that completed in the         09595500
*                                  last hour.  (212:213)                09595700
SMF94EX1 DS    H'0'                count of the number of physical      09595900
*                                  volumes that contain the             09596100
*                                  successfully exported logical        09596300
*                                  volumes exported during the last     09596500
*                                  hour.  (214:215)               @IX2  09596700
SMF94IM2 DS    F'0'                count of the number of logical       09596900
*                                  volumes successfully imported        09597100
*                                  during import operations that        09597300
*                                  completed during the last hour       09597500
*                                  (216:219)                      @IX2  09597700
SMF94EX2 DS    F'0'                count of the number of logical       09597900
*                                  volumes that were successfully       09598100
*                                  exported for export operations       09598300
*                                  completed in the last hour.          09598500
*                                  (220:223)                      @IX2  09598700
SMF94IM3 DS    F'0'                megabytes of data imported for       09598900
*                                  import operations that completed     09599100
*                                  in the last hour.                    09599300
*                                  (224:227)                      @IX2  09599500
SMF94EX3 DS    F'0'                megabytes of data exported           09599700
*                                  during export operation that         09599900
*                                  completed in the last hour.          09600100
*                                  (228:231)                      @IX2  09600300
SMF94IM4 DS    F'0'                megabytes of data that was moved     09600500
*                                  from one physical stacked volume     09600700
*                                  to another as part of the import     09600900
*                                  operations completed in the last     09601100
*                                  hour.  (232:235)                     09601300
SMF94EX4 DS    F'0'                megabytes moved from one             09601500
*                                  physical stacked volume to           09601700
*                                  another as part of the export        09601900
*                                  operations completed in the          09602100
*                                  last hour.  (236:239)                09602300
         DS    CL8                 Reserved, set to x'00'         @IX2  09602500
SMF94ACA DS    H'0'                Accessor A mounts. The count of      09602900
*                                  the number of mount operations       09603100
*                                  accessor A completed during the      09603300
*                                  last hour.  (248:249)          @IX2  09603500
SMF94ACB DS    H'0'                Accessor B mounts. The count of      09603700
*                                  the number of mount operations       09603900
*                                  accessor A completed during the      09604100
*                                  last hour.  (250:251)          @IX2  09604300
         DS    CL4                 Reserved, set to x'00'         @IX2  09604700
*********************************************************************** 09605500
* Enhanced VTS Statistics                                         @gem  09606100
*********************************************************************** 09606700
S94STATS DSECT ,                   Start of enhanced VTS stats    @gem  09607300
S94BSRAT DS    H'0'                backstore comp. ratio                09607900
S94HARAT DS    H'0'                adapter comp. ratio                  09608500
S94TVCS  DS    H'0'                tape volume cache size               09608800
S94ESCON DS    X'00'               number of escon channels             09609100
S94SCSI  DS    X'00'               number of scsi channels              09609400
S94NUMBS DS    F'0'                channel blocks written               09609700
S940KB   DS    X'00'               0   to 2K                            09610300
S942KB   DS    X'00'               2k  to 4k                            09610900
S944KB   DS    X'00'               4k  to 8k                            09611500
S948KB   DS    X'00'               8k  to 16k                           09612100
S9416KB  DS    X'00'               16k to 32k                           09612700
S9432KB  DS    X'00'               32k to 64k                           09613300
S9464KB  DS    X'00'               greater than 64k                     09613900
S94RCPRT DS    X'00'               recall predominate                   09614500
S94WROVT DS    X'00'               write overrun                        09615100
         DS    X'00'               reserved                             09615700
         DS    H'0'                reserved (for allignment)            09616300
S94AVRCT DS    F'0'                average recall                       09616900
S94AVWOT DS    F'0'                average write overrun                09617500
         DS    F'0'                reserved                             09618100
S94TOTAT DS    F'0'                overall                              09618700
S94MAXFR DS    H'0'                max fast ready mount time            09619300
S94MINFR DS    H'0'                min fast ready mount time            09619900
S94AVGFR DS    H'0'                avg fast ready mount time            09620500
S94MAXCH DS    H'0'                max cache hit  mount time            09621100
S94MINCH DS    H'0'                min cache hit  mount time            09621700
S94AVGCH DS    H'0'                avg cache hit  mount time            09622300
S94MAXRM DS    H'0'                max recall mnt mount time            09622900
S94MINRM DS    H'0'                min recall mnt mount time            09623500
S94AVGRM DS    H'0'                avg recall mnt mount time            09624100
S94ADV05 DS    H'0'                05% active data volume               09624700
S94ADV10 DS    H'0'                10% active data volume               09625300
S94ADV15 DS    H'0'                15% active data volume               09625900
S94ADV20 DS    H'0'                20% active data volume               09626500
S94ADV25 DS    H'0'                25% active data volume               09627100
S94ADV30 DS    H'0'                30% active data volume               09627700
S94ADV35 DS    H'0'                35% active data volume               09628300
S94ADV40 DS    H'0'                40% active data volume               09628900
S94ADV45 DS    H'0'                45% active data volume               09629500
S94ADV50 DS    H'0'                50% active data volume               09630100
S94ADV55 DS    H'0'                55% active data volume               09630700
S94ADV60 DS    H'0'                60% active data volume               09631300
S94ADV65 DS    H'0'                65% active data volume               09631900
S94ADV70 DS    H'0'                70% active data volume               09632500
S94ADV75 DS    H'0'                75% active data volume               09633100
S94ADV80 DS    H'0'                80% active data volume               09633700
S94ADV85 DS    H'0'                85% active data volume               09634300
S94ADV90 DS    H'0'                90% active data volume               09634900
S94ADV95 DS    H'0'                95% active data volume               09635500
S94ADV00 DS    H'0'                100% active data volume              09636100
S94THRES DS    X'00'               reclaim threshold                    09636700
         DS    CL1                 reserved (set to zero)               09637300
S94SRTCT DS    H'0'                scratch stacked volume ct            09637900
S94PRICT DS    H'0'                private stacked volume ct            09638500
S94MTVCA DS    F'0'                max tape volume cache age            09638700
S94CMGTS DS    X'00'               cache management settings       @50a 09638800
S94CMVAL EQU   X'80'               fields are valid                @50a 09638900
S94CVPRF EQU   X'70'               copy volume management          @50ax09639000
                                   preference level(0-7)           @50a 09639100
S94RVPRF EQU   X'07'               recall volume management        @50ax09639200
                                   preference level(0-7)           @50a 09639300
         DS    CL3                 reserved                        @51a 09639400
S94LVVCM DS    H                   VTS code modification value     @51a 09639500
S94LVVCF DS    H                   VTS code fix value              @51a 09639600
S94LVLMV DS    H                   LM  code version value          @51a 09639700
S94LVLMR DS    H                   LM  code release value          @51a 09639800
         DS    CL8                 reserved                        @51a 09639900
*********************************************************************** 09640000
* Composite library statistics                                    @gem  09640100
* Contains report for up to 8 AX0's in composite lib.                   09640200
*********************************************************************** 09640300
S94CLLVC DS    F'0'                logical volume to copy               09640400
S94CLDTC DS    F'0'                data to copy                         09640500
S94CLMT0 DS    H'0'                mounts for VTS-0                     09640600
S94CLMT1 DS    H'0'                mounts for VTS-1                     09640700
         DS    CL4                 reserved (set to zero)               09641700
S94CLDC0 DS    F'0'                data copied for AX0            #0    09641900
S94CLVC0 DS    F'0'                volumes copied for AX0         #0    09642100
S94CLRD0 DS    F'0'                read data transferred for AX0  #0    09642300
S94CLWD0 DS    F'0'                write data transferred for AX0 #0    09642500
S94CLCM0 DS    H'0'                category mounts for AX0        #0    09642600
S94CLSM0 DS    H'0'                specific cache mounts for AX0  #0    09642700
S94CLRM0 DS    H'0'                specific recall mounts for AX0 #0    09642800
S94CLCR0 DS    BL2                 compression ratio               @50a 09642900
S94CLPR0 DS    BL1                 distributed library preferences @50a 09643000
S94CLPI0 EQU   X'F0'    xxxx ....  preferred I/O VTS               @50a 09643100
S94CLPM0 EQU   X'0F'    .... xxxx  preferred master VTS            @50a 09643200
         DS    0BL2                configured settings (2 bytes)   @50a 09643300
*                                  The reported settings in this 2 @50a 09643400
*                                  byte field are only valid if    @50a 09643500
*                                  bit S94CLVA0 is set.            @50a 09643600
S94CLC10 DS    1BL1                configured settings (1st byte)  @50a 09643700
S94CLDM0 EQU   X'C0'    xx.. ....  default copy mode               @50a 09643800
S94CLFS0 EQU   X'20'    ..1. ....  force scrtch to preferred VTS   @50a 09643900
S94CLPV0 EQU   X'10'    ...1 ....  I/O selection criteria=primary  @50a 09644000
S94CLCO0 EQU   X'0C'    .... xx..  controller operation mode       @50a 09644100
S94CLWP0 EQU   X'02'    .... ..x.  write protected mode            @53a 09644200
S94CLC20 DS    1BL1                Configured settings (2nd byte)  @50a 09644300
S94CLVA0 EQU   X'01'    .... ...1  configured field valid indicator@50a 09644400
S94CLLS0 DS    BL1                 relative link speeds:           @50a 09644500
S94CLLS0_AX0VTS0 EQU X'F0'         AX0 to VTS0 link speed          @50a 09644600
S94CLLS0_AX0VTS1 EQU X'0F'         AX0 to VTS1 link speed          @50a 09644700
         DS    BL4                 reserved (set to zero)          @50a 09644800
S94CLDC1 DS    F'0'                data copied for AX0            #1    09644900
S94CLVC1 DS    F'0'                volumes copied for AX0         #1    09645000
S94CLRD1 DS    F'0'                read data transferred for AX0  #1    09645100
S94CLWD1 DS    F'0'                write data transferred for AX0 #1    09645200
S94CLCM1 DS    H'0'                category mounts for AX0        #1    09645300
S94CLSM1 DS    H'0'                specific cache mounts for AX0  #1    09645700
S94CLRM1 DS    H'0'                specific recall mounts for AX0 #1    09646300
S94CLCR1 DS    BL2                 compression ratio               @50a 09646400
S94CLPR1 DS    BL1                 distributed library preferences @50a 09646500
S94CLPI1 EQU   X'F0'    xxxx ....  preferred I/O VTS               @50a 09646600
S94CLPM1 EQU   X'0F'    .... xxxx  preferred master VTS            @50a 09646700
         DS    0BL2                configured settings (2 bytes)   @50a 09646800
*                                  The reported settings in this 2 @50a 09646900
*                                  byte field are only valid if    @50a 09647000
*                                  bit S94CLVA1 is set.            @50a 09647100
S94CLC11 DS    1BL1                configured settings (1st byte)  @50a 09647200
S94CLDM1 EQU   X'C0'    xx.. ....  default copy mode               @50a 09647300
S94CLFS1 EQU   X'20'    ..1. ....  force scrtch to preferred VTS   @50a 09647400
S94CLPV1 EQU   X'10'    ...1 ....  I/O selection criteria=primary  @50a 09647500
S94CLCO1 EQU   X'0C'    .... xx..  controller operation mode       @50a 09647600
S94CLWP1 EQU   X'02'    .... ..x.  write protected mode            @53a 09647700
S94CLC21 DS    1BL1                Configured settings (2nd byte)  @50a 09647800
S94CLVA1 EQU   X'01'    .... ...1  configured field valid indicator@50a 09647900
S94CLLS1 DS    BL1                 relative link speeds:           @50a 09648000
S94CLLS1_AX0VTS0 EQU X'F0'         AX0 to VTS0 link speed          @50a 09648100
S94CLLS1_AX0VTS1 EQU X'0F'         AX0 to VTS1 link speed          @50a 09648200
         DS    BL4                 reserved (set to zero)          @06a 09648300
S94CLDC2 DS    F'0'                data copied for AX0            #2    09648400
S94CLVC2 DS    F'0'                volumes copied for AX0         #2    09648500
S94CLRD2 DS    F'0'                read data transferred for AX0  #2    09648700
S94CLWD2 DS    F'0'                write data transferred for AX0 #2    09649300
S94CLCM2 DS    H'0'                category mounts for AX0        #2    09649900
S94CLSM2 DS    H'0'                specific cache mounts for AX0  #2    09650500
S94CLRM2 DS    H'0'                specific recall mounts for AX0 #2    09651100
S94CLCR2 DS    BL2                 compression ratio               @50a 09651200
S94CLPR2 DS    BL1                 distributed library preferences @50a 09651300
S94CLPI2 EQU   X'F0'    xxxx ....  preferred I/O VTS               @50a 09651400
S94CLPM2 EQU   X'0F'    .... xxxx  preferred master VTS            @50a 09651500
         DS    0BL2                configured settings (2 bytes)   @50a 09651600
*                                  The reported settings in this 2 @50a 09651700
*                                  byte field are only valid if    @50a 09651800
*                                  bit S94CLVA2 is set.            @50a 09651900
S94CLC12 DS    1BL1                configured settings (1st byte)  @50a 09652000
S94CLDM2 EQU   X'C0'    xx.. ....  default copy mode               @50a 09652100
S94CLFS2 EQU   X'20'    ..1. ....  force scrtch to preferred VTS   @50a 09652200
S94CLPV2 EQU   X'10'    ...1 ....  I/O selection criteria=primary  @50a 09652300
S94CLCO2 EQU   X'0C'    .... xx..  controller operation mode       @50a 09652400
S94CLWP2 EQU   X'02'    .... ..x.  write protected mode            @53a 09652500
S94CLC22 DS    1BL1                Configured settings (2nd byte)  @50a 09652600
S94CLVA2 EQU   X'01'    .... ...1  configured field valid indicator@50a 09652700
S94CLLS2 DS    BL1                 relative link speeds:           @50a 09652800
S94CLLS2_AX0VTS0 EQU X'F0'         AX0 to VTS0 link speed          @50a 09652900
S94CLLS2_AX0VTS1 EQU X'0F'         AX0 to VTS1 link speed          @50a 09653000
         DS    BL4                 reserved (set to zero)          @06a 09653100
S94CLDC3 DS    F'0'                data copied for AX0            #3    09653200
S94CLVC3 DS    F'0'                volumes copied for AX0         #3    09653300
S94CLRD3 DS    F'0'                read data transferred for AX0  #3    09653400
S94CLWD3 DS    F'0'                write data transferred for AX0 #3    09653500
S94CLCM3 DS    H'0'                category mounts for AX0        #3    09653600
S94CLSM3 DS    H'0'                specific cache mounts for AX0  #3    09653700
S94CLRM3 DS    H'0'                specific recall mounts for AX0 #3    09653800
S94CLCR3 DS    BL2                 compression ratio               @50a 09653900
S94CLPR3 DS    BL1                 distributed library preferences @50a 09654000
S94CLPI3 EQU   X'F0'    xxxx ....  preferred I/O VTS               @50a 09654100
S94CLPM3 EQU   X'0F'    .... xxxx  preferred master VTS            @50a 09654200
         DS    0BL2                configured settings (2 bytes)   @50a 09654300
*                                  The reported settings in this 2 @50a 09654400
*                                  byte field are only valid if    @50a 09654500
*                                  bit S94CLVA3 is set.            @50a 09654600
S94CLC13 DS    1BL1                configured settings (1st byte)  @50a 09654700
S94CLDM3 EQU   X'C0'    xx.. ....  default copy mode               @50a 09654800
S94CLFS3 EQU   X'20'    ..1. ....  force scrtch to preferred VTS   @50a 09654900
S94CLPV3 EQU   X'10'    ...1 ....  I/O selection criteria=primary  @50a 09655000
S94CLCO3 EQU   X'0C'    .... xx..  controller operation mode       @50a 09655100
S94CLWP3 EQU   X'02'    .... ..x.  write protected mode            @53a 09655200
S94CLC23 DS    1BL1                Configured settings (2nd byte)  @50a 09655300
S94CLVA3 EQU   X'01'    .... ...1  configured field valid indicator@50a 09655400
S94CLLS3 DS    BL1                 relative link speeds:           @50a 09655500
S94CLLS3_AX0VTS0 EQU X'F0'         AX0 to VTS0 link speed          @50a 09655600
S94CLLS3_AX0VTS1 EQU X'0F'         AX0 to VTS1 link speed          @50a 09655700
         DS    BL4                 reserved (set to zero)          @06a 09655800
S94CLDC4 DS    F'0'                data copied for AX0            #4    09655900
S94CLVC4 DS    F'0'                volumes copied for AX0         #4    09656400
S94CLRD4 DS    F'0'                read data transferred for AX0  #4    09657700
S94CLWD4 DS    F'0'                write data transferred for AX0 #4    09659000
S94CLCM4 DS    H'0'                category mounts for AX0        #4    09660300
S94CLSM4 DS    H'0'                specific cache mounts for AX0  #4    09661600
S94CLRM4 DS    H'0'                specific recall mounts for AX0 #4    09662900
S94CLCR4 DS    BL2                 compression ratio               @50a 09663000
S94CLPR4 DS    BL1                 distributed library preferences @50a 09663100
S94CLPI4 EQU   X'F0'    xxxx ....  preferred I/O VTS               @50a 09663200
S94CLPM4 EQU   X'0F'    .... xxxx  preferred master VTS            @50a 09663300
         DS    0BL2                configured settings (2 bytes)   @50a 09663400
*                                  The reported settings in this 2 @50a 09663500
*                                  byte field are only valid if    @50a 09663600
*                                  bit S94CLVA4 is set.            @50a 09663700
S94CLC14 DS    1BL1                configured settings (1st byte)  @50a 09663800
S94CLDM4 EQU   X'C0'    xx.. ....  default copy mode               @50a 09663900
S94CLFS4 EQU   X'20'    ..1. ....  force scrtch to preferred VTS   @50a 09664000
S94CLPV4 EQU   X'10'    ...1 ....  I/O selection criteria=primary  @50a 09664100
S94CLCO4 EQU   X'0C'    .... xx..  controller operation mode       @50a 09664200
S94CLWP4 EQU   X'02'    .... ..x.  write protected mode            @53a 09664300
S94CLC24 DS    1BL1                Configured settings (2nd byte)  @50a 09664400
S94CLVA4 EQU   X'01'    .... ...1  configured field valid indicator@50a 09664500
S94CLLS4 DS    BL1                 relative link speeds:           @50a 09664600
S94CLLS4_AX0VTS0 EQU X'F0'         AX0 to VTS0 link speed          @50a 09664700
S94CLLS4_AX0VTS1 EQU X'0F'         AX0 to VTS1 link speed          @50a 09664800
         DS    BL4                 reserved (set to zero)          @06a 09665100
S94CLDC5 DS    F'0'                data copied for AX0            #5    09665500
S94CLVC5 DS    F'0'                volumes copied for AX0         #5    09666800
S94CLRD5 DS    F'0'                read data transferred for AX0  #5    09668100
S94CLWD5 DS    F'0'                write data transferred for AX0 #5    09669400
S94CLCM5 DS    H'0'                category mounts for AX0        #5    09670700
S94CLSM5 DS    H'0'                specific cache mounts for AX0  #5    09672000
S94CLRM5 DS    H'0'                specific recall mounts for AX0 #5    09673300
S94CLCR5 DS    BL2                 compression ratio               @50a 09673400
S94CLPR5 DS    BL1                 distributed library preferences @50a 09673500
S94CLPI5 EQU   X'F0'    xxxx ....  preferred I/O VTS               @50a 09673600
S94CLPM5 EQU   X'0F'    .... xxxx  preferred master VTS            @50a 09673700
         DS    0BL2                configured settings (2 bytes)   @50a 09673800
*                                  The reported settings in this 2 @50a 09673900
*                                  byte field are only valid if    @50a 09674000
*                                  bit S94CLVA5 is set.            @50a 09674100
S94CLC15 DS    1BL1                configured settings (1st byte)  @50a 09674200
S94CLDM5 EQU   X'C0'    xx.. ....  default copy mode               @50a 09674300
S94CLFS5 EQU   X'20'    ..1. ....  force scrtch to preferred VTS   @50a 09674400
S94CLPV5 EQU   X'10'    ...1 ....  I/O selection criteria=primary  @50a 09674500
S94CLCO5 EQU   X'0C'    .... xx..  controller operation mode       @50a 09674600
S94CLWP5 EQU   X'02'    .... ..x.  write protected mode            @53a 09674700
S94CLC25 DS    1BL1                Configured settings (2nd byte)  @50a 09674800
S94CLVA5 EQU   X'01'    .... ...1  configured field valid indicator@50a 09674900
S94CLLS5 DS    BL1                 relative link speeds:           @50a 09675000
S94CLLS5_AX0VTS0 EQU X'F0'         AX0 to VTS0 link speed          @50a 09675100
S94CLLS5_AX0VTS1 EQU X'0F'         AX0 to VTS1 link speed          @50a 09675200
         DS    BL4                 reserved (set to zero)          @06a 09675500
S94CLDC6 DS    F'0'                data copied for AX0            #6    09675900
S94CLVC6 DS    F'0'                volumes copied for AX0         #6    09677200
S94CLRD6 DS    F'0'                read data transferred for AX0  #6    09678500
S94CLWD6 DS    F'0'                write data transferred for AX0 #6    09679800
S94CLCM6 DS    H'0'                category mounts for AX0        #6    09681100
S94CLSM6 DS    H'0'                specific cache mounts for AX0  #6    09682400
S94CLRM6 DS    H'0'                specific recall mounts for AX0 #6    09683700
S94CLCR6 DS    BL2                 compression ratio               @50a 09683800
S94CLPR6 DS    BL1                 distributed library preferences @50a 09683900
S94CLPI6 EQU   X'F0'    xxxx ....  preferred I/O VTS               @50a 09684000
S94CLPM6 EQU   X'0F'    .... xxxx  preferred master VTS            @50a 09684100
         DS    0BL2                configured settings (2 bytes)   @50a 09684200
*                                  The reported settings in this 2 @50a 09684300
*                                  byte field are only valid if    @50a 09684400
*                                  bit S94CLVA6 is set.            @50a 09684500
S94CLC16 DS    1BL1                configured settings (1st byte)  @50a 09684600
S94CLDM6 EQU   X'C0'    xx.. ....  default copy mode               @50a 09684700
S94CLFS6 EQU   X'20'    ..1. ....  force scrtch to preferred VTS   @50a 09684800
S94CLPV6 EQU   X'10'    ...1 ....  I/O selection criteria=primary  @50a 09684900
S94CLCO6 EQU   X'0C'    .... xx..  controller operation mode       @50a 09685000
S94CLWP6 EQU   X'02'    .... ..x.  write protected mode            @53a 09685100
S94CLC26 DS    1BL1                Configured settings (2nd byte)  @50a 09685200
S94CLVA6 EQU   X'01'    .... ...1  configured field valid indicator@50a 09685300
S94CLLS6 DS    BL1                 relative link speeds:           @50a 09685400
S94CLLS6_AX0VTS0 EQU X'F0'         AX0 to VTS0 link speed          @50a 09685500
S94CLLS6_AX0VTS1 EQU X'0F'         AX0 to VTS1 link speed          @50a 09685600
         DS    BL4                 reserved (set to zero)          @06a 09685900
S94CLDC7 DS    F'0'                data copied for AX0            #7    09686300
S94CLVC7 DS    F'0'                volumes copied for AX0         #7    09687600
S94CLRD7 DS    F'0'                read data transferred for AX0  #7    09688900
S94CLWD7 DS    F'0'                write data transferred for AX0 #7    09690200
S94CLCM7 DS    H'0'                category mounts for AX0        #7    09691500
S94CLSM7 DS    H'0'                specific cache mounts for AX0  #7    09692800
S94CLRM7 DS    H'0'                specific recall mounts for AX0 #7    09694100
S94CLCR7 DS    BL2                 compression ratio               @50a 09694200
S94CLPR7 DS    BL1                 distributed library preferences @50a 09694300
S94CLPI7 EQU   X'F0'    xxxx ....  preferred I/O VTS               @50a 09694400
S94CLPM7 EQU   X'0F'    .... xxxx  preferred master VTS            @50a 09694500
         DS    0BL2                configured settings (2 bytes)   @50a 09694600
*                                  The reported settings in this 2 @50a 09694700
*                                  byte field are only valid if    @50a 09694800
*                                  bit S94CLVA7 is set.            @50a 09694900
S94CLC17 DS    1BL1                configured settings (1st byte)  @50a 09695000
S94CLDM7 EQU   X'C0'    xx.. ....  default copy mode               @50a 09695100
S94CLFS7 EQU   X'20'    ..1. ....  force scrtch to preferred VTS   @50a 09695200
S94CLPV7 EQU   X'10'    ...1 ....  I/O selection criteria=primary  @50a 09695300
S94CLCO7 EQU   X'0C'    .... xx..  controller operation mode       @50a 09695400
S94CLWP7 EQU   X'02'    .... ..x.  write protected mode            @53a 09695500
S94CLC27 DS    1BL1                Configured settings (2nd byte)  @50a 09695600
S94CLVA7 EQU   X'01'    .... ...1  configured field valid indicator@50a 09695700
S94CLLS7 DS    BL1                 relative link speeds:           @50a 09695800
S94CLLS7_AX0VTS0 EQU X'F0'         AX0 to VTS0 link speed          @50a 09695900
S94CLLS7_AX0VTS1 EQU X'0F'         AX0 to VTS1 link speed          @50a 09696000
         DS    BL4                 reserved (set to zero)          @06a 09696100
*********************************************************************** 09696200
* VTC code levels in a PTP VTS.                                    @51a 09696300
*                                                                  @51a 09696400
* The following set of fields report the code levels of            @51a 09696500
* the VTCs in a PTP VTS subsystem that generated the               @51a 09696600
* statistical record. For each of the 8 sets of fields,            @51a 09696700
* the field can return zeros for the following cases:              @51a 09696800
*                                                                  @51a 09696900
* 1.The request was for a distributed library of a PTP.            @51a 09697000
* 2.One or more VTC was not installed or was unavailable.          @51a 09697100
* 3.The PTP VTS does not support providing code levels.            @51a 09697200
*********************************************************************** 09697300
S94CMV_VTC0        DS   H          code modification value         @51a 09697400
S94CFV_VTC0        DS   H          code fix value                  @51a 09697500
S94CMV_VTC1        DS   H          code modification value         @51a 09697600
S94CFV_VTC1        DS   H          code fix value                  @51a 09697700
S94CMV_VTC2        DS   H          code modification value         @51a 09697800
S94CFV_VTC2        DS   H          code fix value                  @51a 09697900
S94CMV_VTC3        DS   H          code modification value         @51a 09698000
S94CFV_VTC3        DS   H          code fix value                  @51a 09698100
S94CMV_VTC4        DS   H          code modification value         @51a 09698200
S94CFV_VTC4        DS   H          code fix value                  @51a 09698300
S94CMV_VTC5        DS   H          code modification value         @51a 09698400
S94CFV_VTC5        DS   H          code fix value                  @51a 09698500
S94CMV_VTC6        DS   H          code modification value         @51a 09698600
S94CFV_VTC6        DS   H          code fix value                  @51a 09698700
S94CMV_VTC7        DS   H          code modification value         @51a 09698800
S94CFV_VTC7        DS   H          code fix value                  @51a 09698900
                   DS   CL96       reserved (set to zero)          @51a 09699000
*                                                                       09699100
*********************************************************************** 09699200
* Definitions for the preferred I/O VTS which is reported in       @50a 09699300
* S94CLPI0-S94CLPI7 and in S94CLPM0-S94CLPM7                       @50a 09699400
*********************************************************************** 09699500
S94PREF_VTS0  EQU    B'1000'       VTS 0 is preferred              @50a 09699600
S94PREF_VTS1  EQU    B'1001'       VTS 1 is preferred              @50a 09699700
S94PREF_NONE  EQU    B'1111'       No Preference                   @50a 09699800
*********************************************************************** 09699900
* Definitions for the default copy mode which is reported in       @50a 09700000
* S94CLDM0-S94CLDM7                                                @50a 09700100
*********************************************************************** 09700200
S94COPY_DEFER EQU    B'00'         deferred copy mode              @50a 09700300
S94COPY_IMMED EQU    B'01'         immediate copy mode             @50a 09700400
*********************************************************************** 09700500
* Definitions for controller operation mode which is reported      @50a 09700600
* in S94CLCO0-S94CLCO7                                             @50a 09700700
*********************************************************************** 09700800
S94COM_NORM   EQU    B'00'         normal mode                     @50a 09700900
S94COM_READ   EQU    B'01'         read-only mode                  @50a 09701000
S94COM_RWD    EQU    B'10'         read/write disconnected         @50a 09701100
*********************************************************************** 09701200
* Definitions for relative link speeds which are reported in       @50a 09701300
* S94CLLS0_AX0VTS0 - S94CLLS7_AX0VTS0 and in                       @50a 09701400
* S94CLLS0_AX0VTS1 - S94CLLS7_AX0VTS1                              @50a 09701500
*********************************************************************** 09701600
S94LS1        EQU    B'0001'       ESCON < 5km, FICON < 30km       @50a 09701700
S94LS2        EQU    B'0010'       ESCON <10km, FICON < 80km       @50a 09701800
S94LS3        EQU    B'0011'       channel extender < 1000km,      @50a 09701900
*                                  ESCON over DWDM  < 10km,        @50a 09702000
*                                  FICON < 100km                   @50a 09702100
S94LS4        EQU    B'0100'       channel extender > 1000km,      @50a 09702200
*                                  ESCON over DWDM  < 15km         @50a 09702300
S94LS5        EQU    B'0101'       ESCON over DWDM  > 15km         @50a 09702400
*********************************************************************** 09702500
* When F/C 4001 is installed & enabled, the following statistics   @30a 09702600
* are reported.                                                    @30a 09702700
*********************************************************************** 09702800
S94OPM_VDC         DS   H          Virtual Drives Configured       @30a 09702900
S94OPM_MAXVDM      DS   H          Max Virtual Drives Mounted      @30a 09703000
*                                  during the last hour.           @30a 09703100
S94OPM_MINVDM      DS   H          Min Virtual Drives Mounted      @30a 09703200
*                                  during the last hour.           @30a 09703300
S94OPM_AVGVDM      DS   H          Avg Virtual Drives Mounted      @30a 09703400
*                                  during the last hour.           @30a 09703500
                   DS   CL8        reserved (set to zero)          @50a 09703600
*********************************************************************** 09703700
* When F/C 4001 is installed & enabled, contains information about:@30a 09703800
* Physical tape devices usage characteristics.                     @30a 09703900
* Each group of 32 bytes contains the statistics for the           @30a 09704000
* physical tape device usage of a specific device type in          @30a 09704100
* the VTS. Space is defined for 2 device types.                    @30a 09704200
*********************************************************************** 09704300
S94OPM_DCI1        DS   BL1        device class identifier:        @30a 09704400
*                                  X'00' no device class           @30a 09704500
*                                  X'11' 3590 model B1A            @30a 09704600
*                                  X'13' 3590 Model E1A            @30a 09704700
*                                  X'14' 3590 Model H1A            @52a 09704800
*                                  X'20' 3592 Model J1A            @52a 09704900
S94OPM_PDI1        DS   BL1        physical devices installed      @30a 09705000
S94OPM_CAFU1       DS   BL1        currently available for use     @30a 09705100
S94OPM_MAXCM1      DS   BL1        maximum concurrent mounts       @30a 09705200
*                                  during the last hour.           @30a 09705300
S94OPM_MINCM1      DS   BL1        minimum concurrent mounts       @30a 09705400
*                                  during the last hour.           @30a 09705500
S94OPM_AVGCM1      DS   BL1        average concurrent mounts       @30a 09705600
*                                  during the last hour.           @30a 09705700
S94OPM_MAXTTM1     DS   H          max time (in seconds) to mount  @30a 09705800
*                                  during the last hour.           @30a 09705900
S94OPM_MINTTM1     DS   H          min time (in seconds) to mount  @30a 09706000
*                                  during the last hour.           @30a 09706100
S94OPM_AVGTTM1     DS   H          avg time (in seconds) to mount  @30a 09706200
*                                  during the last hour.           @30a 09706300
S94OPM_STGMNTS1    DS   H          number of stage mounts          @30a 09706400
*                                  completed during the last hour. @30a 09706500
S94OPM_MIGMNTS1    DS   H          number of migration mounts      @30a 09706600
*                                  completed during the last hour. @30a 09706700
S94OPM_RECMNTS1    DS   H          number of reclamation mounts    @30a 09706800
*                                  completed during the last hour. @30a 09706900
S94OPM_SDEMNTS1    DS   H          number of secure data erasure   @53a 09707000
*                                  mounts completed during the     @53a 09707100
*                                  last hour.                      @53a 09707200
S94OPM_PPWRITN1    DS   F          megabytes premigrated from tape @30a 09707300
*                                  volume cache to a primary pool  @30a 09707400
*                                  during the last hour.           @30a 09707500
S94OPM_SPWRITN1    DS   F          megabytes premigrated from tape @30a 09707600
*                                  volume cache to a secondary pool@30a 09707700
*                                  during the last hour.           @30a 09707800
                   DS   BL4        reserved (set to zero)          @30a 09707900
S94OPM_DCI2        DS   BL1        device class identifier:        @30a 09708000
*                                  X'00' no device class           @30a 09708100
*                                  X'11' 3590 Model B1A            @30a 09708200
*                                  X'13' 3590 Model E1A            @30a 09708300
*                                  X'14' 3590 Model H1A            @52a 09708400
*                                  X'20' 3592 Model J1A            @52a 09708500
S94OPM_PDI2        DS   BL1        physical devices installed      @30a 09708600
S94OPM_CAFU2       DS   BL1        currently available for use     @30a 09708700
S94OPM_MAXCM2      DS   BL1        maximum concurrent mounts       @30a 09708800
*                                  during the last hour.           @30a 09708900
S94OPM_MINCM2      DS   BL1        minimum concurrent mounts       @30a 09709000
*                                  during the last hour.           @30a 09709100
S94OPM_AVGCM2      DS   BL1        average concurrent mounts       @30a 09709200
*                                  during the last hour.           @30a 09709300
S94OPM_MAXTTM2     DS   H          max time (in seconds) to mount  @30a 09709400
*                                  during the last hour.           @30a 09709500
S94OPM_MINTTM2     DS   H          min time (in seconds) to mount  @30a 09709600
*                                  during the last hour.           @30a 09709700
S94OPM_AVGTTM2     DS   H          avg time (in seconds) to mount  @30a 09709800
*                                  during the last hour.           @30a 09709900
S94OPM_STGMNTS2    DS   H          number of stage mounts          @30a 09710000
*                                  completed during the last hour. @30a 09710100
S94OPM_MIGMNTS2    DS   H          number of migration mounts      @30a 09710200
*                                  completed during the last hour. @30a 09710300
S94OPM_RECMNTS2    DS   H          number of reclamation mounts    @30a 09710400
*                                  completed during the last hour. @30a 09710500
S94OPM_SDEMNTS2    DS   H          number of secure data erasure   @53a 09710600
*                                  mounts completed during the     @53a 09710700
*                                  last hour.                      @53a 09710800
S94OPM_PPWRITN2    DS   F          megabytes premigrated from tape @30a 09710900
*                                  volume cache to a primary pool  @30a 09711000
*                                  during the last hour.           @30a 09711100
S94OPM_SPWRITN2    DS   F          megabytes premigrated from tape @30a 09711200
*                                  volume cache to a secondary pool@30a 09711300
*                                  during the last hour.           @30a 09711400
                   DS   BL4        reserved (set to zero)          @30a 09711500
*********************************************************************** 09711600
* When F/C 4001 is installed & enabled, the following VTS cache    @30a 09711700
* usage characteristics information is reported.                   @30a 09711800
*********************************************************************** 09711900
S94OPM_ARRAY       DS   8CL64      512 bytes of array data         @30a 09712000
*                                  Mapped by S94OPM_ARRAY_ENTRY    @30a 09712100
S94OPM_IARTAFRT    DS   H          average fast-ready mount time   @30a 09712300
S94OPM_IARTFRM     DS   H          fast-ready mounts               @30a 09712500
S94OPM_IARTCHMT    DS   H          average cache hit mount time    @30a 09712700
S94OPM_IARTCHM     DS   H          cache hit mounts                @30a 09712900
S94OPM_IARTCMMT    DS   H          average cache miss mount time   @30a 09713100
S94OPM_IARTCMM     DS   H          cache miss mounts               @30a 09713300
S94END             DS   0CL1       end of S94STATS                 @30a 09713500
*********************************************************************** 09713700
* Mapping for VTS cache usage information array (S94OPM_ARRAY)     @30a 09713900
*********************************************************************** 09714100
S94OPM_ARRAY_ENTDS DSECT                                                09714300
S94OPM_ARRAY_ENTRY DS   0CL64      S94OPM_ARRAY entry              @30a 09714500
S94OPM_PMC         DS   F          preference management control   @30a 09714700
S94OPM_VVIC        DS   F          virtual volumes in cache        @30a 09714900
S94OPM_DRIC        DS   F          data resident in cache          @30a 09715100
S94OPM_TVCA4       DS   F          tape volume cache age (4 hrs)   @30a 09715300
S94OPM_VM4         DS   F          volumes migrated last 4 hours   @51a 09715600
S94OPM_TVCA48      DS   F          tape volume cache age (48 hrs)  @30a 09715900
S94OPM_VM48        DS   F          volumes migrated last 48 hrs    @51a 09716200
S94OPM_TVCA35      DS   F          tape volume cache age (35 days) @30a 09716500
S94OPM_VM35        DS   F          volumes migrated last 35 days   @51a 09716800
S94OPM_FRMT        DS   H          avg. fast ready mount time      @30a 09717100
S94OPM_FRMNTS      DS   H          number fast-ready mounts        @30a 09717300
S94OPM_CHTIME      DS   H          avg. cache hit mount time       @30a 09717500
S94OPM_CHMNTS      DS   H          cache hit mounts                @30a 09717700
S94OPM_CMTIME      DS   H          avg. cache miss mount time      @30a 09717900
S94OPM_CMMNTS      DS   H          cache miss mounts               @30a 09718100
                   DS   BL16       reserved (set to zero)          @30a 09718300
*********************************************************************** 09718500
*  SMF Type 94 (Subtype 2) record, Volume Pool Statistics          @30a 09718700
*  Note: this data structure is valid when SMF94 subtype           @30a 09718900
*        field (SMF94STP) contains a 2.                            @30a 09719100
*********************************************************************** 09719300
SMF94S2  DSECT                                                          09719500
*********************************************************************** 09719700
*        SMF RECORD HEADER SEGMENT (24 bytes)                           09719900
*********************************************************************** 09720100
SMF94S2_RPS        DS   0CL24      Type 94 Record Header                09720300
SMF94S2_LEN        DS   H          Record Length                        09720500
SMF94S2_SEG        DS   H          Segment Descriptor                   09720700
SMF94S2_FLG        DS   BL1        Header Flag Byte                     09720900
SMF94S2_FNM        EQU  X'80'      ..Subsystem name follows             09721100
SMF94S2_FST        EQU  X'40'      ..Subtypes utilized                  09721300
SMF94S2_RTY        DS   BL1        Record Type=94 (hex 5E)              09721500
SMF94S2_C94        EQU  X'5E'      ..Type=94                            09721700
SMF94S2_TME        DS   CL4        Time since midnight, in hundredths   09721900
*                                  of a second, when the record was     09722100
*                                  moved into the SMF buffer.           09722300
SMF94S2_DTE        DS   PL4        Date when the record was moved       09722500
*                                  into the SMF buffer(packed decimal)  09722700
SMF94S2_SID        DS   CL4        System Id (from SMFPRMXX parm)       09722900
SMF94S2_WID        DS   CL4        Subsystem id, worktype indicator     09723100
SMF94S2_STP        DS   BL2        Record Subtype                       09723300
*                                  2 = VTS Volume Pooling Stats         09723500
*********************************************************************** 09723700
*  Self Defining Section                                                09723900
*********************************************************************** 09724100
SMF94S2_SDL        DS   F          Self Defining Section length         09724300
SMF94S2_POF        DS   F          Offset to product Section            09724500
SMF94S2_PLN        DS   H          Length of product Section            09724700
SMF94S2_PON        DS   H          Number of product Sections           09724900
*                                                                       09725100
SMF94S2_HOF        DS   F          Offset to header section             09725300
SMF94S2_HLN        DS   H          Length of header section             09725500
SMF94S2_HON        DS   H          Number of header sections            09725700
*                                                                       09725900
SMF94S2_SOF        DS   F          Offset to statistics                 09726100
SMF94S2_SLN        DS   H          Length of statistics                 09726300
SMF94S2_SON        DS   H          Number of statistics                 09726500
*********************************************************************** 09726700
*  SMF TYPE 94 (Subtype 2) Product Section                              09726900
*********************************************************************** 09727100
SMF94S2_TYP        DS   H          record subtype = 01                  09727300
SMF94S2_RVN        DS   H          record version number = 01           09727500
SMF94S2_PNM        DS   CL8        product name 'fmid     '             09727700
SMF94S2_MVS        DS   CL8        MVS operating system name            09727900
*********************************************************************** 09728100
*  SMF TYPE 94 (Subtype 2) Header Section                               09728300
*  Contains information generic in nature (common to all of the         09728500
*  Volume Pool Statistics).                                             09728700
*********************************************************************** 09728900
                   DS   BL32       reserved (set to zero)               09729100
*********************************************************************** 09729300
*  SMF TYPE 94 (Subtype 2) Volume Pool Statistics (VPS)                 09729500
*********************************************************************** 09729700
SMF94S2_LENGTH     DS   BL2         0:01 VPS message length             09729800
SMF94S2_MSGFMT     DS   BL1         2:02 message format('01'x)          09729900
SMF94S2_MSGCODE    DS   BL1         3:03 message code  ('29'x)          09730000
SMF94S2_MSGID      DS   BL4         4:07 message id                     09730100
                   DS   BL1         8:08 reserved                       09730200
SMF94S2_LIBID      DS   BL3         9:11 library sequence number        09730300
SMF94S2_VPSFMT     DS   BL1        12:12 volume pool stats format       09730400
                   DS   BL1        13:13 reserved                       09730500
SMF94S2_HHI        DS   H          14:15 Hour index in binary,          09730600
*                                        incremented every hour.        09730700
*                                        Value ranges from 0 to 23      09730800
*                                        (17 hex).                      09730900
SMF94S2_LRTD       DS   CL10       16:25 last reconcile time/data       09731000
SMF94S2_MNVP       DS   H          26:27 max pools in partition         09731100
                   DS   BL1        28                                   09731300
SMF94S2_VPSET      DS   BL1        29    pool set (1of2,2of2,etc)       09731500
                   DS   BL2        30:31                                09731700
                   DS   BL1        32                                   09731900
SMF94S2_BPMI0      DS   BL1        33    media type for BPSVC0          09732100
*                                        possible media values:         09732300
SMF94S2_BPM00      EQU  X'00'            no media type configured       09732500
SMF94S2_BPM10      EQU  X'10'            3590'J' media                  09732700
SMF94S2_BPM11      EQU  X'11'            3590'K' media                  09732900
SMF94S2_BPM20      EQU  X'20'            3592'JA' media            @52a 09733000
SMF94S2_BPM21      EQU  X'21'            3592 reserved.            @52a 09733100
SMF94S2_BPM22      EQU  X'22'            3592'JJ' media            @52a 09733200
SMF94S2_BPM23      EQU  X'23'            3592 reserved.            @52a 09733300
SMF94S2_BPSVC0     DS   BL2        34:35 number of scratch stacked      09733400
*                                        volumes of type BPMI0          09733500
                   DS   BL1        36    reserved                       09733600
SMF94S2_BPMI1      DS   BL1        37    media type for BPSVC1          09733700
SMF94S2_BPSVC1     DS   BL2        38:39 number of scratch stacked      09733900
*                                        volumes of type BPMI1          09734100
                   DS   BL1        40    reserved                       09734300
SMF94S2_BPMI2      DS   BL1        41    media type for BPSVC2          09734500
SMF94S2_BPSVC2     DS   BL2        42:43 number of scratch stacked      09734700
*                                        volumes of type BPMI2          09734900
                   DS   BL1        44    reserved                       09735100
SMF94S2_BPMI3      DS   BL1        45    media type for BPSVC3          09735300
SMF94S2_BPSVC3     DS   BL2        46:47 number of scratch stacked      09735500
*                                        volumes of type BPMI3          09735700
*********************************************************************** 09735900
*  This section contains an array containing statistics for             09736100
*  16 volume pools. Each of the 16 entries is 112 bytes long.           09736300
*  The number of array entries is contained in SMF94S2_SON.             09736500
*********************************************************************** 09736700
SMF94S2_ARRAY      DS   0CL1792                                         09736900
SMF94S2_ENTRY      DSECT                 array entry                    09737100
SMF94S2_VPS        DS   0CL112                                          09737300
                   DS   BL1        0     reserved (set to '00'x)        09737500
SMF94S2_VPN        DS   BL1        1     pool number (starts at 1)      09737700
                   DS   BL2        2:3   reserved (set to '00'x)        09737900
SMF94S2_ALVIP      DS   BL4        4:7   # of logical volumes on        09738100
*                                        physical vols assigned to      09738300
*                                        the pool.                      09738500
SMF94S2_ADIVP      DS   BL4        8:11  Mbytes of pool data            09738700
SMF94S2_DWTPLH     DS   BL4        12:15 Mbytes written to pool in      09738900
*                                        last hour.                     09739100
SMF94S2_PDCI       DS   BL1        16    pool device class.             09739300
SMF94S2_MI0        DS   BL1        17    media 0 counts:                09739500
SMF94S2_PSSSVC0    DS   BL2        18:19 static scratch stacked         09739700
SMF94S2_PSPSVC0    DS   BL2        20:21 static private stacked         09739900
SMF94S2_PBSSVC0    DS   BL2        22:23 borrowed scratch stacked       09740100
SMF94S2_PBPSVC0    DS   BL2        24:25 borrowed private stacked       09740300
                   DS   BL1        26    reserved (set to '00'x)        09740500
SMF94S2_MI1        DS   BL1        27    media 1 counts:                09740700
SMF94S2_PSSSVC1    DS   BL2        28:29 static scratch stacked         09740900
SMF94S2_PSPSVC1    DS   BL2        30:31 static private stacked         09741100
SMF94S2_PBSSVC1    DS   BL2        32:33 borrowed scratch stacked       09741300
SMF94S2_PBPSVC1    DS   BL2        34:35 borrowed private stacked       09741500
                   DS   BL4        36:39 reserved (set to '00'x)        09741700
SMF94S2_AAORD      DS   BL2        40:41 avg.age of residual data       09741900
SMF94S2_MAORD      DS   BL2        42:43 max age of residual data       09742100
SMF94S2_AAOFPSV    DS   BL2        44:45 avg.age of full private        09742300
*                                        stacked volumes.               09742500
SMF94S2_MAOFPSV    DS   BL2        46:47 max age of full private        09742700
*                                        stacked volumes.               09742900
                   DS   BL1        48    reserved (set to '00'x)        09743100
SMF94S2_VPRTP      DS   BL1        49    pool reclaim threshold %       09743300
SMF94S2_ADD00      DS   H          50:51 0 -5% active data              09743500
SMF94S2_ADD05      DS   H          52:53 5 -10% active data             09743700
SMF94S2_ADD10      DS   H          54:55 10-15% active data             09743900
SMF94S2_ADD15      DS   H          56:57 15-20% active data             09744100
SMF94S2_ADD20      DS   H          58:59 20-25% active data             09744300
SMF94S2_ADD25      DS   H          60:61 25-30% active data             09744500
SMF94S2_ADD30      DS   H          62:63 30-35% active data             09744700
SMF94S2_ADD35      DS   H          64:65 35-40% active data             09744900
SMF94S2_ADD40      DS   H          66:67 40-45% active data             09745100
SMF94S2_ADD45      DS   H          68:69 45-50% active data             09745300
SMF94S2_ADD50      DS   H          70:71 50-55% active data             09745500
SMF94S2_ADD55      DS   H          72:73 55-60% active data             09745700
SMF94S2_ADD60      DS   H          74:75 60-65% active data             09745900
SMF94S2_ADD65      DS   H          76:77 65-70% active data             09746100
SMF94S2_ADD70      DS   H          78:79 70-75% active data             09746300
SMF94S2_ADD75      DS   H          80:81 75-80% active data             09746500
SMF94S2_ADD80      DS   H          82:83 80-85% active data             09746700
SMF94S2_ADD85      DS   H          84:85 85-90% active data             09746900
SMF94S2_ADD90      DS   H          86:87 90-95% active data             09747100
SMF94S2_ADD95      DS   H          88:89 95-100%active data             09747300
SMF94S2_PPP        DS   BL1        90     Physical pool properties      09747500
                   DS   BL1        91     reserved('00'x)               09747700
SMF94S2_RPN        DS   BL1        92     Reclamation pool number       09747900
                   DS   BL1        93     reserved('00'x)          @52a 09748000
SMF94S2_RPDSLA     DS   BL2        94:95  Reclaim policy, days     @52ax09748100
                                          since last accessed      @52a 09748200
SMF94S2_RPDSLW     DS   BL2        96:97  Reclaim policy, days     @52ax09748300
                                          since last written       @52a 09748400
SMF94S2_RPDSLDI    DS   BL2        98:99  Reclaim policy, days     @52ax09748500
                                          since last data          @52ax09748600
                                          invalidation.            @52a 09748700
SMF94S2_RPDMADP    DS   BL1        100    Reclaim policy, minimum  @52ax09748800
                                          active data percentage   @52a 09748900
                   DS   BL11       101:111 reserved('00'x)         @52a 09749000
*                                                                       09749100
         MEND                                                        */ 09749200
*%SMF94P2: ;                        /*                           @01A*/ 09749300
* %SMF94_ = 'S94';                                            /* @CHA*/ 09749401
* %IF IBM_CBGENC = 'YES' %THEN                                /* @CHA*/ 09749501
* %DO;                                                        /* @CHA*/ 09749601
*   %SMF94_ = 'SMF94';                                        /* @CHA*/ 09749701
* %END;                                                       /* @CHA*/ 09749801
 /********************************************************************/ 09749900
 /*                                                                  */ 09750000
 /*  SMF TYPE 94 RECORD, PLS DEFINITION                              */ 09800000
 /*                                                                  */ 09850000
 /********************************************************************/ 09900000
 DCL 1 SMFRCD94 BASED(SMF94PTR),    /*                               */ 09950000
       3 SMF94RPS,                  /* Type 94 Record Header         */ 10000000
         5 SMF94LEN FIXED(16),      /* Record Length                 */ 10037500
                                    /*                               */ 10075000
         5 SMF94SEG FIXED(16),      /* Segment Descriptor            */ 10104100
                                    /*                               */ 10133300
         5 SMF94FLG CHAR(1),        /* Header flag byte              */ 10166600
           7 SMF94FNM BIT(1),       /* ..Subsys name follows std hdr */ 10200000
           7 SMF94FST BIT(1),       /* ..Subtypes utilized           */ 10250000
           7 * BIT(6),              /* ..reserved                    */ 10300000
                                                                        10325000
         5 SMF94RTY CHAR(1),        /* record type = 94 (hex 5E)     */ 10350000
                                                                        10362500
         5 SMF94TME FIXED(32) BDY(HWORD),  /* Time since midnight,   */ 10375000
                                    /* in hundredths of a second,    */ 10387500
                                    /* when the record was moved     */ 10400000
                                    /* into the SMF buffer.          */ 10412500
                                                                        10425000
         5 SMF94DTE CHAR(4),        /* Date when the record was      */ 10437500
                                    /* moved into the SMF buffer, in */ 10450000
                                    /* the form cyydddF (where F is  */ 10462500
                                    /* the sign).                    */ 10475000
                                                                        10487500
         5 SMF94SID CHAR(4),        /* system id (from SMFPRMxx parm)*/ 10500000
                                                                        10528500
         5 SMF94WID CHAR(4),        /* subsystem id, worktype indic. */ 10557000
                                                                        10585500
         5 SMF94STP CHAR(2),        /* record subtype                */ 10614000
                                    /* 1 = 34xx Library Statistics      10635500
                                       2 = volume pool statistics@30a   10657000
                                           see SMF94S2           @30a*/ 10678500
 /********************************************************************/ 10700000
 /*   SELF DEFINING SECTION (for format=1 statistics)            @30a*/ 10750000
 /********************************************************************/ 10800000
       3 SMF94SDS,                  /* Self Defining Section         */ 10850000
         5 SMF94SDL FIXED(32),      /* Self Defining Section length  */ 10900000
                                                                        10950000
         5 SMF94POF FIXED(32),      /* Offset to product Section     */ 11000000
         5 SMF94PLN FIXED(16),      /* Length of product Section     */ 11050000
         5 SMF94PON FIXED(16),      /* Number of product Sections    */ 11100000
                                                                        11150000
         5 SMF94HOF FIXED(32),      /* Offset to header section      */ 11200000
         5 SMF94HLN FIXED(16),      /* Length of header section      */ 11250000
         5 SMF94HON FIXED(16),      /* Number of header sections     */ 11300000
                                                                        11350000
         5 SMF94SOF FIXED(32),      /* Offset to self descr info     */ 11400000
         5 SMF94SLN FIXED(16),      /* Length of self descr info     */ 11450000
         5 SMF94SON FIXED(16),      /* Number of self descr info     */ 11500000
                                                                        11550000
         5 SMF94LOF FIXED(32),      /* Offset to library stats       */ 11600000
         5 SMF94LLN FIXED(16),      /* Length of library stats       */ 11650000
         5 SMF94LON FIXED(16),      /* Number of library stats       */ 11700000
                                                                        11750000
         5 SMF94MOF FIXED(32),      /* Offset to mount stats         */ 11800000
         5 SMF94MLN FIXED(16),      /* Length of mount stats         */ 11850000
         5 SMF94MON FIXED(16),      /* Number of mount stats         */ 11900000
                                                                        11950000
         5 SMF94DOF FIXED(32),      /* Offset to demount stats       */ 12000000
         5 SMF94DLN FIXED(16),      /* Length of demount stats       */ 12050000
         5 SMF94DON FIXED(16),      /* Number of demount stats       */ 12100000
                                                                        12150000
         5 SMF94EOF FIXED(32),      /* Offset to eject stats         */ 12200000
         5 SMF94ELN FIXED(16),      /* Length of eject stats         */ 12250000
         5 SMF94EON FIXED(16),      /* Number of eject stats         */ 12300000
                                                                        12350000
         5 SMF94AOF FIXED(32),      /* Offset to audit stats         */ 12400000
         5 SMF94ALN FIXED(16),      /* Length of audit stats         */ 12450000
         5 SMF94AON FIXED(16),      /* Number of audit stats         */ 12500000
                                                                        12550000
         5 SMF94IOF FIXED(32),      /* Offset to insert stats        */ 12590000
         5 SMF94ILN FIXED(16),      /* Length of insert stats        */ 12630000
         5 SMF94ION FIXED(16),      /* Number of insert stats        */ 12670000
                                                                        12710000
         5 SMF94VOF FIXED(32),      /* Offset to VTS stats       @04A*/ 12718000
         5 SMF94VLN FIXED(16),      /* Length of VTS stats       @04A*/ 12726000
         5 SMF94VON FIXED(16),      /* Number of VTS stats       @04A*/ 12734000
                                                                        12742000
         5 SMF94XOF FIXED(32),      /* Offset to import/export   @IXA*/ 12743600
         5 SMF94XLN FIXED(16),      /* Length of import/export   @IXA*/ 12745200
         5 SMF94XON FIXED(16),      /* Number of import/export   @IXA*/ 12746800
                                                                        12748400
         5 SMF942OF FIXED(32),      /* Offset to enhanced stats  @gem*/ 12748800
         5 SMF942LN FIXED(16),      /* Length of enhanced stats  @gem*/ 12749200
         5 SMF942ON FIXED(16),      /* Number of enhanced stats  @gem*/ 12749600
 /********************************************************************/ 12750000
 /*   PRODUCT SECTION                                                */ 12800000
 /********************************************************************/ 12850000
     1 SMF94PSS BASED(ADDR(SMFRCD94)+SMF94POF),  /*                  */ 12900000
       3 SMF94TYP FIXED(16),        /* record subtype                */ 12937500
                                                                        12975000
       3 SMF94RVN CHAR(2),          /* record version number = 01    */ 13000000
                                                                        13025000
       3 SMF94PNM CHAR(8),          /* product name 'JDZ1110  '      */ 13050000
                                                                        13075000
       3 SMF94MVS CHAR(8),          /* MVS operating system name     */ 13100000
                                                                        13125000
 /********************************************************************/ 13150000
 /*  HEADER SECTION (bytes 9-11 in source record)                    */ 13200000
 /********************************************************************/ 13300000
     1 SMF94HDR BASED(ADDR(SMFRCD94)+SMF94HOF),  /*                  */ 13350000
       3 SMF94HSF FIXED(8),         /* Statistics format. Set to @30a   13368700
                                       2 when F/C4001 is enabled.@30a*/ 13387400
       3 SMF94HHI CHAR(2),          /* Hour index in binary,         */ 13406100
                                    /* incremented every hour.       */ 13424800
                                    /* Value ranges from 0 to 23     */ 13443500
                                    /* (17 hex).                     */ 13462200
                                                                        13480900
 /********************************************************************/ 13500000
 /*  SELF DESCRIPTION INFORMATION (bytes 12-37 in source record)     */ 13550000
 /********************************************************************/ 13650000
     1 SMF94SLF BASED(ADDR(SMFRCD94)+SMF94SOF), /*                   */ 13700000
       3 SMF94SLT CHAR(6),          /* System-managed Tape Library   */ 13712900
                                    /* type number.  For example,    */ 13725800
                                    /* 003495 represents the 3495    */ 13738700
                                    /* Tape Library Dataserver.      */ 13751600
                                                                        13764500
       3 SMF94SLM CHAR(3),          /* System-managed Tape Library   */ 13777400
                                    /* model number.  For example,   */ 13790300
                                    /* L30 represents model L30.     */ 13803200
                                                                        13816100
       3 SMF94SMA CHAR(3),          /* System-managed Tape Library   */ 13829000
                                    /* manufacturer.  Always equals  */ 13841900
                                    /* IBM.                          */ 13854800
                                                                        13867700
       3 SMF94SPL CHAR(2),          /* System-managed Tape Library   */ 13880600
                                    /* plant of manufacture.  For    */ 13893500
                                    /* example, 13 represents San    */ 13906400
                                    /* Jose, California and 77       */ 13919300
                                    /* represents Valencia, Spain.   */ 13932200
                                                                        13945100
       3 SMF94SNO CHAR(12),         /* System-managed Tape Library   */ 13958000
                                    /* sequence number.  Uniquely    */ 13970900
                                    /* identifies a system-managed   */ 13983800
                                    /* tape library.                 */ 13996700
                                                                        14009600
       3 *        CHAR(1),          /* Reserved                      */ 14022500
                                                                        14035400
 /********************************************************************/ 14050000
 /*  LIBRARY STATISTICS (bytes 38-53 in source record)               */ 14100000
 /********************************************************************/ 14200000
     1 SMF94LIB BASED(ADDR(SMFRCD94)+SMF94LOF),  /*                  */ 14250000
       3 SMF94LID FIXED(16),        /* Number of drives currently    */ 14258100
                                    /* installed in a system-managed */ 14266200
                                    /* tape library.                 */ 14274300
                                                                        14282400
       3 SMF94LMD FIXED(16),        /* Number of drives currently    */ 14290500
                                    /* mounted in a system-managed   */ 14298600
                                    /* tape library.                 */ 14306700
                                                                        14314800
       3 SMF94LM1 FIXED(16),        /* Maximum number of drives      */ 14322900
                                    /* mounted during the last hour. */ 14331000
                                                                        14339100
       3 SMF94LM2 FIXED(16),        /* Minimum number of drives      */ 14347200
                                    /* mounted during the last hour. */ 14355300
                                                                        14363400
       3 SMF94LM3 FIXED(16),        /* Average number of drives      */ 14371500
                                    /* mounted during the last hour. */ 14379600
                                                                        14387700
       3 SMF94LT1 FIXED(16),        /* Maximum amount of time, in    */ 14395800
                                    /* seconds, that a tape volume   */ 14403900
                                    /* was mounted on a drive during */ 14412000
                                    /* the last hour.  The mount time*/ 14420100
                                    /* of a volume is the time when  */ 14428200
                                    /* the system completed mounting */ 14436300
                                    /* a volume on a drive until the */ 14444400
                                    /* the time when the system      */ 14452500
                                    /* managed tape library receives */ 14460600
                                    /* an order from the host to     */ 14468700
                                    /* demount the volume.           */ 14476800
                                                                        14484900
       3 SMF94LT2 FIXED(16),        /* Minimum amount of time, in    */ 14493000
                                    /* seconds, that a tape volume   */ 14501100
                                    /* was mounted on a drive during */ 14509200
                                    /* the last hour.  The mount time*/ 14517300
                                    /* of a volume is the time when  */ 14525400
                                    /* the system completed mounting */ 14533500
                                    /* a volume on a drive until the */ 14541600
                                    /* time when the system managed  */ 14549700
                                    /* tape library receives an order*/ 14557800
                                    /* from the host to demount the  */ 14565900
                                    /* volume.                       */ 14574000
                                                                        14582100
       3 SMF94LT3 FIXED(16),        /* Average amount of time, in    */ 14590200
                                    /* seconds, that all tape        */ 14598300
                                    /* volumes were mounted on       */ 14606400
                                    /* drives during the last hour.  */ 14614500
                                    /* The mount time of a volume is */ 14622600
                                    /* the time when the system      */ 14630700
                                    /* completed mounting a volume   */ 14638800
                                    /* on a drive until the time     */ 14646900
                                    /* when the system managed tape  */ 14655000
                                    /* library receives an order     */ 14663100
                                    /* from the host to demount the  */ 14671200
                                    /* volume.                       */ 14679300
                                                                        14687400
 /********************************************************************/ 14700000
 /*  MOUNT STATISTICS (bytes 54-73 in source record)                 */ 14750000
 /********************************************************************/ 14850000
     1 SMF94MNT BASED(ADDR(SMFRCD94)+SMF94MOF),  /*                  */ 14900000
       3 SMF94MPR FIXED(16),        /* The total number of mount     */ 14911900
                                    /* requests currently pending.   */ 14923800
                                                                        14935700
       3 SMF94MP1 FIXED(16),        /* Maximum number of mount       */ 14947600
                                    /* requests pending during the   */ 14959500
                                    /* last hour.                    */ 14971400
                                                                        14983300
       3 SMF94MP2 FIXED(16),        /* Minimum number of mount       */ 14995200
                                    /* requests pending during the   */ 15007100
                                    /* last hour.                    */ 15019000
                                                                        15030900
       3 SMF94MP3 FIXED(16),        /* Average number of mount       */ 15042800
                                    /* requests pending during the   */ 15054700
                                    /* last hour.                    */ 15066600
                                                                        15078500
       3 SMF94MTO FIXED(16),        /* Total number of mounts during */ 15090400
                                    /* the last hour.                */ 15102300
                                    /*                               */ 15114200
                                                                        15126100
       3 SMF94MIN FIXED(16),        /* Index mounts during the   @02A*/ 15138000
                                    /* last hour.  An index      @02C*/ 15149900
                                    /* mount is a mount accomplished */ 15161800
                                    /* using the automatic cartridge */ 15173700
                                    /* loader of a 3490 tape drive   */ 15185600
                                                                        15197500
       3 SMF94MPM FIXED(16),        /* Pre-mounts during last hour.  */ 15209400
                                    /* A single pre-mount operation  */ 15221300
                                    /* causes a volume to be added to*/ 15233200
                                    /* the automatic cartridge loader*/ 15245100
                                    /* of a 3490 tape drive.         */ 15257000
                                                                        15268900
       3 SMF94MT1 FIXED(16),        /* Maximum amount of time, in    */ 15280800
                                    /* seconds, required to perform  */ 15292700
                                    /* any single mount operation    */ 15304600
                                    /* during the last hour.         */ 15316500
                                                                        15328400
       3 SMF94MT2 FIXED(16),        /* Minimum amount of time, in    */ 15340300
                                    /* seconds, required to perform  */ 15352200
                                    /* any single mount operation    */ 15364100
                                    /* during the last hour.         */ 15376000
       3 SMF94MT3 FIXED(16),        /* Average amount of time, in    */ 15387900
                                    /* seconds, required to perform  */ 15399800
                                    /* any single mount operation    */ 15411700
                                    /* during the last hour.         */ 15423600
                                                                        15435500
 /********************************************************************/ 15450000
 /*  DEMOUNT STATISTICS (bytes 74-93 in source record)               */ 15500000
 /********************************************************************/ 15600000
     1 SMF94DMT BASED(ADDR(SMFRCD94)+SMF94DOF),  /*                  */ 15650000
       3 SMF94DPR FIXED(16),        /* The total number of demount   */ 15661400
                                    /* requests currently pending.   */ 15672800
                                                                        15684200
       3 SMF94DP1 FIXED(16),        /* Maximum number of demount     */ 15695600
                                    /* requests pending during the   */ 15707000
                                    /* last hour.                    */ 15718400
                                                                        15729800
       3 SMF94DP2 FIXED(16),        /* Minimum number of demount     */ 15741200
                                    /* requests pending during the   */ 15752600
                                    /* last hour.                    */ 15764000
                                                                        15775400
       3 SMF94DP3 FIXED(16),        /* Average number of demount     */ 15786800
                                    /* requests pending during the   */ 15798200
                                    /* last hour.                    */ 15809600
                                                                        15821000
       3 SMF94DTO FIXED(16),        /* Total number of demounts      */ 15832400
                                    /* during the last hour.         */ 15843800
                                                                        15855200
       3 SMF94DIN FIXED(16),        /* Index demounts during the     */ 15866600
                                    /* last hour.  An index demount  */ 15878000
                                    /* moves a volume from the feed  */ 15889400
                                    /* station to the output stack   */ 15900800
                                    /* of the automatic cartridge    */ 15912200
                                    /* loader of a 3490 tape drive.  */ 15923600
                                                                        15935000
       3 SMF94DPM FIXED(16),        /* Post-demounts during the last */ 15946400
                                    /* hour.  A post-demount         */ 15957800
                                    /* operation moves a volume from */ 15969200
                                    /* the output stack of the       */ 15980600
                                    /* automatic cartridge loader of */ 15992000
                                    /* a 3490 tape drive.            */ 16003400
                                                                        16014800
       3 SMF94DT1 FIXED(16),        /* Maximum amount of time, in    */ 16026200
                                    /* seconds, required to perform  */ 16037600
                                    /* any single demount operation  */ 16049000
                                    /* during the last hour.         */ 16060400
                                                                        16071800
       3 SMF94DT2 FIXED(16),        /* Minimum amount of time, in    */ 16083200
                                    /* seconds, required to perform  */ 16094600
                                    /* any single demount operation  */ 16106000
                                    /* during the last hour.         */ 16117400
                                                                        16128800
       3 SMF94DT3 FIXED(16),        /* Average amount of time, in    */ 16140200
                                    /* seconds, required to perform  */ 16151600
                                    /* any single demount operation  */ 16163000
                                    /* during the last hour.         */ 16174400
                                                                        16185800
 /********************************************************************/ 16200000
 /*  EJECT STATISTICS (bytes 94-109 in source record)                */ 16250000
 /********************************************************************/ 16350000
     1 SMF94EJT BASED(ADDR(SMFRCD94)+SMF94EOF),  /*                  */ 16400000
       3 SMF94EPR FIXED(16),        /* The total number of eject     */ 16411500
                                    /* requests currently pending.   */ 16423000
                                    /* An eject operation moves one  */ 16434500
                                    /* volume from the system-managed*/ 16446000
                                    /* tape library to an output     */ 16457500
                                    /* station for removal by an     */ 16469000
                                    /* operator.                     */ 16480500
                                                                        16492000
       3 SMF94EP1 FIXED(16),        /* Maximum number of eject       */ 16503500
                                    /* requests pending during the   */ 16515000
                                    /* last hour.                    */ 16526500
                                                                        16538000
       3 SMF94EP2 FIXED(16),        /* Minimum number of eject       */ 16549500
                                    /* requests pending during the   */ 16561000
                                    /* last hour.                    */ 16572500
                                                                        16584000
       3 SMF94EP3 FIXED(16),        /* Average number of eject       */ 16595500
                                    /* requests pending during the   */ 16607000
                                    /* last hour.                    */ 16618500
                                                                        16630000
       3 SMF94ETO FIXED(16),        /* Total number of ejects during */ 16641500
                                    /* the last hour.                */ 16653000
                                                                        16664500
       3 SMF94ET1 FIXED(16),        /* Maximum amount of time, in    */ 16676000
                                    /* seconds, required to perform  */ 16687500
                                    /* any single eject operation    */ 16699000
                                    /* during the last hour.         */ 16710500
                                                                        16722000
       3 SMF94ET2 FIXED(16),        /* Minimum amount of time, in    */ 16733500
                                    /* seconds, required to perform  */ 16745000
                                    /* any single eject operation    */ 16756500
                                    /* during the last hour.         */ 16768000
                                                                        16779500
       3 SMF94ET3 FIXED(16),        /* Average amount of time, in    */ 16791000
                                    /* seconds, required to perform  */ 16802500
                                    /* a single eject operation      */ 16814000
                                    /* during the last hour.         */ 16825500
                                                                        16837000
 /********************************************************************/ 16850000
 /*  AUDIT STATISTICS (bytes 110-125 in source record)               */ 16900000
 /********************************************************************/ 17000000
     1 SMF94AUD BASED(ADDR(SMFRCD94)+SMF94AOF),  /*                  */ 17050000
       3 SMF94APR FIXED(16),        /* The total number of audit     */ 17061500
                                    /* requests currently pending.   */ 17073000
                                    /* When the host requests an     */ 17084500
                                    /* audit operation , the accessor*/ 17096000
                                    /* moves to a shelf location and */ 17107500
                                    /* ensures that a volume is      */ 17119000
                                    /* present.                      */ 17130500
                                                                        17142000
       3 SMF94AP1 FIXED(16),        /* Maximum number of audit       */ 17153500
                                    /* requests pending during the   */ 17165000
                                    /* last hour.                    */ 17176500
                                                                        17188000
       3 SMF94AP2 FIXED(16),        /* Minimum number of audit       */ 17199500
                                    /* requests pending during the   */ 17211000
                                    /* last hour.                    */ 17222500
                                                                        17234000
       3 SMF94AP3 FIXED(16),        /* Average number of audit       */ 17245500
                                    /* requests pending during the   */ 17257000
                                    /* last hour.                    */ 17268500
                                                                        17280000
       3 SMF94ATO FIXED(16),        /* Total number of audits during */ 17291500
                                    /* the last hour.                */ 17303000
                                                                        17314500
       3 SMF94AT1 FIXED(16),        /* Maximum amount of time, in    */ 17326000
                                    /* seconds, required to perform  */ 17337500
                                    /* any single audit operation    */ 17349000
                                    /* during the last hour.         */ 17360500
                                                                        17372000
       3 SMF94AT2 FIXED(16),        /* Maximum amount of time, in    */ 17383500
                                    /* seconds, required to perform  */ 17395000
                                    /* any single audit operation    */ 17406500
                                    /* during the last hour.         */ 17418000
                                                                        17429500
       3 SMF94AT3 FIXED(16),        /* Average amount of time, in    */ 17441000
                                    /* seconds, required to perform  */ 17452500
                                    /* a single audit operation      */ 17464000
                                    /* during the last hour.         */ 17475500
                                                                        17487000
 /********************************************************************/ 17500000
 /*  INPUT STATISTICS (bytes 126-127 in source record)               */ 17550000
 /********************************************************************/ 17650000
     1 SMF94INP BASED(ADDR(SMFRCD94)+SMF94IOF),  /*                  */ 17700000
       3 SMF94INS FIXED(16),        /* Number of insert stores during*/ 17712500
                                    /* last hour.  This number is the*/ 17725000
                                    /* number of volumes moved from  */ 17737500
                                    /* an input station to a location*/ 17750000
                                    /* inside the system managed tape*/ 17762500
                                    /* library.                      */ 17775000
 /********************************************************************/ 17775600
 /* VIRTUAL TAPE SERVER STATS (bytes 128-211 in source record )  @04A*/ 17776200
 /*                                                                  */ 17776800
 /* The VTS statistical record contains information about physical   */ 17777400
 /* drive usage and physical mount performance of the library.       */ 17778000
 /* The current record has a length of 256 bytes, of which only      */ 17778600
 /* the first 128 bytes contain defined values.  When one or more    */ 17779200
 /* VTS subsystems are installed in the library, the existing        */ 17779800
 /* statistics continue to reflect all physical movement of          */ 17780400
 /* cartridges within the physical library including that of the     */ 17781000
 /* VTS subsystems. The virtual mount statistics and operational     */ 17781600
 /* information about the VTS are reported in bytes 128:211.         */ 17782200
 /* Although up to two VTS subsystems can be configured in a         */ 17782800
 /* library, the statistics reported in bytes 128:211 are only       */ 17783400
 /* for the specific VTS subsystem the request was issued to.        */ 17784000
 /* For statistical data requests issued to a non-VTS device,        */ 17784600
 /* bytes 128:211 contain X'00'.                                     */ 17785200
 /*                                                                  */ 17785800
 /********************************************************************/ 17786400
                                                                        17787500
    1 SMF94VTS BASED(ADDR(SMFRCD94)+SMF94VOF),  /*                   */ 17787700
                                                                        17787900
      3 SMF94VNO CHAR(1),          /* cluster lib number (128)   @ge2*/ 17788100
                                                                        17788300
      3 SMF94VLS CHAR(5),          /* Library sequence number for    */ 17788500
                                   /* library segment for which VTS  */ 17788700
                                   /* statistics are being reported. */ 17788900
                                                                        17789100
      3 SMF94VTI FIXED(8),         /* Number of underlying physical  */ 17789300
                                   /* tape devices currently         */ 17789500
                                   /* installed in the VTS subsystem.*/ 17789700
                                   /* Contains zero with F/C4001 @30a*/ 17789800
                                                                        17789900
      3 SMF94VTA FIXED(8),         /* Number of underlying physical  */ 17790100
                                   /* tape devices currently         */ 17790300
                                   /* available for use by VTS.      */ 17790500
                                   /* Contains zero with F/C4001 @30a*/ 17790600
                                                                        17790700
      3 SMF94VTX FIXED(8),         /* Maximum number of underlying   */ 17790900
                                   /* physical tape devices mounted  */ 17791100
                                   /* concurrently in this VTS       */ 17791300
                                   /* during last hour.              */ 17791500
                                   /* Contains zero with F/C4001 @30a*/ 17791600
                                                                        17791700
      3 SMF94VTN FIXED(8),         /* Minimum number of underlying   */ 17791900
                                   /* physical tape devices mounted  */ 17792100
                                   /* concurrently in this VTS       */ 17792300
                                   /* during last hour.              */ 17792500
                                   /* Contains zero with F/C4001 @30a*/ 17792600
                                                                        17792700
      3 SMF94VTV FIXED(8),         /* Average number of underlying   */ 17792900
                                   /* physical tape devices mounted  */ 17793100
                                   /* concurrently in the VTS during */ 17793300
                                   /* last hour. Value is determined */ 17793500
                                   /* by summing number of concur-   */ 17793700
                                   /* rently mounted physical drives */ 17793900
                                   /* every 10 seconds, and dividing */ 17794100
                                   /* resultant sum by 360 during    */ 17794300
                                   /* hourly statistics generation.  */ 17794500
                                   /* Contains zero with F/C4001 @30a*/ 17794600
                                                                        17794700
      3 SMF94VR2 CHAR(1),          /* Reserved, set to X'00'         */ 17794900
                                                                        17795100
      3 SMF94VMX FIXED(16),        /* Maximum time in seconds used   */ 17795300
                                   /* to perform a mount on a        */ 17795500
                                   /* physical drive in VTS in the   */ 17795700
                                   /* last hour. Time is accrued     */ 17795900
                                   /* from time mount request is     */ 17796100
                                   /* accepted until it is complete. */ 17796300
                                   /* Mount time is accredited to    */ 17796500
                                   /* hour that mount completes.     */ 17796700
                                   /* Contains zero with F/C4001 @30a*/ 17796800
                                                                        17796900
      3 SMF94VMN FIXED(16),        /* Minimum time in seconds used   */ 17797100
                                   /* to perform a mount on a        */ 17797300
                                   /* physical drive in VTS in the   */ 17797500
                                   /* last hour. Time is accrued     */ 17797700
                                   /* from time mount request is     */ 17797900
                                   /* accepted until it is complete. */ 17798100
                                   /* Mount time is accredited to    */ 17798300
                                   /* hour that mount completes.     */ 17798500
                                   /* Contains zero with F/C4001 @30a*/ 17798600
                                                                        17798700
      3 SMF94VMV FIXED(16),        /* Average time in seconds used   */ 17798900
                                   /* to perform a mount on a        */ 17799100
                                   /* physical drive in VTS in the   */ 17799300
                                   /* last hour. Time is accrued     */ 17799500
                                   /* from time mount request is     */ 17799700
                                   /* accepted until it is complete. */ 17799900
                                   /* Mount time is accredited to    */ 17800100
                                   /* hour that mount completes.     */ 17800300
                                   /* Contains zero with F/C4001 @30a*/ 17800400
                                                                        17800500
      3 SMF94VPS FIXED(16),        /* The number of physical mount   */ 17800700
                                   /* requests completed in last     */ 17800900
                                   /* hour to satisfy stage mounts.  */ 17801100
                                   /* Contains zero with F/C4001 @30a*/ 17801200
                                                                        17801300
      3 SMF94VPM FIXED(16),        /* The number of physical mounts  */ 17801500
                                   /* completed in last hour to      */ 17801700
                                   /* satisfy migrate requests.      */ 17801900
                                   /* Contains zero with F/C4001 @30a*/ 17802000
                                                                        17802100
      3 SMF94VPR FIXED(16),        /* The number of physical mounts  */ 17802300
                                   /* completed in last hour to      */ 17802500
                                   /* satisfy reclamation mounts.    */ 17802700
                                   /* Contains zero with F/C4001 @30a*/ 17802800
                                                                        17802900
      3 SMF94VDC FIXED(8),         /* The number of virtual devices  */ 17803100
                                   /* configured in this VTS at the  */ 17803300
                                   /* time request for statistics    */ 17803500
                                   /* was received (current.)        */ 17803700
                                   /* Contains zero with F/C4001 @30a*/ 17803800
                                                                        17803900
      3 SMF94VDX FIXED(8),         /* The maximum number of virtual  */ 17804100
                                   /* drives that were concurrently  */ 17804300
                                   /* mounted in this VTS during     */ 17804500
                                   /* the last hour.                 */ 17804700
                                   /* Contains zero with F/C4001 @30a*/ 17804800
                                                                        17804900
      3 SMF94VDN FIXED(8),         /* The minimum number of virtual  */ 17805100
                                   /* drives that were concurrently  */ 17805300
                                   /* mounted in this VTS during     */ 17805500
                                   /* the last hour.                 */ 17805700
                                   /* Contains zero with F/C4001 @30a*/ 17805800
                                                                        17805900
      3 SMF94VDA FIXED(8),         /* The average number of virtual  */ 17806100
                                   /* drives that were concurrently  */ 17806300
                                   /* mounted in the VTS during last */ 17806500
                                   /* hour. Value is determined by   */ 17806700
                                   /* summing number of concurrently */ 17806900
                                   /* mounted virtual devices every  */ 17807100
                                   /* 10 seconds, and dividing       */ 17807300
                                   /* resultant sum by 360 during    */ 17807500
                                   /* hourly statistics generation.  */ 17807700
                                   /* Contains zero with F/C4001 @30a*/ 17807800
                                                                        17807900
      3 SMF94VVX FIXED(16),        /* Maximum time in seconds that a */ 17808100
                                   /* virtual drive was mounted in   */ 17808300
                                   /* VTS during the last hour. Time */ 17808500
                                   /* is accrued from completion of  */ 17808700
                                   /* mount until demount is issued. */ 17808900
                                   /* Mount time is accredited to    */ 17809100
                                   /* hour that demount is issued.   */ 17809300
                                                                        17809500
      3 SMF94VVN FIXED(16),        /* Minimum time in seconds that a */ 17809700
                                   /* virtual drive was mounted in   */ 17809900
                                   /* VTS during the last hour. Time */ 17810100
                                   /* is accrued from completion of  */ 17810300
                                   /* mount until demount is issued. */ 17810500
                                   /* Mount time is accredited to    */ 17810700
                                   /* hour that demount is issued.   */ 17810900
                                                                        17811100
      3 SMF94VVA FIXED(16),        /* Average time in seconds that a */ 17811300
                                   /* virtual drive was mounted in   */ 17811500
                                   /* VTS during the last hour. Time */ 17811700
                                   /* is accrued from completion of  */ 17811900
                                   /* mount until demount is issued. */ 17812100
                                   /* Mount time is accredited to    */ 17812300
                                   /* hour that demount is issued.   */ 17812500
                                                                        17812700
      3 SMF94VRX FIXED(16),        /* Maximum time in seconds for a  */ 17812900
                                   /* mount to complete on a virtual */ 17813100
                                   /* drive in the last hour. Time   */ 17813300
                                   /* is accrued from time mount     */ 17813500
                                   /* request is accepted until it   */ 17813700
                                   /* is completed.  Mount time is   */ 17813900
                                   /* accredited to the hour that    */ 17814100
                                   /* mount is completed.            */ 17814300
                                                                        17814500
      3 SMF94VRN FIXED(16),        /* Minimum time in seconds for a  */ 17814700
                                   /* mount to complete on a virtual */ 17814900
                                   /* drive in the last hour. Time   */ 17815100
                                   /* is accrued from time mount     */ 17815300
                                   /* request is accepted until it   */ 17815500
                                   /* is completed.  Mount time is   */ 17815700
                                   /* accredited to the hour that    */ 17815900
                                   /* mount is completed.            */ 17816100
                                                                        17816300
      3 SMF94VRA FIXED(16),        /* Average time in seconds for a  */ 17816500
                                   /* mount to complete on a virtual */ 17816700
                                   /* drive in the last hour. Time   */ 17816900
                                   /* is accrued from time mount     */ 17817100
                                   /* request is accepted until it   */ 17817300
                                   /* is completed.  Mount time is   */ 17817500
                                   /* accredited to the hour that    */ 17817700
                                   /* mount is completed.            */ 17817900
                                                                        17818100
      3 SMF94VFR FIXED(16),        /* The number of virtual mounts   */ 17818300
                                   /* in last hour using VTS Fast-   */ 17818500
                                   /* Ready facility.  Fast-Ready is */ 17818700
                                   /* used for mount-from-category   */ 17818900
                                   /* requests for which specified   */ 17819100
                                   /* category has the Fast-Ready    */ 17819300
                                   /* attribute set, or for specific */ 17819500
                                   /* volume requests for which the  */ 17819700
                                   /* specified volume is, at time   */ 17819900
                                   /* mount request is received,     */ 17820100
                                   /* assigned to a category that    */ 17820300
                                   /* has Fast-Ready attribute set.  */ 17820500
                                                                        17820700
                                                                        17820900
      3 SMF94VMH FIXED(16),        /* The number of virtual mounts   */ 17821100
                                   /* last hour that completed for   */ 17821300
                                   /* specific requested volumes     */ 17821500
                                   /* found resident in Tape Volume  */ 17821700
                                   /* Cache (specific mount hits.)   */ 17821900
                                                                        17822100
      3 SMF94VMS FIXED(16),        /* The number of virtual mounts   */ 17822300
                                   /* last hour completed with       */ 17822500
                                   /* specific requested logical     */ 17822700
                                   /* volumes staged from a physical */ 17822900
                                   /* tape back to Tape Volume Cache */ 17823100
                                                                        17823300
      3 SMF94VMP FIXED(16),        /* The number of virtual volumes  */ 17823500
                                   /* for which premigrate was       */ 17823700
                                   /* completed in the last hour.    */ 17823900
                                                                        17824100
      3 SMF94VBW FIXED(32),        /* Total number of bytes written  */ 17824300
                                   /* successfully through host      */ 17824500
                                   /* channels to virtual volumes in */ 17824700
                                   /* an integral multiple of 4096   */ 17824900
                                   /* bytes during the last hour. If */ 17825100
                                   /* number of bytes written is not */ 17825300
                                   /* an integer multiple of 4096,   */ 17825500
                                   /* the number is rounded up.      */ 17825700
                                                                        17825900
      3 SMF94VBR FIXED(32),        /* Total number of bytes read     */ 17826100
                                   /* successfully through host      */ 17826300
                                   /* channels from virtual volumes  */ 17826500
                                   /* in integral multiple of 4096   */ 17826700
                                   /* bytes during the last hour. If */ 17826900
                                   /* number of bytes read is not    */ 17827100
                                   /* an integer multiple of 4096,   */ 17827300
                                   /* the number is rounded up.      */ 17827500
                                                                        17827700
      3 SMF94VTW FIXED(32),        /* Total number of bytes written  */ 17827900
                                   /* successfully by VTS to its     */ 17828100
                                   /* attached physical drives in    */ 17828300
                                   /* integral mulitple of 4096      */ 17828500
                                   /* bytes during last hour. If     */ 17828700
                                   /* number of bytes written is     */ 17828900
                                   /* not an integer multiple of     */ 17829100
                                   /* 4096, the number is rounded    */ 17829300
                                   /* up. Bytes are accredited to    */ 17829500
                                   /* hour in which the underlying   */ 17829700
                                   /* premigrates of virtual         */ 17829900
                                   /* volumes complete.              */ 17830100
                                   /* Contains zero with F/C4001 @30a*/ 17830200
                                                                        17830300
      3 SMF94VTR FIXED(32),        /* Total number of bytes read     */ 17830500
                                   /* successfully by VTS from its   */ 17830700
                                   /* attached physical drives in an */ 17830900
                                   /* integral mulitple of 4096      */ 17831100
                                   /* bytes during last hour. If     */ 17831300
                                   /* number of bytes read is not    */ 17831500
                                   /* an integer multiple of 4096,   */ 17831700
                                   /* the number is rounded up.      */ 17831900
                                   /* Bytes are accredited to the    */ 17832100
                                   /* hour in which the underlying   */ 17832300
                                   /* premigrates of virtual         */ 17832500
                                   /* volumes complete.              */ 17832700
                                   /* Contains zero with F/C4001 @30a*/ 17832800
                                                                        17832900
                                                                        17833100
      3 SMF94VCA FIXED(16),        /* The average age, in minutes, of*/ 17833200
                                   /* the times of last reference of */ 17833300
                                   /* the vitual volumes in the tape */ 17833400
                                   /* Volume Cache at the end of     */ 17833700
                                   /* the reported hour.             */ 17833900
                                   /* Contains zero with F/C4001 @30a*/ 17834000
                                                                        17834100
      3 SMF94VCZ FIXED(16),        /* The average size (mb) of the   */ 17834400
                                   /* virtual volumes in the Tape    */ 17834700
                                   /* Volume Cache at the end of the */ 17835000
                                   /* reported hour.                 */ 17835300
                                   /* Contains zero with F/C4001 @30a*/ 17835600
                                                                        17835900
      3 SMF94VNM FIXED(16),        /* The number of virtual volumes  */ 17836100
                                   /* in Tape Volume Cache at the    */ 17836300
                                   /* end of reported hour.          */ 17836500
                                   /* Contains zero with F/C4001 @30a*/ 17836600
                                                                        17836700
      3 SMF94VR3 CHAR(2),          /* Reserved, set to X'00'         */ 17836900
                                                                        17837100
      3 SMF94VBA FIXED(32),        /* The number of bytes of data    */ 17837300
                                   /* on the active logical volumes  */ 17837500
                                   /* which are on VTS stacked       */ 17837700
                                   /* volumes at the end of the      */ 17837900
                                   /* reported hour. (200:203)       */ 17838100
                                                                        17838500
      3 SMF94VLA FIXED(32),        /* The number of active logical   */ 17838700
                                   /* volumes which are on VTS       */ 17838900
                                   /* stacked volumes at the end of  */ 17839100
                                   /* the reported hour.(204:207)    */ 17839300
                                                                        17839500
      3 SMF94VEC FIXED(32),        /* The total estimated amount @IXC*/ 17839700
                                   /* storage capacity of the empty  */ 17839900
                                   /* 3590 cartridges managed by the */ 17840100
                                   /* VTS in an integral multiple    */ 17840300
                                   /* of 1,048,576 bytes (1 MBytes)  */ 17840500
                                   /* at the end of the reported hour*/ 17841800
 /********************************************************************/ 17843200
 /* VTS Import/Export STATS   (bytes 212-239 in source record )  @IXA*/ 17843300
 /*                                                                  */ 17843400
 /* The VTS Import/Export record contains informationa about 1 hours */ 17843500
 /* import/export activity in a VTS library.                         */ 17843600
 /********************************************************************/ 17843700
    1 SMF94X00 BASED(ADDR(SMFRCD94)+SMF94XOF),  /*                   */ 17843800
                                                                        17843900
      3 SMF94IM1 FIXED(16),        /* count of physical volumes         17844000
                                      processed during import oper-     17844100
                                      ations that completed in the      17844200
                                      last hour. (212:213)           */ 17844300
      3 SMF94EX1 FIXED(16),        /* count of the number of physical   17844400
                                      volumes that contain the          17844500
                                      successfully exported logical     17844600
                                      volumes exported during the last  17844700
                                      hour. (214:215)            @IX2*/ 17844800
      3 SMF94IM2 FIXED(32),        /* count of the number of logical    17844900
                                      volumes successfully imported     17845000
                                      during import operations that     17845100
                                      completed during the last hour.   17845200
                                      (216:219)                  @IX2*/ 17845300
      3 SMF94EX2 FIXED(32),        /* count of the number of logical    17845400
                                      volumes that were successfully    17845500
                                      exported for export operations    17845600
                                      completed in the last hour.       17845700
                                      (220:223)                  @IX2*/ 17845800
      3 SMF94IM3 FIXED(32),        /* megabytes of data imported for    17845900
                                      import operations that completed  17846000
                                      in the last hour.  (224:227)   */ 17846100
      3 SMF94EX3 FIXED(32),        /* megabytes of data exported        17846200
                                      during export operation that      17846300
                                      completed in the last hour.       17846400
                                      (228:231)                  @IX2*/ 17846500
      3 SMF94IM4 FIXED(32),        /* megabytes of data that was moved  17846600
                                      from one physical stacked volume  17846700
                                      to another as part of the import  17846800
                                      operations completed in the last  17846900
                                      hour.  (232:235)               */ 17847000
      3 SMF94EX4 FIXED(32),        /* megabytes moved from one          17847100
                                      physical stacked volume to        17847200
                                      another as part of the export     17847300
                                      operations completed in the       17847400
                                      last hour.  (236:239)          */ 17847500
      3 *        CHAR(8),          /* Reserved, set to x'00'            17847600
                                      (240:247)                  @IX2*/ 17847700
      3 SMF94ACA FIXED(16),        /* Accessor A mounts. The count of   17847800
                                      the number of mount operations    17847900
                                      accessor A completed during the   17848000
                                      last hour.  (248:249)          */ 17848100
      3 SMF94ACB FIXED(16),        /* Accessor B mounts. The count of   17848200
                                      the number of mount operations    17848300
                                      accessor A completed during the   17848400
                                      last hour.  (250:251)          */ 17848500
      3 *        CHAR(4),          /* Reserved, set to x'00'     @gem   17848600
                                      (252:255)                  @IX2*/ 17848700
 /********************************************************************/ 17849200
 /* VTS Enhanced statistics   (bytes 256-xxx in source record )  @gem*/ 17849700
 /*                                                                  */ 17850200
 /* The VTS Enhanced statistics contain information about 1 hours    */ 17850700
 /* activity in a VTS library.                                       */ 17851200
 /********************************************************************/ 17851700
    1 SMF94_%%STATS BASED(ADDR(SMFRCD94)+SMF942OF),                     17852200
                                                                        17852700
      3 SMF94_%%BSRAT FIXED(16),   /* 256  backstore comp. ratio     */ 17853200
      3 SMF94_%%HARAT FIXED(16),   /* 258  adapter comp. ratio       */ 17853700
      3 SMF94_%%TVCS FIXED(16),    /* 260  tape volume cache size@ge2*/ 17853900
      3 SMF94_%%ESCON FIXED(8),    /* 262  number of escon chans @ge2*/ 17854100
      3 SMF94_%%SCSI FIXED(8),     /* 263  number of scsi chans  @ge2*/ 17854300
      3 SMF94_%%NUMBS FIXED(32),   /* 264  channel blocks written    */ 17854700
      3 SMF94_%%0KB FIXED(8),      /* 268  0   to 2K                 */ 17855200
      3 SMF94_%%2KB FIXED(8),      /* 269  2k  to 4k                 */ 17855700
      3 SMF94_%%4KB FIXED(8),      /* 270  4k  to 8k                 */ 17856200
      3 SMF94_%%8KB FIXED(8),      /* 271  8k  to 16k                */ 17856700
      3 SMF94_%%16KB FIXED(8),     /* 272  16k to 32k                */ 17857200
      3 SMF94_%%32KB FIXED(8),     /* 273  32k to 64k                */ 17857700
      3 SMF94_%%64KB FIXED(8),     /* 274  greater than 64k          */ 17858200
      3 SMF94_%%RCPRT FIXED(8),    /* 275  recall predominate        */ 17858700
      3 SMF94_%%WROVT FIXED(8),    /* 276  write overrun             */ 17859200
      3 *        FIXED(8),         /* 277  reserved              @ge2*/ 17859700
      3 *        CHAR(2),          /* 278  reserved (for allignment) */ 17860200
      3 SMF94_%%AVRCT FIXED(32),   /* 280  average recall            */ 17860700
      3 SMF94_%%AVWOT FIXED(32),   /* 284  average write overrun     */ 17861200
      3 *        FIXED(32),        /* 288  reserved              @ge2*/ 17861700
      3 SMF94_%%TOTAT FIXED(32),   /* 292  overall                   */ 17862200
      3 SMF94_%%MAXFR FIXED(16),   /* 296  max fast ready mount time */ 17862700
      3 SMF94_%%MINFR FIXED(16),   /* 298  min fast ready mount time */ 17863200
      3 SMF94_%%AVGFR FIXED(16),   /* 300  avg fast ready mount time */ 17863700
      3 SMF94_%%MAXCH FIXED(16),   /* 302  max cache hit  mount time */ 17864200
      3 SMF94_%%MINCH FIXED(16),   /* 304  min cache hit  mount time */ 17864700
      3 SMF94_%%AVGCH FIXED(16),   /* 306  avg cache hit  mount time */ 17865200
      3 SMF94_%%MAXRM FIXED(16),   /* 308  max recall mnt mount time */ 17865700
      3 SMF94_%%MINRM FIXED(16),   /* 310  min recall mnt mount time */ 17866200
      3 SMF94_%%AVGRM FIXED(16),   /* 312  avg recall mnt mount time */ 17866700
                                                                        17867200
      3 SMF94_%%ADV05 FIXED(16),   /* 314  05% active data volume    */ 17867700
      3 SMF94_%%ADV10 FIXED(16),   /* 316  10% active data volume    */ 17868200
      3 SMF94_%%ADV15 FIXED(16),   /* 318  15% active data volume    */ 17868700
      3 SMF94_%%ADV20 FIXED(16),   /* 320  20% active data volume    */ 17869200
      3 SMF94_%%ADV25 FIXED(16),   /* 322  25% active data volume    */ 17869700
      3 SMF94_%%ADV30 FIXED(16),   /* 324  30% active data volume    */ 17870200
      3 SMF94_%%ADV35 FIXED(16),   /* 326  35% active data volume    */ 17870700
      3 SMF94_%%ADV40 FIXED(16),   /* 328  40% active data volume    */ 17871200
      3 SMF94_%%ADV45 FIXED(16),   /* 330  45% active data volume    */ 17871700
      3 SMF94_%%ADV50 FIXED(16),   /* 332  50% active data volume    */ 17872200
      3 SMF94_%%ADV55 FIXED(16),   /* 334  55% active data volume    */ 17872700
      3 SMF94_%%ADV60 FIXED(16),   /* 336  60% active data volume    */ 17873200
      3 SMF94_%%ADV65 FIXED(16),   /* 338  65% active data volume    */ 17873700
      3 SMF94_%%ADV70 FIXED(16),   /* 340  70% active data volume    */ 17874200
      3 SMF94_%%ADV75 FIXED(16),   /* 342  75% active data volume    */ 17874700
      3 SMF94_%%ADV80 FIXED(16),   /* 344  80% active data volume    */ 17875200
      3 SMF94_%%ADV85 FIXED(16),   /* 346  85% active data volume    */ 17875700
      3 SMF94_%%ADV90 FIXED(16),   /* 348  90% active data volume    */ 17876200
      3 SMF94_%%ADV95 FIXED(16),   /* 350  95% active data volume    */ 17876700
      3 SMF94_%%ADV00 FIXED(16),   /* 352 100% active data volume    */ 17877200
                                                                        17877700
      3 SMF94_%%THRES FIXED(8),    /* 354  reclaim threshold         */ 17878200
      3 *        FIXED(8),         /* 355  reserved (set to zero)    */ 17878700
      3 SMF94_%%SRTCT FIXED(16),   /* 356  scratch stacked volume ct */ 17879200
      3 SMF94_%%PRICT FIXED(16),   /* 358  private stacked volume ct */ 17879700
      3 SMF94_%%MTVCA FIXED(32),   /* 360  max tape vol cache age@ge2*/ 17880000
      3 SMF94_%%CMGTS BIT(8),      /* 364  cache mang. settings  @50a*/ 17880100
        4 SMF94_%%VALPL BIT(1),    /*      valid bit - indicates that   17880200
                                           the following sub-fields     17880300
                                           contain valid data.   @50a*/ 17880400
        4 SMF94_%%CVMPL BIT(3),    /*      copy volume management       17880500
                                           preference level(0-7) @50a*/ 17880600
        4 *         BIT(1),        /*      reserved(set to zero) @50a*/ 17880700
        4 SMF94_%%RVMPL BIT(3),    /*      recall volume management     17880800
                                           preference level(0-7) @50a*/ 17880900
      3 *        CHAR(3),          /* 365:367 reserved           @51c*/ 17881000
      /***************************************************************/ 17881100
      /* The following fields report the code levels of the VTS  @51a*/ 17881200
      /* and Library Manager that generated the statistical      @51a*/ 17881300
      /* record.                                                 @51a*/ 17881400
      /***************************************************************/ 17881500
      3 SMF94_%%LVVCM FIXED(16),   /* 368:369 VTS code modification     17881600
                                              value.             @51a*/ 17881700
      3 SMF94_%%LVVCF FIXED(16),   /* 370:371 VTS code fix value @51a*/ 17881800
      3 SMF94_%%LVLMV FIXED(16),   /* 372:373 Library Manager code      17881900
                                              version value.     @51a*/ 17882000
      3 SMF94_%%LVLMR FIXED(16),   /* 374:375 Library Manager code      17882100
                                              release value.     @51a*/ 17882200
      3 *        CHAR(8),          /* 376:383 reserved           @51c*/ 17882300
      /***************************************************************/ 17882400
      /* Composite library Statistics                                */ 17882500
      /***************************************************************/ 17882600
      3 SMF94_%%CLLVC FIXED(32),   /* 384  logical vols to be copied */ 17882700
      3 SMF94_%%CLDTC FIXED(32),   /* 388  data to copy              */ 17882800
      3 SMF94_%%CLMT0 FIXED(16),   /* 392  mounts for VTS-0          */ 17882900
      3 SMF94_%%CLMT1 FIXED(16),   /* 394  mounts for VTS-1          */ 17883000
      3 *        CHAR(4),          /* 396  reserved                  */ 17884200
      /***************************************************************/ 17884700
      /* 400:655 contains report for up to 8 AX0's in composite lib. */ 17885200
      /* Changes to the following fields for FCR279 also include @50a*/ 17885300
      /* field definitions at the end of this macro(flagged @50).@50a*/ 17885400
      /***************************************************************/ 17885700
                                   /**********************************/ 17885800
                                   /* Statistics for AX0(0)      @50a*/ 17885900
                                   /**********************************/ 17886000
      3 SMF94_%%CLDC0 FIXED(32),   /*  0:3  data copied by AX0       */ 17886100
      3 SMF94_%%CLVC0 FIXED(32),   /*  4:7  volumes copied by AX0    */ 17886200
      3 SMF94_%%CLRD0 FIXED(32),   /*  8:11 read data transferred    */ 17886300
      3 SMF94_%%CLWD0 FIXED(32),   /* 12:15 write data transferred   */ 17886400
      3 SMF94_%%CLCM0 FIXED(16),   /* 16:17 category mounts for AX0  */ 17886500
      3 SMF94_%%CLSM0 FIXED(16),   /* 18:19 specific cache mounts    */ 17886600
      3 SMF94_%%CLRM0 FIXED(16),   /* 20:21 specific recall mounts   */ 17886700
      3 SMF94_%%CLCR0 FIXED(16),   /* 22:23 Compression ratio    @50a*/ 17886800
      3 *        BIT(8),           /* 24:24 Distributed library  @50a   17886900
                                            Preferences          @50a*/ 17887000
        4 SMF94_%%CLPI0 BIT(4),    /*       Preferred I/O VTS    @50a*/ 17887100
        4 SMF94_%%CLPM0 BIT(4),    /*       Preferred Master VTS @50a*/ 17887200
      3 *        BIT(16),          /* 25:26 Configured Settings. @50a   17887300
                                            The reported settings@50a   17887400
                                            in this 2 byte field @50a   17887500
                                            are only valid if bit@50a   17887601
                                            SMF94CLVA0 is set.   @50a*/ 17887703
        4 SMF94_%%CLDM0 BIT(2),    /*       default copy mode    @50a*/ 17887901
        4 SMF94_%%CLFS0 BIT(1),    /*       force scratch to the @50a   17888001
                                            preferred VTS.       @50a*/ 17888101
        4 SMF94_%%CLPV0 BIT(1),    /*       VTS I/O selection    @50a   17888201
                                            criteria is PRIMARY  @50a*/ 17888301
        4 SMF94_%%CLCO0 BIT(2),    /*       Controller           @50a   17888401
                                            Operational Mode     @50a*/ 17888501
        4 SMF94_%%CLWP0 BIT(1),    /*       Write Protected Mode @53a*/ 17888601
        4 *          BIT(8),       /*       reserved(set to zero)@53c*/ 17888701
        4 SMF94_%%CLVA0 BIT(1),    /*       field valid indicator@50a*/ 17888801
      3 *        FIXED(8),         /* 27:27 relative link speeds @50a*/ 17888901
        4 SMF94_%%CLLS0_AX0VTS0 BIT(4), /*  AX0 to VTS0 linkspeed@50a*/ 17889001
        4 SMF94_%%CLLS0_AX0VTS1 BIT(4), /*  AX0 to VTS1 linkspeed@50a*/ 17889101
      3 *        CHAR(4),          /* 28:31 reserved(set to zero)@50a*/ 17889201
                                   /**********************************/ 17889301
                                   /* Statistics for AX0(1)      @50a*/ 17889401
                                   /**********************************/ 17889501
      3 SMF94_%%CLDC1 FIXED(32),   /*  0:3  data copied by AX0       */ 17889601
      3 SMF94_%%CLVC1 FIXED(32),   /*  4:7  volumes copied by AX0    */ 17889701
      3 SMF94_%%CLRD1 FIXED(32),   /*  8:11 read data transferred    */ 17889801
      3 SMF94_%%CLWD1 FIXED(32),   /* 12:15 write data transferred   */ 17889901
      3 SMF94_%%CLCM1 FIXED(16),   /* 16:17 category mounts for AX0  */ 17890001
      3 SMF94_%%CLSM1 FIXED(16),   /* 18:19 specific cache mounts    */ 17890101
      3 SMF94_%%CLRM1 FIXED(16),   /* 20:21 specific recall mounts   */ 17890201
      3 SMF94_%%CLCR1 FIXED(16),   /* 22:23 Compression ratio    @50a*/ 17890301
      3 *        BIT(8),           /* 24:24 Distributed library  @50a   17890401
                                            Preferences          @50a*/ 17890501
        4 SMF94_%%CLPI1 BIT(4),    /*       Preferred I/O VTS    @50a*/ 17890601
        4 SMF94_%%CLPM1 BIT(4),    /*       Preferred Master VTS @50a*/ 17890701
      3 *        BIT(16),          /* 25:26 Configured Settings. @50a   17890801
                                            The reported settings@50a   17890901
                                            in this 2 byte field @50a   17891001
                                            are only valid if bit@50a   17891101
                                            SMF94CLVA1 is set.   @50a*/ 17891203
        4 SMF94_%%CLDM1 BIT(2),    /*       default copy mode    @50a*/ 17891401
        4 SMF94_%%CLFS1 BIT(1),    /*       force scratch to the @50a   17891501
                                            preferred VTS.       @50a*/ 17891601
        4 SMF94_%%CLPV1 BIT(1),    /*       VTS I/O selection    @50a   17891701
                                            criteria is PRIMARY  @50a*/ 17891801
        4 SMF94_%%CLCO1 BIT(2),    /*       Controller           @50a   17891901
                                            Operational Mode     @50a*/ 17892001
        4 SMF94_%%CLWP1 BIT(1),    /*       Write Protected Mode @53a*/ 17892101
        4 *          BIT(8),       /*       reserved(set to zero)@53c*/ 17892201
        4 SMF94_%%CLVA1 BIT(1),    /*       field valid indicator@50a*/ 17892301
      3 *        FIXED(8),         /* 27:27 relative link speeds @50a*/ 17892401
        4 SMF94_%%CLLS1_AX0VTS0 BIT(4), /*  AX0-VTS0 link speed  @50a*/ 17892501
        4 SMF94_%%CLLS1_AX0VTS1 BIT(4), /*  AX0-VTS1 link speed  @50a*/ 17892601
      3 *        CHAR(4),          /* 28:31 reserved(set to zero)@50a*/ 17892701
                                   /**********************************/ 17892801
                                   /* Statistics for AX0(2)      @50a*/ 17892901
                                   /**********************************/ 17893001
      3 SMF94_%%CLDC2 FIXED(32),   /*  0:3  data copied by AX0       */ 17893101
      3 SMF94_%%CLVC2 FIXED(32),   /*  4:7  volumes copied by AX0    */ 17893201
      3 SMF94_%%CLRD2 FIXED(32),   /*  8:11 read data transferred    */ 17893301
      3 SMF94_%%CLWD2 FIXED(32),   /* 12:15 write data transferred   */ 17893401
      3 SMF94_%%CLCM2 FIXED(16),   /* 16:17 category mounts for AX0  */ 17893501
      3 SMF94_%%CLSM2 FIXED(16),   /* 18:19 specific cache mounts    */ 17893601
      3 SMF94_%%CLRM2 FIXED(16),   /* 20:21 specific recall mounts   */ 17893701
      3 SMF94_%%CLCR2 FIXED(16),   /* 22:23 Compression ratio    @50a*/ 17893801
      3 *        BIT(8),           /* 24:24 Distributed library  @50a   17893901
                                            Preferences          @50a*/ 17894001
        4 SMF94_%%CLPI2 BIT(4),    /*       Preferred I/O VTS    @50a*/ 17894101
        4 SMF94_%%CLPM2 BIT(4),    /*       Preferred Master VTS @50a*/ 17894201
      3 *        BIT(16),          /* 25:26 Configured Settings. @50a   17894301
                                            The reported settings@50a   17894401
                                            in this 2 byte field @50a   17894501
                                            are only valid if bit@50a   17894601
                                            SMF94CLVA2 is set.   @50a*/ 17894703
        4 SMF94_%%CLDM2 BIT(2),    /*       default copy mode    @50a*/ 17894801
        4 SMF94_%%CLFS2 BIT(1),    /*       force scratch to the @50a   17894901
                                            preferred VTS.       @50a*/ 17895001
        4 SMF94_%%CLPV2 BIT(1),    /*       VTS I/O selection    @50a   17895101
                                            criteria is PRIMARY  @50a*/ 17895201
        4 SMF94_%%CLCO2 BIT(2),    /*       Controller           @50a   17895301
                                            Operational Mode     @50a*/ 17895401
        4 SMF94_%%CLWP2 BIT(1),    /*       Write Protected Mode @53a*/ 17895501
        4 *          BIT(8),       /*       reserved(set to zero)@53c*/ 17895601
        4 SMF94_%%CLVA2 BIT(1),    /*       field valid indicator@50a*/ 17895701
      3 *        FIXED(8),         /* 27:27 relative link speeds @50a*/ 17895801
        4 SMF94_%%CLLS2_AX0VTS0 BIT(4), /*  AX0-VTS0 link speed  @50a*/ 17895901
        4 SMF94_%%CLLS2_AX0VTS1 BIT(4), /*  AX0-VTS1 link speed  @50a*/ 17896001
      3 *        CHAR(4),          /* 28:31 reserved(set to zero)@50a*/ 17896101
                                   /**********************************/ 17896201
                                   /* Statistics for AX0(3)      @50a*/ 17896301
                                   /**********************************/ 17896401
      3 SMF94_%%CLDC3 FIXED(32),   /*  0:3  data copied by AX0       */ 17896501
      3 SMF94_%%CLVC3 FIXED(32),   /*  4:7  volumes copied by AX0    */ 17896601
      3 SMF94_%%CLRD3 FIXED(32),   /*  8:11 read data transferred    */ 17896701
      3 SMF94_%%CLWD3 FIXED(32),   /* 12:15 write data transferred   */ 17896801
      3 SMF94_%%CLCM3 FIXED(16),   /* 16:17 category mounts for AX0  */ 17896901
      3 SMF94_%%CLSM3 FIXED(16),   /* 18:19 specific cache mounts    */ 17897001
      3 SMF94_%%CLRM3 FIXED(16),   /* 20:21 specific recall mounts   */ 17897101
      3 SMF94_%%CLCR3 FIXED(16),   /* 22:23 Compression ratio    @50a*/ 17897201
      3 *        BIT(8),           /* 24:24 Distributed library  @50a   17897301
                                            Preferences          @50a*/ 17897401
        4 SMF94_%%CLPI3 BIT(4),    /*       Preferred I/O VTS    @50a*/ 17897501
        4 SMF94_%%CLPM3 BIT(4),    /*       Preferred Master VTS @50a*/ 17897601
      3 *        BIT(16),          /* 25:26 Configured Settings. @50a   17897701
                                            The reported settings@50a   17897801
                                            in this 2 byte field @50a   17897901
                                            are only valid if bit@50a   17898001
                                            SMF94CLVA3 is set.   @50a*/ 17898103
        4 SMF94_%%CLDM3 BIT(2),    /*       default copy mode    @50a*/ 17898201
        4 SMF94_%%CLFS3 BIT(1),    /*       force scratch to the @50a   17898301
                                            preferred VTS.       @50a*/ 17898401
        4 SMF94_%%CLPV3 BIT(1),    /*       VTS I/O selection    @50a   17898501
                                            criteria is PRIMARY  @50a*/ 17898601
        4 SMF94_%%CLCO3 BIT(2),    /*       Controller           @50a   17898701
                                            Operational Mode     @50a*/ 17898801
        4 SMF94_%%CLWP3 BIT(1),    /*       Write Protected Mode @53a*/ 17898901
        4 *          BIT(8),       /*       reserved(set to zero)@53c*/ 17899001
        4 SMF94_%%CLVA3 BIT(1),    /*       field valid indicator@50a*/ 17899101
      3 *        FIXED(8),         /* 27:27 relative link speeds @50a*/ 17899201
        4 SMF94_%%CLLS3_AX0VTS0 BIT(4), /*  AX0-VTS0 link speed  @50a*/ 17899301
        4 SMF94_%%CLLS3_AX0VTS1 BIT(4), /*  AX0-VTS1 link speed  @50a*/ 17899401
      3 *        CHAR(4),          /* 28:31 reserved(set to zero)@50a*/ 17899501
                                   /**********************************/ 17899601
                                   /* Statistics for AX0(4)      @50a*/ 17899701
                                   /**********************************/ 17899801
      3 SMF94_%%CLDC4 FIXED(32),   /*  0:3  data copied by AX0       */ 17899901
      3 SMF94_%%CLVC4 FIXED(32),   /*  4:7  volumes copied by AX0    */ 17900001
      3 SMF94_%%CLRD4 FIXED(32),   /*  8:11 read data transferred    */ 17900101
      3 SMF94_%%CLWD4 FIXED(32),   /* 12:15 write data transferred   */ 17900201
      3 SMF94_%%CLCM4 FIXED(16),   /* 16:17 category mounts for AX0  */ 17900301
      3 SMF94_%%CLSM4 FIXED(16),   /* 18:19 specific cache mounts    */ 17900401
      3 SMF94_%%CLRM4 FIXED(16),   /* 20:21 specific recall mounts   */ 17900501
      3 SMF94_%%CLCR4 FIXED(16),   /* 22:23 Compression ratio    @50a*/ 17900601
      3 *        BIT(8),           /* 24:24 Distributed library  @50a   17900701
                                            Preferences          @50a*/ 17900801
        4 SMF94_%%CLPI4 BIT(4),    /*       Preferred I/O VTS    @50a*/ 17900901
        4 SMF94_%%CLPM4 BIT(4),    /*       Preferred Master VTS @50a*/ 17901001
      3 *        BIT(16),          /* 25:26 Configured Settings. @50a   17901101
                                            The reported settings@50a   17901201
                                            in this 2 byte field @50a   17901301
                                            are only valid if bit@50a   17901401
                                            SMF94CLVA4 is set.   @50a*/ 17901503
        4 SMF94_%%CLDM4 BIT(2),    /*       default copy mode    @50a*/ 17901601
        4 SMF94_%%CLFS4 BIT(1),    /*       force scratch to the @50a   17901701
                                            preferred VTS.       @50a*/ 17901801
        4 SMF94_%%CLPV4 BIT(1),    /*       VTS I/O selection    @50a   17901901
                                            criteria is PRIMARY  @50a*/ 17902001
        4 SMF94_%%CLCO4 BIT(2),    /*       Controller           @50a   17902101
                                            Operational Mode     @50a*/ 17902201
        4 SMF94_%%CLWP4 BIT(1),    /*       Write Protected Mode @53a*/ 17902301
        4 *          BIT(8),       /*       reserved(set to zero)@53c*/ 17902401
        4 SMF94_%%CLVA4 BIT(1),    /*       field valid indicator@50a*/ 17902501
      3 *        FIXED(8),         /* 27:27 relative link speeds @50a*/ 17902601
        4 SMF94_%%CLLS4_AX0VTS0 BIT(4), /*  AX0-VTS0 link speed  @50a*/ 17902701
        4 SMF94_%%CLLS4_AX0VTS1 BIT(4), /*  AX0-VTS1 link speed  @50a*/ 17902801
      3 *        CHAR(4),          /* 28:31 reserved(set to zero)@50a*/ 17902901
                                   /**********************************/ 17903001
                                   /* Statistics for AX0(5)      @50a*/ 17903101
                                   /**********************************/ 17903201
      3 SMF94_%%CLDC5 FIXED(32),   /*  0:3  data copied by AX0       */ 17903301
      3 SMF94_%%CLVC5 FIXED(32),   /*  4:7  volumes copied by AX0    */ 17903401
      3 SMF94_%%CLRD5 FIXED(32),   /*  8:11 read data transferred    */ 17903501
      3 SMF94_%%CLWD5 FIXED(32),   /* 12:15 write data transferred   */ 17903601
      3 SMF94_%%CLCM5 FIXED(16),   /* 16:17 category mounts for AX0  */ 17903701
      3 SMF94_%%CLSM5 FIXED(16),   /* 18:19 specific cache mounts    */ 17903801
      3 SMF94_%%CLRM5 FIXED(16),   /* 20:21 specific recall mounts   */ 17903901
      3 SMF94_%%CLCR5 FIXED(16),   /* 22:23 Compression ratio    @50a*/ 17904001
      3 *        BIT(8),           /* 24:24 Distributed library  @50a   17904101
                                            Preferences          @50a*/ 17904201
        4 SMF94_%%CLPI5 BIT(4),    /*       Preferred I/O VTS    @50a*/ 17904301
        4 SMF94_%%CLPM5 BIT(4),    /*       Preferred Master VTS @50a*/ 17904401
      3 *        BIT(16),          /* 25:26 Configured Settings. @50a   17904501
                                            The reported settings@50a   17904601
                                            in this 2 byte field @50a   17904701
                                            are only valid if bit@50a   17904801
                                            SMF94CLVA5 is set.   @50a*/ 17904903
        4 SMF94_%%CLDM5 BIT(2),    /*       default copy mode    @50a*/ 17905001
        4 SMF94_%%CLFS5 BIT(1),    /*       force scratch to the @50a   17905101
                                            preferred VTS.       @50a*/ 17905201
        4 SMF94_%%CLPV5 BIT(1),    /*       VTS I/O selection    @50a   17905301
                                            criteria is PRIMARY  @50a*/ 17905401
        4 SMF94_%%CLCO5 BIT(2),    /*       Controller           @50a   17905501
                                            Operational Mode     @50a*/ 17905601
        4 SMF94_%%CLWP5 BIT(1),    /*       Write Protected Mode @53a*/ 17905701
        4 *          BIT(8),       /*       reserved(set to zero)@53c*/ 17905801
        4 SMF94_%%CLVA5 BIT(1),    /*       field valid indicator@50a*/ 17905901
      3 *        FIXED(8),         /* 27:27 relative link speeds @50a*/ 17906001
        4 SMF94_%%CLLS5_AX0VTS0 BIT(4), /*  AX0-VTS0 link speed  @50a*/ 17906101
        4 SMF94_%%CLLS5_AX0VTS1 BIT(4), /*  AX0-VTS1 link speed  @50a*/ 17906201
      3 *        CHAR(4),          /* 28:31 reserved(set to zero)@50a*/ 17906301
                                   /**********************************/ 17906401
                                   /* Statistics for AX0(6)      @50a*/ 17906501
                                   /**********************************/ 17906601
      3 SMF94_%%CLDC6 FIXED(32),   /*  0:3  data copied by AX0       */ 17906701
      3 SMF94_%%CLVC6 FIXED(32),   /*  4:7  volumes copied by AX0    */ 17906801
      3 SMF94_%%CLRD6 FIXED(32),   /*  8:11 read data transferred    */ 17906901
      3 SMF94_%%CLWD6 FIXED(32),   /* 12:15 write data transferred   */ 17907001
      3 SMF94_%%CLCM6 FIXED(16),   /* 16:17 category mounts for AX0  */ 17907101
      3 SMF94_%%CLSM6 FIXED(16),   /* 18:19 specific cache mounts    */ 17907201
      3 SMF94_%%CLRM6 FIXED(16),   /* 20:21 specific recall mounts   */ 17907301
      3 SMF94_%%CLCR6 FIXED(16),   /* 22:23 Compression ratio    @50a*/ 17907401
      3 *        BIT(8),           /* 24:24 Distributed library  @50a   17907501
                                            Preferences          @50a*/ 17907601
        4 SMF94_%%CLPI6 BIT(4),    /*       Preferred I/O VTS    @50a*/ 17907701
        4 SMF94_%%CLPM6 BIT(4),    /*       Preferred Master VTS @50a*/ 17907801
      3 *        BIT(16),          /* 25:26 Configured Settings. @50a   17907901
                                            The reported settings@50a   17908001
                                            in this 2 byte field @50a   17908101
                                            are only valid if bit@50a   17908201
                                            SMF94CLVA6 is set.   @50a*/ 17908303
        4 SMF94_%%CLDM6 BIT(2),    /*       default copy mode    @50a*/ 17908401
        4 SMF94_%%CLFS6 BIT(1),    /*       force scratch to the @50a   17908501
                                            preferred VTS.       @50a*/ 17908601
        4 SMF94_%%CLPV6 BIT(1),    /*       VTS I/O selection    @50a   17908701
                                            criteria is PRIMARY  @50a*/ 17908801
        4 SMF94_%%CLCO6 BIT(2),    /*       Controller           @50a   17908901
                                            Operational Mode     @50a*/ 17909001
        4 SMF94_%%CLWP6 BIT(1),    /*       Write Protected Mode @53a*/ 17909101
        4 *          BIT(8),       /*       reserved(set to zero)@53c*/ 17909201
        4 SMF94_%%CLVA6 BIT(1),    /*       field valid indicator@50a*/ 17909301
      3 *        FIXED(8),         /* 27:27 relative link speeds @50a*/ 17909401
        4 SMF94_%%CLLS6_AX0VTS0 BIT(4), /*  AX0-VTS0 link speed  @50a*/ 17909501
        4 SMF94_%%CLLS6_AX0VTS1 BIT(4), /*  AX0-VTS1 link speed  @50a*/ 17909601
      3 *        CHAR(4),          /* 28:31 reserved(set to zero)@50a*/ 17909701
                                   /**********************************/ 17909801
                                   /* Statistics for AX0(7)      @50a*/ 17909901
                                   /**********************************/ 17910001
      3 SMF94_%%CLDC7 FIXED(32),   /*  0:3  data copied by AX0       */ 17910101
      3 SMF94_%%CLVC7 FIXED(32),   /*  4:7  volumes copied by AX0    */ 17910201
      3 SMF94_%%CLRD7 FIXED(32),   /*  8:11 read data transferred    */ 17910301
      3 SMF94_%%CLWD7 FIXED(32),   /* 12:15 write data transferred   */ 17910401
      3 SMF94_%%CLCM7 FIXED(16),   /* 16:17 category mounts for AX0  */ 17910501
      3 SMF94_%%CLSM7 FIXED(16),   /* 18:19 specific cache mounts    */ 17910601
      3 SMF94_%%CLRM7 FIXED(16),   /* 20:21 specific recall mounts   */ 17910701
      3 SMF94_%%CLCR7 FIXED(16),   /* 22:23 Compression ratio    @50a*/ 17910801
      3 *        BIT(8),           /* 24:24 Distributed library  @50a   17910901
                                            Preferences          @50a*/ 17911001
        4 SMF94_%%CLPI7 BIT(4),    /*       Preferred I/O VTS    @50a*/ 17911101
        4 SMF94_%%CLPM7 BIT(4),    /*       Preferred Master VTS @50a*/ 17911201
      3 *        BIT(16),          /* 25:26 Configured Settings. @50a   17911301
                                            The reported settings@50a   17911401
                                            in this 2 byte field @50a   17911501
                                            are only valid if bit@50a   17911601
                                            SMF94CLVA7 is set.   @50a*/ 17911703
        4 SMF94_%%CLDM7 BIT(2),    /*       default copy mode    @50a*/ 17911801
        4 SMF94_%%CLFS7 BIT(1),    /*       force scratch to the @50a   17911901
                                            preferred VTS.       @50a*/ 17912001
        4 SMF94_%%CLPV7 BIT(1),    /*       VTS I/O selection    @50a   17912101
                                            criteria is PRIMARY  @50a*/ 17912201
        4 SMF94_%%CLCO7 BIT(2),    /*       Controller           @50a   17912301
                                            Operational Mode     @50a*/ 17912401
        4 SMF94_%%CLWP7 BIT(1),    /*       Write Protected Mode @53a*/ 17912501
        4 *          BIT(8),       /*       reserved(set to zero)@53c*/ 17912601
        4 SMF94_%%CLVA7 BIT(1),    /*       field valid indicator@50a*/ 17912701
      3 *        FIXED(8),         /* 27:27 relative link speeds @50a*/ 17912801
        4 SMF94_%%CLLS7_AX0VTS0 BIT(4), /*  AX0-VTS0 link speed  @50a*/ 17912901
        4 SMF94_%%CLLS7_AX0VTS1 BIT(4), /*  AX0-VTS1 link speed  @50a*/ 17913001
      3 *        CHAR(4),          /* 28:31 reserved(set to zero)@50a*/ 17913101
      /***************************************************************/ 17913201
      /* VTC code levels in a PTP VTS.                           @51a*/ 17913301
      /*                                                         @51a*/ 17913401
      /* The following set of fields report the code levels of   @51a*/ 17913501
      /* the VTCs in a PTP VTS subsystem that generated the      @51a*/ 17913601
      /* statistical record. For each of the 8 sets of fields,   @51a*/ 17913701
      /* the field can return zeros for the following cases:     @51a*/ 17913801
      /*                                                         @51a*/ 17913901
      /* 1.The request was for a distributed library of a PTP.   @51a*/ 17914001
      /* 2.One or more VTC was not installed or was unavailable. @51a*/ 17914101
      /* 3.The PTP VTS does not support providing code levels.   @51a*/ 17914201
      /*                                                         @51a*/ 17914301
      /***************************************************************/ 17914401
      3 SMF94_%%CMV_VTC0 FIXED(16), /* 656:657 code mod value    @51a*/ 17914501
      3 SMF94_%%CFV_VTC0 FIXED(16), /* 658:659 code fix value    @51a*/ 17914601
      3 SMF94_%%CMV_VTC1 FIXED(16), /* 660:661 code mod value    @51a*/ 17914701
      3 SMF94_%%CFV_VTC1 FIXED(16), /* 662:663 code fix value    @51a*/ 17914801
      3 SMF94_%%CMV_VTC2 FIXED(16), /* 664:665 code mod value    @51a*/ 17914901
      3 SMF94_%%CFV_VTC2 FIXED(16), /* 666:667 code fix value    @51a*/ 17915001
      3 SMF94_%%CMV_VTC3 FIXED(16), /* 668:669 code mod value    @51a*/ 17915101
      3 SMF94_%%CFV_VTC3 FIXED(16), /* 670:671 code fix value    @51a*/ 17915201
      3 SMF94_%%CMV_VTC4 FIXED(16), /* 672:673 code mod value    @51a*/ 17915301
      3 SMF94_%%CFV_VTC4 FIXED(16), /* 674:675 code fix value    @51a*/ 17915401
      3 SMF94_%%CMV_VTC5 FIXED(16), /* 676:677 code mod value    @51a*/ 17915501
      3 SMF94_%%CFV_VTC5 FIXED(16), /* 678:679 code fix value    @51a*/ 17915601
      3 SMF94_%%CMV_VTC6 FIXED(16), /* 680:681 code mod value    @51a*/ 17915701
      3 SMF94_%%CFV_VTC6 FIXED(16), /* 682:683 code fix value    @51a*/ 17915801
      3 SMF94_%%CMV_VTC7 FIXED(16), /* 684:685 code mod value    @51a*/ 17915901
      3 SMF94_%%CFV_VTC7 FIXED(16), /* 686:687 code fix value    @51a*/ 17916001
      /***************************************************************/ 17916101
      /* 688:783 reserved (set to X'00')                         @51c*/ 17916201
      /***************************************************************/ 17916301
      3 *        CHAR(96),         /* reserved (set to X'00')    @51c*/ 17916401
      /***************************************************************/ 17916501
      /* 784:799 when F/C 4001 is installed & enabled, contains  @30a*/ 17916601
      /* information about:                                      @30a*/ 17916701
      /* Virtual Tape Device Configuration and Usage.            @30a*/ 17916801
      /***************************************************************/ 17916901
      3 SMF94_%%OPM_VDC FIXED(16), /* Virtual Drives Configured         17917001
                                      Contains the number of virtual    17917101
                                      devices configured in the VTS     17917201
                                      subsystem.                     */ 17917301
      3 SMF94_%%OPM_MAXVDM FIXED(16), /* Max Virtual Drives Mounted con-17917401
                                      currenty during the last hour. */ 17917501
      3 SMF94_%%OPM_MINVDM FIXED(16), /* Min Virtual Drives Mounted con-17917601
                                      currenty during the last hour. */ 17917701
      3 SMF94_%%OPM_AVGVDM FIXED(16), /* Avg Virtual Drives Mounted con-17917801
                                      currenty during the last hour. */ 17917901
      3 *        CHAR(8),          /* reserved (set to X'00')        */ 17918001
      /***************************************************************/ 17918101
      /* 800:863 when F/C 4001 is installed & enabled, contains  @30a*/ 17918201
      /* information about:                                      @30a*/ 17918301
      /* Physical tape devices usage characteristics.            @30a*/ 17918401
      /* Each group of 32 bytes contains the statistics for the  @30a*/ 17918501
      /* physical tape device usage of a specific device type in @30a*/ 17918601
      /* the VTS. Space is defined for 2 device types.           @30a*/ 17918701
      /***************************************************************/ 17918801
      3 *(2) CHAR(32) BDY(WORD),  /* reserved (set to X'00')        */  17918901
       4 SMF94_%%OPM_DCI FIXED(8), /* 00    device class identifier:    17919001
                                            X'00' no device class       17919101
                                            X'11' 3590 Model B1A        17919201
                                            X'13' 3590 Model E1A        17919301
                                            X'14' 3590 Model H1A @52a   17919401
                                            X'20' 3592 Model J1A @52a*/ 17919501
       4 SMF94_%%OPM_PDI FIXED(8), /* 01    physical devs installed  */ 17919601
       4 SMF94_%%OPM_CAFU FIXED(8), /* 02   currently avail for use  */ 17919701
       4 SMF94_%%OPM_MAXCM FIXED(8), /* 03  maximum concurrent mounts   17919801
                                            during the last hour.    */ 17919901
       4 SMF94_%%OPM_MINCM FIXED(8), /* 04  minimum concurrent mounts   17920001
                                            during the last hour.    */ 17920101
       4 SMF94_%%OPM_AVGCM FIXED(8), /* 05  average concurrent mounts   17920201
                                            during the last hour.    */ 17920301
       4 SMF94_%%OPM_MAXTTM FIXED(16),/*                                17920401
                                      06:07 max time(in secs) to mount  17920501
                                            during the last hour.    */ 17920601
       4 SMF94_%%OPM_MINTTM FIXED(16),/*                                17920701
                                      08:09 min time(in secs) to mount  17920801
                                            during the last hour.    */ 17920901
       4 SMF94_%%OPM_AVGTTM FIXED(16),/*                                17921001
                                      10:11 avg time(in secs) to mount  17921101
                                            during the last hour.    */ 17921201
       4 SMF94_%%OPM_STGMNTS FIXED(16),/* 12:13 number of stage mounts  17921301
                                            during the last hour.    */ 17921401
       4 SMF94_%%OPM_MIGMNTS FIXED(16),/* 14:15 # of migration mounts   17921501
                                            during the last hour.    */ 17921601
       4 SMF94_%%OPM_RECMNTS FIXED(16),/* 16:17 # of reclamation mounts 17921701
                                            during the last hour.    */ 17921801
       4 SMF94_%%OPM_SDEMNTS FIXED(16),/* 18:19 # of physical mounts    17921901
                                            during the last hour to     17922001
                                            satisfy secure data         17922101
                                            erasure.             @53a*/ 17922201
       4 SMF94_%%OPM_PPWRITEN FIXED(32),/*                              17922301
                                      20:23 megabytes premigrated from  17922401
                                            tape volume cache to a      17922501
                                            primary pool during the     17922601
                                            last hour.               */ 17922701
       4 SMF94_%%OPM_SPWRITEN FIXED(32),/*                              17922801
                                      24:27 megabytes premigrated from  17922901
                                            tape volume cache to a      17923001
                                            secondary pool during the   17923101
                                            last hour.               */ 17923300
       4 *               CHAR(4),  /* reserved (set to X'00')        */ 17923700
      /***************************************************************/ 17924100
      /* 864:1375 when F/C 4001 is installed & enabled, contains @30a*/ 17924500
      /* information about:                                      @30a*/ 17924900
      /* VTS cache usage characteristics.                        @30a*/ 17925300
      /***************************************************************/ 17925700
      3 SMF94_%%OPM_PLCU(8) CHAR(64) /* 00:64 Pref. Level Cache Usage */17926100
                BDY(WORD),         /*       w/o F/C 4001 set to X'00'*/ 17926500
       4 SMF94_%%OPM_PMC BIT(32),  /* 00:03 preference mang.control  */ 17926900
       4 SMF94_%%OPM_VVIC FIXED(32),/* 04:07 virtual vols in cache   */ 17927300
       4 SMF94_%%OPM_DRIC FIXED(32),/* 08:11 data resident in cache  */ 17927700
       4 SMF94_%%OPM_TVCA4 FIXED(32),/* 12:15 tape volume cache age     17928100
                                            (4 hour rolling average) */ 17928500
       4 SMF94_%%OPM_VM4 FIXED(32),/* 16:19 volumes migrated from       17929000
                                            cache (last 4 hours) @51c*/ 17929500
       4 SMF94_%%OPM_TVCA48 FIXED(32),/* 20:23 tape volume cache age    17930100
                                            (48 hour rolling avg.)   */ 17930500
       4 SMF94_%%OPM_VM48 FIXED(32),/* 24:27 volumes migrated over the  17931000
                                            last 48 hrs          @51c*/ 17931500
       4 SMF94_%%OPM_TVCA35 FIXED(32),/* 28:31 tape volume cache age    17932100
                                            (35 day rolling avg.)    */ 17932500
       4 SMF94_%%OPM_VM35 FIXED(32),/* 32:35 volumes migrated from      17932900
                                            cache over last 35 days     17933300
                                                                 @51c*/ 17933700
       4 SMF94_%%OPM_FRMT FIXED(16),/* 36:37 average fast ready mount   17934100
                                            time.                    */ 17934500
       4 SMF94_%%OPM_FRMNTS FIXED(16),/* 38:39 # of fast-ready mounts */17934900
       4 SMF94_%%OPM_CHTIME FIXED(16),/*                                17935300
                                      40:41 avg. cache hit mount time*/ 17935400
       4 SMF94_%%OPM_CHMNTS FIXED(16),/* 42:43 cache hit mounts      */ 17935700
       4 SMF94_%%OPM_CMTIME FIXED(16),/*                                17936100
                                      44:45 avg.cache miss mount time*/ 17936200
       4 SMF94_%%OPM_CMMNTS FIXED(16),/* 46:47 cache miss mounts     */ 17936500
       4 *               CHAR(16), /* 48:63 reserved (set to X'00')  */ 17936900
      /***************************************************************/ 17937300
      /* 1376:1387 IART Controlled Mount Statistics.             @30a*/ 17937700
      /*                                                         @30a*/ 17938100
      /***************************************************************/ 17938500
      3 SMF94_%%OPM_IARTAFRT FIXED(16),/* 1376:1377 Average fast-ready  17938900
                                                mount time.          */ 17939300
      3 SMF94_%%OPM_IARTFRM FIXED(16),/* 1378:1379 Fast-ready mounts. */17939700
      3 SMF94_%%OPM_IARTCHMT FIXED(16),/* 1380:1381 Average cache hit   17940100
                                                mount time.          */ 17940500
      3 SMF94_%%OPM_IARTCHM FIXED(16),/* 1382:1383 Cache hit mounts. */ 17940900
      3 SMF94_%%OPM_IARTCMMT FIXED(16),/* 1384:1385 Average cache miss  17941300
                                                mount time.          */ 17941700
      3 SMF94_%%OPM_IARTCMM FIXED(16),/* 1386:1387 cache miss mounts. */17942100
      3 SMF94_%%END CHAR(0);       /*                            @30a*/ 17942500
 /********************************************************************/ 17942900
 /*  CONSTANTS                                                       */ 17943300
 /********************************************************************/ 17943700
 DCL SMF94C94 FIXED(8) CONSTANT(94); /* Used in SMF94RTY field       */ 17950000
                                                                        18000000
 /********************************************************************/ 18050000
 /*  SMF TYPE 94 (Subtype 2) RECORD, Volume Pool Statistics      @30a*/ 18100000
 /*  Note: this data structure is valid when SMF94 subtype       @30a*/ 18150000
 /*        field (SMF94STP) contains a 2.                        @30a*/ 18200000
 /********************************************************************/ 18250000
 DCL                                                                    18300000
 1 SMF94S2   BASED(ADDR(SMFRCD94)+LENGTH(SMF94RPS)),                    18350000
 /********************************************************************/ 18400000
 /*   SELF DEFINING SECTION                                          */ 18450000
 /********************************************************************/ 18500000
   3 SMF94S2_SDS,                  /* Self Defining Section          */ 18550000
     5 SMF94S2_SDL FIXED(32),      /* Self Defining Section length   */ 18600000
     5 SMF94S2_POF FIXED(32),      /* Offset to product Section      */ 18650000
     5 SMF94S2_PLN FIXED(16),      /* Length of product Section      */ 18700000
     5 SMF94S2_PON FIXED(16),      /* Number of product Sections     */ 18750000
                                                                        18800000
     5 SMF94S2_HOF FIXED(32),      /* Offset to header section       */ 18850000
     5 SMF94S2_HLN FIXED(16),      /* Length of header section       */ 18900000
     5 SMF94S2_HON FIXED(16),      /* Number of header sections      */ 18950000
                                                                        19000000
     5 SMF94S2_SOF FIXED(32),      /* Offset to statistics           */ 19050000
     5 SMF94S2_SLN FIXED(16),      /* Length of statistics           */ 19100000
     5 SMF94S2_SON FIXED(16),      /* Number of statistics           */ 19150000
 /********************************************************************/ 19200000
 /*  SMF TYPE 94 (Subtype 2) Product Section                         */ 19250000
 /********************************************************************/ 19300000
 1 SMF94S2_PSS BASED(ADDR(SMFRCD94)+SMF94S2_POF),                       19350000
   3 SMF94S2_TYP FIXED(16),        /* record subtype = 01            */ 19400000
   3 SMF94S2_RVN CHAR(2),          /* record version number = 01     */ 19450000
   3 SMF94S2_PNM CHAR(8),          /* product name 'fmid     '       */ 19500000
   3 SMF94S2_MVS CHAR(8),          /* MVS operating system name      */ 19550000
 /********************************************************************/ 19600000
 /*  SMF TYPE 94 (Subtype 2) Header Section                          */ 19650000
 /*  Reserved for information generated by software.                 */ 19700000
 /********************************************************************/ 19750000
 1 SMF94S2_HDR BASED(ADDR(SMFRCD94)+SMF94S2_HOF),                       19800000
   3 *            CHAR(32),        /* reserved                       */ 19850000
 /********************************************************************/ 19900000
 /*  SMF TYPE 94 (Subtype 2) Volume Pool Statistics (VPS)            */ 19950000
 /*  NOTE: there may be more than one of these sections recorded.    */ 20000000
 /*        The number of sections is contained in SMF94S2_SON.       */ 20050000
 /*        SMF94S2_SOF contains the offset to the first section, and */ 20100000
 /*        SMF94S2_SLN contains the length of each section.          */ 20150000
 /********************************************************************/ 20200000
 1 SMF94S2_DATA BASED(ADDR(SMFRCD94)+SMF94S2_SOF)                       20250000
                CHAR(2096) BDY(WORD),                                   20300000
   3 SMF94S2_MSGHDR CHAR(16)       /*  0:15 VPS message header data  */ 20350000
                       BDY(WORD),                                       20400000
    4 SMF94S2_LENGTH   FIXED(16),  /*  0:01 message length           */ 20450000
    4 SMF94S2_MSGFMT   CHAR(1),    /*  2:02 message format ('10'x)   */ 20500000
    4 SMF94S2_MSGCODE  CHAR(1),    /*  3:03 message code   ('29'x)   */ 20550000
    4 SMF94S2_MSGID    CHAR(4),    /*  4:07 message-id               */ 20600000
    4 *                CHAR(1),    /*  8:08 Reserved                 */ 20650000
    4 SMF94S2_LIBID    CHAR(3),    /*  9:11 library sequence number  */ 20700000
    4 SMF94S2_VPSFMT   CHAR(1),    /* 12:12 volume pool stats format */ 20750000
    4 *                CHAR(1),    /* 13:13 Reserved                 */ 20800000
    4 SMF94S2_HHI      FIXED(16),  /* 14:15 hour index               */ 20850000
   3 *                 CHAR(32)    /* 16:47                          */ 20900000
                       BDY(WORD),                                       20950000
    4 SMF94S2_LRTD     CHAR(10),   /* 16:25 last reconcile time/data */ 21000000
    4 SMF94S2_MNVP     FIXED(16),  /* 26:27 max pools in partition   */ 21050000
    4 *                CHAR(1),    /* 28                             */ 21100000
    4 SMF94S2_VPSET    FIXED(8),   /* 29    pool set (1of2,2of2,etc) */ 21150000
    4 *                CHAR(2),    /* 30:31                          */ 21200000
    4 *                CHAR(1),    /* 32                             */ 21250000
    4 SMF94S2_BPMI0    FIXED(8),   /* 33    media type for BPSVC0    */ 21300000
    4 SMF94S2_BPSVC0   FIXED(16),  /* 34:35 number of scratch stacked   21350000
                                            volumes of type BPMI0    */ 21400000
    4 *                CHAR(1),    /* 36    reserved                 */ 21450000
    4 SMF94S2_BPMI1    FIXED(8),   /* 37    media type for BPSVC1    */ 21500000
    4 SMF94S2_BPSVC1   FIXED(16),  /* 38:39 number of scratch stacked   21550000
                                            volumes of type BPMI1    */ 21600000
    4 *                CHAR(1),    /* 40    reserved                 */ 21650000
    4 SMF94S2_BPMI2    FIXED(8),   /* 41    media type for BPSVC2    */ 21700000
    4 SMF94S2_BPSVC2   FIXED(16),  /* 42:43 number of scratch stacked   21750000
                                            volumes of type BPMI2    */ 21800000
    4 *                CHAR(1),    /* 44    reserved                 */ 21850000
    4 SMF94S2_BPMI3    FIXED(8),   /* 45    media type for BPSVC3    */ 21900000
    4 SMF94S2_BPSVC3   FIXED(16),  /* 46:47 number of scratch stacked   21950000
                                            volumes of type BPMI3    */ 22000000
 /********************************************************************/ 22050000
 /*  This section contains an array containing statistics for        */ 22100000
 /*  16 volume pools. Each entry is 112 bytes long.                  */ 22150000
 /********************************************************************/ 22200000
   3 SMF94S2_ARRAY CHAR(1792) BDY(WORD),    /* 48:2095 pool array    */ 22250000
    4 SMF94S2_VPS(16)  CHAR(112) BDY(WORD), /* 0:127   array entry   */ 22300000
     5 *                CHAR(1),   /* 0     reserved (set to '00'x)  */ 22350000
     5 SMF94S2_VPN     FIXED(8),   /* 1     pool number (starts at 1)*/ 22400000
     5 *                CHAR(2),   /* 2:3   reserved (set to '00'x)  */ 22450000
     5 SMF94S2_ALVIP    FIXED(32), /* 4:7   # of logical volumes on     22500000
                                            physical vols assigned to   22550000
                                            the pool.                */ 22600000
     5 SMF94S2_ADIVP    FIXED(32), /* 8:11  Mbytes of pool data      */ 22650000
     5 SMF94S2_DWTPLH   FIXED(32), /* 12:15 Mbytes written to pool in   22700000
                                            last hour.               */ 22750000
     5 SMF94S2_PDCI     FIXED(8),  /* 16    pool device class.       */ 22800000
     5 SMF94S2_MI0      FIXED(8),  /* 17    media 0 counts:          */ 22850000
     5 SMF94S2_PSSSVC0  FIXED(16), /* 18:19 static scratch stacked   */ 22900000
     5 SMF94S2_PSPSVC0  FIXED(16), /* 20:21 static private stacked   */ 22950000
     5 SMF94S2_PBSSVC0  FIXED(16), /* 22:23 borrowed scratch stacked */ 23000000
     5 SMF94S2_PBPSVC0  FIXED(16), /* 24:25 borrowed private stacked */ 23050000
     5 *                CHAR(1),   /* 26    reserved (set to '00'x)  */ 23100000
     5 SMF94S2_MI1      FIXED(8),  /* 27    media 1 counts:          */ 23150000
     5 SMF94S2_PSSSVC1  FIXED(16), /* 28:29 static scratch stacked   */ 23200000
     5 SMF94S2_PSPSVC1  FIXED(16), /* 30:31 static private stacked   */ 23250000
     5 SMF94S2_PBSSVC1  FIXED(16), /* 32:33 borrowed scratch stacked */ 23300000
     5 SMF94S2_PBPSVC1  FIXED(16), /* 34:35 borrowed private stacked */ 23350000
     5 *                CHAR(4),   /* 36:39 reserved (set to '00'x)  */ 23400000
     5 SMF94S2_AAORD    FIXED(16), /* 40:41 avg.age of residual data */ 23450000
     5 SMF94S2_MAORD    FIXED(16), /* 42:43 max age of residual data */ 23500000
     5 SMF94S2_AAOFPSV  FIXED(16), /* 44:45 avg.age of full private     23550000
                                            stacked volumes.         */ 23600000
     5 SMF94S2_MAOFPSV  FIXED(16), /* 46:47 max age of full private     23650000
                                            stacked volumes.         */ 23700000
     5 *                CHAR(1),   /* 48    reserved (set to '00'x)  */ 23750000
     5 SMF94S2_VPRTP    FIXED(8),  /* 49    pool reclaim threshold % */ 23800000
     5 SMF94S2_ADD      CHAR(40)   /* 50:89 Active Data Distribution */ 23850000
                        BDY(HWORD),/*                                */ 23900000
       7 SMF94S2_ADD00  FIXED(16), /* 50:51  0- 5% active data       */ 23950000
       7 SMF94S2_ADD05  FIXED(16), /* 52:53  5-10% active data       */ 24000000
       7 SMF94S2_ADD10  FIXED(16), /* 54:55 10-15% active data       */ 24050000
       7 SMF94S2_ADD15  FIXED(16), /* 56:57 15-20% active data       */ 24100000
       7 SMF94S2_ADD20  FIXED(16), /* 58:59 20-25% active data       */ 24150000
       7 SMF94S2_ADD25  FIXED(16), /* 60:61 25-30% active data       */ 24200000
       7 SMF94S2_ADD30  FIXED(16), /* 62:63 30-35% active data       */ 24250000
       7 SMF94S2_ADD35  FIXED(16), /* 64:65 35-40% active data       */ 24300000
       7 SMF94S2_ADD40  FIXED(16), /* 66:67 40-45% active data       */ 24350000
       7 SMF94S2_ADD45  FIXED(16), /* 68:69 45-50% active data       */ 24400000
       7 SMF94S2_ADD50  FIXED(16), /* 70:71 50-55% active data       */ 24450000
       7 SMF94S2_ADD55  FIXED(16), /* 72:73 55-60% active data       */ 24500000
       7 SMF94S2_ADD60  FIXED(16), /* 74:75 60-65% active data       */ 24550000
       7 SMF94S2_ADD65  FIXED(16), /* 76:77 65-70% active data       */ 24600000
       7 SMF94S2_ADD70  FIXED(16), /* 78:79 70-75% active data       */ 24650000
       7 SMF94S2_ADD75  FIXED(16), /* 80:81 75-80% active data       */ 24700000
       7 SMF94S2_ADD80  FIXED(16), /* 82:83 80-85% active data       */ 24750000
       7 SMF94S2_ADD85  FIXED(16), /* 84:85 85-90% active data       */ 24800000
       7 SMF94S2_ADD90  FIXED(16), /* 86:87 90-95% active data       */ 24850000
       7 SMF94S2_ADD95  FIXED(16), /* 88:89 95-100%active data       */ 24900000
     5 SMF94S2_PPP      FIXED(8),  /* 90    Physical pool properties */ 24950000
     5 *                CHAR(1),   /* 91    reserved('00'x)          */ 25000000
     5 SMF94S2_RPN      FIXED(8),  /* 92    Reclamation pool number  */ 25050000
     5 *                CHAR(1),   /* 93    reserved('00'X)      @52a*/ 25063600
     5 SMF94S2_RPDSLA   FIXED(16), /* 94:95 Reclaim policy, days since  25077200
                                            last accessed        @52a*/ 25090800
     5 SMF94S2_RPDSLW   FIXED(16), /* 96:98 Reclaim policy, days since  25104400
                                            last written.        @52a*/ 25118000
     5 SMF94S2_RPDSLDI  FIXED(16), /* 98:99 Reclaim policy, days since  25131600
                                            last data invalidate @52a*/ 25145200
     5 SMF94S2_RPMADP   FIXED(8),  /* 100   Reclaim policy, Minimum     25158800
                                            active data percent. @52a*/ 25172400
     5 *                CHAR(11);  /* 101:111 reserved('00'x)        */ 25186000
 /********************************************************************/ 25200000
 /* Definitions for media types found in SMF94S2_BPMI0,              */ 25250000
 /* SMF94S2_BPMI1, SMF94S2_BPMI2 and SMF94S2_BPMI3.                  */ 25300000
 /********************************************************************/ 25350000
 DCL                                                                    25400000
  SMF94S2_BPM00 BIT(8) CONSTANT('00'X), /* no media type configured  */ 25450000
  SMF94S2_BPM10 BIT(8) CONSTANT('10'X), /* 3590'J' media             */ 25500000
  SMF94S2_BPM11 BIT(8) CONSTANT('11'X), /* 3590'K' media             */ 25550000
  SMF94S2_BPM20 BIT(8) CONSTANT('20'X), /* 3592'JA' media        @52a*/ 25600000
  SMF94S2_BPM21 BIT(8) CONSTANT('21'X), /* reserved.             @52a*/ 25650000
  SMF94S2_BPM22 BIT(8) CONSTANT('22'X), /* 3592'JJ' media        @52a*/ 25700000
  SMF94S2_BPM23 BIT(8) CONSTANT('23'X); /* reserved.             @52a*/ 25750000
 /********************************************************************/ 25800000
 /* Definitions for the preferred I/O VTS which is reported in   @50a*/ 25850000
 /* SMF94CLPI0-SMF94CLPI7 and SMF94CLPM0-SMF94CLPM7              @50a*/ 25900003
 /********************************************************************/ 25950000
 DCL                                                                    26000000
  SMF94_%%PREF_VTS0 BIT(4) CONSTANT('1000'B),/*                         26050000
                                           VTS 0 is preferred    @50a*/ 26060000
  SMF94_%%PREF_VTS1 BIT(4) CONSTANT('1001'B),/*                         26100000
                                           VTS 1 is preferred    @50a*/ 26110000
  SMF94_%%PREF_NONE BIT(4) CONSTANT('1111'B);/* No Preference    @50a*/ 26150000
 /********************************************************************/ 26200000
 /* Definitions for the default copy mode which is reported in   @50a*/ 26250000
 /* SMF94CLDM0-SMF94CLDM7                                        @50a*/ 26300003
 /********************************************************************/ 26350000
 DCL                                                                    26400000
  SMF94_%%COPY_DEFER BIT(2) CONSTANT('00'B), /*                         26450000
                                           deferred copy mode    @50a*/ 26460000
  SMF94_%%COPY_IMMED BIT(2) CONSTANT('01'B); /*                         26500000
                                           immediate copy mode   @50a*/ 26510000
 /********************************************************************/ 26550000
 /* Definitions for controller operation mode which is reported  @50a*/ 26600000
 /* in SMF94CLCO0-SMF94CLCO7                                     @50a*/ 26650003
 /********************************************************************/ 26700000
 DCL                                                                    26750000
  SMF94_%%COM_NORM BIT(2) CONSTANT('00'B), /* normal mode        @50a*/ 26800000
  SMF94_%%COM_READ BIT(2) CONSTANT('01'B), /* read-only mode     @50a*/ 26850000
  SMF94_%%COM_RWD BIT(2) CONSTANT('10'B); /*                            26900000
                                         read/write disconnected @50a*/ 26910000
 /********************************************************************/ 26950000
 /* Definitions for relative link speeds which are reported in   @50a*/ 27000000
 /* SMF94CLLS0_AX0VTS0 - SMF94CLLS7_AX0VTS0 and in               @50a*/ 27050003
 /* SMF94CLLS0_AX0VTS1 - SMF94CLLS7_AX0VTS1                      @50a*/ 27100003
 /********************************************************************/ 27150000
 DCL                                                                    27200000
  SMF94_%%LS1 BIT(4) CONSTANT('0001'B), /*                              27250000
                                      ESCON < 5km, FICON < 30km  @50a*/ 27260000
  SMF94_%%LS2 BIT(4) CONSTANT('0010'B), /*                              27300000
                                      ESCON <10km, FICON < 80km  @50a*/ 27310000
  SMF94_%%LS3 BIT(4) CONSTANT('0011'B), /*                              27350000
                                      channel extender < 1000km, @50a   27360000
                                      ESCON over DWDM  < 10km,   @50a   27400000
                                      FICON < 100km              @50a*/ 27450000
  SMF94_%%LS4 BIT(4) CONSTANT('0100'B), /*                              27500000
                                      channel extender > 1000km, @50a   27510000
                                      ESCON over DWDM  < 15km    @50a*/ 27550000
  SMF94_%%LS5 BIT(4) CONSTANT('0101'B); /* ESCON over DWDM > 15km @50a*/27600000
