*                                                                       00010000
*        %GOTO SMCAL1;            /* Bilingual Mapping Macro            00020000
         MACRO                                                          00030000
         IEESMCA                                                        00040000
*                                                                       00050000
.*/      %SMCAL1: ;                                               /* */ 00060000
*/**** START OF SPECIFICATIONS ***************************************/ 00070000
*/*                                                                  */ 00080000
*/*    MACRO NAME = IEESMCA                                      @P6C*/ 00090000
*/*                                                                  */ 00100000
*/*     ACRONYM = SMCA                                               */ 00110000
*/*                                                                  */ 00120000
*/*    DESCRIPTIVE NAME = SMF CONTROL TABLE                          */ 00130000
*/*                                                                  */ 00140000
*/*01* PROPRIETARY STATEMENT=                                        */ 00150000
*/***PROPRIETARY_STATEMENT********************************************/ 00160000
*/*                                                                  */ 00170000
*/* LICENSED MATERIALS - PROPERTY OF IBM                             */ 00180000
*/* 5650-ZOS COPYRIGHT IBM CORP. 1979, 2021                          */ 00190000
*/*                                                                  */ 00200000
*/* STATUS= HBB77D0                                                  */ 00210000
*/*                                                                  */ 00220000
*/***END_OF_PROPRIETARY_STATEMENT*************************************/ 00230000
*/*                                                                  */ 00240000
*/*    FUNCTION = Communications area used to hold data needed       */ 00250000
*/*               by SMF or other MVS components                     */ 00260000
*/*                                                                  */ 00270000
*/*01* EXTERNAL CLASSIFICATION:                                  @P3A*/ 00280000
*/*02* NOTPI: BASE                                               @PCC*/ 00290000
*/*02* PI:   FIELDS                                              @PCC*/ 00300000
*/*          SMCASID                                             @P6A*/ 00310000
*/*          SMCAITME                                            @P6A*/ 00320000
*/*          SMCAIDTE                                            @P6A*/ 00330000
*/*01* END OF EXTERNAL CLASSIFICATION:                           @P3A*/ 00340000
*/*                                                                  */ 00350000
*/*    NOTES =                                                       */ 00360000
*/*                                                                  */ 00370000
*/*        Bilingual Mapping Macro (PL/AS and BAL)                   */ 00380000
*/*                                                                  */ 00390000
*/*      DEPENDENCIES =                                              */ 00400000
*/*                                                                  */ 00410000
*/*        PL/AS Version =                                           */ 00420000
*/*         %INCLUDE SYSLIB(CVT) TO DEFINE CVTSMCA                   */ 00430000
*/*                                                                  */ 00440000
*/*        BAL Version =                                             */ 00450000
*/*         A DSECT IS PRODUCED AND A USING ON SMCABASE GIVES        */ 00460000
*/*         ADDRESSABILITY FOR ALL SYMBOLS.                          */ 00470000
*/*                                                                  */ 00480000
*/*      RESTRICTIONS =                                              */ 00490000
*/*                                                                  */ 00500000
*/*        PL/AS Version = None                                      */ 00510000
*/*                                                                  */ 00520000
*/*        BAL Version = None                                        */ 00530000
*/*                                                                  */ 00540000
*/**** INVOCATION ****************************************************/ 00550000
*/*                                                                  */ 00560000
*/*    METHOD OF ACCESS =                                            */ 00570000
*/*                                                                  */ 00580000
*/*      PL/AS Invocation =                                          */ 00590000
*/*                                                                  */ 00600000
*/*  %INCLUDE SYSLIB(IEESMCA)                                        */ 00610000
*/*                                                                  */ 00620000
*/*    PARAMETER DESCRIPTION =  None                                 */ 00630000
*/*                                                                  */ 00640000
*/*    PARAMETER INTERDEPENDENCIES = None                            */ 00650000
*/*                                                                  */ 00660000
*/*------------------------------------------------------------------*/ 00670000
*/*                                                                  */ 00680000
*/*      BAL Invocation =                                            */ 00690000
*/*                                                                  */ 00700000
*/*      name            name: symbol. Begin name in column 1.       */ 00710000
*/*  b                   one or more blanks (up to nine)             */ 00720000
*/*  IEESMCA             should start in column 10                   */ 00730000
*/*  b                   one or more blanks                          */ 00740000
*/*                                                                  */ 00750000
*/*    PARAMETER DESCRIPTION =  None                                 */ 00760000
*/*                                                                  */ 00770000
*/*    PARAMETER INTERDEPENDENCIES = None                            */ 00780000
*/*                                                                  */ 00790000
*/********************************************************************/ 00800000
*/*                                                                  */ 00810000
*/*    DSECT NAME = SMCABASE                                         */ 00820000
*/*                                                                  */ 00830000
*/*    COMPONENT = System Management Facilities (SC100)          @P4C*/ 00840000
*/*                                                                  */ 00850000
*/*    EYE-CATCHER = "SMCA"                                          */ 00860000
*/*     OFFSET = 4 ('4' in hex)                                      */ 00870000
*/*     LENGTH = 4 bytes                                             */ 00880000
*/*                                                                  */ 00890000
*/*    CREATED BY = IFASTART                                         */ 00900000
*/*                                                                  */ 00910000
*/*    POINTED TO BY = CVTSMCA                                       */ 00920000
*/*                                                                  */ 00930000
*/*    DELETED BY = N/A                                              */ 00940000
*/*                                                                  */ 00950000
*/*    SERIALIZATION = None                                          */ 00960000
*/*                                                                  */ 00970000
*/*    STORAGE ATTRIBUTES =                                          */ 00980000
*/*                                                                  */ 00990000
*/*      ALLOCATION METHOD = GETMAIN                                 */ 01000000
*/*      SUBPOOL           = 245                                     */ 01010000
*/*      KEY               = 0                                       */ 01020000
*/*      RESIDENCY         = Below                                   */ 01030000
*/*      SIZE              = 504 bytes ('1F8' in hex)            @L6C*/ 01031000
*/*      FREQUENCY         = 1 per MVS system                        */ 01050000
*/*                                                                  */ 01060000
*/*    DISTRIBUTION LIBRARY = AMACLIB                                */ 01070000
*/*                                                                  */ 01080000
*/**** END OF SPECIFICATIONS *****************************************/ 01090000
*/*                                                                  */ 01100000
*/*  CHANGE ACTIVITY = ZA53006, ZA58293, @L1A, ZA84325, @Q4A,        */ 01110000
*/*                    @DH,     @DI,     @DJ,  @P1,     @DN          */ 01120000
*/*                    @02,     @0S,     @LP,  @LR                   */ 01130000
*/*                                                                  */ 01140000
*/*    $MAC(IEESMCA),COMP(SC100)                                     */ 01150000
*/*                                                                  */ 01160000
*/*  138000,210000,798000,936000                                20011*/ 01170000
*/*  144000-150000,552000-606000,630000-654000,696000-714000,   M0435*/ 01180000
*/*  732000,858000-876000                                       M0435*/ 01190000
*/*  (C) SMCAJWT - RE-DEFINE FIELD CONTENTS                  @ZA18120*/ 01200000
*/*                                                          @ZM50077*/ 01210000
*/*  (C) SMCASUBP- ADD LEADING ASTERISK                      @ZA52499*/ 01220000
*/*  A - BITS FOR SRB SCHEDULED AND SRB RUNNING              @ZA53006*/ 01230000
*/*  A - PTR TO FIRST SSB ON SMF LOCK QUEUE                  @ZA58293*/ 01240000
*/*  A - CREATED A NEW FIELD (SMCADSPO) IN THE COMMUNICATIONS@ZA84325*/ 01250000
*/*      SECTION TO INDICATE THAT A DISPLAY OPTIONS (D SMF,O)@ZA84325*/ 01260000
*/*      IS IN EFFECT.                                       @ZA84325*/ 01270000
*/*  C - DEV APAR OY19862 INCLUDED IN JBB3313                @YA19862*/ 01280000
*/*  A - PROLOG ENHANCEMENT                                      @LPA*/ 01290000
*/*  A - ADD NEW FIELD (SMCASMCX), POINTER TO NEW SMCX CONTROL   @LPA*/ 01300000
*/*      BLOCK, FOR SMF INTERVAL SYNC SUPPORT                    @LPA*/ 01310000
*/*  A - ADD NEW FIELD (SMCAJAC1), TO POINT TO NEW IFAJAC01 RTN  @LRA*/ 01320000
*/*  A - ADD POINTER TO DEFERRED SCHEDULING ROUTINE IN IEEMB839  @LTA*/ 01330000
*/*  C - Changed SMCAMNBF and SMCAMXBF to RESERVED fields        @P2A*/ 01340000
*/*  D - Remove ECBs related to failures in U83/84/85 exits      @LVA*/ 01350000
*/*  D - Remove AMODE bits related to U83/84/85 exits            @LVA*/ 01360000
*/*  A - Add SID 'Source' Bits                                   @LWA*/ 01370000
*/*  A - Add Data Set Name Migration Indicator bit               @LXA*/ 01380000
*/*  A - Add CDPI information to prolog                          @P3A*/ 01390000
*/*  D - Remove unused field names                               @P3A*/ 01400000
*/*  A - Define new fields for Usage Data Collection Service     @01A*/ 01410000
*/*  A - Define new fields for Usage Data Reporting              @03A*/ 01420000
*/*  C - Component name before id                                @P4A*/ 01430000
*/*  C - Change SMCAIDTE comment to format 0CYYDDDF              @P5A*/ 01440000
*/*  C - Define SMCA fields as GUPI                              @P6A*/ 01450000
*/*  A - Add SMCAT892                                            @MXA*/ 01460000
*/*  C - Define SMCAFLGS as abnormal to ensure serialization.    @04A*/ 01470000
*/*  C - Define new fields for SMF initialization serialization. @05A*/ 01480000
*/*  C - Defined SMCAALCN to hold the alternate console ID for   @06A*/ 01490000
*/*      the I SMF command.                                      @06A*/ 01500000
*/*  A - Add DOM IDs for IEE994E messages.                       @P7A*/ 01510000
*/*  C - Changed the macro size documented in the prologue       @P8A*/ 01520000
*/*      from 404 decimal bytes to 480 decimal bytes.            @P8A*/ 01530000
*/*  A - Defined SMCAUISL to hold the interval start time for    @07A*/ 01540000
*/*      type 89 records. Changed the descriptions for SMCAUIT   @07A*/ 01550000
*/*      and SMCAUITL to indicate that these fields hold the     @07A*/ 01560000
*/*      interval end time.                                      @07A*/ 01570000
*/*  A - Define SMCAD068 msgIEE068A DOM ID.                      @09A*/ 01580000
*/*  C - Make the PL/X version of SMCABFLS unsigned              @0AA*/ 01590000
*/*  A - VASLUPS support                                         @L2A*/ 01600000
*/*  C - Removed VASLUPS code                                    @P9A*/ 01610000
*/*  A - Defined SMCA838M. This field is now used to hold the    @0BA*/ 01620000
*/*      address of IEEMB838 instead of SMCX838M.                @0BA*/ 01630000
*/*  C - Change SMCAMACR from Fixed(31) to Ptr(31)               @PAA*/ 01640000
*/*  D - Delete SMCAPFBA, SMCAPFEA, SMCAECBA, SMCALL, SMCALATE   @PBA*/ 01650000
*/*  C - ReadOnly for SMCASMCX                                   @PBA*/ 01660000
*/*  A - Defined SMCASTLS to indicate to IFALSMOD that it was    @0CA*/ 01670000
*/*      called as a result of a SET SMF=xx or SMF start up.     @0CA*/ 01680000
*/*      Some comments on existing fields were also corrected.   @0CA*/ 01690000
*/*  A - Change SMCALL to SMCAFLD                                @L3A*/ 01700000
*/*  A - Add Alias for SMCAD979                                  @L4A*/ 01710000
*/*  A - Add fields for Container Support                        @0DA*/ 01720000
*/*  A - Defined SMCAATSS and SMCANTSS for indicating if         @PCA*/ 01730000
*/*      AUTHSETSMF or NOAUTSETSMF was specified.                @PCA*/ 01740000
*/*  A - Defined SMCASSTX.                                       @PDA*/ 01750000
*/*  A - Defined SMCACNIS, SMCACART, and SMCAECBS for I SMF      @0FA*/ 01760000
*/*      response message routing for IEE362A, IEE352I, and      @0FA*/ 01770000
*/*      IEE391A. Note: SMCACNIS is in a different location      @0FA*/ 01780000
*/*      between HBB77A0 and HBB77B0 (moved at roll up).         @0FA*/ 01790000
*/*      Also rolled up the minor change made with OA49263.      @0FA*/ 01800000
*/*  C - Moved SMCACART above SMCASSTX so it is consistent with  @PEA*/ 01810000
*/*      its placement on lower releases. Also changed it to     @PEA*/ 01820000
*/*      CL8 in the Assembler.                                   @PEA*/ 01830000
*/*  C - Restored the position of SMCACART since I would need to @PFA*/ 01840000
*/*      recompile some parts to accomodate the move.            @PFA*/ 01850000
*/*  C - IFA-> zCBP , SUP -> zIIP commentary corrections.        @L5A*/ 01851000
*/*  A - Defined fields to support new AMODE 64 EP for IFAUSAGE  @L6A*/ 01861000
*/*    - Added/corrected assembler fields for consistency        @L6A*/ 01862000
*/*    - Corrected SIZE comment in prolog but size didn't change @L6A*/ 01863000
*/*                                                                  */ 01870000
*/*  $L1=RAPRAS  ,JBB2110,820604,PD27: RESTARTABLE SMF           @L1A*/ 01880000
*/*  $Q4=PAE0249 ,JBB2133,840320,PDFS: ADD DSET INIT COMPLETE BIT@Q4A*/ 01890000
*/*  $DH=DCR22   ,JBB3313,881104,PDBR: BUFFER AND I/O CHANGES    @DHA*/ 01900000
*/*  $DI=DCR26   ,JBB3313,881216,PDBR: DATA LOST CHANGES         @DIA*/ 01910000
*/*  $DJ=DCR30   ,JBB3313,881216,PDJB: SMFEWTM CROSS MEMORY      @DJA*/ 01920000
*/*  $P1=PGP0464 ,JBB3313,890616,PDBR: SMCABQXX BDY ERRORS       @P1A*/ 01930000
*/*  $02=OY25606 ,JBB3313,890915,PDLO: DD CONSOLIDATION          @02A*/ 01940000
*/*  $DN=DCR0085 ,HBB4420,900224,PDBR: APPC TRANS ACCTING SUPPORT@DNA*/ 01950000
*/*  $0S=OY40499 ,HBB4420,910305,PDDH: NEW DUMP OPTION TO SUPPRESS   */ 01960000
*/*                                    RETRY AFTER ABEND         @0SA*/ 01970000
*/*  $LP=SYNCS   ,HBB4430,910814,PDDH: SMF INTERVAL SYNC SUPPORT @LPA*/ 01980000
*/*  $LR=APPCS   ,HBB4430,911209,PDMF: APPC CONVERSATION ACCOUNTING  */ 01990000
*/*                                                              @LRA*/ 02000000
*/*  $LT=SYNCS   ,HBB4430,911209,PDBR: DEFER INTERVAL SCHED      @LTA*/ 02010000
*/*  $P2=PKB3617 ,HBB4430,920805,PDDH: 10X: Obsolete Option          */ 02020000
*/*                                    Processing                @P2A*/ 02030000
*/*  $LV=PE2STSMF,HBB5510,921217,PDXB: Dynamic exits support     @LVA*/ 02040000
*/*  $LV=SMFSID  ,HBB5510,930304,PDBR: SID Option Enhancements   @LWA*/ 02050000
*/*  $LX=SMFDSN  ,HBB5510,930415,PDSL: DSNAME Option Enhancement @LXA*/ 02060000
*/*  $P3=PIG2206 ,HBB5510,930720,PDDH: CDPI: SHOWHDR Cleanup     @P3A*/ 02070000
*/*  $01=OW02855 ,JBB3313,931115,PDBR: Usage Data Collection     @01A*/ 02080000
*/*  $03=OW02855 ,JBB3313,940110,PDBR: Usage Data Collection - 2 @03A*/ 02090000
*/*  $P4=PN71767 ,HBB5520,941020,PDDH: CDPI: SHOWHDR Cleanup     @P4A*/ 02100000
*/*  $P5=PQC0051 ,HBB6603,950601,PDDH: SMCAIDTE comment wrong    @P5A*/ 02110000
*/*  $P6=PQC0186 ,HBB6603,950601,PDDH: CDPI: GUPI fields         @P6A*/ 02120000
*/*  $MX=PRDEDSMF,HBB6601,950601,PDXB: Product enable/disable    @MXA*/ 02130000
*/*  $04=OW25609 ,HBB4430,970430,PDHB: Serialize SMCAFLGS bits.  @04A*/ 02140000
*/*  $05=OW33380 ,HBB6603,980724,PDDH: ABEND052 on SMF Restart   @05A*/ 02150000
*/*  $06=OA07734 ,HBB7709,040720 PDOO: Console ID for IEEMB824   @06A*/ 02160000
*/*  $P7=PDE0133 ,HBB7720,040227,PDTA: SMF record damaged by userexit*/ 02170000
*/*                                    FIN of OA05135            @P7A*/ 02180000
*/*  $P8=ME01951 ,HBB7720,041022,PDOO: Wrong macro size in           */ 02190000
*/*                                    prologue                  @P8A*/ 02200000
*/*  $07=OA15360 ,HBB7707,060222,PDOO: SMF89IES=SMF89IET on      @07A*/ 02210000
*/*                                    subtype2 records.         @07A*/ 02220000
*/*  $09=OA17663 ,HBB7709,060930,PDOO: Multiple interval records @09A*/ 02230000
*/*                                    after abend553            @09A*/ 02240000
*/*  $0A=OA19453 ,HBB7709,070205,PDOO: SMF7NRO too small for     @0AA*/ 02250000
*/*                                    SMCABFLS                  @0AA*/ 02260000
*/*  $L2=VASLUPS  HBB7750 070720 PDOO: VASLUPS support           @L2A*/ 02270000
*/*                                    (Feature ME10868)         @L2A*/ 02280000
*/*  $P9=ME11718  HBB7750 071110 PDOO: Remove VASLUPS support    @P9A*/ 02290000
*/*  $0B=OA22791  HBB7740 071130 PDOO: ABEND 0C1 during restart  @0BA*/ 02300000
*/*  $PA=ME13887  HBB7760 080627 PDH6: Make SMCAMACR  Ptr(31)    @PAA*/ 02310000
*/*  $PB=ME14342  HBB7760 080822 PDH6: STQE processing cleanup   @PBA*/ 02320000
*/*  $0C=OA26559  HBB7740 081110 PDOO: IFA707I-04/407            @0CA*/ 02330000
*/*  $L3=SMFFLD   HBB7770 090430 PDAS: SMF Flood Automation      @L3A*/ 02340000
*/*  $L4=SMFFLD   HBB7770 090530 PDAS: SMF Flood Automation      @L4A*/ 02350000
*/*  $0D=OA31615  HBB7750 101201 PDAS: Container Support         @0DA*/ 02360000
*/*  $PC=ME23066  HBB7790 111129 PDOO: Authorize SETSMF          @PCA*/ 02370000
*/*      ME28073  HBB77A0 140909 PDOO: SHOWHDR issues                */ 02380000
*/*  $PD=W106657  HBB77B0 160216 PDOO: Incompatible SST change   @PDA*/ 02390000
*/*  $0F=OA51244  HBB7790 161116 PDOO: IEE362A/IEE352I/IEE391A       */ 02400000
*/*                                    routed incorrecly         @0FA*/ 02410000
*/*  $PE=W157286  HBB77B0 170206 PDOO: SMCACART causing Assembler    */ 02420000
*/*                                    errors                    @PEA*/ 02430000
*/*  $PF=W157298  HBB77B0 170206 PDOO: Put SMCACART back to prio     */ 02440000
*/*                                    prior W157286             @PFA*/ 02450000
*/*  $L5=zCBP     HBB77C0 171103 PDNJ: zCBP                          */ 02451000
*/*  $L6=USAGEENH HBB77C0 180630 PDHV: IFAUSAGE Enhancements     @L6A*/ 02461000
*/*     =W385484  HBB77D0 200901 PDTA: Create C header (metadata-    */ 02462000
*/*                                    only change)                  */ 02470000
*/*                                                                  */ 02471000
*/********************************************************************/ 02480000
*/*                                                                  */ 02490000
*        %GOTO SMCAL2;                                            /* *  02500000
*                                                                       02510000
*   BAL mapping definitions...                                          02520000
*                                                                       02530000
         SPACE 1                                                        02540000
SMCABASE DSECT                                                          02550000
         SPACE 1                                                        02560000
         IEZBITS , -          SYMBOLIC BIT DEFINITIONS                  02570000
         SPACE 1                                                        02580000
SMCAOPT  DS    B -            SMFDEFLT OPTIONS SELECTED AT              02590000
*                             INITIALIZATION TIME.  THE OPTIONS APPLY   02600000
*                             TO BACKGROUND PROCESSING.  SMCAFOPT       02610000
*                             (OFFSET 82) CONTAINS THE FOREGROUND       02620000
*                             OPTIONS.                                  02630000
SMCAOPT1 EQU   BIT0 -         Job accounting                       @0CC 02640000
SMCAOPT2 EQU   BIT1 -         Step accounting                      @0CC 02650000
SMCAEXT  EQU   BIT2 -         Exits will be taken                  @0CC 02660000
SMCADSA  EQU   BIT3 -         DATA SET ACCOUNTING                       02670000
SMCAVOL  EQU   BIT4 -         VOLUME ACCOUNTING                         02680000
SMCAUDCS EQU   BIT5           Usage Data Collection Services       @01A 02690000
SMCARS01 EQU   BIT5,,C'X' -   RESERVED                                  02700000
SMCATDS  EQU   BIT6 -         TYPE 17 RECORDS MAINTAINED FOR TEMPORARY  02710000
*                             DATA SETS (REC(PERM) OR REC(CALL))        02720000
SMCAFGND EQU   BIT7 -         SMF FOREGROUND OPTIONS BIT.  IF 0, ABOVE  02730000
*                             BITS DESCRIBE BACKGROUND OPTIONS.  IF 1,  02740000
*                             ABOVE BITS DESCRIBE FOREGROUND OPTIONS.   02750000
*                                                                 20011 02760000
SMCAMISC DS    B -            MISCELLANEOUS INDICATORS                  02770000
SMCAUSER EQU   BIT0 -         SMF RECORDING REQUESTED                   02780000
SMCAMAN  EQU   BIT1 -         SYS1.MAN DATA SET IS/IS NOT PRESENT.      02790000
*                             BITS 0 AND 1 MEAN:                        02800000
*                             00 = NO SMF RECORDING REQUESTED           02810000
*                                  (MAN=NONE),                          02820000
*                             01 = ONLY USER RECORDS TO BE RECORDED     02830000
*                                  (MAN=USER),                          02840000
*                             10 = INVALID COMBINATION,                 02850000
*                             11 = SMF AND USER RECORDING REQUESTED     02860000
*                                  (MAN=ALL)                            02870000
SMCADSIC EQU   BIT2           DATA SET INIT COMPLETE BY IEEMB829   @Q4C 02880000
*                                  (1 = INIT COMPLETE)             @Q4C 02890000
SMCAFIRT EQU   BIT3 -         SMF DATA SET TO BE OPENED                 02900000
SMCAPSDP EQU   BIT4 -         PSEUDO-DUMP SWITCH                        02910000
*                             (DEVICE SWITCHING ONLY)                   02920000
SMCADBSY EQU   BIT5 -         DUMP IS BUSY (SMF WRITER)                 02930000
SMCABSW  EQU   BIT6 -         BUFFER SWITCH.  IF 0, LEFT HALF OF BUFFER 02940000
*                             IN USE.  IF 1, RIGHT HALF OF BUFFER IN    02950000
*                             USE.                                      02960000
SMCADUMP EQU   BIT7 -         DUMP BUSY                                 02970000
SMCATOFF DS    H -            OFFSET OF THE FIRST SMF TIOT ENTRY FROM   02980000
*                             THE BEGINNING OF THE MASTER SCHEDULER     02990000
*                             TIOT                                      03000000
SMCASMCA DS    CL4            CONTROL BLOCK ID                          03010000
*                                                                       03020000
* THE FOLLOWING FIELDS ARE SET UP BY IPL INITIALIZATION                 03030000
*                                                                       03040000
SMCAJWT  DS    F -            JOB WAIT TIME LIMIT - BIT 31     @ZA18120 03050000
*                             REPRESENTS 1.048576 SECONDS      @ZA18120 03060000
SMCAS842 DS    A -            ADDRESS OF IEEMB842              @G743PJK 03070000
SMCASID  DS    CL4 -          SYSTEM IDENTIFICATION (SID)        MDC002 03080000
*                             - INTENDED FOR REFERENCE ONLY        @P6A 03090000
SMCABUFP DS    A -            ADDRESS OF THE SMF BUFFER                 03100000
SMCAMTD  DS    CL8            MAXDORM TIME AND DATE            @G743PJW 03110000
SMCAOPTB DS    A -            ADDRESS OF SMFOPTAB              @G743PJK 03120000
SMCADFLT DS    A -            ADDRESS OF SMFDELFT              @G743PJK 03130000
SMCAARCT DS    F -            # OF RECORDS AT LAST ABEND       @G743PBB 03140000
SMCAABCT DS    F -            # OF BUFFERS AT LAST ABEND       @G743PBB 03150000
SMCASRCT DS    F -            # OF RECORDS AT LAST STATUS      @G743PJW 03160000
SMCASBCT DS    F -            # OF BUFFERS AT LAST STATUS      @G743PJW 03170000
SMCASSTX DS    A -            Pointer to SST_ExtType_Table         @PDC 03180000
SMCACART DS    CL8 -          CART for IEE362A, IEE352I, IEE391A        03190000
*                             for I SMF only                       @PFC 03200000
SMCABR14 DS    H -            SMF RMTR (BR 14)                 @G743PBB 03210000
SMCAASID DS    H -            ASID OF SMF ADDRESS SPACE            @L1C 03220000
*                                                                       03230000
* MISCELLANEOUS POINTERS AND COMMUNICATION AREAS                        03240000
*                                                                       03250000
SMCAWAIT DS    2F -           THE ACCUMULATED WAIT TIME, EXPRESSED IN   03260000
*                             26 USEC TIMER UNITS.  FIRST WORD IS       03270000
*                             OVERFLOW FROM SECOND WORD.                03280000
SMCAENTY DS    0CL2 -         THESE SWITCHES GOVERN ENTRY CONDITIONS    03290000
*                             FOR DEVICE SWITCHING/ALLOCATION/          03300000
*                             OPENING ROUTINES                          03310000
SMCAENDI DS    B -            A COMMUNICATION FIELD                     03320000
SMCARS14 EQU   BIT0,,C'X' -   RESERVED                                  03330000
SMCARS15 EQU   BIT1,,C'X' -   RESERVED                                  03340000
SMCARS16 EQU   BIT2,,C'X' -   RESERVED                                  03350000
SMCARS17 EQU   BIT3,,C'X' -   RESERVED                                  03360000
SMCARS18 EQU   BIT4,,C'X' -   RESERVED                                  03370000
SMCARS19 EQU   BIT5,,C'X' -   RESERVED                                  03380000
SMCADSPO EQU   BIT6 -         DISPLAY OPTIONS (D SMF,O) IS IN EFFECT    03390000
*                                                              @ZA84325 03400000
SMCADSNF EQU   BIT7 -         IF ZERO, DATA SET (X OR Y) WAS FOUND.     03410000
*                             IF ONE, DATA SET (X OR Y) WAS NOT FOUND.  03420000
SMCAENOP DS    C -            ENTRY CODE THAT INDICATES WHICH LOAD OF   03430000
*                             SVC 83 HAS PASSED CONTROL TO CURRENT LOAD 03440000
SMCAFOPT DS    B -            SMF FOREGROUND OPTIONS.                   03450000
*                             BIT SETTINGS ARE SAME AS SMCAOPT.   20011 03460000
SMCABITS DS    X -            BIT INDICATORS                       @0SC 03470000
SMCADAR  EQU   X'80' -        DUMPABND OPTION INDICATOR            @0SA 03480000
SMCADSNM EQU   X'40' -        Data Set Name Migration Indicator    @LXA 03490000
SMCAWRTP DS    F -            AN OPTIMUM BUFFER LOAD DISPLACEMENT       03500000
*                             FIGURE.  WHEN THE BUFFER IS LOADED TO OR  03510000
*                             BEYOND THIS POINT, IT WILL BE WRITTEN TO  03520000
*                             THE SMF DATA SET.                         03530000
SMCAOARY DS    F -            POINTER TO OLD RDS ARRAY         @G743PBB 03540000
SMCANARY DS    F -            POINTER TO NEW RDS ARRAY         @G743PBB 03550000
SMCASUBP DS    F -            POINTER TO SUBPARM CHAIN         @G383P26 03560000
SMCABFMF DS    F -            MAXIMUM NUMBER OF FULL BUFFERS   @G743PBB 03570000
*                                                                 1@P3D 03580000
SMCAPCNO DS    F -            PC NUMBER FOR SMFWTM                 @L1C 03590000
SMCADSTM DS    CL8 -          START TIME AND DATE AT WHICH NO DATA SET  03600000
*                             WAS AVAILABLE TO RECORD ON.  APPEARS IN   03610000
*                             PACKED DECIMAL IN THE FORM 00YYDDDF       03620000
*                             WHERE 00 = ZEROS, YY = LAST 2 DIGITS OF   03630000
*                             THE YEAR, DDD = DAY OF THE YEAR AND F IS  03640000
*                             A SIGN.                                   03650000
SMCADSCT DS    F -            THE NUMBER OF SMF RECORDS THAT HAVE BEEN  03660000
*                             OMITTED FROM THE SMF DATA SET DUE TO THE  03670000
*                             UNAVAILABILITY OF A DATA SET TO RECORD ON 03680000
SMCAASCB DS    A -            ASCB OF SMF ADDRESS SPACE            @L1C 03690000
*                                                                       03700000
*          Although not an intended interface, some ISV products        03710000
*         modify SMCAMACR to contain the address of their intercept     03720000
*         routine.                                                      03730000
*                                                                       03740000
SMCAMACR DS    F -            ENTRY POINT TO MACRO RTN         @G742PJK 03750000
SMCASAVE DS    A -            USER EXIT ADDRESS SAVE FIELD (OS/VS2)     03760000
*                             (MDC300)                         @ZA02385 03770000
SMCATEXP DS   0F -            TIME OF MOST RECENT EXPIRATION OF A       03771000
*                             TEN-MINUTE TIMER QUEUE ELEMENT (TQE)      03790000
*                                                                  @L6C 03800000
SMCAECB7 DS    F              ECB FOR SET SMF TO POST                   03801000
*                             WHEN COMPLETE                        @L6A 03802000
SMCASTKN DS    CL8 -          SMF Address Space Token              @05C 03810000
*                                                                 1@05D 03820000
SMCASJWT DS    CL4 -          SAVE JWT AS ENTERED (HHMM)       @G742PJK 03830000
SMCASMDM DS    CL4 -          SAVE MAXDORM AS ENTERED (MMSS)   @G742PJK 03840000
SMCASSTS DS    CL6 -          SAVE STATUS AS ENTERED (HHMMSS)  @G742PJK 03850000
SMCAPARM DS    CL2 -          PARMLIB SUFFIX FOR RESTART                03860000
*                                                                 1@P3D 03870000
SMCASLCA DS    A -            ADDRESS OF SLCA                      @L1A 03880000
SMCAPGM  DS    F -            NUMBER OF PAGES MIGRATED           ICB310 03890000
SMCAU83  DS   0A -            ADDRESS OF SMF OUTPUT EXIT (IEFU83)       03891000
*                             TAKEN WHEN RECORDS ARE TO BE WRITTEN TO   03910000
*                             AN SMF DATA SET                    ICB407 03920000
SMCALOCK DS    A              POINTER TO FIRST SSB ON SMF LOCK QUEUE    03921000
*                             Added for consistency with PL/x      @L6A 03922000
SMCAWTCB DS    A -            ADDRESS OF SMF WRITER'S TCB - USED BY     03930000
*                             XMPOST ERROR PROCESSOR (IEEMB827)         03940000
*                             (OS/VS2)                           MDC006 03950000
*                                                                 1@P3D 03960000
SMCATSK2 DS    A -            ADDRESS OF IFASMF TASK                    03970000
SMCAACTP DS    A -            ADDRESS OF THE ACT (USED BY PARSE AND     03980000
*                             INPUT MERGE AND LIST OPTIONS)    @G741PLS 03990000
*                                                                       04000000
* THE NEXT TWO FIELDS ARE THE SUBJECT OF COMPARE DOUBLE AND             04010000
* SWAP LOGIC THAT CONTROLS THE SCHEDULING OF THE SRB. THEY              04020000
* MUST BE ON A DOUBLE WORD BOUNDARY.  DO NOT MOVE.             @G742PJK 04030000
*                                                                       04040000
SMCACDS  DS    0D -           TARGET OF CDS TO CONTROL SRB SCHEDULE     04050000
SMCANMFL DS    F -            NUMBER OF FULL BUFFERS           @G742PJK 04060000
SMCASSB  DS    A -            POINTER TO SMF SUSPEND BLOCK     @ZM50077 04070000
SMCACNIS DS    F -            Console ID for IEE362A, IEE352I, IEE391A  04080000
*                             for I SMF only                       @0FC 04090000
SMCASTTT DS    A -            ADDRESS OF STATUS TIMER ELEMENT  @G742PJK 04100000
SMCAMAXT DS    A -            ADDRESS OF MAXDORM TIMER ELEMENT @G742PJK 04110000
SMCADTB  DS    A -            ADDRESS OF DUMP TIMER ELEMENT    @G742PJK 04120000
SMCABITF DS    0F -           FULL WORD OF BIT FLAGS           @G743PJK 04130000
SMCAPRMT DS    XL1 -          REPLACES OPI BIT                 @G741PLS 04140000
SMCAIPLR EQU   X'80' -        PROMPT(IPLR) OR PROMPT(ALL)      @G741PLS 04150000
SMCALIST EQU   X'40' -        PROMPT(LIST) OR PROMPT(ALL)      @G741PLS 04160000
SMCALDSN EQU   X'20' -        DISPLAY DATASET STATUS           @G741PLS 04170000
SMCAMXDM EQU   X'10' -        MAXDORM SPECIFIED?               @G742PJK 04180000
SMCASTUS EQU   X'08' -        STATUS SPECIFIED?                @G742PJK 04190000
SMCARUN  EQU   X'04' -        WRITER SRB RUNNING               @ZA53006 04200000
SMCASKD  EQU   X'02' -        WRITER SRB HAS BEEN SCHEDULED    @ZA53006 04210000
SMCACONS EQU   X'01' -        DD CONSOLIDATION                     @02A 04220000
SMCAFLGS DS    XL1 -          WRITER STATUS FLAGS              @G741PLS 04230000
SMCAINIT EQU   X'80' -        WRITER TASK INITIALIZED          @G741PLS 04240000
SMCARSTR EQU   X'40' -        RESTART IN PROGRESS                  @L1C 04250000
SMCADTLS EQU   X'20' -        DATA LOST - NO SPACE ON DATA SETS    @L1C 04260000
SMCASETP EQU   X'10' -        SET SMF IN PROCESS               @G741PLS 04270000
SMCADISP EQU   X'08' -        DISPLAY SMF FOR OPTIONS OR DATASETS       04280000
*                             IS IN PROCESS.                   @ZA84325 04290000
SMCAFLD  EQU   X'04' -        SMF Flood Automation is active       @L3C 04300000
*        EQU   X'02' -        Reserved - was SMCALATE              @PBC 04310000
SMCASETS EQU   X'01' -        SETSMF IN PROCESS                @G383P26 04320000
SMCAFLGR DS    XL1 -          RECOVERY FOOTPRINTS              @G743PBB 04330000
SMCATERM EQU   X'80' -        SMF TERMINATED                   @G743PBB 04340000
SMCAPGFX EQU   X'40' -        PAGEFIX ISSUED                   @G743PBB 04350000
SMCASRBF EQU   X'20' -        WRITER SRB ABENDED AND ISSUED SDUMP       04360000
*                                                              @G743PBB 04370000
SMCAPSUS EQU   X'10' -        PREVENT SUSPEND PROCESSING WHILE HANDLING 04380000
*                             I/O ERROR                        @G743PBB 04390000
SMCAPCDT EQU   X'10' -        IFAPCWTR HAS TAKEN DUMP              @L1A 04400000
SMCAU29  EQU   X'08' -        IEFU29 EXIT CALLED               @G743PBB 04410000
SMCANOST EQU   X'04' -        NO MORE SETS ALLOWED             @G743PBB 04420000
SMCAPREV EQU   X'02' -        PREVIOUS ABEND IN EASI INTERVAL  @G384P27 04430000
SMCANMRE EQU   X'01' -        NO MORE EASI INTERVAL PROC       @G384P27 04440000
SMCARCUR DS    XL1 -          Recovery recursion & misc bits       @0CC 04450000
SMCAMXDR EQU   X'80' -        PREVENT MAXDORM RECURSION        @G743PBB 04460000
SMCASTTR EQU   X'40' -        PREVENT STATUS RECURSION         @G743PBB 04470000
SMCASUSR EQU   X'20' -        PREVENT SUSPEND RECURSION        @G743PBB 04480000
SMCATIMR EQU   X'10' -        PREVENT TIMER RECURSON           @G743PBB 04490000
SMCASETR EQU   X'08' -        PREVENT SET RECURSION            @G743PBB 04500000
SMCASETC EQU   X'04'          FOOTPRINTS FOR SET RECOVERY      @G743PJK 04510000
SMCASTLS EQU   X'02'          Indicate to IFALSMOD that SET SMF         04520000
*                             or SMF start up is in progress       @0CC 04530000
*        EQU   X'01'          Reserved                             @LVC 04540000
SMCAECB0 DS    F -            DISPLAY SMF ECB                      @L1C 04550000
SMCASRB  DS    A -            ADDRESS OF SMF SRB                   @L1C 04560000
SMCAECB1 DS    F -            SET SMF ECB                          @L1A 04570000
SMCAECB2 DS    F -            DUMP CHECK ECB                       @L1A 04580000
SMCAECB3 DS    F -            SETSMF ECB                           @L1A 04590000
SMCAALCN DS    F -            Alternate console ID for SWITCH SMF  @06C 04600000
SMCAXMCA DS    F -            ADDR OF CROSS MEM COMMUNICATION AREA @L1C 04610000
*                                                                       04620000
*       CONTROL AREA FOR RDS CHAIN - RECORDING DATASET BLOCKS  @G741PLS 04630000
*                                                                       04640000
SMCARDSH DS    CL4 -          RDSH - CHAIN HEADER ID           @G741PLS 04650000
SMCAFRDS DS    A -            FIRST RDS                        @G741PLS 04660000
SMCALRDS DS    A -            LAST RDS                         @G741PLS 04670000
SMCASVCR DS    A -            CURRENT RDS FOR SVC 83 (IEEMB830)    @L1C 04680000
SMCASRBR DS    A -            CURRENT RDS FOR SRB (IEEMB834)       @L1C 04690000
*                                                                       04700000
*       MISCELLANEOUS DATA AREAS                                   @L1C 04710000
*                                                                       04720000
SMCA994E DS    3F -           DOM ID of IEE994E messages.  Array        04730000
*                             entries correspond to DOM IDs for IEFU83, 04740000
*                             IEFU84, IEFU85 versions of message        04750000
*                             respectively.                             04760000
*                             Serialization is CS logic.           @P5C 04770000
SMCAECBI DS    F  -           ADDRESS OF ECB FOR SMF INIT          @L1A 04780000
*                                                                 1@P3D 04790000
SMCADMID DS    F  -           DOM ID OF SMF TERMINATED MSG         @L1C 04800000
SMCAD068 DS    F  -           DOM ID OF IEE068A (sync disabled)    @09C 04810000
*                                                                 1@P3D 04820000
SMCAD978 DS    0F -           DOM ID OF IEE978E MSG                @DIC 04830000
SMCAD986 DS    F  -           DOM ID OF IEE986E MSG                @DIA 04840000
SMCABFLS DS    F  -           NUMBER OF RCDS LOST DUE TO BUFFER         04850000
*                             SHORTAGE                         @G742PJK 04860000
*                                                                 1@P3D 04870000
*       Double define SMCAD786 and SMCAD979 so that if we switch        04880000
*       from dataset to logstream recording and there was a temp        04890000
*       area full condition the message will get dommed.           @L4A 04900000
SMCAD786 DS   0F  -           DOM ID OF IFA786W MSG                @L4A 04910000
SMCAD979 DS    F  -           DOM ID OF IEE979W MSG                @L1A 04920000
SMCABFWT DS    F  -           BUFFERS WRITTEN                  @G742PJK 04930000
SMCARCWT DS    F  -           RECORDS WRITTEN                  @G742PJK 04940000
*                                                                       04950000
*       VARIABLES FOR SMF TIMER MODULE - IEEMB839              @G742PJK 04960000
*                                                                       04970000
SMCATQE  DS    A -            ADDRESS OF TQE                   @G742PJK 04980000
SMCAENQE DS    A -            ADDRESS OF ENQUE ENTRY POINT     @G742PJK 04990000
SMCADEQE DS    A -            ADDRESS OF DEQUE ENTRY POINT     @G742PJK 05000000
SMCANSRB DS    A -            ADDRESS OF NEXT ELEMENT ON CHAIN @G742PJK 05010000
SMCAENDT DS    CL8 -          Time when DIE invoked                @PBC 05020000
*                                                                       05030000
*       SELECTIVITY CONTROL AREA                               @G741PLS 05040000
*                                                                       05050000
SMCASSTP DS    A -            ADDRESS OF SMF SELECTIVITY       @G741PJK 05060000
*                             TABLES                           @G741PJK 05070000
SMCASYSP DS    A -            ADDR OF THE SYSTEM (DEFAULT) SST @G741PJK 05080000
SMCAITME DS    CL4 -          IPL TIME (BINARY) IN HUNDREDTHS OF A @P6A 05090000
*                             SECOND - INTENDED FOR REFERENCE ONLY @P6A 05100000
SMCAIDTE DS    CL4 -          IPL DATE (0CYYDDDF)                  @P5C 05110000
*                             - INTENDED FOR REFERENCE ONLY        @P6A 05120000
SMCASACT DS    A -            ADDRESS OF THE NEW ACT FOR SET   @G743PJK 05130000
SMCANSST DS    H -            NUMBER OF SST ENTRIES            @G743PJK 05140000
SMCALSST DS    H -            LENGTH OF ONE SST ENTRY          @G741PJK 05150000
*                                                              @G860P27 05160000
*                                                              @G860P27 05170000
*       I/O MEASUREMENTS CONTROL AREA                          @G860P27 05180000
*                                                              @G860P27 05190000
*                                                              @G860P27 05200000
SMCAIOMC DS    F              NUMBER OF TIMES I/O MEASUREMENTS @G860P27 05210000
*                             HAVE BEEN TURNED OFF             @G860P27 05220000
SMCAIOMS EQU   X'80'          MEASUREMENTS ARE CURRENTLY ON    @G860P27 05230000
*                                                              @G860P27 05240000
*                                                              @G860P27 05250000
*       SMF  ADDRESS TABLE                                     @G860P27 05260000
*                                                              @G860P27 05270000
SMCA836  DS    A              ADDRESS OF IEEMB836              @G860P27 05280000
SMCA727  DS    A              ADDRESS OF IEFTB727              @G860P27 05290000
SMCA728  DS    A              ADDRESS OF IEFTB728              @G860P27 05300000
*                                                                       05310000
*       DATASET CONTROL INTERVAL SIZE                                   05320000
*          AND DATA LOST CONTROL FLAGS                                  05330000
*                                                                       05340000
SMCACISZ DS    F              SESSION DATASET CONTROL INT SIZE     @DHA 05350000
*                                                                       05360000
SMCA721  DS    0A             ADDRESS OF IEFTB721                  @DNC 05370000
SMCAJAC  DS    A              ADDRESS OF IFAJAC00                  @DNA 05380000
SMCASMCX DS    A              POINTER TO SMCX (SMCA EXTENSION      @LPC 05390000
*                             IN 31-BIT STORAGE)                   @LPA 05400000
SMCASCHD DS    A              ADDR OF DEFERRED SCHED SUB-ROUTINE   @LTC 05410000
*                             IN IEEMB839                          @LTC 05420000
*                                                                       05430000
SMCAFLGA DS    XL1            Miscellaneous flags                  @PCC 05440000
SMCAATSS EQU   X'80' -        AUTHSETSMF was specified             @PCC 05450000
SMCANTSS EQU   X'40' -        NOAUTHSETSMF was specified           @PCC 05460000
*        EQU   BIT2 -         Reserved                             @LVC 05470000
*        EQU   BIT3 -         RESERVED                             @LVC 05480000
SMCAEXR1 EQU   BIT4 -         RESERVED                             @DHA 05480100
SMCAEXR3 EQU   BIT5 -         RESERVED                             @DHA 05500000
SMCAEXR4 EQU   BIT6 -         RESERVED                             @DHA 05510000
SMCAEXR5 EQU   BIT7 -         RESERVED                             @DHA 05520000
*                                                                       05530000
SMCASIDB DS    XL1            SMF SID Syntax Used                  @LWA 05540000
SMCASDFT EQU   X'80'          'Default'                            @LWA 05550000
SMCASONL EQU   X'40'          SID(xxxx)                            @LWA 05560000
SMCASSER EQU   X'20'          SID(xxxx,ser#)                       @LWA 05570000
SMCASSYS EQU   X'10'          SID(xxxxSYSNAME(sysname))            @LWA 05580000
SMCASSYM EQU   X'08'          SID(&SYSNAME(m:n))                   @LWA 05590000
SMCASCOM EQU   X'04'          SID(xxxx,COMBIN(ser#,ser#))          @LWA 05600000
SMCASRSV EQU   X'03'          Reserved                             @LWA 05610000
*                                                                       05620000
SMCAUFLG DS    XL1            Usage Data Collection Services Flags @01C 05630000
SMCAUT89 EQU   BIT0 -         Type 89 Subtype 1 Recording Active   @01A 05640000
SMCAT892 EQU   BIT1 -         Type 89 Subtype 2 Recording Active   @MXA 05650000
*                                                                       05660000
         DS    XL1            Reserved                             @LWA 05670000
*                                                                       05680000
SMCADLFL DS    XL1            DATA LOST CONTROL FLAGS              @01C 05690000
SMCADLWT EQU   BIT0 -         MAXBUFFS OPTION SPECIFIED            @DHA 05700000
SMCADLHL EQU   BIT1 -         NOBUFFS(HALT) SPECIFIED              @DHA 05710000
SMCADLLD EQU   BIT2 -         LASTDS(HALT) SPECIFIED               @DHA 05720000
SMCADLR1 EQU   BIT3 -         RESERVED                             @DHA 05730000
SMCADLR2 EQU   BIT4 -         RESERVED                             @DHA 05740000
SMCADLR3 EQU   BIT5 -         RESERVED                             @DHA 05750000
SMCADLR4 EQU   BIT6 -         RESERVED                             @DHA 05760000
SMCADLR5 EQU   BIT7 -         RESERVED                             @DHA 05770000
*                                                                       05780000
         DS    XL1            Reserved                             @01A 05790000
*                                                                       05800000
SMCAASIS DS    H              SMF ASID used for serialization      @05C 05810000
*                                                                 1@05D 05820000
SMCA838M DS    A -            Address of IEEMB838                  @0BC 05830000
SMCAECBS DS    F -            I SMF ECB, used for IEEMB829              05840000
*                             response message processing.         @0FC 05850000
SMCAJAC1 DS    A              ADDRESS OF IFAJAC01                  @LRA 05860000
SMCAUDCA DS    A              Address of Usage Data Collection     @01A 05870000
SMCAUPCL DS    F              Usage PCA Lockword                   @01A 05880000
SMCAUPCA DS    F              Address of first PCA on chain        @01A 05890000
SMCAUACL DS    F              Usage ACA Lockword                   @01A 05900000
SMCAUACA DS    F              Address of first ACA on chain        @01A 05910000
SMCAUDCT DS    A              Address of Usage Data Collection     @03A 05920000
*                             Timer Element                        @03A 05930000
         DS    CL4            Reserved for Alignment               @03A 05940000
SMCAUST  DS    XL8            Usage Data Start Time (TOD)          @03A 05950000
SMCAUSTL DS    XL8            Usage Data Start Time (Local)        @03A 05960000
SMCAUET  DS    XL8            Usage Data End Time (TOD)            @03A 05970000
SMCAUETL DS    XL8            Usage Data End Time (Local)          @03A 05980000
SMCAUIT  DS    XL8            Usage Record End   Time (TOD)        @07C 05990000
SMCAUITL DS    XL8            Usage Record End   Time (Local)      @07C 06000000
SMCAUISL DS    XL8            Usage Record Start Time (Local)      @07A 06010000
SMCAUCCA DS    F              Address of first CCA                 @0DA 06020000
SMCAUZNF DS    F              zCBP or zAAP Normalization factor    @L5C 06021000
SMCAUSNF DS    F              zIIP Normalization factor            @L5C 06040000
SMCAUD64 DS    A              Address of AMODE 64 Usage Data            06041000
*                             Collection routine                   @L6A 06042000
*                                                                       06050000
SMCAEND  EQU   *                                                        06060000
SMCASIZE EQU   SMCAEND-SMCABASE - SIZE OF SMCA TABLE                    06070000
         MEND  , */                                                     06080000
*    %SMCAL2: ;                                                         06090000
* %DCL ASAXMAC_READONLY CHAR EXT;                          /*    @PBA*/ 06100000
* %ASAXMAC_READONLY = '';                                  /*    @PBA*/ 06110000
* %DCL ASAXMAC_BYPASS CHAR EXT;                            /*    @PBA*/ 06120000
* %IF ASAXMAC_BYPASS ^= '' %THEN %GOTO SMCAPLS99;          /*    @PBA*/ 06130000
* %IF SYSVERSION = '' %THEN %GOTO SMCAPLS99;               /*    @PBA*/ 06140000
* %IF SYSRULESMOD='PL/S-III ' %THEN %GOTO SMCAPLS99;       /*    @PBA*/ 06150000
* ?ASAXMAC ISITPLX(2,4,0);                                 /*    @PBA*/ 06160000
* %DCL ASAXMAC_ISITPLX CHAR EXT;                           /*    @PBA*/ 06170000
* %IF ASAXMAC_ISITPLX ^= 'YES' %THEN %GOTO SMCAPLS99;      /*    @PBA*/ 06180000
* ?ASAXMAC SetEsameInfo;                                   /*    @PBA*/ 06190000
*%SMCAPLS99:;                                              /*    @PBA*/ 06200000
*/*                               */                                    06210000
*/* PL/AS mapping definitions...  */                                    06220000
*/*                               */                                    06230000
*   DECLARE                                                             06240000
*     1 SMCABASE BASED(CVTSMCA) BDY(DWORD),                             06250000
*      2 SMCAOPT     CHAR(1),            /* SMFDEFLT OPTIONS SELECTED   06260000
*                                           AT INITIALIZATION TIME.     06270000
*                                           THE OPTIONS APPLY TO        06280000
*                                           BACKGROUND PROCESSING.      06290000
*                                           SMCAFOPT (OFFSET 82)        06300000
*                                           CONTAINS THE FOREGROUND     06310000
*                                           OPTIONS.                 */ 06320000
*       3 SMCAOPT1 BIT(1),               /* Job accounting       @0CC*/ 06330000
*       3 SMCAOPT2 BIT(1),               /* Step accounting      @0CC*/ 06340000
*       3 SMCAEXT  BIT(1),               /* Exits will be taken  @0CC*/ 06350000
*       3 SMCADSA  BIT(1),               /* DATA SET ACCOUNTING      */ 06360000
*       3 SMCAVOL  BIT(1),               /* VOLUME ACCOUNTING        */ 06370000
*       3 SMCAUDCS  BIT(1),         /* Usage Data Collection Services   06380000
*                                                                @01A*/ 06390000
*         5 SMCARS01 BIT(1),             /* RESERVED             @01C*/ 06400000
*       3 SMCATDS  BIT(1),               /* TYPE 17 RECORDS             06410000
*                                           MAINTAINED FOR TEMPORARY    06420000
*                                           DATA SETS (REC(PERM) OR     06430000
*                                           REC(CALL))               */ 06440000
*       3 SMCAFGND BIT(1),               /* SMF FOREGROUND OPTIONS      06450000
*                                           BIT.  IF 0, ABOVE BITS      06460000
*                                           DESCRIBE BACKGROUND         06470000
*                                           OPTIONS.  IF 1, ABOVE       06480000
*                                           BITS DESCRIBE FOREGROUND    06490000
*                                           OPTIONS             20011*/ 06500000
*      2 SMCAMISC    CHAR(1),            /* MISCELLANEOUS INDICATORS */ 06510000
*       3 SMCAUSER BIT(1),               /* SMF RECORDING REQUESTED  */ 06520000
*       3 SMCAMAN  BIT(1),               /* SYS1.MAN DATA SET           06530000
*                                           IS/IS NOT PRESENT.          06540000
*                                           BITS 0 AND 1 MEAN:          06550000
*                                           00 = NO SMF RECORDING       06560000
*                                                REQUESTED (MAN=NONE)   06570000
*                                           01 = ONLY USER RECORDS TO   06580000
*                                                BE RECORDED (MAN=USER) 06590000
*                                           10 = INVALID COMBINATION    06600000
*                                           11 = SMF AND USER           06610000
*                                                RECORDING REQUESTED    06620000
*                                                (MAN=ALL)           */ 06630000
*       3 SMCADSIC BIT(1),               /* DATA SET INITIALIZATION     06640000
*                                           COMPLETE BY IEEMB829        06650000
*                                           (1 = COMPLETE)       @Q4C*/ 06660000
*       3 SMCAFIRT BIT(1),               /* SMF DATA SET TO BE          06670000
*                                           OPENED                   */ 06680000
*       3 SMCAPSDP BIT(1),               /* PSEUDO-DUMP SWITCH          06690000
*                                           (DEVICE SWITCHING ONLY)  */ 06700000
*       3 SMCADBSY BIT(1),               /* DUMP IS BUSY (SMF WRITER)*/ 06710000
*       3 SMCABSW  BIT(1),               /* BUFFER SWITCH.  IF 0,       06720000
*                                           LEFT HALF OF BUFFER IN      06730000
*                                           USE.  IF 1, RIGHT HALF OF   06740000
*                                           BUFFER IN USE.           */ 06750000
*       3 SMCADUMP BIT(1),               /* DUMP BUSY                */ 06760000
*      2 SMCATOFF    FIXED(15),          /* OFFSET OF THE FIRST SMF     06770000
*                                           TIOT ENTRY FROM THE         06780000
*                                           BEGINNING OF THE MASTER     06790000
*                                           SCHEDULER TIOT           */ 06800000
*      2 SMCASMCA    CHAR(4),            /* CONTROL BLOCK ID         */ 06810000
*   /*                                                               */ 06820000
*   /* THE FOLLOWING FIELDS ARE SET UP BY IPL INITIALIZATION         */ 06830000
*   /*                                                               */ 06840000
*      2 SMCAJWT     FIXED(31),          /* JOB WAIT TIME LIMIT - BIT   06850000
*                                           31 REPRESENTS 1.048576      06860000
*                                           SECONDS          @ZA18120*/ 06870000
*      2 SMCAS842    PTR(31),            /* ADDR OF IEEMB842 @G743PJK*/ 06880000
*      2 SMCASID     CHAR(4),            /* SYSTEM IDENTIFICATION       06890000
*                                           (SID) - INTENDED FOR        06900000
*                                           REFERENCE ONLY       @P6A*/ 06910000
*      2 SMCABUFP    PTR(31),            /* ADDRESS OF THE SMF BUFFER*/ 06920000
*      2 SMCAMTD BDY(WORD) CHAR(8),      /* MAXDORM TIME STAMP OF FIRST 06930000
*                                           RECORD IN CURRENT BUFFER AT 06940000
*                                           EXPIRATION OF PREVIOUS      06950000
*                                           MAXDORM          @G743PJW*/ 06960000
*      2 SMCAOPTB    PTR(31),            /* ADDR OF SMFOPTAB @G743PJK*/ 06970000
*      2 SMCADFLT    PTR(31),            /* ADDR OF SMFDEFLT @G743PJK*/ 06980000
*      2 SMCAARCT FIXED(31),             /* # OF RECORDS AT LAST ABEND  06990000
*                                                            @G743PBB*/ 07000000
*      2 SMCAABCT FIXED(31),             /* # OF BUFFERS AT LAST ABEND  07010000
*                                                            @G743PBB*/ 07020000
*      2 SMCASRCT FIXED(31),             /* # OF RECORDS AT LAST STATUS 07030000
*                                                            @G743PJW*/ 07040000
*      2 SMCASBCT FIXED(31),             /* # OF BUFFERS AT LAST STATUS 07050000
*                                                            @G743PJW*/ 07060000
*      2 SMCASSTX PTR(31),               /* Pointer to SMCASSTP_ExtType 07070000
*                                                                @PDC*/ 07080000
*      2 SMCACART CHAR(8),               /* CART for IEE362A,           07090000
*                                           IEE352I, IEE391A            07100000
*                                           for I SMF only       @PFC*/ 07110000
*      2 SMCABR14 CHAR(2),               /* SMF RMTR (BR 14) @G743PBB*/ 07120000
*      2 SMCAASID FIXED(15),           /* ASID OF SMF ADDR SPACE @L1C*/ 07130000
*   /*                                                               */ 07140000
*   /* MISCELLANEOUS POINTERS AND COMMUNICATION AREAS                */ 07150000
*   /*                                                               */ 07160000
*      2 SMCAWAIT (2) FIXED(31),         /* THE ACCUMULATED WAIT        07170000
*                                           TIME, EXPRESSED IN 26       07180000
*                                           USEC TIMER UNITS.  FIRST    07190000
*                                           WORD IS OVERFLOW FROM       07200000
*                                           SECOND WORD.             */ 07210000
*      2 SMCAENTY    CHAR(2),            /* THESE SWITCHES GOVERN       07220000
*                                           ENTRY CONDITIONS FOR        07230000
*                                           DEVICE SWITCHING/           07240000
*                                           ALLOCATION/OPENING          07250000
*                                           ROUTINES                 */ 07260000
*       3 SMCAENDI    CHAR(1),           /* A COMMUNICATION FIELD    */ 07270000
*        4 SMCARS14 BIT(1),              /* RESERVED                 */ 07280000
*        4 SMCARS15 BIT(1),              /* RESERVED                 */ 07290000
*        4 SMCARS16 BIT(1),              /* RESERVED                 */ 07300000
*        4 SMCARS17 BIT(1),              /* RESERVED                 */ 07310000
*        4 SMCARS18 BIT(1),              /* RESERVED                 */ 07320000
*        4 SMCARS19 BIT(1),              /* RESERVED                 */ 07330000
*        4 SMCADSPO BIT(1),              /* DISPLAY OPTIONS (D SMF,O)   07340000
*                                           IS IN EFFECT.    @ZA84325*/ 07350000
*        4 SMCADSNF BIT(1),              /* IF ZERO, DATA SET (X OR     07360000
*                                           Y) WAS FOUND.  IF ONE,      07370000
*                                           DATA SET (X OR Y) WAS       07380000
*                                           NOT FOUND.               */ 07390000
*       3 SMCAENOP    CHAR(1),           /* ENTRY CODE THAT INDICATES   07400000
*                                           WHICH LOAD OF SVC 83 HAS    07410000
*                                           PASSED CONTROL TO CURRENT   07420000
*                                           LOAD                     */ 07430000
*      2 SMCAFOPT    CHAR(1),            /* SMF FOREGROUND OPTIONS   */ 07440000
*       3 SMCAFOP1 BIT(1),               /* RESERVED                 */ 07450000
*       3 SMCAFOP2 BIT(1),               /* RESERVED                 */ 07460000
*       3 SMCAFEXT BIT(1),               /* RESERVED                 */ 07470000
*       3 SMCAFDSA BIT(1),               /* DATA SET ACCOUNTING         07480000
*                                           (DSV=2 OR 3)        19028*/ 07490000
*       3 SMCAFVOL BIT(1),               /* VOLUME ACCOUNTING           07500000
*                                           (DSV=1 OR 3)        19028*/ 07510000
*       3 SMCAFR01 BIT(1),               /* RESERVED           ICB441*/ 07520000
*       3 SMCAFTDS BIT(1),               /* TYPE 17 RECORDS             07530000
*                                           MAINTAINED FOR TEMPORARY    07540000
*                                           DATA SETS (REC(PERM) OR     07550000
*                                           REC(CALL))               */ 07560000
*       3 SMCAFGN  BIT(1),               /* SMF FOREGROUND OPTIONS      07570000
*                                           BIT.  IF 0, ABOVE BITS      07580000
*                                           DESCRIBE BACKGROUND         07590000
*                                           OPTIONS.  IF 1, ABOVE       07600000
*                                           BITS DESCRIBE               07610000
*                                           FOREGROUND OPTIONS  20011*/ 07620000
*      2 SMCABITS    CHAR(1),            /* BIT INDICATORS       @0SC*/ 07630000
*        4 SMCADAR   BIT(1),             /* DUMPABND OPTION IND  @0SA*/ 07640000
*        4 SMCADSNM  BIT(1),             /* Data Set Name Migration     07650000
*                                           Indicator            @LXA*/ 07660000
*        4 *         BIT(6),             /* RESERVED             @LXC*/ 07670000
*      2 SMCAWRTP    FIXED(31),          /* AN OPTIMUM BUFFER LOAD      07680000
*                                           DISPLACEMENT FIGURE.        07690000
*                                           WHEN THE BUFFER IS LOADED   07700000
*                                           TO OR BEYOND THIS POINT,    07710000
*                                           IT WILL BE WRITTEN TO THE   07720000
*                                           SMF DATA SET             */ 07730000
*      2 SMCAOARY PTR(31),               /* POINTER TO OLD RDS ARRAY    07740000
*                                           FOR SET COMMAND  @G743PJK*/ 07750000
*      2 SMCANARY PTR(31),               /* POINTER TO NEW RDS ARRAY    07760000
*                                           FOR SET COMMAND  @G743PJK*/ 07770000
*      2 SMCASUBP PTR(31),               /* POINTER TO SUBPARM CHAIN    07780000
*                                                            @ZA52499*/ 07790000
*      2 SMCABFMF FIXED(31),             /* MAXIMUM NUMBER OF FULL      07800000
*                                           BUFFERS          @G743PBB*/ 07810000
*                                        /*                     1@P3D*/ 07820000
*      2 SMCAPCNO FIXED(31),             /* PC NUMBER FOR SMFWTM @P3C*/ 07830000
*      2 SMCADSTM    CHAR(8) BDY(WORD),  /* START TIME AND DATE AT      07840000
*                                           WHICH NO DATA SET WAS       07850000
*                                           AVAILABLE TO RECORD ON.     07860000
*                                           APPEARS IN PACKED DECIMAL   07870000
*                                           IN THE FORM 00YYDDDF        07880000
*                                           WHERE 00 = ZEROS, YY =      07890000
*                                           LAST 2 DIGITS OF THE YEAR,  07900000
*                                           DDD = DAY OF THE YEAR AND   07910000
*                                           F IS A SIGN.             */ 07920000
*      2 SMCADSCT    FIXED(31),          /* THE NUMBER OF SMF RECORDS   07930000
*                                           THAT HAVE BEEN OMITTED      07940000
*                                           FROM THE SMF DATA SET DUE   07950000
*                                           TO THE UNAVAILABILITY OF    07960000
*                                           A DATA SET TO RECORD ON  */ 07970000
*      2 SMCAASCB    PTR(31),            /* ASCB OF SMF ADDRESS SPACE   07980000
*                                                              MDC005*/ 07990000
*      /**************************************************************/ 08000000
*      /*                                                            */ 08010000
*      /*  Although not an intended interface, some ISV products     */ 08020000
*      /* modify SMCAMACR to contain the address of their intercept  */ 08030000
*      /* routine.                                                   */ 08040000
*      /*                                                            */ 08050000
*      /**************************************************************/ 08060000
*      2 SMCAMACR    PTR(31),            /* Entry point to macro        08070000
*                                           routine              @PAC*/ 08080000
*      2 SMCASAVE    PTR(31),            /* USER EXIT ADDRESS SAVE      08090000
*                                           FIELD (OS/VS2)              08100000
*                                           (MDC300)        @ZA02385*/  08110000
*      2 SMCATEXP    FIXED(31),          /* TIME OF MOST RECENT         08120000
*                                           EXPIRATION OF A TEN-        08130000
*                                           MINUTE TIMER QUEUE          08140000
*                                           ELEMENT (TQE)      ICB310*/ 08150000
*        3 SMCAECB7 FIXED(31),          /* ECB FOR SET SMF TO POST      08160000
*                                           WHEN COMPLETE        @L1A*/ 08170000
*      2 SMCASTKN    CHAR(8),            /* Address Space Token  @05C*/ 08180000
*                                        /*                     1@05D*/ 08190000
*      2 SMCASJWT    CHAR(4),            /* SAVE JWT AS ENTERED         08200000
*                                           (HHMM)           @G742PJK*/ 08210000
*      2 SMCASMDM    CHAR(4),            /* SAVE MAXDORM AS ENTERED     08220000
*                                           (MMSS)           @G742PJK*/ 08230000
*      2 SMCASSTS    CHAR(6),            /* SAVE STATUS AS ENTERED      08240000
*                                           (HHMMSS)         @G742PJK*/ 08250000
*      2 SMCAPARM    CHAR(2),            /* PARMLIB SUFFIX FOR RESTART  08260000
*                                                                    */ 08270000
*                                        /*                     1@P3D*/ 08280000
*      2 SMCASLCA    PTR(31),            /* ADDRESS OF SLCA      @P3C*/ 08290000
*      2 SMCAPGM     FIXED(31),          /* NUMBER OF PAGES MIGRATED    08300000
*                                                              ICB310*/ 08310000
*      2 SMCAU83     PTR(31),            /* ADDRESS OF SMF OUTPUT EXIT  08320000
*                                           (IEFU83) TAKEN WHEN         08330000
*                                           RECORDS ARE TO BE WRITTEN   08340000
*                                           TO AN SMF DATA SET ICB407*/ 08350000
*        3 SMCALOCK PTR(31),             /* POINTER TO FIRST SSB ON     08360000
*                                           SMF LOCK QUEUE   @ZA58293*/ 08370000
*      2 SMCAWTCB    PTR(31),            /* ADDRESS OF SMF WRITER'S     08380000
*                                           TCB - USED BY XMPOST        08390000
*                                           ERROR PROCESSOR (IEEMB827)  08400000
*                                           (OS/VS2)           MDC006*/ 08410000
*                                        /*                     1@P3D*/ 08420000
*      2 SMCATSK2 PTR(31),             /* ADDRESS OF IFASMF TASK @P3C*/ 08430000
*      2 SMCAACTP PTR(31),               /* ADDRESS OF THE ACT (USED    08440000
*                                           BY INPUT MERGE, PARSE AND   08450000
*                                           LIST OPTIONS)   @G741PLS*/  08460000
*       /*************************************************************/ 08470000
*       /*                                                           */ 08480000
*       /* THE NEXT TWO FIELDS ARE THE SUBJECT OF COMPARE DOUBLE AND */ 08490000
*       /* SWAP LOGIC THAT CONTROLS THE SCHEDULING OF THE SRB.  THEY */ 08500000
*       /* MUST BE ON A DOUBLE WORD BOUNDARY.  DO NOT MOVE.  @G741PLS*/ 08510000
*       /*                                                           */ 08520000
*       /*************************************************************/ 08530000
*      2 SMCACDS CHAR(8) BDY(DWORD),     /* TARGET OF CDS TO CONTROL    08540000
*                                           SRB SCHEDULE     @G742PJK*/ 08550000
*        3 SMCANMFL FIXED(31),           /* NUMBER OF FULL BUFFERS      08560000
*                                                            @G742PJK*/ 08570000
*        3 SMCASSB  PTR(31),          /* POINTER TO SMF SUSPEND BLOCK   08580000
*                                                            @ZM50077*/ 08590000
*      2 SMCACNIS FIXED(31),          /* Console ID for IEE362A,        08600000
*                                        IEE352I, IEE391A               08610000
*                                        for I SMF only          @0FC*/ 08620000
*      2 SMCASTTT PTR(31),            /* ADDR OF STATUS TIMER ELEMENT   08630000
*                                                            @G742PJK*/ 08640000
*      2 SMCAMAXT PTR(31),            /* ADDR OF MAXDORM TIMER ELEMENT  08650000
*                                                            @G742PJK*/ 08660000
*      2 SMCADTB  PTR(31),               /* ADDR OF DUMP TIMER ELEMENT  08670000
*                                                            @G742PJK*/ 08680000
*      2 SMCABITF FIXED(31),            /* WORD OF BIT FLAGS @G743PJK*/ 08690000
*        3 SMCAPRMT BIT(8),              /* REPLACES OPI BIT @G741PLS*/ 08700000
*          5 SMCAIPLR BIT(1),            /* PROMPT(IPLR) OR PROMPT(ALL) 08710000
*                                           SPECIFIED        @G741PLS*/ 08720000
*          5 SMCALIST BIT(1),            /* PROMPT(LIST) OR PROMPT(ALL) 08730000
*                                           SPECIFIED        @G741PLS*/ 08740000
*          5 SMCALDSN BIT(1),            /* DISPLAY DSNAME STATUS       08750000
*                                                            @G741PLS*/ 08760000
*          5 SMCAMXDM BIT(1),            /* MAXDORM SPECIFIED?          08770000
*                                                            @G742PJK*/ 08780000
*          5 SMCASTUS BIT(1),            /* STATUS SPECIFIED?           08790000
*                                                            @G741PLS*/ 08800000
*          5 SMCARUN BIT(1) ABNORMAL,   /* WRITER SRB RUNNING           08810000
*                                                            @ZA53006*/ 08820000
*          5 SMCASKD BIT(1) ABNORMAL,   /* WRITER SRB HAS BEEN          08830000
*                                      SCHEDULED             @ZA53006*/ 08840000
*          5 SMCACONS BIT(1),          /* DD CONSOLIDATION       @02A*/ 08850000
*        3 SMCAFLGS BIT(8) ABNORMAL,     /*                      @04C*/ 08860000
*          5 SMCAINIT BIT(1),            /* WRITER TASK INITIALIZED     08870000
*                                                            @G741PLS*/ 08880000
*          5 SMCARSTR BIT(1),            /* RESTART IN PROGRESS         08890000
*                                                                @L1C*/ 08900000
*          5 SMCADTLS BIT(1),            /* DATA LOST - NO SPACE ON     08910000
*                                           RECORDING DATASETS          08920000
*                                                            @G743PBB*/ 08930000
*          5 SMCASETP BIT(1),            /* SET SMF IN PROCESS          08940000
*                                                            @G741PLS*/ 08950000
*          5 SMCADISP BIT(1),            /* DISPLAY SMF FOR OPTIONS     08960000
*                                           OR DATASETS IN PROCESS      08970000
*                                                            @ZA84325*/ 08980000
*          5 SMCAFLD  BIT(1),            /* SMF Flood Automation is     08990000
*                                           active               @L3C*/ 09000000
*          5 *        BIT(1),            /* Reserved -  was SMCALATE    09010000
*                                                                @PBC*/ 09020000
*          5 SMCASETS BIT(1),           /* SETSMF IN PROCESS @G383P26*/ 09030000
*        3 SMCAFLGR BIT(8),              /* RECOVERY FOOTPRINTS         09040000
*                                                            @G743PBB*/ 09050000
*          5 SMCATERM BIT(1),            /* SMF TERMINATED   @G743PBB*/ 09060000
*          5 SMCAPGFX BIT(1),            /* PAGEFIX ISSUED   @G743PBB*/ 09070000
*          5 SMCASRBF BIT(1),            /* WRITER SRB ABENDED AND      09080000
*                                           ISSUED SDUMP     @G743PBB*/ 09090000
*          5 SMCAPSUS BIT(1),            /* RESERVED             @L1C*/ 09100000
*            7 SMCAPCDT BIT(1),          /* IFAPCWTR HAS TAKEN SDUMP -  09110000
*                                         IEEMB830 RECOVERY DOES NOT    09120000
*                                           NEED TO TAKE DUMP    @L1A*/ 09130000
*          5 SMCAU29 BIT(1),             /* IEFU29 EXIT CALLED          09140000
*                                                            @G743PBB*/ 09150000
*          5 SMCANOST BIT(1),            /* NO MORE SET COMMANDS        09160000
*                                           ALLOWED          @G743PBB*/ 09170000
*          5 SMCAPREV BIT(1) ABNL,       /* ABEND OCCURRED IN PREVIOUS  09180000
*                                           EASI INTERVAL PROCESSING.   09190000
*                                           MUST USE CS TO UPDATE       09200000
*                                                            @G384P27*/ 09210000
*          5 SMCANMRE BIT(1) ABNL,       /* NO MORE EASI INTERVAL       09220000
*                                           PROCESSING DUE TO ABENDS.   09230000
*                                           MUST USE CS TO UPDATE       09240000
*                                                            @G384P27*/ 09250000
*        3 SMCARCUR BIT(8),              /* Recovery recursion & misc   09260000
*                                           bits                 @0CC*/ 09270000
*          5 SMCAMXDR BIT(1),            /* PREVENT MAXDORM RECURSION   09280000
*                                                            @G743PBB*/ 09290000
*          5 SMCASTTR BIT(1),            /* PREVENT STATUS RECURSION    09300000
*                                                            @G743PBB*/ 09310000
*          5 SMCASUSR BIT(1),            /* PREVENT SUSPEND RECURSION   09320000
*                                                            @G743PBB*/ 09330000
*          5 SMCATIMR BIT(1),            /* PREVENT TIMER RECURSON      09340000
*                                                            @G743PBB*/ 09350000
*          5 SMCASETR BIT(1),            /* PREVENT SET RECURSION       09360000
*                                                            @G743PBB*/ 09370000
*          5 SMCASETC BIT(1),            /* FOOTPRINTS FOR SET RECOV-   09380000
*                                           ERY                  @L1C*/ 09390000
*          5 SMCASTLS BIT(1),            /* Indicate to IFALSMOD that   09400000
*                                           SET SMF or SMF start up     09410000
*                                           is in progress       @0CC*/ 09420000
*          5 * BIT(1),                   /* Reserved             @LVC*/ 09430000
*      2 SMCAECB0 FIXED(31),             /* DISPLAY SMF ECB      @L1A*/ 09440000
*      2 SMCASRB  PTR(31),               /* ADDRESS OF SMF WTR SRB      09450000
*                                                            @G741PLS*/ 09460000
*      2 SMCAECB1 FIXED(31),             /* SET SMF ECB          @L1A*/ 09470000
*      2 SMCAECB2 FIXED(31),             /* DUMP CHECK ECB       @L1A*/ 09480000
*      2 SMCAECB3 FIXED(31),             /* SETSMF ECB           @L1A*/ 09490000
*      2 SMCAALCN FIXED(31),             /* Alternate console ID for    09500000
*                                           SWITCH SMF command   @06C*/ 09510000
*      2 SMCAXMCA PTR(31),               /* ADDRESS OF CROSS MEMORY     09520000
*                                           COMMUNICATION AREA  @L1C*/  09530000
*   /*****************************************************************/ 09540000
*   /*                                                               */ 09550000
*   /* HEADER AREA FOR RDS CHAIN - RECORDING DATASET CONTROL         */ 09560000
*   /*                                                       @G741PLS*/ 09570000
*   /*****************************************************************/ 09580000
*   2 SMCARDSH CHAR(4),           /* RDSH - CHAIN HEADER ID  @G741PLS*/ 09590000
*   2 SMCAFRDS PTR(31),           /* FIRST RDS               @G741PLS*/ 09600000
*   2 SMCALRDS PTR(31),           /* LAST RDS                @G741PLS*/ 09610000
*   2 SMCASVCR PTR(31),           /* CURRENT RDS FOR SVC 83 (IEEMB830)  09620000
*                                                            @G741PLS*/ 09630000
*   2 SMCASRBR PTR(31),           /* CURRENT RDS FOR SRB (IEEMB834)     09640000
*                                                            @G741PLS*/ 09650000
*   /*****************************************************************/ 09660000
*   /*                                                               */ 09670000
*   /* Miscellaneous Buffering Fields                                */ 09680000
*   /*                                                           @P3C*/ 09690000
*   /*****************************************************************/ 09700000
*   2 SMCA994E(3) FIXED(31) ABNORMAL, /* DOM ID of IEE994E messages.    09710000
*                                    Array entries correspond to DOM    09720000
*                                    IDs for IEFU83, IEFU84, IEFU85     09730000
*                                    versions of message respectively.  09740000
*                                    Serialization is CS logic.  @P5C*/ 09750000
*   2 SMCAECBI PTR(31),           /* INITIALIZATION END ECB ADR  @P3C*/ 09760000
*   2 SMCADMID FIXED(31),        /* ID TO DOM IEE962E MESSAGE    @P1C*/ 09770000
*                                 /*                            3@P3D*/ 09780000
*   2 SMCAD068 FIXED(31),         /* DOM ID OF IEE068A MESSAGE   @09C*/ 09790000
*                                 /*                            1@P3D*/ 09800000
*   2 SMCAD978 FIXED(31),         /* MESSAGE IEE978E REMOVED     @DIC*/ 09810000
*     3 SMCAD986 FIXED(31),       /* DOM ID FOR LAST IEE986E MSG @DIA*/ 09820000
*   2 SMCABFLS FIXED(32),         /* NUMBER OF RCDS LOST DUE TO         09830000
*                                    BUFFER SHORTAGE             @0AC*/ 09840000
*                                 /*                            1@P3D*/ 09850000
*   /*****************************************************************/ 09860000
*   /*  Double define SMCAD786 and SMCAD979 so that if we switch     */ 09870000
*   /*  from dataset to logstream recording and there was a temp     */ 09880000
*   /*  area full condition the message will get dommed.             */ 09890000
*   /*                                                           @L4A*/ 09900000
*   /*****************************************************************/ 09910000
*   2 SMCAD786 FIXED(31),         /*                             @L4A*/ 09920000
*     3 SMCAD979 FIXED(31),       /* DOM ID FOR IEE979W MESSAGE  @L4C*/ 09930000
*   2 SMCABFWT FIXED(31),         /* BUFFERS WRITTEN         @G742PJK*/ 09940000
*   2 SMCARCWT FIXED(31),         /* RECORDS WRITTEN         @G742PJK*/ 09950000
*   /*****************************************************************/ 09960000
*   /*                                                               */ 09970000
*   /* VARIABLES USED BY TIMER MODULE                                */ 09980000
*   /*                                                       @G742PJK*/ 09990000
*   /*****************************************************************/ 10000000
*   2 SMCATQE  PTR(31),           /* ADDRESS OF TQE          @G742PJK*/ 10010000
*   2 SMCAENQE PTR(31),           /* ADDR OF ENTRY TO ENQUE             10020000
*                                    SUBROUTINE OF IEEMB839  @G742PJK*/ 10030000
*   2 SMCADEQE PTR(31),           /* ADDRESS OF ENTRY TO DEQUE          10040000
*                                    SUBROUTINE OF IEEMB839  @G742PJK*/ 10050000
*   2 SMCANSRB PTR(31),           /* ADDRESS OF FIRST ELEMENT ON        10060000
*                                    CHAIN OF TIMER EVENTS   @G742PJK*/ 10070000
*   2 SMCAENDT CHAR(8) BDY(DWORD), /* Time when DIE invoked      @PBC*/ 10080000
*   /*****************************************************************/ 10090000
*   /*                                                               */ 10100000
*   /*   SELECTIVITY CONTROL AREA                            @G741PLS*/ 10110000
*   /*                                                               */ 10120000
*   /*****************************************************************/ 10130000
*      2 SMCASSTP PTR(31),               /* ADDRESS OF SMF SELECTIVITY  10140000
*                                           TABLE            @G741PJK*/ 10150000
*      2 SMCASYSP PTR(31),               /* ADDRESS OF THE SYSTEM       10160000
*                                           (DEFAULT) SST    @G741PJK*/ 10170000
*      2 SMCAITME CHAR(4),               /* IPL TIME (BINARY) IN        10180000
*                                           HUNDREDTHS OF A SECOND -    10190000
*                                           INTENDED FOR REFERENCE      10200000
*                                           ONLY                 @P6A*/ 10210000
*      2 SMCAIDTE CHAR(4),               /* IPL DATE (0CYYDDDF) -       10220000
*                                           INTENDED FOR REFERENCE      10230000
*                                           ONLY                 @P6A*/ 10240000
*      2 SMCASACT PTR(31),               /* ADDRESS OF THE NEW ACT FOR  10250000
*                                           SET COMMAND      @G743PJK*/ 10260000
*      2 SMCANSST FIXED(15),             /* NUMBER OF SST ENTRIES       10270000
*                                                            @G741PJK*/ 10280000
*      2 SMCALSST FIXED(15),             /* LENGTH OF EACH SST ENTRY    10290000
*                                                            @G741PJK*/ 10300000
*/********************************************************************/ 10310000
*/*                                                                  */ 10320000
*/*    I/O MEASUREMENT CONTROL AREA                          @G860P27*/ 10330000
*/*                                                                  */ 10340000
*/********************************************************************/ 10350000
*      2 SMCAIOMC FIXED(31),             /* COUNT OF NUMBER OF TIMES    10360000
*                    I/O MEASUREMENTS HAVE BEEN TURNED OFF  @G860P27*/  10370000
*         3 SMCAIOMS BIT(1),             /* I/O MEASUREMENTS CURRENTLY  10380000
*                                           IN EFFECT        @G860P27*/ 10390000
*/*******************************************************************/  10400000
*/*                                                                 */  10410000
*/*    SMF ADDRESS TABLE                                    @G860P27*/  10420000
*/*                                                                 */  10430000
*/*******************************************************************/  10440000
*      2 SMCA836  PTR(31),            /* ADDRESS OF IEEMB836 @G860P27*/ 10450000
*      2 SMCA727  PTR(31),            /* ADDRESS OF IEFTB727 @G860P27*/ 10460000
*      2 SMCA728  PTR(31),            /* ADDRESS OF IEFTB728 @G860P27   10470000
*                                                            @DHC    */ 10480000
*/********************************************************************/ 10490000
*/*                                                                  */ 10500000
*/*     DATASET CONTROL INTERVAL SIZE                                */ 10510000
*/*        AND DATA LOST CONTROL FLAGS                               */ 10520000
*/*                                                                  */ 10530000
*/********************************************************************/ 10540000
*                                                                       10550000
*      2 SMCACISZ FIXED(31),          /* SESSION DATASET CONTROL        10560000
*                                        INT SIZE                @DHA*/ 10570000
*                                                                       10580000
*      2 SMCAJAC  PTR(31),            /* ADDRESS OF IFAJAC00     @DNA*/ 10590000
*        3 SMCA721 PTR(31),           /* ADDRESS OF IEFTB721     @DNC*/ 10600000
*      2 SMCASMCX PTR(31) ASAXMAC_READONLY, /* Pointer to SMCX (SMCA    10610000
*                                      extension in 31-Bit storage)     10620000
*                                                                @PBC*/ 10630000
*      2 SMCASCHD PTR (31),         /* ADDRESS OF DEFERRED SCHED        10640000
*                                      SUB-ROUTINE IN IEEMB839   @LTC*/ 10650000
*                                                                       10660000
*      2 SMCAFLGA   BIT(8),           /* Miscellaneous flags     @PCC*/ 10670000
*        3 SMCAATSS BIT(1),           /* AUTHSETSMF was spcfd    @PCC*/ 10680000
*        3 SMCANTSS BIT(1),           /* NOAUTHSETSMF was spcfd  @PCC*/ 10690000
*        3 * BIT(1),                  /* Reserved                @LVC*/ 10700000
*        3 * BIT(1),                  /* Reserved                @LVC*/ 10710000
*        3 SMCAEXR2 BIT(1),           /* RESERVED                @DHA*/ 10720000
*        3 SMCAEXR3 BIT(1),           /* RESERVED                @DHA*/ 10730000
*        3 SMCAEXR4 BIT(1),           /* RESERVED                @DHA*/ 10740000
*        3 SMCAEXR5 BIT(1),           /* RESERVED                @DHA*/ 10750000
*                                                                       10760000
*      2 SMCASIDB FIXED(8),         /* SMF SID Syntax Used       @LWA*/ 10770000
*        3 SMCASDFT BIT(1),         /* 'Default'                 @LWA*/ 10780000
*        3 SMCASONL BIT(1),         /* SID(xxxx)                 @LWA*/ 10790000
*        3 SMCASSER BIT(1),         /* SID(xxxx,ser#)            @LWA*/ 10800000
*        3 SMCASSYS BIT(1),         /* SID(xxxxSYSNAME(sysname)) @LWA*/ 10810000
*        3 SMCASSYM BIT(1),         /* SID(&SYSNAME(m:n))        @LWA*/ 10820000
*        3 SMCASCOM BIT(1),         /* SID(xxxx,COMBIN(ser#,)    @LWA*/ 10830000
*        3 SMCASRSV BIT(2),         /* Reserved                  @LWA*/ 10840000
*                                                                       10850000
*      2 SMCAUFLG FIXED(8),         /* Usage Flags               @01C*/ 10860000
*        3 SMCAUT89 BIT(1),         /* Type 89 Subtype 1                10870000
*                                      Recording active          @01A*/ 10880000
*        3 SMCAT892 BIT(1),         /* Type 89 Subtype 2                10890000
*                                      Recording active          @MXA*/ 10900000
*                                                                       10910000
*      2 *        FIXED(8),         /* Reserved                  @LWA*/ 10920000
*                                                                       10930000
*      2 SMCADLFL FIXED(8),         /* DATA LOST CONTROL FLAGS   @LWC*/ 10940000
*        3 SMCADLR0 BIT(1),         /* RESERVED                  @DIC*/ 10950000
*        3 SMCADLHL BIT(1),         /* NOBUFFS(HALT) SPECIFIED   @DIA*/ 10960000
*        3 SMCADLLD BIT(1),         /* LASTDS(HALT) SPECIFIED    @DIA*/ 10970000
*        3 SMCADLR1 BIT(1),         /* RESERVED                  @DIA*/ 10980000
*        3 SMCADLR2 BIT(1),         /* RESERVED                  @DIA*/ 10990000
*        3 SMCADLR3 BIT(1),         /* RESERVED                  @DIA*/ 11000000
*        3 SMCADLR4 BIT(1),           /* RESERVED                @DIA*/ 11010000
*        3 SMCADLR5 BIT(1),           /* RESERVED                @DIA*/ 11020000
*                                                                       11030000
*      2 *        FIXED(8),         /* Reserved                  @LWA*/ 11040000
*                                                                       11050000
*      2 SMCAASIS FIXED(15),        /* ASID for serialization    @05C*/ 11060000
*                                   /*                          1@05D*/ 11070000
*      2 SMCA838M PTR(31),          /* Address of IEEMB838       @0BC*/ 11080000
*      2 SMCAECBS FIXED(32),        /* I SMF ECB, used for IEEMB829     11090000
*                                      response message                 11100000
*                                      processing                @0FC*/ 11110000
*      2 SMCAJAC1 PTR(31),            /* ADDRESS OF IFAJAC01     @LRA*/ 11120000
*                                                                       11130000
*/********************************************************************/ 11140000
*/*                                                                  */ 11150000
*/*     Usage Data Collection Services Fields                    @01A*/ 11160000
*/*                                                                  */ 11170000
*/********************************************************************/ 11180000
*                                                                       11190000
*      2 SMCAUDCA  PTR(31),         /* Address of Service Rtn    @01A*/ 11200000
*      2 SMCAUPCL  FIXED(31),       /* Usage PCA Lockword        @01A*/ 11210000
*      2 SMCAUPCA  PTR(31),         /* Address of first PCA      @01A*/ 11220000
*      2 SMCAUACL  FIXED(31),       /* Usage ACA Lockword        @01A*/ 11230000
*      2 SMCAUACA  PTR(31),         /* Address of first ACA      @01A*/ 11240000
*      2 SMCAUDCT  PTR(31),         /* Address of Timer Element  @03A*/ 11250000
*      2 *        CHAR(4),          /* Reserved - Alignment      @03A*/ 11260000
*      2 SMCAUST   CHAR(8),         /* Usage Data Start Time (TOD)      11270000
*                                                                @03A*/ 11280000
*      2 SMCAUSTL  CHAR(8),         /* Usage Data Start Time (Local)    11290000
*                                                                @03A*/ 11300000
*      2 SMCAUET   CHAR(8),         /* Usage Data End Time (TOD)        11310000
*                                                                @03A*/ 11320000
*      2 SMCAUETL  CHAR(8),         /* Usage Data End Time (Local)      11330000
*                                                                @03A*/ 11340000
*      2 SMCAUIT   CHAR(8),         /* Usage Record End   Time (TOD)    11350000
*                                                                @07C*/ 11360000
*      2 SMCAUITL  CHAR(8),         /* Usage Record End   Time (Local)  11370000
*                                                                @07C*/ 11380000
*      2 SMCAUISL  CHAR(8),         /* Usage Record Start Time (Local)  11390000
*                                                                @07A*/ 11400000
*      2 SMCAUCCA  PTR(31),         /* Address of first CCA      @0EC*/ 11410000
*      2 SMCAUZNF  FIXED(31),       /* zCBP or zAAP Normalization       11411000
*                                      factor                    @L5C*/ 11430000
*      2 SMCAUSNF  FIXED(31),       /* zIIP Normalization factor @L5C*/ 11440000
*                                                                       11450000
*      2 SMCAUD64  PTR(31),         /* Address of AMODE 64 Usage        11451000
*                                      Data Collection routine   @L6A*/ 11452000
*      2 SMCAEND   CHAR(0) Bdy(DWORD);/* END OF SMCA MAPPING     @L6C*/ 11453000
* @LOGIC;                           /* PRAGMAs for PADI          @L6A*/ 11454000
* #PRAGMA TOOL=PADI.                                                    11455000
* #PADIDELETE.SMCADLWT                                                  11456000
* #PADIDELETE.SMCADLR0                                                  11456100
* #PADIDELETE.SMCAEXR1                                                  11456200
* #PADIDELETE.SMCAEXR2                                                  11456300
* #PADIDELETE.SMCAFOP1                                                  11456400
* #PADIDELETE.SMCAFOP2                                                  11456500
* #PADIDELETE.SMCAFEXT                                                  11456600
* #PADIDELETE.SMCAFDSA                                                  11456700
* #PADIDELETE.SMCAFVOL                                                  11456800
* #PADIDELETE.SMCAFR01                                                  11456900
* #PADIDELETE.SMCAFTDS                                                  11457000
* #PADIDELETE.SMCAFGN                                                   11457100
* #PADIDELETE.SMCASIZE                                                  11457200
* #PADIDELETE.BIT0                                                      11457300
* #PADIDELETE.BIT1                                                      11457400
* #PADIDELETE.BIT2                                                      11457500
* #PADIDELETE.BIT3                                                      11457600
* #PADIDELETE.BIT4                                                      11457700
* #PADIDELETE.BIT5                                                      11457800
* #PADIDELETE.BIT6                                                      11457900
* #PADIDELETE.BIT7                                                      11458000
* #EPRAGMA.                                                             11458100
* @ENDLOGIC;                                                            11459000
