*%GOTO IEEZB833PLAS1; /*                                         @D1C*/ 00010000
         MACRO                                                          00020000
         IEEZB833 &PLISTVER=                                            00030000
*%IEEZB833PLAS1: ;    /*                                         @D1C*/ 00040000
*/**START OF SPECIFICATIONS ******************************************/ 00050000
*/*                                                                  */ 00060000
*/* MACRO NAME: IEEZB833                                         @D1C*/ 00070000
*/*                                                                  */ 00080000
*/* DESCRIPTIVE NAME: VARY Device Service Input                      */ 00090000
*/*                                                                  */ 00100000
*/*01* PROPRIETARY STATEMENT:                                    @L1C*/ 00110000
*/***PROPRIETARY_STATEMENT********************************************/ 00120000
*/*                                                                  */ 00130000
*/*                                                                  */ 00140000
*/* LICENSED MATERIALS - PROPERTY OF IBM                             */ 00150000
*/* 5650-ZOS COPYRIGHT IBM CORP. 1993, 2019                          */ 00160009
*/*                                                                  */ 00170000
*/* STATUS= HBB77C0                                                  */ 00180009
*/*                                                                  */ 00190000
*/***END_OF_PROPRIETARY_STATEMENT*************************************/ 00200000
*/*                                                                  */ 00210000
*/* DSECT NAME: VDEV VDEVARR                                         */ 00220000
*/*                                                                  */ 00230000
*/* COMPONENT: Master Scheduler (SC1B8)                              */ 00240000
*/*                                                                  */ 00250000
*/* EYE-CATCHER: 'VDEV'                                              */ 00260000
*/*                                                                  */ 00270000
*/* OFFSET: 0                                                        */ 00280000
*/*                                                                  */ 00290000
*/* LENGTH: 4                                                        */ 00300000
*/*                                                                  */ 00310000
*/* FUNCTION: Maps the input parameters for invokers of the IEEVARYD */ 00320000
*/*           service.                                               */ 00330000
*/*                                                                  */ 00340000
*/* METHOD-OF-ACCESS:                                                */ 00350000
*/*                                                                  */ 00360000
*/*   PLAS: %INCLUDE SYSLIB(IEEZB833)                            @D1C*/ 00370000
*/*                                                                  */ 00380000
*/*         %VDEVSTORAGE can be used to set the storage              */ 00390000
*/*         attributes for the VDEV control block:                   */ 00400000
*/*                                                                  */ 00410000
*/*           Examples:  %VDEVSTORAGE = 'AUTOMATIC'                  */ 00420000
*/*                      %VDEVSTORAGE = 'BASED'                      */ 00430000
*/*                      %VDEVSTORAGE = 'BASED(ptr)'                 */ 00440000
*/*                                                                  */ 00450000
*/*           Default:   %VDEVSTORAGE = 'BASED'                      */ 00460000
*/*                                                                  */ 00470000
*/*         %VDEVARRSTORAGE can be used to set the storage           */ 00480000
*/*         attributes for the VDEVARR array:                        */ 00490000
*/*                                                                  */ 00500000
*/*           Examples:  %VDEVARRSTORAGE = 'AUTOMATIC'               */ 00510000
*/*                      %VDEVARRSTORAGE = 'BASED'                   */ 00520000
*/*                      %VDEVARRSTORAGE = 'BASED(ptr)'              */ 00530000
*/*                                                                  */ 00540000
*/*           Default:   %VDEVARRSTORAGE = 'BASED'                   */ 00550000
*/*                                                                  */ 00560000
*/*         %VDEVARRNUM can be used to define the number of          */ 00570000
*/*         elements in the VDEVARR array:                           */ 00580000
*/*                                                                  */ 00590000
*/*           Examples:  %VDEVARRNUM = '1'                           */ 00600000
*/*                      %VDEVARRNUM = '5'                           */ 00610000
*/*                      %VDEVARRNUM = '*'                           */ 00620000
*/*                                                                  */ 00630000
*/*           Default:   %VDEVARRNUM = '*'                           */ 00640000
*/*                                                                  */ 00650000
*/*         %IEEZB833_PLISTVER can be used to request a specific @P1A*/ 00651000
*/*         version of the VDEV control block.                   @P1A*/ 00652000
*/*                                                              @P1A*/ 00653000
*/*           Examples:  %IEEZB833_PLISTVER = 'MAX'              @P1A*/ 00653100
*/*                      - gives the latest supported version,   @P1A*/ 00653200
*/*                        which may change from release to      @P1A*/ 00653300
*/*                        release                               @P1A*/ 00653400
*/*                      %IEEZB833_PLISTVER = 'VERSION1'         @P1A*/ 00653500
*/*                      - gives the original version            @P1A*/ 00653600
*/*                      %IEEZB833_PLISTVER = 'VERSION10'        @P1A*/ 00653700
*/*                      - gives version 10.  This version is    @P1A*/ 00653800
*/*                        only necessary when using             @P1A*/ 00653900
*/*                        VDEV_CART_AND_CONSID.                 @P1A*/ 00654000
*/*                                                              @P1A*/ 00654100
*/*           Default:   %IEEZB833_PLISTVER = 'VERSION1'         @P1A*/ 00654200
*/*                                                                  */ 00654300
*/*          %IEEZB833_Options_As_Type = 'YES' can be used to    @L6A*/ 00654401
*/*          request that the option bytes to be specified as    @L6A*/ 00654501
*/*          Cnz_tVDev_Options.                                  @L6A*/ 00654601
*/*                                                                  */ 00654701
*/*   ASM:  IEEZB833                                             @D1C*/ 00654801
*/*         or                                                   @P1A*/ 00654901
*/*         IEEZB833 PLISTVER=version                            @P1A*/ 00655001
*/*         where version is one of:                             @P1A*/ 00655101
*/*         - MAX (which gives the latest supported version,     @P1A*/ 00655201
*/*           which may change from release to release)          @P1A*/ 00655301
*/*         - VERSION1 (the original version, also the default)  @P1A*/ 00655401
*/*         - VERSION10 (only needed when using                  @P1A*/ 00656000
*/*           VDEV_CART_AND_CONSID)                              @P1A*/ 00657000
*/*                                                                  */ 00658000
*/* CREATED BY: Caller of IEEVARYD service                           */ 00659000
*/*                                                                  */ 00660000
*/* DELETED BY: Caller of IEEVARYD service                           */ 00670000
*/*                                                                  */ 00680000
*/* POINTED TO BY: N/A                                               */ 00690000
*/*                                                                  */ 00700000
*/* STORAGE ATTRIBUTES: In storage of caller of IEEVARYD service     */ 00710000
*/*                                                                  */ 00720000
*/*   SUBPOOL/DATASPACE: Caller                                      */ 00730000
*/*                                                                  */ 00740000
*/*   KEY: Caller                                                    */ 00750000
*/*                                                                  */ 00760000
*/*01* SIZE:  Version dependent:                                 @P1C*/ 00770000
*/*           For version 1 (the default):                       @P1A*/ 00780000
*/*           X'10' byte header plus 4 bytes per device          @P1A*/ 00790000
*/*           For version 10:                                    @P1A*/ 00800000
*/*           X'20' byte header plus 4 bytes per device          @P1A*/ 00801000
*/*                                                              @P1A*/ 00802000
*/* SERIALIZATION: None                                              */ 00803000
*/*                                                                  */ 00804000
*/* DEPENDENCIES: None                                               */ 00805000
*/*                                                                  */ 00806000
*/* NOTES: None                                                      */ 00807000
*/*                                                                  */ 00808000
*/*01* EXTERNAL CLASSIFICATION:                                  @L4C*/ 00809000
*/*                                                              @L4C*/ 00810000
*/*02* PI: BASE                                                  @L4C*/ 00820000
*/*                                                              @L4C*/ 00830000
*/*02* NOTPI: FIELDS VDEV_DWNLVL_ENQS_HELD                       @L4C*/ 00840000
*/*                  VDEV_ERROR_SUPPRESS_PATH_MSGS               @L4C*/ 00850000
*/*                  VDEV_SMS_LIBRARY                            @L4C*/ 00860000
*/*                  VDEV_ERROR_MESSAGES                         @L4C*/ 00870000
*/*                  VDEV_DO_NOT_CHECK_VOLSER                    @L4C*/ 00880000
*/*                  VDEV_DDR_CALLER                             @L4C*/ 00890000
*/*                  VDEV_ISSUE_ALL_MESSAGES                     @L5A*/ 00891000
*/*                                                              @L4C*/ 00892000
*/*01* END OF EXTERNAL CLASSIFICATION:                           @L4C*/ 00893000
*/*                                                                  */ 00894000
*/* CHANGE-ACTIVITY:                                                 */ 00895000
*/*   $L0=SYSOPS   HBB5510 921204 PDCF:  Sysplex Operations          */ 00896000
*/*   $D1=DMN4005  HBB5510 930121 PDLC:  Rename to IEEZB833          */ 00897000
*/*   $L1=SYSOP16  HBB5510 930520 PD3J:  SHOWHDR updates             */ 00898000
*/*   $L2=SHRTP83J HBB5520 940415 PD3J:  VARY AUTOSWITCH             */ 00899000
*/*   $01=OW18626  HBB5510 960731 PDHL:  DDR Swap for shared DASD    */ 00900000
*/*   $L3=PVONL    HBB7730 050505 PDTA:  Parallelize VARY Online     */ 00910000
*/*   $02=OA12454  HBB7720 051014 PDTA:  Add Q4 STIMERM              */ 00920000
*/*   $L4=UNAVAIL  HBB7750 070427 PDTA:  Mark Tape Unavailable       */ 00930000
*/*   $P1=ME11441  HBB7750 071012 PDTA:  Version changes             */ 00940000
*/*   $L5=IOSVCU   HBB7770 090731 PDMD:  Vary CU Support             */ 00950000
*/*   $L6=WI252714 HBB77C0 171225 PDSS:  Decase of Vary              */ 00951011
*/*                                                                  */ 00960000
*/*END OF SPECIFICATIONS *********************************************/ 00970000
*/********************************************************************/ 00980000
*/* A  Rename macro from IEEDVDEV and add bits to VDEV_OPTIONS  @D1A */ 00990000
*/* C  Update prolog for SHOWHDR updates                        @L1A */ 01000000
*/* A  Add autoswitch,on!off keywords                           @L2A */ 01010000
*/* A  Add the NOVOL option on the ONLINE keyword               @01A */ 01020000
*/*    to allow for a device to be brought online without       @01A */ 01030000
*/*    checking its volume serial number.                       @01A */ 01040000
*/*    Add the DDR_CALLER option to the internal vary interface @01A */ 01050000
*/*    to allow PPRC/XRC secondary devices to come online.      @01A */ 01060000
*/* C  Change VDEV_ENQS_HELD to VDEV_DWNLVL_ENQS_HELD.  Use of  @L3A */ 01070000
*/*    this flag is no longer supported in HBB7730, and is      @L3A */ 01080000
*/*    provided for compatability purposes only                 @L3A */ 01090000
*/* A  Add VDEV_DO_NOT_WAIT_FOR_ENQ flag.                       @02A */ 01100000
*/* A  Add VDEV_UNAVAIL flag.  Also increase size of VDEV and   @L4A */ 01110000
*/*    update version and add CART and CONSID fields.           @L4A */ 01120000
*/* C  Change to provide version 1 by default, and change the   @P1A */ 01130000
*/*    version and length constants and add macro logic to      @P1A */ 01140000
*/*    request version 10.                                      @P1A */ 01150000
*/* A  ADD VDEV_ISSUE_ALL_MESSAGES FLAG.                        @L5A */ 01160000
*/* A  Support options as a Type                                 @L6A*/ 01161001
*/********************************************************************/ 01170000
*%GOTO IEEZB833PLAS2;   /*                                       @D1C*/ 01180000
*                                                                       01190000
* VARY Device Service Input                                             01200000
*                                                                       01210000
&VDEVVER  SETC '&PLISTVER'                                              01211000
          AIF   ('&VDEVVER' NE 'MAX').VDEV0001                     @P1A 01212000
&VDEVVER  SETC 'VERSION10'                                         @P1A 01213000
          AGO   .VDEV0003                                          @P1A 01214000
.VDEV0001 AIF   ('&VDEVVER' NE '').VDEV0002                        @P1A 01215000
&VDEVVER  SETC 'VERSION1'                                          @P1A 01216000
          AGO   .VDEV0003                                          @P1A 01217000
.VDEV0002 AIF   ('&VDEVVER' EQ 'VERSION1').VDEV0003                @P1A 01217100
          AIF   ('&VDEVVER' EQ 'VERSION10').VDEV0003               @P1A 01217200
          MNOTE 8,'INVALID PLISTVER SPECIFIED'                     @P1A 01217300
          AGO   .VDEVEND                                           @P1A 01217400
.VDEV0003 ANOP                                                          01217500
VDEV                     DSECT        VARY Device Service Input         01217600
VDEV_VERSION_1           DS    0D     Align on doubleword boundary @P1A 01217700
VDEV_ID                  DS    CL4    VDEV identifier ('VDEV')          01217800
VDEV_VERSION             DS    XL1    VDEV version number               01217900
                         DS    XL3    Reserved                          01218000
VDEV_KEYWORDS            DS    0XL2   VARY device command keywords      01218100
VDEV_KEYWORDS1           DS    XL1    First byte of keywords            01218200
VDEV_ONLINE              EQU   X'80'  ONLINE keyword                    01218300
VDEV_OFFLINE             EQU   X'40'  OFFLINE keyword                   01218400
VDEV_AUTOSWITCH          EQU   X'20'  AUTOSWITCH keyword           @L2A 01218500
VDEV_UNAVAIL             EQU   X'10'  UNAVAILABLE keyword          @L4A 01218600
VDEV_KEYWORDS2           DS    XL1    Second byte of keywords           01218700
VDEV_UNCOND              EQU   X'80'  UNCOND keyword                    01218800
VDEV_SHR                 EQU   X'40'  SHR keyword                       01218900
VDEV_RESET               EQU   X'20'  RESET keyword                     01219000
VDEV_FORCE               EQU   X'10'  FORCE keyword                     01220000
VDEV_ON                  EQU   X'08'  ON keyword                   @L2A 01230000
VDEV_OFF                 EQU   X'04'  OFF keyword                  @L2A 01240000
VDEV_OPTIONS             DS    0XL2   Additional options                01250000
VDEV_OPTIONS1            DS    XL1    First byte of additional options  01260000
VDEV_KEEP_OFFLINE_CM     EQU   X'80'  Keep device(s) offline due to a   01270000
*                                     configuration manager             01280000
VDEV_DWNLVL_ENQS_HELD    EQU   X'40'  Provided for compatability with   01290000
*                                     HBB7720 and below.  Was           01300000
*                                     VDEV_ENQS_HELD.  This flag should 01310000
*                                     not be used as of HBB7730    @L3C 01320000
VDEV_ERROR_SUPPRESS_PATH_MSGS EQU X'20' Issue error messages but        01330000
*                                     suppress pathing messages    @D1C 01340000
VDEV_SMS_LIBRARY         EQU   X'10'  SMS library is being varied       01350000
VDEV_ERROR_MESSAGES      EQU   X'08'  Issue error messages         @D1A 01360000
VDEV_DO_NOT_CHECK_VOLSER EQU   X'04'  Bring the device online without   01370000
*                                     checking its volume serial        01380000
*                                     number                       @01A 01390000
VDEV_DDR_CALLER          EQU   X'02'  Indicate that DDR issued the      01400000
*                                     internal vary                @01A 01410000
VDEV_DO_NOT_WAIT_FOR_ENQ EQU   X'01'  Return to the caller if           01420000
*                                     SYSIEFSD.Q4 cannot be obtained    01430000
*                                     in a short amount of time    @02A 01440000
VDEV_OPTIONS2            DS    XL1    Second byte of additional options 01450000
VDEV_CART_AND_CONSID     EQU   X'80'  Use the CART and CONSID           01460000
*                                     specified.  This requires a       01470000
*                                     VERSION10 VDEV               @P1C 01480000
VDEV_ISSUE_ALL_MESSAGES EQU    X'40'  Return all messages. This         01490000
*                                     requires a VERSION10 VDEV    @L5A 01500000
VDEV_CONSID              DS    XL4    Console ID                   @L4A 01510000
VDEV_LENGTH_VERSION1     EQU   *-VDEV Length of VDEV version 1     @P1A 01520000
         AIF   ('&VDEVVER' EQ 'VERSION1').VDEV0100                 @P1A 01530000
VDEV_VERSION_10          DS    0H     Start of VDEV version 10     @P1A 01540000
VDEV_CART                DS    XL8    CART                         @L4A 01550000
                         DS    XL8    Reserved                     @L4A 01560000
VDEV_LENGTH_VERSION10    EQU   *-VDEV Length of VDEV version 10    @P1A 01570000
.VDEV0100 ANOP                                                     @P1A 01580000
VDEV_LENGTH              EQU   *-VDEV Length of this VDEV version  @P1A 01581000
*                                     Input                             01582000
*                                                                       01583000
* IEEVARYD Device Array Entry                                           01584000
*                                                                       01585000
VDEVARR                  DSECT        IEEVARYD Device Array Entry       01586000
                         DS    0F     Align on fullword boundary        01587000
VDEVARR_DEVN             DS    XL2    Device number                     01588000
                         DS    XL2    Reserved                          01589000
VDEVARR_LENGTH           EQU   *-VDEVARR Length of IEEVARYD Device      01590000
*                                     Array Entry                       01600000
*                                                                       01610000
* Constants                                                             01620000
*                                                                       01630000
VDEV_VERN_1              EQU   X'01'  Version for VDEV version 1   @P1A 01640000
*                                                                       01650000
         AIF   ('&VDEVVER' NE 'VERSION1').VDEV0200                      01660000
VDEV_VERN                EQU   VDEV_VERN_1  VDEV version           @P1A 01670000
         AGO   .VDEV0300                                                01680000
.VDEV0200 ANOP                                                          01690000
VDEV_VERN_10             EQU   X'0A'  VDEV version number for version   01700000
*                                     10                           @P1A 01710000
VDEV_VERN                EQU   VDEV_VERN_10  VDEV version          @P1A 01720000
.VDEV0300 ANOP                                                          01730000
VDEV_CBID                EQU   C'VDEV' VDEV identifier                  01740000
.VDEVEND ANOP                                                           01741000
         MEXIT                                                          01742000
         MEND                                                           01743000
*%IEEZB833PLAS2: ;    /*                                         @D1C*/ 01744000
*/********************************************************************/ 01745000
*/*                                                                  */ 01746000
*/* VARY Device Service Input                                        */ 01747000
*/*                                                                  */ 01748000
*/********************************************************************/ 01749000
*%IF IEEZB833_PLISTVER = '' %THEN                                       01750000
*  %IEEZB833_PLISTVER = 'VERSION1';                                     01760000
*%ELSE                                                                  01770000
*  %IF IEEZB833_PLISTVER = 'MAX' %THEN                                  01780000
*    %IEEZB833_PLISTVER = 'VERSION10';                                  01790000
*%IF IEEZB833_PLISTVER ^= 'VERSION1' &                                  01800000
*    IEEZB833_PLISTVER ^= 'VERSION10' %THEN                             01810000
*  %NOTE('INVALID IEEZB833_PLISTVER SPECIFIED') MSGLEVEL(8);            01820000
*%IF VDEVSTORAGE = '' %THEN                                             01830000
*  %VDEVSTORAGE = 'BASED';                                              01831000
*DCL 1 VDEV VDEVSTORAGE BDY(DWORD), /* VARY Device Service Input     */ 01832000
*     2 VDEV_VERSION_1,            /* VDEV base version          @P1C*/ 01833000
*      3 VDEV_ID         CHAR(4),  /* VDEV identifier ('VDEV')       */ 01834000
*      3 VDEV_VERSION    FIXED(8), /* VDEV version number            */ 01835000
*      3 *               CHAR(3),  /* Reserved                       */ 01836000
*      3 VDEV_KEYWORDS   CHAR(2),  /* VARY device command keywords   */ 01837000
*        5 VDEV_KEYWORDS1 CHAR(1), /* First byte of keywords         */ 01838000
*          7 VDEV_ONLINE BIT(1),   /* ONLINE keyword                 */ 01839000
*          7 VDEV_OFFLINE BIT(1),  /* OFFLINE keyword                */ 01840000
*          7 VDEV_AUTOSWITCH BIT(1), /* AUTOSWITCH keyword       @L2A*/ 01850000
*          7 VDEV_UNAVAIL BIT(1),  /* UNAVAILABLE keyword        @L4A*/ 01860000
*        5 VDEV_KEYWORDS2 CHAR(1), /* Second byte of keywords        */ 01870000
*          7 VDEV_UNCOND BIT(1),   /* UNCOND keyword                 */ 01880000
*          7 VDEV_SHR    BIT(1),   /* SHR keyword                    */ 01890000
*          7 VDEV_RESET  BIT(1),   /* RESET keyword                  */ 01900000
*          7 VDEV_FORCE  BIT(1),   /* FORCE keyword                  */ 01910000
*          7 VDEV_ON     BIT(1),   /* ON keyword                 @L2A*/ 01920000
*          7 VDEV_OFF    BIT(1),   /* OFF keyword                @L2A*/ 01930000
* %Dcl IEEZB833_Options_As_Type Char Ext; /*                     @L6A*/ 01931001
* %If Translate(IEEZB833_Options_As_Type) = 'YES' %Then /*       @L6A*/ 01932001
*   %Do;                            /*                           @L6A*/ 01933001
*      3 VDEV_Options IsA(Cnz_tVDev_Options), /* Additional Options     01933105
*                                                                @L6A*/ 01933201
*   %End;                           /*                           @L6A*/ 01934001
* %Else                             /*                           @L6A*/ 01934101
*   %Do;                            /*                           @L6A*/ 01935001
*      3 VDEV_OPTIONS    CHAR(2),  /* Additional options             */ 01940000
*        5 VDEV_OPTIONS1 CHAR(1),  /* First byte of additional          01950000
*                                     options                        */ 01960000
*          7 VDEV_KEEP_OFFLINE_CM BIT(1), /* Keep device(s) offline     01970000
*                                     due to a configuration manager */ 01980000
*          7 VDEV_DWNLVL_ENQS_HELD BIT(1), /* Provided for              01990000
*                                     compatability with HBB7720 and    02000000
*                                     below.  Was VDEV_ENQS_HELD.  This 02010000
*                                     flag should not be used as of     02020000
*                                     HBB7730                    @L3C*/ 02030000
*          7 VDEV_ERROR_SUPPRESS_PATH_MSGS BIT(1),                      02040000
*                                  /* Issue error messages but          02050000
*                                     suppress pathing messages  @D1C*/ 02060000
*          7 VDEV_SMS_LIBRARY BIT(1), /* SMS library is being varied */ 02070000
*          7 VDEV_ERROR_MESSAGES BIT(1), /* Issue error messages @D1A*/ 02080000
*          7 VDEV_DO_NOT_CHECK_VOLSER BIT(1),                           02081000
*                                  /* Bring the device online without   02082000
*                                     checking its volume serial        02083000
*                                     number                     @01A*/ 02084000
*          7 VDEV_DDR_CALLER          BIT(1),                           02085000
*                                  /* Indicate that DDR issued the      02086000
*                                     internal vary              @01A*/ 02087000
*          7 VDEV_DO_NOT_WAIT_FOR_ENQ BIT(1), /* Return to the caller   02088000
*                                     if SYSIEFSD.Q4 cannot be obtained 02089000
*                                     in a short amount of time  @02A*/ 02090000
*        5 VDEV_OPTIONS2 CHAR(1),  /* Second byte of additional         02100000
*                                     options                        */ 02110000
*          7 VDEV_CART_AND_CONSID BIT(1), /* Use the CART and CONSID    02120000
*                                     specified.  This requires a       02130000
*                                     VERSION10 VDEV             @P1C*/ 02140000
*          7 VDEV_ISSUE_ALL_MESSAGES BIT(1), /* Return all message.     02150000
*                                     This requires a VERSION10 VDEV    02160000
*                                                                @L5A*/ 02170000
*   %End;                           /*                           @L6A*/ 02171001
*      3 VDEV_CONSID FIXED(31),    /* Console ID                 @L4A*/ 02180000
*%IF IEEZB833_PLISTVER ^= 'VERSION1' %THEN                              02190000
*  %DO;                                                                 02200000
*     2 VDEV_VERSION_10,           /* Area part of VDEV version 10      02200100
*                                     only                       @P1C*/ 02200200
*      3 VDEV_CART CHAR(8),        /* CART                       @L4A*/ 02200300
*      3 * CHAR(8),                /* Reserved                   @L4A*/ 02200400
*  %END;                                                                02200500
*     2 * CHAR(0);                 /* END of VDEV                @P1A*/ 02200600
*DCL VDEV_LENGTH_VERSION1 FIXED(32)                                     02200700
*                         CONSTANT(LENGTH(VDEV.VDEV_VERSION_1)); /*     02200800
*                                     Length of VDEV Version 1   @P1A*/ 02200900
*%IF IEEZB833_PLISTVER ^= 'VERSION1' %THEN                              02201000
*  %DO;                                                                 02202000
*DCL VDEV_LENGTH_VERSION10 FIXED(32)                                    02203000
*                          CONSTANT(LENGTH(VDEV.VDEV_VERSION_1)+        02204000
*                                   LENGTH(VDEV.VDEV_VERSION_10));/*    02205000
*                                     Length of VDEV Version 10  @P1A*/ 02206000
*  %END;                                                                02207000
*DCL VDEV_LENGTH FIXED(32) CONSTANT(LENGTH(VDEV)); /* Length of VDEV    02208000
*                                     version that was requested @P1A*/ 02209000
*/********************************************************************/ 02209101
*/*                                                                  */ 02209208
*/* Device Options when a TYPE is requested.                     @L6A*/ 02209301
*/*                                                                  */ 02209401
*/********************************************************************/ 02209501
* %Dcl IEEZB833_Options_As_Type Char Ext; /*                     @L6A*/ 02209601
* %If Translate(IEEZB833_Options_As_Type) = 'YES' %Then /*       @L6A*/ 02209701
*   %Do;                            /*                           @L6A*/ 02209801
*   Dcl                                                                 02209902
*     1    Cnz_tVDev_Options Char(2) Type, /* Additional options @L6A*/ 02210003
*       3    VDev_OPTIONS1 CHAR(1), /* First byte of additional         02211001
*                                      options                   @L6A*/ 02212001
*         5    VDev_KEEP_OFFLINE_CM BIT(1), /* Keep device(s) offline   02213001
*                                      due to a configuration manager   02214001
*                                                                @L6A*/ 02215001
*         5    VDev_DWNLVL_ENQS_HELD BIT(1), /* Provided for            02216001
*                                      compatability with HBB7720 and   02217001
*                                      below. Was VDev_ENQS_HELD.       02217101
*                                      This flag should not be used     02217201
*                                      as of HBB7730             @L6A*/ 02217301
*         5    VDev_ERROR_SUPPRESS_PATH_MSGS BIT(1), /* Issue error     02217401
*                                      messages but suppress pathing    02217501
*                                      messages                  @L6A*/ 02217601
*         5    VDev_SMS_LIBRARY BIT(1), /* SMS library is being         02217701
*                                      varied                    @L6A*/ 02217801
*         5    VDev_ERROR_MESSAGES BIT(1), /* Issue error messages      02217901
*                                                                @L6A*/ 02218001
*         5    VDev_DO_NOT_CHECK_VOLSER BIT(1), /* Bring the device     02218101
*                                      online without checking its      02218201
*                                      volume serial number      @L6A*/ 02218301
*         5    VDev_DDR_CALLER BIT(1), /* Indicate that DDR issued      02218401
*                                      the internal vary         @L6A*/ 02218501
*         5    VDev_DO_NOT_WAIT_FOR_ENQ BIT(1), /* Return to the        02218601
*                                      caller if SYSIEFSD.Q4 cannot     02218701
*                                      be obtained in a short amount    02218801
*                                      of time                   @L6A*/ 02218901
*       3    VDev_OPTIONS2 CHAR(1), /* Second byte of additional        02219001
*                                      options                   @L6A*/ 02219101
*         5    VDev_CART_AND_CONSID BIT(1), /* Use the CART and         02219201
*                                      CONSID specified. This           02219301
*                                      requires a VERSION10 VDEV @L6A*/ 02219401
*         5    VDev_ISSUE_ALL_MESSAGES BIT(1), /* Return all message.   02219506
*                                      This requires a VERSION10 VDEV   02219601
*                                                                @L6A*/ 02219701
*         5    *  Bit(6);           /* Reserved                  @L6A*/ 02219804
*   %End;                           /*                           @L6A*/ 02219901
*/********************************************************************/ 02220000
*/*                                                                  */ 02221000
*/* IEEVARYD Device Array                                            */ 02230000
*/*                                                                  */ 02240000
*/********************************************************************/ 02250000
*%IF VDEVARRSTORAGE = '' %THEN                                          02260000
*  %VDEVARRSTORAGE = 'BASED';                                           02270000
*%IF VDEVARRNUM = '' %THEN                                              02280000
*  %VDEVARRNUM = '*';                                                   02290000
*DCL 1 VDEVARR (VDEVARRNUM) VDEVARRSTORAGE BDY(WORD), /* IEEVARYD       02300000
*                                     Device Array                   */ 02310000
*      3 VDEVARR_DEVN  FIXED(16),  /* Device number                  */ 02320000
*      3 *             CHAR(2);    /* Reserved                       */ 02330000
*DCL VDEVARR_LENGTH FIXED(32) CONSTANT(LENGTH(VDEVARR)); /* Length of   02340000
*                                     IEEVARYD Device Array Entry    */ 02350000
*/********************************************************************/ 02360000
*/*                                                                  */ 02370000
*/* Constants                                                        */ 02380000
*/*                                                                  */ 02390000
*/********************************************************************/ 02400000
*DCL VDEV_VERN_1 FIXED(8) CONSTANT(1); /* Original VDEV version  @P1C*/ 02410000
*%IF IEEZB833_PLISTVER ^= 'VERSION1' %THEN                              02420000
*  %DO;                                                                 02430000
*DCL VDEV_VERN_10 FIXED(8) CONSTANT(10); /* VDEV version number for     02430100
*                                     version 10                 @P1C*/ 02430200
*  %END;                                                                02430300
*%IF IEEZB833_PLISTVER = 'VERSION1' %THEN                               02430400
*  %DO;                                                                 02430500
*DCL VDEV_VERN FIXED(8) CONSTANT(VDEV_VERN_1); /* VDEV version   @P1C*/ 02430600
*  %END;                                                                02430700
*%IF IEEZB833_PLISTVER = 'VERSION10' %THEN                              02430800
*  %DO;                                                                 02430900
*DCL VDEV_VERN FIXED(8) CONSTANT(VDEV_VERN_10); /* VDEV version  @P1C*/ 02431000
*  %END;                                                                02432000
*DCL VDEV_CBID CHAR(4) CONSTANT('VDEV'); /* VDEV identifier          */ 02433000
