*                                                                       00001000
* %DCL IEEZB888_INCLUDED CHAR EXT;                                      00002000
* %DEACTIVATE IEEZB888_INCLUDED;                                        00003000
* %IF IEEZB888_INCLUDED = '' %THEN                                      00004000
* %DO;                                                                  00005000
*/* Macro made bi-lingual on 07118. CBGEN compile date 07117         */ 00006000
*% /*                                                                   00007000
         MACRO                                                          00008000
         IEEZB888 &DSECT=YES,&LIST=YES,&TITLE=YES                       00009000
         GBLC  &IEEZB888_INCLUDED                                       00010000
         GBLC  &ZCBPRINT                                                00011000
&IEEZB888_INCLUDED SETC 'YES'                                           00012000
         AIF   ('&LIST' EQ 'NONE').P0                                   00013000
         AIF   ('&TITLE' EQ 'NO').P5                                    00014000
 TITLE   'IEEZB888  - IEEQEMCS Return and Reason Codes           '      00015000
.P5      ANOP                                                           00016000
**/ IEEZB888_1:;                                                        00017000
*/***START OF SPECIFICATIONS******************************************/ 00018000
*/*                                                                  */ 00019000
*/*01* MACRO NAME:  IEEZB888                                         */ 00020000
*/*                                                                  */ 00021000
*/*01* DESCRIPTIVE NAME:  IEEQEMCS Return and Reason Codes           */ 00022000
*/*                                                                  */ 00023000
*/*01* EXTERNAL CLASSIFICATION: PI                               @P1A*/ 00024000
*/*01*  END OF EXTERNAL CLASSIFICATION:                              */ 00025000
*/*                                                                  */ 00026000
*/*01* PROPRIETARY STATEMENT=                                        */ 00027000
*/***PROPRIETARY_STATEMENT********************************************/ 00028000
*/*                                                                  */ 00029000
*/*                                                                  */ 00030000
*/* LICENSED MATERIALS - PROPERTY OF IBM                             */ 00031000
*/* 5694-A01 (C) COPYRIGHT IBM CORP. 1999, 2005                      */ 00032000
*/*                                                                  */ 00033000
*/* STATUS= HBB7720                                                  */ 00034000
*/*                                                                  */ 00035000
*/***END_OF_PROPRIETARY_STATEMENT*************************************/ 00036000
*/*                                                                  */ 00037000
*/*01* DSECT NAME: N/A                                           @P1A*/ 00038000
*/*                                                                  */ 00039000
*/*01* COMPONENT:  Master Scheduler (SC1B8)                          */ 00040000
*/*                                                                  */ 00041000
*/*01* EYE-CATCHER:                                              @P1A*/ 00042000
*/*02*   OFFSET: N/A                                             @P1A*/ 00043000
*/*02*   LENGTH: N/A                                             @P1A*/ 00044000
*/*                                                                  */ 00045000
*/*01* STORAGE ATTRIBUTES:                                           */ 00046000
*/*02*   MAIN STORAGE: Yes                                           */ 00047000
*/*02*   VIRTUAL STORAGE: No                                         */ 00048000
*/*02*   AUXILIARY STORAGE: No                                       */ 00049000
*/*02*   DATA SPACE: No                                              */ 00050000
*/*02*   SUBPOOL: Caller's                                           */ 00051000
*/*02*   KEY: Caller's                                               */ 00052000
*/*02*   Residency: Any                                              */ 00053000
*/*                                                                  */ 00054000
*/*01* SIZE: N/A                                                 @P1A*/ 00055000
*/*                                                                  */ 00056000
*/*01* FUNCTION: Mapping of IEEQEMCS Return and Reason Codes         */ 00057000
*/*                                                                  */ 00058000
*/*01* METHOD OF ACCESS:                                             */ 00059000
*/*                   BAL  - Specify:                                */ 00060000
*/*                                   IEEZB888                       */ 00061000
*/*                                                                  */ 00062000
*/*                   PL/X - %INCLUDE SYSLIB(IEEZB888)               */ 00063000
*/*                                                                  */ 00064000
*/*01* CREATED BY: IEEQEMCS                                          */ 00065000
*/*                                                                  */ 00066000
*/*01* POINTED TO BY: N/A                                        @P1A*/ 00067000
*/*                                                                  */ 00068000
*/* DELETED BY= Caller of IEEQEMCS                                   */ 00069000
*/*                                                                  */ 00070000
*/* DISTRIBUTION=     AMODGEN                                        */ 00071000
*/*                                                                  */ 00072000
*/*01* SERIALIZATION: None                                           */ 00073000
*/*                                                                  */ 00074000
*/*01* OPERATION:                                                    */ 00075000
*/*                                                                  */ 00076000
*/*                                                                  */ 00077000
*/* CHANGE ACTIVITY =                                                */ 00078000
*/* $MAC(IEEZB888) COMP(SC1B8): IEEQEMCS Return and Reason Codes     */ 00079000
*/* $L0=DEMCS,    JBB6607, 980428 , PDTA: Display EMCS / IEEQEMCS    */ 00080000
*/* $P1=PWK0502,  HBB6608, 981209 , PDZH: Add EXTERNAL CLASSIFICATION*/ 00081000
*/*                                       and SHOWHDR updates        */ 00082000
*/* $P2=ME02630,  HBB7720, 050218 , PDKP: Make it CBGEN source       */ 00083000
*/*                                                                  */ 00084000
*/*** START OF CHANGE ACTIVITY ***************************************/ 00085000
*/* A 000000-999999                                                  */ 00086000
*/* C Make the macro the CBGEN source rather than the generated  @P2A*/ 00087000
*/*   CBGEN output.                                              @P2A*/ 00088000
*/*** END OF CHANGE ACTIVITY  ****************************************/ 00089000
*/***END OF SPECIFICATIONS********************************************/ 00090000
*% /*                                                                   00091000
.P0      ANOP                                                           00092000
         AIF   ('&ZCBPRINT' EQ 'NO').P1                                 00093000
         AIF   ('&LIST' EQ 'YES').P2                                    00094000
.P1      ANOP                                                           00095000
         PUSH  PRINT                                                    00096000
         PRINT OFF                                                      00097000
.P2      ANOP                                                           00098000
*                                                                       00099000
*   IEEQEMCS Return and Reason Code definitions                         00100000
*                                                                       00101000
*                                                                       00102000
IEEQE_RC_OK EQU X'00000000' Meaning: EMCS consoles have been found. In *00103000
                         the case of a REQUEST type of SUMMARY, INFO,  *00104000
                         or FULL, the output buffer was sufficient to  *00105000
                         hold all of the information for the consoles  *00106000
                         meeting the search criteria. Action: None     *00107000
                         required.                                      00108000
IEEQE_RC_NOCONS EQU X'00000004' Meaning: No EMCS consoles meet the     *00109000
                         specified filters. Action: None required.      00110000
IEEQE_RC_NOSTOR EQU X'00000008' Meaning: Insufficient return buffer    *00111000
                         storage to complete the query operation.      *00112000
                         Action: Refer to the action provided with the *00113000
                         specific reason code.                          00114000
IEEQE_RS_TOKSZCONS EQU X'00000004' Meaning: A token and recommended    *00115000
                         buffer size have been returned in TOKEN and   *00116000
                         RECSIZE. Also, some console information has   *00117000
                         been returned in the output buffer. Action:   *00118000
                         After processing the information returned in  *00119000
                         the console buffer, issue IEEQEMCS again with *00120000
                         the token that was returned by this call to   *00121000
                         IEEQEMCS so that more console information may *00122000
                         be returned.                                   00123000
IEEQE_RS_TOKSZNOCONS EQU X'00000008' Meaning: A token and recommended  *00124000
                         buffer size have been returned in TOKEN and   *00125000
                         RECSIZE. The output buffer is too small to    *00126000
                         return any EMCS consoles. Action: Allocate a  *00127000
                         new buffer that is at least the size returned *00128000
                         in RECSIZE, and issue IEEQEMCS again with the *00129000
                         new buffer and the token returned on the      *00130000
                         previous IEEQEMCS call. The recommended       *00131000
                         buffer size returned in RECSIZE is sufficient *00132000
                         to hold only one console. It may be necessary  00133000
*                        to obtain a buffer larger than that to hold   *00134000
                         all of the consoles returned by IEEQEMCS.      00135000
IEEQE_RS_NOTOKSZRET EQU X'00000012' Meaning: TOKEN and RECSIZE         *00136000
                         parameters were not coded on the macro        *00137000
                         invocation, so IEEQEMCS could not return a    *00138000
                         recommended buffer size to the caller. The    *00139000
                         buffer size specified by BUFSIZE was not      *00140000
                         sufficient to hold all of the consoles        *00141000
                         returned by IEEQEMCS. Action: Issue IEEQEMCS  *00142000
                         again with the TOKEN and RECSIZE parameters.   00143000
IEEQE_RC_INVTOK EQU X'00000012' Meaning: Invalid token in parameter    *00144000
                         list. Action: Issue IEEQEMCS again with a     *00145000
                         correct token or a token of zeros.             00146000
IEEQE_RC_INVPL EQU X'00000016' Meaning: Invalid parameter list.        *00147000
                         Action: Refer to the action provided with the *00148000
                         specific reason code.                          00149000
IEEQE_RS_INVACRN EQU X'00000004' Meaning: The acronym in the parameter *00150000
                         list was invalid. Action: Correct the acronym *00151000
                         in the parameter list and issue IEEQEMCS      *00152000
                         again.                                         00153000
IEEQE_RS_INVADDR EQU X'00000008' Meaning: An output address is         *00154000
                         invalid. An ABEND occured while trying to     *00155000
                         access storage at an address specified in the *00156000
                         parameter list, possibly because that storage *00157000
                         is not accessible by the caller, or the       *00158000
                         storage does not exist. Action: Correct the   *00159000
                         invalid address in the parameter list and     *00160000
                         issue IEEQEMCS again.                          00161000
IEEQE_RS_INVBUFSIZEADDR EQU X'00000012' Meaning: The length of the     *00162000
                         buffer in the parameter list was invalid.     *00163000
                         Action: Correct the buffer length in the      *00164000
                         parameter list and issue IEEQEMCS again.       00165000
IEEQE_RS_INVLGTH EQU X'00000016' Meaning: The length of the parameter  *00166000
                         list is invalid. Action: Correct the length   *00167000
                         in the parameter list and issue IEEQEMCS      *00168000
                         again.                                         00169000
IEEQE_RS_INVVERS EQU X'00000020' Meaning: The version specified in the *00170000
                         parameter list is invalid. Action: Correct    *00171000
                         the version in the parameter list and issue   *00172000
                         IEEQEMCS again.                                00173000
IEEQE_RS_INVFUNC EQU X'00000024' Meaning: The REQUEST type specified   *00174000
                         in the parameter list is not a valid REQUEST  *00175000
                         type. Action: Correct the REQUEST type in the *00176000
                         parameter list and issue IEEQEMCS again.       00177000
IEEQE_RS_INVSTAT EQU X'00000028' Meaning: The STATUS specified in the  *00178000
                         parameter list is not a valid STATUS type.    *00179000
                         Action: Correct the STATUS in the parameter   *00180000
                         list and issue IEEQEMCS again.                 00181000
IEEQE_RS_INVAUTH EQU X'00000032' Meaning: The command authority        *00182000
                         specified in the parameter list is not a      *00183000
                         valid command authority type. Action: Correct *00184000
                         the AUTH in the parameter list and issue      *00185000
                         IEEQEMCS again.                                00186000
IEEQE_RS_INVDOM EQU X'00000036' Meaning: The DOM attribute specified   *00187000
                         in the parameter list is not a valid DOM      *00188000
                         attribute type. Action: Correct the DOM in    *00189000
                         the parameter list and issue IEEQEMCS again.   00190000
IEEQE_RS_INCONSIST EQU X'00000040' Meaning: A set of parameters        *00191000
                         specified in the parameter list conflict with *00192000
                         each other. Action: Correct the parameter     *00193000
                         list to not have conflicting parameters and   *00194000
                         issue IEEQEMCS again.                          00195000
IEEQE_RS_INVATTR EQU X'00000044' Meaning: The routing attributes       *00196000
                         specified in the parameter list are not valid *00197000
                         routing attribute types. Action: Correct the  *00198000
                         ATTR field in the parameter list and issue    *00199000
                         IEEQEMCS again.                                00200000
IEEQE_RC_SYSERR EQU X'00000064' Meaning: System Error. This return     *00201000
                         code is for IBM diagnostic purposes only.     *00202000
                         Action: Record the return and reason codes    *00203000
                         and supply it to the appropriate IBM support  *00204000
                         personnel.                                     00205000
IEEQE_RS_SYSABEND EQU X'00000004' Meaning: An ABEND occurred during    *00206000
                         processing. This reason code is for IBM       *00207000
                         diagnostic purposes only. Action: Record the  *00208000
                         return and reason codes and supply it to the  *00209000
                         appropriate IBM support personnel.             00210000
IEEQE_RS_SYSERR EQU X'00000008' Meaning: An error occurred during      *00211000
                         processing. This reason code is for IBM       *00212000
                         diagnostic purposes only. Action: Record the  *00213000
                         return and reason codes and supply it to the  *00214000
                         appropriate IBM support personnel.             00215000
         AIF   ('&ZCBPRINT' EQ 'NO').P3                                 00216000
         AIF   ('&LIST' EQ 'YES').P4                                    00217000
.P3      ANOP                                                           00218000
         POP   PRINT                                                    00219000
.P4      ANOP                                                           00220000
.P_EXIT  ANOP                                                           00221000
         MEND                                                           00222000
**/ IEEZB888_2:;                                                        00223000
* %IEEZB888_INCLUDED = 'YES';                                           00224000
* %DCL ZCBPRINT CHAR EXT;                                               00225000
* %DEACTIVATE ZCBPRINT;                                                 00226000
* %DCL IEEZB888_LIST CHAR EXT;                                          00227000
* %DEACTIVATE IEEZB888_LIST;                                            00228000
* %IF IEEZB888_LIST ^= 'NO' &                                           00229000
*    ZCBPRINT ^= 'NO' %THEN                                             00230000
*   %GOTO IEEZB888_3;                                                   00231000
*   @LIST PUSH NOECHO;                                                  00232000
*   @LIST NOASSEMBLE NOECHO;                                            00233000
*   @LIST OFF C NOECHO;                                                 00234000
* %IEEZB888_3:;                                                         00235000
*/* Start of PL/X Source                                             */ 00236000
*/* IEEQEMCS Return and Reason Code definitions                      */ 00237000
*DCL IEEQE_RC_OK BIT(32) Constant('00000000'X) ; /*                     00238000
*                        Meaning: EMCS consoles have been found. In the 00239000
*                        case of a REQUEST type of SUMMARY, INFO, or    00240000
*                        FULL, the output buffer was sufficient to hold 00241000
*                        all of the information for the consoles        00242000
*                        meeting the search criteria.                   00243000
*                        Action: None required.                      */ 00244000
*DCL IEEQE_RC_NOCONS BIT(32) Constant('00000004'X) ; /*                 00245000
*                        Meaning: No EMCS consoles meet the specified   00246000
*                        filters.                                       00247000
*                        Action: None required.                      */ 00248000
*DCL IEEQE_RC_NOSTOR BIT(32) Constant('00000008'X) ; /*                 00249000
*                        Meaning: Insufficient return buffer storage to 00250000
*                        complete the query operation.                  00251000
*                        Action: Refer to the action provided with the  00252000
*                        specific reason code.                       */ 00253000
*DCL IEEQE_RS_TOKSZCONS BIT(32) Constant('00000004'X) ; /*              00254000
*                        Meaning: A token and recommended buffer size   00255000
*                        have been returned in TOKEN and RECSIZE. Also, 00256000
*                        some console information has been returned in  00257000
*                        the output buffer.                             00258000
*                        Action: After processing the information       00259000
*                        returned in the console buffer, issue IEEQEMCS 00260000
*                        again with the token that was returned by this 00261000
*                        call to IEEQEMCS so that more console          00262000
*                        information may be returned.                */ 00263000
*DCL IEEQE_RS_TOKSZNOCONS BIT(32) Constant('00000008'X) ; /*            00264000
*                        Meaning: A token and recommended buffer size   00265000
*                        have been returned in TOKEN and RECSIZE. The   00266000
*                        output buffer is too small to return any EMCS  00267000
*                        consoles.                                      00268000
*                        Action: Allocate a new buffer that is at least 00269000
*                        the size returned in RECSIZE, and issue        00270000
*                        IEEQEMCS again with the new buffer and the     00271000
*                        token returned on the previous IEEQEMCS call.  00272000
*                        The recommended buffer size returned in        00273000
*                        RECSIZE is sufficient to hold only one         00274000
*                        console. It may be necessary to obtain a       00275000
*                        buffer larger than that to hold all of the     00276000
*                        consoles returned by IEEQEMCS.              */ 00277000
*DCL IEEQE_RS_NOTOKSZRET BIT(32) Constant('00000012'X) ; /*             00278000
*                        Meaning: TOKEN and RECSIZE parameters were not 00279000
*                        coded on the macro invocation, so IEEQEMCS     00280000
*                        could not return a recommended buffer size to  00281000
*                        the caller. The buffer size specified by       00282000
*                        BUFSIZE was not sufficient to hold all of the  00283000
*                        consoles returned by IEEQEMCS.                 00284000
*                        Action: Issue IEEQEMCS again with the TOKEN    00285000
*                        and RECSIZE parameters.                     */ 00286000
*DCL IEEQE_RC_INVTOK BIT(32) Constant('00000012'X) ; /*                 00287000
*                        Meaning: Invalid token in parameter list.      00288000
*                        Action: Issue IEEQEMCS again with a correct    00289000
*                        token or a token of zeros.                  */ 00290000
*DCL IEEQE_RC_INVPL BIT(32) Constant('00000016'X) ; /*                  00291000
*                        Meaning: Invalid parameter list.               00292000
*                        Action: Refer to the action provided with the  00293000
*                        specific reason code.                       */ 00294000
*DCL IEEQE_RS_INVACRN BIT(32) Constant('00000004'X) ; /*                00295000
*                        Meaning: The acronym in the parameter list was 00296000
*                        invalid.                                       00297000
*                        Action: Correct the acronym in the parameter   00298000
*                        list and issue IEEQEMCS again.              */ 00299000
*DCL IEEQE_RS_INVADDR BIT(32) Constant('00000008'X) ; /*                00300000
*                        Meaning: An output address is invalid. An      00301000
*                        ABEND occured while trying to access storage   00302000
*                        at an address specified in the parameter list, 00303000
*                        possibly because that storage is not           00304000
*                        accessible by the caller, or the storage does  00305000
*                        not exist.                                     00306000
*                        Action: Correct the invalid address in the     00307000
*                        parameter list and issue IEEQEMCS again.    */ 00308000
*DCL IEEQE_RS_INVBUFSIZEADDR BIT(32) Constant('00000012'X) ; /*         00309000
*                        Meaning: The length of the buffer in the       00310000
*                        parameter list was invalid.                    00311000
*                        Action: Correct the buffer length in the       00312000
*                        parameter list and issue IEEQEMCS again.    */ 00313000
*DCL IEEQE_RS_INVLGTH BIT(32) Constant('00000016'X) ; /*                00314000
*                        Meaning: The length of the parameter list is   00315000
*                        invalid.                                       00316000
*                        Action: Correct the length in the parameter    00317000
*                        list and issue IEEQEMCS again.              */ 00318000
*DCL IEEQE_RS_INVVERS BIT(32) Constant('00000020'X) ; /*                00319000
*                        Meaning: The version specified in the          00320000
*                        parameter list is invalid.                     00321000
*                        Action: Correct the version in the parameter   00322000
*                        list and issue IEEQEMCS again.              */ 00323000
*DCL IEEQE_RS_INVFUNC BIT(32) Constant('00000024'X) ; /*                00324000
*                        Meaning: The REQUEST type specified in the     00325000
*                        parameter list is not a valid REQUEST type.    00326000
*                        Action: Correct the REQUEST type in the        00327000
*                        parameter list and issue IEEQEMCS again.    */ 00328000
*DCL IEEQE_RS_INVSTAT BIT(32) Constant('00000028'X) ; /*                00329000
*                        Meaning: The STATUS specified in the parameter 00330000
*                        list is not a valid STATUS type.               00331000
*                        Action: Correct the STATUS in the parameter    00332000
*                        list and issue IEEQEMCS again.              */ 00333000
*DCL IEEQE_RS_INVAUTH BIT(32) Constant('00000032'X) ; /*                00334000
*                        Meaning: The command authority specified in    00335000
*                        the parameter list is not a valid command      00336000
*                        authority type.                                00337000
*                        Action: Correct the AUTH in the parameter list 00338000
*                        and issue IEEQEMCS again.                   */ 00339000
*DCL IEEQE_RS_INVDOM BIT(32) Constant('00000036'X) ; /*                 00340000
*                        Meaning: The DOM attribute specified in the    00341000
*                        parameter list is not a valid DOM attribute    00342000
*                        type.                                          00343000
*                        Action: Correct the DOM in the parameter list  00344000
*                        and issue IEEQEMCS again.                   */ 00345000
*DCL IEEQE_RS_INCONSIST BIT(32) Constant('00000040'X) ; /*              00346000
*                        Meaning: A set of parameters specified in the  00347000
*                        parameter list conflict with each other.       00348000
*                        Action: Correct the parameter list to not have 00349000
*                        conflicting parameters and issue IEEQEMCS      00350000
*                        again.                                      */ 00351000
*DCL IEEQE_RS_INVATTR BIT(32) Constant('00000044'X) ; /*                00352000
*                        Meaning: The routing attributes specified in   00353000
*                        the parameter list are not valid routing       00354000
*                        attribute types.                               00355000
*                        Action: Correct the ATTR field in the          00356000
*                        parameter list and issue IEEQEMCS again.    */ 00357000
*DCL IEEQE_RC_SYSERR BIT(32) Constant('00000064'X) ; /*                 00358000
*                        Meaning: System Error. This return code is for 00359000
*                        IBM diagnostic purposes only.                  00360000
*                        Action: Record the return and reason codes and 00361000
*                        supply it to the appropriate IBM support       00362000
*                        personnel.                                  */ 00363000
*DCL IEEQE_RS_SYSABEND BIT(32) Constant('00000004'X) ; /*               00364000
*                        Meaning: An ABEND occurred during processing.  00365000
*                        This reason code is for IBM diagnostic         00366000
*                        purposes only.                                 00367000
*                        Action: Record the return and reason codes and 00368000
*                        supply it to the appropriate IBM support       00369000
*                        personnel.                                  */ 00370000
*DCL IEEQE_RS_SYSERR BIT(32) Constant('00000008'X) ; /*                 00371000
*                        Meaning: An error occurred during processing.  00372000
*                        This reason code is for IBM diagnostic         00373000
*                        purposes only.                                 00374000
*                        Action: Record the return and reason codes and 00375000
*                        supply it to the appropriate IBM support       00376000
*                        personnel.                                  */ 00377000
*/* End of IEEQEMCS Return and Reason Code definitions               */ 00378000
* @LOGIC;                                                               00379000
* #PRAGMA TOOL=CBGEN.                                                   00380000
* #EPRAGMA.                                                             00381000
* @ENDLOGIC;                                                            00382000
*/* End of PL/X Source                                               */ 00383000
* %IF IEEZB888_LIST ^= 'NO' &                                           00384000
*    ZCBPRINT ^= 'NO' %THEN                                             00385000
*   %GOTO IEEZB888_4;                                                   00386000
*   @LIST POP NOECHO;                                                   00387000
* %IEEZB888_4:;                                                         00388000
* %END;                                                                 00389000
